{"id": 270, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072441.html", "title": "Chapter 3261 - 3261 3260 Holy Prose Clan, Devil Dragon Lineage", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3261 - 3261 3260 Holy Prose Clan, Devil Dragon Lineage</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3261 3260 holy prose clan, Devil Dragon lineage<br/><br/>“Roar Roar Roar!”<br/><br/>“Damn it, I didn’t expect you to be a peak race.”<br/><br/>Fire Dragon Master stared at the sky array floating in the air with a gloomy face.<br/><br/>A flame pagoda slowly flew out of his mouth.<br/><br/>The Flame Pagoda was emitting a deep red light. Even around the flames, it was extremely bright.<br/><br/>“Hehe, do you really think you’re invincible when you’re at the same level?”<br/><br/>Sky array stared at fire dragon master and said coldly.<br/><br/>“Pinnacle Dragon Seed, I can still suppress you!”<br/><br/>Fire Dragon Master’s face darkened, and flames surged into the pagoda in front of him.<br/><br/>Hong<br/><br/>The pagoda expanded to over 1,000 kilometers in size and attacked sky array.<br/><br/>Sky Array also had a serious look on his face as he set up an array to defend himself.<br/><br/>Fire Dragon Master had already taken out two acquired true treasures, which was impossible for an ordinary universe knight level six great being.<br/><br/>Only the dragon God lineage could be so wealthy and have two acquired true treasures.<br/><br/>Facing Fire Dragon Master who had taken out two acquired true treasures, the sky array had to deal with him with all its might.<br/><br/>“Kill! We have great beings from Dragon Palace to help us deal with Fire Dragon Master. As for the other disciples of Water Dragon Palace, kill them for me. Kill the bunch of fellows from Fire Dragon Palace.”<br/><br/>The Water Dragon King was severely injured, and he had recovered more than half of his heavenly treasures.<br/><br/>“Roar!”<br/><br/>“Kill!”<br/><br/>The experts of the Water Dragon Palace immediately rushed over.<br/><br/>“Kill!”<br/><br/>All the members of the Dragon Palace continued to attack the Red Gold War Dragon of the Water Dragon Palace.<br/><br/>“Wuwu!”<br/><br/>High-level bloodlines were Kun’s favorite.<br/><br/>The sub-dragons were extremely attractive to him.<br/><br/>He attacked with a savage aura.<br/><br/>“Be careful, be careful of the people of the Dragon Palace.”<br/><br/>The leaders of the Fire Cloud Corps and the Dragon Eagle Corps immediately roared.<br/><br/>Boom<br/><br/>At this moment, they looked at Little Blue who was attacking them with a serious expression.<br/><br/>Little blue directly swallowed the 10 heads of the ferocious dragon, making them feel terrified.<br/><br/>Pu! Pu! Pu<br/><br/>At this time, a black and white shadow suddenly appeared around the Fire Dragon Palace and the Red Gold War Dragon.<br/><br/>The sharp claws of the black and white shadow instantly pierced through the Knights of the two dragon palaces.<br/><br/>This time, there were also 200 universe knight-level great beings from the dragon-piercing species.<br/><br/>“Be careful of the strange assassins around.”<br/><br/>The expressions of the great beings from the two dragon palaces changed slightly when they saw more than 100 universe knights being assassinated. They scanned their surroundings warily and roared.<br/><br/>“There are more great beings from the Water Dragon Palace and the Dragon Palace than us. We are not their match.”<br/><br/>Facing ao Qitian’s attack, a universe Knight Level 5 great being from the Red Gold War Dragon changed his expression slightly and roared loudly.<br/><br/>“Retreat, retreat, wait for the Lord of the Devil Dragon bloodline to arrive.”<br/><br/>The leader of the Fire Cloud Army didn’t hesitate and immediately gave the order.<br/><br/>They had come early to suppress the Water Dragon Palace.<br/><br/>Now that the Dragon Palace had joined in and displayed such terrifying power, there was no need for them to fight.<br/><br/>“Retreat!”<br/><br/>In the sky, fire dragon master sensed the situation below and growled with a gloomy face.<br/><br/>Since the other party had displayed such powerful strength, he would wait for the arrival of the Demon Dragon King and the Demon Dragon Emperor.<br/><br/>“Humph!”<br/><br/>He stared at the sky array and did not continue fighting. His body moved and he immediately retreated into the Fire Dragon Palace.<br/><br/>The sky array looked over but did not stop him.<br/><br/>It was difficult for him to stop the other party.<br/><br/>They were surrounded by their dragon palace. It was easy for them to hide inside.<br/><br/>This was the strength of the Dragon Palace.<br/><br/>“Keep fighting, you arrogant guys.”<br/><br/>Seeing them retreat, the experts of the Water Dragon Palace sneered coldly.<br/><br/>“Humph, don’t be arrogant. Your Water Dragon Palace will still be destroyed, and so will the Dragon Palace.”<br/><br/>An expert of the Red Gold War Dragon roared.<br/><br/>“Swoosh! Swoosh! Swoosh!”<br/><br/>As they spoke, they quickly retreated into the Red Gold War Dragon Palace.<br/><br/>Less than one-third of the members of the Red Gold War Dragon Palace were at the peak, and all of them had submitted to the Devil Dragon Clan, with the Devil Dragon King and the Devil Dragon Emperor as their masters.<br/><br/>“Humph, Our Water Dragon Palace is waiting for you.”<br/><br/>The experts of the Water Dragon Palace replied coldly.<br/><br/>“Hu!”<br/><br/>The Water Dragon King let out a sigh of relief when he saw them retreat.<br/><br/>They looked at the members of the Dragon Palace with gratitude.<br/><br/>Without the help of the Dragon Palace, the Fire Dragon Palace and the Red Gold War Dragon might have been able to destroy them.<br/><br/>“Thank you for your help. Thank you, sir.”<br/><br/>The Water Dragon King said and cupped his hands toward the sky array.<br/><br/>The sky array was stronger than him, so it was not an exaggeration for him to call him sir.<br/><br/>“You’re welcome, Water Dragon King. I’m also under your orders.”<br/><br/>Sky array smiled and shook his head, “Fire Dragon Emperor’s strength is really beyond my expectations.”<br/><br/>“Yes!”<br/><br/>Water dragon emperor nodded solemnly, “Fire Dragon Emperor has the strength of a universe Knight Level 6, yet he is suppressed by the Devil Dragon lineage, the Devil Dragon Lineage?”<br/><br/>As he spoke, his expression changed slightly.<br/><br/>“Everyone from the Dragon Palace, please come in.”<br/><br/>Following that, he invited them into the sky array and led them into the Water Dragon Palace.<br/><br/>This battle would probably depend on the dragon palace.<br/><br/>“I really didn’t expect, I really didn’t expect that the Dragon Palace actually had a universe knight level 6 great being.”<br/><br/>Within the Fire Dragon Palace, fire dragon leader growled with a dark expression.<br/><br/>He took out the universe AI and immediately passed this news to the Devil Dragon lineage.<br/><br/>A Universe Knight Level 6 great being had appeared in the Dragon Palace. If they wanted to destroy the Water Dragon Palace and destroy the Dragon Palace, Devil Dragon Emperor had to do it himself.<br/><br/>“HM?”<br/><br/>At the same time, in the space where the Devil Dragon Bloodline was located, the Devil Dragon Dark World covered a huge space.<br/><br/>In the Devil Dragon Dark World, Devil Dragon Emperor and Devil Dragon Emperor received the news from Fire Dragon Emperor, and they were shocked.<br/><br/>“It seems that the Water Dragon Palace doesn’t know what’s good for them and won’t surrender. Let’s go and destroy them.”<br/><br/>“First destroy the Water Dragon Palace, then destroy the Dragon Palace.”<br/><br/>Devil Dragon Emperor said indifferently.<br/><br/>“It’s father!”<br/><br/>Devil Dragon Emperor nodded.<br/><br/>Although they were surprised that the Dragon Palace had a universe Knight Level 6 great being, it didn’t affect their plans much.<br/><br/>They just needed to put in more effort.<br/><br/>Soon, the huge dark sector started to move again and flew toward the Water Dragon Palace.<br/><br/>Recently, the dark sector had made two moves, one to destroy the wind and Thunder Dragon Bloodline.<br/><br/>The other to suppress the Red Gold War Dragon.<br/><br/>This was the third time.<br/><br/>“We’re here. The water dragon continent of the Water Dragon Palace is right in front of us. The four dragon palaces are really majestic!”<br/><br/>Just as the dark sector of Devil Dragon was rushing over, a group of nearly 4,000 universe knights rushed over from a huge light lotus flower in front of the water dragon continent.<br/><br/>They looked ahead and saw the powerful Dragon Palace, and they sighed.<br/><br/>The holy prose clan had arrived!\t\t\t\t\t\t</div>", "images": {}, "success": true}