{"id": 279, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072459.html", "title": "Chapter 3270 - 3270 32.69 Million Asian Dragons Lost Their Lives", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3270 - 3270 32.69 Million Asian Dragons Lost Their Lives</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3270 32.69 million Asian Dragons lost their lives<br/><br/>“Damn it, why is the power of the Dragon Palace so terrifying?”<br/><br/>“If this goes on, we won’t be a match for the Water Dragon Palace and the Dragon Palace!”<br/><br/>On the battlefield, Fire Dragon Master and the other Level 4 and 5 Great Beings looked embarrassed when they saw this scene.<br/><br/>Especially when an lie joined the battlefield, the universe knight level great beings were quickly killed by him.<br/><br/>Initially, they had thought of getting Devil Dragon Emperor to deal with this strange guy.<br/><br/>But now, the Dragon King of the Dragon Palace also had the Combat Power of a universe Knight Level 7, and he was holding Devil Dragon Emperor back.<br/><br/>Then how could this strange guy resist?<br/><br/>They couldn’t resist at all, and they would be hunted down one by one just like the holy prose clan.<br/><br/>“Roar Roar Roar!”<br/><br/>“Kill all the disciples of the Fire Dragon Palace, kill them all!”<br/><br/>Fire Dragon Master ordered all the disciples below Universe Knights.<br/><br/>At this moment, only the disciples of void God Emperor had a huge advantage.<br/><br/>“Disciples of Devil Dragon and Red Gold War Dragon, kill them all!”<br/><br/>Devil Dragon Emperor saw that his father was being held back, and his expression changed. Obviously, he understood the current situation and roared.<br/><br/>“All Knight level members, prepare to retreat to the Dragon Palace!”<br/><br/>At the same time, Devil Dragon Emperor gave an order.<br/><br/>They couldn’t win this battle anymore.<br/><br/>They weren’t even a match for the other party.<br/><br/>At this time, the normal disciples attracted the battle power and the Knights prepared to retreat.<br/><br/>They had never expected this battle to end like this.<br/><br/>They had never expected that the entire sacred text clan would be killed by an expert from the Dragon Palace.<br/><br/>“Hou Hou Hou!”<br/><br/>“Kill, Kill, kill! Destroy the people from the Water Dragon Palace!”<br/><br/>The three great dragon palaces had a total of ten million void God Emperor Disciples, while the Water Dragon Palace only had a few hundred. The difference was huge.<br/><br/>Facing the attacks of the three great dragon palaces, their faces turned slightly pale.<br/><br/>“West Water Department will send some great beings to assist.”<br/><br/>Water Dragon Queen immediately ordered.<br/><br/>“Yes!”<br/><br/>The universe knights immediately replied.<br/><br/>“Tie them down!”<br/><br/>From the front, the sound of Devil Dragon King’s orders could be heard.<br/><br/>Pu! Pu! Pu! Pu<br/><br/>At this moment, an Lie’s figure flashed. The few knights of the Devil Dragon lineage who wanted to stop him were instantly killed.<br/><br/>“Huh?”<br/><br/>In the sky, Wang Xian’s gaze swept across the battle below and his body trembled.<br/><br/>“Kill!”<br/><br/>He stared at Devil Dragon Emperor below and roared. The five elements millstone in front of him had become tens of millions of times larger.<br/><br/>Boom! Boom! Boom<br/><br/>The enormous five elements millstone gave off a terrifying aura and pressed down directly.<br/><br/>“Damn it!”<br/><br/>Devil Dragon Emperor felt the pressure coming from the five elements millstone, and his face changed slightly.<br/><br/>“Roar! Roar! Roar!”<br/><br/>He roared wildly, and a devil dragon Pearl flew out of his mouth. At the same time, a dark skull flew out of his mouth.<br/><br/>Two powerful acquired true treasures flew toward the five elements mill.<br/><br/>Hong<br/><br/>The entire five elements mill was like a huge mountain, pressing down toward the ground.<br/><br/>When it collided with the Devil Dragon Pearl and the Dark Skull, a terrifying energy was released.<br/><br/>Devil Dragon Emperor’s body couldn’t help falling hundreds of millions of kilometers down.<br/><br/>In the surrounding area, the group of universe knights sensed this terrifying power and quickly hid in the surroundings.<br/><br/>Wang Xian immediately attacked Devil Dragon Emperor below. Sensing the distance, his body trembled.<br/><br/>“Dragon’s might!”<br/><br/>The current Wang Xian had already broken through to the Level 1 universe Knight Realm.<br/><br/>His dragon’s might covered an area of nearly one billion kilometers. It could rule all aquatic creatures and all dragon species below the level 1 universe Knight Realm.<br/><br/>When his energy covered the bodies of the 10 million sub-dragon species below, his eyes revealed a bloodthirsty look.<br/><br/>“Destroy!”<br/><br/>He roared.<br/><br/>“Roar!”<br/><br/>He was at the lowest position.<br/><br/>With a roar, the bodies of all the void God emperor level disciples from the three great dragon palaces trembled slightly. They were completely under his control.<br/><br/>At the next moment, they made a move that shocked all the godly dragons and sub-dragons.<br/><br/>Tens of millions of void God emperor level Yalong directly cut off their own life force.<br/><br/>“Peng Peng Peng!”<br/><br/>Continuous loud sounds came over, causing all the disciples of the Water Dragon Palace to widen their eyes. Their faces were filled with shock.<br/><br/>In less than a second, tens of millions of disciples had cut off their own life force.<br/><br/>This terrifying and strange scene caused everyone to reveal terrified expressions.<br/><br/>“What’s going on? What Happened?”<br/><br/>The Fire Dragon Lord, the Devil Dragon King, and the others sensed the death of the disciples below. They opened their eyes wide, and their faces were filled with shock and fear.<br/><br/>Their eyes swept over, and their hearts trembled violently.<br/><br/>“What exactly happened? What kind of method is this?”<br/><br/>The Devil Dragon King’s heart also trembled violently.<br/><br/>Ten million disciples all cut off their own lives?<br/><br/>What kind of strange method was this?<br/><br/>From the beginning to the end, they didn’t even sense who was the one who did it.<br/><br/>All of them committed suicide. This scene was too terrifying.<br/><br/>Moreover, ten million disciples cutting off their own lives was a fatal blow to the demon dragon lineage and the Fire Dragon Palace.<br/><br/>This was the inferior dragon of their Dragon Palace. This was their foundation.<br/><br/>The inferior dragons weren’t from other races, and their numbers were enormous.<br/><br/>The fact that the disciples of the three dragon palaces could reach such numbers was because they had developed over a billion years.<br/><br/>After all, it wasn’t common for the inferior dragons to have the bloodline of the Divine Dragon.<br/><br/>The death of tens of millions of inferior dragons meant that their heritage had disappeared.<br/><br/>“No, Dragon King of the Dragon Palace, Water Dragon Palace, I’m going to kill you. I’m going to kill you all!”<br/><br/>In the sky, Devil Dragon Emperor could sense the situation below. His eyes were blood-red as he went berserk instantly.<br/><br/>These void God emperor level disciples were their foundations!<br/><br/>Nurturing so many disciples was the accumulation of more than a billion years.<br/><br/>Now that all of them were killed, their foundations were completely destroyed!<br/><br/>“Roar Roar Roar!”<br/><br/>He stared at Wang Xian in an extremely berserk manner. He extended his huge dragon claws and charged forward.<br/><br/>“HMPH!”<br/><br/>Wang Xian’s eyes were also filled with a cold luster.<br/><br/>He didn’t want to slaughter so many of the inferior dragons’disciples. However, he realized that these inferior dragons were all controlled by a special energy.<br/><br/>In other words, these inferior dragons had become puppets.<br/><br/>They were controlled by the demonic dragon lineage. Once he destroyed the two demonic dragons, all the inferior dragons would go all out to seek revenge.<br/><br/>Therefore, he had to kill these inferior dragons that were under his control.<br/><br/>He wanted to completely destroy the demonic dragon lineage, the Fire Dragon Palace, and the Red Gold War Dragon.<br/><br/>The war between the divine dragon lineage was also so cruel.<br/><br/>If the Dragon Palace lost, they would all be killed as well.<br/><br/>Just like the wind and thunder divine dragon lineage, all the disciples and experts would be killed.<br/><br/>“Kill!”<br/><br/>Seeing the demonic dragon emperor’s frenzied attack, Wang Xian’s eyes were filled with a violent killing intent.<br/><br/>Both sides had already reached the point where one would die while the other would die.\t\t\t\t\t\t</div>", "images": {}, "success": true}