{"id": 272, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072445.html", "title": "Chapter 3263 - 3263 3262 Returned To The Strange World", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3263 - 3263 3262 Returned To The Strange World</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3263 3262 returned to the strange world<br/><br/>Another great war was about to break out among the Dragon Clan. This time, it was even more eye-catching than the previous two.<br/><br/>Because someone had received the news that the Dragon Palace had sent reinforcements to the Water Dragon Palace.<br/><br/>The Dragon Palace had sent reinforcements to the Water Dragon Palace.<br/><br/>The Fire Dragon Palace had a red gold war dragon under the Devil Dragon Clan, which was equivalent to the final battle between the Dragon Clan and Lu Xingkong.<br/><br/>Whoever won would be the king of the Lu Xingkong Divine Dragon bloodline.<br/><br/>In the void around the water dragon palace, some experts from other forces were investigating the situation here.<br/><br/>Soon, another piece of news caused a huge shock on the Lu Xingkong Universe AI.<br/><br/>“It seems that the Saint Wen Clan has joined the battle. They seem to have a grudge against the Dragon Palace, and the Saint Wen Clan wants to destroy the Dragon Palace.”<br/><br/>“Hiss, why did the Holy Prose Clan suddenly join this battle?”<br/><br/>“The holy prose clan wants to join forces with the Fire Dragon Palace and the Devil Dragon Bloodline. The holy prose clan mainly wants to destroy the Dragon Palace.”<br/><br/>“It seems that the Dragon Palace has killed two universe Knight Level 5 elders of the Holy Prose clan, and the holy prose clan is using this opportunity to take revenge.”<br/><br/>The sudden intervention of a power caused the entire surrounding starry sky to be in an uproar.<br/><br/>Especially the Saint Wen clan, they weren’t weak.<br/><br/>Right now, the Great Beings from all the powers in the AI were guessing that the Devil Dragon bloodline had a level 6 knight, this already suppressed the Water Dragon Palace and Dragon Palace greatly.<br/><br/>Now, with the Saint Wen clan with a level 6 knight, the Water Dragon Palace and Dragon Palace were probably going to lose.<br/><br/>They might have to surrender or escape.<br/><br/>There were all kinds of speculations and discussions.<br/><br/>However, there was a consensus that no force or powerhouse thought that the Water Dragon Palace and the Dragon Palace could win.<br/><br/>Especially after the holy prose clan intervened.<br/><br/>However, they didn’t know that they knew nothing about the Fire Dragon Palace’s current strength towards the Dragon Palace.<br/><br/>The news that the Fire Dragon Master and the Dragon Palace had a level six universe knight didn’t spread out.<br/><br/>“Huh?”<br/><br/>At the same time, in the Dragon Palace located in the starry sky of the starriver, Wang Xian, who was helping the five elements grand mill refine the acquired Supreme Treasure, suddenly received the news of the sky array.<br/><br/>“The Fire Dragon Master’s strength has reached level six universe knight?”<br/><br/>“The holy prose clan is involved in this and wants to destroy the Dragon Palace?”<br/><br/>He narrowed his eyes slightly, especially when he saw the latter news. His eyes were filled with coldness.<br/><br/>He had never expected that the holy prose clan would be involved.<br/><br/>“Hehe, they want to destroy my Dragon Palace?”<br/><br/>Wang Xian’s eyes shone with awe.<br/><br/>“The Fire Dragon Lord’s strength has reached the level of a level six universe knight, but he is still suppressed by the Demonic Dragon Clan. Then, the Demonic Dragon Clan’s strength, even if it is weak, has the combat strength of at least three level six universe knights.”<br/><br/>“Even a level seven universe knight.”<br/><br/>Wang Xian was deep in thought.<br/><br/>The strength of the demonic dragon lineage had far exceeded his estimation. He had thought that the sky array alone would be able to suppress the demonic dragon lineage’s Fire Dragon Palace. Now, it seemed that he was overthinking.<br/><br/>“I have to go there myself.”<br/><br/>He mumbled and slowly stood up.<br/><br/>He looked at the five elements millstone in front of him. It would take another day for him to completely absorb the two acquired treasures.<br/><br/>If an lie had not arrived yet, he could only fly over.<br/><br/>Wang Xian frowned slightly. Logically speaking, an lie should be able to teleport to get the demon spirit altars one by one very quickly.<br/><br/>It had already been one or two days, but there was still no sign of him.<br/><br/>Could there be something wrong?<br/><br/>However, according to the information from the Dragon Palace, an lie was not dead.<br/><br/>Buzz<br/><br/>Just as Wang Xian was thinking about an lie, a figure appeared in the Dragon King’s Hall.<br/><br/>“HMM? He came at the right time!”<br/><br/>Wang Xian smiled when he saw this figure.<br/><br/>An lie was a very special existence. If he died, it would be a great loss to the Dragon Palace.<br/><br/>Especially if he died in an unknown place, he couldn’t even be resurrected.<br/><br/>“Eh?”<br/><br/>When he looked at an lie, he was surprised.<br/><br/>An lie was much stronger than before. His whole body seemed to be in another void.<br/><br/>It looked very ethereal.<br/><br/>However, when he saw that the oil lamp on his body was completely extinguished, he raised his eyebrows.<br/><br/>The oil lamp was extinguished?<br/><br/>The wick of the oil lamp was inexhaustible. Even if the vitality fluid in it was completely consumed, it should not be extinguished.<br/><br/>“Greetings, Dragon King!”<br/><br/>At this moment, an lie was still in shock as he bowed to Wang Xian.<br/><br/>“What happened? It took you so long to get here. Did you encounter any problems?”<br/><br/>Wang Xian asked him. With a wave of his arm, the oil lamp flew towards him.<br/><br/>He looked at the wick of the oil lamp and realized that it had turned black. It was completely dead.<br/><br/>“Dragon King, I encountered something special. When I was teleporting through the demonic altar, I seemed to have entered a very special world. It was very strange.”<br/><br/>An Lie’s expression changed as he spoke.<br/><br/>“A special world?”<br/><br/>Wang Xian was slightly taken aback. He looked at him strangely and asked, “Is it from the heaven-splitting primordial land?”<br/><br/>“Dragon King, I don’t know either. But I don’t feel like it’s the heaven-splitting primordial land. How should I put it? That place gives me a very strange feeling.”<br/><br/>An lie shook his head and said, “And that world is very, very big. It’s very strange. I don’t know what kind of attack I suffered just now. I almost died. If not for the protective treasure you gave me, I might have already died.”<br/><br/>As he spoke, he patted his chest. He almost killed himself before he could even see the shadow of the other party. It was too terrifying.<br/><br/>One had to know that he was already extremely powerful at that time.<br/><br/>If not for his quick reaction, the consequences would have been unimaginable.<br/><br/>“Is that so?”<br/><br/>Wang Xian nodded his head slightly. The universe was so big. It could be a special space or a special place in the heaven-splitting primordial land.<br/><br/>He didn’t think too much about it. He looked at an lie and asked, “How is your current strength?”<br/><br/>“Hehe, Dragon King, my current strength is comparable to a level five universe knight. If I were to assassinate him, it wouldn’t be a problem for me to be one level higher. As for how much higher it is, I can’t guarantee it.”<br/><br/>“If there is enough energy in that oil lamp, I might be able to assassinate a level seven universe knight with it.”<br/><br/>An lie said excitedly.<br/><br/>Although the journey this time was strange and terrifying, his strength had improved tremendously.<br/><br/>His current strength was considered top-notch even in the Dragon Palace.<br/><br/>“Very good!”<br/><br/>Wang Xian nodded with a smile. He waved his arm and another piece of wood flew over and landed in the oil lamp.<br/><br/>Following that, he added some vitality liquid into the oil lamp.<br/><br/>This time, he didn’t give the oil lamp to an lie.<br/><br/>This thing was extremely useful to him.<br/><br/>Furthermore, if an lie wasn’t an assassin, he wouldn’t have needed this thing.<br/><br/>If he wanted to escape now, anyone below the ruler realm might not be able to do anything to him.<br/><br/>Even the ruler of the universe would find it difficult to kill him.<br/><br/>“Let’s go to the Water Dragon Palace.”<br/><br/>He said lightly.\t\t\t\t\t\t</div>", "images": {}, "success": true}