{"id": 273, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072447.html", "title": "Chapter 3264 - 3264 3,263, Four Dragon Palace, Water Dragon Palace", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3264 - 3264 3,263, Four Dragon Palace, Water Dragon Palace</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3264 3,263, four Dragon Palace, Water Dragon Palace<br/><br/>Weng! Weng! Weng! Weng<br/><br/>In the surrounding starry sky, where Water Dragon Palace was located.<br/><br/>In front of the East Gate of Water Dragon Palace, figures slowly stepped out of a magical altar.<br/><br/>Water Dragon King and the others beside him were excited when they saw these figures.<br/><br/>“4,000 universe knights, all powerful Universe Knights.”<br/><br/>“There are so many powerful ones in the Dragon Palace. This time, there are about 6,000 of them.”<br/><br/>When the members of the Water Dragon Palace saw this, their eyes were filled with excitement.<br/><br/>“Dragon King!”<br/><br/>The figures that appeared were naturally Wang Xian and the rest.<br/><br/>Water Dragon King Water Dragon Queen walked over and shouted with a smile.<br/><br/>“Water Dragon King, Water Dragon Queen!”<br/><br/>Wang Xian greeted with a smile.<br/><br/>“It’s all thanks to the Dragon Palace’s help this time. Otherwise, our water dragon palace would have no choice but to flee.”<br/><br/>Water Dragon King said gratefully.<br/><br/>“Haha, you’re Too Kind. Let’s go. We are allies on the same Front.”<br/><br/>Wang Xian smiled and shook his head.<br/><br/>“Dragon King, are you confident now? It’s not just the Devil Dragon lineage. There’s also the holy prose clan. Among them, there are universe knights with level 6 combat strength and 4,000 universe knights.”<br/><br/>“Their strength is even stronger than the overall strength of our Water Dragon Palace!”<br/><br/>Water Dragon King made an inviting gesture and led Wang Xian and the rest into the water dragon palace as he said solemnly.<br/><br/>The current situation had completely exceeded their expectations.<br/><br/>The Fire Dragon Master had the combat strength of a universe Knight Level 6, which was completely beyond their expectations.<br/><br/>If the Fire Dragon Master was so powerful, then what about the Devil Dragon lineage?<br/><br/>Furthermore, they didn’t expect the holy prose clan to interfere.<br/><br/>Otherwise, the Water Dragon Palace would have already prepared to escape.<br/><br/>This wasn’t something they could fight against.<br/><br/>“Water Dragon King, since our Dragon Palace didn’t retreat this time, we have a way to deal with it.”<br/><br/>Wang Xian gave them a reassuring pill. “Leave the lineage of the Devil Dragon, the Fire Dragon Lord, and the holy prose clan to us.”<br/><br/>As he spoke, his gaze swept across the surroundings. When he saw the dragon palaces, his eyes sparkled.<br/><br/>“HMM? Are You Confident, Dragon King?”<br/><br/>Water Dragon Queen’s eyes sparkled as she asked with some anticipation.<br/><br/>“Yes!”<br/><br/>Wang Xian nodded.<br/><br/>“That’s good, that’s good.”<br/><br/>The Water Dragon King’s face was filled with excitement as well. “If the Dragon Palace can help us get through this crisis, our water dragon palace will be led by the Dragon Palace in the future.”<br/><br/>This was a huge crisis for the Water Dragon Palace. If they could get through this crisis, so what if they were led by the Dragon Palace?<br/><br/>Moreover, based on their short-term understanding, they had a good impression of the Dragon Palace.<br/><br/>Wang Xian smiled and didn’t say anything.<br/><br/>Boom! Boom<br/><br/>At this moment, a powerful aura came from outside.<br/><br/>“Huh?”<br/><br/>Wang Xian and the rest were moved and looked outside.<br/><br/>In the void on the right, an extremely huge black cloud was flying towards them.<br/><br/>The entire black cloud covered the sky and the Sun. They couldn’t see the situation inside clearly.<br/><br/>The Shadows of the Devil Dragons flashed by, making it hard for them to see clearly.<br/><br/>“Devil Dragon Dark World!”<br/><br/>“The Devil Dragon Dark World of the Devil Dragon lineage is here, the Devil Dragon King and the others are here!”<br/><br/>The Water Dragon King and the others looked over, and their eyes were filled with coldness.<br/><br/>The entire Devil Dragon Dark World was hidden in the darkness, so they couldn’t see clearly what was going on inside.<br/><br/>The Dark World of the Devil Dragon was very different from the ordinary Dragon Palace.<br/><br/>“There is still one day until the 10-day limit mentioned by the lineage of the Devil Dragon. I wonder if they will attack us after one day or immediately.”<br/><br/>The eyes of the Water Dragon Queen flickered as she spoke.<br/><br/>“Sky Formation, get all the disciples ready.”<br/><br/>Wang Xian spoke to the sky formation beside him indifferently.<br/><br/>“It’s the Dragon King!”<br/><br/>The Sky Formation replied immediately.<br/><br/>“Demon Dragon King, Demon Dragon Emperor and the rest are here!”<br/><br/>“Come, let’s go.”<br/><br/>Around the Water Dragon Palace, in the dragon palaces of the Fire Dragon Palace, the Red Gold War Dragon Palace, and the wind and thunder lineage, many experts flew towards the direction of the Demon Dragon Dark World.<br/><br/>“Oh? Come, let’s Go Too!”<br/><br/>The elders of the Saint Wen Clan looked at the demon dragon dark world with sparkling eyes and said in a low voice.<br/><br/>“Swoosh!”<br/><br/>The Light Lotus flew toward the Dark World of the Devil Dragon.<br/><br/>“Devil Dragon King, Devil Dragon Emperor!”<br/><br/>The Fire Dragon Lord and the others flew toward the dark world of the Devil Dragon and said respectfully.<br/><br/>“Well, get ready. We will destroy the Water Dragon Palace as soon as the ten-day limit arrives.”<br/><br/>At this moment, the Devil Dragon King turned into the true form of the Dark Dragon and ordered indifferently.<br/><br/>“Hehe!”<br/><br/>As soon as he finished speaking, he looked outside with a light smile on his face.<br/><br/>The Devil Dragon King swayed his body and his huge head slowly extended out of the Devil Dragon Dark World.<br/><br/>From Afar, one could see the head of the Devil Dragon stretching out from the black clouds in the sky. It was filled with terror and majesty.<br/><br/>“Devil Dragon King, I’ve long heard of your name!”<br/><br/>When the elders of the holy prose clan saw the Devil Dragon King coming out, they cupped their hands and said with a smile.<br/><br/>“I’ve learned that you have a grudge against the Dragon Palace?”<br/><br/>The Devil Dragon King looked at them and asked.<br/><br/>“That’s right. The Dragon Palace killed the elders of our Saint Wen Clan. This time, we’ll use this opportunity to completely destroy them. Devil Dragon King, Let’s join hands. What do you think?”<br/><br/>The clan leader of the Saint Wen Clan asked faintly.<br/><br/>“Of course there’s no problem. Let’s join hands and destroy them all.”<br/><br/>Devil Dragon Emperor smiled.<br/><br/>“Alright then, after Your Devil Dragon bloodline opens the Water Dragon Palace, leave the people of the Dragon Palace to our holy prose clan.”<br/><br/>The holy prose clan leader said confidently.<br/><br/>“Sure!”<br/><br/>Devil Dragon Emperor raised his head slightly, “The 10 days limit has arrived, we’ll attack immediately.”<br/><br/>After he said that, the dragon head slowly disappeared and entered Devil Dragon Dark World.<br/><br/>“Hehe!”<br/><br/>The Knights of the Saint Wen clan all smiled.<br/><br/>The agreement was reached.<br/><br/>“This Saint Wen clan obviously doesn’t know the strength of the Dragon Palace. If they knew, they wouldn’t dare to be so arrogant.”<br/><br/>“That Level 6 universe knight from the Dragon Palace, even I have to be careful when fighting against him. That level 6 knight from the Dragon Palace can kill more than half of their Saint Wen Clan.”<br/><br/>In the Dark World of Devil Dragon, Fire Dragon Master saw the situation outside and glanced at the people from the Saint Wen clan, his eyes filled with disdain.<br/><br/>“The Saint Wen Clan will benefit us greatly, as for whether they live or die, it has nothing to do with us.”<br/><br/>Devil Dragon Emperor flew over and said with a smile.<br/><br/>“Four dragon palaces suppress, break through the defense of the Water Dragon Palace first.”<br/><br/>At this moment, a voice came from the depths of the Demon Dragon Dark World.<br/><br/>Hearing this voice, everyone’s faces were filled with awe.<br/><br/>Buzz<br/><br/>At this moment, the Demon Dragon Dark World continued to fly forward and slowly arrived above the water dragon palace.<br/><br/>At the same time, an extremely terrifying energy spread out from the demon Dragon Dark World and rushed down.<br/><br/>The other three dragon palaces surrounded the water dragon palace like a triangle.<br/><br/>At this time, a terrifying power burst out.\t\t\t\t\t\t</div>", "images": {}, "success": true}