{"id": 278, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072457.html", "title": "Chapter 3269 - 3269 3268 Holy Prose Clan Exterminated, Attack! Attack", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3269 - 3269 3268 Holy Prose Clan Exterminated, Attack! Attack</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3269 3268 holy prose clan exterminated, Attack! Attack<br/><br/>“Hahaha, I, an lie, AM simply invincible!”<br/><br/>An Lie’s hunting speed was very, very fast, so fast that it was somewhat terrifying!<br/><br/>The entire holy prose clan, with about 4,000 universe members, allowed him to kill them all within 10 minutes.<br/><br/>Especially after the holy prose clan elder was killed by him, he became even more unrestrained, every second, more than 10 people died at his hands.<br/><br/>After he destroyed the holy prose clan, he couldn’t help but laugh out loud, his gaze fixed on the main battlefield.<br/><br/>“Hahaha, I, an lie, am here, the battle situation is starting to change, Haha!”<br/><br/>He laughed madly, his face full of excitement.<br/><br/>He, an lie, was finally starting to turn the tables.<br/><br/>Weng<br/><br/>The next moment, his figure disappeared instantly, reappearing at a universe Knight Level 4 great being.<br/><br/>Pu<br/><br/>A terrifying energy hit the level 4 universe knight, and he disappeared.<br/><br/>He reappeared in front of another figure.<br/><br/>Pu! Pu! Pu<br/><br/>Dark Lie’s instantaneous space teleportation, which ignored both the array and the energy shield, was too powerful.<br/><br/>Ten seconds after he appeared on the battlefield, ten universe knight level four great beings were killed in an instant.<br/><br/>It was too easy to kill those weaker than him!<br/><br/>“Not good, that strange great being has entered the battlefield. We are no match for him. He is too strange!”<br/><br/>In an instant, ten universe Knight Level Four Great Beings were killed, which caused great panic.<br/><br/>The leader of the Fire Cloud Army looked around, his eyes filled with shock, and he roared.<br/><br/>“What a strange guy!”<br/><br/>“Is this the Dragon Palace’s biggest trump card? He single-handedly destroyed the holy prose clan!”<br/><br/>“However, his attack power is only at level 5 universe knight, and he can only kill level 6 at most.”<br/><br/>His blood-red pupils started to lock onto an lie.<br/><br/>“Boom!”<br/><br/>In the next moment, the entire dark world of the Devil Dragon started to spread downwards.<br/><br/>The Dark World of the Devil Dragon began to cover the space below.<br/><br/>“It’s my turn to act. The war is about to end. Destroy!”<br/><br/>The Devil Dragon Emperor let out a cold roar and his entire dragon body rapidly flew downwards.<br/><br/>He carried a terrifying power of darkness.<br/><br/>A large-scale attack covered the area below.<br/><br/>With this attack, he was confident that he could kill that guy with that strange speed.<br/><br/>The reason why he had only made his move now was because he was waiting for an lie to arrive.<br/><br/>As long as an lie got close to Devil Dragon’s dark world, he would have the confidence to kill him.<br/><br/>A large-scale attack without any difference was the best way to kill an lie.<br/><br/>Boom<br/><br/>A terrifying energy burst out from the dark world of the Demon Dragon in the sky, causing everyone’s expression to change drastically.<br/><br/>“What kind of power is this?”<br/><br/>The Water Dragon King, Water Dragon Queen, and the rest raised their heads and looked up at the sky in astonishment.<br/><br/>At this moment, they saw an incomparably huge head of the demon dragon.<br/><br/>The head of the demon dragon stared at the ground with an ice-cold gaze. It was filled with awe and coldness.<br/><br/>“Huh? He finally made his move?”<br/><br/>At the same time, Wang Xian, who was in the Dragon Palace, sensed the terrifying power coming from the sky. He narrowed his eyes.<br/><br/>Fire Dragon Master had the combat strength of a universe knight at level six, so there must be someone stronger than him in the lineage of the Demon Dragon.<br/><br/>Now, it seemed that this existence had made his move!<br/><br/>“This power?”<br/><br/>He narrowed his eyes. This terrifying power surprised him, but at the same time, it was within his expectations.<br/><br/>The lineage of the demonic dragon had the combat strength of a level seven universe knight!<br/><br/>“It’s good that you came out. Only by destroying you can we snatch the Demonic Dragon’s dark world!”<br/><br/>Wang Xian’s eyes revealed a cold and sinister look. This time, he would definitely kill him!<br/><br/>Boom<br/><br/>Wang Xian saw the terrifying power of darkness attacking downwards. With a wave of his arm, the Five Elements Millstone appeared directly in the sky.<br/><br/>At the same time, Wang Xian’s arm sent a vast amount of power of the five elements into the five elements millstone.<br/><br/>With his current strength, the five elements millstone, which could kill a universe knight at level six, burst out with a terrifying power under his support.<br/><br/>The five elements revolved and the grey energy spread out in all directions, directly facing the terrifying power of darkness in the sky.<br/><br/>“Eh? What? This power!”<br/><br/>Devil Dragon Emperor’s expression changed slightly. When he saw the power of the five elements that was attacking him, his gaze froze.<br/><br/>Boom<br/><br/>The next moment, the Black Power and the power of the five elements collided. A vast energy spread out in the surroundings.<br/><br/>The power of darkness started to dissipate. The power of the five elements also dissipated rapidly. The huge mill of the five elements was suspended in the void.<br/><br/>“Is this the hidden powerhouse of Your Devil Dragon Lineage? I have been waiting for you for a long time!”<br/><br/>Wang Xian’s body moved and flew out from the Water Dragon Palace. His gaze was locked onto Devil Dragon Emperor who was in the sky.<br/><br/>“Universe knight level seven offensive power. You actually have the strength of a universe Knight Level Seven!”<br/><br/>Devil Dragon Emperor stared at Wang Xian with his eyes wide open. He roared in disbelief.<br/><br/>“You can even have the strength of a universe knight level seven. Why Can’t I Have It?”<br/><br/>Wang Xian smiled mockingly. He came to the sky above the five elements grinding mill and stood on it.<br/><br/>“You are the Dragon King of the Dragon Palace?”<br/><br/>The Demonic Dragon Emperor stared at Wang Xian, his expression changing.<br/><br/>He was already very surprised by the dragon palace’s top-notch dragon species and the weird guy from the Dragon Palace.<br/><br/>However, the Dragon King of the Dragon Palace still possessed the combat strength of a universe knight at level seven?<br/><br/>“That’s right. I’ve never heard of the Demonic Dragon lineage possessing a powerful demonic dragon. What a surprise!”<br/><br/>Wang Xian stared at him and replied indifferently.<br/><br/>“I have to say, your strength is really out of our expectations!”<br/><br/>The Demonic Dragon Emperor’s expression changed drastically as he roared in embarrassment.<br/><br/>The Dragon King of the Dragon Palace had the combat strength of a level seven universe knight. In addition, there were so many powerhouses in the Dragon Palace. It would be difficult for him to win this battle.<br/><br/>He might even lose!<br/><br/>“Today, the Dragon King will exterminate your demonic dragon lineage. Haha!”<br/><br/>Wang Xian saw the change in his expression. Without any hesitation, he attacked him directly.<br/><br/>“Roar Roar Roar!”<br/><br/>At the same time, his body moved and transformed into the body of a divine dragon. At a terrifying speed, he flew towards the sky in an instant.<br/><br/>He didn’t attack immediately. Instead, he sealed the circuits of the Demonic Dragon Emperor.<br/><br/>He sealed off his route back to the Dark World of Devil Dragon. Next, if he wanted to return to the Dark World of Devil Dragon, he had to get rid of Wang Xian.<br/><br/>However, Wang Xian was already prepared to risk his life.<br/><br/>This time, he would kill him!<br/><br/>“You’re courting death!”<br/><br/>Devil Dragon Emperor’s expression changed slightly when he saw Wang Xian’s terrifying speed. A brutal look appeared in his eyes.<br/><br/>“Roar! Roar! Roar!”<br/><br/>He roared crazily and charged towards Wang Xian.<br/><br/>“This… this… Dragon King also has the combat strength of a level seven universe Knight!”<br/><br/>“Hiss, I didn’t expect Dragon King to be so strong!”<br/><br/>Below, all the powerhouses of the Water Dragon Palace saw this scene and their expressions changed drastically. They were pleasantly surprised.<br/><br/>Dragon King’s strength had exceeded their expectations.<br/><br/>“DAMN!”<br/><br/>“How is this possible? Isn’t Dragon King only a Level 5 universe knight?”<br/><br/>However, the Devil Dragon bloodline and all the Red Gold Battle Dragons of Fire Dragon Palace had ugly expressions on their faces.\t\t\t\t\t\t</div>", "images": {}, "success": true}