{"id": 275, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072451.html", "title": "Chapter 3266 - 3266 3,265 Exterminating An Entire Race", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3266 - 3266 3,265 Exterminating An Entire Race</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3266 3,265 exterminating an entire race<br/><br/>“Pu, Pu, Pu!”<br/><br/>The sound continued to pierce through, and a terrifying blade flashed past.<br/><br/>The Knights of the holy prose clan who were preparing to attack narrowed their eyes. Over 1,000 of them trembled, and traces of blood flowed out of their necks.<br/><br/>They opened their eyes wide, filled with shock.<br/><br/>There were no screams, and no one had time to react.<br/><br/>“Not good!”<br/><br/>At this moment, the smell of blood caught the attention of the clan elder of the central holy prose clan.<br/><br/>He immediately looked around, his body protected by rays of light.<br/><br/>His eyes were wide open, and he swept his gaze across the thousand clan members in shock.<br/><br/>With his senses, the life force of the thousand clan members had completely disappeared.<br/><br/>“Be careful, there’s an assassination attempt, be careful!”<br/><br/>He immediately roared ferociously, his eyes revealing a trace of fear.<br/><br/>In just an instant, over 1,000 clansmen were killed instantly.<br/><br/>He didn’t even sense who the opponent was, and the opponent didn’t reveal himself.<br/><br/>This was simply too terrifying!<br/><br/>“What?”<br/><br/>“What’s happening?”<br/><br/>Some of the Saint Wen Clan warriors who were preparing to attack the Dragon Palace warriors had a slight change in expression.<br/><br/>They hadn’t noticed the situation around them.<br/><br/>Especially those knights at the first or second level.<br/><br/>They didn’t even feel that any of their clansmen had died.<br/><br/>“Peng, Peng, Peng!”<br/><br/>However, at this time, when the corpses fell down one by one, everyone’s expression changed.<br/><br/>At this moment, the clan elder of the Holy Prose clan continued to roar with a ferocious expression.<br/><br/>“Be careful!”<br/><br/>“The clan leader is dead, the clan leader was actually assassinated!”<br/><br/>“Defend, everyone defend!”<br/><br/>At this moment, terrified voices rang out. All the venerables of the holy prose clan had already discovered that their clan leader had been killed.<br/><br/>Before anyone could react, he had turned into a corpse.<br/><br/>They immediately unleashed their powerful defenses and scanned their surroundings vigilantly.<br/><br/>“Hahaha, how Dare You Destroy Our Dragon Palace?”<br/><br/>An Lie’s figure appeared from below. He put away the corpses of the Saint Wen clan with a relaxed expression and stared at them mockingly.<br/><br/>“You’re courting death. Attack him and kill him!”<br/><br/>The holy prose clan leader heard the voice and immediately locked his gaze on an lie. He roared coldly.<br/><br/>He waved his arm, and numerous sharp lotuses formed from light shot toward an lie.<br/><br/>“Attack!”<br/><br/>The rest of them roared with unsightly expressions. The energy of nearly 3,000 universe knights poured toward an lie.<br/><br/>“Haha, Die!”<br/><br/>An lie saw their attack, and his face was full of emotion.<br/><br/>Before the countless attacks arrived, he had already disappeared.<br/><br/>Pu! Pu! Pu<br/><br/>The next moment, those universe knights at level five, level two, and level three were teleported by an lie before they could react.<br/><br/>Hong<br/><br/>“Oh no, he’s attacking! He’s attacking!”<br/><br/>An Lie’s attack landed on an old man from the holy prose clan, and a terrifying energy protected him.<br/><br/>An lie raised his eyebrows and disappeared.<br/><br/>Pu! Pu! Pu! Pu<br/><br/>This time, he didn’t stop. He kept teleporting to kill the Great Beings from the holy prose clan.<br/><br/>“No, no, no, what a weird trick!”<br/><br/>“Run, run, run. His speed is too terrifying. We can’t lock on to them at all.”<br/><br/>“Defense, all of you, Defend!”<br/><br/>When an lie continued to teleport and kill, the Saint Wen Clan completely panicked. They roared with fear on their faces.<br/><br/>The method of that expert of the Dragon Palace was too strange.<br/><br/>When he appeared in front of one person, he appeared next to another person in the next moment.<br/><br/>This speed was too strange.<br/><br/>With such a strange speed and such terrifying power, they had no way of resisting.<br/><br/>Pu! Pu! Pu<br/><br/>An Lie’s assassination continued. Every second, more than 100 people were killed.<br/><br/>Even with all the defenses they had set up, they were still easily killed.<br/><br/>Only a level 5 universe knight could withstand it.<br/><br/>However, how many level 5 universe knights were there in the entire holy prose clan?<br/><br/>Only a dozen or so.<br/><br/>Among them, the clan leader and the others were instantly killed.<br/><br/>“Quick, everyone, get on the Holy Light Lotus immediately.”<br/><br/>The clan leader of the Holy Prose Clan roared loudly, his heart trembling.<br/><br/>In such a short time, nearly 3,000 universe knights had been killed.<br/><br/>That was 3,000 universe knights!<br/><br/>Almost all 4,000 universe knights were killed!<br/><br/>Most importantly, this member of the Dragon Palace was too terrifying. If the Dragon Palace wanted to take revenge on them? How could they defend against it?<br/><br/>This speed was so strange that universe knights below level 5 couldn’t react at all.<br/><br/>Even universe knights at Level 5 would be killed instantly if they weren’t careful.<br/><br/>What kind of being was this?<br/><br/>“Trying to escape? Haha, Dream On!”<br/><br/>An lie laughed out loud, his eyes filled with coldness as he continued to hunt.<br/><br/>None of the universe knights below level 5 could withstand his instant kill.<br/><br/>Even a level 5 universe knight had to defend himself at all times.<br/><br/>“No, Dragon Palace, you deserve to die!”<br/><br/>The elder of the holy prose clan saw that the remaining 1,000 universe knights were still being hunted rapidly, and his eyes were bloodshot.<br/><br/>At the same time, he felt helpless.<br/><br/>He couldn’t lock onto that figure at all. If he couldn’t lock onto that figure, he couldn’t attack.<br/><br/>This made him extremely aggrieved and terrified.<br/><br/>“What!”<br/><br/>“What’s going on with the Holy Prose Clan?”<br/><br/>“Hiss, is this the trump card of the Dragon Palace? How terrifying!”<br/><br/>The war had only started for a few dozen seconds.<br/><br/>The Devil Dragon Bloodline, Fire Dragon Palace, and the others hadn’t even engaged in close combat with the members of the Dragon Palace’s Water Dragon Palace when the holy prose clan beside them collapsed.<br/><br/>This caused the expressions of the Devil Dragon Clan, Fire Dragon Palace, and the Red Gold War Dragon to change drastically.<br/><br/>What the hell was this?<br/><br/>The battle had just begun, and the Saint Wen clan was about to be annihilated?<br/><br/>Didn’t they say they were going to fight the Dragon Palace?<br/><br/>Yet the Dragon Palace only sent one person to annihilate them?<br/><br/>However, when they felt the large number of knights from the Saint Wen Clan being killed, the Devil Dragon Clan and the others’pupils constricted slightly.<br/><br/>Their faces were filled with shock.<br/><br/>The holy prose clan was not weak, yet they had been slaughtered so easily!<br/><br/>That great being from Dragon Palace was a little terrifying!<br/><br/>“What speed is this?”<br/><br/>Inside Devil Dragon Dark World, Devil Dragon Emperor had also noticed the situation here, and his face sank slightly.<br/><br/>“He has the offensive power of a level five universe knight, and his speed is even more terrifying. Even I can’t lock onto him, so how can there be such a terrifying great being in Dragon Palace?”<br/><br/>“If I want to kill him, I have to trap him in the dark sector of Devil Dragon. Otherwise, it’s impossible.”<br/><br/>Devil Dragon Emperor roared in a low voice, his eyes shining.<br/><br/>“No wonder the Dragon Palace is fighting against the Devil Dragon Bloodline. So they have such a trump card. However, with me and the dark sector of Devil Dragon, you all have to die.”<br/><br/>Devil Dragon Emperor roared coldly.\t\t\t\t\t\t</div>", "images": {}, "success": true}