{"id": 286, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072473.html", "title": "Chapter 3277 - 3277 3276", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3277 - 3277 3276</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3277 3276<br/><br/>Buzz<br/><br/>When Wang Xian opened the seal, the wings of the angel of light were revealed in his sight.<br/><br/>The terrifying power of light had an instinctive repulsion with the Demonic Dragon Dark World.<br/><br/>This was an extremely powerful item. It came from the wings of an angel from a peak race.<br/><br/>A terrifying pressure surged towards Wang Xian. Looking at the wings of the angel, Wang Xian felt extremely stifled.<br/><br/>“As expected of a part of the body of the ruler of the universe. It’s too terrifying.”<br/><br/>Wang Xian clicked his tongue slightly. After Devil Dragon Emperor obtained the angelic wings, he would not use it.<br/><br/>His body was of the Darkness Attribute and was repelled by the angelic wings of light.<br/><br/>He did not dare to use such an item. If the angelic race knew about it, they would definitely snatch it away.<br/><br/>Angels were existences that were comparable to the peak of the Divine Dragon Race!<br/><br/>“I don’t think I have any use for this item.”<br/><br/>Wang Xian looked at it and shook his head slightly.<br/><br/>The wings of angels had undergone a special refinement and could no longer be absorbed and turned into dragon blood. The only use for it was to forge a powerful supreme treasure.<br/><br/>However, it was not easy to forge a supreme treasure.<br/><br/>It would take tens of thousands of years to forge a weapon that was at the level of a acquired Supreme Treasure.<br/><br/>“Useless. The treasures in the Dark World of the Devil Dragon are indeed very powerful. They are all existences that are comparable to innate spiritual treasures. However, they are not useful to me.”<br/><br/>Wang Xian shook his head. Other than those acquired Supreme Treasures, the rest were not of much use to him.<br/><br/>Moreover, according to the memories in his mind, the treasures in the Dark World of the Devil Dragon were basically these.<br/><br/>The rest were the treasures in the Ya Long’s lair of the Devil Dragon Dark World.<br/><br/>That was an extremely terrifying amount of resources.<br/><br/>“How much can the Dragon Palace improve by this time?”<br/><br/>Wang Xian’s eyes sparkled and his face was filled with excitement.<br/><br/>Over 10,000 universe knight level corpses and over 10,000 void God Emperor level corpses.<br/><br/>It was unimaginable.<br/><br/>Especially the devouring Dragon Clan. This time around, they would probably receive a qualitative improvement.<br/><br/>Wang Xian’s figure moved and came to the position of the Dragon King Palace. He placed his palm on the dragon throne and sensed it.<br/><br/>This was to control the dark world of the Demon Dragon.<br/><br/>Since the demon Dragon Emperor was already dead, it was very easy for him to control this dark world of the Demon Dragon.<br/><br/>Very soon, Wang Xian had some control over the Devil Dragon Dark World.<br/><br/>“So powerful. This Devil Dragon Dark World is even more powerful than the current Dragon Palace. I wonder if the devouring dragon can devour it.”<br/><br/>Wang Xian pursed his lips.<br/><br/>The Devouring Dragon Devouring Dragon Palace could naturally evolve. However, a dragon palace of this level would probably not be able to eat it.<br/><br/>The energy from the Dragon Palace alone could kill the devouring dragon.<br/><br/>“An lie, go to the other three dragon palaces!”<br/><br/>He instructed an lie.<br/><br/>Soon, they appeared in the Fire Dragon Palace. The treasures in the Fire Dragon Palace had already been taken over by Devil Dragon Emperor and the rest, so there were no treasures inside.<br/><br/>However, there were still many divine herbs and divine trees in the herb garden. In the center of the Fire Dragon Palace, there was a universe knight-level dragon flame tree.<br/><br/>When Wang Xian kept it, he was surprised to find that the dragon flame tree was slowly merging with the endless wood.<br/><br/>This caused the power of the endless wood to increase by a lot.<br/><br/>This made him extremely surprised.<br/><br/>“If there are enough powerful divine trees of fire, will the endless wood be able to advance to the level of a universe dominator?”<br/><br/>Wang Xian was pleasantly surprised.<br/><br/>Wang Xian had been in control of the Fire Dragon Palace, the Red Gold War Dragon Palace, and the Dragon Palace of the divine wind and thunder dragon lineage.<br/><br/>The Demon Dragon Dark World and the Fire Dragon Palace were both dragon palaces built by the universe’s ruler-level divine dragons. The dragon palaces of the Red Gold War Dragon and the divine wind and thunder dragon were much weaker.<br/><br/>This dragon palace should be able to be devoured by the devouring dragon.<br/><br/>Whoosh<br/><br/>He moved and flew out of the Dragon Palace.<br/><br/>“Brother Wang Xian, these are some treasures that my parents asked me to give you. They can heal your injuries.”<br/><br/>As soon as he arrived at the front of the Water Dragon Palace, Shui Linglong ran over with a smile on her face. She was holding a large number of water attribute divine herbs and fruits in her hands.<br/><br/>“There’s no need for that. I have obtained a lot of treasures this time. You can use them for your cultivation!”<br/><br/>Wang Xian shook his head and said with a smile.<br/><br/>“My parents want me to join the Dragon Palace. Brother Wang Xian, Um… Do you agree?”<br/><br/>Shui Linglong looked at him with sparkling eyes and asked with slight anticipation.<br/><br/>“HMM? You want to join the Dragon Palace?”<br/><br/>Wang Xian was slightly taken aback. He pursed his lips and recalled the thoughts of the Water Dragon King and the rest.<br/><br/>There were only three purebred divine dragons in the Water Dragon Palace. Shui Linglong was their daughter.<br/><br/>Naturally, they wanted to find a son-in-law of a purebred divine dragon. Furthermore, they wanted to be closer to the Dragon Palace.<br/><br/>“Of course, there’s no problem. Our Dragon Palace doesn’t have a purebred water dragon palace yet.”<br/><br/>Wang Xian thought about it and agreed with a smile.<br/><br/>“That’s great. Thank you, brother Wang Xian. No, thank you, Dragon King!”<br/><br/>Shui Linglong said excitedly.<br/><br/>“Alright, I still have some things to take care of. You can go and play first.”<br/><br/>Wang Xian looked at her and smiled.<br/><br/>“Dragon King!”<br/><br/>At this moment, Tian Chen and the rest rushed over excitedly. “Dragon King, our harvest this time is very terrifying. After this upgrade, we can directly enter the heaven-splitting primordial land.”<br/><br/>“Yes, with our strength, we will definitely have no problems.”<br/><br/>Wang Xian nodded and looked at an lie who was beside him. “An lie, bring the eight-limbed demon fiend of Tian Chen and the rest to the Shengwen clan. Wipe out the Shengwen clan completely and wipe out their entire lair!”<br/><br/>“It’s the Dragon King!”<br/><br/>An lie and the rest of Tian Chen nodded.<br/><br/>Following that, he informed Prime Minister Gui to send all the treasures here to the Dragon Palace.<br/><br/>The battle slowly came to an end.<br/><br/>“The Water Dragon Palace and the Dragon Palace completely defeated the Fire Dragon Palace of the Devil Dragon Palace. The three dragon palaces were all destroyed!”<br/><br/>“Who would have thought that the Dragon Palace and the Water Dragon Palace would win this battle? It’s said that all the god-like dragons of the Fire Dragon Palace of the Devil Dragon Palace were killed!”<br/><br/>“Hiss, it’s said that the strength of the Dragon Palace is very terrifying, especially the strength of the Dragon King.”<br/><br/>“The Dragon Palace is going to rise up in the future. With the strength of the Dragon Palace now, they can definitely land on the heaven-opening desolate continent!”<br/><br/>“Now that the Water Dragon Palace of the Dragon Palace has killed the Fire Dragon Palace and the red-gold War Dragon of the Demon Dragon Clan, they’ve absorbed a lot of resources. I guess they can be upgraded. Their strength can even be ranked among the top in the surrounding starry sky.”<br/><br/>“The holy prose clan has also been destroyed by the Dragon Palace. The strength of the Dragon Palace is too terrifying!”<br/><br/>All the forces in the surrounding Lu Xingkong were paying attention to the Battle of the Divine Dragon Bloodline.<br/><br/>They were also paying attention to the powerful forces that had landed on the heaven splitting chaotic continent.<br/><br/>After all, the victors of this war would be their opponents in the future.<br/><br/>However, when the results were announced, it still shocked countless people.<br/><br/>Especially when all the Universe Knights of the Devil Dragon Bloodline, Fire Dragon Palace, and holy prose clan were annihilated.<br/><br/>What kind of power could annihilate all these universe knights?<br/><br/>Even though all the powers didn’t know the details of the battle, they were all shocked.\t\t\t\t\t\t</div>", "images": {}, "success": true}