{"id": 282, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072465.html", "title": "Chapter 3273 - 3273 3272", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3273 - 3273 3272</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3273 3272<br/><br/>“Not good, Demon Dragon King. Our Fire Dragon Lord has been dragged into that strange space. Should we take action?”<br/><br/>In the Fire Dragon Palace, the leaders of the Fire Cloud Army and the Dragon Eagle Army saw their former Dragon Lord being dragged into a strange domain. When they saw that the world in front of them seemed to be swallowed by a strange space, their expressions changed drastically.<br/><br/>They immediately asked Devil Dragon King, who was within the wind and Thunder Dragon Palace.<br/><br/>“There’s no need. The moment we make a move, we might be attacked by that strange being, and even a universe knight level 5 will be killed by him.”<br/><br/>Devil Dragon King’s expression changed, and he looked extremely embarrassed.<br/><br/>This battle had made his heart skip a beat.<br/><br/>This battle had made him burn with rage.<br/><br/>The strange existence of the Dragon Palace made him a little scared.<br/><br/>What kind of existence could have such a heaven-defying and strange ability?<br/><br/>“We’ve lost, we’ve lost, we’ve lost completely!”<br/><br/>The Demon Dragon King roared in a low voice and looked up. “No, there’s another possibility. If father can kill the Dragon King, we can still win!”<br/><br/>His expression changed, but he understood in his heart how difficult it was for a divine dragon of the same level to kill the other party. It was simply impossible.<br/><br/>“All the disciples of my Devil Dragon Lineage were killed. I must take revenge, I must take revenge!”<br/><br/>Devil Dragon King roared in a low voice. His dragon eyes were blood-red.<br/><br/>“Get lost!”<br/><br/>At this moment, in the sky, the humongous acquired true treasure skull headed directly toward Wang Xian.<br/><br/>They had lost this battle. Countless disciples had died and thousands of universe knights had died.<br/><br/>Now that his subordinates had returned to the Dragon Palace, there was no need for him to fight anymore.<br/><br/>He wouldn’t be able to defeat the Dragon King even if he continued to fight.<br/><br/>The Dragon King’s terrifying speed made him look extremely embarrassed.<br/><br/>If the other party wanted to escape, he wouldn’t be able to catch up at all.<br/><br/>“HMPH, I will kill you today!”<br/><br/>Wang Xian’s gaze was focused, and his eyes were filled with killing intent.<br/><br/>Boom<br/><br/>An incomparably loud collision sound rang out.<br/><br/>However, at this moment, the Devil Dragon Emperor had already lost his will to fight. He extended his dragon claws and flew directly towards the Devil Dragon’s dark world in the sky.<br/><br/>As long as Wang Xian dodged, he could enter the Devil Dragon’s dark world directly.<br/><br/>“It’s time for a real fight!”<br/><br/>Wang Xian mumbled. This time, he didn’t Dodge. He also stretched out his dragon claws to meet Devil Dragon Emperor’s attacks.<br/><br/>At the same time, at a spot on his dragon body, the simple and unadorned oil lamp was emitting a lustrous glow. Threads of firelight enveloped his body.<br/><br/>However, under the immense energy from his body, the firelight was barely noticeable.<br/><br/>“You’re courting death!”<br/><br/>Seeing that Wang Xian was going to meet him directly, the Demonic Dragon Emperor’s face was filled with viciousness.<br/><br/>“Bang!”<br/><br/>The demonic dragon waved its claws and clawed upwards.<br/><br/>Wang Xian waved his five elements dragon claws to meet it.<br/><br/>“Bang!”<br/><br/>The Dragon Body and the dragon body collided.<br/><br/>One was a dark dragon claw while the other was a dusky dragon claw.<br/><br/>When they collided, a large amount of wounds and fresh blood flowed out from the Demonic Dragon Claw. A terrifying wound appeared on the Dragon Claw.<br/><br/>On Wang Xian’s dragon claw, thick flames enveloped the area and blocked the attack of the Demonic Dragon Claw.<br/><br/>“Roar!”<br/><br/>Wang Xian let out an angry roar. The dragon horn flickered with Yin and yang as he charged directly at the Demonic Dragon Emperor.<br/><br/>“Roar! Roar!”<br/><br/>Devil Dragon Emperor’s eyes were filled with madness as he charged forward as well.<br/><br/>“Bang!”<br/><br/>The collision between the dragon head and the Dragon Head.<br/><br/>Crack! Crack<br/><br/>However, this terrifying collision made the sound of the dragon horn breaking.<br/><br/>A large amount of dragon blood splattered out.<br/><br/>The top of Wang Xian’s head was also enveloped by the glow of flames. He wasn’t injured in the slightest.<br/><br/>“He has a powerful defensive treasure on him!”<br/><br/>After two rounds of physical collision, Devil Dragon Emperor saw that Wang Xian was not injured at all. On the contrary, he was severely injured. He roared with an embarrassed expression.<br/><br/>Boom! Boom! Boom<br/><br/>However, at this moment, faced with Devil Dragon Emperor who was right in front of him, Wang Xian continued to attack with his dragon claws and swept his dragon tail horizontally.<br/><br/>With the advantage of speed and the protection of the ancient oil lamp, Wang Xian was fighting with all his might.<br/><br/>Although the vitality fluid in the oil lamp was depleting rapidly, everything was worth it as long as he could kill Devil Dragon Emperor.<br/><br/>“Damn it!”<br/><br/>“Bang, Bang, Bang!”<br/><br/>After more than ten consecutive collisions, the dragon scales on Devil Dragon Emperor’s body fell off and a large amount of blood spilled out. He hurriedly dodged to the side.<br/><br/>“Dodge? Then I will exhaust you to death with my speed.”<br/><br/>Wang Xian’s eyes were filled with awe when he saw him dodging.<br/><br/>His overall strength was slightly stronger than Devil Dragon Emperor, especially when he had the advantage in speed.<br/><br/>If he continued to exhaust him, Devil Dragon Emperor would definitely die.<br/><br/>“True Dragon Body, Divine Light Dragon!”<br/><br/>He growled in a low voice, and his gray body instantly emitted a dazzling light power.<br/><br/>Light and darkness were completely opposites.<br/><br/>Light illuminated the darkness, and darkness corroded light.<br/><br/>There was no one who could defeat the other. There was only the most intense battle.<br/><br/>After transforming into the body of the light dragon, Wang Xian flapped his primaless saint wings and instantly arrived at the side of Devil Dragon Emperor. He clawed at him with his dragon claws.<br/><br/>Buzz! Buzz! Buzz<br/><br/>Before he could even touch his body, the power of Light and darkness collided.<br/><br/>“What kind of strange ability is this? To think that he can transform himself into a divine dragon with other attributes?”<br/><br/>“Is this a mutated divine dragon?”<br/><br/>When Devil Dragon Emperor saw this scene, his expression turned extremely ugly.<br/><br/>A mutated divine dragon. This was an existence that was even stronger than a purebred divine dragon.<br/><br/>“Bang! Bang! Bang!”<br/><br/>Continuous sounds of attacks were heard. Devil Dragon Emperor’s body was getting more and more miserable.<br/><br/>Wang Xian relied on the defense of the ancient oil lamp and was still uninjured.<br/><br/>Time passed by little by little. The two gigantic divine dragons were engaged in a fierce battle in the starry sky.<br/><br/>The starry sky was dim, and the sun and Moon were dim.<br/><br/>In the surrounding Dragon Palace, all the inferior dragons looked at the battle above them with an abnormally shocked expression.<br/><br/>The battle between the two divine dragons that were tens of thousands of meters long was extremely shocking.<br/><br/>“Oh no, father is at a disadvantage.”<br/><br/>In the Divine Dragon Palace of wind and thunder, the Demon Dragon King saw the battle in the sky. When he saw the injuries on his father’s body, his expression turned ugly.<br/><br/>“Scram, scram, scram!”<br/><br/>However, at this moment, in Little Blue’s Kun Domain, Fire Dragon Emperor’s situation was ten times worse than Devil Dragon Emperor’s.<br/><br/>Sky Array and over a dozen universe knight level five Great Beings were besieging him.<br/><br/>It was especially so for an lie. An Lie’s strange speed was already able to kill a universe knight level six being.<br/><br/>Even though Fire Dragon Emperor was on guard against an lie, under the pressure of sky array and the others, he had suffered over a dozen attacks.<br/><br/>Every time he was attacked, he was injured.<br/><br/>After more than ten attacks, his entire body looked extremely miserable. There were wounds all over his body.<br/><br/>Under the heavy injuries, facing Tian Chen and the others’attacks, it was even harder to resist.<br/><br/>“It’s over. I, the Fire Dragon Lord, am going to die here. Hahaha, I’m going to die in the hands of You Trash!”<br/><br/>Gradually, the Fire Dragon Lord became a little crazy.<br/><br/>He knew that it was impossible for him to escape death!<br/><br/>“I have to think about the day when you are all going to be destroyed when I destroy the other divine dragons.”<br/><br/>When the Water Dragon King and the others saw this, their eyes were filled with coldness and anger.\t\t\t\t\t\t</div>", "images": {}, "success": true}