{"id": 284, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072469.html", "title": "Chapter 3275 - 3275 3274 Victory", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3275 - 3275 3274 Victory</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3275 3274 victory<br/><br/>“However, the real battle has only just begun!”<br/><br/>Wang Xian’s eyes were filled with viciousness. The defense of the ancient lamp had disappeared, but his own battle had only just begun.<br/><br/>If he, who was at his peak, was still unable to kill a seriously injured Devil Dragon Emperor, he would be too incompetent!<br/><br/>“Roar!”<br/><br/>Wang Xian let out a furious roar. His body swayed as he headed straight for the Devil Dragon Emperor.<br/><br/>“The powerful defense on his body has disappeared!”<br/><br/>“Oh no, he wants to fight me to the death!”<br/><br/>Devil Dragon Emperor was delighted when he felt the energy on Wang Xian’s body disappearing.<br/><br/>However, his pupils contracted slightly as he felt his body being entangled. He felt a hint of panic in his heart.<br/><br/>The other party wanted to fight for his life!<br/><br/>The other party was determined to kill him.<br/><br/>“Dragon King, the energy in your body has disappeared. Now, you want to kill me. With my demonic dragon body, even if you can kill me, you might die. You have to know how terrifying the vitality of a divine dragon is!”<br/><br/>The Demonic Dragon Emperor roared sternly.<br/><br/>“Of course I know. I believe in the vitality of my body. hahaha!”<br/><br/>Wang Xian laughed maniacally. His face was filled with arrogance and confidence.<br/><br/>He had the ancestral tree and the powerful branches on it. He did not believe that he, who was at the peak, could not risk his life to kill the Devil Dragon Emperor.<br/><br/>“Roar! Roar! Roar!”<br/><br/>Wang Xian roared maniacally. Streams of energy surged into his body and attacked the dragon-claw dragon-tail dragon sedan.<br/><br/>At the same time, the five elements grinding mill rotated to defend against the skull supreme treasure and the Devil Dragon Pearl.<br/><br/>Following that, an extremely intense battle began!<br/><br/>Large amounts of dragon blood gushed out from his body and his dragon scales began to crumble.<br/><br/>However, Wang Xian was in a miserable state while the demonic dragon emperor was in an even worse state.<br/><br/>“Roar Roar Roar, I’m going to fight it out with you!”<br/><br/>The dragon scales even fell off his body and attacked Wang Xian.<br/><br/>“Hiss!”<br/><br/>From below, all the members of the four great dragon palaces saw the battle between the two divine dragons. When they saw the blood and flesh splattering from the dragon scales, their faces were filled with shock.<br/><br/>“Heal the Dragon King!”<br/><br/>Tian Chen looked over and gave an order to all the members of the Dragon Palace with a low growl.<br/><br/>He waved his arm and immediately began to release the healing formation.<br/><br/>“Heal the Dragon King!”<br/><br/>The Water Dragon King and the rest let out a low growl and immediately released the water attribute law healing technique.<br/><br/>Streams of healing energy surged into Wang Xian’s body.<br/><br/>Even though their level was much lower than Wang Xian’s and the effect was minimal, they were still of some use.<br/><br/>“This is bad, this is bad. We Can’t go on like this. Otherwise, father will die!”<br/><br/>In the Dragon Palace of the wind and Thunder Divine Dragon, the Demon Dragon King roared anxiously.<br/><br/>He was panicking.<br/><br/>In this situation, his father might be killed!<br/><br/>Once his father was killed, he would be finished. With the power of the Dragon Palace, they would be destroyed sooner or later.<br/><br/>“Bang!”<br/><br/>At this moment, he felt a terrifying energy attacking him.<br/><br/>At this moment, he felt the threat of death.<br/><br/>“Not good!”<br/><br/>The Demon Dragon King’s eyes turned red.<br/><br/>“PFFT! PFFT! PFFT!”<br/><br/>But before he could react, the terrifying energy pierced through his head and his life force quickly disappeared.<br/><br/>“Hehe, you didn’t expect this, did you?”<br/><br/>An lie laughed sinisterly. With a wave of his arm, he collected the demon Dragon King’s corpse.<br/><br/>“Not good!”<br/><br/>“How is this possible, how can he enter the Dragon Palace!”<br/><br/>At this time, a terrified voice came from the side.<br/><br/>The leader of the Ghost Dragon and Ghost Dragon widened his eyes and roared in fear.<br/><br/>How was this possible?<br/><br/>The Dragon Palace of the wind and thunder god Dragon was now completely under Devil Dragon Emperor’s control.<br/><br/>Even though the wind and thunder god Dragon’s Dragon Palace wasn’t as powerful as the Fire Dragon Palace’s Devil Dragon Dark World, it was still very difficult for seven or eight universe knights or even a pinnacle being to enter.<br/><br/>However, that strange being directly entered and killed their demon Dragon Emperor.<br/><br/>Terrifying!<br/><br/>Too terrifying!<br/><br/>They instantly felt their scalps go numb and instantly released their defenses to surround them, looking around vigilantly.<br/><br/>“The hunt has begun!”<br/><br/>An lie smiled faintly, the next moment his figure disappeared and appeared within the Red Gold Dragon’s Dragon Palace. Very quickly, another universe knight level 5 sub-dragon was killed.<br/><br/>Following that, the Fire Dragon Palace.<br/><br/>This time, the leader of the Fire Cloud Legion of the Fire Dragon Palace was killed by an lie.<br/><br/>This time, all the members of the three great dragon palaces panicked.<br/><br/>It wasn’t safe in the Dragon Palace?<br/><br/>Where else could they hide?<br/><br/>More importantly, the Dragon Cave of the Dragon Palace was their universe God country. If the universe God country was in the Dragon Palace, where could they escape to?<br/><br/>“Ah Ah Ah Ah!”<br/><br/>Very soon, miserable screams sounded from the three dragon palaces.<br/><br/>The wind thunder god Dragon Palace, Fire Dragon Palace, and Red Gold War Dragon Palace were controlled by Demon Dragon King, Fire Dragon Master, and a level 5 knight of the Red Gold War Dragon.<br/><br/>However, an lie had already caught them off guard and killed them all.<br/><br/>The Dragon Palace had lost its master, so no one could pose a threat to an lie.<br/><br/>What followed was a one-sided massacre.<br/><br/>One by one, Universe Knights died at the hands of an lie. Those below level five of universe knights had no power to resist.<br/><br/>While an lie was hunting, Wang Xian and the Devil Dragon Emperor were still engaged in a fierce battle outside.<br/><br/>At this moment, the Devil Dragon Emperor was in a frenzied state.<br/><br/>Wang Xian was tightly entangled with him. It was impossible for him to escape.<br/><br/>Moreover, he seemed to have given up on escaping.<br/><br/>Devil Dragon Emperor burned his life force and unleashed a terrifying destructive force. He was engaged in a fierce battle with Wang Xian.<br/><br/>As time passed, cracks appeared on Wang Xian’s body and a large amount of blood flowed out.<br/><br/>“Hahaha, if you want to kill me, you will have to pay a terrible price. A terrible price!”<br/><br/>“I will burn all of my life force!”<br/><br/>Devil Dragon Emperor roared crazily.<br/><br/>“Even if you burn all of your life force, I will only be seriously injured!”<br/><br/>Wang Xian smiled sinisterly and continued to fight with him.<br/><br/>Devil Dragon Emperor’s last counterattack was indeed terrifying, but Wang Xian was not afraid at all.<br/><br/>Moreover, with the heaven formation below and the healing of the entire Dragon Palace, his injuries were still bearable.<br/><br/>Even if Devil Dragon Emperor burned all of his life force, he would at most be severely injured.<br/><br/>“Roar!”<br/><br/>Devil Dragon Emperor’s violent voice rang out.<br/><br/>“Roar!”<br/><br/>Wang Xian also let out a low roar. His eyes were filled with madness.<br/><br/>As time passed, the life force in Devil Dragon Emperor’s body was diminishing bit by bit.<br/><br/>One hour, two hours, three hours…<br/><br/>“Dragon King, I won’t let you off. Just you wait, I won’t let you off!”<br/><br/>Ten hours later, the demon Dragon Emperor let out an angry roar with his last bit of life force.<br/><br/>“Hehe!”<br/><br/>Wang Xian felt his severely injured body and his eyes sparkled.\t\t\t\t\t\t</div>", "images": {}, "success": true}