{"id": 287, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072475.html", "title": "Chapter 3278 - 3278 Under The Terrifying Harvest Of 3277", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3278 - 3278 Under The Terrifying Harvest Of 3277</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3278 Under the terrifying harvest of 3277<br/><br/>“Dragon King, gather all the resources.”<br/><br/>“The sky array dark intense eight Qi has destroyed the holy prose clan. A large number of Cosmos God kingdoms and treasures have been gathered.”<br/><br/>On the fifth day after the battle ended, Prime Minister Gui came to the Dragon King Hall to report.<br/><br/>“How are the treasures being handled?”<br/><br/>Wang Xian sat on the Dragon Throne and asked with a smile.<br/><br/>“Dragon King, all of them have been placed in the treasury of the Dragon Palace. The other half of the corpses have already turned into dragon blood and filled up the entire dragon transformation pool. Some divine herbs and divine trees have been planted in the herb garden.”<br/><br/>“The other few thousand divine kingdoms are also around the Dragon Palace.”<br/><br/>Prime Minister Gui’s face was flashing with excitement.<br/><br/>The Dragon Palace had obtained too much this time.<br/><br/>All the treasures of the demonic dragon lineage, the Fire Dragon Palace, the wind and thunder divine dragon lineage, and the red gold war dragon lineage had been obtained by the Dragon Palace.<br/><br/>There were also all the treasures of the holy prose clan.<br/><br/>These were the four great divine dragon lineages, a powerful intermediate race.<br/><br/>Their billions of years of accumulation was too huge for the Dragon Palace.<br/><br/>Just the universe God countries and Dragon Caves obtained by the Dragon Palace could allow 7,000 to 8,000 devouring dragons to reach the Universe Knight Realm.<br/><br/>Furthermore, these were not ordinary universe knights.<br/><br/>As for how much ao crab and the others could improve after devouring the wind and thunder god Dragon Palace and the Red Gold War Dragon Palace, Wang Xian did not dare to imagine.<br/><br/>“I’ll go and take a look!”<br/><br/>He said to Prime Minister Gui before appearing in the Treasury of the Dragon Palace at the next moment.<br/><br/>At this moment, a large number of treasures were piled up in the treasury.<br/><br/>There were all sorts of divine weapons, spiritual treasures, and all sorts of powerful offensive tools.<br/><br/>There were also some very strange things.<br/><br/>The number of various items in the entire treasury was hundreds of thousands of years old. Every single one of them was not lower than a seventh level void God Emperor.<br/><br/>The number of acquired Numinous Treasures had reached more than 100.<br/><br/>Wang Xian’s face was filled with a smile. The next moment, he appeared in the medicinal garden of the Dragon Palace.<br/><br/>In the herb garden, there were all kinds of divine herbs and divine trees planted.<br/><br/>With a glance, there were more than 10,000 of them at the level of a universe knight.<br/><br/>Some of the divine herbs and divine trees had already matured, while some had yet to mature.<br/><br/>Around the Dragon Palace, there were the divine kingdoms of universe knights that were filled with immense power. Each of the divine kingdoms was exuding a mighty aura.<br/><br/>These god countries were built by a universe knight at a huge cost.<br/><br/>Apart from these God countries, there were four huge dragon palaces.<br/><br/>At this moment, a million swallowing dragons were swallowing the god countries in the Dragon Caves of the four dragon palaces.<br/><br/>The number of God countries in the four dragon palaces reached 40 million to 50 million.<br/><br/>The number of void God emperors also reached more than 10 million.<br/><br/>Compared to the number of divine kingdoms, the number of devouring dragons was much smaller.<br/><br/>This time, ao crab was prepared to breed another one million devouring dragons.<br/><br/>“Gather all the disciples of the Dragon Palace and begin the overall improvement.”<br/><br/>Wang Xian returned to the Dragon King Palace and instructed Prime Minister Gui.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui immediately gave the order.<br/><br/>“The resources this time are enough for me to improve again.”<br/><br/>Wang Xian watched Prime Minister Gui leave. With a wave of his arm, a large number of treasures appeared in the main hall.<br/><br/>The Four Great Divine Dragons had all obtained the fortune of powerful divine dragons. They had more treasures than the holy prose clan.<br/><br/>The treasures of the five middle-level races in the universe were all gathered here. It was enough for Wang Xian to improve his strength.<br/><br/>He did not make a breakthrough immediately. Instead, he gathered all the powerful treasures together<br/><br/>There were 132 acquired Numinous Treasures, 21 acquired Supreme Treasures, and the ancient Devil Pool which was at the level of an innate numinous treasure. It was comparable to the wings of an angel which was an innate numinous treasure.<br/><br/>When these treasures were gathered together, they emitted a mighty aura.<br/><br/>Wang Xian moved his palm and the five elements millstone appeared in his hand.<br/><br/>“There’s no need to devour the acquired Numinous Treasure, the Five Elements Millstone. I can make the thirteen acquired supreme treasures with five elements devour them.”<br/><br/>Wang Xian mumbled as he looked at the ancient demon pool and the wings of the angels.<br/><br/>These two treasures were too powerful. It would be best if they could be converted into combat strength.<br/><br/>“I still have two clones with the light and darkness attributes. I have been cultivating in seclusion. After my yin-yang Dragon Disk was condensed, I am getting weaker and weaker.”<br/><br/>“Can I create a yin-yang dragon disk with the light and darkness attributes?”<br/><br/>“Just like the five elements millstone, I will use the light and darkness attributes as the foundation.”<br/><br/>Wang Xian was guessing.<br/><br/>However, the five elements millstone had grown step by step. It would be very difficult to fuse an existence like the ancient magic pool and the wings of angels into one.<br/><br/>“I do have the heart of Light and darkness. I can give it a try.”<br/><br/>He pondered in his heart and placed this plan aside for the time being.<br/><br/>Following that, he waved his arm and a few corpses filled with pressure appeared at the side.<br/><br/>The corpses of the three divine dragons were the Fire Dragon Lord, the Devil Dragon King, and the Devil Dragon Emperor.<br/><br/>Back then, Wang Xian had used the dragon soul of the Tianhai Dragon King and the dragon bone of the Golden Dragon to give birth to an existence like Ao Jin.<br/><br/>Could he use the corpses of the Fire Dragon Lord, the Devil Dragon Emperor, and the Devil Dragon King to create the fire dragon and the Devil Dragon from the souls of the members of the Dragon Palace who had died in battle?<br/><br/>He thought about it and looked at the soul-returning branches on the ancestral tree.<br/><br/>There were many souls on the soul-returning branches.<br/><br/>Although the Dragon Palace won this battle, it didn’t mean that there were no casualties.<br/><br/>Out of the 4,000 universe knights who participated in the exhibition, around 500 died.<br/><br/>Not many, but not few either.<br/><br/>Among them, there were many universe knights at level four.<br/><br/>“I can give it a try.”<br/><br/>As Wang Xian spoke, he moved and brought the souls of three level 4 universe knights and disciples of the Dragon Palace to the dragon transformation pool.<br/><br/>At this moment, the dragon blood had already filled up the dragon transformation pool.<br/><br/>In the dragon transformation pool, the first batch of 500,000 disciples of the Dragon Palace were absorbing the energy rapidly.<br/><br/>Wang Xian waved his arm and threw the corpses of the demon Dragon Emperor, the Demon Dragon King, and the Fire Dragon Lord into the dragon transformation pool.<br/><br/>At the same time, he threw the three souls over.<br/><br/>He used the power of the dragon transformation pool to heal the Three Corpses of the divine dragons so that their souls could be completely fused with them.<br/><br/>“It should be successful.”<br/><br/>Wang Xian said. At least according to his guess, the success rate was 80% .<br/><br/>“Prime Minister Gui, keep an eye on it!”<br/><br/>Wang Xian told Prime Minister Gui to keep an eye on the situation.<br/><br/>Then, he moved and returned to the Dragon Palace.<br/><br/>“It’s time to upgrade.”<br/><br/>Looking at the large number of treasures in front of him, as well as the various divine pills and ripe divine herbs and divine fruits in his mother nest, a smile appeared on his face.<br/><br/>After this upgrade, he would have the combat strength of A Level 8 universe knight.<br/><br/>With such strength, he would be invincible in the encirclement of Lu Xing Kong.<br/><br/>And only the high-level races in the universe would have such strength.<br/><br/>After this upgrade, the Dragon Palace would also have the strength of a high-level race in the universe.\t\t\t\t\t\t</div>", "images": {}, "success": true}