{"id": 281, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072463.html", "title": "Chapter 3272 - 3272 3,271", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3272 - 3272 3,271</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3272 3,271<br/><br/>“Kill, Kill, Kill!”<br/><br/>The Great Beings of the Devil Dragon Bloodline, Fire Dragon Palace, and Red Gold Battle Dragon let out furious roars. They condensed their laws into a powerful defense.<br/><br/>At this time, they could only retreat to the back of the Dragon Palace if they could defend against the attacks of the weak knights.<br/><br/>Otherwise, with their strength, they would be killed before they could retreat.<br/><br/>Now that all the god Emperor level disciples had died, they couldn’t afford to lose more. Otherwise, the entire devil dragon lineage would be finished.<br/><br/>Many universe knights and above were defending.<br/><br/>And an lie was hunting while they were defending.<br/><br/>“The other universe knights can let the people of the three dragon palaces go, but we definitely can’t let Fire Dragon Master Go in.”<br/><br/>An lie scanned his surroundings and transmitted his voice to the Knights from the Dragon Palace and the Water Dragon Palace.<br/><br/>The Dragon Palace could prevent others from entering. Even Wang Xian could not enter the Dragon Palace.<br/><br/>However, an lie was different. He could enter the Dragon Palace easily.<br/><br/>However, if the Fire Dragon Master entered the Fire Dragon Palace, with the Fire Dragon Master’s control over the Dragon Palace, an lie would not be able to kill him.<br/><br/>He could even use the power of the palace to kill him.<br/><br/>Hence, he could not let fire dragon master enter his palace.<br/><br/>As for the rest, an lie did not care. Even if Devil Dragon King entered the dark world, he could still kill him with his strange methods.<br/><br/>After all, he was only a level five knight.<br/><br/>“OK!”<br/><br/>Ao qitian, Mu Zesen, and the others heard an Lie’s words and understood what he meant.<br/><br/>“Attack Fire Dragon Master!”<br/><br/>The next moment, they gave up on all the knights in front of them and charged towards fire dragon master.<br/><br/>Right now, the sky array was fighting fire dragon master.<br/><br/>In the Dragon Palace, there were only nine knights with level 5 strength. This time, only seven came.<br/><br/>Ao Jin and Lei Ming didn’t come.<br/><br/>Little Blue had the power of a universe Knight Level 5. Together with AO qitian, Ao Qi, Ao Tu, and the other leaders of the Dragon Palace, they attacked Fire Dragon Master.<br/><br/>“HM?”<br/><br/>“Attack Fire Dragon Master!”<br/><br/>Water Dragon King and the others narrowed their eyes and attacked the opponent in front of them.<br/><br/>“HM?”<br/><br/>Devil Dragon King was also stunned.<br/><br/>“PFFT!”<br/><br/>At this moment, a terrifying energy attacked him.<br/><br/>The Demon Dragon King’s body trembled, and black bricks appeared around him, enveloping his entire body.<br/><br/>“Bang!”<br/><br/>Even so, a terrifying energy landed on his dragon head, causing him to spit out large mouthfuls of blood.<br/><br/>“What a strange fellow, what a terrifying attack!”<br/><br/>The Demon Dragon King’s eyes revealed a look of fear.<br/><br/>If it wasn’t for the acquired Supreme Treasure protecting his body, this attack would have taken half of his life.<br/><br/>Even so, he was still heavily injured.<br/><br/>“Damn it, run!”<br/><br/>The Demon Dragon King’s expression was extremely ugly as he hurriedly ran back.<br/><br/>The Water Dragon King was no longer attacking him. At this time, survival was more important.<br/><br/>Otherwise, even if that strange guy attacked him a few times, he didn’t dare to guarantee that he would be able to withstand it.<br/><br/>“Retreat, Retreat, Retreat!”<br/><br/>He roared and fled toward wind and thunder god Dragon Palace.<br/><br/>“Retreat!”<br/><br/>The Great Beings of the Devil Dragon bloodline were delighted when they saw that water dragon palace and Dragon Palace weren’t attacking them, and they hurriedly fled.<br/><br/>“Damn it!”<br/><br/>However, at this moment, Fire Dragon Master’s expression changed drastically when he saw the situation.<br/><br/>In an instant, 14 universe knights and level five Great Beings attacked him.<br/><br/>There were dozens of universe knight level four great beings attacking him from a distance.<br/><br/>Although they couldn’t cause him much harm, he couldn’t ignore them completely.<br/><br/>Plus the array master from Dragon Palace, he was suppressed in an instant.<br/><br/>After all, they were the elites of Water Dragon Palace and Dragon Palace, and there were two pure-blooded godly dragons, water dragon emperor and Water Dragon Queen.<br/><br/>Each of them had two true treasures.<br/><br/>“Fire Dragon Emperor!”<br/><br/>The leader of Fire Cloud Army and Dragon Eagle Army was shocked when they saw fire dragon emperor being attacked.<br/><br/>“Retreat! All of you, Retreat! Fire Dragon Emperor, hold on for a few seconds and then retreat!”<br/><br/>Devil Dragon Emperor looked around and ordered loudly.<br/><br/>At this time, as long as Fire Dragon Emperor could hold on for seven or eight seconds, the rest of the universe knights would be able to retreat into Dragon Palace.<br/><br/>“Retreat!”<br/><br/>The expressions of the Warriors of Fire Dragon Palace changed, they gritted their teeth and retreated into the palace.<br/><br/>Even the leader of Fire Cloud Dragon Eagle flew back.<br/><br/>At this time, there was nothing they could do.<br/><br/>If they stayed here for another second, they might be hunted by that strange being.<br/><br/>They were afraid too.<br/><br/>Furthermore, Devil Dragon Emperor had given the order, they had no choice but to follow.<br/><br/>“Damn it!”<br/><br/>Fire Dragon Master saw everyone from the three Dragon Palace retreat, and his face was extremely ugly. He roared furiously.<br/><br/>A Flame Pagoda above his head immediately released a terrifying fire meteorite.<br/><br/>“Surround and kill him, we must kill him!”<br/><br/>The sky array roared, and one formation after another attacked the acquired Supreme Treasure.<br/><br/>“Kill, Kill, Kill!”<br/><br/>Water Dragon King and the others also shouted and used the acquired true treasure to unleash their strongest attacks.<br/><br/>“Okay, as long as we kill Fire Dragon Master and Dragon King kills Devil Dragon Emperor, everything will be easy.”<br/><br/>An Lie’s eyes were shining with a cold light as he locked his eyes on Fire Dragon Master.<br/><br/>Buzz<br/><br/>In the next moment, he appeared on fire dragon master’s tail.<br/><br/>“Boom!”<br/><br/>A terrifying attack landed on the fire dragon Lord’s tail, and blood splattered everywhere.<br/><br/>“Roar! Roar! Roar!”<br/><br/>“You Damned Flea, get lost!”<br/><br/>The Fire Dragon Lord was in pain. He roared and swept his tail across.<br/><br/>“Attack!”<br/><br/>Ao Qitian, Mou Zesen, AO xingmu, and the others immediately attacked.<br/><br/>Terrifying attacks covered him.<br/><br/>“SH * t!”<br/><br/>The Fire Dragon Lord’s expression changed drastically at the sight of these terrifying attacks.<br/><br/>Even the array formation master of the Dragon Palace and the experts like the Water Dragon King were not afraid at all. The Fire Dragon Lord had a strong confidence that he could escape.<br/><br/>However, with the existence of that Strange Fellow, he had to protect his entire body at all times to prevent himself from being attacked.<br/><br/>This put him in a completely passive situation. It was even very difficult for him to escape.<br/><br/>“If I keep fighting, I might die here.”<br/><br/>The Fire Dragon Lord’s expression changed dramatically. Terrifying Flames burned on his body as he retreated.<br/><br/>“Wu Wu Wu!”<br/><br/>At this moment, Little Blue’s voice sounded, and a strange space invaded the entire starry sky.<br/><br/>“What?”<br/><br/>The Fire Dragon Lord’s expression changed when he saw that he had suddenly entered a strange space.<br/><br/>“Kill!”<br/><br/>The sky array, the experts of the Dragon Palace, the Water Dragon King, and the others attacked again.<br/><br/>An Lie’s figure flickered as he waited for an opportunity to move.\t\t\t\t\t\t</div>", "images": {}, "success": true}