{"id": 283, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072467.html", "title": "Chapter 3274 - 3274 Three Thousand, Two Hundred And Seventy-Three Godly Dragons Had Fallen", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3274 - 3274 Three Thousand, Two Hundred And Seventy-Three Godly Dragons Had Fallen</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3274 Three thousand, two hundred and seventy-three godly dragons had fallen<br/><br/>“Hong! Hong! Hong!”<br/><br/>“I can’t accept this. I’m a pure-bred godly dragon. To be able to stand at the top of the universe, that cowardly Devil Dragon King actually didn’t make a move to save me!”<br/><br/>Within Kun region, Fire Dragon Master roared somewhat crazily.<br/><br/>His body was covered with many tragic wounds, and each wound was deep into his bone marrow.<br/><br/>Right now, his combat strength was less than 50% of his peak.<br/><br/>Facing the terrifying attacks, he had no way to resist.<br/><br/>Despair!<br/><br/>Death was waiting for him!<br/><br/>His eyes were filled with fury.<br/><br/>If the Demon Dragon King and the others were willing to attack him, he still had a chance of survival.<br/><br/>But now, everything was over.<br/><br/>“Die!”<br/><br/>An Lie’s figure flashed and appeared behind the Fire Dragon Lord’s head. A terrifying energy heavily struck his head.<br/><br/>“Boom!”<br/><br/>A muffled explosion sounded. The Fire Dragon Lord opened his eyes wide, and large amounts of blood flowed out.<br/><br/>His dragon head shook twice, and his body slowly fell downwards.<br/><br/>Tian Chen and the others in the surroundings saw it, and their eyes flashed with a cold expression.<br/><br/>“Wu Wu!”<br/><br/>Xiao Lan let out a low roar, and the Kun domain disappeared.<br/><br/>When the void of the dark space disappeared, this piece of starry sky once again appeared in front of everyone.<br/><br/>“What!”<br/><br/>“Fire Dragon Master was killed!”<br/><br/>“This… Fire Dragon Master died!”<br/><br/>The Great Beings of water dragon palace were shocked when they saw fire dragon master’s body floating in the sky.<br/><br/>“Roar, good kill, good kill, they want to kill us!”<br/><br/>Some of the Great Beings of Water Dragon Palace roared excitedly.<br/><br/>“Damn it, what a waste, waste, a universe Knight Level 6 power, he was killed by the Dragon Palace and Water Dragon Palace in such a short time!”<br/><br/>Devil Dragon Emperor saw this scene and his face was extremely ugly, he couldn’t help but roar.<br/><br/>However, the death of a universe Knight Level 6 pure-blooded dragon shocked him.<br/><br/>Fire Dragon Emperor was much stronger than him.<br/><br/>Sou<br/><br/>The sky array moved and put away fire dragon emperor’s body and his true treasures.<br/><br/>Peng! Peng! Peng<br/><br/>At this time, there was a loud crash in the sky.<br/><br/>Everyone looked over, their eyes shining with shock.<br/><br/>Compared to the battle between Fire Dragon Emperor and the others, the battle between Devil Dragon Emperor and Dragon Emperor was even more terrifying.<br/><br/>“Not good, our Devil Dragon Emperor has been completely suppressed. Our Devil Dragon Emperor is injured!”<br/><br/>In the three dragon palaces, the faces of the experts from the devil dragon lineage darkened when they saw this scene.<br/><br/>At this moment, there were many wounds on the Devil Dragon Emperor’s body, and large amounts of blood flowed out.<br/><br/>He was completely suppressed and beaten.<br/><br/>The Fire Dragon Lord had just been killed, so their Devil Dragon Emperor wouldn’t be…<br/><br/>They didn’t dare to imagine it.<br/><br/>If something happened to the Devil Dragon Emperor, then they would be completely finished.<br/><br/>“It’s impossible for a divine dragon of the same level to kill his opponent, even if the Dragon King has a powerful defensive treasure. It’s impossible, completely impossible!”<br/><br/>The Devil Dragon King shook his head and roared.<br/><br/>He firmly believed that his father would never be killed by the Dragon King.<br/><br/>At this moment, everyone in the four dragon palaces raised their heads and looked up at the sky.<br/><br/>“Hehe, do these guys think that I can’t kill you after entering the Dragon Palace?”<br/><br/>An lie glanced around and saw that all the divine dragons were staring at the battle in the sky. His eyes sparkled.<br/><br/>He looked at the Demon Dragon King and disappeared in an instant.<br/><br/>“Damn it! I Can’t fight with him anymore. I have to go back to the Dark World of Devil Dragon. Otherwise, I might be exhausted to death!”<br/><br/>“That defensive true treasure on his body is too powerful!”<br/><br/>Devil Dragon Emperor growled in a low voice.<br/><br/>“Let’s fight it out. Even if my injuries are more serious, I have to go back to the Dark World of Devil Dragon!”<br/><br/>He growled with blood-red eyes and stared at the sky.<br/><br/>“Roar! Roar! Roar!”<br/><br/>He let out a wild roar. The skeletons and the demon dragon pearl surrounded him. The dark laws on his body condensed into demonic flames.<br/><br/>“Law projection, Demon Dragon Destruction!”<br/><br/>Demon Dragon Emperor let out a wild roar and flew directly in the direction of the dark world of the Demon Dragon.<br/><br/>The streaks of demonic flames condensed into the virtual image of the demon dragon, burning and corroding the entire void.<br/><br/>“It’s time to go all out!”<br/><br/>Wang Xian saw the violent energy on the Devil Dragon Emperor’s body and stared at his dragon eyes.<br/><br/>“Then let’s Fight!”<br/><br/>He sensed the life force fluid in the ancient lamp. There was not much life force fluid left.<br/><br/>However, he was still in his peak condition.<br/><br/>“Kill!”<br/><br/>Wang Xian roared.<br/><br/>“Law form: eight-sided Dragon Pillar!”<br/><br/>“Roar!”<br/><br/>The eight-sided dragon pillars was Wang Xian’s strongest attack. It was also the first law form of the nine transformations of the divine dragon when he stepped into the realm of a universe knight.<br/><br/>“Boom! Boom! Boom!”<br/><br/>The moment the law form was unleashed, dragon pillars appeared in all directions.<br/><br/>As he was in the state of the Divine Light Dragon, each dragon pillar had a divine light dragon coiled around it.<br/><br/>Eight Dragon Pillars and eight divine light dragons sealed off all directions.<br/><br/>“Roar Roar Roar!”<br/><br/>The eight divine dragons roared, their gazes locked onto the attacking Devil Dragon Emperor as they charged forward.<br/><br/>“Kill Kill Kill!”<br/><br/>Devil Dragon Emperor felt the terrifying energy on the eight dragon pillars, he gritted his teeth and continued charging forward.<br/><br/>Light and darkness collided.<br/><br/>Buzz<br/><br/>The next moment, it was as if the entire void was engulfed. A terrifying energy vortex formed at the center of the collision.<br/><br/>In the Energy Vortex, Devil Dragon Emperor’s body appeared and continued to charge towards the sky.<br/><br/>Wang Xian also swayed his huge body and charged forward.<br/><br/>Bang Bang Bang<br/><br/>There was another violent collision. Wang Xian waved his dragon claws and clawed at Devil Dragon Emperor.<br/><br/>Devil Dragon Emperor also extended his Dragon Claw and met the attack head-on.<br/><br/>“Bang, Bang, Bang!”<br/><br/>It was another physical confrontation. This time, Devil Dragon Emperor was even fiercer. He did not care about the injuries on his body.<br/><br/>Wang Xian did not have any scruples either. His Dragon Claw and Dragon Tail attacked one after another.<br/><br/>In an instant, fresh blood splattered everywhere. A large number of dragon scales fell down.<br/><br/>The entire battle was unusually intense.<br/><br/>The vitality fluid in the ancient lamp on Wang Xian’s body was depleting rapidly. Soon, it was completely depleted.<br/><br/>This time around, Wang Xian had brought all the vitality fluid with him. Once it was completely depleted, the defense of the ancient lamp would disappear completely.<br/><br/>“Scram, scram, scram, scram!”<br/><br/>However, this incomparably intense battle caused Devil Dragon Emperor to be a little terrified.<br/><br/>The injuries on his body were getting more and more serious.<br/><br/>Even though he possessed the body of a divine dragon and had a strong recovery ability, his entire body was stained with blood under this collision.<br/><br/>A pair of dragon horns were completely broken, and a large number of cracks appeared on the dragon head.<br/><br/>As for his body, almost half of his dragon scales had fallen off.<br/><br/>Now that he had one life, it was possible that he only had half of it left.<br/><br/>“I’ve used up all the vitality fluid!”<br/><br/>However, at this moment, Wang Xian also sensed that the vitality fluid had completely disappeared. The fire shield defense on his body had also completely disappeared.\t\t\t\t\t\t</div>", "images": {}, "success": true}