{"id": 289, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072479.html", "title": "Chapter 3280 - 3280 3279 Dragon Palace’S Strength", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3280 - 3280 3279 Dragon Palace’S Strength</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3280 3279 Dragon Palace’s strength<br/><br/>Time passed day by day.<br/><br/>A month passed quickly after the Dragon Palace and Water Dragon Palace won the Battle of the Divine Dragon Clan.<br/><br/>During this month, the outer area of the starry sky was much quieter.<br/><br/>However, something big was happening in the inner area of the starry sky and at the edge of the Heaven Opening Primeval Continent.<br/><br/>Some forces were preparing for the War of landing.<br/><br/>The war on land was a race war, and it was at least a mid-level race war.<br/><br/>The war on land happened every few decades to a hundred years, and the frequency was very high.<br/><br/>After all, every war had tens of millions of experts participating in it, and there were even billions of them.<br/><br/>The Dragon Palace didn’t pay too much attention to what was happening on the land.<br/><br/>During this month, the Dragon Palace didn’t have any contact with the outside world. They were all improving.<br/><br/>“I can’t absorb the ancient demon pool. The wings of angels are soulless items. Although they are comparable to acquired treasures, they can still be absorbed. The ancient demon pool is different now. It’s a little difficult to absorb it.”<br/><br/>“However, this is not bad. The defensive power of the Yin-yang dragon plate is terrifying enough now.”<br/><br/>In the Dragon King Palace in the Dragon Palace, Wang Xian looked at the two treasures floating in the sky and smiled.<br/><br/>After absorbing more than a dozen acquired true treasures, the five elements grinding had reached the level of a universe knight level eight.<br/><br/>With the circulation of the five elements, killing a universe knight level eight was not a big problem.<br/><br/>As for the Tai Chi Dragon Disk, after absorbing the power of light, it had improved even more terrifyingly. Its defensive power could withstand the attacks of a universe knight level nine.<br/><br/>This was a level 9 universe knight. In other words, A Level 9 universe knight wouldn’t be able to do anything to him.<br/><br/>Under the Yin-yang circulation of the Tai Chi Dragon Disc, his defense was abnormally terrifying.<br/><br/>Wang Xian moved his palm and the five elements Millstone entered his body. The Tai Chi Dragon disc revolved around him and gradually became illusory.<br/><br/>The Five Elements Millstone attacked while the tai chi dragon disc defended.<br/><br/>It was very easy for him to kill a level eight universe knight.<br/><br/>However, it was difficult for him to defeat a level nine universe knight. After all, his attack power was not strong enough.<br/><br/>This oil lamp could be seen from the previous battle with Devil Dragon Emperor.<br/><br/>If not for the ancient oil lamp, it would be impossible for Wang Xian to win.<br/><br/>However, the oil lamp required energy to be activated, and it consumed a lot of energy.<br/><br/>Unless it was a life-saving or life-or-death battle, there was no need to use it.<br/><br/>“The consumption of the oil lamp is too great. However, I didn’t expect the dragon blood to be used as oil for the lamp.”<br/><br/>Wang Xian mumbled. He put a lot of dragon blood into the oil lamp and stored it in his body.<br/><br/>These were his three strongest treasures at the moment.<br/><br/>“Dragon King, other than ao crab and the others, the rest of the members of the Dragon Palace have completed their advancement.”<br/><br/>At this moment, Prime Minister Gui walked in and reported respectfully.<br/><br/>“Oh, is that so? Tell them to gather in the Dragon Field!”<br/><br/>Wang Xian squinted his eyes slightly and said immediately.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui replied immediately.<br/><br/>“Sou!”<br/><br/>Soon, Wang Xian’s figure moved and arrived at the Dragon Field.<br/><br/>The million members of the Dragon Palace had gathered there. Even some of the logistics personnel had also gathered there.<br/><br/>As his gaze swept across, his eyes sparkled.<br/><br/>“Greetings, Dragon King!”<br/><br/>All the members of the Dragon Palace bowed respectfully.<br/><br/>“Dragon King, currently, there are 40,000 universe knights in the Dragon Palace. The rest of the disciples have the weakest level eight void God emperor combat strength.”<br/><br/>Prime Minister Gui stepped forward and reported.<br/><br/>“In addition, Ao he and his group of Devouring Dragons have 20,000 universe knights and the weakest level six void God Emperor Combat Strength!”<br/><br/>He continued to add.<br/><br/>“Very good!”<br/><br/>Wang Xian squinted his eyes slightly. The harvest this time was not just the corpses of the 10,000-plus universe knights. After all, there were more than 10 million ya long corpses!<br/><br/>There were only a million members in the Dragon Palace. The million members absorbed the energy of the tens of millions of elite warriors from the three great dragon palaces, giving birth to a large number of strong warriors in the Dragon Palace.<br/><br/>Among them, many of the universe knights with first-level combat strength were piled up from the void God emperor level ya long corpses.<br/><br/>As for the devouring dragons, ao crab and the rest were still in the Red Gold War Dragon Palace and the wind and thunder god Dragon Palace devouring them.<br/><br/>This was definitely a feast for the devouring dragons. Even though ao crab had given birth to millions of devouring dragons, the strength of all the devouring dragons was still at least a level six universe knight.<br/><br/>As for how much ao crab could improve, Wang Xian didn’t dare to guess yet.<br/><br/>But it shouldn’t be weaker than him.<br/><br/>In the Dragon Palace, there were more than 60,000 universe knight-level fighters. Excluding ao crab, a few of his subordinates, and Wang Xian himself, the strongest one was ao Mo. .<br/><br/>He was a member of the Dragon Palace who had resurrected with the help of the corpse of Devil Dragon Emperor.<br/><br/>The corpses of the three purebred divine dragons had already revived the members of the Dragon Palace.<br/><br/>Other than Ao Mo, there were four universe knights, Level 6 sky array, Ba Qi, Xiao Lan, and Ao Huo.<br/><br/>As for the other leaders of the Dragon Palace, the group of purebred divine dragons all had the combat strength of Level 5 universe knights.<br/><br/>There were still too few top-notch members in the Dragon Palace. In fact, there were even some gaps.<br/><br/>“All members must not slack off. Very soon, our Dragon Palace will head to the heaven-splitting chaotic land. That is the center of the universe and the real battlefield.”<br/><br/>Wang Xian reminded.<br/><br/>After the upgrade of the Dragon Palace this time, they had the ability to step into the heaven-splitting chaotic land.<br/><br/>The heaven-splitting chaotic land was known as a Holy Land by all the races in the universe.<br/><br/>If the Dragon Palace wanted to continue the upgrade, they had to step into the heaven-splitting chaotic land.<br/><br/>“It’s the Dragon King!”<br/><br/>All the members of the Dragon Palace replied immediately.<br/><br/>“Okay!”<br/><br/>Wang Xian nodded his head and looked at Prime Minister Gui. “Send someone to investigate the situation in the heaven-splitting chaotic land. We have to prepare for the landing in advance.”<br/><br/>“Yes!”<br/><br/>Prime Minister Gui replied immediately.<br/><br/>“Familiarize yourselves with your abilities. Train well from now on.”<br/><br/>“Lei Ming, come here for a moment!”<br/><br/>Wang Xian instructed and arrived at the Dragon King’s Hall.<br/><br/>Lei Ming flew towards the Dragon King’s Hall immediately.<br/><br/>“Dragon King!”<br/><br/>Lei Ming came to the Dragon King’s Hall and greeted respectfully.<br/><br/>“Regarding the remaining 27 Lei Yu, do you know where they are?”<br/><br/>Wang Xian asked directly.<br/><br/>Lei Yu was a part of the uninitiated holy wings on his back.<br/><br/>Now that he had gathered all the wind-attribute wings, there were still 27 lightning-attribute wings left.<br/><br/>To Wang Xian, the five uninitiated holy wings were very powerful. If he could find the remaining 27 wings, he would be able to control nine attributes.<br/><br/>Lei Ming also knew about the remaining Lei Yu. He had once told him that he was in the hands of an expert from the heaven-splitting chaotic land.<br/><br/>“Reporting to the Dragon King, the remaining Lei Yu is in the hands of the first elder of the high-level lightning ray race. He was the one who took away my lei Yu.”<br/><br/>Lei Ming immediately reported.\t\t\t\t\t\t</div>", "images": {}, "success": true}