{"id": 292, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072485.html", "title": "Chapter 3283 - 3283 3282, The Arrogant God, The Mighty Ancient Sea", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3283 - 3283 3282, The Arrogant God, The Mighty Ancient Sea</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3283 3282, the arrogant God, the mighty ancient sea<br/><br/>“Auction off acquired Numinous Treasures!”<br/><br/>Wang Xian looked at the middle-aged man and said directly.<br/><br/>The ancient sea race had quite a good reputation in the AI of the universe.<br/><br/>He was prepared to sell off some acquired Numinous Treasures.<br/><br/>This time, he had obtained more than 100 acquired Numinous Treasures. Even the members of the Dragon Palace would not be able to use them for 20 to 30 years.<br/><br/>Among them, there were a few acquired Numinous Treasures with metal attributes, water attributes, and light attributes.<br/><br/>However, he couldn’t auction off all the acquired spiritual treasures.<br/><br/>It wasn’t that he couldn’t sell them, but acquired spiritual treasures were powerful treasures for universe knights.<br/><br/>Even one acquired spiritual treasure could make hundreds of universe knights fight for it.<br/><br/>After all, the Dragon Palace had acquired more than 100 acquired spiritual treasures, which was the accumulation of the Devil Dragon Bloodline, Fire Dragon Palace, Red Gold War Dragon, wind and thunder god Dragon Bloodline, and holy prose clan.<br/><br/>Out of the four powerful races, there were only 132 acquired Numinous Treasures among the nearly 20,000 universe knights. This ratio was very, very small.<br/><br/>One could imagine how precious acquired Numinous Treasures were.<br/><br/>And this was only for existences like the divine dragon lineage who had great opportunities.<br/><br/>For other races, acquired numinous treasures were even rarer.<br/><br/>“Oh? Acquired Numinous Treasures?”<br/><br/>The middle-aged man was slightly shocked when he heard Wang Xian’s words. A respectful expression appeared on his face. “Sir, please wait a moment. I will invite our supervisor over now.”<br/><br/>“Sir, please come this way First!”<br/><br/>As he spoke, he brought Wang Xian to a place and sat down.<br/><br/>Wang Xian nodded his head.<br/><br/>“Is this customer here to bid for the acquired Numinous Treasure?”<br/><br/>Very soon, an elder who was at the level of a universe knight walked over and confirmed to Wang Xian.<br/><br/>“That’s right. Five acquired Numinous Treasures!”<br/><br/>Wang Xian did not waste any time and took out five acquired Numinous Treasures.<br/><br/>“Five!”<br/><br/>Upon seeing the five acquired spiritual treasures, the old man from the ancient sea tribe was stunned for a moment. His eyes were filled with excitement.<br/><br/>“Alright, Alright. Thank you for your trust in our ancient sea tribe.”<br/><br/>The old man quickly said as he stared at the five acquired spiritual treasures with a burning gaze.<br/><br/>One acquired spiritual treasure could be the finale treasure even in this auction, let alone five of them.<br/><br/>“Customer, this is the auction certificate of our Ancient Sea Race. Our ancient sea race will record part of the information onto the universe’s AI and be supervised by everyone in the Universe.”<br/><br/>The old man of the Ancient Sea Race handed over a jade token and said to him.<br/><br/>Wang Xian nodded his head.<br/><br/>Business owners relied on their reputation, especially in this type of auction house. If there was no reputation, no one would consign the items to them for sale.<br/><br/>As for the vouchers, the ancient sea race would send some auctioneers’auction vouchers to the universe’s AI.<br/><br/>Once the ancient sea race did not give the auctioneer any fees, the auctioneer would be able to expose himself directly to the universe’s AI.<br/><br/>The ancient sea race was very powerful. They would not destroy their reputation just for five acquired spiritual treasures.<br/><br/>Of course, if Wang Xian took out twenty to thirty items at one go, it would not necessarily be the case.<br/><br/>“In our ancient sea race auction house, we will charge 5% of the auction amount. Also, this customer is a seat in our auction house and will be given to you free of charge.”<br/><br/>The old man said enthusiastically.<br/><br/>Those who were able to take out five acquired spiritual treasures at one go were all people who had great opportunities. Their abilities were definitely not weak.<br/><br/>“Alright!”<br/><br/>Wang Xian nodded his head in satisfaction and left.<br/><br/>He strolled around the surroundings and looked at some shops.<br/><br/>On the ancient sea race’s continent, there were all sorts of items for sale.<br/><br/>Technological items, fantasy items, battle pets, mechs, and so on.<br/><br/>Wang Xian strolled around and didn’t find anything that he could use.<br/><br/>Now that he was at the encircled Lu Xingkong, it was extremely rare to find treasures that were useful to him.<br/><br/>After returning to the hotel, Wang Xian rested.<br/><br/>In the next few days, apart from taking a stroll occasionally, he looked at the information on the universe’s AI.<br/><br/>As the war between the righteous God race and the Ancient Sea Race approached, the number of people in the starry sky around them increased as well.<br/><br/>Meanwhile, the number of people in the ancient sea race continent also increased.<br/><br/>As for the auction in a few days time, the momentum was also increasing.<br/><br/>Especially when the ancient sea race auction house announced that they would be auctioning off at least five acquired Numinous Treasures on the spot, it attracted the attention of many powerhouses.<br/><br/>“The Righteous God race is here. All the powerhouses of the righteous God race are here!”<br/><br/>On the fourth day, there was a sudden commotion outside and in the universe’s AI.<br/><br/>Wang Xian opened the window of the room and was slightly stunned when he heard the commotion outside.<br/><br/>He narrowed his eyes slightly and walked out of the room immediately.<br/><br/>“This is?”<br/><br/>He looked at the starry sky outside. When he saw the race of the Righteous God, he was also surprised.<br/><br/>The leader of the group was a gigantic statue. The statue was wearing armor.<br/><br/>The entire statue was at least a hundred kilometers in size.<br/><br/>It had the appearance of a human and had a wide face. It was filled with dignity. However, the skin on its body was golden.<br/><br/>On both sides of the 100-kilometer statue, there were more than 10 similar statues that were around 50 kilometers long.<br/><br/>These were combat bodies created by the Righteous God race.<br/><br/>Combat bodies were similar to battle angels.<br/><br/>The Righteous God race belonged to a race with a strong constitution. Their strong constitution could allow them to fight two levels above them.<br/><br/>The Divine Dragon belonged to a bloodline race.<br/><br/>In the cosmos, there was a race with a strong physique. They belonged to the peak race.<br/><br/>That was the saint race.<br/><br/>The Saint Body of the saint race could fight three levels higher.<br/><br/>It was comparable to the Divine Dragon!<br/><br/>Behind this group of battle bodies were tens of millions of experts of the righteous God race. The weakest among them was at the void God Emperor Realm.<br/><br/>Their bodies were emitting golden light.<br/><br/>And behind them were all kinds of war machines.<br/><br/>There were hundreds of thousands of battleships, mechas, battleships, and so on.<br/><br/>“Hiss, is this the full power of the true God Race? True God body, so many true God bodies. Didn’t they say that the true God race only has 10 bodies? There are 30 of them, and the body in the middle is too terrifying!”<br/><br/>“This battle, the true God race has used all their trump cards and power, this is too terrifying, that leader’s battle body aura is so strong, it’s probably not weaker than a universe Knight Level 7 great being!”<br/><br/>“This time, the true God race wants to challenge any race on the Split Heaven Primal Continent, with such terrifying power, the person being challenged will probably surrender right away, right?”<br/><br/>On the ancient sea race’s continent, everyone looked towards the distant starry sky.<br/><br/>Looking at the army of the Righteous God race, their faces were filled with shock.<br/><br/>“They are indeed very strong!”<br/><br/>Wang Xian looked over, and his eyes were shining.<br/><br/>There were more than ten thousand universe knights under his sensing. This could only be a part of it.<br/><br/>There might be a lot of them hidden in the dark.<br/><br/>The leader of the Righteous God combat body indeed possessed the combat strength of a level seven universe knight under his sensing.<br/><br/>“No wonder it is known as the strongest force in the surrounding starry sky.”<br/><br/>Wang Xian mumbled.\t\t\t\t\t\t</div>", "images": {}, "success": true}