{"id": 298, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072497.html", "title": "Chapter 3289 - 3289 3288 Sentence", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3289 - 3289 3288 Sentence</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3289 3288 sentence<br/><br/>“Pa!”<br/><br/>Two acquired spiritual treasures and three metal acquired spiritual treasures flew into Wang Xian’s hands.<br/><br/>He stretched out his hand and held it in his hand to sense it.<br/><br/>“Your timing is really good!”<br/><br/>His gaze swept across the five golden figures who were flying over. His eyes sparkled as he said faintly.<br/><br/>“This is not what we wanted to see either.”<br/><br/>The elder who was the leader of the Ancient Sea Race said with a face full of regret.<br/><br/>“Now that the people of the righteous God race are coming over aggressively, this is your territory. Don’t you have any explanation?”<br/><br/>Wang Xian looked at them and asked faintly.<br/><br/>“I’m sorry. The strength of the Righteous God race is stronger than us. If they want to come over and attack us, there’s nothing we can do.”<br/><br/>The elder of the ancient sea race shook his head.<br/><br/>“Who killed our righteous God race’s Clansmen?”<br/><br/>At this moment, a voice full of violent killing intent was heard, accompanied by a terrifying golden light.<br/><br/>“Buzz!”<br/><br/>In the next moment, an enormous golden alms bowl appeared in the sky, and rays of golden light enveloped the area below.<br/><br/>“Not good, it’s a pre-heaven spiritual treasure of the confinement type. Let’s quickly dodge it!”<br/><br/>“Oh no, we can’t make it in time. The coverage is too wide!”<br/><br/>At this moment, the expressions of all the great beings in the auction hall changed drastically. They hurriedly hid at the edge.<br/><br/>“My Lords of the Righteous God race, this matter has nothing to do with our ancient Sea Race!”<br/><br/>The expressions of the great beings of the ancient sea race changed slightly when they saw this terrifying power.<br/><br/>Although there were 20 space hum beasts around them, they didn’t dare to be presumptuous in front of the five level six universe knights of the Righteous God race. They immediately said respectfully.<br/><br/>“Huh?”<br/><br/>The five level 6 universe knights of the Righteous God race narrowed their eyes slightly and landed on Wang Xian.<br/><br/>The leader of the Righteous God race continued to ask in a cold voice. His body was filled with killing intent.<br/><br/>A terrifying aura swept across the auction hall.<br/><br/>“It’s this customer who had a conflict with the people of the Righteous God Race!”<br/><br/>The white-robed elder of the ancient sea race felt the terrifying power and quickly said.<br/><br/>“Hehe, very good!”<br/><br/>Wang Xian smiled when he saw the white-robed elder of the ancient sea race pointing at him.<br/><br/>“You are courting death. Kill my people of the Righteous God race. Die!”<br/><br/>The Five Universe Knights of the Righteous God race locked onto Wang Xian. In the next moment, they moved and charged towards Wang Xian with a terrifying aura.<br/><br/>The five of them did not ask too much. In the entire surrounding Lu Xing Kong, their righteous God race was the strongest existence.<br/><br/>Even the ancient sea race, which was ranked second, was far from them.<br/><br/>They had the strongest level 7 universe knight in the surrounding Lu Xing Kong.<br/><br/>Therefore, when facing Wang Xian, they did not waste any time and killed him directly.<br/><br/>Even if the other party had the strength of a Level 6 universe knight.<br/><br/>With the strength of the five of them, they could still kill him!<br/><br/>“What a terrifying power! That powerhouse is going to suffer!”<br/><br/>“He didn’t escape in time. This time, he’s in big trouble. Even if he has the strength of a Level 6 universe knight, he’s still not a match for the five people of the Righteous God Race!”<br/><br/>“Let’s retreat quickly and not be affected!”<br/><br/>“How can we be affected? Five against one. I think we will be able to suppress and kill him very quickly.”<br/><br/>Everyone in the surrounding auction house was discussing as they came to the edge of the Golden Alms Bowl.<br/><br/>They were not optimistic about Wang Xian.<br/><br/>After all, with the strength that Wang Xian displayed, it was very likely that he was also a level six universe knight.<br/><br/>To fight against five existences of the same level and to be blocked by the surrounding routes, the possibility of him dying was very high.<br/><br/>“Going against the Righteous God race, isn’t this courting death?”<br/><br/>At the side, the experts of the ancient sea race looked over and thought coldly.<br/><br/>“Ha!”<br/><br/>Wang Xian looked at the five universe knights who were attacking him, and his eyes revealed a cold look.<br/><br/>“Die!”<br/><br/>The next moment, the five righteous God race experts let out a low roar and launched terrifying attacks at Wang Xian.<br/><br/>The Righteous God race excelled in close combat. At this moment, the five of them were already about 50 kilometers in front of him.<br/><br/>At such a distance, the five masters of the righteous God race were confident that they could kill their opponents in an instant!<br/><br/>“You are courting death!”<br/><br/>Wang Xian revealed a cold expression. The moment their attacks were about to arrive, the Tai Chi Dragon Disc appeared around him.<br/><br/>A shadow of tai chi swept towards the five level 6 masters of the Righteous God race.<br/><br/>The strongest part of the Tai Chi Dragon Disc was its defense. However, under the control of Wang Xian, killing a level 6 universe knight was a piece of cake.<br/><br/>Buzz<br/><br/>The Shadow of the Tai Chi Dragon disc flashed and the terrifying golden light disappeared instantly!<br/><br/>“Ahhhh!”<br/><br/>In the next moment, the power from Yin and yang descended on their bodies and wiped out their life force.<br/><br/>“What!”<br/><br/>“This… this… He’s not a level 6 universe knight, he’s A Level 7, a level 7!”<br/><br/>“Hiss! How is this possible! Since when did a level 7 universe knight appear in our Wei Lu Xing Kong!”<br/><br/>At this moment, when everyone saw the five level 6 universe knights of the Righteous God race being killed in an instant, they all felt their scalps go numb.<br/><br/>“How is this possible?”Someone shouted in disbelief.<br/><br/>How was this possible?<br/><br/>However, they couldn’t help but believe it when they saw the five corpses floating in the sky.<br/><br/>Universe Knight Level 7!<br/><br/>It was already considered a pinnacle existence in the surrounding starry skies.<br/><br/>The only known universe Knight Level 7 warriors were the two from the righteous God race.<br/><br/>When did another one appear? And it was someone that no one knew?<br/><br/>“How is this possible!”<br/><br/>The expressions of all the experts from the ancient sea race changed drastically when they saw this scene.<br/><br/>“A bunch of trash, how Dare You Provoke Me?”<br/><br/>Wang Xian said disdainfully. He waved his arm and kept the five corpses.<br/><br/>Gulp<br/><br/>Seeing the five level 6 universe knights being killed in an instant, everyone from the ancient sea race gulped.<br/><br/>Wang Xian swept his gaze across the surroundings and landed on the experts of the ancient sea race.<br/><br/>“Congratulations… Congratulations, sir!”<br/><br/>When all the experts of the ancient sea race saw Wang Xian looking over, their hearts tightened.<br/><br/>The Old Man in the lead hurriedly bowed and said.<br/><br/>There was some cold sweat on his forehead.<br/><br/>A Level 7 universe knight was not someone the ancient sea race could afford to offend.<br/><br/>“I sentence your ancient sea race to be exterminated!”<br/><br/>Wang Xian stared at them and said in a calm tone.<br/><br/>“Those who have nothing to do with this, leave immediately!”<br/><br/>He continued. When he finished his sentence, he was already in front of the ancient sea race’s powerhouses.<br/><br/>When everyone heard this sentence, they were shocked and their faces were filled with shock.<br/><br/>This was especially so for everyone from the ancient sea race. Their expressions changed drastically.<br/><br/>The other party actually wanted to destroy them. They actually wanted to destroy their ancient sea race.<br/><br/>How… How did this happen?\t\t\t\t\t\t</div>", "images": {}, "success": true}