{"id": 295, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072491.html", "title": "Chapter 3286 - 3286 3285 Prideful God, Strong Ancient Sea 5", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3286 - 3286 3285 Prideful God, Strong Ancient Sea 5</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3286 3285 prideful god, strong ancient sea 5<br/><br/>A acquired spiritual treasure, the void Golden Awl, was sold for 5.1 amount of god-tribulation stones.<br/><br/>“The next item to be auctioned is a water-elemental acquired spiritual treasure. This time, we will start the auction with the starting price of 5 amount of god-tribulation stones…”<br/><br/>At this moment, the auction continued.<br/><br/>Wang Xian sipped the tea beside him and didn’t speak.<br/><br/>The pre-heaven spiritual treasure with water attribute was being auctioned. This time, the starting price was five cardinal volume godly stones.<br/><br/>Immediately, the Universe Knights started bidding.<br/><br/>This pre-heaven spiritual treasure with water attribute was improving rapidly.<br/><br/>Soon, it reached eight cardinal volume godly stones.<br/><br/>In the end, the final price of this pre-heaven spiritual treasure with water attribute reached 9.7 cardinal volume godly stones. The final price was the highest.<br/><br/>As for the ancient sea race, they would buy it according to the strength of the acquired Numinous Treasure.<br/><br/>Since this water-elemental acquired Numinous Treasure had reached such a level, the final two acquired Numinous Treasures would definitely not be cheap.<br/><br/>“The current price is quite high?”<br/><br/>At the same time, on a few mountain peaks in the center, dozens of middle-aged elders sat on a mountain peak.<br/><br/>The old man holding the wine pot in the center frowned slightly when he saw the price of the water-elemental spiritual treasure.<br/><br/>He pursed his lips and smiled faintly.<br/><br/>“Hehe, Old Wine, Jin Zhengfa just took down a acquired spiritual treasure with 5.1 Calamity Divine Stones. You can do it too.”<br/><br/>The old woman said with a smile.<br/><br/>“That’s right. After today, we will enter the heaven opening desolate continent. Why do we care about other things? If anyone is not satisfied, we will destroy them. Hehe!”<br/><br/>A middle-aged man behind him said faintly.<br/><br/>“That’s right. It is the owner’s honor to have that treasure follow me. Haha!”<br/><br/>The old man holding the wine pot laughed loudly and said.<br/><br/>“Elder Jiu, I heard that there’s a clan leader in front who wants that metal attribute acquired spiritual treasure. He’s also prepared to take it with the five kalpa divine stones!”<br/><br/>A middle-aged man who had received the news from the neighboring mountain peak said to the old man holding the wine pot.<br/><br/>The old man holding the wine pot said with a smile.<br/><br/>“Okay, I’ll inform them. If you want this, no one will compete with you.”<br/><br/>The middle-aged man said with a smile.<br/><br/>“Gulp!”<br/><br/>The old man holding the wine pot took a sip of wine with a smile on his face.<br/><br/>Since they had decided to take this acquired Numinous Treasure, no one would compete with them.<br/><br/>“Alright, the next item to be auctioned is the second last acquired Numinous Treasure. It’s also a metal-type acquired Numinous Treasure and a glove-type numinous treasure. The starting bid is five Kalpa god stones.”<br/><br/>At this moment, the white-robed elder of the ancient sea race smiled at the acquired Numinous Treasure that was being offered.<br/><br/>“Five Kalpa god stones. This acquired Numinous Treasure is mine!”<br/><br/>As soon as the white-robed elder of the ancient sea race finished speaking, an elder stood up on a mountain peak near the auction stage and said with an unquestionable tone.<br/><br/>“Oh?”<br/><br/>His words caused everyone to be slightly stunned once again.<br/><br/>“An expert of the righteous God race has made a move again. They still want to buy it at a low price!”<br/><br/>“This… The Righteous God race is too strong. They completely ignore the feelings of others!”<br/><br/>“The righteous god race clearly thinks that they are about to land on the heaven splitting chaotic continent, so they don’t care about their status. I reckon that if someone dares to compete with them, they might directly take action!”<br/><br/>“It’s really possible. After all, their strength is too terrifying. It’s better for us not to compete. However, I’m afraid that the auctioneer is going to be unlucky!”<br/><br/>In the auction house, everyone’s expression changed slightly when they saw the strong man of the righteous God race making a forceful move.<br/><br/>They were discussing in low voices.<br/><br/>No one dared to compete with them.<br/><br/>Wang Xian squinted his eyes slightly when he saw this scene.<br/><br/>He wanted to make a forceful bid at a low price again?<br/><br/>This caused his gaze to turn cold slowly.<br/><br/>“If no one is bidding, then congratulations to this strong man of the Righteous God race.”<br/><br/>The white-robed elder from the ancient sea race smiled and made his decision.<br/><br/>“The five cardinal tribulations divine stone is for sale. The auctioneer is going to suffer a huge loss. The people from the Righteous God race have gone too far. They are simply going too far.”<br/><br/>At the back, the figure who had sold the golden robe spoke with some anger.<br/><br/>Wang Xian saw that the ancient sea race had once again settled down and stood up slowly.<br/><br/>“Ancient Sea Race, is this your auction house? Just now, a metal-elemental acquired Numinous Treasure was sold at a low price. I didn’t say anything. Now, this acquired Numinous Treasure is still being auctioned at such a price? Do you think that I, the auctioneer, am easy to bully?”<br/><br/>He stood up and stared at the old man in white on the auction stage. He questioned him with an expressionless face.<br/><br/>“Huh?”<br/><br/>Wang Xian suddenly stood up. His sudden questioning voice spread throughout the entire auction hall, causing everyone to be shocked.<br/><br/>“That person is the auctioneer of the acquired Numinous Treasure? The one just now is also his?”<br/><br/>“The auctioneer is actually here and even questioned him directly!”<br/><br/>In the auction hall, everyone’s gaze landed on Wang Xian as their eyes flickered slightly.<br/><br/>This caused the auctioneer to be displeased.<br/><br/>Furthermore, what they didn’t expect was that the metal-elemental acquired Numinous Treasure was also his.<br/><br/>“Huh?”<br/><br/>The white-robed elder from the ancient sea tribe on the stage was slightly taken aback as well. Soon after, he smiled.<br/><br/>“My friend, our ancient sea tribe auction house will proceed with the auction according to the rules. Since no one is bidding, we will only proceed with the final bid!”<br/><br/>“Our ancient sea race has done nothing wrong.”<br/><br/>The white-robed elder of the ancient sea race replied indifferently.<br/><br/>It was just as he said. Their ancient sea race did not break the rules. It was just that no one dared to raise the bid?<br/><br/>What does that have to do with us?<br/><br/>Although his words were reasonable, everyone knew that they were shirking their responsibility.<br/><br/>“Oh, is that so? Then the acquired Numinous Treasure that I sent for auction will not be sold.”<br/><br/>Wang Xian said faintly.<br/><br/>“This is against the rules. The auction has already started. You Can’t just take back the item that you sent for auction as you wish. Otherwise, how can we continue the auction?”<br/><br/>The old man in white continued to say with a smile.<br/><br/>“Oh? In that case, I will raise the price myself. The item that is being auctioned now is ten cardinal tribulations divine stones!”<br/><br/>Wang Xian cracked a smile and looked a little sinister.<br/><br/>“Sorry, the price of this acquired Numinous Treasure has already been fixed.”<br/><br/>The old man in white shook his head and said with a face full of regret.<br/><br/>Now, he also knew that their ancient sea race had offended this customer, but they had no other choice.<br/><br/>In front of the righteous God race and this customer, they naturally knew what to choose.<br/><br/>Moreover, their ancient sea race also acted according to the auction rules.<br/><br/>If they wanted to find trouble, they would look for the righteous god race and see how they died.<br/><br/>The white-clothed elder smiled and was not worried about their reputation being damaged.\t\t\t\t\t\t</div>", "images": {}, "success": true}