{"id": 291, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072483.html", "title": "Chapter 3282 - 3282 3281 Prideful God, On The Mighty Ancient Sea", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3282 - 3282 3281 Prideful God, On The Mighty Ancient Sea</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3282 3281 prideful God, on the mighty ancient sea<br/><br/>The Heaven Opening Primal Continent had its own rules, which were set by the experts and the peak races.<br/><br/>There weren’t many rules, but no one was allowed to violate them.<br/><br/>Once the forces landed on the heaven opening primal continent, they were forbidden to attack and plunder the forces outside the heaven opening primal continent.<br/><br/>This was an iron law.<br/><br/>It was also a form of protection for the stronger factions against the weaker ones.<br/><br/>It was also to ensure that the strong ones could be born in an endless stream.<br/><br/>If there was no such rule, the factions surrounding Lu Xing Kong might have been wiped out long ago.<br/><br/>After all, the advancement of many races could be done with the flesh and blood of other living beings.<br/><br/>“The battle to land will begin in 10 days. You can stroll around here for now!”<br/><br/>Wang Xian read some information on the AI and mumbled.<br/><br/>The zhengshen race would be challenging in 10 days. The races that needed to be challenged had yet to be announced.<br/><br/>Wang Xian was prepared to take a look at this war and prepare for the war of disembarkation of the Dragon Palace.<br/><br/>He scanned his surroundings and flew towards the void in front of him.<br/><br/>In this starry sky, it was unusually lively as the war of disembarkation was about to begin.<br/><br/>Many huge continents were suspended in the surroundings. Some of them even held some auctions.<br/><br/>There were also some experts who took advantage of this time to set up stalls to trade the treasures in their hands.<br/><br/>This made the surroundings look unusually bustling.<br/><br/>Wang Xian flew aimlessly and went to some continents to look around to see if there were any treasures.<br/><br/>After strolling around for more than ten hours, he didn’t feel bored.<br/><br/>All sorts of items and races had opened his eyes.<br/><br/>Boom! Boom! Boom<br/><br/>After more than ten hours, a powerful force was transmitted over.<br/><br/>“Eh?”<br/><br/>“This is the ancient Sea Race!”<br/><br/>His eyes flashed as he looked over.<br/><br/>The ancient ocean race was a famous race in the surrounding starry sky.<br/><br/>They had the most space beasts.<br/><br/>They had hundreds of space beasts.<br/><br/>The weakest among them was a universe knight at level four.<br/><br/>Because they were space beasts, their combat power was even more terrifying.<br/><br/>The ancient ocean race was second only to the true God race.<br/><br/>They controlled 10 universe Knight Level 6 Space Beasts.<br/><br/>In the surrounding starry skies, the God race was number one, and the ancient sea race was number two.<br/><br/>Now, after the Dragon Palace destroyed the Devil Dragon and Fire Dragon Palace, the Dragon Palace’s strength was ranked third.<br/><br/>The main reason was that no one saw the battle between the Dragon Race and the god Dragon Race.<br/><br/>It was also because the strongest divine dragon lineage that surrounded the starry skies was at least a level five universe knight.<br/><br/>Within Wang Xian’s line of sight, 20 starry Sky Hum Beasts were pulling an incomparably huge continent and flying over.<br/><br/>That continent was comparable to a star. The smallest of the 20 starry Sky Hum Beasts was at least 100,000 meters in size.<br/><br/>They were emitting a terrifying aura as they rushed over.<br/><br/>“Eh? The ancient sea race is here. The ancient sea race mainly focuses on business. They shouldn’t give up on this opportunity. I think they are going to hold some auctions or auction some items.”<br/><br/>“TSK tsk, since the ancient sea race is here, we can go over and see if there are any treasures.”<br/><br/>“With the strength of the ancient sea race, they should be able to step into the heaven-splitting primordial land.”<br/><br/>From the surrounding area, there were voices of discussion.<br/><br/>Wang Xian nodded his head slightly when he heard that.<br/><br/>Due to the rules of the heaven opening primal continent, the forces that entered the heaven opening primal continent were prohibited from attacking the forces that surrounded the starry sky.<br/><br/>Similarly, the forces of the Heaven opening primal continent were also prohibited from taking large-scale actions in the surrounding starry sky.<br/><br/>Otherwise, with their strength, they could totally oppress people with their power.<br/><br/>Therefore, once they entered the heaven opening primal continent, they would be prohibited from doing business in the surrounding starry skies.<br/><br/>The ancient sea race mainly used auctions to purchase and sell various items. They had a lot of assets in the surrounding starry skies.<br/><br/>Once they entered the heaven opening primal continent, they would have to give up these assets.<br/><br/>And with their strength, entering the heaven opening primal continent was just the tail of a phoenix. If they wanted to do business, they simply didn’t have the strength.<br/><br/>Hence, they hadn’t made any landings and were active in the surrounding starry skies.<br/><br/>Perhaps after their race gave birth to a universe Knight Level 7 great being, they would consider disembarking.<br/><br/>“The ancient sea race has issued an announcement on the universe AI. There will be an auction in five days. Brothers who need to send items to auction can send them to them!”<br/><br/>“As expected. TSK TSK TSK, let’s go to the ancient sea race’s continent.”<br/><br/>At this moment, voices came from the surroundings again. Wang Xian raised his eyebrows when he heard them.<br/><br/>He hesitated for a moment before flying toward the ancient sea race’s continent.<br/><br/>The ancient sea race’s continent allowed everyone to enter and leave. There were hotels, restaurants, and various entertainment venues and resting places.<br/><br/>There were also many markets and shops.<br/><br/>“If it’s an auction, I can go and take a look. I also have a lot of useless treasures in my hands. I can consider selling them and exchange them for other resources.”<br/><br/>Wang Xian thought to himself. He had a lot of treasures now.<br/><br/>He had a lot of acquired Numinous Treasures. Many of them were useless to the members of the Dragon Palace of acquired Numinous Treasures.<br/><br/>Therefore, he was prepared to sell them in exchange for some other treasures or resources.<br/><br/>His body moved and he flew directly toward the main road of the ancient sea race.<br/><br/>He was not the only one. There were many people flying toward this continent.<br/><br/>“Enter the ancient sea race continent. No flying and no fighting. If not, kill them immediately!”<br/><br/>Wang Xian entered and a voice was heard.<br/><br/>He landed on the ground and took out the universe AI to check a map of the continent.<br/><br/>Then, he quickly walked toward the center.<br/><br/>“TSK TSK, this continent is really bustling!”<br/><br/>Walking on the continent, he muttered as he looked at all kinds of entertainment venues and shops.<br/><br/>Arriving at a hotel, Wang Xian booked a room and prepared to rest here for the next few days.<br/><br/>Following that, he walked toward Gu Hai auction house according to the map.<br/><br/>Gu Hai auction house was extremely grand.<br/><br/>This wasn’t an auction house that was built in a single room. Instead, it was an auction house that was formed by countless tiny mountain peaks.<br/><br/>A main peak that was a hundred meters wide.<br/><br/>There were hundreds of thousands of mountain peaks that were only a dozen meters wide around it.<br/><br/>These mountain peaks looked like pillars from afar. There were seats on them.<br/><br/>The tiny mountain peaks were hundreds of thousands of meters tall.<br/><br/>The entire auction house occupied an area of about a thousand kilometers. It was enough for tens of millions of people to bid at the same time.<br/><br/>Wang Xian followed the instructions and came to the place where the items were auctioned.<br/><br/>“Our ancient sea auction house is the most reliable auction house in the starry sky. May I know what items would you like to auction?”<br/><br/>When they arrived at a cave, a middle-aged man asked Wang Xian with a smile.\t\t\t\t\t\t</div>", "images": {}, "success": true}