{"id": 290, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072481.html", "title": "Chapter 3281 - 3281 The Battle Of 3280 Landings", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3281 - 3281 The Battle Of 3280 Landings</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3281 The Battle of 3280 landings<br/><br/>“Thunder Ray high-level race?”<br/><br/>When Wang Xian heard Lei Ming’s words, he raised his eyebrows slightly and asked, “Do you know anything about the Thunder Ray Race?”<br/><br/>“Dragon King, the Thunder Ray race is not a human race. They were born in the thunder clouds of the heaven-splitting prehistoric continent and are very powerful. There are powerful warriors at the peak of the universe knight level in their race. As for their specific strength, I am not very clear about it.”<br/><br/>Lei Ming immediately reported.<br/><br/>“Top-notch Universe Knights?”<br/><br/>Wang Xian raised his eyebrows slightly. “Alright, you can leave first.”<br/><br/>“Yes!”<br/><br/>Lei Ming nodded and left the Dragon King Hall.<br/><br/>Wang Xian took out the universe AI and searched the strength of the Thunder Ray race.<br/><br/>A race born in the heaven-splitting prehistoric continent was not something that could be compared to those races that needed to log in to the heaven-splitting prehistoric continent.<br/><br/>A race that had the combat strength of a level eight universe knight and 30,000 universe knights would be able to advance to a high-level race in the universe.<br/><br/>However, there was a huge gap between the high-level races.<br/><br/>There were even some high-level races that had the combat strength of a universe master.<br/><br/>Combat strength and realm were two different concepts.<br/><br/>For example, Wang Xian. His current realm was only at level two universe knight, but he had the combat strength of a level eight universe knight.<br/><br/>Of course, he was a freak to be able to surpass so many levels. He was the only one in the universe.<br/><br/>Other than him, there were also many creatures with special bloodlines and physiques that could surpass their levels to fight.<br/><br/>For example, if a strong warrior from a high-level race could surpass two levels to fight, when his realm reached the peak of a universe knight, he would be able to fight against a universe overlord.<br/><br/>However, they could not be rated as a race at the peak of the universe.<br/><br/>If one wanted to step into the peak of the universe, one had to step into the realm of the Masters of the universe, not reach the level of combat ability.<br/><br/>This resulted in a huge gap between the high-level races.<br/><br/>The strength of the Thunder Ray race was not strong among the high-level races, but they were definitely not weak.<br/><br/>I have to think of a way to get the 27 thunder feathers<br/><br/>Wang Xian pondered. He had a premonition that if he had nine attributes, he might be able to achieve a huge improvement.<br/><br/>If he could even fuse the nine attributes, he would be even more powerful.<br/><br/>“Eh?”<br/><br/>At this moment, Wang Xian, who was checking the AI of the universe, suddenly saw a message. He raised his eyebrows slightly.<br/><br/>“The Battle of the landings!”<br/><br/>On the side of the surrounding galaxy, there were some forces that were engaged in the Battle of the landings.<br/><br/>“I can go and take a look myself.”<br/><br/>Wang Xian hesitated for a moment and thought to himself.<br/><br/>He was also filled with curiosity towards the Battle of the landings.<br/><br/>To all the forces in the surrounding galaxy, the Battle of the landings was a huge challenge to a race as well as a huge opportunity.<br/><br/>Once they succeeded, it would be a whole new world after they stepped into it. However, if they failed, they might be exterminated.<br/><br/>The war of landings was exceptionally cruel.<br/><br/>Even the Fire Dragon Palace and the Devil Dragon Clan of the divine dragon lineage did not recklessly land. Instead, they were accumulating their strength.<br/><br/>“Prime Minister Gui, you take care of the matters in the Dragon Palace first.”<br/><br/>He transmitted his voice to Prime Minister Gui. His body moved and he immediately walked out.<br/><br/>“Huala!”<br/><br/>The primaless holy wings were deployed. Now that Wang Xian’s strength had broken through, with the help of the primaless holy wings, he could burst out with the speed of a level nine universe knight.<br/><br/>He shuttled through the starry sky. Currently, there were not many people who could see his speed clearly in the surrounding starry sky.<br/><br/>However, the starry sky of Xingjiang was very, very far away from the heavenly desolate continent.<br/><br/>Even with Wang Xian’s speed, if he were to fly, he would still need a month’s time.<br/><br/>After reaching the surrounding starry skies, he checked the route and traveled through the teleportation formation.<br/><br/>Even so, it took him ten days to arrive at the starry skies closest to the heavenly desolation continent.<br/><br/>“Huh?”<br/><br/>When he walked out from a teleportation formation, he felt that his surroundings were extremely lively.<br/><br/>When he swept his gaze across the starry skies, there were all kinds of creatures.<br/><br/>Not only were there all kinds of humans, there were also all kinds of demon beasts, plant-type creatures, elemental creatures, and even quite a few mechanical creatures and skeleton creatures.<br/><br/>There were all kinds of forms and all kinds of life forms.<br/><br/>Apart from all kinds of creatures, there were also a large number of flying machines. The entire starry sky was extremely lively.<br/><br/>In the surroundings, there was no conflict between the creatures.<br/><br/>This was the border between the surrounding starry sky and the heaven opening desolate continent. It was also the battlefield for this landing battle.<br/><br/>The landing battle had yet to begin, but because of this battle, countless experts from various factions had gathered.<br/><br/>It attracted countless people to watch.<br/><br/>For many experts of various races, this was a feast.<br/><br/>The reason why no one dared to clash was because there were too many experts here.<br/><br/>It was possible that a fight between two creatures would cause a strong person to be displeased and kill you.<br/><br/>Therefore, in this place, the unspoken rule was to not fight if possible.<br/><br/>“It’s really lively here. With just a glance, there’s a universe knight among a hundred people. There are so many strong people.”<br/><br/>Wang Xian scanned his surroundings and sighed in his heart.<br/><br/>The starry sky of the galaxy could not be compared to this place at all.<br/><br/>“I will move the Dragon Palace here in the next few months.”<br/><br/>He thought to himself. The Dragon Palace was going to launch a landing battle soon.<br/><br/>“The Righteous God race is finally going to launch a landing battle. Now that we are surrounding the starry sky, there is no doubt that the righteous God race is number one in terms of strength. However, they have been delaying until now to launch a landing battle!”<br/><br/>“I guess they want to choose a good paradise. I just don’t know which faction the righteous God race will choose to challenge.”<br/><br/>“With the strength of the righteous God race, they should be able to easily land on the edge of a faction. After all, the Righteous God race has two universe knights with level 7 battle strength.”<br/><br/>At this moment, voices of discussion were heard.<br/><br/>When Wang Xian heard it, his eyes were shining.<br/><br/>The Righteous God race was now known as the strongest faction by the surrounding Lu Xing Kong.<br/><br/>A great being with level 7 battle strength of a universe Knight had a strong foundation.<br/><br/>The disciples of this race had very strong physiques, and they could fight two levels above them.<br/><br/>They were worthy of being the kings of the surrounding land of stars.<br/><br/>With their strength, it would be very easy for them to enter the heaven opening primal continent. However, it was obvious that they wanted to enter the deeper parts of the heaven opening primal continent and occupy a better paradise.<br/><br/>There were rules in the land battle. The rules set by the peak races of the universe were that once they successfully entered the heaven opening primal continent, they would be protected for 2,000 years.<br/><br/>Within 2,000 years, other forces could not attack them.<br/><br/>Similarly, within 2,000 years, they could not attack other forces.<br/><br/>Of course, they could choose not to be protected. In that case, the forces surrounding the land could continue to challenge them.<br/><br/>This force could also attack other forces around them.<br/><br/>This rule was only limited to the location of the land landing battle at the edge of the heaven opening primeval continent.\t\t\t\t\t\t</div>", "images": {}, "success": true}