{"id": 299, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072499.html", "title": "Chapter 3290 - 3290 3,289 Went On A Killing Spree", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3290 - 3290 3,289 Went On A Killing Spree</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3290 3,289 went on a killing spree<br/><br/>“Hiss, this, this, this… This lord is actually going to exterminate the ancient Ocean Race!”<br/><br/>“His power is too terrifying, too strong. Five universe knights and a level 6 great being were killed in an instant. Even among universe knights and Level 7 Great Beings, he is probably a relatively strong existence.”<br/><br/>“The ancient ocean race is in big trouble this time. They have kicked an iron board. This time, they are going to face a huge disaster!”<br/><br/>“This is what the ancient sea race deserves. This lord is holding an auction here. They didn’t say anything when the righteous god race lowered the price. When the righteous God race attacked this lord, they didn’t say anything to stop them. Instead, this lord was the one who attacked. They opened their mouths to stop him. It’s obvious that they think this lord is easy to bully.”<br/><br/>“They even pointed out that this lord was the one who said it. It’s great now. They have completely angered the other party!”<br/><br/>“Retreat, Retreat, Retreat. There will be more ancient sea races to play with.”<br/><br/>In the auction venue, everyone heard Wang Xian’s words and immediately flew into the distance.<br/><br/>The Golden Light released by the Golden Bowl had disappeared after the level 6 universe Knight was killed. They all flew into the sky to prevent themselves from being affected.<br/><br/>Everyone looked at the ancient sea race with a hint of mockery on their faces.<br/><br/>They had all witnessed the scene just now. The ancient sea race was obviously afraid of the righteous god race, so they deliberately bullied that lord.<br/><br/>However, what they didn’t expect was that this Lord’s strength was so terrifying.<br/><br/>The ancient sea race had completely kicked an iron board.<br/><br/>…<br/><br/>“Boom Boom Boom!”<br/><br/>However, at the same time, in the Divine Hall located in the center of the Righteous God race’s army.<br/><br/>In the center of the palace, two old men suddenly stood up, their expressions extremely ugly.<br/><br/>“Third elder and the other five have fallen!”<br/><br/>“How is this possible? Third Elder and the others are all universe knights with level 6 combat power, and they even have treasures in their hands!”<br/><br/>“What happened? What exactly happened?”<br/><br/>In the front, the 20 universe knights at Level 6 immediately stood up, their expressions unsightly.<br/><br/>They felt the godly tablets of third elder and the other five instantly break.<br/><br/>This meant that the five of them had fallen, and they had been killed in an instant.<br/><br/>In an instant, the five universe knights at level 6 had been killed.<br/><br/>And how powerful were they!<br/><br/>“Damn it! How could something like this happen at this time?”<br/><br/>The two old men of the true God race looked extremely embarrassed. They dashed out of the godly palace in a flash.<br/><br/>Five universe knights and level-six great beings were killed in an instant. This was definitely not something a universe knight at level-six could do.<br/><br/>Now that their true God race was about to land, they were at a critical juncture.<br/><br/>Now, a mysterious existence had appeared and killed many of their great beings consecutively. This made them furious.<br/><br/>At the same time, they had a bad premonition.<br/><br/>“Let’s Go!”<br/><br/>Seeing the two ancestors flying out, the rest of the universe knights followed closely behind.<br/><br/>“A bunch of reckless fools, Die!”<br/><br/>In the auction venue of the Ancient Sea Race, Wang Xian waved his arm. A destructive force of five elements was directed towards the Universe Knights of the Ancient Sea Race.<br/><br/>With his current strength, he didn’t need to use the primaless sacred wings or the five elements grinding.<br/><br/>Facing this group of level five universe knights, he killed them casually.<br/><br/>The destructive power of the five elements was directed towards the Universe Knights of the Ancient Sea Race.<br/><br/>At this moment, the faces of the Universe Knights of the ancient sea race were extremely pale, and their eyes were filled with despair.<br/><br/>Under the terrifying speed of Wang Xian, they had no way to dodge.<br/><br/>“No, no, sir, don’t Kill Us. It’s our ancient sea race’s fault. Don’t Kill Us.”<br/><br/>Terrified voices came from their mouths as they begged for mercy.<br/><br/>How could they have thought that this young man in front of them was so terrifying!<br/><br/>There were only a few level seven universe knights in the surrounding starry skies, yet they had actually encountered him.<br/><br/>How could they be so unlucky?<br/><br/>“Hehe!”<br/><br/>Wang Xian sneered. The river of destruction swept past their bodies and immediately melted their bodies.<br/><br/>“Roar Roar Roar!”<br/><br/>At this moment, the 20 space hum beasts in the surroundings let out a roar. Their cold eyes stared at Wang Xian.<br/><br/>Boom! Boom! Boom<br/><br/>“Who is causing trouble here?”<br/><br/>The huge commotion immediately woke up a level 6 universe knight from the ancient sea race deep in the continent below.<br/><br/>He moved and instantly appeared at the side of the auction venue.<br/><br/>Buzz! Buzz! Buzz<br/><br/>At this moment, the entire ancient sea race’s continent was filled with urgent sounds.<br/><br/>Upon hearing this voice, the Great Beings and disciples on the land of the ancient sea race quickly flew over.<br/><br/>“Die!”<br/><br/>Wang Xian swept his gaze across and countless blood-red chains appeared around him in an instant.<br/><br/>The chains attacked the surrounding space hum beasts and the Level 6 universe knight.<br/><br/>“Not good!”<br/><br/>The Level 6 ancient sea race warrior who had just flown out was shocked when he saw the terrifying blood-red chains.<br/><br/>The blood-red chains gave him a terrifying feeling.<br/><br/>Hong<br/><br/>He immediately attacked the blood-red chains.<br/><br/>However, he was still too slow. His attacks were useless against the blood-red chains.<br/><br/>“Oh no, Space Hum Beast, Charge!”<br/><br/>Sensing this terrifying attack, the old man of the ancient sea race shouted loudly with blood-red eyes.<br/><br/>“Sir, how did we offend you? Why did you attack our Ancient Sea Race?”<br/><br/>Following that, he shouted anxiously.<br/><br/>“Then we have to ask the people of Your Ancient Sea Race!”<br/><br/>Wang Xian said coldly.<br/><br/>“Roar Roar Roar!”<br/><br/>In the next moment, blood-red chains appeared in front of the Space Hum Hum Beast.<br/><br/>The Space Hum Beast let out a furious roar. A terrifying hurricane force gathered around them and charged directly at the chains.<br/><br/>“PFFT PFFT PFFT PFFT!”<br/><br/>However, what shocked everyone was that the chains easily penetrated the space hum beast’s body.<br/><br/>The blood-red chains were like deadly chains, and the space hum beasts couldn’t resist at all.<br/><br/>The terrifying chains directly pierced through the bodies of 20 space hum beasts.<br/><br/>“Howl! Howl! Howl!”<br/><br/>The Space Hum Beasts let out miserable cries, and the 20 space beasts writhed in pain in the void space.<br/><br/>“Damn it, how did those bastards provoke such a terrifying being?”<br/><br/>The Universe Knight of the ancient sea race saw this scene and looked at the blood-red chains that gradually surrounded him. His face was filled with shock and anger as he roared.<br/><br/>How did those D * MN B * stards of the ancient sea race provoke such an enemy?<br/><br/>“Pu Pu Pu!”<br/><br/>At this moment, Wang Xian did not show any mercy. The chains moved and went straight for all the Space Beasts and the Universe Knight.\t\t\t\t\t\t</div>", "images": {}, "success": true}