{"id": 297, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072495.html", "title": "Chapter 3288 - 3288 3287 Ancient Sea Race That Was Courting Death", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3288 - 3288 3287 Ancient Sea Race That Was Courting Death</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3288 3287 ancient sea race that was courting death<br/><br/>“Hiss, how is this possible!”<br/><br/>“This… this… all the great beings of the righteous god race were killed by him in an instant. What terrifying strength!”<br/><br/>“How dare he?”<br/><br/>“With the combat strength of a universe Knight Level 6, his strength is at least a universe knight level 6. With such strength, how could he not dare? The Righteous God race is about to land. After killing them, they will leave this place immediately. In the future, the righteous God race will not be able to take revenge!”<br/><br/>“Now, the Righteous God race has encountered a tough nut to crack!”<br/><br/>When Wang Xian made his move and instantly killed the universe knights of the Righteous God race, everyone had shocked expressions on their faces.<br/><br/>This was the righteous God race!<br/><br/>They were the strongest race in the surrounding galaxy.<br/><br/>However, some people were also very shocked by Wang Xian’s strength. They also had some agreement with his move.<br/><br/>The Righteous God race was indeed strong, but so what if I killed all of you?<br/><br/>After I killed all of you, I will leave this place immediately. After Your Righteous God race lands on the heaven-splitting chaotic land, can you still seek revenge on me?<br/><br/>With the rules, the righteous God race didn’t dare to seek revenge.<br/><br/>At the auction just now, the Righteous God race was so powerful and didn’t care about their status. It was also because they were about to land and had no scruples.<br/><br/>However, they didn’t expect to meet a universe Knight Level 6 great being.<br/><br/>“Now I don’t know what the true God race will do?”<br/><br/>“We can only blame the true God race for being too greedy. They were able to sell three acquired spiritual treasures, so they must have gotten a great opportunity. It’s surprising that they have such strength, but it’s not too surprising.”<br/><br/>“A universe knight level 6 battle strength is considered top-notch in our Lu Xing Kong.”<br/><br/>Everyone else in the auction continued to discuss.<br/><br/>“Stop, stop for our ancient Sea Race!”<br/><br/>The ancient sea race’s warriors saw all the righteous god race’s warriors and disciples being killed, their expressions changed drastically, and they immediately roared loudly.<br/><br/>This was their ancient sea race’s territory!<br/><br/>The experts of the righteous god race had died here. If the righteous God race were to blame them, they would have to pay a huge price!<br/><br/>More than a dozen experts of the ancient sea race immediately flew to the sky and roared with an embarrassed expression.<br/><br/>Around them, twenty space hum beasts let out roars in unison. A terrifying aura was charging over.<br/><br/>“Hehe!”<br/><br/>When Wang Xian heard their words, he waved his arm and collected the corpses of the few thousand strong disciples of the Righteous God race. Then, he looked at the people of the ancient sea race with a grim expression.<br/><br/>“Just now, the people of the righteous God race attacked first. Why didn’t you guys stop them?”<br/><br/>He said coldly. His eyes were filled with killing intent.<br/><br/>“He is very strong. It is not easy for us to deal with him. Stall him for a while. Later, there is no need for us to make a move. The strong people of the righteous god race will naturally come and destroy him.”<br/><br/>More than ten elders of the ancient sea race were floating in the air.<br/><br/>The leader of the elders transmitted his voice.<br/><br/>“Customer, everything happened too suddenly just now. We naturally have to stop that person from the righteous god race. However, your speed is faster and stronger!”<br/><br/>After the leader of the elders transmitted his voice, he explained to Wang Xian.<br/><br/>“Oh, is that so?”<br/><br/>Wang Xian replied coldly.<br/><br/>“Of course. You are our customer, and the others are our customers as well. We will naturally treat our customers equally.”<br/><br/>The old man in the lead continued with a smile.<br/><br/>“That’s right. Please calm down and calm down, customer.”<br/><br/>The old man in white on the auction stage pursed his lips and said to him.<br/><br/>“My friend, we will give you the items that you sent and all the rewards. Also, we will return the three acquired Numinous Treasures to you. As a token of our apology, we will not charge you any commission.”<br/><br/>Another old man said.<br/><br/>“Oh?”<br/><br/>Wang Xian’s eyes sparkled as he narrowed his eyes slightly. “Alright then. Immediately give me all the items that I sent for auction.”<br/><br/>“Alright. Customer, please wait for a moment. We will prepare them for you immediately.”<br/><br/>The old man in the lead said immediately and gestured to the old man beside him.<br/><br/>“HMM? The entire army of the righteous God race is around. Isn’t he going to leave this place? If he doesn’t leave now, he might not be able to leave even if he wanted to!”<br/><br/>In the auction house, the rest of the people were shocked when they saw that Wang Xian was still waiting for the items he sent for auction.<br/><br/>“Hurry Up!”<br/><br/>Wang Xian squinted his eyes and said to the people of the ancient sea race.<br/><br/>“Yes, yes. Please wait a moment. Customer, the number of items and divine stones involved is too huge. We need a few dozen seconds.”<br/><br/>The old man in white on the auction stage said immediately.<br/><br/>“Alright!”<br/><br/>Wang Xian smiled faintly.<br/><br/>…<br/><br/>“What? What happened to the batch of strong disciples that we went to the Ancient Sea Race? Why were they all killed all of a sudden?”<br/><br/>At the same time, in the void not far away from the ancient sea race continent.<br/><br/>There was a towering palace behind the huge body of the god of war in the center.<br/><br/>In the palace, two old men who were emitting golden light sensed that the divine tablets of thousands of people in the divine hall behind them had been broken.<br/><br/>The God of war race had been preparing for this landing battle for hundreds of millions of years.<br/><br/>Before they set off, all the spirit tablets of their clansmen had been transferred to this godly palace.<br/><br/>They could immediately sense how many clansmen had died.<br/><br/>They could even sense what level of clansmen had died, and in what direction.<br/><br/>All of this was to prepare for the upcoming war.<br/><br/>However, they had not expected that thousands of clansmen’s tablets would be broken before the war broke out.<br/><br/>Among them were a few universe knight level five Great Beings.<br/><br/>“What!”<br/><br/>On the left and right sides of the palace, 28 figures shrouded in golden light were slightly shocked when they heard the words of the ancestor in front of them.<br/><br/>“Three universe knight level five clansmen and more than 2,000 clansmen have been killed. Go and investigate on the ancient ocean race continent. No matter who the murderer is, kill him immediately!”<br/><br/>One of the two old men in the center said coldly.<br/><br/>“Yes, Sir!”<br/><br/>Five old men stood up from the left and right sides of the godly palace. They flew toward the land of the ancient ocean race.<br/><br/>“The land battle is coming. Don’t let anything happen.”<br/><br/>The old man in the center continued.<br/><br/>Boom! Boom! Boom<br/><br/>In the void beside the army of the Righteous God race, five golden figures were flying rapidly towards the main road of the ancient sea race.<br/><br/>Their bodies were filled with an awe-inspiring murderous aura.<br/><br/>They actually dared to kill the disciples of the Righteous God race at this moment. They were courting death!<br/><br/>“Huh?”<br/><br/>At this moment, in the auction house of the ancient sea race, Wang Xian sensed five figures flying towards him. The corners of his mouth curled up slightly. He looked at the people of the ancient sea race and said, “Your speed is a little slow.”<br/><br/>“These are the three acquired spiritual treasures that you sent for auction. These are the other items that you obtained.”<br/><br/>As soon as he finished his sentence, an old man waved his arm and threw all the items towards Wang Xian.<br/><br/>He sensed the position in front of him and his eyes sparkled.\t\t\t\t\t\t</div>", "images": {}, "success": true}