{"id": 302, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072505.html", "title": "Chapter 3293 - 3293 3092 Went Crazy", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3293 - 3293 3092 Went Crazy</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3293 3092 went crazy<br/><br/>“There’s a problem on star travel continent. Our Ancient Sea Race has offended Dragon Palace Dragon King. Dragon King has the power of a universe Knight Level 7. All the Great Beings’disciples on star travel continent have been killed, and 20 space hum beasts have been killed!”<br/><br/>“Dragon Palace Dragon King has threatened to destroy our ancient sea race. This battle is unavoidable. They have a universe Knight Level 7 great being, and we are no match for them!”<br/><br/>“The leader of the Righteous God race has sent us a message, the righteous god race is prepared to give up on the landing battle, immediately go to the Dragon Palace and destroy them completely, ordering our ancient sea race to use all our strength to destroy the Dragon Palace!”<br/><br/>In a palace on the main planet of the Ancient Sea Race, Universe Knights sat in their seats.<br/><br/>In the center, the eight old men of the ancient sea race sat there, their faces gloomy as they announced the news.<br/><br/>When everyone heard this news, their expressions changed drastically.<br/><br/>“We… how did our ancient sea race offend the Dragon King of the Dragon Palace? Why did he want to destroy us?”<br/><br/>A great being of the ancient sea race couldn’t help but ask.<br/><br/>A Universe Knight Level 7 warrior made them feel terrified.<br/><br/>This wasn’t an existence they could fight against anymore.<br/><br/>“You can take a look at the situation on the universe’s AI.”<br/><br/>The leading old man said with a gloomy face.<br/><br/>When they heard the news, they almost peed their pants.<br/><br/>A Universe Knight with level seven combat power wanted to exterminate their ancient ocean race.<br/><br/>How could they defend against it?<br/><br/>However, a message from the leader of the righteous God race made them look hopeful.<br/><br/>In the hall, more than 6,000 universe knights immediately took out their AI and read the message.<br/><br/>There was no need for them to search. The most popular thing in the surrounding Lu galaxy was about them.<br/><br/>What happened in the Auction Hall of the ancient sea race had already spread throughout the surrounding Lu galaxy.<br/><br/>Many people were mocking the ancient sea race.<br/><br/>“Right now, we only have one way, to destroy the Dragon Palace. The Dragon King has not only angered us this time, he has also angered the true God race. Now, the true God race has given up on the land battle.”<br/><br/>“The Dragon King wants to destroy us, then we want to see who will destroy who!”<br/><br/>An old man in the center of the Ancient Sea Race stood up, his eyes were filled with killing intent. “The Dragon King of the Dragon Palace has destroyed the Great Beings of our ancient sea race and destroyed our space beasts. This time, we will compete with them. All the universe knights and core disciples of the Ancient Sea Race, prepare for battle!”<br/><br/>“Kill, Kill, kill. They want to destroy us. Let’s see who will be destroyed!”<br/><br/>“With the Righteous God race here, we can definitely destroy Dragon Palace together!”<br/><br/>The Universe Knights of the ancient ocean race stood up one by one, their faces filled with killing intent.<br/><br/>Dragon King was stronger than them, but with the righteous God race here, they weren’t afraid at all.<br/><br/>Killing 20 of their space beasts was already a fight to the death for them!<br/><br/>If the Dragon King wanted to destroy them, then they also wanted to destroy the Dragon Palace!<br/><br/>“Roar! Roar! Roar!”<br/><br/>Soon, the 90 space beasts let out roars. Above the 90 space beasts stood all the experts and elites of the ancient sea race.<br/><br/>They roared in the starry sky and flew in one direction.<br/><br/>At this moment, everyone in the AI of the universe was shocked by what happened in the void in front of the heaven-splitting chaotic land.<br/><br/>All the experts in the surrounding starry sky were discussing in shock.<br/><br/>The strength of the Dragon King of the Dragon Palace and the race of the ancient sea that was courting death.<br/><br/>However, soon, another piece of news that shocked everyone arrived.<br/><br/>“The army of the Righteous God race is flying toward the south of the surrounding starry sky. They are getting farther and farther away from the land of desolation. What are they doing?”<br/><br/>“There is a shocking guess that the righteous God race has given up on this landing battle.”<br/><br/>The departure of the true God race’s army shocked everyone.<br/><br/>Countless people guessed.<br/><br/>And two hours later, two shocking news arrived.<br/><br/>The true God race gave up on the landing battle and headed towards the direction of the Dragon Palace.<br/><br/>All the space beasts of the ancient sea race and all the universe knights and elite disciples were sent out to meet up with the true God race.<br/><br/>When these two pieces of news spread out, everyone was excited!<br/><br/>“Crazy, this is too crazy. This time, the true God race and the ancient sea race provoked the Dragon King, and the Dragon King killed a large number of warriors of the true God race and the ancient sea race. Now, the true God race has given up on the landing battle and wants to destroy the Dragon Palace!”<br/><br/>“Is this the alliance of the number one and number two forces in the galaxy? They are going to destroy the Dragon Palace!”<br/><br/>“They have given up on the landing battle. The Righteous God race is too crazy this time. After all, the landing Battle of the Righteous God race is 100% successful!”<br/><br/>“The Righteous God race must be afraid that the Dragon Palace will launch a sneak attack during the landing battle. That’s why they are acting so crazily.”<br/><br/>“The ancient sea race is about to join the righteous god race. They are indeed heading in the direction of the Dragon Palace.”<br/><br/>Countless people were discussing on the AI. They were shocked by the crazy actions of the Righteous God race.<br/><br/>However, when everyone found out the reason why the righteous God race and the Ancient Sea Race had offended the Dragon King of the Dragon Palace, there was another uproar.<br/><br/>“This time, the righteous God race can only blame themselves for being unlucky. It’s their fault for being too arrogant and meeting a tough opponent!”<br/><br/>“The Dragon King of the Dragon Palace is also fierce. He has also fought his way out step by step. Why would he be afraid of the Righteous God race and the Ancient Sea Race?”<br/><br/>“Next, do you think the Righteous God race and the Ancient Sea Race can destroy the Dragon Palace? After all, the righteous God race and the Ancient Sea Race are the number one and two forces in Lu Xingkong!”<br/><br/>“The Dragon Palace should not be their match, but it will be difficult to destroy the Dragon Palace. After all, the Dragon Palace of the Divine Dragon lineage is very powerful.”<br/><br/>Countless people discussed and guessed that there was a high possibility of a big battle breaking out.<br/><br/>There could only be one reasonable situation for the righteous God race’s crazy actions, and that was to destroy the Dragon Palace and make up for their losses.<br/><br/>And this guess was also correct.<br/><br/>In the starry sky, the entire righteous God race was traveling at a fast speed. At this time, every member of the race was filled with raging anger.<br/><br/>They had given up on the land battle and could only make up for it with the blood of the Dragon Palace.<br/><br/>“Eh? What’s going on? The race of the Righteous God actually left?”<br/><br/>At the same time, they were in the sky above a vast continent. The entire continent was filled with dense immortal qi.<br/><br/>At the edge of the continent, there were many enormous mountains.<br/><br/>Each mountain was tens of millions of meters tall.<br/><br/>In front of each mountain, there were giants that were tens of thousands of meters tall standing neatly on an empty space.<br/><br/>In front of them, there were more than 60 giants that were 20,000 meters tall. They stared at the space in front of them, their faces filled with shock.<br/><br/>“Leader, look at the universe ai that surrounded Lu Xing Kong. That God race actually gave up on the land battle. They are going to destroy a power from the Dragon God lineage.”<br/><br/>One of the Giants said with shock and joy on his face.\t\t\t\t\t\t</div>", "images": {}, "success": true}