{"id": 304, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072509.html", "title": "Chapter 3295 - 3295 3,094 Cups Of Tea To Exterminate The Two Races", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3295 - 3295 3,094 Cups Of Tea To Exterminate The Two Races</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3295 3,094 cups of tea to exterminate the two races<br/><br/>“Roar!”<br/><br/>Terrifying roars resounded throughout the starry sky.<br/><br/>90 space hum beasts let out angry roars.<br/><br/>Every Space Hum Beast had combat strength no weaker than a level 3 universe knight.<br/><br/>The stronger ones had already reached Level 6 universe knight.<br/><br/>Their roars shook the entire starry sky.<br/><br/>“We’re here! The Dragon Palace is right ahead!”<br/><br/>Golden figures flew toward the front of the true God Race Army.<br/><br/>They stood on top of the true God body, their eyes shining with golden light.<br/><br/>The two ancestors stood on the 100-kilometer-long true God body, staring at the Dragon Palace in the distance.<br/><br/>Behind them, all the experts and disciples of the god of War held divine weapons, and their eyes were full of killing intent.<br/><br/>They had given up on the land-landing battle because of the Dragon Palace!<br/><br/>This time, they wanted to make the Dragon Palace bleed like a river, and they wanted the corpses of the disciples of the Dragon Palace to be under their feet!<br/><br/>The armies of the two races quickly approached them.<br/><br/>The violent killing intent rushed toward the Dragon Palace.<br/><br/>Splash<br/><br/>When they entered the ocean where the Dragon Palace was located, the seawater flowed backward rapidly.<br/><br/>A vacuum was formed quickly.<br/><br/>As the two armies advanced, the seawater also began to flow backward.<br/><br/>“Dragon King of the Dragon Palace, I’ll give you a chance. Submit to the Righteous God race and become the Mount of our righteous God race. Otherwise, even if you flee to any corner of the universe or spend hundreds of millions of years, our righteous God race will annihilate you completely!”<br/><br/>The two armies were only a few hundred million kilometers away from the Dragon Palace.<br/><br/>A Dragon King with the combat strength of a universe knight at level seven?<br/><br/>Facing their entire righteous god race, they were confident that they could destroy this dragon king within a minute!<br/><br/>They were not surprised that there was only the Dragon King waiting in front of the Dragon Palace.<br/><br/>In their opinion, the Dragon Palace was no match for them at all.<br/><br/>The other members did not dare to come out at all.<br/><br/>“Hehe, interesting. You want our disciples of the Dragon Palace to be the mounts of your righteous God Race?”<br/><br/>Wang Xian smiled when he heard their words.<br/><br/>“The Dragon Palace has been waiting for you here for a long time. Welcome, distinguished guests. Haha!”<br/><br/>He laughed out loud.<br/><br/>“Huh?”<br/><br/>When the two patriarchs of the Orthodox God race saw how fearless Wang Xian was, their eyes were filled with astonishment and coldness.<br/><br/>“Dragon King, you killed 20 space hum beasts of the ancient sea race. Today, I will exterminate all the disciples of Your Dragon Palace!”<br/><br/>At the side, the chief of the Ancient Sea Race roared with a face full of killing intent.<br/><br/>“Ignorant!”<br/><br/>Wang Xian shook his head and stood up slowly.<br/><br/>“The disciples of the Dragon Palace are ready to welcome the guests. Please treat them well and leave no one alive!”<br/><br/>He stood up and his calm voice spread throughout the entire Dragon Palace.<br/><br/>“Wu Wu Wu!”<br/><br/>Xiao Lan’s muffled roar was the first to be heard from the Dragon Palace.<br/><br/>“Hahaha, array formation, RISE!”<br/><br/>The sky array laughed loudly, and the surrounding void immediately began to change.<br/><br/>The entire starry sky changed, and was covered by a nine-colored light.<br/><br/>The light covered all the members of the Righteous God race and the Ancient Sea Race.<br/><br/>“Roar Roar Roar!”<br/><br/>Soon after, members walked out of the Dragon Palace one by one.<br/><br/>Nine Wind Divine Dragons, two fire divine dragons, one lightning dragon, one darkness dragon, one Golden Dragon, and one water divine dragon.<br/><br/>Each dragon had a powerful dragon aura. Even if they didn’t exude power, one could see how terrifying they were.<br/><br/>“HMM? There are so many purebred dragons in the Dragon Palace!”<br/><br/>The powerhouses of the righteous god race looked surprised when they saw the purebred dragons in the Dragon Palace.<br/><br/>“It would be great if these purebred dragons could be our mounts!”<br/><br/>“They dare to fight us? Hehe, they don’t even know death!”<br/><br/>The Great Beings and disciples of the righteous God race said coldly.<br/><br/>They didn’t care about the light that covered their bodies.<br/><br/>An array that could only interfere with universe knights and level-six great beings didn’t affect them at all.<br/><br/>“Oh? Do you want to fight us?”<br/><br/>The two ancestors of the true God race saw the members of the Dragon Palace walk out one after another, and their eyes were filled with fear.<br/><br/>“You don’t know what’s good for you. Since you don’t want to submit, then die!”<br/><br/>The ancestors of the true God race roared with fear, and they raised the acquired true treasure in their hands. “All Disciples of the true God race, get ready. The Dragon Palace will stop us from disembarking, and we will make them pay with their blood. Get Ready, Kill!”<br/><br/>“Kill, Kill, Kill!”<br/><br/>“Kill!”<br/><br/>A cold roar came from the mouths of all the great beings and disciples of the true God race.<br/><br/>They stared at the Dragon Palace.<br/><br/>Over there, Great Beings from the Dragon Palace walked out one by one. The universe knights were giving off powerful auras.<br/><br/>However, they didn’t have any fluctuations.<br/><br/>This time, there were 17,000 to 18,000 universe knights from their two races.<br/><br/>“HM? They have some strength!”<br/><br/>When the 10,000 knights of the Dragon Palace came out, everyone from the Zheng God race looked surprised.<br/><br/>10,000 knights, this surprised them.<br/><br/>The rise of the Dragon Palace wasn’t long.<br/><br/>“And!”<br/><br/>However, very quickly, they were shocked to discover that the members that came out of the Dragon Palace were still knights.<br/><br/>At the exit of Dragon Palace, 2,000 members walked out at once.<br/><br/>In other words, the number of universe knights in Dragon Palace reached 12,000.<br/><br/>Very soon, more and more great beings walked out of Dragon Palace.<br/><br/>14,000,16,000… 20,000… 30,000.<br/><br/>When more and more universe knights came out, the righteous god race and the ancient ocean race were completely unable to remain calm.<br/><br/>They were shocked from the initial surprise, and now they were panicking.<br/><br/>The power of the two forces, the fierce killing intent, and the violent aura slowly decreased.<br/><br/>However, the Great Beings in the Dragon Palace continued to come out.<br/><br/>“Damn it, how can there be so many universe knights in the Dragon Palace!”<br/><br/>When the number reached 40,000, the two elders of the true God race lost their composure completely. They growled in a low voice with an embarrassed expression.<br/><br/>“Hurry Up!”<br/><br/>At this moment, prime minister turtle’s voice sounded. In the next moment, more than 20,000 universe knights rushed out.<br/><br/>Following that, disciples at the level of void God Emperor who were emitting powerful auras rushed out one after another.<br/><br/>“Damn it! More than 60,000 universe knights! How is this possible? How is this possible? !”<br/><br/>When all the Great Beings from the ancient sea race saw the number of great beings from Dragon Palace, their bodies trembled, and they could not help but growl in a low voice.<br/><br/>There were more than 60,000 universe knights, which was 10 times more than them.<br/><br/>The number of great beings that were 10 times more than them made their scalps numb.<br/><br/>Gulp<br/><br/>All the Great Beings and disciples of the righteous God race gulped as well. A hint of fear appeared on their faces.<br/><br/>There were too many great beings from the Dragon Palace.<br/><br/>“If you’re here, don’t even think about leaving!”<br/><br/>Wang Xian looked at them and smiled.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The next moment, all the members of the Dragon Palace let out a roar in unison. All the power that belonged to them was unleashed!\t\t\t\t\t\t</div>", "images": {}, "success": true}