{"id": 300, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072501.html", "title": "Chapter 3291 - 3291 The Determination Of The 3,290 Righteous God Race", "volume": 3, "volume_title": "Volume 3", "body": "<h1>Chapter 3291 - 3291 The Determination Of The 3,290 Righteous God Race</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3291 The determination of the 3,290 righteous God race<br/><br/>“No!”<br/><br/>“Ao ao! Ao Ao!”<br/><br/>Screams rang out. Out of the 20 space hum beasts, one of them had reached the combat strength of a universe knight at Level 6.<br/><br/>An old man with the combat strength of a universe knight at Level 6.<br/><br/>Under the attack of Wang Xian’s chains, he died instantly.<br/><br/>Even the old man with the combat strength of a universe knight at Level 6 didn’t even have the chance to escape.<br/><br/>Logically speaking, a level 6 universe knight facing a Level 7 universe knight had a high chance of escaping and returning to his God country.<br/><br/>However, Wang Xian wasn’t a Level 7 universe knight.<br/><br/>The current him could even kill a level 8 universe knight.<br/><br/>Coupled with the attack of the Dragon Eye Lock Eight Desolation Law, a Level 6 universe knight wouldn’t be able to escape at all.<br/><br/>Screams of pain rang out. As the strongest attack of the ancient sea race, 20 space hum beasts were instantly killed.<br/><br/>There were a total of 20 space hum beasts!<br/><br/>There were only about 100 space hum beasts in the entire ancient sea race, and now, 20 of them had been killed.<br/><br/>This was a huge loss for the ancient sea race.<br/><br/>However, the ancient sea race couldn’t care about such losses anymore.<br/><br/>“Not good, our ancient sea race has provoked a powerful existence!”<br/><br/>“One of our forefathers has been killed, and twenty space hum beasts have been easily killed. This is not something we can defend against. Run, immediately report to the clan leader and the others!”<br/><br/>“That person is so strong, undefeatable, run!”<br/><br/>At this moment, the experts from the other parts of the ancient sea race continent heard the alarm sound and flew over.<br/><br/>When they saw their twenty space beasts being killed and their forefathers being killed, they were horrified.<br/><br/>Without any hesitation, they fled into the distance.<br/><br/>Some of them even prepared to flee back to their divine kingdoms.<br/><br/>Buzz! Buzz<br/><br/>With a wave of his arm, the five elements grinding mill appeared and swept across the surroundings.<br/><br/>A grayish river of annihilation swept across the surroundings at a terrifying speed.<br/><br/>The river of annihilation contained a terrifying aura. It swept across the entire galaxy at a terrifying speed.<br/><br/>When everyone felt this terrifying energy, a look of horror appeared on their faces.<br/><br/>“Oh no, run, run!”<br/><br/>“Run!”<br/><br/>Some universe knights sensed the speed of this terrifying river and shouted in horror.<br/><br/>Some of the strong ones who wanted to run back to their divine kingdoms had a drastic change in expression.<br/><br/>The speed of this river of annihilation was too fast!<br/><br/>“What… What kind of power is this?”<br/><br/>In the sky above, in the auction hall, all the Universe Knights felt their scalps go numb when they saw Wang Xian’s terrifying attack.<br/><br/>After the long river of destruction swept past, they felt that even the starry sky seemed to have fallen silent.<br/><br/>The place that was swept by this energy seemed to have become a dead zone.<br/><br/>Buzz Buzz<br/><br/>The terrifying energy swept past and swept across an area of more than a billion kilometers.<br/><br/>None of the ancient sea race experts who were rushing over could escape this terrifying attack.<br/><br/>Energy swept over, and their corpses floated in the air.<br/><br/>With one strike, 80% of the ancient sea race experts on this continent were instantly killed.<br/><br/>“Hiss!”<br/><br/>Looking at this terrifying attack, everyone around sucked in a breath of cold air.<br/><br/>Their gazes were incomparably shocked.<br/><br/>“This is?”<br/><br/>At the same time, in the void not far away, two golden specks of light rapidly flew over.<br/><br/>Behind them, there were more than 20 figures shrouded in golden light.<br/><br/>When the two ancestors of the Zheng God race at the front saw this terrifying attack, they were extremely fearful.<br/><br/>“It’s at least a universe Knight Level 7 attack. Moreover, this attack makes me feel a death threat.”<br/><br/>One of the golden lights instantly stopped. He stared at the front with a serious expression, his expression extremely ugly.<br/><br/>“He’s very powerful. Damn it, how could such an expert suddenly appear? How did our righteous God race members provoke him?”<br/><br/>Another righteous god race ancestor also stopped and growled in a low and gloomy voice.<br/><br/>They had actually encountered such a powerful enemy just as they were about to land.<br/><br/>This was simply bad news for their righteous God race!<br/><br/>If the enemy attacked them from behind while they were about to land, there was a high chance that they would lose everything.<br/><br/>After all, the race they were going to challenge this time was not weak either. They should have the combat power of a level seven universe knight.<br/><br/>“Ancestor!”<br/><br/>“Ancestor, what… What should we do?”<br/><br/>At this time, more than 20 level six universe knights flew over from behind. They looked at the terrifying energy coming from the front, and their faces were full of fear.<br/><br/>This power was at least a Level 7 universe knight.<br/><br/>“Forefather, they dared to kill third elder and the others. We’ll kill them. Our entire true God race’s army is here. Why should we be afraid of them? We’ll destroy them!”<br/><br/>A burly old man roared with a murderous look.<br/><br/>“Idiot!”<br/><br/>The two old men in the lead shouted at him angrily when they heard his words.<br/><br/>They had the power to annihilate a universe knight level seven great being.<br/><br/>But would the other side wait for them to attack?<br/><br/>The other side had already escaped before the army of the normal God race arrived.<br/><br/>They were going to launch a landing battle. As long as the other side attacked them from behind, the losses of the normal god race would be immeasurable!<br/><br/>They might even fail to land.<br/><br/>“Patriarch, what should we do now?”<br/><br/>The Patriarch of the Righteous God race asked with a solemn expression.<br/><br/>This time, they were in big trouble!<br/><br/>After he said that, everyone fell silent.<br/><br/>What should they do?<br/><br/>There were two methods. They could ask the other party for peace. If their clansmen died, they would die. Everything would be based on the land battle.<br/><br/>The second method was to fight the other party!<br/><br/>However, fighting the other party meant that they might have to give up on the landing battle this time.<br/><br/>After giving up, they would have to wait 100 million years if they wanted to fight the landing battle again.<br/><br/>This was the rule of the landing battle.<br/><br/>After all, they had given up at the last minute!<br/><br/>100 million years was a very long time for their righteous God race.<br/><br/>“Who are you? You have killed so many people of our ancient sea race and killed the experts of the righteous God race. Aren’t you afraid of Our Revenge?”<br/><br/>At this moment, an extremely angry roar came from the ancient sea race’s main road.<br/><br/>An elder below shouted at Wang Xian with a face full of anger.<br/><br/>“Hahaha, revenge on me, the Dragon King? Then Our Dragon Palace will exterminate your ancient sea race and the righteous God Race!”<br/><br/>When Wang Xian heard the voice from below, his eyes were filled with murderous intent.<br/><br/>With a wave of his arm, the Five Elements Millstone expanded and attacked the continent below.<br/><br/>“Dragon King of the Dragon Palace?”<br/><br/>At the side, all the powerhouses of the righteous god race had gloomy expressions when they heard this.\t\t\t\t\t\t</div>", "images": {}, "success": true}