{"id": 308, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072517.html", "title": "Chapter 3299 - 3299 3098 Lich", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3299 - 3299 3098 Lich</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3299 3098 lich<br/><br/>“This upright god combat body is made of a special metal. It is infused with the power of law of metal attribute and some bloodlines of the upright god race.”<br/><br/>In the vast starry sky, the Dragon Palace was flying rapidly.<br/><br/>Wang Xian was observing the upright god combat bodies in the Dragon Palace.<br/><br/>Thirty upright God combat bodies were one of the strongest trump cards of the upright God race.<br/><br/>However, before these thirty true God battle bodies could be activated, the true God race was annihilated.<br/><br/>“The true God battle bodies can be absorbed by the Devouring Dragon. Other than that, it won’t be of much use.”<br/><br/>He studied it and shook his head slightly.<br/><br/>The true God battle bodies were slightly similar to battle angels, but they were also very different from battle angels.<br/><br/>They were not as easy to make as battle angels.<br/><br/>“If these true God combat bodies are devoured by the Devouring Dragon, the devouring dragon’s strength will increase by quite a bit.”<br/><br/>Prime Minister Gui stood at the side and said with a smile.<br/><br/>“How are Ao crab and the others improving?”<br/><br/>Wang Xian asked Prime Minister Gui with a smile.<br/><br/>“Ao crab and his four subordinates have already reached the level of a universe Knight Level 7. They haven’t even devoured a single dragon palace yet.”<br/><br/>Prime Minister Gui smiled. “According to my guess, after devouring two Dragon Palaces, ao he should be able to reach the level of a universe knight at level nine.”<br/><br/>“Level nine? That’s fine. After he finishes his upgrade, our Dragon Palace will be able to absorb all the resources of the two major powers. At that time, we will proceed with the landing battle.”<br/><br/>Wang Xian said.<br/><br/>“It’s the Dragon King. With our strength, it’ll be easy for us to land.”<br/><br/>Prime Minister Gui looked confident.<br/><br/>The Dragon Palace flew in the starry sky and entered the surrounding starry sky two days later.<br/><br/>When all the forces saw the dragon palaces flying in the starry sky, their faces were full of awe.<br/><br/>The current strength of the Dragon Palace really made all the forces fear it.<br/><br/>Time passed day by day.<br/><br/>After the Dragon Palace released the information, the hearts of the Righteous God race members had been scattered. Some experts from some planets declared that they would not touch all the treasures in the home.<br/><br/>There were also some disciples from the Righteous God race who scattered and hid in the surrounding starry sky, waiting for this incident to pass.<br/><br/>In short, the entire territory of the Righteous God race was in chaos.<br/><br/>“Trash, didn’t you say that this is your nest? Why is there nothing here?”<br/><br/>On a golden planet, an old man who was holding a void God emperor expert from the righteous God race questioned coldly.<br/><br/>“Lord, this is really the base of our righteous God race. I didn’t lie to you, I didn’t lie to You!”<br/><br/>The Righteous God race disciple who was held by the old man shouted with a terrified expression.<br/><br/>“Trash!”<br/><br/>The Old Man’s face was cold. With a wave of his arm, the righteous God race Disciple’s consciousness became blurry and he was thrown far away.<br/><br/>He didn’t die, but it would take a long time for him to completely recover.<br/><br/>Although they didn’t see him here, they didn’t dare to rashly violate the rules.<br/><br/>“The righteous god race might be worried that they would be ambushed during the landing battle, so they moved the divine kingdom and treasures. They should be hidden in a hidden place. If we can find them, we will definitely have a terrifying harvest!”<br/><br/>An old man beside them said with a burning gaze.<br/><br/>“We are not the only race that has arrived. There are at least seven or eight of them.”<br/><br/>The old man who had attacked just now said with a frown.<br/><br/>“Continue to search.”<br/><br/>Everyone did not stop.<br/><br/>The treasures of the Righteous God race. Even if they were not as good as their own treasures, they were not much worse!<br/><br/>The experts quickly searched.<br/><br/>“Damn it, the hidden treasures are really hidden, even we can’t Find Them!”<br/><br/>At this moment, at a location not far away, more than twenty experts with powerful auras were floating in the air.<br/><br/>Their bodies were not very big, but their figures were very strange.<br/><br/>Their entire bodies seemed to be joined together, strange shapes, filled with strangeness and evil.<br/><br/>They scanned their surroundings, looking a little embarrassed.<br/><br/>“If we can make a move, we can use the sacrificial witchcraft to find the divine kingdoms of the righteous God race’s experts. But damn it, we can’t make a move.”<br/><br/>A creature floating in the void, without legs, and with only a pair of eyes, said coldly.<br/><br/>They were the famous liches at the edge of the heaven splitting chaotic continent.<br/><br/>“The Righteous God race has been preparing for this landing battle for hundreds of millions of years. The hiding place of their God nation is definitely very secretive. Without any special secret techniques, it would be hard to find it just by searching.”<br/><br/>Beside him, another liches said in a deep voice.<br/><br/>They had a special method to find the Cosmos God Nation of the Righteous God race experts, but they needed a medium.<br/><br/>Bloodline.<br/><br/>Through a large number of bloodlines, they could determine the location of the universe God countries of the Righteous God race experts.<br/><br/>However, if they wanted these bloodlines, they had to slaughter a large number of the righteous God race members.<br/><br/>This was against the rules, and they didn’t dare to do so.<br/><br/>“There’s another method, and that is to make a fair trade. We can spend some resources to buy some bloodlines from the disciples of the Righteous God race. However, once we carry out this method, it will definitely be known by the other factions in the surrounding starry sky and the Dragon Palace. At that time, we will become enemies with the Dragon Palace.”<br/><br/>Another lich frowned and suggested.<br/><br/>Their Lich Race’s strength was not weak, but the strongest one was only a universe knight level 8.<br/><br/>The Dragon Palace currently had a universe Knight Level 8 existence, and it was still the dragon God race.<br/><br/>Now, they had to consider whether it was worth it.<br/><br/>“Our strength is naturally much stronger than the Dragon Palace, but the Dragon God race has huge potential.”<br/><br/>The Lich at the center pondered, “The Righteous God race has two Universe Knight Level Seven God kingdoms, and the other universe God kingdoms have over 10,000.”<br/><br/>“Report to the clan leader and the others, and let them decide.”<br/><br/>After hesitating for a moment, he decided.<br/><br/>“Alright!”<br/><br/>The other liches nodded.<br/><br/>“The clan leader has already replied. If we can find all the universe God kingdoms in one go, then we will occupy them. If we can only find a portion, then we will give it to the Dragon Palace.”<br/><br/>“Compared to the God kingdoms and treasure vaults of the righteous god race, making enemies with the Dragon Palace is not a big deal.”<br/><br/>After the news was sent out, they received a reply very quickly.<br/><br/>The Lich in the center said indifferently.<br/><br/>“Alright, let’s do it!”<br/><br/>The group of liches immediately replied. They quickly flew towards a life planet of the Righteous God race.<br/><br/>Very soon, a voice sounded from the sky above a planet of the righteous God race.<br/><br/>They were willing to spend a large number of god Stones to purchase the bloodline of the Righteous God race.<br/><br/>Each person only needed to release one-tenth of their blood, and it wouldn’t affect them too much.<br/><br/>This surprised the righteous god race members, but they didn’t reject it at all. They immediately agreed.<br/><br/>This was because the amount of God stones the other party paid was much, much higher than their blood.\t\t\t\t\t\t</div>", "images": {}, "success": true}