{"id": 305, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072511.html", "title": "Chapter 3296 - 3296 3,095 Cups Of Tea Were Used To Exterminate The Two Races", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3296 - 3296 3,095 Cups Of Tea Were Used To Exterminate The Two Races</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3296 3,095 cups of tea were used to exterminate the two races<br/><br/>Boom! Boom! Boom<br/><br/>Waves of terrifying aura rushed forward.<br/><br/>The huge dragon’s aura covered the entire world.<br/><br/>When the Dragon Palace’s aura charged towards the two races, all the experts and disciples of the Ancient Sea Race of the righteous God race were shocked.<br/><br/>This was especially so for the two ancestors of the righteous god race. At this moment, their expressions changed drastically.<br/><br/>Their eyes were fixed on the dragon of darkness beside Wang Xian, and their hearts were beating violently.<br/><br/>They could feel the power of the same level from the demonic dragon.<br/><br/>It was even stronger than them because the other party was a divine dragon.<br/><br/>The Dragon Palace had more than 60,000 universe knights. They could barely accept it because they had the combat strength of two universe knights at the seventh level and had a powerful righteous god combat body.<br/><br/>In terms of high-end combat power, they had a huge advantage.<br/><br/>But now, when a universe Knight Level 7 Dragon God appeared in the Dragon Palace, their expressions changed drastically.<br/><br/>This power, it was impossible for their true God race to destroy the Dragon Palace.<br/><br/>The Dragon of Darkness, along with the Dragon King of the Dragon Palace, the power of the dragon palace was not much weaker than their true God race.<br/><br/>Especially the number of universe knights in the Dragon Palace was too many.<br/><br/>At this moment, the expressions of all the great beings of the ancient sea race became even more awkward and terrified.<br/><br/>With the power of the Dragon Palace, it would be a piece of cake for the ancient sea race to be annihilated.<br/><br/>“Damn it, retreat, Retreat!”<br/><br/>The two ancestors of the true God race growled in a low voice with a gloomy face.<br/><br/>This time, the righteous God race had suffered a great loss.<br/><br/>Not only could they not destroy the Dragon Palace, but they had also completely offended it.<br/><br/>They had also given up on the landing battle.<br/><br/>This huge loss was difficult for them to accept.<br/><br/>However, in this situation, if they continued to fight, their losses would be even greater.<br/><br/>“Retreat, Retreat!”<br/><br/>When the experts of the ancient sea race heard the words of the ancestor of the Righteous God, they immediately roared loudly.<br/><br/>F * ck, they were no match for him at all.<br/><br/>“I’ve already said, Don’t leave when you’re here. Kill them all!”<br/><br/>Wang Xian looked at them with a mocking expression and immediately ordered loudly.<br/><br/>“Roar! Roar! Roar!”<br/><br/>In the next moment, the members of the Dragon Palace rushed forward without any hesitation.<br/><br/>“Dragon King, don’t be so arrogant. Do you really think that we are afraid of You? In terms of high-level combat strength, Your Dragon Palace is no match for us.”<br/><br/>Seeing that the Dragon Palace dared to attack them directly, the ancestor of the Righteous God race roared with an embarrassed expression.<br/><br/>According to the power of the Dragon Palace, the number of Level 6 universe knights in the Dragon Palace was much lower than theirs.<br/><br/>Furthermore, there were only two level seven universe knights in the Dragon Palace.<br/><br/>If they were to really fight, the righteous God race might not be afraid. They just didn’t want to lose too much!<br/><br/>The Dragon Palace was pushing their luck. This made them extremely furious.<br/><br/>The two ancestors of the righteous god race stared at Wang Xian. Their eyes were filled with killing intent.<br/><br/>“Haha, You Are Courting Death. If I say I will destroy you today, I will destroy you today!”<br/><br/>Wang Xian laughed maniacally. In the next moment, the incipient Saint Wings appeared behind him. His figure moved and disappeared instantly.<br/><br/>“Huh?”<br/><br/>The pupils of the two elders of the righteous god race shrunk slightly when they saw Wang Xian disappearing instantly.<br/><br/>“Who gave you the courage to destroy the Dragon Palace?”<br/><br/>In the next moment, Wang Xian’s figure rang beside their ears.<br/><br/>Hearing the voice that was so close to them, the faces of the two ancestors of the righteous god race changed drastically. They revealed an astonished expression.<br/><br/>Their bodies trembled as they looked ahead.<br/><br/>Five meters ahead of them was only five meters away.<br/><br/>The Dragon King was already five meters away from them.<br/><br/>However, they did not notice anything.<br/><br/>Gulp<br/><br/>The two of them swallowed a mouthful of saliva. Their foreheads were instantly filled with cold sweat.<br/><br/>“You You…”<br/><br/>Their bodies trembled.<br/><br/>“Huh? You’re not arrogant anymore?”<br/><br/>Wang Xian looked at them and smiled.<br/><br/>“How is this possible? How is this possible!”<br/><br/>One of the ancestors of the Righteous God race roared in disbelief. His eyes were filled with despair.<br/><br/>“Killing you guys is like slaughtering dogs!”<br/><br/>Wang Xian smiled and extended his palm.<br/><br/>“Run, run, run!”<br/><br/>The two of them did not hesitate at all. They fled to the side in horror.<br/><br/>Buzz<br/><br/>But in the next moment, Wang Xian’s figure disappeared. When he reappeared, he had two ancestors of the righteous god race in his hands.<br/><br/>Whoosh! Whoosh<br/><br/>At this moment, in front of them, everyone stared blankly at the two figures in the Dragon King’s hands. They felt their vision go black.<br/><br/>Especially for the powerhouses of the Righteous God race, they were their ancestors.<br/><br/>A Universe Knight Level 7 being was subdued by the Dragon King in an instant!<br/><br/>Just how powerful was the Dragon King?<br/><br/>“It’s over, we’re finished, we’re finished!”<br/><br/>The Universe Knight Level 6 Great Beings of the righteous God race saw this scene and roared in fear.<br/><br/>“Run, run, run, run as many as you can!”<br/><br/>The leader of the Righteous God race roared mournfully.<br/><br/>“Dragon King’s power is not at Universe Knight Level 7, it’s even stronger. How is this possible? No, no, no!”<br/><br/>On the ancient sea race’s side, the leader of the ancient sea race saw this scene and his face was filled with disbelief and despair.<br/><br/>They were on the verge of collapse.<br/><br/>Not to mention the 60,000 universe knights in Dragon Palace, Dragon King’s power was still above universe Knight Level 7.<br/><br/>The two ancestors of the true God race were instantly killed.<br/><br/>How could they fight?<br/><br/>They were just waiting to die!<br/><br/>Peng<br/><br/>At this time, the two ancestors of the true God race trembled and were thrown towards the Dragon Palace.<br/><br/>The Dragon King waved his arm and a terrifying true treasure attacked the true God race, but he closed his eyes and floated in the air.<br/><br/>“Run!”<br/><br/>All the Great Beings of the true God race saw their forefather killed, and they saw the dragon king hovering in the air with his eyes closed.<br/><br/>This was a chance for them to survive.<br/><br/>They ran as far as they could.<br/><br/>However, to the horror of the universe knights and level six great beings of the true God race, the disc-like treasure gave off a despairing aura as it attacked them.<br/><br/>Roar! Roar! Roar<br/><br/>The Five Godly Dragons roared at the five elements grinding mill, and a powerful pressure swept across them. The level-six universe knights felt as if the starry sky was pressing down on them.<br/><br/>They were invincible!<br/><br/>“We’re completely finished!”<br/><br/>They didn’t even have the slightest intention of defending against a single treasure. They knew that the true God race was completely finished.<br/><br/>Hong! Hong! Hong<br/><br/>A terrifying energy swept past, and the 22 universe knights and level six great beings of the true God race were instantly killed.<br/><br/>Roar! Roar! Roar<br/><br/>At the side, the Dark Dragon roared and charged toward the ancient sea race. The terrifying Devil Flames blotted out the sky and covered the Sun.<br/><br/>Little Blue let out a low growl, locked her gaze on the 90 or so space hum beasts, and rushed over.<br/><br/>“Die!”<br/><br/>At this moment, all the experts and disciples of the Righteous God race and the Ancient Sea Race lost their fighting spirit.\t\t\t\t\t\t</div>", "images": {}, "success": true}