{"id": 306, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072513.html", "title": "Chapter 3297 - 3297 3096 Killed Whoever Moved", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3297 - 3297 3096 Killed Whoever Moved</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3297 3096 killed whoever moved<br/><br/>“Ahhhh!”<br/><br/>Screams sounded in front of the Dragon Palace.<br/><br/>How could they fight?<br/><br/>The Dragon King easily killed the two ancestors of the righteous god race.<br/><br/>The Other Level 6 universe knights were killed by the Dragon King’s treasure.<br/><br/>Facing such terrifying power, how could they fight?<br/><br/>The surrounding void space was covered with arrays. They couldn’t escape even if they wanted to.<br/><br/>Death was their only destination.<br/><br/>What happened next was exactly what the disciples and Great Beings of the two races had expected.<br/><br/>Facing the attack of the Universe Knight Level Seven Devil Dragon, the ancient sea race couldn’t resist at all.<br/><br/>The 90 Space Hum Beasts weren’t a match for the Devil Dragon even if they tried their best.<br/><br/>Not to mention, the Dragon Palace also had extremely powerful space beasts.<br/><br/>In the following time, it was a one-sided massacre.<br/><br/>There was no escape and no escape. They wanted to surrender, but there was no response.<br/><br/>At this moment, all the disciples and experts of the two races completely gave up.<br/><br/>The Gap was too big!<br/><br/>They never thought that the current dragon palace would be so terrifying.<br/><br/>They could only blame themselves for kicking an iron plate.<br/><br/>They might have survived if they begged for mercy, but they wanted to exterminate the Dragon Palace.<br/><br/>Just like what the Dragon King of the Dragon Palace said, they had been waiting for a long time.<br/><br/>They had been waiting for a month for them to come and throw their lives away.<br/><br/>“The harvest this time is not bad!”<br/><br/>Wang Xian floated in the void and slowly opened his eyes. A smile appeared on his face.<br/><br/>Just now, he had used the soul capturing technique to read the memories of the two ancestors of the righteous god race.<br/><br/>For the sake of the landing battle this time, the Righteous God race had hidden the divine kingdom of all their experts and disciples in one place.<br/><br/>In addition, they had placed all their treasures in one place.<br/><br/>According to the information that he had obtained, the treasures in the Treasury of the righteous god race were extremely huge.<br/><br/>As the most powerful force in the surrounding starry skies, their resources were much more than the demonic dragon lineage.<br/><br/>What a good person!<br/><br/>Wang Xian smiled and scanned his surroundings.<br/><br/>The war around them was about to end. Although the two races had tens of millions of elite core disciples, their overall strength was much weaker compared to the Dragon Palace.<br/><br/>This was especially so for the number of universe knights in the Dragon Palace.<br/><br/>Under the massacre of more than 60,000 universe knights, there were not many people left in the two races.<br/><br/>Some members of the Dragon Palace had already started to collect the spoils of war.<br/><br/>“The Righteous God race has seven acquired Supreme Treasures. This is not a small number. There are nearly 200 acquired Supreme Treasures.”<br/><br/>Wang Xian muttered.<br/><br/>“Dragon King!”<br/><br/>At this moment, Ba Qi, who was parasitizing the leader of the ancient sea race, flew over and shouted with a smile.<br/><br/>“Bring some people to the ancient sea race and bring all their treasures over.”<br/><br/>Wang Xian instructed him.<br/><br/>“It’s the Dragon King!”<br/><br/>Ba Qi replied immediately.<br/><br/>“The rest of the disciples of the Dragon Palace, put away the bodies. Let’s go. This time, we will bring the Dragon Palace to the encirclement of Lu Xingkong.”<br/><br/>Wang Xian glanced at all the members around him and said with a smile.<br/><br/>This time, the Dragon Palace had exterminated the Orthodox God race and the ancient sea race. He was prepared to move the Dragon Palace to the encirclement of Lu Xingkong.<br/><br/>The current Dragon Palace was considered an invincible existence in the entire surrounding Lu Xingkong.<br/><br/>After digesting the resources of the two major forces, they could proceed with the landing.<br/><br/>However, before they landed, they had to head to the surrounding Lu Xingkong to understand some of the situation.<br/><br/>“It’s the Dragon King!”<br/><br/>All the members of the Dragon Palace replied immediately.<br/><br/>Half an hour later, the battlefield had been cleaned up. All the corpses were placed in the Dragon Palace.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian arrived at the Dragon Palace. The entire Dragon Palace started to rise and flew toward the direction of the surrounding starry sky.<br/><br/>Around the Dragon Palace were the Fire Dragon Palace, the Dark World of the Demon Dragon, the Red Gold War Dragon, and the Dragon Palace of the divine wind and thunder dragon lineage.<br/><br/>The dragon palaces of the Red Gold War Dragon and the divine wind and Thunder Dragon were being devoured by Ao Xie and the others.<br/><br/>However, as the level of the Dragon Palace was too high, they would need a long time to digest it!<br/><br/>The five dragon palaces were flying in the starry sky, emitting a terrifying power.<br/><br/>At this moment, all the forces and experts in the starry sky were shocked when they saw the Dragon Palace leave.<br/><br/>They knew that the ancient sea race wanted to destroy the Dragon Palace.<br/><br/>When the two races entered the starry sky, many forces sensed their terror.<br/><br/>They didn’t dare to approach them because of their power.<br/><br/>They thought that a world-shaking war was about to break out. However, they didn’t expect the Dragon Palace to leave in such a short time and fly toward the surrounding starry sky.<br/><br/>Where were the people of the Ancient Sea Race?<br/><br/>Everyone in the starry sky of Xingjiang was shocked and discussed on their computers.<br/><br/>Where were the people from the two races?<br/><br/>The Dragon Palace flew quickly toward the surrounding starry sky.<br/><br/>The war in the Dragon Palace had ended and the two forces had been destroyed. The forces in the surrounding starry sky didn’t receive any news because they were too far away.<br/><br/>The AI in the universe was still discussing what would happen in this battle.<br/><br/>Some forces even started to gamble on what the final result would be.<br/><br/>However, not long after, the Ancient Sea Race released a piece of news that shocked everyone.<br/><br/>The experts of the ancient sea race who stayed in the race revealed that all the experts of the ancient sea race who went to attack the Dragon Palace had broken their divine plates.<br/><br/>The broken divine plates meant that all the experts had died.<br/><br/>All the experts of the Ancient Sea Race had died?<br/><br/>After hearing the news, everyone was shocked.<br/><br/>The Ancient Sea Race had gone with the righteous God race this time!<br/><br/>All the experts of the ancient sea race had been killed, but what about the righteous God Race?<br/><br/>What was going on in this war?<br/><br/>Did the Dragon Palace win?<br/><br/>Countless people were discussing in shock on the artificial intelligence system.<br/><br/>The news of all the experts of the ancient sea race being killed was too shocking.<br/><br/>Some people even found it hard to believe.<br/><br/>This was because the two great races had gone over together. The extermination of one race meant that the war might have ended.<br/><br/>Otherwise, how could all the experts and disciples of the entire ancient sea race have died?<br/><br/>“Dragon King, the people in the surrounding Lu Xingkong have already learned about the extermination of the ancient sea race.”<br/><br/>In the starry sky, the Dragon Palace was flying rapidly. Prime Minister Gui came to the Dragon King’s palace and reported to Wang Xian.<br/><br/>“Inform him that the ancient sea race and the righteous god race have been exterminated by us. We can not pursue the responsibility of their remaining disciples. However, we will kill anyone who does not prepare the treasures of the two races!”<br/><br/>When Wang Xian received the news, his eyes flickered as he gave an order.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui replied immediately.<br/><br/>He took out the universal AI and immediately issued a statement in the name of the Dragon Palace.<br/><br/>This statement was also what Wang Xian said.<br/><br/>“Dragon Palace: the Ancient Sea Race and the righteous god race have been exterminated by the Dragon Palace. We can not pursue the responsibility of the remaining disciples of the two races. However, the treasures of the two races are not prepared by anyone. Whoever moves will be killed!”\t\t\t\t\t\t</div>", "images": {}, "success": true}