{"id": 316, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072533.html", "title": "Chapter 3307 - 3307 On The 3306 Scorpion Destruction Imperial City", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3307 - 3307 On The 3306 Scorpion Destruction Imperial City</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3307 On the 3306 scorpion destruction imperial city<br/><br/>“There are strange creatures invading the Scorpion Emperor’s Cave.”<br/><br/>“Who dares to court death? How dare they barge into the Scorpion Emperor’s Cave!”<br/><br/>The corrosive energy prevented Wang Xian from entering the Scorpion Emperor’s cave. Following that, from the inside of the Scorpion Emperor’s Cave, one figure after another flew over.<br/><br/>They carried a powerful poisonous gas on their bodies. The substance-like poisonous gas charged directly at Wang Xian.<br/><br/>“HMPH, since I can’t go in to investigate, I’ll just kill my way in.”<br/><br/>Wang Xian’s eyes were filled with violent killing intent.<br/><br/>He wasn’t here for fun. He was here to destroy the scorpion imperial city and attack the Lich Kingdom.<br/><br/>Since he had been discovered, there was no need to hide.<br/><br/>Furthermore, according to what he knew, there were 12 main cities in the Lich Kingdom. Each main city only had one level 8 universe knight, The Lich City Lord.<br/><br/>Wang Xian was confident that he could kill a level 8 universe knight within 10 seconds.<br/><br/>“Hong!”<br/><br/>His body shook, and a terrifying force rushed out in all directions.<br/><br/>His body moved, and he charged directly into the Scorpion Emperor Grotto-heaven.<br/><br/>“Peng!”<br/><br/>The defense of the Scorpion Emperor Grotto-heaven was directly broken through by him.<br/><br/>The moment he entered, he saw over 1,000 liches attacking him.<br/><br/>Each of the liches had a combat strength that was no less than a level 5 universe knight.<br/><br/>“Haha, as long as there are more liches from the liches’countries, we can make up for the loss of the Righteous God Race!”<br/><br/>Wang Xian laughed out loud. He waved his arm and turned it into a dragon claw.<br/><br/>The Dragon Claw tore straight ahead.<br/><br/>The terrifying power contained in the dragon claw caused the expressions of the thousands of liches who were charging at him to change drastically.<br/><br/>“This is bad. The strength of the intruders is extremely terrifying.”<br/><br/>Among the thousands of liches, there were liches who possessed extremely powerful senses and sharp perception of danger.<br/><br/>“Can you escape? All of you shall die!”<br/><br/>Killing intent appeared in Wang Xian’s eyes. He waved his dragon claw and attacked them directly.<br/><br/>“We can’t escape. Attack!”<br/><br/>A lich powerhouse’s eyes turned red as he roared coldly.<br/><br/>Buzz! Buzz! Buzz! Buzz<br/><br/>In an instant, all kinds of attacks were launched at Wang Xian.<br/><br/>Some liches had densely packed eyeballs. Every eyeball was emitting a blood-red glow.<br/><br/>Some liches had their chests split open as a large amount of poisonous gas rushed forward.<br/><br/>All kinds of strange attacks.<br/><br/>“Die!”<br/><br/>However, their strength was still not enough for Wang Xian.<br/><br/>The strongest level seven universe Knight Lich could not withstand Wang Xian’s attack.<br/><br/>“Bang, Bang, Bang!”<br/><br/>“Awoo, fight, fight, there’s a strong enemy invasion!”<br/><br/>The sounds of collision and misery rang out. In an instant, nearly 1,000 liches were killed by Wang Xian.<br/><br/>However, there were still a few liches who managed to dodge this fatal blow and roared downwards.<br/><br/>At the bottom of the scorpion emperor grotto-heaven was a poisonous pond.<br/><br/>The entire poisonous pond was emitting a black-green light.<br/><br/>Within this light, there were many figures hidden.<br/><br/>“Not good, it’s a universe knight level 8 powerhouse. Our Scorpion Claw City Lord isn’t Here!”<br/><br/>A lich with a huge vertical eye said with a solemn expression.<br/><br/>“Immediately inform the city leader to use the grotto-heaven to defend against the enemy!”<br/><br/>Beside him, there was a slender figure with a beautiful head, but the head was densely packed with countless poisonous snakes.<br/><br/>The strangest thing was that this talking lich only had this strange and beautiful head and no other body.<br/><br/>“Kill!”<br/><br/>He spat out a cold killing intent and his body shook.<br/><br/>“Kill, anyone who dares to invade our Scorpion Emperor City, die!”<br/><br/>“Sky Miasma, Rise!”<br/><br/>A few liches roared.<br/><br/>The Aura they gave off were all at Universe Knight Level 7.<br/><br/>Hua La<br/><br/>In the poison pool below them, a green scorpion flew out.<br/><br/>“Whoever dares to invade our Scorpion Emperor’s grotto-heaven will die!”<br/><br/>A dense voice that sounded like countless overlapping voices came from the Scorpion’s body.<br/><br/>The Scorpion was about a thousand meters in size. Cracks appeared in the void around it.<br/><br/>He stared at Wang Xian who was in the sky and charged forward in an instant.<br/><br/>The five lich powerhouses around them exchanged glances and followed the scorpion.<br/><br/>“HMM? This scorpion doesn’t seem to be a known powerhouse in the Lich Kingdom. No, this creature is a little special!”<br/><br/>Wang Xian narrowed his eyes slightly and stared at the scorpion that was attacking him.<br/><br/>The green scorpion with black spots emitted a terrifying aura.<br/><br/>The strangest thing was that there were thousands of faces on the Scorpion’s head.<br/><br/>Each face was extremely ferocious as they stared at Wang Xian with bloodthirsty eyes.<br/><br/>“It is said that every force that enters the heaven-splitting primordial land is able to occupy a blessed land. Each blessed land has a different effect.”<br/><br/>“This scorpion should be a guardian monster created by the Lich Kingdom using a special method. This monster can not leave the Scorpion Emperor’s blessed land, but it can unleash terrifying strength.”<br/><br/>Wang Xian narrowed his eyes slightly. The heaven-splitting primordial land was the first continent in the universe, and it was also the most central existence. It had nurtured countless races, and naturally, it also possessed a very mystical place.<br/><br/>“PFFT!”<br/><br/>At this moment, the scorpion heads that flew over opened their mouths one by one. Poison threads attacked Wang Xian instantly.<br/><br/>Wang Xian focused his gaze and waved his arm. A destructive force of the five elements covered the poison threads.<br/><br/>“Pu, Pu, Pu!”<br/><br/>However, what surprised him was that the poison threads penetrated his destructive force instantly.<br/><br/>“He is not an ordinary universe knight with level eight combat strength!”<br/><br/>Wang Xian muttered. In the next moment, the five elements grinding mill appeared around him. The Yin-yang dragon coiled around him.<br/><br/>“Kill!”<br/><br/>His eyes were filled with a sinister look as he attacked the poisonous scorpion.<br/><br/>“Bang!”<br/><br/>The dragon claws formed from his arms clawed at the poisonous scorpion.<br/><br/>The poisonous scorpion also extended its claws, which were flowing with black-green poisonous water, to meet Wang Xian’s dragon claws.<br/><br/>“Bang!”<br/><br/>The sound of a collision was heard. Wang Xian felt the dragon claws stiffen slightly as all sorts of toxins entered his body.<br/><br/>The Yin-yang dragon coiled around him and immediately expelled the toxins.<br/><br/>“Bang!”<br/><br/>In the sky, the five elements Millstone had transformed into a gray divine dragon shadow that swooped down from the sky.<br/><br/>Around this Divine Dragon Shadow were the sun, Coffin, Pagoda, Ice Sword, fire saber, and ropes.<br/><br/>“Boom!”<br/><br/>The terrifying attack from the five elements millstone landed on the scorpion.<br/><br/>“Ahhhh!”<br/><br/>On the scorpion’s body, screams of pain could be heard. More than half of the faces on the Scorpion’s head were disintegrated in an instant and were corroded rapidly.<br/><br/>It looked extremely bloody.<br/><br/>“HMPH!”<br/><br/>“Dragon Eye Lock!”<br/><br/>Wang Xian grunted coldly as chains flew towards it.<br/><br/>“The opponent is very strong. Attack!”<br/><br/>Below, the Universe Knights of Scorpion Imperial City, Level 7 masters, saw this scene and their expressions changed slightly. Their pupils constricted as they roared.\t\t\t\t\t\t</div>", "images": {}, "success": true}