{"id": 319, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072539.html", "title": "Chapter 3310 - 3310 The 3309 Numinous Treasure Was Unearthed", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3310 - 3310 The 3309 Numinous Treasure Was Unearthed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3310 The 3309 Numinous Treasure was unearthed<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Not long after Wang Xian flew out of the scorpion imperial city, numerous majestic figures flew over unscrupulously.<br/><br/>“D * MN Dragon King!”<br/><br/>From Afar, they saw that more than half of the scorpion imperial city was in a sea of fire. Their eyes were blood-red and filled with rage.<br/><br/>The city lord of the Scorpion Imperial City appeared above the Scorpion Imperial City in a flash. He looked down with an extremely gloomy expression.<br/><br/>A Sea of fire enveloped Scorpion Emperor City. Other than the flames, there was only the stench of blood in the surroundings.<br/><br/>There were no corpses of any of his subordinates. The entire Scorpion Emperor City had completely become a ruined city.<br/><br/>Under his senses, more than 90% of the ten million disciples in Scorpion Emperor City had died.<br/><br/>This was not a small loss for the Lich Kingdom!<br/><br/>“Let’s go to the grotto-heaven!”<br/><br/>The Lich King flew straight into the Scorpion Emperor’s grotto-heaven with a gloomy face.<br/><br/>When they entered the Scorpion Emperor’s grotto-heaven, there were no living beings inside.<br/><br/>Except for the Scorpion Emperor’s grotto-heaven, there was nothing else.<br/><br/>“The Scorpion Emperor’s grotto-heaven is protected by the thousand-faced poison scorpion. The thousand-faced poison scorpion is not weak, but it was still killed by the Dragon King. The Dragon King is very strong.”<br/><br/>An expert from the Lich Kingdom looked around with a gloomy face and said in a deep voice.<br/><br/>“The Dragon King of the Dragon Palace is a purebred divine dragon. They killed several other divine dragons and have a lot of acquired supreme treasures. Their strength is definitely not to be underestimated. I really didn’t expect the Dragon King to be so sinister. The last time he saw us, he didn’t dare to make a move. Now he actually dares to sneak attack our Lich Kingdom!”<br/><br/>A skinny lich with a bamboo hat, who looked like an old man, said. He extended his black bone-like arm and waved it gently in front of him.<br/><br/>In the void in front of him, Wang Xian’s image appeared.<br/><br/>In the image, Wang Xian was killing the thousand-faced venomous scorpion.<br/><br/>As a powerful wizard clan, it was easy for the Lich clan to investigate the situation here.<br/><br/>Furthermore, with Wang Xian’s current strength and the Heaven Array’s current strength, it was impossible for him to stop the experts from the Lich Kingdom from investigating.<br/><br/>Therefore, Wang Xian did not interfere at all.<br/><br/>So what if they found out that he was the one who did it?<br/><br/>The eleven lich experts narrowed their eyes slightly. Their faces were filled with a solemn expression.<br/><br/>To be able to destroy the thousand-faced venomous scorpion so quickly, many of the lich experts present thought that they were unable to do so.<br/><br/>“No matter what, if the Dragon King of the Dragon Palace dares to attack our liches country, it means that they are going to start a war.”<br/><br/>The liches king stared at them coldly, his eyes filled with coldness. “If the Dragon Palace wants to start a war, then our liches country doesn’t have to worry at all. Destroy the Dragon Palace!”<br/><br/>He roared the last four words.<br/><br/>Destroy the Dragon Palace.<br/><br/>The leader of the forces surrounding the starry sky had destroyed one city of the Lich Kingdom, so the Lich Kingdom could naturally take revenge and declare war.<br/><br/>“Lord Lich King, the Dragon King is very powerful. He is most likely heading to our other cities right now. We must be prepared.”<br/><br/>A Lich City Lord spoke and frowned slightly. “If we go to destroy the Dragon Palace, then once the Dragon King continues to attack our main city, we won’t be able to do anything.”<br/><br/>“We will definitely take revenge for destroying our Scorpion Imperial City.”<br/><br/>The city Lord roared with killing intent, “I have an idea. Half of the experts will attack the Dragon Palace, and the other half will stay in the Lich Kingdom. All the main cities will be sealed off and be on high alert. Once a main city is attacked, inform everyone to come and help and destroy the Dragon Palace.”<br/><br/>“Okay!”<br/><br/>The Lich King pondered for a moment and nodded heavily.<br/><br/>As long as they were on high alert, they would only need a few seconds to rush over to help through the teleportation formation.<br/><br/>The Dragon King was only one person, so it wasn’t difficult for them to deal with him.<br/><br/>Half of the experts in the lich kingdom were enough to resist and kill the Dragon King.<br/><br/>As for the other half, they would go to surround Lu Xingkong and attack the Dragon Palace.<br/><br/>“Go back and plan!”<br/><br/>The Lich King ordered. The group of powerhouses immediately flew towards the main city behind them.<br/><br/>…<br/><br/>Just as the Lich Kingdom was discussing everything, Wang Xian had already left the scorpion imperial city.<br/><br/>He used the eight luminaries dragon scale to easily change his aura to prevent himself from being chased.<br/><br/>“I can’t fly any deeper. The strongest person at the edge of the heaven-splitting primordial land is a universe knight at level eight. If I go deeper, there will be even stronger ones. Furthermore, the territory I’m in now seems to be the territory of another powerful force.”<br/><br/>Wang Xian looked at the map on the AI and mumbled.<br/><br/>It was more dangerous in the deeper regions. Wang Xian was not prepared to venture deeper.<br/><br/>At the edge of the heaven-splitting prehistoric land, the strength of the Lich Kingdom could be ranked in the top three. The territory he was in now was also the territory of a very powerful force.<br/><br/>“I’ll wander around for five to six days before heading to the next city.”<br/><br/>Wang Xian was making a plan in his mind as he flew towards the right.<br/><br/>He was currently flying in human form. In human form, he looked extremely tiny in the heaven-splitting chaotic land.<br/><br/>Sometimes, an ordinary bug would be much bigger than him.<br/><br/>Buzz! Buzz! Buzz<br/><br/>“Eh?”<br/><br/>When he was flying for three days in the heaven-splitting chaotic land, a powerful energy fluctuation suddenly came from the Left Front.<br/><br/>Sensing this energy fluctuation, he was surprised.<br/><br/>This energy fluctuation was like a numinous treasure.<br/><br/>He slightly narrowed his eyes and quickly flew in that direction.<br/><br/>“Dragon Eye!”<br/><br/>When he gradually approached, he sensed waves of aura, and the dragon eye flickered.<br/><br/>The scene in front of him appeared in his line of sight, and an earthy yellow shield slowly flew up from the underground.<br/><br/>The entire shield looked extremely ancient. There were even patterns of heaven and earth on it.<br/><br/>“This is? A spiritual treasure unearthed?”<br/><br/>Wang Xian was astonished.<br/><br/>There were many acquired spiritual treasures in the heaven-opening primal continent, especially acquired spiritual treasures. If one was lucky, one would be able to pick them up in the heaven-opening primal continent.<br/><br/>It was possible to pick up acquired spiritual treasures, but the probability was even lower.<br/><br/>The discovery of a spiritual treasure was an opportunity for any living being.<br/><br/>If one could obtain a spiritual treasure, it would be a treasure that belonged to oneself.<br/><br/>The shield in front of him contained a powerful force. It was definitely not at the level of an acquired Supreme Treasure.<br/><br/>This was an acquired Supreme Treasure.<br/><br/>“I really didn’t expect to encounter an acquired Supreme Treasure. My Luck is pretty good.”<br/><br/>Wang Xian narrowed his eyes slightly. An acquired treasure was also a powerful treasure to a powerhouse at his level.<br/><br/>“I’m not the only one. There are many people around.”<br/><br/>Wang Xian swept his gaze across the area. In his line of sight, there were three groups of people around the earthy yellow shield.<br/><br/>There were many earthy yellow giant python demonic beasts with earthy yellow horns. They scanned their surroundings with cold eyes.<br/><br/>An existence that looked like a mummy was wrapped in white cloth.<br/><br/>There were also more than ten lich experts from the Lich Kingdom.\t\t\t\t\t\t</div>", "images": {}, "success": true}