{"id": 328, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072557.html", "title": "Chapter 3319 - 3319 3318 Lowered His Head And Admitted Defeat", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3319 - 3319 3318 Lowered His Head And Admitted Defeat</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3319 3318 lowered his head and admitted defeat<br/><br/>“Dragon Palace, don’t be so arrogant. Our Lich Kingdom will never stop until we destroy your Dragon Palace. Unless you never come out, I will kill every single one of you!”<br/><br/>The Lich King stared at the Dragon Palace with his blood-red eyes and roared angrily.<br/><br/>The experts from the Lich Kingdom sent a message.<br/><br/>Five insect city was destroyed. The teleportation array they had set up in advance in the city was destroyed, and almost all the disciples in five insect city were killed.<br/><br/>The losses this time were no less than that of scorpion imperial city.<br/><br/>Even though he had made preparations, a city was still destroyed by the Dragon King, which made him extremely angry.<br/><br/>A city being destroyed was not a small matter.<br/><br/>“Lord Lich King, what… What should we do now?”<br/><br/>The experts of the Lich Kingdom said from the side with ugly expressions.<br/><br/>They had vowed to destroy the dragon palace, but instead of destroying it, the Dragon Palace destroyed another city.<br/><br/>This time, the Lich Kingdom was humiliated.<br/><br/>“Continue to set up the array, seal the array, seal the Dragon Palace, and make sure that no one can come out. Make sure that the Dragon Palace can’t absorb the energy of the universe.”<br/><br/>The Lich King roared with a grim expression.<br/><br/>“Yes!”<br/><br/>The surrounding experts of the Lich Kingdom immediately responded.<br/><br/>At this time, the Lich Kingdom couldn’t just bow its head and admit defeat! They still had methods!<br/><br/>Seal the Dragon Palace!<br/><br/>Cut off the Dragon Palace from absorbing the energy of the universe.<br/><br/>Once the entire Dragon Palace was sealed, without resources or excess energy, how would the members of the Dragon Palace cultivate?<br/><br/>How would they come out?<br/><br/>The Lich King even had an idea.<br/><br/>He wanted to turn this space into an enormous cage and lock the entire Dragon Palace in it.<br/><br/>If they couldn’t break through the Dragon Palace, they would never let the members of the Dragon Palace get out.<br/><br/>The experts of the Lich Kingdom immediately started to move.<br/><br/>A new formation began to form.<br/><br/>“Is the Lich Kingdom launching the third wave of attacks?”<br/><br/>The experts in the surrounding void looked at them in shock.<br/><br/>It was obvious that the Lich Kingdom hadn’t given up yet.<br/><br/>At this moment, the Dragon Palace issued a statement that made everyone feel extremely powerful.<br/><br/>“Warn the Lich Kingdom to return all the divine kingdoms and treasures of the Righteous God race. Otherwise, we will slaughter your main cities one by one!”<br/><br/>A very overbearing and strong statement was also a very strong warning.<br/><br/>This caused an uproar among the experts of all the forces.<br/><br/>The Lich Kingdom was still attacking the Dragon Palace, but the Dragon Palace still dared to say such words, which shocked everyone.<br/><br/>However, in the face of the Dragon Palace’s statement, the others had to believe it.<br/><br/>Because so far, the Lich Kingdom had no way to deal with the Dragon Palace. The Dragon Palace had instead caused the lich kingdom to suffer heavy losses, and two main cities had been destroyed.<br/><br/>“Damn it!”<br/><br/>When the Lich King received the news, he became extremely furious.<br/><br/>He furiously waved his attacks toward the Dragon Palace.<br/><br/>“I want to turn this space into a prison of heaven and earth, locking everyone in the dragon palace inside and never letting them out.”<br/><br/>The Lich King roared furiously. His voice traveled far and wide.<br/><br/>“Hehe!”<br/><br/>At the same time, in the heaven opening primal continent, Wang Xian was sitting on top of a mountain peak. He was eating the barbecued meat of a universe knight-level desolate beast as he leisurely browsed through the information on the AI.<br/><br/>Especially the latest news regarding the Dragon Palace and the Lich Kingdom.<br/><br/>“After the five insect cities are not destroyed, I reckon the Lich Kingdom will be even more vigilant. They might even set up more hidden traps.”<br/><br/>Wang Xian took a bite of the barbecued meat as he muttered.<br/><br/>After the two main cities were destroyed, their vigilance would probably reach a terrifying level.<br/><br/>However, Wang Xian was still not in a hurry. Since the Lich Kingdom wanted to play with the Dragon Palace, he would play with them.<br/><br/>“There are still three days left. Ba Qi should have completed his breakthrough!”<br/><br/>Wang Xian narrowed his eyes and was full of smiles.<br/><br/>Once Ba Qi had the combat strength of a Level 8 universe knight, it would be even easier.<br/><br/>It would be even better to let Ba Qi enter a city alone with a level 8 universe knight. If he could find an opportunity to parasitize it, it would be very easy to destroy a city.<br/><br/>If there were no universe Knight Level 8 powerhouses guarding the city, he would let Ba Qi parasitize all universe Knight Level 7 liches.<br/><br/>Then, he would gather all the universe knights and kill them directly.<br/><br/>Finally, he would start to destroy the city.<br/><br/>After losing the supremacy level, Wang Xian and Ba Qi would attack together. It would only take about ten seconds to destroy a city.<br/><br/>Therefore, Wang Xian was not in a hurry.<br/><br/>If the Lich Kingdom wanted to destroy their dragon palace, he would have to drag it out with them.<br/><br/>He would see who would lower his head and admit defeat first.<br/><br/>As for the blockade of the Dragon Palace by the Lich Kingdom, Wang Xian did not care about it at all.<br/><br/>Even without the existence of an lie, there was a teleportation formation in the Dragon Palace which allowed one to head directly to other dragon palaces.<br/><br/>The actions of the Lich Kingdom had no effect on the dragon palace at all.<br/><br/>“Next time, let’s set our target at Blackwing city, which is next to the Lich Kingdom.”<br/><br/>Wang Xian looked at the map on the universe’s AI and muttered.<br/><br/>After finishing the roasted meat in his hand, he moved his body and flew directly towards Blackwing city.<br/><br/>Blackwing city could be said to be the second largest main city in the Lich Kingdom.<br/><br/>The number of experts in Blackwing city was much more than scorpion imperial city and five insect city.<br/><br/>Furthermore, black wind would constantly blow out from the blessed land in black wing city. This kind of black wind was extremely beneficial to cultivation.<br/><br/>This led to the gathering of many strong warriors from the Lich Kingdom in black wing city.<br/><br/>Wang Xian guessed that there should be a level 8 universe knight in Black Wing City.<br/><br/>Now, he hoped to have such a strong warrior in black wing city.<br/><br/>Once a lich with a level 8 universe knight combat strength, it would already be considered a city lord of the Lich Kingdom and a top-notch existence.<br/><br/>They understood the precautions, vigilance, and plans of the Lich Kingdom.<br/><br/>As long as they parasitized it, it would be much easier to destroy Blackwing city.<br/><br/>Wang Xian quickly flew on the heaven opening primal continent.<br/><br/>Based on the distance, he would need at least ten days to arrive.<br/><br/>However, within ten days, the elevation of the octahedron was completed.<br/><br/>“Open the array formation!”<br/><br/>At the same time, the Lich King shouted coldly from the sky above the Dragon Palace.<br/><br/>When the liches of the Lich Kingdom sealed the Dragon Palace, they had also spent a lot of money to set up a teleportation array.<br/><br/>This teleportation array could instantly bring the experts of the Lich kingdom to this area of void.<br/><br/>Such a long-distance teleportation cost a lot of treasures.<br/><br/>However, the Furious Lich Emperor didn’t care about such a huge consumption.<br/><br/>He wanted to accompany the Dragon Palace to the end.<br/><br/>“Lord Lich Emperor, the array has been opened!”<br/><br/>A Universe Knight Level 8 Lich reported.<br/><br/>“You guys guard here first, I’ll go over and make some arrangements!”<br/><br/>The Lich Emperor said with a cold expression and instantly left through the teleportation array.<br/><br/>He had some orders to give, some orders to defend the other cities, and some orders to destroy the Dragon King.\t\t\t\t\t\t</div>", "images": {}, "success": true}