{"id": 329, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072559.html", "title": "Chapter 3320 - 3320 3319 Was In An Uproar", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3320 - 3320 3319 Was In An Uproar</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3320 3319 was in an uproar<br/><br/>“Greetings, Lord Lich King!”<br/><br/>Within the Lich City, seven Level 8 universe knights from the Lich Kingdom bowed respectfully to the Lich King.<br/><br/>Within this hall, there were only a few of the strongest warriors from the Lich Kingdom.<br/><br/>Even a Level 7 universe Knight Lich wasn’t qualified to participate this time.<br/><br/>What happened in five bug city was completely out of the expectations of the Lich Emperor and the others.<br/><br/>Even though they had already set up a secret array, the array was still destroyed, which meant that it was most likely leaked by the great beings of the Lich Kingdom.<br/><br/>This leak might not have been intentional, but the result was the same for the Lich Emperor and the others.<br/><br/>Therefore, the secret teleportation arrays set up in the following major cities could only be known by Universe Knights Level 8 Great Beings, and the rest of the disciples were not informed.<br/><br/>“Continue to increase the number of teleportation arrays. In addition, you have to control at least three channels of teleportation arrays. These three channels of teleportation arrays can only be known by yourselves.”<br/><br/>Lich Emperor ordered with a cold face.<br/><br/>“Yes, Lord Lich Emperor. We will prepare immediately. This time, as long as that Dragon Emperor enters our cities again, we will definitely destroy him!”<br/><br/>A Lich said confidently.<br/><br/>“Right now, we still have ten main cities. We can split up into seven cities to defend them. There is a seven out of ten chance that if the Dragon King dares to continue attacking, the chances of US encountering him will be much higher.”<br/><br/>“When the time comes, as long as we can tie him down, it will be much easier to kill him!”<br/><br/>A Lich said slowly.<br/><br/>The few liches beside him nodded in agreement.<br/><br/>“Now, all the races and forces at the edge of the Heaven opening primal continent are laughing at Our Lich Kingdom. This time, we must not let the Dragon King destroy our city. We must kill him!”<br/><br/>The Lich King roared with a murderous look on his face.<br/><br/>“Yes!”<br/><br/>The group of peak liches from the Lich Kingdom immediately replied.<br/><br/>“I will personally guard the Lich City. The seven of you will go to the other seven main cities.”<br/><br/>As the Lich King spoke, he waved at them.<br/><br/>The group of liches immediately left and began to set up teleportation arrays to guard the main cities.<br/><br/>The Lich King sat on the throne, his face filled with anger and killing intent.<br/><br/>Two cities were destroyed and a large number of disciples were killed.<br/><br/>The arrogance of the Dragon Palace on the universe ai.<br/><br/>The Lich King would make the Dragon Palace pay a heavy price!<br/><br/>Time passed by day by day. Wang Xian was getting closer and closer to black wing city. When he was rushing over, Ba Qi had already achieved a breakthrough in the Dragon Palace.<br/><br/>Now, Ba Qi had become the second universe knight in the Dragon Palace with level 8 combat strength.<br/><br/>Eight Qi’s breakthrough was much easier for him to follow.<br/><br/>On the eighth day, around the Dragon Palace, the entire starry sky had undergone a terrifying change.<br/><br/>There was no light in the entire starry sky, and there was no sign of life.<br/><br/>At first glance, it was pitch black and eerie, and it was filled with deathly stillness.<br/><br/>Only the Dragon Palace was emitting a weak light, and it was like a bright lamp in this starry sky.<br/><br/>And around the Dragon Palace, there were many dark red long lines.<br/><br/>These blood red long lines completely surrounded the dragon palace.<br/><br/>Sealing Formation!<br/><br/>This was the sealing formation that the Lich Kingdom spent eight days to create.<br/><br/>The formation sealed off the entire space, turning this place into a deathly silent place.<br/><br/>As long as the formation wasn’t withdrawn, the disciples of the Dragon Palace wouldn’t be able to walk out.<br/><br/>These powerful sealing formations were enough to stop even universe knights at level 8.<br/><br/>During these eight days, all the powerhouses in the surrounding starry sky, even those at the edge of the land, understood what the Lich Kingdom was doing.<br/><br/>Since they couldn’t destroy the Dragon Palace, they would seal it completely.<br/><br/>The sealed Dragon Palace would be destroyed with time.<br/><br/>This was a very good idea.<br/><br/>Next, everyone was waiting for the Dragon Palace’s response.<br/><br/>From the statement of the Dragon Palace, it seemed that the Dragon Palace was not afraid of the Lich Kingdom.<br/><br/>All the powerhouses were waiting for this battle.<br/><br/>“We’re Here!”<br/><br/>Two days had passed. Wang Xian squinted his eyes as he stood in front of a city.<br/><br/>The current city of the Lich Kingdom was still the same as before. One could only enter but not leave.<br/><br/>At the entrance of the city of Blackwing City, there was a black wing spreading its wings. From Afar, it was filled with a powerful aura.<br/><br/>Wang Xian did not enter through the main entrance because entering at this time might arouse vigilance.<br/><br/>After flying around for a week, his figure was hidden in the void as he flew towards Blackwing city.<br/><br/>As a huge blackwing city, the top detection formations in the Lich Kingdom could not cover the entire city.<br/><br/>Wang Xian entered the city successfully and transformed into a lich with wind-attribute wings and green scales.<br/><br/>After building a small nest in a slightly remote area, Wang Xian immediately set up a demonic altar.<br/><br/>Buzz<br/><br/>Soon, the figures of an lie and Ba Qi Mo Sha appeared in front of him.<br/><br/>Wang Xian’s gaze landed on Ba Qi, and a smile appeared on his face.<br/><br/>“Both of you, prepare to make your move. Be careful, we are not in a hurry. 90% of Black Wing City has a universe knight level eight lich guarding it. We must succeed in parasitizing it. It doesn’t matter if it takes some time, we can afford it!”<br/><br/>Wang Xian instructed Ba qi and Mo Sha.<br/><br/>“Yes, Dragon King. Leave this to us!”<br/><br/>Ba Qi and Mo Sha replied immediately.<br/><br/>Their figures moved and they left immediately.<br/><br/>Wang Xian sat in this temporary nest and waited quietly.<br/><br/>He didn’t go anywhere but waited here for the news of Ba Qi and Mo Sha.<br/><br/>Blackwing city. The size of the city was almost double that of scorpion imperial city. There were many more disciples and experts in the Lich Kingdom.<br/><br/>“Dragon King, we have encountered some trouble!”<br/><br/>Three days later, Ba Qi, who was parasitizing a Level 7 universe Knight Lich, walked over and reported with a slight frown.<br/><br/>“What’s Wrong?”<br/><br/>Wang Xian raised his eyebrows and asked him.<br/><br/>“There is indeed a level 8 universe Knight Lich in Black Wing City. That Lich is called the Thousand Eyes City Lord. He is currently at the center of the black wing grotto-heaven.”<br/><br/>“According to the memories of this body, thousand-eye city leader’s power is among the top three of the universe knights and Level 8 great beings in the Lich Kingdom. He is also very vigilant and has great investigative abilities. I’m afraid the success rate of parasitizing him is not high!”<br/><br/>Ba Qi said with a serious expression.<br/><br/>There were also great beings in the Lich Kingdom, just like the Lich King. An ordinary universe knight with level 8 combat power was simply not his opponent.<br/><br/>Black wing city was the second largest city in the Lich Kingdom. The thousand-eyed city Lord was also one of the strongest.<br/><br/>“If Mo Sha can also break through to the level 8 combat strength of a universe knight, how high is the success rate?”<br/><br/>Wang Xian squinted his eyes and asked.<br/><br/>“80% !”<br/><br/>Ba Qi replied.<br/><br/>“Alright, inform Mo Sha to return to the Dragon Palace to break through first. We can afford to wait for such a short period of time!”<br/><br/>Wang Xian said indifferently with a cold expression on his face.<br/><br/>He had killed two experts of the wrapped corpse race and obtained the corpses of two level eight universe knights. Now, these resources were of great use!\t\t\t\t\t\t</div>", "images": {}, "success": true}