{"id": 325, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072551.html", "title": "Chapter 3316 - 3316 3315 Attack Activated", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3316 - 3316 3315 Attack Activated</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3316 3315 attack activated<br/><br/>“Lord Lich Emperor, 28 universe knight level eight arrays have been set up. Once activated, even a universe knight level nine great being will die!”<br/><br/>“There are also more than 50 universe knight level seven arrays and 200 universe knight level six arrays.”<br/><br/>“The arrays are one after another. After the final eye of Darkness Array is activated, even a acquired true treasure can penetrate it!”<br/><br/>In the territory of the ancient sea race, above a planet ocean, a group of liches were floating in the sky.<br/><br/>A weak-looking liches reported.<br/><br/>“Very good!”<br/><br/>Liches smiled.<br/><br/>This time, the great beings he brought were all from the array faction.<br/><br/>After four to five days of setting up the array, even a universe knight Level 9 great being at the center of the array could be killed instantly.<br/><br/>This time, in order to set up the array, they even used a powerful pre-heaven true treasure.<br/><br/>When the array was set up one after another, the power of the last attack was enough to break a complete pre-heaven true treasure.<br/><br/>One could imagine how terrifying this attack was.<br/><br/>Even if it was lich emperor facing this kind of array, he would only die.<br/><br/>Of course, it was basically impossible to use this kind of array against the enemy.<br/><br/>The enemy wouldn’t give you four or five days to set up an array formation, much less stand there and do nothing.<br/><br/>Only now could they set up so many arrays in order to break through the Dragon Palace.<br/><br/>“All Disciples of the Lich Kingdom, prepare to activate the array formation!”<br/><br/>The Lich King roared, his eyes filled with violent killing intent.<br/><br/>“Yes!”<br/><br/>Thousands of liches gave off terrifying auras.<br/><br/>“HMPH!”<br/><br/>Within the Dragon Palace, Prime Minister Turtle and the leaders and queens stared coldly at the scene in the sky.<br/><br/>They didn’t believe that the Lich Kingdom could unleash the power of a universe ruler.<br/><br/>“This is the attack that the lich kingdom has been preparing for four to five days. Just looking at the arrays from afar is enough to make one’s heart palpitate and fear!”<br/><br/>“Will the Dragon Palace be able to withstand it? Once the Dragon Palace is unable to withstand it, all the members of the Dragon Palace will probably be massacred!”<br/><br/>In the surrounding void space, the attack of the Lich Kingdom on the Dragon Palace had attracted countless attention.<br/><br/>Some of the braver experts who surrounded Lu Xingkong came to the surrounding areas to watch the battle.<br/><br/>Because the Lich Kingdom had rules and restrictions, they were not afraid that the experts of the Lich Kingdom would attack them.<br/><br/>As long as they avoided the battlefield, nothing would happen.<br/><br/>Everyone was staring at the battlefield.<br/><br/>“Activate the array, destroy the Dragon Palace and destroy all the reckless things in the Dragon Palace!”<br/><br/>The Lich King gave the order.<br/><br/>In the next moment, the arrays started to operate, and the seawater around the dragon palace evaporated instantly.<br/><br/>Even the entire planet began to collapse rapidly.<br/><br/>One had to know that this was the main planet of the ancient sea race. It was abnormally hard and enormous.<br/><br/>However, it started to collapse the moment the array was activated.<br/><br/>Then, the array descended!<br/><br/>…<br/><br/>“Do it!”<br/><br/>At the same time, in the five insect city, the five insect Wonderland was different from the entrance of the Scorpion Emperor Wonderland.<br/><br/>From the outside, the five insect Wonderland looked like a gigantic crustacean-type creature.<br/><br/>However, it was lifeless and its area was much smaller than the Scorpion Emperor’s Wonderland.<br/><br/>It only took up an area of about 10,000 kilometers.<br/><br/>The entrance was located at the mouth of the crustacean. It was not pitch-black inside but contained a majestic energy.<br/><br/>Wang Xian moved his body and flew directly into the five Insect Wonderland.<br/><br/>“Roar!”<br/><br/>The moment Wang Xian entered the grotto-heaven, a low roar was heard throughout the entire blessed land!<br/><br/>Inside the grotto-heaven, there were many small-sized crustacean nests.<br/><br/>There were not many nests, but there were also quite a number of them. There were about 100,000 of them.<br/><br/>“Intruders!”<br/><br/>When the roar was heard, everyone in the grotto-heaven knew that someone had forcefully entered the grotto-heaven.<br/><br/>“Who broke in? Do You Want to Die?”<br/><br/>Numerous liches that were emitting a powerful aura flew out from the lair. Their eyes were filled with a violent killing intent.<br/><br/>Anyone who invaded the grotto-heaven would be killed without mercy.<br/><br/>Boom! Boom! Boom<br/><br/>Figures flew out from the innermost lair rapidly.<br/><br/>Their eyes were filled with vigilance.<br/><br/>After the scorpion imperial city was destroyed, the entire liches kingdom had entered a state of vigilance.<br/><br/>“Die!”<br/><br/>Without any hesitation, Wang Xian waved his arm and the five elements Millstone appeared in front of him. He placed his palm on it.<br/><br/>A grey energy swept forward.<br/><br/>The long river of destruction engulfed the entire grotto-heaven blessed land.<br/><br/>Buzz<br/><br/>At the front, the thousands of lich powerhouses didn’t even have time to react before they died instantly.<br/><br/>“Not good, it’s that Dragon King, the Dragon King is invading!”<br/><br/>At this time, the 10 universe Knight Level 7 warriors at the back saw this scene and their expressions changed.<br/><br/>That Dragon Palace Dragon King actually came to attack their five wormholes!<br/><br/>“Dragon King, you’ve chosen the wrong opponent, I’ll let you die here today!”<br/><br/>The Universe Knight Level 7 liches revealed a ferocious expression.<br/><br/>Choosing their five wormholes was a huge mistake!<br/><br/>In an instant, a compass appeared in the hands of five level 7 universe knights and liches.<br/><br/>“Activate the formation and trap that Dragon King!”<br/><br/>They roared.<br/><br/>Crack Crack Crack<br/><br/>In the next moment, the entire blessed land started to change.<br/><br/>One by one, the carapace formed an egg and surrounded Wang Xian.<br/><br/>In this small space, there was no way to dodge.<br/><br/>When the river of annihilation landed on the formation, it was instantly blocked.<br/><br/>“Huh?”<br/><br/>Wang Xian looked at this strange formation and his gaze focused.<br/><br/>“Dragon Tomb!”<br/><br/>He roared and released his laws and Divine Arts.<br/><br/>A dragon tomb attacked the formation directly.<br/><br/>Boom! Boom! Boom<br/><br/>However, when the dragon tomb struck the formation, the carapace did not budge and there were no cracks.<br/><br/>“Hahaha, don’t even think about breaking the array, just wait for your death!”<br/><br/>The Five Knight Level 7 liches who were controlling the array laughed wildly when they saw this scene.<br/><br/>“I’ve contacted the Lords of our liches country, they’ll be here soon!”<br/><br/>The surrounding five Knight Level 7 liches looked and smiled.<br/><br/>This array had the blessing of the grotto-heaven blessed land, it was impossible for a knight level 8 to break it.<br/><br/>That Dragon King was dead!<br/><br/>…<br/><br/>“Hong Hong Hong!”<br/><br/>At this time, on another battlefield, the vast arrays started to pour towards the Dragon Palace.<br/><br/>Firstly, the combined attacks of over 200 universe knight level 6 arrays were still very terrifying.<br/><br/>Following that, over 50 universe Knight Level 7 arrays.<br/><br/>The terrifying attack landed on the Dragon Palace, but it didn’t move at all.<br/><br/>However, the Lich Emperor and the others weren’t in a rush, the next part was the main event.<br/><br/>The level 8 knight arrays started to pour down!\t\t\t\t\t\t</div>", "images": {}, "success": true}