{"id": 323, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072547.html", "title": "Chapter 3314 - 3314 3313 Was Shocked By The News Surrounding Lu Xing Kong", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3314 - 3314 3313 Was Shocked By The News Surrounding Lu Xing Kong</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3314 3313 was shocked by the news surrounding Lu Xing Kong<br/><br/>“What’s going on?”<br/><br/>The expressions of the warriors who had just come out of the Dragon Palace changed drastically when they felt this suffocating aura.<br/><br/>They were all universe knights at Level 4 and 5, and they were not weak even in the surrounding Lu Xing Kong.<br/><br/>However, the aura coming from afar made them tremble!<br/><br/>What level was this?<br/><br/>The expressions of the great beings from over a dozen organizations changed drastically, and they hurriedly fled into the distance.<br/><br/>Hong<br/><br/>Right at this moment, they saw a centipede flying over with a terrifying aura. On the Centipede’s body were figures that terrified them.<br/><br/>This group of people did not even bother to conceal their aura.<br/><br/>“Hiss, so many great beings, just who are they?”<br/><br/>The experts from the dozens of forces asked in shock.<br/><br/>“Those who aren’t from the Dragon Palace, Scram!”<br/><br/>At this moment, a cold voice sounded. An expert from the Lich kingdom stared at the people from the dozens of forces with a grim expression.<br/><br/>Under this terrifying gaze, everyone felt their scalps go numb and hurriedly retreated further away.<br/><br/>“They? What are they doing? Are they experts from the heaven splitting chaotic continent?”<br/><br/>Everyone widened their eyes and looked shocked<br/><br/>How could so many experts suddenly appear?<br/><br/>Weren’t the experts of the heaven opening desolate continent forbidden to attack the forces surrounding Lu Xingkong?<br/><br/>How could they dare to violate the rules?<br/><br/>They flew far away and looked in their direction.<br/><br/>“Dragon Palace, you deserve to die. Dragon King, you dare to destroy our witchcraft kingdom’s Scorpion Imperial City? You are starting a war with our witchcraft kingdom. From today on, the Dragon Palace will be our enemy and will not rest until it is destroyed!”<br/><br/>At this moment, the witchcraft king’s voice resounded throughout the starry sky.<br/><br/>This was a declaration from the Witchcraft Kingdom, and also a declaration of war from the Witchcraft Kingdom.<br/><br/>“What… What’s going on? F * ck, the Dragon King is not in the Dragon Palace, but has entered the heaven-opening primeval continent and destroyed a city of the witchcraft kingdom. This… This is too ruthless!”<br/><br/>“Hiss, is the Dragon King so fierce? The Lich Kingdom stole the spoils of war from the Dragon Palace, and the Dragon King went straight to the Lich Kingdom and destroyed a city?”<br/><br/>“Oh my God!”<br/><br/>At this moment, the experts from the dozens of forces opened their mouths in disbelief.<br/><br/>The fact that the treasures and divine kingdoms of the Righteous God race were taken away by the Lich Kingdom was known by the entire surrounding starry sky.<br/><br/>Even the forces at the edge of the heaven opening primal continent knew about it.<br/><br/>All the forces in the surrounding starry sky were clear about the strength of the Lich Kingdom.<br/><br/>It was a force with more than a dozen universe knights and level eight powerhouses, and it occupied many paradises in the heaven opening primal continent.<br/><br/>Their strength and foundation were very terrifying.<br/><br/>Everyone thought that the Dragon Palace would calm things down and take this loss secretly.<br/><br/>However, they didn’t expect that the Dragon King would directly charge into the heaven opening desolate continent and destroy a main city of the Lich Kingdom.<br/><br/>He was going to directly start a war with the Lich Kingdom!<br/><br/>This was too fierce, he was going all out!<br/><br/>The strength of the Lich Kingdom wasn’t something the Dragon Palace could contend against.<br/><br/>Now, the experts of the Lich Kingdom had directly charged over.<br/><br/>This…<br/><br/>The experts of the various factions gulped. At the same time, they spread this shocking news to the AI of the universe.<br/><br/>“Haha, The Lich Kingdom was already an enemy of the Dragon Palace when you dared to steal our treasures. Since the Dragon Palace dared to destroy your Scorpion Imperial City, We Aren’t afraid of your revenge. Do you really think that the Dragon Palace is afraid of You?”<br/><br/>Prime Minister Gui stood in the Dragon Palace and roared without any fear.<br/><br/>The Dragon Palace had already received the news before the experts of the Lich Kingdom arrived.<br/><br/>All the members of the Dragon Palace had already entered the Dragon Palace.<br/><br/>Then, like the main cities of the Lich Kingdom, the Dragon Palace defended.<br/><br/>They wanted to see who would admit defeat in the end.<br/><br/>“You’re courting death! Blow up the Dragon Palace!”<br/><br/>The Lich King roared furiously and flew toward the sky of the Dragon Palace at a terrifying speed.<br/><br/>Around him, more than a thousand experts of the Lich Kingdom followed closely and attacked the Dragon Palace.<br/><br/>“Die!”<br/><br/>When they flew over, they had already started to gather the terrifying power of laws.<br/><br/>In an instant, the entire sky above the Dragon Palace looked like the end of the world.<br/><br/>In the next moment, all kinds of terrifying attacks poured toward the dragon palace.<br/><br/>“Hehe.”<br/><br/>In the Dragon Palace, all the members of the Dragon Palace looked at them coldly.<br/><br/>“Bang, Bang, Bang!”<br/><br/>The experts from the forces surrounding Lu Xingkong looked at this attack in shock.<br/><br/>The energy that could easily destroy all of them landed on the Dragon Palace, making an extremely loud noise.<br/><br/>All kinds of energy tore through the void and flooded the Dragon Palace.<br/><br/>In the sky, the Lich King stared at the Dragon Palace coldly with his blood-red dragon eyes.<br/><br/>“What?”<br/><br/>At this moment, when they sensed that the dragon palace was not damaged at all, their expressions changed slightly.<br/><br/>“Keep attacking. I don’t believe that we can’t break the Dragon Palace!”<br/><br/>The Lich King roared with a cold face.<br/><br/>“Hong Hong Hong!”<br/><br/>The next moment, another round of attacks rained down on the Dragon Palace.<br/><br/>The weakest attack was at least a level 5 knight.<br/><br/>With such power, no force in the surrounding Lu Xing Kong could withstand it.<br/><br/>The energy poured down, but the dragon palace remained unmoved, unharmed.<br/><br/>“This… The Lich kingdom still hasn’t broken through the defense of the Dragon Palace.”<br/><br/>“Is this the Dragon Palace’s Trump Card? They dared to provoke the Lich kingdom because they relied on the invincible defense of the Dragon Palace?”<br/><br/>The experts from more than ten forces in the distance murmured.<br/><br/>“Damn it!”<br/><br/>The Lich King glanced at the Dragon Palace below and didn’t continue to attack.<br/><br/>He had seen the Dragon Palace’s defense.<br/><br/>However, he didn’t give up. He didn’t believe that they couldn’t open a dragon palace with their strength.<br/><br/>“Set up a large-scale array formation!”<br/><br/>The Lich King ordered.<br/><br/>They were wizards, and the experts he brought this time were biased toward arrays.<br/><br/>As long as they were given enough time to set up a powerful array formation, they were confident that they could break through the Dragon Palace.<br/><br/>“Yes!”<br/><br/>The other experts of the Lich Kingdom immediately replied.<br/><br/>They were mentally prepared for this scene.<br/><br/>After all, the defense of the Dragon Palace was well known.<br/><br/>They could guess that the Dragon King dared to openly start a war because of the Dragon Palace.<br/><br/>However, they were confident in their own strength.<br/><br/>“Seal the surroundings, if any warrior from the Dragon Palace dares to come out, kill them immediately!”<br/><br/>“Any creature that steps into the Dragon Palace’s territory will be treated as our enemy.”<br/><br/>A Knight Level 8 Lich roared.\t\t\t\t\t\t</div>", "images": {}, "success": true}