{"id": 326, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072553.html", "title": "Chapter 3317 - 3317 3316 Lowered His Head And Admitted Defeat", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3317 - 3317 3316 Lowered His Head And Admitted Defeat</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3317 3316 lowered his head and admitted defeat<br/><br/>“Hong, Hong, Hong!”<br/><br/>Above the ocean of the main planet of the ancient sea race, terrifying attacks poured down.<br/><br/>The moment the level 8 knight arrays were activated, the entire planet started to scatter.<br/><br/>The incomparably huge planet slowly became the dust of the universe.<br/><br/>In the void space, there were only three dragon palaces floating there.<br/><br/>Fire Dragon Palace, Demon Dragon Dark World, Dragon Palace.<br/><br/>The Dragon Palace that was mainly attacked was completely in the state of Doomsday.<br/><br/>When the first level 8 Knight Array landed on the Dragon Palace, there were no ripples or fluctuations in the entire dragon palace.<br/><br/>It stood tall in the void space, under the cover of all kinds of terrifying energy, there were no ripples at all.<br/><br/>One after another, the level 8 Knight Array landed on the Dragon Palace.<br/><br/>When the fifth level 8 universe Knight Array landed on top of the Dragon Palace and was blocked, the expression of the Lich King turned cold.<br/><br/>However, it was not the end yet, and it was hard to say.<br/><br/>At the end of the array, there was the most powerful eye of Darkness Array<br/><br/>“Hahaha, that Dragon King is trapped, trapped, he is going to die!”<br/><br/>At this moment, in the fifth wormhole, when the array formation trapped Wang Xian, a group of Level 7 universe knights from the Lich Kingdom revealed excited expressions.<br/><br/>They knew how powerful this trapping array was. Once the Dragon King entered, he would never be able to come out again.<br/><br/>“Huh?”<br/><br/>In the space of the shell array formation, Wang Xian’s terrifying attacks landed on it. There was no trace of the shell at all.<br/><br/>This terrifying defensive power made his face filled with astonishment.<br/><br/>As what Mo Sha had said, once he was trapped, he wouldn’t be able to break through.<br/><br/>“Now, it’s up to Mo Sha.”<br/><br/>Wang Xian said.<br/><br/>“PFFT!”<br/><br/>A wave of corrosive and evil energy surged into his body and melted his life force.<br/><br/>The formation compass in his hand was snatched away in an instant.<br/><br/>Everything happened in an instant.<br/><br/>“Predemon, what are you doing! ?”<br/><br/>The liches who were laughing and excited a moment ago had a drastic change in expression when they saw this sudden change.<br/><br/>They had never expected that one of their comrades would suddenly kill one of them.<br/><br/>And they even took the array compass away.<br/><br/>With the compass taken away, the array started to crumble without anyone supporting it.<br/><br/>An array of this level couldn’t have any problems at any point. The moment it did, it would be in big trouble.<br/><br/>A hole appeared on the right side of the shell array.<br/><br/>The other eight universe knights looked at the lich with shock and anger.<br/><br/>“Hahaha, die! Those who provoke us, Dragon Palace, will all die!”<br/><br/>It was Mo Sha who attacked.<br/><br/>At this moment, his face was full of excitement and malevolence.<br/><br/>“Who are you? Kill him, he is no longer a predemon!”<br/><br/>“Kill him!”<br/><br/>The group of five Bug City Universe Knight Level 7 liches roared furiously and attacked Mosha with malevolence.<br/><br/>Boom<br/><br/>However, at this moment, a terrifying figure was rapidly attacking them from the formation in front of them.<br/><br/>Pu! Pu! Pu! Pu<br/><br/>The moment Wang Xian caught the problem with the formation, he unfurled his incorporeal holy wings and instantly attacked the eight universe Knight Level 7 liches.<br/><br/>His speed was abnormally terrifying. A level seven universe knight wouldn’t be able to fight back at all.<br/><br/>The only trump card of the five bug city was destroyed by the predemon with the help of the formation in the grotto-heaven!<br/><br/>Wang Xian’s terrifying dragon claws instantly killed five level seven universe knights.<br/><br/>His figure continued to flash as he attacked the other three.<br/><br/>“No, no, no, the speed of the Dragon Palace is too fast!”<br/><br/>“This… We have already passed the news to the great beings in the central city of the Lich Kingdom. According to their speed, they should be here in a few seconds, but they are not here yet. What exactly happened!”<br/><br/>“No, don’t kill me, I don’t want to Die!”<br/><br/>The remaining three universe knights and level seven liches roared in despair.<br/><br/>The betrayal of one of their companions made them feel shocked and furious. However, the news of the invasion of five insect city had already been spread.<br/><br/>According to the speed of the Lord of the Lich Kingdom, they could reach within a few seconds. It had already been dozens of seconds, yet there was still no reaction.<br/><br/>What was going on?<br/><br/>What exactly happened?<br/><br/>“PFFT! PFFT!”<br/><br/>However, they couldn’t figure it out even until they died.<br/><br/>“Kill!”<br/><br/>Wang Xian killed them. When he saw that the Lich Kingdom didn’t send any reinforcements, he smiled.<br/><br/>He knew that the secret teleportation formation of the Lich Kingdom was the one that Mo sha had found out about. It had been destroyed.<br/><br/>Once it was destroyed, once a large number of level eight universe knights didn’t arrive, it was time for him to kill!<br/><br/>“Kill!”<br/><br/>Wang Xian waved his arm and the destructive power formed by the five elements millstone filled the entire blessed land!<br/><br/>Those liches who were hiding in their lairs were instantly killed.<br/><br/>He moved and flew out of the five worms grotto-heaven. His cold gaze swept across the city of the Lich Kingdom.<br/><br/>“Die!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>Wang Xian immediately transformed into a terrifying divine dragon. Streams of dragon breath shot downwards.<br/><br/>On the five elements grinding ground, the gray energy was like the river of time, washing away all life.<br/><br/>The Rampage began!<br/><br/>“What’s going on? How did the teleportation formation in five Bug City break down? This is a secret formation that we have set up. Even the higher-ups in five bug city don’t know much about it!”<br/><br/>“Damn it, what’s the situation in five bug city now?”<br/><br/>At the same time, in the center of the Lich Kingdom, seven universe knights and level eight liches stood in front of a teleportation array, looking extremely embarrassed.<br/><br/>When they received the message from five bug city asking for help, they instantly arrived in front of the teleportation array.<br/><br/>However, they were shocked and angry to find that the opposite side of the teleportation array had been destroyed.<br/><br/>Even the teleportation array that they had secretly set up had been destroyed.<br/><br/>They knew very well what this meant.<br/><br/>The situation in five insect city was probably not objective.<br/><br/>“Not good. The disciples of five insect city have sent a message. They are suffering from a terrifying attack from a divine dragon. Five insect city is going to be destroyed. They have no power to resist!”<br/><br/>At this moment, an expert from the Lich Kingdom roared with blood-red eyes.<br/><br/>After Scorpion Imperial City, the five bug city had also suffered a catastrophe.<br/><br/>This was a huge blow to their lich kingdom.<br/><br/>“Hurry to the nearest main city of the five bug city, Hurry there!”<br/><br/>A lich expert clenched his fists and suppressed the rage in his heart as he shouted in a low voice.<br/><br/>Their figures instantly disappeared.<br/><br/>But it would take them a few hours to get to five insects city.\t\t\t\t\t\t</div>", "images": {}, "success": true}