{"id": 320, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072541.html", "title": "Chapter 3311 - 3311 3310 Corpse-Wrapping Race", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3311 - 3311 3310 Corpse-Wrapping Race</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3311 3310 corpse-wrapping race<br/><br/>“I didn’t expect the discovery of a acquired treasure to attract so many experts. There are three universe knight level seven experts.”<br/><br/>Wang Xian stared ahead. In his line of sight, there was a universe knight level seven expert in each of the three forces.<br/><br/>There were also some experts surrounding them, but they didn’t dare to rush over.<br/><br/>“An acquired treasure. It’s a pretty good treasure!”<br/><br/>Wang Xian narrowed his eyes slightly.<br/><br/>In the middle of the battlefield, the strength of the three forces wasn’t too different. They were looking at each other vigilantly to prevent the other party from making a sudden move.<br/><br/>With the three forces in the balance, no one dared to make the first move to snatch it.<br/><br/>Whoosh<br/><br/>At this moment, Wang Xian’s figure flashed and instantly arrived at the side of the acquired treasure. He waved his arm and a wave of energy enveloped it.<br/><br/>“Not good, someone wants to snatch it!”<br/><br/>“Attack!”<br/><br/>“Roar!”<br/><br/>Wang Xian’s sudden appearance changed the situation of the three forces drastically. They instantly launched their attacks and attacked him.<br/><br/>Wang Xian ignored their attacks. The tai chi dragon spun around and easily blocked their attacks.<br/><br/>He stretched out his palm and directly grabbed the acquired Supreme Treasure Earth attribute shield in his hand.<br/><br/>“The opponent is very strong!”<br/><br/>“Universe Knight Level Eight!”<br/><br/>The expressions of the experts from the three forces changed slightly when they saw that their attacks were easily blocked.<br/><br/>Universe Knight Level Eight was an almost invincible existence in this region.<br/><br/>Buzz<br/><br/>Wang Xian moved his arm and directly kept the acquired Supreme Treasure.<br/><br/>“TSK TSK, as expected of the heaven-splitting primordial land. He obtained an acquired supreme treasure so easily.”<br/><br/>He mumbled and revealed a faint smile on his face.<br/><br/>“Run!”<br/><br/>Sensing Wang Xian’s unfriendly gaze, the group of liches from the Lich kingdom did not hesitate and fled into the distance.<br/><br/>Crash<br/><br/>Wang Xian flapped his incipient saint wings on his back and flew past their bodies at a terrifying speed.<br/><br/>“No, who are you? We are from the Lich Kingdom. Are you trying to make an enemy out of the Lich Kingdom?”<br/><br/>The Level 7 universe knight from the Lich Kingdom, who was in the lead, saw Wang Xian charging towards them. His expression changed drastically as he shouted in shock and anger.<br/><br/>“PFFT! PFFT!”<br/><br/>Wang Xian ignored their roars as more than ten experts from the Lich Kingdom were killed.<br/><br/>“Let’s Go!”<br/><br/>When the horned python saw this scene, it swayed its huge body and instantly fled into the distance.<br/><br/>“Senior, who are you? This treasure was unearthed in the territory of our corpse-wrapping race.”<br/><br/>The corpse-wrapping race expert, who was wrapped in white cloth and looked like a mummy, saw Wang Xian obtain the acquired treasure and saw him killing the experts from the Lich Kingdom. He asked in a cold voice as if he was a corpse talking.<br/><br/>“Acquired treasures belong to those who are capable.”<br/><br/>Wang Xian looked at them and said faintly.<br/><br/>He was naturally clear about the corpse-wrapping race. They were also one of the top factions at the edge of the heaven-opening and primal continent. Their strength was not weaker than the Lich Kingdom.<br/><br/>The cultivation method of the corpse-wrapping race was very special. Their physique was similar to that of humans, but they did not resemble humans.<br/><br/>“The acquired Supreme Treasure in our territory should belong to us, the corpse-wrapping race. Please return it to us, sir.”<br/><br/>The corpse-wrapping race leader, whose figure was completely covered by the white cloth, continued speaking in a cold voice.<br/><br/>When Wang Xian heard his words, he narrowed his eyes slightly and swept his gaze across the group of people. “Come and try it. See if you can take it away!”<br/><br/>The group of people from the corpse-wrapping race was slightly silent.<br/><br/>Their faces couldn’t be seen clearly, and neither could their eyes. It was unknown what they were thinking at this moment.<br/><br/>Wang Xian hesitated for a moment. He didn’t make a move. Instead, he turned around and flew out.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Just as he was about to fly out, strips of bloody white cloth swept towards him.<br/><br/>When he saw the terrifying power of the white cloth, his eyes narrowed slightly.<br/><br/>The other party was deliberately stalling for time just now.<br/><br/>The experts from the corpse-wrapping race had already arrived.<br/><br/>In the next moment, Wang Xian could only feel the surrounding scenery. The dense white cloth around him had formed a special space. In this space, there were three experts from the corpse-wrapping race standing.<br/><br/>They hovered around him in a cold triangular formation and locked onto Wang Xian completely.<br/><br/>“Take out the acquired treasure of our corpse-wrapping race. Otherwise, it will become the nourishment for our corpse-wrapping cloth!”<br/><br/>Right in front of them, the expert from the corpse-wrapping race said in a cold voice.<br/><br/>Their voice was extremely cold without any emotion.<br/><br/>Wang Xian felt very uncomfortable listening to their voices.<br/><br/>As he couldn’t see the faces of the corpse-wrapping race members clearly, he didn’t realize that the other party was deliberately stalling for time.<br/><br/>However, Wang Xian didn’t take the three universe knights from the corpse-wrapping race, who had level eight combat strength, to heart.<br/><br/>Buzz<br/><br/>He moved his palm and the five elements millstone appeared in his hand. He glanced at the three wrapped corpse race experts and said, “You can’t Stop Me. If you want to fight, you are courting death!”<br/><br/>Wang Xian didn’t want to have a conflict with the wrapped corpse race experts. He hadn’t settled the matter of the Lich Kingdom and didn’t want to provoke such a powerful force.<br/><br/>However, it was impossible for him to hand over the acquired treasure.<br/><br/>Treasures belonged to those who were capable!<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>Just as he finished his sentence, the corpse-wrapping cloth attacked him directly.<br/><br/>The corpse-wrapping cloth was sharp and strange as it swept toward Wang Xian.<br/><br/>“Huh?”<br/><br/>“Wind attribute, darkness attribute!”<br/><br/>Wang Xian was slightly shocked when he felt the energy coming from the corpse-wrapping cloth.<br/><br/>The corpse-wrapping race controlled two attributes.<br/><br/>“Get lost!”<br/><br/>Wang Xian growled. The five elements millstone emitted the aura of the destruction of the five elements and attacked the shroud.<br/><br/>Buzz<br/><br/>The shroud seemed to be contaminated by the energy of the Five Elements Millstone in an instant. It became a little gray.<br/><br/>“Kill!”<br/><br/>When the three corpse-wrapping race experts saw this scene, they let out a cold killing intent at the same time. The shroud also turned into a blood shroud in an instant.<br/><br/>On the blood cloth, blood-red mummies were condensed. They directly tore at Wang Xian.<br/><br/>“You guys have really angered me!”<br/><br/>“Let’s end this quickly!”<br/><br/>Wang Xian’s eyes were filled with killing intent. This was the territory of the wrapped-up corpse tribe. He couldn’t stay here for too long.<br/><br/>“Roar! Roar!”<br/><br/>Wang Xian let out a wild roar and transformed into the body of a divine dragon.<br/><br/>“Eight dragon clones!”<br/><br/>After transforming into the body of the divine dragon, he immediately unleashed his most powerful attack.<br/><br/>It was his law projection, the eight dragon clones.<br/><br/>He had to break through this place as soon as possible, or he had to destroy the experts of the corpse-wrapping race.<br/><br/>These cold corpse-wrapping race experts made him feel extremely uncomfortable.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The moment the eight divine dragon silhouettes appeared and when the five elements grinding mill unleashed a terrifying attack, the bodies of the three corpse-wrapping race experts clearly paused.<br/><br/>“Bang, Bang, Bang!”<br/><br/>The powerful eight dragon avatars attacked in all directions, and huge cracks appeared on the corpse-wrapping cloth.<br/><br/>The five elements millstone also unleashed a terrifying river of annihilation, sweeping through the surroundings.\t\t\t\t\t\t</div>", "images": {}, "success": true}