{"id": 324, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072549.html", "title": "Chapter 3315 - 3315 3314 Who Was Attacking Who?", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3315 - 3315 3314 Who Was Attacking Who?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3315 3314 who was attacking who?<br/><br/>Around the Dragon Palace, the experts of the Lich Kingdom began to set up arrays.<br/><br/>Apart from body modification, the most powerful part of the Wizards’lineage was arrays.<br/><br/>Especially when the Wizards were defending.<br/><br/>If a wizard was given enough time to set up a large number of arrays, he could even fight against six or even more.<br/><br/>The sky array used to block a large number of experts.<br/><br/>Now, the Lich Kingdom used the same method.<br/><br/>The Dragon Palace relied on the defense of the Dragon Palace. In terms of experts, the Lich Kingdom was confident that they could defeat them.<br/><br/>They could completely seal the Dragon Palace. Once a member of the Dragon Palace came out, they could kill him.<br/><br/>In that case, they could set up powerful arrays around the palace.<br/><br/>If they set up enough arrays and some acquired true treasures from the Lich Kingdom, they were confident that they could kill a level 9 knight.<br/><br/>They could break through the Dragon Palace with arrays!<br/><br/>That was their plan.<br/><br/>However, it would take a lot of time to set up the arrays.<br/><br/>The Lich Kingdom could afford to wait for this time.<br/><br/>Just as the experts of the Lich Kingdom were preparing to attack the Dragon Palace with the array.<br/><br/>The news of the Lich Kingdom attacking the dragon palace had spread through the entire galaxy.<br/><br/>When everyone heard that the Dragon King of the Dragon Palace had attacked the Lich Kingdom and destroyed a city of the Lich Kingdom, there was an uproar.<br/><br/>“This Dragon King is too ruthless. So what if he’s a powerful force in the heaven opening desolate continent? He’ll have to pay the price for stealing the treasures of the Dragon Palace!”<br/><br/>“This is a direct war against the Lich Kingdom. Can the dragon palace withstand it?”<br/><br/>“The Dragon Palace has already withstood the first wave of attacks from the Lich Kingdom. I wonder if it can withstand the next wave!”<br/><br/>All the forces in the surrounding starry sky were discussing this big battle.<br/><br/>Who would have thought that the Dragon King of the Dragon Palace was so bloody-minded!<br/><br/>Take the treasures of the Dragon Palace and I’ll destroy your city!<br/><br/>Not long after, even some forces in the heaven opening desolation continent found out about this matter. They were all dumbfounded.<br/><br/>They knew the exact strength of the Lich kingdom better than anyone else.<br/><br/>They were ranked in the top three at the edge of the land. They were definitely strong.<br/><br/>However, a faction that surrounded the starry sky dared to challenge them and openly declared war. This was…<br/><br/>Unbelievable!<br/><br/>Was the Dragon Palace crazy, or did they have the confidence to resist the attack of the Lich Kingdom.<br/><br/>The factions that surrounded the starry sky and the edge of the heaven-splitting primordial land were all paying attention to this huge battle.<br/><br/>At the same time, in the five insect city, Wang Xian was looking at the information on the universe’s AI with a smile.<br/><br/>To break through the defense of the Dragon Palace, one had to have the strength of a universe master.<br/><br/>As for the Dark World of the Demon Dragon and the Fire Dragon Palace beside the Dragon Palace, to break through them, one also needed the strength of a universe master.<br/><br/>As for the other two dragon palaces, they were not needed. However, they had been put away and were being devoured by Ao crab and the others.<br/><br/>Therefore, Wang Xian was not worried about the situation at the Dragon Palace.<br/><br/>Time passed day by day. The experts of the Lich Kingdom were setting up various formations.<br/><br/>They were preparing to break through the Dragon Palace in one fell swoop.<br/><br/>Meanwhile, Wang Xian was quietly waiting for Mo Sha and the rest to break through.<br/><br/>“Dragon King!”<br/><br/>Three days later, a ox-headed lich with a carapace on his back came to Wang Xian’s place and shouted respectfully.<br/><br/>“We did it!”<br/><br/>Wang Xian stood up and looked at Mo Sha with a smile.<br/><br/>“Yes, Dragon King. If they didn’t have any more hidden hands, I have pretty much figured out the situation in the entire five insect city.”<br/><br/>Mo sha nodded and continued, “Currently, there are no level eight universe knights in the five insect city. However, if the five insect city were to be attacked, six to seven level eight universe knights could be killed immediately.”<br/><br/>“Other than that, there are 12 universe Knight Level Seven Great Beings in five bug city. Another important point is that if the great beings in five bug city use the cave-in to open the array, they can trap and kill Universe Knight Level Eight Great Beings. Unless they are level nine, they can not escape. ”…”<br/><br/>Mo Sha told him all the information about five bug city.<br/><br/>“A formation that can trap or even kill a Level 8 universe knight?”<br/><br/>Wang Xian’s heart skipped a beat when he heard this.<br/><br/>Now, Wang Xian was very confident in his defense and speed. Both of them were comparable to a level 9 universe knight.<br/><br/>Logically speaking, with such strength, he should be completely unafraid of the lich kingdom.<br/><br/>However, in reality, Wang Xian was still very fearful of the Lich Kingdom.<br/><br/>That was because the lich kingdom was a lineage of wizards.<br/><br/>The strange curse was able to ignore the defense of the Tai Chi Dragon Disk and directly affect his body.<br/><br/>The Tai Chi Dragon Disk’s defense was ineffective.<br/><br/>The powerful binding formation could trap him.<br/><br/>Wang Xian had strong defense and high speed, but his offensive power was only at level 8 universe knight.<br/><br/>Once he was trapped, the powerhouses of the Lich Kingdom could easily kill him.<br/><br/>Just like the formation in the five wormhole, once he was trapped, he could only wait for death.<br/><br/>Even if there was an lie, he didn’t dare to take the risk. If there was still an attack in the formation, even if an lie came, he wouldn’t be able to block it.<br/><br/>“Can you break the formation?”<br/><br/>Wang Xian asked Mo Sha.<br/><br/>“The formation requires five universe knights at Level 7 in the five wormhole to be activated. By then, I can destroy it from the outside.”<br/><br/>Mo Sha said.<br/><br/>“That’s Good!”<br/><br/>Wang Xian squinted his eyes and looked at him. “Can you bring me into the five wormholes? If you can destroy the Level 7 universe Knight Lich, it will be even easier.”<br/><br/>“It’s very difficult to enter. With the formation set up by the experts of the Lich Kingdom, I won’t be able to break it with my strength.”<br/><br/>Mo Sha shook his head.<br/><br/>After all, the one he was hosting was only a lich with the combat strength of a Level 7 universe knight.<br/><br/>“Alright, go and make some preparations. When I enter the five wormhole by force, I must destroy their teleportation formation.”<br/><br/>Wang Xian nodded and instructed.<br/><br/>“It’s the Dragon King. We will destroy the three secret formations as soon as possible.”<br/><br/>Mo Sha nodded his head.<br/><br/>“You go back first. I will act on time in an hour!”<br/><br/>Wang Xian nodded his head.<br/><br/>“It’s the Dragon King!”<br/><br/>Mo Sha replied and left immediately.<br/><br/>Wang Xian looked at the time and walked out of his room. He headed towards the five Insect Wonderland in the center of the five insect city.<br/><br/>Similar to the Scorpion Imperial City, most of the powerhouses in the five insect city were also in the Wonderland.<br/><br/>“Every Wonderland has a special and powerful ability. This is why the powerhouses in the surrounding starry skies want to land. The Wonderland and resources are too tempting.”<br/><br/>“If I can occupy a grotto-heaven blessed land, I might be able to fight against the forces that are stronger than me.”<br/><br/>Wang Xian pondered as he walked.<br/><br/>The battle to land was very difficult for many forces.<br/><br/>Half an hour later, Wang Xian arrived in front of the five worms grotto-heaven. His eyes were sparkling.<br/><br/>At the same time, the formation of the Lich Kingdom was completed in the sky above the Dragon Palace after a few days of setup.<br/><br/>The second round of attacks would start at the same time!\t\t\t\t\t\t</div>", "images": {}, "success": true}