{"id": 321, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072543.html", "title": "Chapter 3312 - 3312 3311 Killed Two Experts", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3312 - 3312 3311 Killed Two Experts</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3312 3311 killed two experts<br/><br/>“Kill, Kill, Kill!”<br/><br/>Sensing the powerful strength that Wang Xian had unleashed, the three experts of the wrapped corpse race let out a low growl.<br/><br/>The shrouds on their bodies flew out from their bodies.<br/><br/>Slowly, the true faces of the three experts of the wrapped corpse race appeared in front of Wang Xian.<br/><br/>Each of the three elders was extremely pale. Their skin was white, and even their eyeballs were white.<br/><br/>It was a little horrifying, as though they were different from the rest of the humans.<br/><br/>Their white arms were holding onto a long shroud as their natal shroud attacked Wang Xian.<br/><br/>On the shroud, Wang Xian could feel the terrifying wind attribute power.<br/><br/>“You guys have really angered me.”<br/><br/>Wang Xian’s eyes were filled with cold killing intent.<br/><br/>He wasn’t prepared to fight to the death with the three experts of the zombie clan. However, since the other party didn’t allow him to leave, he couldn’t be blamed for being vicious.<br/><br/>Did he really think that he was afraid of them?<br/><br/>“Die!”<br/><br/>Wang Xian let out a furious roar. The tai chi dragon coiled around his body. He no longer wanted to break through and escape. Instead, he attacked one of the experts of the corpse-wrapping race.<br/><br/>At the same time, the five elements grinding mill emitted a luster. A grayish divine dragon phantom rushed out from within. All kinds of acquired spiritual treasures and acquired Supreme Treasures attacked the expert of the corpse-wrapping race.<br/><br/>“Be careful!”<br/><br/>When the two wrapping corpse race experts saw that Wang Xian had locked onto one of their clansmen, their expressions changed slightly. They shouted in a cold voice.<br/><br/>Their defeated eyes were filled with traces of blood.<br/><br/>The two of them did not hesitate at all. The power of darkness spread to their natal wrapping cloth. The wrapping cloth instantly turned into a demonic sword and stabbed directly at Wang Xian.<br/><br/>However, Wang Xian completely ignored the attacks of the two experts of the corpse-wrapping race.<br/><br/>He stared at the expert of the corpse-wrapping race in front of him.<br/><br/>“Die!”<br/><br/>The eyes of the expert of the corpse-wrapping race were filled with rage. The shroud in front of him extended and attacked Wang Xian.<br/><br/>“Roar Roar Roar!”<br/><br/>On one side, a gray divine dragon formed by the Five Elements Millstone was attacking the shroud with a terrifying attack.<br/><br/>Under the attack of the five elements millstone, the shroud was instantly suppressed.<br/><br/>This caused the expression of the expert from the wrapping race to change drastically.<br/><br/>“Die!”<br/><br/>At this moment, Wang Xian’s attack followed closely behind.<br/><br/>“The one who dies is you!”<br/><br/>When the expert from the wrapping race who was being attacked saw Wang Xian charging towards him, there wasn’t the slightest hint of fear on his face.<br/><br/>This was because the other two experts from the wrapping race had already arrived beside Wang Xian.<br/><br/>Boom! Boom<br/><br/>The two natal shrouds emitted a terrifying energy and landed on Wang Xian’s body.<br/><br/>However, at this moment, the Tai Chi Dragon was spinning. The terrifying attacks caused ripples around him.<br/><br/>The attacks of the two experts of the wrapped corpse race were completely blocked.<br/><br/>“What?”<br/><br/>At this moment, the expression of the experts of the wrapped corpse race who were in front of him finally changed drastically.<br/><br/>“Roar! Roar!”<br/><br/>Wang Xian let out a wild roar. His dragon claw emitted a grayish destructive force as it clawed at him directly.<br/><br/>This expert from the corpse-wrapping race extended his palm and blocked the endless dark force.<br/><br/>“PFFT!”<br/><br/>However, under Wang Xian’s terrifying attack, the dark force was penetrated by the Dragon Claw and grabbed onto his body.<br/><br/>“Do you really think that I don’t dare to fight with you because I’m afraid of You?”<br/><br/>A cold look appeared in Wang Xian’s eyes as he clenched his dragon claw forcefully.<br/><br/>“PFFT!”<br/><br/>A terrifying energy covered their bodies and killed them directly.<br/><br/>“How is this possible? How can his defense be so terrifying!”<br/><br/>At the side, the other two experts from the corpse-wrapping race saw that their full-strength strike did not break through his defense. Instead, one of their comrades was killed and they looked embarrassed.<br/><br/>A hint of shock and anger appeared in their eyes.<br/><br/>“Roar! Roar!”<br/><br/>In the next moment, Wang Xian’s figure disappeared instantly. When he reappeared, he was already behind one of the experts of the corpse-wrapping race.<br/><br/>“Be careful!”<br/><br/>The other expert immediately warned loudly. His expression changed drastically.<br/><br/>Under the circumstance of three against one, one of them was actually killed by the other party.<br/><br/>Now, they were also in a dangerous situation.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Sensing Wang Xian’s attack, the expert from the wrapped corpse tribe waved his arm. The wrapping cloth in front of him quickly wrapped around his body.<br/><br/>“Bang!”<br/><br/>However, at this moment, a terrifying attack landed on his body, causing him to spurt out fresh blood. The wrapping cloth that had yet to completely wrap around him was dyed red.<br/><br/>“Bang!”<br/><br/>In the next moment, a sharp sword flew out from the five elements grinding mill and pierced directly into the body of the expert from the wrapped corpse tribe. The sharp sword penetrated the wrapping cloth and penetrated his body.<br/><br/>The expert of the wrapping corpse race who came to the rescue landed his attack on Wang Xian. However, he was still unable to break through the defense of the Taiji Dragon Disc.<br/><br/>“Bang!”<br/><br/>The Dragon Claw grabbed onto the body of the second expert of the wrapping corpse race. A terrifying energy enveloped him.<br/><br/>“Run!”<br/><br/>The expression of the last expert of the wrapping corpse race changed drastically. Taking advantage of this opportunity, his figure disappeared instantly.<br/><br/>At the side, more than ten experts of the wrapped corpse race also fled into the distance in a panic.<br/><br/>“HMPH!”<br/><br/>When Wang Xian saw them escaping, he didn’t continue to pursue them.<br/><br/>He waved his arm and stored the corpse into the mother nest.<br/><br/>He scanned his surroundings and didn’t dare to stay here for long. He left immediately and flew out of the territory of the wrapped corpse race.<br/><br/>Ten minutes after he left, more than ten experts of the wrapped corpse race flew over.<br/><br/>Their cold aura stood there for five minutes before leaving.<br/><br/>…<br/><br/>“It’s only a postnatal supreme treasure, yet the competition is so fierce.”<br/><br/>After Wang Xian left the territory of the corpse-wrapping race, he shook his head slightly and transformed into his human form to continue traveling through the heaven-opening primal continent.<br/><br/>Because of a postnatal supreme treasure, two universe knight level eight experts died.<br/><br/>This was something that the corpse-wrapping race did not expect.<br/><br/>It was too difficult to kill an opponent of the same level.<br/><br/>If Wang Xian did not rely on his terrifying speed and strong defense, it would be difficult to kill an existence of the same level.<br/><br/>However, the three powerhouses of the corpse-wrapping race thought that they could defeat Wang Xian. That was why they were killed by him.<br/><br/>“However, obtaining an acquired treasure and the corpses of two universe knight level eight powerhouses is also a great reward.”<br/><br/>Wang Xian mumbled and smiled.<br/><br/>As for the possibility of offending the corpse-wrapping race, he didn’t care too much.<br/><br/>The corpse-wrapping race was still unable to break through the defense of the Dragon Palace.<br/><br/>“Get Ready, let’s continue.”<br/><br/>Wang Xian muttered and turned on the universe AI.<br/><br/>Next, he was preparing to attack another city in the Lich Kingdom.<br/><br/>He had already chosen his target, the five bug city of the Lich Kingdom.<br/><br/>The five insect city was not too far away from where Wang Xian was at the moment.<br/><br/>“This might be different from the last time. This time, the Lich Kingdom should make some preparations. I have to be careful and not be surrounded!”<br/><br/>He mumbled.<br/><br/>Once he was surrounded, he would still be in danger of dying.<br/><br/>Therefore, he had to be fully prepared for the extermination of the city.\t\t\t\t\t\t</div>", "images": {}, "success": true}