{"id": 327, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072555.html", "title": "Chapter 3318 - 3318 3317 Lowered His Head And Admitted Defeat", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3318 - 3318 3317 Lowered His Head And Admitted Defeat</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3318 3317 lowered his head and admitted defeat<br/><br/>“Boom! Boom! Boom!”<br/><br/>In the five bug city, rumbling sounds were heard continuously. The Divine Dragon was wreaking havoc in the sky.<br/><br/>Wang Xian’s eyes were filled with coldness and coldness.<br/><br/>Terrifying attacks were launched downwards.<br/><br/>The entire five bug city was under the coverage of Wang Xian.<br/><br/>The liches that were like bugs were easily killed by Wang Xian.<br/><br/>The destruction of the city lasted for ten minutes.<br/><br/>Ten minutes later, he was flying in the sky. His pair of dragon eyes were staring coldly at the scene below.<br/><br/>“Roar! Roar!”<br/><br/>He let out a low roar and flew rapidly toward the five wormhole in the center.<br/><br/>“Dragon King!”<br/><br/>In the five wormhole, the demonic fiend that was on the predemon immediately flew over and shouted with a smile.<br/><br/>“How are things here?”<br/><br/>Wang Xian asked him.<br/><br/>“Dragon King, the treasures in the five-worm grotto-heaven have been collected. However, there aren’t many treasures.”<br/><br/>Mo sha said, “According to the memories in my mind, after the scorpion imperial city was destroyed and all the venom inside was taken away by you, Dragon King, the Lich Kingdom collected a large portion of the treasures in the grotto-heaven blessed land.”<br/><br/>“Oh? It seems that those liches have learned their lesson!”<br/><br/>Wang Xian raised his eyebrows. He didn’t care too much about the small harvest.<br/><br/>“You should go back first. After leaving this place, it won’t be long before the powerhouses from the Lich kingdom come over.”<br/><br/>He said with a smile.<br/><br/>Mo Sha and a few poisonous horned dragons returned to the Dragon Palace in a flash.<br/><br/>Meanwhile, Wang Xian was flying outside.<br/><br/>His speed was very fast. In less than five minutes, he had left five bug city completely.<br/><br/>Just as Wang Xian flew out of five bug city, he was in the sky above the Dragon Palace, the territory of the ancient sea race.<br/><br/>The truly terrifying array attack had just begun.<br/><br/>One after another, the level eight array formations of universe knights bombarded the Dragon Palace.<br/><br/>Every time a universe knight level 8 array was activated, it would cause the world to shake. That attack was far from what a universe Knight Level 8 warrior could unleash.<br/><br/>It was all-encompassing and the strongest attack.<br/><br/>There were no more objects around the Dragon Palace.<br/><br/>Even the fragments of the main planet of the ancient sea race around the Dragon Palace no longer existed.<br/><br/>The Dragon Palace floated alone in the void space, suffering one terrifying attack after another.<br/><br/>As the arrays were activated and time passed.<br/><br/>The expression of the Lich King became uglier and uglier.<br/><br/>More than half of the Knight Level 8 array had been activated, yet the Dragon Palace still didn’t move.<br/><br/>Seeing that there were no traces of the Dragon Palace, he had a bad premonition.<br/><br/>“The final eye of Darkness Array is 10 times more powerful than the previous array. We have to rely on the last array. We have to succeed!”<br/><br/>The Lich Emperor growled coldly.<br/><br/>Hong! Hong! Hong<br/><br/>Universe Knight Level 8 arrays raged, and the Dragon Palace stood still.<br/><br/>All the Great Beings of the Lich Kingdom were watching closely.<br/><br/>They also knew that they had to rely on the last array formation.<br/><br/>Buzz<br/><br/>When the last array formation was activated, a huge hole was torn in the sky above the Dragon Palace.<br/><br/>A Terrifying Eye of darkness appeared in the void. The entire eye of darkness looked abnormally terrifying.<br/><br/>The Eye of darkness was bigger than the entire Dragon Palace. The moment it appeared, there was no other energy around it.<br/><br/>“What kind of attack is this?<br/><br/>“Hiss? The last attack? It looks so terrifying!”<br/><br/>In the distance, all the experts around Lu Xingkong looked at the terrifying eye of darkness in shock.<br/><br/>Buzz<br/><br/>In the next moment, heaven and earth shook, and a blood-red crescent flew out of the terrifying eye of darkness.<br/><br/>Like a blood moon, it slashed toward the Dragon Palace.<br/><br/>Boom<br/><br/>A terrifying collision sounded, and the entire starry sky began to shake.<br/><br/>The Dragon Palace was dyed red by the blood-red energy.<br/><br/>In the sky, after the Eye of Darkness launched this attack, it slightly scattered, as if all the energy had been consumed.<br/><br/>This was the last attack.<br/><br/>And then… and then nothing!<br/><br/>The blood-red energy covering the dragon palace slowly disappeared, and the Resplendent Dragon Palace still stood in the void without a single crack.<br/><br/>“This… The Lich kingdom has failed. They still haven’t broken through the Dragon Palace!”<br/><br/>“The defense of the Dragon Palace is too terrifying. Their last attack could destroy us even if the energy leaked out. The Dragon Palace is still intact!”<br/><br/>“Failed. The Lich Kingdom has failed. The Dragon Palace is the trump card of the Dragon King and the others. It’s the trump card that they dare to declare war on the Lich Kingdom!”<br/><br/>The surrounding experts from Lu Xing Kong saw this scene and discussed in shock.<br/><br/>When the Lich King and the others saw this scene, their expressions were abnormally ugly.<br/><br/>The strongest attack they had prepared for the past few days didn’t cause the dragon palace to show any signs of damage.<br/><br/>This invincible defense made them feel somewhat powerless.<br/><br/>If they couldn’t break through, how could they destroy the Dragon Palace?<br/><br/>Weng Weng<br/><br/>Just as the Lich King’s expression was gloomy and his fists were tightly clenched, a message came from the universe AI.<br/><br/>When he saw this message, his expression instantly changed.<br/><br/>“Damn it, Dragon Palace Dragon King, you deserve to die!”<br/><br/>A furious voice came out of the Lich King’s mouth. His eyes were blood red and filled with anger.<br/><br/>The rage of the Lich King caused the expressions of the surrounding subordinates to change greatly. They immediately looked over.<br/><br/>“Hahaha, you bunch of trash from the Lich Kingdom want to destroy our Dragon Palace? Wishful thinking. Just now, our Dragon King has already destroyed your five insect city. He has already destroyed two of your cities!”<br/><br/>“Just you wait. Our Dragon King will destroy all of your cities. If you dare to steal from our Dragon Palace, Your Lich Kingdom will have to pay ten times the price!”<br/><br/>At this moment, Mo Sha’s maniacal laughter came from the Dragon Palace.<br/><br/>The voice spread across the entire starry sky.<br/><br/>When the lich king heard this provocative and disdainful voice, he was so angry that he almost vomited blood.<br/><br/>His body trembled, and his eyes were blood-red.<br/><br/>“What?”<br/><br/>“The Dragon King of the Dragon Palace just destroyed another city in the Lich Kingdom?”<br/><br/>“Hiss, this… when the Lich Kingdom attacked the Dragon Palace, the Dragon King also attacked the Lich Kingdom?”<br/><br/>“F * ck, it can’t be. The Lich Kingdom didn’t attack the Dragon Palace, but the Dragon King destroyed a main city of the Lich Kingdom?”<br/><br/>The surrounding experts from Lu Xingkong were shocked when they heard this.<br/><br/>Wasn’t the Dragon Palace too powerful?<br/><br/>The Dragon King was too powerful!<br/><br/>The main city of the Lich Kingdom was destroyed just like that!<br/><br/>This…<br/><br/>Did this mean that the Dragon Palace was invincible?<br/><br/>The Dragon King already had the upper hand?<br/><br/>This… This was something that everyone found unbelievable.<br/><br/>The strength of the Lich Kingdom could be ranked in the top three on the edge of the heaven opening desolate continent!<br/><br/>Such an existence had suffered at the hands of the Dragon Palace. One could imagine the strength of the Dragon Palace.\t\t\t\t\t\t</div>", "images": {}, "success": true}