{"id": 331, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072563.html", "title": "Chapter 3322 - 3322 3321 Was In An Uproar", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3322 - 3322 3321 Was In An Uproar</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3322 3321 was in an uproar<br/><br/>Black wing city was the second largest main city in the Lich Kingdom.<br/><br/>It was second only to the Lich City.<br/><br/>In black wing city, there was even the Thousand Eye City Lord.<br/><br/>And the Thousand Eye City Lord had plundered the eye of a powerful desolate beast, possessing an abnormally powerful ability.<br/><br/>The Lich King was very clear about the thousand eye city Lord’s strength, second only to him and the old national advisor of the Lich Kingdom.<br/><br/>He even had a acquired treasure in his hands.<br/><br/>With the Thousand Eye City leader holding down the fort, it was the second largest city in the lich kingdom, yet it was actually ravaged by the Dragon King of the Dragon Palace.<br/><br/>Furthermore, he had already sensed that the teleportation array from the Lich City to black wing city had been cut off.<br/><br/>It would take five hours to fly from here to black wing city.<br/><br/>This wasn’t the most shocking thing to the Lich King, the most shocking thing was that the token of the thousand eye city leader had already been broken.<br/><br/>Thousand Eye City leader had fallen!<br/><br/>This could be said to be a true level 8 knight killed by the Dragon King.<br/><br/>“Hu hu Hu!”<br/><br/>The Lich King’s breathing was hurried, he closed his eyes and leaned on the throne.<br/><br/>What should he do now?<br/><br/>Even black wing city had been completely destroyed, how could he face the Dragon King next?<br/><br/>There was only one way, that was to gather all the disciples of the Lich Kingdom into one or two cities.<br/><br/>Under such circumstances, they would be able to avoid being massacred by the Dragon King.<br/><br/>But gathering in one or two cities meant that they had to abandon the other seven or eight main cities.<br/><br/>The losses were too great, so great that they could not bear it at all.<br/><br/>It was a great loss for them to give up all the cities for the treasures of the Righteous God race.<br/><br/>Moreover, three cities had already been destroyed, and countless disciples had been killed. The treasures of the Righteous God race could no longer make up for the losses.<br/><br/>“Peng!”<br/><br/>The entire throne cracked.<br/><br/>“Lord Lich King, something happened in black wing city!”<br/><br/>At this time, a universe Knight Level 7 lich came in and said with a panicked face, “That Dragon Palace Dragon King directly provoked the universe AI, he said… he said…”<br/><br/>The Lich said, but didn’t say anything in the end.<br/><br/>The Lich King immediately opened the universe ai with a gloomy face.<br/><br/>When he saw the naked threat from the Dragon Palace on the universe ai, his face was so gloomy that it almost bled.<br/><br/>On the Dragon Palace’s statement, there was a picture.<br/><br/>The picture was of the destroyed black wing city, and at the bottom of the picture, there was a line of words.<br/><br/>The third main city of the Lich Kingdom, black wing city, hand over all the treasures of the Righteous God race and withdraw the array around our dragon palace. Otherwise, this Dragon King will continue to destroy your other main cities.., until you only have one lich city left!<br/><br/>Looking at the pictures and words, his heart was filled with rage and helplessness.<br/><br/>“Lord Lich King, the disciples of some of the cities in the Lich kingdom are already panicking!”<br/><br/>In the front, the Lich continued to report with a gloomy expression.<br/><br/>However, at this moment, on the universe AI, at the border of the Lu Xing Kong and the heaven opening desolation, all the Great Beings of the powers saw this piece of information from the Dragon Palace and were completely excited.<br/><br/>“My God, this… This Dragon King has destroyed the black wing city of the Lich Kingdom again. This is black wing city, the second largest city in the Lich Kingdom. There are universe knights and Level 8 powerhouses guarding it!”<br/><br/>“One month later, the Dragon King will make his move again. If the first main city is destroyed due to carelessness, the second main city is destroyed due to negligence, but what about the third main city? “This is the second main city of the Lich Kingdom. If this goes on, the entire lich kingdom will be finished!”<br/><br/>“Terrifying. The Dragon King’s revenge is too terrifying. If this goes on, the losses of the Lich Kingdom will be too great!”<br/><br/>On the universe’s AI, countless people were discussing. They were shocked by this result.<br/><br/>The three main cities had been destroyed by the Dragon King, and the Lich Kingdom was once again at a disadvantage.<br/><br/>The strength of the Dragon Palace and the Dragon King once again shocked everyone.<br/><br/>“Lord Lich King!”<br/><br/>“Lord Lich King!”<br/><br/>Within the hall where the Lich King was, a number of universe knights with level 8 combat strength flew over. Their expressions were also extremely ugly.<br/><br/>There was even a trace of fear in their eyes.<br/><br/>“Lord Lich King, thousand eye city leader he… he died? What happened over at Black Wing City?”<br/><br/>A Lich City Lord couldn’t help but ask.<br/><br/>Now they were a little afraid.<br/><br/>They knew thousand-eye city Lord’s strength very well.<br/><br/>If thousand-eye city lord fell, then if the Dragon King attacked their main city, wouldn’t they…<br/><br/>“Thousand-eye is dead!”<br/><br/>The Lich King looked at them and said with a gloomy face.<br/><br/>“DEAD!”<br/><br/>The warriors of the Lich kingdom trembled and their expressions changed drastically.<br/><br/>If thousand eyes was really dead, then who would be next?<br/><br/>“Lord Lich Emperor, are we still going to be enemies with that Dragon Emperor? There might be more than one level 8 universe knight in their Dragon Palace, and even thousand eyes city leader is dead. Furthermore, the teleportation formation we set up was cut off.”<br/><br/>A powerful lich couldn’t help but speak.<br/><br/>The Lich Emperor leaned on the cracked throne and didn’t speak.<br/><br/>The group of liches also didn’t speak.<br/><br/>The Lich Emperor knew what they were worried about!<br/><br/>Thousand Eye City Leader’s death, along with the distress signal, even the teleportation array in black wing city was cut off, this made all the liches terrified.<br/><br/>The Lich Emperor didn’t want his men to die either.<br/><br/>“Release a statement and contact the Dragon Palace. We will return all the treasures of the righteous God race to them and undo the array of the Dragon Palace. We admit defeat in this battle!”<br/><br/>After a few minutes of silence, the Lich Emperor spoke.<br/><br/>Hearing the words of the Lich Emperor, the group of liches heaved a sigh of relief.<br/><br/>If this continued, they might all die.<br/><br/>“Go inform the imperial advisor.”<br/><br/>The liches glanced at the universe Knight Level 7 liches and ordered.<br/><br/>“It’s the liches!”<br/><br/>The liches immediately replied and walked out of the hall.<br/><br/>Although they were unwilling, they had no other choice.<br/><br/>“Look at the universe AI, the liches have announced that they want to stop the war with the Dragon Palace. They are willing to return all the treasures of the Righteous God race. Hiss, the liches have admitted defeat!”<br/><br/>“The Lich Kingdom has admitted defeat. They actually admitted defeat. This is simply unbelievable!”<br/><br/>“Return all the treasures of the Righteous God race. This… this… the dignified lich kingdom has actually admitted defeat to the Dragon Palace!”<br/><br/>Not long after, all the powerhouses in the surrounding starry skies and at the edge of the heaven opening desolate continent were in an uproar.<br/><br/>The statement that the Lich Kingdom made on the universe’s AI was too shocking.<br/><br/>Everyone was in an uproar.<br/><br/>This battle actually ended with the Lich Kingdom admitting defeat.<br/><br/>This was something that no one had expected.<br/><br/>A majestic faction surrounding the starry skies forced the top three factions at the edge of the heaven opening desolate continent to admit defeat. This was the first time in history.<br/><br/>This battle was destined to be remembered by all races!\t\t\t\t\t\t</div>", "images": {}, "success": true}