{"id": 337, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072575.html", "title": "Chapter 3328 - 3328 3327 Cursed Pool", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3328 - 3328 3327 Cursed Pool</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3328 3327 cursed pool<br/><br/>“There are the rules of the cursed spirit village ahead. We must abide by these rules here. Otherwise, we will be attacked by the cursed spirit village.”<br/><br/>The old lady spoke to Wang Xian and walked out slowly.<br/><br/>Wang Xian looked at him and looked ahead.<br/><br/>The rules of the cursed spirit village were as follows:<br/><br/>1: no fighting and display of power.<br/><br/>2: no shouting, disturb the curse spirit village.<br/><br/>3: no inquiring about anything from the curse spirit village villagers.<br/><br/>3 rules, every rule seemed extremely powerful.<br/><br/>But no one dared to disobey.<br/><br/>The curse spirit village cursed people, the terrifying thing was not only their curses.<br/><br/>There was also a very terrifying point, that was the karmic fire!<br/><br/>The so-called karmic fire was if someone chased away the desolate beasts or ordered his battle pet to kill these cursed people.<br/><br/>Then, the instigator would also be cursed.<br/><br/>In fact, if a large number of cursed people were killed, it might implicate other parts of one’s bloodline.<br/><br/>For example, if an expert of a race killed a cursed person, this expert might be killed by the curse. The descendants of this expert and the relatives of his lineage might also be killed.<br/><br/>A person who was cursed could not be killed.<br/><br/>However, such a person would not pose much of a threat to Wang Xian and the rest.<br/><br/>Wang Xian scanned his surroundings and flew into the air. He took out the map of the blessed land.<br/><br/>Looking at the information on the map, he raised his eyebrows slightly.<br/><br/>There was actually the existence of the cursed spirit village on this map.<br/><br/>It seemed that this village had a long history.<br/><br/>Wang Xian mumbled. His body moved and he flew straight in that direction.<br/><br/>There weren’t many experts from other races around. Wang Xian didn’t even see one.<br/><br/>The Cape of the sea was very big. Those who could reach here were all experts.<br/><br/>Very soon, Wang Xian arrived above the sea.<br/><br/>There were seabirds and dire beasts flying around. Some seabirds were covered with strange black tattoos.<br/><br/>These seabirds were also cursed existences.<br/><br/>“Some of the cursed creatures are inheritors of their parents. There are also some of them because of other reasons. It seems like there are some strange places here.”<br/><br/>Wang Xian muttered to himself as a look of vigilance appeared on his face.<br/><br/>He did not provoke these seabirds, so naturally, the seabirds did not dare to attack him.<br/><br/>Wang Xian did not fly in the sky. Instead, he entered the ocean.<br/><br/>The Divine Dragon belonged to the ocean!<br/><br/>After entering the ocean, Wang Xian immediately sensed the existence of powerful aquatic creatures around him.<br/><br/>He narrowed his eyes slightly and ignored them. He continued to fly forward.<br/><br/>Swimming in the corner of the ocean, Wang Xian flew deeper into the ocean. Soon, he sensed that there were some universe knight-level seaweed, sea trees, and other creatures growing below.<br/><br/>Wang Xian did not take them away and continued to fly deeper into the sea.<br/><br/>Some universe knight-level level 1 and 2 treasures were not worth his time.<br/><br/>According to the information on the map, Wang Xian arrived at the location of that area two days later.<br/><br/>On this day’s journey, he also encountered many desolate beasts.<br/><br/>They had the strength of desolate beasts and had the combat strength of a universe knight-level 6 or 7.<br/><br/>When he encountered such a desolate beast, Wang Xian killed it immediately.<br/><br/>“I have arrived at this area.”<br/><br/>When Wang Xian was shuttling through the seabed, he suddenly felt a huge change in the seabed in front of him.<br/><br/>The dark blue seawater turned black, as black as ink. In the extremely deep seabed, there were some strange underwater mountains.<br/><br/>Wang Xian looked at the area in front of him with a curious look in his eyes.<br/><br/>Could there be a paradise in this area?<br/><br/>However, the map given to him by the leader of the Deep Swamp tribe was indeed magical. Even with his strength, he could not destroy it.<br/><br/>To be able to create such a map, his strength was definitely terrifying. The credibility of this place was not small.<br/><br/>He entered this area and continued flying forward.<br/><br/>When he entered this area, he suddenly realized that there was something strange in the surroundings.<br/><br/>“There are no living things and no treasures. There are only these mountains at the bottom of the sea.”<br/><br/>Wang Xian mumbled as his eyes revealed a look of vigilance.<br/><br/>This was because the Cape of the sea belonged to the land of mountains and seas. It was normal for there to be existences at the Overlord level.<br/><br/>Therefore, he had to be careful.<br/><br/>He continued flying in. After flying for another day, he narrowed his eyes and stared ahead.<br/><br/>During this day’s flight, Wang Xian didn’t see anyone in this area.<br/><br/>At this moment, he sensed a special energy fluctuation ahead of him.<br/><br/>As a member of the Divine Dragon Clan, Wang Xian had a very strong sense at the bottom of the sea.<br/><br/>He hesitated for a moment before he concealed his body and flew forward.<br/><br/>After flying for a minute, he suddenly saw the existence of human figures.<br/><br/>There were many human figures. There were at least a few million of them. They were standing in front of a basin at the bottom of the sea.<br/><br/>There was an extremely strange energy emitting from the basin. This energy even made Wang Xian’s heart palpitate.<br/><br/>“What is the energy in that basin? It feels so strange. Also, what are those human figures doing?”<br/><br/>Wang Xian mumbled as his eyes revealed a look of astonishment.<br/><br/>He concealed his figure and slowly approached the front.<br/><br/>Those millions of figures belonged to humans. Standing at the front were thousands of cursed people with dark tattoos on their naked upper bodies.<br/><br/>They were speaking strange languages. With a wave of their hands, the millions of figures in the surroundings immediately flew into the basin.<br/><br/>“Ahhhh!”<br/><br/>In an instant, screams of pain rang out, and the dark energy in the basin surged towards them. Their faces began to contort, and they began to look ferocious.<br/><br/>The screams of pain continued to echo in their ears.<br/><br/>Some people began to die rapidly and collapse.<br/><br/>However, the faces of the thousands of cursed people at the edge of the basin did not show any signs of change.<br/><br/>Time passed by minute by minute, and after a few hours, dozens of figures crawled out of the basin.<br/><br/>At this moment, their bodies were covered with dark tattoos.<br/><br/>They had transformed into cursed people.<br/><br/>“Huh?”<br/><br/>Wang Xian was extremely astonished when he saw this scene.<br/><br/>“They deliberately transformed into cursed people. Out of millions of people, only a few dozen people survived. This…”<br/><br/>Wang Xian’s expression changed slightly. The scene in front of him was definitely under the control of a powerful race.<br/><br/>Otherwise, he wouldn’t have traded the lives of millions of people for the lives of dozens of cursed people.<br/><br/>He pondered for a while and continued to watch from the side for a few hours. Then, he flew straight ahead.<br/><br/>That basin should be a naturally formed cursed pool in the heaven-opening and primal continent. One would be attacked by the curse if they entered it.<br/><br/>The probability of surviving and becoming a cursed person was very, very small.<br/><br/>Wang Xian did not continue to investigate and continued flying forward.<br/><br/>According to the information on the map of the grotto-heaven blessed land, the powerful grotto-heaven blessed land should still be in the depths.<br/><br/>He continued to fly deeper. A day later, he flew out of this silent area.<br/><br/>The scene at the bottom of the sea in front of him suddenly changed drastically.<br/><br/>An extremely beautiful bottom of the sea appeared in his line of sight.<br/><br/>Buzz Buzz<br/><br/>All of a sudden, Wang Xian sensed the map in the mother nest and trembled.\t\t\t\t\t\t</div>", "images": {}, "success": true}