{"id": 334, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072569.html", "title": "Chapter 3325 - 3325 3324 Map Of The Grotto-Heaven Blessed Land", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3325 - 3325 3324 Map Of The Grotto-Heaven Blessed Land</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3325 3324 map of the grotto-heaven blessed land<br/><br/>The Dragon King wants him to go there?<br/><br/>Deep Swamp Abyss widened his eyes and his body kept trembling.<br/><br/>Why did the Dragon King ask him to go there?<br/><br/>How did the Dragon King Find Him?<br/><br/>“What happened? Then why did the Dragon King Find Him?”<br/><br/>When the old man heard this, his face was also a little flustered. He naturally knew about his son’s matter.<br/><br/>This time, his son’s death was killed by the Dragon King.<br/><br/>Now, the Dragon Palace actually came looking for him?<br/><br/>This was going to…<br/><br/>“Deacon Zuo, let’s go over as soon as possible. Once our deep pool race infuriates the Dragon King, we will be exterminated!”<br/><br/>The disciple of the deep pool race urged.<br/><br/>“No, no, father, I won’t go over. I Won’t go over!”<br/><br/>The Deep Swamp Abyss was terrified. He quickly ran outside.<br/><br/>“Phew, let’s Go!”<br/><br/>Deacon Zuo took a deep breath and stretched out his hand to grab his body.<br/><br/>“No, no, father. The Dragon King will kill me. The Dragon King will kill me.”<br/><br/>The Deep Swamp Abyss roared in fear.<br/><br/>“Yuan ‘er, how did you provoke the Dragon King?”<br/><br/>Deacon Zuo’s expression was equally unsightly as he stared at his son and roared in a low voice.<br/><br/>“I. . . I. . . Father, I only said a few things on the universe’s AI. I didn’t provoke him in any other way. Back then, he directly killed all of us!”<br/><br/>Deep Swamp Abyss shook his head in fear.<br/><br/>“Stupid!”<br/><br/>Deacon Zuo’s expression was incomparably gloomy. “Can such inherited powerhouses be easily provoked? can their methods be imagined by you?”<br/><br/>As he spoke, he brought his son and flew towards the sky.<br/><br/>“No, no, father, don’t!”<br/><br/>Abyss roared with a face full of despair.<br/><br/>“There’s nothing I can do. You’ll have to rely on your own luck from now on!”<br/><br/>Deacon Zuo said weakly.<br/><br/>Provoking the Dragon King wasn’t something he could solve.<br/><br/>If it wasn’t good, their entire Abyss race would have to pay a heavy price.<br/><br/>If anyone was to blame, it would be their son who had provoked the other party.<br/><br/>Boom<br/><br/>Soon, Deacon Zuo brought the Deep Swamp Abyss out of the swamp. Looking at Wang Xian who was in the sky, his eyes were filled with fear.<br/><br/>The Dragon King in front of him was too ruthless!<br/><br/>“Dragon King, the Deep Swamp Abyss has been brought over!”<br/><br/>The leader of the deep swamp race immediately said respectfully.<br/><br/>Buzz<br/><br/>Wang Xian moved his palm. The grayish energy transformed into claws and grabbed him directly.<br/><br/>“No, no, no!”<br/><br/>Deep Pool Abyss roared with a face full of despair.<br/><br/>Buzz<br/><br/>Wang Xian’s eyes flashed with a demonic expression as he cast the soul-absorbing spell.<br/><br/>He wanted to check some information. If the deep pool tribe was involved in something that was bad for the Dragon Palace, he would not let them off today.<br/><br/>Deep Pool Abyss’s body was suspended in the air and he was motionless.<br/><br/>When the tribe leader of the Deep Pool tribe saw this scene, his expression changed drastically.<br/><br/>At this moment, they were also a little scared and flustered.<br/><br/>If it were to implicate their deep pool tribe, how would they be able to resist this dragon king.<br/><br/>The tribe leader of the deep pool tribe was filled with anxiety. His expression changed drastically.<br/><br/>He moved his palm and a box appeared in his hand. He waited there anxiously.<br/><br/>“Peng!”<br/><br/>After checking the memories of Deep Pool Abyss, Wang Xian waved his arm and killed him.<br/><br/>“Dragon King, my disciple from deep pool tribe has offended you. This is our apology gift. Please accept it, Dragon King!”<br/><br/>Seeing that Wang Xian had killed deep pool abyss, Deep Pool Tribe Leader’s heart skipped a beat. With a wave of his arm, boxes containing powerful force flew towards Wang Xian.<br/><br/>“Huh?”<br/><br/>Wang Xian raised his eyebrows and swept his gaze over.<br/><br/>Some seventh-level universe Knight Pills and a acquired treasure.<br/><br/>This could be said to be a considerable amount of effort!<br/><br/>“Dragon King, there is also this map of Paradise. It was obtained by our previous tribe leader. It should be useful to you!”<br/><br/>Deep Pool tribe leader waved his hand again and a box flew over. He was introducing it.<br/><br/>“Grotto-heaven blessed map?”<br/><br/>Wang Xian’s interest was piqued. He raised his eyebrows and his eyes sparkled.<br/><br/>He opened the box. It was a special stone that looked like a treasure map. There were some routes and images carved on it.<br/><br/>Looking at this grotto-heaven blessed map, his eyes sparkled.<br/><br/>“Alright!”<br/><br/>Wang Xian put away all the treasures. His figure gradually turned illusory and disappeared!<br/><br/>At the side, the Heaven Array also disappeared.<br/><br/>Seeing Wang Xian leave, the deep pool tribe leader and the rest heaved a heavy sigh of relief.<br/><br/>They never expected that on this day, they would be so respectful to a force that surrounded the starry sky.<br/><br/>Buzz<br/><br/>In the Dragon Palace, Wang Xian’s figure appeared in the Dragon King’s Hall.<br/><br/>After returning this time, he was in a good mood.<br/><br/>This time, not only were the treasures of the righteous God race returned, but he also obtained a large amount of treasures and resources.<br/><br/>There were two acquired true treasures, one treasure map, and the corpses of the strong warriors from the Lich kingdom that he had killed.<br/><br/>These resources were enough to raise the Dragon Palace’s strength by quite a bit.<br/><br/>They could bring at least 30,000 universe knights to the Dragon Palace.<br/><br/>Now, with 60,000 plus 30,000, he could get close to 100,000.<br/><br/>The most important thing was that this time, he could increase many high-end fighters of the Dragon Palace.<br/><br/>After destroying three main cities of the Lich Kingdom, there were more than 20 universe knights at Level 7.<br/><br/>As for the other levels, there was no need to mention them.<br/><br/>“Dragon King!”<br/><br/>Sensing the return of the Dragon King, Prime Minister Turtle immediately came to pay his respects.<br/><br/>“Since the main planet of the ancient sea tribe has already collapsed, let’s move the Dragon Palace directly to the edge of the heaven-splitting primordial lands this time!”<br/><br/>“In addition, all the members of the Dragon Palace have absorbed the resources to increase their strength. After AO he and the rest have achieved a breakthrough, we will directly land!”<br/><br/>Wang Xian instructed Prime Minister Gui.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister gui immediately replied, “I am now preparing to look for some paradise in the heaven-splitting primordial lands to see which is more suitable for our Dragon Palace!”<br/><br/>“Yes, that’s fine. Make preparations in advance. Also, recruit some disciples!”<br/><br/>Wang Xian nodded with a smile.<br/><br/>The Dragon Palace was not in a hurry to proceed with the landings. All they had to do was to wait for Ao crab and the rest to make a breakthrough.<br/><br/>Furthermore, Wang Xian pondered for a moment and was also prepared to recruit some disciples of the Dragon Palace.<br/><br/>Although the number of one million members of the Dragon Palace was not a small number, it was definitely not much compared to a race.<br/><br/>Let’s see if we can recruit one million more this time and expand it.<br/><br/>After all, having more people meant having more strength.<br/><br/>Once the Dragon Palace entered the heaven opening primal continent, the races that would compete with them would be high-level races in the universe.<br/><br/>In the end, they might even compete with the peak races in the universe.<br/><br/>At the peak of the Divine Dragon Clan, there were about one million pure-blooded divine dragons, and there were even more other dragon races.<br/><br/>The number of the Dragon Palace had to be increased.<br/><br/>With the influence of the Dragon Palace, it would be very easy to recruit disciples.<br/><br/>It was estimated that all the water tribe experts in the surrounding starry sky would swarm over.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded in agreement.\t\t\t\t\t\t</div>", "images": {}, "success": true}