{"id": 336, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072573.html", "title": "Chapter 3327 - 3327 3326 Cursed Creatures", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3327 - 3327 3326 Cursed Creatures</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3327 3326 cursed creatures<br/><br/>The landing of the Dragon Palace was a very important matter to the Dragon Palace.<br/><br/>This was related to the future development of the Dragon Palace.<br/><br/>The heaven-opening primordial land was an incomparably huge and precious land. Choosing a good place for development would allow the dragon palace to improve rapidly.<br/><br/>Wang Xian attached great importance to this matter.<br/><br/>Three days later, after making some preparations, he left the Dragon Palace and flew straight towards the heaven-opening primordial land.<br/><br/>He went to the Cape of the sea to take a look.<br/><br/>He also wanted to look for that blessed land.<br/><br/>His flying speed was very fast. He had spent some time in the heaven-opening primal continent the last time, so he had some understanding of the continent.<br/><br/>When Wang Xian’s tai chi dragon coiled around him and the incorporeal holy wings were spread out, there were very few who could threaten him.<br/><br/>The speed of a universe knight at level nine, coupled with the defensive power of a universe knight at level nine, allowed him to fly above the heaven-opening primal continent without any scruples.<br/><br/>This also allowed him to travel at a much faster speed.<br/><br/>However, even so, this was still a long road.<br/><br/>Crossing over the mountains of the heaven opening desolation continent and across the huge lakes, Wang Xian had been hurrying along the road at an extremely fast speed.<br/><br/>After hurrying for three months, he looked at the distance and summoned an lie over.<br/><br/>The distance between the Cape of the sea and the Lich Kingdom was about a hundred times.<br/><br/>Wang Xian calculated that it would take at least a year for him to fly there.<br/><br/>Therefore, he decided to let an lie bring him there.<br/><br/>It was too far!<br/><br/>Buzz<br/><br/>Two days later, Wang Xian’s figure flashed and appeared in the void.<br/><br/>“Dragon King, the Sea of bamboo is in front of us. It is the territory occupied by the nine-candle demon race.”<br/><br/>An lie pointed to the front and reported to Wang Xian.<br/><br/>The nine-candle demon race was the race closest to the Cape of the sea. If nothing went wrong, the Dragon Palace might challenge this race in the future.<br/><br/>Wang Xian said to an lie as he looked ahead.<br/><br/>In front of him was a sea of bamboos.<br/><br/>Bamboos were not ordinary bamboos. There were many kinds of bamboos. Some were long and thin while others were thick and strong.<br/><br/>Some of them even had bamboo shoots growing on them.<br/><br/>Wang Xian moved his body and flew forward.<br/><br/>Buzz<br/><br/>When he got closer, he concealed himself.<br/><br/>The nine-candle demon race was not weak. They had the combat strength of a level eight universe knight. However, their overall strength was much weaker than the Lich Kingdom.<br/><br/>Wang Xian did not fly over recklessly. This time, he was not going to cause trouble.<br/><br/>Instead, he was looking at the nine-candle demon race before heading to the Cape of the sea.<br/><br/>“Eh? The bamboo here grows like a sailboat. Does it have any special abilities?”<br/><br/>Wang Xian approached the sea of bamboo and looked at the thing formed by the dense bamboo. His face was filled with curiosity.<br/><br/>Here, he could see some demon beasts of the nine-candle demon race.<br/><br/>The Nine-candle Demon Beast was a type of plant-type demon beast. It possessed the fire attribute and could fight two levels above it.<br/><br/>Their main body was similar to the bamboo and had nine sections.<br/><br/>Hence, they were called the nine-candle Demon Beast.<br/><br/>Wang Xian took a stroll around the nine-candle demon race.<br/><br/>From his senses, the strength of the nine-candle demon race was still quite a distance away from the Dragon Palace.<br/><br/>Even if the Dragon Palace were to launch a landing battle today, the nine-candle demon race would not be their match.<br/><br/>“Eh?”<br/><br/>At this moment, Wang Xian saw more than a hundred demon beasts that did not belong to the nine-candle demon race flying over. They came to the top of a huge bamboo.<br/><br/>On the huge bamboo, there were some teleportation formations.<br/><br/>More than a hundred demon beasts left directly through the teleportation formations.<br/><br/>“Teleportation formations, other demon races?”<br/><br/>Wang Xian’s eyes revealed a look of curiosity. He took out the universal AI to search for them.<br/><br/>“The nine-candle demon race actually has a teleportation formation that leads to the Horn of the sea?”<br/><br/>Wang Xian raised his eyebrows.<br/><br/>The Horn of the sea was a corner of the land and sea. There were many desolate beasts in it and it was very dangerous. However, there were also many similar treasures.<br/><br/>Although desolate beasts were ferocious, many desolate beasts could be used to forge acquired spiritual treasures.<br/><br/>Therefore, there were also quite a number of experts from the races heading to the Horn of the sea.<br/><br/>Wang Xian searched for some information regarding the teleportation formation of the nine-candle demon race. With a move of his body, he immediately flew towards the big bamboo.<br/><br/>“This expert, are you going to be teleported to the Cape of the sea?”<br/><br/>Wang Xian flew over and said as a nine-candle demon beast emerged from the big bamboo.<br/><br/>“Yes, I am going to be teleported.”<br/><br/>Wang Xian nodded his head.<br/><br/>“A treasure at the peak of the void God realm.”<br/><br/>The nine-candle demonic beast said.<br/><br/>“Sure!”<br/><br/>Wang Xian nodded his head. With a wave of his arm, he passed it to him.<br/><br/>A treasure at the peak of the void God realm was worth a lot to teleport once.<br/><br/>However, many experts could accept it.<br/><br/>After all, those who entered the Cape of the sea were all at least at the fourth level of the Universe Knight Realm.<br/><br/>If it was any lower, it would be dangerous to go there.<br/><br/>“Please!”<br/><br/>The nine-candle demon beast gestured at him. Wang Xian immediately went up to the big bamboo.<br/><br/>Buzz<br/><br/>The teleportation formation was activated. The next moment, the surroundings changed.<br/><br/>“Ou ou!”<br/><br/>Hualala<br/><br/>Just as he came out of the teleportation formation, Wang Xian heard the sound of seabirds and waves.<br/><br/>The surrounding scenery changed. A beautiful ancient world appeared in his sight.<br/><br/>“Killing and fighting are prohibited in the cursed spirit village.”<br/><br/>At this moment, a voice came from the side.<br/><br/>When Wang Xian heard this voice, his heart trembled slightly.<br/><br/>He turned his head and looked to the side. There was an old woman standing not far away. The old woman looked very ordinary. It was so ordinary that Wang Xian could sense that the other party only had the strength of a godly king.<br/><br/>What was the concept of a godly King’s strength in the heaven-splitting and primal continent?<br/><br/>Perhaps a hurricane could kill them.<br/><br/>The old woman looked completely human. She was old and very old.<br/><br/>However, her face and body were covered with black tattoos.<br/><br/>This kind of tattoo was very strange. Wang Xian took a glance at it and gave him a feeling of palpitations.<br/><br/>The strength of a godly king. Strange tattoos.<br/><br/>Curse Spirit Village?<br/><br/>Wang Xian’s eyes flickered. He didn’t get this kind of information from the artificial intelligence.<br/><br/>The artificial intelligence wasn’t omnipotent when it came to information.<br/><br/>However, he had a guess in his heart at this moment.<br/><br/>“Young man, this is your first time here, right? Hehe, we are cursed people and also weak people. But please don’t bully us.”<br/><br/>The old woman looked at Wang Xian and said with a smile. She appeared very casual.<br/><br/>Facing a universe knight like Wang Xian, she didn’t show any fear, even a hint of respect.<br/><br/>“A cursed person?”<br/><br/>Wang Xian’s eyes flickered. He smiled and said, “Don’t worry, Granny. I don’t dare to do so either.”<br/><br/>Wang Xian had seen similar creatures in the past when he was cursed.<br/><br/>These creatures were cursed creatures. Similarly, some people said that they were blessed creatures.<br/><br/>Their cultivation was very, very difficult. It was almost impossible for them to advance. According to the records, this kind of creature had never given birth to a universe knight.<br/><br/>However, don’t bully them because they were weak.<br/><br/>They carried a curse. If you killed this kind of person, the curse would descend on you.<br/><br/>You would suffer a terrifying and strange attack.<br/><br/>Even the universe ruler didn’t dare to kill this kind of creature casually.<br/><br/>Weak, cursed, but also protected by Heaven and earth.\t\t\t\t\t\t</div>", "images": {}, "success": true}