{"id": 339, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072579.html", "title": "Chapter 3330 - 3330 3329 Came From The Sneak Attack Of The Cursed Person", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3330 - 3330 3329 Came From The Sneak Attack Of The Cursed Person</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3330 3329 came from the sneak attack of the cursed person<br/><br/>In front of the basin shrouded in white light, over a thousand experts of the light race’s nine-candle demon race were staring at Wang Xian.<br/><br/>Wang Xian was also staring at them.<br/><br/>Both parties had a brief confrontation.<br/><br/>It was obvious that the light race’s nine-candle demon race had been preparing for this blessed land for a very long time.<br/><br/>Wang Xian was determined to obtain this blessed land.<br/><br/>This blessed land was much stronger than the ones he had visited in Scorpion Emperor City, black wing city, and five bug city.<br/><br/>This basin had a special effect.<br/><br/>“This place is still occupied by some powerful desolate beasts. There’s no need for us to fight to the death at this moment. Let’s kill off the desolate beasts here first.”<br/><br/>A Universe Knight Level 8 great being of the nine-candle demon race said indifferently.<br/><br/>The great being of the light race at the side was silent, but he didn’t refuse.<br/><br/>There were still powerful desolate beasts in the grotto-heaven blessed land, and the desolate beasts hadn’t rushed over to compete. Even if they won, if they couldn’t get rid of the desolate beasts in the end, it would be in vain.<br/><br/>Besides, this Dragon Palace Dragon King was able to force the lich kingdom to such an extent, so his power was definitely not as ordinary as he had imagined.<br/><br/>Furthermore, the other party was a pure-bred divine dragon.<br/><br/>“Of course, I have no objections. Let’s kill the desolate beasts here first, then we will continue to fight over them.”<br/><br/>Wang Xian heard their words and nodded his head slightly.<br/><br/>The grotto-heaven and blessed land was occupied by whoever had the ability.<br/><br/>The other party did not attack him directly. Furthermore, it was hard to say what would happen next.<br/><br/>If there were desolate beasts with the combat strength of A Level 9 universe knight, no one would be able to occupy this place.<br/><br/>Moreover, they could join hands to enter this place now.<br/><br/>By then, they would be able to figure out the strength of the other party.<br/><br/>“Alright!”<br/><br/>“Alright!”<br/><br/>Wang Xian smiled faintly when he heard his words.<br/><br/>He was rather satisfied with this rule.<br/><br/>If he displayed his powerful strength, the other party would withdraw from this competition.<br/><br/>Of course, if the other party’s strength made Wang Xian feel that he couldn’t win, he would withdraw as well.<br/><br/>However, the possibility of this happening was very small.<br/><br/>“Everyone, get ready to enter!”<br/><br/>The leader of the light race scanned the surroundings and said in a low voice.<br/><br/>“Yes!”<br/><br/>The warriors of the two races immediately responded and looked ahead.<br/><br/>They had rushed here from the outside and used half a year’s time to encounter dozens of desolate beast groups.<br/><br/>Some of the desolate beast groups had universe knight level 8 beings guarding them.<br/><br/>As for the group of desolate beasts that could occupy the center of this blessed land, their strength was definitely terrifying.<br/><br/>Wang Xian glanced at them and looked at the basin in front of him again.<br/><br/>He could vaguely sense that there were powerful desolate beasts in this blessed land.<br/><br/>“Let’s Go!”<br/><br/>At the side, the powerhouses of the light race and the nine-candle demon race charged straight ahead. They formed a battle formation and stared carefully ahead.<br/><br/>Wang Xian’s figure moved and flew forward as well.<br/><br/>At this moment, he naturally could not stay behind to watch the show.<br/><br/>“It’s just the Dragon King Alone!”<br/><br/>The powerhouse of the light race and the nine-candle demon race, who had the combat strength of a universe knight at level eight, glanced at Wang Xian and frowned slightly.<br/><br/>“There should be a backup plan. Let’s ignore the Dragon King for now. However, we have to be careful to prevent him from ambushing us!”<br/><br/>The leader of the light race said softly.<br/><br/>“What desolate beast is this?”<br/><br/>At this moment, Wang Xian, who was standing to the side, stared ahead with his eyes flickering.<br/><br/>In the inner part of the grotto-heaven blessed land, there were desolate beasts. These desolate beasts were slender and had two wings that were like sharp swords.<br/><br/>This desolate beast was lying quietly at the bottom of the sea, like a cross.<br/><br/>Their bodies were emitting white light. They did not move at all, and one could not sense their strength.<br/><br/>“This is an aquatic creature. Its strength is not simple!”<br/><br/>Wang Xian muttered. With a glance, there were many of these desolate beasts.<br/><br/>Their bodies were not big, only two meters in size.<br/><br/>At the side, the light race and the nine-candle demon race also saw the desolate beasts in front of them. They were all on high alert.<br/><br/>“Let’s test the strength of these desolate beasts first!”<br/><br/>A Universe Knight Level 8 warrior of the nine candle race said, he slowly landed on the bottom of the sea, lightly stomping his feet.<br/><br/>“Pu Pu Pu!”<br/><br/>In an instant, below the bottom of the sea, countless sharp bamboos attacked the desolate beast.<br/><br/>“Weng!”<br/><br/>The moment the warrior of the nine candle race attacked, everyone felt like they were being watched.<br/><br/>The extremely sharp bamboo was easily evaded by the desolate beasts.<br/><br/>At the next moment, beams of light swords attacked them.<br/><br/>In front of them, there were more than a thousand of these desolate beasts attacking.<br/><br/>Wang Xian was also covered by the attacks!<br/><br/>“Eh? All of the attacks are not lower than a level six universe knight. Such powerful strength!”<br/><br/>Wang Xian sensed the attacks and his gaze focused. The strength of these desolate beasts was very strong.<br/><br/>“Kill!”<br/><br/>Without any hesitation, he waved his arm and faced the light swords that were attacking him!<br/><br/>Desolate beasts were also very powerful resources.<br/><br/>“Kill, destroy them!”<br/><br/>The powerhouses of the light race and the nine-candle demon race sensed the attacks of the desolate beasts in front of them and immediately ordered loudly.<br/><br/>Among this group of desolate beasts, none of them had the combat strength of a universe knight at level eight. It should be because they were at the edge of the grotto-heaven blessed land and could be destroyed as soon as possible.<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>The group of desolate beasts saw them attacking. Without any roars, their figures moved and attacked rapidly like a ray of light.<br/><br/>“Dragon Eye Lock on the eight desolates!”<br/><br/>Wang Xian saw the group of desolate beasts and did not hesitate at all. Numerous chains instantly attacked them.<br/><br/>“Hualala!”<br/><br/>Long chains wrapped around them. In an instant, they covered over a hundred desolate beasts and wrapped around their bodies.<br/><br/>Faced with Wang Xian’s attack, these desolate beasts were still unable to resist.<br/><br/>“Ji Ji!”<br/><br/>However, the next moment, what shocked Wang Xian was that the desolate beasts that were entangled by the chains let out terrified cries.<br/><br/>Their bodies started to collapse slowly. Only a white glow was connected to their bodies.<br/><br/>They even gave up on some places that were completely entangled by the chains.<br/><br/>More than a hundred desolate beasts avoided Wang Xian’s attack. Their collapsed bodies were rapidly solidified under the white light. It seemed that they were not injured at all.<br/><br/>Buzz<br/><br/>They did not hesitate at all and flew backward.<br/><br/>A sharp sound spread to the surroundings.<br/><br/>“What a strange ability, what a powerful recovery ability!”<br/><br/>Wang Xian’s expression changed slightly when he saw this scene.<br/><br/>The recovery ability of these desolate beasts was abnormally terrifying. This might have a lot to do with this blessed land.<br/><br/>“They are trying to escape, chase after them!”<br/><br/>At the side, a universe knight level 8 powerhouse from the nine-candle demon race shouted loudly.<br/><br/>They had also encountered Wang Xian’s situation.\t\t\t\t\t\t</div>", "images": {}, "success": true}