{"id": 333, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072567.html", "title": "Chapter 3324 - 3324 3323, The Deep Swamp Race That Peed Their Pants", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3324 - 3324 3323, The Deep Swamp Race That Peed Their Pants</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3324 3323, the deep swamp race that peed their pants<br/><br/>“Boom Boom!”<br/><br/>In the sky above a swamp in the heaven opening desolate continent.<br/><br/>On this swamp, there were all sorts of grass growing. Some of the grass even contained powerful spiritual energy.<br/><br/>In the sky, there would occasionally be some flying desolate beasts landing on the swamp.<br/><br/>This swamp region was the territory of the deep swamp race.<br/><br/>The deep swamp race was a race that specialized in cultivating the Earth attribute.<br/><br/>They lived in the interior of the deep swamp. The entire swamp was the best shelter for their race.<br/><br/>In the middle of the Deep Swamp, there was another blessed land. The exact effect of the blessed land was unknown.<br/><br/>The deep swamp race had occupied this swamp area for a very, very long time.<br/><br/>It was so long that many people could not remember how long it had been.<br/><br/>It was also because of this swamp that formed a natural protection for them. Very few forces would attack this place, and very few forces would be able to break through this place.<br/><br/>At this moment, Wang Xian’s figure was suspended in the air above the middle of the deep swamp.<br/><br/>According to the detection of the Heaven Array Formation, the Divine Kingdom of the corpse was more than a hundred million kilometers deep.<br/><br/>Wang Xian was suspended in the air above, and a faint smile appeared on his face.<br/><br/>“Boom!”<br/><br/>The next moment, he waved his arm, and the five elemental grindstone beneath him instantly expanded and fell directly towards the swamp below.<br/><br/>An extremely violent sound was heard from the swamp. Accompanied by an incomparably terrifying force, it charged downwards.<br/><br/>At the same time, it was located at the location below.<br/><br/>In the interior of the swamp, when Wang Xian and the heaven array arrived above the deep swamp, the disciples of the deep swamp race below had already noticed their arrival.<br/><br/>However, in the sky above their domain, there would often be powerhouses from the forces of the heaven-splitting and primal continent passing by.<br/><br/>They weren’t too cautious about this.<br/><br/>When they felt a terrifying power surging downwards, the expressions of the disciples of the Deep Swamp race changed drastically.<br/><br/>“The other party’s strength is very terrifying. If they attack directly, it will definitely be a provocation. Immediately notify the experts of the race!”<br/><br/>At this moment, without the need for the old man to give orders, some experts of the deep swamp race in the swamp quickly flew out from the palaces.<br/><br/>They raised their heads and looked up.<br/><br/>Through the swamp, they could clearly see two figures floating in the air, staring at them coldly.<br/><br/>“Courting death, who are these two? How dare they provoke our deep swamp race!”<br/><br/>The eyes of the experts of the deep swamp race were filled with coldness.<br/><br/>Their deep swamp race was not weak at the edge of the heaven opening primal continent.<br/><br/>Two people and they dared to cause trouble here?<br/><br/>They were simply courting death.<br/><br/>Boom! Boom! Boom<br/><br/>The powerhouses of the deep pool race emitted an earthy yellow luster as they flew towards the sky.<br/><br/>“Hehe, they are here!”<br/><br/>Wang Xian looked down and revealed a faint smile.<br/><br/>Wang Xian did not put this deep pool race in his eyes at all.<br/><br/>He could easily destroy a race that was only a level seven universe knight.<br/><br/>Even if the other party had a blessed land, he still had the confidence.<br/><br/>“Who are you people? How dare you provoke our deep pool race!”<br/><br/>A group of deep pool race experts flew out and locked their eyes on the two people from Wang Xian’s Heaven Formation. They questioned with a cold expression.<br/><br/>“Hand him over to me!”<br/><br/>Wang Xian waved his arm and a corpse landed in front of them.<br/><br/>“Huh?”<br/><br/>When they saw this body, they were slightly stunned.<br/><br/>“It’s Deep Pool Abyss. It’s his corpse. Isn’t he…”<br/><br/>The few elders swept their gaze over and their pupils contracted slightly.<br/><br/>They knew who this corpse was. Deep Pool Abyss was also a famous expert of their deep pool race.<br/><br/>He had a universe Knight Level 7 father, and he himself was a universe knight level 6.<br/><br/>Seeing his strength, the eyes of the warriors of the deep pool race focused.<br/><br/>“May I ask who you are?”<br/><br/>An old man asked warily.<br/><br/>Not long ago, Deep Pool Abyss and the others had gone out for the treasures of the Righteous God race, and they knew some things.<br/><br/>In the end, only deep pool was left alive.<br/><br/>Now, the other party had taken out deep pool’s corpse. The other party was…<br/><br/>“Dragon Palace, Dragon King, I know that this fellow is not dead yet. Hand him over or I will exterminate your deep pool race!”<br/><br/>Wang Xian looked at them and said faintly.<br/><br/>“What!”<br/><br/>“Dragon Palace’s Dragon King!”<br/><br/>Below them, the expressions of over a hundred experts of the deep pool race changed drastically. Their pupils contracted slightly and were filled with fear and panic.<br/><br/>This was the Dragon King of the Dragon Palace?<br/><br/>What the F * ck? It Can’t be true!<br/><br/>The Dragon King of the Dragon Palace came to them?<br/><br/>“Hong!”<br/><br/>Just as everyone was shocked, a terrifying pressure pressed down on them.<br/><br/>This time, among the group that flew out, the strongest was only a universe knight level 6.<br/><br/>Feeling this terrifying pressure, their bodies shook.<br/><br/>“Pu Pu Pu!”<br/><br/>All the warriors of the deep swamp race couldn’t help but spit out a mouthful of blood, their faces pale and terrified.<br/><br/>“Lord Dragon King, we’ll immediately report to the clan leader and bring them to you!”<br/><br/>A Deep Swamp Race Universe Knight Level 6 warrior hurriedly said.<br/><br/>After saying that, he gestured to the old man beside him.<br/><br/>The old man moved and immediately flew down into the swamp.<br/><br/>“What?”<br/><br/>When the leader of the deep swamp race in the grotto-heaven blessed land heard this news, his face was filled with shock and panic.<br/><br/>“Send someone to call the Deep Swamp Abyss over immediately!”<br/><br/>He growled and immediately flew up into the sky.<br/><br/>“Greetings, Dragon King!”<br/><br/>When the tribe leader of the Deep Pool tribe saw Wang Xian, he immediately bowed and said, “Lord Dragon King, we do not know how the Deep Pool tribe provoked you. I have already ordered someone to bring him here and await your orders!”<br/><br/>As the tribe leader of the Deep Pool tribe spoke, cold sweat appeared on his forehead.<br/><br/>The person in the sky was the Dragon King. He was an existence who had just destroyed three main cities of the Lich Kingdom.<br/><br/>He was also an expert who had single-handedly made the lich kingdom bow their heads.<br/><br/>Such an expert was not someone that the deep pool tribe could contend against.<br/><br/>In front of such an expert, they could only be respectful.<br/><br/>Otherwise, their tribe would not be able to bear the consequences.<br/><br/>“Alright!”<br/><br/>Wang Xian looked at the leader of the deep pool tribe and uttered a word.<br/><br/>If the Deep Pool tribe was honest, he would not have destroyed them for no reason.<br/><br/>“Clan leader, call my son up. What’s the situation?”<br/><br/>At this moment, in the swamp, an old man looked at the person who reported to him and frowned slightly.<br/><br/>On the side, the Deep Swamp Abyss also frowned and suddenly had a bad premonition.<br/><br/>“Deacon Zuo, the Dragon King has come to our deep swamp race and wants to go to the Deep Swamp Abyss.”<br/><br/>The disciple who came to report replied.<br/><br/>“The Dragon King wants me to go? Then the Dragon King of the Dragon Palace wants me to go?”<br/><br/>When the deep pool tribe heard this, their faces changed and their eyes were filled with panic.\t\t\t\t\t\t</div>", "images": {}, "success": true}