{"id": 332, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072565.html", "title": "Chapter 3323 - 3323 3322 Little Rats", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3323 - 3323 3322 Little Rats</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3323 3322 little rats<br/><br/>“Undo all the formations.”<br/><br/>Around the Dragon Palace, the National Master of the Lich Kingdom received the order from the Lich King and ordered with an ugly expression.<br/><br/>The surrounding liches nodded silently.<br/><br/>They had already learned of what had happened in Blackwing city.<br/><br/>They had also learned of the death of the thousand-eyed city lord.<br/><br/>It was already the best choice for them to bow down to the Dragon Palace.<br/><br/>If they continued to fight, no one would know who would die?<br/><br/>But they were certain that their lich kingdom would suffer great losses.<br/><br/>The arrays were dismantled one by one, and the starry sky around the Dragon Palace regained its light.<br/><br/>Very soon, experts from the Lich Kingdom were teleported over from the teleportation array not far away.<br/><br/>They placed the righteous God Race Cosmos God kingdoms in the void beside them.<br/><br/>Time passed by little by little. Not long after, more than 10,000 God kingdoms floated around the Dragon Palace.<br/><br/>These unowned God kingdoms were an exceptionally rich resource for any power.<br/><br/>Other than the God kingdoms of the universe knights, there were also the God kingdoms of millions of void God emperors.<br/><br/>The Lich Kingdom returned all the God kingdoms of the righteous God races one by one.<br/><br/>Below them, the disciples of the Dragon Palace sneered when they saw this scene.<br/><br/>“It seems that the Lich Kingdom knows its place. If they dare to be arrogant for another year or two, we’ll destroy them after Ao crab and the others improve!”<br/><br/>The leaders of the Dragon Palace said with a smile when they saw this scene.<br/><br/>These divine kingdoms were very beneficial to the devouring dragon.<br/><br/>And the divine kingdoms that the Lich Kingdom had robbed this time could be said to have robbed a large part of the devouring Dragon’s resources.<br/><br/>If ao crab knew this, he would definitely kill the Lich Kingdom and the others after he leveled up.<br/><br/>Now that the Lich Kingdom had returned all the divine kingdoms, they had actually dodged a disaster.<br/><br/>At the same time, the powerhouses at the edge of the land, stars, and desolation continent also knew what had happened on the Dragon Palace’s side.<br/><br/>“Has he admitted defeat?”<br/><br/>In the heaven-opening desolation continent, Wang Xian squinted his eyes slightly when he saw the news.<br/><br/>Now, after exterminating the thousand-eye city lord, he had obtained another universe knight level 8 powerhouse’s corpse.<br/><br/>After absorbing this corpse, the Dragon Palace would be able to increase the combat strength of four universe knights level 8 powerhouses.<br/><br/>With this number, if they continued to fight against the Lich Kingdom, they would still suffer heavy losses.<br/><br/>However, since the Lich Kingdom had stopped fighting, Wang Xian was not prepared to make a move either.<br/><br/>If they continued to fight against the Lich Kingdom, there would still be some dangers.<br/><br/>Everything would be settled after one or two years.<br/><br/>“Let’s go back!”<br/><br/>Wang Xian muttered. His body moved and he immediately flew out of the heaven-splitting chaotic land.<br/><br/>He didn’t return to the Dragon Palace immediately because he had some matters to settle.<br/><br/>It was a small matter to him at the moment.<br/><br/>“An lie, bring the Heaven Array Here!”<br/><br/>Wang Xian sent a message to an lie and waited for a reply.<br/><br/>“Greetings, Dragon King”<br/><br/>Not long after, the sky array and an lie appeared in front of them.<br/><br/>The sky array had already absorbed the corpse of another expert from the corpse-wrapping race. Its strength had also broken through to the level of a level eight universe knight.<br/><br/>Furthermore, after destroying three cities in the Lich Kingdom, they had obtained a lot of knowledge on spell formations and other aspects.<br/><br/>This had greatly improved the heaven formation and the Dragon Wizard.<br/><br/>“Check the location of this corpse’s Divine Kingdom!”<br/><br/>Wang Xian waved his arm and threw a corpse in front of the Heaven Formation.<br/><br/>This corpse was the one he had killed beside the treasure of the Righteous God race.<br/><br/>At that time, he had killed more than ten other people.<br/><br/>This was the disciple of a race in the heaven opening and desolation continent. Although he had been killed, he did not die completely. He must have survived with the help of the Supreme Treasure.<br/><br/>Not long ago, this guy who escaped had been taunting and cursing him on the universe’s AI.<br/><br/>He was also the one who spread the news about the lich kingdom snatching the treasure of the Orthodox God Race of the Dragon Palace.<br/><br/>At that time, he even cursed the Dragon Palace!<br/><br/>Wang Xian was very displeased with this guy.<br/><br/>Now that the matter of the Lich Kingdom had been resolved, he would pay a visit to this keyboard warrior and let him know the dangers of this world and the strong malice towards him.<br/><br/>“It’s the Dragon King!”<br/><br/>The Heaven Formation nodded immediately. With the corpses around, it would be much easier for him to find the Kingdom of God.<br/><br/>Furthermore, it was much easier now that he had achieved a breakthrough in his strength.<br/><br/>“Dragon King, in this direction!”<br/><br/>Soon, the Heaven Formation pointed in a direction and spoke.<br/><br/>Wang Xian waved his arm and the five elements millstone appeared beneath them. Immediately, they flew towards the direction pointed by the Heaven Formation.<br/><br/>The speed of the five elements millstone was not slow either. The two of them shuttled through the heaven-splitting chaotic land at a rapid speed.<br/><br/>“Let’s take a look. Let’s take a look at the position at the edge of the heaven-splitting chaotic land. which place is suitable for our Dragon Palace to live in?”<br/><br/>Wang Xian said with a smile on his face.<br/><br/>Very soon, they would be able to enter the heaven-splitting chaotic land completely.<br/><br/>“Yes!”<br/><br/>The Heaven Formation nodded and opened the universal AI to take a look.<br/><br/>At the edge of the heaven opening primal continent, the Dragon Palace could land wherever they wanted.<br/><br/>“Trash, the Lich Kingdom is trash. They can’t even destroy a small dragon palace, and they still claim that they are the top three forces at the edge of the Heaven Opening Primal Continent. They are trash!”<br/><br/>At the same time, in a palace in a swamp in the heaven opening primal continent, a middle-aged man roared furiously.<br/><br/>His face was filled with anger and unwillingness.<br/><br/>He had hoped that the Dragon Palace would be destroyed by the Lich Kingdom and that the Dragon King would be killed!<br/><br/>But now, the Dragon Palace had actually forced the lich kingdom to lower its head and admit defeat.<br/><br/>If that was the case, the possibility of him wanting to take revenge had completely disappeared.<br/><br/>“Damn it!”<br/><br/>He slammed the items one by one, took a deep breath, and closed the universe AI in front of him.<br/><br/>“I should recover my power as soon as possible, and ask for some treasures from my father.”<br/><br/>The middle-aged man’s face was dark, and he decided to forget about revenge.<br/><br/>He moved and left the palace immediately, flying down.<br/><br/>If his hope was destroyed, he wouldn’t have any hope of revenge in the future. He would recover his power first.<br/><br/>“Dragon King, it’s right in front!”<br/><br/>Five days later, the Heaven Array stood on the five elements Millstone and pointed at a swamp in front. “This place seems to be the territory of the deep swamp race. This race is not weak. There are many level seven universe knights in the race.”<br/><br/>“According to the instructions of the array, the universe god country of this corpse is Right Here!”<br/><br/>Wang Xian stood up and looked at the spot in front. He frowned slightly.<br/><br/>“Deeppool race? Let’s go. Hehe, let’s go and kill that Rat!”<br/><br/>He said faintly.\t\t\t\t\t\t</div>", "images": {}, "success": true}