{"id": 338, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072577.html", "title": "Chapter 3329 - 3329 3328 Powerful Grotto-Heaven Blessed Land", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3329 - 3329 3328 Powerful Grotto-Heaven Blessed Land</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3329 3328 powerful grotto-heaven blessed land<br/><br/>“What’s going on?”<br/><br/>Wang Xian moved his palm and the grotto-heaven blessed land appeared in his hand.<br/><br/>At this moment, the blurry grotto-heaven blessed land was emitting a white glow. A clear map appeared in the middle of the map.<br/><br/>It was also an ocean basin, but this basin was not pitch-black. Instead, it was emitting a white glow.<br/><br/>As it was shown on the treasure map, Wang Xian did not know the exact situation.<br/><br/>“What’s the situation? A pitch-black basin, and now there’s a basin covered in white light? Things will always go against each other when they reach the extreme?”<br/><br/>Wang Xian’s eyes flickered slightly.<br/><br/>He looked at the route of the grotto-heaven blessed land and flew straight ahead.<br/><br/>“HMM? There are so many aquatic creatures!”<br/><br/>After flying for less than three minutes, Wang Xian suddenly sensed that there were more desolate beasts in the water around him.<br/><br/>It could even be described as a lot.<br/><br/>Each desolate beast was emitting a powerful aura. They were in groups, and the weakest among them was at least a level four universe knight.<br/><br/>Wang Xian hesitated for a moment and did not attack these desolate beasts. He continued flying forward.<br/><br/>There was a white light spot on the map of the grotto-heaven blessed land. The light spot was not very far away from him.<br/><br/>He did not know what was going on. Wang Xian was prepared to go over and check it out.<br/><br/>On the map, the white basin was not too far away from the white light spot. Of course, if Wang Xian were to fly, he would need one or two days.<br/><br/>He hid his body and flew towards the white light spot. Wang Xian realized that the deeper he went, the more dire beasts there were.<br/><br/>This sea area was at the same extreme as the previous location. It was dead silent and full of vitality.<br/><br/>The seabed was abnormally beautiful. There were all kinds of plants and many universe knight-level spiritual herbs and spiritual trees.<br/><br/>Wang Xian even saw a acquired spiritual treasure in the middle of a group of desolate beasts.<br/><br/>This place was simply a Holy Land.<br/><br/>“It should be because of that blessed land. Every blessed land will attract all kinds of powerful forces to fight for it. Naturally, it will also attract desolate beasts.”<br/><br/>He mumbled and avoided the desolate beasts one by one. He walked towards the location of the light spot.<br/><br/>There was a stone under him. The stone looked very ordinary. However, on the surface of this stone, it seemed as though a thin layer had been cut off.<br/><br/>The size of this layer was the same as the grotto-heaven blessed land in his hands.<br/><br/>He raised his eyebrows and placed the map on it.<br/><br/>Buzz<br/><br/>At this moment, the surrounding white light lit up and a teleportation formation appeared.<br/><br/>Wang Xian narrowed his eyes slightly. The tai chi dragon coiled around him and announced that he had stepped into the teleportation formation.<br/><br/>Buzz<br/><br/>The next moment, his figure appeared at the edge of a basin that was emitting white light.<br/><br/>A warm energy enveloped his entire body, making him feel extremely comfortable.<br/><br/>“This is?”<br/><br/>He looked at the spot in front of him with a look of excitement in his eyes.<br/><br/>The grotto-heaven blessed land. The basin that was emitting white light in front of him was the grotto-heaven blessed land.<br/><br/>Moreover, it was a grotto-heaven blessed land that was not occupied by other factions.<br/><br/>Standing at the edge, Wang Xian could sense a powerful light force. This force could clear his mind and increase his recovery ability tremendously.<br/><br/>At this moment, it was as if he had received a blessing. His entire body was in an extremely mystical state.<br/><br/>Wang Xian had even cut off his arm. He could recover immediately just by relying on this force of light.<br/><br/>“I have yet to enter the grotto-heaven blessed land completely, but I already possess such a powerful ability. What about in the depths?”<br/><br/>Wang Xian mumbled, his eyes filled with excitement.<br/><br/>He didn’t expect his luck to be so good.<br/><br/>A treasure map had brought him directly into this place.<br/><br/>This was simply giving him a grotto-heaven blessed land.<br/><br/>“That’s not right. Are there desolate beasts in the basin?”<br/><br/>At this moment, Wang Xian narrowed his eyes slightly. His dragon eyes flickered.<br/><br/>Waves of energy were injected into his dragon eyes. Wang Xian could vaguely see the situation inside.<br/><br/>In the basin, there were many desolate beasts that were emitting the power of light.<br/><br/>He did not know how strong these desolate beasts were, but they were definitely not weak.<br/><br/>“Hualala!”<br/><br/>At this moment, Wang Xian sensed movement coming from behind. He was slightly stunned and looked over.<br/><br/>More than a thousand figures were flying over quickly. When Wang Xian saw these figures, his eyes flickered slightly.<br/><br/>There were actually people who came here.<br/><br/>Furthermore, it was a faction.<br/><br/>There were more than 1,000 powerhouses. The weakest among them was a level five universe knight.<br/><br/>“There are powerhouses from the nine-candle demon race and another faction.”<br/><br/>Wang Xian thought to himself.<br/><br/>One of them was from the nine-candle demon race, and the other was from a human race.<br/><br/>However, this human race had a pair of bright wings on their back. They looked somewhat like the angel race, but they shouldn’t be from the angel race.<br/><br/>“HMM?”<br/><br/>When Wang Xian saw them, more than a thousand people who flew over also noticed him. The five powerhouses who were in the lead were clearly stunned. They were filled with astonishment.<br/><br/>Their eyes were fixed on Wang Xian as they sized him up from head to toe.<br/><br/>“Which race are you from? How did you barge into this place?”<br/><br/>The powerhouse who had a pair of bright wings looked at Wang Xian. His eyes flickered as he asked.<br/><br/>“Dragon Palace, which race are you all from?”<br/><br/>Wang Xian did not hide anything after hearing the words of the powerhouse with the bright wings. Instead, he asked them.<br/><br/>“Dragon Palace? Are you the Dragon King?”<br/><br/>The powerhouse with the bright wings was shocked when he heard what Wang Xian said.<br/><br/>Wang Xian did not reply. Instead, he looked at them.<br/><br/>“We are from the light race. They are from the nine-candle demon race.”<br/><br/>The leader of the light race said faintly.<br/><br/>“The light race?”<br/><br/>Wang Xian was slightly surprised when he heard his introduction.<br/><br/>The light race was a famous faction at the edge of the heaven-splitting primordial land. In terms of strength, they were probably second only to the corpse-wrapping race in the Lich Kingdom.<br/><br/>However, no one knew the exact strength of the light race. No one knew how strong the light race was.<br/><br/>The two major races had joined forces to come here. Who were they?<br/><br/>Wang Xian’s eyes were also flickering as he swept his gaze across them.<br/><br/>Among the 1,000 of them, there was a bloody smell on their bodies. It was obvious that they had come all the way here.<br/><br/>“Are you all here for this grotto-heaven blessed land?”<br/><br/>Wang Xian asked them.<br/><br/>“That’s right.”<br/><br/>The leader of the light race answered bluntly. He looked at Wang Xian warily and asked, “Dragon King, are you here for this grotto-heaven blessed land as well?”<br/><br/>“Yes.”<br/><br/>Wang Xian did not hide anything.<br/><br/>“What do you mean by that? Are you leaving now, Dragon King, or are we leaving?”<br/><br/>The leader of the light tribe narrowed his eyes slightly and said, “Or should we chase away the desolate beasts in the grotto-heaven blessed land first? After that, we will determine the victor.”<br/><br/>The light tribe and the nine-candle demon tribe did not underestimate Wang Xian. To be able to force the lich kingdom to such an extent, they also attached importance to the Dragon King.<br/><br/>“Hehe, suit yourself.”<br/><br/>Wang Xian’s gaze swept across the five in front of them, his eyes gleaming.<br/><br/>He was not afraid of the five universe knights and level eight powerhouses.\t\t\t\t\t\t</div>", "images": {}, "success": true}