{"id": 346, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072593.html", "title": "Chapter 3337 - 3337 3336", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3337 - 3337 3336</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3337 3336<br/><br/>“AH, how is this possible? Why aren’t you under the attack of the curse?”<br/><br/>When the flames engulfed everyone in the cursed spirit village and when they felt the intense pain, the people from the cursed spirit village were completely flustered.<br/><br/>They stared at Wang Xian in horror and shouted in disbelief.<br/><br/>The other party was attacking them and the curse had already counterattacked. Why was nothing happening to the other party?<br/><br/>Their curses seemed to be useless against the other party.<br/><br/>“Curse? Do you really think that you are invincible just because of your curses? Hehe?”<br/><br/>Wang Xian stared at them and laughed mockingly.<br/><br/>“Next, enjoy the torture of the Sea of Fire!”<br/><br/>He laughed coldly and the flames engulfed them bit by bit.<br/><br/>“Ahhhh!”<br/><br/>Screams of agony were emitted from their mouths. Hundreds of people from the cursed village were shouting in horror.<br/><br/>At this moment, they were filled with despair.<br/><br/>Wang Xian stood there quietly, feeling the attack from the curse power.<br/><br/>To his satisfaction, the Tai Chi Dragon Coil had blocked all the curse power.<br/><br/>This made him smile.<br/><br/>“This… this… that Dragon King actually blocked the attack from the curse. How did he do it?”<br/><br/>“I don’t know. It should be the defensive treasure around his body. It’s really powerful!”<br/><br/>“Hahaha, good, good, good, good, good, kill them. Let them die in pain and despair.”<br/><br/>The experts of the light tribe and the nine-candle demon tribe were shocked and confused when they saw this scene.<br/><br/>However, they were all excited.<br/><br/>They were already filled with anger towards this group of damned cursed Spirit Village People.<br/><br/>Now that Wang Xian had killed them, they were able to vent their anger as well.<br/><br/>The miserable screams continued for a full half an hour.<br/><br/>This was the first time he had killed someone so slowly.<br/><br/>“Eh?”<br/><br/>Just as they were dying one by one, Wang Xian saw a white light flashing across a few corpses.<br/><br/>He looked at the white light, and his eyes were shining.<br/><br/>This white light was somewhat familiar. The last time he killed a universe knight level eight desolate beast, there was also a flash of white light on the body of that desolate beast.<br/><br/>Other than that, when he killed the middle-aged man from the deep pool race, after his death, there was a flash of earthy yellow light.<br/><br/>This meant that the other party might not have died completely. Moreover, he had used a bunch of treasures to make his soul escape.<br/><br/>“Could it be…”<br/><br/>He had some guesses in his heart as his eyes sparkled.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Not long after the white glow disappeared, the mechas in the depths of the grotto-heaven blessed land flew over rapidly.<br/><br/>In the middle, three mechas released terrifying attacks and attacked Wang Xian.<br/><br/>“HMPH!”<br/><br/>Wang Xian looked at the mech with a cold look in his eyes.<br/><br/>Last time, he was afraid of the power of the curse, so he didn’t attack. However, this time, he didn’t have any scruples.<br/><br/>Buzz<br/><br/>Wang Xian moved his body and the incipient Saint Wings appeared behind him. The Tai Chi Dragon spun around.<br/><br/>His palm turned into a dragon claw and attacked the hundred mechs directly.<br/><br/>“Kill, kill him!”<br/><br/>A cold and hateful voice came from the three level eight universe knights in the middle of the mechs. Rays of terrifying light shot towards Wang Xian.<br/><br/>Wang Xian did not dodge the terrifying attack. Instead, he went straight for it.<br/><br/>“Boom!”<br/><br/>When the three terrifying attacks landed on Wang Xian, the Tai Chi Dragon Plate instantly blocked the attacks from the mechs.<br/><br/>On the Tai Chi Dragon Plate, the black parts were emitting a strange luster. A black recoil force was directed at the three mecha.<br/><br/>“Dodge!”<br/><br/>The three mecha instantly calculated the strength and speed of the recoil force and immediately dodged to the side.<br/><br/>Boom! Boom! Boom! Boom<br/><br/>At this moment, around the three mecha, hundreds of other mecha were attacking Wang Xian.<br/><br/>“Not good. There’s only one dragon king, but there are three level 8 universe knights in that group of mechas!”<br/><br/>The experts of the light race’s nine-candle demon clan glanced at the group of mechas. Their expressions changed slightly as they spoke in a deep voice.<br/><br/>However, they did not dare to go over to help. If they rushed over, the ones who would die would be them.<br/><br/>“Hmph, I’ll kill all of you today.”<br/><br/>Wang Xian’s eyes were filled with coldness. With the Tai Chi Dragon Disc’s defense, he did not have any scruples.<br/><br/>Facing the coverage of all kinds of energy, he flapped his incipient saint wings and attacked a level eight mech of a universe knight.<br/><br/>Boom<br/><br/>When his speed was pushed to the extreme, the level eight mech of a universe knight could not dodge at all.<br/><br/>Wang Xian rushed over. The Dragon Claw in his hand landed directly on the mech. The huge force caused the mech to tremble.<br/><br/>“What a strong defense!”<br/><br/>Wang Xian narrowed his eyes slightly. The Five Elements Millstone appeared in the sky above him in an instant.<br/><br/>“Bang, Bang, Bang!”<br/><br/>The five elements millstone collided directly with the mech. All kinds of energy crushed it.<br/><br/>“Crack, crack, crack!”<br/><br/>The Mech began to crack slowly and started to collapse.<br/><br/>Buzz<br/><br/>Wang Xian moved his body and instantly turned around to attack another mech.<br/><br/>“This is bad. We have calculated that the opponent’s defense is very strong. Our Mech can’t break through the opponent’s defense at all. Retreat, Retreat!”<br/><br/>One of the mechs calculated Wang Xian’s terrifying defense and shouted with a face full of shock and anger.<br/><br/>“Can we escape?”<br/><br/>Wang Xian’s eyes locked onto the mechas one by one. His eyes were filled with killing intent.<br/><br/>The Level 8 Mech of a universe knight was different from other creatures. If they wanted to escape, they could only rely on flying.<br/><br/>They could not return directly to their own divine kingdom.<br/><br/>Wang Xian relied on his own speed and rushed to the front of another level 8 Mech of a universe knight.<br/><br/>“Holy Dragon Shadow, break for me!”<br/><br/>A huge shadow of a divine dragon attacked the mech in front of him.<br/><br/>At the same time, Wang Xian grabbed the mech with his dragon claws, not allowing him to escape.<br/><br/>No matter how the mech attacked, he did not move at all.<br/><br/>On the contrary, the counterattack force on the Tai Chi Dragon disk caused the mech to collapse at an increasingly faster speed.<br/><br/>Crack Crack Crack<br/><br/>Boom<br/><br/>Very soon, the second level 8 Mech of a universe Knight was destroyed.<br/><br/>“Hiss, this… This Dragon King’s strength is terrifying, his speed is terrifying, and his defense is terrifying!”<br/><br/>“He’s too strong. His strength is close to a level 9 universe knight, right?”<br/><br/>At the back, the nine powerhouses of the light race and the nine-candle demon race were filled with shock when they saw the violent scene of Wang Xian.<br/><br/>Three mechs of the same level were attacking at the same time. If it were them, they would have no choice but to flee.<br/><br/>However, that Dragon King managed to destroy two of them in just a few dozen seconds.<br/><br/>Especially the speed and defensive power that he displayed, it shocked them.<br/><br/>They could not help but suspect that even if the nine of them joined forces, it would be very difficult to defeat this Dragon King!<br/><br/>“No wonder the Lich kingdom would lower their heads. This strength is too strong!”<br/><br/>They sighed in their hearts.<br/><br/>He was not afraid of the power of the curse, yet he was able to unleash such terrifying strength.<br/><br/>Such an enemy, too terrible!\t\t\t\t\t\t</div>", "images": {}, "success": true}