{"id": 348, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072597.html", "title": "Chapter 3339 - 3339 3338 Was Ready To Land", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3339 - 3339 3338 Was Ready To Land</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3339 3338 was ready to land<br/><br/>“Sky Formation, set up a formation here. Don’t let anyone enter.”<br/><br/>“Eight-limbed demonic black dragon, you guys stay here with the Sky Formation!”<br/><br/>After the nine powerhouses of the light race and the nine-candle demon race left, Wang Xian summoned an lie and the rest over and ordered them to guard this blessed land.<br/><br/>“It’s the Dragon King!”<br/><br/>The four of them replied immediately.<br/><br/>In the current Dragon Palace, other than him, the eight-limbed demonic fiend of the Heaven Formation and the only black dragon in the Dragon Palace had all broken through to the combat strength of a level eight universe knight.<br/><br/>Before the Dragon Palace was relocated, Wang Xian and the rest had to guard this place.<br/><br/>“An lie, I’ll mark a place for you. You Go There and bring me there.”<br/><br/>Following that, Wang Xian sent the location of the cursed spirit village to an lie who was at the side.<br/><br/>He wanted to go to the cursed spirit village to take a look at the situation and prevent the people from the cursed spirit village from making a comeback.<br/><br/>Wang Xian dared to kill them, but he couldn’t kill them with the eight heavens formation. If he killed them, they would still be cursed.<br/><br/>Therefore, Wang Xian planned to make a trip to the cursed spirit village. It would be best if he could exterminate all of them.<br/><br/>“Yes!”<br/><br/>An lie nodded his head and took action immediately.<br/><br/>Twenty minutes later, an lie returned and brought him to the front of the cursed spirit village.<br/><br/>Whoosh<br/><br/>Wang Xian moved and instantly arrived in front of the cursed spirit village. His dragon eyes scanned the area.<br/><br/>“Did they all run away?”<br/><br/>He raised his eyebrows. The cursed spirit village was rather quiet. There were mountains and rivers around it. It was like a paradise.<br/><br/>“HMPH!”<br/><br/>Wang Xian snorted softly. He waved his arm and a gray energy swept across the entire mountain village.<br/><br/>Buzz! Buzz! Buzz<br/><br/>When the energy passed, there was complete silence. All the buildings collapsed and the entire cursed spirit village was in ruins.<br/><br/>“Dragon King, Damn Dragon King!”<br/><br/>At the same time, far away from the cursed spirit village, the cursed spirit village people were flying above the edge of the heaven opening primal continent under the guidance of mechas.<br/><br/>At this time, the leader of the elders suddenly stopped. He saw that the cursed spirit village was destroyed under the detection of the technology. He saw that the scene was pitch black, and his face revealed an angry expression.<br/><br/>“Dragon King!”<br/><br/>Around them, thousands of cursed spirit village’s clansmen were breathing rapidly, and their eyes were blood red.<br/><br/>“WHOOSH WHOOSH WHOOSH!”<br/><br/>At this moment, battleships flew over from the front.<br/><br/>This search battleship was like a ghost, quickly arriving in front of the cursed spirit village’s group.<br/><br/>In the middle, a battleship that was ten thousand meters wide stopped in the air, and a robot walked out from it.<br/><br/>This robot had the face of a middle-aged man. He was smiling as he stared at the cursed spirit village.<br/><br/>“Clan leader, have you thought about it? Join Our Steel Union. We won’t treat you unfairly!”<br/><br/>The middle-aged robot asked the cursed spirit village’s clan leader calmly.<br/><br/>“Joining the steel union is fine, but we want that blessed land.”<br/><br/>When the cursed spirit village’s clan leader heard his words, his expression changed drastically. After more than ten seconds, he gritted his teeth and replied.<br/><br/>Their curse spirit village was very special. Without these mechs, they would not even dare to move around in the heaven opening primal continent.<br/><br/>Once they encountered a natural disaster, all of them would have to die.<br/><br/>They could only find a safe place to bring them.<br/><br/>Joining the steel union was beneficial to them, but at the same time, they also needed to pay a lot of things.<br/><br/>At the critical moment, it was their lives.<br/><br/>Because, what they were most useful for was their lives.<br/><br/>The iron and Steel Union also wanted to recruit them because of this point.<br/><br/>Last time, they didn’t succeed, but this time, their cursed spirit village had already reached a desperate situation.<br/><br/>“Yes, but not now!”<br/><br/>The middle-aged robot wasn’t too surprised by their conditions and directly agreed.<br/><br/>“Then how long do we have to wait?”<br/><br/>The chief of Cursed Spirit Village said with an embarrassed expression.<br/><br/>“Not long, don’t worry!”<br/><br/>The middle-aged automaton said, his eyes shining.<br/><br/>“Only if you help us to occupy that blessed land will we be willing to work for you.”<br/><br/>The chief of Cursed Spirit Village said with a gloomy face.<br/><br/>“Okay!”<br/><br/>The middle-aged automaton nodded with a smile and extended his hand to make an inviting gesture. “Welcome to the Steel Union!”<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>The people of Curse Spirit Village moved and flew inside.<br/><br/>Curse Spirit Village joining the iron and steel union was of great strategic significance to the iron and steel union.<br/><br/>It was like having a member of curse spirit village on a warship, and then the warship would attack a powerful enemy.<br/><br/>Once the enemy destroyed the warship, what awaited him would be the power of the curse.<br/><br/>With the addition of the curse spirit village, the steel union would be able to improve tremendously.<br/><br/>The people from the curse spirit village entered and the battleship flew into the distance.<br/><br/>Time passed day by day. After Wang Xian left the curse spirit village, he returned directly to the Dragon Palace.<br/><br/>It had been quite some time since Wang Xian left the Dragon Palace. Currently, the improvement in the Dragon Palace was basically over.<br/><br/>Currently, the total number of universe knights in the Dragon Palace had reached 100,000.<br/><br/>During this period of time, the number of disciples in the Dragon Palace had reached 1.8 million.<br/><br/>The weakest among these 1.8 million had the combat strength of a void God emperor at level seven.<br/><br/>This was especially so for the old members of the Dragon Palace. The weakest among them had already reached the combat strength of a void God emperor at level nine.<br/><br/>However, ao he and the rest still needed some time to improve. It would take them at least a year.<br/><br/>Wang Xian would be bringing them along in the Dragon Palace for the rest of the time.<br/><br/>At that blessed land, the heaven array eight qi and the rest were guarding it. No creatures dared to approach it.<br/><br/>The surrounding Lu Xing Kong was also in a state of peace. Wang Xian and a group of girls were strolling around the various planets in the surrounding Lu Xing Kong to have some fun.<br/><br/>Boom! Boom<br/><br/>A year passed very quickly. On this day, a terrifying aura came from the Dragon Palace.<br/><br/>“Hahaha, I, ao crab, have finally made a breakthrough. I have finally made a breakthrough!”<br/><br/>Following that, an excited voice was heard. When the leaders of the Dragon Palace heard the voice, they immediately flew over.<br/><br/>“Ao crab, you guys have finally made a breakthrough!”<br/><br/>Prime Minister Gui flew over and swept his gaze across ao crab and the rest.<br/><br/>The dragon palaces of the wind and Thunder Godly Dragon Clan and the Red Gold War Dragon Clan allowed ao crab and the other three devouring dragons to completely devour them.<br/><br/>Now, the four of them had the combat strength of universe knights at Level 9.<br/><br/>With such combat strength, they were almost invincible even on the edge of the heaven opening primal continent.<br/><br/>“Congratulations!”<br/><br/>The leaders of the dragon palaces congratulated them with smiles on their faces.<br/><br/>“Hahaha, from now on, leave the matters of our brothers’breakthroughs to us, the devouring Dragon!”<br/><br/>Ao he said loudly with a face full of joy.<br/><br/>Currently, the bloodline of the devouring dragon was the strongest in the Dragon Palace. The four universe knights had level nine combat strength and were invincible.<br/><br/>They were even stronger than the Dragon King!<br/><br/>Buzz<br/><br/>At the same time, Wang Xian, who had received the message, returned to the Dragon Palace. Sensing the strength of Ao he and the rest, he smiled.<br/><br/>“Greetings, Dragon King!”<br/><br/>Ao he and the rest bowed respectfully when they saw Wang Xian.<br/><br/>“Not bad, not bad. We are just waiting for you guys to break through. We can prepare to land now!”<br/><br/>Wang Xian said with a smile.\t\t\t\t\t\t</div>", "images": {}, "success": true}