{"id": 344, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072589.html", "title": "Chapter 3335 - 3335 Does 3334 Have The Guts To Kill Us?", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3335 - 3335 Does 3334 Have The Guts To Kill Us?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3335 Does 3334 have the guts to kill us?<br/><br/>“However, although the dragon palace can give birth to a cursed dragon and if the cursed dragon destroys the cursed person, he will not be cursed. However, the other party still has that powerful mech. This is still a problem!”<br/><br/>“The best way is to be able to resist this strange curse.”<br/><br/>Wang Xian mumbled.<br/><br/>Although the heart of Light and darkness could expel the curse from his body, it still required a process.<br/><br/>If he were to enter the pool of curses directly, the curse would erupt instantly. Even if he didn’t die, he would be severely injured.<br/><br/>If he were to kill a few hundred people who were cursed, it would be very troublesome.<br/><br/>“Let’s continue to test it out!”<br/><br/>As Wang Xian spoke, his body moved and returned to the front of the pool of curses once again.<br/><br/>Following the same method, he condensed another cursed soul-returning fruit. He looked at the fruit and sized it up.<br/><br/>“Should I let the clones on the Tai Chi Dragon Plate Try?”<br/><br/>Wang Xian’s mind was full of thoughts.<br/><br/>The Tai Chi Dragon Plate was now under the control of his two clones of darkness and light. What would happen if the clones of darkness were to devour the fruit?<br/><br/>“I can give it a try. If it doesn’t work, the heart of Light and darkness can expel it.”<br/><br/>Wang Xian pondered for a moment.<br/><br/>The Tai Chi Dragon Plate was created by his two clones of Light and darkness. Now, the clones had turned into souls and no longer had a physical body.<br/><br/>In the absence of a physical body, after being cursed, perhaps the circulation of energy would not be blocked, nor would it reduce the strength of the doppelganger.<br/><br/>Moreover, he had the heart of light and dark to suppress the circulation, so it should not be too much of a problem.<br/><br/>As long as he could succeed, then he had the confidence to resist the power of the curse.<br/><br/>After thinking about it, he began to experiment. He summoned the Tai Chi Dragon Disc.<br/><br/>The tai chi dragon disc could absorb the light and darkness treasures to improve itself. Naturally, it could also absorb the sphere.<br/><br/>Buzz<br/><br/>After absorbing it, the Tai Chi Dragon Disc didn’t change much.<br/><br/>“Did I succeed?”<br/><br/>Wang Xian raised his eyebrows and moved his body. The tai chi dragon disc completely enveloped him.<br/><br/>He moved his body and extended his hand into the pool of curses in front of him.<br/><br/>Buzz<br/><br/>The power of the curse on his clothes came over and the tai chi dragon plate rotated. Not only did the power of the curse not enter Wang Xian’s body, but it was also absorbed by the Tai Chi Dragon Plate.<br/><br/>A look of joy appeared in his eyes. He moved his body and entered the pool of curses directly.<br/><br/>“I’ve succeeded!”<br/><br/>His body was inside the pool of curses. Under the protection of the Tai Chi Dragon Plate, he wasn’t attacked at all.<br/><br/>Furthermore, under Wang Xian’s senses, the tai chi dragon plate must have undergone a special change. This change wasn’t noticed for the time being.<br/><br/>“Now I can touch those who are cursed!”<br/><br/>Wang Xian’s eyes revealed a cold expression.<br/><br/>Those guys attacked him without restraint. Now, he could kill all of them.<br/><br/>Wang Xian moved his body and immediately flew towards the blessed land.<br/><br/>After flying for two days, Wang Xian arrived at the front of the blessed land once again.<br/><br/>“Roar Roar Roar!”<br/><br/>“Woo Woo Woo!”<br/><br/>Just as he stepped into the vibrant and beautiful seabed, the desolate beasts in front of him suddenly fled outside.<br/><br/>When Wang Xian saw the desolate beasts fleeing in all directions, he frowned slightly.<br/><br/>“Have they started to chase away the desolate beasts here?”<br/><br/>Wang Xian’s eyes flickered.<br/><br/>“Roar Roar!”<br/><br/>At this moment, a ferocious-looking aquatic creature was fleeing in his direction. When it saw Wang Xian in front of it, it let out a wild roar.<br/><br/>Wang Xian swept his gaze over.<br/><br/>In this area, the strength of the desolate beasts was not weak. The strength of the desolate beast in front of him had reached the combat strength of a Level 6 universe knight.<br/><br/>This strength was not weak at all.<br/><br/>With a thought, he stood there without moving. The tai chi dragon disc was floating around him.<br/><br/>“Pu!”<br/><br/>The ferocious desolate beast had long claws and clawed at Wang Xian.<br/><br/>However, when the claws landed on the Tai Chi Dragon Disc, it did not move at all.<br/><br/>“Buzz!”<br/><br/>At this moment, Wang Xian sensed a rebounding force from the Tai Chi Dragon Disc.<br/><br/>This rebounding force was twice as strong as the attack of this desolate beast.<br/><br/>“PFFT!”<br/><br/>The expression of the desolate beast changed drastically. A black mark appeared on its body as it fled into the distance in fear.<br/><br/>Wang Xian waved his arm and killed it.<br/><br/>“There’s actually an additional ability to rebound the opponent’s attack? Is this the reason for the curse force?”<br/><br/>Wang Xian looked at the Tai Chi Dragon Plate with a face full of surprise and delight.<br/><br/>This was rather powerful!<br/><br/>The attack of the desolate beast from earlier had returned to its body at least twice.<br/><br/>“Let’s go and take a look!”<br/><br/>Wang Xian moved his body and arrived at the location where the grotto-heaven blessed land was teleported to. He disappeared instantly through the teleportation formation.<br/><br/>Buzz<br/><br/>When he reappeared, he had already arrived at the location in front of the grotto-heaven blessed land basin.<br/><br/>He scanned his surroundings and immediately looked ahead.<br/><br/>“There’s someone. It’s not that mech!”<br/><br/>Wang Xian looked to his right and immediately concealed himself. He then approached the area carefully.<br/><br/>“Curse Spirit Village, are you looking for death? You killed the powerhouses of the nine-candle demon race and even destroyed the teleportation formation that led us to curse spirit village. Do you really think that we can’t do anything to You?”<br/><br/>A voice entered Wang Xian’s ears. He looked over and his eyes were shining.<br/><br/>In front of them were the experts of the nine-candle demon race and the light race.<br/><br/>There were only nine experts, but all of them were universe knights and level eight experts.<br/><br/>In front of them were a group of people who were cursed.<br/><br/>Among them was a very familiar figure of Wang Xian, the old woman from Curse Spirit Village.<br/><br/>Wang Xian had seen this old woman when he had just teleported over.<br/><br/>Just like the last time he saw her, her face was filled with indifference and disdain.<br/><br/>It was an expression that showed that she didn’t put any powerhouses in her eyes.<br/><br/>They, the group of cursed people, indeed had the qualifications to do so.<br/><br/>“Hehe, just kill us then. Why? Do You Want Revenge? Do You Dare?”<br/><br/>The one who spoke was the old woman. She coldly stared at the experts of the light clan and the nine-candle demon clan.<br/><br/>“Cursed spirit village, we found this blessed land. If you occupy this place, think about the consequences. Do you really think we can’t do anything to you cursed people?”<br/><br/>An expert of the light clan stared at them with a face full of killing intent.<br/><br/>“This grotto-heaven blessed land will be our cursed spirit existence’s territory in the future. If you dare to come in, you can give it a try!”<br/><br/>An old man of cursed spirit existence said with an ice-cold face.<br/><br/>“Are you relying on the Steel Union?”<br/><br/>The expert at the center of the nine-candle monster race asked with a dark face.<br/><br/>“We, cursed spirit existence, don’t rely on anyone. We are only cooperating with them.”<br/><br/>The old woman said indifferently as her gaze swept past the nine of them. “Get out of our curse spirit existence’s territory immediately. Otherwise, don’t blame us for being impolite in the future.”<br/><br/>“You…”<br/><br/>The expression of the nine-candle demon race’s expert changed as he was filled with fury.<br/><br/>“What do you mean you have the guts to kill us? Otherwise, get out. This grotto-heaven blessed land belongs to our curse Spirit Village!”<br/><br/>An old man said mockingly.\t\t\t\t\t\t</div>", "images": {}, "success": true}