{"id": 340, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072581.html", "title": "Chapter 3331 - 3331 3330 Came From The Cursed Person’S Sneak Attack", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3331 - 3331 3330 Came From The Cursed Person’S Sneak Attack</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3331 3330 came from the cursed person’s sneak attack<br/><br/>“Stay here for me!”<br/><br/>When Wang Xian saw that the 100-odd desolate beasts were trying to escape, his eyes turned cold.<br/><br/>He moved his body and the incipient saint wings appeared behind him. With a terrifying speed, he attacked them.<br/><br/>“Pu, Pu, Pu!”<br/><br/>He waved his hand and a grayish destructive force covered them completely.<br/><br/>The powerful destructive force instantly made their life force disappear.<br/><br/>Wang Xian waved his arm and kept more than 100 desolate beast corpses into his bag.<br/><br/>At the side, the five level 8 universe knights of the light race, the nine-candle demon race, had the same strength. They attacked the desolate beasts one by one.<br/><br/>“Ji Ji Ji Ji!”<br/><br/>An ear-piercing sound reverberated throughout the entire grotto-heaven blessed land. The desolate beasts let out hurried sounds. It was obvious that they were asking for help.<br/><br/>“Hualala!”<br/><br/>At this moment, a ray of light came from the center of the grotto-heaven and blessed land. The light enveloped the escaping desolate beasts, causing their speed to increase by ten times.<br/><br/>When all the powerhouses of the light race’s nine-candle demon race saw this scene, their expressions changed slightly.<br/><br/>“Be careful!”<br/><br/>They shouted loudly.<br/><br/>Wang Xian’s gaze focused. He saw many desolate beasts that were three to four meters in size charging at them.<br/><br/>Their bodies were like crosses, but they were extremely sharp.<br/><br/>A Universe Knight Level 8 desolate beast locked onto Wang Xian and attacked him like a beam of light.<br/><br/>In front of him, there was not only one level 8 universe knight level desolate beast, but there were at least ten of them.<br/><br/>When the light race’s nine-candle demon saw this scene, his expression changed slightly.<br/><br/>“Kill One First!”<br/><br/>Wang Xian did not care about the two races. He focused his gaze and stared at the desolate beast that was attacking him. The Five Elements Millstone appeared in his hand.<br/><br/>“Crash!”<br/><br/>“Buzz!”<br/><br/>At this moment, the desolate beast was completely like a cross formed by light swords. It wanted to pierce through Wang Xian’s body in an instant.<br/><br/>However, the Tai Chi Dragon was spinning around Wang Xian’s body. When the universe knight level eight desolate beast collided with it, its body trembled.<br/><br/>Wang Xian stretched out his arm and transformed it into a dragon claw. He grabbed at its body directly.<br/><br/>The five elements grinding mill released a gray energy and covered it in an instant.<br/><br/>“PFFT!”<br/><br/>Wang Xian grabbed it. A powerful force landed on its body. The terrifying energy melted his life force.<br/><br/>“Huh?”<br/><br/>However, at this moment, Wang Xian sensed a terrifying resistance coming from his body.<br/><br/>This force was resisting the destructive force.<br/><br/>“This is? A Universe Knight Level 8 powerhouse shouldn’t have such a strong resistance. Is it because of this blessed land?”<br/><br/>Wang Xian muttered as the Dragon Claw and Dragon Force directly wiped it out.<br/><br/>However, at this moment, he saw a flash of light power on his Dragon Claw. This made him raise his eyebrows slightly.<br/><br/>“Whoosh!”<br/><br/>The next moment, he locked onto a universe knight level eight desolate beast and attacked it again.<br/><br/>“Pu!”<br/><br/>Wang Xian’s speed was extremely terrifying. He held the five elements millstone with his dragon claw and the energy gushed into it.<br/><br/>An ice sword flew out from the five elements millstone and instantly pierced through a universe knight level eight desolate beast.<br/><br/>With one strike, he directly cut off a universe knight level eight desolate beast.<br/><br/>However, what surprised Wang Xian happened again. His attacks were accompanied by a powerful destructive force.<br/><br/>At the moment when it pierced through the desolate beast, there was also energy surging into the body of the desolate beast, destroying its vitality.<br/><br/>However, the injury of the desolate beast that was cut off was not very serious. The cut off body slowly fused together.<br/><br/>“Crash!”<br/><br/>When Wang Xian saw this scene, he flapped his incipient sacred wings and instantly appeared above it. His Dragon Claw grabbed it in his hand and completely destroyed it.<br/><br/>“AH, be careful!”<br/><br/>At this moment, the light race universe Knight Level 7 expert suddenly let out a terrified cry. His body was directly penetrated by a desolate beast.<br/><br/>“Eh?”<br/><br/>But very quickly, a shocking scene happened. The wound that he was pierced through was quickly recovering.<br/><br/>“This grotto-heaven blessed land has an extremely terrifying recovery ability.”<br/><br/>A light race universe level 8 powerhouse shouted loudly.<br/><br/>This powerful recovery power was not only for the desolate beasts, but also for them.<br/><br/>When Wang Xian saw this scene, his eyes flickered slightly. His body moved and once again locked onto a universe knight level 8 desolate beast and attacked it.<br/><br/>“Ji Ji Ji Ji!”<br/><br/>When that Universe Knight Level 8 desolate beast saw Wang Xian attacking it, it let out a hurried sound.<br/><br/>Three universe knight level eight desolate beasts immediately stared at Wang Xian in the surrounding area, their eyes filled with vigilance.<br/><br/>Their bodies moved and they attacked Wang Xian together.<br/><br/>Just now, he had killed two universe knight level eight desolate beasts consecutively, which had already attracted the attention of the desolate beast experts.<br/><br/>“Hiss, that Dragon King’s strength is so strong. He has already killed two universe knight level eight desolate beasts!”<br/><br/>On the side, the light race and the nine-candle demon race experts were shocked when they saw the four desolate beasts attacking Wang Xian.<br/><br/>Just now, Wang Xian had killed two desolate beasts of the same level by himself. His strength had also shocked them.<br/><br/>“No wonder the Lich Kingdom has bowed to this dragon king. His strength is really terrifying!”<br/><br/>They thought to themselves.<br/><br/>With Wang Xian sharing a large portion of the universe knight level eight desolate beasts, it was much easier for them to deal with them.<br/><br/>Faced with the attacks of four universe knight level eight desolate beasts, Wang Xian’s expression did not change at all.<br/><br/>Four of them could be dealt with, or even killed.<br/><br/>However, as this was the grotto-heaven blessed land, the recovery of the injuries was very terrifying. It was likely that this battle would last for a very, very long time.<br/><br/>“Is the effect of this grotto-heaven blessed land really so terrifying?”<br/><br/>At the same time, at the back of Wang Xian and the rest, a group of over 400 people were walking towards them.<br/><br/>They were flying here without any scruples.<br/><br/>When the surrounding desolate beasts saw them, they immediately avoided them.<br/><br/>Among the over 400 people, half of them were covered in dark tattoos.<br/><br/>This half of them were in a surrounding formation.<br/><br/>Those who were cursed were weak, but some desolate beasts would avoid them, afraid of the power of the curse on them.<br/><br/>In the middle, there were over 200 mechas.<br/><br/>Beside the leading dark golden mech, there were two cursed elders.<br/><br/>“Of course. How can a blessed land that corresponds to the pool of curse be weak?”<br/><br/>An elder who was holding a cane said calmly.<br/><br/>“Hehe, that’s good. Then we’ll work together to take this place. However, you said that the members of the light race and the nine candles race have already entered. When the time comes, the universe level 8 powerhouses of the nine candles race will be handed over to you.”<br/><br/>The Dark Golden Mech emitted a mechanical voice.<br/><br/>“Naturally, there won’t be any problems. With your mechs, it’ll be easy for us to kill them.”<br/><br/>The cursed old man said calmly.<br/><br/>“There’s a battle ahead. Get Ready!”<br/><br/>The dark golden mecha stared ahead. Data after data entered its mind and it immediately ordered.<br/><br/>“Get Ready!”<br/><br/>The two cursed old men scanned their surroundings.<br/><br/>The group of cursed people clenched their fists. The mecha covered their bodies.\t\t\t\t\t\t</div>", "images": {}, "success": true}