{"id": 341, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072583.html", "title": "Chapter 3332 - 3332 3331 Came Under The Sneak Attack Of The Cursed Person", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3332 - 3332 3331 Came Under The Sneak Attack Of The Cursed Person</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3332 3331 came under the sneak attack of the cursed person<br/><br/>“Boom Boom Boom!”<br/><br/>“This desolate beast is really hard to kill in this grotto-heaven blessed land!”<br/><br/>In the grotto-heaven blessed land, Wang Xian attacked the four universe knight level eight desolate beasts one after another.<br/><br/>With one against four, Wang Xian was not at a disadvantage. He was even at an advantage, completely suppressing the four desolate beasts.<br/><br/>However, these desolate beasts were too difficult to kill. Wang Xian’s attacks tore their bodies apart, allowing them to recover quickly.<br/><br/>Due to the blessed land, their vitality was abnormally terrifying.<br/><br/>On the other hand, on Wang Xian’s side, as the desolate beasts could not break through his defense, the powerful recovery ability of the blessed land was of no use to him.<br/><br/>“I’m afraid it will take a very long time to kill these four desolate beasts.”<br/><br/>Wang Xian mumbled.<br/><br/>At the side, the light race and the nine-candle demon race were fighting with the desolate beasts. They were in a stalemate.<br/><br/>If they injured the desolate beasts, they could recover quickly.<br/><br/>If the desolate beasts injured them, they could recover quickly.<br/><br/>Overall, because they had an additional universe knight with level 8 combat strength, the two races were still in the upper hand.<br/><br/>“As long as I can obtain this blessed land, everything will be worth it!”<br/><br/>Wang Xian’s eyes sparkled as he continued to fight, slowly depleting the life force of the desolate beast.<br/><br/>“Eh?”<br/><br/>At this moment, he sensed someone flying towards him from behind.<br/><br/>Wang Xian took a glance and saw one mech after another flying over. Each mech was emitting a powerful aura.<br/><br/>“Are they the people summoned by the light ancestor and the nine-candle demon race?”<br/><br/>He raised his eyebrows, and his eyes were shining.<br/><br/>Buzz! Buzz! Buzz<br/><br/>However, a scene that surprised Wang Xian appeared.<br/><br/>Two mechs flew towards him and shot out beams of lasers.<br/><br/>“Sneak attack? Who are they? What are they doing?”<br/><br/>Wang Xian was stunned. He completely ignored the laser that was attacking him.<br/><br/>The laser landed on his body and was easily blocked by the Tai Chi Dragon Plate.<br/><br/>At the side, the mechs were also attacking the powerhouses of the light race and the nine-candle demon race.<br/><br/>The laser beams covered the bodies of the five level 8 universe knights of the two races.<br/><br/>“You are courting death!”<br/><br/>The sudden appearance of the sneak-attack made the great beings of the light race and the nine-candle demon race look furious.<br/><br/>Three of the Universe Knights waved their arms, and terrifying attacks covered the mechs.<br/><br/>Hong<br/><br/>In the next moment, the attacks landed on the mechs.<br/><br/>Hong! Hong! Hong<br/><br/>More than ten mechs exploded instantly and were turned into pieces.<br/><br/>“Be careful, something is courting death!”<br/><br/>The few universe knights of the light race, nine-candle demon race, and level eight great beings raised their weapons at their subordinates with cold expressions.<br/><br/>“Ah! Ah! Ah! Ah!”<br/><br/>However, at this moment, screams suddenly came out of the mouths of the three universe knights who had fought back earlier.<br/><br/>They covered their faces in horror, and black tattoos appeared out of thin air on their bodies.<br/><br/>The black tattoos entered their bodies.<br/><br/>In an instant, the three of them looked ferocious. Their flesh and blood started to fall off, and their life force was fading rapidly. Even if they were in this blessed land with powerful recovery abilities, they would not be able to recover.<br/><br/>“Ah! Ah!”<br/><br/>The terrifying and strange black tattoos entered their bodies completely, and the three universe knights, Level 8 Great Beings, fell to the bottom of the ocean.<br/><br/>“Father! Father!”<br/><br/>Beside them, an old man from the light race stared at the bodies at the bottom of the ocean and shouted in fear and sadness.<br/><br/>“Ah, my body, my body!”<br/><br/>Suddenly, he stared at his own body in fear, and on his arm, dark tattoos that were slightly illusory appeared.<br/><br/>These dark tattoos also rushed into his body.<br/><br/>“Oh no, that’s a curse. It’s a curse. In the mech that third elder and the rest killed, there were people who were cursed!”<br/><br/>At this moment, a level 8 universe knight from the nine-candle demon race saw this scene. His expression changed drastically as he shouted loudly.<br/><br/>Once a person who was cursed was killed, they would suffer the revenge of the curse.<br/><br/>This curse was extremely terrifying. Even the ruler of the universe had to be careful.<br/><br/>The person in the mech was cursed.<br/><br/>When Wang Xian heard the words of the nine-candle demon, his expression changed slightly.<br/><br/>He didn’t dare to touch such a strange thing recklessly.<br/><br/>He was about to destroy the two mechs in front of him, but he stopped immediately. His eyes flickered slightly.<br/><br/>Whoosh! Whoosh<br/><br/>However, he didn’t retaliate. The two mechs charged at him without any restraint. Beams of laser beams landed on his body.<br/><br/>Although the tai chi dragon plate could block the laser beams, the scene before his eyes still made him extremely displeased.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>At this moment, a few hundred mechs flew towards them from the back.<br/><br/>More than four hundred mechs bombarded them directly.<br/><br/>Wang Xian frowned slightly when he saw this scene.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>More than a dozen mechs attacked Wang Xian. Terrifying attacks came at him one after another.<br/><br/>One of the attacks was comparable to a level eight universe knight.<br/><br/>“A Level Eight Universe Knight Armor?”<br/><br/>Wang Xian’s expression changed slightly.<br/><br/>In the universe, the peak power of technology had not reached the level of a universe dominator.<br/><br/>However, it had also reached the peak of a universe knight.<br/><br/>Even so, there were very few technological races in the heaven opening and primal continent.<br/><br/>This also made the level eight mech of a universe knight abnormally rare.<br/><br/>However, there was actually a level eight mech of a universe knight appearing and attacking them.<br/><br/>Wang Xian moved his body and dodged the attack of the mech. His expression changed slightly but he did not retaliate.<br/><br/>This was because he was afraid that the one controlling the mech was the cursed one.<br/><br/>If the other party was killed by him, he would have to bear a huge price for it. He might even die.<br/><br/>“I’m aggrieved.”<br/><br/>Wang Xian’s figure flashed and he dodged to the side. He did not fight with the dire beast.<br/><br/>“Ji Ji Ji Ji!”<br/><br/>The dire beasts saw Wang Xian leaving and locked onto the mechas in the air, preparing to attack.<br/><br/>“Ka Ka Ka!”<br/><br/>However, at this moment, more than ten mechas flew over. One by one, the mechas were taken off, revealing the people who were cursed.<br/><br/>When the group of desolate beasts saw them, their eyes were filled with fear. They were unwilling to provoke them and let out a few low growls.<br/><br/>“Who are you people? The cursed spirit village has always been on good terms with us, the nine-candle demon race. Why are you attacking us?”<br/><br/>At the side, an expert from the nine-candle demon race asked with an embarrassed expression.<br/><br/>“On good terms? We are cooperating, but you don’t even give us ten percent. Is this considered good terms? Get out immediately. This grotto-heaven belongs to our cursed spirit village!”<br/><br/>A cold voice came from within a mecha.<br/><br/>“It really is your cursed spirit village. Where did you get so many powerful mecha?”<br/><br/>Hearing his words, the faces of the nine-candle demon clan members were extremely ugly.\t\t\t\t\t\t</div>", "images": {}, "success": true}