{"id": 345, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072591.html", "title": "Chapter 3336 - 3336 3335, Charge", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3336 - 3336 3335, Charge</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3336 3335, Charge<br/><br/>In front of the blessed land, the light race and the nine-candle demon race, eight universe knights and level nine great beings, stared at the people of Curse Spirit village with dark expressions.<br/><br/>They looked extremely embarrassed.<br/><br/>The two races had paid a huge price for this blessed land. From searching for this blessed land to barging in from the surrounding desolate beasts, they had lost hundreds of knights and used up a large amount of treasures.<br/><br/>However, now, it was occupied by the curse spirit village that they had always looked down on. This made their expressions unusually gloomy.<br/><br/>“Hehe!”<br/><br/>The people from the curse spirit village raised their heads slightly and looked at them. Their eyes were filled with ridicule and disdain.<br/><br/>They were truly fearless now.<br/><br/>With a group of mechas, as long as someone dared to compete with them, they would attack directly.<br/><br/>Once they were killed, their opponents would not be able to live either.<br/><br/>The curse that they hated in the past had now become their trump card.<br/><br/>At the back, Wang Xian saw this scene and narrowed his eyes slightly. He moved his body and did not hide anymore. He flew straight towards them.<br/><br/>“Huh?”<br/><br/>Wang Xian’s appearance attracted the attention of the experts from the light tribe. They looked over and their eyes flickered slightly.<br/><br/>“Dragon King!”<br/><br/>An expert from the nine-candle demon tribe shouted.<br/><br/>“Yes!”<br/><br/>Wang Xian nodded at them.<br/><br/>He didn’t have much dislike for the light tribe and the nine-candle demon tribe.<br/><br/>Although both parties were competitors, it could be considered a fair competition.<br/><br/>Whoever was stronger would occupy this place.<br/><br/>If the Dragon Palace was stronger, the light tribe and the nine-candle demon tribe wouldn’t fight over it anymore. Similarly, it was the same for Wang Xian’s side.<br/><br/>The other party might not have much of an opinion on who occupied the place, but they had a lot of opinions on the cursed spirit village.<br/><br/>Especially when the other party had just started to attack them with the mech, the light race and the nine-candle demon race had even lost three universe knight level eight powerhouses.<br/><br/>Wang Xian was also disgusted by them.<br/><br/>“Curse Spirit Village, just a bunch of cursed people like you are dreaming of occupying this place. You will pay the price in the future. Our three races will always have a way to exterminate you.”<br/><br/>An expert from the light race took a glance at Wang Xian and said with a gloomy face.<br/><br/>“Hahaha, let us pay the price, you dog. I don’t care if you are two or three races. If you have the guts, I will exterminate you. If you don’t dare to do so, get lost immediately. Don’t disturb us here.”<br/><br/>At the back, a middle-aged man with a curse spirit cursed loudly.<br/><br/>“Haha, that’s right. What’s the use of just standing here? All of you are top-notch experts at the edge of the heaven-splitting primordial land. If you have the guts, Come and kill us? If you don’t dare, Scram, you bunch of trash!”<br/><br/>The moment the middle-aged man finished his sentence, the young man beside him also cursed mockingly.<br/><br/>They stared at Wang Xian and the rest of the powerhouses in front of them. Their faces were filled with malevolence and excitement.<br/><br/>Cursing the powerhouses from the three major races was simply too satisfying!<br/><br/>Especially since the other party didn’t dare to attack them.<br/><br/>“Hehe!”<br/><br/>When Wang Xian heard their words, his gaze turned cold. He sneered, “Do you really think that we can’t do anything to You?”<br/><br/>“The Dragon King of the Dragon Palace, right? I know you. But we don’t care if you are the Dragon King or whatever. Don’t talk nonsense here. If you have the guts, do it, idiot!”<br/><br/>A young man stared at Wang Xian. He raised his head slightly and said disdainfully.<br/><br/>“Damn it!”<br/><br/>When the nine powerhouses of the light race and the nine-candle demon race heard their insults, they looked extremely embarrassed.<br/><br/>They were all top-notch powerhouses at the edge of the heaven-splitting chaotic land. They had never met anyone who dared to humiliate them in such a manner.<br/><br/>However, they were helpless in the face of such humiliation.<br/><br/>Buzz<br/><br/>However, just as the young man finished his sentence, Wang Xian started to move.<br/><br/>His figure moved and appeared beside the young man in an instant.<br/><br/>When the young man saw Wang Xian appearing in front of him, he was slightly stunned. A trace of cold sweat appeared on his face.<br/><br/>“Hahaha, what’s wrong? You’re so flustered. If you dare to touch me, you piece of trash!”<br/><br/>However, the next moment, the young man pointed at Wang Xian and shouted with a face full of mockery.<br/><br/>“Hehe!”<br/><br/>The people from the cursing spirit village looked at this scene coldly.<br/><br/>“Dragon King, don’t be Rash!”<br/><br/>At the back, the expressions of the experts from the nine-candle demon race changed slightly. They immediately reminded him.<br/><br/>“Bang!”<br/><br/>Wang Xian looked at the young man who was staring at him with a face full of disdain and mockery. He smiled and stretched out his arm to grab his neck.<br/><br/>“You… If you have the guts, just… kill me…”<br/><br/>The Young Man’s face turned red instantly as he glared at him with hatred.<br/><br/>“Dragon King, I advise you not to offend us, the cursed spirit village. We are not afraid of you. If you don’t wish to have endless trouble in the future, you’d better scram immediately!”<br/><br/>The old woman at the side stared at Wang Xian and said coldly.<br/><br/>Even though Wang Xian was close to them, they weren’t afraid at all.<br/><br/>“Oh?”<br/><br/>Wang Xian smiled.<br/><br/>“Ah Ah Ah Ah Ah!”<br/><br/>At this moment, the young man who was grabbing Wang Xian’s neck let out a miserable scream.<br/><br/>Layers of flames emerged on his body. The flames burned his body bit by bit.<br/><br/>The dark tattoos emitted a strange light as they surged toward Wang Xian.<br/><br/>“What!”<br/><br/>At the back, the expressions of the nine-candle demons and the light tribe experts changed slightly when they saw Wang Xian attacking the people from the curse spirit village.<br/><br/>This… was this mutual destruction?<br/><br/>Buzz<br/><br/>However, when the curses spread to Wang Xian’s body, the Tai Chi Dragon Disc started to spin around his body.<br/><br/>The power of the curses surged towards the tai chi dragon disc and was instead absorbed bit by bit.<br/><br/>“Ahhhhh!”<br/><br/>The miserable shrieks continued to come out from the young man’s mouth. The Flames released by Wang Xian were burning his body bit by bit.<br/><br/>A Guy who was only at the first level of celestial thearch dared to curse at him? He dared to be so arrogant in front of him.<br/><br/>Relying on the curse?<br/><br/>“What!”<br/><br/>At this moment, the people from the curse spirit village saw Wang Xian torturing their clansmen with the flames bit by bit. When they saw that Wang Xian was not attacked by the curse, their expressions changed drastically.<br/><br/>“Eh? Why isn’t the Dragon King affected by the power of the curse?”<br/><br/>The pupils of the powerhouses of the light race’s nine-candle demon race shrunk slightly when they saw this scene.<br/><br/>Torturing a person who was cursed like this would definitely cause him to be attacked by the power of the curse.<br/><br/>However, the Dragon King seemed to be fine at this moment!<br/><br/>“Come on, continue to curse!”<br/><br/>Wang Xian looked at the young man in front of him and said with a face full of mockery.<br/><br/>Crash<br/><br/>As he spoke, chains spread around and surrounded the hundreds of people from the cursing spirit village.<br/><br/>“Today, I will kill all of you bit by bit. I want to see if the power of the curse will be useful to me. I also want to see if all of you will still be as arrogant and arrogant as before!”<br/><br/>Wang Xian said faintly and revealed a smile on his face.<br/><br/>The Flames also spread to the other powerhouses of the curse spirit village.\t\t\t\t\t\t</div>", "images": {}, "success": true}