{"id": 343, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072587.html", "title": "Chapter 3334 - 3334 3333 Cursed Dragon? Down", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3334 - 3334 3333 Cursed Dragon? Down</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3334 3333 cursed dragon? down<br/><br/>Buzz, Buzz, Buzz<br/><br/>When the soul-returning wood entered the strange pool of curses, waves of curses surged into the soul-returning wood. The power of the curses wanted to completely destroy the soul-returning wood!<br/><br/>Wang Xian stared at the branches of the soul-returning wood, his eyes shining.<br/><br/>Buzz, Buzz, Buzz<br/><br/>The soul-returning wood was attacked, and it emitted a gray energy.<br/><br/>The soul-returning wood was a treasure of the master level of the universe. It was extremely powerful. Furthermore, it had the backing of the Heaven’s origin creator level, the ancestral tree.<br/><br/>This cursed pool was indeed strange. Even if the Master of the universe entered it, he might die.<br/><br/>The soul-returning wood that had just stepped into the edge was wrapped in a gray energy. Facing the invasion of the curse, it was not damaged at all.<br/><br/>Wang Xian raised his eyebrows slightly and watched quietly.<br/><br/>Time passed little by little. The soul-returning wood was not harmed in the slightest, but there were no changes.<br/><br/>This made Wang Xian frown slightly. He hesitated for a moment and extended half of his arm into the pool of curse.<br/><br/>After his arm entered the pool, the power of the curse immediately surged into Wang Xian’s body.<br/><br/>With a thought, he activated the heart of Light and darkness in his body. The power of darkness blocked his arm to prevent the curse from entering his body.<br/><br/>“It’s effective!”<br/><br/>When the power of the heart of Light and darkness blocked his arm, the strange power of the curse was blocked.<br/><br/>Although it was blocked, Wang Xian’s arm was quickly invaded by the strange curse.<br/><br/>He saw black tattoos appearing on his arm.<br/><br/>These dark tattoos covered his arm and looked exactly the same as the arms of the cursed person.<br/><br/>Wang Xian sensed his arm. His arm was invaded by the curse and he could move it. However, he felt that his energy was blocked and his attack power was greatly reduced.<br/><br/>He extended his arm and his entire arm was completely covered by this strange dark tattoo. It was as if he had become one with his arm.<br/><br/>After retreating out of the range of the pool of curse, Wang Xian looked at his arm and his mind moved.<br/><br/>The power of the heart of Light and darkness was directed towards this strange dark tattoo.<br/><br/>Buzz<br/><br/>However, this expulsion did not dissipate directly. Instead, it was directed towards his palm.<br/><br/>The dark tattoo on his palm was directed towards the soul-returning wood on his arm.<br/><br/>The power of the soul-returning wood was very strong. It stopped when it reached the tip of the soul-returning wood.<br/><br/>Therefore, the dark tattoos could only gather together and eventually form a ball.<br/><br/>The ball was inserted into the soul-returning wood.<br/><br/>Wang Xian was stunned when he saw this scene. At this moment, he felt that a strange power within the ball had been worn away. It was as if it had become one with the soul-returning wood.<br/><br/>No, it was exactly the same as the soul-returning fruit. However, this fruit was very special. It didn’t have a soul.<br/><br/>Wang Xian looked at this strange fruit. His eyes sparkled.<br/><br/>“What if the members of the Dragon Palace were to devour it?”<br/><br/>Wang Xian’s eyes sparkled. He thought of the millions of people who had entered the pool of curse not long ago. In the end, dozens of them had survived.<br/><br/>Would it be possible to devour them and turn them into cursed creatures?<br/><br/>Wang Xian had a thought and immediately informed an lie. He drew an altar and asked him to bring a member of the Dragon Palace over.<br/><br/>“Dragon King!”<br/><br/>Soon, a member who had just joined the Dragon Palace was brought over by an lie.<br/><br/>“Swallow This!”<br/><br/>Wang Xian looked at him and instructed.<br/><br/>The new member who had just joined the Dragon Palace had already evolved into a berserk dragon.<br/><br/>“It’s the Dragon King!”<br/><br/>The member nodded and immediately took it and swallowed it.<br/><br/>Buzz<br/><br/>After he swallowed the dark sphere, his body immediately underwent a transformation.<br/><br/>The dark tattoo slowly appeared on his body and spread rapidly throughout his entire body.<br/><br/>He looked down and couldn’t feel any pain. However, he frowned slightly.<br/><br/>“Dragon King, I feel that my strength is decreasing rapidly. My control over my attributes is decreasing!”<br/><br/>Soon, his expression changed slightly and he said immediately.<br/><br/>“It’s Alright!”<br/><br/>Wang Xian shook his head. A few minutes later, this member of the Dragon Palace in front of him had completely turned into a cursed existence.<br/><br/>“How do you feel?”<br/><br/>Wang Xian asked him.<br/><br/>“Dragon King, my strength has decreased. In the past, I could fight across three levels. Now, I can only fight across one level. In addition, I feel that there is a strange energy contained in my body!”<br/><br/>He widened his eyes and said to Wang Xian.<br/><br/>“Very good. I will bring you to test it out!”<br/><br/>Wang Xian’s eyes were sparkling. His body moved and brought him out.<br/><br/>A day later, he flew out of this dead land and found a level five universe knight desolate beast.<br/><br/>The Dragon Palace member who had evolved into a cursed one was only at level one universe knight.<br/><br/>As he could only fight one level higher now, he was similar to some mid-level races in the universe.<br/><br/>“Go, attack this desolate beast and let him kill you. Then, I will revive you!”<br/><br/>Wang Xian immediately instructed him.<br/><br/>“It’s the Dragon King!”<br/><br/>The member of the Dragon Palace did not hesitate and attacked the desolate beast directly.<br/><br/>“Boom!”<br/><br/>He did not hesitate and launched an attack directly.<br/><br/>When the desolate beast saw that someone was attacking him, its eyes were filled with fury and wind blades were circling around its body.<br/><br/>However, when it saw the face of the member of the Dragon Palace, it revealed a fearful expression. It immediately retracted its hand and did not dare to attack.<br/><br/>However, this member of the Dragon Palace moved in a flash and appeared around this desolate beast. The wind blades around him instantly killed it.<br/><br/>“Roar Roar Roar!”<br/><br/>When the desolate beast saw this scene, it was obvious that it was shocked and extremely terrified.<br/><br/>“Roar Roar Roar!”<br/><br/>In less than a minute, it let out a blood-curdling scream. It was filled with fear and despair. Its body was bound by a curse as it slowly died.<br/><br/>Wang Xian flew over and took out the soul-returning wood when he saw the desolate beast die.<br/><br/>The soul of the Dragon Palace member flew over and slowly began to condense into the soul-returning fruit.<br/><br/>In the past, the soul-returning fruit that was condensed was all gray.<br/><br/>But now, the soul-returning fruit was a little black.<br/><br/>“What a powerful curse. Even if he were to resurrect after his death, he wouldn’t be able to get rid of the curse. No wonder this curse could curse people with similar bloodlines out of thin air.”<br/><br/>Wang Xian mumbled as his eyes sparkled.<br/><br/>After this member of the Dragon Palace was resurrected, it could be said that he was a new dragon.<br/><br/>“Let’s call him the cursed Dragon!”<br/><br/>He mumbled.<br/><br/>Although this cursed dragon could only fight a level higher, this degree of strangeness made even Wang Xian feel disgusted.<br/><br/>When the ruler of the universe saw this cursed creature, he avoided it and didn’t want to get involved with this disgusting thing.<br/><br/>If the Dragon Palace had a cursed dragon seed, it would be terrifying.<br/><br/>If they killed it, they would be finished.<br/><br/>Most importantly, a universe Knight Level 1 cursed Dragon could replace a pinnacle universe knight.<br/><br/>This was a huge win.\t\t\t\t\t\t</div>", "images": {}, "success": true}