{"id": 342, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072585.html", "title": "Chapter 3333 - 3333 3332 Cursed Dragon? Go", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3333 - 3333 3332 Cursed Dragon? Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3333 3332 cursed dragon? Go<br/><br/>“You don’t need to know, kill them!”<br/><br/>The people from the cursed spirit village didn’t care about the nine candle demon race, one of the mechas roared and attacked them.<br/><br/>Among the 400 mechas, there were 4 universe knights at Level 8.<br/><br/>This power, if placed at the edge of the Open Heaven Primal Continent, was a very powerful and terrifying existence.<br/><br/>The other group of mechas also attacked the light tribe and the nine-candle demon tribe.<br/><br/>“Die!”<br/><br/>In front of Wang Xian, the level eight mech of a universe Knight attacked him again.<br/><br/>“This weird thing.”<br/><br/>Wang Xian couldn’t help but curse. He was confident that he could kill this mech instantly.<br/><br/>However, there might be people who were cursed inside. He didn’t dare to kill them.<br/><br/>This made him a little angry and aggrieved.<br/><br/>“Not good, Retreat.”<br/><br/>The light race and the nine-candle race were even more passive when faced with the attack of the mechs from the cursed spirit village.<br/><br/>As long as they fought back and killed them, they would be attacked by the curse.<br/><br/>However, if they didn’t fight back, the mechs were also very terrifying. Even a level 8 universe knight could kill them.<br/><br/>Under such circumstances, the light race and the nine-candle demon race had no way of fighting.<br/><br/>They could only run away!<br/><br/>Especially now, three out of the five universe knights at level 8 had been killed. To their race, the losses were already terrible.<br/><br/>The Universe Knights of the two races resisted with all their might. The rest of the members immediately disappeared and returned to their God countries.<br/><br/>Fortunately, they were in the blessed land. Their recovery abilities were very strong, and this blessed land had no effect on the mech.<br/><br/>“Let’s Go!”<br/><br/>The last two level 8 universe knights saw their subordinates leave and disappeared in an instant.<br/><br/>“Who is this guy? Why does he have the strength of A Level 8 universe knight? They are not on the same side as the light race and the nine-candle demon race.”<br/><br/>“I don’t know. Kill him!”<br/><br/>Immediately, more than a hundred mechs attacked Wang Xian.<br/><br/>Wang Xian frowned slightly. He flapped his incipient saint wings and flew to the side in an instant.<br/><br/>With his speed, the mechs could not catch up to him at all.<br/><br/>“These guys are really disgusting. The cursed people used technology to burst out with powerful strength. Moreover, there are death warriors among them. It’s a little troublesome.”<br/><br/>Wang Xian shook off the group of mechas. His expression changed unsightly.<br/><br/>He had already witnessed how powerful the curse was. Three universe knights at level eight could not resist it at all.<br/><br/>On the other hand, they were merely a dozen people who had cursed. In fact, they had even implicated their descendants.<br/><br/>It was strange and terrifying!<br/><br/>Moreover, they were indeed compatible with the technology. Creating a death warrior was simply exchanging the weak for the strong.<br/><br/>This was a huge profit for many races.<br/><br/>“Let’s go take a look around!”<br/><br/>Wang Xian was unwilling to give up on this blessed land. He moved his body and flew around the blessed land.<br/><br/>The entire grotto-heaven blessed land was not very big. However, at this moment, the cursed people were flying unscrupulously inside.<br/><br/>None of the desolate beasts dared to attack them.<br/><br/>They seemed to be investigating the situation and were preparing to occupy the place.<br/><br/>“These cursed people are so weak. How did they get such powerful mechas? Which faction is behind them?”<br/><br/>Wang Xian’s eyes flickered as he thought of the most powerful faction at the edge of the heaven-cleaving desolation continent.<br/><br/>The Steel Union.<br/><br/>If the Lich Kingdom was ranked in the top three, it would definitely not be number one because the steel union was number one.<br/><br/>This was a technological faction, and it was also the strongest technological faction in the heaven-cleaving desolation continent.<br/><br/>In the entire universe, the technological faction of the Steel Union could be ranked in the top three.<br/><br/>One could imagine their strength.<br/><br/>The people of the cursed spirit village might have obtained the mech from the Steel Union.<br/><br/>Of course, it could also be from other technological races.<br/><br/>“Now, if I want to compete for this blessed land, I have to grasp a method. That is to resist the power of the curse.”<br/><br/>Wang Xian pondered in his heart.<br/><br/>The power of this curse was very strong. It involved the special power of karma and bloodline.<br/><br/>Wang Xian’s body moved and he immediately flew towards the back.<br/><br/>He wanted to go to the cursed pool to take a look.<br/><br/>Wang Xian was very fast. Two days later, he arrived at the pitch-black and silent sea area. When he flew to the center, a strange energy charged over.<br/><br/>At this moment, there was no one around the cursed pool.<br/><br/>This place was not a treasured land to begin with. It was too late to hide and no one came over.<br/><br/>Wang Xian approached the strange basin. The closer he got, the more he felt a strange energy eroding towards him.<br/><br/>This strange energy wanted to fuse into Wang Xian’s body.<br/><br/>“The origin of this energy is still darkness. It’s just a variation of darkness.”<br/><br/>Wang Xian resisted this power and walked to the edge of the basin.<br/><br/>Standing here was the limit of his physical body’s resistance.<br/><br/>Once he entered the basin, he would probably be subjected to a terrifying attack.<br/><br/>“The heart of light and darkness that I possess can resist such a curse? The ancestral tree can resist such a curse?”<br/><br/>The heart of Light and darkness and the ancestral tree were Wang Xian’s trump cards against this strange curse.<br/><br/>The darkness of the heart of Light and darkness was the darkness of the origin. He could give it a try.<br/><br/>He was deep in thought. With a movement of his body, the Taiji dragon disc slowly appeared around him. The dark part of the Taiji Dragon Disc slowly transformed into a dragon of darkness and flew into the basin.<br/><br/>Buzz<br/><br/>The moment the black dragon entered, it was struck by a terrifying attack.<br/><br/>Waves of strange darkness energy surged into the black dragon’s body.<br/><br/>At this moment, Wang Xian could feel that the tai chi dragon disk seemed to be collapsing.<br/><br/>“Roar!”<br/><br/>At the side, the Divine Light Dragon roared and flew to the side of the black dragon. It activated its tai chi and immediately fled towards Wang Xian.<br/><br/>It couldn’t withstand it!<br/><br/>The tai chi dragon disk couldn’t withstand this strange attack.<br/><br/>If it stayed for a few more seconds, it would be damaged.<br/><br/>“The tai chi dragon plate can withstand an attack from a level nine universe knight.”<br/><br/>Wang Xian could not help but exclaim in his heart. His expression changed slightly.<br/><br/>“This strange power of darkness seems to have a soul.”<br/><br/>He mumbled and hesitated for a moment. With a move of his palm, a grey branch appeared in his hand.<br/><br/>Soul-returning Wood!<br/><br/>The soul-returning wood could absorb souls. Of course, this soul-absorbing wood could only absorb the souls of the members of the Dragon Palace.<br/><br/>What if he placed the soul-returning wood into something that was invaded by the power of Darkness?<br/><br/>Would the soul-returning Wood’s branches be destroyed?<br/><br/>Wang Xian felt that the possibility was very small. After all, the soul-returning Wood’s mother was the ancestral tree. He didn’t think that a pool of curses could contend against the ultimate treasure of the Heaven’s origin.<br/><br/>“I wonder what will happen!”<br/><br/>He mumbled and placed the soul-returning wood into the pool of curses!\t\t\t\t\t\t</div>", "images": {}, "success": true}