{"id": 349, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072599.html", "title": "Chapter 3340 - 3340 3339 Cards Of The Dragon Palace", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3340 - 3340 3339 Cards Of The Dragon Palace</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3340 3339 cards of the Dragon Palace<br/><br/>The Dragon Palace had been preparing for the war of disembarkation for more than a year.<br/><br/>Everything was waiting for Ao he’s breakthrough.<br/><br/>Today, with Ao he’s breakthrough, the Dragon Palace could directly carry out the war of disembarkation.<br/><br/>However, the War of disembarkation of the dragon palace this time might be different from the war of disembarkation of other races.<br/><br/>“Prime Minister Gui, announce that our dragon palace will be disembarkating in five days. We will not challenge any races. We have our own Paradise!”<br/><br/>In the Dragon King Palace, Wang Xian’s gaze swept across the leaders of the Dragon Palace. They were all pure-bred godly dragons, and he gave the order with a smile on his face.<br/><br/>Currently, there were four universe knights with level 9 combat strength in the Dragon Palace, five universe knights with level 8 combat strength, and 30 universe knights with Level 7 combat strength.<br/><br/>The leaders of the Dragon Palace, the Golden Dragon, the water god Dragon, the Fire God Dragon, the Thunder Dragon, the wind god Dragon, and the Little Blue House all had the combat strength of a universe knight with Level 7 combat strength.<br/><br/>Now, the Dragon Palace was powerful enough.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui replied immediately.<br/><br/>In less than 10 minutes, the news of the Dragon Palace landing spread throughout the entire surrounding starry sky and the Heaven Opening Primal Continent.<br/><br/>Everyone had witnessed how powerful the Dragon Palace was.<br/><br/>Every move of the Dragon Palace could cause a huge shock in the surrounding starry sky.<br/><br/>Not to mention the landing battle this time.<br/><br/>However, the announcement made by the Dragon Palace not only shocked the surrounding starry sky, but also the forces at the edge of the heaven-opening primeval continent.<br/><br/>The landing battle usually required a force at the edge of the heaven-opening primeval continent to be challenged.<br/><br/>The Dragon Palace was so powerful that the landing battle of the Dragon Palace also made those forces at the edge panic.<br/><br/>However, when they saw the announcement of the Dragon Palace, they were both excited and shocked at the same time.<br/><br/>“This… the battle for the land of the Dragon Palace doesn’t challenge any forces. The Dragon Palace has already occupied an ownerless blessed land. Oh My God!”<br/><br/>“Is this the Dragon Palace? Is this the Invincible Dragon Palace? Isn’t this battle for the land of the Dragon Palace too terrifying? “Other forces need to challenge them to land, but the Dragon Palace has already occupied a blessed land ahead of time. They don’t need to challenge other races at all!”<br/><br/>“Now, the forces at the edge of the heaven opening desolate continent are also relieved. All of us are terrified that the Dragon Palace is going to land. Who would have thought that the dragon palace would be so powerful that it occupied a blessed land ahead of Time!”<br/><br/>“The Dragon Palace is too powerful. It has created history. It has occupied a blessed land before it even landed.”<br/><br/>At this moment, everyone in the surrounding land and the heaven opening desolate continent were discussing in shock.<br/><br/>The Battle of the Dragon Palace’s Landing was unprecedented.<br/><br/>If a race wanted to establish a clan in the heaven opening desolate continent, they had to own their own blessed land.<br/><br/>The importance of a grotto-heaven blessed land was clear to all races.<br/><br/>If not, there would be no foothold, no place to stand.<br/><br/>This would greatly affect the development of a race.<br/><br/>And the grotto-heaven blessed land at the edge of the heaven opening desolate continent was limited. It was basically occupied by all races. Even if it was not occupied by some races, it would be occupied by powerful desolate beast races.<br/><br/>Therefore, if one wanted to occupy a grotto-heaven blessed land, they had to declare war on it.<br/><br/>And the Dragon Palace had already occupied a grotto-heaven blessed land in advance. One could imagine how powerful they were.<br/><br/>They had occupied a grotto-heaven blessed land before they even landed. It could be said that they had created history.<br/><br/>“Welcome to the heaven opening desolate continent, Dragon Palace. If you have the time, Dragon King and guests of the Dragon Palace, you can come to our light race as guests!”<br/><br/>“Welcome Dragon Palace to the heaven opening desolate continent. Our nine-candle demon clan hopes to develop friendly relations with the Dragon Palace and become friendly neighbors.”<br/><br/>While the disciples of some forces at the edge of the heaven opening desolate continent were discussing, the congratulatory statements made everyone excited again.<br/><br/>“What the hell? What’s going on? The light clan and the nine-candle demon clan welcome the Dragon Palace? It seems that the Dragon King has a good relationship with their two clans. The strength of these two clans is not weak at the edge of the heaven opening desolate continent!”<br/><br/>“This is the card face. The powerful forces welcome the Dragon Palace directly.”<br/><br/>“Awesome, F * CK, is this the Dragon Palace? This is the Dragon Palace’s arrival. It’s so domineering!”<br/><br/>Looking at the statements of the two clans, countless people on the artificial intelligence system were discussing in awe.<br/><br/>Look, this is the Dragon Palace. It’s so awesome!<br/><br/>The statements of the light clan and the nine-candle demon clan seemed to have a beginning.<br/><br/>Soon after, some other races, led by the deep pool race, congratulated the Dragon Palace on their arrival in the heaven opening desolate continent.<br/><br/>In less than a day, more than twenty races made statements.<br/><br/>The experts of the forces surrounding Lu Xingkong could see that they were trying to curry favor with the Dragon Palace!<br/><br/>The Dragon Palace was so powerful that they wanted to get familiar with it. They hoped that they wouldn’t have any conflicts with the Dragon Palace in the future.<br/><br/>Looking at the statements of the races, all the forces in the surrounding galaxy were extremely envious.<br/><br/>If one day they could reach the level of the Dragon Palace, they would have no regrets.<br/><br/>“Humph, Dragon Palace, Dragon King!”<br/><br/>While the AI was busy with the Dragon Palace, in the Lich City of the Lich Kingdom.<br/><br/>The Lich King looked at the messages on the AI with anger on his face.<br/><br/>The more glorious the Dragon Palace was, the angrier he became.<br/><br/>It could be said that the dragon palace had risen up by stepping on the head of the Lich Kingdom.<br/><br/>The Lich Kingdom had also suffered heavy losses because of them.<br/><br/>“Do you think the landing battle will be so simple?”<br/><br/>The Lich King looked at the information on the AI with a grim expression. He smiled coldly and his eyes were filled with violent killing intent.<br/><br/>He did not expect that the Dragon Palace would not only offend them.<br/><br/>Very soon, they were going to take revenge.<br/><br/>“General Jin, the Dragon Palace is already preparing to land on the heaven opening desolate continent. This time, they will go directly to that blessed land. Once they occupy that place, with the Dragon Palace’s defensive power, it will be very difficult to chase them away.”<br/><br/>“Other than that, if they occupy that place, they will definitely find the cursed pool not far away. When that time comes, it will have a great impact on the plans of the cursed creatures.”<br/><br/>Located on the other side of the heaven opening primal continent, this was a realm filled with sci-fi, with all sorts of mecha and war chariots flying in the sky.<br/><br/>The places below were all filled with dream-like buildings.<br/><br/>This was the famous land of Technology in the heaven opening primal continent, the steel union.<br/><br/>Inside a castle located under this technological area, the cursed spirit village chief stood in front of a middle-aged mecha expert with a somewhat ugly expression as he spoke.<br/><br/>“I know. That place will not be occupied by the Dragon Palace. You Don’t have to worry. Our Steel Association understands the importance of the cursed pool!”<br/><br/>General Jin slowly browsed through some information on the AI and said faintly.<br/><br/>“Then… then what should we do?”<br/><br/>The chief of cursed spirit village could not help but ask.<br/><br/>“What should we do? Contact the Dragon Palace privately. If they don’t know what’s good for them, then don’t blame me for being impolite.”\t\t\t\t\t\t</div>", "images": {}, "success": true}