{"id": 357, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072615.html", "title": "Chapter 3348 - 3348 3347 Invincible Defense Under The Terrifying Devouring Dragon", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3348 - 3348 3347 Invincible Defense Under The Terrifying Devouring Dragon</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3348 3347 invincible defense under the terrifying devouring dragon<br/><br/>“Annihilate the Dragon King, this reckless fellow!”<br/><br/>“Attack!”<br/><br/>The 28 steel union’s generals were all wearing armor. The bullet holes began to condense a terrifying attack power.<br/><br/>They locked onto Wang Xian, who was attacking the battleships one after another, and launched an attack.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>The next moment, the attacks of the twenty-eight generals instantly covered Wang Xian completely.<br/><br/>Wang Xian seemed to have not seen these attacks as he flew toward the battleships one after another.<br/><br/>“Boom! Boom! Boom!”<br/><br/>In the next moment, all kinds of terrifying attacks landed on the sky above him. The entire void underwent a terrifying transformation.<br/><br/>A dead zone was formed around Wang Xian.<br/><br/>A large number of battleships from the steel union were affected by the impact. They collapsed under the terrifying impact.<br/><br/>“Is he dead?”<br/><br/>All the generals from the steel union stared at him with sparkling eyes.<br/><br/>The Dragon King was indeed very strong. However, the combined strength of the twenty-eight of them was sufficient to fight against a level nine universe knight.<br/><br/>Even a level nine universe knight would find it difficult to withstand their attacks head-on.<br/><br/>“What!”<br/><br/>“Damn it, is the defensive treasure on the Dragon King an innate spiritual treasure?”<br/><br/>However, soon, the generals of the iron and Steel Union looked embarrassed.<br/><br/>“Roar Roar Roar!”<br/><br/>In the next moment, a huge divine dragon flew out from the center of the explosion and attacked the surrounding battleships.<br/><br/>On his body, the collapsed tai chi dragon disc was slowly recovering. A red light surrounded it.<br/><br/>Wang Xian smiled faintly. After the attacks of the 28 generals had destroyed the Taiji Dragon Plate’s defense, only one-third of the attack was left.<br/><br/>This attack was easily blocked by the ancient oil lamp on his body.<br/><br/>It was very easy. Wang Xian was not injured at all.<br/><br/>“Haha, Die!”<br/><br/>He swayed his huge body and clawed at the battleships.<br/><br/>“Bang, Bang, Bang!”<br/><br/>The terrifying destructive force and almost invincible defense made Wang Xian feel as though he had entered an uninhabited land. All kinds of battleships and battleships were destroyed by him and turned into flames as they fell towards the ground.<br/><br/>“Are they moving?”<br/><br/>At this moment, Wang Xian sensed that the mechs were flying towards the left and right sides. Their eyes were locked onto ao crab and the rest.<br/><br/>“HMPH!”<br/><br/>Wang Xian moved his body. He flapped his incipient saint wings and charged towards them.<br/><br/>“Oh no, Sir Leader, help us block this Dragon King!”<br/><br/>When the powerhouses from curse spirit village who were wearing mechs saw Wang Xian charging towards them, their expressions changed drastically. They immediately shouted loudly.<br/><br/>“HMPH!”<br/><br/>The leader of the Steel Association looked at this scene with a gloomy expression. His body moved and his golden body landed directly in the middle of the battleship that was over 10,000 kilometers in size.<br/><br/>A throne appeared below him, and he landed directly on it.<br/><br/>On the throne, there was a red transmitter. The leader of the iron and Steel Union’s palm landed on the red transmitter.<br/><br/>Layers of identity scans were performed, and the red transmitter rose. At this moment, a cannon hole that was over 10,000 meters in size rose from the enormous battleship.<br/><br/>The dark and eerie cannon hole seemed as though it was going to destroy everything in front of it.<br/><br/>The cannon hole locked onto Wang Xian, and terrifying energy began to accumulate inside.<br/><br/>“Huh?”<br/><br/>When Wang Xian was locked onto by the terrifying cannon hole, his expression changed slightly.<br/><br/>“Leader of the Cursed Dragon, you guys go and take care of these guys from the curse spirit village.”<br/><br/>Wang Xian immediately transmitted his voice to the direction of the Dragon Palace.<br/><br/>In order to prevent those guys from cursed spirit village, the Dragon Palace had established a new species of dragon, the cursed dragon.<br/><br/>Among the cursed dragons, the strongest one had already reached the level of a Level 6 universe knight.<br/><br/>Together with the large amount of treasures they had, it was enough to deal with the people from cursed spirit village.<br/><br/>Furthermore, the strongest one that rushed out was only a level 6 universe knight.<br/><br/>Now that the cursed spirit village had completely submitted to the steel union, the steel union would not allow them to bring their level 7 or even level 8 universe knight armors to their deaths.<br/><br/>“It’s the Dragon King!”<br/><br/>In the Dragon Palace, the leader of the cursed dragon and the rest moved and charged over immediately.<br/><br/>Crash<br/><br/>After Wang Xian gave the order, Wang Xian flapped his primaless sacred wings and charged towards the terrifying cannon hole at a terrifying speed.<br/><br/>The tai chi dragon disc floated around him and a red light enveloped it.<br/><br/>Wang Xian squinted his eyes slightly and checked the energy in the ancient oil lamp. He revealed a wanton smile on his face.<br/><br/>The energy in the ancient oil lamp was enough for him to withstand a powerful attack.<br/><br/>Moreover, Wang Xian really didn’t believe that this attack from the steel union could have the destructive power of a peak universe knight.<br/><br/>“Die, Damn Dragon King!”<br/><br/>The leader of the Steel Union roared furiously. The terrifying energy beam that was accumulated charged directly at Wang Xian.<br/><br/>Boom<br/><br/>At this moment, it was as if the entire sky had turned into an extremely dazzling day.<br/><br/>Buzz<br/><br/>The terrifying energy charged at Wang Xian.<br/><br/>Wang Xian opened his mouth and a powerful defense was formed in front of him.<br/><br/>However, the defense that he released was instantly destroyed and continued to charge at him.<br/><br/>The attack landed on the Tai Chi Dragon Plate. The Tai Chi Dragon Plate’s defense slowly collapsed and continued to land on the light shield of the ancient oil lamp.<br/><br/>Around Wang Xian, the red light was flourishing. The vitality fluid in the ancient oil lamp was rapidly depleting.<br/><br/>However, this terrifying attack was completely blocked.<br/><br/>Wang Xian revealed a smile. He only needed to hold on for a while more and everything would be over!<br/><br/>“Ahhhhh!”<br/><br/>Just as he was entangled with the experts from the steel union, screams of agony began to ring out from both sides.<br/><br/>Ao he and the other two universe knights had level nine combat strength, the devouring dragon. They had completely suppressed the top-notch experts of the corpse-wrapping race in the Lich Kingdom.<br/><br/>And next was the stage for the Great Beings of the Dragon Palace.<br/><br/>Although the combined strength of the Great Beings of the dragon palace was much less than that of the two races, there was an lie in the Dragon Palace.<br/><br/>An lie now had the level of a Level 5 universe knight, and he had all kinds of treasures on him. There was a 50% chance that he could kill a level 6 universe knight in an instant.<br/><br/>He traveled at a strange speed between the great beings of the Lich Kingdom and the zombie clan. The moment he appeared, A Level 4 or 5 universe Knight was killed.<br/><br/>With an Lie’s strange and terrifying speed, he could kill dozens of universe knights in a second.<br/><br/>This was a very terrifying number.<br/><br/>Since the beginning of the war, tens of thousands of universe knights had died in his hands.<br/><br/>At that moment, the two forces were jittery. They were afraid that this strange figure would appear at their side.<br/><br/>It was as if death would choose them and they would die. Who Wouldn’t be afraid?<br/><br/>Under such circumstances, the Arrow Dragon from the Dragon Palace, the Strange Charm Dragon, and the over 10,000 universe Knight Level 4 dragon wizards all unleashed terrifying long-range attacks, causing the disciples of the Lich Kingdom and the wrapped corpse race to be terrified!\t\t\t\t\t\t</div>", "images": {}, "success": true}