{"id": 358, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072617.html", "title": "Chapter 3349 - 3349 3348 Annihilated The Three Major Forces, Shocking The World", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3349 - 3349 3348 Annihilated The Three Major Forces, Shocking The World</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3349 3348 annihilated the three major forces, shocking the world<br/><br/>“Not good, Lord Lich King. We are no match for the Dragon Palace. There are too many strange experts among them!”<br/><br/>“Clan leader, we can’t hold on anymore. We can’t hold on anymore. The Dragon Palace is too terrifying!”<br/><br/>At this moment, the terrified voices of the disciples from both sides of the Lich Kingdom and the corpse-wrapping race suddenly came.<br/><br/>The battle had been going on for five minutes, but during these five minutes, a large number of their companions were killed, and many disciples died every second.<br/><br/>They were a little afraid, afraid that they would be the ones to die in the next moment.<br/><br/>“Damn it, the steel union hasn’t even taken care of a single Dragon King, how can we fight?”<br/><br/>The bodies of the Lich King and the wrapped corpse race leader trembled violently, and they roared with an extremely unsightly expression.<br/><br/>They had relied on the true treasures in their hands to barely resist this universe Knight Level 9 devouring dragon.<br/><br/>Even so, it wouldn’t be long before they were defeated.<br/><br/>However, they had been waiting, waiting for the steel union’s reinforcements.<br/><br/>But up until now, they hadn’t even taken care of a single Dragon King.<br/><br/>This caused them to feel slightly terrified.<br/><br/>They were clear about the strength of the steel union, but they hadn’t killed the Dragon King yet. That Dragon King’s strength was definitely not simple.<br/><br/>Hearing the screams of their subordinates, their expressions kept changing.<br/><br/>If this continued, they would all die here.<br/><br/>“Run, run immediately, run back to your God Country!”<br/><br/>The Lich King gritted his teeth and ordered loudly.<br/><br/>They had lost, completely lost.<br/><br/>When the Dragon Palace erupted with the strength of two universe knights at Level 9, they wouldn’t be able to win this battle.<br/><br/>It would be impossible to destroy the Dragon Palace.<br/><br/>Furthermore, the members of the Dragon Palace had erupted with terrifying and strange attacks, they weren’t a match for the Dragon Palace at all.<br/><br/>Flee!<br/><br/>Let’s not talk about the consequences, as long as they could flee now.<br/><br/>Upon hearing the Order of the Lich King, all the powerful disciples of the Lich kingdom heaved a sigh of relief and immediately roared loudly.<br/><br/>“Kill, don’t let them escape so easily!”<br/><br/>At the forefront position, the berserk dragon species violently attacked in front of them. The powerful disciples of the Lich Kingdom fled back to their divine kingdoms.<br/><br/>Every minute they dragged on, tens of thousands more of the experts and disciples of the Lich Kingdom would die.<br/><br/>“Corpse-wrapping race disciples, flee immediately!”<br/><br/>On the other side, the corpse-wrapping race patriarch heard the orders of the Lich King. He swept his gaze across the battlefield and ordered while gritting his teeth.<br/><br/>The Lich Kingdom had fled. If they did not flee, their losses would be even more severe.<br/><br/>“Flee, flee, Flee!”<br/><br/>Immediately, experts from the corpse-wrapping race fled back to their God countries.<br/><br/>“Hahaha, if you want to flee, you have to stay here for at least half of it!”<br/><br/>Ao crab and the others roared, and their attacks became even fiercer.<br/><br/>When the clan leader of the Lich King corpse-wrapping race saw this, his expression sank.<br/><br/>Fleeing back to his Cosmos God country in an instant required some time to prepare.<br/><br/>Especially on such a battlefield where all sorts of energies were wreaking havoc, it was very easy to be interrupted.<br/><br/>And if a portion of the disciples managed to escape, the other portion would have to suffer double the number of attacks.<br/><br/>Under such circumstances, at least one-third of the disciples would have to stay here forever.<br/><br/>However, this was something that they had no choice but to do.<br/><br/>“What? This did not break through his defense?”<br/><br/>At the same time, the leader of the iron and steel union on the huge warship in the center stared at the spot in front of him.<br/><br/>He stared at the Dragon King who was covered by the energy of the warship.<br/><br/>However, when he saw that the Dragon King appeared in good condition, his expression changed drastically.<br/><br/>This time, they didn’t take the Dragon Palace too seriously.<br/><br/>With the three forces working together, the Dragon Palace wouldn’t be able to resist at all.<br/><br/>But now, he knew that he was wrong.<br/><br/>Just the Dragon King in front of them was enough to make the iron and steel union extremely difficult to deal with.<br/><br/>At this moment, they saw the experts of the Lich Kingdom and the corpse-wrapping race running away, and their expressions changed again.<br/><br/>“The Lich Kingdom and the corpse-wrapping race actually ran away, oh no!”<br/><br/>The expression of the leader of the iron and steel union changed slightly.<br/><br/>They couldn’t escape back to their God country like the Lich Kingdom and the corpse clan.<br/><br/>They had already become one with the machines. If they wanted to escape, they could only fly.<br/><br/>The moment both races escaped, the two universe Knight Level 9 warriors from the Dragon Palace would face the steel union directly.<br/><br/>This time, the strongest attack they sent out was only this one strategic level battleship.<br/><br/>There were even more powerful weapons, they were at the base and couldn’t move at will.<br/><br/>“I’m afraid there’s going to be big trouble!”<br/><br/>The leader of the steel union muttered, his expression constantly changing.<br/><br/>“Howl Howl Howl, die!”<br/><br/>At this time, over at the Lich Kingdom, the figure of the Lich emperor flashed and strangely left the battlefield hundreds of millions of kilometers away.<br/><br/>Ao crab ignored the Lich Emperor and charged towards the rest of the Lich Kingdom Knights with level 8 combat strength.<br/><br/>“No, no, no!”<br/><br/>“Run!”<br/><br/>Screams sounded. Without the Lich Emperor’s strength, the other level 8 knights were no match for ao crab.<br/><br/>They quickly fled.<br/><br/>However, it was impossible for all of them to escape.<br/><br/>In an instant, four level 8 knights were swept away by Ao Crab’s dragon claws.<br/><br/>The terrifying attack instantly killed them.<br/><br/>Other than that, almost none of the universe knights and Level 7 Great Beings were able to escape. They were all easily killed by ao crab.<br/><br/>On the other side, it was the same for the corpse-wrapping race.<br/><br/>If they wanted to escape, if they wanted to escape the devouring dragon’s attack, they had to pay a heavy price.<br/><br/>This price was the lives of a few universe knights and Level 8 Great Beings, as well as the lives of a group of universe knights and Level 7 Great Beings.<br/><br/>“Roar!”<br/><br/>After the Lich King and the rest escaped, ao crab and the rest turned their gaze to the steel union.<br/><br/>“Kill!”<br/><br/>They roared and Ao crab and another devouring dragon flew toward Wang Xian.<br/><br/>There was no need for them to destroy the Lich Kingdom and the corpse-wrapping race. There was another wave of attacks waiting for them.<br/><br/>“Oh no!”<br/><br/>At this moment, all the experts and disciples of the Iron and Steel Union saw ao crab and the others flying over. Their faces changed drastically, and their eyes revealed fear.<br/><br/>The twenty-eight generals’faces were gloomy. They immediately released one attack after another, covering ao crab and the others.<br/><br/>“Roar! Roar! Roar!”<br/><br/>However, in the face of these attacks, ao crab and the others directly waved their ferocious dragon claws to meet them.<br/><br/>Boom! Boom! Boom<br/><br/>The sound of explosions rang out. The 28 generals posed no threat to ao crab and the others.<br/><br/>“Destroy the steel union, leave no one alive!”<br/><br/>Wang Xian’s eerie voice resounded throughout the starry sky.<br/><br/>This time, the first one to be destroyed was the steel union. With the speed of him, ao crab and the other universe knights at Level 9, he wanted to see where they could escape to!<br/><br/>They wanted to destroy the Dragon Palace? Suppress the Dragon Palace?<br/><br/>Now let’s see who would be the one to destroy who!\t\t\t\t\t\t</div>", "images": {}, "success": true}