{"id": 356, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072613.html", "title": "Chapter 3347 - 3347 3346 Invincible And Terrifying Devouring Dragons", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3347 - 3347 3346 Invincible And Terrifying Devouring Dragons</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3347 3346 invincible and terrifying devouring dragons<br/><br/>The same was true for the wrapped corpse race!<br/><br/>This time, there were 15 universe knights and Level 8 great beings from the wrapped corpse race. Two of them died, but there were still 13.<br/><br/>However, when Ao Xie and the other two devouring dragons unleashed all their power, the leader and the others were stunned.<br/><br/>What was going on?<br/><br/>How could their power be so terrifying.<br/><br/>“Roar Roar Roar!”<br/><br/>Ao he and the others let out a furious roar as their dragon claws tore forward.<br/><br/>“Not good, the Dragon Palace has a Knight Level 9 fighter!”<br/><br/>At this moment, the warriors of the Lich Kingdom and the corpse race couldn’t help but roar, their bodies shaking violently.<br/><br/>The Dragon Palace actually had a knight level 9 fighter!<br/><br/>How was this possible! !<br/><br/>A year ago, the Lich Kingdom had directly attacked the Dragon Palace, and the Dragon Palace hadn’t resisted at all.<br/><br/>If the dragon palace had such combat strength, the Lich Kingdom would have been destroyed long ago.<br/><br/>But now, the Dragon Palace had suddenly erupted with such terrifying strength.<br/><br/>Two Knight Level 9 warriors, this…<br/><br/>“Pu Pu Pu!”<br/><br/>Ao crab and the others suddenly erupted with the power of a universe Knight Level 9, catching both the Lich kingdom and the wrapped corpse race off guard.<br/><br/>Even the eyes of the Lich Emperor and the others turned blood red instantly. They looked at the dragon claws that were attacking them, and their expressions changed drastically.<br/><br/>“Dodge!”<br/><br/>The Lich Emperor roared and hurriedly dodged to the side.<br/><br/>“Ah Ah Ah!”<br/><br/>However, within the Lich Kingdom, three universe knights and level 8 liches who were proficient in arrays let out miserable shrieks.<br/><br/>When they flew over, their bodies were already covered in a powerful defensive barrier.<br/><br/>The three liches who were proficient in arrays died instantly.<br/><br/>At the same time, ao crab and the others carried their power and headed straight for the other disciples of the Lich Kingdom.<br/><br/>“Roar!”<br/><br/>“Just the three races want to destroy our Dragon Palace and die!”<br/><br/>Ao he roared, and his huge dragon tail swept toward them with the heavy Earth and darkness attributes.<br/><br/>“Not good!”<br/><br/>“Dodge, Dodge!”<br/><br/>The millions of great beings from the Lich Kingdom roared in fear when they saw the terrifying dragon tail.<br/><br/>This time, when the three forces joined forces, the number of universe knights sent by the liches and the corpse-wrapping race alone reached over 700,000.<br/><br/>The Steel Union couldn’t even count the number of universe knights.<br/><br/>The power of the three forces could sweep across half of the edge of the Splitting Heaven Primal Continent.<br/><br/>However, there was still a huge gap between these 700,000 universe knights and one level 9 universe Knight and one million universe knights from the Dragon Palace.<br/><br/>Especially ao crab’s power.<br/><br/>One level 9 universe Knight was enough to make them pay a heavy price.<br/><br/>“Roar, Roar, Roar, kill, Kill, Kill!”<br/><br/>Ao crab and the other devouring dragon raged, locking onto all level 8 universe knights and even Level 7 universe knights from the Lich Kingdom and the corpse clan.<br/><br/>They were all covered by Ao crab and the others’attacks.<br/><br/>At this time, the Berserk Dragon, Imperial Dragon, Sky Thunder, Earth Fire, Dragon and Phoenix that were following closely behind had already rushed up.<br/><br/>Behind them, the Arrow Dragon, Charm Dragon, and Dragon Wizard were also launching long-range attacks.<br/><br/>Without their peak combat strength to block them, the few universe Knight Level 8 warriors of the Dragon Palace and the group of universe Knight Level 7 warriors were wreaking havoc.<br/><br/>Ao qitian, Ao Qi, and the others rushed over, their bodies exuding a violent aura. No Lich or the corpse-wrapping race could stop them.<br/><br/>“Not good, steel leader, request for reinforcements. There are level 9 knights in the Dragon Palace!”<br/><br/>The eyes of the Lich Emperor and the others were bloodshot as they roared.<br/><br/>At this moment, they were terrified.<br/><br/>They had never thought that the power of the Dragon Palace would be so terrifying.<br/><br/>If they had known, they wouldn’t have attacked the Dragon Palace even if they were beaten to death.<br/><br/>They could already foresee that even if they escaped this time, they would suffer the revenge of the Dragon Palace. At that time, the corpse race of the Lich Kingdom would have to flee.<br/><br/>“Damn it, how can there be such a powerful being in the Dragon Palace?”<br/><br/>The leader of the Steel Union and the generals all had a huge change in expression at this moment. Their eyes revealed a trace of fear.<br/><br/>“Cursed spirit village members, immediately enter your armor and attack those two universe Knight Level 9 Dragon Palace members!”<br/><br/>The leader of the iron and Steel Union immediately ordered loudly, his expression extremely gloomy.<br/><br/>“Yes!”<br/><br/>Behind them, all the cursed spirit village members’expressions were also extremely unsightly.<br/><br/>They had not expected that the power of the Dragon Palace was actually so terrifying!<br/><br/>This time, it was the combined attack of the three Great Powers!<br/><br/>They were actually suppressed by the other party in an instant.<br/><br/>“Hehe, don’t worry. I’ll play with you guys!”<br/><br/>Wang Xian stared at them with a violent look in his eyes.<br/><br/>“Roar! Roar! Roar!”<br/><br/>He let out a wild roar and eight divine dragon clones appeared around him. They attacked the various battleships, mechs, and spaceships in front of him.<br/><br/>“Bomb!”<br/><br/>A general moved his body and flew into the sky. His mech covered him.<br/><br/>All kinds of attacks were aimed at Wang Xian.<br/><br/>Boom! Boom! Boom<br/><br/>Countless attacks landed on the eight divine dragon clones. The Divine Dragon clones slowly collapsed.<br/><br/>Boom! Boom! Boom<br/><br/>However, Wang Xian had already rushed over at this moment.<br/><br/>His gigantic body extended his dragon claws and grabbed at the battleships and mechs one by one.<br/><br/>In an instant, sparks flew in all directions. The battleships and mechs fell to the ground one after another.<br/><br/>“Self-destructing mechs, kill this Dragon King!”<br/><br/>The leader of the Steel Union roared coldly.<br/><br/>At this moment, their bodies were covered in golden metal, and they were about 100 meters in size.<br/><br/>Although their bodies were not very big, the sophisticated weapons on them were emitting a terrifying golden glow.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>As soon as he gave the order, hundreds of self-destructing mechs attacked Wang Xian.<br/><br/>These self-destructing mechs were enough to turn a level 8 universe knight into ashes.<br/><br/>“Bang, Bang, Bang!”<br/><br/>Wang Xian saw the self-destructing mechs one after another. With a wave of his dragon claws, the five elements millstone appeared above his head.<br/><br/>On the Five Elements Millstone, the five divine dragons stuck their heads out and spat out attacks.<br/><br/>“Boom, Boom, Boom!”<br/><br/>When the attacks landed on the self-destructing mechs, the mechs immediately exploded.<br/><br/>The terrifying aftershock of the explosion swept across the surroundings.<br/><br/>Wang Xian did not retreat at all. Instead, he flew straight ahead. His target was the battleship that was over 10,000 kilometers long.<br/><br/>“Damn it, this Dragon King has so many treasures on him. Attack!”<br/><br/>The leader of the steel union saw it and ordered with a cold expression.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>At this moment, the 28 generals rose into the air. The special mech weapons on their bodies covered them as they attacked Wang Xian directly.<br/><br/>The combined strength of the 28 generals was sufficient to fight against a Level 9 universe knight.<br/><br/>Wang Xian narrowed his eyes slightly. An ancient oil lamp appeared at the position of his dragon’s head and horn.<br/><br/>“Kill!”<br/><br/>Wang Xian was fearless and charged forward.\t\t\t\t\t\t</div>", "images": {}, "success": true}