{"id": 354, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072609.html", "title": "Chapter 3345 - 3345 3344. Under The Siege Of The Three Forces", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3345 - 3345 3344. Under The Siege Of The Three Forces</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3345 3344. Under the siege of the three forces<br/><br/>The three races quickly flew toward the Dragon Palace.<br/><br/>The Dragon Palace was also making preparations.<br/><br/>Time passed day by day.<br/><br/>“HMM? Didn’t the Dragon Palace get the news that the three races are attacking them? Why hasn’t it stopped? Why hasn’t it changed its route?”<br/><br/>Two days later, the experts of the forces found that the Dragon Palace was still flying according to the usual route as if it didn’t know that the three races were attacking them.<br/><br/>This surprised the experts.<br/><br/>“How could they not know? Does the dragon palace have any trump cards?”<br/><br/>“What trump cards can they have? The only trump card they have against the three races is the defense of the Dragon Palace. If they really have a trump card, when the Lich Kingdom attacked the Dragon Palace, they had already destroyed the lich kingdom. They didn’t need the Dragon King to launch a Sneak Attack!”<br/><br/>“That’s true. In a real face-to-face fight, the Dragon Palace is not even a match for the Lich Kingdom, let alone the three forces. I think the three forces can destroy the Dragon Palace in one round of attack.”<br/><br/>The experts of the various forces analyzed on the universal intelligence.<br/><br/>The Dragon Palace was very powerful in everyone’s eyes, but it was only as strong as the forces surrounding the starry sky. Compared to the ordinary forces in the heaven opening and prehistoric continent, there was a big gap between them and the forces like the Lich Kingdom.<br/><br/>Not to mention the steel union.<br/><br/>Part of the strength of the Dragon Palace came from the defense of the Dragon Palace.<br/><br/>If the Dragon Palace went to challenge the other forces, it would be a piece of cake. However, they were besieged by the three forces.<br/><br/>No one thought highly of them.<br/><br/>“Humph, you are courting death. This time, I will suppress you forever!”<br/><br/>In the sky above the edge of the heaven opening desolate continent, the lich king looked at the messages one by one, his eyes filled with killing intent.<br/><br/>The three forces were getting closer and closer to the nine-origin pit.<br/><br/>The Dragon Palace was also getting closer and closer to the nine-origin pit.<br/><br/>The computational ability of the artificial intelligence of the iron and steel union had accurately calculated the route and progress of the Dragon Palace to hundreds of millions of kilometers.<br/><br/>This could be said to be extremely terrifying.<br/><br/>“Dragon King, the three major forces should be at the front. They might be lying in wait for us!”<br/><br/>A day later, a huge deep pit appeared in the sky above the Dragon Palace.<br/><br/>“Lying in wait for us? Hehe!”<br/><br/>Wang Xian smiled gently. His body moved and he immediately arrived in front of the East Gate of the Dragon Palace.<br/><br/>At this moment, at the East Gate of the Dragon Palace, all the members of the Dragon Palace were gathered there. Their eyes were filled with violent killing intent.<br/><br/>“Prepare for battle!”<br/><br/>Wang Xian squinted his eyes slightly. As the Dragon Palace moved forward, figures appeared on the screen one by one through the detection of the Dragon Palace.<br/><br/>Those terrifying battleships, those powerful mechas, and those battle spaceships that looked like ghosts.<br/><br/>In the center, there was an incomparably huge battleship.<br/><br/>One could see many figures standing on it.<br/><br/>And on the left and right sides, on the black clouds, were the powerful disciples of the Lich Kingdom.<br/><br/>On the white cloth were the powerful disciples of the corpse-wrapping race.<br/><br/>They floated in the air, waiting for the arrival of the Dragon Palace.<br/><br/>“Bzzz bzzz!”<br/><br/>When the Dragon Palace slowly approached, above the Dragon Palace, a terrifying lightning net appeared. That densely packed lightning net slowly condensed into a huge lightning hammer.<br/><br/>When the hammer of lightning descended, the entire Dragon Palace would be smashed into the deep pit below, but it would be sealed and suppressed.<br/><br/>“Hmph, this dragon palace is really cowardly. Since they want to be cowardly, then they can cower here forever!”<br/><br/>The Lich King looked at the Dragon Palace in his line of sight with a grim expression.<br/><br/>“Die! Kill those guys from the Dragon Palace!”<br/><br/>On the warship tens of thousands of kilometers away, the people from the cursed spirit village looked at this scene with excitement and malevolence.<br/><br/>“They still don’t dare to come out. It seems that we have overestimated the Dragon Palace!”<br/><br/>On the warship tens of thousands of kilometers away, the leader of the iron and Steel Union looked at the Dragon Palace that was about to be attacked with disdain.<br/><br/>They thought that the Dragon Palace would dare to resist, but they didn’t expect that it was still hiding in the dragon palace at this moment.<br/><br/>“The Dragon Palace is their support. If they come out, they will be courting death. The Dragon Palace is not stupid, Hehe!”<br/><br/>General Jin of the iron and Steel Union said with a smile at the back.<br/><br/>The Thunder and lightning in the Sky had long been prepared to slowly condense into a huge thunder hammer. The Dragon Palace continued to move forward at the same speed as before.<br/><br/>They were getting closer and closer to the three major forces.<br/><br/>At this distance, the members of the Dragon Palace could already see the experts of the three major forces clearly.<br/><br/>When they flew out, the opponents were already within their attack range.<br/><br/>“When the Thunder Hammer dissipates, it will be the time for our Dragon Palace to Attack!”<br/><br/>Wang Xian raised his head and looked at the Thunder Hammer that was about to descend. He gave an order calmly.<br/><br/>“Yes!”<br/><br/>All the members of the Dragon Palace replied immediately.<br/><br/>“Roar Roar Roar! I will defend against this Thunder Hammer!”<br/><br/>The Dragon Palace could defend against the attack of this thunder hammer. However, under the impact of the Thunder Hammer and the gravity, the dragon palace would fall downwards.<br/><br/>Ao crab let out a low roar. He transformed into a devouring dragon and swayed his huge body.<br/><br/>Boom<br/><br/>At this moment, the Thunder Hammer fell from the sky and smashed toward the Dragon Palace with endless power of thunder and lightning.<br/><br/>Once the Dragon Palace fell into the deep pit, the three forces would directly suppress the Dragon Palace.<br/><br/>“It won’t end so soon, will it? This is too boring.”<br/><br/>The experts of the three forces said indifferently when they saw this scene.<br/><br/>Roar! Roar<br/><br/>However, in the Dragon Palace that they couldn’t see, ao crab directly rushed toward the sky.<br/><br/>He stretched out his ferocious claws, and the defensive power of the Dragon Palace automatically opened a hole.<br/><br/>Ao crab’s dragon claws directly went toward the Lightning Hammer.<br/><br/>“Eh?”<br/><br/>When ao Crab’s dragon claws reached out, they immediately attracted the attention of the three forces.<br/><br/>They narrowed their eyes, and their eyes were shining.<br/><br/>Boom<br/><br/>The Lightning Hammer landed on the Dragon Claw, and the terrifying lightning struck the Dragon Claw.<br/><br/>However, the black and gray energy interweaved on the Dragon Claw, and the Dragon Claw collided with it.<br/><br/>Bang<br/><br/>In the next moment, another collision sounded. This time, the Lightning Hammer, which was condensed from lightning, flickered and flew up into the sky.<br/><br/>“As expected, the dragon palace is not that simple. They dared to come here because they relied on the special ability of the Dragon Palace?”<br/><br/>The three forces were not too surprised when they saw that the attack was blocked by the Dragon Palace.<br/><br/>“Kill!”<br/><br/>At this moment, a terrifying killing intent came from the Dragon Palace. A cold voice resounded across the entire sky.<br/><br/>Wang Xian was the first to bear the brunt. He took the lead and flew out from the East Gate of the Dragon Palace. His eyes were filled with killing intent.<br/><br/>His gaze locked onto the group of figures on the huge battleship. The five elements millstone floated above his head while the tai chi dragon circled around him.\t\t\t\t\t\t</div>", "images": {}, "success": true}