{"id": 350, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072601.html", "title": "Chapter 3341 - 3341 3340 Iron And Steel Union Declared War!", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3341 - 3341 3340 Iron And Steel Union Declared War!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3341 3340 iron and Steel Union declared war!<br/><br/>The cursed pool was very important to the iron and steel union.<br/><br/>As for the other blessed land, in fact, the iron and Steel Union didn’t pay too much attention to it.<br/><br/>Even that blessed land was abnormally powerful.<br/><br/>The main reason why they didn’t fight for that blessed land before was because of curse spirit village.<br/><br/>They wanted to completely control the members of the cursed spirit village.<br/><br/>After more than a year of preparation, they had completely controlled everyone in the cursed spirit village.<br/><br/>Now, the Dragon Palace was going to launch a landing battle.<br/><br/>They didn’t care if the Dragon Palace launched a landing battle, but they wouldn’t let the Dragon Palace take over the blessed land.<br/><br/>This would affect some of the iron and Steel Union’s plans.<br/><br/>As for the Dragon Palace, they naturally wouldn’t directly tell the Dragon Palace to Scram.<br/><br/>They also understood the Dragon Palace’s strength. The Lich Kingdom had already tested the Dragon Palace’s defensive power.<br/><br/>Therefore, their steel union would inform the Dragon Palace privately.<br/><br/>As the strongest force in the heaven opening and primeval continent, they could do this because they were giving face to the Dragon Palace.<br/><br/>“Huh?”<br/><br/>The chief of curse spirit village frowned slightly when he heard General Jin’s words. However, he did not say anything.<br/><br/>He did not have much authority to make the steel union do anything.<br/><br/>“Dragon King, we suddenly received a message from the Steel Union.”<br/><br/>An hour later, just as all the members of the Dragon Palace were preparing to land, Prime Minister Gui suddenly came to the Dragon King’s palace and reported to Wang Xian with an awkward expression!<br/><br/>“Information from the Steel Union!”<br/><br/>Wang Xian was slightly taken aback. When he saw Prime Minister Gui’s expression, he narrowed his eyes slightly and asked, “What information?”<br/><br/>“The Steel Union said that the grotto-heaven blessed land is of great use to them and to the curse spirit village. They don’t care about the matter regarding the curse spirit village, but the grotto-heaven blessed land belongs to their steel union. They will not give up and let our Dragon Palace find another place.”<br/><br/>“They also want the Dragon Palace to give them a reply within an hour.”<br/><br/>Prime Minister Gui said.<br/><br/>Chu Xian smiled. “Tell them to scram. If they dare to lay their hands on the grotto-heaven, we’ll fight them.”<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui replied immediately.<br/><br/>“Also!”<br/><br/>At this moment, Wang Xian narrowed his eyes. “Inform the heaven’s formation and tell them to come back. If anyone dares to touch our things this time, we will directly start a war with them.”<br/><br/>“Yes!”<br/><br/>Prime Minister Gui also narrowed his eyes and replied immediately.<br/><br/>Things were different now!<br/><br/>Back then, when the Lich Kingdom touched the Dragon Palace’s spoils of war, Wang Xian could only use sneak attacks to make the lich kingdom bow their heads.<br/><br/>But now, if anyone dared to touch the Dragon Palace’s blessed land, they would immediately start a war with them.<br/><br/>With ao crab and the other four universe knights with level 9 combat strength, would the Dragon Palace be afraid of the Steel Union?<br/><br/>So what if they were the strongest force at the edge of the heaven opening primal continent.<br/><br/>“HM?”<br/><br/>Very soon, the technology field of the Steel Union in the Heaven Opening Primal Continent.<br/><br/>When the higher-ups of the iron and Steel Union received the news from the Dragon Palace, their eyes turned cold.<br/><br/>“Release a statement directly. The blessed land occupied by the Dragon Palace belongs to the iron and Steel Union. If they dare to come here, let the Dragon Palace have a landing battle, Humph!”<br/><br/>The Supreme Leader of the iron and Steel Union issued an order, and the generals immediately responded.<br/><br/>In less than two minutes, the statement about the iron and steel union was released directly.<br/><br/>The iron and steel union was the most powerful force in the primal chaos continent.<br/><br/>It was one of the top technological forces in the entire universe.<br/><br/>Their every move attracted the attention of countless experts from countless forces.<br/><br/>When they made this statement, all the forces were stunned!<br/><br/>“What does the iron and steel union mean? The paradise occupied by the Dragon Palace belongs to the iron and Steel Union? If the Dragon Palace dares to come, we will have a war with them? A war between the Dragon Palace and the iron and Steel Union!”<br/><br/>“Hiss, it can’t be. What’s going on? What’s the grudge between the Dragon Palace and the iron and Steel Union?”<br/><br/>The experts from the forces on the edge of the heaven opening desolate continent widened their eyes and discussed in shock.<br/><br/>The iron and Steel Union had just announced that the Dragon Palace was going to land when they made such a declaration.<br/><br/>Did this mean that they were going to start a war?<br/><br/>The iron and steel union was the strongest force on their side.<br/><br/>The news quickly spread to the surrounding Lu Xingkong.<br/><br/>When the surrounding Lu Xingkong received the news, he was also in an uproar. His face also revealed an extremely shocked expression.<br/><br/>This…<br/><br/>The strongest force on the edge of the heaven opening desolate continent actually issued such a warning to the Dragon Palace?<br/><br/>What was going on?<br/><br/>Countless People’s eyes focused on the Dragon Palace and the iron and steel union, and they all swallowed their saliva.<br/><br/>They really thought that the Dragon Palace’s Landing battle this time was not as simple as they had imagined.<br/><br/>Facing the strongest force in the heaven splitting chaotic continent, the Dragon Palace was probably…<br/><br/>All kinds of discussions and all kinds of astonishment.<br/><br/>“Hahaha, I really didn’t expect that the Dragon Palace would actually provoke the iron and Steel Union.”<br/><br/>At this moment, in the Great Hall of the Lich Kingdom, the Lich King heard the news and roared excitedly.<br/><br/>Not long ago, when he received the news from the corpse-wrapping race, he was already very shocked.<br/><br/>The two races had already contacted each other to prepare for their next move.<br/><br/>However, he never expected that the steel union would also start a conflict with the Dragon Palace.<br/><br/>This was simply God’s help for them.<br/><br/>They knew more about the steel union than the other forces.<br/><br/>They knew how terrifying they were.<br/><br/>It was no exaggeration to say that if the iron and steel union’s battleship landed on the sky of their lich kingdom, their lich kingdom would have no choice but to flee.<br/><br/>They couldn’t resist it at all.<br/><br/>Now that the iron and steel union had a conflict with the Dragon Palace, in addition to their Lich Kingdom and the zombie clan, if they could join hands…<br/><br/>He was confident that he could completely suppress and seal the Dragon Palace.<br/><br/>“We can’t be anxious, we can’t be anxious. The Dragon Palace might not dare to provoke the iron and steel union. Since the iron and Steel Union has issued such a statement, the Dragon Palace might cower. If that’s the case, they won’t be able to fight. In the end, only the zombie clan will be left.”<br/><br/>Soon, the Lich King suppressed the excitement in his heart and murmured.<br/><br/>Everything was not set in stone yet, so they couldn’t be happy so early.<br/><br/>“HM?”<br/><br/>However, at this time, he saw a message on the AI, and his eyes instantly lit up.<br/><br/>“Hahaha, I didn’t expect that your Dragon Palace would be so arrogant. Are you relying on the Dragon Palace? You’re courting death!”<br/><br/>The Lich King laughed loudly as he spoke, opening the dragon’s mouth and could not help but laugh.<br/><br/>The Dragon Palace sent another message on the universe AI.<br/><br/>Five days later, the Battle of the landings!<br/><br/>The Battle of the landings!<br/><br/>Different from the previous announcement, the previous announcement was about the landings.<br/><br/>The addition of the word “Battle”also meant that if the steel union fought, the Dragon Palace would also fight!\t\t\t\t\t\t</div>", "images": {}, "success": true}