{"id": 351, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072603.html", "title": "Chapter 3342 - 3342 33.41 Million People Were Paying Attention To The Battle Of Land", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3342 - 3342 33.41 Million People Were Paying Attention To The Battle Of Land</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3342 33.41 million people were paying attention to the Battle of land<br/><br/>The Battle of land!<br/><br/>“Hiss, the Dragon Palace has responded. Their statement has been changed. They are going to wage a war against the iron and steel union in the Battle of land in five days!”<br/><br/>“The iron and steel union is so powerful, but the Dragon Palace is still not retreating. Is… is the Dragon Palace relying on the powerful defense of the Dragon Palace?”<br/><br/>“The Dragon Palace is still the same as before, but they must be relying on the defense of the Dragon Palace. Otherwise, how could they compete with the number one force in the heaven-opening desolate continent?”<br/><br/>“The Dragon Palace’s defense is very strong. The iron and steel union might not be able to break it!”<br/><br/>The response of the Dragon Palace shocked everyone.<br/><br/>They thought that the Dragon Palace would give up the paradise, but they didn’t expect that the iron and steel union would be involved.<br/><br/>The forces at the edge of the heaven-opening desolate continent were also surprised, their eyes shining.<br/><br/>To be honest, they were not optimistic about the Dragon Palace. The Dragon Palace was not even as powerful as the Lich Kingdom, how could it compete with the steel union?<br/><br/>The steel union was much more powerful than the Lich Kingdom.<br/><br/>Even if the Dragon King and the others entered the heaven-opening desolate continent with the defense of the Dragon Palace, what would happen next?<br/><br/>The Steel Union’s surveillance system could completely monitor the entire Dragon Palace. Once the members of the Dragon Palace came out, they would definitely suffer a huge blow.<br/><br/>“I thought that the Dragon Palace would descend, but I didn’t expect it to challenge the most powerful force.”<br/><br/>Some people sighed in their hearts, their eyes shining.<br/><br/>At this time, no force at the edge of the heaven opening desolate continent opened their mouths to welcome the Dragon Palace.<br/><br/>They were afraid of offending the Steel Union.<br/><br/>The entire edge of the heaven opening desolate continent fell into a strange atmosphere.<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>In the void in front of the steel union, four figures were flying toward the sci-fi territory.<br/><br/>The Lich King with the dragon head of the Demon Dragon and another expert from the Lich Kingdom.<br/><br/>Beside them were the experts of the corpse-wrapping race wrapped in a shroud.<br/><br/>Just as they approached the steel union, drones flew over and locked onto their identities.<br/><br/>“Please state your intentions!”<br/><br/>“We are the leaders of the Lich Kingdom and the corpse-wrapped race. We wish to meet the leader of the Steel Union. If there’s anything we can discuss!”<br/><br/>The Lich King immediately said.<br/><br/>“Please Wait a moment!”<br/><br/>“Please follow me!”<br/><br/>Soon, under the guidance of the drone, the Lich King and the others entered the territory of the Steel Union.<br/><br/>The Sci-fi buildings, weapons, and huge battleships docked in the void made their hearts palpitate.<br/><br/>“Ka Ka Ka!”<br/><br/>Soon, they flew to the front of a sci-fi building. The building opened an entrance, and the Lich King and the zombie clan experts entered.<br/><br/>Inside was a large hall, and an old man sat on the Iron Throne in front.<br/><br/>“Lich King, chief of the corpse-wrapping race, what business do you have here personally?”<br/><br/>The old man looked at them and asked faintly.<br/><br/>“Steel leader, you should have guessed that we are here for the Dragon Palace!”<br/><br/>The Lich King cupped his hands toward the chief of the Steel Union and said.<br/><br/>“Oh? You have a grudge against the Dragon Palace?”<br/><br/>The leader of the iron and Steel Union looked at the leader of the iron and Steel Union and asked in surprise.<br/><br/>“Two universe knights of the iron and Steel Union were killed by the Dragon King. Naturally, the iron and steel union will take revenge.”<br/><br/>The leader of the iron and Steel Union said.<br/><br/>“I want to hear your plans. If possible, the iron and Steel Union will agree.”<br/><br/>The leader of the steel union’s eyes sparkled.<br/><br/>The arrival of the two great races, the Lich Kingdom and the corpse-wrapping race, had also exceeded his expectations.<br/><br/>The strength of their two races was second only to the steel union at the edge of the heaven opening desolate continent.<br/><br/>For two great races to come at once, the Dragon Palace had really provoked a lot of powerful forces!<br/><br/>“Steel spirit, our action is very simple. The Dragon Palace wants to go to the grotto-heaven blessed land that they currently occupy. We’ll find a good place to ambush midway and directly suppress them there forever, so that they can never come out!”<br/><br/>The Lich King said directly.<br/><br/>“The Paradise they are occupying belongs to us. Our Steel Union has already sent people to take it over.”<br/><br/>The leader of the Steel Union said and pondered for a few seconds, “Then how strong is the defense of the Dragon Palace?”<br/><br/>“I judge that unless they have the destructive power of a universe overlord, it will be very difficult to break through the defense of the Dragon Palace. Sealing and suppressing is the best way.”<br/><br/>Lich emperor said solemnly, “If it wasn’t for the powerful defense of the Dragon Palace, Our Lich Empire would have destroyed the dragon palace long ago.”<br/><br/>“Sealing and suppressing.”<br/><br/>The leader of the steel union nodded slightly, “This isn’t difficult. Our Steel Union will come up with the plan for this matter. Your two races can just send all the strong disciples, no problem right!”<br/><br/>“Of course not.”<br/><br/>When the Lich King and the chief of the wrapped corpse clan heard this, they smiled.<br/><br/>The iron and Steel Union’s plan was much more detailed than theirs.<br/><br/>Their fighter jets and their smart technology could find the best place and find the best plan.<br/><br/>When the time came, their lich kingdom and the wrapped corpse clan only needed to send people to attack!<br/><br/>“In three days, we will pass the plan to you!”<br/><br/>The leader of the iron and Steel Union said directly.<br/><br/>The Lich King and the leader of the corpse-wrapping race nodded and left.<br/><br/>“This time, the Dragon Palace will definitely die!”<br/><br/>When they heard that they had flown to the sky, their eyes were full of excitement.<br/><br/>“It’s good to suppress the Dragon Palace, so that they won’t take revenge in the future!”<br/><br/>In the territory of the iron and Steel Union, the leader of the iron and steel union muttered.<br/><br/>He quickly checked the information of the Dragon Palace in his mind, and was slightly shocked by the speed of the rise of the Dragon Palace.<br/><br/>Such a force could either be suppressed directly or not offend them.<br/><br/>Unfortunately, they had already offended them, so he would suppress them!<br/><br/>He closed his eyes slightly, and a scene appeared in his mind.<br/><br/>Battleships and spaceships had already arrived above that blessed land.<br/><br/>In that blessed land, the formation was operating.<br/><br/>“Attack!”<br/><br/>A mechanical voice rang out, and terrifying attacks attacked the formation one after another.<br/><br/>The formation slowly began to collapse, and the unmanned fighter jets scanned their surroundings, slowly landing in that blessed land.<br/><br/>The members of Curse Spirit Village came to the blessed land excitedly.<br/><br/>At the same time, in the cursed pool not far from the blessed land, tens of millions of clones stood in front of the cursed people.<br/><br/>They all jumped into the cursed pool and screamed in pain.<br/><br/>Their chances of survival were one in ten thousand.<br/><br/>Now that the technology of the Steel Union had reached a critical point, they could only think of other ways to improve.<br/><br/>Creating some cursed people was a relatively simple method for now.\t\t\t\t\t\t</div>", "images": {}, "success": true}