{"id": 366, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072633.html", "title": "Chapter 3357 - 3357 At The Edge Of The 3356 Continent, The Dragon Palace Was The King", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3357 - 3357 At The Edge Of The 3356 Continent, The Dragon Palace Was The King</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3357 At the edge of the 3356 continent, the Dragon Palace was the king<br/><br/>Now that the three forces had been destroyed, it was time for the Dragon Palace to harvest.<br/><br/>The treasures of the corpse-wrapping race and the steel union were being collected. Most of the treasures had been collected.<br/><br/>Now, it was the steel union’s turn.<br/><br/>As the most powerful steel union in the heaven opening desolate continent, they had been standing on this piece of land for a long, long time.<br/><br/>The treasures they possessed would definitely reach a terrifying level.<br/><br/>“Let’s look for the treasures of the Steel Union.”<br/><br/>Wang Xian gave an order to ao crab and the rest before he transformed into his human form and flew towards the area below.<br/><br/>Although the area below had turned into ruins, there were still many buildings that were in good condition.<br/><br/>This was especially so for the underground base buildings.<br/><br/>“These metals can give the devouring dragon a significant upgrade.”<br/><br/>Wang Xian scanned his surroundings and said with a smile.<br/><br/>“Peng!”<br/><br/>He landed on the ground and scanned his surroundings with his dragon eyes.<br/><br/>Sensing the source of the tremendous energy, he moved and immediately arrived at an entrance.<br/><br/>“Please conduct a Test!”<br/><br/>The voice of the AI was heard. With a wave of his arm, Wang Xian destroyed it.<br/><br/>Below him was a huge underground palace.<br/><br/>The entire palace did not have the same technological feeling as the one above. Instead, it was filled with a natural aura.<br/><br/>There were universe knight-level trees, flowers, and plants growing. There was also an artificial river. The river contained a huge amount of spiritual energy.<br/><br/>The entire palace was made of green bricks and tiles. It was exceptionally beautiful.<br/><br/>“This should be the place where the upper echelons of the steel union live.”<br/><br/>Wang Xian scanned his surroundings. His eyes were sparkling.<br/><br/>The surrounding trees, flowers, and grass were all at least level five universe knights.<br/><br/>Even the Dragon Palace did not have so many divine trees and grass.<br/><br/>There were also some fruits on some of the trees that were emitting dense spiritual energy.<br/><br/>As the steel union was developing technology, these divine herbs of the divine kingdom might not be as useful as the huge divine stones in their eyes.<br/><br/>This also resulted in this extremely luxurious place to live in.<br/><br/>The entire palace complex took up an area of about 100 kilometers. It was not very big, but it was very beautiful.<br/><br/>Wang Xian flew in the sky. With a glance, he could see all kinds of general’s residences.<br/><br/>There were 28 general’s residences. The central location was the leader’s residence.<br/><br/>Wang Xian arrived above the leader’s residence.<br/><br/>The leader’s residence was located above the blessed land of the grotto-heaven. There was only one effect of this blessed land.<br/><br/>It could produce a powerful protective shield.<br/><br/>Wang Xian landed in the leader’s residence. His gaze swept across the Blessed Land of the grotto-heaven located in the backyard.<br/><br/>There was a robot standing there motionlessly. Clearly, it was controlling this defensive barrier.<br/><br/>Wang Xian studied it for a moment. A wave of energy covered the grotto-heaven blessed land.<br/><br/>In an instant, the defensive barrier outside slowly disappeared.<br/><br/>“This defensive barrier can withstand the destructive power of a peak universe knight. If it wasn’t for an lie, it would be impossible to destroy the Steel Union.”<br/><br/>Wang Xian muttered and scanned the area with his dragon eyes.<br/><br/>“Here!”<br/><br/>He moved and arrived at a palace in the center of the leader’s residence.<br/><br/>This palace was emitting all kinds of powerful abilities.<br/><br/>He came to this palace with an excited look in his eyes.<br/><br/>On the walls around the palace, there were many treasures hanging in crystal boxes.<br/><br/>With a glance, there were more than 40 acquired Supreme Treasures.<br/><br/>These were acquired Supreme Treasures!<br/><br/>For treasures of this level, even universe knights of level eight or level nine would fight for them with all their might.<br/><br/>Other than these acquired Supreme Treasures, there were also other mystical treasures.<br/><br/>“This is?”<br/><br/>Wang Xian glanced around and kept the acquired Supreme Treasure. His gaze landed at the center.<br/><br/>There was a piece of metal there. The silver-white metal was squirming inside the crystal box.<br/><br/>Wang Xian could sense the strange energy coming from it.<br/><br/>“What kind of treasure is this? To be placed in the center, it must be extraordinary!”<br/><br/>He mumbled and did not study it in detail. He kept all the treasures in his bag.<br/><br/>A large number of big elixirs should have been obtained by killing other powerhouses.<br/><br/>There were also various other treasures.<br/><br/>Just the Steel Union’s collection alone could allow Wang Xian to achieve a breakthrough in his strength!<br/><br/>“Dragon King, the Dragon Palace has arrived!”<br/><br/>While Wang Xian was searching, Prime Minister Gui’s voice was heard.<br/><br/>Wang Xian looked at the sky. The Dragon Palace had already rushed over.<br/><br/>“Gather all the treasures in the Steel Union. Also, announce that the three major forces have been destroyed by the Dragon Palace!”<br/><br/>Wang Xian replied immediately.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui replied immediately.<br/><br/>Whoosh<br/><br/>He moved and entered the other generals’residences to search for all sorts of treasures.<br/><br/>“This time, it can be said to be a huge boost. The strength of the Dragon Palace can be increased tremendously.”<br/><br/>Wang Xian muttered.<br/><br/>The Dragon Palace already had a million universe knights. After this, it could increase by at least 800,000 to 900,000, or even a million.<br/><br/>After all, this was all the resources of the three most powerful forces at the edge of the land.<br/><br/>Hong<br/><br/>When Prime Minister Turtle issued a statement in the name of the Dragon Palace, all the Great Beings who were watching the war immediately became excited.<br/><br/>“The Steel Union has also been destroyed. It’s unprecedented to destroy three forces at once!”<br/><br/>“As expected, the steel union was unable to withstand the attack of the Dragon Palace. The three forces are all existences that have been standing here for billions of years!”<br/><br/>“The Dragon Palace is too powerful. With such terrifying strength, they are powerful enough to enter the deep part of the heaven-opening desolate continent, let alone land there!”<br/><br/>“After this battle, the Dragon Palace will be the king on the edge of the heaven-opening desolate continent!”<br/><br/>The forces surrounding the starry sky and the forces on the edge of the heaven-opening desolate continent were all shocked.<br/><br/>The Dragon Palace was the king on the edge of the continent!<br/><br/>No powerhouse dared to object to this statement.<br/><br/>The Dragon Palace was built with great strength and terrifying battle records.<br/><br/>Once they landed, they would be invincible!<br/><br/>Some of the forces surrounding Lu Xingkong were already considering whether they should pay a visit to the Dragon Palace after the dragon palace was completely stabilized.<br/><br/>Please!<br/><br/>A battle had attracted everyone’s attention. For a long period of time, they might be discussing this matter.<br/><br/>Just as the AI was boiling with excitement, Wang Xian and the rest emptied the entire steel union.<br/><br/>Other than the blessed lands that could not be taken away, the rest were taken away.<br/><br/>The group of palaces were also taken away.<br/><br/>Their target was the revival Wonderland at the Horn of the sea.<br/><br/>The Zombies in the Lich Kingdom and the blessed lands occupied by the steel union were very powerful. However, the most suitable place for the Dragon Palace was still the revival Wonderland at the Horn of the sea.<br/><br/>That place was the largest ocean in the heaven-splitting prehistoric land. It was more suitable for the future development of the Dragon Palace.<br/><br/>“However, this time, the Dragon Palace needs to settle down and stabilize!”<br/><br/>Wang Xian mumbled to himself as he thought about the future development of the Dragon Palace!\t\t\t\t\t\t</div>", "images": {}, "success": true}