{"id": 365, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072631.html", "title": "Chapter 3356 - 3356 At The Edge Of The 3355 Continent, The Dragon Palace Was The King", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3356 - 3356 At The Edge Of The 3355 Continent, The Dragon Palace Was The King</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3356 At the edge of the 3355 continent, the Dragon Palace was the king<br/><br/>“There’s an enemy invasion. How can there be an enemy invasion?”<br/><br/>“How is this possible? Our Paradise has a strong defense. How can it be invaded?”<br/><br/>When the voice of the artificial intelligence sounded, all the strong disciples of the iron and Steel Union looked around in shock.<br/><br/>The defense of this paradise was their last shelter. If it was invaded, the consequences would be unimaginable.<br/><br/>The leader of the iron and Steel Union and more than 20 generals were also shocked.<br/><br/>“Roar! Roar! Roar!”<br/><br/>At this moment, a roar came from behind them.<br/><br/>A huge wave of dragon power rushed toward them.<br/><br/>“What!”<br/><br/>At this moment, all the upper-level disciples of the iron and steel union trembled. They quickly looked back.<br/><br/>When they saw the Dragon King and the four devouring dragons, their eyes widened.<br/><br/>“How is this possible? How did they enter this place? How is this possible!”<br/><br/>An incredulous voice came from the mouth of a general.<br/><br/>This was their final defense!<br/><br/>“Kill! Today is the day your steel union will be destroyed!”<br/><br/>Wang Xian stared straight ahead. His eyes were filled with a violent aura. He swayed his huge dragon body and waved his dragon claws. All kinds of energy weapons of the five elements were thrown forward.<br/><br/>The terrifying ice arrows, the blazing sun, the pagoda that was emitting flames, and the fan that was fanning the hurricane…<br/><br/>All Kinds of elemental laws and energies were wreaking havoc in the surroundings.<br/><br/>“Roar Roar Roar, die!”<br/><br/>Ao crab and the others roared and moved, directly rushing towards the center.<br/><br/>Their gazes locked onto the steel union leader and the generals, filled with awe.<br/><br/>The steel union leader’s breathing was somewhat hurried, and his eyes were filled with death and madness.<br/><br/>He roared crazily.<br/><br/>The Golden Battleship’s body glowed, and beams of sharp golden light met ao crab and the others’attacks.<br/><br/>Boom! Boom! Boom<br/><br/>The sounds of collision rang out, but the combined strength of the iron and Steel Union could at most fight two or three universe knights with level 9 combat strength.<br/><br/>Now that sawtooth was suppressed, their resistance was greatly reduced.<br/><br/>Furthermore, in the defense of this paradise, they could not withstand the ravages of the four devouring dragons.<br/><br/>“Roar! Roar! Roar!”<br/><br/>Terrifying dark quicksand swept down in all directions.<br/><br/>“Bang! Bang! Bang!”<br/><br/>A large number of mecha battleships collapsed and fell down.<br/><br/>There were more than a billion mecha battleships of the steel union. Now that they were hiding in this defense, they could only attack from the front row.<br/><br/>Their attacks were not of much use to Wang Xian and ao crab.<br/><br/>With every attack, more than ten million mech battleships were shot down. The area below instantly turned into a huge sea of fire.<br/><br/>“Kill, Kill, Kill!”<br/><br/>The Generals of the Steel Union roared with blood-red eyes. They activated their mechas and launched countless attacks at ao crab and Wang Xian.<br/><br/>“Die!”<br/><br/>Wang Xian was surrounded by the Tai Chi Dragon. In an instant, he came to the side of one of the generals and waved his dragon claws.<br/><br/>“Bang!”<br/><br/>The terrifying attacks caused Sparks to fly all over his body as he fell heavily towards the ground.<br/><br/>“Die!”<br/><br/>At this moment, more than ten generals immediately attacked Wang Xian.<br/><br/>“HMPH!”<br/><br/>Wang Xian snorted and flew backwards rapidly.<br/><br/>“Roar! Roar! Roar!”<br/><br/>At this moment, two devouring dragons appeared at Wang Xian’s left and right. They attacked the dozen or so generals.<br/><br/>“Ahhhh!”<br/><br/>They let out a final roar when they saw the devouring dragons charging at them.<br/><br/>“Boom! Boom! Boom!”<br/><br/>Soon, the sounds of explosions and collapse could be heard.<br/><br/>“It’s over, it’s completely over!”<br/><br/>The dozen or so generals were killed. The rest of the people from the steel union were on the verge of collapse.<br/><br/>They looked at this scene with despair on their faces.<br/><br/>This wasn’t just a failure, it was destruction.<br/><br/>After today, the steel union would probably no longer exist in the universe.<br/><br/>The steel union was completely powerless in the following battle.<br/><br/>Facing the four devouring dragons of the Dragon Palace, the steel union was rapidly dying.<br/><br/>Even the leader of the steel union could only watch as they died.<br/><br/>The battle and destruction continued.<br/><br/>On the universal AI, everyone was talking about this battle.<br/><br/>Especially when the news of the Lich Kingdom and the zombie clan being exterminated spread out, the AI on the edge of the land was talking in shock.<br/><br/>They were talking about how powerful the Dragon Palace was!<br/><br/>The Lich Kingdom and the wrapped corpse race had fled to their old dynasty after being defeated. Yet, they were destroyed so quickly under such circumstances. The Dragon Palace was too terrifying!<br/><br/>“The Dragon Palace must have been prepared to destroy the two races. They had already set up a terrifying force around their nest!”<br/><br/>“One of my brothers from the Lich Kingdom who escaped said that they were attacked by a universe Knight Level 9 great being. When they were preparing to escape, they destroyed all their Great Beings!”<br/><br/>“Those who entered the nest of the wrapped corpse race and killed them must be universe knight Level 9 Great Beings. This Dragon Palace actually displayed four universe Knight Level 9 Great Beings!”<br/><br/>“This power is too terrifying. I wonder what’s going on over at the Steel Union? Will the steel union be destroyed?”<br/><br/>On the universe AI, from the beginning, all the great beings from all the powers thought that the Dragon Palace would be suppressed, until now, the two powers had been destroyed.<br/><br/>Now, all the powerhouses were discussing whether the steel union was going to be destroyed or not!<br/><br/>Regarding the power that the Dragon Palace displayed, everyone was extremely shocked.<br/><br/>This power, if placed on the edge of the continent, was already an invincible existence.<br/><br/>At the edge of the sky splitting continent, a universe Knight Level 8 was the pinnacle.<br/><br/>The steel union was slightly special due to technology, but it couldn’t reach the level of a true universe Knight Level 9.<br/><br/>Now that the Dragon Palace had just landed from the surrounding starry skies, they were invincible.<br/><br/>This made the powers of the heaven opening primal continent extremely dazed.<br/><br/>The power of the Dragon Palace was too strong.<br/><br/>There were over 100,000 powers at the edge of the entire heaven opening primal continent, and they were all waiting for the result of this battle.<br/><br/>Hong Hong<br/><br/>An hour later, in the inner part of the iron and steel union’s grotto-heaven defense, the final explosion ended, and the entire world seemed to calm down instantly.<br/><br/>“Dragon King, everything is settled!”<br/><br/>Ao crab grabbed the head of the leader of the steel union with his claw and said with a smile.<br/><br/>“Very good. Settle it and search for the steel union’s Treasure!”<br/><br/>“Also, send the Heaven Formation over to prevent these guys from escaping by cloning and directly carry out the curse!”<br/><br/>Wang Xian swept his gaze across the surroundings and revealed a smile.<br/><br/>The three major forces were annihilated!\t\t\t\t\t\t</div>", "images": {}, "success": true}