{"id": 362, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072625.html", "title": "Chapter 3353 - 3353 None Of The 3352 Were Able To Escape", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3353 - 3353 None Of The 3352 Were Able To Escape</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3353 None of the 3352 were able to escape<br/><br/>“Boom! Boom! Boom!”<br/><br/>The destruction of the Lich Kingdom and the corpse-wrapping race had yet to be known by the experts of the other forces.<br/><br/>Meanwhile, on the side of the steel union, a huge battleship was fleeing in the sky above the heaven opening primeval continent.<br/><br/>The occasional explosion caused a commotion in the surroundings.<br/><br/>They flew over the sky above the various forces, causing a huge commotion.<br/><br/>More and more videos of the iron and Steel Union escaping in a sorry state appeared. When everyone saw this information on the AI, their faces were filled with shock and astonishment.<br/><br/>Wang Xian chased after them from the rear. His gaze was cold as he locked onto them.<br/><br/>He wanted to see how long the iron and Steel Union could last!<br/><br/>The chase continued and time passed little by little.<br/><br/>“Huh?”<br/><br/>At this moment, Wang Xian received a message from the eight-limbed demonic fiend and the other two devouring dragons.<br/><br/>When he saw this message, a smile appeared on his face.<br/><br/>The Lich Kingdom and the corpse-wrapping race had been annihilated. Only a small number of experts had escaped.<br/><br/>“Heaven Array, get an lie to bring you and the dragon shaman to the corpse-wrapping race and the Lich Kingdom to find all the treasures and divine kingdoms.”<br/><br/>“Also, an lie, bring the two devouring dragons over.”<br/><br/>Wang Xian immediately ordered through voice transmission.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie and the others immediately replied.<br/><br/>With the Lich Kingdom and the corpse-wrapping race destroyed, the resources and treasures of the two races were extremely terrifying.<br/><br/>This time, Wang Xian should have enough resources for his breakthrough.<br/><br/>“The steel union is still flying towards their base. They must be relying on the defense within the base. As the strongest force at the edge of the heaven-opening primal continent, they should be able to withstand the attacks of a level 9 universe knight. They might even be able to withstand one or two of them.”<br/><br/>Wang Xian looked at the steel union as they fled desperately. He was deep in thought.<br/><br/>Time passed day by day. A large number of spaceships, battleships, and mechs were destroyed by Wang Xian, ao crab, and the rest.<br/><br/>The number of spaceships in the steel union was decreasing. Their attack power was also getting weaker.<br/><br/>“Eh?”<br/><br/>On the fourth day, Wang Xian saw some spaceships flying to the main battleship of the steel union.<br/><br/>The speed of these spaceships was terrifying, comparable to the flying speed of a universe knight at level eight.<br/><br/>Some members of the Steel Union entered the spaceships and evacuated quickly.<br/><br/>“Dragon King, their firepower is not enough. We will be able to destroy that huge battleship very soon.”<br/><br/>From the side, ao crab transmitted his voice to Wang Xian.<br/><br/>“Okay!”<br/><br/>Wang Xian squinted his eyes slightly. “The other party might give up on this warship. We don’t care about anything else. We will follow closely behind them.”<br/><br/>“Roar!”<br/><br/>The Divine Dragon’s roar was heard.<br/><br/>“Damn the Dragon Palace. If you dare to come to our steel union’s base, I will make you suffer!”<br/><br/>One day later, on the main battleship of the steel union, the leader of the Steel Union glared at the Divine Dragons in front of him with a face full of hatred. His eyes were filled with fury.<br/><br/>“Leader, all the energy will be used up soon. Let’s retreat quickly!”<br/><br/>A general said to the leader of the Steel Union.<br/><br/>“Let’s Go!”<br/><br/>The leader of the steel union gritted his teeth and growled in a low voice.<br/><br/>Boom! Boom! Boom<br/><br/>Their bodies moved and they flew forward rapidly.<br/><br/>At the back, all the spaceships and battleships seemed to have activated their berserk mode. Not only did they not continue to fly, but they went straight for Wang Xian and the rest.<br/><br/>This included the terrifying battleships that were tens of thousands of kilometers away. They contained a terrifying force and released all kinds of terrifying energy attacks.<br/><br/>“The leader of the Steel Union has escaped. destroy all these battleships!”<br/><br/>Wang Xian’s dragon eyes swept across the area in front of him as he gave an order to ao crab and the rest.<br/><br/>“Roar! Roar! Roar!”<br/><br/>Ao crab and the rest roared as they resisted the attacks of these battleships that were about to be destroyed.<br/><br/>A radius of more than a billion kilometers was covered by all sorts of terrifying attacks. Even ao crab and the rest were unable to finish them off immediately.<br/><br/>After holding back Wang Xian and the rest for a full hour, a large number of battleships were turned into ruins.<br/><br/>“Let’s go. We have to rush over immediately. We can’t let them know that the Lich Kingdom and the corpse-wrapping race have been exterminated. Once they know about it, they will be on guard!”<br/><br/>The wreckage of the spaceship was handled by the members of the Dragon Palace. Wang Xian stared at the front and ordered immediately.<br/><br/>“Woo Woo!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>Xiao Lan’s small house roared. Wang Xian and the rest continued to fly towards the direction of the Steel Union.<br/><br/>The steel union had used the battleship to obstruct Wang Xian and the rest for an hour. However, Wang Xian and the rest were slightly faster than the other party.<br/><br/>Although they could not catch up to the other party within a short period of time, they were able to close in quickly.<br/><br/>The speed of both parties was extremely terrifying.<br/><br/>“That D * MN Dragon Palace! D * MN Dragon King! How dare he continue to pursue us from behind!”<br/><br/>At the front, the leader of the Steel Union and the group of generals could see that Wang Xian and the rest were still pursuing them through some detection methods. A cold murderous intent could be seen in their eyes.<br/><br/>“It won’t be long before they arrive at our steel union base. When the time comes, let them know our firepower.”<br/><br/>A general said with a gloomy face.<br/><br/>“Activate the base’s SSS grade defense system. Activate the base’s SSS grade attack system. Prepare to fire at the air.”<br/><br/>Data flashed in the eyes of the steel union leader. He gave long-range orders with a cold expression.<br/><br/>“Boom Boom Boom!”<br/><br/>As they flew towards the base, the entire steel union base emitted a rumbling sound.<br/><br/>All kinds of machines poked out terrifying dark cannon holes.<br/><br/>All kinds of energy weapons began to charge!<br/><br/>In the center of a huge building, a black cannon hole that was thousands of kilometers wide poked out.<br/><br/>This cannon hole connected to the depths of the ground, and the palpitating energy began to spread out in all directions.<br/><br/>In addition to this cannon hole, there was also something that looked like a golden sawtooth that slowly drilled out from the ground.<br/><br/>The entire sawtooth was tens of thousands of kilometers in size. It stood motionless between heaven and earth like a sleeping tiger.<br/><br/>“WHOOSH WHOOSH WHOOSH!”<br/><br/>At this moment, in the steel union’s base, a large number of battleships and mechs flew to the sky.<br/><br/>When the entire steel union’s weapons started to move, all the steel union’s citizens also entered a battle state.<br/><br/>Compared to the iron and Steel Union’s forces, the forces left in the base were stronger and more terrifying.<br/><br/>There were more than a billion different types of armor, densely covering the entire sky.<br/><br/>The power of science fiction looked equally magnificent from afar.<br/><br/>“Although our iron and steel union was defeated this time, it’s wishful thinking to destroy us!”<br/><br/>“The iron and Steel Union has been standing on the heaven-splitting primeval continent for so long. How could we be destroyed so easily?”<br/><br/>Seeing that all the war weapons in the base had been activated, the leader of the iron and Steel Union looked cold.<br/><br/>“Anyone who wants to destroy our force will have to pay a heavy price, including the Dragon Palace!”\t\t\t\t\t\t</div>", "images": {}, "success": true}