{"id": 364, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072629.html", "title": "Chapter 3355 - 3355 At The Edge Of The 3354 Continent, The Dragon Palace Was The King", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3355 - 3355 At The Edge Of The 3354 Continent, The Dragon Palace Was The King</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3355 At the edge of the 3354 continent, the Dragon Palace was the king<br/><br/>“Whoosh!”<br/><br/>A terrifying bullet headed towards the two devouring dragons.<br/><br/>One of the devouring dragons looked over and suddenly opened its huge mouth.<br/><br/>A black hole-like energy shot towards the bullet.<br/><br/>“Weng!”<br/><br/>His body shook and numerous earth-attribute devouring dragons surrounded the black hole and attacked the bullet as well.<br/><br/>“Roar Roar!”<br/><br/>Another devouring dragon continued to attack the surrounding mecha battleships.<br/><br/>Every strike destroyed a large number of mecha battleships, causing them to fall to the ground.<br/><br/>“Roar Roar Roar, with your strength, you still want to destroy our Dragon Palace!”<br/><br/>Right at this moment, after ao crab blocked the terrifying bullet, the follow-up attack did not arrive.<br/><br/>He moved his body and charged into the sky above the steel union.<br/><br/>“Roar!”<br/><br/>He opened his mouth and streams of demonic flames descended.<br/><br/>“Boom!”<br/><br/>The terrifying demonic flames destroyed a large number of weapons.<br/><br/>“Whoosh!”<br/><br/>At this moment, Wang Xian made use of his powerful defensive strength and speed to charge out from the flames of war.<br/><br/>His gaze was locked onto a general of the steel union. He flapped his incipient saint wings.<br/><br/>“Crash!”<br/><br/>He pushed his speed to the limit and attacked the general directly.<br/><br/>“Attack him!”<br/><br/>The general sensed Wang Xian’s attack and roared loudly.<br/><br/>Dense shells covered Wang Xian.<br/><br/>A Taiji pattern appeared around him. Wang Xian passed through the attacks of the shells directly.<br/><br/>“Oh no, his speed is too fast!”<br/><br/>When the general saw that all the attacks were ineffective against Wang Xian and saw his terrifying speed, he revealed a look of astonishment.<br/><br/>“Die!”<br/><br/>Wang Xian came to the front of the general and waved his dragon claws!<br/><br/>Boom! Boom! Boom<br/><br/>The general shot out streams of terrifying energy, but it had no effect on the dragon claws.<br/><br/>The Dragon Claw landed and the general fell into Wang Xian’s Dragon Claw.<br/><br/>Boom<br/><br/>The sound of an explosion came from his Dragon Claw. Wang Xian scanned his surroundings coldly.<br/><br/>“Not good!”<br/><br/>“That Dragon King’s strength is also extremely terrifying. We are not his match!”<br/><br/>“A general is dead!”<br/><br/>A general was killed by Wang Xian. Everyone in the surroundings was filled with fear.<br/><br/>This was a general of their steel union. He was practically an immortal existence.<br/><br/>“Warning! Warning! The enemy is too powerful. The base is unable to fight back. The base is unable to fight back!”<br/><br/>At this moment, the voice of the AI sounded in the minds of the generals in the cockpit of the huge battleships.<br/><br/>Upon hearing this voice, the faces of everyone in the steel union changed drastically.<br/><br/>“Damn it, how can there be four universe Knight Level 9 warriors in the Dragon Palace, how is this possible!”<br/><br/>The leader of the Iron and Steel Union roared indignantly.<br/><br/>“Leader, we are not their match, activate the Absolute Defense!”<br/><br/>A general saw all the warriors of the Dragon Palace rushing into the area of their base and roared ferociously.<br/><br/>“Activate the Absolute Defense!”<br/><br/>The leader of the steel union shouted and gave the order.<br/><br/>Boom! Boom! Boom<br/><br/>At this moment, a light shield rose around him and spread in all directions.<br/><br/>“All the disciples of the Steel Union retreat into the core circle!”<br/><br/>“Fire at the experts of the Dragon Palace!”<br/><br/>The generals immediately gave the order loudly.<br/><br/>Boom! Boom! Boom<br/><br/>The self-destructing mech spaceships charged at Wang Xian and ao crab without any regard for their lives. The sound of explosions kept ringing out.<br/><br/>The light shield began to envelop and form a golden defensive space.<br/><br/>This golden glow was not the power of technology, but the defense of the grotto-heaven paradise in their base.<br/><br/>“Boss, help me destroy this Golden Sawtooth First!”<br/><br/>At this time, the swallowing dragon that had been fighting with the Golden Sawtooth roared at ao crab and the others.<br/><br/>The Golden Sawtooth was very powerful, and it seemed to have intelligence as it kept rotating.<br/><br/>The terrifying golden sawtooth cut through all the energy.<br/><br/>It made the swallowing dragon, a level 9 knight, have to avoid it.<br/><br/>This was the strongest weapon of the steel union.<br/><br/>It was made of metal from a blessed land and a brain.<br/><br/>Even though it had a single attack, it couldn’t kill a level 9 knight.<br/><br/>However, when a level 9 knight was entangled, it would be a headache!<br/><br/>“Suppress this Golden Sawtooth!”<br/><br/>Ao crab roared and turned to attack the Golden Sawtooth.<br/><br/>There was only a Level 9 universe Knight Devouring Dragon accompanying Wang Xian.<br/><br/>He stared at the shield in front of him and waved his dragon claws.<br/><br/>Boom! Boom! Boom<br/><br/>Terrifying waves landed on the shield, but it didn’t budge at all.<br/><br/>This caused the devouring dragon to frown slightly.<br/><br/>“Dragon King, the defense of this shield is extremely terrifying!”<br/><br/>He immediately transmitted his voice.<br/><br/>“Shield, Hehe!”<br/><br/>Wang Xian smiled faintly. He did not mind it and looked to the side.<br/><br/>Boom! Boom! Boom<br/><br/>The Golden Sawtooth was moving slower and slower under the attacks of Ao crab and the other devouring dragons.<br/><br/>“Oh no, sawtooth is about to be suppressed!”<br/><br/>Within the Steel Union’s Protective Shield, the generals saw sawtooth being suppressed by ao crab and the others, and their expressions were extremely ugly.<br/><br/>This sawtooth could be said to be the steel union’s biggest trump card.<br/><br/>And now it was being suppressed by the Dragon Palace!<br/><br/>“This dragon palace is too powerful, luckily we still have the protection of this blessed land.”<br/><br/>A general’s forehead broke out in cold sweat, and his expression was extremely ugly as he said.<br/><br/>Four universe knights and Level 9 warriors were not something the iron and steel union could fight against.<br/><br/>The leader of the iron and Steel Union stood in the center, his expression changing constantly.<br/><br/>“Look at the AI, the AI has sent news that the lich kingdom and the wrapped corpse race have been destroyed, completely destroyed!”<br/><br/>At this time, a general exclaimed.<br/><br/>“What!”<br/><br/>Everyone was shocked.<br/><br/>“It should be the two knights from the Dragon Palace, they were ready to destroy us when we were about to attack!”<br/><br/>The generals trembled, their expressions dark.<br/><br/>When they were about to destroy the Dragon Palace, the Dragon Palace was also preparing to destroy them.<br/><br/>“Sawtooth has been stopped by them!”<br/><br/>“Phew, the Dragon Palace is too powerful!”<br/><br/>At this moment, a general looked at the area in front of him. Sawtooth’s energy had almost been consumed.<br/><br/>“Fortunately, our paradise is strong enough and has a terrifying defensive barrier!”<br/><br/>At this moment, all the senior disciples of the iron and Steel Union felt lucky.<br/><br/>“Beep Beep Beep, enemy invasion, enemy invasion!”<br/><br/>At this moment, an unusually urgent voice suddenly resounded throughout the entire space.<br/><br/>Figures slowly appeared behind the iron and steel union base that covered half of the base.\t\t\t\t\t\t</div>", "images": {}, "success": true}