{"id": 363, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072627.html", "title": "Chapter 3354 - 3354 None Of Them Could Escape", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3354 - 3354 None Of Them Could Escape</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3354 None of them could escape<br/><br/>“Any force that wants to destroy us will pay a heavy price, including the Dragon Palace!”<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>In front of the territory of the iron and Steel Union, the leaders and generals of the iron and steel union quickly flew toward them.<br/><br/>Their eyes were filled with coldness.<br/><br/>“It’s our territory!”<br/><br/>The generals looked at the battleships that rose into the sky. There were more than a billion armors and countless terrifying cannon holes. Their eyes revealed a sinister expression.<br/><br/>“All the steel union disciples, get ready to fight. Let the enemy never return!”<br/><br/>A general roared with a face full of fury.<br/><br/>This was their base. This place had already been forged into an iron wall.<br/><br/>Anyone who entered the base of the iron and steel union would be attacked with extreme terror.<br/><br/>Swoosh! Swoosh! Swoosh<br/><br/>The leader of the iron and Steel Union and the twenty-eight generals immediately came to the front of the powerful warships and weapons. Their eyes were full of killing intent as they looked at the rear.<br/><br/>The terrifying golden sawtooth that stood in the base of the iron and Steel Union.<br/><br/>The terrifying cannon hole in the center of the iron and Steel Union.<br/><br/>All kinds of terrifying weapons were aimed at the rear, waiting for the arrival of the powerful warriors of the Dragon Palace.<br/><br/>“Dragon King, the territory of the steel union is right in front of us. Above their base, there are already countless battleship weapons!”<br/><br/>An Lie’s figure appeared beside Wang Xian and reported.<br/><br/>The steel union had been fleeing to their base. They must be confident that they could withstand the attack of two universe knights, Level Nine Devouring Dragons.<br/><br/>Therefore, Wang Xian and an lie had investigated in advance.<br/><br/>“Are you ready to welcome us? It seems that the other party has the ability to fight AO he and the rest!”<br/><br/>Wang Xian’s eyes flickered slightly, and a sinister look appeared on his face.<br/><br/>“Attack and destroy the Steel Union!”<br/><br/>Wang Xian growled.<br/><br/>Roars came from both sides.<br/><br/>Battle intent surged from Ao he and the rest.<br/><br/>At the back, Xiao Lan’s small house accompanied them on both sides. Above them, the dragon clan’s dragon species that specialized in long-range attacks followed them.<br/><br/>In the middle, two devouring dragons in human form stood there quietly, waiting for orders.<br/><br/>“We’re Here!”<br/><br/>More than ten minutes later, a magnificent and technological domain appeared in their line of sight.<br/><br/>However, at this moment, there were countless armored spaceships in the sky above this magnificent technological domain.<br/><br/>A formidable aura rushed over.<br/><br/>“It’s Here!”<br/><br/>Everyone in the Steel Union also stared at the Divine Dragon flying over.<br/><br/>“Dragon King of the Dragon Palace, withdraw from our steel union’s domain. The enmity between us will be put to rest. We will never invade each other in the future!”<br/><br/>The voice of the leader of the iron and steel union was transmitted forward. He looked at the majestic divine dragon with a gloomy expression.<br/><br/>Now that the Dragon Palace had displayed such a powerful strength, the iron and steel union no longer wanted to be enemies with it.<br/><br/>“Hehe!”<br/><br/>Wang Xian’s eyes were filled with mockery when he heard the voice from the iron and steel union’s base.<br/><br/>“Attack when you want to attack the Dragon Palace. If you want to make peace, make peace. How can there be such a good thing in the world? Today, the Dragon Palace will turn your steel union into ruins!”<br/><br/>Wang Xian shouted with a cold face.<br/><br/>“You don’t know what’s good for you. Attack and destroy those guys from the Dragon Palace!”<br/><br/>The leader of the Steel Union roared furiously.<br/><br/>Buzz<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>The next moment, countless mecha battleships let out rumbling sounds. Densely packed attacks that blotted out the sky and covered the Sun headed towards Wang Xian and the rest.<br/><br/>“HMPH, you think you can get rid of us just by relying on two universe knights and a Level 9 powerhouse? Wishful Thinking!”<br/><br/>The leader of the steel union snorted coldly. He stood in front of the gigantic cannon hole and squinted his eyes slightly.<br/><br/>Buzz<br/><br/>The terrifying energy in the hole began to condense. A missile-like warhead charged towards ao crab.<br/><br/>The sawtooth-like golden weapon in front of him started to revolve and attacked another universe Knight Level Nine Devouring Dragon.<br/><br/>The terrifying attack instantly covered Wang Xian and the rest.<br/><br/>“Attack!”<br/><br/>Wang Xian growled and swayed his huge body. With a wave of his dragon claws, the Tai Chi Dragon disk covered the entire area.<br/><br/>“Roar!”<br/><br/>Ao he and the rest moved and went straight for the terrifying bullet and the golden sawtooth that made their hearts palpitate.<br/><br/>“Kill!”<br/><br/>On Xiao Lan’s body, the two devouring dragons also started to move.<br/><br/>They welcomed the densely packed attacks and flew towards the mecha battleships in the air above the steel union base.<br/><br/>“Boom! Boom! Boom!”<br/><br/>Very soon, the sound of explosions rang out. The details of all sorts of shells and the terrifying attacks caused the front to sink into a gray world. Nothing could be seen.<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>Right at this moment, the two figures took the lead to rush out of the gray world of cannon fire and continue flying towards the sky above the steel union.<br/><br/>“Eh?”<br/><br/>The two figures rushed over, slightly surprising all the generals of the iron and Steel Union.<br/><br/>“Lock onto those two guys from the Dragon Palace and destroy them!”<br/><br/>Immediately, a general ordered loudly, while at the same time, he shot out attacks one after another.<br/><br/>“Roar! Roar! Roar!”<br/><br/>However, at the moment when they attacked, the two devouring dragons let out violent roars.<br/><br/>They instantly turned into 100,000 m huge bodies, their terrifying aura spreading out in all directions.<br/><br/>They opened their mouths and a dark quicksand rushed forward.<br/><br/>“Boom Boom Boom!”<br/><br/>In an instant, the cannons that attacked them were shattered, countless quicksand landed on the battleships and mechs, making a loud explosion.<br/><br/>The attack of the two swallowing dragons caused tens of millions of battleships and mechs to instantly collapse.<br/><br/>This sudden scene stunned everyone in the Steel Union.<br/><br/>“What? How is this possible? weren’t the two Knight Level 9 Dragon Palace members held back?”<br/><br/>A general swept his gaze over, his expression changing as he roared.<br/><br/>“Roar Roar Roar!”<br/><br/>However, what awaited them was another attack from the two swallowing dragons.<br/><br/>“Sou Sou Sou!”<br/><br/>“Hong Hong Hong!”<br/><br/>They swayed their huge bodies and charged into the fleet of battleships and mechas. They waved their 18 dragon claws and their terrifying dark claws covered an area of over 100 million square meters.<br/><br/>Their dragon tails swept out and caused the battleships to explode one after another, falling downwards.<br/><br/>They were wreaking havoc, completely wreaking havoc.<br/><br/>“How is this possible? The Dragon Palace actually has a universe knight level 9 fighter hidden!”<br/><br/>A voice filled with disbelief and anger came from the leader of the Steel Union. His blood-red eyes stared at the two devouring dragons that had already charged into the sky.<br/><br/>Just now, their attacks had already locked onto immortal ao crab and the others. However, he had never expected that the Dragon Palace still had a universe knight level 9 fighter.<br/><br/>“They have been hiding their strength all this time. They want to completely destroy us. Damn it!”<br/><br/>The leader of the steel union trembled violently. He quickly turned the cannon hole beside him and attacked the devouring dragon that had already charged in.\t\t\t\t\t\t</div>", "images": {}, "success": true}