{"id": 369, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072639.html", "title": "Chapter 3360 - 3360 Inside The 2259 Continent", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3360 - 3360 Inside The 2259 Continent</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3360 Inside the 2259 continent<br/><br/>The appearance of the support Elves made the Dragon Palace a little livelier. The girls, Hua Er, Cai er, Xiao Yu, and the others also loved this little elf that was born.<br/><br/>However, Wang Lingling, who was born on the ancestral tree, had terrifying abilities.<br/><br/>As a support elf, she was like her name, a combat support elf.<br/><br/>Her main purpose was to release buff energy to heal her injuries, and even slow down her opponent’s speed to create some interference.<br/><br/>As for the support elf that was nurtured by the ancestral tree, she currently had five abilities, one of which was extremely heaven-defying.<br/><br/>The first ability was healing, a powerful healing technique that was comparable to pouring life force liquid directly into one’s body.<br/><br/>The second ability was the power of lightning, which could speed up and paralyze the enemy.<br/><br/>The third ability was the immunity to fire attribute law damage. It could help her target to be immune to a portion of the damage.<br/><br/>The fourth ability was spiritual interference, spiritual protection, interference with the enemy, and protection against mysterious attacks.<br/><br/>The last ability, which was also the most powerful ability, was resurrection. It was a very heaven-defying ability.<br/><br/>If Wang Xian was killed, Wang Lingling could instantly resurrect him.<br/><br/>All of her abilities came from the branches of the ancestral tree. The ability to revive came from the soul-returning tree branches.<br/><br/>Wang Lingling and the other supporting elves also had an extremely powerful ability.<br/><br/>The other supporting elves would not die no matter how they attacked. As long as the tree of life existed, they would exist forever.<br/><br/>It was the same for Wang Lingling. As long as the ancestral tree existed, she would not die.<br/><br/>“There is a reason why the ELF race is able to stand at the peak of the race.”<br/><br/>Wang Xian could not help but sigh after witnessing the strength of the supporting elves.<br/><br/>Time passed day by day. Five years later, after all the members of the Dragon Palace had made up their minds about various knowledge, they began to move around the Dragon Palace.<br/><br/>The Dragon Palace was now standing in the Horn of the sea. As the Horn of the mountain and sea, a corner of the largest ocean of the heaven opening primal continent, there were countless desolate beasts in it.<br/><br/>Even in their current location, they could still encounter some universe knight level seven or level eight desolate beasts.<br/><br/>The Dragon Palace also had to send some experts to clean up these desolate beasts.<br/><br/>In the blink of an eye, the Dragon Palace had been in the heaven-opening primal continent for ten years.<br/><br/>During these ten years, Wang Xian and the rest also went to visit other races. It was relaxing and relaxing.<br/><br/>The only thing was that the competition at the edge of the heaven-splitting primordial land was too intense. Many places were the territories of some desolate beasts.<br/><br/>The laws of the jungle were fully displayed. It was as if they were in a primitive world, with each and every faction occupying a part of the world.<br/><br/>“The factions at the edge of the heaven-splitting primordial land are like barbaric tribes. They are completely different from the inner parts of the heaven-splitting primordial land.”<br/><br/>Wang Xian looked through some information regarding the inner regions of the heaven-opening primal continent.<br/><br/>If they were said to be backward ancient villages, further into the inner regions would be city states and countries.<br/><br/>It was an interesting thing. The position at the edge of the continent was very important to the race and their bloodline. However, it was not so important in the inner regions.<br/><br/>Although it was still a race that dominated a region, this race was also willing to absorb the experts of other races and the elites of other forces.<br/><br/>Compared to the edge, the inner area valued a person’s strength more.<br/><br/>Strength was king.<br/><br/>In the depths of the heaven opening desolate continent, many people who could enter were experts who could surpass two levels, and there were many who could surpass three levels.<br/><br/>In this place, geniuses roamed unhindered, and experts roamed unhindered.<br/><br/>If a faction wanted to be prosperous and never decline, it needed an endless stream of experts.<br/><br/>It was still fine for those peak races. They controlled the core treasures, and there was an endless stream of experts. Basically, there wouldn’t be any gaps.<br/><br/>As for the other factions, they no longer had the ability of peak races. Gradually, they were willing to accept other experts to join them.<br/><br/>There were even some races that, in order to give birth to new powerful bloodlines, entered into marriage with other powerful bloodlines. Countless years had passed, and this had resulted in countless connections between the various races.<br/><br/>This also caused internal competition and race wars to be much less than those on the fringes.<br/><br/>Of course, there was another reason. The factions that could enter the inner regions were not simple.<br/><br/>Under the circumstances where they were not confident of destroying all of them, they would not rush over and kill them wantonly.<br/><br/>That was because this would cause the latter to take revenge crazily.<br/><br/>A Level 9 universe knight killing a Level 1 or Level 2 universe Knight of your race crazily, which race would be able to stand it?<br/><br/>“The city-state, country, school, sect, chamber of Commerce, and the inner circle of the heaven opening primal continent are more like a civilized society.”<br/><br/>Wang Xian looked at the documents one by one and revealed a smile on his face.<br/><br/>Things will always turn against each other when they reach their limits!<br/><br/>A hundred schools of thought were contending!<br/><br/>The heaven-splitting primordial land was more like a prosperous planet that had developed to its peak.<br/><br/>It was unlike the borderlands where all the races were fighting each other for resources, just like the ancient tribes.<br/><br/>Within the heaven-splitting primordial land, the competition was not only for ordinary resources, but also for talents and experts.<br/><br/>It was impossible for all the clansmen of a single race to be united. It was impossible for them to not have differences, and it was impossible for them not to encounter injustice.<br/><br/>If you encountered injustice, you could leave your own race and join some city-states, countries, schools, and even sects.<br/><br/>Many city-states, countries, schools, and sects were established by experts who had suffered injustice or left their races for other reasons.<br/><br/>As time passed, they grew stronger.<br/><br/>In places like this, the racial awareness of some powerhouses weakened and became a bustling place for business.<br/><br/>Of course, there were also some races that established their own schools to attract disciples from other races to join them and brainwash them for their own use.<br/><br/>The interior of the heaven-splitting and primal continent was more prosperous and prosperous.<br/><br/>“That’s right. If that’s the case, it’s much better than the edge.”<br/><br/>Wang Xian mumbled to himself. There was no powerful strength at the edge. There was a high possibility of death if he went out.<br/><br/>In the interior, there were rules and restrictions that increased the safety of the place by a lot.<br/><br/>“I’ve been here for ten years. It’s time to go out and take a look. I’ll look for the remaining Lei Yu and check out the interior situation!”<br/><br/>Wang Xian sat on the dragon throne and made his plan.<br/><br/>He had checked out a lot of information about the internal situation of the heaven-opening primal continent. However, he still needed to check out more information by himself.<br/><br/>Furthermore, he had to get his hands on the last twenty-seven Lei Yu of the incipient holy wings.<br/><br/>“Prime Minister Gui, I’m going out to take a look in a few days. You can handle the matters of the Dragon Palace!”<br/><br/>Wang Xian gave a light shout and instructed Prime Minister Gui.<br/><br/>Since he was mentally prepared, he would act immediately.<br/><br/>The stage of the heaven-splitting primordial land was located in the inner part of the continent. The number of resources and treasures of the powerhouses there was far beyond what this place could compare to.<br/><br/>Most importantly, the place was prosperous enough with many powerhouses.<br/><br/>It was the most resplendent place in the universe.\t\t\t\t\t\t</div>", "images": {}, "success": true}