{"id": 361, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072623.html", "title": "Chapter 3352 - 3352 None Of The 3351 Could Escape", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3352 - 3352 None Of The 3351 Could Escape</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3352 None of the 3351 could escape<br/><br/>“Lord Lich King, all the powerhouses and elite disciples from the eight cities have arrived!”<br/><br/>In the Lich Kingdom’s Lich City, there were nine more cities after three of them were destroyed by Wang Xian.<br/><br/>Under the Order of the Lich King, all the elite powerhouses had gathered in the Lich City.<br/><br/>At this moment, more than ten million liches had gathered in front of the main city’s grotto-heaven blessed land.<br/><br/>All kinds of liches were giving off powerful killing intent.<br/><br/>However, at this moment, their eyes were filled with fear.<br/><br/>Their liches country and the three great powers of the iron and steel union of the wrapped corpse clan had joined forces to attack the Dragon Palace, yet they were defeated by the Dragon Palace.<br/><br/>They had already heard this news.<br/><br/>Especially after knowing that the Dragon Palace had a universe Knight Level 9 great being.<br/><br/>They knew that the Lich kingdom had been completely defeated.<br/><br/>They also knew that the Lich Emperor had summoned them over, and they were probably going to escape.<br/><br/>As for where they were going to escape to, they didn’t know.<br/><br/>Sou Sou Sou<br/><br/>Right at this time, they saw the great beings of the Lich Kingdom flying over.<br/><br/>Seeing the great beings beside the lich emperor, their hearts sank.<br/><br/>Once, the Lich Kingdom had more than ten universe knights and level eight great beings.<br/><br/>However, there were only five of them now. This was a huge blow to the lich kingdom.<br/><br/>“All members of the Lich Kingdom, listen up. We have encountered an unprecedented enemy. Next, we have to avoid the hunting of the powerful enemies. I have found the place where we are hiding. All disciples, follow behind.”<br/><br/>The Lich King was floating in front of them. He was no longer as high-spirited as before. He stood there with a gloomy expression and said in a deep voice.<br/><br/>“Yes, Lord Lich King!”<br/><br/>The disciples of the Lich Kingdom replied with a heavy heart.<br/><br/>“Get Ready, let’s Go!”<br/><br/>The Lich King’s face was gloomy as his voice once again entered the minds of all his subordinates.<br/><br/>However, at this moment, an extremely terrifying gigantic dragon claw suddenly attacked the Lich King and the lich experts around him.<br/><br/>“What!”<br/><br/>At this moment, all the cells in the Lich King’s body exploded. The Dragon Eyes on the demonic dragon’s head widened, filled with disbelief and shock.<br/><br/>He quickly turned his body, and a gigantic shield appeared in front of him.<br/><br/>Hong<br/><br/>A terrifying sound was heard, followed by a terrifying dark quicksand that covered the surroundings.<br/><br/>“Not good, there’s a great being attacking!”<br/><br/>“This is… This is a terrifying being from the Dragon Palace, why are they here?”<br/><br/>At this moment, everyone in the Lich Kingdom opened their eyes wide, filled with fear.<br/><br/>Especially the Lich Emperor who was enveloped by the swallowing dragon and the other four universe knights, Level 8 liches.<br/><br/>They were filled with fear.<br/><br/>Why was that terrifying swallowing dragon in their Lich City?<br/><br/>How was that possible!<br/><br/>“Ah!”<br/><br/>However, facing the attack of a universe knight, they let out a final roar.<br/><br/>Peng<br/><br/>However, under the attack of the swallowing dragon, the Lich Emperor was still heavily injured. The other four universe knights were killed!<br/><br/>The terrifying dark quicksand covered an area of hundreds of millions of kilometers.<br/><br/>In front of them were all the elite disciples of the Lich Kingdom.<br/><br/>Because of the gathering of the Lich Emperor, they were all gathered together.<br/><br/>Under such circumstances, many of them had no time to escape.<br/><br/>Especially those below universe Knight Level 7. With their speed, how could they avoid the attack of a universe Knight Level 9 great being?<br/><br/>“Ahhhhh!”<br/><br/>When the dark quicksand rushed over, countless liches let out screams.<br/><br/>Facing such a terrifying attack, they couldn’t resist at all.<br/><br/>“No, no, no!”<br/><br/>Seeing this scene, Lich emperor howled with despair, “You… why did you suddenly come to our lich city, how could it be!”<br/><br/>“You want to destroy our Dragon Palace, die!”<br/><br/>The Devouring Dragon’s eyes were filled with a sinister malevolence as it attacked the Lich King with its dragon claws.<br/><br/>The Lich King, who had already been severely injured, turned pale when he saw this attack.<br/><br/>A shadow of a Devil Dragon appeared on his dragon head and blocked the devouring dragon’s attack.<br/><br/>“Boom!”<br/><br/>A terrifying collision sound was heard as the Lich King’s body sank 10,000 meters into the ground.<br/><br/>“Eh?”<br/><br/>The Devouring Dragon looked at him in surprise, somewhat surprised that he wasn’t dead yet.<br/><br/>“Keke Keke, leave it to me!”<br/><br/>At this moment, a black shadow instantly attacked the Lich King.<br/><br/>In just an instant, the black shadow directly entered the Lich King’s body.<br/><br/>The badly injured Lich King’s body trembled violently as his pupils slowly turned pitch-black, gradually giving up on resisting.<br/><br/>“Roar! Roar! Roar!”<br/><br/>When the devouring dragon saw this scene, it raised its head and swept its gaze across the surroundings. It swayed its huge body and directly charged towards the surrounding liches.<br/><br/>“Boom!”<br/><br/>The terrifying dragon tail violently attacked. In an instant, this place turned into a Lich’s hell.<br/><br/>“Run! Run! Our Lich Kingdom is about to be destroyed!”<br/><br/>“Lord Lich King has been killed! Run! Run! Run!”<br/><br/>The terrified and desperate voices resounded throughout the entire Lich City, and all the liches fled in fear.<br/><br/>They opened their blood red eyes wide, wanting to escape.<br/><br/>Hong Hong Hong<br/><br/>However, faced with the Universe Knight Level 9 devouring Dragon’s rampage and the terrifying attacks, large numbers of liches were killed.<br/><br/>Out of 10,000, it was already good enough for one to escape.<br/><br/>The difference was too great.<br/><br/>In less than five minutes, the entire lich city fell into Doomsday.<br/><br/>The swallowing dragon was wreaking havoc and slaughtering.<br/><br/>The destruction of the lich main city also meant the complete destruction of the Lich Kingdom.<br/><br/>However, at this time, it wasn’t just the Lich Kingdom, it was located in a distant place, in the old dynasty of the wrapped corpse race.<br/><br/>The Lair of the corpse-wrapping race was located in the territory of a desert. Numerous incomparably huge pyramids stood erect on the ground.<br/><br/>However, at this time, an incomparably terrifying devouring dragon directly caused a pyramid to collapse with a single claw.<br/><br/>Countless corpse-wrapping race expert disciples fled in all directions in terror.<br/><br/>Suddenly, the surrounding sand rose into the air, condensing into an incomparably huge divine dragon that attacked the surrounding corpse-wrapping race disciples.<br/><br/>The golden sand filled the sky, and endless terror descended on the wrapped corpse clan.<br/><br/>The miserable screams were incessant.<br/><br/>The chief of the wrapped corpse clan looked at this scene with despair on his face, and his whole body trembled violently.<br/><br/>“No, no, no, Dragon Palace, you will die a horrible death!”<br/><br/>They let out miserable and despairing roars and uttered useless curses.<br/><br/>The Devouring Dragon, which had been hidden in advance in the two forces, had completely become a nightmare for the two forces.<br/><br/>No one could escape from destroying the Dragon Palace.<br/><br/>On this day, the Lich Kingdom was destroyed!<br/><br/>The corpse-wrapping race was destroyed!<br/><br/>The steel union was still on the run!\t\t\t\t\t\t</div>", "images": {}, "success": true}