{"id": 360, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072621.html", "title": "Chapter 3351 - 3351 3,350 To Destroy The Three Forces, The World Was Shocked", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3351 - 3351 3,350 To Destroy The Three Forces, The World Was Shocked</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3351 3,350 to destroy the three forces, the world was shocked<br/><br/>The Dragon Palace landed on the heaven opening desolate continent!<br/><br/>The Lich Kingdom joined hands with the corpse-wrapping race and the iron and Steel Union, and the three forces besieged the Dragon Palace in the nine-origin deep pit.<br/><br/>This matter was the most important thing for all the forces surrounding Lu Xingkong and the edge of the heaven opening desolate continent.<br/><br/>However, no one dared to come and watch the battle between the four forces.<br/><br/>It was too vast and terrifying!<br/><br/>Only on the A.I. chip, countless people were discussing.<br/><br/>Two hours after the war broke out, the A.I. chip had already guessed that the war might have ended.<br/><br/>Some people guessed that the dragon palace had been completely suppressed.<br/><br/>Some people guessed that the Dragon Palace had already been broken through and that the dragon palace had been massacred.<br/><br/>Some people guessed that the Dragon Palace might have escaped.<br/><br/>There were all kinds of guesses and discussions.<br/><br/>But no one thought that the Dragon Palace was a match for the three forces.<br/><br/>The reason was that the three forces were too strong.<br/><br/>The strength displayed by the Dragon Palace was weaker than any one of the three forces.<br/><br/>With such strength, how could they fight against the three forces?<br/><br/>However, in the third hour of the discussion between the strong disciples of the three forces, something happened that shocked everyone.<br/><br/>The Phoenix Vein clan was a force at the edge of the heaven opening primal continent.<br/><br/>They weren’t far from the nine origin pit, only a few hours away.<br/><br/>More than ten hours ago, the battleships of the steel union had flown over the territory of their race.<br/><br/>However, at this moment, a warning sound came from the clan, and the defensive fire covered their nest.<br/><br/>The sound of explosions came from the front.<br/><br/>“What happened?”<br/><br/>The Phoenix Vein clan’s strong disciples flew to the sky.<br/><br/>Behind them, the battleships fell down with sparks.<br/><br/>The powerful dragons swayed their huge bodies and attacked from behind.<br/><br/>The Feng Wen clansmen’s jaws dropped when they saw this, their faces filled with disbelief.<br/><br/>“What… What’s happening? The steel union’s battleships are escaping, and the dragons are chasing after them?”<br/><br/>“Oh my God, look at those two dragons, their auras are terrifying, are they knights at level 9?”<br/><br/>“The Dragon Palace is chasing after the ship of the iron and Steel Union, the Dragon Palace is chasing after them!”<br/><br/>A shocked voice came from the Feng Wen clansmen.<br/><br/>They watched with their mouths Agape as the iron and steel union fled into the distance.<br/><br/>Behind them, the experts of the Dragon Palace continued to attack and Chase.<br/><br/>Along the way, all kinds of fighter airships fell.<br/><br/>Not long after, they saw four huge dragon palaces following closely behind them, collecting some of the fallen fighter airships.<br/><br/>The Phoenix patterns clan widened their eyes in shock.<br/><br/>Soon, this news was transmitted to the AI of the universe.<br/><br/>Not only were there oral messages, but there were also videos and images.<br/><br/>When the disciples of the races surrounding Lu Xing Kong and the edge of the land saw this result, their faces were filled with disbelief.<br/><br/>“This is unbelievable. The Dragon Palace is actually chasing after the steel union. Doesn’t that mean that the Dragon Palace has won this battle?”<br/><br/>“The three powers besieged the Dragon Palace, but they were chased by the Dragon Palace. If not for the videos, I wouldn’t have believed it. How could the Dragon Palace have such terrifying power?”<br/><br/>“The Dragon Palace actually has a knight level 9 warrior, this… This…”<br/><br/>“For more than a year, the Dragon Palace still couldn’t do anything to the Lich Kingdom. Now, after a year, they are chasing after the steel union to kill them. How did they improve so quickly?”<br/><br/>Countless disciple warriors were in an uproar, discussing among themselves.<br/><br/>No one had expected this outcome.<br/><br/>No one had expected that the three powers would lose.<br/><br/>No one had expected that the steel union would be hunted down by the Destruction Dragon Palace.<br/><br/>The Dragon Palace was too terrifying!<br/><br/>Even the steel union was being hunted down, what about the two powers, the Lich Kingdom and the corpse clan?<br/><br/>Did they escape?<br/><br/>Or were they destroyed?<br/><br/>On the AI, all the living beings were guessing again.<br/><br/>The battle at the Dragon Palace shocked all the powers.<br/><br/>“Two universe knights with level 9 battle power, damn it, how can there be such a great being in Dragon Palace, this is simply unreasonable!”<br/><br/>At the same time, in the Lich City of the Lich Kingdom, after the Lich Emperor escaped back to his god country, he came to the throne in the main palace.<br/><br/>The Great Beings of the Lich Kingdom who had escaped also rushed over one by one.<br/><br/>When they saw the information on the universe AI, their expressions were extremely unsightly.<br/><br/>At this moment, the Lich King’s breathing was a little hurried.<br/><br/>Two universe knights with level 9 combat strength were already enough to annihilate their lich kingdom.<br/><br/>Even if they escaped this time, they would face the Dragon Palace’s Revenge in the future.<br/><br/>What could they use to defend against it?<br/><br/>What was even more unbelievable was, why did two universe knights with level 9 combat strength suddenly appear from the Dragon Palace?<br/><br/>A year ago, they had gone to besiege the Dragon Palace. If there had been such a strong warrior in the Dragon Palace, their lich kingdom would have been finished long ago.<br/><br/>Back then, there hadn’t been one. How could they believe that two universe knights and Level 9 warriors had appeared in the past year?<br/><br/>“How many have we lost this time?”<br/><br/>Lich emperor asked with a gloomy face.<br/><br/>“Reporting to Lord Lich Emperor, only five universe knights and level 8 warriors have returned. About 40 level 7 warriors have died, and one-third of the disciples of the other warriors have been killed or injured, close to 2 million.”<br/><br/>A Lich reported in a low voice.<br/><br/>“Lord Lich King, now… What do we do now? Once that Dragon Palace warrior attacks, we won’t be able to defend!”<br/><br/>A Lich said with a dark expression.<br/><br/>Now that they had become enemies with the Dragon Palace, once the Dragon Palace warrior attacks, their lich kingdom would be unable to defend.<br/><br/>Now, they had to find a way out for themselves!<br/><br/>Hearing his subordinate’s words, the Lich King’s face kept changing.<br/><br/>“Huff! Huff!”<br/><br/>He took a deep breath, and there was a trace of powerlessness in his calm face. “Let’s talk about it. Then, let’s Find a place to hide!”<br/><br/>Now, they could only find a secret place to hide.<br/><br/>Like stray dogs.<br/><br/>Within the main hall, the warriors of the Lich Kingdom were silent, and they started to discuss.<br/><br/>And amongst the group of Lich Warriors, a universe Knight Level 7 warrior’s eyes gleamed, quietly waiting for the best time.<br/><br/>“Gather all the remaining elite disciples of the city, get them here immediately!”<br/><br/>Half an hour later, the Lich Emperor gave an order.<br/><br/>Next, they had to start their escape plan.<br/><br/>They had to find a secret place and hide.<br/><br/>After the order was given, the elites of the other eight cities in the Lich Kingdom quickly gathered.<br/><br/>At this moment, in a corner of the Lich City, a figure was watching everything with a smile on his face.<br/><br/>They could attack immediately!<br/><br/>Those who violated the Dragon Palace would die!\t\t\t\t\t\t</div>", "images": {}, "success": true}