{"id": 368, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072637.html", "title": "Chapter 3359 - 3359 Elf 2258", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3359 - 3359 Elf 2258</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3359 Elf 2258<br/><br/>Support Elf: not yet born<br/><br/>When the green fruit was hanging on the main trunk of the ancestral tree, a message was transmitted to Wang Xian’s mind.<br/><br/>When he saw this message, he was slightly stunned.<br/><br/>“Elf, this fruit is actually an elf?”<br/><br/>His mouth was slightly agape and his face was filled with astonishment.<br/><br/>The Elf race was one of the top races in the universe. The ancient Lake, Moon Bay, was a treasure belonging to the elf race.<br/><br/>Compared to the ancient Lake Moon Bay, the Elves were undoubtedly a precious treasure.<br/><br/>There were two kinds of elves. One was born with maternal instinct, and the other was born with the tree of life.<br/><br/>Compared to maternal instinct, the elves born with the tree of life were nobles among the elves.<br/><br/>The Tree of life was an innate treasure belonging to the elves. It was said to be the treasure closest to the heavenly creation level.<br/><br/>The Tree of life of the elf race could not only give birth to powerful elves, but also had other mystical abilities.<br/><br/>According to the records of the Dragon Palace, there was one among the few existences that were above the masters in the universe.<br/><br/>That person was the Heaven’s origin creation of the wood life, one of the strongest beings in the universe.<br/><br/>The elf race had cultivated the wood attribute to the peak.<br/><br/>What surprised Wang Xian was that he actually obtained a support elf.<br/><br/>Elves had both combat and support. There were very few support elites. Usually, only the royal family of the Elves had them.<br/><br/>Ordinary divine trees could not give birth to elves, but the ancestral tree was different.<br/><br/>Moreover, the potential of the elves nurtured by the ancestral tree was even stronger than the elites nurtured by the tree of life.<br/><br/>It was even more magical.<br/><br/>“The support elves are also known as the companion elves. Every support elf possesses powerful abilities. I wonder how strong they will be.”<br/><br/>Wang Xian mumbled.<br/><br/>Thump! Thump! Thump<br/><br/>At this moment, he felt his heart trembling. He felt something and some blood flowed into the ancestral tree.<br/><br/>Wang Xian’s eyes flickered as he looked at it. A smile appeared on his face.<br/><br/>After looking at it for a while, he looked at the other treasures.<br/><br/>There were many kinds of acquired spiritual treasures and many acquired Supreme Treasures.<br/><br/>Wang Xian placed the Tai Chi Dragon Plate on two acquired Supreme Treasures of darkness attribute for them to absorb.<br/><br/>He checked once and did not find any treasures in his eyes.<br/><br/>In the Dragon Palace, the rest of the disciples of the Dragon Palace were improving their strength in the dragon transformation pool.<br/><br/>The Devouring Dragon was devouring a large amount of metal.<br/><br/>The various battleships and spaceships of the steel union were able to improve significantly after being devoured by the devouring dragon.<br/><br/>This time around, Wang Xian was prepared to settle down at the edge of the heaven-opening primal continent.<br/><br/>At the very least, he had to understand the heaven-opening primal continent better before proceeding with the development.<br/><br/>Time passed day by day. This time, it took two months for all the members of the Dragon Palace to upgrade.<br/><br/>Two months later, the last batch of disciples had completed the upgrade.<br/><br/>Since then, over 1.9 million members of the Dragon Palace all had the combat strength of a universe knight.<br/><br/>Apart from Wang Xian, ao Xie, and the other five universe knights who had the combat strength of level 9,.<br/><br/>Xiao Lan, the other three, and the two devouring dragons had also advanced to level 9.<br/><br/>The rest of the leaders and the group of pure-bred dragons had the combat strength of Level 8 universe knights.<br/><br/>The number of Level 9 universe knights in the Dragon Palace had reached 10.<br/><br/>Two months later, the Five Elements Millstone underwent a transformation, and its strength rose by another level.<br/><br/>After all the members of the Dragon Palace Rose, Prime Minister Turtle ordered a group of civil officials to teach the members of the dragon palace all sorts of knowledge.<br/><br/>During this period, every day, other races from the heaven opening primal continent would come to visit the Dragon Palace and give them valuable treasures.<br/><br/>There were even a few races that weren’t weak, and they took out many treasures and bought the steel union, the wrapped corpse clan, and the grotto-heaven they occupied from the Dragon Palace.<br/><br/>These resources allowed the Dragon Palace to add two universe Knight Level 9 powerhouses.<br/><br/>Other grotto-heaven blessed lands aside, the steel union’s grotto-heaven blessed land was definitely a very powerful existence.<br/><br/>This was a pleasant surprise to the Dragon Palace.<br/><br/>Five years passed very quickly. During these five years, Wang Xian stayed in the Dragon Palace and played with a group of girls. He didn’t find it boring.<br/><br/>“Xiao Xian, look, the elf is about to be born!”<br/><br/>On this day, Hu Yan ‘er’s voice was heard.<br/><br/>“Huh?”<br/><br/>Wang Xian, who was in front of the Dragon Palace, was slightly stunned. His figure instantly arrived at the Dragon King’s Palace.<br/><br/>It had been five years since he obtained the support elf on the ancestral tree.<br/><br/>During these five years, he would occasionally suck some of Wang Xian’s dragon blood. From the shape of a fruit, he slowly transformed into a human shape.<br/><br/>However, the size of the support elf did not change at all. It was still only the size of two fists.<br/><br/>The female Elf had a fiery red dress and a purple hat on her head.<br/><br/>She was holding a gray branch in her hand. On the head of the branch, there was the flame of a fire Phoenix. It looked a little mystical.<br/><br/>In addition, she had wings made of leaves. She looked very cute.<br/><br/>However, today, the little elf opened her eyes and looked around curiously.<br/><br/>“Daddy!”<br/><br/>When she saw Wang Xian, her eyes lit up.<br/><br/>Crack! Crack<br/><br/>The part of the ancestral tree that was connected to the back was broken. She flapped her wings and flew toward Wang Xian immediately.<br/><br/>“Huh?”<br/><br/>Wang Xian smiled when he saw the palm-sized elf calling him Daddy.<br/><br/>“How cute. I’ll Call You Wang Lingling from now on!”<br/><br/>Wang Xian looked at her and reached out his palm to let her land on it. He said with a smile on his face.<br/><br/>“Sure, sure!”<br/><br/>Wang Lingling waved the magic wand in her hand.<br/><br/>“Wow, she’s so cute. Come, let mommy take a look!”<br/><br/>The girls who were attracted came over with shining eyes.<br/><br/>“Hehehe, Daddy, why do I have so many moms?”<br/><br/>Wang Lingling smiled and looked at the girls around her and asked in confusion.<br/><br/>“Because your father is a scumbag.”<br/><br/>Guan Shuqing and the others said with a smile.<br/><br/>“What is a Scumbag?”<br/><br/>Wang Lingling continued to ask curiously.<br/><br/>“Come here, Mommy will explain it to you!”<br/><br/>The group of girls stretched out their palms, their faces filled with love.<br/><br/>The group of girls was no longer young considering their age on Earth. They also wanted to have a child.<br/><br/>However, if the Dragon God wanted to have a child, it would require a long period of time.<br/><br/>Moreover, the purer the bloodline of both parents, the stronger the Dragon God would be.<br/><br/>After hesitating for a while, they still did not want to have a child for the time being.<br/><br/>Now that they saw such a cute little elf, the girls treated her like a child too.<br/><br/>“Initiation education is very important. You Can’t teach her like that!”<br/><br/>Wang Xian was at the side and said to them with a speechless expression.\t\t\t\t\t\t</div>", "images": {}, "success": true}