{"id": 374, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072649.html", "title": "Chapter 3365 - 3365 2264, On Top Of A Heaven’S Favorite", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3365 - 3365 2264, On Top Of A Heaven’S Favorite</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3365 2264, on top of a heaven’s favorite<br/><br/>“This type of thundercloud vulture is very suitable to be used as a mount!”<br/><br/>Wang Xian stared at the Thundercloud vulture that was flying at high speed on the right. His body moved and disappeared instantly.<br/><br/>Buzz<br/><br/>The next moment, he appeared in front of the Thundercloud vulture and a chain directly wrapped around it.<br/><br/>Chirp! Chirp<br/><br/>The Thundercloud Vulture didn’t have any power to resist and was easily bound by Wang Xian.<br/><br/>“CHIRP CHIRP CHIRP!”<br/><br/>The Thundercloud Vulture wasn’t very big. It was only about four meters long when it spread its wings. It looked at Chu Xian with a frightened expression.<br/><br/>“Over here, I heard the Thundercloud Vulture’s voice. Hurry Up!”<br/><br/>At this moment, a voice came from the void behind them. Wang Xian heard the voice and held the chain as he looked behind him.<br/><br/>“Eh?”<br/><br/>At the back, two elders flew over. They looked at Wang Xian as he restrained the Thundercloud Vulture. Their eyes flickered slightly.<br/><br/>“Who is this person? I wonder if you know that this is the territory of our Thunderlight Race?”<br/><br/>The two elders narrowed their eyes slightly and asked Wang Xian.<br/><br/>“I know!”<br/><br/>Wang Xian looked at them with a smile on his face. The next moment, his figure disappeared.<br/><br/>“Oh no, be careful!”<br/><br/>When the two old men saw Wang Xian disappearing instantly, their expressions changed drastically. They hurriedly shouted loudly.<br/><br/>Buzz<br/><br/>“Soul capture!”<br/><br/>However, at this moment, a voice sounded in their minds. Their bodies trembled slightly.<br/><br/>“We finally met the strong warriors of the Lightning Race!”<br/><br/>Wang Xian revealed a smile on his face and muttered. The two disciples of the Lightning race with the combat strength of a universe knight at level seven were instantly controlled by him.<br/><br/>Ten minutes later, Wang Xian opened his eyes. He hesitated for a moment before waving his arm. He erased the memories of the two of them and threw them into the position below.<br/><br/>Wang Xian didn’t kill them because he didn’t think these two fellows were bad.<br/><br/>He wouldn’t kill the innocent without any enmity.<br/><br/>“The great elder of the Thunder Ray race is in their lair. This is troublesome.”<br/><br/>Wang Xian mumbled.<br/><br/>According to the information he obtained, the great elder of the Thunder Ray race was in charge of the lair of the Thunder Ray Race to handle all matters.<br/><br/>Under the circumstance that the leader of the Thunder Ray race was not out, he was the person in charge.<br/><br/>The possibility of him infiltrating was zero.<br/><br/>Furthermore, from the two disciples of the Thunder Ray tribe, he learned that there were a total of eight top-notch universe knights of the Thunder Ray tribe.<br/><br/>Furthermore, they were good at speed. Even if two or three of them came, Wang Xian would not be their match.<br/><br/>I have to use other methods to get in<br/><br/>Wang Xian stood there and pondered.<br/><br/>This feels like a thief. However, that thunder feather was originally snatched by the great elder of the Thunder Ray tribe. I merely snatched it back<br/><br/>Wang Xian mumbled to himself as he thought of a solution.<br/><br/>From the memories of the two members of the Thunder Ray race, he obtained a method to blend in with the Thunder Ray race.<br/><br/>Ten days later, the Thunder Ray race would be recruiting disciples to the outside world.<br/><br/>As long as one was within the age of 20 eras and passed the assessment, one could join the Thunder Ray race.<br/><br/>The Age was the division of age in the heaven-opening and primal continent.<br/><br/>Because there were many places in the heaven opening primal continent that didn’t have day and night, the calculation of age was different from other places in the universe.<br/><br/>One era represented 100,000 years, while the 20th era was two million years.<br/><br/>The Heaven Opening Primal Continent didn’t have a sun or moon. Usually, an expert entering seclusion once could last for a million years.<br/><br/>As for the 20th era, for the heaven opening primal continent, it could be done with the snap of a finger.<br/><br/>One could interpret it this way. 20-odd Yuan was equivalent to the age of 20 for most living beings.<br/><br/>That was when they were young.<br/><br/>Of course, this was just a division of Wang Xian himself.<br/><br/>In fact, there were many old monsters who had lived for billions of years or even tens of billions of years in the heaven-opening primal continent.<br/><br/>However, 30-odd billion years was the end point.<br/><br/>If one wanted to live for more than 30 billion years, he would need to possess the strength of the Heaven’s fate.<br/><br/>Furthermore, 30 billion years was a calamity.<br/><br/>At Wang Xian’s current age, he was basically at the age of drinking milk in the heaven-opening primordial land.<br/><br/>Naturally, this age restriction had nothing to do with him.<br/><br/>Age Isn’t a problem, but it doesn’t seem to be that easy to sneak in with my current strength<br/><br/>Wang Xian pondered.<br/><br/>With his current strength, even if he hid it, he could be detected with the strength of the Lightning race.<br/><br/>Once he was discovered, he would definitely be surrounded and attacked.<br/><br/>“This is a treasure!”<br/><br/>After thinking for a few minutes, he moved his hand and took out a silver-white metal.<br/><br/>This metal could isolate everything. At the same time, it could also isolate him from the outside world.<br/><br/>This was an extremely useless thing. It was very strong, but it was also very weak.<br/><br/>He placed this metal into his body. With a thought, the metal covered his entire body.<br/><br/>Very soon, from the outside world, Wang Xian’s aura was decreasing rapidly.<br/><br/>However, his body was slowly covered by lightning.<br/><br/>Wang Xian now had 22 lightning feathers. He could still control the power of lightning.<br/><br/>Coupled with the isolation of this silver-white metal, he could not isolate the power of his physical body.<br/><br/>He used the silver-white metal to isolate the other eight attributes in his body, leaving only the Thunder attribute that he had yet to fully grasp.<br/><br/>This caused his power to be reduced to the level of a universe knight at level six.<br/><br/>He could unleash all of his power, but once he unleashed it, it would mean that his power had been leaked.<br/><br/>If he only used the Thunder attribute, it would be impossible for him to be detected.<br/><br/>“His strength is still a little strong. However, the power of his physical body can not be concealed by the silver-white metal here. So Be it if he is a universe knight at level six!”<br/><br/>Wang Xian mumbled.<br/><br/>From birth until the 20th century, he already possessed the combat strength of a universe knight at level six. This was definitely considered as a top heaven’s favorite in the heaven-opening primal continent.<br/><br/>Perhaps only the descendants of some races could do it.<br/><br/>It was impossible for ordinary cultivators to achieve this.<br/><br/>However, he had no other choice. When the time came, he just had to get close to the great elder of the Thunder Ray race and escape as soon as he got hold of Lei Yu.<br/><br/>“How troublesome!”<br/><br/>Wang Xian smiled and flew directly towards the Sky Thunder City.<br/><br/>The recruitment of disciples by the Thunder Ray race was held in the Sky Thunder City. All he had to do was to wait in the city.<br/><br/>After flying back to the Sky Thunder City, Wang Xian found a luxurious villa and rented it.<br/><br/>“If you want to act like one, then act like one. Tame this thunder cloud vulture!”<br/><br/>Lying in front of the swimming pool, Wang Xian summoned the Thunder Cloud Vulture and tamed it.<br/><br/>Taming a thunder cloud vulture with the combat strength of a universe knight at level six was an easy task for him.<br/><br/>“CHIRP CHIRP CHIRP!”<br/><br/>Very soon, this thunder cloud vulture lay respectfully beside Wang Xian.<br/><br/>This time, it pretended to be a proud son of heaven and blended into the inner circle of the Thunder Ray race. Hopefully, there wouldn’t be any accidents. Otherwise, he would have to change his method.<br/><br/>Wang Xian thought to himself as his eyes sparkled. He was waiting for the time to come!\t\t\t\t\t\t</div>", "images": {}, "success": true}