{"id": 372, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072645.html", "title": "Chapter 3363 - 3363 2,262 People Were Like Dragons", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3363 - 3363 2,262 People Were Like Dragons</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3363 2,262 people were like dragons<br/><br/>“I am Dongwen Mountain of Haotian City. Thank you for your help, Brother!”<br/><br/>“I am Haokong Yan of Haotian City. Thank you for your help, Brother!”<br/><br/>The other two elders flew over and cupped their hands at Wang Xian with a smile on their faces.<br/><br/>“Wang Xian!”<br/><br/>Wang Xian cupped his hands at them. “You’re welcome. I just happened to be passing by!”<br/><br/>“Brother Wang Xian, are you from the ancestral dragon lineage? Your attack seems to be similar to the ancestral dragon lineage!”<br/><br/>Scholar Fang asked Wang Xian curiously.<br/><br/>“The ancestral dragon lineage?”<br/><br/>Wang Xian was stunned for a moment before he shook his head and asked curiously, “No, the ancestral dragon lineage is in this area?”<br/><br/>“Yes and no. Nowadays, the experts from the ancestral dragon lineage are traveling around. I only saw that your attack has the charm of a divine dragon, brother Wang Xian.”<br/><br/>Scholar Fang said with a smile.<br/><br/>“Brother Wang Xian, without your help this time, we wouldn’t have been able to kill the muscle-headed snake. Brother Wang Xian, why don’t you take half of the resources from the muscle-headed snake?”<br/><br/>The elder called Dongwen Mountain said to Wang Xian.<br/><br/>“Sure!”<br/><br/>Wang Xian nodded. Half of the spoils of war was not a small amount.<br/><br/>“Let’s get our men to deal with the corpses. Brother Wang Xian, where are you planning to go?”<br/><br/>Scholar Fang continued to ask Wang Xian.<br/><br/>“I’m going to take a look around. I’m going to settle some matters with the Lightning race.”<br/><br/>Wang Xian smiled and said.<br/><br/>“Oh? The lightning race is still a long way from here. Brother Wang Xian, you can use the teleportation formation to travel from our Heavenly City!”<br/><br/>Scholar Fang said.<br/><br/>Wang Xian nodded his head.<br/><br/>“Haha, Alright. Brother Wang Xian, please board the ship!”<br/><br/>Scholar Fang invited him.<br/><br/>Wang Xian didn’t reject him. He followed him and flew towards the ship.<br/><br/>“I think scholar Fang’s attack method is rather unique. Does this belong to you?”<br/><br/>Wang Xian came to a hall on the ship and asked after a moment of hesitation.<br/><br/>“Attack method? “This is a cultivation method that belongs to the lineage of the Saints. The lineage of the Saints is similar to the lineage of the Wizards in terms of formations and formations. However, there are some differences. Saint Hetian once said that everyone in the world can become a saint. I hope that one day, I will be able to reach that stage. I hope that I will be able to walk on the path of the morning and die in the evening!”<br/><br/>Fang Wensheng’s eyes flickered as he spoke.<br/><br/>“The sage of unity.”<br/><br/>Wang Xian mumbled.<br/><br/>The sage of unity was the strongest existence in the lineage of saints. He was also one of the invincible powerhouses in the universe.<br/><br/>“Haha, the one I admire the most in my life is the sage of unity. The one I admire the most is the leader of the ancestral dragon lineage.”<br/><br/>Scholar Fang laughed out loud.<br/><br/>“The leader of the ancestral dragon lineage?”<br/><br/>Wang Xian mumbled.<br/><br/>“Brother Wang Xian, how long have you been in seclusion?”<br/><br/>Scholar Fang saw his puzzled expression, he smiled and said, “The leader of the ancestral dragon lineage is also a hero of his generation. He said that everyone can be like a dragon, and all living things can become dragons. If this leader can break through to the realm of the ruler of the universe, the divine dragon lineage might really be able to reach the peak under his leadership.”<br/><br/>“Everyone can be like a dragon, and all living beings can become dragons.”<br/><br/>When Wang Xian heard these words, his heart was slightly shaken.<br/><br/>“Brother Wang Xian, this is half of the resources of the muscular head snake. You can take a look!”<br/><br/>Not long after, haokong Yan walked over and handed him an interspatial ring.<br/><br/>“Alright!”<br/><br/>Wang Xian took it and took a look. He nodded his head.<br/><br/>“Brother Wang Xian, this is the good wine of our heavenly city. There are also some delicacies. Let’s go and have a drink on the deck!”<br/><br/>After settling the resources of the muscular-headed snake, scholar Fang gestured to Wang Xian.<br/><br/>“Alright!”<br/><br/>Wang Xian smiled and nodded his head.<br/><br/>Since it was his first time here, Wang Xian had many things that he needed to understand.<br/><br/>The ship sailed towards heavenly city.<br/><br/>Haotian city was a city that was close to the ocean.<br/><br/>This city was founded by an expert from the saint’s lineage. That expert had the strength of a peak universe knight.<br/><br/>Now that it had fallen, his descendants and disciples controlled this city.<br/><br/>The saint’s lineage was a race at the peak of the universe in the universe.<br/><br/>The body of a saint and the method of a saint. This was the reason why they were able to stand at the peak of the universe.<br/><br/>From scholar Fang, Wang Xian obtained a lot of information that he couldn’t get from the AI.<br/><br/>For example, the specific situation of the saint lineage.<br/><br/>The saint lineage usually passed down the method of inheritance, which was passed down from generation to generation.<br/><br/>The restrictions they placed on their own disciples weren’t very high. Many of the saint lineage would even travel far away after their master died, leaving the saint lineage.<br/><br/>This also caused the disciples of the Saints’lineage to disperse to many places in the heaven-opening primal continent.<br/><br/>Apart from the Saints’lineage, Wang Xian asked around for information about the divine dragon lineage.<br/><br/>The ancestral dragon and the Holy Dragon Clan.<br/><br/>The current leader of the ancestral dragon lineage had long reached the peak of the Universe Knight Realm.<br/><br/>He even had the battle record of killing a universe dominator with combat strength.<br/><br/>His potential was endless. However, he had not been able to take the final step and step into the universe overlord realm for a long time at this realm.<br/><br/>This also caused the leader of the ancestral dragon to give an order. All the disciples of the ancestral dragon lineage would go out to travel and all of them would undergo experiential training.<br/><br/>One day, if any of the members of the divine dragon lineage could step into the universe overlord realm, all the disciples of the ancestral dragon lineage would return and rebuild the glory of the Divine Dragon lineage.<br/><br/>When Wang Xian received this information, his heart was slightly shaken.<br/><br/>As long as the ancestral dragon lineage did not have the realm of the universe’s ruler, the disciples of the ancestral dragon lineage would not return for a day.<br/><br/>This was equivalent to breaking up an entire faction just to pursue the peak.<br/><br/>“This ancestral dragon is really bold.”<br/><br/>Wang Xian mumbled. He was very respectful of his actions.<br/><br/>It would be useless if he didn’t reach the peak.<br/><br/>What surprised Wang Xian was that there were more than 200 pure-blooded divine dragons in the ancestral dragon lineage.<br/><br/>This was mainly due to the accumulation of hundreds of millions of years of development. Pure-blooded divine dragons were born from the marriage of pure-blooded divine dragons.<br/><br/>Although there were more than 200 of them, it was incomparable to the peak of the Divine Dragon Clan.<br/><br/>There were hundreds of thousands of pure-blooded divine dragons in the peak of the Divine Dragon Clan.<br/><br/>“Currently, the Divine Dragon of light is the main clan of the Divine Dragon Clan. All of them have joined the Angel clan. It is said that the Divine Dragon King is the Mount of one of the sons of the father of the Angels!”<br/><br/>Scholar Fang told Wang Xian some of the information he knew.<br/><br/>When he received this news, his heart was filled with mixed feelings.<br/><br/>There were seniors of the Divine Dragon Clan who dispersed their clan members in order to rebuild the Divine Dragon’s glory. They would not return until they became the ruler.<br/><br/>There were also powerhouses of the Divine Dragon Clan who joined the top races in the universe and became their divine beasts.<br/><br/>There were two completely different choices and two completely different paths.<br/><br/>“Everyone should be like a dragon. All living beings can become dragons. If there’s a chance, I must have a drink with the leader of the ancestral dragon.”<br/><br/>Wang Xian thought to himself and smiled.<br/><br/>He raised his glass and toasted scholar Fang and the rest before drinking it down.\t\t\t\t\t\t</div>", "images": {}, "success": true}