{"id": 378, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072657.html", "title": "Chapter 3369 - 3369 2268 Was Surprisingly Easy To Obtain", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3369 - 3369 2268 Was Surprisingly Easy To Obtain</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3369 2268 was surprisingly easy to obtain<br/><br/>Acquired Supreme Treasures were considered very powerful treasures even in the Open Heaven Primal Continent.<br/><br/>Among the disciples of the Thunder Light race, only a handful had acquired supreme treasures.<br/><br/>However, the great elder of the Thunder Light Race had agreed to give him a acquired supreme treasure as long as he won.<br/><br/>This made him feel a little awkward. He was here to snatch the item today.<br/><br/>“Sure!”<br/><br/>However, it was impossible for Wang Xian to refuse at this moment. He nodded his head lightly and a glimmer of light flashed in his eyes.<br/><br/>“This new disciple, please give me some advice!”<br/><br/>Lei Zhengfa was not careless. He was not weak since he could suppress the Thundercloud vulture.<br/><br/>Moreover, he could tell a thing or two from the first elder’s attitude.<br/><br/>“Please advise me!”<br/><br/>Wang Xian moved his palm and kept the Thundercloud vulture. His body shook and an incipient saint wings appeared on his back.<br/><br/>Only the Lightning attribute incipient saint wings appeared. It looked very strange. On the other side, Wang Xian used the power of lightning to form a pair of lightning wings.<br/><br/>“Eh? This Is?”<br/><br/>At this moment, the first elder who was standing at the front saw the uninitiated holy wings behind Wang Xian. His body trembled violently and his eyes glowed.<br/><br/>He pondered for a moment and watched silently.<br/><br/>“Eh? Should he use the Thundercloud Vulture to spar one-on-one? He’s so confident!”<br/><br/>When the surrounding disciples of the Thunder Ray race saw this scene, their eyes focused and their faces revealed a look of astonishment.<br/><br/>“This guy’s strength should be at level six universe knight. How is this possible? He is not even 20 eras old. This is impossible…”<br/><br/>Lei Zhengyun shook his head and his face was filled with disbelief.<br/><br/>At such a young age and with such strength, he should be extremely powerful among those peak races, right?<br/><br/>“Be careful!”<br/><br/>Lei Zhengfa moved his body and lightning flashed on his body. He charged directly at Wang Xian.<br/><br/>Wang Xian’s eyes focused. He was using the metal to conceal his eight attributes and eight types of energy.<br/><br/>At this moment, he naturally could not reveal his full strength.<br/><br/>Wang Xian moved his palm. The lightning condensed into a dragon claw and grabbed forward.<br/><br/>“Good, I really didn’t expect to be able to spar with such a heaven’s favorite today!”<br/><br/>Lei Zhengfa sensed Wang Xian’s attack and laughed out loud. A thunder hammer and a thunder awl appeared in his hand.<br/><br/>Crack! Crack<br/><br/>The Thunder Hammer struck the thunder awl and a bolt of lightning struck toward the Thunder Dragon Claw.<br/><br/>Crack! Crack! Crack<br/><br/>The sound of collision rang out.<br/><br/>Wang Xian moved his hand, and a bolt of lightning appeared in his hand.<br/><br/>This bolt of lightning was obtained from the Thunder Cloud. It belonged to a acquired Numinous Treasure.<br/><br/>“Kill!”<br/><br/>He waved his arm, and the Lightning covered this bolt of lightning. It slowly transformed into a thunder dragon, swaying its huge body as it headed straight for Lei Zhengfa.<br/><br/>“Hiss, that disciple is so strong. He has just joined our thunder ray race and hasn’t even reached the age of the 20th epoch yet, but he’s already so strong. This is too terrifying!”<br/><br/>“Is… is he still human? Even a monster wouldn’t be so monstrous. Such strong strength!”<br/><br/>When the surrounding disciples saw the collision between Wang Xian and Lei Zhengfa, their faces were filled with shock.<br/><br/>Lei Zhengfa was their senior brother. He could be ranked among the top in the Thunder Ray race.<br/><br/>“This… This young man’s means…”<br/><br/>Beside the chief elder of the Thunder Ray race, the old man stared at Wang Xian and mumbled.<br/><br/>“Divine Dragon. It’s very similar to the attack of the divine dragon lineage. This isn’t his true form. His true form should be a divine dragon.”<br/><br/>A glint flashed across the eyes of the chief elder as he spoke.<br/><br/>“Divine dragon lineage? Is he the disciple of the ancestral dragon? It’s highly possible. With such talent and strength, other than the top-tier races, there aren’t many disciples from high-tier races who are as outstanding as him. The disciples of the ancestral dragon are going to join our lightning race?”<br/><br/>The elder beside him said in surprise.<br/><br/>“That’s not impossible. Now, that leader of the ancestral dragon has scattered all his disciples and made them pursue ten thousand techniques. As long as there isn’t a universe overlord, and as long as the disciples of the ancestral dragon don’t gather, there’s a precedent for the disciples of the ancestral dragon to join other powers.”<br/><br/>The first elder said.<br/><br/>The ancestral dragon lineage was now called the Orthodox lineage of the divine dragon lineage. and the leader of the ancestral dragon lineage also made many great beings revere him.<br/><br/>The ancestral dragon lineage had many great beings and geniuses.<br/><br/>Those pure-bred divine dragons and peak dragon species were all comparable to the talents of peak races.<br/><br/>And some disciples of the ancestral dragon lineage, in order to pursue greater power, in order to follow the leader, and in order to pursue the universe ruler realm, some disciples of the ancestral dragon lineage joined other factions.<br/><br/>The other powers didn’t refuse. Firstly, the disciples of the ancestral dragon lineage were indeed outstanding. Secondly, regardless of whether or not a universe ruler was born in the ancestral dragon lineage in the future, there were only benefits and no disadvantages for these powers.<br/><br/>If a universe ruler was born in the ancestral dragon lineage, and the disciples of the ancestral dragon lineage returned, their race would be related to a pinnacle race because of this disciple.<br/><br/>The ancestral dragon lineage did not have a universe overlord. Their race would have a great being with the bloodline of the Divine Dragon for no reason. Why Not?<br/><br/>“Then for such a disciple, we…”<br/><br/>The old man looked at Wang Xian and said.<br/><br/>“Nurture him, nurture him vigorously. I will report this matter to the clan leader and the rest later.”<br/><br/>The chief elder of the Thunder Ray race said with a smile.<br/><br/>The elder nodded his head.<br/><br/>“Zhengfa is going to lose. Zhengfa shouldn’t fight him in close combat. The physical body of the divine dragon is not something our thunder ray tribe can compare to!”<br/><br/>The chief elder looked ahead and said!<br/><br/>“Bang!”<br/><br/>A violent collision sound was heard from the front.<br/><br/>Wang Xian’s arm was covered in dragon scales. He clenched his fist and collided with Lei Zhengfa.<br/><br/>A powerful force charged towards Lei Zhengfa.<br/><br/>Sensing this force, his breathing stopped. His body couldn’t help but fly backward.<br/><br/>“Clap, clap, Clap!”<br/><br/>The next moment, bolts of lightning exploded around Lei Zhengfa. This caused his expression to change slightly.<br/><br/>“Huff, Huff, I lost!”<br/><br/>Lei Zhengfa looked at Wang Xian with a complicated expression and said with a disappointed expression.<br/><br/>“This… senior brother Lei Zhengfa actually lost!”<br/><br/>All the disciples of the Lightning race were dumbfounded. He lost just like that?<br/><br/>Their senior brother was defeated by a new disciple?<br/><br/>“Good, good. He has a very strong divine dragon body and a very strong control of lightning techniques. What is the name of this disciple?”<br/><br/>The great elder stood up, clapped his hands and said loudly.<br/><br/>“Wang Xian!”<br/><br/>Wang Xian’s eyes flickered slightly as he replied.<br/><br/>“Wang Xian? Very good. You have defeated a powerful senior brother. I will fulfill my promise and reward you with a acquired treasure. However, I will give you a choice!”<br/><br/>As the great elder spoke, he narrowed his eyes slightly.<br/><br/>“Please tell me, Great Elder.”<br/><br/>Wang Xian cupped his hands.<br/><br/>“I have a part of a treasure here. You should have a part of it with you. If you are sincere enough to join my lightning race, I can give it all to you!”<br/><br/>As the great elder spoke, he moved his palm and numerous lightning feathers appeared in his hand.<br/><br/>“Eh? This…”<br/><br/>Wang Xian gaped slightly when he saw this scene.<br/><br/>What the F * ck, was it that Easy?<br/><br/>This was totally out of the ordinary!<br/><br/>Initially, Wang Xian had planned to take the wings off the great elder of the Lightning race by surprise and bring him away.<br/><br/>However, he decided to flee immediately. He even thought of a way to escape.<br/><br/>He thought of how to deal with the attack of the powerful warriors of the Thunder Ray tribe.<br/><br/>However, he did not expect the great elder of the Thunder Ray tribe to gift it to him directly. This was way beyond his expectations!\t\t\t\t\t\t</div>", "images": {}, "success": true}