{"id": 379, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072659.html", "title": "Chapter 3370 - 3370 Surprisingly, 2269 Was Obtained Easily", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3370 - 3370 Surprisingly, 2269 Was Obtained Easily</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3370 Surprisingly, 2269 was obtained easily<br/><br/>27 thunder feathers were floating in front of the chief elder of the Thunder Ray tribe.<br/><br/>Wang Xian could feel the restless movement of the uninitiated holy wings in his body.<br/><br/>He looked at the 27 thunder feathers and frowned slightly.<br/><br/>The thunder feathers were within his reach. However, the chief elder of the Thunder Ray tribe offered a condition.<br/><br/>He had to join the Thunder Ray tribe Sincerely.<br/><br/>As the leader of the Dragon Palace, how could he join the Thunder Ray Tribe?<br/><br/>However, the other party didn’t show any disgust. If he directly took it, he would feel sorry.<br/><br/>“I know your hesitation, and I know that you are a disciple of the ancestral dragon tribe. Once the ancestral dragon tribe needs you, you will leave. It doesn’t matter. If one day you decide to quit the Thunder Ray tribe, you can quit right away. As long as you remember the kindness of the Thunder Ray tribe, it will be enough<br/><br/>“Join Our Thunder Ray tribe and we will not mistreat you!”<br/><br/>The great elder of the Thunder Ray tribe suddenly spoke again.<br/><br/>“HMM?”<br/><br/>Wang Xian was slightly stunned when he heard his words.<br/><br/>What was going on?<br/><br/>Did he think of himself as a disciple of the ancestral dragon lineage?<br/><br/>This… He could leave at any time as long as he remembered this favor?<br/><br/>Wang Xian’s mind was filled with thoughts as he instantly thought of many things.<br/><br/>“What? He is actually a disciple of the ancestral dragon lineage?”<br/><br/>“Is he a divine dragon? No wonder, no wonder he is so powerful. To possess such strength at such a young age, he must be one of the top heaven’s favorites in the ancestral dragon lineage, right?”<br/><br/>“Is he a divine dragon? A purebred divine dragon? A Lightning Dragon?”<br/><br/>When all the Lightning race disciples heard the first Elder’s words, they were discussing in shock.<br/><br/>“He is the Divine Dragon? No wonder his attack just now was similar to the attack of the Divine Dragon Tribe.”<br/><br/>“Alright. I, Wang Xian, will never forget the kindness of the Thunder Ray Tribe!”<br/><br/>When Wang Xian heard his words, he did not hesitate and agreed immediately.<br/><br/>Since the other party had mistaken him for a disciple of the ancestral dragon tribe, he would just accept his mistake.<br/><br/>As long as he remembered this favor, it would be fine.<br/><br/>These 27 thunder feathers were extremely important to him. Since the other party wanted to gift them to him in this way, Wang Xian would owe him this favor.<br/><br/>He would repay the favor in the future.<br/><br/>“Haha, Good, good. Wang Xian, right? Welcome to join our Thunder Ray tribe. You are the first person with the Divine Dragon bloodline to join our Thunder Ray tribe. This is your reward.”<br/><br/>The great elder of the Thunder Ray tribe laughed out loud. With a wave of his arm, he threw the 27 thunder feathers to him.<br/><br/>When Wang Xian saw the 27 thunder feathers, his eyes were filled with excitement. He immediately stretched out his hand and took them.<br/><br/>The last part of the Genesis Wings had finally been found.<br/><br/>Furthermore, Wang Xian realized that these thunder feathers were nurtured by the great elder of the Thunder Ray tribe. Each of them was comparable to acquired Numinous Treasures.<br/><br/>Twenty-seven thunder feathers were comparable to twenty-seven acquired Numinous Treasures.<br/><br/>After he nurtured them, he would be able to completely restore the incipient holy wings.<br/><br/>When that time comes, he wondered what kind of radiance would the incipient holy wings be able to emit?<br/><br/>After possessing nine attributes, how could he unleash such strength?<br/><br/>His eyes were sparkling as he kept all the Thunder Feathers.<br/><br/>“Thank you, Great Elder!”<br/><br/>Wang Xian immediately thanked him with a smile on his face.<br/><br/>This was a sincere gratitude.<br/><br/>“No need. You deserve it. As the heaven’s favored son of our thunder ray tribe, Our Thunder Ray tribe will give you various rewards. With your strength, you can enter the inner sect directly. I will bring you to a mansion where you will live in the future.”<br/><br/>The great elder waved his hand. He was in a good mood.<br/><br/>“Yes!”<br/><br/>Wang Xian smiled and stood at the side.<br/><br/>“You guys make the arrangements for the rest. Wang Xian, follow me!”<br/><br/>The great elder instructed the experts of the Thunder Ray race. He looked at Wang Xian and gestured for him to follow him.<br/><br/>Wang Xian nodded and followed behind him immediately.<br/><br/>“I didn’t expect the disciples of the ancestral dragon lineage to join our Thunder Ray race. Moreover, the great elder seems to be very happy!”<br/><br/>“Of course. This is beneficial to us without any harm. If that Wang Xian is a purebred divine dragon, if he marries a female disciple of our thunder ray tribe in the future, he will give birth to a dragon seed. If he gives birth to a peak dragon seed, our thunder ray tribe will be rich!”<br/><br/>“Eh… The Great Elder might not even think as much as you do, right?”<br/><br/>“Hehe, I don’t think so. However, this Wang Xian is really powerful. To possess such strength at such a young age, he will be our senior brother in the future!”<br/><br/>After the great elder left, some of the senior disciples of the Lightning race whispered to each other when they saw this scene.<br/><br/>They had some guesses about the great elder’s actions.<br/><br/>Wang Xian, who had just left behind the great elder of the Lightning race, heard some voices behind him and his face turned black.<br/><br/>Such a possibility seemed to be possible.<br/><br/>He shook his head and threw it to the back of his mind. The main reason why he came to open up the heaven and desolation continent was for Lei Yu.<br/><br/>It was a pleasant surprise for him to obtain such a smooth reward.<br/><br/>“Come here, Wang Xian. This is a thundercloud where the inner sect disciples live. There is a blessed land in this thundercloud called the Thunder Mountain. The Thunder Energy released by the Thunder Mountain has a corporeal form and is extremely beneficial to the cultivation of the Thunder technique. The closer you are to the top of the Thunder Mountain, the more beneficial it is to the cultivation of the Thunder technique.”<br/><br/>The great elder brought Wang Xian to a thundercloud. In this Thundercloud, there was a purple thunder mountain peak.<br/><br/>This thunder mountain peak was very strange. It was not suspended in the air but connected to the land below.<br/><br/>This was a powerful blessed land.<br/><br/>Just the place where the disciples lived was located in the blessed land. One could imagine the strength of the Thunder race.<br/><br/>“There is an empty palace at the top. You can stay here in the future.”<br/><br/>The great elder said to Wang Xian.<br/><br/>“Okay!”<br/><br/>Wang Xian looked over and nodded. This palace was close to the top and was considered an excellent location in the grotto-heaven blessed land.<br/><br/>However, Wang Xian didn’t care about this. He planned to return to the Dragon Palace first to completely refine lei yu.<br/><br/>“I’ll bring you to some important places of the Thunder Ray tribe so that you can get to know them.”<br/><br/>The great elder continued to speak to him and brought him to take a look at the other places of the Thunder Ray tribe.<br/><br/>There was the treasure house of the Thunder Ray tribe, the Blessed Land of the ascending thunder peak for the Disciples’trial, and the main hall of the Thunder Ray tribe.<br/><br/>Every place represented a blessed land. Wang Xian did a rough calculation. Just the places that the great elder of the Thunder Ray tribe brought him to, there were already more than ten blessed lands.<br/><br/>This also allowed Wang Xian to witness the power of the tribes in the heaven-opening and primal continent.<br/><br/>After all, the Dragon Palace currently only occupied a paradise.<br/><br/>“These are some rules and precautions for the Thunder Ray tribe. Take a look first. Three days later, there will be disciples coming to look for you. All of you should get to know each other!”<br/><br/>Before the chief elder left, he passed a jade slip to Wang Xian.<br/><br/>“Alright, Great Elder!”<br/><br/>Wang Xian nodded and watched him leave.<br/><br/>“Forget it. I’ll stay here for a period of time to understand more about the inner parts of the heavenly desolate continent.”<br/><br/>After staying for more than ten seconds, he smiled and entered his own hall.\t\t\t\t\t\t</div>", "images": {}, "success": true}