{"id": 371, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072643.html", "title": "Chapter 3362 - 3362 The 2,261 People Were Like Dragons", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3362 - 3362 The 2,261 People Were Like Dragons</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3362 The 2,261 people were like dragons<br/><br/>Boom<br/><br/>A dull and loud sound was heard. The tail that was attacking Wang Xian was defeated in one move.<br/><br/>“What!”<br/><br/>“That young man is an expert!”<br/><br/>“Hiss, what a strong strength!”<br/><br/>At the front, the people on the ship were shocked when they saw the attack from the muscle-headed snake was defeated.<br/><br/>They looked at Wang Xian with astonishment in their eyes.<br/><br/>“This is bad. This fellow is a little strong. It will be difficult to kill him!”<br/><br/>“We have underestimated his strength!”<br/><br/>At this moment, the middle-aged man in front of them who was holding a black writing brush and writing the word “Kill”in the air was drenched in cold sweat. He shouted with an embarrassed expression.<br/><br/>“Damn it, if we can’t kill him this time, we won’t have a Chance!”<br/><br/>There were over 10,000 sharp swords flying behind an old man not far away. The sharp sword in the middle was even sharper. It was at least a acquired treasure.<br/><br/>The three universe knights with level 9 combat strength were all extraordinary, but they still couldn’t do anything to the muscular-headed snake!<br/><br/>“Sir, are you interested in fighting? When the time comes, you will get a share of the spoils of war.”<br/><br/>On the ship, when everyone saw that the three of them could not do anything to the muscular-headed snake, their expressions changed slightly. An elder hesitated for a moment before looking at Wang Xian and said.<br/><br/>“Oh? Other than its corpse, what other treasures does the muscular-headed snake have? Moreover, such a powerful desolate beast is not easy to kill.”<br/><br/>Wang Xian raised his eyebrows and asked.<br/><br/>In the ocean, he had encountered at least ten universe knight level nine desolate beasts. However, only one of them died in his hands.<br/><br/>That one was caught off guard and was killed by luck.<br/><br/>The rest were all allowed to escape back to their own divine kingdom.<br/><br/>Since Wang Xian’s speed was so difficult to kill, this muscle-headed snake in front of him was even more difficult to kill.<br/><br/>Even if he were to make a move, he wouldn’t be able to stop it from escaping.<br/><br/>“Sir, this muscular head snake’s lair is on that deserted island. The other thirteen heads of this muscular head snake can be forged into an acquired treasure. Its fresh blood can also be used to create powerful talismans!”<br/><br/>The old man continued, “If sir is willing to make a move, the three of us will definitely take revenge!”<br/><br/>“Is the lair here?”<br/><br/>Wang Xian’s eyes sparkled when he heard the old man’s words.<br/><br/>“Sure!”<br/><br/>Wang Xian moved his body and stretched out his arm. He condensed a grayish dragon claw and attacked the muscular-headed snake.<br/><br/>He took action partly for the muscular-headed snake and partly for this group of people.<br/><br/>He had been traveling in the ocean for more than a year now. Now that he had finally infiltrated the humans, he naturally had to gather some information.<br/><br/>He wanted to familiarize himself with the inner workings of the heaven-splitting primordial land.<br/><br/>“Thank you for your help, brother. Let’s Join Hands and kill this beast!”<br/><br/>At the front, the three experts from Haotian City had already received a voice transmission from their subordinates the moment Wang Xian made his move.<br/><br/>They swept their gaze over and looked a little excited.<br/><br/>“You guys hold off a portion of its head. I’ll kill the rest!”<br/><br/>Wang Xian’s Dragon Claw attacked forward and was defeated by the two snake heads. He squinted his eyes and shouted softly.<br/><br/>“HMM?”<br/><br/>“Alright!”<br/><br/>The three people from Haotian City were stunned for a moment. They hesitated for a moment before nodding their heads.<br/><br/>No matter what, they only needed to hold down the few snake heads that they could hold down.<br/><br/>This would not affect their safety.<br/><br/>Crash<br/><br/>The muscular-headed snake had thirteen snake heads. The snake heads were its main attack method. The three of them could pin down the nine snake heads.<br/><br/>The next four snake heads were easy for Wang Xian.<br/><br/>He flapped his incipient saint wings. His body instantly streaked across a shadow and arrived above one of the snake heads.<br/><br/>Hiss! Hiss! Hiss<br/><br/>The snake head sensed that Wang Xian was above it. It immediately opened its mouth and a water sword shot into the sky.<br/><br/>Splash<br/><br/>Wang Xian’s figure flashed and appeared in front of the other snake head in an instant.<br/><br/>Before the other snake head could react, Wang Xian’s arm turned into a dragon claw and grabbed towards the area below the snake head.<br/><br/>Slash<br/><br/>The terrifying force immediately drew a circle on the snake head and a large amount of fresh blood scattered in the surroundings.<br/><br/>“What a fast speed!”<br/><br/>When the three powerhouses from Haotian city saw this scene, their pupils constricted slightly as shock appeared on their faces.<br/><br/>“Bang!”<br/><br/>“Hiss, hiss, hiss!”<br/><br/>One of the heads was directly chopped off by Wang Xian, while the other three heads attacked him at the same time.<br/><br/>The heads of these three heads were filled with protruding scales that were as bright as crystals. They were incomparably sharp.<br/><br/>“HMPH!”<br/><br/>Wang Xian snorted softly. His body moved and he instantly escaped the attack range of the snake heads.<br/><br/>“Whoosh!”<br/><br/>In the next moment, numerous clones appeared around Wang Xian. There were thousands of clones and they attacked the three snake heads.<br/><br/>“Hiss! Hiss! Hiss!”<br/><br/>The three snake heads opened their mouths and spewed out green poisonous fog.<br/><br/>“Cloud Mist Dragon Surge!”<br/><br/>Wang Xian let out a low voice and the cloud mist instantly enveloped the snake heads. He ignored the poisonous fog and landed directly on top of one of the snake heads.<br/><br/>Crack! Crack<br/><br/>The terrifying dragon claws tore his head apart.<br/><br/>Bang! Bang! Bang<br/><br/>The other two snake heads immediately came to support him, but Wang Xian easily dodged them.<br/><br/>Puff! Puff! Puff<br/><br/>In the cloud, the speed of the snake heads was less than one-tenth of Wang Xian’s speed.<br/><br/>Soon, the other two snake heads were also severely injured.<br/><br/>Hiss! Hiss! Hiss<br/><br/>Roar! Roar<br/><br/>The other nine snake heads felt the pain and raised their heads to let out a violent roar.<br/><br/>“Get rid of these three!”<br/><br/>At this moment, Wang Xian rushed out from the clouds and shouted at the middle-aged man who was holding a black brush.<br/><br/>“Impressive!”<br/><br/>The middle-aged man could sense that Wang Xian was able to injure four of the heads so quickly. His eyes were filled with astonishment.<br/><br/>“Paint the ground into a prison, trap!”<br/><br/>He let out a low roar and waved his arm. A picture was drawn to trap the two snake heads.<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>In an instant, countless green threads appeared around the two snake heads and coiled around them.<br/><br/>“Good!”<br/><br/>When Wang Xian saw this scene, his eyes lit up and his dragon claws landed on them.<br/><br/>“PFFT! PFFT!”<br/><br/>The powerful attack instantly dealt heavy damage to the two snake heads. With a wave of his arm, the other snake head, Wang Xian, sent a dragon tomb directly towards them.<br/><br/>“Hahaha, good, good, good. Thank you, brother. Kill!”<br/><br/>The other two experts roared in excitement.<br/><br/>The following battle was simple. With the help of Wang Xian, the snake heads were quickly killed.<br/><br/>“Saint, Judgement!”<br/><br/>As the middle-aged man’s brush was carving out characters in the air, a light judgement landed on the muscular snake’s body and killed it completely.<br/><br/>“Impressive. This middle-aged man’s attack method is similar to a wizard’s formation. However, they shouldn’t be in the same system.”<br/><br/>Wang Xian’s gaze swept over as his eyes sparkled.<br/><br/>“Hahaha, I’m scholar Fang of Haotian City. Thank you for your help, Brother!”<br/><br/>After the muscular-headed snake was killed, the middle-aged man cupped his hands at Wang Xian and thanked him.\t\t\t\t\t\t</div>", "images": {}, "success": true}