{"id": 373, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072647.html", "title": "Chapter 3364 - 3364 2263 Thunder Cloud Domain", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3364 - 3364 2263 Thunder Cloud Domain</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3364 2263 Thunder Cloud Domain<br/><br/>Heavenly City was a city close to the ocean. The entire city had five universe Knight Level 9 great beings guarding it.<br/><br/>In the surrounding domain, heavenly city still had a lot of prestige.<br/><br/>The entire city was huge. There were not only humans living in it, but also other living beings.<br/><br/>“We’re here, brother Wang Xian. Do you want to stay in Haotian City for a period of time?”<br/><br/>After traveling on the sea for more than half a year, the ship docked at the edge of the coast.<br/><br/>In front of them was the vast Haotian city.<br/><br/>“No thanks. I’ll head straight to the Thunder Ray tribe. Thank you, brother Fang Wen, and everyone for your hospitality for the past half a year!”<br/><br/>Eight months later, Wang Xian arrived at Heavenly City on a ship from heavenly city. He cupped his hands and expressed his gratitude.<br/><br/>“Haha, Brother Wang Xian, let me bring you to the teleportation formation!”<br/><br/>Scholar Fang Wen brought Wang Xian and flew towards heavenly city.<br/><br/>“Brother Fang Wen, Farewell!”<br/><br/>When they arrived at the teleportation formation, Wang Xian cupped his hands and said with a smile on his face.<br/><br/>“Have a safe journey!”<br/><br/>Scholar Fang waved his hand at him.<br/><br/>Buzz<br/><br/>The teleportation formation was activated, and Wang Xian’s figure disappeared.<br/><br/>When he reappeared, he had already arrived at another city.<br/><br/>This was a dark city, and there were only skeletons living around it. Wang Xian did not stay any longer and teleported to the next city.<br/><br/>The lightning race was very far away from here. If he were to fly, it would take at least more than ten years. Even if he were to teleport continuously through the teleportation formation, it would still take a few days.<br/><br/>He quickly traveled from one strange city to another. Three days later, he arrived at a city and squinted his eyes.<br/><br/>This was a city filled with technology. It was filled with dreams. All kinds of spaceships were flying in the sky.<br/><br/>There were more than a dozen huge purple buildings in the city. They went straight into the clouds. In the clouds, there were lightning bolts. Lightning bolts fell on the city, maintaining the energy of the entire city.<br/><br/>“Welcome to Heavenly Thunder City. We will automatically form a temporary identity for you. Please abide by the rules of Heavenly Thunder City. Otherwise, you will be punished by Heavenly Thunder City!”<br/><br/>“Heavenly Thunder City. It is the closest city in the territory of the Lightning race. The population of the entire Heavenly Thunder City is around 300 million.”<br/><br/>Wang Xian walked straight outside.<br/><br/>This time, his target was here.<br/><br/>The Thunder Ray race was not too far from this city. This city was built by an expert at the peak of the universe knight level.<br/><br/>Although the city was technologically advanced, the people living in it did not follow the path of technology.<br/><br/>Instead, they were all kinds of cultivators.<br/><br/>Among them, the majority were thunder attribute cultivators.<br/><br/>This was because there were thunder clouds in the sky around the sky of the Thunder City.<br/><br/>This was a special territory. The area covered by the Thunder Clouds was huge. In the sky, every cloud contained a terrifying power of thunder.<br/><br/>The Thunder Race was born in the Thunder Clouds and established a powerful race.<br/><br/>The number of the Thunder race was not many. The number of disciples of the race was around ten billion. Their strength was not weak.<br/><br/>Wang Xian walked out from the teleportation formation and walked in the city. He scanned his surroundings.<br/><br/>He saw a flying car that was used to tour the entire city. He spent some time to sit on it.<br/><br/>There were many humans, demonic beasts, and other living beings on the car.<br/><br/>There was one type of living being that had a sharp purple nose and purple wings on their back. They were the disciples of the Thunder Ray tribe.<br/><br/>The entire Sky Thunder City was huge. There were all kinds of things and even academies.<br/><br/>The Sky Thunder City was a neutral force that did not belong to any race. They were not weak.<br/><br/>With the strength of a city lord at the peak of the universe knight level, even if a powerful warrior of the Thunder Ray race came here, they had to follow the rules.<br/><br/>Wang Xian toured around the city and took out the universe AI to search for some information.<br/><br/>The great elder of the Thunder Ray tribe was his target this time around. The 27 thunder feathers of the incipient holy wings were still with him.<br/><br/>During the half a year on the ship, he had gotten scholar Fang to confirm some information for him.<br/><br/>After all, it was tens of millions of years ago when the Thunder Ray tribe’s thunder feathers were snatched away.<br/><br/>After confirmation, the great elder of the Thunder Ray tribe from tens of millions of years ago was still the great elder now.<br/><br/>However, Wang Xian did not know the exact location of the Great Elder.<br/><br/>“First, I have to confirm the position of the great elder of the Thunder Ray race and whether Lei Yu is still in his hands. Then, I have to snatch him over!”<br/><br/>Wang Xian mumbled.<br/><br/>Currently, Wang Xian’s strength could easily suppress the great elder of the Thunder Ray race. However, it was still not enough to deal with the entire thunder ray race.<br/><br/>The lightning race had the combat strength of a peak universe knight. With their deep foundation, Wang Xian should not be their match.<br/><br/>“This is a little troublesome. I have to find a disciple of the lightning race to investigate the situation!”<br/><br/>Wang Xian mumbled. His body moved and he immediately flew in the direction of the Lightning race.<br/><br/>After flying for more than ten minutes and leaving the Sky Thunder City, Wang Xian looked at the thunderclouds in the sky.<br/><br/>In this area of Thunderclouds, the light was a little dim. From time to time, lightning would illuminate the entire starry sky.<br/><br/>In this thick thundercloud, it greatly affected a person’s vision.<br/><br/>Furthermore, there were some desolate beasts in this thundercloud.<br/><br/>The Thundercloud not only gave birth to a powerful lightning race, but it also gave birth to other powerful desolate beasts.<br/><br/>Especially in the depths of the thunder clouds, there were even more terrifying desolate beasts.<br/><br/>Some desolate beasts were able to threaten peak universe knights.<br/><br/>Wang Xian flew into the thunder clouds and felt as if he had entered a huge and unfamiliar world. Thunder and lightning would appear from time to time in his surroundings. It was difficult for the weak to survive here.<br/><br/>“Dragon Eyes!”<br/><br/>Wang Xian activated his dragon eyes and scanned his surroundings before flying straight ahead.<br/><br/>Crackle! Crackle<br/><br/>While he was flying, terrifying bolts of lightning would burst out from time to time. Some of them were strong while others were weak.<br/><br/>“Eh?”<br/><br/>At this moment, Wang Xian suddenly saw a lightning bolt that seemed to have substance.<br/><br/>He was slightly stunned when he saw this lightning bolt. His body moved and he flew straight ahead.<br/><br/>Buzz<br/><br/>Wang Xian grabbed the lightning bolt in his hand and felt a powerful force of lightning coming from within.<br/><br/>“TSK TSK, this is still a treasure. An acquired spiritual treasure. How did I manage to encounter it so easily?”<br/><br/>Wang Xian raised his eyebrows and revealed a shocked expression. He kept it and continued flying forward.<br/><br/>“CHIRP CHIRP CHIRP!”<br/><br/>After flying in the Thundercloud for more than ten days, Wang Xian suddenly heard the chirping of birds coming from his right.<br/><br/>The ear-piercing sound had a powerful penetrating force. His eyes focused.<br/><br/>“This is a thundercloud vulture dire beast!”<br/><br/>Wang Xian narrowed his eyes slightly.<br/><br/>He had not met any members of the thunderlight race for more than ten days. Instead, he encountered a rare Thundercloud vulture dire beast.<br/><br/>The Thundercloud Vulture was one of the dire beasts that lived in the Thundercloud. It was an extremely rare, extremely powerful and terrifying dire beast!\t\t\t\t\t\t</div>", "images": {}, "success": true}