{"id": 377, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072655.html", "title": "Chapter 3368 - 3368 2267 Didn’T Follow The Rules!", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3368 - 3368 2267 Didn’T Follow The Rules!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3368 2267 didn’t follow the rules!<br/><br/>Lei zhengyun, the favored son of the Thunder race, had reached the level of a universe knight level 3 and had at least four or five acquired spiritual treasures.<br/><br/>Lei Zhengyun had great potential to become the senior sister of the Thunder race in the future.<br/><br/>And the title of senior sister represented the strongest female disciple of the Thunder race.<br/><br/>If she could defeat the eldest senior brother of the Lightning race in the future, she would be the eldest senior sister of the entire lightning race.<br/><br/>The title of eldest senior brother and eldest senior sister had an extremely high status in the lightning race, not inferior to an ordinary elder.<br/><br/>This was because those who could obtain this title had the potential to reach the peak of their lightning race.<br/><br/>However, it was extremely difficult to obtain the title of eldest senior brother and eldest senior sister.<br/><br/>The eldest senior brother of the Thunder Ray race had already reached more than 400 eras old.<br/><br/>Now, Lei Zhengyun, who had the combat strength of a level three universe knight and the potential of the eldest senior sister, was allowed to spar with a new disciple who had just joined the Thunder Ray Race?<br/><br/>In the entire hall, all the disciples looked at this scene in astonishment.<br/><br/>In the end, their gazes landed on Wang Xian, and their eyes were filled with astonishment.<br/><br/>Could it be that this fellow was hiding his true strength?<br/><br/>“It’s him.”<br/><br/>The disciples around Wang Xian looked at him with sparkling eyes.<br/><br/>They knew clearly that among them, this fellow was the strongest. He did not reveal his true strength from the beginning to the end.<br/><br/>He was not called to participate in the sparring session just now.<br/><br/>“First elder came to let me spar with a little fellow like you. From the looks of it, you must have some strength.”<br/><br/>Lei zhengyun came to his senses. He sized up Wang Xian from head to toe and said faintly.<br/><br/>“Whoosh!”<br/><br/>“Come on. As your senior sister, I Won’t bully you. I Won’t use any spiritual treasures.”<br/><br/>She moved and flew to the high platform. She hooked her finger at Wang Xian.<br/><br/>Wang Xian felt helpless when he saw that everyone was focused on him.<br/><br/>At this moment, it was impossible for him to charge directly at the great elder of the Thunder Ray tribe because he would most likely fail.<br/><br/>“You are not worthy for me to make a move.”<br/><br/>Wang Xian’s eyes flickered slightly. His gaze landed on Lei Zhengyun as he said faintly.<br/><br/>“Huh?”<br/><br/>Lei Zhengyun was slightly stunned when he heard his words. A hint of anger appeared in his eyes. “Little Guy, do you not know the immensity of Heaven and earth?”<br/><br/>“Holy Shit, this new disciple is so arrogant?”<br/><br/>“Does he have the capital to be arrogant, or is there something wrong with his brain?”<br/><br/>“He dares to be so arrogant to junior sister Zhengyun, this kid is asking for a beating!”<br/><br/>The surrounding people were also stunned when they heard his words. This was too arrogant!<br/><br/>“Hehe!”<br/><br/>The first elder of the Lightning race in front of him smiled faintly.<br/><br/>“You… very good. I want to make your face stick to the ground!”<br/><br/>Lei Zhengyun clenched his fist and lightning flashed on the wings on his back.<br/><br/>“Crash!”<br/><br/>The next moment, her figure disappeared instantly.<br/><br/>Wang Xian looked at her figure and smiled. He waved his arm.<br/><br/>A four-meter-tall figure appeared in front of him.<br/><br/>At this moment, Lei Zhengyun’s figure appeared in front of Wang Xian. She was clenching her fist and preparing to attack Wang Xian’s face.<br/><br/>However, when she saw the figure beside Wang Xian, she froze.<br/><br/>“CHIRP CHIRP!”<br/><br/>The Thundercloud Vulture looked at Lei zhengyun curiously and chirped.<br/><br/>“You, you, you…”<br/><br/>When Lei Zhengyun saw the Thundercloud vulture staring at him, his expression started to change.<br/><br/>The Thundercloud Vulture, who had the combat strength of a Level 6 universe knight, was standing beside the young disciple.<br/><br/>Damn it…<br/><br/>How could she fight!<br/><br/>She was sure that she would be electrocuted before her fist landed!<br/><br/>“Oh?”<br/><br/>At this moment, the head elder of the Thunder race saw the Thunder Cloud Vulture and raised his eyebrows, looking surprised.<br/><br/>“Hiss… this… is the thunder cloud vulture, a level 6 thunder cloud vulture!”<br/><br/>“How is this possible, how could that disciple have such a terrifying battle pet!”<br/><br/>“Thunder Cloud Vulture, it’s an extremely rare desolate beast in our thunder cloud territory. It’s too difficult to capture one as a battle pet!”<br/><br/>“How could he have a thunder cloud vulture battle pet with a Level 6 universe knight combat strength? How could he suppress it?”<br/><br/>All the disciples of the Thunder Light race were shocked when they saw this scene.<br/><br/>Even the great being of the Thunder Light race was shocked.<br/><br/>Thunder Cloud Vultures were very rare in the Thunder Cloud Domain, especially in terms of speed. Even the great beings of the Thunder light race couldn’t compare to them in terms of speed.<br/><br/>Within the Thunder Light race, there were many thunder cloud vultures that had been suppressed and tamed. However, there were only a few dozen of them, and most of them were in the hands of the top great beings of the Thunder light race.<br/><br/>Their clan leader had once tried to form a thunder cloud vulture battle group, but he had failed.<br/><br/>Thundercloud vultures were too rare and too fast!<br/><br/>However, a newly joined disciple actually possessed the combat strength of a Level 6 universe knight, Thundercloud Vultures?<br/><br/>This made them feel a little incredulous.<br/><br/>“Could he be the descendant of some lord of the Thunder Race?”<br/><br/>Some of the disciples were bewildered.<br/><br/>“Are we still fighting?”<br/><br/>Wang Xian listened to the discussions around him and looked at Lei Zhengyun with a smile. He asked teasingly.<br/><br/>“You… which senior of our Thunder Ray race are you the descendant of?”<br/><br/>Lei Zhengyun’s expression kept changing as he couldn’t help but ask.<br/><br/>“Alright, Zhengyun, you’ve lost. You have to know that there are always people better than you in this world. This disciple can easily defeat you before the age of 20. Don’t be arrogant in the future!”<br/><br/>In the front, the first elder of the Thunder Ray race said with a smile.<br/><br/>“That… that’s because he has a thunder cloud vulture with the combat strength of A Level 6 universe knight. This doesn’t count…”<br/><br/>Lei Zhengyun pouted and said unwillingly.<br/><br/>“Hehe, Zhengfa!”<br/><br/>The great elder of the Thunder Ray race smiled and looked at a middle-aged man not far away from him.<br/><br/>“Your disciple is here!”<br/><br/>The middle-aged man cupped his hands and stood up immediately.<br/><br/>“Let’s spar with this disciple!”<br/><br/>The chief elder of the Lightning race said as his gaze landed on Wang Xian. “If you can win this time, as the chief elder of the Lightning race, I will reward you with an acquired treasure that is suitable for you!”<br/><br/>“Hiss, what! An acquired treasure!”<br/><br/>“I… Directly rewarded you with an acquired treasure. This… This reward is too high, isn’t it?”<br/><br/>“In the entire thunder light race, only eldest senior brother and eldest senior sister were rewarded with a acquired true treasure. Now, the great elder has promised such a precious reward!”<br/><br/>“Lei Zheng Fa is our ninth senior brother, and he is ranked ninth among the current disciples. With the Combat Power of a universe knight at level six, even if he has a universe Knight Level Six Thunder Cloud Vulture, he may not be a match for ninth senior brother!”<br/><br/>“That’s right. It’s not so easy to obtain a acquired treasure!”<br/><br/>When all the surrounding disciples heard the first Elder’s words, they were shocked again.<br/><br/>Lei Zhengfa was also slightly taken aback. He bowed casually and replied, “Yes!”<br/><br/>“Huh?”<br/><br/>When Wang Xian heard the first Elder’s instructions, he was also slightly taken aback.<br/><br/>This… This was not going according to the plan!<br/><br/>If he won, he would give the acquired treasure directly?\t\t\t\t\t\t</div>", "images": {}, "success": true}