{"id": 376, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072653.html", "title": "Chapter 3367 - 3367 There Was Something Wrong With The Script 2266", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3367 - 3367 There Was Something Wrong With The Script 2266</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3367 There was something wrong with the script 2266<br/><br/>“That old man is the great elder of the Lightning race.”<br/><br/>Wang Xian stared at the old man with excitement in his heart. His eyes flickered slightly as he thought about how to make a move.<br/><br/>“Great Elder!”<br/><br/>At this moment, more than ten powerhouses of the Lightning race who were the first to be teleported over flew to the front of the old man and cupped their hands.<br/><br/>“Have you met any good seedlings?”<br/><br/>The old man had a head of white hair, and even the tip of his sharp nose was white.<br/><br/>He opened his mouth and asked indifferently.<br/><br/>“First elder, this time, there really is a seedling. Among them, there is a young man whose strength we have yet to test out. The other strongest one is a level nine void God Emperor!”<br/><br/>The middle-aged man who was the leader reported.<br/><br/>“Oh? Lei Lianyun’s strength has not been tested in several trials. It seems that his strength should have reached the combat strength of a level one universe knight. Such a heaven’s favored child is extremely rare.”<br/><br/>A look of surprise and joy appeared on the Great Elder’s face. He laughed as he swept his gaze across the more than a thousand disciples on the high platform. Finally, his gaze landed on Wang Xian.<br/><br/>His gaze flickered slightly. With a move of his palm, a round plate appeared.<br/><br/>A bolt of lightning slowly covered the round plate.<br/><br/>“Huh?”<br/><br/>Wang Xian stood there and lowered his head slightly when he saw this scene. He was not afraid of being discovered.<br/><br/>“Hiss, this…”<br/><br/>Suddenly, the great elder who was sitting there and looking at the round plate stiffened. He stared at the contents displayed on the plate in disbelief.<br/><br/>He raised his head and looked at Wang Xian. His eyes were filled with shock.<br/><br/>“Apart from that disciple, let the rest spar with each other!”<br/><br/>The great elder took a few deep breaths. After pondering for a moment, he ordered the dozen of people in front of him.<br/><br/>“Yes!”<br/><br/>The dozen of lightning race experts who were in charge of recruiting disciples nodded their heads.<br/><br/>“All of you are now external disciples of our lightning race. Next, we will rank you according to your abilities. Seize this opportunity. The stronger you are and the higher your ranking, the more rewards you will receive!”<br/><br/>The great elder sat there and knocked on his chair gently. His expression changed slightly.<br/><br/>He passed the disc to an elder beside him.<br/><br/>“HMM?”<br/><br/>The elder beside him had his eyes closed after taking a look. He was slightly stunned when he saw the disc that the great elder passed to him. When he saw the information on it, his pupils constricted slightly.<br/><br/>“This… is this for real? How is this possible?”<br/><br/>The old man exclaimed in a low voice in shock.<br/><br/>“It is indeed somewhat inconceivable. Such a heaven’s chosen is too rare.”<br/><br/>The first elder said.<br/><br/>“How did he join our lightning race? With his strength, it is impossible for him not to have a powerful background.”<br/><br/>The old man said with his eyes wide open.<br/><br/>“There’s another possibility, and that is that he obtained a powerful inheritance. However, the possibility is very small.”<br/><br/>The great elder guessed, “It’s indeed too strange that he wants to join our lightning race.”<br/><br/>“Such a disciple, other forces would nurture him in front of treasures. It’s impossible for them to release him, let alone let him join our lightning race. It’s impossible for us to not want such a disciple!”<br/><br/>The old man slowly said.<br/><br/>“Let’s first investigate the details!”<br/><br/>The first Elder’s eyes flickered. His heart was filled with doubt and shock.<br/><br/>“The highest level is void God Emperor Rank 9. His control over the Thunder technique is also average. This time, it’s not as good as the last time. The last time, there were at least peak void God emperor experts.”<br/><br/>“Indeed, it seems that the disciples entering this batch are not good enough!”<br/><br/>On the high platform, the disciples were sparring. In the surrounding seats, some of the older disciples were watching. They were discussing softly with smiles on their faces.<br/><br/>The lightning race was divided into outer and inner disciples. Those below the combat strength of a universe knight would become outer disciples.<br/><br/>And in the front seat, there were a group of inner disciples watching him.<br/><br/>They crossed their arms and watched him from above.<br/><br/>The battles ended quickly. However, Wang Xian was not called to the arena.<br/><br/>“This is a little boring. I thought it would be fun for new disciples to enter the sect. Sigh!”<br/><br/>At the front, a young girl from the Lightning race shook her head and said in boredom.<br/><br/>“Hehe, the entrance examination for new disciples is a very boring thing. We are only here to stand on the stage.”<br/><br/>A middle-aged man beside him said to him with a smile.<br/><br/>“Senior brother, how much longer is it going to be? I’m going to run away!”<br/><br/>The woman’s gaze swept over him, her eyes rolled as she said softly.<br/><br/>“Junior sister, the elder is in front.”<br/><br/>The middle-aged man reminded him softly.<br/><br/>“Hehe, it’s fine. The first elder is a good person. He Won’t beat me up!”<br/><br/>The girl smiled softly.<br/><br/>The middle-aged man shook his head helplessly.<br/><br/>His junior sister had outstanding talent. In the Thunder race, other than the first senior brother, she was the most talented.<br/><br/>She had the power of a level 3 universe knight at such a young age, and she had a high chance of becoming the first senior sister of the Thunder race in the future.<br/><br/>The seniority of the disciples of the Thunder race was not determined by the time they entered the sect or their age, but by their power.<br/><br/>Furthermore, this junior sister’s master was the first Elder’s junior sister. Many elders of the Lightning race doted on her.<br/><br/>The girl shrunk her head and prepared to retreat from the back.<br/><br/>The actions of the girl above were all under the gaze of the first elder and the others.<br/><br/>The first elder of the Lightning race narrowed his eyes slightly.<br/><br/>“Zhengyun, come over and spar with a disciple!”<br/><br/>He spoke directly to the girl who was about to slip away.<br/><br/>“Ah?”<br/><br/>When the girl heard the first elder call her name, she quickly turned around and lowered her head.<br/><br/>“Ah What? Go to the high platform and spar with a newly joined disciple.”<br/><br/>The first elder looked at her and said with a smile.<br/><br/>“Oh?”<br/><br/>The elder saw his arrangement and smiled. He muttered, “That’s good too. Let this girl know what it means to be high and mighty.”<br/><br/>“Let me spar with the new Junior Brothers. Are you serious, great elder?”<br/><br/>The girl raised her head. Her face was filled with astonishment as her eyes widened. “I can defeat this group of junior brothers with a single finger. Great Elder, are you kidding me?”<br/><br/>“This disciple will spar with her. If you defeat her, I will reward you with a acquired spiritual treasure!”<br/><br/>At this moment, the Great Elder’s gaze landed on Wang Xian as he spoke to him.<br/><br/>“HMM?”<br/><br/>When Wang Xian heard the words of the great elder of the Lightning race, his body paused slightly.<br/><br/>As expected, his strength had been discovered.<br/><br/>However, what did the great elder want to do?<br/><br/>“What’s the situation? He wants a newly joined disciple to spar with senior sister Lei Zhengyun?”<br/><br/>“No way! Senior Sister Lei Zhengyun has the Combat Power of a Level 3 universe knight. How… How can a new disciple spar with senior sister?”<br/><br/>“What’s going on? Why did the great elder arrange this?”<br/><br/>The surrounding disciples listened to the Great Elder’s instructions in shock.<br/><br/>Even the deacons and managers of the Thunder light race were shocked.\t\t\t\t\t\t</div>", "images": {}, "success": true}