{"id": 384, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072669.html", "title": "Chapter 3375 - 3375 2274 Was Searching For Enemies And Hunting Desolate Beasts", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3375 - 3375 2274 Was Searching For Enemies And Hunting Desolate Beasts</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3375 2274 was searching for enemies and hunting desolate beasts<br/><br/>“That’s true!”<br/><br/>“Senior brother Wang Xian!”<br/><br/>In the Thundercloud, Lei Zhengyun and the rest looked at Wang Xian and greeted him with a smile.<br/><br/>“Yes!”<br/><br/>Wang Xian had already sensed their arrival. He stood up and looked at them.<br/><br/>“Is senior brother Wang Xian cultivating alone here?”<br/><br/>A middle-aged man asked Wang Xian.<br/><br/>Nowadays, there might not be many people who knew Wang Xian from the Thunder Ray tribe. However, many outstanding disciples knew him.<br/><br/>The group of disciples who invited Wang Xian previously were all rather famous in the Thunder Ray tribe.<br/><br/>“Yes, he is cultivating here!”<br/><br/>Wang Xian nodded his head and swept his gaze across them. “Are you guys training here?”<br/><br/>“Yes, I’m strolling around with third senior sister and the rest to see if I can capture some dire beasts and find some treasures.”<br/><br/>The middle-aged man nodded. “Senior brother Wang Xian, you have to be careful if you are alone. This place is very dangerous.”<br/><br/>“Yes, I will be careful!”<br/><br/>Wang Xian nodded his head.<br/><br/>“Senior brother Wang Xian.”<br/><br/>At this moment, Lei Zhengyun, who was at the side, rolled his eyes. He suddenly shouted and flew towards him.<br/><br/>“Eh?”<br/><br/>When the disciples of the Lightning race saw this, they were shocked.<br/><br/>“What’s the matter?”<br/><br/>When Wang Xian saw Lei Zhengyun’s eyes darting around, he asked with a smile.<br/><br/>“Hehe, that senior brother Wang Xian, there’s a matter. How did you capture the Thundercloud Vulture in your hands?”<br/><br/>Lei Zhengyun looked at Wang Xian and asked with a smile.<br/><br/>“How did you catch it? is that how you caught it?”<br/><br/>Wang Xian smiled and replied.<br/><br/>“This… The Thundercloud Vulture’s speed is so fast. How can I catch it?”<br/><br/>Lei Zhengyun asked speechlessly.<br/><br/>“I have a way!”<br/><br/>Wang Xian looked at her and said.<br/><br/>“You have a way?”<br/><br/>Lei Zhengyun’s eyes lit up. His eyes were sparkling as he said, “How about senior brother Wang Xian accompany us to catch dire beasts? If we succeed, I will give you a treasure for your cultivation. What do you think?”<br/><br/>“This…”<br/><br/>Wang Xian was slightly stunned when he heard her words. He pondered for a moment and nodded his head when he saw her expectant expression.<br/><br/>“Sure!”<br/><br/>He agreed.<br/><br/>“Hehe, that’s great. Haha, Third Senior Sister, let’s go. I’ve invited senior brother Wang Xian. Let’s continue to capture the Thundercloud Vulture!”<br/><br/>“With senior brother Wang Xian and you as well as senior brother Wang Xian’s thundercloud vulture mount, our chances of success are very high!”<br/><br/>Lei Zhengyun said excitedly.<br/><br/>“This…”<br/><br/>Third senior sister smiled and shook her head. Her gaze landed on Wang Xian. “Then, we welcome junior brother Wang Xian to join our team.”<br/><br/>“There’s no need. I came out this time to see if I can obtain some treasures.”<br/><br/>Wang Xian shook his head.<br/><br/>After cultivating for two months, his current lightning attribute strength was comparable to an ordinary level seven universe knight.<br/><br/>After that, he followed them around to see if he could come across any treasures.<br/><br/>“Alright. With senior brother Wang Xian joining us, the chances of us capturing some desolate beasts will increase by a lot.”<br/><br/>Third senior sister said.<br/><br/>“Since senior brother Wang Xian is joining us, let’s head deeper. How about the Lightning Web?”<br/><br/>A middle-aged man suggested with a smile.<br/><br/>“The Thunder net is fine too. There are more desolate beasts there. Let’s Go!”<br/><br/>Third senior sister pondered for a moment and nodded.<br/><br/>“Let’s go. Senior brother Wang Xian, Summon Your Thundercloud Vulture!”<br/><br/>Lei zhengyun nodded and said to Wang Xian.<br/><br/>“CHIRP CHIRP!”<br/><br/>Wang Xian smiled. With a wave of his arm, the Thundercloud Vulture appeared in front of him.<br/><br/>“I’m really envious. When will I be able to have a thundercloud vulture battle pet?”<br/><br/>Lei Zhengyun spoke with an envious expression.<br/><br/>The other disciples around him were also envious.<br/><br/>The potential of the Thundercloud vulture was similar to that of the Lightning race. If they were fed well, their abilities would be similar to their own.<br/><br/>This was equivalent to a powerful comrade.<br/><br/>“Let’s Go!”<br/><br/>Everyone smiled and flew straight ahead.<br/><br/>Lei Zhengyun and the rest were obviously very familiar with the situation here. Wang Xian followed them and scanned the surroundings.<br/><br/>Among this group of people, the weakest one had the strength of a Level 3 universe knight.<br/><br/>The strongest third senior sister had the combat strength of a Level 7 universe knight.<br/><br/>They flew for a full two days before they arrived at the so-called lightning net.<br/><br/>The Thunder net was the name given to it by the Lightning race. The entire thunder cloud and the area below were filled with dense thunderbolts.<br/><br/>When these Thunderbolts interweaved together, it was a world of thunder and lightning.<br/><br/>There were strong and weak Thunderbolts. The strong ones were comparable to the attack power of a universe knight.<br/><br/>“Everyone, be careful. We will split up some distance. Two of us will rush forward in groups. Once we discover something, we will inform immediately!”<br/><br/>Third senior sister swept her gaze across the group and instructed.<br/><br/>“Then I will go with senior brother Wang Xian. He is very strong and has a war pet.”<br/><br/>Lei Zhengyun replied immediately.<br/><br/>“Alright.”<br/><br/>Third senior sister nodded. The other dozen or so people also formed groups of two. The stronger one would bring the weaker one along.<br/><br/>“Let’s go this way!”<br/><br/>Lei Zhengyun moved his palm and a lightning needle appeared in front of him. She looked at Wang Xian and said.<br/><br/>“Okay!”<br/><br/>Wang Xian nodded his head. He looked at the needle in front of her and asked curiously, “What kind of treasure is this needle?”<br/><br/>“This is called the lightning needle. The lightning needle can sense the strong ones in the surrounding lightning. If there are dire beasts, it can also detect them. It is a very practical treasure. If our disciples come out, we can apply to the race.”<br/><br/>Lei Zhengyun introduced him.<br/><br/>“OH.”<br/><br/>Wang Xian nodded his head.<br/><br/>“Let’s go, let’s go. Our Lightning race is very powerful. We even have innate spiritual treasures!”<br/><br/>Lei Zhengyun said proudly.<br/><br/>“Innate spiritual treasures?”<br/><br/>Wang Xian raised his eyebrows and flew forward from the side.<br/><br/>The lightning needle could help the disciples of the Lightning Race to avoid danger. However, there were not many of such treasures among the Lightning race.<br/><br/>Wang Xian followed Lei Zhengyun and flew forward. He scanned his surroundings.<br/><br/>Time passed day by day. In half a month’s time, they did not encounter a single desolate beast.<br/><br/>The entire area covered by the Lightning Cloud was too huge. It was so huge that even if Wang Xian were to unleash his full strength, it would take him more than a hundred years to fly from one side to the other.<br/><br/>“Fellow disciples, we have found a desolate beast here!”<br/><br/>Not long after, a voice was transmitted into the minds of Wang Xian and the rest.<br/><br/>“Huh?”<br/><br/>Wang Xian was stunned and immediately looked to the right.<br/><br/>“We have found it. I don’t know if it’s the Thundercloud vulture. Senior brother Wang Xian, we will be depending on you in a while!”<br/><br/>Lei Zhengyun said excitedly and immediately flew to the right.<br/><br/>Wang Xian’s figure moved and flew over directly.<br/><br/>On the right, two middle-aged men found a desolate beast. The rest of the disciples also rushed over quickly.<br/><br/>“In front, there are two three-tailed thunderfoxes. Their strength should be around the fourth level of a universe Knight!”<br/><br/>Wang Xian and the rest rushed over. A middle-aged man pointed to the front and said.\t\t\t\t\t\t</div>", "images": {}, "success": true}