{"id": 381, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072663.html", "title": "Chapter 3372 - 3372 Under The 2271 Complete And Uninitiated Holy Wings", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3372 - 3372 Under The 2271 Complete And Uninitiated Holy Wings</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3372 Under the 2271 complete and uninitiated holy wings<br/><br/>Wang Xian’s age and the strength that he displayed far exceeded the disciples of the Thunder Ray tribe.<br/><br/>Especially Lei Zhengyun, he felt a huge blow.<br/><br/>Her strength and talent were definitely top-notch among the same generation of the Thunder Ray tribe. She was on par with his eldest senior brother.<br/><br/>However, her current strength was worlds apart from Wang Xian’s. This was a huge blow to her.<br/><br/>She stared at Wang Xian with curiosity.<br/><br/>Was he a purebred divine dragon?<br/><br/>When the disciples of the other lightning race heard about Lei Zhengyun’s culture, they also looked at Wang Xian with curiosity.<br/><br/>They were also curious about whether Wang Xian was a purebred divine dragon.<br/><br/>Purebred divine dragons were such powerful creatures. They were considered to be at the peak of the Universe Knights.<br/><br/>They could fight above three levels, and with powerful techniques, they had a chance to reach the top-tier.<br/><br/>The Thunder light race didn’t seem weak, and their strongest warriors were at the pinnacle of universe knights. However, in fact, their strongest warriors were only at the eighth level of universe knights.<br/><br/>Within the Split Heaven Primal Continent, most beings could fight above two levels, which meant that their talents and bloodlines were useless in the Split Heaven Primal Continent.<br/><br/>Those who were stronger than them were all at level nine of the Universe Knight Realm and at the peak of their realm.<br/><br/>Not to mention those powerful peak races.<br/><br/>“You can say that!”<br/><br/>Wang Xian nodded with a smile when he heard Lei Zhengyun’s curious words.<br/><br/>He moved his palm and turned it into a dragon claw. The void condensed and a thunder dragon soared into the sky and disappeared.<br/><br/>“Junior brother Wang Xian is really a purebred dragon god? This… is too powerful!”<br/><br/>“A purebred dragon God, and a thunder dragon too. This Thunder Dragon’s talent should be much more powerful than ours. In the future, junior brother Wang Xian will be able to surpass our clan leader and the rest!”<br/><br/>“This is the first time I’ve seen a peak race. I’m really envious!”<br/><br/>The disciples of the Thunder race looked at Wang Xian with envy. Their eyes were flashing with astonishment.<br/><br/>Since the birth of their thunder race, the strongest expert was at the level eight of a universe knight.<br/><br/>This had a lot to do with their physique, Bloodline, and spells. It was very difficult for them to break through this shackle.<br/><br/>However, the purebred divine dragon was different. The only shackle of the purebred divine dragon was when they broke through to the ruler of the universe.<br/><br/>At that time, their combat ability could easily destroy the entire thunder ray race.<br/><br/>This was the relationship between potential and upper limits.<br/><br/>Wang Xian possessed the body of a purebred divine dragon. Naturally, the other disciples of the Lightning race were very envious of him.<br/><br/>Wang Xian smiled. The lineage of the divine dragon was indeed not something that the lightning race could compare to.<br/><br/>“No wonder senior brother Wang Xian could defeat me. So it’s a purebred divine dragon. Let’s go, senior brother Wang Xian. Let’s go inside.”<br/><br/>Lei Zhengfa spoke from the side. Everyone came to the leisure and entertainment area of the Lightning race’s disciples.<br/><br/>When they entered, some of the disciples saw him and whispered among themselves, their faces filled with curiosity.<br/><br/>Now, all the disciples of the Thunder Light Race knew that a very powerful and monstrous disciple had come to their race.<br/><br/>He had defeated Senior Lei Zheng Fa, who had a level 6 universe knight combat strength, at the age of less than 20 eras, and he had a thunder cloud vulture combat pet with a Level 6 universe knight combat strength.<br/><br/>This shocked all the disciples.<br/><br/>Especially the fact that he might be a purebred divine dragon, it was even more shocking.<br/><br/>“Come and have a taste, junior brother Wang Xian. This is the Thunder Cloud Brew that I got from the elders.”<br/><br/>The disciples of the Thunder Ray race greeted Wang Xian enthusiastically.<br/><br/>They had also received orders from their masters, elders, and elders to befriend Wang Xian.<br/><br/>They also wanted to befriend such a powerful Heaven’s favorite and his disciples who had unlimited potential in the future.<br/><br/>Furthermore, with Wang Xian’s current strength, he could be ranked in the top ten among the disciples of the Lightning race.<br/><br/>After playing with the group of disciples for five to six hours, Wang Xian returned to his palace and announced to the public that he would be in closed-door cultivation for a few months.<br/><br/>The group of disciples of the Lightning race also smiled and nodded.<br/><br/>A few months of closed-door cultivation was already very short in their eyes.<br/><br/>Furthermore, they also knew that Wang Xian had received a treasure from the great elder and needed to be refined.<br/><br/>After returning to his own palace, Wang Xian returned to the Dragon Palace once again.<br/><br/>This time, no one bothered him.<br/><br/>His identity as a purebred divine dragon, the Lightning Dragon, was also completely spread throughout the lightning race.<br/><br/>This caused countless disciples and even the experts of the Thunder Ray tribe to discuss among themselves.<br/><br/>Time passed day by day. Wang Xian was in the dragon palace, nurturing the uninitiated holy wings. He was waiting for the uninitiated holy wings to fully recover.<br/><br/>Buzz<br/><br/>Chirp! Chirp<br/><br/>A month later, in the Dragon Palace, a bird-like sound was heard.<br/><br/>Chirp! Chirp<br/><br/>Roar! Roar<br/><br/>Behind Wang Xian, the uninitiated holy wings were emitting intense light.<br/><br/>The violent force of wind and thunder condensed into the appearance of a powerful bird.<br/><br/>The pupils of this wind and thunder bird seemed to possess endless wisdom. It appeared on the incipient saint wings.<br/><br/>At this moment, the phantom image of Wang Xian’s wind and thunder avatar appeared. The wind and thunder bird directly entered the Phantom image of the wind and Thunder Avatar.<br/><br/>In the next moment, Wang Xian felt the strong force of wind and thunder surging into his body.<br/><br/>Meanwhile, the incipient saint wings started to take root on Wang Xian’s back and completely entered his body. It was as if they were going to completely merge with his body.<br/><br/>Boom<br/><br/>At this moment, Wang Xian sensed a huge image surging into his mind.<br/><br/>In the image, a 10,000-meter-wide wind and thunder bird was battling countless creatures in the void.<br/><br/>Some of these creatures were like humans while others were like demonic beasts.<br/><br/>However, their attacks were very strange. It seemed that they all possessed the ability to teleport.<br/><br/>That’s right, it was teleportation. It was similar to the teleportation of an lie.<br/><br/>These countless human demonic beasts were abnormally powerful. However, this bird of wind and thunder was also extremely terrifying.<br/><br/>Bolts of lightning attacked the enemies in the void. The speed of its flight was comparable to teleportation. In fact, it was even faster than teleportation.<br/><br/>The speed of the bird of wind and thunder had reached its peak. It even disappeared. Wang Xian could only see human demonic beasts being killed one by one as they fell towards the ground.<br/><br/>The intense battle continued. The stench of blood permeated the entire void. In just a few minutes, countless experts had died at the hands of the bird of wind and thunder.<br/><br/>Buzz! Buzz! Buzz<br/><br/>In the next moment, Wang Xian saw more than a dozen gigantic figures appearing in front of the bird of wind and thunder.<br/><br/>The space around these huge figures started to distort and the space started to wrinkle. It was extremely strange.<br/><br/>Wang Xian couldn’t see the following scene because they were fighting too fast. There weren’t even any shadows.<br/><br/>The entire scene continued for half an hour. At the last moment, more than ten huge corpses and a pair of wings of wind and thunder suddenly appeared.<br/><br/>The other parts of the bird of wind and thunder had completely disappeared.<br/><br/>Wang Xian sensed the strange battle in his mind and was shocked!\t\t\t\t\t\t</div>", "images": {}, "success": true}