{"id": 389, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072679.html", "title": "Chapter 3380 - 3380 2279 Female Disciples Tempted Him", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3380 - 3380 2279 Female Disciples Tempted Him</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3380 2279 female disciples tempted him<br/><br/>“Senior brother Wang Xian, do you want to go to the Elders’place with us? This time, senior brother, you have captured so many dire beasts. The elders will be rewarded handsomely.”<br/><br/>In the territory of the Lightning race, after Wang Xian and the rest had dealt with the lightning nematode worms, third senior sister and the rest of the disciples asked him.<br/><br/>“You guys go. I Won’t go. I’m going back to rest for a while!”<br/><br/>Wang Xian shook his head and replied to them.<br/><br/>“Alright then. We will report everything to the elders.”<br/><br/>Third senior sister and the rest nodded and waved at him.<br/><br/>Wang Xian responded and flew back to his palace.<br/><br/>“Phew. This time, I’ll completely cultivate the law of thunder to the peak. I should be able to fight against a peak universe Knight!”<br/><br/>Wang Xian returned to his palace and stood there muttering.<br/><br/>He moved his palm and silver-white metal landed in his hand. A majestic aura was emitted from his body.<br/><br/>His surroundings were slowly enveloped by nine-colored light. Five Elements, wind and thunder, yin and yang!<br/><br/>When all nine elements were activated, he could unleash a terrifying strength.<br/><br/>The offensive power of the five elements, the speed of wind and thunder, and the defense of Light and darkness.<br/><br/>The nine types of energy faintly complemented each other, causing his strength to receive a huge boost.<br/><br/>“The universe is made up of nine types of attributes. Then, can I fuse the nine types of attributes and transform them into one supreme attribute?”<br/><br/>Wang Xian mumbled as his eyes sparkled.<br/><br/>He gave it a try and quickly frowned.<br/><br/>The five elements could fuse together, wind and thunder could fuse together, and yin and Yang could fuse together. However, it was extremely difficult to merge them all together.<br/><br/>…<br/><br/>“Elder, these desolate beasts were basically captured by senior brother Wang Xian. He said he didn’t need them.”<br/><br/>At the same time, at the main hall of the Lightning race, third senior sister and the rest released all the desolate beasts and reported to the seventh elder of the merit shop.<br/><br/>“Oh? Most of them were captured by Wang Xian’s disciples? Even the lightning nematode worms with the combat strength of a universe knight at level seven?”<br/><br/>Seventh Elder stood in the main hall and looked at the group of desolate beasts in astonishment.<br/><br/>They could be considered as a considerable resource.<br/><br/>“Yes, seventh elder. Senior brother Wang Xian’s strength has already reached the level seven of a universe knight. He is much stronger than me. His thunder force is very powerful.”<br/><br/>Third senior sister replied.<br/><br/>“He has already reached the level seven combat strength of a universe knight? So Fast?”<br/><br/>Seventh Elder was shocked and moved.<br/><br/>“Yes, Elder. Senior brother Wang Xian is very powerful.”<br/><br/>The disciples beside him immediately responded.<br/><br/>“This talent is really…”<br/><br/>Seventh Elder smacked his tongue and looked at the group of desolate beasts in front of him. After a moment of hesitation, he continued, “Keep the desolate beasts that you can use as your battle pets. I will report this to first elder and the rest!”<br/><br/>“It’s the seventh elder!”<br/><br/>The group of disciples replied happily.<br/><br/>“Buzz Buzz!”<br/><br/>Soon, not long after, three figures appeared in the merit shop.<br/><br/>“Oh?”<br/><br/>The seventh elder and the rest were slightly stunned. They quickly bowed and said, “Greetings to the clan leader and Guardian!”<br/><br/>“Greetings to the Elder, greetings to the Guardian and the first elder!”<br/><br/>Third senior sister and the rest also bowed respectfully.<br/><br/>“Get up. where is that Wang Xian’s disciple?”<br/><br/>The leader of the Lightning race had a head of long purple hair. He sat on the central seat and swept his gaze across them as he asked.<br/><br/>“Leader, that Wang Xian’s disciple is at his residence Now!”<br/><br/>Seventh Elder immediately reported.<br/><br/>“Did you guys see Wang Xian’s disciple make a move?”<br/><br/>The leader of the Lightning race nodded his head faintly and asked the group of disciples.<br/><br/>“Reporting to the leader, we saw senior brother Wang Xian transform into a lightning dragon to fight. He is very powerful!”<br/><br/>The group of disciples immediately replied.<br/><br/>When the leader of the Lightning race heard that, his eyes flickered as he swept his gaze across the group of desolate beasts.<br/><br/>“Seventh Elder, take out a lightning heart grass from the treasure vault and reward it to Wang Xian’s disciples. Ask Zhengyun… Yes, send it over with some female disciples!”<br/><br/>The leader of the Thunder Ray Tribe said faintly.<br/><br/>His words caused the disciples to be slightly stunned.<br/><br/>“Yes!”<br/><br/>Seventh Elder opened his mouth and a look of shock appeared in his eyes. He immediately replied.<br/><br/>The Thunder Heart Grass was the treasure of their thunder ray tribe. It was nurtured in the grotto-heaven blessed land above the main hall.<br/><br/>Every billion years, only ten of them would grow after being tempered by the Thunder. It was extremely precious in their thunder ray tribe.<br/><br/>As for getting a group of female disciples to send them over, they understood it in their hearts.<br/><br/>This was the tribe leader trying to seduce that Wang Xian’s disciple with his beauty!<br/><br/>The disciples of the Lightning race were slightly different from humans. They had a pair of lightning wings and a sharp nose. However, this did not mean that there were no beauties in the Lightning race.<br/><br/>In fact, the beauties of the Lightning race were also very beautiful. The sharp noses of the males of the lightning race were black, but the females were indeed purple in color. There was still a different kind of beauty.<br/><br/>Lei Zhengyun was considered a beauty in the Thunder race, but of course, she was not the most beautiful.<br/><br/>“Then let Yun Zi and the others go over too. Clan leader, do you want to go and see that disciple?”<br/><br/>The great elder at the side said with a smile on his face.<br/><br/>“We won’t see him for the time being. Just let our disciple have a good relationship with him. If he can become the eldest senior brother of the Thunder race, then we’ll see each other again!”<br/><br/>The leader of the Thunder Ray tribe pondered for a moment before replying with a smile.<br/><br/>“Alright!”<br/><br/>The first elder nodded his head and looked at the group of disciples in front of him. “Call Yun Zi and the other beautiful female disciples over. Bring them to the residence of Wang Xian’s disciples later and give him the Thunder Heart Grass.”<br/><br/>“ER… It’s the first elder!”<br/><br/>The group of disciples looked at each other and nodded their heads.<br/><br/>“Hehe!”<br/><br/>The leader of the Lightning race and the rest smiled and left immediately.<br/><br/>“This… what the leader and the rest mean is that they want some female disciples of our race to be together with senior brother Wang Xian!”<br/><br/>A middle-aged disciple could not help but speak up when he saw the leader and the rest leaving.<br/><br/>“Senior brother Wang Xian is a divine dragon and has such great potential. The leader naturally wants to keep senior brother Wang Xian here. Junior Sister Zhengyun, Hehe, you can seize this opportunity!”<br/><br/>A middle-aged man said to Lei Zhengyun with a twinkle in his eyes.<br/><br/>“Senior brother Wang Xian is very handsome and so powerful. If senior brother Wang Xian really likes me, Hehe, I will definitely not reject him. It’s a pity that senior brother Wang Xian is too outstanding. I’m afraid he won’t take a fancy to me!”<br/><br/>Lei Zhengyun’s face turned slightly red, but he spoke without any scruples.<br/><br/>“I feel that junior sister Yun Zi is very confident. Junior Sister Yun Zi is the goddess among the disciples!”<br/><br/>“It’s really possible. Let’s Go and call junior sister Yun Zi over. If any junior sister is able to be together with senior brother Wang Xian, I reckon that the clan leader will reward her handsomely. Hehe!”<br/><br/>“Let’s not talk about whether there are any rewards. Senior brother Wang Xian is so outstanding and handsome. I reckon that no junior sister would dislike him.”<br/><br/>The disciples discussed among themselves.\t\t\t\t\t\t</div>", "images": {}, "success": true}