{"id": 383, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072667.html", "title": "Chapter 3374 - 3374 2273 Locked Onto The Enemy And Was Hunting For The Dire Beasts", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3374 - 3374 2273 Locked Onto The Enemy And Was Hunting For The Dire Beasts</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3374 2273 locked onto the enemy and was hunting for the dire beasts<br/><br/>“Thank you for the Reminder!”<br/><br/>Wang Xian cupped his hands at the two lightning race experts guarding the formation. His body moved and he flew straight ahead.<br/><br/>Boom<br/><br/>Crackle<br/><br/>After flying for less than half an hour, there was a thunderstorm in front of him. There were black and purple clouds everywhere in the Thundercloud Domain. There were also frequent thunderstorms below.<br/><br/>The so-called thunderstorms were the Thunderbolts contained in the rainwater.<br/><br/>Wang Xian shuttled through the clouds. From time to time, an arc of lightning would strike his body and Polish it.<br/><br/>“Go Deeper!”<br/><br/>“Huala!”<br/><br/>Wang Xian muttered. In the next moment, a part of the thunder wings of the uninitiated holy wings appeared behind him.<br/><br/>At the position of his thunder wings, the Phantom image of the Thunder Dragon appeared. As it was stirred, it was like a divine dragon galloping.<br/><br/>Vaguely, the shadow of the Thunderbird could be seen on the Thunder Feathers.<br/><br/>Wang Xian continued to fly forward. Waves of powerful sensing force were transmitted from the Thunder wings.<br/><br/>He could sense which direction the power of the Thunder was stronger.<br/><br/>Following this sensing force, Wang Xian continued to fly in.<br/><br/>Half a month later, he arrived at the center of a Purple Thunder Cloud.<br/><br/>“I can sense a powerful force of lightning here. This force of lightning is very gentle. It should be helpful for cultivation!”<br/><br/>Wang Xian came to the Purple Thundercloud and muttered.<br/><br/>The Thunder Wings had a powerful sense of lightning. He could sense the gentle force of lightning. There should be a treasure here.<br/><br/>“Over here. Eh, I found it!”<br/><br/>After flying for an hour, Wang Xian saw a fruit in the void in front of him.<br/><br/>“This should be the Thunder Void Fruit!”<br/><br/>Wang Xian walked over and picked it up as he muttered.<br/><br/>In the sky above the heaven-splitting primordial land, the Void was much more stable than other places in the universe.<br/><br/>It was just like here. Unless Wang Xian unleashed all his strength, he wouldn’t be able to open the void crack.<br/><br/>It was impossible to teleport here.<br/><br/>“TSK TSK, the energy in this thunder void fruit is really huge. I can cultivate here for a period of time!”<br/><br/>Wang Xian didn’t continue to go deeper. This position was good enough for him.<br/><br/>He did not rely on the thunder wings to search for treasures either. The probability was too low and it was a waste of time.<br/><br/>After putting the Thunder void fruit into his mouth, Wang Xian immediately sat under the lightning and began to cultivate.<br/><br/>Streaks of lightning landed in his body and quickly converted into the energy in his body.<br/><br/>By relying on this method of cultivation, Wang Xian’s strength increased rapidly.<br/><br/>Buzz<br/><br/>Time passed day by day. Wang Xian sat cross-legged in the lightning and cultivated for more than two months.<br/><br/>However, on this day, a terrifying figure suddenly attacked Wang Xian who was cultivating cross-legged.<br/><br/>It had a long horn and a snake-like body.<br/><br/>The Thunder Horn Snake was a desolate beast that was very good at killing. It lived in the thunderclouds and hunted.<br/><br/>It had been staring at Wang Xian for two days. When it saw that Wang Xian was not moving at all, it launched an attack at this moment.<br/><br/>The Thunder Horn Snake had a level six attack power of a universe knight. Its attack was very terrifying and also very fast.<br/><br/>It hid in a bolt of lightning above Wang Xian and attacked him.<br/><br/>“You’re courting death!”<br/><br/>Wang Xian sensed the change in the lightning above him. He opened his eyes and looked over. His eyes were shining.<br/><br/>“Let’s test my ability to defeat enemies in the Void!”<br/><br/>He sat there with his legs crossed. A lightning sword on the lightning wings on his back attacked upwards.<br/><br/>“Bang!”<br/><br/>The lightning horns of the Lightning horned snake collided with the lightning sword, producing a crisp sound.<br/><br/>“Hiss! Hiss!”<br/><br/>Seeing that his attack had failed, the Lightning horned snake stuck out its tongue and didn’t linger. Lightning flashed on its body as it fled into the distance.<br/><br/>“Crackle crackle!”<br/><br/>At this moment, bolts of lightning landed on the thunder-horned snake’s body. Wang Xian waved his arm and grabbed at it with his thunder-dragon claws.<br/><br/>These thunder-dragon claws seemed to be equipped with navigation. No matter how the thunder-horned snake tried to dodge, it was still chasing after it.<br/><br/>“Hiss! Hiss! Hiss!”<br/><br/>The thunder-horned snake’s eyes were filled with fury. It swept its tail horizontally and bolts of purple lightning struck at the Dragon Claws.<br/><br/>Crackle! Crackle<br/><br/>The collision between the bolts of lightning was heard. Wang Xian waved his hand and a thunder dragon slowly condensed and chased after the thunder-horned snake once again.<br/><br/>Hiss! Hiss! Hiss<br/><br/>At this moment, the thunder-horned snake revealed a terrified expression. It immediately fled into the distance while the Thunder Dragon chased after it from behind.<br/><br/>Buzz! Buzz! Buzz<br/><br/>Soon, the thunder-horned snake pulled a distance away and disappeared in an instant. It then fled back to its nest.<br/><br/>However, the Thunder Dragon was still chasing after it, as if it wanted to kill its way to the thunder-horned Snake’s nest.<br/><br/>Wang Xian looked over, and his eyes sparkled.<br/><br/>Under his senses, the Thunder Dragon attack that he released flew for dozens of minutes. Finally, it was attacked by other Thunderbolts in the thunderclouds and disappeared completely.<br/><br/>“It really is a search for enemies in the void. As long as the opponent has not cleared the Thunder Energy left in its body, my attack can continue to chase after the opponent until its energy is exhausted.”<br/><br/>Wang Xian smiled.<br/><br/>With this method, he could chase the opponent to the location of the divine kingdom.<br/><br/>After a simple experiment, he closed his eyes and continued to meditate.<br/><br/>…<br/><br/>“Third senior sister, this thundercloud vulture is too difficult to capture. We finally met one and let it escape!”<br/><br/>At a location not far away, a female disciple of the thunderlight race said with a bitter expression.<br/><br/>“The Thundercloud Vulture is good at speed, and it’s rare. It’s very difficult to capture it. We only have a hundred Thundercloud Vultures.”<br/><br/>A middle-aged woman next to her shook her head with a smile.<br/><br/>“Yes, Junior Sister Zhengyun. It’s too difficult to get a thundercloud vulture. I think you should consider other battle pets.”<br/><br/>A dozen disciples beside him suggested.<br/><br/>“The potential of other battle pets is too low, and some are very ugly. Who would want such a battle pet!”<br/><br/>Lei Zheng Yun shook his head with a bitter expression.<br/><br/>“Then there’s nothing we can do. Unless we can meet a thunder cloud vulture with Knight Level 1 and Level 2 combat power, we’ll have a chance to capture it. Otherwise, it’ll be hard to capture a stronger one.”<br/><br/>“Moreover, it will be very difficult to tame it after capturing it!”<br/><br/>The lady who was addressed as third senior sister shook her head.<br/><br/>“Alright then. I wonder how that Wang Xian managed to capture the Thunder Cloud Vulture. His strength is the same as his thunder cloud vulture!”<br/><br/>Lei Zhengyun muttered to himself with a hint of unwillingness on his face.<br/><br/>“Eh.”<br/><br/>Third senior sister suddenly exclaimed in surprise when she heard her words. She looked towards the direction in front and said, “There’s someone in front!”<br/><br/>“Eh? It’s senior brother Wang Xian? What a coincidence!”<br/><br/>A middle-aged man looked over and revealed an astonished expression.\t\t\t\t\t\t</div>", "images": {}, "success": true}