{"id": 388, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072677.html", "title": "Chapter 3379 - 3379 Under The Shock Of The 2278 Disciples Of The Lightning Race", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3379 - 3379 Under The Shock Of The 2278 Disciples Of The Lightning Race</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3379 Under the shock of the 2278 disciples of the Lightning race<br/><br/>“Crash!”<br/><br/>The moment Wang Xian issued the warning, he immediately stood up and reminded everyone.<br/><br/>“Eh?”<br/><br/>All the disciples on the Thunder Mirror were slightly shocked. Even third senior sister looked around with a stunned expression.<br/><br/>“Crackle! Crackle!”<br/><br/>Wang Xian’s body trembled as bolts of lightning appeared around him.<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>At this moment, hundreds of meters long desolate beasts that were only as thick as a thumb attacked them.<br/><br/>There were more than a hundred of these desolate beasts.<br/><br/>“Oh no, it’s the lightning nematode worms. Everyone, be careful!”<br/><br/>Third senior sister’s expression changed slightly as she shouted loudly.<br/><br/>“There are three universe knight level seven lightning nematode worms. Be careful.”<br/><br/>Wang Xian glanced over and reminded.<br/><br/>He moved his palm and his entire arm turned into a dragon claw. A Thunder Dragon Claw clawed at the Thunder Nematodes.<br/><br/>Among them, his attack covered two universe knight level seven thunder nematodes.<br/><br/>“Three universe Knight Level Seven Thunder Nematodes?”<br/><br/>When all the disciples heard that, their expressions changed drastically.<br/><br/>“If you can’t defend against them, run back to your God country immediately!”<br/><br/>Third senior sister shouted. The Thunder mirror beneath her suddenly emitted a purple glow.<br/><br/>Streaks of lightning swept across the surroundings.<br/><br/>“Bang, Bang, Bang!”<br/><br/>On Wang Xian’s side, the huge dragon claws collided with dozens of thunder nematodes.<br/><br/>Especially the two thunder nematodes with the combat strength of a universe knight at level seven. When they collided with the Dragon Claws, dragon scales fell off and half of their bodies drilled into it.<br/><br/>“We can deal with them!”<br/><br/>Wang Xian shouted softly. With a wave of his hand, a thunder prison appeared in his hand.<br/><br/>The Thunder Prison was not formed from lightning. It was a acquired treasure.<br/><br/>This acquired treasure was obtained after he destroyed a bunch of powers. He had never used it.<br/><br/>Now, he could take it out and use it!<br/><br/>With a wave of his arm, the Thunder Prison instantly covered the two thunder nematodes.<br/><br/>The acquired Supreme Treasure was a great boost to a universe knight with level seven combat strength.<br/><br/>In addition, more than a month had passed, and Wang Xian’s thunder technique had reached its peak.<br/><br/>One on one, he could easily kill a universe knight with level seven combat strength.<br/><br/>With the help of the acquired Supreme Treasure Thunder Prison, the two thunder nematodes with level seven combat strength immediately felt the danger.<br/><br/>Their bodies flashed, trying to escape.<br/><br/>“Too Late!”<br/><br/>Wang Xian clenched his dragon claws, and bolts of lightning exploded.<br/><br/>The bodies of the two thunder nematodes trembled.<br/><br/>Weng<br/><br/>The Thunder Prison flew over and locked the two thunder nematodes inside. Waves of dense lightning energy attacked them continuously.<br/><br/>“Thunder Chains!”<br/><br/>He shouted softly, and bolts of lightning turned into chains and swept toward the surrounding thunder nematodes.<br/><br/>The powerful lightning instantly caught dozens of lightning nematodes.<br/><br/>Buzz! Buzz! Buzz<br/><br/>At the side, the rest of the lightning nematodes sensed the situation on Wang Xian’s side. Their eyes revealed a look of horror as they immediately fled into the distance.<br/><br/>“The body of a true dragon!”<br/><br/>“Eight dragon clones!”<br/><br/>Wang Xian swept his gaze over and his body trembled. He transformed into the form of a lightning dragon.<br/><br/>The Eight Thunder Dragon clones flew out from his body and attacked the group of thunder nematode worms.<br/><br/>“Stay here for me, Heavenly Lightning and Earth Net!”<br/><br/>Third senior sister saw Wang Xian transforming into a divine dragon and her body trembled. She shouted loudly and the Thunder mirror floated above her head. Bolts of lightning attacked the Thunder nematode worm which had the combat strength of a Level 7 universe knight.<br/><br/>“Bzzz bzzz!”<br/><br/>The eyes of the Thunder Worm revealed a look of horror.<br/><br/>“Towering Dragon Horn!”<br/><br/>Wang Xian growled in a low voice. The power of lightning gathered on the Dragon Horn and directly attacked the group of Thunder Worms.<br/><br/>“Crackle!”<br/><br/>In an instant, the entire area was engulfed by the Lightning. The Thunder Worms rolled in the void in pain.<br/><br/>“HMPH!”<br/><br/>Wang Xian snorted coldly. To attack them here and even think of escaping was wishful thinking.<br/><br/>Even if he didn’t unleash his other attributes, he could still keep all these lightning nematodes.<br/><br/>“Is this the Lightning Dragon? It’s too strong!”<br/><br/>Lei Zhengyun looked at Wang Xian’s divine dragon body with a shocked expression.<br/><br/>“I should be able to address him as senior brother Wang Xian!”<br/><br/>Third senior sister swept her gaze over and revealed a look of respect.<br/><br/>A acquired Supreme Treasure had trapped two thunder nematodes with the combat strength of a level seven universe knight. The powerful godly dragon body had also defeated over a hundred thunder nematodes.<br/><br/>Wang Xian’s strength was not something she could compare to.<br/><br/>“Perhaps even eldest senior brother might not be his match!”<br/><br/>Third senior sister muttered.<br/><br/>“Capture all these thunder nematodes!”<br/><br/>At this moment, they heard Wang Xian’s voice and immediately captured the Thunder nematodes one by one!<br/><br/>“Thunder nematodes are a very powerful weapon-type battle pet. Those three thunder nematodes with the combat strength of a universe knight at level seven are no less than a acquired treasure to a universe knight with the combat strength of level seven!”<br/><br/>A middle-aged man shouted excitedly.<br/><br/>Third senior sister’s eyes lit up when she heard this. She looked excited and immediately attacked the Thunder nematode worms.<br/><br/>The Thunder nematode worms were a very special type of desolate beast. They were very thin and were only the size of a thumb. Their length could be shortened and lengthened. They had a powerful piercing ability and could be used as a powerful weapon.<br/><br/>To a universe knight level seven powerhouse, it was comparable to an ordinary acquired supreme treasure.<br/><br/>Of course, there was still a huge gap between them and an acquired Supreme Treasure.<br/><br/>However, a thunder nematode of the same level could be used as a weapon to fight against two enemies.<br/><br/>Buzz<br/><br/>Wang Xian saw that all the thunder nematode worms were captured. He smiled and turned into a human form.<br/><br/>He came to the location of the Lightning prison and suppressed the two lightning nematodes inside. The rest of the lightning nematodes of other levels were also captured in his hands.<br/><br/>“Senior brother Wang Xian, more than a hundred lightning nematodes. This is a huge harvest. Haha, I’m Rich!”<br/><br/>“Senior brother Wang Xian is too powerful. How did your strength increase? Isn’t this too fast?”<br/><br/>The group of disciples held onto the lightning nematodes in their hands. They came to Wang Xian’s side with excited faces and spoke loudly.<br/><br/>“Here, keep them!”<br/><br/>Wang Xian smiled at them and passed the Lightning nematodes to third senior sister and the rest.<br/><br/>“Senior brother Wang Xian, it’s time for me to address you as senior brother!”<br/><br/>Third senior sister looked at the group of lightning nematodes and spoke sincerely.<br/><br/>Wang Xian didn’t mind. He gestured at them again and said, “Each of you should keep one that you can use. The rest should be given to the clan!”<br/><br/>“Senior brother Wang Xian, aren’t you going to keep one? This thunder nematode worm is extremely useful to us!”<br/><br/>Third senior sister said to him.<br/><br/>“I don’t need it. You guys can take it.”<br/><br/>Wang Xian shook his head.<br/><br/>“That’s great, that’s great. Thunder nematode worms. Thank you, senior brother Wang Xian!”<br/><br/>“Thank you, senior brother Wang Xian!”<br/><br/>The group of disciples cheered excitedly. This time, they had made a huge profit.<br/><br/>“Alright, let’s Go!”<br/><br/>Wang Xian waved his hand and said with a smile.\t\t\t\t\t\t</div>", "images": {}, "success": true}