{"id": 386, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072673.html", "title": "Chapter 3377 - 3377 2276 Lightning Race Disciples Were Shocked", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3377 - 3377 2276 Lightning Race Disciples Were Shocked</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3377 2276 lightning race disciples were shocked<br/><br/>In front of them, chains were binding the thundercloud vulture as it flew towards them.<br/><br/>The Thundercloud Vulture’s face was filled with fear as it let out a shrill cry.<br/><br/>All the lightning race disciples were dumbfounded!<br/><br/>What was going on?<br/><br/>What was going on with this thundercloud vulture?<br/><br/>Why was it bound by chains? How could it be bound?<br/><br/>Everyone looked at each other and stared at the restrained Thundercloud Vulture.<br/><br/>At the back, Wang Xian smiled when he saw this scene.<br/><br/>Locking down the enemy in the void, especially when the opponent was weaker than him, was very easy to kill or capture.<br/><br/>If the Thundercloud Vulture escaped back to his divine kingdom, Wang Xian might have to spend some effort to catch it. However, it didn’t have it, so it was easy.<br/><br/>The Thunderbolt chain chased after it and directly restrained it. Furthermore, it flew over automatically.<br/><br/>Whoosh<br/><br/>Wang Xian waved his arm and the thunderbolt chain brought the Thundercloud vulture over. He grabbed the chain.<br/><br/>“This… this…”<br/><br/>Lei Zhengyun widened his eyes as he looked at the Thundercloud vulture in front of him. His face was filled with disbelief.<br/><br/>“This… junior brother Wang Xian, what is this? Is this chain a powerful treasure?”<br/><br/>Third senior sister came to her senses and flew over. She pointed at the chain and asked with a shocked expression.<br/><br/>“No, it’s just a law attack!”<br/><br/>Wang Xian found an excuse and smiled. “I don’t want this thundercloud vulture. Who needs to take it away?”<br/><br/>“Wow, senior brother Wang Xian, aren’t you too powerful? You actually captured this thundercloud vulture so easily!”<br/><br/>Lei Zhengyun reacted and exclaimed in shock.<br/><br/>“SOB, SOB, sob. I really want this thundercloud vulture. It’s a pity that it’s too strong. I can’t suppress it!”<br/><br/>Very soon, she spoke in frustration.<br/><br/>“That’s right. Senior brother Wang Xian’s attack is too powerful. As expected of the Divine Dragon!”<br/><br/>A group of thunder ray disciples immediately surrounded him and exclaimed in amazement.<br/><br/>“This… junior brother Wang Xian, the Thundercloud Vulture is very precious. This thundercloud vulture was also obtained by you alone. If you want to make a move, the other senior brothers will give you a satisfactory price.”<br/><br/>Third senior sister stared at the Thundercloud Vulture with a twinkle in her eyes and said.<br/><br/>“I don’t need it either. I’ll give it to you.”<br/><br/>Wang Xian shook his head nonchalantly.<br/><br/>He didn’t lack cultivation resources. The only thing he lacked was a treasure with the Lightning attribute.<br/><br/>Of course, in reality, he didn’t lack this treasure too much. He had quite a number of treasures in his hands. He could easily buy some thunder treasures by selling them.<br/><br/>What he needed more was some time to polish the lightning attribute in his body.<br/><br/>“No.”<br/><br/>Third senior sister shook her head and looked at the people around her. Then, she landed on four or five people and asked, “Among the five of you, who wants this thundercloud vulture?”<br/><br/>“According to your strength, senior brother Ying is the most powerful. Let’s give it to senior brother Ying!”<br/><br/>A middle-aged man’s face changed and he said.<br/><br/>“I agree!”<br/><br/>The other middle-aged men and women also nodded in agreement.<br/><br/>“Thank you, Junior Brothers and sisters.”<br/><br/>The middle-aged man hesitated for a moment and did not reject. He said gratefully.<br/><br/>“Hehe, senior brother Ying, you should thank senior brother Wang Xian!”<br/><br/>A middle-aged man said with a smile.<br/><br/>“Thank you, senior brother Wang Xian. Thank you!”<br/><br/>This junior brother with the combat strength of a universe knight at level six bowed respectfully.<br/><br/>“No need.”<br/><br/>Wang Xian shook his head.<br/><br/>“Senior brother Wang Xian, I only have these treasures and cultivation resources with me for the time being. I will collect them for you when I return!”<br/><br/>He took out some cultivation treasures from his interspatial ring and handed them to Wang Xian.<br/><br/>“I want this thunder pearl. I don’t want the rest.”<br/><br/>Wang Xian took a thunder pearl casually and rejected the rest.<br/><br/>This time, he didn’t really join the Thunder Ray tribe. He only did it for Lei Yu.<br/><br/>Since he was misunderstood by the Great Elder and the rest, he decided to play along.<br/><br/>However, Wang Xian remembered this favor and would repay it in the future.<br/><br/>Helping the disciples of the Thunder Ray Tribe was nothing to him!<br/><br/>Wang Xian really didn’t take a fancy to these treasures.<br/><br/>“This… how can this be!”<br/><br/>The middle-aged man was stunned for a moment before he spoke.<br/><br/>“It’s alright. Let’s continue. Let’s see if we can encounter more Thundercloud Vultures!”<br/><br/>Wang Xian waved his hand.<br/><br/>“Thank you, senior brother Wang Xian. Thank you!”<br/><br/>The middle-aged man didn’t know how to thank him. He bowed.<br/><br/>“Senior brother Wang Xian is really generous. This thundercloud vulture is worth a lot!”<br/><br/>“That’s right, senior brother Ying. You owe senior brother Wang Xian a huge favor this time!”<br/><br/>“I know. I, Thundercloud Eagle, will repay you in the future!”<br/><br/>The group of disciples looked at Wang Xian in awe. They looked at senior brother Ying with Envy and said.<br/><br/>“Let’s continue. With junior brother Wang Xian around, we should be able to capture the desolate beasts as long as we encounter them!”<br/><br/>Third senior sister said with a smile.<br/><br/>Everyone nodded and continued to explore.<br/><br/>However, when they looked at Wang Xian, their faces were filled with respect.<br/><br/>“Senior brother Wang Xian, can you catch a Thundercloud Vulture for me? I want it too!”<br/><br/>Lei Zhengyun followed beside Wang Xian and pleaded.<br/><br/>“I can’t catch it just because I want to. If I can, I will definitely catch it for you.”<br/><br/>Wang Xian assured her with a smile.<br/><br/>“You said it!”<br/><br/>Lei Zhengyun’s eyes lit up as he looked at the lightning needle and his surroundings seriously.<br/><br/>“I have encountered a group of desolate beasts over here. Haha, brothers, come over quickly!”<br/><br/>Wang Xian searched while honing his lightning attribute. His strength was gradually increasing.<br/><br/>Ten days later, the excited voice of a disciple could be heard.<br/><br/>“Let’s go, senior brother Wang Xian!”<br/><br/>Lei zhengyun shouted excitedly.<br/><br/>“Alright!”<br/><br/>Wang Xian nodded his head. His body moved and he immediately flew towards the direction of the voice.<br/><br/>“Eh? This Is? Heavenly Thunder Horse?”<br/><br/>As Wang Xian got closer, he immediately noticed the group of Heavenly Thunder horses in front of him.<br/><br/>Heavenly Thunder Horses had a pair of thunder wings. Similarly, they were a type of war pet that the disciples of the Thunder Ray race yearned for very much.<br/><br/>Heavenly Thunder horses were only slightly weaker than Thundercloud vultures. However, they could still fight against those who were two levels above them.<br/><br/>There were more than 20 thunder horses in front of them. They were riding on thunder and looked very magical.<br/><br/>Compared to the Thunder Cloud Vulture, they were more suitable for mounts and looked very handsome.<br/><br/>At this time, more than 20 thunder horses were surrounding a purple fruit, which was emitting powerful thunder energy.<br/><br/>“24 thunder horses. Judging from the power they are emitting, there are four universe knights with level 6 battle strength, and the weakest one has level 3 battle strength!”<br/><br/>Third senior sister flew over and transmitted her voice. They carefully hid in the surroundings to prevent being discovered.<br/><br/>“We can do it!”<br/><br/>Wang Xian nodded and said.<br/><br/>“Okay, leave the four universe knights with level 6 thunder horses to me. The rest will be left to you guys. Catch as many as you can. There are too many of them. We can’t attack them together. Just attack them directly. Don’t be greedy!”<br/><br/>Third Senior Sister’s eyes flickered as she ordered.<br/><br/>“Yes!”<br/><br/>The disciples immediately replied.<br/><br/>Wang Xian smiled. Thunder Dragons slowly emerged from his body. There were five Thunder Dragons with long thunder chains on their tails.<br/><br/>“Attack!”<br/><br/>Third senior sister shouted and immediately rushed over to attack.\t\t\t\t\t\t</div>", "images": {}, "success": true}