{"id": 385, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072671.html", "title": "Chapter 3376 - 3376 2275, Locking Down Enemies And Hunting Desolate Beasts", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3376 - 3376 2275, Locking Down Enemies And Hunting Desolate Beasts</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3376 2275, locking down enemies and hunting desolate beasts<br/><br/>The three-tailed thunder fox was a common desolate beast in the Thunder Cloud region.<br/><br/>In terms of talent, it was weaker than the Thunder Cloud Vulture by a level.<br/><br/>However, the three-tailed thunder fox with a Knight Level 4 battle strength was still a decent battle pet.<br/><br/>“Just like before, surround them and keep attacking them to prevent them from escaping back to their old dynasty!”<br/><br/>Third senior sister ordered them.<br/><br/>“Yes!”<br/><br/>It was obviously not their first time hunting desolate beasts, they nodded heavily.<br/><br/>Two universe Knight Level 4 three-tailed thunder foxes were much weaker than them.<br/><br/>However, if they charged in recklessly, the two three-tailed thunder foxes would escape instantly. Even if third senior sister attacked, she was not 100% sure.<br/><br/>In this world where the strong preyed on the weak, every desolate beast that was able to grow up until now possessed a strong sense of vigilance. Otherwise, they would have died long ago.<br/><br/>Everyone stared at the two ten-meter-sized lightning foxes and spread out in the surroundings, preparing to surround them.<br/><br/>Wang Xian followed behind Lei Zhengyun and flew to the left.<br/><br/>Soon, they formed a circle.<br/><br/>“Do it!”<br/><br/>At this moment, third senior sister’s voice was transmitted into everyone’s mind.<br/><br/>They focused their gaze and locked onto the two three-tailed lightning foxes in front of them. In an instant, they rushed over.<br/><br/>“Crackle crackle!”<br/><br/>When they were halfway through their flight, the sound of thunder suddenly came from their surroundings.<br/><br/>The sound of Thunder was exceptionally ear-piercing.<br/><br/>“Ji Ji!”<br/><br/>In an instant, the two three-tailed lightning foxes scanned their surroundings. Without any hesitation, their figures started to turn illusory.<br/><br/>“Thunder Lock!”<br/><br/>Wang Xian’s gaze focused. The lightning in his hand instantly attacked the two three-tailed lightning foxes.<br/><br/>The attack power of these two lightning bolts was not strong, but their speed was abnormally terrifying. They arrived in front of the two three-tailed lightning foxes who were gradually turning illusory.<br/><br/>CHIRP CHIRP<br/><br/>The eyes of the two three-tailed lightning foxes revealed a look of fear. Their chance of escaping back to the divine kingdom was interrupted.<br/><br/>“Oh? What Fast Lightning!”<br/><br/>At this moment, third senior sister’s attack also arrived. When he saw Wang Xian’s lightning, a look of astonishment appeared on his face.<br/><br/>“Crackle crackle!”<br/><br/>Very soon, the two three-tailed lightning foxes were completely covered by the lightning and were easily captured.<br/><br/>To capture a dire beast of this level, the most important thing was to interrupt the time when they were returning to their divine kingdom. Once they were interrupted, they could be easily suppressed.<br/><br/>“Junior brother Wang Xian’s lightning is so fast.”<br/><br/>After the two three-tailed lightning foxes were captured, third senior sister walked over and said to Wang Xian.<br/><br/>“Not bad!”<br/><br/>Wang Xian smiled.<br/><br/>“This time, it’s all thanks to junior brother Wang Xian for interrupting the three-tailed lightning foxes’attack. He deserves 80% of the credit.”<br/><br/>Third senior sister said.<br/><br/>“No objections!”<br/><br/>The rest of the disciples didn’t have any objections.<br/><br/>Everyone had witnessed the situation just now. They were also very surprised by Wang Xian’s lightning speed.<br/><br/>Wang Xian smiled and didn’t mind.<br/><br/>“Eh? There’s something wrong with the lightning needle. There are still dire beasts nearby!”<br/><br/>At this moment, a middle-aged man at the side cried out in surprise.<br/><br/>“There really is a dire beast nearby. Let’s go and catch it!”<br/><br/>Lei Zhengyun looked at the Lightning needle in front of him and said loudly.<br/><br/>“Put away the two three-tailed lightning foxes. Let’s go and take a look!”<br/><br/>Third senior sister instructed immediately.<br/><br/>Wang Xian moved his body and the Lightning Wings appeared behind him. They trembled slightly.<br/><br/>“This way!”<br/><br/>His body moved and he flew over immediately. The rest of the disciples followed behind him immediately.<br/><br/>“Over there!”<br/><br/>Soon, Wang Xian and the rest saw a shadow. It was a desolate beast with wings.<br/><br/>“Thundercloud vulture, it’s a thundercloud vulture. Catch it quickly!”<br/><br/>Lei Zhengyun looked over. His eyes were glowing as he transmitted his voice to everyone.<br/><br/>“Give it a try. Catch it if you can!”<br/><br/>Third senior sister said to all the disciples.<br/><br/>This thundercloud vulture was in a flying state. It was unlike the three-tailed thunderfox that was lying in the Thundercloud and was surrounded by them.<br/><br/>It was impossible for them to surround this thundercloud vulture now. They could only pursue and kill it directly!<br/><br/>Whoosh<br/><br/>Wang Xian stared at the Thundercloud vulture. With a wave of his arm, dense thunderbolts flew towards the thundercloud vulture.<br/><br/>Chirp! Chirp<br/><br/>The Thundercloud Vulture noticed Wang Xian and the rest. It let out a low chirp as Thunderbolts flew towards it.<br/><br/>“Huala!”<br/><br/>“Catch him!”<br/><br/>The disciples of the Thunder Ray race immediately flew over. The bolts of lightning transformed into a net of lightning and tried to attack the Thunder Cloud Vulture.<br/><br/>“CHIRP CHIRP!”<br/><br/>The Thunder Cloud Vulture sensed their power and flapped its wings. It immediately fled into the distance.<br/><br/>“This thunder cloud vulture has the combat strength of a Level 5 universe knight. Be careful!”<br/><br/>Third senior sister looked over and reminded him loudly.<br/><br/>“Searching for enemies in the Void!”<br/><br/>Wang Xian sensed the lightning landing on the Thunder Cloud Vulture and smiled.<br/><br/>He stopped and stood there. Bolts of lightning condensed into a chain and waved toward the void.<br/><br/>“Senior brother Wang Xian, chase after it. Let your battle pet chase after it. There’s a chance to catch it!”<br/><br/>At the side, Lei Zhengyun shouted loudly when he saw that Wang Xian was standing there and did not chase after him.<br/><br/>Crash<br/><br/>Wang Xian ignored him and launched his attacks forward one after another.<br/><br/>Following that, he stood there and waited quietly.<br/><br/>“Oh no, its speed is too fast.”<br/><br/>At the front, a group of disciples from the Lightning race were chasing after the thundercloud vulture as they exclaimed in shock.<br/><br/>Within the Thundercloud, one’s line of sight would be greatly obstructed, and the lightning attribute cultivators would be greatly enhanced within.<br/><br/>They were already quite a distance away from the thundercloud vulture, so the Thundercloud Vulture didn’t linger at all and directly fled.<br/><br/>Even third senior sister wouldn’t be able to catch it in an instant.<br/><br/>Not to mention, this was a lightning zone, and all kinds of lightning were densely packed, so it was very easy to lose track of it.<br/><br/>However, when they were pursuing it, they didn’t notice that four or five lightning chains were flying towards the Thundercloud vulture.<br/><br/>“Hu, stop chasing it. If we keep chasing it, we won’t be able to catch it at all. Moreover, it’s easy to encounter danger!”<br/><br/>Third senior sister chased after it for two minutes and then stopped.<br/><br/>In this area, it was very dangerous to chase it recklessly.<br/><br/>There was a chance of catching it, but it was unnecessary to take the risk.<br/><br/>“We let it escape again!”<br/><br/>“The Thunder Cloud Vulture is too alert. It can detect us before we get close and escape immediately. Unless we encounter a level 1 or 2 knight, we can suppress it with our speed, otherwise, it will be very difficult to catch it!”<br/><br/>The disciples of the Thunder Light race shook their heads and said helplessly.<br/><br/>In this special environment, it was better to hunt other desolate beasts. However, the Thunder Cloud Vulture was very troublesome.<br/><br/>The disciples stopped in the air and shook their heads.<br/><br/>“CHIRP CHIRP CHIRP!”<br/><br/>However, at this moment, an urgent sound was getting closer and closer. Everyone was slightly shocked and immediately turned to look.<br/><br/>“This… This Is?”<br/><br/>Suddenly, they opened their eyes wide and looked ahead in shock.\t\t\t\t\t\t</div>", "images": {}, "success": true}