{"id": 380, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072661.html", "title": "Chapter 3371 - 3371 On The 2270 Uninitiated Holy Wings", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3371 - 3371 On The 2270 Uninitiated Holy Wings</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3371 On the 2270 uninitiated holy wings<br/><br/>The interior of the main hall was decorated very luxuriously. Wang Xian scanned the surroundings and was very satisfied with the interior.<br/><br/>He did not take out the uninitiated holy wings immediately. After observing for a while, he took a look at the information given to him by the chief elder of the Thunder Ray tribe.<br/><br/>He looked through all the information regarding the rules of the Thunder Ray tribe and the Thunder Ray tribe.<br/><br/>In this unfamiliar place, Wang Xian had to pay more attention.<br/><br/>“Clan leader!”<br/><br/>Just as Wang Xian was reading all sorts of information, in the main hall of the Lightning race, there was a huge hall bathed in lightning. From Afar, it looked majestic.<br/><br/>The chief elder of the Lightning race was standing in a room in the side room of the hall. He bowed respectfully to the chief of the Lightning race.<br/><br/>“HMM? What happy event made you call me here so urgently?”<br/><br/>The chief of the Thunder Ray tribe sat on the chair and asked the chief elder with a smile on his face.<br/><br/>“Chief, about today’s recruitment of disciples, this time we had an accident…”<br/><br/>The chief elder happily reported everything that happened today to the chief.<br/><br/>“HMM?”<br/><br/>When the clan leader of the Thunder Ray tribe heard his words, he slightly raised his eyebrows and his eyes flickered, “Very good, you did well in this matter. At such a young age and with such strength, there is a high possibility that you are a purebred divine dragon.”<br/><br/>“You arrange for the disciples of our Thunder Ray tribe to have more contact with him. It doesn’t matter if you want to spar with him or cultivate together. Oh, especially the female disciples.”<br/><br/>The tribe leader said with a face full of words as he gently lifted his chair.<br/><br/>“Hehe, it’s the tribe leader. I know what to do!”<br/><br/>The great elder smiled and nodded.<br/><br/>If the other party was a purebred divine dragon, their thunder ray tribe would hope that he could marry and have children with them. If a purebred divine dragon or a powerful dragon was born, it would be extremely beneficial to their thunder ray tribe.<br/><br/>“Yes, treat him better. If you want treasures, give them to me. If you want resources, give them to me. Even if he runs away, we will only lose some things. But as long as he doesn’t run away, we will earn a lot.”<br/><br/>“Of course, we have to check his temperament.”<br/><br/>The Thunder Ray race leader continued to instruct.<br/><br/>The first elder of the Thunder Ray race nodded slightly.<br/><br/>…<br/><br/>In the main hall where Wang Xian was staying, he read through all the information and muttered.<br/><br/>He sat cross-legged in the cultivation room. His eyes flickered slightly. He contacted the Dark Intense Heaven Formation and drew a formation.<br/><br/>Buzz<br/><br/>Soon, the figures of the Dark Intense Heaven Formation and the Heaven Formation appeared.<br/><br/>“Dragon King!”<br/><br/>The two of them immediately bowed.<br/><br/>“Heaven Formation, set up some shielding formations in this room. If anyone comes in, inform me immediately when you return to the Dragon Palace.”<br/><br/>Wang Xian immediately instructed the heaven formation.<br/><br/>“It’s the Dragon King!”<br/><br/>The Heaven Formation replied.<br/><br/>Wang Xian nodded. The next moment, his figure disappeared and returned to the Dragon Palace.<br/><br/>“I’m Suffocating!”<br/><br/>After coming out, Wang Xian released his spirit. He ignored the little guy and went straight to the Dragon King’s palace.<br/><br/>Buzz<br/><br/>His body trembled. Wang Xian took out 27 lightning feathers.<br/><br/>The last 27 lightning feathers.<br/><br/>Crash<br/><br/>The uninitiated holy wings appeared on his back. With a slight flap, the 27 lightning feathers flew back automatically.<br/><br/>“Crackle!”<br/><br/>When the 27 thunder feathers landed on the wings, the power of lightning started to circulate. Streaks of lightning intersected with each other.<br/><br/>Wang Xian stood there and sensed it quietly.<br/><br/>The Thunder Feathers had already started to return to the uninitiated holy wings. Wang Xian could sense that a majestic lightning was being nurtured and reborn.<br/><br/>However, he needed to nurture the thunder feathers for a period of time before they could be completely integrated.<br/><br/>“Roar!”<br/><br/>On the incipient saint wings, Wang Xian’s thunder attribute avatar slowly poked his head out and let out a roar.<br/><br/>He began to swim on it.<br/><br/>One was a thunder wing while the other was a wind attribute. The two wings were placed on his back and were flapping slowly.<br/><br/>Gradually, Wang Xian realized that the two thunder and wind attribute avatars were slowly integrating.<br/><br/>This fusion was not about fusing into one, but the fusion of energy.<br/><br/>The speed of the fusion was very slow, and it would take some time.<br/><br/>“It will take at least a month!”<br/><br/>Wang Xian muttered as he sensed the speed of the fusion behind him.<br/><br/>A month later, the complete uninitiated holy wings would appear.<br/><br/>“The power of Thunder in my body is constantly increasing. It Won’t be long before I can have the combat strength of a level seven universe knight by relying on the power of thunder and my physical body.”<br/><br/>He calculated in his heart and nurtured the primaless holy wings with all his strength, waiting for it to complete.<br/><br/>“Dragon King, someone has entered your palace!”<br/><br/>Three days passed very quickly. A message came from the sky array.<br/><br/>“HMM?”<br/><br/>Wang Xian opened his eyes. His eyes were sparkling as he shouted, “Sky array!”<br/><br/>Buzz<br/><br/>The figure of the sky array appeared. The next moment, he returned to the main hall of the Lightning race.<br/><br/>He immediately used the silver-white special metal to conceal his energy and flew out.<br/><br/>“Eh? Junior brother Wang Xian is cultivating inside?”<br/><br/>At the entrance of the main hall, more than a hundred disciples of the Lightning race were standing in front.<br/><br/>The middle-aged man in the lead looked in with doubt.<br/><br/>“He’s Out!”<br/><br/>At this moment, a woman beside him spoke and looked in front curiously.<br/><br/>“Greetings to all of you. Sorry, I’m in the middle of my cultivation!”<br/><br/>Wang Xian came out from the main hall. When he saw the group of lightning race disciples at the entrance, he greeted them with a smile and cupped his hands.<br/><br/>“No wonder junior brother Wang Xian is able to possess such strength at such a young age. He is really hardworking in his cultivation. It’s our fault for disturbing you!”<br/><br/>The middle-aged man in the lead smiled and cupped his hands at Wang Xian.<br/><br/>“I’m not disturbing you, I’m not disturbing you. It’s me who lost track of time. The Great Elder has already informed me in advance!”<br/><br/>Wang Xian shook his head and invited, “Fellow brothers and sisters, do you want to come in and have a seat?”<br/><br/>“No, no, no. We are here to get to know junior brother Wang Xian. Naturally, we would like to invite junior brother Wang Xian to our place. Let’s go, we have prepared some good wine and dishes from the lightning race. I guarantee that you have never eaten them before!”<br/><br/>The middle-aged man waved his hand and invited him.<br/><br/>“Sorry to Bother You Then!”<br/><br/>Wang Xian smiled and nodded his head.<br/><br/>“Come, junior brother Wang Xian, let me introduce all of you. In the future, we will be a family in the Lightning race. If you need anything, you can come to us directly. In a while, we will contact the AI of the universe. If there is anything, you don’t have to be polite to us, junior brother Wang Xian.”<br/><br/>As the middle-aged man spoke, he introduced the surrounding disciples to Wang Xian one by one.<br/><br/>From the middle-aged man’s introduction, Wang Xian also learned of the middle-aged man’s identity.<br/><br/>He was the fourth senior brother of the Thunder Ray tribe. His strength was ranked fourth among the disciples.<br/><br/>Among the disciples who came, he was the strongest. The top three senior brothers and sisters did not come this time.<br/><br/>“That Wang Xian… senior brother, are you a divine dragon? A purebred divine dragon? You are so young, how can you be so powerful? You are so freakish. You are much more powerful than me!”<br/><br/>When they arrived at an entertainment venue for the disciples, Lei Zhengyun couldn’t help but ask Wang Xian from the side.\t\t\t\t\t\t</div>", "images": {}, "success": true}