{"id": 391, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072683.html", "title": "Chapter 3382 - 3382 2281 Among The Eldest Senior Brothers Of The Thunder Ray Race", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3382 - 3382 2281 Among The Eldest Senior Brothers Of The Thunder Ray Race</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3382 2281 among the eldest senior brothers of the Thunder Ray race<br/><br/>“Did you hear? Senior brother Wang Xian is instructing a group of disciples in the martial arts practice field. Many female senior brothers and sisters are there!”<br/><br/>“You just found out. I heard that even senior sister Lei Yunzi is serving senior brother Wang Xian tea. Ahhh, my goddess!”<br/><br/>“Senior brother Wang Xian is ranked third on the ranking list of the disciples of our Thunder Ray race. He is simply a monster!”<br/><br/>The news of Wang Xian teaching a group of disciples in the martial arts practice field spread quickly. Many disciples rushed over upon hearing the news.<br/><br/>Since Wang Xian had decided to teach them and repay the Great Elder’s kindness, he was not impatient at all.<br/><br/>In the heaven-opening and Primal Chaos Continent, there was no distinction between night and night. Age was calculated according to the era.<br/><br/>Therefore, ten days to half a month might just be the time for them to think about a problem.<br/><br/>It would take them a few months to travel casually here. One could imagine how worthless time was.<br/><br/>Wang Xian continued to teach for five days. Later, more disciples rushed over.<br/><br/>He didn’t mind and patiently taught them one by one.<br/><br/>This allowed his prestige to rise rapidly in front of the disciples of the Lightning race.<br/><br/>At this moment, more than a thousand disciples gathered in the martial arts practice field. All of them were looking at the figure sitting in front of them with admiration.<br/><br/>“Senior brother Wang Xian is so powerful. He can easily point out any difficulties in his cultivation. He’s too powerful!”<br/><br/>“Yeah, I feel that he’s even more powerful than eldest senior brother!”<br/><br/>“Eldest brother? I feel that he’s even more powerful than our elders. You must know that even fourth senior sister is asking senior brother Wang Xian for advice!”<br/><br/>Some of the surrounding disciples were discussing in low voices.<br/><br/>“Senior brother Wang Xian, have some tea.”<br/><br/>Beside Wang Xian, Lei Yunzi, Lei Zhengyun and the rest were talking enthusiastically.<br/><br/>Wang Xian smiled faintly. He looked at the disciples in front of him and gave him some advice.<br/><br/>“That Wang Xian is too strong. Let’s report this matter to eldest senior brother!”<br/><br/>“HMM, from the look of senior brother Lei Yunzi, he must have a good impression of that Wang Xian. If eldest senior brother knew about this, he would definitely be furious!”<br/><br/>“He should teach Wang Xian a good lesson!”<br/><br/>Three middle-aged men at the side transmitted their voices to each other.<br/><br/>Although his current strength had not reached the level of a level eight universe knight, he was almost invincible among level seven universe knights.<br/><br/>The three of them had obtained a lot of benefits from following the eldest senior brother.<br/><br/>Now, they could be ranked in the top 20 among the group of disciples.<br/><br/>They knew that their eldest senior brother liked Lei Yunzi.<br/><br/>They would also report to their eldest senior brother on the situation regarding Lei Yunzi in a timely manner.<br/><br/>Now that Lei Yunzi was so attentive to Wang Xian, it was definitely a big deal for their eldest senior brother. If they didn’t report to him immediately, he would definitely punish them afterward.<br/><br/>The three of them exchanged a glance and left immediately.<br/><br/>They had absolute confidence in their eldest senior brother’s strength.<br/><br/>Previously, second senior brother and third senior sister were Frank. Even if they joined forces, they weren’t a match for eldest senior brother.<br/><br/>One could imagine how strong eldest senior brother’s strength was!<br/><br/>“Oh? Is What You Said True?”<br/><br/>Half an hour later, in the Thunder Ray grotto-heaven above the main hall of the Thunder Ray Tribe!<br/><br/>This grotto-heaven was the most powerful grotto-heaven of the Lightning race, and it was also the most important one.<br/><br/>However, not everyone could cultivate here.<br/><br/>Among the disciples, only the most powerful eldest senior brother or eldest senior sister had the qualifications to cultivate here.<br/><br/>At this moment, a burly middle-aged man flew out from inside.<br/><br/>The middle-aged man had an unangry look on his face and was surrounded by lightning. At this moment, he asked with a gloomy expression.<br/><br/>“Eldest senior brother, we only came to report after we went to investigate!”<br/><br/>A middle-aged man said respectfully.<br/><br/>They were filled with reverence towards eldest senior brother.<br/><br/>Among the group of disciples, eldest senior brother was the strongest existence in the current generation.<br/><br/>“Wang Xian? Tell me all the information about him. The martial arts practice field is teaching disciples. Humph, I would like to experience it!”<br/><br/>As eldest senior brother spoke, he snorted lightly and flew directly in the direction of the Thunder Ray Race’s Disciple’s martial arts practice field.<br/><br/>The three middle-aged men immediately followed behind and told eldest senior brother all the information about Wang Xian.<br/><br/>“A purebred divine dragon? Less than 20 eras? The combat strength of a universe knight at level seven?”<br/><br/>When eldest senior brother heard the information about Wang Xian, his expression changed slightly.<br/><br/>“HMPH, all the heaven’s favorites are still weaklings before they become strong!”<br/><br/>He was silent for dozens of seconds before he snorted coldly with a sullen face.<br/><br/>However, there was a hint of pressure in his eyes.<br/><br/>Whoosh<br/><br/>When they arrived at the Lightning Race’s martial arts practice field, eldest senior brother scanned his surroundings.<br/><br/>“Eldest senior brother, this way!”<br/><br/>The three of them brought him to the martial arts practice field.<br/><br/>Around them, there were some disciples walking towards that place.<br/><br/>“Eh? Eldest senior brother, greetings, eldest senior brother!”<br/><br/>“Greetings, eldest senior brother!”<br/><br/>When some of the disciples saw their eldest senior brother, they were slightly shocked and quickly greeted him with respect.<br/><br/>Eldest senior brother did not say anything and walked straight in.<br/><br/>“Wow, that junior brother is really lucky. He actually made a breakthrough on the spot under the guidance of senior brother Wang Xian!”<br/><br/>“It’s senior brother Wang Xian who is too powerful. He is simply invincible!”<br/><br/>The moment they entered, they heard exclamations coming from the front.<br/><br/>Eldest senior brother frowned slightly and looked forward.<br/><br/>When he saw Lei Yunzi who was standing beside a young man, his expression changed slightly.<br/><br/>He had liked Lei Yunzi for a long time, but his attitude towards him was very ordinary.<br/><br/>Now that he saw Lei Yunzi looking at the disciple named Wang Xian with admiration, he clenched his fists slightly.<br/><br/>“Eldest senior brother, you have to calm down. The elders in our family have instructed us to befriend this Wang Xian!”<br/><br/>The three middle-aged disciples at the side sensed the aura emitted from him and immediately reminded him.<br/><br/>“Only by sparring between disciples can we improve better!”<br/><br/>Eldest senior brother’s gaze was a little cold as his figure moved slightly.<br/><br/>“Next problematic disciple, come up!”<br/><br/>At this moment, Wang Xian’s voice sounded.<br/><br/>In the middle, the young man bowed with an excited face and walked to the side.<br/><br/>“I have…”<br/><br/>A female disciple was about to go up when she suddenly saw a figure appearing in the middle. She was slightly stunned.<br/><br/>“I have a cultivation problem!”<br/><br/>The eldest senior brother who came to the middle stared at Wang Xian and asked faintly.<br/><br/>“Eh? This is… This is the eldest senior brother!”<br/><br/>“What is the eldest senior brother doing here? Is he here to consult senior brother Wang Xian? This…”<br/><br/>“Does the eldest senior brother need to consult senior brother Wang Xian about his strength?”<br/><br/>The sudden appearance of the eldest senior brother in the middle shocked all the surrounding disciples.<br/><br/>Lei Yunzi, who was beside Wang Xian, was slightly stunned. Then, he frowned slightly.<br/><br/>“Ask Away!”<br/><br/>When Wang Xian heard the discussions around him, he raised his eyebrows slightly and took a sip of tea.\t\t\t\t\t\t</div>", "images": {}, "success": true}