{"id": 390, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072681.html", "title": "Chapter 3381 - 3381 2280. The First Senior Brother Of The Lightning Race", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3381 - 3381 2280. The First Senior Brother Of The Lightning Race</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3381 2280. The first senior brother of the Lightning race<br/><br/>“Junior sister Yun Zi, junior sister Yun Zi!”<br/><br/>On the mountain where the disciples of the Lightning race lived, because of the order of the elders, the third senior sister, no, it should be the fourth senior sister and the others who came to the palace where Lei Zi Yun lived.<br/><br/>“En? Senior Sisters, Senior Brothers, what’s the matter?”<br/><br/>Lei Zi Yun came out of his palace and looked at them with a stunned face. He immediately called out to them.<br/><br/>At this moment, besides fourth senior sister and a dozen others, there were also forty to fifty female disciples of the Lightning race.<br/><br/>All of them were single and beautiful disciples.<br/><br/>“Junior sister Yun Zi, it’s an order from the clan leader and elders. Let us call out to you.”<br/><br/>Fourth senior sister said to him with a smile.<br/><br/>“Huh? Why are you calling out to me?”<br/><br/>Lei Yunzi asked with a surprised expression.<br/><br/>“To give senior brother Wang Xian the Thunder heart grass that the clan gave her as a reward!”<br/><br/>Fourth senior sister replied.<br/><br/>“Thunder Heart Grass?”<br/><br/>Lei Yunzi revealed a shocked expression. “This, why do you want me to… Let us give it to him?”<br/><br/>“Hehe, junior sister, Can’t you tell? The clan leader wants us to get in touch with senior brother Wang Xian to see who can get along with senior brother Wang Xian!”<br/><br/>A female disciple said with a smile.<br/><br/>“This…”<br/><br/>This made Lei Yunzi slightly stunned. She naturally knew about senior brother Wang Xian, who had just joined their thunder ray tribe. She also knew that he was a divine dragon disciple of the ancestral dragon lineage.<br/><br/>However, what made her astonished was that the clan leader had personally pulled the strings. This made her feel a little…<br/><br/>“Alright, I have no choice but to obey the orders of the clan leader!”<br/><br/>Lei Yunzi smiled and walked over.<br/><br/>“Fourth senior sister, I heard that senior brother Wang Xian’s strength is above yours. Wow, this is too amazing. Senior brother Wang Xian is much, much younger than us!”<br/><br/>The group of female disciples were discussing with sparkling eyes.<br/><br/>Most of them had never seen Wang Xian’s appearance before. They were also filled with curiosity and their eyes lit up!<br/><br/>“Eh? What are these girls doing?”<br/><br/>“I don’t know. Senior Sister Lei Yunzi is also here. She is the goddess among our disciples. I heard that even eldest senior brother is interested in her. I wonder if it’s true!”<br/><br/>In the surrounding area, some of the disciples were discussing among themselves when they saw the beautiful girls.<br/><br/>“Senior brother Wang Xian, I’m sorry to disturb you!”<br/><br/>The group of people came to the front of Wang Xian’s palace quickly and spoke.<br/><br/>“Eh?”<br/><br/>In the palace, Wang Xian was studying how to fuse the nine attributes. When he heard the voices outside, he raised his eyebrows and said, “Please come in!”<br/><br/>“Let’s go and see what senior brother Wang Xian looks like!”<br/><br/>“Hehe, senior brother Wang Xian should be a little dragon, right?”<br/><br/>The group of girls immediately flew into the palace. Their eyes were filled with excitement.<br/><br/>Wang Xian came to the welcoming hall. When he heard the faint voice coming from the front, his face turned black.<br/><br/>A fragrant smell came. He looked over and saw that most of them were female disciples.<br/><br/>This made him slightly stunned.<br/><br/>“Wow, senior brother Wang Xian looks so handsome. He has an extraordinary bearing!”<br/><br/>A female disciple commented with a smile.<br/><br/>The rest of the female disciples were also sizing him up.<br/><br/>“Senior brother Wang Xian, sorry to disturb you. In the name of the Clan Elder, we are here to deliver a treasure to senior brother. This is a reward from the clan for senior brother!”<br/><br/>Fourth senior sister smiled and looked at Lei Yunzi who was beside her.<br/><br/>Lei Yunzi looked at her and then at Wang Xian. She walked forward and handed it over.<br/><br/>“Reward?”<br/><br/>Wang Xian looked at the treasure box in Lei Yunzi’s hand with a curious look in his eyes.<br/><br/>He took it and opened it to take a look. When he saw the Thunder heart grass inside, there was a hint of surprise in his eyes.<br/><br/>Just by looking at the Lightning Energy on it, one could tell that it was very precious.<br/><br/>“I’ll have to trouble you all to send it over!”<br/><br/>Wang Xian said with a smile.<br/><br/>“There’s no need to thank senior brother Wang Xian. Senior brother, can we ask you a question?”<br/><br/>A female disciple asked with a smile.<br/><br/>“Sure!”<br/><br/>Wang Xian looked at her and nodded.<br/><br/>“Senior brother Wang Xian, how did you cultivate? How did you improve so quickly?”<br/><br/>She asked immediately.<br/><br/>“Well… I improved just by cultivating!”<br/><br/>Wang Xian said. He couldn’t possibly say that he had a system, right?<br/><br/>“You’re too discouraging. Senior brother Wang Xian, can you teach us some lightning techniques in the future?”<br/><br/>The female disciple continued to ask.<br/><br/>“No problem. If there’s anything you don’t understand, you can come and ask me!”<br/><br/>Wang Xian nodded.<br/><br/>With the Lightning Dragon’s technique and the wind and Thunder Bird’s understanding of lightning techniques, Wang Xian’s foundation in the convenience of lightning was much better than the lightning race.<br/><br/>“Really? Then can we come over anytime?”<br/><br/>A female disciple beside him asked with sparkling eyes.<br/><br/>“Yes, for the time being. I don’t have anything to do now!”<br/><br/>Wang Xian pondered for a moment and agreed.<br/><br/>At present, he had found all of Lei Yu. Indeed, he didn’t have anything to do.<br/><br/>“That’s great. Since we don’t have anything to do now, senior brother Wang Xian will teach us a thing or two!”<br/><br/>Fourth senior sister also said with a smile.<br/><br/>“Alright, let’s go inside the training ground!”<br/><br/>Wang Xian said.<br/><br/>“Let’s go, Let’s Go!”<br/><br/>The group of female disciples immediately said excitedly.<br/><br/>Following them, Wang Xian came to the spot where the disciples of the Lightning race were sparring with each other to practice their lightning techniques.<br/><br/>There were many disciples in the training ground. When they saw them, all of them revealed curious expressions.<br/><br/>Wang Xian and the rest came to a separate training ground.<br/><br/>“If you guys have anything to say, I can tell you guys if I know anything!”<br/><br/>Wang Xian stood in the middle and spoke to them.<br/><br/>With his current strength, he was qualified to teach them.<br/><br/>“Let me do it, senior brother Wang Xian.”<br/><br/>A female disciple immediately stretched out her hand and asked a question.<br/><br/>Wang Xian replied without hesitation.<br/><br/>“Eh, it’s true.”<br/><br/>Very soon, the female disciple exclaimed and nodded her head.<br/><br/>“Senior brother Wang Xian, I have created a lightning technique. I want to cultivate it into a law form to help me achieve a breakthrough. What do you think?”<br/><br/>Soon, another female disciple asked seriously.<br/><br/>Wang Xian nodded his head. He looked over and explained to her.<br/><br/>After instructing a few female disciples consecutively, the eyes of the other female disciples shone brightly. Even fourth senior sister was astonished. After hesitating for a moment, she also asked a question.<br/><br/>This question was easily solved by Wang Xian.<br/><br/>This surprised all the disciples. Among the group of disciples, some had a master while others had their parents and elders to guide them.<br/><br/>However, their masters and parents were mostly at the seventh or eighth level of a universe knight, while the ninth level was extremely rare.<br/><br/>Their masters and parents’understanding of lightning was completely inferior to Wang Xian’s.<br/><br/>“Senior brother Wang Xian, do you know the way of a Saint? I encountered a problem when I integrated the way of a saint into lightning!”<br/><br/>Not long after, Lei Yunzi couldn’t help but ask Wang Xian.<br/><br/>“The way of a Saint?”<br/><br/>When Wang Xian heard her question, he frowned slightly. “I don’t know much about the way of a saint, but a friend gave me a painting.”<br/><br/>As he spoke, he took out a painting that the scholar on the ship had given him. This painting was drawn by him and was one of his best paintings. He could comprehend some of the ways of a saint from it.<br/><br/>“Take a look at this painting. The Great Dao is the same. Using words and paintings to trigger lightning requires one to master the laws and rules within.”<br/><br/>Wang Xian added.<br/><br/>“HMM?”<br/><br/>Lei Yunzi’s eyes lit up when he saw this painting. He revealed an excited expression and said immediately, “Thank you, senior brother Wang Xian!”\t\t\t\t\t\t</div>", "images": {}, "success": true}