{"id": 393, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072687.html", "title": "Chapter 3384 - 3384 2283 Wang Xian, The Eldest Senior Brother", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3384 - 3384 2283 Wang Xian, The Eldest Senior Brother</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3384 2283 Wang Xian, the eldest senior brother<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>“D * mn, the eldest senior brother and Wang Xian are really fighting!”<br/><br/>“This… although senior brother Wang Xian is a divine dragon, he has just stepped into the seventh-level combat strength of a universe knight. How can he be a match for the eldest senior brother!”<br/><br/>“He actually dares to compete with the eldest senior brother. He’s too arrogant!”<br/><br/>As the battle erupted, more and more disciples flew over from the surroundings.<br/><br/>When they saw the two people who were already fighting in the arena, a look of astonishment appeared on their faces.<br/><br/>“Buzz Buzz Buzz!”<br/><br/>At this moment, four to five figures suddenly appeared at the side of the arena.<br/><br/>Four to five old men appeared faintly as they stared at the position of the arena.<br/><br/>“This Wang Xian disciple is a little arrogant. Yun Tian is after all the eldest senior brother of our Thunder Ray race. He was nurtured by our thunder ray race with all our strength. Although that Wang Xian disciple has boundless potential, he is still too inexperienced to challenge Yun Tian!”<br/><br/>The four elders were all elders of the Thunder Ray race.<br/><br/>One of the elders looked over and said faintly.<br/><br/>“Second elder, that might not be the case. Wang Xian’s disciple is not an ordinary race. Even if he is at the peak, he is still a Peerless Heaven’s favorite.”<br/><br/>In the middle, the first elder shook his head. Looking at Wang Xian who was controlling the Thunder Dragon to fight against Lei Yuntian, his eyes flickered slightly.<br/><br/>“Hehe, first elder, I don’t believe that a disciple who hasn’t even reached the 20th century can defeat our thunder ray race’s first senior brother. If that’s the case, we old fellows will have lived in vain!”<br/><br/>The second elder frowned slightly and said.<br/><br/>He didn’t believe that Wang Xian was Lei Yuntian’s match.<br/><br/>Lei Yuntian was the most talented disciple of their thunder ray race, and he had cultivated for tens of times longer than Wang Xian.<br/><br/>Wang Xian had just broken through to level seven universe knight not long ago, even though he was a purebred divine dragon.<br/><br/>Deep down in his heart, he didn’t want to believe that Wang Xian was Lei Yuntian’s disciple. He also hoped that Lei Yuntian would win.<br/><br/>Otherwise, this would be too much of a blow to them!<br/><br/>Many of the surrounding disciples had the same thoughts as second elder.<br/><br/>They were all creatures from the heaven-opening and primal continent, but the divine dragon was only one level higher than their bloodline. If eldest senior brother was defeated, it would be a huge blow to them.<br/><br/>“Eldest senior brother is the strongest. If senior brother Wang Xian wants to defeat eldest senior brother, he will need at least ten more epochs!”<br/><br/>Some disciples cheered for eldest senior brother.<br/><br/>Buzz! Buzz<br/><br/>At this moment, two figures slowly appeared beside the few elders.<br/><br/>“Yun Tian is much weaker in the control of the lightning technique. With such terrifying talent, even the disciples of the peak races would find it hard to produce such a perverse existence!”<br/><br/>The appearance of two figures made the few elders slightly shocked.<br/><br/>“Clan leader, Grand Supreme!”<br/><br/>They hurriedly shouted respectfully.<br/><br/>The clan leader and Grand Supreme Elder of the Thunder race waved their hands.<br/><br/>“This… clan leader, Grand Supreme, how is this possible? No matter how strong that Wang Xian’s disciple is, it’s impossible for him to defeat Yun Tian. How long has it been since he broke through?”<br/><br/>The second elder said in disbelief.<br/><br/>“Continue to watch!”<br/><br/>The eyes of the clan leader of the Lightning race flashed.<br/><br/>“Get lost!”<br/><br/>In the middle of the arena, Lei Yuntian held a thunder hammer and a thunder awl. It was as if a god of Thunder had descended.<br/><br/>With a cold expression, he flew directly to the top of the Thunder Dragon. The terrifying power of the Thunder struck directly at the Thunder Dragon.<br/><br/>Buzz<br/><br/>At the bottom of the arena, the Thunder wings on Wang Xian’s back quivered. Streaks of thunder connected to the Thunder Dragon.<br/><br/>The Lightning Dragon’s horns emitted a bright glow as it charged forward.<br/><br/>Below him, the huge lightning prison was heading straight for him.<br/><br/>Boom<br/><br/>A violent collision sound rang out as the terrifying lightning caused tiny cracks to appear in the void.<br/><br/>Lei Yuntian’s figure hurriedly retreated backward to avoid the attack of the Lightning prison.<br/><br/>“Law projection, Lightning Flash Nine Heavens!”<br/><br/>Seeing that the Lightning Dragon still contained a terrifying power, his face darkened and he let out a low roar!<br/><br/>The law form was activated.<br/><br/>“Crackle crackle!”<br/><br/>Nine bolts of lightning, each more terrifying than the last, landed directly on the Lightning Dragon.<br/><br/>“The power of this law form is not bad, but it’s too heavy!”<br/><br/>Wang Xian stood below and commented indifferently.<br/><br/>“Eight lightning pillars!”<br/><br/>“Roar! Roar!”<br/><br/>His eyes focused. The Lightning Dragon condensed from the Lightning technique roared loudly and eight lightning pillars appeared around him instantly.<br/><br/>The divine dragons surrounded the lightning pillars and attacked Lei Yuntian directly.<br/><br/>“This is bad!”<br/><br/>Lei Yuntian’s expression changed slightly when he saw this scene.<br/><br/>His lightning nine heavens was made up of nine bolts of lightning that struck down one after another. Each strike was stronger than the previous one.<br/><br/>However, the eight lightning pillars exploded with a terrifying power. The first bolt of lightning was instantly destroyed by the lightning pillars and attacked him.<br/><br/>He flapped his wings and quickly dodged to the side. His face was extremely gloomy.<br/><br/>“This… this…”<br/><br/>At this moment, even though most of the disciples couldn’t see the battle between Wang Xian and Lei Yuntian clearly, they could still see the situation clearly.<br/><br/>Wang Xian had been standing there all this while while controlling a lightning dragon. From time to time, he would even comment on the situation.<br/><br/>On the other hand, their eldest senior brother was dodging attacks all over the place. He was helpless against the Lightning Dragon and lightning prison.<br/><br/>It was obvious that he was at a disadvantage!<br/><br/>This made many disciples feel that it was unbelievable.<br/><br/>“Senior brother Wang Xian has just broken through. How could he make eldest senior brother look so miserable? This is simply unbelievable!”<br/><br/>“The Divine Dragon shouldn’t be so heaven-defying. Senior brother shouldn’t have used his ultimate move!”<br/><br/>“Senior brother seemed to have used his law projection just now!”<br/><br/>The group of disciples widened their eyes and discussed.<br/><br/>“At your level, there are very few experts who can guide you. Since you are not my match, you might as well try to break through with your fighting spirit. However, don’t be discouraged.”<br/><br/>At this moment, everyone heard Wang Xian’s voice once again.<br/><br/>Everyone from the Lightning race opened their mouths slightly.<br/><br/>Confidence?<br/><br/>Arrogance?<br/><br/>Arrogance?<br/><br/>Or strength?<br/><br/>“Huff Huff!”<br/><br/>At this moment, Lei Yuntian’s breathing was a little hurried. The lightning wings on his back were pitch black, and his expression was gloomy and uncertain!<br/><br/>When the second elder saw this scene, his expression was uncertain.<br/><br/>The result was already very obvious.<br/><br/>Wang Xian was able to make Lei Yuntian in such a sorry state just by controlling the Thunder Dragon. If he were to go up against him in person, Lei Yuntian would definitely not be a match for him.<br/><br/>In fact, under such circumstances, he might not even be a match for him.<br/><br/>“Alright, Yuntian, you have lost. Wang Xian will be the eldest senior brother of the Thunder Ray tribe in the future!”<br/><br/>At this moment, the leader of the Thunder Ray Tribe, who was standing at the side, announced directly.<br/><br/>“What!”<br/><br/>“It’s the clan leader and the others!”<br/><br/>“Greetings clan leader, Greetings Grand Supreme!”<br/><br/>When the surrounding disciples heard this voice, they quickly looked over and respectfully bowed.<br/><br/>Lei Yuntian’s body trembled. He looked at the clan leader and the others and took a deep breath.<br/><br/>“Greetings clan leader, Grand Supreme!”<br/><br/>He respectfully bowed. His eyes were filled with unwillingness, disbelief, and shock.<br/><br/>He knew that he had lost!<br/><br/>He had lost to a new disciple, and the position of the eldest brother of the Thunder race had changed hands!\t\t\t\t\t\t</div>", "images": {}, "success": true}