{"id": 396, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072693.html", "title": "Chapter 3387 - 3387 Deep Within The 3,386 Thunder Clouds, Heaven And Earth Were Indistinguishable", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3387 - 3387 Deep Within The 3,386 Thunder Clouds, Heaven And Earth Were Indistinguishable</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3387 Deep within the 3,386 thunder clouds, Heaven and earth were indistinguishable<br/><br/>On the Five Elements Millstone, the five godly dragons were giving off a powerful aura. When they merged together, they were enough to kill a Pinnacle Universe Knight.<br/><br/>A breakthrough!<br/><br/>After the five elements Millstone improved, the fire dragon pearl was not completely absorbed.<br/><br/>There was still more than half of the energy left.<br/><br/>Although this energy was not enough to make the five elements millstone improve again, it could accumulate a huge amount of energy for the next upgrade.<br/><br/>If he obtained another fire dragon bead of this level, the five elements millstone should be able to break through directly.<br/><br/>After the five elements millstone upgraded, the absorption did not stop.<br/><br/>A month later, the fire dragon bead completely disappeared, and the power of the five elements millstone increased a little.<br/><br/>“Phew, my strength is already comparable to a peak universe knight. Now that the Five Elements Millstone has also reached that level, it shouldn’t be too much of a problem to fight or even kill three to four peak universe knights. Of course, if the other party has an innate spiritual treasure, it won’t be possible!”<br/><br/>Wang Xian mumbled as a satisfied expression appeared on his face.<br/><br/>After three months, the Five Elements Millstone had completed its upgrade. After spending two days in the Dragon Palace with a group of girls, he called an lie over.<br/><br/>Buzz<br/><br/>He returned to the Lightning race once again. His gaze swept across the hall and a smile appeared on his face.<br/><br/>“Next, my goal is to upgrade my level. This requires a lot of resources!”<br/><br/>Wang Xian planned in his heart.<br/><br/>The last time he increased his level was because of the incipient holy wings. His realm was still at the level of a level three universe knight.<br/><br/>When he reached the level four universe knight, he would have the combat strength of a level one universe overlord.<br/><br/>“Resources?”<br/><br/>He pondered for a moment and took out the universe AI to search.<br/><br/>The current him could not ask the Thunder Ray tribe for resources. The other party had already given him a lot of things. Moreover, if he wanted to break through, he would need a lot of resources.<br/><br/>He would have to search for the rest of the resources himself.<br/><br/>“The Thunder Ray tribe is located within the Thunder Clouds. The entire Thunder Cloud region is a special territory. There are a lot of treasures in it. There are many places that the powerhouses of the Thunder Ray tribe have never set foot in before!”<br/><br/>Wang Xian mumbled.<br/><br/>In many places, the experts of the Lightning race did not dare to set foot in.<br/><br/>In this area, there were also a large number of treasures.<br/><br/>“Let’s go to the depths of the thunderclouds and take a look!”<br/><br/>He mumbled and did as he said. His body moved and he flew out directly.<br/><br/>“Eldest senior brother!”<br/><br/>When they arrived at the teleportation formation, the surrounding experts who were guarding it immediately greeted Wang Xian respectfully when they saw him.<br/><br/>The status of the eldest senior brother was equivalent to that of an elder. Even if the lightning race deacons met him, they would still address him as the eldest senior brother.<br/><br/>Wang Xian nodded his head and arrived at the edge of the Lightning race through the teleportation formation.<br/><br/>“Eldest senior brother, be careful!”<br/><br/>Under the reminder of a few middle-aged men at the edge of the teleportation formation, Wang Xian flew deep into the distance.<br/><br/>After flying for two hours, he sensed his surroundings.<br/><br/>Crash<br/><br/>The next moment, a complete set of the primaless Saint Wings appeared behind his back. Wang Xian’s aura underwent an earth-shattering change.<br/><br/>His face was slowly covered by dragon scales. In the next moment, he charged forward.<br/><br/>His speed had increased by a hundred times.<br/><br/>This was his peak speed!<br/><br/>“Awesome!”<br/><br/>Without concealing his strength, Wang Xian flew in the thunderclouds. He felt his terrifying speed and smiled.<br/><br/>In a flash, he disappeared in an instant.<br/><br/>Whoosh<br/><br/>He flapped his incipient saint wings and gathered the power of wind and thunder in front of him. His speed had already surpassed that of a peak universe knight.<br/><br/>This was a speed that could only be unleashed by a ruler.<br/><br/>“With my strength, I should be able to dominate the entire Thundercloud Domain, right? Even if I am the strongest person of the Thunder Ray race, even if he has an innate spiritual treasure, I have full confidence in killing him!”<br/><br/>Wang Xian muttered to himself as a smile appeared on his face.<br/><br/>The complete uninitiated holy wings and the great grinding of the five elements after upgrading were his confidence.<br/><br/>The last time, Wang Xian only used half a day to cover the journey of a few months.<br/><br/>Half a day later, they arrived at the Lightning Net.<br/><br/>The Lightning was as dense as a net and intertwined together. Wang Xian continued to fly forward.<br/><br/>He slowed down slightly and scanned his surroundings.<br/><br/>“Huh?”<br/><br/>Not long after, he saw a thunder cloud vulture. It was a thunder cloud vulture with the combat strength of A Level 6 universe knight.<br/><br/>He narrowed his eyes slightly and flashed to the side of the Thunder Cloud Vulture.<br/><br/>“CHIRP CHIRP CHIRP!”<br/><br/>Before the Thunder Cloud Vulture could react, he instantly captured it.<br/><br/>“Hehe, the Thunder Cloud Vulture with the combat strength of A Level 6 universe knight, keep it. Next, capture all the desolate beasts below level 8 universe knights that you encounter.”<br/><br/>He muttered to himself. If he encountered some desolate beasts next, he was prepared to capture them and gift them to the disciples of the Thunder Light race as a way to repay the Thunder Light race.<br/><br/>“The most important thing is to find some treasures!”<br/><br/>He thought to himself. His body moved and he continued to fly forward.<br/><br/>According to the information from the Thunder Light race, there was no existence with the combat strength of a universe ruler in the Thunder Cloud Domain.<br/><br/>This was a good thing for Wang Xian. Without a ruler, he could forget about killing him.<br/><br/>However, he could not be careless. This was because there were still many grotto-heavens in the Thunder Cloud Domain. Some grotto-heavens were occupied by desolate beasts. Some grotto-heavens had offensive means that could kill anyone below a ruler.<br/><br/>He could not be careless, but he did not need to be too careful either.<br/><br/>As he shuttled through the Thunder Cloud Net, Wang Xian used the primaless sacred wings to sense his surroundings.<br/><br/>There were treasures in some places where the lightning was dense or abnormal.<br/><br/>“There are really quite a number of treasures here!”<br/><br/>In the next half a month, Wang Xian discovered quite a number of treasures, ranging from those at the level of a god-emperor to those at the level of a universe knight.<br/><br/>There were all kinds of acquired spiritual treasures and special fruits of the power of lightning.<br/><br/>Furthermore, in this half a month, he had captured more than a hundred desolate beasts, including more than ten Thundercloud Vultures.<br/><br/>This was mainly because Wang Xian was too fast and had a strong sense of lightning.<br/><br/>If it were any other universe knight with peak combat strength, it would not even be one-tenth of his.<br/><br/>At this moment, he was already close to the depths of the Thundercloud Domain. Further in was the area that the disciples of the Thunder Ray race were forbidden to enter.<br/><br/>Once the disciples entered, the death rate would be as high as 80% .<br/><br/>Wang Xian did not have any scruples and continued to fly forward.<br/><br/>“Eh, it’s indeed dangerous!”<br/><br/>When he flew to the front, Wang Xian suddenly narrowed his eyes. When he arrived here, the Thundercloud was already connected to the ground.<br/><br/>At the back, the thunderclouds were at a height of billions of kilometers above the ground.<br/><br/>In front of him, the black and purple thunderclouds were connected to the ground. It seemed as though heaven and earth were indistinguishable.<br/><br/>In this place, one had to pay attention not only to their surroundings but also to the ground.<br/><br/>Whoosh<br/><br/>Wang Xian moved his body and entered the place directly.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>However, the moment he entered the place, numerous Thunderbolts were attacking him!\t\t\t\t\t\t</div>", "images": {}, "success": true}