{"id": 398, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072697.html", "title": "Chapter 3389 - 3389 3388 Innate Spiritual Treasure Was Unearthed", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3389 - 3389 3388 Innate Spiritual Treasure Was Unearthed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3389 3388 innate spiritual treasure was unearthed<br/><br/>“CHIRP CHIRP CHIRP!”<br/><br/>The group of Thundercloud Vultures seemed to be mocking Wang Xian when they saw him flying backward.<br/><br/>“I didn’t expect this tree to be a blessed land. It’s really strange!”<br/><br/>Wang Xian flew around the purple tree and muttered.<br/><br/>“Boom!”<br/><br/>He tried it out and a powerful force struck the purple tree again.<br/><br/>“Bang!”<br/><br/>The powerful attack was deflected, and he hurriedly dodged into the distance.<br/><br/>“The defense is very strong. I reckon that even a level one universe Overlord’s attack can’t break the defense of this paradise!”<br/><br/>Wang Xian’s expression changed slightly.<br/><br/>“Chirp, chirp, Chirp!”<br/><br/>“Chirp, chirp, Chirp!”<br/><br/>On the purple tree, there were dozens of Thundercloud vultures flying inside. Their eyes were staring at him as they cried out.<br/><br/>Their voices were unusually messy and ear-piercing. It was obvious that they were mocking him.<br/><br/>“Hehe, you thundercloud vultures, don’t get too cocky!”<br/><br/>Wang Xian’s eyes turned cold. His universe ai immediately informed an lie!<br/><br/>Buzz<br/><br/>After receiving an Lie’s reply, Wang Xian set up a demonic altar.<br/><br/>“Dragon King!”<br/><br/>An Lie’s figure appeared and bowed to him!<br/><br/>“Bring me in Here!”<br/><br/>Wang Xian pointed to the spot in front of him and said.<br/><br/>“It’s the Dragon King!”<br/><br/>After placing it on a demonic spirit altar, he immediately returned to Wang Xian’s side.<br/><br/>“Five elements grinding, five elements world!”<br/><br/>Wang Xian waved his arm and the five elements grinding flew to the sky above the purple tree. A grayish energy enveloped the entire purple tree.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian shouted softly and entered the purple tree in the next moment.<br/><br/>“Chirp, chirp, Chirp!”<br/><br/>When the group of Thundercloud vultures saw that Wang Xian had disappeared, they were puzzled and cried out.<br/><br/>“Let’s see where you bunch of animals can run to!”<br/><br/>Wang Xian’s faint voice rang in the minds of every thundercloud vulture.<br/><br/>“Chirp, chirp, Chirp!”<br/><br/>Upon hearing this voice, the feathers of the two thundercloud vultures with the combat strength of A Level 9 universe knight exploded. Their eyes were filled with fear.<br/><br/>Boom<br/><br/>The next moment, Wang Xian’s figure appeared beside a thunder cloud vulture and smashed his fist down.<br/><br/>Bang<br/><br/>The tremendous force immediately caused the thunder cloud vulture to land heavily on the purple tree. A large amount of blood flowed out of its mouth.<br/><br/>“Wind and Thunder Chains!”<br/><br/>Wang Xian growled. Countless chains behind him attacked the Thunder Cloud Vultures one by one.<br/><br/>“CHIRP CHIRP CHIRP!”<br/><br/>“CHIRP CHIRP CHIRP CHIRP!”<br/><br/>At this moment, all the Thundercloud vultures let out terrified cries and flapped their wings in an attempt to escape.<br/><br/>However, in this small space of the grotto-heaven blessed land, they could not avoid Wang Xian’s attack at all.<br/><br/>The chains restrained them and Wang Xian pulled with his arm.<br/><br/>“CHIRP CHIRP CHIRP CHIRP!”<br/><br/>Seven to eight hundred Thundercloud vultures were easily captured by Wang Xian.<br/><br/>Among them, there were twelve Thundercloud vultures with universe knight level seven combat strength and above.<br/><br/>“Not bad, not bad. The harvest this time is much more than the Thundercloud vultures in the entire thunderlight race!”<br/><br/>He smiled.<br/><br/>There were only a few dozen Thundercloud vultures in the thunderlight race. The harvest this time was dozens of times more than theirs.<br/><br/>After putting them away, Wang Xian inspected this blessed land.<br/><br/>The purple trees should be able to produce some fruits. However, there weren’t any fruits on the trees. It was possible that the Thundercloud vultures had devoured them.<br/><br/>“Continue!”<br/><br/>After he left, he continued flying forward.<br/><br/>Following that, he flew within the Thunderclouds and kept all the treasures in his bag.<br/><br/>Halfway through, he encountered another blessed land.<br/><br/>It was a blessed land with a strong offensive power.<br/><br/>There was a tribe of thunder male apes living in that blessed land. There were more than 10,000 of them. The strongest one was a level 9 universe knight.<br/><br/>Initially, Wang Xian thought it would be a huge harvest. He didn’t expect them to occupy such a powerful blessed land.<br/><br/>That terrifying offensive power had injured Wang Xian with just one strike.<br/><br/>He didn’t dare to stay any longer and ran away.<br/><br/>This also made him understand why the Thunder Ray race didn’t completely occupy the Thunder Cloud region.<br/><br/>It wasn’t just because they weren’t strong enough. There were also these powerful grotto-heavens and blessed lands.<br/><br/>Just like the grotto-heavens and blessed lands where the Thunder Cloud Vulture was located, the Thunder Ray race couldn’t do anything about it, let alone this grotto-heavens and blessed lands with terrifying attacks.<br/><br/>If it wasn’t for Wang Xian’s relatively fast speed, an ordinary expert at the peak of the Universe Knight Realm would have a 50% chance of being killed directly.<br/><br/>I’ll leave after two months of searching<br/><br/>It had been half a year since he entered this place. Wang Xian looked at the time and thought to himself.<br/><br/>Let’s see if I can get some treasures at the last minute<br/><br/>He moved his body and continued to fly forward.<br/><br/>Buzz Buzz<br/><br/>After flying for half an hour, the uninitiated holy wings on his back suddenly trembled.<br/><br/>“Huh?”<br/><br/>Wang Xian’s body moved as he looked to the right.<br/><br/>In that direction, he sensed a strong attraction force of lightning. This attraction force shocked him.<br/><br/>“What level is this treasure?”<br/><br/>He muttered and immediately flew to the right.<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>Before he could get close, roars were heard. The terrifying roars caused Wang Xian’s expression to change slightly.<br/><br/>“This is?”<br/><br/>He lowered his speed and tried his best to conceal his figure as he approached slowly.<br/><br/>Soon, a thunder male ape that was about 10,000 meters in size appeared in his line of sight.<br/><br/>On the left side of the Thunder Male Ape, there was a 100-meter-sized thunder cloud vulture. On the right side, there was a purple thunder snake that was a few thousand meters in size.<br/><br/>On the head of this thunder snake, there was a huge thunder horn with the lightning symbol floating on it.<br/><br/>The three desolate beasts looked at each other from afar. Their cold eyes stared at each other warily.<br/><br/>Around them, there were a large number of corpses. On the corpses of these desolate beasts, there was still a powerful aura.<br/><br/>“A desolate beast with the combat strength of a peak universe Knight.”<br/><br/>Wang Xian’s gaze focused as he exclaimed in his heart.<br/><br/>His gaze immediately looked towards the center of them.<br/><br/>At the center of them, there was a powerful Thunderbolt Force blooming on the ground.<br/><br/>This thunderbolt force made even Wang Xian feel an unusual fear. He was sure that if he were to approach this thunderbolt, he would probably be pierced through.<br/><br/>The three peak universe knight desolate beasts looked over there from time to time, their eyes revealing desire and fervor.<br/><br/>“Is this an innate spiritual treasure unearthed, or is it the birth of a divine herb divine tree at the universe dominator level?”<br/><br/>Wang Xian stared at it intently. His eyes were sparkling.<br/><br/>“Roar Roar Roar!”<br/><br/>At this moment, the Purple Thunder Snake suddenly let out a roar. Its body coiled slightly together.<br/><br/>“Roar Roar!”<br/><br/>“CHIRP CHIRP!”<br/><br/>The Thunder Male Ape and the Thunder Cloud Vulture stared at it in fear. They didn’t want to be outdone and let out a low roar.<br/><br/>“Eh? That purple lightning snake is very strong. No, the Lightning Horn on its head is not a growth. It is a terrifying treasure!”<br/><br/>Wang Xian’s gaze landed on the purple lightning snake as well. His eyes were filled with astonishment!\t\t\t\t\t\t</div>", "images": {}, "success": true}