{"id": 400, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072701.html", "title": "Chapter 3391 - 3391 3390 To Defeat The Three Desolates Beast. Innate Spiritual Treasure Obtained!", "volume": 4, "volume_title": "Volume 4", "body": "<h1>Chapter 3391 - 3391 3390 To Defeat The Three Desolates Beast. Innate Spiritual Treasure Obtained!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3391 3390 to defeat the three desolates beast. Innate spiritual treasure obtained!<br/><br/>“Roar!”<br/><br/>Seeing that Wang Xian was charging at him, the purple lightning snake stared at him coldly. It grabbed at the innate spiritual treasure and attacked its surroundings with the power of lightning.<br/><br/>The lightning horns formed by the lightning bolts shuttled through the space.<br/><br/>“Bang! Bang! Bang!”<br/><br/>Wang Xian had entered the range of its attack and could only block it with energy.<br/><br/>The attack of the lightning horns landed on his body, causing his speed to drop drastically!<br/><br/>“What a cunning fellow!”<br/><br/>Wang Xian’s gaze was gloomy.<br/><br/>“Roar, Roar!”<br/><br/>His body shook and transformed into the body of a divine dragon. Nine-colored rays of light shot out in all directions.<br/><br/>Wang Xian’s dragon tail swept across and swept towards the countless lightning horns.<br/><br/>“Roar!”<br/><br/>When the purple lightning snake saw Wang Xian’s figure, a hint of fear flashed across its eyes. It raised its tail and charged towards the dragon tail.<br/><br/>“Bang! Bang! Bang!”<br/><br/>A terrifying sound of collision rang out.<br/><br/>“Nine-colored Dragon Pillar!”<br/><br/>Wang Xian let out a wild roar. Nine Dragon Pillars of different attributes appeared in the surroundings and attacked the purple lightning snake at the same time.<br/><br/>“Roar!”<br/><br/>The purple lightning snake roared and unleashed its ultimate move.<br/><br/>A purple snake head phantom with a lightning horn appeared in the sky above it. The purple snake head contained terrifying lightning as it charged towards the nine-colored dragon pillar.<br/><br/>“Boom! Boom! Boom!”<br/><br/>The terrifying collision made the entire space look extremely terrifying.<br/><br/>At the side, the five elements grinding mill was fighting with two peak universe knight desolate beasts. It was equally powerful.<br/><br/>Crash<br/><br/>Wang Xian looked at the collision of the energy in the sky. He swayed his body and flapped his primaless sacred wings to attack the Purple Thunder Snake instantly<br/><br/>Boom<br/><br/>Wang Xian opened his dragon mouth and a grayish river of annihilation headed toward the Purple Thunder Snake.<br/><br/>Roar<br/><br/>The purple lightning snake also opened its mouth and spewed out sparks of lightning.<br/><br/>“Boom!”<br/><br/>In terms of attack power, the purple lightning snake, which was also blessed by the innate spiritual treasure level thunder horn, was not afraid of Wang Xian at all.<br/><br/>“Crash!”<br/><br/>Behind him, the power of wind and lightning from the incipient saint wings covered Wang Xian’s entire body. His dragon body swayed and he instantly arrived at the right side of the purple lightning snake.<br/><br/>The purple lightning snake hurriedly turned its head and stared at Wang Xian with vigilance in its eyes.<br/><br/>“Bang!”<br/><br/>However, at this moment, Wang Xian’s huge dragon tail swept toward the purple lightning snake’s body at an even faster and fiercer speed.<br/><br/>“Bang!”<br/><br/>The huge sweeping force caused a large amount of blood to appear on the purple lightning snake’s body as it flew to the side.<br/><br/>“Roar! Roar!”<br/><br/>The purple lightning snake’s eyes were filled with shock and anger.<br/><br/>Roar! Roar<br/><br/>Wang Xian roared as well. In an instant, he arrived behind the purple lightning snake and clawed at it with his dragon claws.<br/><br/>On the lightning horn above the purple lightning snake’s head, a lightning symbol met the dragon claw directly.<br/><br/>Boom<br/><br/>The lightning symbol exploded. Wang Xian felt the power and immediately flapped his uninitiated holy wings to get further away!<br/><br/>“I’d like to see how long you can last!”<br/><br/>Wang Xian roared with a cold expression. His dragon body swayed as he charged forward once again.<br/><br/>“Roar! Roar!”<br/><br/>The purple lightning snake, which had been suppressed and had a passive defense, stared at Wang Xian. Its eyes were filled with fear.<br/><br/>“Roar! Roar!”<br/><br/>In the next moment, its entire body was covered in lightning as it charged towards the innate spiritual treasure.<br/><br/>Its huge body turned into a terrifying swimming snake as it unleashed its maximum speed.<br/><br/>“Competing in speed?”<br/><br/>When Wang Xian saw it charging towards the innate spiritual treasure, a mocking look appeared in his eyes.<br/><br/>Crash<br/><br/>At this moment, Wang Xian’s speed was even faster. He extended his Dragon Claw and grabbed towards the innate spiritual treasure.<br/><br/>“I’ve got it!”<br/><br/>Wang Xian’s speed was not something that the purple lightning snake could compare to. He extended his dragon claw and grabbed the innate spiritual treasure.<br/><br/>“I got it!”<br/><br/>“Roar!”<br/><br/>However, at this moment, Wang Xian suddenly felt a terrifying attack coming from behind.<br/><br/>A pitch-black lightning horn drilled into Wang Xian’s body.<br/><br/>“Bang!”<br/><br/>A huge force immediately penetrated Wang Xian’s defense. It penetrated through the dragon scales and caused a large amount of blood to splatter out!<br/><br/>“You’re courting death!”<br/><br/>Wang Xian felt an intense pain coming from his body. He immediately turned around.<br/><br/>Hiss! Hiss<br/><br/>The purple lightning snake stuck out its tongue and let out a cold sound. It flew to the side and its figure became illusory.<br/><br/>“You Bastard, you’re courting death!”<br/><br/>Wang Xian stared at the purple lightning snake’s disappearing body with a murderous look.<br/><br/>It was obvious that the purple lightning snake was prepared for its final attack.<br/><br/>“It knows that its speed is not as fast as mine. It rushed over to attack me in preparation. HMPH, does it think that it will be fine after escaping back to its nest?”<br/><br/>Wang Xian’s face was grim as he stared at the spot where the purple lightning snake had disappeared.<br/><br/>“CHIRP CHIRP!”<br/><br/>“Roar Roar!”<br/><br/>At the side, the thundercloud Vulture and the thundermale ape let out anxious cries when they saw Wang Xian obtaining the innate spiritual treasure and the purple lightning snake escaping.<br/><br/>They hurriedly flew backward and left in an instant after setting up a defensive line!<br/><br/>Wang Xian’s gaze swept past them. He ignored them and extended his dragon claws.<br/><br/>Buzz<br/><br/>The five elements grinding mill flew into his hands and entered his body instantly.<br/><br/>Wang Xian’s gaze landed on the innate spiritual treasure.<br/><br/>It was a bell-shaped innate spiritual treasure. He would only be able to know the specific attack method after refining it.<br/><br/>Crack! Crack<br/><br/>Wang Xian didn’t refine it immediately. Instead, he glanced at the huge wound on his body. A bolt of lightning drilled out from the position of his dragon horn.<br/><br/>The bolt of lightning flew in one direction.<br/><br/>Wang Xian returned to his human form and flapped his wings. He immediately followed behind the bolt of lightning.<br/><br/>As the bolt of lightning flew, it began to turn illusory slowly.<br/><br/>Wang Xian replenished his energy before it disappeared.<br/><br/>This was called Void Pursuit!<br/><br/>When Wang Xian was fighting with the purple lightning snake, he had already integrated the void pursuit of the incipient saint wings into his attack.<br/><br/>Now, he wanted to use this technique to chase after the purple lightning snake.<br/><br/>The cunning purple lightning snake had thoroughly infuriated Wang Xian.<br/><br/>Even though he knew that he couldn’t obtain the innate spiritual treasure, he still managed to trick Wang Xian.<br/><br/>He had to pay the price!<br/><br/>Void pursuit wasn’t omnipotent. The distance was too far and required constant energy reinforcement. Moreover, once the purple lightning snake removed the wind and thunder force left behind by Wang Xian, it would lose the ability to chase after him.<br/><br/>Therefore, Wang Xian did not stay any longer. He chased after the purple lightning snake as fast as he could.<br/><br/>He wanted to kill the purple lightning snake.<br/><br/>Of course, there was another reason for this. The lightning horn on the head of the purple lightning snake was also an innate spiritual treasure.<br/><br/>An innate spiritual treasure was enough for him to make some attempts.<br/><br/>“I hope that the lair of the purple lightning snake is not in an attack-type or recovery-type blessed land!”<br/><br/>As he shuttled through the thunderclouds, Wang Xian was like a terrifying bolt of lightning.<br/><br/>The effect of searching for enemies in the void did not disappear, causing Wang Xian’s eyes to glow.<br/><br/>Time passed day by day. Wang Xian also shuttled through a long distance.<br/><br/>Four days later, the Lightning in front of him suddenly emitted a glow. Wang Xian squinted his eyes slightly and looked ahead.<br/><br/>Here we are!\t\t\t\t\t\t</div>", "images": {}, "success": true}