{"id": 408, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072717.html", "title": "Chapter 3399 - 3399 3398’S Eldest Senior Brother Was In A Bad Mood", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3399 - 3399 3398’S Eldest Senior Brother Was In A Bad Mood</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3399 3398’s eldest senior brother was in a bad mood<br/><br/>“Third senior brother, that Lei Yuntian is too arrogant!”<br/><br/>“Arrogant? Humph, his father was still killed by our elder. It Won’t be long before it’s him!”<br/><br/>In the Divine Thunder City, the experts of the Great Thunderclap Academy watched the disciples of the Thunder Ray race leave with gloomy faces.<br/><br/>A few bald men in front of them said with gloomy faces.<br/><br/>!!<br/><br/>“Hehe, that’s right. Lei Yuntian has never been a match for our eldest senior brother. If our eldest senior brother were here, he wouldn’t dare to be presumptuous. However, I heard that Lei Yuntian is no longer the eldest senior brother of the Thunder Ray race. He is a pure-bred thunder dragon of the ancestral dragon lineage.”<br/><br/>A bald man beside him said with a cold smile.<br/><br/>“That’s right. However, the new eldest senior brother of the Thunder Ray race only has the combat strength of a level seven universe knight. Our eldest senior brother can easily crush him!”<br/><br/>The third senior brother of the Great Thunderclap Academy said coldly.<br/><br/>…<br/><br/>Wang Xian left with the disciples of the Thunder Ray tribe. After strolling around for a few hours and understanding the situation in the Divine Thunder City, he separated from them.<br/><br/>They didn’t separate. Instead, Wang Xian, Lei Yun, Zi Lei, and Lei Zhengyun came to a restaurant.<br/><br/>“There should be ten top-notch universe knights in the Great Thunderclap Academy. Our Thunder Ray tribe has a grudge with them for billions of years. Many experts and disciples have died at the hands of the other party. Of course, many of the other party’s experts have also died at our hands.”<br/><br/>“However, the strength of both parties has always been relatively balanced and has not been broken. Therefore, there has been a stalemate.”<br/><br/>Wang Xian asked a few girls about the great thunderclap academy and they answered truthfully.<br/><br/>“What was the reason for the conflict with the Great Thunderclap Academy back then?”<br/><br/>Wang Xian asked curiously.<br/><br/>“Eldest senior brother, when our thunder ray race was just born, we were not in our current form. The current form was evolved by us. We should be considered as demon beasts back then.”<br/><br/>“The Great Thunderclap Academy was established earlier than our thunder ray tribe. They enslaved our tribe members and forced us to be their mounts. Hence, the grudges were settled and continued until now.”<br/><br/>Lei Yunzi said.<br/><br/>Wang Xian nodded his head slightly.<br/><br/>Such a situation was very normal. The strong would enslave the weak, especially the strong human tribe who would enslave demonic beasts.<br/><br/>Of course, there were also demon beast races who would devour humans.<br/><br/>The hatred between the Thunder Ray race and the Great Thunderclap Academy was a blood feud that lasted for a very, very long time.<br/><br/>There were four peak universe knights in the Divine Thunder City and they had an offensive paradise. The Thunder Ray race would also give them some face.<br/><br/>After chatting and eating some food, Wang Xian bade farewell to the girls a few hours later and flew toward Floating Thunder Island.<br/><br/>Floating Thunder Island was a paradise and also the place where the auction was held.<br/><br/>Anyone who wanted to bid for it had to go to Floating Thunder Island.<br/><br/>Wang Xian landed on it and scanned his surroundings.<br/><br/>Floating Thunder Island was very big. There was a huge open-air auction house in the middle of it.<br/><br/>In front of the auction house, there was a building that was covered by lightning. That was the interior of the blessed land.<br/><br/>Wang Xian flew over and his facial expression started to change.<br/><br/>“Sir, are you here to auction items?”<br/><br/>Wang Xian came to the front of the building that was covered by lightning. A lady in front of him asked.<br/><br/>“Yes!”<br/><br/>Wang Xian nodded.<br/><br/>“Please come in!”<br/><br/>The lady gestured to him.<br/><br/>After entering, Wang Xian took out three acquired Supreme Treasures and some acquired Numinous Treasures. All of them were for sale and were a considerable amount of resources.<br/><br/>Acquired Supreme Treasures were considered to be a relatively powerful existence in the Thunder Ray tribe.<br/><br/>“The auction will begin in 18 hours. You can participate in the auction when the time comes. There are about 20 acquired supreme treasures in our auction. There are also a large number of heavenly and earthly treasures.”<br/><br/>The lady introduced him enthusiastically and gave him an identity card.<br/><br/>With this identity card, he could come and collect the divine stones after the auction.<br/><br/>Wang Xian nodded and didn’t stay any longer. He turned around and walked out.<br/><br/>There were still 18 hours before the auction. Wang Xian strolled around the Hanging Thunder Island before flying down to the Divine Thunder City.<br/><br/>He didn’t look for Lei Yunzi and the rest for the time being. Instead, he took a look alone.<br/><br/>“This should be a disciple of the Jianye Fire clan.”<br/><br/>“This should be a member of the sky-connecting clan.”<br/><br/>Wang Xian strolled around and saw the disciples of the Jianye Fire clan and the sky-connecting clan.<br/><br/>The Jianye Fire clan didn’t look like humans, but the sky-connecting clan belonged to the wizard lineage.<br/><br/>The Divine Thunder City was very grand. Due to the auction, there were many people.<br/><br/>Universe knights could be seen everywhere.<br/><br/>“Eldest senior brother, where are you? We are preparing to go to the auction venue!”<br/><br/>Eighteen hours passed very quickly. Lei Zhengyun and the rest sent a message.<br/><br/>“See you in front of the auction venue!”<br/><br/>Wang Xian replied and flew towards the direction of the Hanging Thunder Island.<br/><br/>In the surrounding air, there were also a large number of people flying towards the Hanging Thunder Island. The number of people was densely packed at a glance.<br/><br/>“Eh? We haven’t arrived yet?”<br/><br/>When Wang Xian arrived at the Hanging Thunder Island, he didn’t see any disciples of the Thunder Ray tribe.<br/><br/>He raised his eyebrows and waited there.<br/><br/>“Eldest senior brother, something bad has happened. We have a conflict with the disciples of the Great Thunderclap Academy!”<br/><br/>Not long after, Lei Yunzi sent an anxious message to him.<br/><br/>“Eh?”<br/><br/>Wang Xian was slightly stunned and frowned slightly.<br/><br/>He had a conflict with the disciples of the Great Thunderclap Academy?<br/><br/>In the Divine Thunder City, ordinary conflicts were still acceptable. However, if there was a large-scale conflict, the Thunder Ray race and the Great Thunderclap Academy would still have to be wary.<br/><br/>After all, the Divine Thunder City was not weak.<br/><br/>“Eldest senior brother is in trouble. Senior Brother Lei Yuntian was severely injured in a duel with the eldest senior brother of the Great Thunderclap Academy!”<br/><br/>Following that, another piece of news was sent.<br/><br/>Wang Xian looked at this piece of news. His dragon eyes flickered slightly as he looked down.<br/><br/>When he saw a large number of figures gathered, he immediately flew over.<br/><br/>“The eldest senior brother of the Great Thunderclap Academy actually defeated Lei Yuntian?”<br/><br/>Wang Xian mumbled and was slightly surprised.<br/><br/>When he was holding the celebration banquet for his eldest senior brother, he could already tell that Lei Yuntian’s cultivation had already broken through and was comparable to a level eight universe knight.<br/><br/>He was already very powerful.<br/><br/>However, he was defeated by the big senior of the Great Thunder Sound School. It seemed that he was not weak!<br/><br/>“This… Lei Yuntian of the Thunder Light race was defeated by the law of the Great Thunder Sound School so easily. This is really unexpected!”<br/><br/>“The big senior of the Great Thunder Sound School is so powerful. Lei Yuntian has already made a breakthrough to level 8 universe knight, yet he was still defeated so easily. He is really powerful!”<br/><br/>“He’s too powerful. The eldest senior brother Fa du of the Great Thunderclap School is simply too powerful.”<br/><br/>When Wang Xian got closer, a shocked discussion could be heard.<br/><br/>In front of them, where they were surrounded by a group of powerful disciples, the Thunder Ray race and the disciples of the Great Thunderclap School were confronting each other.<br/><br/>However, at this moment, the disciples of the Thunder Ray race looked extremely embarrassed!\t\t\t\t\t\t</div>", "images": {}, "success": true}