{"id": 402, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072705.html", "title": "Chapter 3393 - 3393 3392 Innate Thunder Bell. It Was A Pleasant Surprise", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3393 - 3393 3392 Innate Thunder Bell. It Was A Pleasant Surprise</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3393 3392 innate thunder bell. It was a pleasant surprise<br/><br/>Boom<br/><br/>In the lake of thunder, Wang Xian’s body trembled. A powerful pressure enveloped the purple thunder snake king.<br/><br/>Since he wanted to suppress it, he had to tame it completely.<br/><br/>Hiss! Hiss! Hiss<br/><br/>The Purple Thunder Snake King lay on the ground with its head lowered.<br/><br/>It didn’t take long to tame and suppress it. It was done within half an hour.<br/><br/>“Hiss! Hiss!”<br/><br/>The Purple Lightning Snake King was lying in front of Wang Xian as it swayed its body.<br/><br/>“Let’s go. Bring me to your lair and see if there are any treasures!”<br/><br/>Wang Xian patted its head and gave an order.<br/><br/>“Hiss! Hiss!”<br/><br/>The purple lightning snake king nodded its head and brought it to the entrance of the cave.<br/><br/>He kept the large number of corpses that had died due to their battle.<br/><br/>“Hiss! Hiss! Hiss!”<br/><br/>Wang Xian entered the cave and immediately felt a majestic force of lightning.<br/><br/>This was a place that could allow lightning practitioners to improve rapidly.<br/><br/>Deep inside the cave, the nest of the Purple Lightning Snake King was inside.<br/><br/>“Hiss! Hiss! Hiss!”<br/><br/>The purple lightning snake king brought him inside and stuck out its tongue.<br/><br/>“HMM? There aren’t any treasures inside?”<br/><br/>Wang Xian looked inside and frowned slightly. He communicated with it.<br/><br/>“Hiss! Hiss!”<br/><br/>The Purple Thunder Snake King shook its head, indicating that all its treasures had been absorbed by it.<br/><br/>“Hiss! Hiss!”<br/><br/>At this moment, the Purple Thunder Snake King suddenly stuck out its tongue at him. A message was transmitted into his mind.<br/><br/>It transmitted an image. The image was of the thundermale ape.<br/><br/>The thundermale ape was lying on top of a mountain, emitting a powerful aura.<br/><br/>“Are you saying that you know the lair of the Thundermale Ape?”<br/><br/>Wang Xian asked the purple thundersnake king in surprise.<br/><br/>The purple thundersnake king nodded and replied immediately.<br/><br/>“Oh, bring me there immediately!”<br/><br/>Wang Xian’s eyes flickered slightly. He immediately ordered it.<br/><br/>“Hiss! Hiss!”<br/><br/>The purple lightning snake king immediately responded. It lowered its head and ordered Wang Xian to stand on it.<br/><br/>Wang Xian moved his body and jumped on it.<br/><br/>“Roar! Roar!”<br/><br/>It let out a low roar and dashed out quickly.<br/><br/>Wang Xian took out the vitality fluid and sprinkled it on its wounds. It healed the wounds on its body quickly.<br/><br/>“Hiss! Hiss!”<br/><br/>This made the purple lightning snake king let out a joyous cheer and increased its speed.<br/><br/>Wang Xian stood on top of its head and shuttled across the land quickly.<br/><br/>When the surrounding dire beasts saw the Purple Thunder Snake King, they immediately hid far away.<br/><br/>“Hehe, to have such a powerful battle pet, it’s quite domineering.”<br/><br/>Wang Xian smiled gently. With a move of his palm, the bell-shaped innate spiritual treasure appeared in his hand.<br/><br/>The innate spiritual treasure was also of great use to the current Wang Xian. It could increase his attack power by quite a lot.<br/><br/>As the energy was transferred into it, waves of information were transmitted immediately.<br/><br/>The bell was called the innate Thunder Bell. It was a powerful attack Numinous Treasure.<br/><br/>It could release the innate thunder sound, Thunder Bell Explosion, and other powerful attack methods.<br/><br/>To Wang Xian, it was considered a rather powerful weapon.<br/><br/>“I’ll refine it for the time being. When I have the chance, I’ll sell it and exchange it for resources to increase my strength.”<br/><br/>Wang Xian thought to himself as he stood on top of the Purple Thundersnake King and began to refine it.<br/><br/>The Purple Thundersnake king brought him along as they shuttled through the thunderclouds.<br/><br/>The thundermale Ape’s lair was not close. They flew for half a month.<br/><br/>There was a reason why the Purple Thundersnake King was much slower than Wang Xian.<br/><br/>“Hiss, hiss, hiss!”<br/><br/>Half a month later, the Purple Lightning Snake King stuck out its tongue at Wang Xian and sent him a message.<br/><br/>“Are we here?”<br/><br/>Wang Xian squinted his eyes slightly and looked at the innate lightning bell in front of him.<br/><br/>He had already refined a portion of the Lightning Bell. It would take another one to two months for him to completely refine it.<br/><br/>He raised his head and scanned his surroundings.<br/><br/>Here, there were mountain peaks that were bathed in the lightning.<br/><br/>At a glance, the mountain peaks were endless.<br/><br/>“Hiss Hiss!”<br/><br/>The Purple Lightning Snake King’s gaze was fixed in one direction, transmitting a message.<br/><br/>Wang Xian looked in the direction it was looking at, and his dragon eyes flickered.<br/><br/>That mountain peak was obviously very different from the surrounding mountain peaks.<br/><br/>The entire mountain peak was even more purple. Bathed in the Lightning, it emitted a purple glow.<br/><br/>Wang Xian could vaguely see a huge body lying at the top of the mountain peak.<br/><br/>“You can go there later.”<br/><br/>Wang Xian’s body moved and appeared behind him with the uninitiated holy wings. The five elements millstone was suspended in the air.<br/><br/>In a flash, he disappeared immediately.<br/><br/>Buzz<br/><br/>In the next moment, he arrived at the spot above the thundermale ape that was lying on the mountain peak.<br/><br/>“A healing-type blessed land!”<br/><br/>Sensing the energy from the mountain peak below, Wang Xian made a judgment in his heart.<br/><br/>“Dragon Eyes Lock All Corners!”<br/><br/>In the next moment, without any hesitation, he transformed into a divine dragon instantly. Numerous chains charged towards the thundermale ape.<br/><br/>“Roar!”<br/><br/>The moment Wang Xian made his move, the thundermale ape, who was lying on top of the mountain and bathing in the Lightning, opened its eyes. With a move of its palm, a lightning pillar appeared in its palm and smashed towards him.<br/><br/>“Purple Thundersnake King, make your move!”<br/><br/>Wang Xian shouted softly and the five elemental grindstone met the attack of the Lightning pillar directly.<br/><br/>“Bang!”<br/><br/>The Lightning pillar collided with the five elemental grindstone and collapsed instantly. The power of the five elemental grindstone was still sweeping towards the thundermale ape.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The thundermale ape went berserk instantly when he saw this scene. It was as though blood was seeping out from his eyes.<br/><br/>“Bang! Bang! Bang!”<br/><br/>He patted his chest forcefully. It was as though he was beating a drum. Bolts of lightning struck the surroundings.<br/><br/>“Roar! Roar! Roar!”<br/><br/>At this moment, the Purple Thundersnake King rushed over. A huge bolt of lightning shot out from his thunder horn and struck at him.<br/><br/>The Purple Thundersnake King wasn’t weak. In fact, he could even suppress the thundermale ape by himself.<br/><br/>Under such circumstances, coupled with Wang Xian and the five elements grindstone, the thundermale ape did not have any strength left to resist.<br/><br/>“Five elements annihilating Dragon Claw!”<br/><br/>Wang Xian growled and charged forward.<br/><br/>The five elements grindstone was accompanied by the roars of the five divine dragons. Streams of elemental energy blasted towards it.<br/><br/>“Roar! Roar! Roar!”<br/><br/>When the thundermale ape saw these attacks, its face was filled with shock and anger.<br/><br/>Boom<br/><br/>He waved his arm and a thunder mountain flew over from the surrounding area. He hugged the Thunder Mountain and smashed it towards Wang Xian and the rest.<br/><br/>Bang! Bang<br/><br/>The Thunder Mountain was extremely sturdy. However, it was still easily shattered into pieces when faced with the attacks from Wang Xian and the rest.<br/><br/>“Kill him immediately!”<br/><br/>Wang Xian did not show any mercy and ordered the Purple Thunder Snake King.<br/><br/>“Roar Roar!”<br/><br/>The Purple Thundersnake king immediately responded. After being subdued, it attacked the thundermale ape with all its might.<br/><br/>Wang Xian and the five elements Millstone’s attacks also arrived at the same time.<br/><br/>“Roar Roar Roar!”<br/><br/>The thundermale ape waved its arms again and smashed the Thunder Mountains towards them.<br/><br/>“Bang Bang Bang!”<br/><br/>However, very soon, a continuous stream of energy landed on its body.<br/><br/>The Thunder Male Ape’s nest was here, so it could not escape even if it wanted to.<br/><br/>The battle against the Thunder Male Ape was very easy.\t\t\t\t\t\t</div>", "images": {}, "success": true}