{"id": 405, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072711.html", "title": "Chapter 3396 - 3396 Under The Shock Of The 3395 Lightning Race", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3396 - 3396 Under The Shock Of The 3395 Lightning Race</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3396 Under the shock of the 3395 lightning race<br/><br/>“Junior Brothers, my name is Wang Xian and I will be your eldest senior brother in the future.”<br/><br/>Wang Xian stood in front of the group of elders and looked at the position in front of him.<br/><br/>Tens of millions of disciples stood there and looked at him as he introduced himself.<br/><br/>“Greetings, eldest senior brother!”<br/><br/>Tens of millions of disciples immediately greeted him respectfully when they heard his words.<br/><br/>Eldest senior brother’s status was comparable to that of an elder in the Lightning race.<br/><br/>In the face of eldest senior brother, none of the disciples dared to be presumptuous.<br/><br/>Even if some of the disciples’elders were elders or even clan leaders.<br/><br/>In the Lightning race, there was no young clan leader, No clan leader’s daughter, and only eldest senior brother and eldest senior sister.<br/><br/>This title represented status and authority.<br/><br/>“Yes. If you encounter any problems in the future, you can come and look for me.”<br/><br/>Wang Xian nodded his head faintly.<br/><br/>“Hehe, senior brother, if you challenge him today, he will be embarrassed!”<br/><br/>Surrounded by the crowd below, a few middle-aged men looked at Wang Xian who was awe-inspiring on the stage and transmitted their voices to Lei Yuntian.<br/><br/>Lei Yuntian smiled faintly and didn’t say anything.<br/><br/>Since the other party was highly regarded by the clan leader and the rest, he wouldn’t embarrass him too much.<br/><br/>Especially on such an occasion.<br/><br/>“Today is my first day as the eldest senior brother of the Thunder Ray tribe. I will take out some things as a wager. Whoever can get it will be able to take it away!”<br/><br/>At this moment, Wang Xian’s voice continued to ring out.<br/><br/>Below him, all the disciples revealed a faint smile as they looked forward to it.<br/><br/>“Eldest senior brother will take out some pretty good items on his first day!”<br/><br/>“I have some desolate beasts that can be tamed as battle pets.”<br/><br/>Wang Xian stood on top and said as he waved his arm.<br/><br/>Buzz<br/><br/>In an instant, the desolate beasts that were imprisoned in the Lightning prison landed at a corner.<br/><br/>There were a total of 1,500 cages, and each cage contained a desolate beast.<br/><br/>However, when Wang Xian waved his hand and the 1,500 cages appeared in the sight of all the disciples, they were slightly stunned. Their eyes widened in disbelief.<br/><br/>“Boom!”<br/><br/>“Hiss, what’s going on? Holy shit, what’s going on?”<br/><br/>“Desolate beasts? Thundercloud vultures, why are there so many Thundercloud Vultures? What the F * ck, this… this…”<br/><br/>“There are more than a thousand desolate beasts, but there are actually more than a thousand desolate beasts. The number of Thundercloud vultures should be around 800, right?”<br/><br/>Everyone from the Lightning race was stunned for a few seconds. In the next moment, they were in an uproar.<br/><br/>When they heard what Wang Xian said just now, they thought that their eldest senior brother would take out some pills or something.<br/><br/>He would use some acquired spiritual treasures that the disciples could use as a wager.<br/><br/>However, he actually took out more than 1,500 desolate beasts.<br/><br/>What shocked them the most was that there were more than 800 Thundercloud vultures among them.<br/><br/>To every disciple, this was no less than a acquired supreme treasure.<br/><br/>All the disciples of the Thunder Ray tribe knew the value of the Thundercloud Vultures.<br/><br/>More than 800 of them were given directly to the disciples present?<br/><br/>This…<br/><br/>Was unbelievable!<br/><br/>“This… this…”<br/><br/>The group of girls who had received the Thundercloud vultures from their fourth senior sister, Lei Yun Zi, Lei Zhengyun, and the rest were also stunned. They widened their eyes and looked at Wang Xian in a daze.<br/><br/>They were not surprised that Wang Xian still had thundercloud vultures, but this number…<br/><br/>“There are 20 Thundercloud vultures with the combat strength of a universe knight at level seven!”<br/><br/>At this moment, Lei Zhengyun and the third senior brother of the Thunder Ray Race, who were at the forefront, trembled.<br/><br/>20 thunder cloud vultures with level 7 battle strength of a universe knight, this… Was he the one who captured them?<br/><br/>To them, it was already Wang Xian’s luck to be able to capture a thunder cloud vulture with level 7 battle strength of a universe knight.<br/><br/>However, there were a total of 20 of them now.<br/><br/>If this senior brother tamed all 20 Thundercloud vultures into battle pets, wouldn’t he be able to fight against a Level 8 universe knight?<br/><br/>This was secondary. To be able to capture 20 Thundercloud vultures, was his strength still at Level 7 universe knight?<br/><br/>At this moment, Lei Zhengyun was in a slight daze. His expression kept changing.<br/><br/>He was extremely discouraged after losing to Wang Xian a year ago.<br/><br/>Not long ago, he had achieved a breakthrough and regained his confidence once again. In fact, he no longer placed Wang Xian in his eyes.<br/><br/>Even though he possessed such strength at such a young age.<br/><br/>However, in the heaven opening and desolation continent, a strong person was still a strong person. He would not change just because of his young age.<br/><br/>However, now, he could not see through Wang Xian’s strength.<br/><br/>“This… this… Wang Xian, is this the desolate beast that you captured?”<br/><br/>In front, Wang Xian looked at the shocked disciples with a smile on his face. The corners of his mouth curled up slightly.<br/><br/>However, all of a sudden, the figures of the first elder and the rest came in front of Wang Xian and stared at him with widened eyes.<br/><br/>“HMM, I’m lucky. I captured some desolate beasts. I don’t need them myself. I’m prepared to gift them to the disciples!”<br/><br/>Wang Xian said directly to him.<br/><br/>“Huff, Huff, Lucky?”<br/><br/>The first elder, second elder, and the rest looked at each other.<br/><br/>Was this luck?<br/><br/>Even if he was lucky, how could it be so easy to catch so many Thundercloud Vultures?<br/><br/>Luck was only a part of it. More importantly, it was his strength.<br/><br/>Could it be… He had obtained the Dragon Pearl in his clan and received an upgrade?<br/><br/>No Way!<br/><br/>If that was the case, it would be too terrifying!<br/><br/>Gulp<br/><br/>The great elder gulped and forced a smile on his face. “Ahem, Wang Xian, are you sure you want to give so many desolate beasts to your disciple? Do you know their value?”<br/><br/>“Compared to the Thunder feather that you gave me and the treasure that the clan rewarded me with, these desolate beasts are nothing. Since I don’t need them, I’ll give them to the clan.”<br/><br/>Wang Xian said with a smile.<br/><br/>“It’s My Thunder Ray Tribe’s honor that you have such thoughts!”<br/><br/>The first elder was slightly stunned when he heard his words. Soon after, a gratified look appeared on his face.<br/><br/>“Haha, Good, good. It seems that our thunder ray tribe didn’t misjudge you. Haha!”<br/><br/>The second elder couldn’t help but Pat Wang Xian on the shoulder and laughed out loud.<br/><br/>“It’s all mutual!”<br/><br/>Wang Xian shook his head with a smile.<br/><br/>If the first elder of the Thunder Ray tribe didn’t give him the Lei Yu as a reward, he might directly snatch it from him. At that time, he might even become enemies with the Thunder Ray tribe.<br/><br/>Coupled with the fire dragon bead, Wang Xian owed the Thunder Ray tribe quite a lot.<br/><br/>Some things are mutual. Since you have treated me well, I will naturally repay you with my full strength.<br/><br/>“The things you took out this time are too precious, especially with so many thundercloud vultures and desolate beasts. This is a treasure to the entire thunder ray tribe.”<br/><br/>“A long time ago, our thunder ray tribe had wanted to form a thundercloud vultures team, but we have not succeeded. How about this, Wang Xian, leave the distribution of the Thundercloud vultures to the tribe. The disciples of the other desolate beasts who passed the assessment can be rewarded to them.”<br/><br/>The first elder’s gaze swept across the group of Thundercloud Vultures. He was full of astonishment as he spoke to him.<br/><br/>Thundercloud vultures were a treasure to their thunder ray tribe. In particular, more than 800 Thundercloud vultures were considered strategic treasures.<br/><br/>They could not bear to give them to the disciples directly.\t\t\t\t\t\t</div>", "images": {}, "success": true}