{"id": 407, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072715.html", "title": "Chapter 3398 - 3398 3397 Quickly Went To Invite His Eldest Senior Brother", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3398 - 3398 3397 Quickly Went To Invite His Eldest Senior Brother</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3398 3397 quickly went to invite his eldest senior brother<br/><br/>“Eldest senior brother, it’s time for us to set off!”<br/><br/>Nearly two months later, in front of Wang Xian’s palace, the voices of Lei Yun, Zi Lei, Zheng Yun and the rest rang out.<br/><br/>Wang Xian opened his eyes and looked at the time on the universe’s AI. Then, he walked out with a smile on his face.<br/><br/>“Eldest senior brother!”<br/><br/>The moment Wang Xian walked out, the disciples at the entrance immediately greeted him respectfully.<br/><br/>At the entrance, there were not only a few girls but also many disciples from other lightning races. There were more than 20,000 of them.<br/><br/>Even the former eldest senior brother Lei Yunhai and the rest were among them.<br/><br/>The auction at the Divine Thunder City was a very lively event for the disciples. It was not a big deal for more than 20,000 disciples to go there.<br/><br/>There were even some disciples who went there alone or in groups.<br/><br/>“Okay, let’s Go!”<br/><br/>Wang Xian looked at them and nodded his head.<br/><br/>“Eldest senior brother, we will first arrive at the Heavenly Thunder City through the teleportation formation. After that, we will proceed with the teleportation from the Heavenly Thunder City. After passing through two cities, we will be able to reach the Divine Thunder City.”<br/><br/>Fourth senior sister said.<br/><br/>“Okay, lead the way!”<br/><br/>Wang Xian nodded his head and followed beside them.<br/><br/>Lei Yuntian looked at Wang Xian with his eyes shining.<br/><br/>During the banquet held by his eldest senior brother, he was proud to think that Wang Xian was no match for him after his breakthrough.<br/><br/>However, when he saw the large number of desolate beasts, he was stunned.<br/><br/>If those desolate beasts were tamed by him into battle pets, he would definitely be no match for them.<br/><br/>Now, his confidence in whether he could defeat Wang Xian began to waver again.<br/><br/>After all, Wang Xian had hunted too many desolate beasts, and there were too many universe knights at level seven.<br/><br/>Lei Yuntian was very doubtful. Could it be that the divine dragon was so strong?<br/><br/>Could it be that the disciples of the peak races were so abnormal?<br/><br/>At this moment, he was also convinced by Wang Xian. He had initially planned to challenge him for a period of time, but he had dispelled that idea.<br/><br/>Buzz Buzz<br/><br/>Wang Xian followed them and made a quick transfer through the teleportation formation.<br/><br/>After passing through one city after another, they arrived at the Divine Thunder City not long after.<br/><br/>Unlike the Divine Thunder City, the Divine Thunder City was a city of technology. On the other hand, the Divine Thunder City was a city that was rather mystical.<br/><br/>Palaces were located in the surroundings. Some of the palaces were suspended in the air.<br/><br/>A huge island was floating in the sky above Divine Thunder City. The Purple Island was covered by lightning, and it was emitting a powerful aura.<br/><br/>It was a blessed land.<br/><br/>“The elders should have arrived early. Let’s walk around here. Whoever has something to do can leave!”<br/><br/>Lei Yuntian looked around and said to the disciples.<br/><br/>“Alright, Senior Brother!”<br/><br/>The disciples immediately replied.<br/><br/>“Eldest brother, are you going to take a stroll with us or do you want to do something?”<br/><br/>“The auction will be held the day after tomorrow. If eldest brother has any items to be auctioned, you can wait for a while or you can go to the Hanging Thunder Island to auction them tomorrow!”<br/><br/>Lei Yuntian turned to look at Wang Xian and said.<br/><br/>“Let’s walk around together first. I will handle some matters tomorrow!”<br/><br/>Wang Xian said.<br/><br/>It was his first time in the Divine Thunder City. He could get a group of disciples to introduce him and show him around.<br/><br/>“Alright, let’s walk around then!”<br/><br/>A group of disciples from the Lightning race walked out.<br/><br/>“That’s a disciple from the Lightning race!”<br/><br/>“Eh? That’s true. I heard that the eldest senior brother of the Lightning race has been replaced. There are disciples from the ancestral dragon lineage who have joined the Lightning race and become the eldest senior brother!”<br/><br/>Wang Xian and his group of over 10,000 people strolled around the Divine Thunder City and attracted the attention of many people around them.<br/><br/>They were discussing in a low voice.<br/><br/>The Lightning race was the strongest force in the Thunder Cloud Domain. It was also one of the top forces in the vicinity.<br/><br/>The group of disciples naturally attracted attention.<br/><br/>“Eldest senior brother, the Divine Thunder City is very big. It occupies five blessed lands. Every time the Divine Thunder City holds an auction, it is very lively. There is one blessed land in the Divine Thunder City that is open to the public. As long as one has the divine flower stones, one can enter and cultivate.”<br/><br/>Lei Yunzi introduced to Wang Xian as he walked by the side.<br/><br/>“Do you know how many factions are participating in this auction?”<br/><br/>Wang Xian asked them.<br/><br/>“According to the news, all the factions in the Thundercloud domain have arrived. In addition, there will be the Jiuye Fire clan, the Great Thunderclap Academy, and the heaven-receiving clan. The rest should be gone.”<br/><br/>Lei Yunzi replied.<br/><br/>The Jiuye Fire clan, the Great Thunderclap Academy, and the heaven-receiving clan were about the same strength as the Thunder Ray clan.<br/><br/>Wang Xian shook his head slightly.<br/><br/>If he wanted to sell the innate thunder bell to the four major forces, it would be difficult for him to do so.<br/><br/>Only the great thunderclap school and the Thunder Ray race would compete for the Thunder element innate spiritual treasure. By then, they might not be able to sell it at a good price.<br/><br/>It might not be suitable for him to auction it off.<br/><br/>“I’ll sell some other acquired Supreme Treasures first. After this auction, I’ll sell the innate spiritual treasure elsewhere!”<br/><br/>Wang Xian was deep in thought as he strolled around with his disciples.<br/><br/>“Eh? It’s the bunch of cowards from the Great Thunderclap Academy!”<br/><br/>Not long after, the voices of his second senior brother and the rest came from the side.<br/><br/>“Hehe, it’s a bunch of guys from the Lightning race.”<br/><br/>A voice came from the front as well, carrying a hint of mockery and indifference.<br/><br/>Wang Xian was slightly taken aback as he looked over.<br/><br/>On the right, a few thousand people were walking over. Wang Xian looked over.<br/><br/>A few thousand people were dressed in purple and had a bell on their chest.<br/><br/>All of them were bald. Regardless of gender, there were nine purple light dots on their heads.<br/><br/>They looked like humans and belonged to the human lineage.<br/><br/>The disciples of the Lightning race stared at them coldly. They were also staring at Wang Xian and the rest.<br/><br/>It was obvious that there was a huge grudge between the two parties.<br/><br/>“Heh, move aside. We want to go over!”<br/><br/>Lei Yuntian walked towards the right at this moment. The disciples immediately followed behind him.<br/><br/>“Eldest senior brother, our thunder ray tribe has a huge grudge with the Great Thunderclap Academy. If the disciples meet each other in the wild, they would usually hunt each other down. The overall strength of the Great Thunderclap Academy is not weaker than ours.”<br/><br/>Lei Yunzi introduced to Wang Xian.<br/><br/>Wang Xian nodded and swept his gaze over.<br/><br/>“Move aside!”<br/><br/>Lei Yuntian and the rest walked to the front of the Great Thunderclap Academy and spoke coldly.<br/><br/>“Lei Yuntian, are you bullying our eldest senior brother for not being here?”<br/><br/>The bald men and women in front of the Great Thunderclap Academy stared at Lei Zhengyun with cold expressions.<br/><br/>“Hehe, that’s right. Get lost quickly!”<br/><br/>Lei Yuntian’s aura faintly rushed forward, his eyes filled with coldness.<br/><br/>“You… good, good, we’ll wait and See!”<br/><br/>The disciples of the Great Thunderclap Academy snorted coldly, making way for him with an embarrassed expression.<br/><br/>There were more disciples of the Lightning race, so they didn’t dare to not make way because Lei Yuntian would suppress them with his aura.<br/><br/>Would this break the rules of the Divine Thunder City?<br/><br/>The Divine Thunder City didn’t dare to do anything to the disciples of the Thunder Ray Race!<br/><br/>If they were strong, they would do the same.\t\t\t\t\t\t</div>", "images": {}, "success": true}