{"id": 417, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072735.html", "title": "Chapter 3408 - 3408 Senior Brother 3407 Had Arrived", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3408 - 3408 Senior Brother 3407 Had Arrived</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3408 Senior Brother 3407 had arrived<br/><br/>“Roar Roar Roar!”<br/><br/>“Run, run, run!”<br/><br/>The humongous clay city collapsed rapidly. Terrified screams rang out.<br/><br/>At this moment, the citizens of Clay City still didn’t understand what kind of disaster had befallen their clay city?<br/><br/>Who was the one who destroyed their clay city?<br/><br/>At this moment, they could only flee frantically.<br/><br/>Wang Xian hovered above the teleportation formation and watched this scene coldly. There wasn’t the slightest fluctuation.<br/><br/>If Clare City wanted to destroy the lightning race, they had to be prepared to be destroyed.<br/><br/>In the face of war, there was no right or wrong, and there was no mercy.<br/><br/>“Let’s Go!”<br/><br/>The entire Clare City was ravaged by the five elements grinding mill and the purple lightning snake for only five minutes. Wang Xian spoke indifferently and landed at the position below.<br/><br/>The teleportation formation in front of him was not destroyed. He could still teleport.<br/><br/>With a wave of his arm, he kept the five elements millstone and the Purple Lightning Snake King. Wang Xian put in some divine stones and stepped into the teleportation formation.<br/><br/>His figure slowly disappeared, leaving only the ruins of Clay City.<br/><br/>Buzz<br/><br/>When Wang Xian appeared in front of the teleportation formation on the mountain where the lightning race’s disciples lived, a strong pressure was emitted.<br/><br/>“Eh?”<br/><br/>Wang Xian’s expression changed slightly as he looked around.<br/><br/>“It’s me!”<br/><br/>He immediately opened his mouth and said.<br/><br/>“Eldest senior brother! It’s eldest senior brother!”<br/><br/>In the surrounding area, some disciples shouted loudly.<br/><br/>There was also an elder and deacon beside him!<br/><br/>“Wang Xian, come over quickly!”<br/><br/>In front of him, an elder waved his hand at Wang Xian.<br/><br/>After Wang Xian killed eldest senior brother of the Great Thunderclap Academy in one move, the elders of the Thunder Ray tribe had already regarded him as an expert of the same level.<br/><br/>“Alright, Elder. What’s the situation now?”<br/><br/>Wang Xian flew over and asked after scanning the surroundings.<br/><br/>“This time, it’s a huge crisis for us, the Thunder Ray Race!”<br/><br/>The elder’s expression was slightly solemn and embarrassed.<br/><br/>Wang Xian was slightly taken aback. “Elder, how many forces are attacking us?”<br/><br/>“According to the information we have so far, five forces, the Great Thunderclap School, Divine Thunder City, Purple City, Clay City, and Liuyan City, are going to attack us. Right now, the main battle force of the Thunder Ray race is fighting with them on a small scale from the front.”<br/><br/>“Among the five forces, there are about 18 pinnacle universe knights, which is more than twice as many as us.”<br/><br/>The elder said with a solemn face.<br/><br/>“Elder, why did we start a conflict with them?”<br/><br/>Wang Xian’s eyes flickered slightly as he asked curiously.<br/><br/>There must be a reason why the five forces suddenly attacked the Thunder Ray race.<br/><br/>“Because of a treasure, a god tree at the level one of the universe dominator, a god tree that can bear thunder fruits. This god tree was originally already in our possession. The second Supreme Elder was suddenly ambushed by them and died. Four Pinnacle Universe Knights ambushed him, catching the second supreme elder by surprise!”<br/><br/>“Now that the first level divine tree of the universe dominator has been obtained by the Great Thunderclap Academy, they launched a counterattack and formed an alliance!”<br/><br/>“These five D * MNED fellows. They must have planned this beforehand. Otherwise, they wouldn’t have acted so quickly!”<br/><br/>The elder roared furiously.<br/><br/>Wang Xian frowned slightly when he heard the elder’s words.<br/><br/>A divine tree that was on the level of the Master of the universe. A treasure of this level was indeed worthy for a force like the Thunder Ray tribe to fight for it desperately.<br/><br/>However, the other party had already planned for this to happen. The four great cities of a large tribe had joined forces. No, it could be said that there were only three cities now.<br/><br/>Even so, the Thunder Ray tribe was still not their match.<br/><br/>They had more than twice the number of peak experts. If the other party were to attack them all at once, it would be difficult for the Thunder Ray tribe to resist.<br/><br/>However, they had to resist even if they couldn’t.<br/><br/>Once they gave up, they could only hide in the grotto-heaven blessed land. However, hiding in the grotto-heaven blessed land was their last resort.<br/><br/>As long as they retreated into the grotto-heaven blessed land, the lightning race would be completely surrounded by the enemies.<br/><br/>At that time, they might be sealed here by the enemy’s array formation.<br/><br/>This kind of thing had happened before in the heaven opening primeval continent.<br/><br/>Back then, the steel union, the corpse-wrapping race, and the Lich Kingdom wanted to completely seal and suppress the Dragon Palace.<br/><br/>Therefore, as long as there was a glimmer of hope for the Thunder Ray race, they would not give up.<br/><br/>“Not good. The forces of the Great Thunderclap Academy are ready to assemble. A Great War is about to break out. The clan leader has ordered us to rush over immediately!”<br/><br/>At this moment, an elder beside him said somewhat anxiously.<br/><br/>“Shut down all the external teleportation formations. All the disciples, follow me to the battlefield ahead!”<br/><br/>He immediately ordered loudly.<br/><br/>“Yes, Elder!”<br/><br/>The disciples replied immediately. They clenched their fists tightly and were filled with killing intent.<br/><br/>The closure of the teleportation formation meant that the Lightning race had shut down their connection with the outside world.<br/><br/>Wang Xian followed behind the elder and immediately flew towards the battlefield ahead.<br/><br/>The current battlefield was also a place where they were forced to retreat by the Great Thunderclap Academy’s Divine Thunder City.<br/><br/>They had already reached the territory of the Lightning race. Beside them was a blessed land of the Lightning race.<br/><br/>The Blessed Land of the Lightning race was called the Lightning Cave.<br/><br/>This blessed land was beneficial to their cultivation. It could not help them to fend off their opponents.<br/><br/>The Lightning race could teleport internally. Through the teleportation formation, they could reach the lightning cave very quickly.<br/><br/>“All the disciples who have arrived, get into formation and get ready for battle!”<br/><br/>Wang Xian and the rest had just arrived when they heard the order from the front.<br/><br/>A somber atmosphere filled the surroundings.<br/><br/>In front of them, almost all the strong disciples of the Lightning race had gathered.<br/><br/>There were a total of 50 to 60 million disciples lined up in an army formation. They stared coldly at the position in front of them.<br/><br/>The leader of the Lightning race and all the supreme elders had arrived.<br/><br/>After the death of the second Supreme Elder, there were only seven peak universe knight experts of the Lightning race.<br/><br/>All of them had arrived!<br/><br/>“Let’s go over. Wang Xian, follow me!”<br/><br/>The elder beside him said to Wang Xian. The two of them immediately flew towards the leader of the central race.<br/><br/>“Leader, Supreme Elder!”<br/><br/>“Clan leader, Supreme Elder!”<br/><br/>After Wang Xian and the rest went over, they immediately greeted the clan leader and the rest.<br/><br/>“Hehe, Wang Xian, we are very pleased that you are here!”<br/><br/>When the clan leader of the Thunder Ray tribe saw Wang Xian, he revealed a gratified look on his face.<br/><br/>They knew that Wang Xian had gone out not long ago. However, when they heard that a war had broken out, he was still able to rush over. This also meant that he treated the Thunder Ray tribe as one of his own.<br/><br/>Otherwise, who would be willing to take the risk to participate in a war of this level?<br/><br/>“I am now a disciple of the Thunder Ray tribe. Tribe leader and elders, you have treated me well. Of course, I will not back down at the last minute!”<br/><br/>Wang Xian smiled at the tribe leader and said.<br/><br/>“Haha, Good, Good.”<br/><br/>The tribe leader of the Thunder Ray tribe laughed out loud. The six supreme elders beside him also nodded in satisfaction.<br/><br/>“When the next battle breaks out, you must protect your own life. If we lose, we still have to rely on you, Wang Xian, to turn the tables. Therefore, you must not die!”<br/><br/>The leader of the Thunder Ray tribe and the rest looked at each other and landed on Wang Xian together. They spoke in a slightly solemn tone.\t\t\t\t\t\t</div>", "images": {}, "success": true}