{"id": 414, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072729.html", "title": "Chapter 3405 - 3405 The Sudden War In 3404", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3405 - 3405 The Sudden War In 3404</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3405 The sudden war in 3404<br/><br/>“Hehe.”<br/><br/>The old lady handed over the interspatial ring and checked it. She smiled and said, “My bid is higher than yours!”<br/><br/>As she spoke, she looked at Wang Xian.<br/><br/>“Ten Level One universe dominator fruits, one level two universe dominator fruit, five acquired Supreme Treasures, and one unit of warm thunder liquid. How about it?”<br/><br/>The girl took out one item after another from her space ring and floated in front of her, saying with a smile.<br/><br/>“Oh my God, this… This resource is too terrifying!”<br/><br/>“Warm thunder liquid, this is a unique treasure of the Godly Tiger clan. That girl must have a very high status in the Godly Tiger Clan!”<br/><br/>Hearing the girl’s words, the surrounding people showed heated expressions.<br/><br/>These treasures were the most precious treasures to them.<br/><br/>When the purple-skinned elder heard that, he shook his head helplessly. With a wave of his arm, he kept his interspatial ring.<br/><br/>The difference was a little big.<br/><br/>“Alright!”<br/><br/>When Wang Xian saw the treasures, his eyes sparkled. He immediately agreed.<br/><br/>Since this girl was using such a high-grade fruit to trade, he didn’t have to waste any time. He could just consume it directly.<br/><br/>The resources that the other party took out were definitely worth a connate numinous treasure.<br/><br/>Especially the warm thunder liquid, which was very valuable.<br/><br/>“Hehe, I like this kind of Connate Numinous Treasure!”<br/><br/>The girl waved her arm and threw the treasure in her hand to Wang Xian excitedly. She walked to the front of the Connate Lightning Bell and picked it up.<br/><br/>Wang Xian checked the treasure and put it away in satisfaction. He stood up.<br/><br/>The girl looked at the innate lightning bell in her hand. It was obvious that she liked it very much!<br/><br/>“This girl’s status is definitely not low!”<br/><br/>“I have another treasure here. Do you want it?”<br/><br/>He hesitated for a moment and said to the girl.<br/><br/>“HMM? There’s another treasure? An innate spiritual treasure? Let me take a look!”<br/><br/>The girl was slightly stunned. She raised her head to look at Wang Xian and said.<br/><br/>“It’s not an innate spiritual treasure, but it can still be considered an innate spiritual treasure!”<br/><br/>Wang Xian said. With a wave of his arm, the purple lightning snake appeared at the side.<br/><br/>Hiss! Hiss! Hiss<br/><br/>Its huge body and the innate spiritual treasure above its head released a powerful pressure.<br/><br/>Wang Xian waved his arm to stop the pressure from attacking the surroundings.<br/><br/>“A battle pet at the pinnacle level of a universe knight. It has a weapon at the pinnacle level of an innate spiritual treasure on top of its head. Do you want it?”<br/><br/>He continued to ask.<br/><br/>Although the Purple Thunder Snake was very powerful, it would be useless to him once Wang Xian made a breakthrough.<br/><br/>Now that he had met a rich lady, he naturally had to ask her. It would be best if he could sell it.<br/><br/>If a pinnacle universe knight mount was sold, it would be a terrifying amount of resources.<br/><br/>“Damn, a pinnacle universe knight mount, and this mount even has an innate spirit treasure on its head. This is too awesome!”<br/><br/>“Hiss, that young man actually has so many treasures? How come I’ve never heard of this number one person?”<br/><br/>“A pinnacle universe knight Mount, amazing, if only I had one!”<br/><br/>A shocked voice came from the surrounding area. All the onlookers stared at it with their eyes wide open.<br/><br/>It was already too much to set up a stall to sell an innate spiritual treasure. Now, he was actually selling a top-notch battle pet of a universe knight who had an innate spiritual treasure!<br/><br/>Wasn’t this powerhouse a little too rich in treasures?<br/><br/>“It’s so ugly!”<br/><br/>The girl stared at the Purple Lightning Snake and shook her head with a pout.<br/><br/>Upon hearing this, Wang Xian was slightly speechless.<br/><br/>“Young master, are you selling that innate spiritual treasure alone?”<br/><br/>The purple-skinned elder looked at Wang Xian and asked.<br/><br/>“Not alone!”<br/><br/>Wang Xian shook his head and looked at the girl again.<br/><br/>“It’s too ugly. I don’t want it!”<br/><br/>The girl shook her head.<br/><br/>“Alright!”<br/><br/>Wang Xian was helpless. He waved his arm and kept the purple lightning snake.<br/><br/>He cupped his hands and flew out.<br/><br/>“I’ll go back and increase my strength first. Then, I’ll come back and sell the purple lightning snake. It’s either a treasure with light and dark attributes or a treasure with five attributes.”<br/><br/>Wang Xian flew towards the teleportation formation and thought to himself.<br/><br/>He needed to upgrade the Taiji Dragon Plate, a treasure with light and dark attributes. Currently, the Taiji Dragon Plate was only able to withstand a level 9 universe Knight’s attack. It could no longer keep up with his improvement speed.<br/><br/>In addition, after his upgrade this time around, the five elements millstone could no longer keep up.<br/><br/>Wang Xian was very satisfied after coming out this time. Since the innate Thunder Bell had made its move, he had sufficient resources to upgrade himself.<br/><br/>I should return to the Thunder Ray race first and upgrade my strength. However, I have to make plans for the future<br/><br/>He smiled and teleported rapidly through the teleportation formations.<br/><br/>After being teleported over a hundred times, Wang Xian began to fly above the inner area of the heaven-splitting primordial land.<br/><br/>The journey was long. This time, it took him about five months to return.<br/><br/>“Eldest senior brother, a powerful treasure appeared in the Thundercloud Domain. The experts of our thunder ray race went to fight for it. Our second Supreme Elder was ambushed and killed by the experts of the Great Thunderclap Academy and the Divine Thunder City!”<br/><br/>“Eldest senior brother, Our Thunder Ray race is at war with the Great Thunderclap Academy and the Divine Thunder City!”<br/><br/>“Eldest senior brother, we are at war with the Great Thunderclap Academy and the Divine Thunder City. We are taking revenge for the second Supreme Elder!”<br/><br/>“Eldest senior brother, for some reason, the Divine Thunder City has joined forces with the Great Thunderclap Academy. There are also other cities that are involved. They are trying to deal with us!”<br/><br/>…<br/><br/>Just when Wang Xian was two days away from the Thunder Ray tribe, his universe ai suddenly sent him urgent messages.<br/><br/>There were dozens of messages. All of them were sent to him by the disciples of the Thunder Ray tribe.<br/><br/>When Wang Xian saw these messages, he was slightly stunned. His face was filled with shock.<br/><br/>“The Thunder Ray Tribe has started a war with the Divine Thunder City of the Great Thunderclap Academy? The second Supreme Elder has actually fallen?”<br/><br/>His expression changed slightly and he frowned slightly.<br/><br/>The second Supreme Elder was a peak universe knight, yet he had actually fallen.<br/><br/>This…<br/><br/>The death of a peak universe knight was a rare occurrence in the billions of years of war between the Thunder Ray race and the Great Thunderclap Academy.<br/><br/>“The Divine Thunder City is involved, and there are other cities involved as well?”<br/><br/>“Was it premeditated, or was it for some other reason? To fight for treasures?”<br/><br/>Wang Xian mumbled and continued flying at a high speed.<br/><br/>The Thunder Ray race was at war with the Great Thunderclap Academy. A war between such a race would usually last for a long time.<br/><br/>Furthermore, based on the heritage of the Thunder Ray race and the Blessed Land, the other party wouldn’t be able to destroy them.<br/><br/>Therefore, Wang Xian wasn’t too anxious.<br/><br/>“Great Thunderclap Academy, Divine Thunder City, are you courting death?”<br/><br/>Wang Xian’s eyes flashed with a cold look.<br/><br/>No matter what, since the Thunder Ray race was at war with the other party, Wang Xian would definitely participate in this battle.<br/><br/>To him, this was a good opportunity to return the favor.<br/><br/>“Then, I shall do my best to help the Thunder Ray Race!”<br/><br/>He made up his mind. From now on, there was no need to hide his strength and identity!\t\t\t\t\t\t</div>", "images": {}, "success": true}