{"id": 418, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072737.html", "title": "Chapter 3409 - 3409 3408 Went All Out", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3409 - 3409 3408 Went All Out</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3409 3408 went all out<br/><br/>The war had already started. The leader of the Thunder Light Race and the others were very familiar with the current situation.<br/><br/>They had no choice but to fight this war, but there was only a 30% chance that they could resist it.<br/><br/>If they lost, the Thunder light race wouldn’t be exterminated, but they would have to retreat into the blessed land.<br/><br/>Then if they wanted to turn the tables, they would need the combat power of a universe master.<br/><br/>If it was in the past, they might not have a backup plan. However, they had a chance now.<br/><br/>Wang Xian!<br/><br/>In their opinion, Wang Xian’s strength was at level nine Universe Knight. He had such potential at such a young age. Furthermore, he was a purebred divine dragon.<br/><br/>In the future, there was a 90% chance that he would have the combat strength of a universe dominator.<br/><br/>Therefore, anyone could die in this battle. However, Wang Xian was the only one who could not die.<br/><br/>This was their hope.<br/><br/>When Wang Xian heard the words of the leader of the Thunder Ray tribe, he was slightly stunned. Then, he revealed a smile.<br/><br/>“Don’t worry, leader. We will definitely win this battle!”<br/><br/>He said with a smile.<br/><br/>“Haha, Definitely. Wang Xian, go to the group of disciples. Don’t stay in the middle. Be careful. If you encounter any danger, retreat immediately. Others can not retreat, but you must retreat!”<br/><br/>The leader of the Lightning race laughed out loud and instructed him.<br/><br/>Wang Xian smiled and nodded. Then, he flew to the side.<br/><br/>Here, the Lightning race was divided into five armies. The leader and the experts in the middle.<br/><br/>There were already three combat armies.<br/><br/>There were also the disciples of the Lightning race who had yet to join the army.<br/><br/>According to the rules of the Lightning race, those below 500 eras were all disciples of the Lightning race.<br/><br/>Anyone above this age would have to join the various departments of the Thunder Ray tribe.<br/><br/>There was an army and some other law enforcement departments.<br/><br/>This battle was also a battle between the top-notch experts, an army against an army, and a disciple against a disciple.<br/><br/>This was basically a tacit agreement.<br/><br/>At that time, the opponents of the Thunder Ray Tribe’s disciples would also be the disciples of the Great Thunderclap Academy.<br/><br/>“Eldest senior brother!”<br/><br/>“Eldest senior brother, you’re here!”<br/><br/>On the side of the disciples of the Thunder Ray tribe, they greeted Wang Xian respectfully when they saw him.<br/><br/>“Yes!”<br/><br/>Wang Xian swept his gaze across them and revealed a faint smile on his face.<br/><br/>It didn’t matter where he was in the upcoming battle.<br/><br/>By being on the side of the disciples, he would be able to catch them off guard.<br/><br/>“Eldest senior brother, be careful later. The clan leader and elders told you to be careful!”<br/><br/>Lei Yuntian walked over and said to Wang Xian.<br/><br/>“Hehe, don’t worry. I will show you all my strength later.”<br/><br/>As Wang Xian spoke, the corners of his mouth curled up slightly.<br/><br/>“Eldest senior brother, you must not be rash!”<br/><br/>At the side, fourth senior sister, Lei Yunzi, and the other girls reminded him.<br/><br/>Wang Xian smiled and nodded his head.<br/><br/>Boom! Boom! Boom<br/><br/>At this moment, a rumbling sound came from the area in front of him. Wang Xian’s eyes narrowed slightly.<br/><br/>Waves of vast and terrifying energy rushed over from the area in front of him.<br/><br/>The first thing that entered his eyes were two incomparably huge thunder lions!<br/><br/>They were over a hundred kilometers in size and were galloping within the Thunder Clouds. Their power was abnormally terrifying.<br/><br/>This was a Pinnacle Universe Knight Thunder Lion.<br/><br/>It was also the Guardian Godly Beast of the Great Thunder Sound College!<br/><br/>Above the Thunder Lion stood more than 10 figures. These figures included the pinnacle great beings of the Great Thunder Sound College, as well as the Pinnacle Universe Knights of Godly Thunder City, purple city, and Liuyan City.<br/><br/>A total of 15 figures looked over coldly.<br/><br/>“Roar! Roar! Roar!”<br/><br/>They roared in unison, and the legions of the four forces behind them were exuding a fierce killing intent.<br/><br/>Their eyes were filled with excitement and malevolence!<br/><br/>There were all kinds of war pets and all kinds of huge war machines.<br/><br/>Especially at the Great Thunder Sound Academy, there was a huge bell covered with purple thunder. The power of this explosion was 100% of the power of an innate spiritual treasure.<br/><br/>The entire bell was over 10,000 kilometers in size, and it was extremely terrifying!<br/><br/>Below the Divine Thunder City Army, there was a flying city. The entire city was flowing with the power of lightning, and it connected to the Divine Thunder City’s experts.<br/><br/>The vast power of the bell made all the experts and disciples of the Lightning race extremely solemn.<br/><br/>“Lightning race, get out of the Thunder Cloud Domain. We can let you live!”<br/><br/>On the Thunder Lion, a bald old man holding a thunder staff suddenly said coldly to the Thunder light race, with nine purple light spots blooming above his head.<br/><br/>“Old bald donkey of the Great Thunder Sound Academy, don’t dream about it. You Don’t have the ability to make us get out!”<br/><br/>The leader of the Thunder Light race shouted coldly, his eyes full of killing intent.<br/><br/>He and the six supreme elders rushed into the sky, their bodies emitting light.<br/><br/>“Sneak attack and kill our lightning race’s second Supreme Elder, I will make you pay a terrible price. Divine Thunder City, Purple City, Liuyan City, you just wait for our lightning race’s endless revenge!”<br/><br/>The leader of the Lightning race roared with killing intent.<br/><br/>“Haha, Lightning Race, Don’t be so high and mighty. Since we dare to attack, we are not afraid of you. Besides, you can survive this crisis first. Arrogant and ignorant!”<br/><br/>The city lord of Divine Thunder City said with a cold face.<br/><br/>“Good, good, good. All the disciples of the Thunder race remember today. In the future, we will definitely exterminate them!”<br/><br/>The clan leader of the Thunder race shouted sternly.<br/><br/>“We will definitely exterminate the enemy!”<br/><br/>“We will definitely exterminate the enemy!”<br/><br/>All the powerful disciples of the Thunder race shouted with a furious face.<br/><br/>“Humph, Attack! Exterminate the Thunder Race!”<br/><br/>The headmaster of the Great Thunderclap Academy raised his lightning rod.<br/><br/>Lightning exploded in the sky as the battle horn sounded!<br/><br/>While the Lightning race was fighting the Great Thunderclap Academy, the Thundercloud Domain and the surrounding factions were also paying attention to the situation here.<br/><br/>This was especially so for the other dozen or so cities in the Thundercloud Domain. The sudden outbreak of war and the Great Thunderclap Academy joining forces with the other cities caused the other cities to be incomparably shocked.<br/><br/>Their gazes were all focused on this side, waiting for the results.<br/><br/>As for the destruction of Clay City, it had been too short a time, and the various factions had yet to receive any news.<br/><br/>Only the Great Thunderclap Academy’s Divine Thunder City knew of the situation in clay city, but they didn’t take it to heart.<br/><br/>The lack of clay city wasn’t a big deal!<br/><br/>“Kill!”<br/><br/>Following the orders of the Great Thunderclap Academy’s dean, the disciples of the four great factions roared.<br/><br/>“Roar Roar Roar!”<br/><br/>The two Thunder Lions instantly roared as their eyes locked onto the seven members of the Thunder race.<br/><br/>The headmaster of the Great Thunderclap Academy and the others laughed sinisterly as they followed closely in the sky.<br/><br/>Seventeen versus seven. With the difference of more than two times, they were 100% confident.<br/><br/>“Fight! Kill the enemy!”<br/><br/>The Thunder Race’s clan leader gritted his teeth as a thunder battle axe appeared in front of him. It contained a powerful might as he slowly clenched his fists and gritted his teeth as he roared!<br/><br/>“Kill the enemy!”<br/><br/>At this moment, all the strong disciples of the Thunder race stared at the invading enemy and roared!<br/><br/>Wang Xian’s eyes focused. He stared ahead and slowly stretched his body!<br/><br/>He smiled wantonly!\t\t\t\t\t\t</div>", "images": {}, "success": true}