{"id": 419, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072739.html", "title": "Chapter 3410 - 3410 3409 Attacked With All His Might", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3410 - 3410 3409 Attacked With All His Might</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3410 3409 attacked with all his might<br/><br/>“Destroy all the disciples of the Lightning Race!”<br/><br/>“Kill them!”<br/><br/>When the disciples of the Lightning race roared, the disciples of the Great Thunderclap Academy, the three cities, and the Army also roared ferociously.<br/><br/>They were full of violent killing intent and confidence.<br/><br/>They were 100% confident about the battle in front of them.<br/><br/>In terms of the powerful disciples and the army, they had a crushing stance.<br/><br/>“Follow me to kill the disciples of the Thunder Ray Tribe!”<br/><br/>In front of the disciples of the Great Thunderclap Academy, eldest senior brother Fadu stared at the front with a grim face.<br/><br/>Generals versus generals, kings versus kings, disciples versus disciples!<br/><br/>“Brother Fadu, eldest senior brother of the Thunder Ray race is very strong. I’ll get my battle pets to help you hold them back. Haha!”<br/><br/>At the side, the current young city lord of the Divine Thunder City laughed out loud.<br/><br/>“Alright!”<br/><br/>When eldest senior brother Fadu heard this name, his expression changed slightly. He nodded his head heavily.<br/><br/>The last time he was killed by Wang Xian in an instant was a great humiliation to him.<br/><br/>However, Wang Xian’s strength was not something he could withstand.<br/><br/>“You’d better help me kill him. I’ll go and kill the rest of the Thunder Ray race’s Disciples!”<br/><br/>Eldest senior brother Fadu’s eyes revealed a bloodthirsty look as he shouted at the young castellan of the Divine Thunder City.<br/><br/>“It might be a little difficult to kill him, but I’m 80% confident!”<br/><br/>The young castellan of the Divine Thunder City smiled sinisterly.<br/><br/>The young city leader of Godly Thunder City was not young anymore. He was the most outstanding and valued son of the city leader of Godly Thunder City.<br/><br/>He had the power of a universe knight at level nine, and he was a battle pet with the power of a universe knight at level nine.<br/><br/>Facing the eldest senior brother of the Thunder Light race, he was 100% sure that he could defeat him.<br/><br/>If he used his trump card, he could even kill him!<br/><br/>“Hahaha, good, Kill, Kill, Kill!”<br/><br/>“Rumble!”<br/><br/>The eldest senior brother of the Great Thunderclap Academy let out a wild roar and flew forward. He raised the Lightning staff in his hand and bolts of lightning struck forward.<br/><br/>In front of him were the disciples of the Lightning race.<br/><br/>Both parties were getting closer and the battle had already begun.<br/><br/>“Kill them!”<br/><br/>Lei Yuntian stared ahead. His eyes were filled with bloodlust as he shouted at all the disciples.<br/><br/>Wang Xian narrowed his eyes slightly. The incipient sacred wings appeared behind him, and a violent aura gushed out from his body.<br/><br/>“Hahaha, let me challenge the eldest senior brother of the Thunder Ray race to avenge Brother Fadu!”<br/><br/>The young city lord of the Divine Thunder City stared at Wang Xian and laughed out loud.<br/><br/>He was riding a single-horned Thunder Beast.<br/><br/>The Thunder Beast was over 10,000 meters in size, and its entire body was covered in thick scales. Under the dragon scales, it was terrifying and direct.<br/><br/>He locked onto Wang Xian and let out a maniacal laugh.<br/><br/>“Eldest senior brother, be careful. That’s the young city lord of Divine Thunder City. He’s a level nine battle pet of a universe Knight!”<br/><br/>At the back, a group of disciples immediately reminded Wang Xian.<br/><br/>“I’ll go and kill him First!”<br/><br/>Wang Xian smiled and said directly.<br/><br/>Crack! Crack<br/><br/>Boom<br/><br/>As soon as Wang Xian finished his sentence, he flapped his incipient saint wings and disappeared in an instant.<br/><br/>At this moment, the enemies and allies were about one billion kilometers apart. This distance was already within the range of their attacks.<br/><br/>Similarly, this distance was only an instant for Wang Xian.<br/><br/>When his figure disappeared, the disciples of the Lightning race behind him were slightly shocked!<br/><br/>At the front, the young castellan of the Divine Thunder City who had locked onto Wang Xian also focused his gaze and looked around in shock.<br/><br/>“Challenge Me? You Don’t have the qualifications!”<br/><br/>“Die!”<br/><br/>In the next moment, Wang Xian’s figure appeared in front of the young castellan of the Divine Thunder City. He stood on the body of the Unicorn Thunder Beast.<br/><br/>He looked at the young castellan of the Divine Thunder City with a smile on his face. His arm transformed into a dragon claw and grabbed at him directly.<br/><br/>Boom<br/><br/>“No!”<br/><br/>At this moment, the young master of the Divine Thunder City was completely stunned.<br/><br/>He stared at Wang Xian in disbelief and shock as his body trembled violently.<br/><br/>How did this senior brother of the Lightning race appear in front of him in an instant?<br/><br/>How could he release such terrifying strength?<br/><br/>His strength was… at the peak of the Universe Knight Realm?<br/><br/>How was this possible!<br/><br/>“PFFT!”<br/><br/>However, after he let out a terrified roar, Wang Xian’s dragon claws had already grabbed onto his body.<br/><br/>“Bang!”<br/><br/>Following that, Wang Xian’s right foot stepped on the Unicorn Thunder Beast’s body. A terrifying destructive force directly entered its body.<br/><br/>With one claw and one kick, the young master of the Divine Thunder City and his battle pet died instantly.<br/><br/>“Whoosh!”<br/><br/>In the next moment, his figure instantly appeared in front of the eldest senior brother of the Great Thunderclap Academy. The terrifying force locked him in the void, making him unable to move at all!<br/><br/>Their eyes met!<br/><br/>Eldest senior brother Fa du of the Great Thunderclap Academy was completely stunned.<br/><br/>His expression changed instantly, and his pupils dilated.<br/><br/>“You… you…”<br/><br/>He opened his mouth and was somewhat dumbfounded!<br/><br/>At this moment, Wang Xian was standing in front of all the disciples of the Great Thunderclap Academy, the Divine Thunder City, the Purple City, and Liuyan City.<br/><br/>He had the aura of one man holding off ten thousand enemies.<br/><br/>“All of you can go and Die Now!”<br/><br/>Wang Xian stood there and said with a smile.<br/><br/>“Roar Roar Roar Roar!”<br/><br/>In the next moment, godly dragons flew out from his body. There were a total of nine godly dragons’shadows.<br/><br/>The power of the nine godly dragons enveloped all the disciples of the Great Thunderclap Academy.<br/><br/>The Godly Dragon’s power, which was as powerful as a prison, pressed forward.<br/><br/>“No, no, no! How is this possible? !”<br/><br/>“The Power of a Pinnacle Universe Knight! He is a Pinnacle Universe Knight! No, Dean, ancestor, save us!”<br/><br/>“City leader, save us!”<br/><br/>When the nine godly dragons rushed toward them, all the disciples of the Great Thunder Sound College looked desperate and shouted.<br/><br/>They were just a group of disciples, and their power was not as powerful as their army.<br/><br/>However, now that they were facing the attack of a universe pinnacle warrior, how could they resist?<br/><br/>What made them even more terrified was that the eldest senior brother of the Thunder light race was actually so terrifying!<br/><br/>“Damn it, your thunder light race deserves to die. You actually hid a pinnacle warrior. I’ll make you pay a hundred times the price!”<br/><br/>On the battlefield of the group of Pinnacle Warriors in the center, the battle on their side had already erupted.<br/><br/>The Thunder light race was instantly suppressed.<br/><br/>The city leader of Godly Thunder City sensed the situation on this side. He swept his gaze over and realized that his son’s aura had completely disappeared. He roared ferociously.<br/><br/>The Thunder Light Race had actually hidden a universe knight pinnacle great being, and it was the Thunder Light Race’s eldest senior brother…<br/><br/>This completely caught them off guard.<br/><br/>“How could this be!”<br/><br/>The expressions of the Great Thunderclap Academy Dean and the other Universe Knight Pinnacle Great Beings changed drastically.<br/><br/>When the battle erupted, they had already used their powerful treasures to investigate.<br/><br/>This was to prevent the thunder light race from concealing their power and suddenly launching a sneak attack.<br/><br/>They dared to guarantee that their detection methods would not have any flaws, and all the great beings would be able to detect it.<br/><br/>However, they did not expect that a universe knight with Pinnacle Combat Power would appear.<br/><br/>And he was the eldest senior brother of the Thunder Ray Race!\t\t\t\t\t\t</div>", "images": {}, "success": true}