{"id": 411, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072723.html", "title": "Chapter 3402 - 3402 3401 Took Out The Innate Spiritual Treasure", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3402 - 3402 3401 Took Out The Innate Spiritual Treasure</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3402 3401 took out the innate spiritual treasure<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>“Please take a seat, eldest senior brother!”<br/><br/>Before the auction on Hanging Thunder Island, Wang Xian and a group of disciples from the Lightning race flew over. When they saw the second supreme elder and the rest from the Lightning race, they immediately sat at the back.<br/><br/>The group of disciples made Wang Xian sit at the front respectfully.<br/><br/>“Hehe, Wang Xian, well done!”<br/><br/>In front, the second Supreme Elder, first elder and the rest looked over and nodded at him with a smile on their faces.<br/><br/>Wang Xian smiled and nodded back at them.<br/><br/>The eyes of the second supreme elder and the rest flickered slightly. They were also full of thoughts.<br/><br/>They felt that they couldn’t see through this disciple who had joined their lightning race.<br/><br/>At his current age, he already possessed such terrifying strength. He had unlimited potential in the future!<br/><br/>“Is that the new eldest senior brother of the Thunder Ray race, a Purebred Thunder Dragon?”<br/><br/>“To possess such terrifying strength at such a young age, he must have obtained a great opportunity!”<br/><br/>“He’s too strong. Has His strength reached level nine universe knight?”<br/><br/>At the surrounding area, a group of strong disciples from various factions looked over when they saw Wang Xian and the rest flying over.<br/><br/>Everyone had already received the news of the conflict between the Thunder Ray race and the Great Thunderclap Academy.<br/><br/>Many of the strong ones also witnessed this scene.<br/><br/>They sized up Wang Xian up close. Their eyes were filled with astonishment.<br/><br/>Their strength and talent left them in shock.<br/><br/>“HMPH!”<br/><br/>At the side, the strong ones and disciples from the Great Thunderclap Academy glanced at Wang Xian in a shady manner and snorted softly.<br/><br/>“Hehe, welcome to the auction in the Divine Thunder City. Thank you for your support. The auction will begin immediately!”<br/><br/>Not long after, the auction officially began.<br/><br/>Wang Xian sat at the bottom and watched quietly.<br/><br/>However, it didn’t attract Wang Xian much.<br/><br/>Throughout the entire auction, there weren’t any treasures that could attract him.<br/><br/>This made him slightly disappointed.<br/><br/>The auction in the Divine Thunder City was still a little low-level for a powerhouse like Wang Xian.<br/><br/>The auction lasted for more than ten hours. All the items were auctioned off.<br/><br/>After Wang Xian obtained the resources he obtained from the auction, he didn’t stay in the Divine Thunder City.<br/><br/>“Eldest senior brother, what are your next actions?”<br/><br/>Following the group of female disciples back to the Lightning race, Lei Zhengyun, Lei Yunzi and the rest asked.<br/><br/>“I’m going out for a while. I’ll be back in a few months!”<br/><br/>Wang Xian said to them.<br/><br/>“HMM? Where are you going, eldest senior brother?”<br/><br/>The group of female disciples asked curiously.<br/><br/>“I’m going to Jiuri City!”<br/><br/>Wang Xian didn’t hide anything and said directly.<br/><br/>“Jiuri City. Eldest senior brother, are you going to Jiuri City? It’s very far!”<br/><br/>Lei Yunzi and the rest said in surprise.<br/><br/>“Yes, there’s something that I have to do!”<br/><br/>Wang Xian nodded his head.<br/><br/>“Alright then, we won’t bother eldest senior brother!”<br/><br/>The group of girls nodded their heads.<br/><br/>“Yes, I’ll head there immediately. I’ll be back as soon as possible!”<br/><br/>Wang Xian said as he waved his hand at them and left through the teleportation formation.<br/><br/>“Eldest senior brother, be careful!”<br/><br/>The group of female disciples said.<br/><br/>“HMM? Where’s your eldest senior brother?”<br/><br/>Not long after Wang Xian left, the figure of the great elder appeared on the mountain peak where the disciples lived.<br/><br/>He did not sense Wang Xian and happened to see the group of female disciples. He asked.<br/><br/>“First Elder, eldest senior brother has just left and is heading to nine Sun City. He will be back in a few months!”<br/><br/>The group of female disciples replied immediately.<br/><br/>“Oh? Nine Sun City?”<br/><br/>First Elder raised his eyebrows, nodded his head, and left.<br/><br/>“Clan leader, Grand Elder, Wang Xian’s disciple has just left and is heading to nine Sun City. He will be back in a few months!”<br/><br/>The grand elder came to the main hall of the Thunder Ray race and reported to the clan leader and a few grand elders.<br/><br/>“Oh, let’s meet him when he comes back!”<br/><br/>“Hehe, I wonder if his strength has already reached the level 9 combat strength of a universe Knight!”<br/><br/>The clan leader and the Grand Elders originally wanted to meet Wang Xian. Now that he had left, they could only wait for him to return before meeting him again.<br/><br/>“In terms of combat strength, he is 100% able to fight against a universe Knight Level 9 powerhouse. It seems that the fire dragon pearl has improved him a lot!”<br/><br/>The second Supreme Elder spoke.<br/><br/>“He must have hidden some secrets in the past. Otherwise, it would be impossible for him to improve so quickly.”<br/><br/>One of the supreme elders guessed.<br/><br/>The clan leader nodded in agreement.<br/><br/>“Greetings clan leader, clan leader. We have discovered that there are signs of the birth of a treasure in the eastern part of the Thundercloud Domain. The energy is extremely terrifying. It is definitely a powerful treasure!”<br/><br/>At this moment, a figure suddenly flew over in a panic and reported loudly.<br/><br/>“Eh?”<br/><br/>The eyes of the clan leader and the rest of the Thunderlight clan lit up.<br/><br/>…<br/><br/>“It should be able to make a move on the innate spiritual treasure in nine Sun City!”<br/><br/>At this moment, Wang Xian flew out from a city. He looked at the map and flew into the distance.<br/><br/>Nine Sun City was the nearest big city that Wang Xian found after researching for the past few days.<br/><br/>The so-called big city that he mentioned was a city that could digest innate spiritual treasures.<br/><br/>Nine Suns city was a city at the edge of the Divine Tiger clan.<br/><br/>The Divine Tiger clan was one of the top races in the universe.<br/><br/>The Tiger clan might only be a famous animal on Earth, but in the universe, the Divine Tiger clan was indeed very powerful.<br/><br/>There were many types of the Divine Tiger clan. In general, they could be divided into two royal clans. One of the royal clans was good at fighting while the other was good at speed!<br/><br/>None of the top races were weak. Their terror was enough to suffocate the other races.<br/><br/>Nine Sun City was only a peripheral city of the godly tiger race. It was very big, and it was possible to occasionally encounter great beings of the godly tiger race.<br/><br/>Besides, the city leader of nine Sun City was a great being at the pinnacle level of a universe knight.<br/><br/>It was rumored that he was a great being of the godly tiger race who had been expelled from the race for committing crimes.<br/><br/>This also meant that he possessed the combat strength of a level 3 universe overlord.<br/><br/>Due to the presence of experts, nine suns city quickly became prosperous and formed a large-scale trading market.<br/><br/>Around Nine Suns city, there were a few forces that possessed the combat strength of a universe overlord. This also caused the occasional appearance of innate spiritual treasures in this large-scale city.<br/><br/>Therefore, it shouldn’t be a problem to sell the innate spiritual treasures.<br/><br/>Furthermore, there was another reason why Wang Xian chose nine Sun City.<br/><br/>In the Divine Tiger clan, the royal clan that specialized in speed had the wind and thunder attributes as their main attributes.<br/><br/>Wang Xian’s innate thunder bell was extremely useful to the Thunder attribute experts.<br/><br/>He was trying to see if he could attract some experts from the Divine Tiger clan over. That way, he would be able to sell it for a good price.<br/><br/>Wang Xian was thinking as he flew at an extremely fast speed.<br/><br/>He needed to go to another city to carry out the teleportation.<br/><br/>The teleportation formation was not connected to each other within the heaven opening primeval era.\t\t\t\t\t\t</div>", "images": {}, "success": true}