{"id": 425, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072751.html", "title": "Chapter 3416 - 3416 3415 Annihilated Liuyan City Once Again", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3416 - 3416 3415 Annihilated Liuyan City Once Again</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3416 3415 annihilated Liuyan City once again<br/><br/>“Wang Xian, it’s all thanks to you this time. If not, the consequences would be unimaginable. On behalf of the entire lightning race, I would like to thank you!”<br/><br/>In the main hall of the Lightning race, a group of supreme elders, elders, and clan leader looked at Wang Xian and said gratefully.<br/><br/>“Clan leader, elders, all of you have treated me well. Naturally, I, Wang Xian, will not stand idly by.”<br/><br/>Wang Xian swept his gaze across them and smiled faintly.<br/><br/>“Hahaha, it seems that we have good taste. I didn’t expect you to be so strong!”<br/><br/>The first elder laughed out loud and stared at Wang Xian as he said with a sigh.<br/><br/>Wang Xian could be considered as someone who was recruited by him. If that day did not come, they would not have such a good result today.<br/><br/>If Wang Xian wasn’t around, the Thunder Ray tribe would have lost at least half of their strong disciples this time. Furthermore, there was a high possibility that they would be forced to retreat to the grotto-heaven blessed land.<br/><br/>“With your strength, Wang Xian, there’s no need for you to join our Thunder Ray tribe, right?”<br/><br/>The tribe leader hesitated for a moment before asking.<br/><br/>This was what the Thunder Ray tribe was most curious about. With Wang Xian’s strength, there was no need for him to join them.<br/><br/>Now, with Wang Xian’s strength alone, he could fight against the entire thunder ray tribe.<br/><br/>After all, it was too terrifying to fight against seven of them alone!<br/><br/>“Hehe, tribe leader, I originally came to the Thunder Ray tribe for Lei Yu. At that time, I did hide some of my strength. However, at that time, I was only a level nine universe knight.”<br/><br/>Wang Xian smiled and did not hide anything. He spoke frankly.<br/><br/>“For Lei Yu? The Lei Yu that I gave you back then?”<br/><br/>The great elder was slightly shocked and said.<br/><br/>“That’s right. Initially, I was not prepared to join the Thunder Ray tribe. I was prepared to leave after I got it.”<br/><br/>Wang Xian smiled.<br/><br/>“That was really a coincidence. Perhaps this is the luck of our Thunder Ray Tribe.”<br/><br/>The clan leader smiled and said happily.<br/><br/>Wang Xian nodded his head. If the great elder had not rewarded him with treasures back then, the situation would have been different now.<br/><br/>“Haha, this is really the fortune of our Thunder Ray Race!”<br/><br/>After learning the result, the experts of the Thunder Ray race were also full of smiles.<br/><br/>They were already very satisfied with this result.<br/><br/>As for the other matters, were they important?<br/><br/>It was enough for Wang Xian to stand on their side and fight for the Lightning race.<br/><br/>“Reporting to the clan leader!”<br/><br/>At this moment, an expert from the Lightning race flew over and bowed respectfully.<br/><br/>“Oh? Is there any news?”<br/><br/>The clan leader of the Lightning race asked directly when he saw that the disciple was dressed in black.<br/><br/>“Clan leader, we have been monitoring the Liuyan city. We have already set up a teleportation formation in secret. We can teleport there immediately. We have already investigated the situation at the mayor’s residence of Liuyan City!”<br/><br/>“However, the city lord of Liuyan City and the Army of Liuyan City have not returned yet.”<br/><br/>The disciple in black said.<br/><br/>“HMPH, how dare they attack us from a small city like Liuyan City? They don’t know what’s good for them!”<br/><br/>The Thunder Race’s clan leader revealed a violent killing intent in his eyes.<br/><br/>“HMM? Clan leader, are we going to attack Liuyan City?”<br/><br/>Wang Xian looked over and asked with a raised brow.<br/><br/>“A while ago, we discovered that Liuyan city was acting sneakily. Hence, we have sent people to monitor it. However, we didn’t expect that they would dare to follow the Great Thunderclap Academy and attack us.”<br/><br/>The chief of the Thunder Ray tribe said with a cold gaze.<br/><br/>“Let’s go. We will attack and destroy everyone in Liuyan City!”<br/><br/>He swept his gaze across the surroundings and said in a sinister tone.<br/><br/>“Alright, Chief. I will go with you!”<br/><br/>Immediately, the four great elders of the Lightning race spoke. Their bodies were filled with killing intent.<br/><br/>“Clan leader, do you still want me to go over?”<br/><br/>Wang Xian raised his eyebrows and asked.<br/><br/>“No need. The city Lord and the army of Liuyan City have yet to return. There are no experts in Liuyan city. It’s enough for us to go over!”<br/><br/>The clan leader of the Lightning race shook his head.<br/><br/>Wang Xian nodded his head. There was no danger or difficulty. The leader of the Lightning race and the rest could handle it on their own.<br/><br/>“Wang Xian, I’ll have to trouble you to take charge of the Lightning race from now on.”<br/><br/>The leader of the Lightning race said to him.<br/><br/>“No Problem!”<br/><br/>Wang Xian nodded his head. “I’ll return to the palace first. If there’s anything, the elders can inform me.”<br/><br/>“Alright, Wang Xian, you should go and rest first!”<br/><br/>The grand elders nodded their heads.<br/><br/>Wang Xian moved his body and flew into his palace.<br/><br/>Now that he had gathered all the resources to level up, as long as he absorbed them, his combat strength would be able to reach the first level of the Master of the universe.<br/><br/>With such strength, he would be able to kill his way to the Great Thunderclap Academy by himself and wipe them out completely.<br/><br/>After dealing with all the troubles of the Thunder Ray race, he could consider traveling to other places.<br/><br/>After returning to the palace, Wang Xian did not have to hide anything this time. He transformed into his divine dragon body and started to devour the divine fruits of the universe masters.<br/><br/>Just as Wang Xian was about to level up, the calamity of Liuyan City arrived.<br/><br/>As one of the more than ten cities in the Thunder Cloud Domain, Liuyan city was considered to be relatively strong as it was overseen by a Top-notch universe knight.<br/><br/>When all the residents in Liuyan City learned that their city leader and the Great Thunder Sound Academy had gone to attack the Thunder light race, the whole city was in an uproar.<br/><br/>Those disciples who were not citizens of Liuyan city immediately left.<br/><br/>Because once the war broke out, they would not rest until one of them was dead.<br/><br/>Especially when they went to attack a thunder light race that was almost ten times stronger than Liuyan City.<br/><br/>Some people were afraid of being affected, so they left immediately. However, the real citizens of Liuyan City didn’t leave.<br/><br/>They trusted the city leader because they knew that if Liuyan City joined hands with Great Thunder Academy and Thunder God City, they would be 100% confident.<br/><br/>Other than the smaller number of people in Liuyan City, there wasn’t much of an impact.<br/><br/>However, before the citizens of Liuyan City knew about the situation on the battlefield, five Pinnacle Universe Knights led by the leader of the Thunder race arrived.<br/><br/>“Kill everyone in Liuyan City, leave no one alive!”<br/><br/>A cold roar came from the leader of the Thunder race. The five of them didn’t show any mercy and vented their killing intent in Liuyan City.<br/><br/>This was the end for Liuyan City!<br/><br/>The terrifying attack caused the entire city to collapse rapidly. Only the grotto-heaven in the city leader’s mansion managed to save some lives.<br/><br/>The rest were all killed.<br/><br/>This was the price!<br/><br/>To start a war, one had to pay the price of being destroyed.<br/><br/>The entire city was reduced to ruins in less than five minutes.<br/><br/>The destruction of Liuyan city immediately caused a huge commotion.<br/><br/>Soon after, news of the war between the Lightning race, the destruction of Liuyan City, and the destruction of clay city spread like wildfire in the Thundercloud Domain and the surrounding area.<br/><br/>When they received the news one by one, their faces were filled with shock.<br/><br/>They had never imagined that this war would change completely because of one person.\t\t\t\t\t\t</div>", "images": {}, "success": true}