{"id": 423, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072747.html", "title": "Chapter 3414 - 3414 The Four Forces Of 3413 Were Defeated And Forced To Retreat", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3414 - 3414 The Four Forces Of 3413 Were Defeated And Forced To Retreat</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3414 The four forces of 3413 were defeated and forced to retreat<br/><br/>“Roar! Roar! Roar!”<br/><br/>A furious roar was heard. Wang Xian swayed his huge body while the purple lightning snake accompanied him. The five elements millstone was suspended above his head.<br/><br/>He moved his body and charged towards the group of experts from the Great Thunderclap Academy’s Divine Thunder City.<br/><br/>“Kill him! I don’t believe that he can fight against the seven of us!”<br/><br/>Sensing the might of Wang Xian and the rest, an expert from the great thunderclap academy gritted his teeth and shouted.<br/><br/>They really didn’t believe that the eldest senior brother of the Thunder Ray race could fight against the seven of them alone.<br/><br/>“Kill!”<br/><br/>The Seven Peak Universe Knight experts roared and charged towards Wang Xian.<br/><br/>“Eldest senior brother, be careful!”<br/><br/>“Eldest senior brother, you must be careful!”<br/><br/>At the back, a group of thunder race disciples saw Seven Peak Universe Knights attacking Wang Xian. Their expressions changed drastically as they reminded him loudly.<br/><br/>“Roar!”<br/><br/>Wang Xian growled in a low voice. The five elements grinding mill above his head was emitting a luster as streams of energy charged towards them.<br/><br/>The Purple Thunder Snake raised its head and welcomed them directly.<br/><br/>Wang Xian swayed his huge body as his body moved. He flapped his incipient saint wings and displayed a terrifying speed!<br/><br/>Whoosh<br/><br/>At the moment when they surrounded him, Wang Xian’s terrifying speed had already arrived at the position behind them.<br/><br/>“Cloud and mist dragon surge!”<br/><br/>Wang Xian growled. The surrounding clouds and mist began to condense and instantly covered an area of more than a billion kilometers.<br/><br/>It enveloped all of them within it.<br/><br/>Due to the fact that they were surrounded by thunderclouds, the ability of Cloud and mist dragon surge was even more terrifying.<br/><br/>Within this space, everyone’s line of sight increased greatly.<br/><br/>“Be careful, expel the clouds!”<br/><br/>An expert from divine thunder city shouted loudly.<br/><br/>“Hong!”<br/><br/>At this moment, a terrifying dragon tail swept out.<br/><br/>“Be careful!”<br/><br/>The surrounding experts roared loudly. The expression of the expert who was attacked changed slightly as he hurriedly defended.<br/><br/>“Peng!”<br/><br/>“Pu!”<br/><br/>However, he was caught off guard and was sent flying by the powerful force. He spat out a mouthful of blood.<br/><br/>“His speed is very fast. He should have a speed supreme treasure of the Connate Numinous Treasure level on him. Let’s lean against each other!”<br/><br/>The expert who was sent flying immediately roared loudly, and his expression was extremely ugly.<br/><br/>He was actually in a passive position in a one-on-seven situation. This was something that they had never imagined.<br/><br/>“Roar Roar Roar!”<br/><br/>At this moment, the purple lightning snake also charged over. The lightning on its body raged, and the innate spiritual treasure released a powerful lightning pillar that swept towards the experts.<br/><br/>The five elements millstone revolved, and similarly charged over.<br/><br/>“Block this powerful weapon and that lightning snake!”<br/><br/>They felt the power contained within the five elements millstone, and their expressions changed once again.<br/><br/>They could sense that the five elements millstone was even more terrifying than the strange eldest senior brother of the Thunder Light race.<br/><br/>The eldest senior brother of the Thunder light race was terrifying because of his speed.<br/><br/>And the five elements millstone was terrifying because of its attacks. They were overwhelmed by all kinds of elemental weapons.<br/><br/>This was especially so for the two Pinnacle Universe Knights<br/><br/>They had already witnessed the strength of the Five Elements Millstone. That terrifying attack was definitely not something that two peak-stage universe knights could withstand.<br/><br/>The Four Great Beings went up against the five elements millstone and the Purple Thunder Snake. The remaining three peak-stage universe knights went up against Wang Xian.<br/><br/>“Trap him!”<br/><br/>The three great beings who were fighting against Wang Xian roared. Their backs were facing each other like a triangle as they stared at the surrounding void space.<br/><br/>Numerous binding bolts of lightning and chains were held in their hands as they waited for Wang Xian’s attack with a cold expression.<br/><br/>“Hehe!”<br/><br/>Wang Xian chuckled. He did not attack the three of them. Instead, he fluttered his incipient Saint Wings and instantly launched a sneak attack on the flying purple lightning snake.<br/><br/>“Damn it, tie him down!”<br/><br/>The old man who had just collided with the purple lightning snake was repelled. When he sensed a terrifying energy charging towards him, he immediately roared loudly.<br/><br/>“Damn it, his speed is comparable to a peak master of the universe. It’s impossible for us to stop him!”<br/><br/>The three experts who were surrounding each other saw this scene and their expressions changed drastically.<br/><br/>Wang Xian was very fast and was able to maintain the initiative.<br/><br/>He could fight against three of them by himself. The Five Elements Millstone could also fight against three of them by himself.<br/><br/>As for the purple lightning snake, it could fight against two of them.<br/><br/>However, right now, the opponent only had seven peak-stage universe knights. Furthermore, they did not have any treasures on the level of innate spiritual treasures.<br/><br/>Under such circumstances, the opponent was not a match for Wang Xian and the rest.<br/><br/>They would be slightly suppressed by Wang Xian and the rest.<br/><br/>It might be very difficult for Wang Xian to kill them. However, if they were to fight for one or two days, he could still find an opportunity to exhaust one of them.<br/><br/>Once the balance was broken, the opponent would not be his match.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Bolts of lightning chains and lightning ropes appeared behind him. Wang Xian could only give up on attacking the expert. He flapped his incipient saint wings and left instantly.<br/><br/>“Phew!”<br/><br/>The expert who sensed that the danger had disappeared exhaled heavily. He stared at the purple lightning snake in front of him with an embarrassed expression, he roared, “I am no match for this thunder snake. I will be completely suppressed. Once that senior brother of the Thunder race attacks me, I will be in great danger.”<br/><br/>“Hu, how can this guy be so strong? We Seven Pinnacle Universe Knights can’t do anything to him!”<br/><br/>Hearing his words, the great beings of Godly Thunder City and Great Thunder Sound College looked extremely embarrassed.<br/><br/>It was a seven-on-one battle. Under such circumstances, they were still in a passive position. They were completely led away. This made them feel embarrassed but at the same time, they were also a little terrified.<br/><br/>The opponent’s strength was really terrifying.<br/><br/>“Dean, the eldest senior brother of the Thunder Ray race is very strong. We can only barely hold him back!”<br/><br/>An expert from the Great Thunderclap Academy had a change in expression. He growled in a low voice and passed the information over to the dean of the Great Thunderclap Academy.<br/><br/>“What?”<br/><br/>When Wang Xian and the rest were surrounded by clouds and mist, they couldn’t sense the specific situation here.<br/><br/>However, for the experts from the Great Thunderclap College, Purple City, Divine Thunder City, and Liuyan City, wouldn’t it be easy for them to fight against the eldest senior brother of the Lightning race in a seven-on-one situation?<br/><br/>They never expected that such a message would be sent out now.<br/><br/>Seven against one could only barely hold them back. This… Was this F * cking senior brother of the Lightning race really that freakish?<br/><br/>It could also be said that the strength of the Lightning Race’s senior brother alone could almost rival that of the Lightning Race’s patriarch, Supreme Elder, and the others?<br/><br/>“How could this be? How could his strength be so strong?”<br/><br/>When the city lords of Purple City and Liuyan City received this news, their expressions changed.<br/><br/>The reason why they joined to deal with the Lightning race was because they had 100% confidence.<br/><br/>But now that such an expert had appeared in the Lightning race, it was basically impossible for them to defeat him.<br/><br/>Then, they would completely become enemies with the Lightning race.<br/><br/>With the strength of Purple City and Liuyan City, there was no way they could withstand the lightning race’s revenge.\t\t\t\t\t\t</div>", "images": {}, "success": true}