{"id": 421, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072743.html", "title": "Chapter 3412 - 3412 3411 Killed One After Another, Fighting Against The Top Six Universe Knights", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3412 - 3412 3411 Killed One After Another, Fighting Against The Top Six Universe Knights</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3412 3411 killed one after another, fighting against the top six universe knights<br/><br/>“Bang! Bang!”<br/><br/>With an explosion, Wang Xian appeared at the side of the city leader of Divine Thunder City. He extended his Dragon Claw and grabbed at his upper body.<br/><br/>“Ah!”<br/><br/>The city leader of Divine Thunder City let out a miserable scream when his upper body was grabbed.<br/><br/>“Buzz!”<br/><br/>At this moment, his lower body, which he wanted to escape, was also locked down by the Five Elements Millstone. Streams of energy sealed it.<br/><br/>“You Want to kill me with your strength? Hehe, go down and accompany your son!”<br/><br/>Wang Xian stared at the city lord of Divine Thunder City with disdain. He waved his arm and a wave of destructive power surged into his body.<br/><br/>At the side, the five elements millstone also directly destroyed the lower half of his body.<br/><br/>The famous city lord of Divine Thunder City in the Thunder Cloud Domain had fallen!<br/><br/>A Pinnacle Universe Knight had fallen!<br/><br/>“Hiss!”<br/><br/>At this moment, the entire battlefield fell into a strange silence.<br/><br/>Everyone looked over in disbelief, their faces filled with shock.<br/><br/>Thunder city leader had actually died.<br/><br/>He had been killed by the senior brother of the Thunder Light Race!<br/><br/>This was the leader of the second most powerful force in the Thunder Cloud Domain, and he was not an ordinary pinnacle universe knight.<br/><br/>However, he did not even last a minute against the eldest senior brother of the Thunder Light race.<br/><br/>“How… How is this possible? The city leader of Godly Thunder City was killed by him, and he even has a powerful war pet!”<br/><br/>“City leader! City leader!”<br/><br/>In the middle of the battlefield, the Dean of Great Thunder Sound Academy and the other Pinnacle Great Beings looked over, and their expressions changed drastically.<br/><br/>A great being who could kill the city leader of Godly Thunder City, and a great being with a pinnacle battle pet of a universe knight.<br/><br/>This would bring them great trouble.<br/><br/>Especially the disciples of the Great Beings of Godly Thunder City. When they saw their city leader being killed, they looked extremely embarrassed.<br/><br/>This was their city leader!<br/><br/>“So Strong, so powerful. His power is even stronger than mine!”<br/><br/>The leader of the Thunder Ray race looked over with excitement in his eyes.<br/><br/>In a one-on-one situation, he could completely suppress the city lord of the Divine Thunder City. However, it was extremely difficult to kill him.<br/><br/>However, Wang Xian was actually able to kill him. Most importantly, he had a war pet at the peak of the Universe Knight Realm.<br/><br/>That War pet also had an innate spiritual treasure. What else could he say?<br/><br/>He could only say that it was awesome!<br/><br/>“Hahaha, Long live the eldest senior brother! The eldest senior brother is invincible!”<br/><br/>“The eldest senior brother is invincible! Let’s destroy this bunch of guys!”<br/><br/>All the disciples of the Thunder Ray race cheered excitedly when they saw Wang Xian killing the city lord of the Divine Thunder City.<br/><br/>In an instant, the morale of the Thunder Ray race soared.<br/><br/>Wang Xian smiled faintly and moved his body instantly. His target was the peak of the Universe Knight realm expert from the Great Thunderclap Academy who was entangled with the purple thunder snake.<br/><br/>“Damn it!”<br/><br/>“Dean of Court, back me up!”<br/><br/>When that powerhouse saw Wang Xian rushing towards him, he revealed a terrified expression and immediately roared loudly.<br/><br/>Currently, he was completely suppressed when he fought against the Purple Thunder Snake alone. Now that the guy who killed the city lord of Divine Thunder City was rushing over, he didn’t have the strength to resist at all.<br/><br/>He might even be killed easily.<br/><br/>“Oh no, quickly go and support the three ancestors!”<br/><br/>The Great Thunderclap Academy’s Headmaster looked over, and his expression changed drastically as he roared loudly.<br/><br/>“Kill, Kill, Kill!”<br/><br/>The Lightning Race’s clan head roared furiously, and the lightning battle axe in his hand slashed forward. The might of a connate numinous treasure was as if it could split the heavens and split the earth.<br/><br/>A few supreme elders immediately unleashed their most violent attacks to stop them from going to help.<br/><br/>“Thunder Ray race, you are courting death!”<br/><br/>The headmaster of the Great Thunderclap Academy roared, and his eyes were filled with murderous intent.<br/><br/>Although the leader of the Thunder Ray race and the others tried their best to stop them, the Great Thunderclap Academy still had a lot more people. Two peak-stage universe knights immediately rushed out to assist the Great Thunderclap Academy’s experts.<br/><br/>“Two is not enough!”<br/><br/>Wang Xian smiled when he saw the two peak universe knights rushing over.<br/><br/>He waved his arm and the five elements Millstone went straight for the two peak universe knights.<br/><br/>“Roar Roar Roar!”<br/><br/>Five divine dragons stretched out their bodies on the five elements millstone. Streams of energy of the five elements attacked them.<br/><br/>“What!”<br/><br/>“What kind of treasure is this? How can it unleash such a terrifying attack?”<br/><br/>The expressions of the two peak universe knights who were charging over changed drastically when they sensed the attack of the five elements millstone.<br/><br/>They felt a sense of threat from the five elements millstone.<br/><br/>The threat of death!<br/><br/>This made them feel incredulous!<br/><br/>No one was controlling this treasure. How could it be so powerful even when no one was controlling it?<br/><br/>Crash<br/><br/>The moment Wang Xian threw out the five elements millstone, he flapped his incipient saint wings and pushed his speed to the limit. He charged straight towards the powerhouse who was fighting with the purple lightning snake.<br/><br/>His speed instantly arrived at the side. He drew a greenish-purple shadow and charged towards him.<br/><br/>“Dean, save me! Save Me Quickly!”<br/><br/>When that powerhouse saw Wang Xian’s shadow, his heart trembled violently.<br/><br/>He was no match for the Purple Lightning Snake in a one-on-one fight. Now that he had Wang Xian who possessed terrifying speed, he wouldn’t be able to hold on for more than a few seconds.<br/><br/>If the reinforcement was one step slower, he would die here.<br/><br/>“D * MN it, how is this possible? Dean, this supreme treasure is too powerful. It can completely restrain the two of us!”<br/><br/>Hearing the three ancestors’fearful request for help, the two pinnacle great beings who were supporting them from behind also roared with an unsightly expression.<br/><br/>They were actually held back by a weapon!<br/><br/>“This is bad!”<br/><br/>The dean of Great Thunder Sound College looked over and his eyes were about to crack.<br/><br/>They originally had 18 Pinnacle Great Beings who were universe knights. However, the city leader of Clay City didn’t come for some unknown reason, and the city leader of Godly Thunder City was killed.<br/><br/>There were 16 left!<br/><br/>One was surrounded and killed by the purple thunder snake and Wang Xian, while the other two were restrained by that terrifying true treasure. There were still 13 on their side.<br/><br/>However, the Great Beings of the Thunder light race were trying to stop them like crazy. It would take them a few seconds to escape.<br/><br/>If they were to fly over to support them, it would take them at least seven to eight seconds.<br/><br/>“I hope nothing bad will happen!”<br/><br/>The headmaster of the Great Thunderclap Academy prayed in his heart. He stared at the two great beings from the divine thunder city and said, “You guys go and provide support. You must save the three ancestors of the Great Thunderclap Academy. We will defend this side!”<br/><br/>He shouted loudly.<br/><br/>“Alright!”<br/><br/>The two great beings from the divine thunder city gritted their teeth and replied immediately.<br/><br/>Now that they were on the same side, Wang Xian’s appearance had completely disrupted their deployment.<br/><br/>Next, they absolutely could not allow any peak universe knight to die. Otherwise, they would be in big trouble.<br/><br/>“Let’s Fight!”<br/><br/>The dean of the Great Thunderclap Academy held the Thunder staff in his hand. The nine light spots above his head emitted purple light.<br/><br/>Dong Dong Dong<br/><br/>The incomparably huge innate true treasure thunder bell exploded with a loud sound.<br/><br/>Two great beings from Divine Thunder City escaped and headed towards the support of the three ancestors of the Great Thunderclap Academy.<br/><br/>“Two is not enough!”<br/><br/>Sensing the situation over there, Wang Xian didn’t let out a cold snort. Instead, he locked his gaze on the peak-stage universe knight in front of him and attacked him directly.\t\t\t\t\t\t</div>", "images": {}, "success": true}