{"id": 422, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072745.html", "title": "Chapter 3413 - 3413 3412 Killed Consecutively And Fought Against The Seven Universe Knights At Their Peak", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3413 - 3413 3412 Killed Consecutively And Fought Against The Seven Universe Knights At Their Peak</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3413 3412 killed consecutively and fought against the seven universe knights at their peak<br/><br/>“Ah!”<br/><br/>When the powerhouse from the great thunderclap academy who was surrounded saw Wang Xian attacking him, a ferocious look appeared on his face.<br/><br/>His entire body was extremely violent and he was going all out!<br/><br/>He was going all out to buy himself ten seconds.<br/><br/>“Going all out?”<br/><br/>Wang Xian narrowed his eyes slightly. “Go all out then. Purple Thunder Snake, go all out!”<br/><br/>He immediately gave an order.<br/><br/>Fight with my life?<br/><br/>I have my battle pet!<br/><br/>My battle pet also has an innate spiritual treasure. If I were to fight with my life in an instant, this expert from the Great Thunderclap College would definitely die.<br/><br/>The purple lightning snake would also be severely injured.<br/><br/>However, Wang Xian was still waiting for an opportunity to strike. There was no telling if the purple lightning snake would be severely injured.<br/><br/>Even if it was severely injured, Wang Xian would still have the vitality fluid to treat it.<br/><br/>He was going all out and didn’t panic at all!<br/><br/>“Roar! Roar! Roar!”<br/><br/>When the purple lightning snake heard Wang Xian’s order, it let out a roar. Its eyes were filled with a violent aura.<br/><br/>The lightning horn on its head emitted a glow as it charged directly at the three ancestors of the Great Thunderclap Academy.<br/><br/>This kind of battle was purely about going all out.<br/><br/>“Damn it!”<br/><br/>When the three ancestors of the Great Thunderclap Academy saw how crazy the Purple Lightning Snake’s attack was, they gritted their teeth and wanted to dodge to the side.<br/><br/>He didn’t dare to risk it. He knew that he couldn’t win.<br/><br/>However, the moment he dodged, Wang Xian’s attack arrived.<br/><br/>Faced with Wang Xian’s terrifying speed, the only way the three grandmasters of the Great Thunderclap Academy could do was to defend with all their might.<br/><br/>However, with all their might, the purple lightning snake’s lightning horns would collide with him.<br/><br/>This was an unsolvable confrontation.<br/><br/>If he were to face Wang Xian alone, he would be able to defend with all his might if he was prepared, let alone ten seconds. He would be able to defend for a minute.<br/><br/>However, with the purple lightning snake, he had no way of withstanding it.<br/><br/>This was because the purple lightning snake’s attack was a desperate strike. If he didn’t want to be severely injured, all he had to do was to escape.<br/><br/>Therefore, this was an attack that he couldn’t escape from.<br/><br/>“Ah, block it for me!”<br/><br/>The three ancestors of the Great Thunderclap Academy gritted their teeth and roared with all their might. They set up a strong defense in front of them.<br/><br/>Boom<br/><br/>At this moment, the purple lightning snake’s lightning landed on his defense. The powerful attack from the Connate Numinous Treasure directly broke through the three ancestors’defense.<br/><br/>Furthermore, with the advantage of the connate numinous treasure, the attack continued to attack downwards.<br/><br/>“You’re courting death!”<br/><br/>When the three ancestors of the Great Thunderclap Academy saw this scene, their bodies trembled. They gritted their teeth and attacked the purple lightning snake’s head.<br/><br/>Boom<br/><br/>Due to the short distance and the fact that the purple lightning snake’s desperate attack was completely defenseless, the head of the purple lightning snake was hit hard instantly.<br/><br/>“Hehe!”<br/><br/>When Wang Xian saw that the three ancestors of the Great Thunderclap Academy had almost lost their rationality in their counterattack, he sneered.<br/><br/>At this moment, he had no other good choice.<br/><br/>Crash<br/><br/>PFFT<br/><br/>Wang Xian’s Dragon Claw came in front of the three ancestors of the Great Thunderclap Academy and penetrated his body directly.<br/><br/>“Cough cough, cough cough!”<br/><br/>The three ancestors of the great thunderclap school turned their heads to look at Wang Xian with an extremely unsightly and desperate expression.<br/><br/>“Die!”<br/><br/>Wang Xian said calmly as a terrifying energy surged into his body from his Dragon Claw.<br/><br/>The life force of the three ancestors of the great thunderclap school was quickly extinguished.<br/><br/>Everything happened within four seconds.<br/><br/>“No, third brother!”<br/><br/>When the life force of the three ancestors of the great thunderclap school disappeared, the great thunderclap school’s powerhouses who had been paying attention to the situation saw this scene. Their bodies trembled violently as they cried out involuntarily.<br/><br/>Another Peak Universe Knight had fallen!<br/><br/>This was the second peak universe knight who had died at the hands of Wang Xian.<br/><br/>He didn’t even have the time to send reinforcements.<br/><br/>“Not good!”<br/><br/>The two powerhouses from Divine Thunder City who were flying over changed their expressions slightly when they saw this scene. Their pupils contracted slightly.<br/><br/>A peak universe knight couldn’t even last for ten seconds.<br/><br/>The opponent’s strength was simply too terrifying!<br/><br/>“The two of us are no match for the other party at all. Request for reinforcements!”<br/><br/>The two experts from Divine Thunder City who were helping shouted and spoke.<br/><br/>The other party could almost instantly kill a peak-stage universe knight. Then, the two of them were definitely no match for the man and Snake.<br/><br/>Request for reinforcements!<br/><br/>“Another peak-stage universe knight was killed by Wang Xian!”<br/><br/>The leader of the Thunder Ray race and the rest were all excited.<br/><br/>They had a new understanding of Wang Xian’s strength.<br/><br/>“Hahaha, another one was killed, another one was killed by eldest senior brother!”<br/><br/>“Eldest senior brother is invincible!”<br/><br/>Cheers continued to ring out from the back. All the disciples of the Thunder Ray race were extremely excited.<br/><br/>At this moment, on the other hand, the disciples of the Great Thunderclap Academy from the Divine Thunder City looked extremely embarrassed.<br/><br/>The battle had just begun and they had already lost two peak-level masters. This was a huge blow to them.<br/><br/>“Fight!”<br/><br/>Wang Xian shouted in a low voice. He waved his arm and a large amount of life force liquid fell onto the head of the Purple Thunder Snake.<br/><br/>His figure flashed and he directly attacked the two peak-level masters of Universe Knights from the Divine Thunder City.<br/><br/>“Get lost! Send three more to stop that guy!”<br/><br/>The dean of Great Thunderclap Academy saw this scene and his eyes turned blood-red. His entire body turned violent as he spoke to the surrounding experts.<br/><br/>At this moment, they had to go all out.<br/><br/>They had never expected that the beginning of this battle would be such a situation!<br/><br/>A senior brother of the Thunder Ray race had actually forced them to such an extent.<br/><br/>“Kill, Kill, Kill!”<br/><br/>The Great Thunderclap Academy’s group of experts, who were prepared to suppress the thunder ray race bit by bit, had no choice but to go all out at this moment.<br/><br/>Among the 11 peak universe knights, three of them immediately attacked Wang Xian’s purple thunder snake.<br/><br/>Under such circumstances, there were only eight experts fighting against seven experts of the Thunder Ray race.<br/><br/>This greatly reduced the pressure on the leader and the rest of the Thunder Ray race.<br/><br/>“Purple Thunder Snake, Kill!”<br/><br/>Wang Xian gave an order to the Purple Thunder Snake. His body moved and went straight for the peak universe knights.<br/><br/>With the help of the five elements millstone, he could hold back six peak-stage universe knights by himself.<br/><br/>The Purple Thunder Snake could also fight against two peak-stage universe knights.<br/><br/>Together, they faced seven peak-stage universe knights without any fear.<br/><br/>“You’re courting death. Surround him and kill him!”<br/><br/>Seeing that Wang Xian was not afraid at all, the group of experts from the Great Thunderclap Institute and Divine Thunder City were filled with killing intent as they roared furiously.<br/><br/>“You guys are not qualified enough!”<br/><br/>Wang Xian’s eyes revealed a look of disdain as his body trembled.<br/><br/>“Transform into a dragon!”<br/><br/>“Roar Roar Roar!”<br/><br/>A dragon’s roar filled the air. Wang Xian swayed his gigantic dragon body and stared coldly at the Seven Peak Universe Knights.<br/><br/>The five elements grinding mill spun and waves of energy filled the surroundings.<br/><br/>The purple lightning snake came to Wang Xian’s side and locked its cold gaze on the enemy.<br/><br/>Wang Xian was fighting against seven enemies by himself.<br/><br/>After all, weapons and battle pets were his own strength.<br/><br/>Sensing the might of Wang Xian and the rest, the expressions of the peak universe knights from the Great Thunderclap Academy and the Divine Thunder City froze slightly.<br/><br/>They felt that they had really encountered an opponent this time.<br/><br/>The opponent’s strength was too terrifying!\t\t\t\t\t\t</div>", "images": {}, "success": true}