{"id": 428, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072757.html", "title": "Chapter 3419 - 3419 3,418 Was Making A Comeback, And Everyone Was Paying Attention To It", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3419 - 3419 3,418 Was Making A Comeback, And Everyone Was Paying Attention To It</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3419 3,418 was making a comeback, and everyone was paying attention to it<br/><br/>“The Great Thunder Sound College is going to go all out. Will any power be willing to pay a huge sum of money to ask a universe master for help?”<br/><br/>“It’s hard to say. If the four powers can come up with precious treasures, they might be able to invite them.”<br/><br/>“Now that the Thunder Light Race has made a statement, whoever helps the great thunder sound college will attack with all their might!”<br/><br/>“TSK TSK, now that the Great Thunderclap Academy, Purple City, Liuyan City, and Godly Thunder City are at their wits’end, the moment they can’t resist the Thunder Ray race, they will suffer a terrifying revenge, unless the four of them can unite into one force, but is that possible?”<br/><br/>On the universe AI, the forces around the Thunder Cloud Domain were discussing.<br/><br/>The Thunder Light race and the Great Thunder Sound Academy were both big forces. Along with the Thunder City and the others, the battle between them was the focus of everyone’s attention.<br/><br/>The Great Thunder Sound Academy lost the first battle, and the Thunder Light Race’s eldest senior brother appeared out of nowhere.<br/><br/>A Pinnacle Universe Knight with a powerful battle pet.<br/><br/>Such strength shocked everyone.<br/><br/>Now, if the Great Thunder Sound Academy wanted to defeat the Thunder light race, they needed someone strong to suppress the Thunder Light Race’s eldest senior brother.<br/><br/>To be safe, they would need a great being with the Combat Power of a universe ruler at level one!<br/><br/>Just as the groups of powers were discussing, two days later, they saw the Great Thunderclap Academy, Godly Thunder City, Purple City, and Liuyan City moving again.<br/><br/>At the entrance of the Great Thunderclap Academy, the armies of the four great powers were flying rapidly toward the direction of the Thunder Light race.<br/><br/>“HM?”<br/><br/>The Great Thunderclap Academy and the other great powers were so powerful that they immediately attracted the attention of all the great beings.<br/><br/>This caused them to be extremely shocked.<br/><br/>“What’s going on? The four great powers of the Great Thunderclap Academy have once again sent out their armies. Are they… are they completely confident?”<br/><br/>“Could it be that they have invited Great Beings at the universe ruler level for this expedition? How… how did they manage to do it in such a short period of time? What Price did they pay?”<br/><br/>“Hiss, this is really surprising. The Great Thunder Sound College is actually going on another expedition so quickly. They must have a trump card!”<br/><br/>Countless people were discussing and paying close attention to the specific situation of this war.<br/><br/>The armies of the four great powers were moving forward. A black cloud was in the sky, and it was vast and mighty.<br/><br/>The Thunder Light race was the first to receive this news, and their expressions were unusually grave.<br/><br/>“Clan leader, what should we do now? They actually attacked so quickly. They definitely have a powerful trump card, and it’s very likely that they are universe masters.”<br/><br/>The supreme elders of the Thunder Light Race had ugly expressions on their faces. They gathered together and discussed.<br/><br/>“Ask all our clansmen and disciples to retreat to our defensive grotto-heaven blessed land. The defense within the grotto-heaven should be able to hold out.”<br/><br/>The leader of the Thunder Light Race had an extremely grave expression.<br/><br/>With all the power of the entire race and the grotto-heaven blessed land, they were still able to withstand the attacks of a universe ruler Level 1 great being.<br/><br/>However, if the Great Thunder Sound Academy really invited a universe ruler level great being, the Thunder Light race would be in great trouble.<br/><br/>“Right, let’s retreat to the grotto-heaven blessed land first and take a look at the trump cards of the Thunder Light race. If they really invited a universe ruler level great being, there’s no need for us to resist. We’ll just go into seclusion in the grotto-heaven blessed land and wait for an opportunity.”<br/><br/>The first Supreme Elder of the Thunder Ray Race said.<br/><br/>Such an outcome would definitely be disastrous to the Thunder Ray race in the past. It might even be destructive.<br/><br/>But it was different now.<br/><br/>They had Wang Xian!<br/><br/>A pure-bred divine dragon with the combat strength of a peak universe knight.<br/><br/>They were confident and had a premonition that Wang Xian would be able to break through to the level of masters of the universe very soon.<br/><br/>At most, their entire race would go into seclusion for hundreds of millions of years. When Wang Xian broke through, it would be time for them to retaliate.<br/><br/>Therefore, they could accept it if they retreated into the grotto-heaven blessed land.<br/><br/>“Great Elder, go and inform Wang Xian to come over. We will ask him if he wants to enter the grotto-heaven blessed land with US or leave directly. We will wait for him to break through to save us.”<br/><br/>The leader of the Lightning race said.<br/><br/>“Alright!”<br/><br/>The great elder nodded and immediately flew towards the place where Wang Xian was staying.<br/><br/>Regardless of whether Wang Xian entered the grotto-heaven blessed land with them or cultivated in other places, the Lightning race would not have any objections.<br/><br/>After all, all they could rely on now was Wang Xian.<br/><br/>“Huh?”<br/><br/>Wang Xian, who was absorbing resources in the palace and preparing to improve himself, was slightly stunned when he received the news from the Great Elder.<br/><br/>He followed the great elder to the main hall. When he heard what the chief of the Thunder Ray tribe had said, he raised his eyebrows slightly.<br/><br/>“Chief, how long until the other party arrives?”<br/><br/>He asked.<br/><br/>“Around four days. That’s because they have set up a teleportation formation halfway through.”<br/><br/>The chief of the Thunder Ray Tribe said.<br/><br/>“Chief, let’s go outside. I’ll wait for an opportunity to make a move outside.”<br/><br/>Wang Xian didn’t say much to them and said to them.<br/><br/>“That’s fine too. But you have to be careful. We suspect that the Great Thunderclap Academy has invited an expert at the level of the Master of the universe. When the time comes, we will also leave the great elder and the two supreme elders to hide outside.”<br/><br/>“You can contact them when the time comes.”<br/><br/>The leader of the Thunder Ray Tribe said.<br/><br/>Wang Xian nodded his head.<br/><br/>The resources in his hands could be completely converted into dragon energy in less than ten days. After the upgrade, the problem of the lightning race should be easily solved.<br/><br/>Of course, if the other party could invite an expert with combat strength above the first level of the Universe Dominator, Wang Xian wouldn’t be able to do anything about it.<br/><br/>However, the possibility of that was very small.<br/><br/>“Alright, clan leader, don’t worry. The crisis this time will pass very soon!”<br/><br/>Wang Xian said with a smile.<br/><br/>“Haha, we believe that with you around, we will feel much more at ease.”<br/><br/>The Thunder Ray clan leader and the rest smiled.<br/><br/>“I will return to the palace first. Clan leader, you can handle your matters. You Don’t have to worry about me. An expert at the first level of the universe dominator can’t do anything to me.”<br/><br/>Wang Xian spoke a few more words to them before leaving.<br/><br/>As for the Thunder Ray race, he wasn’t in a hurry.<br/><br/>The Thunder Ray race had been established for so long. They still had their foundations. Even a level one universe dominator wouldn’t be able to destroy them.<br/><br/>As for the rest, it would be over once he broke through.<br/><br/>Wang Xian didn’t feel the slightest bit nervous. He returned to the palace to continue his advancement.<br/><br/>Just as he was improving rapidly, the armies of the Great Thunderclap Academy and the other four major forces had already arrived in front of the Lightning race.<br/><br/>“Hehe, they don’t dare to come out anymore? Haha!”<br/><br/>When the principal of the Great Thunderclap Academy and the rest saw that the lightning race didn’t dare to come out and accept the challenge, they laughed out loud.<br/><br/>“Let’s charge in. Those bastards from the Lightning race are already afraid!”<br/><br/>The city lord of Zi City shouted loudly, and the army charged into the interior of the Thunder Ray race.<br/><br/>Even after entering, they still did not encounter any resistance.<br/><br/>The Great Thunderclap Academy and the others were also very unrestrained.<br/><br/>Because they had experts!<br/><br/>They had confidence!\t\t\t\t\t\t</div>", "images": {}, "success": true}