{"id": 420, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072741.html", "title": "Chapter 3411 - 3411 3410 Killed A Peak Universe Knight", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3411 - 3411 3410 Killed A Peak Universe Knight</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3411 3410 killed a peak universe knight<br/><br/>Shock!<br/><br/>Shock!<br/><br/>At this moment, everyone’s faces were filled with shock.<br/><br/>Even the leader of the Thunder Ray race and the others who sensed the situation were also wide-eyed.<br/><br/>Holy shit!<br/><br/>What was going on?<br/><br/>The eldest senior brother of the Thunder Ray race’s disciple, Wang Xian, actually erupted with the combat strength of a peak universe knight.<br/><br/>This…<br/><br/>What else could they say?<br/><br/>This was simply too heaven-defying!<br/><br/>“We’ve picked up a treasure!”<br/><br/>This was what the Thunder Ray clan leader and the others were thinking.<br/><br/>This was too f * cking awesome!<br/><br/>A Pinnacle Universe Knight!<br/><br/>Even if they had to sacrifice a treasure like the Fire Dragon Pearl, it was still worth it in the current battlefield.<br/><br/>“F * ck, this is our eldest senior brother?”<br/><br/>“This… this… this is too strong!”<br/><br/>“A Pinnacle Universe Knight, our eldest brother is a Pinnacle Universe Knight!”<br/><br/>At the back, the disciples of the Thunder light race were shocked when they saw this scene.<br/><br/>They instantly killed the young city leader of Thunder City and his battle pet, and now they were facing all the disciples of the Great Thunder Sound School alone. The terrifying dragon attack was heading towards them.<br/><br/>After this attack, the disciples of the Great Thunderclap Academy were about to suffer heavy casualties.<br/><br/>“Ah!”<br/><br/>At the same time, a scream sounded.<br/><br/>The first to bear the brunt was the eldest senior brother of the Great Thunderclap Academy, Fadu, who had suffered a terrifying attack.<br/><br/>Just the energy shockwaves from the nine Divine Dragon Phantoms caused his life force to instantly disappear.<br/><br/>The nine divine dragons were like world-destroying divine dragons as they headed toward the disciples of the Great Thunderclap Academy.<br/><br/>In an instant, more than half of the tens of millions of disciples had perished.<br/><br/>“I want you to die!”<br/><br/>“Kill him!”<br/><br/>The mayor of the Divine Thunder City sensed that his outstanding son had been killed. His eyes were bloodshot as he directly gave up on the grand elder of the Lightning race in front of him and charged towards Wang Xian.<br/><br/>A model of a city floated above his head. The entire city contained a majestic aura.<br/><br/>In the city, there were more than 20 acquired supreme treasures floating in the air. Every one of them had the lightning attribute.<br/><br/>This was a very special weapon. Although it was not an innate spiritual treasure, it was still extremely terrifying.<br/><br/>The city lord of Divine Thunder City carried an invincible aura as he flew towards Wang Xian. His eyes were filled with violent killing intent.<br/><br/>With such a powerful treasure, he had the confidence to defeat this strange eldest senior brother of the Lightning race.<br/><br/>Although the opponent was strong, he was still very young.<br/><br/>“Eldest senior brother, be careful. The city lord of the Divine Thunder City is very strong!”<br/><br/>“Wang Xian, be careful!”<br/><br/>The disciples and the clan leader of the Thunder Ray race reminded him loudly.<br/><br/>However, the clan leader of the Thunder Ray race could only watch. They were completely entangled and could not spare any support.<br/><br/>“You dare to kill the disciples of our Great Thunder Sound College? I will kill you!”<br/><br/>The moment the city lord of the Divine Thunder City took action, a peak universe knight from the Great Thunder Sound College also took action.<br/><br/>He was also attacking Wang Xian!<br/><br/>Two Peak Universe Knights were attacking him.<br/><br/>“Hehe!”<br/><br/>Wang Xian swept his gaze over and narrowed his eyes slightly. The Five Elements Millstone appeared above his head.<br/><br/>“Whoosh!”<br/><br/>He moved his body and went straight for the city lord of Divine Thunder City.<br/><br/>“You are courting death!”<br/><br/>The city lord of Divine Thunder City had a fierce look in his eyes. All kinds of thunder treasures on the castle above his head released energy and attacked him directly.<br/><br/>Whoosh<br/><br/>Wang Xian flapped his uninitiated holy wings and quickly dodged the attacks of the Thunderbolts.<br/><br/>“What a fast speed!”<br/><br/>Seeing Wang Xian’s speed, the face of the castellan of Divine Thunder City changed drastically. His pupils contracted slightly.<br/><br/>“Die!”<br/><br/>In an instant, Wang Xian arrived at the right side of the castellan of Divine Thunder City. His arm transformed into a dragon claw and attacked him directly.<br/><br/>“You’re courting death!”<br/><br/>The castle above the castellan of Divine Thunder City emitted a glow. Numerous acquired Supreme Treasures flew out and completely covered Wang Xian.<br/><br/>Buzz<br/><br/>The five elements millstone above Wang Xian’s head trembled. Similarly, all kinds of weapons were condensed on the five elements millstone as he charged forward.<br/><br/>Wang Xian didn’t retreat but advanced instead. He continued to charge forward.<br/><br/>“Restrain him. Let’s kill this fellow!”<br/><br/>At this moment, an expert from the Great Thunderclap Academy charged over. His gaze locked onto Wang Xian as he shouted at the mayor of the Divine Thunder City.<br/><br/>“Alright!”<br/><br/>The mayor of the Divine Thunder City shouted loudly. His gaze focused as two lightning beams shot out from his pupils.<br/><br/>“Hehe!”<br/><br/>Wang Xian smiled. His speed did not decrease. With a wave of his arm, a huge object instantly appeared beneath him.<br/><br/>“Roar!”<br/><br/>A roar was heard as the purple lightning snake hovered in the air.<br/><br/>He stared at the powerhouse from the Great Thunderclap School. A purple light pillar shot out from the lightning horn above his head and charged forward.<br/><br/>Boom<br/><br/>A purple light pillar pierced through the entire void.<br/><br/>“Damn it, how is this possible!”<br/><br/>The moment the purple lightning snake appeared, the powerhouse from the great thunderclap school sensed an extremely terrifying power.<br/><br/>He stared at the purple light pillar, his expression changed and he roared in disbelief.<br/><br/>A Pinnacle Universe Knight Purple Thunder Snake.<br/><br/>Most importantly, the Thunder Horn on the Purple Thunder Snake’s head made his heart palpitate.<br/><br/>Facing the Purple Thunder Snake’s attack, he hurriedly dodged to the side.<br/><br/>“Roar Roar Roar!”<br/><br/>The purple thunder snake didn’t hesitate at all, it swayed its huge body and attacked directly.<br/><br/>The thunder around it was dense and slowly gathered at the location of the Thunder Horn.<br/><br/>“What!”<br/><br/>On the side of the city lord of Divine Thunder City, he saw the battle pet of a peak universe knight appearing under Wang Xian. His expression changed slightly when he saw the Great Thunderclap Academy’s powerhouse being blocked.<br/><br/>Boom! Boom! Boom<br/><br/>At this moment, the collision between the five elements millstone and the various treasures in the castle sounded.<br/><br/>The acquired treasures were sent flying towards the castle. The lightning on them dimmed rapidly.<br/><br/>The Five Elements Millstone’s attack was still terrifying.<br/><br/>“How is this possible? !”<br/><br/>The city lord of Divine Thunder City’s expression changed drastically again. He stared at the treasures that were completely crushed in disbelief.<br/><br/>Crash<br/><br/>All of a sudden, he sensed that Wang Xian’s figure had disappeared in an instant.<br/><br/>This made his heart tighten as the threat of death enveloped his heart.<br/><br/>“PFFT!”<br/><br/>An extremely sharp piercing sound was heard. He lowered his head and stared at the spot on his chest in shock.<br/><br/>“No!”<br/><br/>The city lord of Divine Thunder City’s expression changed drastically. His body trembled as he separated his body. He hurriedly dodged to the side.<br/><br/>“Buzz Buzz Buzz!”<br/><br/>The Five Elements Millstone in the sky released a wave of destructive energy. It was like a long river of time that covered an area of over a hundred million kilometers.<br/><br/>“Ah!”<br/><br/>In the river of destruction, the five elements destructive energy surged into the city Lord’s body from the wound and dissolved his life force.<br/><br/>He roared with a ferocious expression.<br/><br/>“Huala!”<br/><br/>“Huala!”<br/><br/>The terrifying explosion sound entered his ears again, and the city Lord’s eyes showed panic and despair.<br/><br/>“What a terrifying speed, what a powerful attack, how is this possible!”<br/><br/>His body trembled as he roared, his face covered in cold sweat as he scanned the surroundings.\t\t\t\t\t\t</div>", "images": {}, "success": true}