{"id": 427, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072755.html", "title": "Chapter 3418 - 3418 3,417 Universe Masters", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3418 - 3418 3,417 Universe Masters</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3418 3,417 universe masters<br/><br/>“HM? Universe Master Level One God Tree, 40 universe master level one god fruits, an innate spiritual treasure, and a large number of universe knight level treasures. TSK, TSK, these resources are really irresistible!”<br/><br/>“Once we make a move, we will become enemies with the Thunder light race. The Thunder Light Race is nothing, but that senior brother of the Thunder Light race can not be underestimated. Even if he hides his age, his power and future potential are a huge threat!”<br/><br/>“Indeed. If it’s just the Lightning race, we don’t need to take it to heart. We can directly make our move.”<br/><br/>At the same time, in an underground castle, two figures sat inside, weighing their gains and losses.<br/><br/>“We want some more treasures. If they are willing to take out more, we can take the risk.”<br/><br/>One figure hesitated for a few minutes before making a decision.<br/><br/>Another figure nodded.<br/><br/>“Damn it, the sand sand race has sent us news. They said that we have paid too little and hope that we can add some more things!”<br/><br/>Soon, within the Great Thunderclap Academy, Divine Thunder City’s experts received this news. Their faces were extremely gloomy.<br/><br/>“It’s fine. The sand sand race is just a faction that we are looking for. If they aren’t willing, the other factions might not reject.”<br/><br/>The head of the Great Thunderclap Academy said with a dark expression.<br/><br/>The rest nodded and sat there quietly waiting.<br/><br/>Since they had reached such a level with the Thunder light race, they didn’t hesitate to invite the strong to help them.<br/><br/>The price they had to pay was already high enough.<br/><br/>Even the universe ruler Level 1 warriors were moved.<br/><br/>They really didn’t believe that no one would agree.<br/><br/>“Weng!”<br/><br/>Time passed bit by bit, and many powers rejected them directly.<br/><br/>There was only one reason, the eldest senior brother of the Thunder Light race.<br/><br/>They were afraid that if they couldn’t kill the eldest senior brother of the Thunder Light race this time, they would suffer revenge in the future.<br/><br/>“Hong!”<br/><br/>However, on the third day, a black cloud suddenly descended above the Great Thunderclap Academy.<br/><br/>The terrifying pressure caused the expressions of all the powerful disciples of the Great Thunderclap Academy to change drastically.<br/><br/>“Which Lord has come to our Great Thunderclap Academy?”<br/><br/>The headmaster of the Great Thunderclap Academy and the others immediately flew out, their eyes revealing a grave expression.<br/><br/>“I accept your request.”<br/><br/>A voice came from within the black cloud, but the figure of a person could still not be seen clearly.<br/><br/>“May I ask who the Lord is?”<br/><br/>The headmaster of the Great Thunderclap Academy hesitated for a moment before opening his mouth to ask.<br/><br/>“You don’t need to know. I will help you suppress the Lightning race. Don’t forget your reward!”<br/><br/>The voice from within the black cloud continued to ring out.<br/><br/>“Yes, sir. We don’t dare to Lose Your Treasures!”<br/><br/>The principal of the Great Thunderclap Academy and the others’faces lit up with joy as they spoke excitedly.<br/><br/>“Alright, when do we make our move?”<br/><br/>The voice from within the Black Cloud asked directly.<br/><br/>“Sir, we need to make some preparations. We will make our move in the next one or two days. Sir, do you want to rest in our great Thunderclap Academy First?”<br/><br/>The Great Thunderclap Academy’s Dean asked respectfully.<br/><br/>“No need.”<br/><br/>The voice in the Black Cloud replied.<br/><br/>“Then please sign a curse contract with our Great Thunderclap Academy!”<br/><br/>The Great Thunderclap Academy’s Dean’s gaze flickered slightly as he took out a black contract.<br/><br/>This type of curse contract was somewhat similar to the cursed creatures, but it was even more mystical.<br/><br/>Once a contract was signed, it had to be carried out, or else one would be attacked by the curse.<br/><br/>No one dared to break the contract, not even universe overlords.<br/><br/>“No Problem!”<br/><br/>The experts within the black cloud didn’t have any objections and directly replied.<br/><br/>The contract was quickly completed, and the Great Thunderclap Academy’s principal and the others cupped their hands.<br/><br/>“In two days, we’ll be relying on you, my Lord!”<br/><br/>Their faces were filled with excitement and respect as they spoke.<br/><br/>“It’s a small matter!”<br/><br/>The figure within the black cloud lightly said.<br/><br/>The Great Thunderclap Academy’s principal and the others glanced at each other before immediately returning to the main hall.<br/><br/>“I wonder which faction’s lord expert knows of our news.”<br/><br/>The city leader of Purple City said with a smile.<br/><br/>“I don’t know. The other party intentionally concealed his identity because he didn’t want others to know about his power. Hehe, this won’t affect us too much. The curse contract has been signed. Everything will proceed according to the contract.”<br/><br/>The dean of Great Thunder Sound College said with a smile.<br/><br/>They weren’t too curious or surprised about a universe ruler level one great being who didn’t want to show his face.<br/><br/>If he didn’t show his face, the Thunder light race wouldn’t know who he was.<br/><br/>This was to prevent the Thunder light race from taking revenge.<br/><br/>After all, if a pinnacle universe knight targeted a power, it wouldn’t be easy for that power.<br/><br/>The other party killed your disciple, so why can’t the Great Beings in your race always guard around?<br/><br/>“Yes, Dean, the news of us asking for Great Beings’help with a huge sum of money has been spread.”<br/><br/>At this moment, an expert from the Great Thunderclap Academy looked at the universe AI and suddenly said.<br/><br/>“Don’t bother about it. The three of you should make some preparations. Two days later, we will make a comeback. This time, we will definitely suppress the Thunder Ray race. We have already prepared the treasures to suppress them!”<br/><br/>“Don’t worry, we have already made full preparations!”<br/><br/>The headmaster of the Great Thunderclap Academy ignored him and ordered. The experts from the god Thunder City, Purple City, and Liuyan city immediately replied.<br/><br/>“Leader, not long ago, a terrifying black cloud appeared in the sky above the Great Thunderclap Academy. The exact situation is unknown!”<br/><br/>“Someone from the universe’s AI has spread the news that the Great Thunderclap Academy and the other powers have used a large sum of money to invite their Race’s warriors to act. They have been rejected!”<br/><br/>At this moment, the Thunder Ray race had already obtained some information regarding the situation of the Great Thunderclap Academy and the universe’s AI.<br/><br/>The Thunder Ray race had spies in the Great Thunderclap Academy, so they were able to get some basic information.<br/><br/>The information on the universe AI was obviously spread on purpose.<br/><br/>As for why it was spread, no one knew.<br/><br/>“They are desperate!”<br/><br/>The leader of the Thunder Ray race had a serious expression on his face.<br/><br/>In the past, the Thunder Ray race and the Great Thunderclap Academy had always fought, but neither side was able to destroy the other.<br/><br/>The most important reason was that neither side had the combat power of a universe master.<br/><br/>Besides, with their background, it was impossible for them to get help from a universe master.<br/><br/>However, things were different now. They were four powers, and they had many treasures.<br/><br/>With that godly tree, the other side might really be able to get help from a universe master.<br/><br/>“Immediately make a statement. This is a war between the Thunder light race and the Great Thunder Sound College. If there is any power, even if we have to fight to the death, we will take a bite!”<br/><br/>The Thunder Ray Race’s clan leader said with a dark face.<br/><br/>They could only use this method to remind the forces and experts who wanted to interfere.<br/><br/>“It’s the clan leader!”<br/><br/>The rest of the Thunder Ray race’s experts also knew the seriousness of the problem and nodded heavily.<br/><br/>“This calamity is difficult. I must kill a group of bastards from the Divine Thunder City’s Purple City and Liuyan City!”<br/><br/>A grand elder face full of anger roared.\t\t\t\t\t\t</div>", "images": {}, "success": true}