{"id": 426, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072753.html", "title": "Chapter 3417 - 3417 3,416", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3417 - 3417 3,416</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3417 3,416<br/><br/>“The Great Thunder Sound School, Godly Thunder City, Liuyan City, and Purple City besieged the Thunder light race, but they were defeated!”<br/><br/>“The big senior brother of the Thunder Light race appeared out of nowhere. He single-handedly killed the city leader of Godly Thunder City and the ancestor of the Great Thunder Sound School, and he fought against seven Pinnacle Universe Knights. He was invincible!”<br/><br/>“With the power of the Thunder light race, they were no match for the four forces of the Great Thunder Sound School. However, the big senior brother of the Thunder Light Race who appeared out of nowhere was too powerful.”<br/><br/>“Everyone thought that the Thunder Ray race would be in trouble after the battle that everyone was watching. However, they didn’t expect that a super powerhouse would appear.”<br/><br/>“How powerful is the eldest senior brother of the Thunder Ray Race?”<br/><br/>After the news spread out, all the powerhouses in the Thunder Cloud Domain and the nearby areas were dumbfounded when they saw this result.<br/><br/>They were especially shocked by the strength of the eldest senior brother of the Thunder Ray race.<br/><br/>When did the eldest senior brother become so terrifying?<br/><br/>Was this really the eldest senior brother and not the ancestor of the Lightning race who had been hiding for billions of years?<br/><br/>Wasn’t this too F * cking powerful?<br/><br/>Just as everyone was shocked by the terrifying strength of the eldest senior brother of the Lightning race, the news of the destruction of Liuyan city by the Lightning race spread quickly.<br/><br/>Soon after, the news of clay city being destroyed was confirmed. Some people even said that the person who destroyed clay city was the eldest senior brother of the Lightning race.<br/><br/>This caused everyone to be shocked once again.<br/><br/>If Clay City was included, there were already three experts who died at the hands of the eldest senior brother of the Lightning race!<br/><br/>This terrifying strength was an invincible existence in the surrounding domain.<br/><br/>“The Great Thunderclap Academy might be in trouble!”<br/><br/>“The Great Thunderclap Academy is still fine. They have a deep foundation and many experts. They can withstand the revenge of the Lightning race. However, the Purple City and the Divine Thunder City are completely finished!”<br/><br/>“The residents of the Divine Thunder City and the Purple City are in trouble. I don’t know when they will suffer a violent revenge!”<br/><br/>“It seems that the people living in God Thunder City and Purple City are already on the run. The two cities have succeeded in courting death!”<br/><br/>Regarding god Thunder City and Purple City, many powerful warriors began to express their condolences.<br/><br/>Now that the Thunder race had such a powerful warrior, what else could they use to fight them?<br/><br/>They would just have to wait for their revenge.<br/><br/>However, at this moment, the disciples of the Thunder race cheered.<br/><br/>They bragged about their eldest senior brother on the universe AI.<br/><br/>Bragging that their eldest senior brother was invincible, and that he would definitely become a universe overlord level great being in the future.<br/><br/>Of course, they weren’t bragging.<br/><br/>Their eldest senior brother’s age, talent, and potential, all the Thunder Race’s great disciples understood.<br/><br/>Such a powerful and terrifying eldest senior brother, they were naturally proud of him.<br/><br/>…<br/><br/>“What should we do now? That eldest senior brother of the Lightning race is so powerful. They will definitely take revenge on our Divine Thunder City. When the time comes…”<br/><br/>“Revenge? The Lightning race is already taking revenge on our Liuyan City. Our entire Liuyan city has already been destroyed!”<br/><br/>At the same time, while the experts of the lightning race were bragging about their eldest senior brother, the experts of the Divine Thunder City, Purple City, and Liuyan City in the Great Thunderclap Academy roared furiously.<br/><br/>Liuyan city, in particular, had been destroyed.<br/><br/>Their foundation had basically been destroyed.<br/><br/>And the situation in Liuyan city was likely to be a lesson to godly thunder city and Purple City in the future.<br/><br/>“The eldest senior brother of the Thunder Light race is too powerful. Once we are separated, even your great Thunder Sound School Can’t stop them.”<br/><br/>The city leader of Purple City glanced at the dean of Great Thunder Sound School and said with a gloomy face.<br/><br/>The eldest brother of the Thunder Light race was able to fight against seven Pinnacle Universe Knights, which was almost the power of all the pinnacle great beings of the Thunder Sound School.<br/><br/>Plus the other seven great beings of the Thunder light race, the Thunder Sound School was no match for him.<br/><br/>At that time, the Thunder Sound School would also suffer a terrible revenge.<br/><br/>“We can’t separate now.”<br/><br/>The dean of the Thunder Sound School said with a gloomy expression.<br/><br/>“Not separate? If we don’t separate, where can we defend? Can We defend our Divine Thunder City?”<br/><br/>An expert from Divine Thunder City questioned with a gloomy expression.<br/><br/>The Purple City’s city Lord also looked over.<br/><br/>Their expressions were all extremely awkward.<br/><br/>They came from four different factions, and if they could not separate, it also meant that they could only defend one area.<br/><br/>What about the other two areas?<br/><br/>Should they give up directly?<br/><br/>“We must defeat the Lightning race. We must destroy that lightning race’s eldest senior brother!”<br/><br/>The Great Thunderclap Academy’s Headmaster’s gaze swept past them as he tightly gripped the lightning scepter in his hand.<br/><br/>Hearing his words, the expressions of the experts from the Purple City Divine Thunder City changed.<br/><br/>“Headmaster, do you have any ideas?”<br/><br/>They looked at the Great Thunderclap Academy’s headmaster and asked weakly.<br/><br/>Now, they could only look at the methods of Great Thunder Sound College. Otherwise, they would have to flee for their lives!<br/><br/>“Either we invite a universe ruler-level great being to help us, or a universe ruler-level great being will be born among us!”<br/><br/>The dean of Great Thunder Sound College said while gritting his teeth.<br/><br/>“Didn’t Great Thunder Sound College get a universe ruler-level godly tree this time? Can Great Thunder Sound College have a great being who can break through again?”<br/><br/>Liuyan city leader asked.<br/><br/>“The chances are very small.”<br/><br/>The Great Thunderclap Academy’s Dean was expressionless. “There’s only one way now, and that is to invite great beings from other powers over.”<br/><br/>“Inviting a universe ruler-level great being over, not to mention how much it would cost, others might not agree either. That senior brother of the Thunder Light Race’s potential is too terrifying.”<br/><br/>A great being of Godly Thunder City said with a gloomy face.<br/><br/>“As long as there is a sufficient price, there will definitely be great beings who agree. At this point, we are all on the same line, so there is no need to hold back!”<br/><br/>The dean of Great Thunder Sound College swept his gaze over them and said with a gloomy face.<br/><br/>The Four Great Powers had joined forces and brought out all their resources. If it were in the past, they might not have been able to invite a universe master level great being with Combat Power.<br/><br/>However, the Great Thunderclap Academy had a universe ruler-level godly tree in their hands.<br/><br/>This godly tree could bear universe ruler-level fruits, so one could imagine its value.<br/><br/>It was also because of this godly tree that the great thunderclap academy had launched a sneak attack on the supreme elder of the Thunder Light race.<br/><br/>This was because that godly tree was enough for a power at their level to start a war.<br/><br/>With this godly tree and a large number of other treasures, they were at least 70% certain that they would be able to invite help.<br/><br/>“Alright, but we have to completely suppress the Lightning race. Otherwise, it will be a disaster for us in the future!”<br/><br/>The city lord of Zi City gritted his teeth and replied.<br/><br/>“That’s only natural. Now, either they die or we die. We’ll go all out.”<br/><br/>The headmaster of the Great Thunderclap Academy had a cold expression on his face, revealing a dense killing intent.<br/><br/>“But I believe that the ones who die will definitely be the lightning race!”<br/><br/>As he spoke, his gaze swept across the experts from the three great cities.<br/><br/>“Get Ready!”<br/><br/>They had already been forced to the peak of Liang Mountain. No matter how great the price they had to pay, they had to suppress the Lightning race.\t\t\t\t\t\t</div>", "images": {}, "success": true}