{"id": 436, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072773.html", "title": "Chapter 3427 - 3427 3426 Continued To Clamor?", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3427 - 3427 3426 Continued To Clamor?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3427 3426 continued to clamor?<br/><br/>“Old bald donkey, the grudge between our thunder ray race and your great Thunderclap Academy, which is close to ten billion, can be considered to be completely settled this time!”<br/><br/>The Thunder Ray Race’s clan leader looked at the Great Thunderclap Academy’s headmaster and the others in the grotto-heaven blessed land and said with a cold expression.<br/><br/>“Haha, completely settled? “As long as our great Thunderclap Academy isn’t destroyed, our grudge will not be settled. I admit that Your Thunder Ray race’s luck is relatively good and you obtained a powerful expert. However, it won’t be long before our great thunderclap academy will once again step into this heaven splitting desolate continent.”<br/><br/>“When the time comes, we will make your thunderclap race pay the price in blood!”<br/><br/>The headmaster of the Great Thunderclap Academy stood in the grotto-heaven blessed land with a face full of killing intent. He roared furiously.<br/><br/>He looked at Wang Xian slowly and the hatred in his eyes became even more intense.<br/><br/>“And this eldest senior brother of your thunderclap race. Our disciples of the Great Thunderclap Academy will never forget today’s grudge for generations. As long as we stand out, it will be time for you to pay the price!”<br/><br/>“At that time, our great thunderclap academy will fight you and all your bloodlines to the death!”<br/><br/>“The leader of our great thunderclap academy will swear on my blood and my bloodline that I will make all of you pay the price. If I fail to do so, I will die without a burial ground!”<br/><br/>The headmaster of the Great Thunderclap Academy stared at Wang Xian and swore an oath coldly.<br/><br/>“Kill, Kill, kill. One day, we will make your thunder ray tribe bleed like a river!”<br/><br/>Beside them, purple city, Liuyan City’s city Lord and the other powerful warriors roared with killing intent on their faces.<br/><br/>“Blood flow like a river!”<br/><br/>“Blood flow like a river!”<br/><br/>Behind them, all the powerful warriors of the three major forces were roaring furiously, their expressions incomparably savage.<br/><br/>At this time, they looked unusually crazy.<br/><br/>Because they knew that they would have to live here for a very, very long time, suppressing within this small space for a very, very long time.<br/><br/>This enmity was like a sea of blood!<br/><br/>“Hahaha, old bald donkey, you can only call out twice now. It’s fine, you can call out. If you don’t, you won’t have the chance in the future, because you will disappear in the long river of the universe forever.”<br/><br/>The leader of the Thunder light race laughed loudly and said with a face full of ridicule.<br/><br/>“Next, we will suppress you, so that you will never see the light of day again!”<br/><br/>The experts from the lightning race laughed and said.<br/><br/>“Hahaha, it’s best if we don’t see the light of day again. Otherwise, it will be the day of your calamity.”<br/><br/>The headmaster of the Great Thunderclap Academy roared crazily.<br/><br/>Whoosh<br/><br/>“HMPH!”<br/><br/>Wang Xian snorted softly and disappeared instantly. He appeared in front of the Purple Lightning Force. His arm turned into a dragon claw and smashed towards the sky.<br/><br/>Boom<br/><br/>An extremely loud sound was heard. The entire purple energy didn’t move at all.<br/><br/>This defensive power was much stronger than the paradise of the Thunder Ray race.<br/><br/>Wang Xian raised his eyebrows slightly. He took out the five elements millstone and injected energy into it to smash towards the sky.<br/><br/>Boom! Boom! Boom<br/><br/>The loud sounds kept coming, but this strong defensive power didn’t move at all.<br/><br/>“It’s impossible to break the defense of our great Thunderclap Academy. Do You Really Think You’re Invincible?”<br/><br/>An elder of the Great Thunderclap Academy looked over and said with a murderous look.<br/><br/>“Wang Xian, the defense of the grotto-heaven and Blessed Land of the Great Thunderclap Academy is very strong. We don’t need to kill them. We can just suppress them directly!”<br/><br/>The leader of the Thunder Ray tribe flew over and said to Wang Xian.<br/><br/>“Hehe, I don’t like them!”<br/><br/>Wang Xian said faintly.<br/><br/>“Eldest senior brother, there’s nothing we can do even if we are unhappy. It’s the same even if we suppress them. After suppressing them, they won’t have any treasures or resources. They will never be able to make a name for themselves in the grotto-heaven blessed land. They won’t be able to support so much of their cultivation with just one grotto-heaven blessed land.”<br/><br/>The first elder said with a smile.<br/><br/>They didn’t wish to destroy the Great Thunderclap Academy either. Being able to suppress it was also an extravagant wish of theirs.<br/><br/>Wang Xian smiled and didn’t say anything. He took out the universal AI and contacted an lie.<br/><br/>What he hated the most was people threatening him.<br/><br/>Did they think that they would be safe just by hiding in the defense of the grotto-heaven blessed land?<br/><br/>They were really overthinking things.<br/><br/>“All the disciples of the Great Thunderclap Academy, remember our enemies in our minds. This will be the motivation for our cultivation!”<br/><br/>The headmaster of the Great Thunderclap Academy said solemnly.<br/><br/>“Yes!”<br/><br/>The eyes of the disciples were a little blood-red as they stared at every member of the Thunder Ray tribe.<br/><br/>Wang Xian swept his gaze across them. With a move of his body, he flew into the distance and arrived at a place where they could not see him.<br/><br/>“Huh?”<br/><br/>The leader of the Thunder Ray tribe looked at Wang Xian curiously as he left. Then, he swept his gaze across the group of strong disciples around him and said, “Begin to suppress the reckless people of the Great Thunderclap Academy.”<br/><br/>“Yes, leader!”<br/><br/>The group of experts and disciples from the Lightning race replied immediately.<br/><br/>Buzz<br/><br/>“Greetings, Dragon King!”<br/><br/>At this moment, an Lie’s figure appeared in front of Wang Xian from the sky.<br/><br/>“Alright, enter the grotto-heaven blessed land and be careful. The enemies are all enemies. Also, bring me there.”<br/><br/>Wang Xian nodded and ordered him.<br/><br/>“It’s the Dragon King. This is a small matter!”<br/><br/>An lie looked at the grotto-heaven blessed land with a smile on his face. His figure disappeared instantly.<br/><br/>However, in just an instant, his figure appeared in front of Wang Xian again.<br/><br/>Buzz<br/><br/>A wave of energy enveloped Wang Xian. Wang Xian’s figure also disappeared.<br/><br/>In the next moment, he appeared in the grotto-heaven blessed land of the Great Thunderclap Academy.<br/><br/>In front of him, all the strong disciples of the Great Thunderclap Academy, Zi City, and Liuyan city stared at the Lightning race outside with hatred in their eyes.<br/><br/>No one could sense that Wang Xian had already entered their area.<br/><br/>“Hehe!”<br/><br/>He chuckled and flapped his incipient saint wings slightly. In the next moment, he flew to the front.<br/><br/>To his left and right were the principal of the Great Thunderclap Academy, the patriarch, the city lords of Zi City and Liuyan City, and the rest of the strong ones.<br/><br/>“You said earlier that you wanted to fight to the death with me. You wanted me and those related to my bloodline to pay the price!”<br/><br/>Wang Xian spoke. He tilted his head with a smile and spoke.<br/><br/>At this moment, due to Wang Xian’s strange speed, the principal of the Great Thunderclap Academy and the others had yet to react.<br/><br/>When he heard this sentence, all the hair on his body stood on end. His eyes were instantly filled with horror.<br/><br/>The headmaster of the Great Thunderclap Academy turned his head stiffly and stared at Wang Xian with a trembling gaze.<br/><br/>“Don’t you recognize me?”<br/><br/>Wang Xian smiled and patted his shoulder lightly.<br/><br/>Cold Sweat instantly trickled down from the head of the headmaster of the Great Thunderclap Academy.<br/><br/>“No, no, no, no!”<br/><br/>At this moment, the grandmasters of the Great Thunderclap Academy and the city lord of Liuyan City of Zi City had also seen Wang Xian.<br/><br/>They felt that everything before them was pitch black. They couldn’t help but take a few steps back as they spoke with fear and despair on their faces.<br/><br/>A Great Terror had descended!<br/><br/>“Why Are You So Afraid? Weren’t you very arrogant just now?”<br/><br/>Wang Xian glanced at them and said with a smile.<br/><br/>Continue to shout?<br/><br/>Hehe!\t\t\t\t\t\t</div>", "images": {}, "success": true}