{"id": 433, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072767.html", "title": "Chapter 3424 - 3424 3423 Universe Masters Fled", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3424 - 3424 3423 Universe Masters Fled</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3424 3423 universe masters fled<br/><br/>“Hong! Hong! Hong!”<br/><br/>The sound of collision resounded in the sky above the main hall of the Thunder Ray race.<br/><br/>A terrifying war broke out.<br/><br/>The Great Thunderclap Academy’s Dean and the other great beings from the four great powers were all looking at the war in fear.<br/><br/>“All disciples, gather together. Everyone, get ready.”<br/><br/>The Great Thunderclap Academy’s Dean had an extremely ugly expression on his face as he ordered fearfully.<br/><br/>They gave up on continuing to suppress the Lightning race as their expressions kept changing as they stared at the battle in front of them.<br/><br/>Right now, their hearts were filled with fear.<br/><br/>The battle in front of them was related to their fates.<br/><br/>In fact, they understood that the fates of the four great factions might have already come to an end. However, they still had some unrealistic thoughts in their hearts.<br/><br/>They hoped that the powerhouse in the black cloud would be able to kill the eldest senior brother of the Thunder Ray race.<br/><br/>After all, the eldest senior brother of the Thunder Ray race had just made a breakthrough.<br/><br/>“Wang Xian… he has made a breakthrough in his strength? He is currently fighting with the powerhouse in the Black Cloud!”<br/><br/>“Hiss, he has really made a breakthrough. His strength has really broken through to the level of a universe overlord. Hahaha, this is great, this is great!”<br/><br/>“Our eldest senior brother of the Thunder Ray Tribe has made a breakthrough in his strength. Who would have thought that we are going to win? The Great Thunderclap Academy, Zi City, Liuyan City, your doomsday has arrived!”<br/><br/>At this moment, in the main hall, the leader of the Thunder Ray tribe and the rest of the experts who were suppressed in the grotto-heaven blessed land looked at the scene in front of them with excitement.<br/><br/>They were already prepared to be suppressed.<br/><br/>However, Wang Xian had actually made a breakthrough.<br/><br/>This made them feel extremely dazed.<br/><br/>Wang Xian had made a breakthrough. Their Thunder Ray tribe also had an existence on the level of the Master of the universe!<br/><br/>This crisis could also be resolved quickly.<br/><br/>“What? Our eldest senior brother has made a breakthrough?”<br/><br/>“Our eldest senior brother has made a breakthrough. This… Hahaha, this is great. Our eldest senior brother is invincible!”<br/><br/>At the back, when the disciples heard the exclamations of the clan leader and the rest, their eyes widened instantly and their bodies were filled with excitement.<br/><br/>Boom! Boom! Boom<br/><br/>At the position outside, Wang Xian was relying on his powerful speed to continuously attack the black cloud.<br/><br/>The energy of the black cloud was getting lesser and lesser. Gradually, the figure within the black cloud slowly emerged.<br/><br/>He was three meters tall and extremely skinny. He held a black scepter in his hand and had two faces.<br/><br/>His blood-red eyes were filled with bloodlust and violence.<br/><br/>He waved the scepter in his hand and blocked Wang Xian’s attacks continuously.<br/><br/>His expression was unusually ugly.<br/><br/>“Senior brother of the Thunder Ray race, you can’t kill me. Are you really going to be my enemy?”<br/><br/>The figure in the black cloud let out a cold voice and roared in a sinister manner.<br/><br/>“You are the one who wants to be my enemy. You are the one who is going to be our enemy. You even said that I am your enemy and that I will let you off. If you don’t pay the price today, don’t even think about leaving this place.”<br/><br/>Wang Xian stared coldly at the figure in the black cloud. His eyes were filled with disdain.<br/><br/>From Wang Xian’s perspective, the figure in the black cloud was not very strong. He was mainly good at long-range attacks.<br/><br/>If he did not have the innate spiritual treasure, the black cloud, Wang Xian would be able to kill him quickly.<br/><br/>Even so, if he wanted to escape, Wang Xian would have to make him pay a price.<br/><br/>“You deserve to die. Your Thunder Ray race deserves to die too!”<br/><br/>The Elder in the Black Cloud roared furiously. Waves of black gas surged out from his body and charged directly at Wang Xian.<br/><br/>The black gas covered a radius of hundreds of millions of kilometers. It was a full-scale attack.<br/><br/>Wang Xian moved his body and easily retreated out of the range of the attack. Waves of single-point attacks charged into the area.<br/><br/>Buzz<br/><br/>The figure in the black cloud started to turn illusory. He wanted to escape back to his divine kingdom in an instant.<br/><br/>However, how could Wang Xian give him this opportunity.<br/><br/>He dashed forward at a terrifying speed. Waves of energy rushed towards his body.<br/><br/>He could not move when he escaped back to his divine kingdom.<br/><br/>Therefore, the attacks around him were not very strong at this moment. Wang Xian relied on his speed and strength to interrupt his escape once again.<br/><br/>“Mighty Heavenly Dragon!”<br/><br/>At this moment, Wang Xian also unleashed his strongest law attack.<br/><br/>Didn’t you want to escape?<br/><br/>When you were escaping, it was also the time when you were most unprepared.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The Mighty Celestial Dragon appeared in front of Wang Xian in an instant. It was an incomparably terrifying divine dragon.<br/><br/>The Divine Dragon looked the same as Wang Xian’s dragon body. It also had a pair of dragon wings.<br/><br/>However, the Mighty Celestial Dragon was over ten million kilometers in size.<br/><br/>“This is bad!”<br/><br/>The figure in the dark cloud trembled violently after being interrupted. He immediately waved his staff and the surrounding skulls flew up and collided with the Mighty Celestial Dragon.<br/><br/>Boom<br/><br/>The collision was heard and the figure in the dark cloud was sent flying backward. He spat out a mouthful of fresh blood.<br/><br/>“I’m not his match! I Can’t continue wasting time!”<br/><br/>The figure in the Black Cloud’s face turned pale. When he saw the skulls around him crack, his heart sank again.<br/><br/>“Whoosh!”<br/><br/>At this moment, he sensed a figure appear behind him.<br/><br/>A trace of cold sweat appeared.<br/><br/>“Black Cloud, Cloud Lotus!”<br/><br/>He immediately roared, and the surrounding black cloud condensed into a flower petal, protecting his body.<br/><br/>“Run!”<br/><br/>“Senior brother of the Lightning race, just you wait. I will make you pay a terrible price!”<br/><br/>His two faces opened their mouths at the same time and let out a sinister voice. He stared at Wang Xian with bloodthirsty eyes.<br/><br/>His body started to turn illusory again.<br/><br/>“Hehe!”<br/><br/>Wang Xian looked at him and sneered, “Just you wait. Don’t let me know which race you are from.”<br/><br/>As he spoke, his arm turned into a dragon claw and clawed at the lotus flowers.<br/><br/>Bam<br/><br/>An intense resistance came. Wang Xian did not break through the defense of the lotus flowers. The figure inside stared at him with hatred and disappeared.<br/><br/>However, the price was that the black cloud stayed behind.<br/><br/>The black cloud helped him to resist for some time.<br/><br/>Wang Xian smiled and looked to the side.<br/><br/>“Gulp!”<br/><br/>“He escaped. That Lord has escaped. No, he is trying to escape for his life!”<br/><br/>At this moment, all the strong disciples from the Great Thunderclap Academy and the other four major forces were stunned!<br/><br/>“Run, run, run!”<br/><br/>The headmaster of the Great Thunderclap Academy shouted with a face full of despair. Their bodies moved and began to turn illusory.<br/><br/>Even the masters of the universe had escaped. were they not going to run and wait for their deaths?<br/><br/>At this moment, they had already decided that once they returned, they would immediately lead all of their clansmen into the grotto-heaven blessed land.<br/><br/>Just like the Lightning race, they hid in the grotto-heaven blessed land.<br/><br/>They had lost. They had completely lost.<br/><br/>They had lost to the eldest senior brother of the Lightning race, and they had lost to a disciple of the lightning race.<br/><br/>To them, it was as if the heavens wanted to kill them on purpose.<br/><br/>Buzz! Buzz! Buzz<br/><br/>Their figures began to turn illusory rapidly and disappeared.<br/><br/>As they were quite far away, Wang Xian had no way to deal with them.<br/><br/>However, the four major forces were no longer imposing to Wang Xian. He could kill them as he pleased.<br/><br/>Compared to killing the four major forces, it was more worthwhile to make the figure in the black cloud pay the price.<br/><br/>A dark attribute innate numinous treasure.\t\t\t\t\t\t</div>", "images": {}, "success": true}