{"id": 437, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072775.html", "title": "Chapter 3428 - 3428 3427 Was Completely Destroyed", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3428 - 3428 3427 Was Completely Destroyed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3428 3427 was completely destroyed<br/><br/>“How did you get in? How did you get into our grotto-heaven blessed land?”<br/><br/>“Hiss, how? How did he get into our place? No, no, no, no!”<br/><br/>“Senior brother of the Thunder Ray race, how… How did he get in?”<br/><br/>In the grotto-heaven blessed land of the Great Thunderclap Academy, horror and panic filled everyone’s minds.<br/><br/>They all stared with wide eyes, their faces filled with disbelief as they stared at the figure next to their principal!<br/><br/>The eldest senior brother of the Lightning race, that opponent whom they thought was invincible!<br/><br/>They had been forced into the grotto-heaven blessed land and were already prepared to survive here.<br/><br/>But now, the eldest senior brother of the Lightning race had suddenly entered.<br/><br/>Then, the fate awaiting them was destruction!<br/><br/>This made all of them tremble uncontrollably.<br/><br/>Compared to being suppressed in the grotto-heaven blessed land, they had only lost some freedom. However, they could still survive and live here.<br/><br/>If they died, everything would be gone!<br/><br/>The arrival of the eldest senior brother of the Thunder Ray Race announced their death<br/><br/>“You can die in peace!”<br/><br/>Wang Xian looked at the four peak-stage universe knights beside him and said faintly.<br/><br/>The dean of the Great Thunderclap School, an ancestor of the great thunderclap school, the city lord of Liuyan City, and the city lord of Zi City.<br/><br/>The four of them were extremely pale and filled with despair and bitterness.<br/><br/>“Can you tell us how you entered our great Thunderclap School’s grotto-heaven blessed land?”<br/><br/>The dean of the Great Thunderclap School asked Wang Xian with a face full of unwillingness.<br/><br/>“No!”<br/><br/>Wang Xian smiled and waved his arm. A wave of energy completely covered them.<br/><br/>“Soul capture!”<br/><br/>He muttered softly and a wave of information entered his mind.<br/><br/>Some information about the great thunderclap academy, Liuyan City, and Zi City were presented one by one.<br/><br/>In addition, there was also the matter of the two ancestors of the Great Thunderclap Academy leading their elite disciples to hide outside.<br/><br/>He smiled slightly and waved his arm. A wave of death energy enveloped the four pinnacle universe knights.<br/><br/>“No, no, no!”<br/><br/>“Kill him, kill him, he wants to kill us!”<br/><br/>“What should we do if the dean and the rest are killed? I don’t want to die, I don’t want to Die!”<br/><br/>At the back, everyone saw their dean and City Lord Falling. Their faces were filled with panic and despair as they shouted.<br/><br/>Some of the disciples had completely collapsed.<br/><br/>“I’ll fight it out with you!”<br/><br/>A Level Nine Universe Knight roared and charged towards Wang Xian.<br/><br/>“Ha!”<br/><br/>Wang Xian chuckled. With a wave of his arm, the level nine universe Knight was instantly killed.<br/><br/>He smiled contemptuously and swept his gaze across everyone from the three forces.<br/><br/>An invisible pressure was pressing down on them, making it hard for them to breathe.<br/><br/>“Fog grass, look at the grotto-heaven blessed land of the Great Thunderclap Academy. Our eldest senior has entered it!”<br/><br/>“Our eldest senior brother has actually entered their grotto-heaven blessed land. hahaha!”<br/><br/>“When did our eldest senior brother enter? The principal of the Great Thunderclap Academy and the rest were killed by our eldest senior brother. Our eldest senior brother is invincible!”<br/><br/>“Were we going to say that he wanted to destroy us? Now that our eldest senior brother has entered, it’s their Doomsday!”<br/><br/>At the same time, outside, the experts of the Thunder Ray race were ready to suppress the three major forces.<br/><br/>At this moment, they suddenly saw Wang Xian appearing inside the grotto-heaven blessed land. Their eyes were wide open and their faces were filled with shock.<br/><br/>Eldest senior brother had actually entered the grotto-heaven blessed land!<br/><br/>The end of the three major forces was coming!<br/><br/>The leaders of the Thunder Ray tribe were also in disbelief and were filled with shock.<br/><br/>Eldest senior brother was simply omnipotent!<br/><br/>Boom<br/><br/>In the interior of the grotto-heaven blessed land of the great thunderclap courtyard, Wang Xian waved his arm. A wave of destructive power swept towards the experts from the three major forces.<br/><br/>That terrifying energy was not something they could withstand.<br/><br/>“Ahhhh!”<br/><br/>Screams of pain rang out. They cried out helplessly and hopelessly.<br/><br/>“Don’t Kill Us! Don’t Kill Us!”<br/><br/>The civilians and weak disciples behind them kneeled on the ground in despair and shouted loudly.<br/><br/>Wang Xian glanced at them but did not make a move. These weak disciples and civilians were left to the Thunder Ray Race to deal with.<br/><br/>He would not participate in the killing or anything else!<br/><br/>Buzz<br/><br/>His body moved and arrived directly in front of the defense formation switch of the grotto-heaven blessed land.<br/><br/>He closed the defense formation.<br/><br/>The formation disappeared. Wang Xian’s body trembled and numerous chains covered the entire void. Everyone was enveloped within them.<br/><br/>Under his coverage, no one could escape.<br/><br/>“Wang Xian, you are simply too strong!”<br/><br/>“Phew, eldest senior brother is an invincible existence!”<br/><br/>The leader of the Thunder Ray tribe and the rest flew over excitedly as they exclaimed in their hearts.<br/><br/>It was simply bad news to have such an enemy.<br/><br/>The defense of the grotto-heaven paradise of the Great Thunderclap Academy was much stronger than the Thunder Ray tribe. However, Wang Xian was able to enter it easily.<br/><br/>This unbelievable method was terrifying!<br/><br/>“Hehe, leader, I’ll leave them to you to deal with. Please give their corpses to me as well. Please give me some treasures of the wind and thunder attributes as well. I’m Useful!”<br/><br/>Wang Xian said with a smile.<br/><br/>“Hahaha, all of this was obtained by you, Wang Xian. Without You, our thunder race would have been suppressed.”<br/><br/>The clan leader of the Thunder Race said with a laugh.<br/><br/>“No need. I only want these. I don’t need the other Thunder attribute treasures.”<br/><br/>Wang Xian shook his head. He helped the Thunder Race to destroy the three major forces and gave all these treasures to them.<br/><br/>He had repaid most of his favors.<br/><br/>In the future, their friendship would still be there. However, he didn’t need to give them all the treasures that he had obtained.<br/><br/>“This… Let’s take a look at the treasure vaults of the three major forces first. First Elder, take your men and imprison all the disciples of the three major forces.”<br/><br/>The leader of the Thunder Ray Tribe gave an order.<br/><br/>“Yes, leader!”<br/><br/>First Elder and the rest responded immediately. Their faces were also filled with excitement.<br/><br/>This time, they had destroyed the three major powers and obtained the other party’s grotto-heaven blessed land, which was of great benefit to the development of the Thunder Ray tribe.<br/><br/>Especially the grotto-heaven blessed land of the Great Thunderclap Academy, which was even more powerful than their thunder ray tribe!<br/><br/>Not to mention there were other treasures!<br/><br/>“Great Victory!”<br/><br/>The Great Elder and the others couldn’t help but shout.<br/><br/>“Great Victory!”<br/><br/>The group of strong disciples roared.<br/><br/>“Clan leader, let’s go. I know where their treasure vault is. Let’s go in and take a look!”<br/><br/>Wang Xian looked at the clan leader of the Lightning race and said.<br/><br/>“This… Wang Xian, you can take all the treasures in the treasure vault.”<br/><br/>The clan leader of the Lightning race and the rest said in embarrassment.<br/><br/>“If there’s anything that I can use, I will take it!”<br/><br/>Wang Xian smiled. With a wave of his arm, he brought them to the deepest part of the blessed land.<br/><br/>In the deepest part of the blessed land, there was a mountain peak that was more than 10,000 meters in size. There was a cave entrance in front of the mountain peak.<br/><br/>This was the treasure house of the Great Thunderclap Academy, a force that had accumulated for close to 10 billion years.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian’s gaze was a little heated. With a wave of his arm, he opened the door of the treasure house and entered!\t\t\t\t\t\t</div>", "images": {}, "success": true}