{"id": 439, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072779.html", "title": "Chapter 3430 - 3430 3429 Tai Chi Dragon Plate, Great Grinding Of The Five Elements", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3430 - 3430 3429 Tai Chi Dragon Plate, Great Grinding Of The Five Elements</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3430 3429 tai chi dragon plate, great grinding of the five elements<br/><br/>“The Great Thunderclap Academy, Zi City, and Liuyan City have been destroyed by the Lightning race. This… This is destruction!”<br/><br/>“Hiss, their grotto-heaven blessed land has also been destroyed. Isn’t this too terrifying?”<br/><br/>“I heard that the eldest senior brother of the Lightning race has entered their grotto-heaven blessed land. This ability makes people panic!”<br/><br/>In the Thunder Cloud Domain and the surrounding area, all the experts of the various factions were filled with shock when they heard the news from the Great Thunderclap Academy.<br/><br/>All the factions were somewhat panicking.<br/><br/>The grotto-heaven blessed land of a single race was their greatest trump card.<br/><br/>It was their greatest guarantee.<br/><br/>Even if they were suppressed, they wouldn’t be destroyed and would still have a chance to turn things around.<br/><br/>However, once the defense of the grotto-heaven was forced, it would be complete annihilation.<br/><br/>Facing such enemies, who wouldn’t Panic?<br/><br/>It was a total panic!<br/><br/>This made them even more wary of the Thunder Race’s big senior brother!<br/><br/>If they provoked him, who could guarantee that their grotto-heaven’s defense would be stronger than the Great Thunderclap School?<br/><br/>Not to mention the Thunder Race’s big senior brother’s current strength.<br/><br/>He was conferred the title of King in a single battle!<br/><br/>The Great Thunderclap School was destroyed, Liuyan city was destroyed, and Zi City was destroyed!<br/><br/>Very soon, the news of the three major forces being destroyed spread out completely. The grotto-heaven paradise of the three major forces was completely occupied by the Thunder Ray race.<br/><br/>“Thank you very much, Wang Xian. Please accept our bow as well!”<br/><br/>Two days later, in the main hall of the Thunder Ray race, the clan leader and the rest of the experts bowed respectfully to Wang Xian.<br/><br/>They bowed sincerely.<br/><br/>“Tribe leader, you are too polite!”<br/><br/>Wang Xian looked at them and smiled.<br/><br/>“Hehe, we have to bow. It is our honor to have the help of such a true dragon from our thunder ray tribe.”<br/><br/>The tribe leader chuckled and said. After hesitating for a moment, he continued, “Wang Xian, do you have any plans in the future?”<br/><br/>“I might go out to gain some experience in the future. I Won’t hide it from you all. I have my own forces and am not from the ancestral dragon lineage.”<br/><br/>Wang Xian did not hide anything and said, “If the lightning race has any difficulties in the future, you can look for me, tribe leader.”<br/><br/>“HMM?”<br/><br/>The tribe leader and the rest were slightly stunned. They were very surprised. They did not expect Wang Xian to not be from the ancestral dragon lineage.<br/><br/>“Alright.”<br/><br/>The experts of the Thunder Ray tribe also understood that their small river couldn’t accommodate a true dragon. It was already extremely beneficial to be able to obtain Wang Xian’s promise.<br/><br/>Furthermore, they had obtained so many treasures and grotto-heaven blessed lands this time around. This would also allow the overall strength of the Thunder Ray tribe to increase significantly.<br/><br/>“Alright, clan leader. I’ll return to the palace first. I might be going out for training in a short while. I Won’t greet you all then.”<br/><br/>As Wang Xian spoke, he returned to his own palace.<br/><br/>His figure flashed as he returned to the Dragon Palace.<br/><br/>“Greetings, Dragon King!”<br/><br/>In the Dragon Palace, Prime Minister Gui immediately greeted him respectfully.<br/><br/>The current Dragon Palace was a little deserted.<br/><br/>Out of the nearly two million disciples in the Dragon Palace, more than one million had already left and entered the heaven-opening primordial land for training.<br/><br/>Now that a few years had passed, they had already reached the inner regions.<br/><br/>“I have some resources here. Let them improve.”<br/><br/>Wang Xian waved his arm and placed the corpses he obtained from the Great Thunderclap Academy, Liuyan City, and Zi City to the side.<br/><br/>There were a total of fourteen corpses of peak universe knights.<br/><br/>As for the corpses of universe knights with ninth-level combat strength, there were more than 80 of them.<br/><br/>There were also many level 8 and Level 7 corpses.<br/><br/>This could give the members of the Dragon Palace a huge boost.<br/><br/>“Dragon King, you actually obtained so many corpses. I’ll inform them to come back and increase their strength first!”<br/><br/>Prime Minister Gui looked shocked when he saw the corpses and replied immediately.<br/><br/>“Yes, 14 corpses. This should help the sky array to break through to the level 1 universe dominator.”<br/><br/>Wang Xian nodded his head.<br/><br/>“Dragon King, Ao he and the rest have not left yet. They are currently devouring a few dragon palaces. It is more difficult now. We can raise their strength to the peak of the Universe Knight first. In that case, they will also break through to the first level of the universe Dominator’s combat strength very quickly.”<br/><br/>Prime Minister Gui suggested.<br/><br/>“Alright, you make the arrangements!”<br/><br/>Wang Xian nodded his head. It was not so easy to devour a Dragon Palace of the universe dominator level.<br/><br/>However, once they devoured it, they would definitely be able to achieve a breakthrough.<br/><br/>This would allow the Dragon Palace to produce a few masters of the universe with level one combat strength. It was not completely certain yet.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded his head and left.<br/><br/>Wang Xian took out the treasures that he had obtained one by one.<br/><br/>They were innate spiritual treasures with Earth and darkness attributes. The rest were acquired supreme treasures and spiritual treasures.<br/><br/>He took out the five elements grinding and tai chi dragon plate, immediately began to absorb.<br/><br/>As the days went by.<br/><br/>Buzz<br/><br/>“Ho ho ho!”<br/><br/>Half a month later, the Tai Chi Dragon disk quickly rotating, such as ink-like two dragon roars sound.<br/><br/>Wang Xian face revealed a smile, Tai Chi Dragon disc breakthrough!<br/><br/>After the breakthrough of Taiji Dragon Disk, the universe master below the attack, do not want to break.<br/><br/>At the side, the five elements millstone was still absorbing the innate spiritual treasure of the Earth attribute.<br/><br/>A thick and heavy aura spread to the surroundings.<br/><br/>Wang Xian’s palm landed on it. The thick five elements power assisted the five elements millstone in refining it.<br/><br/>The breakthrough was imminent!<br/><br/>“Roar! Roar! Roar!”<br/><br/>Not long after, roars were heard. The Five Elements Millstone and five divine dragons intertwined together, emitting a terrifying aura.<br/><br/>This aura caused the level one master of the universe to tremble.<br/><br/>After the breakthrough of the Five Elements Millstone, Wang Xian’s strength had another explosive increase.<br/><br/>It would not be a problem for him to fight against five or six of them.<br/><br/>However, it might be a little more difficult if the other party had an innate spiritual treasure.<br/><br/>The elevation of both the Tai Chi Dragon Plate and the five elements millstone made Wang Xian in a good mood.<br/><br/>They were prepared to accompany a group of girls before heading out to search for resources.<br/><br/>Only after entering the heaven-opening primal continent did Wang Xian realize how cheap time was.<br/><br/>If there was no teleportation formation, it would take a few years to travel from one place to another.<br/><br/>If he were to travel far away, he might need to fly for thousands of years or tens of thousands of years.<br/><br/>A year’s time was like a day.<br/><br/>In the interior, it was recorded by the era!<br/><br/>One era, one hundred thousand years!<br/><br/>Wang Xian accompanied the group of girls to rest for a few years. The group of disciples in the Dragon Palace rushed back after a short while to improve their strength one by one.<br/><br/>After that, he asked an lie to send them to the inner area one by one to save some time.<br/><br/>Five years passed in the blink of an eye. On this day, Wang Xian came to the Lightning race.<br/><br/>He came out of the palace and looked around.<br/><br/>“Eldest senior brother!”<br/><br/>“Hello, eldest senior brother!”<br/><br/>All the disciples who saw Wang Xian immediately stopped and greeted him respectfully.<br/><br/>The current eldest senior brother was the strongest person in the Lightning race and also their savior.<br/><br/>Wang Xian nodded at them and walked around casually. After that, he left through the teleportation formation!\t\t\t\t\t\t</div>", "images": {}, "success": true}