{"id": 432, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072765.html", "title": "Chapter 3423 - 3423 3422 Was Invincible", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3423 - 3423 3422 Was Invincible</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3423 3422 was invincible<br/><br/>Boom<br/><br/>A terrifying explosion sounded, causing a huge tremor.<br/><br/>The figure in the Black Cloud had a slightly ugly expression. The entire black cloud flew backward.<br/><br/>The five elements grinding was much stronger than ordinary innate spiritual treasures.<br/><br/>Even without relying on his speed, Wang Xian was not afraid of a head-on clash with someone of the same level.<br/><br/>“What? He is an expert invited by the Thunder Ray Race? Oh No, the other party is also a level one universe overlord.”<br/><br/>“Why does this voice sound so familiar? It sounds like… It sounds like…”<br/><br/>“It sounds like the voice of the Thunder Ray Race’s senior brother. No, no, that’s impossible. His strength is only at the peak of the universe knight level. It’s impossible for him to break through so quickly.”<br/><br/>“It’s very difficult for a peak universe knight to break through to the first level of the universe dominator. How is it possible for him to break through so quickly?”<br/><br/>In the surrounding area, when the disciples of the Great Thunder Sound College heard Wang Xian’s voice, their faces were filled with shock.<br/><br/>This voice was somewhat familiar.<br/><br/>However, they couldn’t believe that the senior brother of the Thunder Ray race would break through and possess the combat strength of the first level of the universe dominator.<br/><br/>This was too exaggerated!<br/><br/>“Huh? What happened outside?”<br/><br/>“There seems to be an expert fighting with that black cloud. Who Is It?”<br/><br/>At the same time, the experts of the Thunder Ray race who were suppressed in the grotto-heaven blessed land sensed the changes outside. They widened their eyes and looked over with astonishment.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>In the sky, Wang Xian relied on his terrifying speed to fly in the void continuously. Streaks of terrifying attacks landed on the black cloud.<br/><br/>With each attack, the fog in the black clouds lessened.<br/><br/>“Universal Prison!”<br/><br/>The figure in the black clouds had a gloomy expression. He roared and raised the staff in his hand.<br/><br/>The staff held up the sky. The Darkness Attribute in the sky descended from the sky and formed a terrifying heavenly prison. It went straight for Wang Xian.<br/><br/>“Eight-sided Dragon Pillars!”<br/><br/>Wang Xian saw this restrictive attack and let out a low growl. Dragon pillars stood up one after another and smashed towards the universal prison.<br/><br/>Boom<br/><br/>The terrifying collision sounded again. The Universal Heaven Prison and the eight dragon pillars slowly dissipated.<br/><br/>Crash<br/><br/>Wang Xian’s figure flashed as he arrived above the black clouds.<br/><br/>“Holy Dragon Shadow!”<br/><br/>He let out a low growl as rays of light condensed into the shadow of a divine dragon and charged downwards.<br/><br/>Roar! Roar! Roar<br/><br/>The roar of the Divine Dragon sounded as it landed heavily on the thunderclouds.<br/><br/>The figure in the Thundercloud had deliberately concealed his figure. Therefore, he could not dodge such an attack at all.<br/><br/>“Damn it!”<br/><br/>In the Dark Cloud, the expert cursed angrily. He did not want to reveal his identity, but now, it had put him in a dilemma.<br/><br/>“Demon Devouring World!”<br/><br/>He let out a wild roar and the skulls around him condensed into a terrifying abyss mouth. It directly devoured the Divine Dragon’s figure.<br/><br/>“Towering dragon’s Horn!”<br/><br/>Wang Xian’s figure flashed once again. Relying on his terrifying speed, he arrived directly below the black cloud.<br/><br/>A resplendent dragon’s horn charged straight into the sky.<br/><br/>The Holy Dragon’s shadow flickered in the surroundings as a terrifying dragon’s aura swept across the surroundings.<br/><br/>“It’s the eldest senior brother of the Lightning race. He has made a breakthrough. It’s actually him!”<br/><br/>At this moment, if they were still unable to determine who their opponent was, then they would all be too foolish.<br/><br/>This attack was filled with the style of a godly dragon, and this familiar yet terrifying pressure caused the expressions of the great beings from the Great Thunder Sound Academy and the other four great powers to change drastically.<br/><br/>He had broken through?<br/><br/>The eldest senior brother of the Thunder Light race was actually a universe ruler level one great being with Combat Power?<br/><br/>This… This was simply bad news for them.<br/><br/>The dean of the Great Thunderclap Academy, the ancestor, the two great beings from God Thunder City, and the city leader of Purple City’s Liuyan city all turned pale.<br/><br/>Their bodies trembled, and their eyes were fixed on the battlefield.<br/><br/>This was all a joke, right?<br/><br/>The eldest senior brother of the Thunder Ray race had broken through?<br/><br/>Then how could they continue to fight?<br/><br/>Unless that great being in the black cloud killed the senior brother of the Thunder Light race.<br/><br/>But was this possible?<br/><br/>“Roar! Damn it! Great Thunder Sound College! Didn’t you say that the opponent didn’t have a great being at the universe ruler level? You are lying!”<br/><br/>In the black cloud, that figure was looking around with an extremely unsightly expression.<br/><br/>Numerous aoe attacks covered the sky and covered the earth.<br/><br/>The other party’s speed was too fast, and he couldn’t lock onto him at all.<br/><br/>Facing his attacks, he could only take them head-on.<br/><br/>Under such circumstances, he could only Dodge. His face was filled with rage as he roared at the Great Beings of Great Thunder Sound Academy.<br/><br/>Previously, they hadn’t said that the other party was a great being with the Combat Power of a universe ruler at level one.<br/><br/>Otherwise, how could he have accepted such a mission?<br/><br/>“We… We do not know either. Sir, help us kill this fellow. As long as you help us kill him, we are willing to pay any price!”<br/><br/>The dean of Great Thunder Sound Academy roared loudly, his face covered in cold sweat.<br/><br/>Now, all their hopes were placed on this great being within the black cloud.<br/><br/>The moment the other party did not care, they would be finished.<br/><br/>“I’ll kill your entire family!”<br/><br/>When the powerhouse in the black cloud heard this, he couldn’t help but curse.<br/><br/>With the other party’s strange speed, how was he going to kill him?<br/><br/>If he continued to tangle with him, he would definitely die.<br/><br/>Now, he was preparing to escape.<br/><br/>“I’m no longer involved in this matter. I’ll retreat immediately. Stop Your Attacks!”<br/><br/>He shouted at Wang Xian.<br/><br/>“Hehe, you have already been locked onto by me. You want to escape without paying any price?”<br/><br/>Wang Xian revealed a cold smile.<br/><br/>If it was in the past, when he was trying his best to escape when he was at the same level, Wang Xian might not have a good solution for him.<br/><br/>However, it was different now.<br/><br/>The complete primaless sacred wings had the ability to search for enemies in the void. He could interrupt his opponent and escape back to his Cosmos God nation.<br/><br/>And once he was entangled, it would be very difficult for the other party to escape.<br/><br/>However, the expert in the Black Cloud had an innate spiritual treasure, so it was possible for him to escape.<br/><br/>However, it was impossible for him not to pay a certain price.<br/><br/>“Damn it, don’t Push Your Luck.”<br/><br/>The figure in the Black Cloud had a slightly savage expression as he roared furiously.<br/><br/>“You are courting death. Since you dare to attack the Lightning race, you must pay the price!”<br/><br/>Wang Xian locked his eyes on him.<br/><br/>Huala<br/><br/>He moved and attacked the black cloud at a terrifying speed once again.<br/><br/>“Damn it!”<br/><br/>The figure in the Black Cloud had a gloomy expression. He had witnessed Wang Xian’s speed.<br/><br/>Under this strange speed and continuous attacks, the chances of him returning to the divine kingdom in an instant were very small.<br/><br/>If he continued to fight, he would be exhausted to death.<br/><br/>Unless, he could set up a protective shield to support himself and escape in an instant.<br/><br/>Moreover, after this protective shield was set up and attacked, it wouldn’t affect him.<br/><br/>This was a bit difficult for him, especially the hands of the Lightning race’s eldest senior brother, who was also a powerful weapon.\t\t\t\t\t\t</div>", "images": {}, "success": true}