{"id": 434, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072769.html", "title": "Chapter 3425 - 3425 3424 Reversed, And The Lightning Race Counterattacked!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3425 - 3425 3424 Reversed, And The Lightning Race Counterattacked!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3425 3424 reversed, and the Lightning race counterattacked!<br/><br/>An innate spiritual treasure of the darkness attribute was just enough to give his tai chi dragon disc a huge boost.<br/><br/>After Wang Xian kept it, he moved swiftly to the front of the main hall of the Lightning race.<br/><br/>“Boom!”<br/><br/>A terrifying dragon claw tore through the front. The object of suppression collapsed rapidly and flew to the side.<br/><br/>“Hahaha, our eldest senior brother has won. That universe ruler-level great being has been beaten away by our eldest senior brother, and the four great powers have all fled!”<br/><br/>“We’ve won, we’ve won, we’ve won!”<br/><br/>“Our eldest senior brother is invincible, our eldest senior brother is invincible!”<br/><br/>An incomparably excited roar sounded within the grotto-heaven blessed land. At this moment, everyone from the Thunder Light race cheered.<br/><br/>Even the tribe leader’s face was flushed red as he clenched his fists tightly.<br/><br/>The suppressive items outside had been cleared, and the situation here could be seen even more clearly.<br/><br/>They looked at their eldest senior brother who had broken through the suppressive items with a wave of his hand. They were burning with passion, admiration, and admiration.<br/><br/>At this moment, their eldest senior brother was their thunder ray tribe’s great hero!<br/><br/>“Boom!”<br/><br/>“Remove the defensive formation!”<br/><br/>After the suppressive objects in front were removed, the leader of the Lightning race immediately gave the order.<br/><br/>“It’s the leader!”<br/><br/>Excited voices came from behind. After the formation disappeared, they flew out one by one.<br/><br/>Wang Xian looked at them with a smile.<br/><br/>“Wang Xian, on behalf of the entire lightning race, thank you for saving us!”<br/><br/>The leader of the Thunder Ray tribe flew over and bowed respectfully.<br/><br/>Behind them, a group of experts from the Thunder Ray tribe bowed respectfully.<br/><br/>If not for Wang Xian, their thunder ray tribe might have become history.<br/><br/>“Hehe, leader, you don’t have to be so polite. The four major forces have already escaped. We can’t give them too much time. Let’s just kill our way over!”<br/><br/>Wang Xian smiled at them and said.<br/><br/>“Alright, Alright. Let’s kill our way over immediately. Let’s kill our way over immediately!”<br/><br/>The eyes of the Thunder Ray clan’s clan leader and the rest were filled with murderous intent as they roared.<br/><br/>“Alright, clan leader. Let’s go to the Great Thunderclap Academy and kill them directly.”<br/><br/>Wang Xian’s eyes were sparkling. The Great Thunderclap Academy had a very deep foundation, which was even deeper than the Thunder Ray clan.<br/><br/>Wang Xian did not ask for anything else. He only needed to obtain some acquired treasures and acquired Numinous Treasures other than the wind and thunder attributes.<br/><br/>These treasures could allow him to upgrade the great mill of five elements and the Tai Chi Dragon Disc.<br/><br/>Now, regardless of whether it was the great mill of five elements or the tai chi dragon disc, they both needed to upgrade their levels.<br/><br/>“Teleport directly to the edge of the great thunderclap academy through the teleportation formation. In addition, the teleportation formation that they set up for the journey should not be damaged. We can use it directly!”<br/><br/>A supreme elder of the Lightning race said directly.<br/><br/>“My Army, follow eldest senior brother immediately and follow us to the Great Thunderclap Academy. This time, it’s our turn to destroy the Great Thunderclap Academy!”<br/><br/>“Let’s Go!”<br/><br/>At the back, the experts of the lightning race immediately shouted excitedly.<br/><br/>“Yes, let’s Go!”<br/><br/>“Let’s go, let’s destroy them!”<br/><br/>All the disciples shouted angrily.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian and the rest immediately flew towards the teleportation formation.<br/><br/>Everything was starting to turn around!<br/><br/>Earlier, the Great Thunderclap Academy was attacking the Lightning race. Now, it was the Lightning race that was attacking back.<br/><br/>Buzz! Buzz! Buzz<br/><br/>Tens of millions of powerful disciples of the Lightning race followed Wang Xian and the rest and immediately set off.<br/><br/>At this moment, their faces were filled with excitement and fighting spirit.<br/><br/>Through the teleportation array, they started their expedition immediately.<br/><br/>At the same time, in the old dynasty of the grotto-heaven blessed land of the great thunderclap yard.<br/><br/>The experts of the great thunderclap yard and the Cosmos God Nation were all placed in their lairs.<br/><br/>With the existence of the grotto-heaven blessed land, it was extremely safe.<br/><br/>When all the members returned, the head of the Great Thunderclap Yard gave an order with an extremely aggrieved expression.<br/><br/>“All the disciples and citizens of the Great Thunderclap Academy, enter the grotto-heaven Blessed Land!”<br/><br/>“All the disciples and citizens of the Great Thunderclap Academy, enter the grotto-heaven Blessed Land!”<br/><br/>A mighty voice resounded throughout the Great Thunderclap Academy, accompanied by an urgent bell chime.<br/><br/>This bell chime would only ring when the Great Thunderclap Academy was in the most dangerous situation.<br/><br/>At this moment, the citizens of the Great Thunderclap Academy who had not received the news were all stunned.<br/><br/>“Why did the dean and the others ask us to retreat into the Great Thunderclap Academy? What exactly happened?”<br/><br/>“Hiss, what happened? Why did the alarm bell of our Great Thunderclap Academy Sound? Didn’t the Dean and the others go to suppress the Thunder Light Race?”<br/><br/>“What exactly happened?”<br/><br/>All the citizens of the Great Thunderclap Academy were stunned. They quickly flew in the direction of the grotto-heaven blessed land.<br/><br/>Very soon, they received the specific news.<br/><br/>When they learned that the eldest senior brother of the Thunder Light race had broken through to the universe ruler level of combat power.<br/><br/>When they learned that the eldest senior brother of the Thunder Light Race had defeated a universe ruler level one combat power great being, they only felt their vision go black.<br/><br/>Some of them were in disbelief, some were in disbelief, and some were in fear!<br/><br/>The eldest senior brother of the Thunder light race had actually broken through.<br/><br/>He had actually defeated them!<br/><br/>Then what about their future?<br/><br/>“Hu hu!”<br/><br/>All the citizens and disciples had ugly expressions on their faces as they entered the grotto-heaven blessed land in despair.<br/><br/>Not long ago, they had been cheering and celebrating, but now, the tables had turned.<br/><br/>“Principal, news has come from Zi City and Liuyan City. They want to enter our grotto-heaven blessed land and join us!”<br/><br/>At this moment, an elder in the Great Thunderclap Academy reported to the dean.<br/><br/>“They want to join us? They want to enter our grotto-heaven blessed land? Send them over!”<br/><br/>The dean’s expression changed slightly as he replied.<br/><br/>“What about Divine Thunder City?”<br/><br/>An ancestor looked at the elder and asked.<br/><br/>“There’s no news from Divine Thunder City. The city lord of Divine Thunder City is dead. They might disband Divine Thunder City and flee to other places.”<br/><br/>The elder said with an embarrassed expression.<br/><br/>In fact, their great thunderclap academy, Liuyan City, and Zi City could also flee.<br/><br/>However, there was a huge reason. They had too many clansmen.<br/><br/>Secondly, they had to conceal their identities to escape. This meant that they could not expose their identities, and they could not occupy another blessed land.<br/><br/>Otherwise, if the Thunder light race found out that their eldest senior brother of the Thunder Light race had come to kill them, they would still be finished.<br/><br/>They lived a life of being hunted. Because they did not have any backers, they might be hunted down by other races.<br/><br/>It was also very troublesome to enter some neutral cities. The other party might not allow you to enter.<br/><br/>That was because you had offended a universe ruler level one great being with Combat Power.<br/><br/>In order not to offend this great being, those neutral cities would not accept you.<br/><br/>As for joining other races, who would dare to take it?<br/><br/>A universe pinnacle race would dare to take it, but you would seek refuge?<br/><br/>Are you sure you would not be working like a horse?<br/><br/>Therefore, after considering everything, it would be better to stay in the grotto-heaven blessed land and cower, hoping to one day turn the tables.<br/><br/>As for the situation in the Divine Thunder City, it was because the city lord of the Divine Thunder City had died. The experts of the Divine Thunder City didn’t care about the people and just fled!\t\t\t\t\t\t</div>", "images": {}, "success": true}