{"id": 438, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072777.html", "title": "Chapter 3429 - 3429 3428 Thundercloud Domain Vibrated. It Was An Ancient Blueprint", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3429 - 3429 3428 Thundercloud Domain Vibrated. It Was An Ancient Blueprint</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3429 3428 Thundercloud domain vibrated. It was an ancient blueprint<br/><br/>According to the memories in Wang Xian’s mind, there were some bad treasures in the Treasury of the Great Thunderclap Academy.<br/><br/>However, it was a pity that they had to pay a lot of treasures in order to invite the Master of the universe.<br/><br/>Even so, the items inside would still drive people crazy.<br/><br/>The moment Wang Xian and the rest entered the treasury, they felt a majestic energy.<br/><br/>“The Great Thunderclap Academy has a deep heritage. They were born earlier than us, the Thunder Ray Race!”<br/><br/>The leader of the Thunder Ray race scanned his surroundings as his eyes sparkled.<br/><br/>“Most of them are treasures of the Thunder attribute!”<br/><br/>Wang Xian scanned his surroundings. The moment he entered the treasure house, there were all kinds of weapons of the Thunder attribute.<br/><br/>These weapons were all below the level of acquired Numinous Treasure. The number of weapons had reached a million. This was considered a small-scale weapon storage.<br/><br/>Wang Xian and the rest continued to walk forward. The energy in the depths was even more majestic. Similarly, it was mainly of the Lightning attribute.<br/><br/>Acquired Numinous Treasure, acquired Supreme Treasure!<br/><br/>When they reached the deepest part, Wang Xian looked to the right and revealed a smile.<br/><br/>He walked over. It was a flag of the Dark Yellow Earth attribute.<br/><br/>He waved his arm and the flag flew over. It emitted a powerful aura.<br/><br/>Innate spiritual treasure, this was the only other innate spiritual treasure in the great thunderclap academy that had the Lightning attribute.<br/><br/>The Earth attribute could be absorbed by the Five Elements Millstone.<br/><br/>“After absorbing it, the five elements millstone should be able to achieve a breakthrough.”<br/><br/>He muttered. The last time the Five Elements Millstone absorbed the universe ruler Level Fire Dragon Pearl, it had already achieved a very high level, and it was only a little bit away from the universe ruler Level 1.<br/><br/>Now that it absorbed this innate spiritual treasure, the five elements millstone should be able to break through!<br/><br/>However, it would be difficult for the Tai Chi Dragon Disc to break through!<br/><br/>He only had one innate spiritual treasure with the darkness attribute in his hands now, which could elevate the tai chi dragon disc to the peak of the Universe Knight.<br/><br/>In order for it to break through again, he still needed an innate spiritual treasure with the light and darkness attributes.<br/><br/>Wang Xian kept the flag of the innate numinous treasure. Naturally, the leader of the Lightning race and the rest did not have any objections.<br/><br/>Other than this innate numinous treasure, there were dozens of weapons with the wind and lightning attributes in the treasury.<br/><br/>There were five elements and there was also light and dark attributes!<br/><br/>Wang Xian kept all of these while he also took the other elixirs.<br/><br/>There were many elixirs, but there was still a long way to go before he could make another breakthrough.<br/><br/>“Clan leader, I won’t take the rest of the items. Let the other strong disciples use them!”<br/><br/>Wang Xian said to the Thunder Ray clan’s clan leader and the rest.<br/><br/>“These treasures are too valuable. Wang Xian, please accept these two innate spiritual treasures as well!”<br/><br/>The Thunder Ray clan’s clan leader and the rest looked at each other and shook their heads.<br/><br/>There were a total of three innate spiritual treasures in the great thunderclap academy, but Wang Xian didn’t want them.<br/><br/>“Clan leader, you can use this. You can take it.”<br/><br/>Wang Xian said with a smile.<br/><br/>“This… Alright.”<br/><br/>The clan leader of the Lightning race didn’t reject him anymore.<br/><br/>“Wang Xian, come and take a look at this. This is a very special item and its value isn’t low either!”<br/><br/>At this moment, the first supreme elder of the Lightning race was holding a blue ancient blueprint in his hand.<br/><br/>The entire ancient blueprint was emitting a faint blue light like waves.<br/><br/>“Huh?”<br/><br/>Wang Xian looked over and revealed a curious expression.<br/><br/>This ancient blueprint was like a living thing. The water elemental energy on it was condensed into fish swimming.<br/><br/>There were also some sailboats drifting on it!<br/><br/>The half-meter-long ancient blueprint presented a world.<br/><br/>“This seems to be the river of Eternity.”<br/><br/>The leader of the Lightning race walked over to take a look and made a guess.<br/><br/>“The river of Eternity?”<br/><br/>Wang Xian revealed a curious expression.<br/><br/>“The river of Eternity is not too far away from us. It would take a few years to fly there. It would take more than a month to pass through the teleportation formation. That is a place of suppression and also a place of brilliance.”<br/><br/>The leader of the Lightning race introduced to him, “Over there, more than ten billion years ago, there was a huge war between the two races. One of the races was suppressed here!<br/><br/>Later, the other race was destroyed by a space beast and turned into ruins.<br/><br/>The entire river of stars was occupied by that Space Beast. It was said that it still lived under the river of stars.<br/><br/>No force dared to occupy those paradises, but many experts went there to search for treasures and gain experience.<br/><br/>“The river of stars is also a branch of the mountains and seas.”<br/><br/>“It should be the river of eternity. I just don’t know what exactly is the place recorded on this ancient blueprint, and what exactly is its use!”<br/><br/>The first Supreme Elder of the Lightning race studied the ancient blueprint and shook his head.<br/><br/>“Look at the ripples on it. The ripples form circles and form a lotus pattern. It should be related to the 12th grade water lotus of the river of eternity, but the possibility is very small.”<br/><br/>The leader of the Lightning race continued.<br/><br/>“That’s true!”<br/><br/>The supreme elder of the Lightning race nodded.<br/><br/>“Twelfth-grade Water Lotus? Leader, what kind of treasure is this?”<br/><br/>Wang Xian asked curiously.<br/><br/>“The twelfth-grade water lotus can be said to be an innate treasure weapon. It can also be said to be a powerful water attribute cultivation treasure. No one has seen it before. On the other hand, sixth-grade water lotus and ninth-grade water lotus have appeared before.”<br/><br/>The leader of the Lightning race spoke.<br/><br/>Wang Xian nodded his head.<br/><br/>An innate treasure. A treasure of this level was not something that a faction like the Lightning race could possess.<br/><br/>Even if they managed to obtain one, it would be snatched away by an expert.<br/><br/>“Grand Elder, give me this ancient blueprint. I will go there to take a look when I have time!”<br/><br/>Wang Xian said.<br/><br/>Now that he had helped the lightning race to get rid of the Great Thunderclap Academy and the rest, he did not plan to stay here any longer.<br/><br/>He would go to other places to look for resources and treasures.<br/><br/>The river of Eternity was a good place to go. After all, the territory of the divine dragon was in the ocean.<br/><br/>“Alright, here you go!”<br/><br/>The first supreme elder nodded and passed the ancient blueprint to him.<br/><br/>Other than this ancient blueprint, Wang Xian was not too interested in anything else.<br/><br/>He did not want some strange and special items either.<br/><br/>“Clan leader, let’s go to Zi City and Liuyan City’s treasury.”<br/><br/>All the treasures in Zi City and Liuyan City had been transferred to the Divine Kingdom of the city lord.<br/><br/>Their divine kingdom had also been transferred to the grotto-heaven blessed land!<br/><br/>Wang Xian brought them over. All sorts of treasures had been reaped.<br/><br/>Just as Wang Xian and the rest began to collect the spoils of war, the news of the Great Thunderclap Academy, Zi City, and Liuyan city being destroyed had spread out.<br/><br/>Being annihilated and being suppressed were two completely different concepts.<br/><br/>The eldest senior brother of the Thunder Ray race had achieved a breakthrough and launched a desperate counterattack. They had thought that the great thunderclap academy and the rest would be defeated and that the three major factions would be suppressed.<br/><br/>However, all the factions and all the strong disciples had never thought that the three major factions of the great thunderclap academy would be completely annihilated!<br/><br/>This was because with the foundation of the Great Thunderclap Academy and the grotto-heaven blessed land that the Great Thunderclap Academy occupied, it was impossible unless there was an expert whose combat strength surpassed that of a level one universe overlord!\t\t\t\t\t\t</div>", "images": {}, "success": true}