{"id": 435, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072771.html", "title": "Chapter 3426 - 3426 3425 Had An Even Stronger Defense", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3426 - 3426 3425 Had An Even Stronger Defense</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3426 3425 had an even stronger defense<br/><br/>“What’s going on? Why did Liuyan City Sound the alarm?”<br/><br/>“I’m in Purple City right now, and I’m panicking. According to some of my brothers in Purple City, the senior brother of the Thunder race broke through to universe ruler level one, and the great being invited by the Four Great Powers was defeated by the senior brother of the Thunder Race. Now, the four great powers are finished!”<br/><br/>“I’m in Godly Thunder City right now, and I’m panicking as well. I saw the Great Beings of godly thunder city running away with their disciples. They immediately ran away, leaving their cities behind!”<br/><br/>“How… How could this be? The eldest senior brother of the Thunder race broke through all of a sudden, and he changed the entire battlefield by Himself!”<br/><br/>“The four great powers have been suppressing the Thunder race for more than ten days, and they’re almost completely suppressing them. But the eldest senior brother of the Thunder race broke through. This… the eldest senior brother of the Thunder race is really terrifying!”<br/><br/>“The Thunder Ray race has already begun their counterattack!”<br/><br/>The situation at the Great Thunder Note Hall, Purple City, God Thunder City, and Liuyan City couldn’t be concealed at all.<br/><br/>When the Great Beings of God Thunder City fled, and when the great beings of purple city and Liuyan City used the teleportation array to head to the Great Thunder Note Hall, it had already caused a huge commotion.<br/><br/>The war seemed to have ended in everyone’s eyes. In the end, no one had expected that the Thunder Ray race’s eldest senior brother would suddenly break through.<br/><br/>He even defeated A Level 1 universe overlord invited by the Four Great Powers.<br/><br/>This sudden change shocked everyone.<br/><br/>With this change, they knew that the situation had completely reversed.<br/><br/>Next, it was time for the Thunder Ray Race to counterattack. It was time for the Divine Thunder City to flee!<br/><br/>And, as expected, the Thunder Ray race had already begun their expedition.<br/><br/>“Headmaster!”<br/><br/>Not long after, at the Great Thunderclap Academy’s teleportation array, the experts from Purple City’s Liuyan City were teleported over.<br/><br/>The experts from Purple City’s Liuyan City arrived at the Great Thunderclap Academy’s main hall and shouted with an embarrassed expression.<br/><br/>“Let your disciples enter the grotto-heaven blessed land first. First Elder, go and make the arrangements!”<br/><br/>The Great Thunderclap Academy’s Headmaster ordered his subordinates with a sullen face.<br/><br/>“Yes, Headmaster!”<br/><br/>The first elder nodded and replied.<br/><br/>“Headmaster, what… What should we do next?”<br/><br/>The city lord of Zi City couldn’t help but ask.<br/><br/>“Our Great Thunderclap Academy’s grotto-heaven blessed land is stronger than the Lightning Race’s. It’s completely impossible for the Lightning race to break through it, but the other party will definitely suppress us.”<br/><br/>The Great Thunderclap Academy’s Headmaster said with a dark expression.<br/><br/>Now, they were the ones being attacked.<br/><br/>However, the great thunderclap school was also confident in the defensive power of their blessed land.<br/><br/>Universe Masters with first-level combat power couldn’t break it.<br/><br/>Only universe masters with second-level combat power could.<br/><br/>But they had to consider for the future.<br/><br/>Should they need a great being to wait outside and check out the situation?<br/><br/>Or would they need a group of disciples to hide and wait for an opportunity to make a move.<br/><br/>“Dean, the godly tablets of the two ancestors and thunder lion have been broken. They must have been killed by the senior brother of the Thunder Light race. There are only the four of us with Pinnacle Universe Knights.”<br/><br/>One of the ancestors of the Thunder Light Race said with an abnormally ugly expression.<br/><br/>Since the beginning of the war, five Pinnacle Universe Knights had died at the hands of the senior brother of the Thunder Light race.<br/><br/>That was more than half of the Great Beings in Great Thunder Note Academy.<br/><br/>Now, including Purple City and Liuyan City, there were only six Pinnacle Universe Knights.<br/><br/>Even without their eldest senior brother, they would not be a match for this power.<br/><br/>“Clan leader, how about I lead some seeds and elites to hide in the outside world and seek for a breakthrough, so that one day I can raise my combat power to the level of a universe ruler!”<br/><br/>An ancestor’s expression kept changing as he spoke.<br/><br/>“Alright!”<br/><br/>The Great Thunderclap Academy’s Dean clenched his fists and gritted his teeth.<br/><br/>“Third ancestor, fifth ancestor, the two of you will lead a group of disciples and great beings with potential to hide in the outside world in search of a breakthrough. We will seek a breakthrough in the grotto-heaven blessed land!”<br/><br/>He looked at the two old men and spoke.<br/><br/>The two ancestors nodded heavily, and their eyes were filled with a berserk killing intent. “Even if we can’t break through, we will make the Thunder light race unable to rest in peace.”<br/><br/>“Take your disciples and leave immediately. According to the news, they will arrive in five hours at most!”<br/><br/>The headmaster of the Great Thunderclap Academy leaned on his throne and said tiredly.<br/><br/>When the first battle started, they thought that they would definitely win, but the sudden appearance of the Lightning race’s eldest senior brother completely defeated them.<br/><br/>They still had 100% confidence in the second battle, and they had even enjoyed more than ten days of victory.<br/><br/>But they didn’t expect that the eldest senior brother of the Lightning race had broken through again!<br/><br/>“It’s all because of that eldest senior brother of the Lightning Race!”<br/><br/>He muttered, his eyes filled with hatred.<br/><br/>But in his heart, he felt even more powerless.<br/><br/>The Lightning race had produced an expert, even though he wasn’t their disciple.<br/><br/>In the Great Thunderclap Academy, all the disciples and citizens started moving. They moved all the treasures and everything into the grotto-heaven blessed land.<br/><br/>This made the grotto-heaven blessed land of the great thunderclap academy slightly more crowded.<br/><br/>“The Great Thunderclap Academy is right in front of us!”<br/><br/>At the same time, Wang Xian, the Thunder Ray race, and the rest arrived at the front of the Great Thunderclap Academy through teleportation and flying.<br/><br/>All the disciples were aggressive and carried a strong fighting spirit.<br/><br/>Looking at the Great Thunderclap Academy that had appeared in their line of sight, they approached it quickly.<br/><br/>“Our Thunder Ray race has been waiting for this day, waiting for the Great Army of the Thunder Ray Race to step onto the Great Thunderclap Academy’s Domain. Today, we have finally done it, Hahaha!”<br/><br/>An excited voice came from the mouths of the Thunder Ray race’s patriarch and the others.<br/><br/>“Billions and billions of grudges. Today, our thunder ray race’s luck is better and we have obtained victory. All disciples, charge into the Great Thunderclap Academy!”<br/><br/>The group of Supreme Elders and elders roared loudly and took the lead to charge forward.<br/><br/>Wang Xian was at the front, scanning the surroundings with a smile on his face.<br/><br/>Under the sweeping gaze of his dragon eyes, the great thunderclap school appeared unusually desolate.<br/><br/>Just like the Thunder Ray race not long ago, all the strong disciples of the Great Thunderclap School had already hidden in the grotto-heaven blessed land.<br/><br/>They knew that they were no longer a match for the Lightning race!<br/><br/>“Hahaha, Great Thunderclap Academy, today will come for all of you!”<br/><br/>All the disciples roared in excitement as they flew directly in the direction of the Great Thunderclap Academy’s Purple God Academy.<br/><br/>That was the core of the Great Thunderclap Academy, the grotto-heaven blessed land.<br/><br/>When they arrived in front of them, they let out excited and angry roars.<br/><br/>In the Purple God Academy, a massive purple energy enveloped the surroundings. In front of the Purple God Academy, the headmaster of the Great Thunderclap Academy, the city lord of Purple City, and the city lord of Liuyan City stood in front of them, they looked at the army of the Lightning race with embarrassed expressions.<br/><br/>At this moment, their feelings were no less than those of the Lightning race not long ago.<br/><br/>Behind them, the disciples of the Great Thunderclap Academy, Purple City, and Liuyan City were pale and full of hatred!\t\t\t\t\t\t</div>", "images": {}, "success": true}