{"id": 431, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072763.html", "title": "Chapter 3422 - 3422 3421 Was Invincible", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3422 - 3422 3421 Was Invincible</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3422 3421 was invincible<br/><br/>Two Thunder Lions and two Pinnacle Universe Knights from the Great Thunder Sound College.<br/><br/>They rode on the Thunder Lions and immediately flew to the right.<br/><br/>“Continue!”<br/><br/>The dean of the Great Thunder Sound College didn’t pay too much attention to them. He shouted and continued to suppress them.<br/><br/>They had universe masters on their side, so they weren’t worried about anything else.<br/><br/>“There must be some great beings from the Thunder light race who haven’t entered the blessed land and are hiding somewhere else.”<br/><br/>“That’s right. The senior brother of the Thunder Light race didn’t see them just now, and the two supreme elders of the Thunder Light Race didn’t show up. They should be hiding outside.”<br/><br/>“Humph! Once we suppress them here, they won’t be able to break through.”<br/><br/>On the Thunder Lion, two universe Knight Pinnacle Great Beings from the Great Thunder Sound Academy flew to the right quickly, looking around.<br/><br/>The eldest senior brother of the Thunder Light race was the biggest trouble to them. However, as long as they suppressed this place, they could send people to guard this place, and the eldest senior brother of the Thunder light race would be useless.<br/><br/>However, they had to be careful of the other party’s Revenge in the future.<br/><br/>As for the Purple City, Liuyan City, and the Divine Thunder City, the three major forces would move their cities here. At that time, there was nothing to worry about.<br/><br/>“Eh?”<br/><br/>At the same time, Wang Xian was flying rapidly in front of them.<br/><br/>His dragon eyes flickered. He smiled when he saw the two thunder lions flying over and the two great beings from the Great Thunderclap Academy.<br/><br/>Before he made a breakthrough, he was able to kill a peak universe knight by surprise.<br/><br/>What about now?<br/><br/>Crack! Crack<br/><br/>Wang Xian pushed his speed to the limit. He flapped his incipient saint wings and dashed toward them at a terrifying speed.<br/><br/>“What is that?”<br/><br/>The two great thunderclap academy ancestors who were riding on the Thunder Lions felt a light in front of them. They were astonished.<br/><br/>However, in the next moment, they felt death enveloping them completely. They widened their eyes and vaguely saw a familiar figure.<br/><br/>“PFFT! PFFT! PFFT!”<br/><br/>The sound of being penetrated was heard. Wang Xian narrowed his eyes slightly and his figure slowly stopped in the air.<br/><br/>Behind him, the Thunder Lion’s figure stopped. The two grandmasters of the great thunderclap school were completely frozen.<br/><br/>Following that, their vitality dissipated and they fell straight down.<br/><br/>“Hehe.”<br/><br/>Wang Xian smiled. He waved his arm and kept their bodies.<br/><br/>With his current strength, he could easily kill an expert with the peak combat strength of a universe knight.<br/><br/>After killing four experts in an instant, Wang Xian didn’t hesitate and continued to fly forward.<br/><br/>He concealed himself slightly.<br/><br/>In less than five minutes, he arrived at the front of the main hall.<br/><br/>In front of the main hall, the four major forces of the Great Thunderclap Academy were carrying out their suppression.<br/><br/>His gaze landed on the Black Cloud.<br/><br/>In this black cloud, there was an expert with the combat strength of A Level One universe dominator.<br/><br/>This was the only existence that Jian Yun was worried about.<br/><br/>As long as he could get rid of this fellow, all problems would be solved.<br/><br/>Right now, the Great Thunderclap Academy and the other four major forces were nothing to worry about.<br/><br/>“Dragon Eye!”<br/><br/>Wang Xian’s eyes shone brightly as he looked into the black cloud.<br/><br/>In his vision, the black cloud was slowly penetrated and a black shadow stood there.<br/><br/>The shadow was like a skeleton. It was about three meters tall and held a pitch-black staff in its hand.<br/><br/>Below him, dozens of heads condensed into a lotus throne. He stood motionless on it.<br/><br/>“Is this his real face? which race is he from?”<br/><br/>Wang Xian looked at the figure in his line of sight. His eyes flickered slightly.<br/><br/>He concealed his figure and approached the figure bit by bit.<br/><br/>“Huh?”<br/><br/>Just as Wang Xian approached, he suddenly saw the back of the figure’s head slowly emitting a luster.<br/><br/>A pair of blood-red glasses opened and a face appeared at the back of the figure’s head.<br/><br/>The blood-red eyes kept twitching as they sized up their surroundings.<br/><br/>“Have I been discovered?”<br/><br/>Wang Xian’s gaze focused. The other party must have been in a state of vigilance. That was why he was discovered at such a long distance.<br/><br/>“Attack!”<br/><br/>At this moment, Wang Xian did not hesitate at all.<br/><br/>Facing an expert with the combat strength of A Level One universe dominator, he did not hesitate at all and charged forward in an instant.<br/><br/>Wang Xian’s current speed was extremely terrifying. Even experts at the pinnacle of universe knights could hardly see him clearly.<br/><br/>Crash<br/><br/>With a soft explosion, Wang Xian arrived in front of the black cloud in an instant.<br/><br/>He flapped his incipient saint wings and charged into the black cloud in an instant.<br/><br/>Boom<br/><br/>A loud explosion was heard. The figure in the Black Cloud had already appeared in front of Wang Xian.<br/><br/>The black cloud condensed into a sharp spike and stabbed directly at Wang Xian.<br/><br/>Buzz<br/><br/>Wang Xian’s figure flickered slightly and instantly dodged this terrifying attack.<br/><br/>His arm turned into a dragon claw and directly tore towards the Thundercloud.<br/><br/>Buzz! Buzz! Buzz<br/><br/>A collision sound was heard, causing Wang Xian’s dragon claw to go slightly numb.<br/><br/>“HMM? This thundercloud is not simple. It should be an innate spiritual treasure.”<br/><br/>Wang Xian’s eyes narrowed slightly.<br/><br/>“Who are you?”<br/><br/>In the dark cloud, the three-meter tall and skinny figure holding a staff asked Wang Xian sternly.<br/><br/>“Hehe, who are you?”<br/><br/>Wang Xian sneered and asked the figure in the dark cloud.<br/><br/>“What happened?”<br/><br/>“What’s going on? is someone fighting with that Lord?”<br/><br/>“This…”<br/><br/>The terrifying energy that was suddenly transmitted from the dark cloud caused the expressions of everyone around to change drastically. They immediately looked over, their faces filled with shock.<br/><br/>“This is bad. An expert with the combat strength of a Master of the universe has appeared. What’s going on? Could it be an expert invited by the Thunder Ray Race?”<br/><br/>The headmaster of the Great Thunderclap Academy and the rest looked over. An ugly expression appeared on their faces as they growled in a low voice.<br/><br/>“If you don’t want to be enemies, get out of here.”<br/><br/>In the Black Cloud, the figure’s blood-red eyes stared at Wang Xian as he warned him with murderous intent.<br/><br/>“Hahaha, you want me to get out of here? Is this the Thunder Ray Race? You want me to get out of Here?”<br/><br/>“Since you guys like to stay here, then you can stay here forever!”<br/><br/>Wang Xian laughed out loud when he heard the figure in the black cloud. His figure flashed and the five elements millstone appeared in his hand. In an instant, he arrived in front of the black cloud.<br/><br/>Buzz<br/><br/>The energy of the five elements was injected into the five elements millstone. A terrifying attack was launched directly at the Black Cloud.<br/><br/>The Five Elements Millstone was able to kill a top-notch universe knight without Wang Xian’s control.<br/><br/>With his blessing, it was even more terrifying.<br/><br/>The destructive energy collided with the black cloud and tore a hole in it.<br/><br/>“Black Cloud Wave Slash!”<br/><br/>The Shadow in the black cloud growled. The black cloud in front of him condensed into the shape of a long blade and slashed at Wang Xian.<br/><br/>“Whoosh!”<br/><br/>Wang Xian’s figure flashed and instantly arrived at the back of the Black Cloud.<br/><br/>“Five elements reversal, explode!”<br/><br/>Wang Xian waved his arm and a series of phantom images exploded on the five elements grinding. The five elements began to reverse and the attributes began to clash.<br/><br/>Boom<br/><br/>A violent explosion resounded in the void above the lightning race.\t\t\t\t\t\t</div>", "images": {}, "success": true}