{"id": 447, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072795.html", "title": "Chapter 3438 - 3438 3437 Had Obtained The Water Lotus And Was On Top Of The Terrifying Space Beast", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3438 - 3438 3437 Had Obtained The Water Lotus And Was On Top Of The Terrifying Space Beast</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3438 3437 had obtained the water lotus and was on top of the terrifying space beast<br/><br/>“Dragon King!”<br/><br/>An lie looked at Wang Xian and greeted him respectfully.<br/><br/>“Did you bring the ancient oil lamp and vitality liquid?”<br/><br/>Wang Xian looked at an lie and asked him.<br/><br/>“Yes, I’ve already brought it.”<br/><br/>An lie nodded.<br/><br/>“Alright, an lie. For this place, calculate the distance ratio on the ancient blueprint. In a while, you will go to this location. There is a water lotus here. Go and see if you can bring it over.”<br/><br/>“Don’t force it. There is a terrifying existence at the level of a universe overlord here. You must be careful. If you encounter it, escape immediately.”<br/><br/>“Bring the five elements millstone with you. It can make the ancient blueprint show the location of the Water Lotus. I will remind you through the five elements millstone at all times!”<br/><br/>Wang Xian held the ancient blueprint and instructed him.<br/><br/>“Alright, Dragon King. I will take note.”<br/><br/>An lie nodded his head and looked up. His eyes flickered slightly.<br/><br/>An lie nodded his head. He moved his body and disappeared instantly.<br/><br/>He teleported around and calculated the distance shown on the ancient blueprint.<br/><br/>Then, he began to teleport forward.<br/><br/>Wang Xian moved his body and immediately sat cross-legged at the bottom of the river. He was sensing from afar.<br/><br/>The five elements millstone was equivalent to Wang Xian’s eyes. He could see everything around the five elements Millstone.<br/><br/>He could also communicate with an lie.<br/><br/>However, Wang Xian did not speak. He just watched quietly.<br/><br/>An Lie’s teleportation speed was extremely terrifying. He did not stop and teleported rapidly.<br/><br/>After more than ten seconds, an lie was approaching rapidly.<br/><br/>“It’s right in front of us. Be careful of your surroundings. There might be dire beasts guarding the area!”<br/><br/>Wang Xian’s reminder was heard. Through the five elements grinding, he was vigilant of his surroundings.<br/><br/>An Lie’s strength was still a little weaker. His insight was much weaker than Wang Xian’s.<br/><br/>Therefore, Wang Xian acted as his eyes and gave him a reminder.<br/><br/>“Use a short distance teleportation to close in. Be careful!”<br/><br/>Wang Xian continued to remind him. An Lie’s figure flashed and he immediately teleported over.<br/><br/>“I see it!”<br/><br/>As an lie got closer, Wang Xian’s gaze focused slightly and stared at the water lotus.<br/><br/>It was a sixth-grade water lotus!<br/><br/>“Be careful of the surroundings. 90% of the time, there are powerful desolate beasts guarding it!”<br/><br/>“I’ve found it. Behind the Water Lotus, do you see it? It’s a fish-type desolate beast with a pointed head. It should be a level one overlord-level desolate beast.”<br/><br/>Very soon, Wang Xian sensed the dire beast guarding the water lotus through the five elements grindstone. He sent a voice transmission to an lie.<br/><br/>“An lie, teleport to the right. I’ll do some Scouting!”<br/><br/>Wang Xian ordered.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie responded and scanned his surroundings vigilantly.<br/><br/>His life was very fragile here.<br/><br/>Buzz<br/><br/>An Lie’s figure disappeared. Wang Xian immediately looked around.<br/><br/>“Do it. Snatch the water lotus and teleport away. I will protect you through the five elements Millstone.”<br/><br/>Wang Xian scanned his surroundings and spoke after confirming.<br/><br/>Buzz<br/><br/>An lie instantly appeared in front of the water lotus and reached out to grab it.<br/><br/>Buzz<br/><br/>At the same time, five divine dragon silhouettes appeared around an lie and completely protected him.<br/><br/>“CHIRP CHIRP!”<br/><br/>The moment an lie appeared, the terrifying fish in front of him started to move.<br/><br/>He had sharp thorns and dashed over like a swordfish.<br/><br/>An lie sensed it and clenched his teeth to remove the water lotus completely.<br/><br/>“Bang!”<br/><br/>The sharp head of the terrifying fish-type dire beast collided with the defense of the five elements grinding.<br/><br/>An Lie’s figure disappeared instantly.<br/><br/>“Success!”<br/><br/>Wang Xian smiled when he saw that an lie had succeeded.<br/><br/>A sixth-grade water lotus was worth a lot of money.<br/><br/>Especially such a treasure. It was not something that a acquired treasure could compare to.<br/><br/>“Dragon King, it’s a success. The speed of the dire beast’s attack is too fast!”<br/><br/>An lie returned soon and said with a smile on his face.<br/><br/>“Alright, leave it to me. Let’s continue the operation. However, the next place is where the water from the Sky Falls. It might be even more dangerous there. You should proceed as before.”<br/><br/>Wang Xian said to him.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded.<br/><br/>“Fortunately, an lie is here. Otherwise, I wouldn’t dare to go there alone.”<br/><br/>Wang Xian watched as he left and mumbled.<br/><br/>Even though his speed was extremely terrifying, he didn’t dare to enter recklessly with the reminder of the Green Dragon Moon.<br/><br/>If he really disturbed the universe overlord-level space beast, he would definitely be sending himself to his death.<br/><br/>The possibility of escaping was very low.<br/><br/>After all, such a space beast could exert immense pressure on Wang Xian just by relying on its pressure!<br/><br/>With a move of his palm, the sixth-grade water lotus entered his body and appeared on the ancestral tree.<br/><br/>He sensed for a moment and realized that the two water lotuses were beginning to merge.<br/><br/>Could the merging of two sixth-grade water lotuses improve it?<br/><br/>He mumbled and looked at the speed of the merging. His attention was once again on the great mill of the five elements.<br/><br/>An lie continued to move forward and soon arrived in front of the second water lotus.<br/><br/>However, at this moment, streams of water gushed out from the top of the water lotus, causing great pressure on the bottom of the river.<br/><br/>As the water flowed down from the sky, this place was already within the coverage area.<br/><br/>This made an lie even more vigilant.<br/><br/>As the five elements grinded, the heads of the five divine dragons extended out slowly and scanned the surroundings vigilantly.<br/><br/>“Continue to get closer!”<br/><br/>Wang Xian ordered.<br/><br/>An lie immediately teleported.<br/><br/>When the water lotus appeared under Wang Xian’s perception, he frowned slightly.<br/><br/>He could already see the water lotus, but he did not sense any desolate beasts guarding the surroundings.<br/><br/>This was a little illogical.<br/><br/>After all, the river of Eternity was still the world of the desolate beasts.<br/><br/>If the water lotus appeared, it would definitely be discovered by the desolate beasts.<br/><br/>However, there were no desolate beasts around?<br/><br/>It was highly likely that he did not sense it.<br/><br/>“An lie, you can’t sense the dire beasts. Be careful.”<br/><br/>Wang Xian reminded him.<br/><br/>An lie nodded. He hesitated for a moment before teleporting again.<br/><br/>After teleporting to another direction, Wang Xian scanned the area again but still did not find anything.<br/><br/>“Be careful!”<br/><br/>He reminded again.<br/><br/>“Dragon King, I’ll make a move directly!”<br/><br/>An lie frowned slightly and said.<br/><br/>“Alright!”<br/><br/>Wang Xian nodded his head. He had no choice but to make his move now.<br/><br/>With the ancient oil lamp around, he should be fine.<br/><br/>Buzz<br/><br/>An Lie’s figure appeared in front of the water lotus in an instant. Without any hesitation, he grabbed it.<br/><br/>The Five Elements Millstone raised its defense.<br/><br/>Buzz<br/><br/>At this moment, a terrifying tentacle swept towards an lie.<br/><br/>“So Fast!”<br/><br/>An Lie’s expression changed drastically. Gritting his teeth, he grabbed at the water lotus.<br/><br/>“Be careful. It’s a desolate beast with at least the combat strength of a level two universe overlord!”<br/><br/>Wang Xian’s expression changed drastically as he reminded him.<br/><br/>Bang<br/><br/>The terrifying tentacle landed on the five elements Millstone’s defense. The defense collapsed immediately.<br/><br/>A Ray of red light enveloped an Lie’s body, blocking the attack of the tentacles.<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>At this moment, countless densely packed tentacles attacked, completely covering him.<br/><br/>An lie heaved a sigh of relief instead, and he immediately teleported while hugging the water lotus.\t\t\t\t\t\t</div>", "images": {}, "success": true}