{"id": 440, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072781.html", "title": "Chapter 3431 - 3431 3430 City Alliance River Of Eternity", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3431 - 3431 3430 City Alliance River Of Eternity</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3431 3430 City Alliance River of eternity<br/><br/>River of eternity, water from the sky.<br/><br/>Flowing into the mountains and seas.<br/><br/>The so-called sky was not the real sky, but an incomparably huge snow mountain.<br/><br/>The shape of this snow mountain was very strange. At the top, there was an extended piece that stretched for over a trillion kilometers.<br/><br/>It extended all the way to a relatively warm region. The snow melted into water and flowed down from the sky.<br/><br/>This was the river of eternity. Water came from the sky.<br/><br/>It was also known as the waterfall in the sky!<br/><br/>The river of Eternity was not far from the Lightning race. It would take more than a month of teleportation to reach it.<br/><br/>Wang Xian did not know where he was going to gain experience and search for resources. He decided to come to the river of eternity to see if he could find any treasures from the ancient blueprint.<br/><br/>The teleportation process still required some time to fly. Occasionally, roars could be heard as he soared in the sky.<br/><br/>Wang Xian’s speed had a qualitative improvement compared to the past. As he flew, he could tear apart the sky above the Heaven Desolation Continent.<br/><br/>The level one combat strength of a ruler of the universe was considered to be among the top experts in the heaven desolation continent.<br/><br/>In less than a month, Wang Xian arrived at the city closest to the Milky Way.<br/><br/>The Milky Way City!<br/><br/>The distance between the Milky Way city and the Milky Way city was not considered close. It would take Wang Xian a week to fly there.<br/><br/>Currently, no faction dared to set up their base at the river of stars.<br/><br/>That was because there was a terrifying space beast hidden there.<br/><br/>A large number of people living there might attract the attention of the space beast.<br/><br/>Therefore, the nearest Tian Heng City was also relatively far away.<br/><br/>However, even if it was far away, the strength of Tian Heng City was not weak.<br/><br/>The city lord of Tian Heng City had the combat strength of a level one universe overlord. It belonged to a large city.<br/><br/>Usually, experts who entered the river of Tianheng would use the teleportation formation to reach here.<br/><br/>Wang Xian came out from the teleportation formation and came to this city. He scanned his surroundings.<br/><br/>The city was huge. The area of the mountains and rivers was even larger than the huge courtyard of the entire great Thunderclap Academy.<br/><br/>There were also many people in the city. There were residents and some experts who had rushed over from the teleportation formation.<br/><br/>“It’s quite bustling!”<br/><br/>Wang Xian scanned his surroundings and revealed a smile.<br/><br/>As he walked on the road, there were many humans and demonic beasts around him. It was also very peaceful.<br/><br/>The city was a little quieter. There were all kinds of items for sale on both sides of the street.<br/><br/>There was less killing intent here and more silence.<br/><br/>Wang Xian was not in a hurry to rush to the river of Eternity and strolled around.<br/><br/>“Eh? This is the Hundred Cities Alliance?”<br/><br/>After strolling around for more than two hours, Wang Xian saw a huge building.<br/><br/>There were many people entering and exiting the building.<br/><br/>He had a curious look on his face as he walked in.<br/><br/>What entered his eyes was a huge screen. There were all sorts of missions on the screen.<br/><br/>At the top of the screen was the Hundred Cities Alliance Mission Board.<br/><br/>At the top of the screen was the mission to hunt down a level three desolate beast, a universe overlord, and the mission to assassinate the leader of a certain faction.<br/><br/>“This is rather interesting.”<br/><br/>Wang Xian’s eyes were sparkling. He opened his AI and checked the Hundred Cities Alliance.<br/><br/>“It’s very strong!”<br/><br/>He was slightly shocked when he saw the Hundred Cities Alliance.<br/><br/>The so-called hundred cities alliance was just like its name. It was an alliance.<br/><br/>The Hundred Cities Alliance was not just a hundred cities, but an alliance formed by 108 cities.<br/><br/>Firstly, the strength of the cities required universe masters to be in charge.<br/><br/>Secondly, the cities were completely neutral and did not participate in anything.<br/><br/>Their alliance had a main purpose, which was to prevent anyone from fighting within the cities of the Hundred Cities Alliance. Otherwise, they would be hunted down by the Hundred Cities Alliance.<br/><br/>An alliance had hundreds of universe ruler level warriors, who would dare to mess with them?<br/><br/>The alliance was very powerful within the heaven opening primal continent.<br/><br/>However, because they were neutral, the other races could rest assured.<br/><br/>Plus, the alliance was only an alliance based on rules, so it wasn’t too scary.<br/><br/>If there was a conflict between a force and a city of the Hundred Cities Alliance, they could announce a challenge. The experts of the Hundred Cities Alliance would basically stand on a fair point of view and make a statement.<br/><br/>There was a huge possibility that they wouldn’t interfere!<br/><br/>Of course, there was also a possibility that they would protect them. After all, they were in the same alliance.<br/><br/>The strength of the Hundred Cities Alliance also gave birth to the missions of the Hundred Cities Alliance. Some people could set up missions within the cities, and the Hundred Cities Alliance would act as a guarantee.<br/><br/>Some of them were similar to the Mercenary Association.<br/><br/>Wang Xian took a look inside and realized that there were quite a number of missions related to the river of eternity.<br/><br/>For example, the news about the twelfth-grade water lotus.<br/><br/>The news about the ninth-grade water lotus.<br/><br/>Wait!<br/><br/>“I heard that the Azure Dragon Moon obtained a sixth-grade water lotus. Is that true?”<br/><br/>“It should be true. A sixth-grade water lotus is only at the level of an acquired Numinous Treasure. Although it is much more valuable than an acquired numinous treasure, there are occasionally experts who obtain it. The Azure Dragon Moon is the divine dragon of the ancestral dragon lineage!”<br/><br/>“TSK TSK, I was fortunate enough to see him transform into the body of a divine dragon. He is too strong. The peak bloodline is the peak bloodline.”<br/><br/>Just as Wang Xian was walking out, a few figures walked over from the entrance and started to discuss.<br/><br/>“The body of a divine dragon?”<br/><br/>Wang Xian heard their conversation and raised his eyebrows slightly.<br/><br/>It seemed that there was a divine dragon of the ancestral dragon lineage in the river of Eternity!<br/><br/>Wang Xian continued listening and did not receive any news. He shook his head and walked out.<br/><br/>His body moved and flew to the sky.<br/><br/>He looked in the direction of the river of Eternity and flew straight away.<br/><br/>There were once two powerful races living in the river of eternity.<br/><br/>These two races had the combat strength of the Masters of the universe. Furthermore, there were quite a number of them.<br/><br/>Ten billion years ago, one force was suppressed by another.<br/><br/>And the other force was destroyed by the Space Beast.<br/><br/>This also made it so that there were many blessed lands there, and they were all ownerless. No force dared to occupy them.<br/><br/>Those blessed lands attracted many great beings to enter and cultivate.<br/><br/>According to the information on the AI, there were many great beings in the Heavenly River.<br/><br/>Some of them were looking for water lotuses for their cultivation.<br/><br/>It was the most precious treasure of a water attribute cultivator.<br/><br/>Wang Xian was flying rapidly in the sky. From time to time, he would bump into some people.<br/><br/>Seven days later, an incomparably huge waterfall descended from the sky.<br/><br/>At a glance, the end of the waterfall was like the water in the sky.<br/><br/>The river of Eternity was located below. The surface of the ground was washed out of a huge territory by the flow of water. The length could not be measured.<br/><br/>As for the width, with Wang Xian’s speed, he would be able to fly for one to two months.<br/><br/>The Majestic River was filled with energy. It was like a Fairyland!<br/><br/>At the edge of the river, there were even many sailboats on it. However, the sailboats were not very big.<br/><br/>There was a taboo in the river of eternity. One should not engage in an intense battle within the river of eternity.<br/><br/>It might attract the terrifying space beast over.\t\t\t\t\t\t</div>", "images": {}, "success": true}