{"id": 443, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072787.html", "title": "Chapter 3434 - 3434 3433. The 12Th Cave Master", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3434 - 3434 3433. The 12Th Cave Master</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3434 3433. The 12th cave master<br/><br/>“I want it!”<br/><br/>Wang Xian walked over slowly and spoke directly.<br/><br/>He was still very interested in the water lotus.<br/><br/>The ancestral tree could allow the water lotus to grow rapidly. Even if he could not use it for the time being, he could cultivate it slowly.<br/><br/>In the future, he might be able to cultivate it into a 12th grade water lotus.<br/><br/>“Oh?”<br/><br/>When everyone saw Wang Xian asking for it directly, they were surprised and looked at him.<br/><br/>The old man who was selling the fruits smiled.<br/><br/>“I don’t have any weapons, but these resources should be enough!”<br/><br/>Wang Xian took out some water-type fruits and presented them in front of him.<br/><br/>“Alright, it’s Enough!”<br/><br/>When the old man saw the fruits, his eyes lit up and he immediately said.<br/><br/>Wang Xian waved his arm and the fruits came before the old man.<br/><br/>The old man’s eyes lit up and he immediately kept the fruits.<br/><br/>“Wait!”<br/><br/>“I want this water lotus too!”<br/><br/>Just as the old man waved his hand and gave the water lotus to Wang Xian, a voice suddenly sounded.<br/><br/>“Huh?”<br/><br/>Wang Xian was slightly taken aback. The old man also turned around immediately.<br/><br/>Two men and a woman walked over from the side. They had four arms and tails.<br/><br/>All four arms were holding sharp swords. They were more than two meters tall and were green in color.<br/><br/>“Hey, those are… the people of the cave master of the Demoness Cave!”<br/><br/>“They want it too. Looks like there’s going to be a competition.”<br/><br/>When the crowd saw the three figures, they were surprised and whispered.<br/><br/>“The Cave Master of the Demoness Cave?”<br/><br/>When Wang Xian heard this title, he was curious.<br/><br/>“Venerable one, I want the Water Lotus!”<br/><br/>The three of them arrived. The woman in the lead spoke directly to the old man who was selling the water lotus.<br/><br/>“This…”<br/><br/>The old man looked at Wang Xian with an embarrassed expression.<br/><br/>“Our deal has been completed!”<br/><br/>Wang Xian said plainly. With a wave of his arm, the water lotus in front of him flew towards him.<br/><br/>Whoosh<br/><br/>However, when the water lotus was flying towards him, a figure started to move. With a wave of his arm, a thorn directly wrapped around the water lotus.<br/><br/>Wang Xian narrowed his eyes slightly and looked at the lady who was attacking him.<br/><br/>“I want this water lotus. Please give my master, the Cave Master of the Demoness Cave, some face.”<br/><br/>The woman looked at Wang Xian indifferently and said.<br/><br/>“The disciple of the cave master of the Demoness Cave?”<br/><br/>The surrounding experts were slightly shocked when they heard his words.<br/><br/>“Hehe.”<br/><br/>Wang Xian smiled and shook his head slowly. “I have already bought it.”<br/><br/>“Hehe, I can bring you into the cave to cultivate. Give me this water lotus!”<br/><br/>The woman chuckled and ignored Wang Xian. She looked at the elder beside her.<br/><br/>“Cultivate in the demoness cave!”<br/><br/>The old man’s expression changed. He looked at Wang Xian and gritted his teeth. “This… Venerable one, I’m not selling the water lotus anymore!”<br/><br/>“It’s a deal.”<br/><br/>Wang Xian looked at him. He had already kept the divine fruits that he had given to the other party.<br/><br/>Now, he still wanted to go back on his word?<br/><br/>Sorry, it’s a deal!<br/><br/>He wouldn’t agree to it!<br/><br/>When the old man heard his words, his eyes flickered.<br/><br/>“Deal? Hehe, this venerable one, do you think this water lotus should be sold to him or me?”<br/><br/>The woman smiled and asked the old man.<br/><br/>“Naturally, it should be sold to you, female venerable one!”<br/><br/>When the old man heard her words, his eyes flickered and he took two steps back.<br/><br/>“Very good. Therefore, the Water Lotus is mine!”<br/><br/>The woman waved the sharp sword in her hand and said to Wang Xian without a doubt.<br/><br/>“How dare you be so arrogant here?<br/><br/>Wang Xian shook his head.<br/><br/>In the next moment, his figure disappeared instantly.<br/><br/>“PFFT! PFFT! PFFT!”<br/><br/>Sounds of penetration rang out. When he reappeared, he was already at the side of the water lotus. He stretched out his hand and kept it.<br/><br/>“Bang Bang Bang!”<br/><br/>The woman’s body fell to the side, and that old man also fell to the ground.<br/><br/>There was no life left!<br/><br/>He didn’t even have the chance to scream before he died instantly!<br/><br/>“Oh? Hiss, this is?”<br/><br/>“What speed. He… he actually killed the disciple of the cave master of the Demoness Cave!”<br/><br/>“So Powerful!”<br/><br/>When the two corpses fell, everyone around was shocked and hurriedly took a few steps back.<br/><br/>“How dare you kill our senior sister? You’re courting death!”<br/><br/>The man next to the woman reacted. His expression changed drastically as he shouted sternly.<br/><br/>Wang Xian looked at them and frowned slightly.<br/><br/>With a flick of his finger, a surge of terrifying energy instantly entered their bodies.<br/><br/>Boom<br/><br/>A loud explosion sounded from within their bodies. They died immediately!<br/><br/>They were courting death!<br/><br/>This wasn’t a city, nor was it the domain of some races. He could be considered to have seen some rules.<br/><br/>Rules meant that there were no rules.<br/><br/>Just now, the old man and the woman had completely disobeyed the rules, wanting to use their power to suppress him.<br/><br/>But this was simply courting death.<br/><br/>Perhaps that woman was used to being arrogant, or perhaps she had a background.<br/><br/>But what was the use?<br/><br/>There were foolish people everywhere.<br/><br/>“He is a powerful expert, but those three are the cave master of the Banshee Cave. Does he not want to live here anymore?”<br/><br/>“Ha, that woman is a fool. She offhandedly offended someone. She deserves it!”<br/><br/>Some of the surrounding people saw this scene and said softly.<br/><br/>“Boom!”<br/><br/>At this moment, a terrifying energy covered the sky and covered the earth.<br/><br/>Everyone’s expression changed drastically and they immediately flew into the distance.<br/><br/>“Who is courting death? How dare you kill my disciple!”<br/><br/>A woman with four arms flew out from a flower petal cave on the Lotus Mountain.<br/><br/>Her face was filled with a strong murderous aura.<br/><br/>Her gaze locked onto Wang Xian. Without any hesitation, she attacked him with her sword aura.<br/><br/>Wang Xian squinted his eyes slightly. The incipient Saint Wings appeared behind his back instantly and his figure disappeared.<br/><br/>“Crash!”<br/><br/>The next moment, he arrived at the side of the Banshee. His arm transformed into a dragon claw and attacked the banshee directly.<br/><br/>“What? What a fast speed!”<br/><br/>The Banshee’s expression changed drastically when she sensed Wang Xian’s speed. The four sharp swords in her hands immediately blocked the attack.<br/><br/>“Boom!”<br/><br/>The powerful force immediately sent her flying backward.<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Large-scale battles are prohibited in the river of eternity. No one is allowed to violate the rules. Cave master, if you are going to fight, go to the sky!”<br/><br/>Just as Wang Xian was about to continue his attack, waves of power came from the lotus flower caves.<br/><br/>A cold voice entered their ears.<br/><br/>“I know.”<br/><br/>The cave master wiped the blood from the corner of her mouth and stared at Wang Xian with a fearful expression.<br/><br/>Wang Xian swept his gaze across the flower petal caves below and did not continue his attack.<br/><br/>He could sense waves of powerful threats from these caves.<br/><br/>All of them were at the level of the Masters of the universe.<br/><br/>“Little brother, I can sense the aura of a divine dragon from you. Are you a newly advanced powerhouse from my ancestral dragon lineage?”<br/><br/>At this moment, a dignified middle-aged man walked out from the cave entrance and asked Wang Xian.<br/><br/>“HMM?”<br/><br/>Wang Xian looked at the middle-aged man with a twinkle in his eyes.<br/><br/>The other party was a divine dragon!\t\t\t\t\t\t</div>", "images": {}, "success": true}