{"id": 441, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072783.html", "title": "Chapter 3432 - 3432 3431 Sixth-Grade Water Lotus", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3432 - 3432 3431 Sixth-Grade Water Lotus</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3432 3431 sixth-grade water lotus<br/><br/>“Is this the river of Eternity?”<br/><br/>Wang Xian looked at the river in front of him. His eyes gleamed as he swept his gaze over.<br/><br/>Unlike ordinary rivers and oceans, the sea water of the river of eternity was emitting white mist. From Afar, it looked like a celestial river.<br/><br/>He flapped his wings and came to the top of the river.<br/><br/>Wang Xian could feel that the water was warm!<br/><br/>When he entered the river, the water was warm and comfortable. However, the water of the river of eternity was unusually deep. One could not see the bottom at a glance.<br/><br/>“There are two paradises in the river of eternity. One is located at the bottom of the river, and the other is located on an island at the center of the right.”<br/><br/>Wang Xian thought of the information regarding the river of eternity and mumbled.<br/><br/>There were not only two paradises in these two places, but they were once the territories of the two major forces.<br/><br/>There were more than a dozen paradises around each of these territories.<br/><br/>There were quite a number of experts cultivating there!<br/><br/>“Eh?”<br/><br/>Wang Xian took out the ancient blueprint and noticed that the scene on it had changed.<br/><br/>The patterns on the ancient blueprint had changed, and the ships on it had also changed.<br/><br/>In the past, there were only about a dozen ships on it. Now, there were a few hundred of them.<br/><br/>The surface of the ancient blueprint was still rippling, forming a water lotus pattern.<br/><br/>Wang Xian moved his body and immediately flew to the sky. His gaze swept across the surrounding ships.<br/><br/>“The number of ships on the ancient blueprint is the same. What exactly is the use of this ancient blueprint?”<br/><br/>A curious expression appeared on his face as he took the ancient blueprint and entered the bottom of the river once again.<br/><br/>His body moved and he landed at the bottom of the river once again. He scanned his surroundings vigilantly and flew forward.<br/><br/>The depth of the river was extremely terrifying. However, the entire bottom of the river was suffused with a blue luster. This was the luster of the water attribute.<br/><br/>By practicing the water attribute here, he would be able to achieve twice the result with half the effort.<br/><br/>Wang Xian swam quickly and sized up the ancient blueprint in his hand from time to time.<br/><br/>Time passed by little by little. After flying for a day, the ancient blueprint had also undergone some changes.<br/><br/>There were no more ships on it. All that was left were seawater and ripples.<br/><br/>“This ancient blueprint should be a kind of probing treasure. What is it probing for? Water Lotus?”<br/><br/>Wang Xian guessed and continued flying. However, there were still no changes to the ancient blueprint for the next ten days.<br/><br/>Other than some changes, there were no other changes.<br/><br/>This made Wang Xian feel a little helpless.<br/><br/>“However, if this is a powerful treasure, the Great Thunderclap Academy would have made use of it. They wouldn’t have kept it in the Treasury.”<br/><br/>Wang Xian mumbled as he looked at the ancient blueprint. He hesitated for a moment and entered some water-elemental laws into it.<br/><br/>“HMM?”<br/><br/>When he inserted the water-elemental energy into it, the ancient blueprint glowed and the ripples on it became faster.<br/><br/>Wang Xian was stunned for a moment before he injected the water-elemental energy into it with all his might.<br/><br/>The ripples on the ancient blueprint became faster and faster. In the end, the water lotus pattern on it became clearer.<br/><br/>“Other than this change, there are no other changes!”<br/><br/>Wang Xian frowned. Could it be that the water energy was insufficient?<br/><br/>Wang Xian moved his palm and the five elements millstone appeared in his hand. He placed the ancient blueprint on the Five Elements Millstone.<br/><br/>He channeled all his energy into the five elements millstone. The five elements millstone started to rotate and converted all of it into water-elemental energy that surged into the ancient blueprint.<br/><br/>Waves of vast energy surged into it. However, what surprised Wang Xian was that there were no changes to the ancient blueprint. Instead, there were some changes to the five elements millstone.<br/><br/>On the five elements millstone, the water and wood attributes emitted a luster. The two colors interweaved and slowly condensed into a water lotus pattern.<br/><br/>Then… then it was gone!<br/><br/>“That’s not right. According to the records, there were two races that once lived in the river of eternity. One of them was a dual-attribute cultivation race, wood and water attributes.”<br/><br/>Wang Xian mumbled as his eyes sparkled.<br/><br/>With a wave of his arm, he controlled the five elements grinding mill.<br/><br/>The wood attribute and water attribute surged into the ancient blueprint. In the next moment, the ancient blueprint underwent another change.<br/><br/>The water lotus formed by the ripples of the water flow moved slowly to the front left.<br/><br/>Wang Xian raised his eyebrows slightly. He moved his body and flew in that direction.<br/><br/>He flew quickly. As he flew, the position of the Water Lotus remained unchanged.<br/><br/>He frowned slightly and continued flying.<br/><br/>Half an hour later, he realized that the position of the Water Lotus on the ancient blueprint had changed. It was getting closer and closer to the starting point.<br/><br/>In fact, it wasn’t the water lotus that was moving but Wang Xian. Wang Xian was getting closer and closer to his target.<br/><br/>Another ten minutes passed. The ancient blueprint showed the starting point of the water ripple. Wang Xian stood there and scanned his surroundings.<br/><br/>There were no treasures in sight. He looked down and flew straight down.<br/><br/>The depth was terrifying. He flew down for half an hour, but he still didn’t reach the bottom of the river.<br/><br/>It was like an abyss.<br/><br/>Whoosh! Whoosh! Whoosh! Whoosh<br/><br/>Just as Wang Xian continued to dive downwards, waves of ripples were transmitted over. Following that, Wang Xian sensed a terrifying attack.<br/><br/>There were water snakes with heads that were like lotus flowers. Due to their unique heads, they did not have any sense of beauty. On the contrary, they gave off a terrifying feeling.<br/><br/>Wang Xian’s body trembled. The Tai Chi Dragon Disc was suspended in the surroundings.<br/><br/>“Bang, Bang, Bang!”<br/><br/>The sound of collision could be heard and Wang Xian’s figure started to flicker.<br/><br/>In terms of speed, he wasn’t afraid at all.<br/><br/>“Whoosh, Whoosh, Whoosh!”<br/><br/>His arm turned into a dragon claw with chains wrapped around it. He directly grabbed at the water snakes.<br/><br/>“Crash!”<br/><br/>The chains restrained the water snakes. Wang Xian squinted his eyes slightly and shook his arm.<br/><br/>Five water snakes at the peak of the Universe Knight level were instantly killed.<br/><br/>He had obtained five corpses at the peak of the universe knight level just like that?<br/><br/>This was rather satisfying!<br/><br/>“Whoosh!”<br/><br/>However, at this moment, another terrifying attack appeared. Wang Xian’s gaze focused and the five elements millstone smashed forward.<br/><br/>“Boom!”<br/><br/>A violent collision sound rang out and the five elements millstone trembled slightly.<br/><br/>A water snake flew backward while staring at its body. The blue eyes in front of the Lotus head stared at Wang Xian.<br/><br/>“A Level 1 water snake with the combat strength of a universe Dominator!”<br/><br/>Wang Xian’s expression changed slightly and revealed a look of shock.<br/><br/>“There are definitely treasures here!”<br/><br/>He was certain in his heart. Otherwise, the five water snakes at the peak of the universe knight level would not risk their lives to attack him.<br/><br/>This water snake would not attack him recklessly either.<br/><br/>“What is that?”<br/><br/>He looked down and saw that he had already reached the bottom of the river. There was a glowing lotus flower there.<br/><br/>The one-meter-long lotus flower had yet to bloom and was exuding a strong vitality.<br/><br/>The water lotus flower was of the water attribute and was also of the wood attribute. Water gave birth to wood, and it was the one with the strongest vitality.<br/><br/>“No wonder he attacked me. It turns out that the water lotus flower exists. This ancient blueprint is really impressive!”<br/><br/>Wang Xian’s eyes lit up as he stared at the water snake.<br/><br/>“You’re courting death!”<br/><br/>He moved his body and flapped his incipient holy wings. In an instant, he appeared at the water snake\t\t\t\t\t\t</div>", "images": {}, "success": true}