{"id": 444, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072789.html", "title": "Chapter 3435 - 3435 3434. Under The 12 Cave Masters", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3435 - 3435 3434. Under The 12 Cave Masters</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3435 3434. Under the 12 Cave Masters<br/><br/>He had a wood element aura and was filled with a strong dragon aura.<br/><br/>His strength should be at level one of the universe Dominators.<br/><br/>Wang Xian looked at the middle-aged man who was filled with power and a name appeared in his mind.<br/><br/>Green Dragon Moon!<br/><br/>It was a green dragon in the river of eternity, which was also of the wood element.<br/><br/>Currently, there were Golden Dragons, water dragons, fire dragons, wind dragons, Thunder Dragons, and Darkness Dragons in the Dragon Palace. The Green Dragon was one of the missing ones.<br/><br/>Looking at the friendly expression of the Azure Dragon Moon, he cupped his hands slightly.<br/><br/>“You are not a disciple of the ancestral dragon lineage, but you are also a member of the Divine Dragon lineage. You should be the Azure Dragon Moon, right? I have long heard of you!”<br/><br/>Wang Xian said to the Azure Dragon Moon.<br/><br/>“In the universe, other than the Holy Dragon lineage, the other divine dragon lineages are all friends. If this brother doesn’t mind, you can come and be my guest!”<br/><br/>Green Dragon Moon laughed out loud and invited Wang Xian over.<br/><br/>“Alright!”<br/><br/>Wang Xian felt the goodwill and nodded his head slightly.<br/><br/>This was the first expert from the ancestral dragon lineage that he had met.<br/><br/>Furthermore, he seemed to be easy to get along with.<br/><br/>“An expert from the Holy Dragon lineage. No wonder this Lord Dared to casually destroy Cave Master Banshee’s disciple!”<br/><br/>“Just now, Cave Master Banshee was injured in just one exchange. His strength is definitely at the first level of the Universe Overlord.”<br/><br/>“Hehe, this time, the cave master of the Demoness Cave has met his match!”<br/><br/>In the surrounding area, some people were discussing in shock when they saw this scene.<br/><br/>The Cave Master of the Demoness Cave took a fierce look and returned to his cave abode.<br/><br/>“May I know the name of this brother?”<br/><br/>Wang Xian entered the cave abode of the Azure Dragon Moon and asked.<br/><br/>“Wang Xian.”<br/><br/>Wang Xian replied.<br/><br/>“Wang Xian? Is He the Dragon King of the Dragon Palace?”<br/><br/>Green Dragon Moon paused for a moment and looked at him in astonishment.<br/><br/>“HMM? I didn’t expect brother Green Dragon Moon to know about it. Our Dragon Palace is a small force!”<br/><br/>Wang Xian was extremely astonished when he recognized Wang Xian. He couldn’t help but exclaim.<br/><br/>This was the first time he was recognized by someone when he came to the heaven-splitting primordial land.<br/><br/>The Dragon Palace was very strong in the outer region and was almost invincible. Their reputation was also very well-known.<br/><br/>However, in the inner region, they were silent and nameless. No one would take them to heart.<br/><br/>“Haha, Brother Wang Xian, you are too humble. As we are both from the divine dragon lineage, I have paid more attention to it. Through the universal AI, I have learned a little about it. I really didn’t expect to meet the leader of the third divine dragon lineage in the Universe!”<br/><br/>Green Dragon Moon laughed out loud and gestured for him to sit at the side. He poured him a glass of wine and waved his hand. Some delicacies appeared on the table.<br/><br/>“Our Dragon Palace can not be compared to the ancestral dragon lineage. The leader of the ancestral dragon lineage is even more courageous and admirable!”<br/><br/>Wang Xian said with a smile. He was sincere as well.<br/><br/>“I do admire our leader.”<br/><br/>Qing longyue was slightly moved. Then, she looked at Wang Xian and said, “But I have also seen your deeds, brother Wang Xian. You’re amazing. You’re even more amazing than the rumors.”<br/><br/>“You’re too modest!”<br/><br/>Wang Xian shook his head.<br/><br/>“May I know what brother Wang Xian thinks of the Holy Dragon Clan?”<br/><br/>Qing longyue suddenly asked.<br/><br/>“Evaluation. There’s nothing to comment on.”<br/><br/>Wang Xian was slightly stunned. He smiled and said, “If there are people who like to be lackeys, then let them be. As long as we can stand at the peak again and rebuild the glory of the Holy Dragon Clan, it’s enough.”<br/><br/>“Hahaha, good, good, good. Our leader once said the same thing. If there are people who like to be a lackey, let them be. When we re-establish our peak again, we will be the pure divine dragon lineage.”<br/><br/>Green Dragon Moon laughed out loud and picked up his wine glass. “It has been a long time since I met a brother of the divine dragon lineage. Let’s Toast!”<br/><br/>Wang Xian picked up his wine glass and smiled.<br/><br/>“Oh right, brother Azure Dragon Moon, I’ve just arrived at the river of eternity. Brother, can you tell me about the situation here?”<br/><br/>Wang Xian asked him.<br/><br/>He really didn’t know much about the situation here.<br/><br/>For example, the powerhouses in the twelve flower petal caves had an unspoken rule.<br/><br/>“The river of Eternity is a chaotic place. There are no restrictions, but there is an unspoken rule. That is, do not engage in a powerful battle here for fear of disturbing the space behemoth in the river of Eternity.”<br/><br/>“Secondly, the Heavenly River has two grotto-heavens. Our Lotus Grotto-heaven, my grotto-heaven, belongs to the highest level. You should be able to feel the energy here, and it will greatly aid your cultivation.”<br/><br/>“There are twelve such grotto-heavens, which is twelve petals. I and the other eleven powers occupy this place, and they are known as the Twelve Cave Masters.”<br/><br/>“Our combat strength is at the first or second level of the universe dominator. There is only one at the second level.”<br/><br/>Azure Dragon Moon introduced to him.<br/><br/>Wang Xian nodded his head slightly. The energy here was indeed abundant, especially the water energy. A day of cultivation here was equivalent to a hundred days outside!<br/><br/>“Brother Wang Xian, you are very strong. It shouldn’t be difficult for you to become the cave master. You can challenge one of them. Once you defeat him, this cave abode will belong to you.”<br/><br/>Azure Dragon Moon continued to speak to him.<br/><br/>“Challenge? How?”<br/><br/>Wang Xian asked curiously.<br/><br/>“You can just challenge him directly. For example, the cave master of the Demoness Cave just now. If you say that you want to challenge her directly at the door, she will accept it. Then, she will go to the sky to fight. If she wins, she will have to leave this place.”<br/><br/>Azure Dragon Moon replied.<br/><br/>“Oh? That’s pretty easy!”<br/><br/>Wang Xian nodded his head.<br/><br/>“There are twelve cave masters. With your strength, as long as you don’t Challenge Cave Master Tianheng, Cave master water mage, and Cave Master Ice Emperor, the rest shouldn’t be too much of a problem. Of course, Cave Master Banshee should have a huge treasure.”<br/><br/>Azure Dragon Moon said.<br/><br/>“Tianheng, water mage, and Ice Emperor?”<br/><br/>Wang Xian nodded his head slightly. “Brother Qing longyue, I have another question. Are there many water lotuses in the Tianheng River?”<br/><br/>“How can there be so many treasures? If brother Wang Xian is here for the water lotuses, it will take a long time to find them. I have been here for tens of thousands of years and only got a sixth-grade water lotus.”<br/><br/>Qing longyue shook his head with a smile. “It is said that there are many water lotuses in the place where the water from the Sky Falls. There are also ninth-grade water lotuses, but no one dares to go there.”<br/><br/>“Is that Space Beast There?”<br/><br/>Wang Xian asked curiously.<br/><br/>“I’m not sure, but the possibility is very high. It’s a real space beast at the level of a ruler of the universe. Even if a powerhouse from a peak race came, they might not be able to kill it. There’s even the possibility of suffering its revenge. Therefore, although I’m not sure, no one dares to go there yet.”<br/><br/>Green Dragon Moon said.<br/><br/>“Alright, thank you for informing me, Brother Green Dragon Moon.”<br/><br/>Wang Xian thanked him and nodded slightly. He had some thoughts in his mind.<br/><br/>“Come, come. Try the snow lotus seeds I got on the snow mountain. TSK TSK, the taste is very good.”<br/><br/>Green Dragon Moon gestured at him.<br/><br/>The snow lotus seeds were emitting a blue glow. They were comparable to the divine fruits of a peak universe knight.<br/><br/>“Haha, Alright. I’m going to find a cave abode to stay in. When the time comes, you can look for me if you need anything.”<br/><br/>Wang Xian said with a smile.<br/><br/>The two of them could be considered to befriend each other!\t\t\t\t\t\t</div>", "images": {}, "success": true}