{"id": 445, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072791.html", "title": "Chapter 3436 - 3436 3435 Battle Against The Cave Master Of The Banshee Cave", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3436 - 3436 3435 Battle Against The Cave Master Of The Banshee Cave</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3436 3435 battle against the Cave Master of the Banshee Cave<br/><br/>Wang Xian had a good chat with Azure Dragon Moon. He now had a detailed understanding of the river of eternity!<br/><br/>He walked out from the cave abode of Azure Dragon Moon. His body moved and he immediately came to the front of the cave abode of the cave master of the Banshee Cave.<br/><br/>“Cave Master of the Banshee Cave, get out here!”<br/><br/>He stood in front and spoke indifferently.<br/><br/>His voice was transmitted to the interior of the cave master of the Demoness Cave.<br/><br/>Not far away, Green Dragon Moon was leaning against his cave abode. He was watching this scene with a smile on his face.<br/><br/>“Eh? That powerhouse wants to challenge the Cave Master of the Demoness Cave!”<br/><br/>“He exchanged a move with the cave master of the Demoness Cave just now. It’s obvious that he has the upper hand!”<br/><br/>“The battle for the cave master. It’s been a long time since such a battle took place. A huge battle is about to take place!”<br/><br/>In the center, everyone was astonished when they saw Wang Xian challenging the cave master of the Banshee tribe.<br/><br/>This was the paradise of the Lotus tribe. At their peak, the Lotus tribe had the combat strength of a level two master of the universe.<br/><br/>As their base, their paradise was much more powerful than the paradise of some factions!<br/><br/>The energy contained in each cave abode could not even be compared to a large city like the Eternal Heaven City.<br/><br/>In fact, in the Eternal Heaven River, the powers of the Eternal Heaven City occupied one area and became the cave master.<br/><br/>As an expert with the combat strength of A Level One universe dominator, the cave master of the Demoness Cave was not someone to be trifled with even though she did not have her own powers.<br/><br/>“You’re courting death!”<br/><br/>In the cave abode of the Demoness Cave, the Cave Master of the Demoness Cave snorted and flew out. Her cold gaze locked onto Wang Xian.<br/><br/>“Hehe!”<br/><br/>Wang Xian chuckled. His body moved and he flew up into the sky.<br/><br/>When he arrived in the sky above the river of eternity, he looked down at the cave master of the Demoness Cave. His eyes were filled with disdain.<br/><br/>He had 100% confidence in dealing with this cave master of the Demoness Cave.<br/><br/>“I’m going to kill you!”<br/><br/>The Cave Master of the Demoness Cave was emitting a blue light. Her four arms were holding sharp swords and her face was extremely ferocious.<br/><br/>She waved her four arms and a terrifying water current cleaved directly into the sky.<br/><br/>Wang Xian’s figure moved and easily dodged it.<br/><br/>“Die!”<br/><br/>The Cave Master of the Demoness Cave roared and charged into the sky.<br/><br/>At the same time, in the other ten cave abodes, the figures were looking at the scene in front of them.<br/><br/>In the scene, it was the scene outside.<br/><br/>They were naturally very concerned about a strong person challenging a cave master.<br/><br/>This person might be their competitor in the future.<br/><br/>“Hehe!”<br/><br/>Wang Xian could vaguely feel the prying eyes from the surroundings. He smiled gently.<br/><br/>The energy in his body was circulating. He had the body of a true dragon and the body of a water god Dragon.<br/><br/>“Cloud and mist dragon!”<br/><br/>He growled in a low voice. An incomparably huge cloud and mist appeared in the sky, covering everyone’s line of sight.<br/><br/>His gaze was locked onto the cave master of the Demoness Cave who was attacking him. He immediately moved.<br/><br/>“Splash!”<br/><br/>Streams of water rushed towards the cave master of the Demoness Cave.<br/><br/>The sharp sword in the hands of the cave master of the Demoness Cave slashed down.<br/><br/>“PFFT! PFFT! PFFT!”<br/><br/>Wang Xian’s attack was immediately broken.<br/><br/>“Kill my disciple. I’m going to kill you this time!”<br/><br/>The cave master of the demoness cave sensed Wang Xian’s attack and her eyes lit up.<br/><br/>From her point of view, the last time she was attacked, the other party must have unleashed some powerful bloodline power.<br/><br/>Otherwise, it was impossible for him to be so fast.<br/><br/>Now that she sensed his combat strength, it was only so-so. He could definitely fight!<br/><br/>All he had to do was to be careful of his explosive power!<br/><br/>“Kill!”<br/><br/>Wang Xian let out a low growl as well. He controlled the flow of water to condense into a divine dragon and attacked the cave master of the Demoness Cave once again.<br/><br/>“Demoness water technique!”<br/><br/>The Cave Master of the Demoness Cave let out a low growl. One after another, the demoness formed by the flow of water appeared. They attacked Wang Xian from all directions.<br/><br/>Wang Xian flapped his primaless saint wings and dodged continuously.<br/><br/>He did not reveal his true strength.<br/><br/>Yes, he was hiding his true strength.<br/><br/>There were experts spying on him from below. Furthermore, since Wang Xian was planning to stay here for a period of time, he definitely could not reveal his full strength.<br/><br/>When he used all his trump cards, it would be the most dangerous time for him.<br/><br/>Keeping some trump cards was also to prevent some special situations.<br/><br/>Wang Xian was fighting with the cave master of the female demon cave. He didn’t use the five elements grindstone or the incipient sacred wings. He only relied on his abhijna and battle tactics to fight with her.<br/><br/>When he encountered some danger, he would run away quickly from time to time to show his speed. This was also to avoid the suspicion of the cave master of the female demon cave.<br/><br/>The battle between powerhouses, especially those of the same level, would last for a long time if there wasn’t too much suppression.<br/><br/>Wang Xian wasn’t in a hurry. He accompanied the cave master of the Banshee Cave and played with her.<br/><br/>Time passed hour by hour.<br/><br/>At the bottom, everyone raised their heads and watched the battle in the sky.<br/><br/>They could only sense the terrifying power. They couldn’t even see a shadow.<br/><br/>In the grotto-heaven, the powerhouses were also watching.<br/><br/>A Day passed very quickly. The battle continued.<br/><br/>No one was surprised by this.<br/><br/>A Day of battle was not a long time.<br/><br/>“Who do you think will win?”<br/><br/>“It’s hard to say. A battle between Masters of the universe is not something we can guess.”<br/><br/>“I think it’s that new lord. He seems to be very powerful.”<br/><br/>“The cave master of the Banshee Cave is also very powerful. In a battle of this level, it’s up to who has the most treasures and who has the most trump cards.”<br/><br/>In the Lotus Mountain Peak, a group of experts were discussing.<br/><br/>“Is brother Wang Xian hiding his strength? According to the information I received, he is extremely strong within the same level. He is almost invincible. What is happening now?”<br/><br/>Azure Dragon Moon looked at the battle in the sky. Due to the cover of the clouds and the raging energy, he could not see the exact situation of the battle.<br/><br/>“Banshee Heaven and earth!”<br/><br/>At this moment, a cold voice came from the sky.<br/><br/>An enormous phantom of a banshee appeared in the sky and slashed downwards with her sword.<br/><br/>A terrifying energy filled the sky and earth.<br/><br/>“Roar Roar Roar!”<br/><br/>“Mighty Heavenly Dragon!”<br/><br/>The Roar sounded and everyone could faintly see a terrifying divine dragon charging towards the banshee.<br/><br/>“Eh?”<br/><br/>Some people couldn’t help but look in the direction of the Azure Dragon Moon when they saw this divine dragon.<br/><br/>“Could it be that this lord is an expert of the ancestral dragon lineage?”<br/><br/>“It shouldn’t be. He just got to know Lord Azure Dragon Moon.”<br/><br/>Some people looked on in astonishment.<br/><br/>“Damn it!”<br/><br/>At this moment, the cave master of the Banshee Cave, who was in the middle of the battlefield, looked at this divine dragon with an abnormally awkward expression.<br/><br/>Her world of the demoness had been suppressed by this divine dragon.<br/><br/>Since the start of the battle, she was at a slight disadvantage.<br/><br/>“I’m not playing with you anymore!”<br/><br/>Wang Xian’s eyes were sparkling with the eyes of the cave master of the Demoness Cave. The incipient saint wings were emitting a luster.<br/><br/>Crash<br/><br/>In the next moment, his figure disappeared instantly.<br/><br/>“This move again!”<br/><br/>A vicious look appeared in the eyes of the cave master of the Demoness Cave as she scanned her surroundings vigilantly.<br/><br/>“No, it’s faster than before!”<br/><br/>At this moment, Wang Xian’s voice sounded from behind him.<br/><br/>“What?”<br/><br/>The expression of the cave master of the Demoness Cave changed drastically.\t\t\t\t\t\t</div>", "images": {}, "success": true}