{"id": 449, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072799.html", "title": "Chapter 3440 - 3440 3439 Ninth-Grade Water Lotus", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3440 - 3440 3439 Ninth-Grade Water Lotus</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3440 3439 ninth-grade water lotus<br/><br/>This water lotus had two flower buds, and the third flower bud could be vaguely seen.<br/><br/>The two flower buds were not small. It would be very soon before it could be upgraded to a ninth-grade water lotus.<br/><br/>Of course, it would be very soon, and it would take a long time.<br/><br/>“If these four water lotus flowers are fused together, there might be a slight chance of upgrading to a ninth-grade water lotus!”<br/><br/>Wang Xian smiled as he looked at the four water lotuses that were slowly fusing on the ancestral tree.<br/><br/>He informed the Heaven Formation and instructed him to set up a demonic altar.<br/><br/>Following that, under the lead of an lie, he arrived at the cave abode of the Lotus Peak.<br/><br/>“An lie, I have a mission for you. Bring the five elements millstone and search for the water lotus in the river of eternity. Do not go near the space behemoth.”<br/><br/>Wang Xian did not let an lie leave and instructed him.<br/><br/>Although an lie did not have the protection of the ancient oil lamp, as long as he did not go to the Space Beast’s location and had the protection of the five elements millstone, he should not be in any danger.<br/><br/>An lie was faster than Wang Xian and it was more convenient for him to search.<br/><br/>“It’s the Dragon King.”<br/><br/>An lie nodded.<br/><br/>At the side, the Heaven Array was studying the formation. Wang Xian did not interrupt him and flew to the entrance of the cave abode.<br/><br/>“I heard that there are terrifying waves surging in the center of the river of eternity. The terrifying power is wreaking havoc in the surroundings!”<br/><br/>“I’ve heard about it too. It should be the space beast. Isn’t this too terrifying?”<br/><br/>“Some of them have escaped recently. I’m afraid that the space beast will go berserk. Otherwise, we won’t be able to escape.”<br/><br/>Just as he walked out of the cave, some voices sounded.<br/><br/>His eyes gleamed.<br/><br/>With the terrifying power of the space beast, once it charged over, the imprisoned energy would make it hard for a universe knight to escape.<br/><br/>A universe ruler was a ruler who could already rule the world.<br/><br/>Especially a water elemental great being in the river and ocean.<br/><br/>Their strength would be enhanced even more.<br/><br/>“Senior Azure Dragon Moon!”<br/><br/>In front of the cave abode of Azure Dragon Moon, more than ten flustered figures flew over.<br/><br/>They came to the front of the cave abode and bowed respectfully.<br/><br/>“EH, these more than ten are disciples of the Divine Dragon lineage.”<br/><br/>Wang Xian’s dragon eyes looked at their bloodlines, and his eyes sparkled.<br/><br/>Then, he shook his head. The number of ancestral dragons could not be compared to the Dragon Palace.<br/><br/>Before they disbanded, there were tens of millions of them. Now that the ancestral dragons had disbanded for tens of millions of years, there were probably more disciples.<br/><br/>Of course, there was a possibility that there were fewer of them. After all, the outside world was dangerous.<br/><br/>More than a dozen disciples of the ancestral dragons were bowing in front of the Azure Dragon Moon Cave abode. They entered very quickly.<br/><br/>Wang Xian took a look and returned to his own cave abode.<br/><br/>He sensed the fusion of the water lotus. Based on this speed, it would probably take one to two years.<br/><br/>He was not in a hurry. In the heaven-opening primal continent, one to two years would pass in the blink of an eye.<br/><br/>Wang Xian returned to his cave abode and checked some information on the universe’s AI.<br/><br/>Time passed day by day. At an Lie’s place, there was a piece of good news ten days later. He had obtained a water lotus.<br/><br/>Even though it was a third-grade water lotus, it was not bad.<br/><br/>After sending it over, he immediately left.<br/><br/>The other experts needed to search carefully for the water lotus. They even needed to check every single spot.<br/><br/>How Big was the river of Eternity? Even if it was a level 1 universe overlord, it would take hundreds of millions of years to search every single spot.<br/><br/>Therefore, the others relied on luck to find the water lotus.<br/><br/>If they were lucky, they could get one.<br/><br/>If they were unlucky, they might not get one even if they stayed here for millions of years.<br/><br/>However, other than the water lotus, there were other treasures in the river of eternity, such as the water attribute divine tree, divine grass, and divine fruit.<br/><br/>However, it was different for an lie. He could teleport and had the ancient blueprint, so he could quickly search every area.<br/><br/>According to his speed, in a few years, apart from the center, he would be able to search through the entire river of eternity.<br/><br/>In the following period of time, he stayed quietly in the cave abode.<br/><br/>One by one, the water lotus flowers were sent over by an lie. They were of the third and sixth grades. In a short period of time, he had found more than 20 of them.<br/><br/>Among them, there were ten of them who were of the sixth grade. It was a little out of Wang Xian’s expectations.<br/><br/>He was also slightly excited about this.<br/><br/>The ninth grade water lotuses were stable now. There was a 100% chance that he could fuse them together.<br/><br/>Perhaps he could even get two ninth grade water lotuses!<br/><br/>This was much better than venturing into the Central Region!<br/><br/>Another year passed by in a flash. On this day, Wang Xian could feel a majestic water energy surging out from his body.<br/><br/>A phantom image of a lotus flower slowly appeared in front of him.<br/><br/>“Has it fused into a ninth-grade water lotus?”<br/><br/>Wang Xian sensed this energy and looked at the image in front of him. His eyes were sparkling.<br/><br/>With a thought, the two-meter-sized water lotus flower appeared in front of him.<br/><br/>The entire water lotus flower contained a majestic life force and the flow of water energy.<br/><br/>Wang Xian looked at it in astonishment.<br/><br/>This water energy was much stronger than the innate spiritual treasure.<br/><br/>This was an existence that was above the innate spiritual treasure and below the innate supreme treasure.<br/><br/>Wang Xian moved his body and sat cross-legged on the water lotus. Streams of water flowed through his entire body, making him exceptionally comfortable.<br/><br/>“The water lotus mainly focuses on defense and cultivation. Its attack is also very strong. This is simply a powerful treasure that combines both offense and defense with cultivation. No wonder the value of the water lotus is so high!”<br/><br/>He muttered to himself. Sitting cross-legged on it, he still had a sense of holiness!<br/><br/>This water lotus could be used as an innate spiritual treasure weapon. It could also be absorbed. After absorbing it, one could comprehend the essence of the water lotus. Perhaps, one would be able to comprehend a powerful attack technique.<br/><br/>“Hehe!”<br/><br/>Wang Xian smiled and revealed a satisfied expression.<br/><br/>There were still a bunch of water lotus on the ancestral tree. Based on the number of these water lotus, it shouldn’t be a problem to fuse them into three more water lotus.<br/><br/>However, it might be difficult to fuse them into a twelfth grade water lotus.<br/><br/>This would require at least a dozen ninth grade water lotuses.<br/><br/>However, he was already very satisfied to be able to obtain such a harvest.<br/><br/>With the water lotuses around, his strength would also be able to increase a little.<br/><br/>In the past, it was one against three, now it was one against four, or even five.<br/><br/>“Senior Azure Dragon Moon, save me!”<br/><br/>At this moment, a terrified cry for help came from outside.<br/><br/>Wang Xian was slightly stunned. His body moved and he flew out.<br/><br/>“Boom!”<br/><br/>At the entrance, Wang Xian saw a few disciples of the Divine Dragon lineage escaping in this direction with the shackles above their heads.<br/><br/>Behind them, more than a dozen figures were chasing after them.<br/><br/>“Ah!”<br/><br/>A disciple who had transformed into a divine dragon had his head pierced through by a sharp sword!<br/><br/>“You’re courting death!”<br/><br/>An angry voice came from within the Azure Dragon Moon Cave abode, and a azure divine dragon flew out from within.<br/><br/>He had directly transformed into an azure dragon, and one could imagine how furious he was.<br/><br/>“Oh No, run!”<br/><br/>The expressions of the pursuing figures changed drastically, and they hurriedly fled!\t\t\t\t\t\t</div>", "images": {}, "success": true}