{"id": 442, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072785.html", "title": "Chapter 3433 - 3433 3432 Lotus Grotto-Heaven", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3433 - 3433 3432 Lotus Grotto-Heaven</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3433 3432 lotus grotto-heaven<br/><br/>“Hiss, hiss, hiss!”<br/><br/>When the water snake, who had the combat strength of A Level One universe dominator, saw Wang Xian appearing by its side, its azure-blue eyes changed slightly and it lowered its head slightly.<br/><br/>The refinement on the top of its head gradually enlarged, forming a powerful defense.<br/><br/>“Boom!”<br/><br/>Wang Xian clawed out with his dragon claws. The terrifying force landed on it, causing a huge wound to appear on its head instantly.<br/><br/>Buzz<br/><br/>At the side, the five elemental grinding mill collided directly. Destructive energy was condensed on it.<br/><br/>The water snake flew backward.<br/><br/>Hiss! Hiss! Hiss<br/><br/>It let out a roar. A look of fear appeared in its eyes. It opened its mouth and a water snake formed from water elemental laws attacked the water lotus that had yet to bloom.<br/><br/>“Huh?”<br/><br/>Wang Xian frowned slightly when he saw this scene. His body moved and instantly appeared in front of the water lotus. He waved his hand and destroyed the attack of the water snake.<br/><br/>At the side, the figure of the water snake started to turn illusory and left instantly.<br/><br/>Wang Xian swept his gaze over and frowned slightly.<br/><br/>“This water snake is really smart. If it doesn’t attack the water lotus, it won’t be able to escape.”<br/><br/>He mumbled.<br/><br/>With Wang Xian’s current strength and the five elements grindstone, an expert of the same level wouldn’t be able to escape.<br/><br/>If he were to encounter the expert in the black cloud the last time, Wang Xian was 100% sure that he would be able to kill him.<br/><br/>Even if he had obtained another innate spiritual treasure.<br/><br/>“What grade is this water lotus?”<br/><br/>Wang Xian came to the front of the water lotus and sized it up.<br/><br/>He sensed for a moment and realized that its energy was far beyond that of an ordinary acquired spiritual treasure.<br/><br/>“It should be a sixth grade water lotus of the level of an acquired spiritual treasure!”<br/><br/>Wang Xian mumbled to himself. A sixth grade water lotus was much more precious than an acquired spiritual treasure.<br/><br/>The water lotus could be absorbed and could also be used as a powerful weapon.<br/><br/>As a weapon, it was much more powerful than an acquired spiritual treasure.<br/><br/>“This is not fully matured yet. How long will it take for it to mature?”<br/><br/>He raised his eyebrows slightly. After hesitating for a moment, he placed his palm on it.<br/><br/>A branch extended out from his finger and waves of energy surged into it.<br/><br/>Wang Xian was prepared to use the ancestral tree to mature it!<br/><br/>Buzz<br/><br/>However, what surprised him was that the water lotus that had yet to bloom seemed to be greatly attracted. It slowly moved to the roots of the ancestral tree.<br/><br/>A look of surprise appeared on his face. The Water Lotus entered his body and appeared on the ancestral tree of the Dragon Palace.<br/><br/>“This is really unexpected. Is it because of the characteristics of the Water Lotus?”<br/><br/>According to Wang Xian’s understanding, the water lotus could continue to grow. In other words, as long as there was sufficient energy and time, it could grow to the level of a twelfth-grade water lotus.<br/><br/>A twelfth-grade water lotus was a treasure that was slightly higher than an innate treasure.<br/><br/>It was definitely an ultimate treasure of the universe.<br/><br/>Wang Xian smiled and sensed the situation of the water lotus. He took out the ancient blueprint and continued to look at it.<br/><br/>“HMM? Is there a detection range?”<br/><br/>He entered the water attribute and wood attribute energy into the water lotus again. The Water Lotus on the ancient blueprint did not have any changes.<br/><br/>He made a guess and flew forward.<br/><br/>In the following month, he searched all the way, but did not encounter a second water lotus.<br/><br/>This made him a little speechless.<br/><br/>The number of such water lotus was too little, right?<br/><br/>After wandering for another two days, he saw the changes on the ancient blueprint, and his eyes lit up.<br/><br/>His body moved, and he immediately flew forward.<br/><br/>There was another hint on the ancient blueprint. It was located in front of him.<br/><br/>“Isn’t this a blessed land? I think it’s called the Lotus Grotto-heaven Group.”<br/><br/>Forty minutes later, Wang Xian looked ahead and frowned slightly.<br/><br/>The Lotus Grotto-heaven group was once the location of the Lotus race in the river of eternity.<br/><br/>There were more than a dozen blessed lands here, and they were not too far away.<br/><br/>This lotus race was also the race that was exterminated by the Space Beast back then.<br/><br/>Back then, their defensive blessed lands were unable to stop the space beast.<br/><br/>Wang Xian followed the instructions on the ancient blueprint and continued to fly forward.<br/><br/>Soon, he discovered the silhouettes of other experts around him.<br/><br/>And there were quite a number of them.<br/><br/>All of them belonged to the water element.<br/><br/>“The Lotus Mountain is ahead!”<br/><br/>As he continued flying, Wang Xian saw a huge mountain peak at the bottom of the river ahead. He flew upwards.<br/><br/>There was an incomparably huge mountain peak at the top. The entire mountain peak was like a lotus flower that was protruding out of the water.<br/><br/>On this mountain peak was the core of the former lotus flower race.<br/><br/>He flew to the mountain peak. The entire mountain peak looked exactly like a real lotus flower and belonged to the twelfth grade.<br/><br/>The twelve petals of the mountain peak represented the residence of an expert from the lotus flower race.<br/><br/>There was a large hall in the center.<br/><br/>However, all of this had been destroyed. There were only some remains that had been repaired.<br/><br/>There were many people in the Lotus Flower Mountain Peak. At a glance, there were at least over a hundred thousand people.<br/><br/>Some of them were cultivating while some of them were setting up stalls to trade.<br/><br/>Wang Xian took a look at the ancient blueprint and walked in.<br/><br/>According to the ancient blueprint, there were water lotuses in the surroundings.<br/><br/>“This water lotus should belong to someone. It was a wasted trip!”<br/><br/>Wang Xian looked at his surroundings and flew forward.<br/><br/>“Eh, there are quite a number of experts around here.”<br/><br/>Wang Xian came to the Lotus Mountain Peak and scanned his surroundings. He could sense more than ten powers of the universe overlord level.<br/><br/>Most of the powers came from the position of the twelve flower petals on the mountain peak.<br/><br/>Moreover, waves of majestic energy came from within.<br/><br/>That place should be considered the core of the grotto-heaven blessed land. It was helpful for cultivation.<br/><br/>Although this place was not occupied by other powers and races, there were many experts who came here to cultivate and occupy a treasured land.<br/><br/>“Third-grade water lotus. Someone actually sold a third-grade water lotus over there!”<br/><br/>“What’s so exciting about a third-grade water lotus? It’s not of much use to us anymore!”<br/><br/>“We can nurture it. Someone is able to nurture a third-grade water lotus to the level of a sixth-grade one!”<br/><br/>“That would require too much time and resources. Let’s go and take a look.”<br/><br/>At the back, two figures flew past Wang Xian and discussed excitedly.<br/><br/>Wang Xian looked over. There was indeed a water lotus.<br/><br/>A third-grade water lotus was between a acquired Numinous Treasure and an acquired Supreme Treasure. However, it was much less useful to a universe knight and above level seven.<br/><br/>Wang Xian moved and flew over immediately.<br/><br/>He could buy this water lotus that could grow continuously. With the existence of the ancestral tree, its evolution speed was faster.<br/><br/>“Third-grade Water Lotus, exchange for an offensive and defensive water-elemental acquired Numinous Treasure. Or if you have enough resources, exchange for it too.”<br/><br/>In the middle, an old man was sitting there. A mature water lotus was floating in front of him. His voice spread throughout the surroundings.<br/><br/>“I want it!”<br/><br/>Wang Xian walked over. His gaze landed on it and spoke directly.\t\t\t\t\t\t</div>", "images": {}, "success": true}