{"id": 459, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072819.html", "title": "Chapter 3450 - 3450 3449, A Terrifying Battle", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3450 - 3450 3449, A Terrifying Battle</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3450 3449, a terrifying battle<br/><br/>The body of the Astral Beast was completely revealed. Its triangular head coldly stared at Baili’s Archangel.<br/><br/>That monstrous aura caused everyone to feel suffocated.<br/><br/>Baili’s Archangel stared at the Astral Beast. His twelve angelic wings flapped, and his eyes were calm.<br/><br/>“Retreat. I want the twelfth grade water lotus.”<br/><br/>He stared at the space beast calmly, and his expression didn’t change at all.<br/><br/>“I’ve protected the grade-12 water lotus for billions of years, and you want to take it away? Angel race, from today onwards, I want to kill everyone I see!”<br/><br/>The Space Beast let out a furious roar.<br/><br/>Any living creature in the heaven opening primal continent, as long as they reached the universe ruler realm, would possess powerful intelligence.<br/><br/>Naturally, there was no problem for them to speak the language of the universe.<br/><br/>The three eyes of the space beast that were filled with killing intent stared at the 12-winged archangel with incomparable ferocity.<br/><br/>“HMPH, going against our Angel race, even if you are a space beast, you must die!”<br/><br/>The 12-winged archangel snorted with disdain.<br/><br/>In the next moment, the 12-winged archangel on his back flapped its wings and instantly appeared in the sky above the space beast.<br/><br/>The Tentacle of the space beast also moved in an instant. The entire world seemed to be completely enveloped.<br/><br/>Boom! Boom! Boom<br/><br/>At the next moment, a terrifying collision sound was heard.<br/><br/>He couldn’t see it anymore!<br/><br/>Wang Xian and all the experts around him couldn’t see the battle inside anymore. They could only feel waves of terrifying energy surging over.<br/><br/>“Their speed is too fast. My Eyes Can’t keep up at all.”<br/><br/>Wang Xian looked at the battle in front of him. His pupils contracted slightly and his face was filled with shock.<br/><br/>It was too fast.<br/><br/>When Baili Archangel flapped his long wings, Wang Xian could no longer catch his figure.<br/><br/>The gigantic space beast was also enveloped by the water and light energy.<br/><br/>They retreated backward repeatedly.<br/><br/>Even the Angel Army that was surrounding them immediately expanded their encirclement.<br/><br/>“How terrifying, they are so powerful!”<br/><br/>Lingling spoke beside Wang Xian’s ear as she trembled slightly.<br/><br/>“The treasure is right below them. You Don’t dare to snatch the treasure now, right?”<br/><br/>Wang Xian smiled and said to her.<br/><br/>“I don’t Dare!”<br/><br/>Lingling replied obediently.<br/><br/>Boom! Boom! Boom<br/><br/>The Rumble and battle continued in the middle. They were watching the vast battle from afar.<br/><br/>With Wang Xian’s current strength, he wouldn’t even be left with a speck of dust if he entered.<br/><br/>“This is too terrifying. Is this a battle between the Masters of the Universe?”<br/><br/>“I wonder who will win. This battle is too terrifying!”<br/><br/>“It should be archangel Baili who will win. After all, he is the Master of the Angel Race!”<br/><br/>In the surrounding area, all the experts were discussing.<br/><br/>The commotion of this battle could even be seen clearly in Heng Tian City.<br/><br/>Buzz<br/><br/>All of a sudden, everyone felt the sky brightening up.<br/><br/>A Bright Cross appeared in the sky.<br/><br/>The entire cross was emitting a dazzling light power.<br/><br/>When this cross appeared, the surrounding space seemed to have disappeared. There was only this cross in the world.<br/><br/>“What is this? An innate treasure?”<br/><br/>Wang Xian could feel an unusually terrifying aura from this cross.<br/><br/>This cross seemed to be able to judge everything.<br/><br/>“Innate supreme treasure, cross of Judgment!”<br/><br/>The Great Elf, Life Voice, who was standing quietly at the side of the battlefield, looked at the Cross of judgment with a solemn expression in his eyes.<br/><br/>Every innate supreme treasure was extremely precious.<br/><br/>It was extremely difficult for the masters of their universe to obtain it.<br/><br/>This required luck, Luck, and strength.<br/><br/>Just like now, the Space Beast had been waiting for the birth of the grade-12 water lotus for billions of years.<br/><br/>It wasn’t certain whether it could be obtained now.<br/><br/>The Cross of judgement appeared in the Void and descended directly, as if it could suppress everything.<br/><br/>“Bird Man of the Angel race, do you think I haven’t made any preparations in these billions of years? If you want to snatch the grade-12 water lotus, I’ll destroy it, but I won’t let you take it away, hahaha!”<br/><br/>“Twelfth-grade Water Lotus, Bloom!”<br/><br/>At this moment, a violent voice was heard from the center. The river of eternity below was trembling violently.<br/><br/>The river water started to change. In the huge area, the river water condensed into a lotus pattern.<br/><br/>The Lotus Rose and headed towards the Cross of judgment.<br/><br/>When everyone around saw this scene, they were shocked.<br/><br/>Wang Xian had a strange expression on his face.<br/><br/>“Me?”?<br/><br/>A gigantic space beast actually called himself “Me”?<br/><br/>This… The Universe was full of wonders.<br/><br/>“Beast, stop it. If you dare to destroy the foundation of a twelfth grade water lotus, I will definitely kill you today!”<br/><br/>Baili’s Archangel revealed an angry expression. The judgement cross in the sky accelerated and descended.<br/><br/>Following that, one by one, the angel wings gathered around them. Flapping their wings, they shot towards the center.<br/><br/>“Bang! Bang! Bang!”<br/><br/>The terrifying attack came again. On the surface of the river, Wang Xian could feel that the water had turned red.<br/><br/>The Space Beast was injured. From the looks of it, its injuries were not light!<br/><br/>“Beast, Scram immediately.”<br/><br/>Baili Archangel roared again, and a spear suddenly appeared above the judgement cross.<br/><br/>The surroundings of this spear were pitch black, as if it was in another dimension.<br/><br/>“You actually have an innate supreme treasure. You were prepared for this. Ahhhh!”<br/><br/>The Space Beast’s angry voice sounded.<br/><br/>“Holy Bone Spear, isn’t this the universe light Archangel’s innate supreme treasure? He actually took it. Looks like Baili was prepared for this.”<br/><br/>The great elf life sound arrow frowned slightly when she saw the holy bone spear come out.<br/><br/>She was at the same level as Baili Archangel, but he had the innate supreme treasure, judgement cross.<br/><br/>This was why she was wary of him.<br/><br/>As a peak race, he had an innate supreme treasure. If she fought him, she would definitely be at a disadvantage.<br/><br/>Now, he had another innate supreme treasure, holy bone spear.<br/><br/>“Maybe I can really kill this space beast.”<br/><br/>She muttered.<br/><br/>The Space Beast did not have a Cosmos God nation. It could also be said that their huge bodies were a cosmos God nation.<br/><br/>Hence, they did not immediately flee back to their God nation.<br/><br/>Facing the attack of the two innate supreme treasures, great archangel Bai Lie had a great chance to destroy them.<br/><br/>“Twelfth-grade water lotus, explode, rhythm of water, water from the sky!”<br/><br/>The Space Beast Roared.<br/><br/>“You’re courting death!”<br/><br/>Archangel Baili also roared furiously.<br/><br/>“Splash!”<br/><br/>The water from the sky that wasn’t supposed to fall fell down again.<br/><br/>The difference was that the water from the sky carried tens of thousands of tons and attacked Archangel Baili.<br/><br/>“Hahaha, you didn’t expect this, did you? I’ve been here for billions of years, and I’ve already made a huge connection with the twelfth grade water lotus. If you want to snatch it away, you’ll only be able to obtain a badly damaged twelfth grade water lotus.”<br/><br/>The Space Behemoth roared crazily.\t\t\t\t\t\t</div>", "images": {}, "success": true}