{"id": 454, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072809.html", "title": "Chapter 3445 - 3445 3444 Appeared Again To Rescue Them, The City Behind The Scenes", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3445 - 3445 3444 Appeared Again To Rescue Them, The City Behind The Scenes</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3445 3444 appeared again to rescue them, the city behind the scenes<br/><br/>“Roar! Roar! Roar!”<br/><br/>The Water Dragon and the Green Dragon Roared.<br/><br/>The leader of the Dragon Palace’s Water Dragon, Green Dragon Moon, and the rest roared and attacked the four of them directly.<br/><br/>The five elements millstone and the ninth-grade water lotus also released a terrifying power in an instant.<br/><br/>Wang Xian stood at the back and licked his lips. He flapped his incipient saint wings and disappeared instantly.<br/><br/>“Eh? Be careful!”<br/><br/>When the four of them saw Wang Xian disappear and sensed the position of the five elements millstone, they were shocked.<br/><br/>The four of them surrounded each other and quickly put up a strong defense.<br/><br/>“Attack!”<br/><br/>Wang Xian shouted loudly. His arm turned into a dragon claw and gray energy charged straight at them.<br/><br/>“Boom!”<br/><br/>“Boom!”<br/><br/>“Boom!”<br/><br/>The Green Dragon Moon, the Heaven Formation, the Water Dragon Leader and the five elements water grinding lotus exploded with energy and charged at them.<br/><br/>Looking at the incoming attack, the expressions of the four of them changed slightly again.<br/><br/>“Not good. Their attacks are extremely terrifying. Block them with all your might!”<br/><br/>The figure holding the staff roared with a face full of shock and anger.<br/><br/>Four against four. In their eyes, there was no danger at all.<br/><br/>Even if that fellow who had appeared had killed cave master shui, in their eyes, there were two other experts who had launched a sneak attack.<br/><br/>However, when they sensed this terrifying attack, they knew that it was not.<br/><br/>Regardless of whether it was the strange array master’s attack or the attack that was filled with the deathly silent energy disc, they all felt incomparably terrifying.<br/><br/>They would definitely not be able to resist this attack one on one.<br/><br/>“Go All Out!”<br/><br/>One of the figures wearing a light mask also roared crazily. One of his arms enlarged and blocked the area in front of him.<br/><br/>The hearts of the other three people pounded violently. They took out their strongest connate numinous treasure and acquired Supreme Treasure to block the attack.<br/><br/>“Brother Wang Xian is so strong. Is this his subordinate? He is also extremely powerful!”<br/><br/>Green Dragon Moon felt the attacks around him and his face was filled with joy.<br/><br/>Boom<br/><br/>A terrifying collision was heard. The energy in the entire sky was sent out in all directions.<br/><br/>“Eh? What? There seems to be a change in the battle in the sky. There are still experts on Green Dragon Moon’s side!”<br/><br/>“Green Dragon Moon has helpers. It seems that their ancestral dragon lineage has made preparations!”<br/><br/>“That’s great. There are still experts on our side. That’s Great!”<br/><br/>Shocked and exclamations came from below. They looked at the terrifying collision in the sky, and they were all extremely shaken.<br/><br/>This terrifying energy fluctuation made even the cave masters’Hearts palpitate.<br/><br/>“That new cave master is so powerful. Did Water Mage Cave master get killed, or did he escape?”<br/><br/>Several cave masters raised their heads to look. They couldn’t see clearly due to the distance.<br/><br/>However, they could feel that there were at least eight universe masters with first-level battle power in the sky.<br/><br/>“DAMN!”<br/><br/>An old man in front of a cave abode looked up at the sky, his eyebrows twitching.<br/><br/>His body trembled, and an identical figure separated from his body and disappeared in an instant.<br/><br/>Pu! Pu! Pu! Pu<br/><br/>At the same time, at the same place in the sky, four figures wearing light masks spat out blood. Their faces were filled with shock.<br/><br/>They had been severely injured by that terrifying attack!<br/><br/>Their opponents’attacks were extremely terrifying.<br/><br/>They felt as if they were not facing four universe ruler level one great beings, but ten, or even more.<br/><br/>“Undefeatable! The enemy’s array masters have already sealed off our space!”<br/><br/>The four of them looked at each other, and the figure holding the staff said with an unsightly expression.<br/><br/>“Break this sealing formation for us!”<br/><br/>One of the burly figures let out a low growl. His voice traveled far and wide.<br/><br/>“Huh?”<br/><br/>Wang Xian heard the growl and narrowed his eyes slightly.<br/><br/>“Kill!”<br/><br/>His figure flashed and instantly arrived at the side of the powerhouse holding the staff. He clawed out with his dragon claws.<br/><br/>“What speed. No Wonder Cave Master Shui was killed. His speed is comparable to a powerhouse with the combat strength of a level two universe dominator.”<br/><br/>The figure holding the staff had a drastic change in expression. He raised his innate spiritual treasure-level staff to block the attack.<br/><br/>Boom<br/><br/>A terrifying collision occurred once again. The figure holding the staff flew backward and spat out a large amount of blood again.<br/><br/>Wang Xian’s figure flashed and appeared on the other side of him in an instant.<br/><br/>“Save him!”<br/><br/>The other three people shouted immediately.<br/><br/>Streams of energy covered the surroundings of the expert holding the staff.<br/><br/>“Kill!”<br/><br/>Tian Cheng let out a low roar and waved his hand. One formation after another was instantly formed and attacked them.<br/><br/>The Azure Dragon Moon and the water dragon leader swayed their huge bodies as their dragon tails swept out.<br/><br/>The dragon tails formed from the condensed attributes blocked the heaven and earth.<br/><br/>“This won’t do. We’re not their match at all. Defend, Defend Again!”<br/><br/>The burly figure roared furiously.<br/><br/>“Quickly break through the array’s defenses, quickly!”<br/><br/>He continued to roar sternly, his eyes filled with anxiety and fear.<br/><br/>They were no match for them. They were completely no match for them.<br/><br/>If this dragged on any longer, they would be killed!<br/><br/>The four of them directly gathered back to back, propping up their defenses.<br/><br/>“Boom Boom!”<br/><br/>Another wave of attacks landed on their bodies.<br/><br/>The arms of the two men who raised their arms instantly disintegrated and dissipated.<br/><br/>“Continue to kill. I think there are more accomplices!”<br/><br/>Wang Xian let out a low roar and continued to attack.<br/><br/>“Boom!”<br/><br/>However, at this moment, a rumbling sound came from the rear.<br/><br/>“Dragon King, there are experts at level one of the Masters of the universe breaking the formation outside!”<br/><br/>The Heaven Formation swept over immediately and shouted in a deep voice.<br/><br/>“Hold them off!”<br/><br/>“Let’s make our move as soon as possible!”<br/><br/>Wang Xian shouted loudly and glanced at Azure Dragon Moon.<br/><br/>“Die!”<br/><br/>Azure Dragon Moon’s eyes were filled with rage.<br/><br/>To kill him this time, he actually sent out so many masters of level one of the universe.<br/><br/>If not for Wang Xian, he would definitely die today.<br/><br/>“Not good, Dragon King. The formation has been broken. The other party has an innate spiritual treasure.”<br/><br/>At this moment, the voice of the Heaven Formation was heard.<br/><br/>“Continue to kill them. Even if they are broken, they will not be able to escape!”<br/><br/>Lightning exploded on the uninitiated holy wings on Wang Xian’s back. They turned into lightning needles and attacked the four of them directly.<br/><br/>“Wings of the King of Angels, run!”<br/><br/>“Just you wait. Your ancestral dragon will be destroyed!”<br/><br/>At this moment, a bright wing suddenly rose in the middle of the four of them.<br/><br/>The light wing completely enveloped them.<br/><br/>Wang Xian’s lightning attack landed on the light wing and was immediately blocked.<br/><br/>The spear of obliteration from the five elements grinding landed on the light wing but was still unable to shake it.<br/><br/>“The defense of the Angel Race!”<br/><br/>When Green Dragon Moon saw the light wing that was used for defense, her expression was unusually ugly.<br/><br/>The fact that the other party had such a powerful light attribute life-saving treasure was enough to represent that even if the angel race did not participate in the fight, they were indirectly involved.<br/><br/>After all, this kind of defensive life-saving treasure was not so easy to obtain!<br/><br/>Under the cover of the Angel King’s wings, the four figures slowly disappeared.<br/><br/>They fled back to their own divine kingdom.<br/><br/>“Angel Race!”<br/><br/>Azure Dragon Moon looked at the body of the light wings and trembled, his expression extremely ugly.\t\t\t\t\t\t</div>", "images": {}, "success": true}