{"id": 458, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072817.html", "title": "Chapter 3449 - 3449 3448 Angel Army", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3449 - 3449 3448 Angel Army</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3449 3448 Angel Army<br/><br/>“The elites of the pinnacle races have appeared. In such a short period of time, there are actually two elites from the pinnacle races.”<br/><br/>“Those are the 12-winged angels. They are the true masters of the universe, the strongest existences in our universe!”<br/><br/>“Hiss, is that the elven race’s Lord? What a perfect existence. The Elven race’s arrow of life is the strongest archer in the universe, chasing after the sun and moon, hunting the heavens and earth!”<br/><br/>A shocked voice came from the surroundings. Everyone looked at the two figures that had appeared.<br/><br/>The water in the sky had already stopped flowing. It seemed to have encountered a terrifying resistance.<br/><br/>The two figures stood there quietly. It gave people the feeling that they were at the center of the world.<br/><br/>Holy, terrifying, and not to be looked at directly!<br/><br/>A wave of reverence rose in everyone’s hearts.<br/><br/>“That sister gives me a very intimate feeling.”<br/><br/>Lingling whispered into Wang Xian’s ear.<br/><br/>Wang Xian nodded his head slightly. “All of you belong to the same race.”<br/><br/>“Sound of life arrow, I want this water lotus. You Can’t compete with me.”<br/><br/>At this moment, the twelve-winged angel who was in the middle turned his head and looked at the Great Elf of the Arrow of life. He spoke faintly.<br/><br/>“Archangel Baili, how would we know if we don’t try? Besides, this guardian has been here for billions of years. How could he let you take him away?”<br/><br/>The Great Elf of the arrow of life said calmly.<br/><br/>The arrow of the Arrow of life was the name of this great elf.<br/><br/>Once the Elf clan stepped into the universe ruler realm, they would take life as their surname.<br/><br/>“If he doesn’t let me, I’ll kill him.”<br/><br/>Baili’s Archangel said confidently.<br/><br/>He swept his gaze around and waved his arm.<br/><br/>“Hong Hong Hong!”<br/><br/>The next moment, a large number of angels appeared around him.<br/><br/>There were six-winged angels, eight-winged angels, and ten-winged angels.<br/><br/>There were over a million of them, and there were over a hundred powerful ten-winged angels among them!<br/><br/>“Hiss, this is the Angel Army, a powerful Angel Army!”<br/><br/>“This… This is the power of a 12-winged archangel? This is too terrifying!”<br/><br/>Everyone looked at the army of over a million angels, their faces filled with fear.<br/><br/>That terrifying aura made them shiver.<br/><br/>The six-winged angels were the weakest, but they had at least the power of a universe knight at Level 7, and they were strong enough to reach level 8.<br/><br/>The hundreds of ten-winged angels all had universe master level two or even level three power.<br/><br/>This was a terrifying being at the universe master level of a pinnacle race.<br/><br/>With a wave of his hand, he had a million legions.<br/><br/>However, this was also related to the characteristics of the angel race. The battle angels of the Angel race were war machines.<br/><br/>They were similar to the skeleton race, a pinnacle race.<br/><br/>The Dominators of the skeleton race even had an even larger army.<br/><br/>“Seal off the surrounding area. Kill anyone who comes near!”<br/><br/>Archangel Baili ordered faintly.<br/><br/>“It’s Archangel Baili!”<br/><br/>All the Angels immediately responded. Under the lead of over a hundred ten-winged angels, they flew to the surrounding area and formed an incomparably large encirclement.<br/><br/>Some of the experts around hurriedly retreated. Their eyes were filled with shock.<br/><br/>“Is this an existence at the level of a universe overlord?”<br/><br/>Some of the experts muttered.<br/><br/>Wang Xian’s gaze was similarly shining.<br/><br/>At their peak, those dragon kings who were at the level of a universe overlord also possessed such might.<br/><br/>They walked across the starry sky, made way for the ocean, and were supported by countless experts from the Dragon Palace!<br/><br/>“Don’t attack when I kill this guy.”<br/><br/>Archangel Baili looked at this expert of the ELF race and said lightly.<br/><br/>Life sound arrow frowned slightly, and his bright eyes seemed to be able to see through the ground.<br/><br/>“How about you try it with it, and then I’ll attack.”<br/><br/>Archangel baili smiled and said confidently.<br/><br/>“If you can suppress it, I won’t do it. If not, don’t blame me.”<br/><br/>The Voice of life replied indifferently.<br/><br/>“Alright, Remember.”<br/><br/>The archangel nodded.<br/><br/>The rules set by the strong were usually not broken.<br/><br/>And as a race at the pinnacle of the universe, they would not rashly clash.<br/><br/>The archangel stared below and with a move of his hand, an Archangel’s sword and shield appeared in his hand.<br/><br/>“Will you hand over the water lotus to me, or shall I suppress you?”<br/><br/>Archangel baili stared at the ground below and said coldly.<br/><br/>“Roar Roar!”<br/><br/>The next moment, an angry roar came from below. Following that, an incomparably terrifying tentacle drilled out from the water and attacked him.<br/><br/>The entire tentacle was incomparably huge and emitted a terrifying aura.<br/><br/>“Holy Light Slash!”<br/><br/>Baili’s Archangel wielded his angel Greatsword and slashed towards the tentacle.<br/><br/>“Boom!”<br/><br/>An incomparably resplendent light illuminated the starry sky. The Holy Light Longsword directly slashed at the tentacle.<br/><br/>“Pu!”<br/><br/>The Holy Light Slash entered the tentacle and a large amount of blood flowed out.<br/><br/>“Anyone who wants to fight for my treasure must die.”<br/><br/>At this moment, a sharp female voice came from below. Several hundred terrifying tentacles rushed over from the bottom of the river once again.<br/><br/>Water droplets rushed towards the sky.<br/><br/>Each water droplet was as heavy as a vast mountain peak as they attacked the Archangel.<br/><br/>“Peng Peng Peng!”<br/><br/>The Archangel raised his shield, and the water droplets made a loud sound as they fell on it.<br/><br/>“Light Judgement Sword!”<br/><br/>He waved his arm, and the longsword in his hand stabbed downwards.<br/><br/>The entire longsword seemed to instantly become a hundred times bigger as it descended from the sky.<br/><br/>“Boom!”<br/><br/>At the location below, a terrifying whirlpool formed, directly absorbing the longsword.<br/><br/>Following that, the whirlpool charged out directly, sweeping towards the Archangel Baili.<br/><br/>“You’re courting death, you’re so stubborn!”<br/><br/>“Angel Country, Angel Battle Hymn, Kill!”<br/><br/>His entire body trembled, and the wings on his body slightly spread out. Numerous angel Phantoms condensed, directly attacking downwards.<br/><br/>The whirlpool quickly collapsed.<br/><br/>“Roar! Roar! Roar!”<br/><br/>At this moment, an incomparably large body was revealed on the surface of the water.<br/><br/>The incomparably large astral beast was over 10,000 kilometers in size, and its tentacles were terrifyingly long.<br/><br/>It could extend over a hundred million kilometers.<br/><br/>This astral beast was hundreds of times the size of a planet.<br/><br/>It waved its tentacles, and the densely packed tentacles attacked the Baili Archangel.<br/><br/>“Kingdom of Heaven, Move!”<br/><br/>A shadow of the Kingdom of angels appeared behind him, and a beam of white light shot toward the tentacles.<br/><br/>Boom! Boom! Boom<br/><br/>The extremely terrifying collision was heard once again.<br/><br/>Wang Xian and the rest moved and retreated into the distance. He looked at the battle in front of him in astonishment.<br/><br/>Was this the strength of a true master of the Universe?<br/><br/>The aftermath made them tremble.<br/><br/>“Get out of my territory. Otherwise, I will make you pay a terrible price!”<br/><br/>The Voice of the Space Beast rang out again. Dense tentacles blotted out the sky and covered the Sun.<br/><br/>It was extremely violent!\t\t\t\t\t\t</div>", "images": {}, "success": true}