{"id": 453, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072807.html", "title": "Chapter 3444 - 3444 3443. Under The Cave Master Of Killing Water Mage", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3444 - 3444 3443. Under The Cave Master Of Killing Water Mage</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3444 3443. Under the cave master of Killing Water Mage<br/><br/>The ninth-grade water lotus was floating around.<br/><br/>What was the concept of four ninth-grade water lotus?<br/><br/>Even Wang Xian found it difficult to control them.<br/><br/>This required the five elements grinding at the side to strengthen them.<br/><br/>It was not good for a person to have as many treasures as possible, especially for a treasure of a very high level like the water lotus.<br/><br/>Some weapons such as ordinary innate spiritual treasures required a person to control them.<br/><br/>An expert was not able to control countless treasures without limits.<br/><br/>He had to control them with energy.<br/><br/>This was different from the Five Elements Millstone. The Five Elements Millstone was formed by Wang Xian’s dragon blood by chance. The Dragon Soul was equivalent to a clone, and the clone controlled the Five Elements Millstone.<br/><br/>Treasures like this were extremely rare.<br/><br/>A ninth-grade lotus flower was very powerful, but it was extremely difficult to control four ninth-grade lotus flowers.<br/><br/>However, Wang Xian could do it!<br/><br/>“Lotus flowers, Bloom. Petals, kill!”<br/><br/>The four ninth-grade lotus flowers spun and bloomed one by one, heading straight for the cave master.<br/><br/>“No, how did you get so many water lotuses?”<br/><br/>The cave master trembled violently when he saw the beautiful water lotuses that were filled with killing intent.<br/><br/>He had been here for so long and had only obtained one ninth-grade water lotus.<br/><br/>This fellow actually had a total of four!<br/><br/>Four ninth grade water lotus was equivalent to more than ten connate numinous treasures!<br/><br/>These dozen or so connate numinous treasures were smashed over under the control of great power, and one could imagine their power.<br/><br/>Not to mention, there was an even more terrifying five elements millstone in the surroundings.<br/><br/>The Flames of the five elements millstone covered the surroundings, melting the water energy in the entire space.<br/><br/>Cave master water mage suffered a terrifying attack.<br/><br/>“Boom! Boom! Boom!”<br/><br/>One flower petal after another landed on his body, causing the body of the water energy to begin to collapse.<br/><br/>His body was in an unusual condition. It was as if he had cultivated a pool of water to such an extent. It was very mystical.<br/><br/>However, when the Water Lotus’attack landed on his body, he could sense that the life force of cave master water mage was quickly disappearing.<br/><br/>“Eh, that’s not right. Although the attack of the ninth-grade water lotus can dissolve his life force, it doesn’t seem to be able to do so. Is it because of his peculiar body?”<br/><br/>Wang Xian mumbled. His body trembled and his entire body seemed to be covered by soil.<br/><br/>The five elements millstone started to reverse and transferred the fire energy to the earth energy.<br/><br/>It was really a counteraction of the attributes. It was still the earth that counteracted the water!<br/><br/>“Time sand, cover!”<br/><br/>Wang Xian growled in a low voice. Countless Earth attribute energies transformed into sand and flooded forward.<br/><br/>“How did you get so many attributes?”<br/><br/>The water cave master widened his eyes and was filled with disbelief. The body of the water current was trembling violently.<br/><br/>“Die!”<br/><br/>Wang Xian’s face turned cold as the sand current completely covered it.<br/><br/>“Retrieve!”<br/><br/>The five elements millstone was suspended in the air above the cave master of the Water Mage Cave. The bodies that were wrapped in mud entered the five elements millstone.<br/><br/>“It’s indeed a very special creature!”<br/><br/>A smile appeared on Wang Xian’s face. With a wave of his arm, he kept the body of the cave master of the water mage cave into his bag.<br/><br/>The body of the cave master of the Water Mage Cave was a silver-white stream of water. Even after his death, it still contained a huge amount of energy.<br/><br/>“This body is really special. It can be refined into a weapon and can also be absorbed. It can also allow the water lotus to absorb and improve.”<br/><br/>Wang Xian mumbled as his eyes sparkled.<br/><br/>He put it away and looked towards the sky.<br/><br/>Four powerhouses at the first level of the universe dominator were surrounding and killing Azure Dragon Moon. They were engaged in a fierce battle.<br/><br/>The sudden end of the battle on Wang Xian’s side seemed to have attracted their attention.<br/><br/>“Eh? How is this possible? The life force of aquamancer has disappeared!”<br/><br/>The four of them looked in their direction. Their eyes were sparkling.<br/><br/>“Attack!”<br/><br/>At this moment, Wang Xian dashed out directly.<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>He shouted loudly. At the same time, a roar and a terrifying energy ravaged the surroundings.<br/><br/>A water god Dragon rushed out from below. It swayed its huge body and came to their side.<br/><br/>Soon after, the entire sky seemed to be covered by a cloth and was separated into a special dark space.<br/><br/>The array completely covered this space.<br/><br/>“What? There’s an ambush!”<br/><br/>“Oh no, there are experts from the ancestral dragon bloodline here!”<br/><br/>When the four experts saw this scene, their expressions changed slightly.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Wang Xian flew over and instantly arrived at the right side of them.<br/><br/>Below them, an lie also flew over slowly and arrived at the other side.<br/><br/>“Three. There are still three experts from your ancestral dragon lineage here. It seems like we have really underestimated you!”<br/><br/>The figure holding a staff in the middle swept his gaze across the surrounding Wang Xian Heaven Formation’s water dragon leaders. His eyes were filled with coldness.<br/><br/>“Hehe, we are not from the ancestral dragon lineage. We just don’t like you guys!”<br/><br/>Wang Xian said plainly and looked at Green Dragon Moon. “Brother Green Dragon Moon, Are You Alright?”<br/><br/>“Thank you for your help, Brother.”<br/><br/>Green Dragon Moon looked at the leaders of the Heaven Formation and water dragons with a hint of shock.<br/><br/>He did not expect Wang Xian to have two such experts on his side.<br/><br/>Together with Wang Xian, they weren’t afraid at all in a four-on-four situation. In fact, they were even able to gain the upper hand.<br/><br/>“Someone who isn’t from the ancestral dragon lineage dares to get involved in this mess. You really don’t know what’s good for you!”<br/><br/>A figure wearing a white mask glared at Wang Xian and the rest.<br/><br/>“Hehe, you guys aren’t from the Holy Dragon lineage either. Since all of you dare to get involved, why wouldn’t I?”<br/><br/>Wang Xian narrowed his eyes slightly. “Furthermore, all of you will die today.”<br/><br/>“Arrogant. If I can’t destroy all of you this time, I will be able to destroy all of you the next time!”<br/><br/>The old voice spoke again as they scanned their surroundings.<br/><br/>“HMPH, let’s Go!”<br/><br/>After he finished speaking, he held his staff and flew straight to the back.<br/><br/>Crash<br/><br/>When Wang Xian saw that they were about to leave, he flapped his incipient saint wings and revealed a faint smile on his face.<br/><br/>“How can we leave so easily?”<br/><br/>As he spoke, his figure had already arrived behind them.<br/><br/>“HMM?”<br/><br/>The four powerhouses who were wearing light masks were stunned for a moment. Their eyes revealed a sinister look.<br/><br/>“You are really arrogant. Do you think you can keep us here?”<br/><br/>A figure said coldly.<br/><br/>“Then, you can give it a try?”<br/><br/>Wang Xian smiled and slowly raised his palm. He held the five elemental grindstone in one hand and the ninth-grade water attribute Lotus in the other!<br/><br/>“Brother Qing longyue, let’s destroy them today. Don’t let them escape!”<br/><br/>He shouted softly and threw out the water lotus and the five elemental grindstone. His arm turned into a dragon claw and grabbed at the four powerhouses.<br/><br/>“Hahaha, good!”<br/><br/>Green Dragon Moon’s eyes sparkled when he saw that Wang Xian wanted to keep them here.<br/><br/>He laughed out loud and swung his huge body, sweeping out his dragon tail.<br/><br/>“Are you courting death? Do you really think that we are easy to deal with? So what if you are Divine Dragons!”<br/><br/>The four powerhouses were furious as they roared.\t\t\t\t\t\t</div>", "images": {}, "success": true}