{"id": 451, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072803.html", "title": "Chapter 3442 - 3442 3441 Azure Dragon Moon Was Besieged!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3442 - 3442 3441 Azure Dragon Moon Was Besieged!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3442 3441 Azure Dragon Moon was besieged!<br/><br/>“The situation of the disciples of the ancestral dragon lineage is not looking good!”<br/><br/>Wang Xian returned to his cave abode and mumbled as he checked the various information on the universe’s AI.<br/><br/>As the Holy Dragon lineage had the backing of the Angel clan, they were able to issue a reward to the Hundred Cities Alliance.<br/><br/>Once the reward was issued, there would be people who would be tempted to kill the disciples of the ancestral dragon lineage in exchange for the reward.<br/><br/>This was extremely dangerous for the disciples of the ancestral dragon lineage.<br/><br/>“However, the situation has not gone out of control yet.”<br/><br/>Wang Xian mumbled to himself as he cultivated in the cave abode.<br/><br/>“Dragon King, there’s something wrong with the atmosphere outside!”<br/><br/>Two months later, an lie sent over a third-grade water lotus and suddenly said to Wang Xian.<br/><br/>“HMM? Something’s wrong? What’s Wrong?”<br/><br/>Wang Xian was slightly taken aback.<br/><br/>“The atmosphere is a little tense and the number of people around has obviously decreased. Everyone is discussing the hundred cities alliance and the ancestral dragon lineage.”<br/><br/>An lie spoke.<br/><br/>Wang Xian’s eyes flickered slightly. He opened the universal AI and continued to check the information.<br/><br/>When he saw a content, he raised his eyebrows slightly.<br/><br/>In the Hundred Cities Alliance, there were experts from two cities who besieged and killed an expert from the ancestral dragon lineage.<br/><br/>“HMM? Why are they attacking the experts from the ancestral dragon lineage? The overall strength of the ancestral dragon lineage is much stronger than the entire hundred cities alliance. Aren’t they afraid of retaliation when they attack the experts from the ancestral dragon lineage?”<br/><br/>Wang Xian revealed a deep look of doubt.<br/><br/>The ancestral dragon lineage was not weak. Their leader was also known as the number one person under the ruler of the universe.<br/><br/>The strength of the Hundred Cities Alliance could not withstand the retaliation of the ancestral dragon lineage, let alone two cities.<br/><br/>“Is there an inside story or something?”<br/><br/>Wang Xian frowned and flew out.<br/><br/>There were obviously fewer people outside. However, there were many disciples of the ancestral dragon lineage around.<br/><br/>Clearly, some of the disciples were here to seek refuge with the Azure Dragon Moon.<br/><br/>Wang Xian narrowed his eyes slightly and leaned against the side of the cave abode to watch quietly.<br/><br/>Perhaps it was because there were more disciples of the ancestral dragon lineage that appeared here, causing the atmosphere here to be a little tense.<br/><br/>This was especially so after the experts of the hundred cities alliance had surrounded and killed a level one master of the ancestral dragon lineage.<br/><br/>No one knew if they would come and attack the Green Dragon Moon.<br/><br/>It was well-known that the ancestral dragon lineage had an green dragon here.<br/><br/>Wang Xian was deep in thought.<br/><br/>Could it be that the angel race was involved?<br/><br/>Otherwise, why would the Hundred Cities Alliance Dare to get involved?<br/><br/>Wang Xian shook his head and entered the cave abode. He took a look at the water lotus on the ancestral tree and smiled.<br/><br/>There were a total of four ninth-grade water lotus flowers.<br/><br/>However, other than the area where the water from the sky fell, most of the other places had been searched by an lie.<br/><br/>Boom! Boom! Boom<br/><br/>“You guys are courting death! Roar! Roar!”<br/><br/>Half a month later, a loud roar was suddenly heard.<br/><br/>It was accompanied by the roar of a dragon.<br/><br/>When Wang Xian heard the roar, his body moved and he immediately flew out.<br/><br/>“Sky Formation, leader of the water dragons, come out!”<br/><br/>At the same time, he shouted softly and two figures immediately followed behind him.<br/><br/>Shui Linglong’s father had already arrived after his breakthrough.<br/><br/>Wang Xian flew out of the cave abode and looked outside.<br/><br/>“Roar! Roar! Roar!”<br/><br/>At the location outside, four figures were wearing a bright mask on their heads. The mask was emitting light and completely covered their figures.<br/><br/>The four figures surrounded the green dragon moon in the middle.<br/><br/>The Green Dragon Moon transformed into human form and scanned the four people around him with a cold gaze.<br/><br/>“You are from the Hundred Cities Alliance? Which City are you from? Do you know that you are seeking your own destruction? !”<br/><br/>Azure Dragon Moon stared at them, his face filled with rage.<br/><br/>“We are not from the Hundred Cities Alliance. Hehe, Azure Dragon Moon, you don’t have to threaten us. Your Ancestral Dragon bloodline is doomed. Today is the Day You Die!”<br/><br/>A figure among the four of them said coldly.<br/><br/>“Haha, You Want To Kill Me? With just the four of you?”<br/><br/>Azure Dragon Moon laughed out loud and swayed his dragon body. The wood attribute energy on his body swept out in all directions.<br/><br/>“Everyone, large-scale battles are prohibited in Lotus Peak. Please head to the sky as well. Otherwise, don’t blame us for being impolite. Azure Dragon Moon, you know the rules here.”<br/><br/>At this moment, Cave Masters appeared one by one in the cave abodes. There were twelve cave masters. Apart from Wang Xian and the rest, six City Masters walked out.<br/><br/>They gave a faint warning look.<br/><br/>“We all know the rules. Keke Keke, Azure Dragon Moon, I have already locked onto you. Even if you escape to your own divine kingdom, we will be able to find you very quickly. Surrender and die!”<br/><br/>An old voice said faintly. They had obviously come prepared.<br/><br/>Azure Dragon Moon’s gaze was extremely cold as he looked downwards.<br/><br/>Below, there were over a thousand disciples of the Divine Dragon Bloodline.<br/><br/>“Among you, there are disciples of the Divine Dragon bloodline and traitors!”<br/><br/>He said coldly.<br/><br/>With Azure Dragon Moon’s strength, under such a situation of the ancestral dragon bloodline, he could not possibly not make some preparations.<br/><br/>For example, if an expert were to come, he could directly lead his disciples away.<br/><br/>Now that the other party suddenly charged over, not only did he not sense it at all, even the array formation he had set up in the cave residence was temporarily ineffective.<br/><br/>Therefore, among them, there was someone from the other party.<br/><br/>“Who did it? Who Did It?”<br/><br/>“Damn it, there’s actually a traitor among us.”<br/><br/>The thousands of disciples of the ancestral dragon lineage looked at each other. Each and every one of them looked extremely embarrassed.<br/><br/>Wang Xian looked over and frowned slightly.<br/><br/>The dissolution of the ancestral dragon lineage had its pros and cons. Tens of millions of years had passed. Some of the members were still loyal to their leader and the ancestral dragon lineage.<br/><br/>However, there were also some who had been subdued by the Holy Dragon lineage and were hiding in the crowd.<br/><br/>“It seems like the war between the ancestral dragon and the Holy Dragon has been planned for a long time.”<br/><br/>Wang Xian thought to himself.<br/><br/>The problem with Azure Dragon Moon was not only due to the teleportation formation. It was possible that his aura had been locked onto by the other party.<br/><br/>Among the other party, there was a great wizard.<br/><br/>“Come up, Azure Dragon Moon. You Won’t be able to escape!”<br/><br/>The masked man flew straight up into the sky and said mockingly to Azure Dragon Moon.<br/><br/>“Ho ho ho, hahaha, I’m not the one who said this, but if you want to kill me, at least two or three of you will die!”<br/><br/>Azure Dragon Moon roared and flew up into the sky.<br/><br/>The other three masked figures around him attacked him directly.<br/><br/>The other party had come prepared for the hunting battle. He would not show any mercy.<br/><br/>“Dragon King, we…”<br/><br/>The Heaven Array looked at the battle that broke out in the sky and transmitted his voice to Wang Xian.<br/><br/>“All of you go and make preparations.”<br/><br/>Wang Xian’s eyes flickered as he gave the order.<br/><br/>“Whoosh!”<br/><br/>At this moment, Wang Xian sensed a figure moving.<br/><br/>The figure headed straight for the group of ancestral dragon disciples in front of the Azure Dragon Lunar Wonderland.<br/><br/>“Huh?”<br/><br/>When Wang Xian saw the figure who suddenly attacked, his gaze froze!\t\t\t\t\t\t</div>", "images": {}, "success": true}