{"id": 455, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072811.html", "title": "Chapter 3446 - 3446 3,445, Four Major Cities", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3446 - 3446 3,445, Four Major Cities</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3446 3,445, four major cities<br/><br/>In the sky above the lotus peak, the energy dissipated. Wang Xian and the rest were floating around.<br/><br/>The four figures wearing light masks had already disappeared. Wang Xian raised his eyebrows slightly.<br/><br/>This time around, there were a total of six level one masters of the universe who came to kill Green Dragon Moon.<br/><br/>On the surface, there were four people, but in the dark, there were two people. This was not a small scene.<br/><br/>They were going to kill Azure Dragon Moon completely!<br/><br/>If it wasn’t for him making a move, Azure Dragon Moon would probably be in deep trouble this time.<br/><br/>“Thank you, brother Wang Xian, for saving us!”<br/><br/>Azure Dragon Moon’s expression changed. He looked at Wang Xian and bowed respectfully.<br/><br/>“You’re welcome.”<br/><br/>Wang Xian smiled and replied, “Brother Azure Dragon Moon, you have to be careful in the future. The opponent is very strong.”<br/><br/>“There are cities from the Hundred Cities Alliance making a move. Furthermore, there are more cities making a move than we expected!”<br/><br/>Green Dragon Moon said with an embarrassed expression, “Moreover, the Angel clan has also taken action indirectly. They want to destroy our ancestral dragon lineage.”<br/><br/>“Brother Green Dragon Moon, what do you want to do now?”<br/><br/>He opened his mouth and asked.<br/><br/>The experts from the ancestral dragon lineage should have started to take action. It was not appropriate for him to get involved in such matters.<br/><br/>“I will contact the other experts from the ancestral dragon lineage and find out which city took action against us. Brother Wang Xian, you have to be careful. The other party might implicate you in the future.”<br/><br/>Qing longyue reminded.<br/><br/>“Don’t Worry!”<br/><br/>Wang Xian replied with a smile.<br/><br/>“I’ll go and settle some matters first. I, Qing longyue, will definitely repay you for today’s kindness.”<br/><br/>Qing longyue cupped his hands and flew down.<br/><br/>Wang Xian nodded his head and gestured to the Heaven Formation before returning to his residence.<br/><br/>In front of the cave abodes on Lotus Peak, all the figures were looking at Wang Xian and the rest with fear.<br/><br/>Just now, the strength that Wang Xian and the rest displayed shocked them.<br/><br/>Three powerhouses at the first level of the universe dominator. Their strength was already very terrifying.<br/><br/>Some of the powerful cities and high-level races were only so-so.<br/><br/>Furthermore, they guessed that it was very likely that the cave master of water mage had already died in their hands.<br/><br/>Wang Xian landed in front of the cave abodes and glanced at the Green Dragon Moon.<br/><br/>His gaze swept across all the disciples and his expression was a little gloomy.<br/><br/>There were traitors among them.<br/><br/>He led everyone into the cave abode.<br/><br/>Wang Xian’s gaze swept over as his eyes sparkled.<br/><br/>“All of you should enter the cave abode first. Be careful and be safe. I have something to take care of.”<br/><br/>He spoke to the leader of the water dragons in the sky formation. The incipient Saint Wings fluttered and disappeared in an instant.<br/><br/>Arriving at a place where no one was around, he opened his palm. A bolt of lightning condensed and flew in a certain direction.<br/><br/>Searching for enemies in the Void was one of the abilities of the incipient saint wings.<br/><br/>During the battle just now, Wang Xian’s lightning attacks had already penetrated into their bodies.<br/><br/>The four of them had been attacked twice consecutively and were severely injured. There was also quite a lot of lightning power in their bodies.<br/><br/>Unless they had powerful treasures, they would not be able to get rid of all of them in a short period of time.<br/><br/>However, to be on the safe side, he immediately summoned an lie over.<br/><br/>He asked an lie to teleport quickly in a certain direction and brought him over.<br/><br/>An lie arrived and teleported in the direction of the Lightning for more than ten minutes. Then, he returned to bring Wang Xian over.<br/><br/>“This direction, is it Tianheng City? Is Tianheng city involved in this?”<br/><br/>Wang Xian looked at the direction pointed out by the Thunder and frowned slightly. He asked an lie to teleport in the direction of Tianheng City.<br/><br/>After more than ten minutes, Wang Xian arrived at Tianheng City. He looked at the sensing of the Thunder and raised his eyebrows slightly.<br/><br/>“Tianheng city is really involved in this.”<br/><br/>He thought to himself as he continued to use the lightning to sense.<br/><br/>There were four experts wearing masks of light. Among them, there were three who were confirmed to be experts from Tian Heng City.<br/><br/>Looking at the defensive line guided by the Lightning, Wang Xian opened the map and took a look.<br/><br/>There were many cities of the Alliance of 100 cities in that direction. He went straight to the teleportation formation of Tian Heng City.<br/><br/>The Alliance of 100 cities naturally had a teleportation formation between them. Wang Xian could rush over quickly through the teleportation formation.<br/><br/>Following that, after more than an hour of teleportation and searching, he had locked onto four cities.<br/><br/>“Tian Heng City, Great Marquis City, Light Dragon City, and Sun City.”<br/><br/>In these four cities, Wang Xian could sense the power of lightning.<br/><br/>In other words, he could confirm that these four cities were involved.<br/><br/>“On the surface, Tian Heng City only has one level one master of the universe. They should be hiding something. On the surface, Great Marquis city has two.”<br/><br/>Wang Xian mumbled to himself. He asked the Heaven Array to set up a devil spirit altar.<br/><br/>Under the lead of an lie, he returned to the cave abode of Lotus Peak in an instant.<br/><br/>Sometimes, an lie would use it to travel. It was really convenient.<br/><br/>Wang Xian returned from the cave abode. After hesitating for a moment, he came to the front of the cave abode. His gaze swept across Tianheng cave abode.<br/><br/>Tianheng cave abode was occupied by Tianheng City.<br/><br/>“Forget it. Inform brother Qinglongyue about this matter. I Won’t get involved in other matters for the time being.”<br/><br/>Wang Xian mumbled to himself. He took out the universal AI and sent a message to qinglongyue.<br/><br/>It allowed him to focus on investigating these four cities.<br/><br/>Buzz Buzz<br/><br/>At this moment, Wang Xian’s universal ai trembled. He opened it and saw that it was a message from Prime Minister Gui.<br/><br/>Prime Minister Gui wanted to deploy an lie. Many disciples from the Dragon Palace had been killed and they needed to be saved.<br/><br/>“Killed?”<br/><br/>He raised his eyebrows but didn’t pay too much attention to it. It was normal for people to be killed inside.<br/><br/>“Dragon King!”<br/><br/>At this moment, Heaven Formation walked over from the side.<br/><br/>“Dragon King, I have a subordinate who sent news that someone is hunting them in a place inside the heaven opening primordial land. They are hunting people with the Divine Dragon Bloodline.”<br/><br/>Heaven array walked over and suddenly spoke.<br/><br/>“Are the Dragon Wizards being hunted?”<br/><br/>Wang Xian raised his eyebrows and asked.<br/><br/>“Yes, Dragon King. I’ve checked just now. It’s not just the Dragon Wizards. The other dragon species have also encountered such a situation, especially in the vicinity of the Hundred Cities Alliance. Regardless of whether they are the disciples of the ancestral dragon or not, as long as they have the bloodline of the Divine Dragon, they will kill them directly.”<br/><br/>“I can find some information on the universal AI.”<br/><br/>As he spoke, Wang Xian frowned slightly.<br/><br/>“That shouldn’t be the case, right?”<br/><br/>He took out the universal AI and did some research.<br/><br/>“The creatures of the divine dragon lineage near the Hundred Cities Alliance have been hunted!”<br/><br/>“In the heaven-splitting chaotic land, the divine dragon lineage and some bounty hunters are hunting the creatures of the divine dragon lineage.”<br/><br/>“The war between the Holy Dragon lineage and the ancestral dragon lineage has completely erupted? The most terrifying internal strife of the Holy Dragon lineage? As long as they are of the Holy Dragon lineage, they can exchange for the bounty after killing them!”<br/><br/>Very soon, he received one piece of information after another.<br/><br/>Wang Xian looked at the information, and his eyes sparkled.<br/><br/>“They would rather kill the wrong person than let it go? Or is there some other conspiracy? As long as they are of the Holy Dragon lineage, they can obtain the bounty after killing them?”<br/><br/>Wang Xian frowned slightly.<br/><br/>However, Wang Xian could understand a little. The war between the bloodline of the Holy Dragon and the bloodline of the ancestral dragon had broken out in an all-out manner. Within the bloodline of the Divine Dragon, other than the bloodline of the Holy Dragon and the ancestral dragon, the rest were just small fry.<br/><br/>It didn’t matter even if he killed the wrong person. After all, it was less than one percent of the ancestral dragon’s bloodline.\t\t\t\t\t\t</div>", "images": {}, "success": true}