{"id": 450, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072801.html", "title": "Chapter 3441 - 3441 3440 Ancestral Dragon Bloodlines With A Bounty On Their Heads", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3441 - 3441 3440 Ancestral Dragon Bloodlines With A Bounty On Their Heads</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3441 3440 ancestral dragon bloodlines with a bounty on their heads<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>The instant the Azure Dragon Moon rushed out, the expressions of the pursuing figures changed drastically. Their figures began to turn illusory as they immediately fled.<br/><br/>Even though the Azure Dragon Moon was very powerful, the distance between them was too far, causing them to flee.<br/><br/>This caused his expression to be abnormally ugly.<br/><br/>His body moved, and his dragon claws caught the body of the ancestral dragon bloodline disciple. He inspected it for a moment, and a regretful expression appeared on his face.<br/><br/>“Sir, our companion…”<br/><br/>The other four ancestral dragon’s disciples flew over and looked over with unsightly expressions.<br/><br/>Their hearts sank and they couldn’t help but ask.<br/><br/>“He died.”<br/><br/>Azure Dragon Moon’s gaze was ice-cold as he spoke.<br/><br/>“Sir, the experts of the sacred dragon’s lineage are now wantonly hunting down our ancestral dragon’s disciples. Moreover, a few days ago, the Hundred Cities Alliance issued a bounty for our ancestral dragon’s disciples. As long as they kill our ancestral dragon’s disciples, they will be able to obtain a lot of rewards.”<br/><br/>“Sir, what… What should we do now?”<br/><br/>A disciple of the ancestral dragon lineage could not help but kneel in front of him as he spoke with a face full of anger.<br/><br/>“The bounty of the Hundred Cities Alliance?”<br/><br/>Green Dragon Moon’s expression changed slightly as a hint of anger appeared in his eyes.<br/><br/>“All of you, follow me into the cave abode!”<br/><br/>As he spoke, his body moved and brought the corpse into the cave abode.<br/><br/>The other four disciples of the ancestral dragon lineage immediately followed.<br/><br/>Wang Xian looked over and frowned slightly.<br/><br/>He opened the universal AI and searched for the reward token of the Hundred Cities Alliance.<br/><br/>The so-called reward token of the Hundred Cities Alliance was not a reward issued by the Hundred Cities Alliance to deal with the ancestral dragon lineage.<br/><br/>Instead, it was a reward issued by someone else and appeared in the Mission Hall of the Hundred Cities Alliance.<br/><br/>Under normal circumstances, the Hundred Cities Alliance wouldn’t do such a thing.<br/><br/>Especially for a powerful force like the ancestral dragon bloodline.<br/><br/>But this time, the bounty appeared in the Hundred Cities Alliance for many reasons.<br/><br/>And the force that issued the bounty didn’t hide anything, the Holy Dragon Bloodline.<br/><br/>The Ancestral Dragon Bloodline, the Holy Dragon Bloodline, the most powerful Holy Dragon bloodline within the Heaven opening primal continent.<br/><br/>One of the leaders was extremely powerful and was only one step away from becoming the ruler of the universe.<br/><br/>The other one was not weak either and had even become a subsidiary race of the Angel Race.<br/><br/>The collision between these two races was definitely extremely terrifying.<br/><br/>“The Holy Dragon lineage actually fought with the ancestral dragon lineage? What is the reason?”<br/><br/>“Why did the Hundred Cities Alliance agree to the Holy Dragon lineage issue a reward? Is it for profit or is it because of the Angel Race?”<br/><br/>Wang Xian’s eyes flickered as he read the message.<br/><br/>This was a huge matter.<br/><br/>Wang Xian hesitated for a moment before flying to the front of the Azure Dragon lunar abode.<br/><br/>“Wang Xian is here to pay a visit!”<br/><br/>He shouted directly at the door.<br/><br/>“Brother Wang Xian, please come in!”<br/><br/>The Voice of the Azure Dragon Moon was heard immediately.<br/><br/>He flew in and saw that the Azure Dragon Moon was sitting in the middle of the hall in front of him.<br/><br/>There were more than a hundred figures in the surroundings.<br/><br/>With a glance, all of them were of the Divine Dragon Bloodline. They were obviously disciples of the ancestral dragon lineage.<br/><br/>It seemed that more than one or two disciples of the ancestral dragon lineage had come to seek refuge with him during this period of time.<br/><br/>“Brother Green Dragon Moon, sorry to disturb you!”<br/><br/>Wang Xian cupped his hands at him.<br/><br/>“Brother Wang Xian, please take a seat.”<br/><br/>Green Dragon Moon gestured at him.<br/><br/>“Brother Green Dragon Moon, I won’t beat around the bush. What happened between the ancestral dragon and the Holy Dragon lineage? What happened to the Hundred Cities Alliance?”<br/><br/>Wang Xian sat down and asked directly.<br/><br/>“This darn holy dragon lineage, HMPH!”<br/><br/>Green Dragon Moon’s eyes were filled with anger. “According to the information I received, the Holy Dragon God had a conflict with our leader. Our leader killed the eldest son of the Holy Dragon God. Now, they are taking revenge on us.”<br/><br/>“As for the Hundred Cities Alliance, they don’t know the exact situation. It’s possible that the Angel clan has put pressure on them. It’s also possible that the Holy Dragon Clan has come to an agreement with them.”<br/><br/>“So far, millions of our ancestral dragon clan’s disciples have been killed.”<br/><br/>He spoke slowly and clenched his fists.<br/><br/>“Then… What did Lord Ancestral Dragon Say?”<br/><br/>Wang Xian revealed a surprised expression and asked.<br/><br/>“There is a possibility that the angel race is involved. A month ago, our leader sent out a message that one can only reach the peak in times of adversity. One can either be reborn from the ashes or be destroyed.”<br/><br/>“Leader didn’t reveal any more details.”<br/><br/>Azure Dragon Moon shook his head. The ancestral dragon lineage had been separated for tens of millions of years. He didn’t know much.<br/><br/>“Are there any experts from the hundred cities alliance attacking the disciples of the ancestral dragon lineage?”<br/><br/>As Wang Xian spoke, he looked at the surrounding disciples of the ancestral dragon lineage.<br/><br/>“Not yet. It’s hard to say in the future. However, the Hundred Cities Alliance has also issued a statement. They are only issuing this bounty. This bounty has nothing to do with the Hundred Cities Alliance. If any city forces are involved, it has nothing to do with them. They will not participate either.”<br/><br/>Azure Dragon Moon shook his head.<br/><br/>The meaning of the hundred cities alliance was that they would only provide this reward platform for the mission and not participate in it.<br/><br/>The participation of cities within the Hundred Cities Alliance was their individual action and had nothing to do with the entire alliance.<br/><br/>Their alliance would not pay for the actions of this city or lend a hand.<br/><br/>“One can only reach the peak in times of adversity. Leader ancestral dragon is really bold. Brother Azure Dragon Moon, if you need any help in the future, you can come to me.”<br/><br/>“I will stand on your side for this battle.”<br/><br/>Wang Xian said with a twinkle in his eyes.<br/><br/>Now, the disciples of the Dragon Palace had already started to move around and gain experience in the heaven-opening primordial land.<br/><br/>They were people with the bloodline of the Divine Dragon, and they would definitely be considered as disciples of the ancestral dragon lineage.<br/><br/>This battle would also involve them.<br/><br/>However, Wang Xian did not mind. If the ancestral dragon were to fight with the bloodline of the Divine Dragon, he would stand on the side of the ancestral dragon lineage without any hesitation.<br/><br/>A lineage of the Holy Dragon that was dependent on other races had already lost the dignity of the Holy Dragon.<br/><br/>They were traitors of the lineage of the Holy Dragon.<br/><br/>They could live on, but they could not be lackeys!<br/><br/>There had to be a bottom line.<br/><br/>Furthermore, the war between the Holy Dragon lineage and the ancestral dragon lineage was obviously not that easy to fight.<br/><br/>The disciples of the ancestral dragon lineage were already scattered and could not fight at all.<br/><br/>The Holy Dragon lineage could only use this method to offer a reward for killing the members of the ancestral dragon lineage.<br/><br/>Perhaps, the leader of the ancestral dragon lineage was spying on the disciples of the Holy Dragon lineage to carry out an assassination!<br/><br/>It was hard to say.<br/><br/>If they were to really fight, it would take millions of years.<br/><br/>The Dragon Palace was mixed in and could also gain some experience.<br/><br/>Currently, the overall strength of the Dragon Palace was equivalent to the strength of two to three cities of the Hundred Cities Alliance.<br/><br/>Joining in would not change much of the battle situation.<br/><br/>“Thank you, brother Wang Xian!”<br/><br/>Qing longyue stood up and thanked him.<br/><br/>“No need. Brother Qing longyue, be careful too. If you need anything, come and find me directly.”<br/><br/>Wang Xian cupped his hands and bade farewell before leaving.<br/><br/>In the surroundings, the disciples of the ancestral dragon lineage looked at Wang Xian with astonishment.<br/><br/>“All of you go and contact them. If any of your disciples do not have a safe place, you can come to the river of Eternity!”<br/><br/>Azure Dragon Moon looked at the group of disciples and said in a deep voice.<br/><br/>“Yes, Sir!”<br/><br/>The group of ancestral dragon disciples replied respectfully.\t\t\t\t\t\t</div>", "images": {}, "success": true}