{"id": 460, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072821.html", "title": "Chapter 3451 - 3451 The Death And Resurrection Of 3450 Wang Xian!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3451 - 3451 The Death And Resurrection Of 3450 Wang Xian!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3451 The death and resurrection of 3450 Wang Xian!<br/><br/>“If I can’t get the twelfth-grade water lotus, I’ll get your corpse and forge it into a powerful weapon.”<br/><br/>Baili Archangel was also furious.<br/><br/>The twelfth-grade water lotus was not an innate treasure in the conventional sense.<br/><br/>The twelfth-grade water lotus could be absorbed and destroyed.<br/><br/>This space behemoth obviously had a backup plan.<br/><br/>After all, it had been waiting for this 12th grade water lotus for billions of years, just waiting for its advancement.<br/><br/>“You Want to kill me? Wishful Thinking.”<br/><br/>At this moment, the space beast no longer wanted to obtain the complete 12th grade water lotus.<br/><br/>Right now, she only wanted to take a portion of the water lotus and slip away.<br/><br/>“HMPH, Cross of judgment, Holy Bone Spear, Kill!”<br/><br/>Baili Archangel flapped his 12 long wings, and the two powerful innate supreme treasures attacked the space beast.<br/><br/>On the surface of the water, lotus flowers bloomed, blocking the attacks of the two innate treasures.<br/><br/>However, the 12th grade water lotus flowers were not fully mature yet, and if they were mature, they might be able to block them. But now, they were not fully mature yet and had not been refined, so their power was greatly reduced.<br/><br/>The holy bone spear pierced through the defense and landed below.<br/><br/>“Roar Roar Roar!”<br/><br/>A blood-curdling scream rang out, and an incomparably huge tentacle flew out from the bottom of the river.<br/><br/>That tentacle had already been severed.<br/><br/>“Boom!”<br/><br/>Everyone could only see the current surging. A huge figure wanted to escape into the distance.<br/><br/>“You want to escape? And bring the Water Lotus with you? You no longer have the chance!”<br/><br/>Archangel Baili immediately attacked and chased after him.<br/><br/>“Retreat!”<br/><br/>The surrounding experts of the Angel Army immediately roared and continued to expand the encirclement.<br/><br/>“Eh?”<br/><br/>In the air, the Great Elf, Sonic Arrow of life, let out a soft sound. His figure moved and disappeared in an instant.<br/><br/>In the next moment, he appeared at the bottom of the river. With a wave of his hand, roots flew into his hand.<br/><br/>“Sonic Arrow of life, is that a treasure that belongs to me?”<br/><br/>From the position in front, the voice of the Archangel of Baili rang out with anger.<br/><br/>“I didn’t break the agreement. It’s because you didn’t suppress the Space Beast. Some of its roots are only one-twentieth of the lotus flower.”<br/><br/>The Voice of life said indifferently.<br/><br/>“Humph!”<br/><br/>Archangel Baili snorted coldly and didn’t say anything else. He stared at the space beast in front of him, his eyes filled with killing intent.<br/><br/>The value of a twelfth-grade water lotus flower was already higher than an ordinary innate supreme treasure. Even if it was damaged, as long as it could be obtained, it would still be worth a lot.<br/><br/>“Cross of judgment, I want to judge the space beast, behead it!”<br/><br/>Archangel baili growled in a low voice, and the cross of judgment shone with a luster.<br/><br/>He poured a vast amount of light power into the cross of judgment.<br/><br/>In front of the cross of judgment, the illusory image of a space beast appeared.<br/><br/>The illusory image’s head was beheaded by a beam of light, and it fell straight down!<br/><br/>“Roar! Roar! Roar!”<br/><br/>In the next moment, an extremely miserable cry was heard.<br/><br/>When everyone saw this scene, they felt a chill in their hearts.<br/><br/>“What… What kind of attack is this? How can it be so terrifying?”<br/><br/>“A direct judgement decapitation without any contact. Is this the power of an innate treasure?”<br/><br/>This attack was very slow and everyone around could see it clearly.<br/><br/>This made their hearts tremble.<br/><br/>Wang Xian looked at this strange attack and was extremely horrified.<br/><br/>This attack was too strange and terrifying!<br/><br/>It was too unbelievable.<br/><br/>“Huff! Huff!”<br/><br/>He took a deep breath and looked forward.<br/><br/>“Damn it, that space beast isn’t dead yet. He took two lotus petals and chased after her. Her strength has already dropped below the level of a universe dominator.”<br/><br/>In less than a minute, an angry shout was heard.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>At this moment, the Army of one million angels immediately moved.<br/><br/>Whoosh<br/><br/>All of a sudden, Wang Xian sensed a shadow flying toward him. The shadow flashed past.<br/><br/>He swept his gaze over and was slightly stunned.<br/><br/>This Is?<br/><br/>“Over here!”<br/><br/>At this moment, he felt a terrifying energy attacking him.<br/><br/>His expression changed drastically and he quickly dodged to the side.<br/><br/>He swept his gaze over and saw two ten-winged angels flying towards him.<br/><br/>“HMM? They disappeared here. A part of the Space Beast’s body was fleeing in this direction!”<br/><br/>The two ten-winged angels immediately stopped and their eyes emitted a bright power.<br/><br/>“Eh? Divine Dragon Bloodline. How Strange and pure. What’s that on him? A companion Elf?”<br/><br/>A ten-winged Angel’s gaze landed on Wang Xian. He was slightly stunned and a look of astonishment flashed across his face.<br/><br/>“Whoosh!”<br/><br/>The next moment, he made a move that astonished Wang Xian.<br/><br/>He flapped his ten angelic wings and charged at Wang Xian rapidly.<br/><br/>Wang Xian’s expression changed drastically.<br/><br/>“PFFT!”<br/><br/>An angelic sword penetrated Wang Xian’s body directly. The pure power of light instantly extinguished his life force.<br/><br/>“Scoundrel! Big Scoundrel! How dare you kill my father! Big Scoundrel!”<br/><br/>When Lingling saw this scene, her eyes turned red as she shouted.<br/><br/>Buzz<br/><br/>Her body trembled and the body that was wrapped around Wang Xian disappeared instantly.<br/><br/>The companion Elf shared the same divine kingdom as the host. Naturally, he could take away Wang Xian’s body.<br/><br/>“Eh? This companion Elf?”<br/><br/>The ten-winged Angel raised his eyebrows slightly. His eyes were filled with astonishment and astonishment.<br/><br/>However, he did not pay too much attention to it.<br/><br/>He was merely an expert with the combat strength of a Master of the universe at Level One. In the eyes of other races, he was very strong.<br/><br/>However, in his eyes, he killed him casually.<br/><br/>Perhaps, he would forget about killing the other party after a few days.<br/><br/>As for why he wanted to kill him, it was naturally because he possessed the purest divine dragon bloodline.<br/><br/>Whoosh<br/><br/>All of a sudden, a figure appeared at the spot where Wang Xian’s corpse had disappeared.<br/><br/>The Great Elf, Yin Yin ya, frowned as she looked at her surroundings. Her eyes were filled with doubt.<br/><br/>“The aura of a half-life elf? I shouldn’t have sensed wrongly.”<br/><br/>She mumbled.<br/><br/>“The great void is confined by the light. No one is allowed to leave.”<br/><br/>Buzz<br/><br/>At this moment, the light enveloped everything. Everyone who was watching the battle had no time to escape. Their bodies were stiff.<br/><br/>They could only move their eyes. Their thoughts were still there. Everything else seemed to have disappeared.<br/><br/>The Great Elf glanced at the sound of life arrow and looked at Baili Archangel. Then, she stepped into the void and disappeared.<br/><br/>…<br/><br/>“Bad guy, bad guy. How dare you kill Father. Lingling must kill her way back in the future.”<br/><br/>At the same time, in the Dragon Palace, Lingling was flying around Wang Xian’s corpse. Her small face was filled with anger.<br/><br/>Green, blue, and mysterious gray energy entered Wang Xian’s body.<br/><br/>The location of his wound quickly disappeared.<br/><br/>“Lingling’s resurrection technique, wake up, Dad!”<br/><br/>She tapped the staff in her hand lightly.<br/><br/>Lingling’s innate ability, resurrection!<br/><br/>“HMM?”<br/><br/>Wang Xian, who was lying on the ground, suddenly opened his eyes. He looked at Lingling, who was lying beside him with a pale face.<br/><br/>“Lingling, were you the one who revived me?”<br/><br/>He touched Lingling’s head and asked.<br/><br/>“Yes, Dad. I’m tired. I need to feel it!”<br/><br/>Lingling nodded and said weakly.<br/><br/>It was very exhausting for her to perform resurrection.\t\t\t\t\t\t</div>", "images": {}, "success": true}