{"id": 461, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072823.html", "title": "Chapter 3452 - 3452 3451 Space Beast Water Touch King", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3452 - 3452 3451 Space Beast Water Touch King</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3452 3451 Space Beast Water Touch King<br/><br/>“I was killed by the ten-winged angel in an instant. That ten-winged angel should have the combat strength of a level three universe overlord!”<br/><br/>“I was saved by the spirit. Why did the ten-winged Angel Want to kill me? He seemed to have said that I have a powerful divine dragon bloodline.”<br/><br/>Wang Xian sat on the dragon throne in the Dragon King Palace and muttered.<br/><br/>He lost all consciousness in an instant. Fortunately, the spirit spirit was there and brought him back to the Dragon Palace.<br/><br/>Otherwise, even if he could be resurrected through the ancestral tree, he would still suffer heavy losses.<br/><br/>At the very least, he needed a large amount of resources to recover.<br/><br/>“It’s because I have the Divine Dragon Bloodline. It seems that the angel race has indirectly or even directly participated in the war between the Holy Dragon and the Ancestral Dragon Bloodline!”<br/><br/>Wang Xian mumbled as his eyes slowly revealed a violent killing intent.<br/><br/>There was a ball of fury in his heart.<br/><br/>The other party didn’t know whether he was innocent or not. If he had the bloodline of the Divine Dragon, as long as he wasn’t a disciple of the Holy Dragon race, he would kill him directly.<br/><br/>In that case, the Dragon Palace was also the target of being killed.<br/><br/>“Looks like I have to have a good fight.”<br/><br/>Wang Xian’s eyes were filled with killing intent as he clenched his fists slightly.<br/><br/>“Huh?”<br/><br/>All of a sudden, he was slightly stunned. He could sense something coming out of his body.<br/><br/>If he was not in the Dragon Palace, he might not have been able to sense it.<br/><br/>Whoosh<br/><br/>He moved his palm and grabbed towards the back.<br/><br/>“Roar, Roar, don’t kill me. We are from the same root, why are you in such a hurry? Don’t kill me!”<br/><br/>A voice suddenly sounded, causing Wang Xian to be slightly stunned.<br/><br/>“This is? The Space Beast!”<br/><br/>He was slightly shocked. With a wave of his arm, a tentacle the size of a palm appeared in front of him.<br/><br/>There was a small head on the tentacle, which was very strange.<br/><br/>Based on his senses, the energy contained in the body of this space beast was only at the peak of a universe knight.<br/><br/>Although such energy was still huge, it could not be compared to her peak.<br/><br/>In addition, Wang Xian could sense a familiar energy in his body.<br/><br/>Water Lotus!<br/><br/>When he thought of the furious roar of Baili Archangel and the search conducted by the millions of angels, his eyes sparkled.<br/><br/>“I didn’t expect the magnificent space beast to be in such a sorry state. Also, I am not born with the same roots as you.”<br/><br/>Wang Xian stared at her and said with a smile.<br/><br/>“It’s about the same. I was severely injured by that bird man from the Angel clan. You were also almost killed by the bird man from the Angel clan. We are all of the same kind.”<br/><br/>The Space Beast said to him. This logic seemed to be correct.<br/><br/>“Hehe, I contributed a lot to your escape. How are you going to repay me?”<br/><br/>Wang Xian smiled and said to her.<br/><br/>“Repay me, little brother of the Divine Dragon Bloodline. When I regain my strength, I will take care of you in the future. I will help you seek revenge from the Angel clan. I will secretly kill their clansmen and kill them all.”<br/><br/>The Space Beast said fiercely.<br/><br/>“I don’t know how long it will take for you to regain your strength. Hurry up and give me the petals of the two grade-12 water lotus flowers in your body.”<br/><br/>Wang Xian pinched her body and said directly.<br/><br/>“No, after I devour these petals, I can instantly recover to the level-two combat strength of a universe dominator. I Can’t give them to you.”<br/><br/>The Space Beast revealed a panicked expression and shouted loudly.<br/><br/>“You have to do it even if you can’t. I’m Your Savior. If it weren’t for me, you wouldn’t have been able to escape. You have to repay your savior properly. Hurry Up!”<br/><br/>Wang Xian forced him.<br/><br/>The two petals of a 12th grade water lotus were definitely worth a lot of money.<br/><br/>In fact, after Wang Xian devoured it, he would be able to achieve a breakthrough.<br/><br/>Naturally, he had to obtain such a treasure.<br/><br/>As for what the Space Beast said, Wang Xian didn’t even care about it.<br/><br/>By the time she recovered, he might have reached the level four combat strength of a universe overlord.<br/><br/>“No, no way, Kid. Now, bring me sufficient resources to recover. I will definitely protect you in the future. In this universe, other than those peak races, no other forces would dare to provoke you.”<br/><br/>The Space Beast immediately roared loudly.<br/><br/>“If you don’t take it out, I will have to take it out myself.”<br/><br/>Wang Xian said indifferently. With a move of his palm, the petals of the water lotus slowly emerged from her body.<br/><br/>“No, you detestable fellow. Do you know what you are doing? I am a majestic water-tentacled space beast. You are courting death!”<br/><br/>The Space Beast water-tentacled King roared shrilly.<br/><br/>“I will kill you if you continue to spout nonsense.”<br/><br/>Wang Xian said calmly. Two petals that contained immense power appeared in front of him.<br/><br/>Looking at the water lotus, Wang Xian’s eyes were burning with passion.<br/><br/>Although he was killed this time, the reward was totally worth it.<br/><br/>Should I devour it directly or let it merge with the Ninth-grade Water Lotus<br/><br/>Wang Xian had a hesitant look on his face as he pondered in his heart.<br/><br/>If he devoured it directly, his strength would increase directly.<br/><br/>This could increase his strength by a lot. Although he didn’t dare to say that he would increase by two levels, he should be able to approach two levels.<br/><br/>However, if he were to devour it, it would be too much of a pity.<br/><br/>After all, this kind of treasure was extremely rare.<br/><br/>It was something that could be encountered but not sought after.<br/><br/>“Forget it, I’ll just stay here. I can obtain the resources that I need to improve from other places!”<br/><br/>Wang Xian mumbled to himself. With a movement of his hand, two petals flew towards the ancestral tree.<br/><br/>“HMM?”<br/><br/>At the side, the king of water touch noticed the ancestral tree. When he saw the petals of a grade-12 water lotus landing on the ancestral tree, his eyes widened instantly.<br/><br/>“This is impossible. This is impossible. The sapling of the Divine Tree of Heaven’s origin creation. How is this possible!”<br/><br/>She widened her three eyes and roared in disbelief.<br/><br/>Heaven’s origin creation. Such a treasure was not something that ordinary creatures could obtain.<br/><br/>To him, Wang Xian was just a little guy. A Little Guy’s divine kingdom actually possessed such a heaven-defying treasure.<br/><br/>“There’s nothing impossible about it. Water Touch King, what do you think I should do to you?”<br/><br/>He smiled and stared at water touch king with sparkling eyes!<br/><br/>“You… I’m willing to submit. Big Brother, I’m willing to submit. I’m willing to submit to you!”<br/><br/>However, to Wang Xian’s surprise, this space beast directly laid down in front of him to submit.<br/><br/>This made him slightly stunned.<br/><br/>What about this fellow’s moral integrity?<br/><br/>However, he also had some guesses in his heart. The reason why this king of water tentacles submitted to him was largely because of the ancestral tree.<br/><br/>If not, even if her strength had been greatly reduced, she would not submit to others so easily.<br/><br/>“If you want to submit, then devour this drop of blood essence.”<br/><br/>Wang Xian naturally would not reject a space beast that possessed the potential of a ruler of the universe.<br/><br/>Right now, she was only severely injured. As long as she had sufficient strength, she would be able to fully recover.<br/><br/>It was not easy to break through to the realm of the ruler of the universe. Even for a peak race, it was extremely difficult to break through.<br/><br/>For example, the leader of the ancestral dragon had not been able to break through\t\t\t\t\t\t</div>", "images": {}, "success": true}