{"id": 469, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072839.html", "title": "Chapter 3460 - 3460 3459 Underworld Ghost And The Breakthrough", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3460 - 3460 3459 Underworld Ghost And The Breakthrough</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3460 3459 underworld ghost and the breakthrough<br/><br/>“TSK TSK, I didn’t expect that there would be such a thing in the four cities. It’s really strange.”<br/><br/>The king of water tentacles came to the black bottle, her eyes shining.<br/><br/>She looked at the patterns on the bottle and then opened it with her tentacles.<br/><br/>“Buzz!”<br/><br/>The black bottle was opened, and a shadow floated out. The Shadow was a child.<br/><br/>The child’s entire body was gray, and he had a pair of fangs and blood-red eyes.<br/><br/>The most shocking thing was that there were a few blood-red eyes between his eyebrows and on his stomach.<br/><br/>This child gave people a very uncomfortable feeling.<br/><br/>“Drink, drink, drink!”<br/><br/>The child did not have a physical body. When he came out, he let out a sinister voice.<br/><br/>He stared at the king of water tentacles ferociously as if he did not know fear.<br/><br/>“What is this?”<br/><br/>Wang Xian looked at this strange child who did not have a physical body. His eyes revealed a look of surprise.<br/><br/>“This is called the ghost of the underworld. It is the ultimate treasure of the underworld race, the peak race in the universe. One ghost can give birth to many more. This is what it means!”<br/><br/>The king of water tentacles replied.<br/><br/>“Is this the ghost of the Underworld?”<br/><br/>Wang Xian’s eyes flickered slightly. From the inheritance of the divine dragon lineage, he knew some information about the Netherworld Ghost.<br/><br/>The Netherworld race was a race at the peak of the universe. This race was very strange and terrifying.<br/><br/>They did not have a physical body, so physical attacks had no effect on them.<br/><br/>In other words, they were immune to physical attacks.<br/><br/>They also had a strong resistance to the darkness attribute and were very abnormal.<br/><br/>However, their powerful bodies and unique characteristics made their cultivation even more difficult.<br/><br/>Especially their attack methods were relatively simple.<br/><br/>Furthermore, they had one thing in common with the space beast, which was that they did not have a cosmos god country.<br/><br/>Without a physical body and a cosmos god country, it meant that they relied on themselves for everything.<br/><br/>However, the reason why the dark race was ranked among the top races in the Cosmos was that they had a very powerful treasure.<br/><br/>It was the Dark Ghost!<br/><br/>Compared to the bodies of the dark race, the stronger the Dark Ghost was, the more dark ghosts there were, and the stronger their own power would be.<br/><br/>However, the same flaw made it extremely difficult for the dark ghost to improve.<br/><br/>The dark race was the only race that was not harmonious within the pinnacle race, and they had always been in a civil war.<br/><br/>This was because the fastest way for the dark race to improve was to devour their own kind.<br/><br/>The strange little boy in front of him was the dark ghost. The ownerless dark ghost was still very weak.<br/><br/>If the dark ghost wanted to advance, it had to first devour the souls of living creatures, then lure the dark ghost into its body and nurture it with its own darkness attribute.<br/><br/>In short, raising the Dark Ghost was exceptionally difficult.<br/><br/>It could be said that raising a dark ghost would make a darkness attribute expert’s cultivation progress twice as slow.<br/><br/>Furthermore, it wasn’t something that could be raised by any dark attribute expert.<br/><br/>In short, there were many laws and inheritances involved. It was extremely difficult.<br/><br/>After all, the Ghoul was one of the foundations of the Netherworld race.<br/><br/>“What a pity. The Ghoul is also very valuable in the Netherworld race. However, it is basically useless to others.”<br/><br/>King watertouch said with a face full of regret.<br/><br/>Wang Xian nodded his head slightly. With a wave of his arm, the Netherworld Ghost appeared in front of him.<br/><br/>The Netherworld Ghost, which was only half a meter long, was somewhat eerie and terrifying.<br/><br/>“It’s too weak. It only has the combat strength of an emperor of the Void.”<br/><br/>Wang Xian shook his head and prepared to put it away.<br/><br/>“Drink, drink, drink!”<br/><br/>All of a sudden, this netherworld ghost floated toward the Dragon Throne.<br/><br/>No, it was heading toward the ancestral tree.<br/><br/>“Eh?”<br/><br/>Wang Xian was slightly stunned as he watched quietly.<br/><br/>This little ghost flew to the branch of the ancestral tree’s soul-returning tree. It stared at a soul-returning fruit with its blood-red eyes and opened its mouth to bite it<br/><br/>Buzz<br/><br/>The soul-returning fruit entered his mouth, causing his body to emit a gray energy.<br/><br/>Wang Xian could clearly sense that the ghost’s strength had improved tremendously.<br/><br/>“What is this?”<br/><br/>He narrowed his eyes and watched quietly.<br/><br/>After eating one of the fruits, the ghost continued to devour the other one.<br/><br/>The second fruit entered his stomach and a wave of power swept across his body.<br/><br/>He had advanced to the level of a universe knight.<br/><br/>“Dragon King, what fruit is this? It can actually be absorbed by the ghost and can increase his strength so quickly.”<br/><br/>The king of water touch asked in astonishment.<br/><br/>Wang Xian didn’t answer her. He just watched quietly.<br/><br/>The soul-returning embryo fruit could absorb souls. To a certain extent, the ghost of the dead also belonged to the soul.<br/><br/>It was normal for the energy of the same origin to be absorbed.<br/><br/>Crack! Crack<br/><br/>At this moment, the ghost of the dead didn’t seem to be satisfied with the soul-returning embryo fruit. He actually bit the branch of the soul-returning tree.<br/><br/>Wang Xian was slightly stunned.<br/><br/>At this moment, the soul-returning tree branch emitted a grayish luster as it directly coiled towards him.<br/><br/>“Ahhhh!”<br/><br/>A terrifying and ear-piercing sound came from the ghost’s mouth. He was slowly entangled by the soul-returning tree branch and was soon completely wrapped up.<br/><br/>Following that, a human-shaped soul-returning fruit was formed.<br/><br/>This human-shaped fruit was exactly the same as the ghost. However, it had shrunk by ten times.<br/><br/>“This…”<br/><br/>Wang Xian looked at this strange scene in astonishment and raised his eyebrows slightly.<br/><br/>He flew over and touched this special soul-returning embryo fruit with his hand.<br/><br/>A stream of information was transmitted instantly, causing Wang Xian’s eyes to glow.<br/><br/>According to the information transmitted from the soul-returning tree, if he were to swallow this soul-returning embryo fruit, he would be able to create a Netherworld Ghost.<br/><br/>The Netherworld Ghost possessed its own appearance and strength.<br/><br/>Even if it was an individual existence, it was also an existence that relied on itself.<br/><br/>It was very mystical.<br/><br/>“TSK TSK, this is a good thing.”<br/><br/>Wang Xian’s eyes sparkled. As long as he were to devour it, it would mean that he had a clone whose strength was about the same as his.<br/><br/>Of course, this clone was still much weaker than him.<br/><br/>The main difference lay in the uninitiated holy wings.<br/><br/>If Wang Xian didn’t have the uninitiated holy wings, his strength would be about the same as his combat strength.<br/><br/>Regardless, as long as he devoured it, he would have a clone with the combat strength of A Level One universe dominator.<br/><br/>It was very strong, very strong!<br/><br/>One had to know that it possessed the characteristics of the Netherworld race and could ignore physical attacks.<br/><br/>He directly swallowed it into his stomach, and the special soul-returning embryo fruit instantly spread throughout his entire body.<br/><br/>A special feeling was transmitted over.<br/><br/>He felt as if he had an additional soul, and he was connected to this soul.<br/><br/>It was slightly different from his clone.<br/><br/>His mind moved, and a gray figure that looked exactly like him appeared beside him.<br/><br/>With a thought, he could easily control his own energy and interconnect it with his own.<br/><br/>“This… This is too strange. Dragon King, you can actually have an additional netherspirit clone in an instant? Is this the terrifying ability of the Heaven’s origin creation level?”<br/><br/>At the side, King watertouch saw this scene and his face was filled with shock.<br/><br/>It was extremely difficult for the Netherworld Race to nurture a netherspirit, but Wang Xian had one so easily?<br/><br/>What kind of power was this?<br/><br/>The power of the heaven creation ancestral tree?\t\t\t\t\t\t</div>", "images": {}, "success": true}