{"id": 466, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072833.html", "title": "Chapter 3457 - 3457 3456, The Four Major Cities Were Destroyed. The Alliance Of 100 Cities Was In A State Of Shock", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3457 - 3457 3456, The Four Major Cities Were Destroyed. The Alliance Of 100 Cities Was In A State Of Shock</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3457 3456, the four major cities were destroyed. The Alliance of 100 cities was in a state of shock<br/><br/>“TSK TSK, a lackey of the Angel clan. You’re courting death.”<br/><br/>King Shui Chui killed the city lord of Great Marquis City. A look of disdain appeared in his eyes. “Sooner or later, I, King Shui Chui, will kill the Angel clan and make the hundred-row archangels pay a terrible price.”<br/><br/>“There’s still one more. It’s located in the grotto-heaven blessed land below. Kill him!”<br/><br/>Wang Xian spoke. His body moved and he flew straight to the core of the grotto-heaven blessed land below.<br/><br/>Mo Sha had already told him all the information in the entire great marquis city and everywhere.<br/><br/>This made it very convenient for him to move around.<br/><br/>Not to mention, Mo Sha was also acting as an insider!<br/><br/>“Who is it?”<br/><br/>When Wang Xian arrived at the core of the grotto-heaven blessed land, a figure bathed in flames suddenly opened his eyes and immediately picked up the staff at the side.<br/><br/>“Wizard? It’s You!”<br/><br/>Wang Xian recognized this figure at a glance. This was the wizard who besieged Azure Dragon Moon previously.<br/><br/>The mayor of Great Marquis City was also a formation wizard, so Wang Xian’s attack was very easy.<br/><br/>Wizards who specialized in formations were most afraid of close combat and assassination.<br/><br/>Not to mention that his injuries had not fully recovered yet.<br/><br/>Whoosh<br/><br/>Wang Xian flapped his incipient saint wings and arrived in front of him at a terrifying speed. He swept his dragon claws across.<br/><br/>“It’s You!”<br/><br/>The Wizards from Darhou city also recognized Wang Xian. Their expressions changed drastically.<br/><br/>Last time, they failed to besiege Azure Dragon Moon and were almost left behind. It was all because of this terrifying fellow in front of them.<br/><br/>“Die!”<br/><br/>Wang Xian said indifferently.<br/><br/>“How did you find this place?”<br/><br/>He widened his eyes and roared. His face was filled with disbelief.<br/><br/>The staff in his hand instantly released a powerful defense.<br/><br/>This was a formation that had already been set up in advance, just in case.<br/><br/>“Even a small formation can’t protect your life!”<br/><br/>The staff blocked Wang Xian’s attack, but the water touch king had been lying on Wang Xian’s shoulder the entire time and shouted.<br/><br/>She was, after all, a real cosmic beast that once ruled the universe.<br/><br/>Even though she was severely injured and had just recovered to the combat strength of A Level One universe dominator.<br/><br/>Her attack power and combat strength were still not something that an ordinary level one universe dominator could compare to.<br/><br/>Even the combat strength of a peak race could not compare to her.<br/><br/>Unless the opponent had several innate spiritual treasures.<br/><br/>“PFFT!”<br/><br/>This magus from the Great Marquis city was easily killed by the water touch king.<br/><br/>With Wang Xian and the water touch king working together, no one of the same level could withstand a round of attacks.<br/><br/>“Demon Fiend, start moving immediately.”<br/><br/>After killing the Great Marquis City Lord and the rest, Wang Xian gave an order directly.<br/><br/>“Wu Wu Wu!”<br/><br/>“In the Great Marquis City, all the powerhouses and all the disciples of the army should head to the city Lord’s mansion immediately!”<br/><br/>A hurried voice rang out in the sky above the Great Marquis city. When all the citizens and disciples of the Army heard the alarm sound, their expressions changed drastically.<br/><br/>They looked in the direction of the city Lord’s Mansion and saw that the defensive formation of the grotto-heaven was suddenly activated. Their expressions changed drastically.<br/><br/>“What happened?”<br/><br/>“Quick, quick, head to the city Lord’s mansion immediately!”<br/><br/>“Did something happen? Or is it because of the matter of the annihilation of the Eternal Heaven City? Does the city Lord have any orders? No, even if he does, he shouldn’t sound the alarm!”<br/><br/>The strong disciples from the various legions flew over quickly.<br/><br/>Wang Xian stood quietly at a corner of the city lord’s residence, waiting for their arrival.<br/><br/>This time, the position of the Great Marquis city’s strong disciples who were possessed by the demonic fiend was more honorable, so it was more relaxed.<br/><br/>He only needed to wait here quietly.<br/><br/>Ten minutes later, all the strong disciples from the Great Marquis City’s legions gathered at their positions outside<br/><br/>They looked at the blessed land that was covered by the defense, full of doubts.<br/><br/>Hong<br/><br/>However, at this moment, a terrifying energy swept toward them.<br/><br/>The sudden attack made all the great beings from Great Marquis city look terrified.<br/><br/>“Run! Run! Something happened to the city leader and the others!”<br/><br/>A Pinnacle Universe Knight roared crazily, his face full of panic.<br/><br/>“Boom!”<br/><br/>However, a terrifying attack had arrived. The Five Elements Millstone was suspended in the sky.<br/><br/>A long river destroyed everything.<br/><br/>Wang Xian watched indifferently. There wasn’t the slightest fluctuation.<br/><br/>These few casualties were nothing to the experts of the divine dragon lineage who were hunted down?<br/><br/>The attack came and went quickly. All the elite experts of great Marquis City were killed.<br/><br/>At this time, the rest of the citizens and some tourists in the city were completely stunned.<br/><br/>Everyone looked over in fear. No experts dared to approach.<br/><br/>Some experts felt that the atmosphere was a bit strange and immediately fled.<br/><br/>The entire great Marquis city fell into a strange atmosphere.<br/><br/>It wasn’t until two to three hours later that someone dared to come over to investigate.<br/><br/>“No One? Why is there no one? What Happened?”<br/><br/>“Did a battle happen just now? What’s going on?”<br/><br/>The people who came to investigate were extremely shocked. The array of the grotto-heaven blessed land was still open, but there was no sign of life around the city Lord’s mansion.<br/><br/>It was so quiet here that it made people feel terrified.<br/><br/>However, compared to the huge commotion that came from the Heavenly Heng City, the Great Marquis city was much quieter.<br/><br/>The news of the Great Marquis city’s strong disciples being killed did not spread out immediately.<br/><br/>“The next two cities are the Light Dragon City and Jili City. The city lords of these two cities have been injured. Although the news of the poisonous horned dragon species is not much, it is enough!”<br/><br/>Three hours later, Wang Xian smiled. He walked out of the teleportation formation and came to the top of a restaurant in Jili City under the lead of a poisonous horned dragon species.<br/><br/>“Dragon King, leader, this is all the information I have on Jili City.”<br/><br/>The strength of Jili city was slightly weaker than that of Tian Heng City. Now that the city lord of Jili City was injured, everything was left to his son to handle.<br/><br/>Currently, the city lord of Jili City might not know the news of the destruction of Tian Heng City.<br/><br/>“Let’s go. Let’s go to the city Lord’s mansion. Ba Qi, you will parasitize it first. Then, just like Da Hou City, gather all the legions and powerhouses and kill them directly.”<br/><br/>Wang Xian said faintly.<br/><br/>“It’s the Dragon King!”<br/><br/>Ba Qi nodded. Wang Xian’s body moved and enveloped him as he flew toward the city Lord’s mansion.<br/><br/>According to the information obtained by the poisonous horned dragon species, his dragon eyes quickly locked onto an old man.<br/><br/>The old man was in the city Lord’s main hall, looking through the news one by one.<br/><br/>Buzz<br/><br/>Wang Xian’s figure appeared behind him. He didn’t even sense it.<br/><br/>When his palm landed on the old man’s head, the old man’s body stiffened. Ba Qi immediately began to parasitize him.<br/><br/>“Dragon King, the city lord of Ji Ri City is not in the city. His universe God nation is not placed here. He does not even know about this body.”<br/><br/>Very soon, Ba Qi reported with a frown.<br/><br/>“Forget it if he is not here. Gather all the experts of Ji Ri City over.”<br/><br/>Wang Xian frowned slightly. One less corpse of a level one master of the universe with combat strength was missing.<br/><br/>Moreover, he would have to obtain quite a few treasures.<br/><br/>However, Wang Xian didn’t care too much about it!<br/><br/>The operation this time was very smooth!<br/><br/>“It’s the Dragon King!”<br/><br/>Ba Qi nodded his head. Just like Mo Sha, he gathered all the experts of the army.<br/><br/>This time, he wasn’t in a hurry. He would gather all the elite experts of Sun City in an hour!\t\t\t\t\t\t</div>", "images": {}, "success": true}