{"id": 467, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072835.html", "title": "Chapter 3458 - 3458 3457, The Four Great Cities Were Destroyed, And The Hundred Cities Alliance Was Shaken", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3458 - 3458 3457, The Four Great Cities Were Destroyed, And The Hundred Cities Alliance Was Shaken</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3458 3457, the four great cities were destroyed, and the Hundred Cities Alliance was shaken<br/><br/>“Boom!”<br/><br/>When the terrifying energy covered the sky and covered the front of the city Lord’s mansion, it also announced the destruction of the entire Ji Ri City.<br/><br/>“What’s going on over there? What’s going on over at the city Lord’s Mansion?”<br/><br/>“Hiss, what’s going on with that terrifying energy?”<br/><br/>The terrifying energy swept past, and all the citizens of Jil City looked over with faces full of shock.<br/><br/>Everyone was discussing animatedly.<br/><br/>“A strange situation has also occurred over at the Great Marquis City. Quickly search the Great Marquis city, they are the same!”<br/><br/>“Really, according to the citizens of the Great Marquis City, all the experts within the Great Marquis city have disappeared. There is a certain possibility that they have been killed!”<br/><br/>“Hiss, how is this possible?”<br/><br/>“Let’s go and take a look!”<br/><br/>Because of the example of the great marquis city, some citizens quickly flew towards the city Lord’s mansion.<br/><br/>When they flew there, the situation was exactly the same as in the Great Marquis City.<br/><br/>The surroundings of the city Lord’s Mansion were dead silent.<br/><br/>There was no sign of life, and the surroundings were abnormally strange!<br/><br/>Their expressions changed wildly, and they had a bad premonition in their hearts!<br/><br/>“Hualala!”<br/><br/>Right at this moment, a stretch of yellow sand appeared in the sky.<br/><br/>“Greetings, City Lord!”<br/><br/>Seeing the appearance of the yellow sand, the hearts of the surrounding people trembled, and they immediately bowed respectfully.<br/><br/>The yellow sand that filled the sky slowly condensed into a human figure.<br/><br/>This figure’s gaze was fixed on the position of the city Lord’s mansion, and his expression constantly changed.<br/><br/>“Who is it? Who Killed the experts of Jil City? Who Is It?”<br/><br/>His face was filled with a ferocious roar, filled with anger and unwillingness.<br/><br/>Not long ago, he sensed that all of his bloodline in Jil City had disappeared.<br/><br/>He sensed that all of his subordinates’divine tokens had been shattered.<br/><br/>This caused him to feel extremely terrified.<br/><br/>What kind of power could instantly wipe out the experts of Jil City?<br/><br/>What exactly happened?<br/><br/>The city lord of Jil City immediately used the yellow sand to form an avatar to rush over. The situation in Jil City caused him to feel a chill in his heart.<br/><br/>There were no traces of battle in the surroundings. However, all the experts of Jil City were killed. Not even their corpses were left.<br/><br/>How did the other party do it?<br/><br/>This made him feel extremely terrified.<br/><br/>“City Lord, something similar happened in the Great Marquis City. What is going on?”<br/><br/>A citizen of Jil City said in fear.<br/><br/>“Great Marquis City? How is this possible?”<br/><br/>The city lord of Jil city was slightly shocked. His true body in the divine kingdom immediately contacted the city lord of the Great Marquis City.<br/><br/>What shocked him was that he could not contact the city lord of the Great Marquis City.<br/><br/>He was very clear what this meant.<br/><br/>“The city lord of Great Marquis City and the others are experts of the Magus lineage. They were actually killed!”<br/><br/>“The Eternal Sky City was destroyed, the Great Marquis city was destroyed, and our Jili City was also destroyed. Next… The Light Guardian Dragon Cheng, was it an expert of the ancestral dragon lineage who attacked?”<br/><br/>The city lord of Jili City immediately thought of something and his expression changed slightly.<br/><br/>The other party had come prepared.<br/><br/>“No, I have to report this matter to the Hundred City Alliance. I have to tell this matter to the city lord of the light guardian Dragon City.”<br/><br/>He immediately reported his guess and the situation here to the Hundred City Alliance and the City Lord of the light guardian Dragon City.<br/><br/>In fact, all the experts in the current Hundred City Alliance had already participated in the war between the Holy Dragon lineage and the ancestral dragon lineage.<br/><br/>However, some cities had already taken action and some cities had not!<br/><br/>The experts in the Hundred Cities Alliance had also reached an agreement. They would try their best to act in secret and not be exposed.<br/><br/>The information of the city lord of Jil City was quickly transmitted to the Hundred Cities Alliance and Light Dragon City.<br/><br/>“Hiss!”<br/><br/>Light Dragon City stood on a mountain range of light.<br/><br/>The entire mountain range was like the back of a dragon, stretching over a billion kilometers.<br/><br/>In the city Lord’s cave abode at the center of Light Dragon City, the city lord of Light Dragon City saw the message sent to him by the city lord of Jili City, and his face changed drastically.<br/><br/>“How is this possible? All the experts of Heavenly Heng City and Great Marquis City of Jili City were killed in one day. This was definitely premeditated. It was targeted at our four cities. Is it because of the previous incident that we were exposed?”<br/><br/>“Damn it, damn it, how could this be?”<br/><br/>The city leader of Light Dragon City looked extremely embarrassed, and he immediately stood up. “Men!”<br/><br/>“They’re here. Do You Already Know?”<br/><br/>An unfamiliar voice sounded, causing the city leader of Light Dragon City to tremble, and he stared straight ahead.<br/><br/>“You, you, you… Who Are You? Who Are You? Why are you trying to kill us?”<br/><br/>His voice was trembling as he growled in a low voice.<br/><br/>The Great Marquis City of Tianheng City had been destroyed. There were two level one masters of the universe in both cities.<br/><br/>He knew that he was definitely not a match for this faction.<br/><br/>“Because you all deserve to die!”<br/><br/>Wang Xian entered the palace and said calmly.<br/><br/>Crash<br/><br/>The next moment, the prieless holy wings on his back flapped and instantly attacked the city lord of Light Dragon City.<br/><br/>Flee! Flee!<br/><br/>The city lord of Dragon City of light didn’t hesitate at all. He turned around and fled for his life.<br/><br/>Boom<br/><br/>In the next moment, the dragon claws and the five elements grinding mill attacked him.<br/><br/>Following that, there was also the king of water tentacles who was lying on his body.<br/><br/>PFFT<br/><br/>The city lord of Dragon City of light didn’t have the slightest ability to retaliate in front of them.<br/><br/>A corpse was lying there.<br/><br/>Next, Wang Xian and the stinger dragon species, the poisonous horned dragon species, made their move and killed the powerhouse of Dragon City of light.<br/><br/>The scene that happened in Jili City of Great Marquis city had already been transmitted here.<br/><br/>Therefore, Wang Xian couldn’t cover the situation of the two cities.<br/><br/>However, although it took him some time to do it himself, he wasn’t worried about reinforcements coming over after a few hours or even more when the teleportation formation was shut down.<br/><br/>It was impossible for the reinforcements from the Hundred Cities Alliance to arrive so quickly.<br/><br/>“Run!”<br/><br/>“Our Dragon City of light has also been invaded by a mysterious force. Run, run!”<br/><br/>An hour later, when the assassination attempt by the Dragonspur was discovered by some powerhouses, panic began to spread throughout Dragon City of light.<br/><br/>With the example of the three major cities, countless citizens fled frantically.<br/><br/>Four hours later, after the sky array wiped out some traces, Wang Xian and the rest returned to the Dragon Palace in an instant.<br/><br/>From then on, the four great cities were all annihilated within a day.<br/><br/>The five level one masters of the universe were all killed.<br/><br/>In the four great cities, more than 95% of the elite core disciples were killed or injured.<br/><br/>The four great cities were completely destroyed.<br/><br/>Even if it was jil city, how could the city lord of Jil City hold up the entire city?<br/><br/>The four cities had been destroyed for such a short period of time that many people who didn’t pay attention to the Hundred Cities Alliance didn’t know about it.<br/><br/>However, the news of the four cities being destroyed in a day swept through the surroundings at a terrifying speed.<br/><br/>These were the four cities of the Hundred Cities Alliance, and each city was equivalent to a high-level race.<br/><br/>However, within a day, they were destroyed. Only the Lord of Jil City was still alive.<br/><br/>How terrifying was this power?\t\t\t\t\t\t</div>", "images": {}, "success": true}