{"id": 463, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072827.html", "title": "Chapter 3454 - 3454 3453 Above The Eternal Heaven City", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3454 - 3454 3453 Above The Eternal Heaven City</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3454 3453 above the Eternal Heaven City<br/><br/>Buzz! Buzz! Buzz<br/><br/>The Eternal Heaven City was a quiet and harmonious city to Wang Xian.<br/><br/>Wang Xian had a good impression of the city. It was more beautiful and peaceful.<br/><br/>At a place in front of the Eternal Heaven City, strange figures appeared one after another.<br/><br/>“Dragon King, the eight-headed Hydra has sent all the information over.”<br/><br/>Ao Yaoyao reported to Wang Xian from the side.<br/><br/>“Okay!”<br/><br/>Wang Xian nodded. “Let’s go in.”<br/><br/>He said faintly. With a wave of his arm, all the prongs entered the mother nest.<br/><br/>“Kill the lackeys of the angel race. Kill them one by one.”<br/><br/>King Aqua Tentacle lay on Wang Xian’s shoulder and roared ferociously.<br/><br/>“Alright, you have to hide your figure well. Don’t let the Angel race know about this. If they do, we will be doomed.”<br/><br/>Wang Xian reminded the king of water tentacles.<br/><br/>“Don’t worry, Dragon King. I, the king of water tentacles, am one of the strongest space beasts in the universe. I have my own innate ability. Under such changes, even the birds wouldn’t be able to recognize me.”<br/><br/>King water touch said confidently.<br/><br/>“That’s Good!”<br/><br/>Wang Xian smiled slightly. His body moved and he flew straight ahead.<br/><br/>He successfully entered Tianheng City. A guardian of Tianheng City flew in front of him.<br/><br/>“Dragon King, please follow me!”<br/><br/>“Okay!”<br/><br/>Under the lead of this parasitic poisonous horned dragon that was guarding Tianheng City, Wang Xian walked toward the center of Tianheng City.<br/><br/>After passing through many heavily guarded places with ease, Wang Xian arrived at a mansion.<br/><br/>“Dragon King!”<br/><br/>After entering the mansion, another poisonous horned dragon that was residing in Tianheng city came over and bowed respectfully.<br/><br/>Wang Xian had been setting up the four major cities for several years. The eight-limbed demonic fiend and the rest had already gone deep into their territory.<br/><br/>In Tian Heng City, the eight-limbed demonic fiend was currently residing in the body of a son of the city lord of Tian Heng City.<br/><br/>He knew most of the secrets.<br/><br/>“Dragon King, it’s very safe here. We can get the brothers of the thorned dragon species to come out.”<br/><br/>The member of the poisonous horned dragon species continued to speak respectfully.<br/><br/>“Alright.”<br/><br/>Wang Xian nodded his head. With a wave of his arm, 200,000 thorned dragon species appeared around him.<br/><br/>“This is the information of all the members of the army in Tian Heng City, including the powerhouses in their grotto-heaven blessed land.”<br/><br/>This poisonous horned dragon species passed the information to every thorned dragon species.<br/><br/>Wang Xian drew a demonic altar and an Lie’s figure appeared.<br/><br/>“Give one to an lie.”<br/><br/>In terms of assassination, it was easy for an lie to assassinate those weaker than him. He was even more terrifying than the thorned dragon species.<br/><br/>Since he was going to make a move this time, Wang Xian wanted to destroy the entire Tian Heng City.<br/><br/>Since they had already participated in the war, they had to pay the price for it.<br/><br/>In the face of a race war, there was no one who was innocent.<br/><br/>“Make your move in ten minutes!”<br/><br/>At this moment, a message came from Wang Xian’s universal AI.<br/><br/>The message was from the octahedron. Ten minutes later, he would shut down the detection array of the entire Tian Heng City.<br/><br/>If he wanted to recover, he would need at least half an hour.<br/><br/>And this would require the city leader to personally act.<br/><br/>Without the detection array, the assassination of the thorned dragon species would be even more convenient.<br/><br/>Tian Heng City was very powerful. However, there were only over 300,000 universe knights and above.<br/><br/>Over 300,000 was not a small number. After all, Tian Heng City’s power was considered not bad among the high-level races.<br/><br/>Not every race had such terrifying means of improvement as the Dragon Palace.<br/><br/>The number of universe knights in the Dragon Palace was extremely huge.<br/><br/>However, thinking about how an Archangel could easily destroy the dragon palace with a wave of his hand, Wang Xian had nothing to be proud of!<br/><br/>The quality of the experts in the Tian Heng city was much higher than the Dragon Palace. In terms of overall strength, excluding the three water dragon leaders of the Wang Xian Heaven Array, the overall strength of the entire dragon palace was only slightly higher than the Tian Heng City.<br/><br/>The main reason was that even though the combat strength of the Dragon Palace was at the Universe Knight level, most of the realms were at the void God Emperor level.<br/><br/>There were more universe knights at the first and second level of combat strength.<br/><br/>However, Tian Heng city was different. According to the information sent by the eight points, there were more than 20 peak universe knights among them.<br/><br/>This was much more than the Great Thunder Sound College of the Thunder Light race combined.<br/><br/>There were not so many Top-notch universe knights in the Dragon Palace.<br/><br/>“I have to do it myself!”<br/><br/>Wang Xian smiled and looked at the message sent by the Ba Qi.<br/><br/>This message was from the top-notch universe knights in Tian Heng City.<br/><br/>There were 20 of them. The rest of the Ba Qi did not know where they were at the moment.<br/><br/>However, this was enough.<br/><br/>Ten minutes passed very quickly. Wang Xian waved his hand and the incipient saint wings appeared on his back.<br/><br/>He began to move.<br/><br/>With his current speed, only the city lord and the first-level masters of the universe in the entire Tian Heng City would be able to capture him.<br/><br/>No one else would be able to capture him.<br/><br/>Even if he was flying in the sky.<br/><br/>Even if he hid himself, no one would be able to sense him even if the detection array was shut down.<br/><br/>With the precise location of the octahedron, he arrived at the nearest one. The Dragon Eyes of the yin-yang and five elements penetrated through a palace and landed on a lying lion demon.<br/><br/>This was an expert from the Tian Heng City.<br/><br/>“PFFT!”<br/><br/>In the next moment, his figure appeared in front of the lion demon expert and instantly killed him.<br/><br/>He didn’t even have the time to react before he died.<br/><br/>He didn’t die in pain.<br/><br/>With a wave of his arm, Wang Xian kept the body and disappeared.<br/><br/>“Hey, Dragon King, I can sense a water-type treasure. I want to get the treasure!”<br/><br/>At this moment, the king of water tentacles suddenly said.<br/><br/>“Don’t be discovered!”<br/><br/>Wang Xian ignored her and said directly.<br/><br/>“Don’t worry, Dragon King!”<br/><br/>The king of water tentacles moved and flew away immediately.<br/><br/>Wang Xian flapped his primaless sacred wings and arrived at the Second Peak Universe Knight.<br/><br/>Just like before, the other party was killed without any reaction.<br/><br/>With Wang Xian’s current strength, even a level one universe dominator of the same level could kill him instantly, let alone them.<br/><br/>“Ah! There’s an assassin!”<br/><br/>Just as Wang Xian killed 15 peak universe knights, a weak voice suddenly came from behind.<br/><br/>“Was he discovered?”<br/><br/>Wang Xian mumbled. He wasn’t surprised by this.<br/><br/>The success rate of assassinating the thorned dragon species wasn’t 100% . Some powerhouses had powerful treasures.<br/><br/>He didn’t stop and continued to kill his next target.<br/><br/>“Whoever dares to cause trouble in Tian Heng City is courting death!”<br/><br/>An angry shout came from the front. Following that, Wang Xian saw a burly old man flying over on the clouds.<br/><br/>“HMM? Hehe, perfect!”<br/><br/>Wang Xian smiled and his figure flashed. The old man who was stepping on the clouds disappeared instantly. His corpse had already been stored in the mother nest.<br/><br/>“Ahhh!”<br/><br/>At this moment, another scream was heard. Clearly, another thorned dragon species had been discovered.<br/><br/>“It’s going to end soon!”<br/><br/>Wang Xian did not show any signs of fluctuation and continued with his next target!\t\t\t\t\t\t</div>", "images": {}, "success": true}