{"id": 464, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072829.html", "title": "Chapter 3455 - 3455 3454. Below The Eternal Sky City", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3455 - 3455 3454. Below The Eternal Sky City</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3455 3454. Below the Eternal Sky City<br/><br/>“Someone is trying to assassinate the experts of our Eternal Sky City. Someone is trying to assassinate us!”<br/><br/>In the peaceful and quiet eternal sky city, screams and exclamations could be heard.<br/><br/>As more and more voices were heard, someone sensed that something was wrong. They flew to the sky and shouted sternly.<br/><br/>This voice resounded throughout the entire eternal Sky City.<br/><br/>“What’s going on? Someone is trying to assassinate the experts of Heavenly Heng City? How is this possible? Who Dares to act recklessly?”<br/><br/>“How Strange. There’s a battle over there. Why hasn’t the Heavenly Heng City’s defensive formation been activated? An investigative formation and an alarm formation? What’s going on?”<br/><br/>“Not good, another battle has erupted over there. What on Earth happened? Where are the Heavenly Heng City Guards? Where are the Heavenly Heng City Army and the experts of Heavenly Heng City?”<br/><br/>Following a few screams of terror, the residents of Tian Heng City also felt that something was wrong, and they all shouted in terror.<br/><br/>The quiet and peaceful city was now in an uproar.<br/><br/>Sou Sou<br/><br/>“Who is it? who dares to cause trouble in Tian Heng City?”<br/><br/>“All the guards of Tian Heng City immediately fly into the sky, and all the Great Beings with the power of universe knights in the army fly into the sky.”<br/><br/>At this moment, a figure flew into the sky from below. His body was exuding a terrifying aura.<br/><br/>This was a powerhouse at the peak of the universe knight level. It was also a powerhouse at the peak of the universe knight level who had not received any information from the eight-limbed.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>“It’s Sir Yao!”<br/><br/>In Tian Heng City, some powerhouses heard the order and immediately flew towards him.<br/><br/>“Oh?”<br/><br/>When Wang Xian heard this voice, a smile appeared on his face. He flapped his wings and quickly rushed over.<br/><br/>“Damn it, what’s going on? Why are there so few powerhouses in our Tian Heng City? Where are the other peak-stage universe knights? What’s with the array formation in the city?”<br/><br/>Lord Yao flew into the air and looked down at the entire city. When he saw the powerhouses of Tian Heng city flying over one by one, he became nervous.<br/><br/>The Pinnacle Universe Knights didn’t appear, and the array didn’t respond.<br/><br/>This gave him a bad feeling.<br/><br/>Hong<br/><br/>However, at this moment, he felt death enveloping him.<br/><br/>“It’s over!”<br/><br/>His heart sank, and his eyes revealed a look of despair.<br/><br/>Hong<br/><br/>A wave of destructive energy instantly swept over.<br/><br/>This terrifying energy covered an area of one billion kilometers.<br/><br/>“No!”<br/><br/>Within Tian Heng City, the powerful beings that were flying towards them became targets.<br/><br/>Their actions were akin to throwing away their lives.<br/><br/>The destructive energy swept past them and turned them into corpses.<br/><br/>In an instant, over 100,000 universe knights were killed!<br/><br/>“Weng!”<br/><br/>At this moment, everyone in Tian Heng City raised their heads and looked at this scene in shock.<br/><br/>Those over 100,000 strong people were actually killed in an instant!<br/><br/>“Not good, there are strong people invading our Tian Heng City!”<br/><br/>“Quickly run, quickly run, someone is attacking our Tian Heng City!”<br/><br/>Terrified voices sounded, and the entire Tian Heng city instantly fell into panic.<br/><br/>One figure after another flashed and quickly escaped from this place.<br/><br/>“Who is it? who attacked our Tian Heng City? Who killed my disciple? I’m going to kill you.”<br/><br/>Right at this moment, a great being from Tian Heng City rushed over and roared furiously.<br/><br/>The city leader of Tian Heng City flew to the sky above Tian Heng City, and his expression was extremely gloomy as he sensed his surroundings.<br/><br/>Under his sensing, there were not many universe knight level great beings in the entire city.<br/><br/>He couldn’t sense any universe knights at the pinnacle.<br/><br/>He was shocked and shocked.<br/><br/>How could this be!<br/><br/>He didn’t sense anything when something big happened in Tian Heng City.<br/><br/>Sou<br/><br/>He felt a terrifying energy attacking him, and his expression changed.<br/><br/>Weng<br/><br/>A fan appeared in front of him and dodged to the back.<br/><br/>Boom<br/><br/>However, the next moment, a terrifying energy collided with the fan, causing him to spit out blood. His body flew backward.<br/><br/>“Not good, Tian Xing, Attack!”<br/><br/>The city lord of Tianheng City’s eyes were blood-red as he shouted in fear.<br/><br/>“Sou, stop. Who Are You? You killed a disciple of our Tianheng city. Our Hundred Cities Alliance will not let you off!”<br/><br/>At this moment, another figure flew out from a blessed land below and attacked Wang Xian.<br/><br/>“As expected, you are one of the radiant masked men who besieged the Azure Dragon Moon last time!”<br/><br/>Wang Xian’s dragon eyes swept across a level one universe dominator who had appeared again. His eyes were filled with killing intent.<br/><br/>“Who are you?”<br/><br/>When the Heavenly Star City powerhouse heard Wang Xian’s words, his pupils constricted slightly as he shouted in horror.<br/><br/>“Who am I? Haha, Heavenly Star, right? You killed the ancestral dragon lineage. Heavenly Star City will have to pay the price for becoming the leader of the Holy Dragon Lineage!”<br/><br/>Wang Xian said with a face full of killing intent. His body moved and attacked him directly.<br/><br/>At the side, the five elements Millstone was emitting a terrifying power as it charged towards the city lord of Heavenly Star City.<br/><br/>“You’re spouting nonsense!”<br/><br/>Tian Xing’s face changed drastically as he retorted loudly.<br/><br/>“It doesn’t matter if you’re talking nonsense or not. You’re going to die today anyway!”<br/><br/>Wang Xian roared furiously as his body was emitting scorching flames.<br/><br/>The True Dragon’s body allowed him to conceal his aura.<br/><br/>Even if he were to be spread out, he would only guess that it was a fire-attributed powerhouse.<br/><br/>“You Want to kill me? Wishful Thinking!”<br/><br/>Tian Xing’s face changed drastically as a huge thunder hammer appeared in his hand.<br/><br/>“Crash!”<br/><br/>However, the next moment, he realized that Wang Xian’s figure had disappeared in front of his eyes instantly. This shocked him.<br/><br/>“It’s You!”<br/><br/>The familiar terrifying speed reminded him of the powerhouse who had saved the Azure Dragon Moon.<br/><br/>He cursed in his heart. He raised the Thunder Hammer and the terrifying thunder pillar descended to surround him.<br/><br/>“HMPH!”<br/><br/>Wang Xian snorted and flew around him rapidly.<br/><br/>He wanted to see how long the other party could last!<br/><br/>“Oh no, my body is already severely injured. I haven’t recovered yet. Damn it.”<br/><br/>Tian Xing sensed his surroundings and his heart sank. His body moved and he wanted to escape into the distance without any hesitation.<br/><br/>“You are seriously injured and you still want to escape!”<br/><br/>Wang Xian naturally saw Tian Xing’s condition clearly and his eyes revealed a look of disdain.<br/><br/>He unleashed the incipient saint wings to the maximum and arrived at the side of Tian Xing. His arm turned into a dragon claw and tore it apart.<br/><br/>Buzz<br/><br/>Tian Xing hurriedly raised his thunder hammer to block the attack. However, Wang Xian’s figure had already disappeared in the next moment.<br/><br/>“It’s over!”<br/><br/>He was shocked and a look of despair appeared on his face. “No!”<br/><br/>A terrified roar rang out.<br/><br/>“PFFT!”<br/><br/>The Dragon Claw penetrated Tian Xing’s body. Wang Xian snorted coldly and kept the corpse into the mother nest.<br/><br/>The next moment, he turned around and attacked the city lord of Tian Heng City.<br/><br/>“What!”<br/><br/>The city lord of Tian Heng City was struggling to deal with the attack of the Five Elements Millstone. When he sensed this, his expression changed.<br/><br/>It’s over. Tian Heng City was going to be finished, and so was he!\t\t\t\t\t\t</div>", "images": {}, "success": true}