{"id": 465, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072831.html", "title": "Chapter 3456 - 3456 3455, The Four Major Cities Were Destroyed. The Hundred Cities Alliance Was Shocked", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3456 - 3456 3455, The Four Major Cities Were Destroyed. The Hundred Cities Alliance Was Shocked</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3456 3455, the four major cities were destroyed. The Hundred Cities Alliance was shocked<br/><br/>“PFFT!”<br/><br/>The city lord of Tianheng City was very powerful. He even had an innate spiritual treasure in his hands.<br/><br/>However, it was still nothing in front of Wang Xian.<br/><br/>With the addition of the five elements millstone, it would be very difficult for Wang Xian to escape even if he was at the same level.<br/><br/>Unless he also had a treasure like the wings of the King of angels.<br/><br/>However, it was obvious that they could not have too many of such treasures.<br/><br/>Wang Xian’s dragon claw penetrated the body of the city lord of the Eternal Heaven City. A hint of coldness appeared on his face.<br/><br/>Two level one masters of the universe in the Eternal Heaven City were killed. This also represented the destruction of the entire Eternal Heaven City.<br/><br/>“Run, run, run!”<br/><br/>“The city Lord is dead. The entire Eternal Heaven City is finished. The entire Eternal Heaven City is finished.”<br/><br/>Those below who could escape back to their divine kingdom in an instant had all escaped.<br/><br/>Even those who could not escape in an instant flew out in fear.<br/><br/>They were afraid that the experts above would destroy the entire city directly.<br/><br/>This was not impossible.<br/><br/>Countless people in the entire city were flying around and escaping.<br/><br/>Wang Xian did not chase after them. It was enough for him to destroy all the experts in the Eternal Heaven City.<br/><br/>“Dragon King!”<br/><br/>At this moment, ao Yaoyao Bachi’s figure flew over. They revealed excited expressions.<br/><br/>“Dragon King, I’ve already taken control of the grotto-heaven blessed lands. I’ve also killed a few of them in a sneak attack.”<br/><br/>Ba Qi said with a smile.<br/><br/>“HMM, very good. How’s the collection of resources in Tian Heng City?”<br/><br/>Wang Xian smiled and asked.<br/><br/>“Everything is under control. Dragon King, war can help us improve quickly. The resources in Tian Heng city are too abundant.”<br/><br/>Ba Qi said excitedly.<br/><br/>There were many, many resources in Tianheng City. It was much more than the resources of the Dragon Palace.<br/><br/>It was enough for them to make a huge improvement.<br/><br/>“It’s enough for me to make a breakthrough!”<br/><br/>Wang Xian needed a lot of resources to make a breakthrough. The last time he destroyed the Great Thunderclap Academy and the other forces, he kept some divine herbs and medicinal pills.<br/><br/>In addition to the resources in the Eternal Sky City, it was more than enough to increase his strength.<br/><br/>However, it might be troublesome to achieve a breakthrough after the breakthrough.<br/><br/>However, he was not in a hurry.<br/><br/>This time, by destroying the Eternal Sky City and finding the Divine Kingdom of the Eternal Sky City Lord and the Heavenly Star, the Dragon Palace would be able to increase the combat strength of three level one masters of the universe.<br/><br/>The remaining large number of corpses would increase the number of people in the Dragon Palace by a lot.<br/><br/>War would be able to increase the strength of the Dragon Palace rapidly.<br/><br/>However, such an increase was also taking a huge risk.<br/><br/>If the Hundred Cities Alliance knew that it was done by the Dragon Palace, the Hundred Cities Alliance would be able to destroy the Dragon Palace before the Dragon Palace could prove that Tian Heng City had participated in the hunt for the ancestral dragon lineage.<br/><br/>By using war to increase their strength, everything was forced.<br/><br/>Wang Xian wanted to fight his way to the Angel clan.<br/><br/>“Order all the members to put away all the corpses and gather all the treasures. We need to leave Tianheng city as soon as possible.”<br/><br/>Although the teleportation formation of Tianheng City had been cut off, Wang Xian and the rest needed to leave as soon as possible in order to prevent any accidents.<br/><br/>After all, they were facing the powerful Hundred Cities Alliance.<br/><br/>“Let’s continue. Next Target.”<br/><br/>Two hours later, Wang Xian and the rest left Tian Heng City. He didn’t stop nor did he try to increase his strength.<br/><br/>Just now, Wang Xian received good news and bad news.<br/><br/>The bad news was that the water touch king had devoured a large amount of resources, which might not even be enough for him to increase his strength.<br/><br/>The good news was that her strength had recovered to the level one combat strength of a universe dominator. She could become a powerful helper.<br/><br/>Wang Xian didn’t stay any longer. Instead, he charged straight towards another city.<br/><br/>On the surface, there were two level one combat strength experts of a universe dominator in Darhou city.<br/><br/>Now, Mo Sha had already infiltrated their inner circle.<br/><br/>According to the information mo sha had obtained, there were only two experts in Darhou city.<br/><br/>One of them was confirmed to be severely injured and was recuperating in the grotto-heaven blessed land.<br/><br/>In order to prevent any accidents from happening, Wang Xian was prepared to act swiftly. He wanted to see if he could destroy all four cities in one go.<br/><br/>If that was the case, the strength of the Dragon Palace would increase by a lot.<br/><br/>Buzz<br/><br/>At this moment, an lie was shuttling back and forth rapidly. He brought Wang Xian along as he rushed towards Darhou city.<br/><br/>Buzz<br/><br/>They arrived at a city. Wang Xian entered the teleportation formation and arrived at Great Marquis City.<br/><br/>At this moment, only four hours had passed since the destruction of Tian Heng City.<br/><br/>In these four hours, Great Marquis City had already received the news of the destruction of Tian Heng City.<br/><br/>The Hundred Cities Alliance had already received the news the moment Tian Heng City was destroyed.<br/><br/>“Tian Heng City was destroyed? Was it done by the ancestral dragon lineage?”<br/><br/>“According to some sources, it was done by the ancestral dragon lineage. They assassinated a large number of experts in the Eternal Sky City, and the Eternal Sky City Lord and Lord Tian Xing, who had been hiding, were killed by the experts. However, all of this is still uncertain. According to our analysis, the ancestral dragon lineage doesn’t seem to have any powerful assassins.”<br/><br/>“Of course, the possibility of the ancestral dragon lineage is still very high. However, we can’t rule out other factions taking advantage of the situation and deliberately blaming the ancestral dragon lineage.”<br/><br/>At this moment, in the city Lord’s Manor of Great Marquis City, the city Lord sat on his throne while the experts below reported the news.<br/><br/>The destruction of heavenly city wasn’t a small matter to the Hundred City Alliance.<br/><br/>They had to investigate it clearly.<br/><br/>On the surface, heavenly city didn’t participate in the hunt for the ancestral dragon bloodline, and the experts of the ancestral dragon bloodline couldn’t casually kill the members of the Hundred City Alliance.<br/><br/>“From today onwards, let all the legions and city guards defend to prevent any accidents from happening.”<br/><br/>The Great Marquis City Lord said.<br/><br/>“Yes!”<br/><br/>Below, the subordinates immediately replied.<br/><br/>“Could it be the revenge of the experts of the ancestral dragon lineage? Could it be that the ancestral dragon lineage found out about the encirclement of the Azure Dragon Moon and what we did in secret?”<br/><br/>“It shouldn’t be, the chances of finding out should be very small.”<br/><br/>The Great Marquis City Lord Muttered.<br/><br/>“HM?”<br/><br/>At this moment, he felt something and immediately looked down.<br/><br/>“What’s going on? Someone opened the defensive formation of the grotto-heaven blessed land!”<br/><br/>His expression changed slightly.<br/><br/>The city Lord’s estate was located within the Grotto-heaven blessed land, and this grotto-heaven blessed land was a defensive type.<br/><br/>Once it was activated, even a level 2 universe ruler wouldn’t be able to break it.<br/><br/>However, this estate-world defensive formation would only be activated at the last moment.<br/><br/>Why was it suddenly activated?<br/><br/>Furthermore, within the Great Marquis City, there were only five people who knew how to activate the formation.<br/><br/>“Sou!”<br/><br/>At this moment, the Great Marquis City Lord felt a terrifying attack heading towards him.<br/><br/>The sudden attack caused his expression to change drastically.<br/><br/>“Weng!”<br/><br/>He moved his palm and a staff appeared in his hand.<br/><br/>“Pu!”<br/><br/>However, his speed was somewhat slow.<br/><br/>The incomparably sharp claws tore through more than half of his body. His eyes revealed a terrified expression as he wanted to escape.<br/><br/>However, at this moment, a tentacle pierced through his body.<br/><br/>Instant Kill!\t\t\t\t\t\t</div>", "images": {}, "success": true}