{"id": 468, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072837.html", "title": "Chapter 3459 - 3459 3458 Large Amount Of Resources", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3459 - 3459 3458 Large Amount Of Resources</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3459 3458 large amount of resources<br/><br/>The base camp of the Hundred Cities Alliance.<br/><br/>Although the Hundred Cities Alliance was only a loose alliance, they also had their own base camp.<br/><br/>This was a very unique location.<br/><br/>One hundred and eight mountain peaks towered into the clouds. These mountain peaks were close to each other.<br/><br/>Below the mountain peaks was a powerful defensive paradise. This paradise covered a total of one hundred and eight mountain peaks.<br/><br/>And at the top of each of these 108 mountain peaks, there was a treasure floating in the air.<br/><br/>An innate spiritual treasure.<br/><br/>These innate spiritual treasures complemented each other, and the energy completely connected together, forming an incomparably terrifying array.<br/><br/>An array formed by 108 innate spiritual treasures, what kind of power was this?<br/><br/>In addition to this powerful and defensive grotto-heaven, if there was a level 3 magus with the Combat Power of a universe ruler overseeing it, it would definitely have the power to fight against a true universe ruler.<br/><br/>This was the headquarters of the Hundred Cities Alliance. These innate spiritual treasures were all placed here in cities.<br/><br/>At this moment, within these 108 mountain peaks, figures were rapidly flying towards a mountain peak in the center.<br/><br/>“Alliance leader, something has happened.”<br/><br/>Figures filled with powerful might flew over and entered a cave abode.<br/><br/>In the center of the cave, there was a figure sitting cross-legged.<br/><br/>This figure had the head of a water dragon, a golden body, and a golden dragon tail.<br/><br/>On his body, there were strange and strange patterns.<br/><br/>With a glance, one could guess that this was a wizard.<br/><br/>In the current universe, for wizards, if they wanted to transplant a body, the best choice would be the divine dragon lineage, followed by the space beasts that were comparable to the peak races.<br/><br/>This was because the divine dragon lineage no longer had any experts. If a wizard dared to transplant the corpses of the Phoenix race, elite race, and other peak races, they would be directly killed by that peak race. Even if you wanted to escape, you wouldn’t be able to.<br/><br/>Even if you became an ancestral wizard, you would still have to die.<br/><br/>Therefore, the corpses of peak races were taboo, and the divine dragon lineage was the best choice.<br/><br/>“The experts of the Heavenly Balance City, the Great Marquis City, and the Light Dragon City have all fallen. I’ve already sensed it.”<br/><br/>The Alliance Master of the Hundred Cities Alliance opened his eyes and said expressionlessly.<br/><br/>“Yes, not only that, there’s also Jil City. Although the city master of Jil City hasn’t died, all of their experts and disciples have been killed. It’s somewhat strange and terrifying. The other party’s strength seems to be very terrifying. They’ve destroyed four great cities in more than ten hours, and more than 95% of the elite disciples and experts have been killed or injured.”<br/><br/>An old man nodded and said with a grave expression.<br/><br/>It was still fine for their hundred cities alliance if their cities were destroyed, but such a method of destruction and such a terrifying speed made their hundred cities alliance feel apprehensive.<br/><br/>“Tian Heng City, Ji Ri City, Guang Shou Dragon City, and Great Marquis City joined forces a few years ago. The last time was when they failed to kill an azure dragon from the ancestral dragon lineage and were saved by an expert who suddenly appeared. We suspect that they were exposed during that time.”<br/><br/>An expert with a human body and a beast head analyzed the situation.<br/><br/>“The other party clearly planned for a long time and came prepared. Otherwise, they wouldn’t have destroyed the four great cities in a short day. Take this and go investigate.”<br/><br/>The alliance leader of the Hundred Cities Alliance moved his hand, and a water mirror appeared in his hand. “Find out who did it!”<br/><br/>“Alliance leader, Alliance leader, if it’s the ancestral dragon lineage, then we…”<br/><br/>An old man’s eyes flickered.<br/><br/>“If it’s the ancestral dragon lineage, then treat it as if we haven’t found the murderer. If it’s not, then destroy it.”<br/><br/>The alliance leader of the Hundred Cities Alliance said indifferently.<br/><br/>The rest of the people nodded slightly.<br/><br/>The Hundred Cities Alliance didn’t want to become enemies with the ancestral dragon lineage.<br/><br/>No… They didn’t dare to completely lose all decorum with the ancestral dragon.<br/><br/>They could just act in secret!<br/><br/>They were also afraid that the ancestral dragon would jump over the wall in desperation and drag them down with them.<br/><br/>The group of people moved and quickly disappeared.<br/><br/>The Alliance Master of the Hundred Cities Alliance was still sitting there with his legs crossed, not moving at all.<br/><br/>…<br/><br/>“Dragon King, our gains this time are simply too bountiful. It’s still faster to obtain resources through war.”<br/><br/>At the same time, in the Dragon Palace, the eight-limbed demonic fiend and the rest spoke with excitement.<br/><br/>“It’s faster, but the risk is too great!”<br/><br/>Wang Xian shook his head slightly and said, “Moreover, this is only after you guys had laid out your plans for a few years.”<br/><br/>If it weren’t for the poisonous horned dragon species laying out their plans a few years earlier, the operation this time wouldn’t have been so smooth.<br/><br/>Once the battle started, the alert of the entire city would sound. By then, it would be difficult to kill half of the enemy’s experts.<br/><br/>“Dragon King, we have to be careful. Although I’ve removed all traces of our battle, if the Hundred Cities Alliance has powerful wizards or treasures, they might still be able to find us.”<br/><br/>Tian Chen said from the side.<br/><br/>“That’s right. The Hundred Cities Alliance is very powerful. They are also a relatively powerful existence in the inner continent. There is a high possibility that they will trace us here.”<br/><br/>Wang Xian nodded his head in agreement. However, he did not pay too much attention to it. The Hundred Cities Alliance was very powerful, but it was not like the Dragon Palace did not have any trump cards.<br/><br/>“The corpses and resources we obtained this time are mainly used to raise the strength of the thorned dragon species and the poisonous horned dragon species. We will first raise the strength of the two dragon species.”<br/><br/>Wang Xian instructed.<br/><br/>“Yes!”<br/><br/>The eight-headed demon Ao Yao and the rest replied immediately.<br/><br/>“Upgrade it immediately!”<br/><br/>He waved his hand and looked at the position in front of him. “Prime Minister Gui!”<br/><br/>“I’m Here!”<br/><br/>Prime Minister Gui replied immediately.<br/><br/>“Send someone to guard the surroundings. We must be careful.”<br/><br/>Wang Xian instructed.<br/><br/>“Yes!”<br/><br/>Prime Minister Gui replied immediately and gave an order.<br/><br/>Buzz<br/><br/>Wang Xian waved his arm and a large number of treasures appeared in the Dragon King’s palace.<br/><br/>“Dragon King, Dragon King, there are many water-type treasures. Can you give them all to me? TSK TSK, this will allow me to recover a lot.”<br/><br/>The king of water tentacles looked at the water-type treasures in front of him and his eyes lit up.<br/><br/>“Water-type divine fruits and herbs are fine, but treasures are not.”<br/><br/>Wang Xian said plainly.<br/><br/>How many treasures were there in the four cities?<br/><br/>It was extremely terrifying. There were fifteen innate spiritual treasures alone.<br/><br/>Most of them were of the five elements while three of them were of the light element.<br/><br/>The only things that were not useful were two of the wind-type and one of the Thunder-type.<br/><br/>These treasures would allow the five elements grinding to improve without any problems. The yin-yang Dragon Plate would also be able to improve easily.<br/><br/>“Alright!”<br/><br/>The king of water touch felt a little helpless when she heard Wang Xian’s words.<br/><br/>“Eh, Dragon King, I can sense that there is a very powerful treasure inside.”<br/><br/>All of a sudden, the king of water touch sensed something and flew directly toward a black bottle.<br/><br/>“Huh?”<br/><br/>Wang Xian was slightly stunned when he heard her words. He immediately looked over.<br/><br/>For the king of water touch to say that it was a treasure, it was definitely not simple. At the very least, it was above an innate spiritual treasure.\t\t\t\t\t\t</div>", "images": {}, "success": true}