{"id": 474, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072849.html", "title": "Chapter 3465 - 3465 3464 Strong Enemies Had Arrived", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3465 - 3465 3464 Strong Enemies Had Arrived</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3465 3464 strong enemies had arrived<br/><br/>“You must be careful. Don’t be careless. First, check whether the Hundred Cities Alliance has become the Lackey of the ancestral dragon lineage!”<br/><br/>Wang Xian reminded the eight-limbed demonic fiend.<br/><br/>“It’s the Dragon King. We, the poisonous horned dragon species, will ensure the completion of the mission perfectly.”<br/><br/>The eight-limbed demonic fiend guaranteed.<br/><br/>Wang Xian still trusted the eight-limbed demonic fiend very much. He nodded at them.<br/><br/>The two of them led their subordinates and left immediately. They began to invade the cities of the Hundred Cities Alliance.<br/><br/>Perhaps in less than a year or two, they would be able to easily take control of a city.<br/><br/>This might seem like a long time to Wang Xian and the rest. However, to the other races in the mainland, it was simply too fast and terrifying.<br/><br/>Time continued to pass day by day.<br/><br/>As the Dragon Palace was unable to teleport through the demonic dragon altar, there was only one way to transfer the main Dragon Palace to the river of eternity. It was to bring it along and fly.<br/><br/>Obviously, it was impossible to bring it along. They would be killed by the Hundred Cities Alliance halfway.<br/><br/>In that case, they might as well stay here. This would make the dragon palace safer.<br/><br/>“It’s just ahead. The location of the Dragon Palace is just ahead.”<br/><br/>Three months later, the Golden Wind West desolate beast reached the edge of the Horn of the sea. They were only one step away from the Dragon Palace.<br/><br/>On the Golden Wind West Desolate Beast’s body, the leading elder looked at the map with a terrifying killing intent in his eyes.<br/><br/>“The Dragon Palace should be able to guess that we are coming. Be careful. Even if we can’t destroy all the disciples of the Dragon Palace, we have to destroy their nest.”<br/><br/>The great being with the huge eyes on his head said coldly.<br/><br/>“Yes, Lord Eye!”<br/><br/>The 15 universe ruler Level 1 great beings immediately responded.<br/><br/>“At this position, the grotto-heaven blessed land won’t be very strong. The defensive grotto-heaven blessed land won’t be able to withstand our attacks.”<br/><br/>An old woman holding a staff said indifferently.<br/><br/>“That’s right. Golden Wind West entered the ocean, not far ahead.”<br/><br/>The old man in the lead transmitted his voice to the desolate beast.<br/><br/>“Peng!”<br/><br/>When they entered the ocean, energy was transmitted to their surroundings.<br/><br/>“Reporting to the Dragon King. I sense a powerful energy flying towards our Dragon Palace.”<br/><br/>In the Dragon Palace, the guards of the Dragon Palace immediately sensed that a terrifying existence was approaching.<br/><br/>Wang Xian opened his eyes. Without any hesitation, he instantly appeared above the Dragon Palace and stared ahead.<br/><br/>His dragon eyes flickered. He saw a thousand-meter-wide desolate beast flying towards him at a terrifying speed.<br/><br/>There were more than twenty figures on the desolate beast.<br/><br/>“It’s pretty fast.”<br/><br/>Wang Xian mumbled as his eyes sparkled.<br/><br/>“Roar Roar Roar!”<br/><br/>At this moment, the cursed dragons in the surroundings roared. They were scattered all over the Dragon Palace and were ready to fight at any time.<br/><br/>Of course, their battle was purely suicidal.<br/><br/>“Is that the Dragon Palace? We have been discovered!”<br/><br/>“HMPH, the power that the Dragon Palace is emitting is merely so-so. I can destroy it easily!”<br/><br/>The experts from the Hundred Cities Alliance appeared in Wang Xian’s line of sight. Naturally, the Dragon Palace appeared in his line of sight as well.<br/><br/>“This is their lair? Trash!”<br/><br/>The powerhouses spoke without hiding anything.<br/><br/>“Attack!”<br/><br/>Wang Xian looked at the powerhouses of the Alliance of 100 cities. Without any hesitation, he immediately ordered the cursed dragon to attack.<br/><br/>In an instant, 20 cursed dragons flapped their huge wings and attacked them directly.<br/><br/>“You dare to attack us? You are courting death!”<br/><br/>Seeing that the members of Dragon Palace dared to attack them, the eyes of the Hundred City Alliance turned cold.<br/><br/>“Ants!”<br/><br/>A great being with the Combat Power of a universe ruler at level two waved his arm, and a stream of water swept toward the cursed dragons.<br/><br/>Pu! Pu! Pu<br/><br/>The 30 cursed dragons couldn’t resist at all. The moment the stream of water passed through them, their bodies collapsed.<br/><br/>A black energy instantly disappeared.<br/><br/>“Oh? Something is wrong, not good!”<br/><br/>Suddenly, the huge eye of the expert called Lord eye shone with a blood-red light. His expression changed drastically as he looked towards the expert who had attacked.<br/><br/>That expert’s body stiffened at this moment. He sensed something and hurriedly looked towards his arm.<br/><br/>Strange black patterns appeared on his body and spread to his entire body.<br/><br/>“Not good! That’s a cursed creature!”<br/><br/>The expression of the level two universe master changed drastically, and he yelled in terror.<br/><br/>“Ahhhhh!”<br/><br/>The next moment, a miserable scream came out of his mouth.<br/><br/>Their bodies slowly turned black, slowly turning into ashes and smoke.<br/><br/>In fact, in a city Lord’s mansion of the Hundred City Alliance, hundreds of thousands of figures suddenly froze. Their bodies were extended by the black curse, and they died instantly.<br/><br/>A universe ruler level two expert had just arrived at the Dragon Palace, and he died just like that.<br/><br/>“Roar Roar Roar!”<br/><br/>At this time, another roar came. This time, more than a hundred cursed dragons attacked them.<br/><br/>“Damn it, why are there so many cursed creatures in the Dragon Palace? These cursed creatures are terrifyingly powerful, and the power of their curses is even stronger. We absolutely can’t kill them.”<br/><br/>The old man in the lead warned loudly. His body shook and formed a defensive barrier.<br/><br/>Bang! Bang<br/><br/>The cursed dragons flew forward and were blocked by the defensive barrier. They couldn’t break through the other party’s defense at all.<br/><br/>“Roar!”<br/><br/>However, at this time, all the cursed dragons surrounding the Dragon Palace let out a roar in unison.<br/><br/>“All of them are universe knight level cursed dragons, you can’t kill them.”<br/><br/>The Eye Lord’s huge eyes scanned the area, his gaze cold.<br/><br/>“I didn’t expect this dragon palace to have such a trump card, using the cursed creatures to protect their nest.”<br/><br/>The old woman swept her gaze across and spoke in a sinister tone.<br/><br/>“Dragon Palace, if you dare to destroy the four cities of the Hundred Cities Alliance, you are the enemy of the Hundred Cities Alliance. We will definitely destroy all of you. Don’t think that some cursed creatures will be able to save your lives!”<br/><br/>The old man in the lead stared at the people below and roared with an ugly expression.<br/><br/>“Hehe, the four cities of the Hundred Cities Alliance and Tian Heng City have secretly killed the disciples of the Dragon Palace. Of course, I will destroy them. Didn’t the Hundred Cities Alliance not interfere in the individual battles of the cities? Why are they interfering now?”<br/><br/>Wang Xian stood above the dragon palace and swept his gaze across them.<br/><br/>Eight universe masters with level two combat strength.<br/><br/>Fifteen universe masters with level one combat strength.<br/><br/>This power was indeed strong.<br/><br/>It seemed that the other party wanted to completely destroy the Dragon Palace.<br/><br/>“The four great cities have already been destroyed by Your Dragon Palace. Naturally, Your Dragon Palace can splash dirty water on them at will.”<br/><br/>The old man in the lead said coldly, “Since you dare to destroy the Dragon Palace, you must pay the price. This price is destruction!”\t\t\t\t\t\t</div>", "images": {}, "success": true}