{"id": 479, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072859.html", "title": "Chapter 3470 - 3470 Didn’T The Dragon Palace Kill 3469 Randomly", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3470 - 3470 Didn’T The Dragon Palace Kill 3469 Randomly</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3470 Didn’t the Dragon Palace Kill 3469 randomly<br/><br/>Old Star City was destroyed. It was a big city and a powerful high-level race.<br/><br/>In just a few minutes, it was completely destroyed.<br/><br/>This shocked everyone.<br/><br/>“Didn’t the disciples of the Dragon Palace kill the disciples of the Hundred Cities Alliance casually? Wasn’t the Dragon Palace easily suppressed? How come another city of the Hundred Cities Alliance was destroyed?”<br/><br/>“What’s going on? Didn’t the Hundred Cities Alliance not put the Dragon Palace in their eyes at all? Didn’t the Dragon Palace not have any power to resist? Now another city has been destroyed?”<br/><br/>Compared to the shock and fear of the disciples of the Hundred Cities Alliance, the other forces were even more shocked.<br/><br/>Ever since they learned that Tianheng City and the others had been destroyed by the Dragon Palace, the attitude of the Hundred Cities Alliance had never put the Dragon Palace in their eyes.<br/><br/>The Dragon Palace was easily suppressed, and some disciples of the Dragon Palace were easily killed.<br/><br/>The powerful warriors and disciples of the mainland all thought the same.<br/><br/>But now, Star Old City was destroyed, and the powerful warriors of the Dragon Palace took action.<br/><br/>This was shocking.<br/><br/>Star Old City’s strength was definitely not weak in the 100 City Alliance.<br/><br/>There were even two universe masters with first-level battle power personally overseeing it.<br/><br/>Now, two universe masters with first-level combat strength were killed, and the city was destroyed.<br/><br/>And the Great Beings of the Dragon Palace escaped easily.<br/><br/>If the Dragon Palace could destroy star old city, did that mean that it could also destroy other cities?<br/><br/>Could the Dragon Palace be easily killed?<br/><br/>The people of the Hundred City Alliance also thought of this question.<br/><br/>The Dragon Palace couldn’t be easily killed.<br/><br/>On the contrary, the other side’s revenge would be unbearable for them.<br/><br/>If one day the Dragon Palace’s experts came to their cities, they might be destroyed.<br/><br/>The Hundred Cities Alliance was originally a neutral force. They formed an alliance to protect themselves.<br/><br/>In essence, every city was neutral.<br/><br/>But now, their peace was completely broken.<br/><br/>They were passively participating in the battlefield.<br/><br/>This made many citizens of the Hundred Cities Alliance unhappy, and the city Lord asked the Hundred Cities Alliance to give them an explanation as soon as possible.<br/><br/>Some cities formed by races were still fine, and they were more united.<br/><br/>But more importantly, the citizens of the Hundred Cities Alliance lived in the cities because the cities were more peaceful, and they didn’t participate in any wars.<br/><br/>There was a safety net!<br/><br/>Now that there was no safety net, why did they still stay in the Hundred City Alliance?<br/><br/>Was it not good to go to other cities?<br/><br/>Especially for those merchants.<br/><br/>…<br/><br/>“Something happened to the alliance leader. Star Old City was destroyed by Dragon Palace!”<br/><br/>At the same time, at the headquarters of the Hundred City Alliance, five Great Beings of the Hundred City Alliance flew to the center of the mountain and reported with an embarrassed expression.<br/><br/>“There’s A level two universe master in Dragon Palace?”<br/><br/>The alliance leader of the Hundred City Alliance opened his eyes and frowned slightly.<br/><br/>“Yes, it’s a dark godly dragon. It’s very powerful and destroyed star Old City in a very short time. Now, some people in the Hundred City Alliance are worried that their city will be attacked.”<br/><br/>The old man in the lead said.<br/><br/>The Hundred Cities Alliance was different from some other races. The races were very united.<br/><br/>The cities of the Hundred Cities Alliance attracted disciples and experts through neutrality and peace.<br/><br/>Without Peace, the foundation would be scattered.<br/><br/>“Dark Dragon? Did the other party wipe out their own aura?”<br/><br/>The alliance leader of the Hundred Cities Alliance asked.<br/><br/>“No, the people we sent haven’t arrived yet.”<br/><br/>Everyone shook their heads.<br/><br/>“I’ll go personally.”<br/><br/>The alliance leader of the Hundred Cities Alliance who was sitting cross-legged slowly stood up and said coldly.<br/><br/>He was over ten meters tall and had the head of a divine dragon and the tail of a golden dragon. His body was like that of a human, but there were terrifying eyes on his chest, each eye was the size of an ordinary human’s head.<br/><br/>“Whoosh!”<br/><br/>The leader of the Hundred Cities Alliance disappeared, but the five experts didn’t follow him.<br/><br/>Even with their speed, they couldn’t keep up.<br/><br/>A day later, the leader of the Hundred Cities Alliance appeared in the sky above Old Star City.<br/><br/>At his chest, each eye scanned the area below.<br/><br/>There were ruins below, but those eyes seemed to be able to travel through time.<br/><br/>Soon, one of the dozen eyes on his chest slowly turned pitch-black.<br/><br/>On It, a divine dragon appeared.<br/><br/>He slowly stretched out his hand.<br/><br/>It was an abnormally terrifying claw with sharp thorns and a strange suction cup.<br/><br/>He grabbed the eye on his chest and forcefully removed it.<br/><br/>His figure started to turn illusory.<br/><br/>Soon, he reappeared at the base of the Hundred Cities Alliance.<br/><br/>Within that mountain peak, five figures were still waiting.<br/><br/>“Alliance Master!”<br/><br/>Seeing the Hundred Cities Alliance’s Alliance master return, they immediately bowed.<br/><br/>“Red-eye, take this eye of mine and go find that Black Dragon and kill it!”<br/><br/>The Hundred Cities Alliance’s Alliance master handed his eye to the expert with the eye.<br/><br/>“It’s the alliance master, I’ll Go Now!”<br/><br/>Red-eye looked at the eye with a burning expression.<br/><br/>This eye not only had powerful abilities, but it also had part of the Alliance Leader’s power.<br/><br/>“No Rush. I’ll contact the experts of the sacred dragon lineage and ask them to send experts with you. The Dragon Palace is obviously an enemy of the sacred dragon lineage. They have to help!”<br/><br/>The Alliance Master of the Hundred Cities Alliance added.<br/><br/>“Yes!”<br/><br/>Red Eye nodded.<br/><br/>“Also, inform all the city lords of the Hundred Cities Alliance to set up a special teleportation formation. If any city is in danger, immediately call for help.”<br/><br/>The Alliance Master of the Hundred Cities Alliance continued to give orders.<br/><br/>“Yes!”<br/><br/>The five experts of the Hundred Cities Alliance immediately replied and left quickly.<br/><br/>The Alliance Master of the Hundred Cities Alliance looked at the place where they left and fell into deep thought.<br/><br/>…<br/><br/>The Hundred Cities Alliance was in an uproar. The strong disciples of the various races were discussing among themselves.<br/><br/>At this moment, Wang Xian had already arrived at the land of the demonic bones.<br/><br/>“It’s really hard to imagine what kind of war it is to be able to produce so many terrifying corpses.”<br/><br/>Wang Xian hovered above the edge of the land of the demonic bones. He looked down in astonishment.<br/><br/>At a glance, there were all kinds of withered bones.<br/><br/>There were even withered bones within a million kilometers. He couldn’t see the edge at all.<br/><br/>According to the records, it would take about ten years for a level one master of the universe to fly over this land of devil bones.<br/><br/>How vast was this area?<br/><br/>Why were there so many corpses here?<br/><br/>What kind of great battle had happened here?<br/><br/>Any powerhouse who came here might have such thoughts. It was too shocking!<br/><br/>“Some people said that the land of demonic bones was once a battlefield of the Apocalypse.”<br/><br/>Wang Xian mumbled. He thought of some guesses about the land of demonic bones. This was also a guess that was the closest to the answer.<br/><br/>Every Apocalypse was a calamity for all lives.<br/><br/>When the calamity began, even the races at the peak of the universe would be exterminated.<br/><br/>In fact, it would be considered pretty good if half of the races at the peak of the universe still existed even when the calamity began and ended.\t\t\t\t\t\t</div>", "images": {}, "success": true}