{"id": 478, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072857.html", "title": "Chapter 3469 - 3469 Wasn’T The 3468 Dragon Palace Killed Casually?", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3469 - 3469 Wasn’T The 3468 Dragon Palace Killed Casually?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3469 Wasn’t the 3468 Dragon Palace killed casually?<br/><br/>“Roar Roar Roar! You Dare to kill the Disciples of our Dragon Palace? You dare to destroy more than half of Haotian City? Since that’s the case, from today onwards, the disciples of our Dragon Palace will also kill all the powerful disciples of the Hundred Cities Alliance.”<br/><br/>“All the living beings in the Hundred Cities Alliance are regarded as the enemies of the Dragon Palace. You Die or I Die!”<br/><br/>When Wang Xian heard the voice coming from the grotto-heaven blessed land in the Old Star City, he also roared with a grim expression.<br/><br/>This time, he did not hide anything and acted directly as a member of the Dragon Palace.<br/><br/>Streams of terrifying energy swept across the entire city. Below, a large number of strong disciples from Old Star City were killed by Wang Xian before they could escape.<br/><br/>Under Wang Xian’s terrifying speed, the entire city was destroyed rapidly.<br/><br/>“Damn it, damn it, Dragon Palace. Our Old Star City is at war with you. We will not rest until one of You is dead!”<br/><br/>Inside the defense of the grotto-heaven blessed land, the two level one universe overlords of Old Star City were roaring ferociously.<br/><br/>However, they did not dare to go out. They could sense the terrifying strength of Wang Xian.<br/><br/>If they went out, they would only be courting death. It would be useless.<br/><br/>Now, they could only watch helplessly as their cities were destroyed and countless of their citizens were destroyed.<br/><br/>They could only helplessly pass on the news to the Hundred City Alliance.<br/><br/>Time passed, and a Gray Sea of fire rose up in Star Old City.<br/><br/>Ten minutes later, the entire city was in ruins.<br/><br/>The sounds of attacks disappeared.<br/><br/>“Too fast, too fast. Didn’t they say that there are no universe rulers with level-two combat power in Dragon Palace? Why does it feel like the invaders are even more terrifying than universe rulers with level-two Combat Power?”<br/><br/>Inside the defense of the Blessed Land, the two universe masters with level-one combat power in Star Old City looked extremely embarrassed.<br/><br/>Their bodies were trembling violently.<br/><br/>Their cities had been destroyed so quickly.<br/><br/>Their homes had been completely wiped out.<br/><br/>“Has the Alliance leader replied yet? Have the Great Beings from our alliance arrived yet?”<br/><br/>An expert from Old Star City asked with an awkward expression.<br/><br/>“The experts from the alliance have already arrived, but it’s useless. His movements are too fast, and the teleportation array has been destroyed. How did he manage to enter the city so smoothly?”<br/><br/>Another expert shook his head.<br/><br/>“This… what exactly happened? How did this happen?”<br/><br/>“Our city has actually been destroyed, destroyed!”<br/><br/>Within the defenses of the blessed land, some great beings who were in closed-door cultivation had just received the news. They flew out and looked at the ruins outside, their bodies trembling violently.<br/><br/>“It won’t end so easily. All of You, die!”<br/><br/>All of a sudden, a voice that shocked everyone was heard.<br/><br/>Two great beings with the Combat Power of universe masters at level one of Star Old City turned their heads and roared in disbelief.<br/><br/>“PFFT! PFFT!”<br/><br/>The next moment, they saw a figure passing by their eyes. Their vitality was draining rapidly!<br/><br/>How was this possible?<br/><br/>How did he enter the defense of the grotto-heaven blessed land?<br/><br/>When these two thoughts disappeared, they had already turned into corpses.<br/><br/>Ten seconds later, the entire grotto-heaven blessed land fell silent.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian said in a low voice. An Lie’s figure appeared and disappeared with him in an instant.<br/><br/>An hour later, he had arrived at an extremely distant place.<br/><br/>This was the first time Wang Xian had come to this place. He didn’t know where it belonged to.<br/><br/>“Hehe! Although it’s a little risky, it’s very satisfying. I would like to see if your hundred cities alliance can still be as arrogant as before.”<br/><br/>Wang Xian smiled faintly and checked the map.<br/><br/>“Eh, the land of the Devil’s Bones?”<br/><br/>He looked at the information on the map of the universe’s AI and was slightly taken aback.<br/><br/>The land of the Devil’s Bones was a location at the edge of the skeleton race, a race at the peak of the universe. According to rumors, this was a place where a great battle took place in the previous era.<br/><br/>There were countless corpses buried here. The corpses had turned into bones over time.<br/><br/>There were experts who had dug down for millions of kilometers, but they were still corpses.<br/><br/>Most of the corpses had no energy left, only a strong hardness.<br/><br/>Because they had lost all kinds of energy, they were not much different from firm rocks.<br/><br/>But among these corpses, there were some that still contained energy. These corpses were called demon bones.<br/><br/>Some demon bones gave birth to sentience and turned into a skeleton.<br/><br/>There were also some demon bones that did not give birth to sentience and turned into demon skeletons that only knew how to kill and their thoughts were chaotic!<br/><br/>Some demon bones were refined into treasures and possessed powerful offensive power.<br/><br/>This was a treasure land and also a dangerous place.<br/><br/>However, according to the information on the A.I. , Magi appeared here and there were strong experts of the darkness attribute.<br/><br/>There were also a few powerful clans and forces in the land of magic bones.<br/><br/>One of the clans and forces of the Wizards was extremely terrifying.<br/><br/>I can take a look around. If I can obtain some magic bones, I can even upgrade the Tai Chi Dragon Plate<br/><br/>Wang Xian thought to himself.<br/><br/>After flying out of Old Star City, he did not return to the blessed land in the water in the sky.<br/><br/>Although it was very safe there.<br/><br/>However, after coming out this time, he had the intention of improving himself.<br/><br/>If he could make another breakthrough, he could directly fight against the Hundred Cities Alliance head-on.<br/><br/>“Go ahead and take a look!”<br/><br/>Wang Xian looked at the map and flew towards the edge of the land of the demonic bones.<br/><br/>…<br/><br/>Just as Wang Xian stepped into the land of the demonic bones, the universe ai in the area of the Hundred Cities Alliance, which was located in the region of the Hundred Cities Alliance, was completely in an uproar.<br/><br/>The destruction of Old Star City, countless disciples of Old Star City, and even two level one masters of the universe were killed. This caused a huge commotion.<br/><br/>During this period of time, the Hundred Cities Alliance was extremely powerful. Not long ago, they even destroyed a few disciples of the Dragon Palace in a small city and more than half of the city.<br/><br/>Although they apologized, it was obvious that they were warning other neutral forces that it was best to forbid the disciples of the Dragon Palace from entering. Otherwise, they would bear the consequences.<br/><br/>This also made many disciples and citizens of the Hundred Cities Alliance feel proud.<br/><br/>This represented the strength and heritage of their hundred cities alliance.<br/><br/>Since the Hundred Cities Alliance said that they wanted to destroy the Dragon Palace, the Dragon Palace’s lair had been suppressed, and their disciples had been killed.<br/><br/>This made the disciples and citizens of the Hundred Cities Alliance think that the Dragon Palace was just so-so.<br/><br/>Offending them was simply courting death.<br/><br/>However, today, when the news of Old Star City being destroyed spread out, all the disciples and citizens of the hundred cities alliance trembled violently.<br/><br/>“How… How is this possible? The Dragon Palace destroyed another city of Our Hundred City Alliance, and this time, they didn’t let go of the citizens who survived there. Countless people were killed and injured. This… this…”<br/><br/>“What the hell is going on? How did the other party do it? There aren’t many universe rulers in Old Star City, but in terms of disciples and armies, they can be ranked in the top 15 of the Hundred City Alliance. How could they be destroyed so quickly?”<br/><br/>The disciples of the Alliance were discussing in disbelief.\t\t\t\t\t\t</div>", "images": {}, "success": true}