{"id": 472, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072845.html", "title": "Chapter 3463 - 3463 3,462 Strong Enemies Arrived", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3463 - 3463 3,462 Strong Enemies Arrived</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3463 3,462 strong enemies arrived<br/><br/>“Another Dragon God bloodline joined in? Now the Hundred Cities Alliance has issued a kill order, kill any disciples of the Dragon Palace without mercy.”<br/><br/>“The universe AI can search for information about the Dragon Palace, this dragon palace is so fierce in the outer area and the edge of the Universe!”<br/><br/>On this day, when the Hundred Cities Alliance issued a kill order and announced this information on the universe AI, it caused countless disciples to boil with excitement.<br/><br/>A new faction of the Dragon God lineage, this caused countless people to be extremely curious.<br/><br/>When they searched for information about the Dragon Palace on the AI, they were also extremely surprised.<br/><br/>This Dragon Palace’s battle record was very glorious!<br/><br/>“The Hundred Cities Alliance wants to make an enemy of this dragon God lineage, this is getting more and more lively.”<br/><br/>“It should be a mission from the Hundred Cities Alliance, causing the disciples of the Dragon Palace to be killed by mistake, hence the dragon palace retaliated against a few large cities. However, for this Dragon Palace to be able to wipe out four large cities within a day and wipe out several universe ruler Level 1 warriors, their own strength is definitely not weak.”<br/><br/>“The Dragon Palace is courting death. Do they think they have the strength of the ancestral dragon lineage? They actually dare to make an enemy of our hundred cities alliance. They don’t know what’s good for them!”<br/><br/>Some people guessed on the AI, and some disciples of the Hundred Cities Alliance spoke up.<br/><br/>In short, the name of the Dragon Palace had completely entered the eyes of all the races and powers within the Heaven Opening Primal Chaos.<br/><br/>To be able to destroy four cities in a day, it was considered a relatively powerful high-level race within the clan.<br/><br/>“Eh? The Dragon King Xian of the Dragon Palace actually destroyed four cities. Why did he do that?”<br/><br/>In the deep and dense forest, towering trees shot into the sky.<br/><br/>Inside a huge tree, Azure Dragon Moon looked at the information reported by his disciple, his face full of shock.<br/><br/>“Brother Azure Dragon Moon, is this the brother who saved you back then? A powerhouse of our divine dragon lineage?”<br/><br/>Around them, there were more than ten figures sitting on chairs. When they heard his words, they revealed curious expressions.<br/><br/>Now that the ancestral dragon lineage was being hunted and attacked, many experts of the ancestral dragon lineage had already gathered together to deal with some dangers.<br/><br/>“Yes, this brother is very strong. He can easily kill A Level 1 universe overlord of the same level. According to what I know, besides his Dragon Palace, there are two other Level 1 universe overlords, a wizard and a purebred water divine dragon.”<br/><br/>“This brother Wang Xian from the Dragon Palace is a good person. His philosophy is the same as our ancestral dragon leader. He clearly hates the Holy Dragon lineage. The last time I was attacked, he was the one who told me later that it was Tian Heng City who did it.”<br/><br/>Green Dragon Moon opened his mouth and said with doubt in his eyes, “I just don’t know why he attacked the four great cities.”<br/><br/>“Let me ask him.”<br/><br/>After hesitating for a few seconds, he took out the universal AI and sent some information to Wang Xian.<br/><br/>“Oh? Then this brother is very strong. However, we have searched for a few years but there is no evidence to prove that the four great cities attacked the Green Dragon Moon brothers. Without evidence, it would be difficult for us to take revenge.”<br/><br/>“Now that the four great cities have been destroyed by the Dragon Palace, the Dragon Palace might be in danger. They are not a match for the Hundred Cities Alliance at all.”<br/><br/>A few experts from the ancestral dragon lineage said.<br/><br/>“Brother Wang Xian is not an impulsive person. He must have some sort of plan.”<br/><br/>Azure Dragon Moon shook his head.<br/><br/>“Brother Wang Xian replied to me. He was the one who destroyed the four major cities. He told me not to worry about them. Since the Hundred Cities Alliance is their enemy, the Dragon Palace will fight with them to the end.”<br/><br/>At this moment, Azure Dragon Moon received Wang Xian’s message and said.<br/><br/>“This brother is really a ruthless person.”<br/><br/>An expert from the ancestral dragon lineage shook his head slightly and said with a smile.<br/><br/>“I hope nothing bad will happen to them. That Old Fellow from the Hundred Cities Alliance is very strong.”<br/><br/>Azure Dragon Moon mumbled as a hint of worry flashed across his eyes.<br/><br/>However, the ancestral dragon lineage was about to lose their lives. They didn’t have the time to care about Wang Xian.<br/><br/>“As expected, the Hundred Cities Alliance found out and issued a killing order to destroy the Dragon Palace?”<br/><br/>He was located at the corner of the ocean. After Green Dragon Moon sent him a message, he did a search and found out that the hundred cities alliance had locked onto the Dragon Palace. Wang Xian’s eyes flickered slightly.<br/><br/>“Under normal circumstances, the Hundred Cities Alliance would definitely send experts over and destroy the Dragon Palace.”<br/><br/>He mumbled to himself and appeared to be deep in thought.<br/><br/>The current Dragon Palace could not withstand attacks from masters of the universe and above.<br/><br/>With such strength, it could already break through the defense of the Dragon Palace.<br/><br/>“When the other party attacks, the Dragon Palace still has some trump cards. It’s not that they are afraid of the other party destroying the Dragon Palace.”<br/><br/>“But there are still a lot of risks. It would be great if the Dragon Palace had a blessed land that could withstand a master of the universe at level three or four.”<br/><br/>Wang Xian mumbled.<br/><br/>“A defense of the blessed land that can withstand the destructive strength of a level three or four universe dominator? Dragon King, I know a place. However, the defense of the Blessed Land has already been activated. We can’t enter it.”<br/><br/>Upon hearing his words, water touch king suddenly spoke.<br/><br/>“HMM?”<br/><br/>“What Place?”<br/><br/>Wang Xian paused and looked at her.<br/><br/>“It’s at the river of eternity, where the water in the Sky Falls. I can’t even break through the defense of the grotto-heaven there. Even the hundred-row bird men can’t break through the defense there. It’s a pity that I can’t get in anymore.”<br/><br/>The water touch king said plainly.<br/><br/>“Below the water in the sky, you mean the grotto-heaven paradise of the Tianshui Race?”<br/><br/>Wang Xian’s eyes lit up as he asked.<br/><br/>The Tianshui tribe was the tribe that was defeated by the Lotus tribe. They hid in the paradise and were completely sealed by the Lotus tribe.<br/><br/>Was their paradise so powerful?<br/><br/>“It should be the Tianshui tribe that you mentioned. The seal on the outside is gone, but the defense of the Paradise has never been opened. It is possible that the entire tribe has perished inside.”<br/><br/>King Shuishui said.<br/><br/>“The Dragon Palace can be transferred there.”<br/><br/>Wang Xian’s eyes lit up.<br/><br/>However, he was not in a hurry. Although the Hundred Cities Alliance was very strong, since Wang Xian had made his move, he had made some preparations.<br/><br/>Currently, the Dragon Palace still had a trump card to defend against the attacks of the Hundred Cities Alliance.<br/><br/>And that Trump card was the cursed dragon.<br/><br/>Over the past few decades, the number of cursed dragons in the Dragon Palace had reached 10,000, and the strongest one already had the combat strength of a universe Knight Level 7.<br/><br/>The rest were mostly at Universe Knight Level 1 or 2.<br/><br/>The cursed dragons’combat strength was very weak, and they could only fight one level higher. This kind of talent was considered trash in the inner continent.<br/><br/>However, they had the cursed bodies, and their combat strength was not good, but who dared to kill them?<br/><br/>Back then, a universe knight would be instantly cursed to death if he killed a godly king level being.<br/><br/>As for the cursed dragon of the Dragon Palace, a universe master level being, to kill them, he had to consider the price he had to pay.<br/><br/>Maybe a pinnacle race and a terrifying great being had a way to resist, but he didn’t think the Hundred Cities Alliance had a way.\t\t\t\t\t\t</div>", "images": {}, "success": true}