{"id": 475, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072851.html", "title": "Chapter 3466 - 3466 3465 Dragon Palace Was Suppressed!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3466 - 3466 3465 Dragon Palace Was Suppressed!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3466 3465 Dragon Palace was suppressed!<br/><br/>“Hundred Cities Alliance, I would like to see who we are going to destroy who?”<br/><br/>Wang Xian stood above the Dragon Palace and stared at the experts of the Hundred Cities Alliance. He said with a face full of killing intent.<br/><br/>“Hehe, we will suppress all of you today!”<br/><br/>The leader of the Hundred Cities Alliance said. His eyes were filled with killing intent.<br/><br/>His gaze swept across the experts around him. Everyone nodded their heads!<br/><br/>“Dragon Palace, even if you have made some preparations and your subordinates have left the nest, it won’t be long before we completely destroy you and turn you into enemies with our Hundred Cities Alliance, seeking your own destruction!”<br/><br/>The expert with a huge eye on his head said as he flew straight ahead.<br/><br/>The experts of the hundred cities alliance scattered around and floated in the air.<br/><br/>“Move Mountain!”<br/><br/>“Fill the ocean!”<br/><br/>“Thick Earth!”<br/><br/>“Suppress demon!”<br/><br/>“Seal Demon!”<br/><br/>“Sky Fall!”<br/><br/>“Earth Unite!”<br/><br/>One of the eight universe master level one great beings was killed by the curse.<br/><br/>However, the other seven great beings shouted coldly, and their eyes gleamed.<br/><br/>After each word was uttered, the surrounding space began to change drastically.<br/><br/>Moving Mountains, a mountain peak suddenly appeared in the sky above the Dragon Palace.<br/><br/>Filling the sea, the surrounding space instantly became gray!<br/><br/>Thick soil appeared around the Dragon Palace, and terrifying city walls appeared.<br/><br/>Demon suppression, an enormous palm descended from the sky!<br/><br/>Demon sealing, two talismans crossing each other, appeared in the void.<br/><br/>The sky fell, and the surrounding darkness!<br/><br/>The Earth closed, and the earth shook!<br/><br/>They spat out energy from their mouths and the energy from their bodies surged into the surroundings. This scene was like a spell that changed the heaven and earth.<br/><br/>In the surrounding area, fifteen level one masters of the universe waved their arms and waves of energy surged into them.<br/><br/>Wang Xian stood on the Dragon Palace and watched. His eyes were filled with a solemn expression.<br/><br/>Seven level two masters of the universe. With his current strength, he could fight against them.<br/><br/>However, there was one condition: the other party didn’t have a powerful connate numinous treasure.<br/><br/>However, it was obvious that each of them had one or two or three connate numinous treasures.<br/><br/>While the accompanying spirit spirit was still in a deep sleep, he didn’t have the confidence to fight against the seven of them.<br/><br/>Not to mention, the 15 universe masters with level one combat strength weren’t something the Dragon Palace could withstand.<br/><br/>“Roar!”<br/><br/>The cursed dragons saw this and immediately flew up into the sky.<br/><br/>Peng! Peng! Peng<br/><br/>However, they were blocked by an invisible energy when they flew up into the sky. The energy did not move at all when they collided with it.<br/><br/>The cursed beings would only attack the other party after they were killed by the curse.<br/><br/>If they died from the collision, the curse would not affect the other party.<br/><br/>In other words, the other party could seal the Dragon Palace and not be cursed.<br/><br/>Unless they were sealed in the Dragon Palace and died because of the seal and received karma, the other party would be cursed.<br/><br/>However, the probability was too small.<br/><br/>Therefore, although the other party couldn’t do anything to the cursed dragon, they could directly seal the Dragon Palace.<br/><br/>Weng<br/><br/>The old man waved his hand, and items landed on the surrounding phantoms.<br/><br/>The mountain began to descend, heading towards the Dragon Palace.<br/><br/>The surrounding seawater quickly disappeared, covered by the Gray Earth attribute.<br/><br/>The city walls began to close in, surrounding the Dragon Palace.<br/><br/>The condensed void items began to seal the Dragon Palace.<br/><br/>“What a strange suppression method. After the Dragon Palace is suppressed, even if I wanted to break it, it would be very difficult unless a level three master of the universe took action.”<br/><br/>Wang Xian sensed the interlocking suppression method and revealed a surprised expression.<br/><br/>He hesitated for a moment before moving his body and entering the Dragon Palace.<br/><br/>“There aren’t many members in the Dragon Palace. I think they have already guessed that we will come to destroy them. Therefore, most of the members have already escaped. I think they will go against Our Hundred Cities Alliance next!”<br/><br/>The great being with a head like an eye seemed to be able to pierce through the dragon palace as he said coldly.<br/><br/>“HMPH, as long as they dare to attack our Hundred City Alliance, we will be able to destroy them.”<br/><br/>The old man in the lead revealed a strong expression of confidence.<br/><br/>Their Hundred City alliance had many great beings and had all sorts of methods.<br/><br/>There were also many great beings of the wizard lineage. With sorcery methods, as long as the disciples of the Dragon Palace dared to attack their cities, they would be able to use sorcery to track them.<br/><br/>At that time, the other party wouldn’t be able to escape at all.<br/><br/>According to their guesses, the Dragon Palace shouldn’t have any level two masters of the universe.<br/><br/>This wouldn’t affect them at all!<br/><br/>Wang Xian stood in the Dragon Palace and watched the entire dragon palace being suppressed.<br/><br/>The terrifying seal isolated everything in the Dragon Palace. The Dragon Palace had been suppressed!<br/><br/>He moved and immediately came to the position of the Dragon Cave in the Dragon Palace. He looked at the Fire Dragon Palace and the Dark World of the Demon Dragon which were being devoured in the Dragon Palace.<br/><br/>Ao he and the rest were devouring the Dragon Cave.<br/><br/>“Ao he, how long will it take for you to completely devour it? What realm will your strength reach after devouring it?”<br/><br/>Wang Xian asked them.<br/><br/>“Reporting to Dragon King, it will take more than ten years. By then, our devouring dragon should be able to produce more than twenty level two masters of the universe.”<br/><br/>Ao he immediately reported.<br/><br/>It was different from what they had initially expected.<br/><br/>Wang Xian thought that Ao he could only raise his combat strength to level-one and level-two universe Dominators. However, he had misjudged the energy contained in the Fire Dragon Palace’s Demonic Dragon Dark World.<br/><br/>These two were the dragon palaces of the real masters of the universe.<br/><br/>In other words, they were the dragon palaces of the divine dragons, which were at least at the level of universe Dominators.<br/><br/>Even after the erosion of time, they could still improve a lot after devouring.<br/><br/>“Alright, you guys continue to devour.”<br/><br/>Wang Xian nodded his head.<br/><br/>The Devouring Dragons could only fight two levels above them. The fact that they could reach the combat strength of a Master of the universe at level two meant that their realm had reached the peak of a universe knight.<br/><br/>It would be difficult for them to reach the true master of the universe with the help of the Fire Dragon Palace.<br/><br/>“It has been completely suppressed. Unless an expert like the leader of the ancestral Dragon Clan makes a move, the lair of the Dragon Palace will never see the light of day again!”<br/><br/>A few hours later, outside the Dragon Palace, the old man who was the leader of the Hundred Cities Alliance said coldly.<br/><br/>“Let’s go back and inform all the cities to be on guard against the Sneak Attack of the Dragon Palace!”<br/><br/>As they spoke, their figures slowly disappeared and left the place.<br/><br/>Whoosh<br/><br/>When they had left completely, an Lie’s figure appeared outside. He took a look at his figure and returned to the Dragon Palace.<br/><br/>“Dragon King, the experts from the Hundred Cities Alliance have left.”<br/><br/>An lie reported to Wang Xian.<br/><br/>“Alright, let’s go. The war has begun!”<br/><br/>A faint smile appeared on Wang Xian’s face as he stepped into the demonic dragon altar.<br/><br/>The suppression of the Dragon Palace didn’t affect them in the slightest.<br/><br/>After their figures disappeared, they arrived at the Dragon Palace’s long-term base, the grotto-heaven paradise beneath the water in the sky!<br/><br/>However, the news of the suppression of the Dragon Palace on the universal ai was intentionally spread by the Hundred Cities Alliance. It immediately caused a sensation.\t\t\t\t\t\t</div>", "images": {}, "success": true}