{"id": 470, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072841.html", "title": "Chapter 3461 - 3461 3460 Nether Ghost Of The Nether Race And His Breakthrough", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3461 - 3461 3460 Nether Ghost Of The Nether Race And His Breakthrough</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3461 3460 Nether Ghost of the nether race and his breakthrough<br/><br/>How Strong was an existence at the heavenly fate level?<br/><br/>No one knew!<br/><br/>But according to guesses, if an expert at the first level of the Universe Dominator held an item at the heavenly fate level, he could easily kill an opponent at the fifth or sixth level.<br/><br/>Although this was only a guess and a rumor, no one doubted the truth.<br/><br/>There was even a saying that if one could control an item at the heavenly fate level, an ordinary person could also kill the universe dominator.<br/><br/>Of course, this was a false statement. An ordinary person would not be able to control a treasure of the heaven origin creation level.<br/><br/>The Netherworld Ghost was a soul item while the soul-returning embryo fruit was a fruit on the soul-returning tree. The soul-returning tree was also a branch of the ancestral tree.<br/><br/>It could be said that the soul-returning embryo fruit was a fruit tree on the ancestral tree.<br/><br/>A fruit of the heaven origin creation level. Even if the ancestral tree had yet to reach the level of the heaven origin creation level, it was still extremely terrifying.<br/><br/>Furthermore, the Netherworld Ghost was wrapped up by the branches of the soul-returning wood and condensed into a soul-returning embryo fruit. The fact that this Netherworld Ghost was able to reach the same level of strength as Wang Xian was very important.<br/><br/>That was because the netherworld ghost was still connected to the soul-returning wood.<br/><br/>It could be said that the energy of the soul-returning wood was connected to the Netherworld Ghost.<br/><br/>This was because the ancestral tree and the soul-returning wood resided in Wang Xian’s body.<br/><br/>Buzz<br/><br/>Wang Xian’s netherspirit avatar moved slightly, and a ferocious dark dragon head flew out from his body.<br/><br/>“This strength is comparable to an ordinary level one master of the universe. TSK TSK, my strength has increased a little.”<br/><br/>Excitement appeared on his face.<br/><br/>The incipient holy wings and the five elements grinding allowed him to fight against six people of the same level with half-life elves. The number of people he could fight against could be increased by one or two.<br/><br/>Now, with the addition of the Netherspirit avatar, the number could be increased by a little.<br/><br/>If the yin-yang Dragon Plate could be upgraded, it would be even more insane.<br/><br/>It was simply too powerful.<br/><br/>“Other than this treasure, are there any other treasures?”<br/><br/>Wang Xian looked at the king of water tentacles and asked him.<br/><br/>Putting everything else aside, this fellow was much stronger than him in sensing and recognizing treasures.<br/><br/>After all, the king of water tentacles had lived for at least 10 billion years.<br/><br/>He was definitely a terrifying old monster.<br/><br/>“There’s no more. It’s already very good to have a ghost.”<br/><br/>The king of water tentacles shook his head.<br/><br/>“Then, it’s time for me to raise my strength.”<br/><br/>Wang Xian looked at the treasures around him, and his eyes sparkled.<br/><br/>Roar! Roar<br/><br/>He immediately transformed into the body of a divine dragon and gobbled up all sorts of resources.<br/><br/>The resources entered his mouth and transformed into dragon energy.<br/><br/>Time passed slowly.<br/><br/>At the side, the king of water tentacles widened her eyes when she saw how Wang Xian was gobbling up treasures and how his aura was growing.<br/><br/>“What… What’s going on? How could the energy be converted so quickly, even if it’s the former Zerg…”<br/><br/>The king of water tentacles looked on in shock. When she mentioned the Zerg, her body trembled and she had a guess.<br/><br/>However, she did not dare to continue guessing. If what she guessed was true, it would be too terrifying.<br/><br/>…<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Just as Wang Xian was devouring a large number of treasures and the experts from the Dragon Palace were improving their strength, five figures appeared in the sky above Tian Heng City.<br/><br/>They looked down and their expressions were slightly unsightly.<br/><br/>At this moment, Tian Heng City had already become an empty city.<br/><br/>Unlike the other cities, the first city to be attacked was Tian Heng City, which had gone through the assassination of the prickly dragon species. After the attack of Wang Xian, it caused panic in the city.<br/><br/>After the panic descended, all the citizens fled frantically. They didn’t dare to stay any longer.<br/><br/>The entire Tian Heng city was basically intact, but there wasn’t a single living creature.<br/><br/>Whoosh<br/><br/>The five of them frowned. An old man in the middle waved his arm, and a mirror floated into the sky. The mirror slowly grew bigger, and soon, a beam of light descended.<br/><br/>When the light landed in the city, the entire city became abnormally lively.<br/><br/>A human figure condensed from white light shuttled through the city.<br/><br/>The entire city came to life.<br/><br/>But soon, a scream was heard. They immediately looked in the direction of the scream.<br/><br/>A figure flew out, followed by an extremely blurry figure.<br/><br/>This blurry figure seemed to have been erased by a wave of energy. It was very blurry.<br/><br/>“The opponent has a wizard.”<br/><br/>A powerhouse with a head, but the entire head was only oval-shaped eyes, said indifferently.<br/><br/>“There’s still a blurry shadow here, we can piece it together.”<br/><br/>He looked to the other side and said lightly.<br/><br/>“We can only confirm a blurry figure, it’ll be difficult to find.”<br/><br/>The old man in the middle frowned slightly.<br/><br/>“Send a large number of people to search, we’ll be able to find some clues, we’ll first search through the database of the Universe AI.”<br/><br/>An expert with an eye on the head said.<br/><br/>The few of them nodded slightly. After staying for more than ten minutes, they left immediately.<br/><br/>Five days later, they appeared in the Great Marquis City.<br/><br/>This was the time they had to travel at full speed and had to teleport for five days to get here. One could imagine how big the heaven splitting primordial land was.<br/><br/>After using the mirror to search, they determined the shape of a creature.<br/><br/>If Wang Xian and the rest saw it, they would definitely know that the other party had already captured the form of the thorned dragon.<br/><br/>“Boom!”<br/><br/>“Ding! Congratulations on your upgrade. You have reached the level of a level five universe knight and comprehended the Dharma Idol: the divine tail plays with the pearl.”<br/><br/>While the Hundred Cities Alliance was searching for the murderer, Wang Xian’s strength had broken through once again in the Dragon Palace.<br/><br/>A level five universe knight and a level two universe dominator. Such a terrifying ability to fight across levels was definitely the best in the current universe.<br/><br/>Name: Wang Xian<br/><br/>Race: Yin-yang Wind Thunder Five Elements Divine Dragon (man-dragon unity)<br/><br/>Level: Universe Knight Level 5(Divine Dragon Transformation Level 9)<br/><br/>Origin: 1% (the next breakthrough will require 99%)<br/><br/>Ability: ruling the water race (ruling the water race below their own level)<br/><br/>Devouring creatures (devouring creatures to extract origin)<br/><br/>Five elements control<br/><br/>Technique: Divine Dragon Transformation<br/><br/>Divine Ability: soul capture, spirit attachment<br/><br/>Law Divine Ability: Dragon Eye Lock, Five Elements Dragon Claw, Yin-yang breaking realm, eight luminaries dragon scale, Sacred Dragon Shadow, Heavenly Dragon Eight Tribes, Dragon Tomb, Cloud Dragon Rising, true dragon body<br/><br/>Law aspect: eight Dragon Pillars, eight dragon clones, towering dragon horns, Mighty Heavenly Dragon, divine tail playing pearl<br/><br/>Control Law: metal, wood, water, fire, Earth, light, dark wind and thunder<br/><br/>Divine Kingdom: Dragon Palace<br/><br/>Dragon Palace: acquired.<br/><br/>Members of Dragon Palace: 1964,450<br/><br/>“Phew, I’ve finally broken through again!”<br/><br/>Wang Xian opened his dragon eyes and revealed a smile.<br/><br/>Sensing his own strength, the smile on his face deepened.<br/><br/>This strength was already very strong among the high-level races.<br/><br/>The strongest expert of the high-level races only had the combat strength of a level three universe dominator.<br/><br/>He was only one step away from being a Supreme Master of a pinnacle race.<br/><br/>However, with his speed, a level-three universe master wouldn’t be able to kill him.<br/><br/>Weng<br/><br/>He had a thought, and a ghost dragon body appeared beside him. After he leveled up, dark ghost also leveled up.<br/><br/>It felt great. He didn’t need to provide extra energy to level up with him.\t\t\t\t\t\t</div>", "images": {}, "success": true}