{"id": 471, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072843.html", "title": "Chapter 3462 - 3462 The 3461 Dragon Palace Was Exposed. It Was The Third Largest Divine Dragon Lineage In The Universe", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3462 - 3462 The 3461 Dragon Palace Was Exposed. It Was The Third Largest Divine Dragon Lineage In The Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3462 The 3461 Dragon Palace was exposed. It was the third largest divine dragon lineage in the universe<br/><br/>“Congratulations, Dragon King, for your breakthrough in strength. In the future, you will become the ruler of the universe. It is only a matter of time before you unify the universe.”<br/><br/>King aqua tentacles shouted respectfully after Wang Xian’s breakthrough.<br/><br/>She stared at him with a burning gaze. Her eyes were filled with shock.<br/><br/>“Stop flattering me. Focus on your cultivation and recover your strength!”<br/><br/>Wang Xian said calmly. His body moved and he flew into the dragon transformation pool.<br/><br/>“If I were to recover slowly, it would take at least a few billion years.”<br/><br/>Water Touch King mumbled and flew directly towards Wang Xian and landed on his shoulder.<br/><br/>In the Dragon Transformation Pool, the group of thorned dragon species and poisonous horned dragon species were improving.<br/><br/>This time, the main purpose was to increase the strength of the poisonous horned dragon species and thorned dragon species.<br/><br/>After the four cities were destroyed, there were a total of 70 universe masters with level one combat strength.<br/><br/>These 70 were able to increase the strength of the two by 70 Pinnacle Universe Knights.<br/><br/>This was a terrifying upgrade.<br/><br/>After the upgrade, they would become extremely terrifying beings.<br/><br/>This time, the Dragon Palace had obtained close to a million universe knight level corpses.<br/><br/>It was impossible for the thorned dragon species and the poisonous horned dragon species to absorb all of them. The other dragon species would also be able to improve significantly.<br/><br/>The war would allow the dragon palace to improve rapidly.<br/><br/>“After the upgrade, I can slowly devour the other cities of the Hundred Cities Alliance to see if they have completely become the lackeys of the holy dragon lineage.”<br/><br/>Wang Xian muttered to himself as he returned to the Dragon King Palace to continue the upgrade.<br/><br/>Other than the resource corpses, the innate spiritual treasures he obtained could upgrade both the five elements millstone and the yin-yang Dragon Plate.<br/><br/>The Five Elements Millstone could upgrade to the second level of the universe dominator while the yin-yang Dragon Plate was the first level of the universe dominator.<br/><br/>Buzz<br/><br/>The Five Elements Millstone and the yin-yang Dragon Plate appeared in front of Wang Xian. He began to help refine the two treasures.<br/><br/>…<br/><br/>“I’ve found it. I can already lock onto the murderer who destroyed the four great cities. I really didn’t expect that. I really didn’t expect that there would be the third divine dragon lineage in the universe. Furthermore, they have already grown to such an extent!”<br/><br/>At this moment, five experts were sitting cross-legged at the top of one of the 108 mountain peaks of the Hundred Cities Alliance.<br/><br/>At this moment, they received a message from their subordinates, and their eyes were full of surprise.<br/><br/>“Let’s Go and report to the Alliance Master!”<br/><br/>The group of people moved and immediately flew toward the main peak in the center.<br/><br/>“Have you found it?”<br/><br/>The city master of the Hundred Cities Alliance, who was sitting cross-legged, asked indifferently without opening his eyes.<br/><br/>“Alliance master, we have found the murderer. The four cities were destroyed by the Dragon Palace.”<br/><br/>The old man in the center immediately reported.<br/><br/>“The Dragon Palace?”<br/><br/>The alliance leader of the Hundred Cities Alliance sounded confused.<br/><br/>“Yes, Alliance leader. The Dragon Palace is the other divine dragon lineage in the universe. It’s also the third divine dragon lineage in the universe besides the ancestral Dragon Holy Dragon lineage. We received news that more than 20 years ago, the Dragon Palace landed on the heaven opening primal continent and was at the periphery.”<br/><br/>“Once they landed, they destroyed the three outer forces. Our disciples have gone through countless comparisons in the universe’s AI. After some searching, we can confirm that the person who attacked the four cities was a member of the Dragon Palace, a dragon that specializes in assassinations.”<br/><br/>The old man explained in detail.<br/><br/>“As for why they wanted to destroy the Eternal Sky City and the others, we have some guesses. This dragon palace seems to have a good relationship with an azure dragon of the ancestral Dragon Clan. In addition, it might be because their disciples were hunted down.”<br/><br/>The great being with a huge eye on the head guessed.<br/><br/>“How powerful is this Dragon Palace?”<br/><br/>The alliance leader of the Hundred Cities Alliance said indifferently.<br/><br/>“I’m not sure. The information on the universe AI doesn’t match them at all. However, I don’t think there are any universe ruler level 2 Great Beings.”<br/><br/>The Old Man in the center guessed.<br/><br/>“Find the enemy’s nest and destroy it!”<br/><br/>The alliance leader slowly opened his eyes and said.<br/><br/>“We’ve locked onto the enemy’s nest. Alliance leader, I think we’d better send more great beings over.”<br/><br/>The old man in the center said.<br/><br/>“HM, inform some cities to send out eight universe masters and 15 Universe Masters and 15 universe masters and 1st Level Great Beings.”<br/><br/>The city leader of the Hundred City Alliance said with a twinkle in his eyes, “Also, announce this matter to the public. Our Hundred City Alliance will become enemies with the Dragon Palace, and we are determined to destroy them. As long as we encounter any disciples of the Dragon Palace, we will kill them all.”<br/><br/>“Huh? Alliance leader, you mean that we can use this action of the Dragon Palace to hunt down the great beings of the godly dragon lineage in the future?”<br/><br/>The eyes of the expert with the huge head glowed as he spoke.<br/><br/>“Hehe, that’s right. The ancestral dragon bloodline has been scattered for tens of millions of years. The newly born Divine Dragon bloodline can be classified as the Dragon Palace Bloodline.”<br/><br/>The alliance leader of the Hundred Cities Alliance revealed a faint smile.<br/><br/>“We understand. We’ll go now.”<br/><br/>The five experts of the Hundred Cities Alliance nodded and left immediately.<br/><br/>At this moment, in the territory of the Hundred Cities Alliance, on the AI of the Hundred Cities Alliance, the news of the four cities being destroyed spread like wildfire.<br/><br/>Countless experts and disciples of the Hundred Cities Alliance were discussing and speculating.<br/><br/>Some people guessed that it was the experts of the ancestral dragon lineage who made the move. At the moment, the ancestral dragon lineage had the greatest motive.<br/><br/>This caused the disciples and citizens of the Hundred Cities Alliance to feel slightly panicked.<br/><br/>Was the Hundred Cities Alliance really going to make an enemy out of the ancestral dragon bloodline?<br/><br/>This wasn’t good news for them.<br/><br/>The ancestral dragon bloodline was much stronger than them.<br/><br/>If they really angered the leader of the ancestral dragon bloodline, he would directly descend and no city would be able to stop him.<br/><br/>The surrounding areas of the Hundred Cities Alliance were also discussing.<br/><br/>The battle between the ancestral dragon bloodline and the Sacred Dragon bloodline was something that the other races didn’t pay much attention to.<br/><br/>“Look, the Hundred Cities Alliance has issued an announcement. The murderer of the four cities has been found. It’s a force called the Dragon Palace, the third most powerful force in the Universe!”<br/><br/>“The announcement has been made. It’s confirmed that the powerhouses of the Dragon Palace have taken action. Why are they attacking the Heavenly Hengcheng City? What are they trying to do?”<br/><br/>“The Dragon Palace? Why is there another incident involving the Divine Dragon Bloodline? Why haven’t I heard about it? Are they strong? Why are they attacking the four cities?”<br/><br/>“Up until now, the experts of the ancestral dragon bloodline haven’t attacked the cities of Our Hundred Cities Alliance. Why are they attacking? Are they courting death?”<br/><br/>The notice of the Hundred Cities Alliance was issued. The four cities had been destroyed. They had even brought out all the evidence of the murderer, the Dragon Palace.<br/><br/>In addition, the Hundred Cities Alliance also emphasized one thing in the announcement. They had no intention of participating in the war between the ancestral dragon bloodline and the Holy Dragon Bloodline, but if any force took advantage of the situation, they wouldn’t be blamed for being rude.<br/><br/>The Hundred Cities Alliance declared war on the Dragon Palace and was bound to destroy the Dragon Palace.\t\t\t\t\t\t</div>", "images": {}, "success": true}