{"id": 480, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072861.html", "title": "Chapter 3471 - 3471 3470 Demonic Skeletons", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3471 - 3471 3470 Demonic Skeletons</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3471 3470 demonic skeletons<br/><br/>“The Divine Dragon Clan has experienced two apocalypses and survived until they perished together with the Bug clan!”<br/><br/>“In this era, the Saint Clan, the Divine Tiger clan, the skeleton clan, and the Celestial Nation clan are the new top races in the universe.”<br/><br/>Wang Xian thought of some things about the apocalypses.<br/><br/>What was the Apocalypses?<br/><br/>There was no such thing in Wang Xian’s inheritance.<br/><br/>However, he knew that it was a terrifying disaster.<br/><br/>This Land of demonic bones was most likely the battlefield of a cataclysm.<br/><br/>Otherwise, even if there were five to six races at the pinnacle of the universe, there would not be so many skeletons.<br/><br/>Wang Xian moved and landed at the bottom. The skeletons on the ground were extremely hard.<br/><br/>He scanned the area with his dragon eyes but could not penetrate too many skeletons.<br/><br/>Crack! Crack! Crack<br/><br/>He stepped on them and made cracking sounds.<br/><br/>He scanned his surroundings. The entire world was like hell.<br/><br/>Some of the skeletons were tens of thousands of meters in size, resembling half of a mountain peak.<br/><br/>Some of the skeletons were piled up together, forming a mountain of skeletons.<br/><br/>There were also some that caved in, forming a valley.<br/><br/>With a glance, it was extremely desolate.<br/><br/>Wang Xian continued to fly towards the center.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>After flying for an hour, sharp bones suddenly flew out from the ground.<br/><br/>The bones completely covered Wang Xian.<br/><br/>“Eh? Is it a demonic skeleton or a skeleton? Or is it an expert with the darkness attribute? How dare he launch a Sneak Attack!”<br/><br/>Wang Xian waved his arm and the bones fell towards the ground.<br/><br/>“Bang! Bang! Bang!”<br/><br/>The bones fell to the ground and produced a loud sound of collision.<br/><br/>He looked down and raised his eyebrows slightly.<br/><br/>Other than sensing that something was attacking him, all he saw were bones.<br/><br/>It was as if the attack just now was an illusion.<br/><br/>“What a powerful concealment technique!”<br/><br/>Wang Xian raised his eyebrows.<br/><br/>It was exceptionally dangerous in the land of the demonic bones because one would be attacked if one was not careful.<br/><br/>The attack might have come from the demonic skeletons, or it might be some skeletons that were born with intelligence!<br/><br/>Some people said that the skeleton race was born in the land of demonic bones, but this was still to be verified.<br/><br/>However, it could be said that the skeletons that were born with intelligence could already be considered as a member of the skeleton race.<br/><br/>“It shouldn’t be an expert of the darkness attribute.”<br/><br/>Wang Xian calmly scanned the area below. From the attack just now, the strength of the attacker should be at the peak of a universe knight.<br/><br/>It would be difficult for a dark attribute cultivator at this level to escape his detection.<br/><br/>However, he couldn’t sense it at the moment. Therefore, he could basically confirm whether the opponent was a demon skeleton or a skeleton.<br/><br/>The demon skeleton and the skeleton had a strong ability to hide in the land of demon bones.<br/><br/>They restrained their energy and merged into all the dry bones, making it difficult for them to be discovered.<br/><br/>Even if it was an area-of-effect attack, they would still drill downwards.<br/><br/>It would be very difficult to kill them.<br/><br/>Wang Xian’s mind stirred as an idea appeared in his mind.<br/><br/>Beside him, a figure that looked exactly like him appeared.<br/><br/>The ghost of the dead!<br/><br/>The ghost of the dead possessed the combat strength of a level two overlord of the universe.<br/><br/>The ghost of the dead did not have a physical body and could pass through the withered bones. The moment he was blocked, it meant that there was energy in this withered bone.<br/><br/>This could verify if this was a demonic skeleton or a skeleton.<br/><br/>“Roar!”<br/><br/>With a thought, the human-shaped netherworld ghost transformed into the form of a divine dragon and flew down.<br/><br/>Its huge body passed through the skeletons.<br/><br/>He stood at the top and scanned the area.<br/><br/>Although the Netherworld Ghost Avatar did not have the primaless saint wings, its speed was still not slow.<br/><br/>Hualala<br/><br/>All of a sudden, when the ghost avatar came to a spot in front of him, a piece of dry bone started to move and escaped in a frenzy.<br/><br/>“Hehe, I found it. It should be a demonic skeleton!”<br/><br/>Wang Xian moved his body and chased after the demonic skeleton.<br/><br/>With the activation of the primaless saint wings, he immediately came to a spot above the skeleton and stretched out his hand to grab it.<br/><br/>It was a bird-type demonic skeleton. Its body was emitting a strong demonic aura.<br/><br/>The bones on its body were unusually sharp and emitted a black glow.<br/><br/>Seeing that Wang Xian was grabbing at it, the demonic skeleton raised its claws and attacked him.<br/><br/>“Bang!”<br/><br/>A violent collision sound was heard. Wang Xian grabbed the demonic skeleton in his hand and made it unable to move.<br/><br/>“This demonic skeleton is really a treasure.”<br/><br/>Wang Xian grabbed the demonic skeleton in his hand and felt its energy. His eyes lit up.<br/><br/>This demonic skeleton was like a weapon, but it was different from a weapon.<br/><br/>They could be divided into dire beasts. They had no intelligence and only knew how to kill.<br/><br/>However, due to their unique life forms, they could be refined into weapons.<br/><br/>The tai chi dragon plate could absorb them.<br/><br/>“TSK TSK, not bad. If I can encounter more demon skeletons, the tai chi dragon plate will be able to break through!”<br/><br/>He mumbled and moved his body. The Tai Chi Dragon Plate appeared and began to destroy the energy of the demon skeletons and absorb them.<br/><br/>Continue!<br/><br/>His body moved and he continued to fly forward.<br/><br/>Wang Xian was not arrogant enough to use himself as bait. If a demon skeleton with the combat strength of a level three universe dominator appeared below him, he would be in trouble.<br/><br/>According to rumors, there might be a real universe dominator level demon skeleton here.<br/><br/>Wang Xian was flying towards the territory of the race, known as the spiritual demon race.<br/><br/>He wanted to go there to obtain some information so that it would be easier for him to move around.<br/><br/>Any living beings could enter the periphery of the spiritual demon race.<br/><br/>There was a huge trading market there. It was also the only safe place to recuperate in the land of demon bones.<br/><br/>When the powerhouses from other places came to the land of demonic bones, they would go to the spirit demon race when they were resting.<br/><br/>Wang Xian was not attacked during the rest of the journey.<br/><br/>Five days later, an extremely huge and special area appeared in Wang Xian’s sight.<br/><br/>It was an extremely huge skeleton.<br/><br/>This skeleton was like a giant standing there.<br/><br/>This skeleton did not have any energy. It was a withered skeleton. Its body was at least hundreds of thousands of meters tall and it was filled with power.<br/><br/>“We’re here. Once we pass through this huge skeleton giant, it will be the territory of the spiritual demon race. No fighting is allowed within this area.”<br/><br/>Wang Xian looked at the symbol of the skeleton giant and muttered.<br/><br/>His body moved and he came to the interior of the skeleton giant.<br/><br/>The spiritual demon race did not have any city walls to protect their territory. Wang Xian only saw the other powerful beings after he had entered for an hour.<br/><br/>Each of the skeletons had a glow in their eyes.<br/><br/>Each of them was an expert of the darkness attribute.<br/><br/>Some of them flew out while others flew in.<br/><br/>Each of them was cold and dead silent. They exuded an aura that no one was allowed to enter.<br/><br/>In the end, this was the territory of the skeletons. The skeletons were not good at communication.<br/><br/>“Let’s go inside and check out some information. Let’s see if there are any ways to hunt more demon skeletons.”<br/><br/>Wang Xian looked ahead and continued to go deeper.<br/><br/>Numerous strange-looking buildings appeared in his line of sight. These buildings were all built with dried bones.<br/><br/>Some of the buildings were at least hundreds of thousands of meters tall. They were extremely magnificent and unique.\t\t\t\t\t\t</div>", "images": {}, "success": true}