{"id": 485, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072871.html", "title": "Chapter 3476 - 3476 3475 Counterattacked", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3476 - 3476 3475 Counterattacked</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3476 3475 counterattacked<br/><br/>“Roar! Roar! Roar!”<br/><br/>The roar of the Divine Dragon could be heard. One was bright and the other was dark. The two divine dragons were intertwined together like an ink painting.<br/><br/>He surrounded Wang Xian’s body. The thick and heavy energy seemed to have isolated him in a special world.<br/><br/>He could not withstand the erosion from the outside world.<br/><br/>Wang Xian looked at the two divine dragons of light and dark and smiled.<br/><br/>The Tai Chi Dragon Plate had finally caught up with his current strength.<br/><br/>The powerful tai chi dragon plate was extremely difficult to break even for a level two master of the universe.<br/><br/>Without a powerful weapon, Wang Xian could stand there and the enemy would not be able to hurt him.<br/><br/>“With my current strength and defense, as long as I am not unlucky enough to meet a level three master of the universe in the underground demon cave city, I will not be in any danger.”<br/><br/>A smile appeared on Wang Xian’s face. He moved his body and emerged from the dried up bones, landing on the people below.<br/><br/>Beside him, the Ghost Avatar appeared. Wang Xian’s mind moved and the Tai Chi Dragon Disc appeared around him.<br/><br/>“Continue!”<br/><br/>Wang Xian’s mind moved and his avatar scouted the way ahead. He was still at the same position as he was at the back not long ago.<br/><br/>The avatar restrained its power and moved forward little by little.<br/><br/>Ten days later, Wang Xian sensed a trace of energy fluctuation below.<br/><br/>The Netherworld Ghost moved and immediately flew down.<br/><br/>Crack Crack Crack<br/><br/>Soon, a demon skeleton was caught by the Netherworld Ghost Doppelganger.<br/><br/>This was a demon skeleton at the peak of the universe knight level. It had been discovered hiding below.<br/><br/>Wang Xian waved his arm and kept it.<br/><br/>After killing the human-shaped skeleton, this level of demon skeleton was no longer a pleasant surprise to him.<br/><br/>At the very least, if he wanted to upgrade the Taiji dragon plate again, this level of demon skeleton was not very useful.<br/><br/>However, no matter how few mosquitoes there were, they were still meat. Furthermore, this was not a mosquito.<br/><br/>He continued to move forward and deeper into the city. Time passed day by day. Wang Xian was indeed an almost invincible existence in the underground demon cave city.<br/><br/>The demon skeletons that were discovered along the way were easily suppressed by him.<br/><br/>In a whole year, Wang Xian killed five demon skeletons with level-one combat strength and one level-two demon skeleton with level-two combat strength.<br/><br/>There were more than a dozen peak level universe knights.<br/><br/>“I’ve reached the end of the map!”<br/><br/>A year later, Wang Xian arrived at the end of the information of the spiritual demon race’s map.<br/><br/>According to a hint at the end of the information of the spiritual demon race, the probability of encountering a level three demon skeleton with the combat strength of a universe dominator would increase slightly further.<br/><br/>Of course, the probability would only increase. In the entire underground demon cave city, the number of level three demon skeletons with the combat strength of a universe dominator might be few and far between.<br/><br/>“There’s no need to take the risk. Anyway, the Tai Chi Dragon Plate has been upgraded.”<br/><br/>Wang Xian thought for a moment and decided not to go any deeper.<br/><br/>After all, there was a slight danger.<br/><br/>The main reason he came here was to hunt demon skeletons to upgrade the Tai Chi Dragon Plate. Now that it had been upgraded, there was no need to take the risk.<br/><br/>Instead, he could continue to take a look at other passageways.<br/><br/>Wang Xian returned directly and entered other passageways.<br/><br/>Two months had passed. During these two months, he might have been unlucky and did not encounter any demon skeletons at the level of a universe dominator.<br/><br/>This was also normal. The first route he took was the route with more demon skeletons in the records of the spiritual demon race.<br/><br/>The information of the spiritual demon race was also true. The locations of the other passageways were much less than this one.<br/><br/>“Get out and go to the Abyss Dry Bone Pool!”<br/><br/>Wang Xian decided.<br/><br/>The Abyss Dry Bone Pool had very detailed records of the spiritual demon race. He could go there and take a look.<br/><br/>The abyssal bone pool was different from the underground demon cave city. Inside the bone pool, there were all dried up bone parts.<br/><br/>For example, an arm bone, a palm bone, and a skull bone.<br/><br/>But these parts should not be underestimated. Some of the bone parts gave birth to intelligence, and were not any weaker than the demon skeleton.<br/><br/>There were even some bones that connected their own bodies.<br/><br/>For example, a skull gave birth to a wisp of intelligence. It would look for parts below the head to connect its body.<br/><br/>Often, the skull that gave birth to intelligence would suppress the other bones that gave birth to intelligence and join them together to form its own body. This would allow it to erupt with even more terrifying and bizarre abilities.<br/><br/>To a certain extent, the abyss dry bone pool was a little more dangerous than the underground demon cave city.<br/><br/>However, Wang Xian was prepared to improve steadily. He wanted to go to a place where the information of the spiritual demon race was safer than his own.<br/><br/>He was already very satisfied to be able to obtain one or two bones with the combat strength of a level two universe dominator.<br/><br/>With a move, Wang Xian followed the route in his mind and flew out quickly.<br/><br/>As he was heading back, he was faster. Some of the demon skeletons and the experts who entered the place immediately hid after sensing Wang Xian’s might.<br/><br/>“Phew!”<br/><br/>After coming out of the underground demon Cave City, Wang Xian felt the world brightening up and a smile appeared on his face.<br/><br/>He looked in one direction and immediately flew over.<br/><br/>“Whoosh!”<br/><br/>Just as he flew up, a long spear suddenly pierced through him.<br/><br/>The sudden bright spear made Wang Xian’s body tense up and his pupils contracted slightly.<br/><br/>He didn’t notice anything strange around him.<br/><br/>Furthermore, this spear was abnormally terrifying!<br/><br/>“Bang!”<br/><br/>Before Wang Xian could react, the spear had already arrived in front of him.<br/><br/>The Tai Chi Dragon disc revolved automatically and surrounded him. The bright spear landed on it and gave off a violent collision.<br/><br/>Crack! Crack<br/><br/>The energy condensed by the Tai Chi Dragon Disc actually cracked slowly.<br/><br/>Fortunately, the tai chi dragon disc blocked it and reflected a wave of energy.<br/><br/>“Weng!”<br/><br/>A wave of strange energy descended.<br/><br/>“Pu!”<br/><br/>The energy instantly landed on the elder with a dragon horn on his head. He spat out a large amount of blood and his body flew backward.<br/><br/>“What kind of strange ability is this?”<br/><br/>The elder widened his eyes, full of shock and disbelief.<br/><br/>“What!”<br/><br/>“Attack first, red-eyed world, Seal!”<br/><br/>A Cry of surprise sounded, and red-eyed’s expression changed. He raised the huge eye in his hand and overlapped it with the eye on his head.<br/><br/>“Weng Weng Weng!”<br/><br/>The next moment, the entire world changed. A blood-red eye hung in the air.<br/><br/>The entire world was blood-red.<br/><br/>This was a world with red eyes.<br/><br/>It could seal the surrounding space and not allow one to return to their divine kingdom in an instant.<br/><br/>“An ambush?”<br/><br/>Wang Xian saw the drastic changes in the surrounding space. His gaze was fixated on the back of his surroundings.<br/><br/>Three elders with dragon horns on their heads and their bodies were filled with a rich light energy. The Divine Dragon’s shadow flickered around them as they attacked him.<br/><br/>“Divine Dragon of light!”<br/><br/>Wang Xian’s expression changed slightly. His eyes were filled with killing intent as he said, “Holy Dragon lineage, you guys are experts of the Holy Dragon lineage. My Dragon Palace should not have provoked you guys, right? Why are you attacking me?”<br/><br/>“A dying black dragon. You Don’t need to know so much!”<br/><br/>The pale-white elder in the middle roared coldly. His figure changed as a divine dragon of light appeared and attacked Wang Xian directly.\t\t\t\t\t\t</div>", "images": {}, "success": true}