{"id": 486, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072873.html", "title": "Chapter 3477 - 3477 2476 Turned The Tables", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3477 - 3477 2476 Turned The Tables</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3477 2476 turned the tables<br/><br/>“Hehe, it seems that your hundred cities alliance has become the Lackey of the Holy Dragon Lineage!”<br/><br/>When Wang Xian heard their words, his eyes revealed a cold expression.<br/><br/>Now, he was completely certain.<br/><br/>“Destroying the cities of Our Hundred Cities Alliance, you must die. You are just the beginning. Your Dragon Palace will soon be destroyed!”<br/><br/>The red eyes stared at Wang Xian. The eyes on his head were glowing red.<br/><br/>In this space, numerous blood-red eyes appeared and stared at Wang Xian.<br/><br/>These eyes made Wang Xian feel extremely uncomfortable.<br/><br/>He felt a strange energy corroding into his body.<br/><br/>This was a very special attack, a very special invasion.<br/><br/>The Taiji Dragon Plate had already started to crack. It would take some time for it to recover.<br/><br/>The attack from the spear of light was very terrifying.<br/><br/>If it was an ordinary level two master of the universe, he would have already been killed.<br/><br/>This was definitely not an ordinary innate spiritual treasure.<br/><br/>However, even though the Taiji dragon plate had cracks, the attacker was definitely not in a good mood.<br/><br/>Wang Xian’s Tai Chi Dragon Plate had absorbed the energy from the pool of curses and had the ability to rebound.<br/><br/>The attack that he received earlier had also rebounded onto the attacker’s body, causing him to be severely injured instantly.<br/><br/>“Be careful. This fellow is a little strange. Get Rid of him as soon as possible!”<br/><br/>At this moment, the severely injured elder of the Holy Dragon lineage reminded him with an extremely ugly expression.<br/><br/>“Roar Roar Roar!”<br/><br/>“Holy Dragon Lock, Destroy!”<br/><br/>The Three Holy Dragons of light roared. One after another, energy that resembled a lock appeared above their heads and attacked Wang Xian directly.<br/><br/>Wang Xian stared at them. His eyes were sparkling.<br/><br/>“A dog who betrayed the Holy Dragon Clan. You are unworthy of being called a Holy Dragon. Kill me? I will destroy all of you today!”<br/><br/>His eyes were filled with killing intent.<br/><br/>He was not afraid of four experts of the same level.<br/><br/>The incipient Saint Wings appeared on his back and flapped. The energy in Wang Xian’s body circulated and transformed into a dragon of darkness.<br/><br/>The five elements millstone slowly appeared above his head.<br/><br/>“Roar! Roar!”<br/><br/>He let out a wild roar and immediately transformed into a dragon of darkness. With a wave of his dragon claws, he landed directly on the five elements millstone.<br/><br/>The five elements millstone rapidly expanded and headed towards the three divine light dragons.<br/><br/>At the same time, Wang Xian waved his dragon claws. Claws formed from condensed energy attacked the blood-red eyes in the air.<br/><br/>“Bang, Bang, Bang!”<br/><br/>In an instant, the sound of collision was heard. One by one, the eyes were destroyed.<br/><br/>“Boom, Boom, Boom!”<br/><br/>In front of them, the lock formed from condensed light collided with the Five Elements Millstone.<br/><br/>The five elements millstone was suspended in the air. The five elements revolved and transformed into destructive power. The terrifying lock of light was crushed bit by bit and disappeared.<br/><br/>“What? What kind of innate spiritual treasure is this? How can it be so powerful?”<br/><br/>The three divine light dragons’faces changed drastically. They were filled with shock<br/><br/>Crash<br/><br/>At this moment, Wang Xian flapped his primaless saint wings and disappeared instantly.<br/><br/>The next moment, he appeared in front of the injured divine light dragon.<br/><br/>“Oh No, stop him!”<br/><br/>The Divine Light Dragon’s expression changed drastically as he roared in shock and anger.<br/><br/>“What a terrifying speed. Even after being invaded by the red eye, it’s still not affected much!”<br/><br/>The red eye’s expression changed slightly. He raised the eye in his hand and the red eye in the sky above this world descended directly onto a ray of light and attacked Wang Xian.<br/><br/>Buzz<br/><br/>At this moment, the Ghost Avatar flew out from Wang Xian’s body.<br/><br/>Roar! Roar! Roar<br/><br/>The Ghost Avatar roared and went straight for the ray of light from red-eye.<br/><br/>Wang Xian continued to attack the injured divine light dragon.<br/><br/>“Damn it, what the Hell Is This!”<br/><br/>When the injured Divine Light Dragon saw a shadow coming towards red-eye’s attack, his expression changed drastically. He ignored the injuries on his body and quickly dodged to the side.<br/><br/>Crash<br/><br/>However, how could his speed be compared to Wang Xian’s.<br/><br/>Wang Xian arrived in front of him in an instant.<br/><br/>Roar! Roar! Roar<br/><br/>The Divine Dragon of light raised his head with a face full of fear. He released beams of light power in an attempt to fend off Wang Xian’s attack.<br/><br/>“Die!”<br/><br/>Wang Xian clawed at him. Ignoring the attack of the light power, he clawed at his body directly.<br/><br/>“Roar!”<br/><br/>“Save me!”<br/><br/>A painful voice came out of his mouth.<br/><br/>Behind him, the expressions of the other three divine dragons of light changed drastically.<br/><br/>“This is an underworld ghost avatar. He even has an underworld ghost avatar!”<br/><br/>At the Red Eye, he roared in disbelief.<br/><br/>An underworld ghost avatar!<br/><br/>This was the trump card of the underworld race, the terrifying ability of the underworld race.<br/><br/>Even if the others had obtained the underworld ghost, it would be difficult for them to cultivate it into their own avatar.<br/><br/>Without the special constitution and methods of the ghost clan, it would be impossible for them to cultivate the ghost into their own clones.<br/><br/>However, this expert from the Dragon Palace had one, causing red eyes to be filled with shock and disbelief.<br/><br/>“Divine light, block it!”<br/><br/>A divine light dragon looked over, his expression extremely ugly.<br/><br/>“Dragon Suppression Mountain!”<br/><br/>He roared wildly, and a mountain peak that contained a powerful light power and terrifying energy appeared above his head.<br/><br/>Within the mountain peak, there were the wings of angels of light carved on it, and in the middle, there was an archangel sword carved on it.<br/><br/>Dragon Suppression Mountain, this was the dragon suppression mountain that the angel race had created for the Holy Dragon lineage.<br/><br/>It had a great suppression on the divine dragons.<br/><br/>Dragon Suppression Mountain appeared, and it directly pressed down on the five elements Millstone.<br/><br/>“Roar Roar Roar!”<br/><br/>Within the Five Elements Millstone, the five divine dragons let out furious roars, and all sorts of weapons attacked Dragon Suppression Mountain.<br/><br/>However, under the suppression of the Dragon Suppression Mountain, the weapons were destroyed one by one!<br/><br/>“All of you, support me. I will go and save the Divine Light!”<br/><br/>The Divine Light Dragon let out a furious roar and attacked Wang Xian directly.<br/><br/>The other two divine light dragons poured streams of light energy into the Dragon Suppression Mountain to fight against the Five Elements Millstone.<br/><br/>“You want to save him? Wishful thinking. Today, I want to see who will kill who!”<br/><br/>Wang Xian let out a wild roar. The divine wings on his back flapped violently. Waves of wind and thunder attacked the Divine Dragon of light below.<br/><br/>His defense was crumbling rapidly.<br/><br/>“Divine tail of light!”<br/><br/>At the back, the Divine Dragon of light that came to support Wang Xian swung its gigantic tail and swept it towards Wang Xian.<br/><br/>“Hula!”<br/><br/>Wang Xian grabbed the figure of light below him and flapped his divine wings. He quickly came to the ground to avoid the attack of the dragon tail. The Dragon Claw grabbed him and slammed him heavily onto the ground.<br/><br/>“Roar! Roar! Roar!”<br/><br/>An intense scream came from the mouth of the Divine Dragon of light below.<br/><br/>“What a powerful recovery ability!”<br/><br/>Wang Xian looked at him. Even his powerful attack was unable to kill him. This was the Divine Dragon of light, the Divine Dragon of light!<br/><br/>“However, no matter how powerful the recovery ability is, I will still die!”<br/><br/>Waves of dark energy surged into Wang Xian’s body from his dragon claws, depleting his vitality.<br/><br/>“Save me, save me!”<br/><br/>A cry for help came from his mouth. His face was filled with fear.\t\t\t\t\t\t</div>", "images": {}, "success": true}