{"id": 484, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072869.html", "title": "Chapter 3475 - 3475 3474 Tai Chi Dragon Plate Breakthrough And Holy Dragon Ambush", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3475 - 3475 3474 Tai Chi Dragon Plate Breakthrough And Holy Dragon Ambush</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3475 3474 tai chi Dragon Plate breakthrough and Holy Dragon Ambush<br/><br/>Apart from a Level 2 universe dominator battle skeleton, there was another huge harvest.<br/><br/>That was the human-headed grass.<br/><br/>The human-headed grass was a treasure.<br/><br/>“No, no, don’t kill me, don’t kill me!”<br/><br/>The skeleton that was caught by Wang Xian begged for mercy in fear, “I’m willing to take out all my treasures, don’t kill me.”<br/><br/>“Three level two masters of the universe are hunting here. You should have gained a lot, right?”<br/><br/>Wang Xian looked at him and said with a smile.<br/><br/>“Sir, please let me go. As long as you let me go, I will take out the treasures in my divine kingdom. This is definitely much more valuable than the treasures offered by the spiritual demon race. Please let me go, sir.”<br/><br/>The skeleton continued.<br/><br/>“HMM? The reward offered by the spiritual demon race?”<br/><br/>Wang Xian raised his eyebrows slightly and stared at him with a twinkle in his eyes.<br/><br/>He didn’t expect that this fellow would be offered a reward by the spiritual demon race.<br/><br/>It seemed that they had killed quite a number of powerhouses.<br/><br/>The fact that they were able to live such a comfortable life despite being offered a reward by the spiritual demon race had a lot to do with their strength.<br/><br/>With this skeleton and the other two skeletons joining forces, they were indeed invincible.<br/><br/>However, it was a pity that they met Wang Xian this time.<br/><br/>“I want your life. I want the rest of your things as well!”<br/><br/>Wang Xian stared at him. With a wave of his hand, he landed a heavy blow on his head.<br/><br/>The eight wisps of skeleton flames on his head dimmed instantly. A few of them were showing signs of extinguishing.<br/><br/>“This defense is really tough!”<br/><br/>Wang Xian muttered and landed another palm on it.<br/><br/>“Soul capture!”<br/><br/>Following that, his mind moved and the flames that were jumping in his pupils stopped.<br/><br/>“Summon Your Kingdom of God!”<br/><br/>He ordered.<br/><br/>“Yes!”<br/><br/>The heavily injured skeleton responded mechanically. Soon, a Kingdom of God appeared behind him.<br/><br/>However, the Kingdom of God of this skeleton was a little strange and special.<br/><br/>The Kingdom of God of this skeleton looked like a coffin, and it was only 100,000 meters in size.<br/><br/>In the divine kingdom, it was considered a very small existence.<br/><br/>Wang Xian walked over and immediately opened the coffin’s divine kingdom. Everything inside came into view.<br/><br/>The entire Coffin’s divine kingdom was bare, and there were pitifully few things inside.<br/><br/>Some divine herbs and elixirs were on the level of the Master of the universe.<br/><br/>However, there were no demonic skeletons inside.<br/><br/>After thinking about it, it made sense. Skeletons could absorb and evolve, and after they killed each other, they could absorb them.<br/><br/>However, there were six innate spiritual treasures, all of which were of the darkness attribute.<br/><br/>This could greatly improve the tai chi dragon plate.<br/><br/>Apart from that, a special treasure caught his attention.<br/><br/>It was a skeleton that contained a huge amount of energy, a pink skeleton.<br/><br/>It was a palm, a pink human palm.<br/><br/>Inside this pink palm, there were two types of energy.<br/><br/>One was of the darkness attribute while the other was of the fire attribute.<br/><br/>Wang Xian was a little surprised by the fact that it was a bone palm with two attributes.<br/><br/>“The energy of this pink palm is extremely powerful. It’s even stronger than an innate spiritual treasure. Is this left behind by a fallen powerhouse? If that’s the case, how strong is this former powerhouse?”<br/><br/>Wang Xian looked at the pink palm and mumbled.<br/><br/>If this palm didn’t grow in the later stages, the owner of this palm would have been too terrifying when he was still alive.<br/><br/>He was definitely not an ordinary master of the universe.<br/><br/>It was possible that his real realm had reached the second or third stage of the Master of the universe, or even higher.<br/><br/>“It’s a pity that it can’t be used to upgrade the Tai Chi Dragon Plate and the five elements Millstone.”<br/><br/>Wang Xian felt a little regretful. The two attributes contained in this palm could not be absorbed by the Tai Chi Dragon Plate and the five elements millstone.<br/><br/>“Keep it. I might be able to use it in the future.”<br/><br/>He kept it well and looked at the skeleton in front of him. With a palm strike, he destroyed it completely.<br/><br/>The Tai Chi Dragon Plate appeared in the surroundings and allowed it to be absorbed.<br/><br/>Wang Xian looked at his surroundings. He decided to continue hunting some demonic skeletons after the tai chi dragon plate was upgraded.<br/><br/>He moved to the back and entered the skeleton. He started to help the tai chi dragon plate refine the skeletons.<br/><br/>Time passed day by day.<br/><br/>Just as the Tai Chi Dragon Plate was upgraded, five figures flew over to the area of the demon bones.<br/><br/>“What an annoying aura. Kill that guy as soon as possible and leave. I don’t want to stay here for a day.”<br/><br/>In the sky in front of the underground demon cave city, there was a huge eye on the head. Four figures with dragon horns on their heads were flying over quickly.<br/><br/>The one who spoke was a middle-aged man. He had an annoyed expression on his face.<br/><br/>With dragon horns on his head, his body contained the pure power of a divine dragon. His body was like the sunlight.<br/><br/>This was the Holy Dragon, the Divine Light Dragon of the Holy Dragon lineage.<br/><br/>Four pure-bred divine light dragons!<br/><br/>“There are four Lord Divine Dragons. It’s easy to destroy them.”<br/><br/>Red-eye said lightly.<br/><br/>“Find them as soon as possible. After we destroy them, we still have to hunt down the fellows from the ancestral dragon lineage.”<br/><br/>A divine light dragon urged.<br/><br/>“Don’t worry. I have one of the eyes of the alliance master, so I can easily find them.”<br/><br/>Red-eye replied, the eyes in his hands shining, “He’s right in front of us.”<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>Five figures flew over quickly and soon arrived above the underground demon cave city.<br/><br/>“He’s inside. This is the underground demon cave city of the Devil Bone Land. It’s extremely complicated inside.”<br/><br/>Red-eye looked over, his voice carrying a hint of helplessness.<br/><br/>“Can’t Your Alliance Leader’s Eyes Lock onto his position accurately?”<br/><br/>A light dragon God frowned and asked.<br/><br/>“We can lock onto his position, but we can’t lock onto his route. The few of you can check this place on the AI. It’s very troublesome. I suggest we ambush him here and wait for him to come out!”<br/><br/>Red-eye suggested.<br/><br/>“Ambush him here? Then if he doesn’t come out for a few decades, we should also ambush him here? If he goes back to his own divine kingdom, then wouldn’t we be waiting for Nothing?”<br/><br/>The Light Dragon said.<br/><br/>“If he goes back to his own divine kingdom, your eyes can lock onto his divine kingdom.”<br/><br/>Red-eyed said.<br/><br/>“Let’s wait here. Even if it’s a few decades, it’s just a little time.”<br/><br/>The Divine Light Dragon, who looked the oldest, said. He swept his gaze across the surroundings and said, “Let’s set up an ambush first and conceal ourselves.”<br/><br/>“Alright!”<br/><br/>The other three divine light dragons nodded their heads. This was an order from the Holy Dragon King, and they had to complete it.<br/><br/>The five figures moved and hid in the surrounding areas, quietly waiting for Wang Xian to appear.<br/><br/>Wang Xian didn’t know that there were already experts lying in wait for him outside.<br/><br/>He didn’t expect that the experts from the Hundred Cities Alliance would be able to find him here.<br/><br/>A month later, the light and darkness on the Tai Chi Dragon Disk spun and erupted with a powerful force.<br/><br/>The Tai Chi Dragon Disk had broken through!\t\t\t\t\t\t</div>", "images": {}, "success": true}