{"id": 481, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072863.html", "title": "Chapter 3472 - 3472 3471 Three Dangerous Places", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3472 - 3472 3471 Three Dangerous Places</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3472 3471 three dangerous places<br/><br/>“Eh, the interior of this spiritual demon race is a little different from the outside.”<br/><br/>Wang Xian flew to the interior of the spiritual demon race’s territory. It was different from what he had imagined. He thought that this place would be deserted.<br/><br/>However, the real interior was much livelier.<br/><br/>There were all kinds of items placed in the special skeleton buildings.<br/><br/>There were also sounds of bargaining around.<br/><br/>Some of the skeletons made sounds of collisions as they walked.<br/><br/>Wang Xian observed for a while and realized that the strength of the skeletons was related to the flames above his head.<br/><br/>These were skeleton flames.<br/><br/>There were five skeleton flames above the head of a peak universe knight. Furthermore, the colors of the flames were different.<br/><br/>Some of the flames were black, some were red, and some were purple.<br/><br/>Skeletons didn’t only have darkness attributes. There were also fire, lightning, wind, and metal attributes.<br/><br/>On the other hand, skeletons with other attributes were very rare.<br/><br/>Wang Xian walked on the ground where the skeletons were laid and observed his surroundings.<br/><br/>There were all sorts of shops in the surrounding buildings. There were quite a number of shops that even sold demonic skeletons!<br/><br/>These demonic skeletons could be cultivated and refined into their own weapons.<br/><br/>It could also be absorbed by other skeletons to increase its strength.<br/><br/>Demon skeletons were considered precious materials and treasures in this land of demon bones.<br/><br/>“Here!”<br/><br/>After walking for seven to eight hours, Jian Yun saw a huge skeleton building.<br/><br/>It was like a skeleton left behind by a space beast after its death. Its huge mouth was the entrance.<br/><br/>Above it was the spiritual demon race mission hall.<br/><br/>This mission hall was somewhat similar to the Hundred Cities Alliance’s Mission Hall.<br/><br/>As he entered the hall, he heard loud noises coming from inside.<br/><br/>One by one, the skeletons were cultivating the darkness attribute. They were looking at the missions and conversing with each other.<br/><br/>Wang Xian walked forward. There were all sorts of missions on the mission pane.<br/><br/>There were missions to purchase the demon skeletons, and there were also missions to search for some special divine herbs and parts of the divine blood skeletons in the land of the demon skeletons.<br/><br/>There were also some missions that offered rewards for assassinations. There were at least hundreds of thousands of missions.<br/><br/>Other than various missions, the spiritual demon race mission hall also sold some special information about the land of the demon skeletons.<br/><br/>This information was confidential and would not be released to the universe’s AI.<br/><br/>Wang Xian came for this information.<br/><br/>“I want to purchase the top-notch information here.”<br/><br/>He walked to a staff member and said.<br/><br/>The so-called spirit demon race was actually similar to the skeletons.<br/><br/>The difference was that they had two forms. One was in their normal state and possessed flesh and blood.<br/><br/>The other was in their combat state, when flesh and blood entered their bodies, they possessed terrifying destructive power.<br/><br/>The spirit demon race was very strong. It was known that they had the combat strength of a level three master of the universe.<br/><br/>There were even rumors that the spiritual demon race had a king of the skeleton race backing them up.<br/><br/>Wang Xian was not interested in this information. He wanted to obtain some information about the land of the demonic bones.<br/><br/>It would be best if this information could help him find more demonic skeletons!<br/><br/>“Alright, sir. This is the best information. It is worth as much as a connate numinous treasure. Are you sure you want to buy it?”<br/><br/>The staff member of the spiritual demon clan asked.<br/><br/>“Yes, give it to me.”<br/><br/>Wang Xian was slightly taken aback. He hesitated for a moment before nodding his head.<br/><br/>He had to admit that it was really expensive. However, he had killed a large number of city lords of the Hundred Cities Alliance. There were still four of them with the wind and thunder attribute.<br/><br/>He could definitely exchange them for it.<br/><br/>“Alright!”<br/><br/>Wang Xian handed over the innate spiritual treasure and the other party led him to the back.<br/><br/>“You need to sign a contract if you want to see this information. If this information is leaked out, you will be killed instantly.”<br/><br/>An old man walked over and reminded Wang Xian.<br/><br/>“Alright, I know the Rules!”<br/><br/>Wang Xian nodded and a black stone tablet appeared in front of him.<br/><br/>“Place your hand on it and you will be able to see all kinds of information. This is the best information of our spiritual demon race. It will definitely be worth it!”<br/><br/>The old man said.<br/><br/>Wang Xian placed his hand on it and waves of information gushed into his mind.<br/><br/>“HMM?”<br/><br/>Very soon, he squinted his eyes slightly. A large amount of information regarding the land of demonic bones was imprinted in his mind.<br/><br/>Underground Demon Cave City!<br/><br/>Abyssal Bone Pool!<br/><br/>Land of blood plasma.<br/><br/>Information appeared one after another. These information could be seen on the universe’s AI. However, the information sold by the spiritual demon race was 70% of the routes of the underground demon cave city.<br/><br/>There were some weaknesses of the skeleton parts in the abyss dry bone pool.<br/><br/>There was the divine blood contained in the blood plasma land. How to obtain it.<br/><br/>The detailed information made Wang Xian feel that it was worth it.<br/><br/>“The information is good, right?”<br/><br/>The old man said with a smile.<br/><br/>“Very comprehensive, very good!”<br/><br/>Wang Xian nodded his head in agreement.<br/><br/>“Please remind this lord that these secret places were explored by our spiritual demon race. In order to obtain this information, many experts were killed or injured. This is a treasure land, but it is also a dangerous place. It is very common for the masters of the universe to die.”<br/><br/>The old man kindly reminded him.<br/><br/>Jian Yun nodded. “Thank you for your reminder.”<br/><br/>Underground Demon Cave City, Abyss Dry Bone Pool, and blood pool.<br/><br/>These three places were relatively famous in the demon bone pool, and they were also the most dangerous places in the demon bone pool.<br/><br/>In the underground demon cave city, there were a large number of demon skeletons.<br/><br/>According to the information of the spirit demon race, there might be many universe rulers with level three combat power demon skeletons in the deepest parts of the city.<br/><br/>Inside the pool of bones in the Abyss was a messy place. There were countless bones densely packed together.<br/><br/>Someone had once found many innate spiritual treasures inside.<br/><br/>However, here, there were some skeletons that had gained sentience and were assembling their own bodies, hunting all kinds of experts.<br/><br/>The blood pool was a special place. There were no bones there, and it was rumored that it was a place where blood gathered.<br/><br/>It was possible to obtain some divine blood that contained a vast amount of energy.<br/><br/>These divine blood possessed great power.<br/><br/>Similarly, there was a race of blood weasel desolate beasts living here. These blood weasel desolate beasts were extremely terrifying. Even a level two master of the universe could be devoured by their blood.<br/><br/>In short, each and every one of them was a dangerous place.<br/><br/>However, it was also a treasure land.<br/><br/>Wang Xian walked out from the mission hall of the spiritual demon race with a contemplative look on his face.<br/><br/>The three great treasure lands were also three dangerous places. It didn’t matter where one entered.<br/><br/>“I should head to the underground demon cave city to hunt some demon skeletons and upgrade the tai chi dragon disc as soon as possible.”<br/><br/>Wang Xian mumbled and flew in a direction quickly.<br/><br/>In the sky, there were also many powerhouses flying in the void.<br/><br/>From his senses, the number of powerhouses here was much more than the Hundred Cities Alliance.<br/><br/>Basically, there were no powerhouses below the level of a universe knight.<br/><br/>However, the number of creatures here could not be compared to a city like the Hundred Cities Alliance.<br/><br/>“To be able to survive in the land of the demon bones, one must at least be at the level of a universe Knight.”<br/><br/>Wang Xian mumbled and sped up.\t\t\t\t\t\t</div>", "images": {}, "success": true}