{"id": 489, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072879.html", "title": "Chapter 3480 - 3480 2479 Ruler-Level Skeleton Component, Inside The Pink Skeleton", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3480 - 3480 2479 Ruler-Level Skeleton Component, Inside The Pink Skeleton</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3480 2479 ruler-level skeleton component, inside the pink skeleton<br/><br/>Buzz<br/><br/>Wang Xian sensed that the netherworld ghost avatar had suffered a heavy blow. With a thought, the Netherworld Ghost Avatar returned to his body instantly.<br/><br/>In the Dragon Palace, the ancestral tree’s soul-returning wood branch emitted a gray glow, nourishing the Netherworld Ghost Avatar’s injuries.<br/><br/>At this moment, he had already rushed to the front of the pink finger bone. The Five Elements Millstone was the first to collide with it.<br/><br/>Wang Xian’s body trembled. Numerous chains instantly sealed the surrounding area.<br/><br/>“Bang!”<br/><br/>The pink skeleton finger seemed to have sensed the pressure from the five elements millstone and immediately flew backward.<br/><br/>It directly struck the surrounding chains.<br/><br/>“Roar! Roar! Roar!”<br/><br/>On the Five Elements Millstone, the five divine dragons roared. The millstone revolved and the green dragon stuck its head out. Numerous thorns attacked the pink finger bone.<br/><br/>“Bang! Bang! Bang!”<br/><br/>The attack of the pink finger bone was extremely terrifying. When it collided with Wang Xian’s chain, the chain let out a cracking sound.<br/><br/>This made Wang Xian’s eyes focused as he flew over quickly.<br/><br/>When the pink finger bone had just broken through the chain’s defense, the branches wrapped around it and restrained it.<br/><br/>“Boom!”<br/><br/>However, at this moment, the tiny finger bone burst into violent flames. The terrifying flames caused the branches to turn black.<br/><br/>“Roar! Roar!”<br/><br/>The five elements were grinding against each other. The fire god Dragon roared and spewed out flames towards the branches to block the flames from the finger bone!<br/><br/>At this moment, Wang Xian rushed over. His palm turned into light, which condensed into a point and attacked the pink finger bone.<br/><br/>“Bang!”<br/><br/>“Ah!”<br/><br/>The terrifying penetration and collision rang out.<br/><br/>A shrill sound of pain could be heard from within the finger bone.<br/><br/>Wang Xian focused his gaze. A bright and magnificent dragon horn condensed above his head. The Dragon Horn locked onto the pink finger bone and attacked once again.<br/><br/>Buzz<br/><br/>However, the finger bone trembled violently. Pitch-black claws appeared around him.<br/><br/>Each claw seemed to come from Hell as it attacked Wang Xian and the five elements millstone.<br/><br/>Wang Xian’s expression changed slightly. With a wave of his arm, the five elements millstone flew into his hand.<br/><br/>Waves of five elements power surged into the five elements millstone and a terrifying energy was injected into it.<br/><br/>The Five Elements Millstone was accompanied by five divine dragons that roared.<br/><br/>Metal, wood, water, fire, and earth. The five attribute swords slashed towards the pink finger bone.<br/><br/>The surrounding hell claws collapsed one by one under the sharp swords. Although two of the five attribute swords had dissipated, there were still three that landed on them.<br/><br/>“Bang! Bang! Bang!”<br/><br/>“Ah! Ah!”<br/><br/>The painful screams continued to ring out. There was a hint of brutality in the voice.<br/><br/>“Void realm-breaking finger!”<br/><br/>At this moment, five words suddenly came from the pink finger bone. Following that, Wang Xian sensed that there seemed to be a terrifying change in his surroundings.<br/><br/>His surroundings seemed to have changed into the void of the universe. There was nothing in this endless void except for a finger pointing at his head!<br/><br/>This powerful and strange attack made Wang Xian’s heart skip a beat!<br/><br/>“How can this pink finger bone be so terrifying?”<br/><br/>His expression was a little solemn as he hurriedly picked up the five elements millstone in his hand.<br/><br/>A huge amount of five elements power surged into it. The five elements revolved and turned into the Earth attribute.<br/><br/>The earth dragon slowly entrenched itself and completely surrounded Wang Xian.<br/><br/>“Bang!”<br/><br/>A tremendous force was transmitted over. Wang Xian could feel his body flying backward rapidly.<br/><br/>Everything around him was restored once again. His body flew backward and collided with countless dry bones.<br/><br/>The energy of the pink finger bone dimmed a little and was about to flee into the distance!<br/><br/>Crack! Crack! Crack<br/><br/>The incipient sacred wings on Wang Xian’s body flapped violently. A force of wind and thunder instantly landed on it.<br/><br/>He steadied his body and chased after it immediately.<br/><br/>This finger bone was definitely a treasure.<br/><br/>Even if he couldn’t use it, he could at least increase the combat strength of a level two universe dominator in the Dragon Palace after being absorbed by the Dragon Transformation Pool.<br/><br/>The void seeking enemy had already attached itself to the pink finger bone. Wang Xian exerted his speed to the maximum.<br/><br/>“Bang, Bang, Bang!”<br/><br/>The pink finger bone was the size of an ordinary human’s finger. Its speed was abnormally fast inside.<br/><br/>Wang Xian quickly shrunk his body size and followed behind.<br/><br/>Shrinking one’s body size was maintained by energy. Furthermore, shrinking one’s body size did not mean that one’s strength would not change.<br/><br/>Otherwise, wouldn’t it be better for a strong person to become a needle than a large creature?<br/><br/>After all, the smaller one was, the stronger one’s penetrating force would be!<br/><br/>This was not the case. This involved the circulation of the energy in one’s body.<br/><br/>There was still a gap between Wang Xian in his human form and his divine dragon form.<br/><br/>Although the gap was not huge, he was still slightly stronger in his divine dragon form.<br/><br/>Wang Xian followed behind him. In just ten minutes, he could not see the pink finger bones at all.<br/><br/>However, Wang Xian relied on the power of wind and thunder to lock down his enemies. He quickly sensed and chased after them.<br/><br/>“Bang, Bang, Bang!”<br/><br/>Wherever he passed by, a terrifying sound spread to the surroundings.<br/><br/>Some of the powerhouses in the land of devil bones sensed Wang Xian’s undisguised energy and hurriedly hid far away.<br/><br/>Wang Xian did not have any scruples. After all, if he were to encounter a powerhouse with the combat strength of a level three master of the universe, he would only be considered unlucky.<br/><br/>He continued to give chase from behind. Time passed by little by little.<br/><br/>After pursuing him for more than two months, Wang Xian could already feel that he had arrived at a place far away.<br/><br/>This place did not even have any information about the spiritual demon race.<br/><br/>This made him cautious.<br/><br/>He made the already recovered ghost avatar in front while he was at the back.<br/><br/>After advancing for another ten days based on the ability to search for enemies in the void, he finally arrived in front of the pink finger bone.<br/><br/>Wang Xian immediately stopped and looked ahead.<br/><br/>The Ghost Avatar also stopped.<br/><br/>“The condition of the pink finger bone should be no different from being injured. I can see if I can seal it up!”<br/><br/>Wang Xian mumbled and instructed the ghost avatar to bring the five elements millstone to the left.<br/><br/>Ten minutes later, the Ghost Avatar and the Five Elements Millstone arrived behind the pink finger bone.<br/><br/>According to the information brought by the enemy search in the void, the pink finger bone was located in the middle.<br/><br/>“As long as I capture it, it will be a great harvest!”<br/><br/>Wang Xian’s eyes sparkled as he began to approach slowly, concealing his figure.<br/><br/>The Ghost Avatar was also approaching the opposite position.<br/><br/>Crash<br/><br/>When Wang Xian was about to approach the finger bone, it seemed to have sensed something and immediately flew away from Wang Xian.<br/><br/>It was also the place where the ghost avatar and the Five Elements Millstone were.<br/><br/>“Alright!”<br/><br/>Wang Xian sensed it and no longer had any cover. He quickly increased his speed.<br/><br/>Boom! Boom! Boom<br/><br/>He flew away quickly while the ghost avatar and the Five Elements Millstone hid themselves rapidly and waited for the pink finger bone to charge over.<br/><br/>Bang<br/><br/>When he was within the attack range of the ghost avatar and the pink finger bone, a terrifying attack immediately erupted!\t\t\t\t\t\t</div>", "images": {}, "success": true}