{"id": 490, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072881.html", "title": "Chapter 3481 - 3481 2,480 Skeleton Parts Of The Master Level, The Pink Skeleton", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3481 - 3481 2,480 Skeleton Parts Of The Master Level, The Pink Skeleton</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3481 2,480 skeleton parts of the master level, the pink skeleton<br/><br/>Boom! Boom<br/><br/>The Five Elements Millstone and the Ghost Avatar launched an attack. The terrifying attack completely covered the pink finger bone.<br/><br/>The sudden attack and the terrifying attack power landed on the pink finger bone.<br/><br/>“Ahhhh!”<br/><br/>The pink finger bone flew backward and let out an extremely loud scream.<br/><br/>When Wang Xian saw it, he was overjoyed.<br/><br/>His palm turned into the Dragon Claw of the radiant divine dragon and clawed at it.<br/><br/>“No!”<br/><br/>The pink finger bone had a premonition and let out a despairing and brutal roar.<br/><br/>Crack Crack<br/><br/>Wang Xian grabbed it with his palm and held it tightly. A faint smile appeared on his face.<br/><br/>After spending so much time, he finally managed to grab the pink finger bone.<br/><br/>It wasn’t easy!<br/><br/>This pink finger bone was worth a lot of money.<br/><br/>This time, he had made a huge profit by coming to the ancient pool of the Abyss!<br/><br/>Boom<br/><br/>Waves of energy destroyed the soul of the pink finger bone. Wang Xian revealed a curious expression on his face.<br/><br/>A small finger bone was able to bear such a terrifying amount of energy. The owner of this finger bone when he was alive was definitely an existence at the level of a ruler of the universe.<br/><br/>“I wonder if it belongs to the same owner as that pink palm.”<br/><br/>Wang Xian mumbled to himself. He looked around and decided to leave this place.<br/><br/>This place was already considered an extremely dangerous place. If he were to be attacked by the demonic skeleton with the level-three combat strength of a ruler of the universe, it would not be worth it.<br/><br/>His body moved and Wang Xian was prepared to fly upwards to reach the ground.<br/><br/>Boom<br/><br/>Just as Wang Xian was about to leave, waves of majestic energy suddenly rushed towards his direction.<br/><br/>This made him slightly stunned. He turned his head around in astonishment.<br/><br/>“This is?”<br/><br/>When Wang Xian looked over, he was slightly stunned.<br/><br/>A skull was flying towards him. Furthermore, this skull was pink in color. It was similar to the pink finger bones and palm that he had obtained.<br/><br/>The power contained within the skull was at the level of a level two master of the universe.<br/><br/>“That’s not right. It’s at the level of a level three master of the universe. It’s been severely injured!”<br/><br/>At this moment, Wang Xian sensed that something was amiss. This pink skull was unusually weak. It must have been severely injured.<br/><br/>What level would an expert be at if he was severely injured to such a level?<br/><br/>“Lock onto it and don’t let it escape!”<br/><br/>At this moment, a voice was heard from the back.<br/><br/>Looking over, four figures were flying over from the back. The leader was a skeleton.<br/><br/>This skeleton was also very special. She had a pink chest and the rest of her body was no different from an ordinary skeleton.<br/><br/>However, Wang Xian’s gaze immediately landed on the top of her head.<br/><br/>On top of her head, there was a skeleton palm pressing on her head. This palm emitted an energy that made Wang Xian’s heart palpitate.<br/><br/>“There’s an expert in front!”<br/><br/>“Don’t look at that Skeleton Head!”<br/><br/>At this moment, the four figures noticed Wang Xian in front of them and reminded him loudly.<br/><br/>“Huh?”<br/><br/>Wang Xian was slightly stunned. At this moment, the eyes of the skeleton head that was flying towards him suddenly emitted a blood-red glow.<br/><br/>Its eyes were like a sea of blood, possessing another world.<br/><br/>Wang Xian felt as though he had been pulled into an unfamiliar world.<br/><br/>“Not good!”<br/><br/>The voices of the four people came from the front.<br/><br/>Buzz<br/><br/>“You’re courting death!”<br/><br/>However, at this moment, Wang Xian’s mind immediately cleared up. With a move of his palm, the power of the five elements was channeled into the five elements grinding mill and smashed directly at the pink skull.<br/><br/>Boom<br/><br/>Wang Xian’s sudden awakening was obviously out of the Pink Skull’s expectations. He was hit heavily.<br/><br/>The entire skull flew backward.<br/><br/>“Huh?”<br/><br/>“This is a powerhouse!”<br/><br/>“Thank you for your help. The demon claw from the previous era has traveled through time and space and the starry sky. Capture!”<br/><br/>At the back, four skeleton powerhouses shouted loudly.<br/><br/>The skeleton with a pink skeleton chest in the middle stopped and muttered. The claws on its head glowed.<br/><br/>At the next moment, claws suddenly appeared around the pink skeleton head and tried to catch it.<br/><br/>The claws contained a terrifying power and grabbed it tightly.<br/><br/>“What kind of strange technique is this? No, this is an innate treasure. It’s definitely an innate treasure!”<br/><br/>Wang Xian looked over and his pupils contracted slightly.<br/><br/>This was the second time he had seen an innate supreme treasure.<br/><br/>The first time was the terrifying innate supreme treasure of the Archangel of Baili Archangel. It was able to kill the head directly.<br/><br/>And this innate supreme treasure was able to stretch out its demonic claws in the void and attack.<br/><br/>They were all abnormally terrifying!<br/><br/>Moreover, according to his senses, the four skeletons in front of him were all at the level of a level two universe overlord.<br/><br/>The reason why such a powerful skeleton could heavily injure or even suppress a level-three universe master was probably due to that innate true treasure.<br/><br/>“Die, die, die, die!”<br/><br/>The Pink Skull roared ferociously, and the blood ocean in its eyes kept rolling.<br/><br/>However, the next moment, the demon claw disappeared, and the pink skull was also there.<br/><br/>Following that, the pink skull appeared in front of the pink skull with a chest.<br/><br/>The skull fire in her eyes was throbbing. It was filled with excitement and surprise. She immediately put it away.<br/><br/>“Thank you, my friend, for your help. Ling Honggu is extremely grateful!”<br/><br/>The skull with the innate treasure looked at Wang Xian and thanked him.<br/><br/>“Eh? Ling Honggu? The spiritual demon clan?”<br/><br/>Wang Xian was astonished when he heard her name.<br/><br/>“You’re welcome. It was just a coincidence.”<br/><br/>Wang Xian shook his head and couldn’t help but look at the position of her chest.<br/><br/>The energy contained there was the same as the pink skeleton’s palm and finger bone.<br/><br/>“Judging from your attack just now, you should be from the Divine Dragon lineage, right? The ancestral dragon lineage?”<br/><br/>Ling Honggu looked at Wang Xian and asked curiously.<br/><br/>“No, it belongs to the Dragon Palace.”<br/><br/>Wang Xian shook his head.<br/><br/>“The Dragon Palace?”<br/><br/>Ling Honggu was puzzled. The skeleton at the side knew something and transmitted a message to her.<br/><br/>“My friend from the Dragon Palace, the battle in the underground Demon Cave City not long ago should be between the Holy Dragon tribe and the Alliance of 100 cities, right?”<br/><br/>A skeleton on the right said.<br/><br/>“Yes!”<br/><br/>Wang Xian did not hide anything. It was normal for the spiritual demon tribe to know about the battle in the underground Demon Cave City. After all, this was their territory.<br/><br/>“Oh?”? “Be careful, my friend. If you are fine, you can come to our spiritual demon race as a guest. Don’t worry. Our spiritual demon race has no connection with the Hundred Cities Alliance and the Holy Dragon lineage. Furthermore, the skeleton race and the angel race are not on good terms.”<br/><br/>Ling Honggu invited him.<br/><br/>“Sure.”<br/><br/>Wang Xian hesitated for a moment. He did not find them disgusting and nodded his head.<br/><br/>He was very curious about this pink skeleton. The other party should know something about it.<br/><br/>Wang Xian wanted to know more about it first.\t\t\t\t\t\t</div>", "images": {}, "success": true}