{"id": 498, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072897.html", "title": "Chapter 3489 - 3489 2488 Panic In The Hundred Cities Alliance", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3489 - 3489 2488 Panic In The Hundred Cities Alliance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3489 2488 panic in the Hundred Cities Alliance<br/><br/>“How terrifying! The strength of the Dragon Palace is so terrifying! Four more cities of the Hundred Cities Alliance were destroyed by the Dragon Palace, and none of them managed to escape. They have completely turned into dead cities!”<br/><br/>“The four cities were destroyed in less than half a day. It was so terrifying. We thought that the Dragon Palace was courting death by provoking the Hundred Cities Alliance, but we didn’t expect that it was the Hundred Cities Alliance who was courting death.”<br/><br/>“So far, nine cities have been destroyed by the Dragon Palace. Will There Be More? May I ask if the disciples and residents of the Hundred Cities Alliance are panicking?”<br/><br/>“I’m a resident of the Hundred Cities Alliance. I’m panicking now. I’m going to run away!”<br/><br/>After the news that four more cities in the nine-nine cities, nine-star Lianzhu city, Martial City, and Star City had been destroyed spread, the forces in the mainland were in an uproar.<br/><br/>The Hundred Cities Alliance was not weak, but now, nine cities had been destroyed.<br/><br/>Each city was equivalent to a high-level race!<br/><br/>The Hundred Cities Alliance was originally a neutral alliance force, but now because of the Divine Dragon and the Dragon Palace, it was completely involved in the war.<br/><br/>It would be fine if the dragon palace was destroyed, but now, not only was the dragon palace not destroyed or suppressed, but four more cities were destroyed.<br/><br/>Since the beginning of the war between the Dragon Palace and the Hundred Cities Alliance, nine cities had been destroyed in just a few years.<br/><br/>That was nine cities!<br/><br/>If the Hundred Cities Alliance could not destroy the Dragon Palace immediately, which city would be destroyed next.<br/><br/>Although the great array of all the cities of the Hundred Cities Alliance had been activated, the residents and some disciples and experts were even more panicked.<br/><br/>After the news broke out, a large number of residents walked out of the alliance and entered other cities.<br/><br/>They were not leaving?<br/><br/>Why Not?<br/><br/>They had become the victims of the war between the Alliance and the Dragon Palace.<br/><br/>In the face of war, there was no right or wrong, only victory and defeat.<br/><br/>But now they understood that even if the alliance could win in the end, it would suffer a great loss.<br/><br/>The strength displayed by the Dragon Palace had already left the alliance somewhat helpless.<br/><br/>The departure of the residents and the loss of people had caused even more disciples and warriors of the Hundred City Alliance to fall into Fear and panic.<br/><br/>Their expressions were all extremely ugly.<br/><br/>Even some city lords of the Hundred City Alliance were panicking.<br/><br/>After all, from the start of the war until now, there had been a total of 13 universe knights with level 1 battle strength that had died.<br/><br/>This was an existence on the same level as them!<br/><br/>…<br/><br/>“Dragon King, we’ve reaped a bountiful harvest this time.”<br/><br/>At the same time, within the Dragon Palace, the eight-limbed demon demon and the others said excitedly.<br/><br/>After a few years of hibernation, they had reaped a huge harvest today.<br/><br/>Six universe master level 1 combat strength corpses, and six Great Beings’God countries.<br/><br/>In addition to the accumulation of all four cities, as well as a large number of corpses.<br/><br/>There were more than 50 peak-stage universe knights in the four cities.<br/><br/>This time, Wang Xian was prepared to use these 50 corpses to increase the number of universe masters of the Dragon Palace with level-one combat strength.<br/><br/>In other words, this time, he would be able to increase the number of universe masters with level-one combat strength by at least 14.<br/><br/>In addition, Wang Xian had six demon skeletons with level-two combat strength of universe masters in his hands.<br/><br/>After the members of the Dragon Palace absorbed these, the number of experts in the Dragon Palace would receive a terrifying increase.<br/><br/>“All of you should go and increase your strength first. Next, you should be more cautious. I will go to the outside world to investigate the situation.”<br/><br/>Wang Xian spoke to them.<br/><br/>“It’s the Dragon King!”<br/><br/>The eight-limbed demon demon and the rest nodded. Their faces were filled with excitement.<br/><br/>“Boss Dragon King, can you give me all the water-type treasures and some elixirs? As long as I absorb all the water-type treasures and some elixirs, I will be able to regain my level-two combat strength as a universe overlord. By then, I will be able to kill even more enemies of the Dragon Palace.”<br/><br/>The water-tentacle king looked at Wang Xian greedily.<br/><br/>“Alright!”<br/><br/>Wang Xian thought for a moment and nodded.<br/><br/>Although the recovery of the water-tentacle king required a large number of treasures, the strength of the water-tentacle king was not to be underestimated.<br/><br/>The former ruler of the universe, the space behemoth, was not something the other members of the Dragon Palace could compare to.<br/><br/>“Thank you, Dragon King!”<br/><br/>The water-tentacle king cheered and flew straight to the pile of treasures in front of him, taking away the items that were beneficial to his recovery.<br/><br/>Wang Xian smiled and ignored her.<br/><br/>Splash<br/><br/>“Daddy, Daddy, Lingling is awake! Lingling is awake!”<br/><br/>At this moment, a voice rang in his ears. The little fellow appeared beside him and flapped its wings continuously.<br/><br/>“Oh? Lingling is awake?”<br/><br/>Wang Xian looked at her and patted her head.<br/><br/>“Yes.”<br/><br/>Lingling nodded and moved her palm. She pouted slightly and said, “Daddy, I only have one small lotus flower left. Why Is it missing?”<br/><br/>She looked at the lotus flower on the magic staff in front of her and asked with a pout.<br/><br/>“Can’t you see that this lotus flower is even stronger? It has already grown three flower buds!”<br/><br/>Wang Xian nodded her face and said with a smile.<br/><br/>“Oh, OH. When will these three flowers bloom?”<br/><br/>Lingling asked innocently.<br/><br/>“HMM, it won’t be long.”<br/><br/>Wang Xian smiled. The hostility brought about by the massacre was quickly dispelled by Ling Ling.<br/><br/>With the awakening of Ling Ling, Wang Xian’s strength could be improved a little.<br/><br/>If the king of water touch could recover a little more, Wang Xian felt that it shouldn’t be too much of a problem to deal with an ordinary level three master of the universe.<br/><br/>Of course, it was only to resist. It was impossible to defeat the other party.<br/><br/>If the other party had a powerful treasure, there was no need to think about it.<br/><br/>However, he was already very satisfied with this.<br/><br/>In the four cities, other than the harvest of the corpse resources, there were twelve innate spiritual treasures. Eight of them were of the five elements and could be absorbed by the five elements grinding mill.<br/><br/>There was also one of the light elements which could be absorbed by the Tai Chi Dragon Plate!<br/><br/>Just as Wang Xian was counting the treasures…<br/><br/>In the sky above Wu City, the leader of the Alliance of 100 cities was hovering with a gloomy face.<br/><br/>The terrifying blood-red eyes on his body reflected everything that was happening in Wu City.<br/><br/>However, he could only see the destruction of the entire city.<br/><br/>He could only see the terrifying attacks unleashed by the powerhouses of the Dragon Palace. He did not notice anything else.<br/><br/>“What’s going on? The city lord of Martial City was killed in advance? But how could those hidden arrays be destroyed? How did they do it?”<br/><br/>“A powerful soul-searching technique, or some other strange ability?”<br/><br/>The Alliance Master of the Hundred Cities Alliance stared down with a gloomy face.<br/><br/>He couldn’t do anything about this strange attack.<br/><br/>“I’ve underestimated the Dragon Palace!”<br/><br/>He stood in the air for half an hour, but still had no clue. His body trembled as he said coldly.<br/><br/>“We must destroy the Dragon Palace. Even if we can’t destroy it, we must ensure the safety of the Hundred Cities Alliance. Otherwise, everything will be over.”<br/><br/>He gritted his teeth, looked to the west, and immediately flew away.\t\t\t\t\t\t</div>", "images": {}, "success": true}