{"id": 499, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072899.html", "title": "Chapter 3490 - 3490 2489 Dragon Eyes Of Reflection!", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3490 - 3490 2489 Dragon Eyes Of Reflection!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3490 2489 dragon eyes of reflection!<br/><br/>Two days later, the Alliance Master of the Hundred Cities Alliance floated in the sky above the nine stars Lianzhu city with a gloomy face.<br/><br/>Here, the information he received was exactly the same as that of Martial City.<br/><br/>Waves of terrifying figures rose up and directly destroyed the entire city.<br/><br/>The defensive array in the city was not opened, and the battle did not erupt.<br/><br/>It was as if half of the city had already died.<br/><br/>He was helpless against this situation, there was nothing he could do.<br/><br/>“Hu!”<br/><br/>The city leader of the Hundred Cities Alliance took a deep breath, took out his universe AI and contacted Holy Dragon Emperor!<br/><br/>Even though the Hundred Cities Alliance had entered the battlefield to participate in the battle between the Holy Dragon and the ancestral dragon.<br/><br/>However, the Hundred Cities Alliance was not considered a lackey of the Holy Dragon.<br/><br/>The power of the Alliance leader of the Hundred Cities Alliance was not much weaker than Holy Dragon Emperor.<br/><br/>It was just that he didn’t have a connate true treasure, but the weapons he forged were also very terrifying.<br/><br/>Now that the hundred cities alliance had encountered such a situation because of the Holy Dragon bloodline, he had to ask for the other party’s support.<br/><br/>He even had to ask for the support of the angel race.<br/><br/>If this continued, the Hundred Cities Alliance would collapse.<br/><br/>“Quick, quick, after receiving the mission, deal with some matters and we’ll leave this place quickly.”<br/><br/>Time passed day by day. A figure with a staff in hand and a twig wrapped around his head entered Muyang City.<br/><br/>Muyang city was a huge city located within a forest.<br/><br/>It was one of the top ten cities within the Hundred City Alliance.<br/><br/>The city leader of this city was a level two universe master with Combat Power. There were more than ten universe masters with Combat Power.<br/><br/>He was definitely the core city of the Hundred Cities Alliance. He was extremely powerful.<br/><br/>However, the current Muyang city was much quieter than before.<br/><br/>Some people also came in and came out in a hurry.<br/><br/>Even though the formation had covered the entire city, it still couldn’t make people calm down.<br/><br/>The figure that was entangled by the branches and leaves was Wang Xian who came from the Dragon Palace.<br/><br/>After the five elements great mill and the Tai Chi Dragon Plate devoured those innate spiritual treasures, he rushed over immediately.<br/><br/>He wanted to investigate the specific situation of the Hundred Cities Alliance.<br/><br/>Although the poisonous horned dragon seed had not been exposed, he still had to be careful of the methods of some universe masters.<br/><br/>He did not dare to guarantee that the other party had a way to verify the poisonous horned dragon seed.<br/><br/>However, he felt that if it was a race at the peak of the universe, there was an 80% chance that they would be able to find out if an expert had been parasitized by the poisonous horned dragon species.<br/><br/>The parasitism of the poisonous horned dragon species was not invincible. It was still possible for it to be discovered if it was parasitized into a person’s body.<br/><br/>At the very least, with Wang Xian’s current strength, he could use the dragon eyes.<br/><br/>Wang Xian could see some clues when a poisonous horned dragon species at the level of a universe knight parasitized someone else.<br/><br/>The means of the strong were not to be underestimated.<br/><br/>Apart from this conjecture, he had to look at other problems.<br/><br/>Wang Xian’s attire was made for him by Lingling.<br/><br/>After Lingling made a breakthrough, she had mastered a few supporting abilities.<br/><br/>One of them was the heart of nature.<br/><br/>The heart of nature was a disguise ability that allowed Wang Xian to possess a wood attribute identity.<br/><br/>This identity completely isolated his identity as a dragon God.<br/><br/>Now, the aura contained within his body belonged to the elves.<br/><br/>Wang Xian realized that this concealment ability was much more powerful than his transformation into a true dragon body.<br/><br/>This was equivalent to transforming his identity as a true dragon into an elf.<br/><br/>This time, it was likely that the red eyes would not be able to lock onto him.<br/><br/>Wang Xian came to the location of a restaurant and requested for a room. He waited there quietly.<br/><br/>“HMM?”<br/><br/>Time passed day by day. At the Endless Divine Mountain of light, the Holy Dragon King looked at the alliance leader of the Hundred Cities Alliance in front of him and frowned.<br/><br/>“According to the information we received, the one who saved an azure dragon from the ancestral dragon lineage back then was a powerhouse from the Dragon Palace. Now that our hundred cities alliance has been forced to such an extent, we want to get the Lord of the Angel clan to make a move.”<br/><br/>The Alliance Master of the Hundred Cities Alliance looked at the Holy Dragon King and said with an unpleasant expression.<br/><br/>“Of course, if the Holy Dragon lineage has any way to help us solve the current crisis, it’s also possible.”<br/><br/>The Alliance Master of the Hundred Cities Alliance added.<br/><br/>“This matter is not worth disturbing the lords of the Angel clan.”<br/><br/>The Holy Dragon King’s eyes flickered as he said.<br/><br/>“Then do we have to wait until our hundred cities alliance completely collapses before we take action?”<br/><br/>The Hundred Cities Alliance leader said with a gloomy face.<br/><br/>“Don’t worry, it’s just a Dragon Palace.”<br/><br/>The Holy Dragon King said lightly.<br/><br/>“How can we not be worried? Last Time, your son personally went to kill the Devil Dragon of the Dragon Palace, but he didn’t succeed. Now, nine of our cities have been destroyed!”<br/><br/>The Hundred Cities Alliance leader said coldly.<br/><br/>“This is a glance from the Holy Dragon. If placed in the city, it can sense anyone with the aura of the Holy Dragon and the bloodline of the Holy Dragon. If placed in the city, it can give an early warning. Even I can sense it.”<br/><br/>The Holy Dragon King waved his arm and fist-sized pupils flew towards the alliance leader of the Hundred Cities Alliance.<br/><br/>“Humph!”<br/><br/>The alliance leader of the Hundred Cities Alliance waved his arm and took all the pupils and left.<br/><br/>His expression did not look good.<br/><br/>That was because he did not even have the right to meet the experts of the angel race.<br/><br/>“If it wasn’t for the fact that I could not refuse the promise of Your Holy Dragon Bloodline, Our Hundred Cities Alliance would not have joined forces with you lackeys.”<br/><br/>In the next moment, his figure appeared in the old Chao of the Hundred Cities Alliance. His heart was ice-cold.<br/><br/>“Red-eye, Heaven’s will!”<br/><br/>He sat there cross-legged and growled in a low voice.<br/><br/>“Lord Alliance Leader!”<br/><br/>Soon, red-eye and an old man flew over and called out respectfully.<br/><br/>“Take these pupils and search all the cities in the Hundred Cities Alliance that have the Divine Dragon bloodline. After finding them, kill them immediately.”<br/><br/>The Hundred Cities Alliance’s Alliance leader looked at them. “In addition, place a pupil in each city. This pupil can sense all the people with the Divine Dragon bloodline and the divine dragon aura in the surroundings.”<br/><br/>“It’s the leader!”<br/><br/>When the red-eyed Heaven’s will and the others saw the use of this treasure, their eyes lit up. They nodded and left immediately.<br/><br/>They brought people to a city and immediately took out a dragon eye of reflection.<br/><br/>“Eh? There are people with the Divine Dragon bloodline in this city. Kill them directly!”<br/><br/>Seeing the information on the Dragon Eye of reflection, the red-eyed heaven’s will immediately flew toward the direction indicated. Without any confirmation or inquiry, it directly killed the person with the Divine Dragon Bloodline.<br/><br/>Very soon, the people with the Divine Dragon bloodline in the cities were swiftly cleaned up.<br/><br/>Some of the Dragon Palace’s disciples who had concealed their aura and entered the Hundred Cities Alliance were immediately caught and killed.<br/><br/>The death of a large number of dragon palace’s disciples also attracted Prime Minister Gui’s attention. After seeing the location of their deaths, he immediately issued a notice to all the Dragon Palace’s disciples to withdraw from the Hundred Cities Alliance.<br/><br/>Wang Xian soon received the news as well. His eyes sparkled.<br/><br/>It seemed that the hundred cities alliance had some special methods. He just didn’t know if the poisonous horned dragon species would be discovered.<br/><br/>“It’s time to test it out!”<br/><br/>He mumbled.\t\t\t\t\t\t</div>", "images": {}, "success": true}