{"id": 491, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072883.html", "title": "Chapter 3482 - 3482 2481, The Son Of The Holy Dragon King. It Was An Innate Treasure", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3482 - 3482 2481, The Son Of The Holy Dragon King. It Was An Innate Treasure</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3482 2481, the son of the Holy Dragon King. It was an innate treasure<br/><br/>“We have a teleportation item here. If you trust us, you can crush it directly!”<br/><br/>In the pool of dry bones in the Abyss, Ling Honggu passed him a skull compass.<br/><br/>Wang Xian took a look at it. It was a teleportation item.<br/><br/>He smiled and nodded his head. Then, he moved his body and disappeared slowly.<br/><br/>Ling Honggu smiled and disappeared soon after.<br/><br/>When Wang Xian regained his sight, he had already arrived at a huge skeleton building within the spiritual demon race.<br/><br/>Below him was a huge formation.<br/><br/>Beside him, Ling Honggu and the rest appeared beside Wang Xian.<br/><br/>“Eh?”<br/><br/>What surprised Wang Xian was that Ling Honggu was no longer the skeleton from before. Instead, she was an extremely beautiful woman.<br/><br/>“I still don’t know the name of this friend from the Dragon Palace!”<br/><br/>Ling Honggu asked Wang Xian with a smile.<br/><br/>“Wang Xian!”<br/><br/>Wang Xian declared his life and cupped his hands with a smile.<br/><br/>“By the way, Miss Ling Honggu, why is the demonic skeleton that you were chasing earlier pink? I feel that there are two types of elemental energy in its body.”<br/><br/>He asked.<br/><br/>The main reason why he followed them this time was to obtain this answer.<br/><br/>“Young master Wang Xian, you are a guest. Let’s Find a place to sit down first. I will give you an answer!”<br/><br/>Ling Honggu said with a smile and gestured to the three people beside him.<br/><br/>The three of them smiled and left immediately.<br/><br/>“Alright, thank you, Miss Ling Honggu!”<br/><br/>Wang Xian smiled and said.<br/><br/>“You’re welcome. If it weren’t for you, that skull would have a high chance of escaping. I should be the one thanking you. If you need any help in the future, just look for me, Ling Honggu.”<br/><br/>Ling Honggu smiled and led him out.<br/><br/>This place was the core of the spiritual demon race. Non-spiritual demon race members were prohibited from entering.<br/><br/>“Eh? What’s going on? His figure suddenly disappeared. where is he now? In that direction!”<br/><br/>Just as Wang Xian followed Ling Honggu into the inner part of the spiritual demon race, five figures were located in the dry bone pool of the abyss. They were above the dry bone pool.<br/><br/>Red eyes stared at the eyes in his hand. The huge eyes on the head were sparkling as he spoke.<br/><br/>“It should be an item that can be used to teleport. Sir Holy Dragon Son, the Demonic Dragon of the Dragon Palace is in that direction!”<br/><br/>Red Eye pointed to a direction and said to a skinny but extremely handsome middle-aged light dragon God beside him.<br/><br/>“Let’s go over and kill him!”<br/><br/>The middle-aged Light Dragon God was the son of the Holy Dragon King of the Holy Dragon lineage. He was also the most outstanding son, the Holy Dragon Son.<br/><br/>The son of the Holy Dragon stared in that direction and said faintly.<br/><br/>“It’s Lord Holy Dragon Son!”<br/><br/>Red-eyed immediately replied and led the way.<br/><br/>“Lord Holy Dragon Son, that direction seems to be the spiritual demon race. The spiritual demon race’s strength isn’t weak.”<br/><br/>A divine dragon of light looked ahead and said.<br/><br/>“Give them a greeting. They don’t dare to protect the enemies that our holy dragon lineage wants to kill.”<br/><br/>The Holy Dragon Son said faintly.<br/><br/>The few light dragons nodded slightly.<br/><br/>In terms of overall strength, this spirit demon race was still slightly inferior to their Holy Dragon Clan.<br/><br/>Four Light Dragons and an expert from the Hundred Cities Alliance quickly shuttled through the sky above the spirit demon race. Their powerful auras didn’t have the slightest scruple.<br/><br/>…<br/><br/>“Your Highness!”<br/><br/>The spiritual demon race had an incomparably huge five-fingered bone claw.<br/><br/>This claw stood erect on the ground. It was hundreds of thousands of meters tall and huge.<br/><br/>With such a huge claw, an existence when he was alive was definitely an expert at the level of a universe overlord who could destroy the world.<br/><br/>On the tallest claw in the center, Ling Honggu flew over with Wang Xian.<br/><br/>An expert from the spiritual demon race immediately bowed respectfully.<br/><br/>“Prepare a sumptuous meal for our guest and bring it here as soon as possible.”<br/><br/>Ling Honggu instructed.<br/><br/>“It’s Your Highness!”<br/><br/>The powerhouse of the spiritual demon race immediately replied respectfully.<br/><br/>“Oh? I didn’t expect you to be the princess of the spiritual demon race, Miss Honggu?”<br/><br/>Wang Xian revealed a look of astonishment in his eyes.<br/><br/>He initially thought that the other party was only a powerhouse of the spiritual demon race. He didn’t expect that she was indeed a princess.<br/><br/>The spirit demon race could be considered to belong to the skeleton race.<br/><br/>The skeleton race was somewhat similar to the previous Dragon God race.<br/><br/>The skeleton race was not a whole race. They were divided into skeleton kings.<br/><br/>Every Skeleton King had the realm of a universe ruler.<br/><br/>A king was the king of a tribe. Below him were princes, princesses, and generals!<br/><br/>The position of a princess was very high in the skeleton race.<br/><br/>Especially since spirit red bone had the combat power of a Level 2 universe overlord, this strength was considered the top of the spirit demon race.<br/><br/>“Hehe, it’s just the identity of a princess. In the heaven opening primal continent, everything still depends on one’s own strength.”<br/><br/>Spirit red bone smiled slightly, and with a move of his palm, he took out the pink skull.<br/><br/>“If I didn’t guess, this pink skull should have the combat strength of a level three universe overlord. Princess Ling Honggu, the four of you were able to severely injure it. How impressive!”<br/><br/>Wang Xian looked over and sized it up.<br/><br/>“This is because it has just broken through and I have the ultimate treasure of my clan. That’s why I had the chance to severely injure it.”<br/><br/>Ling honggu smiled and introduced, “This skull is known as the pink skull in our city. According to my father, the owner of this pink skull was at least a powerful existence at level six or above of a universe overlord when she was alive.”<br/><br/>“Furthermore, the owner of this skull had a terrifying physical body. Currently, there is only one pink skull corpse in the entire land of the Devil’s Bones. However, her corpse has been scattered into many parts. Now, I have obtained the location of her chest and head.”<br/><br/>Wang Xian nodded his head slightly. “Can Princess Ling Honggu transfer the parts of this pink skull onto her own body?”<br/><br/>“I was in a special situation. When I was young, I almost died because of a disaster. In order to save me, my mother used a powerful treasure to fuse the chest of this pink skeleton into my body, allowing me to escape a calamity. This part of my chest has completely fused with me. According to my father’s guess, if I can find the other parts, perhaps my strength will be greatly enhanced.”<br/><br/>Ling Honggu smiled. “However, the various parts of this pink skeleton have already given birth to sentience. In these hundreds of millions of years, this is the only one that I have obtained. It is also one of the more important parts. The skull. Who knows, I might really have a chance to become the Skeleton King.”<br/><br/>“Is that so? Then I wish Princess Ling Honggu the best that she can step into the realm of the ruler of the universe.”<br/><br/>Wang Xian smiled and said with a twinkle in his eyes.<br/><br/>“Hehe, this is just my wishful thinking. It’s too difficult to break through. Furthermore, I still have another realm that I have yet to reach.”<br/><br/>Ling Honggu shook his head.<br/><br/>At this moment, the powerhouses of the spiritual demon race brought some food over.<br/><br/>“Young master, try some of our spiritual demon race’s food!”<br/><br/>Ling Honggu smiled and gestured.<br/><br/>“Thank you!”<br/><br/>Wang Xian nodded his head!\t\t\t\t\t\t</div>", "images": {}, "success": true}