{"id": 492, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072885.html", "title": "Chapter 3483 - 3483 2482 Son Of The Holy Dragon King, Under The Innate Supreme Treasure", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3483 - 3483 2482 Son Of The Holy Dragon King, Under The Innate Supreme Treasure</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3483 2482 son of the Holy Dragon King, under the innate supreme treasure<br/><br/>“This is an illusion-inducing fruit, a fruit of the first level of the universe dominator. After consuming it, there will be some illusions attached to it. Of course, such illusions are beneficial. Consuming it is a great enjoyment!”<br/><br/>Ling Honggu handed a fruit to Wang Xian with a smile and introduced it.<br/><br/>“Oh, this kind of delicacy is very rare.”<br/><br/>Wang Xian revealed a surprised expression and said with a smile.<br/><br/>“Although the land of the Devil’s Bones is very desolate, there are many treasures here.”<br/><br/>Ling Honggu said with a smile.<br/><br/>“Indeed. We can indeed obtain many treasures here at the land of the Devil’s Bones.”<br/><br/>Wang Xian smiled and chatted with the Princess of the spiritual demon race for a while.<br/><br/>He had a basic understanding of the pink skeleton.<br/><br/>The body parts of the pink skeleton were not of much use to the other experts of the darkness attribute. They could only be turned into powerful weapons.<br/><br/>However, to the spirit red skeleton, it was indeed a rare treasure.<br/><br/>Of course, the body parts of the pink skeleton were much more valuable than the demon skeleton of the same level.<br/><br/>“Red Skeleton, you obtained the skull of the pink skeleton?”<br/><br/>Just as the two of them were conversing, an old man suddenly appeared.<br/><br/>The old man was dressed in a black robe and had a single horn on his head. His body exuded the aura of a superior.<br/><br/>He suddenly appeared beside Wang Xian and Ling Hong Gu and spoke happily.<br/><br/>“Yes, father. This is all thanks to young master Wang Xian. If it wasn’t for his coincidental appearance, we might not have been able to suppress him.”<br/><br/>Ling Honggu looked at the old man and stood up.<br/><br/>“Oh? Spirit Demon King!”<br/><br/>Wang Xian was slightly stunned when he saw the old man. He immediately cupped his hands and greeted him.<br/><br/>He could feel a palpitating energy from the old man.<br/><br/>This was the leader of the spirit demon race, the king of the spirit demon race.<br/><br/>“Haha, this must be the Dragon Palace’s little brother, the Divine Dragon. Thank you for your help!”<br/><br/>The spirit demon king laughed and said to Wang Xian.<br/><br/>“It’s just a coincidence!”<br/><br/>Wang Xian smiled.<br/><br/>“Reporting to your majesty, there are experts from the Holy Dragon lineage and the Hundred Cities Alliance flying towards US quickly. We have warned them that they have something important to do. They are very strong!”<br/><br/>Three figures suddenly flew over from the front. They reported to the spirit demon king in the form of skeletons.<br/><br/>“Huh?”<br/><br/>The spirit demon king was slightly surprised.<br/><br/>When Wang Xian heard this news, he frowned slightly.<br/><br/>They were chasing after him again?<br/><br/>“They should be here to kill me. They didn’t succeed last time. This time, they might send out a level three master of the universe.”<br/><br/>Wang Xian frowned and said. He looked at the spirit red bone and the spirit demon king and said, “I won’t bother you anymore.”<br/><br/>“My Son, the Holy Dragon, is here to kill the enemies of my holy dragon lineage. I have no intention to offend the spirit demon race. Please give us some face.”<br/><br/>At this moment, a voice came from afar.<br/><br/>Following that, four divine dragons of light and red eyes, which were emitting a strong power of light, flew towards them.<br/><br/>The son of the Holy Dragon and the rest did not transform into the appearance of divine dragons. This was also because they did not want to anger the spirit demon race.<br/><br/>Around them, there were experts of the spirit demon race following them.<br/><br/>However, it was clear that the peak experts of the spirit demon race had yet to rush over.<br/><br/>“HMPH!”<br/><br/>The spirit demon king saw the son of the Holy Dragon and the others and snorted lightly. His figure instantly appeared in the void above.<br/><br/>A skeleton throne instantly appeared behind him. He sat there coldly and his entire body transformed into a five meter tall skeleton.<br/><br/>A hand grabbed onto his shoulder.<br/><br/>On the skeleton throne was a terrifying skull of a creature that contained a tremendous power.<br/><br/>He stared ahead, the skeleton fire in his eyes jumping continuously!<br/><br/>“Eh? Spirit Demon King?”<br/><br/>The Holy Dragon Son and the others who were flying over felt the power of spirit demon king on the skeleton throne, and their eyes focused.<br/><br/>They were floating in the air.<br/><br/>“Sir Holy Dragon Son, the Demon Dragon from the Dragon Palace is over there, right over there!”<br/><br/>The eye in red eye’s hand sensed something. He looked over with his huge eye and immediately reported to the Holy Dragon Son.<br/><br/>The Holy Dragon Son’s gaze swept across and locked onto Wang Xian.<br/><br/>At this moment, Wang Xian’s gaze also landed on the Holy Dragon Son. As he felt the energy on his body, his face was filled with a solemn expression.<br/><br/>A third-level master of the universe with combat strength. As expected!<br/><br/>In order to kill him, the Holy Dragon lineage had sent out an even stronger existence.<br/><br/>“This should be Lord Spirit Demon King. Someone from the Dragon Palace has killed an expert from our holy dragon lineage. We are here to kill him. Please do us a favor, Spirit Demon King!”<br/><br/>The son of Saint Dragon’s gaze landed on the spirit demon king. He cupped his hands and said.<br/><br/>“Directly intruding into our Spirit Devil Race, are you not placing our spirit Devil Race in Your Eyes?”<br/><br/>The Spirit Devil King’s gaze stared at the Holy Dragon Son as he coldly questioned.<br/><br/>“Our Holy Dragon race was also forced. The other party killed our experts, so please give us holy dragon race some face. The Spirit Devil King can expel him. Next, we’ll act ourselves. Our Holy Dragon race will also compensate the Spirit Devil Race!”<br/><br/>The Holy Dragon Son replied with a smile.<br/><br/>“Father!”<br/><br/>Hearing the Holy Dragon Son’s words, Ling honggu frowned slightly and shouted.<br/><br/>“Ha, Holy Dragon Bloodline, you have three seconds to leave the range of our spiritual demon race. Otherwise, you will stay here forever!”<br/><br/>The spiritual demon king stared at the Holy Dragon Son and sneered, warning him!<br/><br/>“Spiritual Devil King, are you trying to protect the enemies of our Holy Dragon Bloodline? Our Holy Dragon bloodline has no intention to be your enemy!”<br/><br/>The Holy Dragon Son’s expression changed slightly when he heard his words, and he said with a dark face.<br/><br/>The Spiritual Devil King sat there quietly and didn’t respond.<br/><br/>The holy dragon son frowned slightly and looked at the Spiritual Devil King.<br/><br/>“Three seconds are up, this king will die!”<br/><br/>However, three seconds later, the spiritual demon king instantly moved, and a monstrous killing intent surged forward.<br/><br/>“Buzz!”<br/><br/>The Claw on his shoulder instantly disappeared, and in the next moment, it appeared beside the son of the sacred dragon.<br/><br/>More than ten claws directly tore at the son of the Sacred Dragon.<br/><br/>“What!”<br/><br/>The son of the sacred dragon’s expression changed drastically when he saw the spiritual demon king attack.<br/><br/>He didn’t expect the other party to attack just like that. Moreover, he felt a death threat from the dark claws around him.<br/><br/>“Innate supreme treasure, you really want to be our sacred dragon’s enemy!”<br/><br/>The Sacred Dragon Son’s face changed drastically, and he quickly spat out two dragon eyes. The Dragon Eyes formed a circle of light and resisted the terrifying hell claws!<br/><br/>“Ha, what an ignorant thing. Do you think that my spirit demon race is afraid of Your Holy Dragon Race? And you dare to barge into my spirit demon race? You are courting death!”<br/><br/>The Spirit Demon King showed a look of disdain. “Even if an angel came, I would still dare to make a move, let alone a bunch of lackeys like you!”<br/><br/>“Huh?”<br/><br/>On the huge skeletal claw, Wang Xian was astonished when he saw the spirit demon king actually attacking the Holy Dragon race.<br/><br/>He didn’t expect the spirit demon king to be so ferocious. He used an innate supreme treasure to kill the Holy Dragon.<br/><br/>He didn’t expect the Holy Dragon Son to have an innate supreme treasure as well.<br/><br/>He was a level three master of the universe and had an innate supreme treasure with him. He must kill Wang Xian!\t\t\t\t\t\t</div>", "images": {}, "success": true}