{"id": 496, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072893.html", "title": "Chapter 3487 - 3487 2486 Attacked Again And Destroyed Four Cities", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3487 - 3487 2486 Attacked Again And Destroyed Four Cities</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3487 2486 attacked again and destroyed four cities<br/><br/>99 cities. This was a city with a very gentle name.<br/><br/>At first, the Great Beings who created this city were a couple. In order to celebrate the 99 million years they had spent together, they built this city.<br/><br/>The creator of this city had already died, and his descendants had inherited it.<br/><br/>Now, there was only one universe ruler Level 1 great being in 99 cities.<br/><br/>Compared to when it was first established, 99 cities had undergone a huge change.<br/><br/>Due to the special topography of 99 cities, a large number of bounty hunter teams lived there.<br/><br/>Bounty hunters mainly relied on the trust of the Hundred City Alliance to obtain information and increase their strength.<br/><br/>Because of the existence of the Hundred City Alliance, many bounty hunter teams were born.<br/><br/>Powerful teams had many Pinnacle Universe Knights.<br/><br/>Many bounty hunter teams would choose to build their own cities and join the 100 Cities Alliance when the Great Beings in their teams broke through to the first level of universe ruler.<br/><br/>There were many of them, even more than 10 of them.<br/><br/>80% of the 99 cities were the families and disciples of the bounty hunters.<br/><br/>Now that the Hundred Cities Alliance was wantonly hunting the disciples of the Dragon Palace, these bounty hunters were an indispensable fighting force.<br/><br/>Currently, those who were still in the Hundred Cities Alliance were the enemies of the Dragon Palace.<br/><br/>This was because the citizens who didn’t want a war had already left the Hundred Cities Alliance.<br/><br/>No one wanted to become a victim of the war.<br/><br/>Those who didn’t leave were the instigators of the war.<br/><br/>Wang Xian didn’t show any mercy to the people in Jiujiu City.<br/><br/>Since they dared to destroy Haotian City and assassinate him again and again, Wang Xian and the Alliance of 100 cities wouldn’t rest until one of them was dead!<br/><br/>When Wang Xian gave the order to attack.<br/><br/>Ao Yao and the other two masters of the universe had the strength of a level one dragon-type.<br/><br/>Over 100,000 powerful Dragonkin disciples.<br/><br/>Along with King immortal water touch and Ba Qi, the leader of the sky array and Water Dragon King who were brought over by an lie, they immediately arrived at one of the 99 cities!<br/><br/>A Level 2 universe overlords with the same level as Ming Gui’s avatar.<br/><br/>Seven Level 1 universe overlords with the same level of strength.<br/><br/>They immediately rose into the air and flew above the 99 cities.<br/><br/>“If the Hundred Cities Alliance wants to destroy my Dragon Palace, then all the disciples of the Hundred Cities Alliance are enemies of my Dragon Palace. Today, I, the Dragon King, sentence the nine-nine cities to destruction!”<br/><br/>Wang Xian flew to the sky, and an overwhelming pressure surged downwards.<br/><br/>His face was ice-cold as he judged, and his killing intent filled the entire city.<br/><br/>The moment he made his move, the Heaven Array, the eight-headed ao monster, and the rest all moved.<br/><br/>Destruction descended upon the nine-nine city.<br/><br/>Boom! Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>An incomparably vast and terrifying energy began to condense in the sky above the nine-nine city. It bloomed with the flower of death.<br/><br/>“Die. If you want to blame someone, blame yourself for being members of the Hundred Cities Alliance!”<br/><br/>Wang Xian roared wildly. Destructive energy covered the area below.<br/><br/>The sudden terrifying power and the sudden attack caused everyone in the city to tremble violently.<br/><br/>They looked up with fear and despair on their faces.<br/><br/>“No, no, no, no!”<br/><br/>“No, no, no!”<br/><br/>“It’s the powerhouses from the Dragon Palace. How did this happen? How did they suddenly attack us?”<br/><br/>The sound of despair and aura instantly filled the entire city.<br/><br/>Buzz, Buzz, Buzz<br/><br/>In the next moment, the destructive energy had already descended.<br/><br/>No one could avoid it. Everything was in the midst of death.<br/><br/>Wang Xian looked at this scene coldly. A city had completely turned into a dead city within three seconds.<br/><br/>An Lie’s figure started to stir. The poisonous horned dragon and the thorned dragon also started to take action. They collected all the corpses.<br/><br/>Five minutes later, Wang Xian and the rest left immediately.<br/><br/>When they reappeared, they had already arrived at the nine-star Lianzhu City.<br/><br/>The nine-star Lianzhu City was located in the sky. There were nine connected stars.<br/><br/>This star was not big, but it contained terrifying energy.<br/><br/>The nine stars formed a huge formation.<br/><br/>Wang Xian and the rest appeared in one of the stars.<br/><br/>“Dragon King!”<br/><br/>Beside him, Mo Sha, who was parasitizing the city lord, immediately bowed.<br/><br/>“Are You Ready?”<br/><br/>Wang Xian asked.<br/><br/>“Dragon King, I’m ready. There’s also a master of the universe with level one combat strength who is cultivating in the grotto-heaven blessed land.”<br/><br/>Mo Sha said.<br/><br/>“Alright, I will use my clone to hunt him down. Do It now and don’t waste any time!”<br/><br/>Wang Xian nodded and said.<br/><br/>“It’s Dragon King. I can shut down the formation instantly!”<br/><br/>Mo Sha said immediately.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian moved and immediately floated above this star.<br/><br/>King watertouch, AO Yaoba Qi, and the rest immediately flew towards the surrounding stars and were ready to make their move.<br/><br/>Boom! Boom! Boom<br/><br/>A minute later, waves of vast energy covered the stars one by one. Under the destructive energy, the nine-star Lianzhu city was quickly destroyed.<br/><br/>The Master of the universe in the grotto-heaven blessed land, an expert with level one combat strength, was also easily killed by the Netherspirit Avatar!<br/><br/>Five minutes later, they left once again.<br/><br/>The speed of Wang Xian and the rest’s attack was abnormally fast, and it was also abnormally terrifying.<br/><br/>In fact, within ten minutes, no one knew that two cities had been destroyed.<br/><br/>The third city, Wu City, was also a city with two level one masters of the universe.<br/><br/>However, when Wang Xian and the rest arrived, that master had already been killed by the poisonous horned dragon seed.<br/><br/>That was because the masters of Wu City were a pair of father and son.<br/><br/>It was easy for a father to kill his son.<br/><br/>Two minutes later, martial city was destroyed!<br/><br/>This time around, a group of bounty hunters had just arrived at the edge of the city.<br/><br/>“What… What Happened?”<br/><br/>“Hiss, what kind of energy is this? What kind of destructive energy is this?”<br/><br/>“This is bad. This destructive energy has covered the entire martial city. Martial City can’t withstand it at all. Our martial city has been destroyed. Destroyed!”<br/><br/>Outside, their group of bounty hunters had just killed a divine dragon and were ready to earn treasures. However, they had witnessed the destruction of the martial city with their own eyes!<br/><br/>The bodies of more than ten bounty hunters trembled violently, and their faces were filled with astonishment.<br/><br/>“You want to destroy my Dragon Palace? Humph! The martial city has been destroyed!”<br/><br/>At this moment, they heard a cold voice. Their pupils constricted slightly, and they were filled with astonishment.<br/><br/>Seeing the destructive energy disappear and the Martial City completely fall silent, they gulped and flew over shakily.<br/><br/>When they saw their martial city completely become a dead city, their bodies were already drenched in sweat.<br/><br/>Terrifying!<br/><br/>Terrifying!<br/><br/>If they were in the city, they would definitely die!<br/><br/>“The Dragon Palace is taking revenge. The Dragon Palace is taking revenge again. They actually destroyed our entire martial city so easily. How is this possible? What kind of enemy have we provoked? !”<br/><br/>The terrified voices came from their mouths!\t\t\t\t\t\t</div>", "images": {}, "success": true}