{"id": 495, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072891.html", "title": "Chapter 3486 - 3486 2485 Attacked Again And Destroyed The Four Cities", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3486 - 3486 2485 Attacked Again And Destroyed The Four Cities</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3486 2485 attacked again and destroyed the four cities<br/><br/>“This blood refinement fruit is so perverse. If it were to fall outside, wouldn’t it cause people to go crazy?”<br/><br/>Wang Xian mumbled.<br/><br/>A fruit to refine the bloodline. To the descendants of the peak races and those who possessed the bloodline of the peak races, this was simply a great treasure.<br/><br/>The Yalong, who possessed the bloodline of the Phoenix, the Divine Tiger, the Black Tortoise, and the ELF, as long as they devoured it, they would be able to possess the bloodline of their ancestors.<br/><br/>This was extremely heaven-defying.<br/><br/>“As expected of a heaven-opening creation item of the supporting type. This ability is simply terrifying!”<br/><br/>At the side, when king aqua tentacles heard Wang Xian’s words, his face was filled with shock.<br/><br/>“If this fruit was placed in the mountains and seas, it would probably drive countless level three universe dominators and desolate beasts crazy.”<br/><br/>He said faintly.<br/><br/>To some desolate beasts, this blood refinement fruit was undoubtedly the key to stepping into the realm of masters of the universe.<br/><br/>To be able to condense one in more than a year and absorb the energy of this land, it shouldn’t be too much of a problem to condense hundreds of thousands or millions.<br/><br/>Wang Xian pondered in his heart as he slowly stood up. The roots that had penetrated into the ground entered his body.<br/><br/>In the next moment, his figure disappeared.<br/><br/>When he reappeared, he was already in the Dragon Palace.<br/><br/>He arrived at the teleportation formation of the Dragon Palace and appeared in the grotto-heaven blessed land below the water in the sky.<br/><br/>“Dragon King!”<br/><br/>“Dragon King!”<br/><br/>When Wang Xian arrived, Prime Minister Gui and Ao Yao immediately came over and greeted him respectfully.<br/><br/>“Did anything happen in the past few years?”<br/><br/>Wang Xian looked at Prime Minister Gui and asked him.<br/><br/>“There’s one thing. Ao Qitian was hunted down by the bounty hunters of the Hundred Cities Alliance a year ago. An lie has brought his soul over and it has already recovered. A few thousand members of the berserk dragon species invaded a city of the Hundred Cities Alliance and more than half of them were killed or injured.”<br/><br/>“However, the city of the Hundred Cities Alliance wasn’t doing well either. Millions of people were killed or injured.”<br/><br/>Prime Minister Gui said with a smile, “In addition, the other dragon-seed disciples suffered varying degrees of casualties, but they were all resurrected.”<br/><br/>“Yes!”<br/><br/>Wang Xian nodded. He didn’t mind the injuries.<br/><br/>Although AO Qitian was killed, two of his peers died in order to kill him.<br/><br/>The Dragon Palace had the soul-returning wood branch and the ancestral tree. They could afford to play with it.<br/><br/>He took out the universe AI and looked at the situation of the Hundred Cities Alliance.<br/><br/>Compared to before, the current hundred cities alliance was unusually strict.<br/><br/>Every city was on alert at all times.<br/><br/>The war between the Dragon Palace and the Hundred Cities Alliance had caused quite a big impact on the Hundred Cities Alliance.<br/><br/>Many residents of the Hundred Cities Alliance settled here because the cities were neutral and wouldn’t erupt in war.<br/><br/>Now, no one knew if the Dragon Palace would suddenly send experts to attack.<br/><br/>Therefore, many people had already left the Hundred Cities Alliance and moved to other neutral cities.<br/><br/>Those who stayed in the Hundred Cities Alliance were basically the true loyal subjects of the Hundred Cities Alliance.<br/><br/>Because the Hundred Cities Alliance was now loyal subjects, the Hundred Cities Alliance was unusually united.<br/><br/>Each of them was shouting the slogan of destroying the Dragon Palace.<br/><br/>In each of the cities, there were even teams of bounty hunters that were organized to destroy the members of the Dragon Palace.<br/><br/>They were active in the surroundings. Once they received news of the members of the Dragon Palace, they would immediately kill their way over.<br/><br/>In the past few years, there were indeed many members of the Dragon Palace who died at their hands.<br/><br/>However, at the same time, there were also many disciples of the Hundred Cities Alliance who died at the hands of the Dragon Palace.<br/><br/>Wang Xian looked at the messages one by one and a cold expression appeared on his face.<br/><br/>He immediately sent messages to the eight-limbed demon, an lie, and the rest.<br/><br/>Buzz<br/><br/>Very soon, an Lie’s figure arrived at the position in front of him.<br/><br/>“Let’s go, take me to the eight-limbed demon!”<br/><br/>Wang Xian instructed an lie directly.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie replied immediately. In the next moment, they appeared in the residence of a city lord.<br/><br/>99 cities. This was the name of this city. In the city Lord’s mansion, Wang Xian appeared beside the throne.<br/><br/>“Dragon King!”<br/><br/>An elder cupped his hands at Wang Xian.<br/><br/>The elder had the power of a Level 1 universe dominator. He had a smile on his face.<br/><br/>“Have you taken control of this city?”<br/><br/>Wang Xian asked Ba Qi with a smile on his face.<br/><br/>“Yes, Dragon King. I have full control of it. There is only one level one universe dominator in this city. I have kept all the treasures and can take action at any time!”<br/><br/>Ba Qi replied, he continued, “Mo sha and the other two subordinates may need to take action. Wu City, nine stars Lianzhu City, and Star City. There is more than one level one universe dominator in these three cities.”<br/><br/>“Then let’s make a move on this city first. An lie, Go and prepare the passage to the other three cities. We will try to destroy all four cities within one to two hours.”<br/><br/>Wang Xian instructed an lie.<br/><br/>“Yes, Dragon King. I will go and prepare immediately!”<br/><br/>An lie nodded and left through the teleportation formation.<br/><br/>“Ba Qi, tell me some information about the Hundred Cities Alliance!”<br/><br/>Wang Xian sat down and said to Ba Qi.<br/><br/>“Dragon King, the Hundred Cities Alliance has indeed interfered in the war between the ancestral dragons of the Holy Dragon lineage. They have also secretly sent people to hunt down the disciples of the ancestral dragons.”<br/><br/>“In addition, the defenses of the cities are very strong. For example, the city I’m in now has more than a dozen teleportation formations that lead to the headquarters of the Hundred Cities Alliance. If any of the cities are in danger, reinforcements can arrive within two minutes. If the news is transmitted quickly, they can arrive within a few seconds!”<br/><br/>“If we want to make a move, we have to destroy the teleportation formation first!”<br/><br/>Ba Qi said.<br/><br/>“HMM? If we destroy the teleportation formation, will they be able to guess the location of the Masters of the Universe?”<br/><br/>Wang Xian’s eyes flickered.<br/><br/>“That’s for sure. According to the rules of the Hundred Cities Alliance, only the Masters of the cities and Masters of the universe would know about half of the secret locations of the teleportation formation. I’m afraid that after we make a move, the other party will suspect that the masters of the cities are being controlled.”<br/><br/>Ba Qi nodded. “However, since our poisonous horned dragon species can live on their bodies, there shouldn’t be any problems.”<br/><br/>“It’s hard to say. The Holy Dragon lineage will help the Hundred Cities Alliance. Perhaps the angel race will also help.”<br/><br/>Wang Xian shook his head. His eyes were sparkling.<br/><br/>“Oh? Dragon King, there’s news from the universe’s AI. The experts of the Holy Dragon lineage failed to besiege a black dragon in the land of the demonic bone. Is It you, Dragon King?”<br/><br/>Ba Qi asked in astonishment.<br/><br/>Wang Xian nodded. “No matter what, let’s destroy these four cities first. We’ll consider it later.”<br/><br/>“Yes!”<br/><br/>Ba Qi nodded.<br/><br/>After a while, an Lie’s figure came over and nodded at Wang Xian.<br/><br/>The demonic altar had been set up. They could reach another city from here in an instant.<br/><br/>“Let’s do it!”<br/><br/>Wang Xian stood up and commanded with a face full of killing intent.\t\t\t\t\t\t</div>", "images": {}, "success": true}