{"id": 494, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072889.html", "title": "Chapter 3485 - 3485 2484. The Change Of The Roots Of The Ancestral Tree Had Taken Root In The Land Of Blood", "volume": 5, "volume_title": "Volume 5", "body": "<h1>Chapter 3485 - 3485 2484. The Change Of The Roots Of The Ancestral Tree Had Taken Root In The Land Of Blood</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3485 2484. The change of the roots of the ancestral tree had taken root in the land of blood<br/><br/>Wang Xian was still grateful for the actions of the Spirit Demon King and the Spirit Red Bones.<br/><br/>Although Wang Xian had helped them first, the reward was heavy enough.<br/><br/>He was willing to make enemies with the Holy Dragon and was willing to protect his dragon palace.<br/><br/>The reward was heavy.<br/><br/>Moreover, the price of the pink skeleton palm that the other party traded with him was relatively high.<br/><br/>Wang Xian was prepared to make a trip to the land of blood plasma to see if he could help him obtain the parts of the pink skeleton.<br/><br/>After chatting with Ling Honggu for a while, Wang Xian left immediately.<br/><br/>This time, Ling Honggu gave him a more detailed set of information and information.<br/><br/>More detailed information about the land of blood plasma.<br/><br/>This included some of the dangers of the land of blood plasma. It was more detailed than the information he obtained from the spiritual demon race.<br/><br/>Wang Xian flew out from the spiritual demon race and arrived at the land of blood ten days later.<br/><br/>This was a blood-red ground. There were no bones here, only endless blood.<br/><br/>However, the blood had lost its energy. There were demon skeletons here. They were looking for some blood essence that contained energy.<br/><br/>These blood essence were usually extremely precious treasures. Some of them could even directly raise a living creature’s realm.<br/><br/>The ground of the land of blood plasma was soft and one could burrow into it directly.<br/><br/>Wang Xian came to the sky above the land of blood plasma and looked down.<br/><br/>The entire sky above the land of blood plasma was filled with a blood-red fog.<br/><br/>Even after tens of billions of years, there was still a hint of the smell of blood in the air.<br/><br/>Wang Xian looked down and flew over directly.<br/><br/>Bang<br/><br/>The Land of blood plasma was unusually soft. Wang Xian entered it easily and dived down at a terrifying speed.<br/><br/>According to Ling Honggu, there were basically no demonic skeletons or skeletons in the shallow part of the land of blood plasma.<br/><br/>This was because there was no longer any blood essence in the shallow part of the land. Only the deep part existed.<br/><br/>Therefore, if he wanted to gain something, he had to go deep into the land.<br/><br/>After Wang Xian entered the body, he kept going deeper into the body.<br/><br/>Twenty minutes later, Wang Xian’s body suddenly paused. A look of astonishment appeared on his face.<br/><br/>At this moment, his body was located in the deeper part of the blood plasma land.<br/><br/>Here, he could sense that the ancestral tree in his body had a strange movement.<br/><br/>This made him extremely astonished.<br/><br/>This was the first time that the ancestral tree had such a change.<br/><br/>With a thought, he sensed it.<br/><br/>Buzz<br/><br/>At the next moment, the roots of an ancestral tree emerged from Wang Xian’s chest and took root in the blood plasma.<br/><br/>Wang Xian could vaguely sense waves of energy entering the roots.<br/><br/>“What’s going on?”<br/><br/>A look of astonishment appeared on his face. What was the reason for the roots of the ancestral tree to take root in the blood plasma?<br/><br/>Was it absorbing energy?<br/><br/>With a thought, the king of water tentacles appeared in front of him.<br/><br/>“Dragon King!”<br/><br/>The king of water tentacles immediately shouted when she saw Wang Xian.<br/><br/>“Do you know about the situation before your eyes?”<br/><br/>Wang Xian looked at the king of water tentacles and asked her.<br/><br/>“HMM?”<br/><br/>The king of water tentacles looked over and looked around carefully.<br/><br/>“Dragon King, is this a dried blood pool that has lost its energy? What is this place?”<br/><br/>She looked at the ancestral tree and looked around curiously before asking.<br/><br/>“The blood pool in the land of demonic bones is not far away from the skeleton clan!”<br/><br/>Wang Xian replied.<br/><br/>“Blood Pool?”? The blood pool had dried up and the energy had disappeared. Part of it dissipated in the world while the other part merged with everything around it. The ancestral tree must have sensed that the nutrients here were more abundant and wanted to absorb the energy here.”<br/><br/>The King of water touch guessed, “Dragon King, when we infiltrated the deepest part of the land of blood, part of the energy of the blood merged with the land. This caused a slight change in the land. The ordinary divine tree and divine grass can’t absorb the energy in this land. However, as an ancestral tree of the Heaven’s origin level, it can.”<br/><br/>“Alright!”<br/><br/>Wang Xian nodded his head. His body moved and he continued to drill downwards.<br/><br/>Half an hour later, he arrived at the deepest part of the Land of blood plasma.<br/><br/>As expected, when the branch of the ancestral tree was dug into the ground, Wang Xian could feel a red energy surging into the ancestral tree.<br/><br/>“As expected!”<br/><br/>Wang Xian mumbled, “I just don’t know what changes will happen to the ancestral tree next, or what changes will happen to this branch.”<br/><br/>The mutation of the ancestral tree had dispelled all his plans. Wang Xian sat there with his legs crossed and waited quietly.<br/><br/>As time passed by, the branch of the ancestral tree slowly turned blood red.<br/><br/>A month later, Wang Xian noticed that a small fruit had appeared on this branch.<br/><br/>The fruit was very small. It was blood red and emitted a pure luster.<br/><br/>Wang Xian was slightly taken aback as he sized it up carefully.<br/><br/>The King of Water Touch was also looking at it curiously.<br/><br/>In the blink of an eye, a year had passed. The small fruit had grown to the size of a fist.<br/><br/>Wang Xian could sense that the fruit was about to ripen!<br/><br/>This made his face full of anticipation.<br/><br/>What effect would a ripe blood-red fruit have?<br/><br/>Buzz Buzz<br/><br/>On this day, Wang Xian suddenly received news from the eight limbed demonic fiend and the rest.<br/><br/>When he saw this news, he narrowed his eyes slightly. His eyes were shining.<br/><br/>The eight-limbed demonic fiend had already sent news that they had already taken control of the bodies of four level one universe Dominators of the hundred-city alliance.<br/><br/>In other words, they could make a move now and destroy the four cities of the hundred-city alliance.<br/><br/>After destroying the four cities of the Great Marquis City of the hundred-city alliance, Tian Heng City, there were seven level one universe Dominators of the Dragon Palace.<br/><br/>After that, Wang Xian had also destroyed two level one universe Dominators in Old Star City. The number of level one universe Dominators in the Dragon Palace did not include the devouring dragon. There were already nine of them.<br/><br/>These nine people were the leader of the sky array, water dragon, ao Yao, Ba Qi, Mo Sha, and the poisonous horned dragon species, as well as the thorned dragon species.<br/><br/>The resources obtained from the four cities were mainly used to upgrade the poisonous horned dragon species and thorned dragon species.<br/><br/>After a few years, the eight-limbed demonic fiend and the rest finally managed to completely parasitize the level one masters of the universe in the four cities.<br/><br/>After the parasitization was successful, it would be easy for them to destroy the cities.<br/><br/>Wang Xian replied to them and waited for their orders. Then, he continued to look at the blood-red fruit.<br/><br/>He waited for it to ripen.<br/><br/>A month passed by again. Suddenly, he sensed that the fruit had ripen.<br/><br/>Wang Xian placed his hand on it and the ancestral tree transmitted a message to him.<br/><br/>Blood refining fruit: it can extract bloodlines and guide the strongest bloodlines in the body.<br/><br/>“HMM?”<br/><br/>When this message was transmitted to Wang Xian’s mind, he was slightly stunned. His eyes slowly lit up with a fiery expression.<br/><br/>Blood refining fruit was a very common name. However, this effect shocked Wang Xian.<br/><br/>Extracting the bloodline and guiding the strongest bloodline in the body.<br/><br/>What did this mean?<br/><br/>This meant that as long as the Asian dragon devoured it, he would have a chance to evolve into a pure-blooded divine dragon, a true divine dragon.\t\t\t\t\t\t</div>", "images": {}, "success": true}