{"id": 501, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072903.html", "title": "Chapter 3492 - 3492 2491 Spiny Dragon Made Its Move To Warn The World", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3492 - 3492 2491 Spiny Dragon Made Its Move To Warn The World</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3492 2491 spiny dragon made its move to warn the world<br/><br/>Buzz<br/><br/>A few months later, Wang Xian came to the land of blood plasma. He sat cross-legged in the deepest part of the land with a smile on his face.<br/><br/>The branches of the ancestral tree pierced deep into the ground. He sat there quietly with his legs crossed.<br/><br/>Time passed day by day. The blood refinement fruit began to condense bit by bit.<br/><br/>However, the war between the Dragon Palace and the Alliance of Hundred Cities had finally erupted.<br/><br/>In the past, Wang Xian only used the poisonous horned dragon species to obtain information one by one and then destroyed one city after another.<br/><br/>But now, it was a contest of strength and an assassination in the dark.<br/><br/>This was already a head-on confrontation.<br/><br/>Located around one city after another, 200,000 thorned dragon species were distributed in the surrounding areas.<br/><br/>Currently, there were 95 cities in the Alliance of 100 cities.<br/><br/>There were over 2,000 thorned dragon species in each of the 95 cities.<br/><br/>They were already scattered.<br/><br/>They hid around the cities of the alliance and monitored the entire city.<br/><br/>The weakest among them had the combat strength of a universe knight at level 3.<br/><br/>Out of the nine cities that were destroyed, 50% of the resources were concentrated in the thorned dragon species.<br/><br/>When the disciples and experts of the Hundred Cities Alliance flew out of the cities, Ao Yao and the others would carry out assassinations.<br/><br/>The surroundings of the cities were extremely vast.<br/><br/>It was impossible for the disciples of the Hundred Cities Alliance to stay in the cities and not come out. They also needed to improve and survive.<br/><br/>Was it possible for all the disciples of the Hundred Cities Alliance to stay in the divine kingdom and not come out?<br/><br/>What was the difference between that and being suppressed in the grotto-heaven blessed land.<br/><br/>When they flew out, they would be assassinated.<br/><br/>“Pu Pu Pu!”<br/><br/>Over ten people flew out from the sky above a city and flew in one direction.<br/><br/>All of a sudden, thorny dragon species appeared around them, cutting their necks and killing them.<br/><br/>The assassination continued.<br/><br/>Even though there were very few disciples in the cities of the Hundred Cities Alliance, the number of people entering and leaving over 90 cities could reach up to 10 million.<br/><br/>After all, the number of disciples in the Hundred Cities Alliance was too huge!<br/><br/>But now, all of a sudden, at the entrance of the Hundred Cities Alliance, a large number of disciples and warriors were killed.<br/><br/>Especially after that, some disciples escaped death from the dragon species and spoke on the universe’s AI after surviving the disaster.<br/><br/>“When I left the city, I was attacked by an assassination. All of our comrades were killed!”<br/><br/>At the beginning, this piece of news didn’t attract much attention.<br/><br/>But slowly, as time passed, half a year later, more and more people started to publish this information on the cosmic AI.<br/><br/>The number of people who published this information reached a few thousand.<br/><br/>A few thousand was not a lot of data, but these few thousand people realized that something was wrong. They gathered together on the universe’s AI and collectively published this information.<br/><br/>“Four months ago, I came out with more than a dozen people and was suddenly assassinated. I was the only one who survived!”<br/><br/>“It was also more than ten days ago. Captain and I were about to hunt some desolate beasts when we were attacked. A terrifying figure appeared out of thin air. I was the only one who escaped!”<br/><br/>“My family and I were also assassinated. All my family members were killed. I was the only one who survived.”<br/><br/>“It’s too terrifying. According to what I know, in the past half a year, very few people who left the city returned alive.”<br/><br/>“I keep feeling that the outside of the city is suddenly very terrifying. All my friends who left the city have lost their means of contact.”<br/><br/>One by one, information spread within the Hundred Cities Alliance. As the number of people increased, it quickly attracted the attention of some people.<br/><br/>“In that case, our bounty team left the city two months ago, but there’s no news at all!”<br/><br/>“The same goes for me. I can’t contact my relatives who left the city.”<br/><br/>“Someone is assassinating people around our city!”<br/><br/>The Hundred Cities Alliance had a lot of people entering and leaving the city every day. In half a year, the number of missing people had reached a terrifying number.<br/><br/>The encounter of thousands of people attracted even more people.<br/><br/>Because of their relatives and friends, many of them lost contact after leaving the city.<br/><br/>The number of this group of people was still very large.<br/><br/>In just over ten hours, the number of relatives and friends that went missing from the universe AI had reached tens of millions.<br/><br/>When everyone saw this number, the commotion started.<br/><br/>“Someone is assassinating all the disciples of our Hundred Cities Alliance, someone is attacking us!”<br/><br/>“What’s going on, have the elders of our hundred cities alliance found out anything? What’s going on?”<br/><br/>“Is this real or fake, is the Dragon Palace deliberately creating a panic, or is it the truth?”<br/><br/>Questions appeared on the universe’s AI.<br/><br/>“I have pictures of assassins trying to assassinate us here. This is it, this is it!”<br/><br/>As time passed, someone suddenly exposed the picture of the dragonspine.<br/><br/>It was a terrifying existence of light and darkness, half light and half darkness, hidden in the void.<br/><br/>Looking at it quietly, it was abnormally terrifying.<br/><br/>“This is the Dragonspine of the Divine Dragon Clan. Back then, it was the Pinnacle Race of the Divine Dragon Clan, a terrifying assassin. Among the pinnacle races, it was also a terrifying assassin. Even when it was the pinnacle of the Divine Dragon Clan, their number was very small, less than 10,000.”<br/><br/>Immediately, someone recognized the dragon-stinger and started to explain it on the universe’s AI.<br/><br/>Dragon-stinger?<br/><br/>“This is definitely a powerful dragon from the Dragon Palace. According to the history of the Dragon Palace’s development, their Dragon Palace has a powerful assassin. It was definitely the dragon-stinger of the Dragon Palace!”<br/><br/>“Hiss, a dragon-stinger at the peak of the Divine Dragon Clan tried to assassinate a disciple of our hundred cities alliance, this… This…”<br/><br/>The disciples and warriors of the Hundred City Alliance felt a chill when they saw this information.<br/><br/>A peak dragon, this could be said to be a peak race creature.<br/><br/>And it was a top-tier assassination existence in the universe.<br/><br/>This kind of existence was born to resist or even assassinate other peak race creatures.<br/><br/>But now, they had locked onto their hundred city alliance.<br/><br/>And within a short half a year, a large number of disciples of their Hundred City Alliance who left the city were assassinated.<br/><br/>This was simply bad news for them. It was simply Hell mode.<br/><br/>Not long ago, the Hundred Cities Alliance had announced that the extermination of the city would absolutely not happen. They already had a way to defend against the sudden attack of the Dragon Palace.<br/><br/>Now, the extermination of the city had not happened, but the outside of the city had suffered a terrible attack.<br/><br/>Who knew how many disciples had been assassinated!<br/><br/>If this continued, wouldn’t the disciples of the Hundred Cities Alliance never be able to leave the city?<br/><br/>“They have already been discovered by the Hundred Cities Alliance?”? Prime Minister Gui, in the name of the Dragon Palace, announce that the Dragon Palace will hunt all the disciples of the Hundred Cities Alliance and warn the other cities. It’s best to cut off the teleportation formation with the Hundred Cities Alliance. Otherwise, don’t blame us if you accidentally injure them.”<br/><br/>In the underground of the land of blood and plasma, Wang Xian received a message from Prime Minister Gui and said with a smile.<br/><br/>Now was the time for the Dragon Palace to turn the tables.<br/><br/>Back then, the Hundred Cities Alliance announced that they were hunting the Dragon Palace and warned the other cities not to let the disciples of the Dragon Palace enter the cities. Otherwise, they would bear the consequences.<br/><br/>Now, they were hunting the Hundred Cities Alliance and warning the other cities!\t\t\t\t\t\t</div>", "images": {}, "success": true}