{"id": 507, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072915.html", "title": "Chapter 3498 - 3498 2497 Sky Plant Tribe", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3498 - 3498 2497 Sky Plant Tribe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3498 2497 sky plant tribe<br/><br/>Wang Xian’s strength shocked the Azure Dragon Beard Shadow and Azure Dragon Moon.<br/><br/>However, the search still needed to continue!<br/><br/>The group continued to move forward. Time passed day by day.<br/><br/>Apart from searching for the Dragon Palace, they could also hunt some desolate beasts at the level of a universe dominator. To Wang Xian, this was akin to obtaining resources and searching for treasures.<br/><br/>After killing a level two desolate beast at the level of a Master of the universe, the number of level two masters at the level of a Master of the universe in the Dragon Palace would increase by one.<br/><br/>“Dragon King, I can feel the power of light here!”<br/><br/>Two months later, one day, the king of water touch suddenly spoke to Wang Xian.<br/><br/>“Huh?”<br/><br/>Wang Xian was slightly stunned and squinted his eyes.<br/><br/>“Is it the aura of the Divine Dragon?”<br/><br/>He asked.<br/><br/>“It should be. I Can’t be too sure!”<br/><br/>The king of water touch replied.<br/><br/>Wang Xian nodded his head and looked around vigilantly.<br/><br/>He continued to move forward. After another two days, Wang Xian could also sense the aura of the divine dragon of light.<br/><br/>The divine dragon lineage could sense some of that dragon’s might.<br/><br/>“Dragon King!”<br/><br/>At this moment, the silhouettes of the Azure Dragon, Azure Dragon Moon, and the rest flew over with a solemn expression. “Did you sense it?”<br/><br/>Wang Xian nodded his head. “It’s an extremely dense aura of the divine dragon. It’s accompanied by light. It should be the divine dragon of light!”<br/><br/>“The enemy has already scouted the area in front of us. We can conceal ourselves and look for the figures of this group of divine dragons of light.”<br/><br/>The eyes of the Azure Dragon Whisker flickered as he spoke.<br/><br/>Now, the Divine Dragon of light was also searching for the Dragon Palace. Once they encountered it, there would be a fight after all!<br/><br/>Since the other party had already investigated this place, there was no need for them to investigate further.<br/><br/>Now, they could investigate the strength of the lineage of the Holy Dragon.<br/><br/>If the other party was too strong, they had to be careful of their attacks even if they found the Dragon Palace.<br/><br/>If the other party was weak, they could act according to the situation.<br/><br/>“Sure!”<br/><br/>Wang Xian nodded his head.<br/><br/>The group gathered together and sensed the remnants of the divine dragon’s might in the surroundings. Then, they continued flying forward.<br/><br/>“Do they know that you guys will also be looking for the Dragon Palace?”<br/><br/>All of a sudden, the king of water tentacles, who was lying on Wang Xian’s shoulder, asked the azure dragon whiskers and the rest.<br/><br/>The azure dragon whiskers and the rest were slightly stunned. Then, they shook their heads slowly.<br/><br/>“We don’t know if they know either.”<br/><br/>He replied.<br/><br/>“They should be able to eliminate the aura of the Divine Dragon. However, it has always been around. Either the other party did it on purpose or they were too unscrupulous.”<br/><br/>The king of water touch continued.<br/><br/>“Be careful!”<br/><br/>Wang Xian said to them.<br/><br/>The green dragon whiskers and the rest nodded. A hint of solemnity appeared on their faces.<br/><br/>Everyone scanned their surroundings vigilantly and continued to fly forward.<br/><br/>“Dragon King, someone is watching us. It’s that plant. He is a demonic beast.”<br/><br/>After they continued flying forward for an hour, the voice of the king of aquatic tentacles suddenly rang in Wang Xian’s mind.<br/><br/>Upon hearing this, his gaze focused on the plant.<br/><br/>It was an ordinary plant. It was no different from the plants at the bottom of the underground river.<br/><br/>When Wang Xian swept his gaze over, he didn’t even realize that it was a demonic beast.<br/><br/>If it wasn’t for the reminder from the water touch king, he wouldn’t have known.<br/><br/>In the next moment, Wang Xian’s figure flashed and disappeared in an instant. He appeared directly beside the demonic beast. With a move of his arm, he grabbed at the demonic beast.<br/><br/>“Huh?”<br/><br/>When Green Dragon Moon and the rest saw Wang Xian’s sudden action, they were slightly stunned. A look of astonishment appeared on their faces.<br/><br/>“Soul Catcher!”<br/><br/>When Wang Xian grabbed this demonic beast, his mind moved and he immediately cast soul catcher.<br/><br/>Buzz<br/><br/>A stream of information entered Wang Xian’s mind. When he saw this information, his eyes sparkled.<br/><br/>“Demonic Beast? The Tianzhi Tribe?”<br/><br/>The Azure Dragon and the rest looked at this demonic beast and were slightly stunned.<br/><br/>Wang Xian opened his eyes and nodded slightly.<br/><br/>The Tianzhi tribe was a subordinate tribe under the Angel tribe. The Tianzhi tribe was very strong and was not weaker than the Holy Dragon tribe.<br/><br/>According to the information that Wang Xian received, they were here to look for the Azure Dragon Palace.<br/><br/>“Why is the Tianzhi tribe involved in this?”<br/><br/>The expressions of the Azure Dragon, Xu Ying, and the rest were a little ugly.<br/><br/>This was not good news for them.<br/><br/>Did this mean that the Tianzhi tribe was also involved in the war between the Holy Dragon tribe and the ancestral dragon tribe?<br/><br/>Wang Xian did not obtain much information from the memory of this Tianzhi demonic beast.<br/><br/>This Sky Plant Demon Beast was only in charge of monitoring the surrounding information. If any disciples of the ancestral dragon lineage came, they would immediately report the information.<br/><br/>Their information had already been reported.<br/><br/>Furthermore, there were many sky plant demon beasts of the same level as him. They were scattered all over the underground river.<br/><br/>“Let’s continue moving forward. Be careful. It’s very likely that the other party will ambush us. Furthermore, the other party has sent out many people. It’s very likely that they have already found the Dragon Palace.”<br/><br/>Wang Xian frowned and said.<br/><br/>“Dragon King, I don’t think we need to go with them. Their speed is too slow. With your speed and my perception in the water, if we were to search, our speed would be dozens of times faster than now.”<br/><br/>The voice of the King of water touch entered Wang Xian’s mind.<br/><br/>This made Wang Xian ponder for a moment.<br/><br/>“Brother Azure Dragon Moon, I’m faster. I’ll move alone. If there’s any news, I’ll contact you immediately!”<br/><br/>Wang Xian looked at qinglongyue and said.<br/><br/>“Alright, be careful, Dragon King!”<br/><br/>Qinglongyue and Qinglongxu Ying exchanged a glance and nodded.<br/><br/>“Alright, I’ll make a move first!”<br/><br/>The uninitiated holy wings appeared behind Wang Xian. He nodded at Qinglongyue and the rest and disappeared in the next moment.<br/><br/>What a fast speed!<br/><br/>Qinglongxu Ying revealed a shocked expression.<br/><br/>“The Dragon King’s strength is not simple.”<br/><br/>The old man who was saved by Wang Xian said with a twinkle in his eyes.<br/><br/>“I really didn’t expect brother Wang Xian to have improved so much in such a short period of time.”<br/><br/>Green Dragon Moon muttered.<br/><br/>“Water contact, try your best to sense the surroundings. Find the people from the Dragon Palace or the holy dragon lineage as soon as possible.”<br/><br/>Wang Xian spoke from the front.<br/><br/>“It’s the Dragon King!”<br/><br/>Water tentacles nodded his head. He extended his tentacles to the surroundings and opened up the suction cups one by one.<br/><br/>Wang Xian’s speed was very fast. The sensing ability of the king of water tentacles was very terrifying.<br/><br/>Their detection ability was ten times stronger than before!<br/><br/>“Dragon King, the position on the right, conceal yourself!”<br/><br/>A few days later, the voice of the king of water tentacles was heard. Following that, a blue light enveloped Wang Xian and the rest.<br/><br/>Wang Xian’s eyes focused. He slowed down and flew to the right.<br/><br/>“There are many living beings in front of us. Furthermore, the energy there is much more abundant. It should be a paradise. It is very likely to be the location of the Dragon Palace!”<br/><br/>The king of water touch continued.<br/><br/>Wang Xian began to conceal his figure and slowly approached the front.<br/><br/>“Dragon King, there are many celestial plants with strong concealment abilities in front of us. Be careful. Don’t be discovered.”<br/><br/>As they approached, the water touch king continued to warn them.\t\t\t\t\t\t</div>", "images": {}, "success": true}