{"id": 509, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072919.html", "title": "Chapter 3500 - 3500 3499 Entered The Azure Dragon Palace!", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3500 - 3500 3499 Entered The Azure Dragon Palace!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3500 3499 entered the Azure Dragon Palace!<br/><br/>“There’s an attack from the ancestral dragon lineage. Be careful!”<br/><br/>“Damn it, kill them!”<br/><br/>A Level 2 universe overlord, the Divine Light Dragon, was killed by Wang Xian’s sneak attack. Everyone’s faces were filled with shock and anger.<br/><br/>This was a top-notch expert among them, yet he was killed in an instant!<br/><br/>“Oh no!”<br/><br/>Above the Dragon Palace, the three level 2 universe overlords, the sky plant demonic beasts, sensed the might from this side and their expressions changed drastically.<br/><br/>“Hurry up and support me!”<br/><br/>The other divine light dragon was filled with fear as he roared loudly at the sky plant demonic beasts.<br/><br/>“Chop, skeleton cross-nail!”<br/><br/>Wang Xian killed one divine light dragon and headed straight for the second divine light dragon.<br/><br/>The unparalleled might caused his face to be filled with fear.<br/><br/>This attack was too terrifying!<br/><br/>The Divine Dragon of Light, who had the combat strength of a level two universe dominator, trembled violently and formed the strongest defense in front of him.<br/><br/>“Attack!”<br/><br/>The expressions of the three sky-planting demonic beast powerhouses changed slightly. One by one, they covered Wang Xian with branches.<br/><br/>Crack! Crack<br/><br/>However, their attacks were still too slow.<br/><br/>Wang Xian completely ignored their attacks. The skull crucifix broke through the defense of the second divine dragon of light and headed straight for his dragon body.<br/><br/>“Ahhhh!”<br/><br/>A blood-red angel appeared on the crucifix. The Divine Dragon of light let out a blood-curdling scream.<br/><br/>Death enveloped it.<br/><br/>Two divine dragons of light were unable to escape from Wang Xian’s attack.<br/><br/>He was too strong!<br/><br/>It was too easy for Wang Xian to kill an existence of the same level as him!<br/><br/>“Hiss, another divine dragon of light was killed by the Dragon King. Hahaha, good, good!”<br/><br/>When the Green Dragon Whisker Shadow and the rest who were flying over saw this scene, they were excited.<br/><br/>Two divine light dragons were killed in an instant. There were only three masters of the universe with stage two combat strength.<br/><br/>“Be careful, his strength is very terrifying!”<br/><br/>The pupils of the three sky plant demonic beasts who were flying over shrunk slightly when they saw this scene.<br/><br/>They did not rush over recklessly. Instead, many branches were entangling Wang Xian from afar.<br/><br/>“Whoosh!”<br/><br/>Wang Xian looked at their long-range attacks with a look of disdain on his face. The uninitiated holy wings flickered.<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>The branches broke one by one. He flew towards the three heaven-planted demonic beasts at a terrifying speed.<br/><br/>The five elements grinding mill contained a powerful force. The water-touch King also exuded a power that made one’s heart palpitate.<br/><br/>Upon seeing this scene, the three heaven-planted demonic beasts looked at each other. Their faces were filled with a solemn expression.<br/><br/>“Heaven-planting, sweep!”<br/><br/>The three of them had a solemn expression on their faces. Their bodies turned into giant trees with blurry faces.<br/><br/>A wave of energy surged into a tree behind them.<br/><br/>That tree was the powerful innate spiritual treasure that was twining around the dragon palace. It was an extremely thick branch with sharp spikes that covered Wang Xian.<br/><br/>“Roar!”<br/><br/>Wang Xian let out a low roar and transformed into a divine dragon of wood attribute. A gush of green energy charged upwards.<br/><br/>“Splash!”<br/><br/>The king of water tentacles also condensed a sharp water current and charged towards the giant tree.<br/><br/>“Bang! Bang! Bang!”<br/><br/>The giant tree that was charging towards them was quickly defeated.<br/><br/>In front of them, the expressions of the three heaven-planted demonic beasts changed drastically.<br/><br/>“Go!”<br/><br/>He growled and ordered all the disciples and experts.<br/><br/>“The two of us have already died. Run!”<br/><br/>“Go, the experts of the ancestral dragon lineage are very strong!”<br/><br/>All the experts and disciples of the Sacred Dragon lineage and the Sky Plant Demonic Beasts roared and immediately fled when they heard the order.<br/><br/>“If you want to run, die!”<br/><br/>The eyes of the Azure Dragon Whisker Shadow were filled with killing intent as it locked onto an expert of the sacred dragon lineage.<br/><br/>“Oh no!”<br/><br/>That expert from the Holy Dragon lineage was merely a sub-dragon and was not a pure-blooded divine light dragon. When faced with the Green Dragon Shadow who was one level higher than him, he revealed a terrified expression.<br/><br/>He could not escape from being locked onto by an green dragon.<br/><br/>“Ah!”<br/><br/>Very soon, the thorns completely surrounded him and killed him directly.<br/><br/>In the surrounding area, a group of experts and disciples from the Holy Dragon Lineage were escaping rapidly and returned to their divine kingdom.<br/><br/>At the front, Wang Xian raised his eyebrows slightly when he saw the three heaven-planting demonic beasts fleeing.<br/><br/>Since the other party had fled immediately, it would be difficult for him to keep them.<br/><br/>However, Wang Xian did not care. His main target this time was the Azure Dragon Palace.<br/><br/>In addition, he had killed two divine radiant dragons. Including the previous one, there were a total of three divine radiant dragons.<br/><br/>The Divine Radiant Dragons from the last time were not absorbed by the Dragon Transformation Pool. Instead, Wang Xian wanted to resurrect the other disciples of the Dragon Palace with the body of the Divine Radiant Dragons.<br/><br/>If that was the case, the Dragon Palace would have three more divine dragons of light.<br/><br/>The three sky-planting demonic beasts disappeared, and so did the branches that wrapped around the Green Dragon Palace.<br/><br/>A Dragon Palace appeared in everyone’s line of sight.<br/><br/>“They all escaped!”<br/><br/>“Haha, they killed Two Masters at the level of universe masters of the Holy Dragon lineage.”<br/><br/>Behind them, Green Dragon Moon and the rest laughed excitedly.<br/><br/>“Dragon King, I didn’t expect you to be so strong. Are you a mutated Divine Dragon?”<br/><br/>The shadow of the Green Dragon flew over and looked at Wang Xian in shock.<br/><br/>“Yes!”<br/><br/>Wang Xian smiled and nodded his head. There was no other explanation.<br/><br/>He was also a mutated divine dragon.<br/><br/>“You are really a mutated divine dragon, brother Wang Xian. You might be the only mutated divine dragon in the Universe!”<br/><br/>The Green Dragon’s beard shadow widened his eyes.<br/><br/>“Our leader, the ancestral dragon, is only a pure-bred divine dragon. Perhaps one day in the future, brother Wang Xian, you might be able to break through to the true ruler of the Universe!”<br/><br/>The Green Dragon Moon flew over and said with shining eyes.<br/><br/>Now, he finally understood why Wang Xian could use several attributes. Only the mutated divine dragon could do this.<br/><br/>“Let’s not talk about anything else. When the Dragon King reaches the limit of a universe knight, he will be able to match a true master of the universe.”<br/><br/>Some other experts from the ancestral dragon lineage flew over and looked at Wang Xian in awe.<br/><br/>“Hehe.”<br/><br/>Wang Xian smiled. “Let’s enter Senior Green Dragon’s Dragon Palace first. The Sky Plant Demon Beasts of the Holy Dragon lineage will not let this go easily.”<br/><br/>“Alright, let’s try to enter!”<br/><br/>The Azure Dragon Whisker Shadow and the rest nodded and arrived above the Dragon Palace.<br/><br/>Wang Xian flew up and sized up the entire Dragon Palace.<br/><br/>“It’s not easy to enter. The defense of this dragon palace is very strong. Furthermore, there’s a blessed land below the Dragon Palace. This blessed land has a unique feature, which is that it has a boost to the defense of this Dragon Palace.”<br/><br/>King watertouch stared at the Green Dragon Palace and said.<br/><br/>“Do you have a way to enter?”<br/><br/>Wang Xian looked at the Green Dragon Beard Shadow, Green Dragon Moon, and the others and asked.<br/><br/>“The pure-blooded bloodlines of our ancestral dragon lineage are all related. We can give it a try.”<br/><br/>The Green Dragon Beard Shadow said.<br/><br/>He looked at Green Dragon Moon. The two of them came to the Dragon Gate of the Dragon Palace. With a wave of their arms, a stream of their blood fell into the Dragon Gate.<br/><br/>“I am the Azure Dragon Whisker Shadow!”<br/><br/>“I am the Azure Dragon Moon!”<br/><br/>“I implore senior Azure Dragon’s remaining will to let us enter your Dragon Palace!”<br/><br/>The two bowed respectfully as the blood dripped into the Dragon Gate.<br/><br/>Buzz<br/><br/>In the next moment, the energy in the Dragon Gate slowly opened a crack.\t\t\t\t\t\t</div>", "images": {}, "success": true}