{"id": 506, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072913.html", "title": "Chapter 3497 - 3497 2,496 Seconds. A Level 2 Desolate Beast, The Master Of The Universe", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3497 - 3497 2,496 Seconds. A Level 2 Desolate Beast, The Master Of The Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3497 2,496 seconds. A Level 2 desolate beast, the Master of the universe<br/><br/>“Oh?”<br/><br/>When Wang Xian heard the words of the king of water tentacles, he was astonished.<br/><br/>Under his perception, he did not sense the existence of the desolate beast. However, the king of water tentacles actually sensed it?<br/><br/>Wang Xian could be said to be the water god Dragon and the Azure Dragon, but he did not sense it.<br/><br/>“Hehe, Dragon King, I am a Space Beast, an existence on the same level as the Divine Dragon. In fact, the space beast has something that other peak races can not compare to.”<br/><br/>“I, the water touch king, am very powerful when it comes to sensing in the water!”<br/><br/>The water touch king said confidently.<br/><br/>Wang Xian nodded his head slightly. At the river of Eternity, the Water Touch King’s perception had covered an extremely terrifying area.<br/><br/>Even when an lie went to pick the water lotus, he was easily sensed by the water touch king.<br/><br/>The ability of the water touch king could not be underestimated.<br/><br/>“Capture him!”<br/><br/>Wang Xian ordered the king of water tentacles.<br/><br/>“Alright, Dragon King, leave it to me!”<br/><br/>The king of water tentacles stirred up its tentacles. One of its eyes glowed and a water mirror appeared in front of it.<br/><br/>The plant-type dire beast seemed to have sensed danger and quickly fled into the distance.<br/><br/>However, at the next moment, a water mirror appeared in front of it and drilled into it.<br/><br/>At the next moment, it appeared in front of Wang Xian and the rest. The king of water tentacles waved his tentacles and killed it.<br/><br/>“What kind of ability is this?”<br/><br/>Wang Xian couldn’t help but ask when he saw his strange attack.<br/><br/>“It’s a talent that belongs to US Space Beasts.”<br/><br/>The king of water tentacles said.<br/><br/>Wang Xian nodded his head slightly. This kind of talent wasn’t something that other races could learn.<br/><br/>“He’s pretty amazing!”<br/><br/>He commented.<br/><br/>“That’s true. If not for that bird man possessing an innate treasure, I wouldn’t be in such a miserable state. When I recover, I will definitely pluck his bird feathers.”<br/><br/>The king of water tentacles said angrily.<br/><br/>Wang Xian smiled and continued to fly forward.<br/><br/>The king of water tentacles was slightly stronger than him in terms of his special sensing ability in the water. Therefore, Wang Xian decided to let her sense the surroundings.<br/><br/>A blanket search was very time-consuming. According to the Green Dragon Whisker Shadow and the rest, if one was unlucky, they might not be able to search for more than ten years.<br/><br/>However, if one was lucky, it might only take a few years or even less.<br/><br/>More than ten years was as short as more than ten months compared to the time outside of the heaven opening and primal continent.<br/><br/>Wang Xian was not in a hurry. If that senior had enough resources in the Dragon Palace, the resources he obtained would be able to accumulate a lot for his advancement.<br/><br/>Time passed day by day. In the blink of an eye, half a year had passed.<br/><br/>“Be careful, run this way!”<br/><br/>Suddenly, a terrified voice came from the left.<br/><br/>“Lord Dragon King, Lord Green Dragon Whisker Shadow, save me!”<br/><br/>A terrified voice with a cry for help was heard. Wang Xian looked over and saw the incipient saint wings appear on his back. It disappeared instantly.<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>On the left, a strange and terrifying desolate beast was attacking an expert from the ancestral dragon lineage.<br/><br/>It was a water snake. The water snake was like a tree with a thick snake body.<br/><br/>On the body of this snake, there were numerous small snakes. These small snakes were like the branches of a tree as they covered the snake.<br/><br/>Looking at the countless water snakes, the great being of the ancestral dragon bloodline revealed a look of despair.<br/><br/>It was over!<br/><br/>The water snake, a level two universe master, couldn’t escape even if he wanted to!<br/><br/>“Beast, you are courting death!”<br/><br/>Just as he was in despair, a figure strangely appeared beside him.<br/><br/>Following that, an azure dragon head directly attacked the desolate beast.<br/><br/>At the same time, he saw a shadow flying over as well.<br/><br/>The shadow had terrifying tentacles with suction cups and sharp teeth.<br/><br/>“Hiss! Hiss! Hiss!”<br/><br/>Countless snake heads let out a hiss. They raised their heads and spat out water arrows. The water arrows were densely packed and covered the entire space around them.<br/><br/>The tai chi dragon coiled around the experts of the ancestral dragon lineage. Wang Xian’s figure disappeared in an instant.<br/><br/>“Let’s test the power of this skull cross-nail!”<br/><br/>His figure appeared above the water snake, and the energy from his body surged into his face.<br/><br/>A mask appeared, and a deep, dark cross-shaped object fell towards the strange water snake.<br/><br/>At the same time, the tentacles of the water-tentacle king tightly coiled around it.<br/><br/>Buzz<br/><br/>Hiss! Hiss! Hiss<br/><br/>The deep, dark cross-shaped object landed on the countless heads of the water snake. The heads of the water snake vanished in an instant. Fresh Blood and energy condensed into a strange, blood-red angel-like appearance.<br/><br/>The Angel was nailed to the cross. This made the power of the cross-nail increase by a lot.<br/><br/>Hiss! Hiss! Hiss<br/><br/>The entire water snake shook the small snakes in a panic. However, it was unable to escape under the restraint of the king of water tentacles.<br/><br/>The cross-nail continued to descend. It penetrated the body of the water snake and killed it.<br/><br/>“What a powerful skull cross-nail. As expected of the innate spiritual treasure that killed the Archangel!”<br/><br/>Wang Xian had a look of astonishment in his eyes. He flew over and kept the corpse.<br/><br/>The skull cross Spike’s attack was relatively simple, but its power was indeed a little terrifying.<br/><br/>Especially when it hurt the enemy and formed a blood-red angel, its power increased exponentially.<br/><br/>“This… Lord Dragon King’s strength is so strong!”<br/><br/>At the back, the expert from the ancestral dragon lineage, who was a level one universe dominator, looked at Wang Xian in shock. He could not help but gulp.<br/><br/>A level two desolate beast, a master of the universe, was easily killed. It did not even have the chance to escape.<br/><br/>This strength was too terrifying!<br/><br/>He had only lasted a few seconds under the attack of this desolate beast.<br/><br/>This desolate beast could not even last a few seconds under the Dragon King’s attack.<br/><br/>“Sou Sou Sou!”<br/><br/>At this moment, the Azure Dragon Whisker Shadow and the rest flew over and swept their gaze over.<br/><br/>“Are You Alright?”<br/><br/>“Where’s that terrifying desolate beast?”<br/><br/>The Green Dragon Whisker Shadow and the rest asked in astonishment when they saw that expert.<br/><br/>“It has been killed by the Dragon King!”<br/><br/>That expert swallowed a mouthful of saliva and said with a shocked expression.<br/><br/>“Killed?”<br/><br/>The Green Dragon Whisker Shadow and the rest were slightly shocked and revealed an incredulous expression.<br/><br/>The second-level desolate beast, the universe dominator, had been killed?<br/><br/>In just a few seconds?<br/><br/>They immediately looked at Wang Xian in front of them. Their eyes were filled with shock.<br/><br/>“I’ve already taken care of it.”<br/><br/>Wang Xian looked at them and said with a smile.<br/><br/>“Brother Wang Xian, do you… do you have a powerful innate supreme treasure?”<br/><br/>Green Dragon Moon opened his mouth and could not help but ask.<br/><br/>“No, but I have a powerful weapon.”<br/><br/>Wang Xian smiled and said, “It won’t be a problem for me to kill a dire beast of the same level!”<br/><br/>“Impressive. With you around this time, the chances of us finding the Dragon Palace are much higher.”<br/><br/>Qing longxu Ying was slightly shocked and said in pleasant surprise.<br/><br/>They didn’t expect the Dragon King to be so powerful. No wonder he was able to force the hundred cities alliance to such an extent.<br/><br/>“Let’s continue.”<br/><br/>Wang Xian smiled and said.\t\t\t\t\t\t</div>", "images": {}, "success": true}