{"id": 503, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072907.html", "title": "Chapter 3494 - 3494 2493’S Sneak Attack On The Red Skeleton Leg", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3494 - 3494 2493’S Sneak Attack On The Red Skeleton Leg</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3494 2493’s sneak attack on the red skeleton leg<br/><br/>“The Holy Dragon bloodline sent people to kill me directly. Even the son of the Holy Dragon used his innate treasure. Why would I care about making an enemy out of the Holy Dragon Bloodline?”<br/><br/>Wang Xian mumbled to himself. He didn’t care at all about participating in the war between the Holy Dragon bloodline and the Ancestral Dragon Bloodline.<br/><br/>The Dragon Palace had even participated in the war from the very beginning. However, the Dragon Palace was merely fishing in troubled waters back then and basically didn’t contribute much.<br/><br/>Later on, when the disciples of the Dragon Palace were attacked by the Hundred Cities Alliance, the Dragon Palace had a battle with the Hundred Cities Alliance.<br/><br/>“A third-level master of the universe, the Green Dragon Palace, must have a lot of treasures. According to the information from the Green Dragon Moon, they will give me at least 30% of the treasures. If I contribute more, I will get more.”<br/><br/>Wang Xian mumbled to himself. After thinking for a while, he immediately replied to the Green Dragon Moon.<br/><br/>Soon, news came from Green Dragon Moon. They would gather in two months.<br/><br/>Wang Xian looked at the gathering. It would take about ten days to reach the river of eternity.<br/><br/>He looked at the blood refinement fruit in front of him. The time was just right.<br/><br/>The blood refinement fruit would ripen in another month or so.<br/><br/>At that time, he would have two blood refinement fruits.<br/><br/>After giving the Green Dragon Moon an accurate reply, Wang Xian waited quietly.<br/><br/>“The Dragon King has agreed. We will gather in two months!”<br/><br/>At the same time, on the Green Dragon Moon’s side, he looked at the people beside him and said.<br/><br/>“Alright. With the Dragon King, a level two master of the universe, our chances will be higher.”<br/><br/>The few elders nodded their heads slightly.<br/><br/>Among them, the strongest one was only a level two master of the universe.<br/><br/>Time passed day by day. In the blood plasma area, the second blood refinement fruit was gradually maturing.<br/><br/>The entire fruit was emitting an alluring luster.<br/><br/>Wang Xian looked at the fruit and smiled.<br/><br/>Buzz<br/><br/>“HMM?”<br/><br/>At this moment, Wang Xian sensed something strange in his surroundings. He narrowed his eyes slightly and sat cross-legged without moving. He was sensing his surroundings.<br/><br/>Whoosh<br/><br/>At this moment, he saw a desolate beast that looked like a rat. It was attacking Wang Xian at a terrifying speed.<br/><br/>This rat was blood-red in color and its body was emitting a powerful blood aura.<br/><br/>It had blood-red teeth, and its speed was extremely terrifying.<br/><br/>“A level one dire beast that is a universe dominator?”<br/><br/>Wang Xian’s eyes turned cold. He waved his arm and grabbed it in his hand.<br/><br/>Energy restrained it, and a smile appeared on his face.<br/><br/>It was too easy to obtain a level one dire beast that was a universe dominator!<br/><br/>His luck was not bad!<br/><br/>Boom<br/><br/>However, at this moment, a blood-red thigh appeared beside him. The blood-red aura that surged into the sky made Wang Xian’s breathing stop.<br/><br/>This blood-red thigh seemed to have appeared out of thin air, causing his expression to change drastically.<br/><br/>Buzz<br/><br/>Around Wang Xian, the Tai Chi Dragon disc appeared and blocked the attack that had suddenly appeared.<br/><br/>Crack! Crack! Crack<br/><br/>The sound of it breaking rang out, causing Wang Xian’s gaze to freeze.<br/><br/>The Tai Chi Dragon Plate had been destroyed again!<br/><br/>Ever since the Tai Chi Dragon Plate had been upgraded to the second level of the universe dominator, it had been destroyed several times!<br/><br/>“A blood-red skeleton leg?”<br/><br/>However, even though the tai chi dragon plate had been destroyed, a strong backlash force was rebounding towards it.<br/><br/>When Wang Xian saw the attacker, his gaze froze.<br/><br/>No, it was a pink skeleton leg.<br/><br/>It was part of the pink skeleton!<br/><br/>“You’re courting death!”<br/><br/>Wang Xian sensed the attack of the pink skeleton leg and a cold look appeared in his eyes.<br/><br/>Whoosh<br/><br/>However, the pink skeleton leg, which had suffered the backlash from the Tai Chi Dragon Plate, did not retreat at all. Instead, it strangely disappeared into thin air.<br/><br/>In the next moment, it appeared directly at the side of the blood refinement fruit.<br/><br/>A wave of energy enveloped the blood refinement fruit.<br/><br/>Its target was the blood-refining fruit.<br/><br/>The blood-refining fruit was definitely a rare treasure fruit in the world. It was not rare for it to attract some skeletons and desolate beasts.<br/><br/>However, this pink skeleton leg was somewhat terrifying.<br/><br/>Its strength was sufficient to kill a level two master of the universe.<br/><br/>Most importantly, its attacks were very strange and terrifying. It was as if it could break through the void.<br/><br/>“You’re courting death!”<br/><br/>When Wang Xian saw that it was actually trying to grab the blood refinement fruit, a cold expression appeared on his face.<br/><br/>The blood refinement fruit was produced by the ancestral tree. With a thought, the blood refinement fruit disappeared instantly.<br/><br/>Buzz<br/><br/>“Kill it!”<br/><br/>In the next moment, the Netherworld Ghost appeared. The Water Touch King appeared. The Spirit Spirit appeared. The Five Elements Millstone appeared!<br/><br/>This was the full extent of the technique. It was also a technique that could cause fear among those of the same level.<br/><br/>A blue light flashed, and mirrors appeared out of thin air around him. The mirrors were somewhat illusory.<br/><br/>The Netherspirit’s five elements Millstone attacked him directly.<br/><br/>Ling Ling held a staff with a powerful ninth-grade water lotus in her hand and released a bolt of lightning.<br/><br/>A bolt of lightning that could restrain the opponent.<br/><br/>Wang Xian flapped his primaless saint wings and arrived in front of the pink skeleton leg in an instant.<br/><br/>Buzz! Buzz<br/><br/>The pink skeleton leg sensed the energy that was locked onto it. Its body trembled.<br/><br/>Buzz! Buzz! Buzz<br/><br/>Its entire body emitted a blood-red glow. It transformed into more than ten pink skeleton legs and fled to the surroundings.<br/><br/>Bang! Bang! Bang<br/><br/>The attacks of Wang Xian, the five elements grinder, the ghost of the Netherworld, and the rest landed on the pink skeleton legs. Each of the pink skeleton legs seemed to be corporeal.<br/><br/>When the powerful attacks landed on them, the energy on the pink skeleton legs dimmed significantly.<br/><br/>Buzz<br/><br/>At this moment, more than a dozen of the pink skeleton legs glowed brightly. One by one, the pink skeleton legs disappeared, leaving only the one in the front. In an instant, it dashed forward like a water mirror.<br/><br/>It rushed into the water mirror but did not break it. In the next moment, it appeared from another water mirror and was even closer to Wang Xian and the rest!<br/><br/>“Hahaha, Stupid Thing, you still want to escape from me, the king of water tentacles?”<br/><br/>When the king of water tentacles saw this scene, he let out a maniacal laugh.<br/><br/>This time, the king of water tentacles had swallowed most of the elixirs and water-type treasures in the four cities. After his strength had recovered, his means had also recovered a lot.<br/><br/>When Wang Xian saw this scene, his eyes revealed a look of surprise and joy.<br/><br/>The king of water tentacles’means were indeed strange.<br/><br/>“Dragon Claw!”<br/><br/>He stretched out his dragon claw and clawed at the pink skeleton leg.<br/><br/>The Five Elements Grunt and the ghouls had also completely sealed off the surroundings of the pink skeleton leg.<br/><br/>“Bang!”<br/><br/>The Dragon Claw grabbed and waves of energy attacked it. The destructive power of the five elements melted the life force and soul in its body!<br/><br/>“Ahhhh!”<br/><br/>Screams came from within the pink skeleton leg and gradually disappeared.<br/><br/>“You still want to covet my blood refinement fruit? You’re courting death!”<br/><br/>Wang Xian looked at it and smiled.<br/><br/>This harvest was not bad. The pink skeleton leg could be exchanged for at least two demon skeletons with the combat strength of level two masters of the universe for Princess Ling Honggu.<br/><br/>There were even more of them. These were the stronger body parts of the pink skeleton that Wang Xian had obtained.<br/><br/>They were even stronger than the pink skeleton fingers!<br/><br/>Logically speaking, it shouldn’t be a problem to exchange them for three of the same level.<br/><br/>However, Wang Xian didn’t mind. He wouldn’t reject even if it was a one-for-one exchange with Ling Honggu and the rest.<br/><br/>After all, they were considered friends!<br/><br/>“Before I reunite with the Azure Dragon Moon, I’ll make a trip to the spiritual demon race!”<br/><br/>Wang Xian mumbled.\t\t\t\t\t\t</div>", "images": {}, "success": true}