{"id": 508, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072917.html", "title": "Chapter 3499 - 3499 2,498 Seconds To Kill The Divine Dragon Of Light", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3499 - 3499 2,498 Seconds To Kill The Divine Dragon Of Light</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3499 2,498 seconds to kill the Divine Dragon of light<br/><br/>The Sky Plant Tribe was a subsidiary tribe of the Angel tribe. The Sky Plant tribe represented that they were the plants between heaven and earth.<br/><br/>Once these demonic beasts restrained their aura and energy, they would be completely different from ordinary plants.<br/><br/>If it wasn’t for the fact that the Water Touch King was a space beast, it would be difficult for him to discover them.<br/><br/>“What level are they at?”<br/><br/>Wang Xian asked.<br/><br/>“The highest level is the level one combat strength of the Master of the universe. Dragon Palace, you can hide your body. Even if the other party were to hide his aura and energy, he wouldn’t be able to discover you!”<br/><br/>The king of water touch said.<br/><br/>Wang Xian nodded and began to hide his body.<br/><br/>Under his concealment, it would be difficult for others of the same level to detect him.<br/><br/>The sky plant demonic beasts were obviously the spies of the Holy Dragon lineage and the sky plant tribe to monitor the surroundings.<br/><br/>However, they did not expect the existence of a water attribute space behemoth like the water touch king.<br/><br/>Many space behemoths with peak bloodlines were stronger than the peak races.<br/><br/>Although they were few in number, their abilities were extremely terrifying.<br/><br/>For example, the Kun fed on the Divine Dragon and Phoenix. When a divine dragon of the same level fought against a Kun of the same level, they might not be a match for the Kun without powerful treasures.<br/><br/>The strength of the Kun was similar to that of a mutated divine dragon.<br/><br/>Although the king of water touch was not as powerful, he still possessed considerable strength.<br/><br/>Wang Xian concealed his figure and easily passed through under the surveillance of the sky plant tribe.<br/><br/>In addition, the half-life elf spirit was of the wood attribute. Under the change of his aura, it was even harder for them to discover him.<br/><br/>“TSK TSK, there are more than 200 sky plant demonic beasts. It seems that they have sent quite a number of people over.”<br/><br/>Wang Xian passed through and the king of water touch spoke.<br/><br/>“The Dragon Palace of the Azure Dragon is extremely alluring to the wood-elemental heaven plant tribe.”<br/><br/>Wang Xian spoke.<br/><br/>The Dragon Palace of the Azure Dragon and the collection of the Azure Dragon. Even a master of the wood-elemental universe with a level three combat strength would be envious of it.<br/><br/>However, he didn’t know if there were any heaven plant demonic beasts with a level three combat strength. If there were, it would be troublesome!<br/><br/>“It’s just ahead!”<br/><br/>Wang Xian looked ahead. He could feel a strong energy coming from ahead.<br/><br/>It should belong to the grotto-heaven blessed land.<br/><br/>There was a high possibility that senior Green Dragon’s Dragon Palace was located around the grotto-heaven blessed land.<br/><br/>Buzz<br/><br/>“Two level two masters with combat strength of a light-attributed universe dominator and three level two masters with combat strength of a wood-attributed universe dominator.”<br/><br/>Wang Xian approached and the voice of the water touch king rang in his mind.<br/><br/>Wang Xian narrowed his eyes slightly and approached carefully.<br/><br/>Soon, an incomparably huge dragon palace appeared in his sight.<br/><br/>At this moment, the top of the Dragon Palace was slowly covered by branches.<br/><br/>There were more than twenty figures standing in front of him.<br/><br/>There were five people from the Holy Dragon lineage while the rest were all experts from the Tianzhi clan.<br/><br/>They looked at the Dragon Palace in front of them. Clearly, they were waiting.<br/><br/>“It’s not easy to enter the Dragon Palace of the Divine Dragon with level three combat strength. If that senior green dragon had been prepared, it would be difficult for even experts of the same level as him to break into it. The other party either took it away or wanted to use a special method to break into it!”<br/><br/>Wang Xian looked at this scene and muttered to himself. His face revealed a look of pleasant surprise.<br/><br/>Five level two masters of the universe could be dealt with.<br/><br/>He took out the universe AI and passed the information here to Green Dragon Moon.<br/><br/>After that, he scanned his surroundings and started to investigate.<br/><br/>The branches slowly covered the entire dragon palace. At this moment, one-third of the Dragon Palace was covered.<br/><br/>It seemed that when the dragon palace was completely covered, it was time for them to open it.<br/><br/>Three days later, the Green Dragon Moon and the rest arrived.<br/><br/>“HMM? You guys weren’t discovered by the sky plant demonic beasts at the periphery?”<br/><br/>Wang Xian asked in surprise when he saw them arriving.<br/><br/>“Dragon King, you have already informed us in advance. Naturally, we will be able to come over smoothly. After all, we are also divine dragons.”<br/><br/>The Green Dragon Beard Shadow smiled.<br/><br/>Being of the wood attribute, the green dragon was indeed much stronger than the Tian Zhi tribe.<br/><br/>Wang Xian smiled and nodded before pointing forward.<br/><br/>“There are a total of five universe masters with stage two combat strength and 18 universe masters with stage one combat strength.”<br/><br/>He opened his mouth and spoke, he looked at the Green Dragon Beard Shadow and the rest. “Brother Green Dragon Moon, Brother Beard Shadow, I can deal with five universe masters with stage two combat strength. However, can you guys open this Dragon Palace quickly? If you can’t open it immediately, the other party might continue to send reinforcements.”<br/><br/>“Open it immediately?”<br/><br/>The Green Dragon, Xu Ying and the rest shook their heads bitterly.<br/><br/>They couldn’t open this senior’s Dragon Palace immediately either.<br/><br/>“Forget it then. I still have a way!”<br/><br/>Wang Xian nodded slightly and wasn’t in a hurry.<br/><br/>They couldn’t open it. It was still an lie who could enter directly.<br/><br/>“Get ready to attack and destroy the other party!”<br/><br/>Wang Xian looked at them and said.<br/><br/>“Brother Wang Xian, are you confident?”<br/><br/>Green Dragon Moon looked at Wang Xian and asked.<br/><br/>“Don’t worry. Leave the five opponents with stage two combat strength to me.”<br/><br/>Wang Xian nodded confidently.<br/><br/>Ling Ling, Water Touch King, Hell Ghost, Five Elements Millstone, and himself, this would be a 5v5.<br/><br/>Not to mention, their strength could not be regarded as an ordinary powerhouse.<br/><br/>“I’ll make the first move. You guys follow behind!”<br/><br/>The incipient holy wings appeared behind Wang Xian. His face was covered by the skull-shaped cross-spike.<br/><br/>In the next moment, his figure dashed forward instantly.<br/><br/>The tentacles of the water-tentacle king rose.<br/><br/>The five elements grinding mill appeared above Wang Xian’s head. The Netherspirit avatar also began to condense.<br/><br/>At this moment, Wang Xian unleashed his terrifying strength.<br/><br/>“Eh?”<br/><br/>At the front, two experts from the Holy Dragon Lineage were the closest to Wang Xian. The other three experts from the sky plant race were standing in front of a tree.<br/><br/>They were clearly controlling the branches of the tree to cover the Dragon Palace.<br/><br/>Wang Xian’s attack had alerted the two divine light dragons. Their expressions changed slightly as they immediately looked behind them.<br/><br/>“Roar!”<br/><br/>At the same time, their bodies transformed into the bodies of divine dragons. A beam of light energy shot towards the back.<br/><br/>“Too slow!”<br/><br/>Wang Xian revealed a cold smile. Now that he had launched a sneak attack, unless the opponent had an innate supreme treasure, even an expert from a peak race would have to die.<br/><br/>Boom<br/><br/>Wang Xian rushed over and locked onto a divine dragon of light. The water touch king, the Five Elements Great Mill, the Netherworld Ghost Avatar, and his own attacks landed on his body instantly.<br/><br/>“No!”<br/><br/>Sensing this invincible power, the Divine Light Dragon roared in fear.<br/><br/>“Bang!”<br/><br/>He wiped out the divine light dragon instantly, even if it was a purebred one.<br/><br/>“Terrifying, let’s Attack!”<br/><br/>At the back, the Azure Dragon Beard Shadow saw this scene. He gulped and moved his body.<br/><br/>“Roar Roar!”<br/><br/>He immediately transformed into an azure dragon and charged toward the Divine Light Dragon and the Sky Plant Demonic Beast.<br/><br/>Azure Dragon Moon and the others followed closely behind.<br/><br/>“Not good, there’s an expert attacking, be careful!”<br/><br/>When the other divine light dragon saw this scene, his expression changed drastically as he cried out in alarm.\t\t\t\t\t\t</div>", "images": {}, "success": true}