{"id": 514, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072929.html", "title": "Chapter 3505 - 3505 The Respect Of The 3504 Elves And The Position Of The Spirit!", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3505 - 3505 The Respect Of The 3504 Elves And The Position Of The Spirit!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3505 The respect of the 3504 elves and the position of the spirit!<br/><br/>Wang Xian flew quickly as he stared at the lush forest in front of him.<br/><br/>He flapped his divine wings and entered the forest.<br/><br/>“Eh? What’s going on?”<br/><br/>At the same time, the Golden Hoop Sky plant demonic beast at the back saw Wang Xian entering the territory of the Elves and was astonished.<br/><br/>“Is he not in the territory of the Elf tribe yet? He should be!”<br/><br/>A hint of doubt flashed across the eyes of the Golden Hoop Celestial plant demonic beast as he continued to follow closely behind.<br/><br/>This was because he had never stepped into the territory of the Elf tribe before. He also did not know the exact location of the boundary line of the Elf tribe’s territory.<br/><br/>He did not hesitate and followed closely behind.<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>However, at this moment, arrows strangely appeared in front of him.<br/><br/>Three of the arrows made him feel as if he was enveloped by death!<br/><br/>At this moment, his expression changed drastically.<br/><br/>“This is the archer of the elves, the Arrow of Life!”<br/><br/>His expression changed drastically, and he hurriedly stopped his figure. His face was filled with confusion and shock.<br/><br/>What the hell was going on?<br/><br/>The Fellow in front of him wasn’t attacked. As soon as he got close, he attacked?<br/><br/>“Hualala!”<br/><br/>He didn’t have time to think too much. He hurriedly waved the branches that were emitting golden light.<br/><br/>“Bang, Bang, Bang!”<br/><br/>Arrows fell on his branches one by one, and his branches exploded one by one.<br/><br/>“WHOOSH WHOOSH WHOOSH!”<br/><br/>At this moment, more than ten arrows attacked.<br/><br/>“No, my lord of the Elf clan, I don’t mean to offend you. I will immediately retreat. Why are you attacking me? Why aren’t you attacking him?”<br/><br/>The Golden Hoop Sky Plant Demon Beast immediately roared in shock and anger.<br/><br/>The reason why the Archers of the Elf clan were called the arrows of life.<br/><br/>Because this represented an arrow that reaped the enemy’s life.<br/><br/>In the entire universe, the best archery skills were the arrows of life of the elves. The rest could not be compared to them.<br/><br/>They were undoubtedly the strongest in the universe.<br/><br/>Even though they were dragon species, they were still inferior to them!<br/><br/>“Huh?”<br/><br/>Wang Xian, who was fleeing in front, heard the commotion behind him. He was slightly stunned. He landed on a tree and looked behind him.<br/><br/>“This is?”<br/><br/>Wang Xian raised his eyebrows slightly and looked in one direction.<br/><br/>He saw more than ten elven angels standing on the tree and shooting at the Golden Hoop Sky plant demonic beasts.<br/><br/>“Dad, are they our people too?”<br/><br/>At this moment, Lingling asked Wang Xian.<br/><br/>“They are from the same race as you, Lingling.”<br/><br/>Wang Xian’s eyes flickered slightly.<br/><br/>Now, he completely understood why he could feel that there was a strong vitality here.<br/><br/>It seemed that he had entered the territory of the elves.<br/><br/>Looking at the terrifying arrows, he was also slightly shocked.<br/><br/>If they were to attack him, he would probably be shot to death.<br/><br/>“Is it because of the spirit spirit?”<br/><br/>Wang Xian raised his eyebrows and his eyes flickered slightly.<br/><br/>The spirit spirit belonged to the accompanying elves, supporting elves. This was only owned by the royal family of the Elves.<br/><br/>Wang Xian stopped there and watched quietly.<br/><br/>Boom! Boom! Boom<br/><br/>In the front, the Gold Hoop Sky plant demonic beast that was locked on suffered the second round of arrows.<br/><br/>Terrifying wounds appeared on his body instantly.<br/><br/>“No, why are you only attacking me? Why? I am a subordinate of the Sky Plant Demonic Beast tribe of the Angel tribe. Don’t kill me, I didn’t mean to offend you!”<br/><br/>The Golden Hoop Sky Plant Demon Beast’s body was extremely miserable as it roared in fear.<br/><br/>“Intruding into the territory of our elf race, die!”<br/><br/>An Elf said coldly.<br/><br/>“Pu!”<br/><br/>Hearing this, the Golden Hoop Sky Plant Demon Beast Spat Out Green Blood and roared with a face full of unwillingness, “That Green Dragon also intruded!”<br/><br/>That Green Dragon also intruded?<br/><br/>Why did it only attack him and not the Green Dragon?<br/><br/>I…<br/><br/>The dozen or so elves did not reply. The third round of attacks had already been launched.<br/><br/>The distance between the two sides was very far.<br/><br/>Even the Golden Hoop Sky Plant Demon Beast wanted to resist, but it could not reach this distance.<br/><br/>This was another terrifying aspect of the arrow of life.<br/><br/>The distant killing distance!<br/><br/>“I refuse to accept this!”<br/><br/>He saw the arrows that attacked again and was filled with despair.<br/><br/>Facing the attacks of three arrows of life of the same level, he wouldn’t be able to escape without powerful treasures.<br/><br/>He couldn’t escape anymore!<br/><br/>He wasn’t willing to accept this.<br/><br/>Why didn’t he attack the Azure Dragon?<br/><br/>At this moment, he suddenly thought of the one on his body. It seemed to be a companion elf.<br/><br/>“Bang!”<br/><br/>Before he could think further, death had arrived!<br/><br/>The Angels were affiliated to the Sky Plant Demonic Beast Race. The top expert, golden hoop, was directly shot to death.<br/><br/>The entire process took less than ten seconds.<br/><br/>Wang Xian looked over and a look of astonishment flashed across his eyes.<br/><br/>This was a race at the peak of the universe. It was simply a powerful stroke!<br/><br/>He clenched his fists. One day, the Dragon Palace would be able to let the divine dragon ascend to the peak once again.<br/><br/>After the Golden Hoop Sky plant demonic beast was shot to death, Wang Xian looked at the group of elves.<br/><br/>“Thank you all for your help. I, Wang Xian, AM eternally grateful!”<br/><br/>He flew over and cupped his hands in gratitude.<br/><br/>The group of elves looked at Wang Xian before their gazes landed on Lingling.<br/><br/>“She really is a companion elf.”<br/><br/>They mumbled.<br/><br/>“My friend from the Azure Dragon, how did you obtain this companion Elf?”<br/><br/>The leader of the Elves looked at Lingling and asked.<br/><br/>“HMM?”<br/><br/>Wang Xian was slightly surprised when he heard their honorific address of Lingling.<br/><br/>“I got the Spirit Spirit by chance.”<br/><br/>He opened his mouth and concealed the ancestral tree in his body with a thought.<br/><br/>The branches of the ancestral tree’s soul-returning wood emitted a faint luster, completely concealing the aura of the ancestral tree.<br/><br/>“This friend from the Azure Dragon Clan is really lucky. He has received the approval of the half-life Elf lord. Please follow us to the inner part of the Elf clan.”<br/><br/>“My Friend, you don’t have to worry. The accompanying elf is a lord of our elf tribe. Our royal family will take good care of you.”<br/><br/>The leader of the Elf tribe said.<br/><br/>“Alright. Everyone, please save us. I will naturally trust the Elf tribe.”<br/><br/>Wang Xian nodded and smiled.<br/><br/>“Please follow me then!”<br/><br/>The leader of the Elf tribe said with a smile. In an instant, he appeared on a tree beside Wang Xian.<br/><br/>Whoosh<br/><br/>Wang Xian flapped his divine wings and followed closely beside him.<br/><br/>“This pair of wings is a treasure. My Friend, your fortune is really enviable!”<br/><br/>The leader of the Elves looked at the divine wings and smiled.<br/><br/>“Yes, I didn’t know that this was the territory of the elves. It’s also my luck to meet you guys.”<br/><br/>Wang Xian smiled and said.<br/><br/>“Maybe this is fate.”<br/><br/>The leader of the Elves also smiled and looked at Lingling.<br/><br/>“You guys are good people. Thank you for saving Dad!”<br/><br/>Lingling thanked the leader of the elves.<br/><br/>“No, no, no. No matter where you were born, you are still the leader of the Elves.”<br/><br/>The leader of the Elves said hurriedly.<br/><br/>Wang Xian was also surprised as he watched. The status of the accompanying elves in the Elf clan was very high!\t\t\t\t\t\t</div>", "images": {}, "success": true}