{"id": 515, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072931.html", "title": "Chapter 3506 - 3506 The Liquid Of Life 3505, A Breakthrough!", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3506 - 3506 The Liquid Of Life 3505, A Breakthrough!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3506 The liquid of life 3505, a breakthrough!<br/><br/>“Hualala!”<br/><br/>Wang Xian followed the leader of the Elves as they flew into the territory of the Elves and headed towards the center.<br/><br/>The deeper they went, the stronger the vitality became.<br/><br/>A river appeared in the surroundings. The water was so clear that the bottom could be seen. There were many demonic beasts living in the river.<br/><br/>“Up ahead is the city of fairy flowers. It is the lair of the fairy flower race, a subsidiary race of the ELF race. We will teleport there from here.”<br/><br/>The leader of the Elf tribe pointed ahead and introduced to Wang Xian.<br/><br/>Wang Xian nodded his head and looked at the incomparably beautiful fairy flower city ahead.<br/><br/>It was more like a fairy flower garden than a fairy flower city.<br/><br/>The city wall was formed from a special kind of flower branches. It looked exceptionally beautiful from afar.<br/><br/>“Greetings, sir!”<br/><br/>Wang Xian and the rest flew over and arrived at the teleportation formation. One by one, the plant-type demonic beasts bowed to the leader of the Elf tribe.<br/><br/>The Elf captain nodded his head and stepped into the teleportation formation. He gestured to Wang Xian.<br/><br/>Wang Xian nodded his head and followed him in.<br/><br/>Buzz<br/><br/>In the next moment, Wang Xian felt an extremely dense spiritual energy as well as a majestic life force coming towards him.<br/><br/>This life force was extremely dense. Even a single breath was as though he had swallowed immortal wine.<br/><br/>Wang Xian revealed a look of shock.<br/><br/>The energy here was too dense!<br/><br/>Compared to the Dragon Palace, the difference was too great.<br/><br/>“Dad, I can feel the aura of the same origin.”<br/><br/>Lingling looked ahead and said.<br/><br/>Wang Xian raised his head and looked ahead. His face was filled with shock.<br/><br/>A lush green tree stood between the heaven and earth.<br/><br/>This tree was incomparably resplendent and huge.<br/><br/>This tree was the largest tree in the world that Wang Xian had ever encountered. On it, Little Elves were jumping and playing on the branches.<br/><br/>The branches were floating and sometimes, they were playing with the little elves!<br/><br/>On this tree, an extremely rich vitality was emitted.<br/><br/>On the branches, there were human-shaped fruits.<br/><br/>Wang Xian looked at them with his eyes flashing.<br/><br/>The entire tree stood between heaven and earth. It was as if this world was centered around her.<br/><br/>“This is the tree of Life?”<br/><br/>Wang Xian looked at the leader of the Elves and asked in shock.<br/><br/>“This is our mother, the mother who gave birth to us elves!”<br/><br/>The leader of the Elves looked forward with respect in his eyes.<br/><br/>The elves were born a few aeons ago. According to rumors, the tree of life gave birth to the elves and gave birth to a peak race.<br/><br/>Now, this race was rumored to have the existence of the elven empress who was above the ruler.<br/><br/>The strength of the Elves was unquestionable.<br/><br/>“Let’s go, I’ll bring you to meet the Elven royalty.”<br/><br/>The leader of the elves retracted his gaze and spoke to him with a smile on his face.<br/><br/>Wang Xian nodded his head and the two of them flew in the direction of the Tree of life.<br/><br/>The Tree of life was not as imposing and majestic as Wang Xian had imagined. On the contrary, the branches were playing with the little elves.<br/><br/>The sounds of laughter could be heard from far away.<br/><br/>The surroundings were very harmonious and filled with the aura of nature.<br/><br/>Wang Xian scanned the surroundings and felt that it was unusually harmonious.<br/><br/>Compared to other places, this place was filled with warmth.<br/><br/>There was no hostility, no murderous aura, and no killing intent.<br/><br/>“Eh, Sir Companion Elf, that foreign creature actually has a companion Elf!”<br/><br/>“That’s true. How did he give birth to Sir Companion Elf?”<br/><br/>As they approached the Tree of life, some of the Elves noticed the companion elf on Wang Xian’s shoulder and were discussing with curiosity.<br/><br/>The spirit spirit was also sizing them up with curiosity.<br/><br/>“Oh, the tree of life. This is the first time I’ve seen it.”<br/><br/>The king of water tentacles, who had been lying on Wang Xian’s shoulder, looked ahead. His eyes were filled with shock.<br/><br/>The elves, even the king of water tentacles, were existences that one had to look up to.<br/><br/>This was one of the truly invincible races in the universe.<br/><br/>“Friend, please wait here for a moment!”<br/><br/>Coming to the front of the Tree of life, the leader of the Elves spoke to him before flying towards the top of the tree of life.<br/><br/>Wang Xian took a look from below.<br/><br/>Ling Ling and the king of water tentacles were also looking around curiously.<br/><br/>“Huala!”<br/><br/>Just as the leader of the Elves left, a branch suddenly stuck out from the tree of life in front of them and slowly arrived in front of Wang Xian and the rest.<br/><br/>A leaf on the branch slowly enlarged and arrived in front of them.<br/><br/>In the next moment, the branch of the Tree of life brought him towards the trunk of the tree.<br/><br/>“Dragon King, the tree of life seems to be very friendly to us. If she gives us some liquid of life, we will be rich!”<br/><br/>When the king of water tentacles saw this scene, he revealed an excited expression and growled in a low voice.<br/><br/>When Wang Xian saw this scene, his eyes flickered slightly.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>At this moment, when Wang Xian and the rest were brought over by the Tree of life, elves appeared one after another.<br/><br/>Every elf was filled with a natural aura.<br/><br/>When they saw this scene, they were also slightly surprised and didn’t say anything.<br/><br/>When Wang Xian saw more than thirty elves appearing at the side, his face revealed a look of shock.<br/><br/>All of them were great elves!<br/><br/>Among them, there was a companion elf floating beside eight great elves.<br/><br/>These companion elves looked at the spirit curiously.<br/><br/>“This companion elf is a child left behind by US Elves. For some unknown reason, he was actually nurtured and formed a life-and-death contract with this divine dragon.”<br/><br/>An archangel sized up Wang Xian and the spirit.<br/><br/>“This divine dragon is not simple. His body contains the five elements of yin and yang. The wings on his back are also very powerful treasures. They are almost a part of his body.”<br/><br/>An archangel sized up Wang Xian and immediately saw through everything about him.<br/><br/>“The one on his shoulder, if I’m not wrong, is a space beast. It’s an injured space beast and was once a level one universe dominator.”<br/><br/>Another archangel looked at the king of water touch.<br/><br/>“The Luck of this divine dragon is very strong!”<br/><br/>A few archangels were discussing among themselves.<br/><br/>Wang Xian and the rest did not seem to have any secrets in front of him.<br/><br/>Buzz<br/><br/>“HMM?”<br/><br/>Just as the group of Archangels were discussing, another branch of the Tree of life came before Wang Xian and the rest.<br/><br/>There was a leaf on this branch and three drops of crystal clear liquid were on the leaf.<br/><br/>The branch came in front of Wang Xian. One drop landed on Lingling’s head while the other drop landed on the water lotus staff in Lingling’s hand.<br/><br/>The other drop landed on Wang Xian’s body.<br/><br/>“This is?”<br/><br/>Wang Xian sensed the energy contained in this drop of liquid and a shocked expression appeared on his face.<br/><br/>“The liquid of life. This is the liquid of life of the Tree of life. Ah Ah, Lord Tree of life, can you give me one drop?”<br/><br/>King Aqua Tentacle suddenly cried out and pleaded to the branch in the sky.<br/><br/>However, the tree of life did not bother with her at all.<br/><br/>When the elixir of life landed on Wang Xian’s head, it immediately entered his body. Part of it was converted into energy while the other part was directly absorbed by the ancestral tree.<br/><br/>Wang Xian’s body trembled. This energy was converted into Dragon Qi crazily.<br/><br/>He was about to break through!\t\t\t\t\t\t</div>", "images": {}, "success": true}