{"id": 513, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072927.html", "title": "Chapter 3504 - 3504 3,503 Elves", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3504 - 3504 3,503 Elves</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3504 3,503 elves<br/><br/>“I’m still a distance away from a level three master of the Universe!”<br/><br/>Wang Xian licked the blood at the corner of his mouth and a cold expression appeared on his face.<br/><br/>Although he was hit just now, this small injury could be healed in an instant.<br/><br/>Wang Xian’s gaze flew in a direction quickly.<br/><br/>He had gained a lot this time. The only thing that the Green Dragon Whisker Shadow and the rest had gained was the Green Dragon Palace.<br/><br/>Therefore, he had to buy some time for the other party. Otherwise, the Green Dragon Beard Shadow and the rest would gain nothing.<br/><br/>This time, he had relied on them to obtain these gains. Naturally, he would not abandon the other party so easily.<br/><br/>“You won’t be able to escape!”<br/><br/>At the back, the Golden Hoop Sky Plant Demonic Beast’s eyes were filled with violent killing intent. One after another, it attacked Wang Xian.<br/><br/>“Huala!”<br/><br/>“Boost!”<br/><br/>“It’s impossible to catch up to us!”<br/><br/>Ling Ling waved the water lotus magic staff in her hand and streams of energy were channeled onto Wang Xian.<br/><br/>The water touch king was also channeling the boost.<br/><br/>This caused Wang Xian’s speed to increase by a little.<br/><br/>“Huh?”<br/><br/>When the golden hoop sky plant noticed that Wang Xian’s speed had increased by a little, its expression changed slightly and it frowned.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>He waved the branches on his body and gave chase at a high speed.<br/><br/>Wang Xian identified a direction and flew at a high speed.<br/><br/>“I don’t believe that you can outlast me!”<br/><br/>When the golden hoop celestial plant noticed that it was difficult for him to keep his opponent, his expression turned cold and he continued to give chase.<br/><br/>Wang Xian had the golden branches and leaves that he had left behind. He could control these branches and leaves.<br/><br/>As long as Wang Xian wanted to escape back to his divine kingdom in an instant, he could interrupt him.<br/><br/>This was his powerful ability.<br/><br/>In fact, Wang Xian knew this as well. If he used all the energy of the ancestral tree, he could cover up this golden branch and leaf.<br/><br/>He could escape back to his divine kingdom.<br/><br/>However, he didn’t do so.<br/><br/>Once he escaped, the other party might target the Azure Dragon Palace.<br/><br/>The Green Dragon Whisker Shadow and the rest would be in trouble.<br/><br/>Boom! Boom! Boom<br/><br/>Wang Xian was escaping while the Golden Hoop Sky plant demonic beast chased after him from behind.<br/><br/>This terrifying might caused the desolate beasts along the way to tremble.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Wang Xian and the Golden Hoop Sky plant demonic beast were always at a certain distance. It was difficult for them to pull apart or close the distance.<br/><br/>However, the Golden Hoop Sky plant demonic beast would not give up on Wang Xian.<br/><br/>An azure dragon with a large number of treasures in his hands, as well as the items that were suspected to be the accompanying Elf and the Ghost Avatar, made his eyes burn with passion.<br/><br/>The pursuit and escape continued day by day.<br/><br/>They passed through the entanglement and entered a vast and boundless plain. They flew rapidly above the plain.<br/><br/>“Huh?”<br/><br/>“In that direction?”<br/><br/>The Gold Hoop Sky plant demon beast that had been chasing them for nearly two months frowned slightly.<br/><br/>In front of them, huge trees appeared in sight, full of vitality coming from within.<br/><br/>That world seemed to be even more beautiful.<br/><br/>“Within the territory of the elf race, within the territory of the Elf race, all non-elf race disciples are prohibited from entering.”<br/><br/>The Gold Hoop Sky Plant Demon Beast muttered.<br/><br/>It wasn’t just the elven race, any peak race of the universe was the same.<br/><br/>Their territory, unless the peak race of the universe allowed you to enter, they would treat you as an intruder.<br/><br/>Facing an intruder, they would naturally kill him directly.<br/><br/>“I’ll be fine as long as I follow behind him. Hehe, let’s see where you can escape to!”<br/><br/>A ferocious look appeared on the face of the Golden Hoop Sky plant demonic beast as it continued to follow closely behind.<br/><br/>“HMM? The vitality ahead is so dense?”<br/><br/>At this moment, Wang Xian could also sense the changes in front of him.<br/><br/>Each and every one of the huge trees was more than ten times larger than the one in the encirclement.<br/><br/>Each and every one of the trees towered into the clouds.<br/><br/>There were also some flying birds and beasts in the sky.<br/><br/>“Is there a blessed land?”<br/><br/>He muttered and didn’t care about anything else, continuing to fly forward.<br/><br/>“We’re getting closer, the boundary of the peak race of the universe, we definitely can’t step into it!”<br/><br/>The Golden Hoop Sky Plant Demon Beast’s eyes flickered with light, ready to attack at any time.<br/><br/>“CHIRP CHIRP!”<br/><br/>At the same time, within the boundary of the elf race, the sound of a bird chirping could be heard.<br/><br/>“Sir, someone has stepped into our territory!”<br/><br/>The voice of the demon bird sounded from above.<br/><br/>“Who dares to step into the territory of the elf race and I will shoot them down?”<br/><br/>More than ten elves immediately walked out from the caves in the trees.<br/><br/>As they spoke, their figures instantly disappeared.<br/><br/>There were not many members of the ELF race. The number of elves born in the Tree of life was only about one million.<br/><br/>The number of mothers was in the hundreds of millions.<br/><br/>The ones born in the tree of life belonged to the nobles of the elven race. They were existences comparable to pure-blooded divine dragons.<br/><br/>As for the ones born in the Mother Nature, they were like the dragon species of the Dragon Palace.<br/><br/>Some were comparable to the nobles of the elves, which were at the peak of the dragon species.<br/><br/>Some were like high-grade dragon species.<br/><br/>In the next moment, at the border, more than ten elves were floating on the trees.<br/><br/>Pairs of extremely sharp eyes were looking ahead.<br/><br/>They were all archers of the elf race, and they were the arrows of life among the elves.<br/><br/>The border was also guarded by the arrows of life.<br/><br/>“Eh?”<br/><br/>Pairs of sharp eyes swept ahead and locked onto Wang Xian and the golden hoop celestial plant.<br/><br/>When they saw Wang Xian who was fleeing ahead, they paused for a moment.<br/><br/>Their gaze landed on the spirit spirit who was holding a magic staff on Wang Xian’s shoulder.<br/><br/>“This is… This Is?”<br/><br/>Shocked voices came out from the mouths of the elves.<br/><br/>They looked at each other and were filled with shock and disbelief.<br/><br/>“Companion Elf, this is a companion elf. How could a half-life Elf of our elf race be on the body of a divine dragon?”<br/><br/>A female elf could not help but ask.<br/><br/>“I don’t know, half-life elf. Other than the tree of life that can be nurtured, there is no other half-life elf that can be nurtured. In the history of our Elf clan, there were only two creatures that coincidentally obtained a companion Elf of our Elf clan. One has already died, and the other is Lord Mu Mu.”<br/><br/>The Elf in the center spoke.<br/><br/>Companion elves could only be obtained by the royal family of the Elf clan. Even the noble elves that were nurtured by the tree of life were very difficult to obtain.<br/><br/>This required the gift of the tree of life and the approval of the companion elves.<br/><br/>And the royal family was not hereditary, but had half-life elves.<br/><br/>It could be understood that the royal family of the Elf clan was equivalent to the mutated divine dragon of the Divine Dragon Clan.<br/><br/>“He is being chased and will enter our territory immediately. Captain, we?”<br/><br/>An ELF opened his mouth to ask and answer.<br/><br/>“Naturally, he is the one who is chasing after him!”<br/><br/>The Elf captain in the middle didn’t hesitate at all and said indifferently.<br/><br/>“The universe ruler Level 3 Plant Type Demon Beast needs us to act together!”<br/><br/>The bow appeared in the hand, bowstring, slowly pulled open!\t\t\t\t\t\t</div>", "images": {}, "success": true}