{"id": 519, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072939.html", "title": "Chapter 3510 - 3510 3509 Strong Kill, Target 15 Cities!", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3510 - 3510 3509 Strong Kill, Target 15 Cities!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3510 3509 strong kill, Target 15 cities!<br/><br/>“Roar Roar Roar!”<br/><br/>At the same time, after Wang Xian bid farewell to the Green Dragon Whisker Shadow and the rest.<br/><br/>Just as he arrived at the Dragon Palace, a series of excited roars were suddenly heard.<br/><br/>When Wang Xian heard this voice, he was slightly stunned.<br/><br/>Buzz<br/><br/>His figure flashed and he instantly appeared at the North Dragon Gate of the Dragon Palace.<br/><br/>Over there, the devouring dragons raised their heads and let out excited roars.<br/><br/>The Fire Dragon Palace and the Dark World of the demon dragon had completely disappeared.<br/><br/>Ao crab was in the center. His body emitted the aura of a level two universe dominator.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>At this moment, figures flew over.<br/><br/>These figures also emitted the aura of a level two universe dominator. Among them, there were two divine light dragons.<br/><br/>“Greetings, Dragon King!”<br/><br/>Ao he and the rest greeted Wang Xian respectfully when they saw him.<br/><br/>The two divine dragons of light and the other level two universe Dominators of the Dragon Palace also greeted him immediately.<br/><br/>“Get up. You have improved a lot this time!”<br/><br/>Wang Xian swept his gaze across them and smiled.<br/><br/>He had already placed the eight heaven plant demonic beasts he killed last time into the Dragon Palace.<br/><br/>They had already been completely absorbed by the members of the Dragon Palace.<br/><br/>Now, among the disciples of the Dragon Palace, including Ao crab and a dozen other universe rulers with Level 2 devouring dragons, there were a total of 28 level 2 fighters in the Dragon Palace.<br/><br/>With 28 Level 2 universe rulers and him, their strength was not much weaker than the 100 City Alliance.<br/><br/>The only ones in the Dragon Palace who were weaker than the Hundred Cities Alliance were Level 1 universe overlords and universe knights.<br/><br/>After all, they still had more than 90 cities.<br/><br/>“Dragon King, I heard that our Dragon Palace is currently fighting with a force. Now that our devouring dragon has completed its upgrade, when are we going to fight them?”<br/><br/>Ao crab’s eyes were filled with a strong fighting spirit as he spoke.<br/><br/>“Hehe, don’t be anxious. We will take action immediately.”<br/><br/>Wang Xian swept his gaze across them and smiled. “Follow me. We will head to the river of Eternity First.”<br/><br/>As he spoke, he moved to the location of the teleportation formation.<br/><br/>Ao he and the rest immediately followed behind and stepped into the teleportation formation.<br/><br/>Buzz<br/><br/>“Prime Minister Gui, call Ao Yao and the rest of the eight-limbed demonic killing formation over.”<br/><br/>When Wang Xian arrived, he immediately instructed Prime Minister Gui.<br/><br/>“It’s the Dragon King!”<br/><br/>When Prime Minister Gui heard the order, he immediately responded.<br/><br/>The eight-limbed demonic sky formation and the rest were looking for an opportunity to hunt down the strong disciples of the Hundred Cities Alliance.<br/><br/>Ao Yao was even circling around the Hundred Cities Alliance.<br/><br/>Currently, the Hundred Cities Alliance was forced into a passive position by the thorned dragon seed.<br/><br/>The thorned dragon seed had also been circling around a fixed city.<br/><br/>It could appear in one city or another city.<br/><br/>In short, in order to prevent being surrounded by the experts of the Hundred Cities Alliance, they would not stay around the same city to assassinate.<br/><br/>Currently, the Hundred Cities Alliance did not have any good methods.<br/><br/>They could only protect the inner part of the city, but they could not do anything about the outside.<br/><br/>Recently, there were not many people from the Hundred Cities Alliance who left the city.<br/><br/>If they wanted to leave, they would use special methods.<br/><br/>For example, they would instantly return to the divine kingdom that was hidden outside.<br/><br/>Most of them were the disciples and experts of the Hundred Cities Alliance. They went into seclusion and hid for tens of thousands of years.<br/><br/>Buzz! Buzz! Buzz<br/><br/>“Greetings, Dragon King!”<br/><br/>Not long after, the eight-headed demonic fiend and Ao Yao returned.<br/><br/>“How’s the situation of the Hundred Cities Alliance recently?”<br/><br/>Wang Xian asked with a smile.<br/><br/>“Dragon King, it’s going to be difficult to assassinate the disciples and experts of the Hundred Cities Alliance now. They can either hide in the city or use the teleportation formation to enter and exit the city.”<br/><br/>Ao Yao reported.<br/><br/>“Ask all the prickly dragon species to retreat. There’s no need for us to continue wasting our time with them.”<br/><br/>Wang Xian said calmly, he looked at the eight-limbed demonic fiend and said, “Eight-limbed demonic fiend, both of you have a better understanding of the Hundred Cities Alliance. Choose 15 cities. One of them will be guarded by a level two universe overlord while the rest will be guarded by a level one universe overlord.”<br/><br/>“Alright, Dragon King. Dragon King, what are we going to do this time?”<br/><br/>The eight-limbed demonic fiend and Wang Xian nodded and asked with sparkling eyes.<br/><br/>“We’ll attack directly!”<br/><br/>Wang Xian’s eyes revealed a sinister look. “We’ll attack immediately and attack 15 cities at the same time.”<br/><br/>“Attack 15 cities at the same time?”<br/><br/>Ba Qi and Mo Sha’s eyes flickered. They scanned their surroundings and saw a group of experts from the Dragon Palace. They nodded slightly. This strength was sufficient.<br/><br/>“Dragon Palace, with our strength, we can easily destroy 15 cities. However, we might still encounter danger. The alliance leader of the Hundred Cities Alliance has the combat strength of a level three universe overlord.”<br/><br/>Ba Qi spoke.<br/><br/>“Therefore, we must be careful this time. If we encounter the leader of the Alliance of 100 cities, escape immediately!”<br/><br/>Wang Xian nodded.<br/><br/>The Alliance of 100 cities only had one level three universe overlord, and that was the leader of the Alliance of 100 cities.<br/><br/>According to the information, the other party was a wizard and didn’t have any innate supreme treasures. He shouldn’t be a match for Wang Xian.<br/><br/>Of course, Wang Xian could not be 100% sure when facing the strongest person from such a huge force.<br/><br/>“Dragon King, I think we can attack these 15 cities!”<br/><br/>Ba Qi communicated with Mo Sha and wrote down 15 cities.<br/><br/>These 15 cities were closer to this place and it would take less time to fly over.<br/><br/>“Sure!”<br/><br/>Wang Xian nodded immediately when he saw that.<br/><br/>Did they think that they were safe just by hiding in the cities?<br/><br/>This time around, he and the members of the Dragon Palace had reached a certain level of strength. They could definitely kill their way over.<br/><br/>This time around, it was a real battle of strength.<br/><br/>Although the Dragon Palace was still inferior to the Hundred Cities Alliance at the moment.<br/><br/>However, the Hundred Cities Alliance was a loose alliance after all. All the forces were not gathered together.<br/><br/>Therefore, the chances of Wang Xian and the rest succeeding in killing their way over were very, very high.<br/><br/>“Get Ready!”<br/><br/>After confirming the 15 cities, killing intent flashed in Wang Xian’s eyes. “I’ll get an lie to bring us over one by one. This time, let’s make the alliance of 100 cities even more miserable.”<br/><br/>Although the 15 cities that he had chosen were the closest to this place.<br/><br/>If they were to fly over, with Wang Xian’s current speed, it would still take a year.<br/><br/>After all, there were 15 cities!<br/><br/>There was a long distance between the cities. Furthermore, there was no teleportation formation at the moment.<br/><br/>It would take even longer for the eight-headed ao crab and the rest to complete their preparations.<br/><br/>If it was an lie, he would be able to complete all the preparations within a dozen days.<br/><br/>“Yes!”<br/><br/>The eight-headed ao crab and the others nodded.<br/><br/>Soon, an lie arrived after receiving the order. He began to teleport to the location of the fifteen cities.<br/><br/>Time passed day by day. Wang Xian waited quietly in the Dragon Palace.<br/><br/>“Dragon King, Mo Sha and the others have already made the arrangements. You are the only one left.”<br/><br/>Half a month later, an Lie’s figure appeared and reported.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian nodded.\t\t\t\t\t\t</div>", "images": {}, "success": true}