{"id": 512, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072925.html", "title": "Chapter 3503 - 3503 Under The 3502 Battle Master With Level 3 Combat Strength", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3503 - 3503 Under The 3502 Battle Master With Level 3 Combat Strength</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3503 Under the 3502 Battle Master with Level 3 combat strength<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>Numerous extremely sharp thorns covered Wang Xian.<br/><br/>“Crash!”<br/><br/>Wang Xian flapped his uninitiated holy wings. The tai chi dragon circled around him while the king of water tentacles formed a line of defense.<br/><br/>“Boom!”<br/><br/>He completely resisted his opponent’s attack. He flapped his uninitiated holy wings and attacked the Golden Hoop Sky Plant Demon Beast in the sky.<br/><br/>“Huh?”<br/><br/>The Golden Hoop Sky plant demon beast stared at Wang Xian with a cold and disdainful look. “Azure Dragon? You are courting death!”<br/><br/>“Crash!”<br/><br/>In the next moment, numerous metal-like branches attacked Wang Xian.<br/><br/>Wang Xian focused his gaze. Waves of energy surged into the five elements Millstone and went straight for the golden branches.<br/><br/>The spirit of the accompanying Elf began to strengthen it. The water touch king and his Netherspirit avatar also attacked at the same time.<br/><br/>“With our combined strength, we can withstand it!”<br/><br/>The Water Touch King roared with confidence.<br/><br/>Regardless of whether it was Wang Xian, the five elements millstone, or the water touch king, they could not be understood by ordinary experts of the same level.<br/><br/>They could easily kill existences of the same level.<br/><br/>All the attacks collided with the branches of the Golden Light, resulting in a violent collision.<br/><br/>Boom<br/><br/>The branches of the golden light began to melt, and so did Wang Xian’s attacks.<br/><br/>It was blocked!<br/><br/>“Huh?”<br/><br/>At the front, the Golden Hoop Celestial Plant Demonic Beast was full of surprise when he saw this scene.<br/><br/>His gaze swept across Wang Xian’s body, and his eyes sparkled.<br/><br/>“What is that? A companion elf? And An Abyss Ghost Avatar? How is this possible? What kind of opportunity is this?”<br/><br/>The Golden Hoop Celestial plant demonic beast revealed a shocked expression.<br/><br/>Crash<br/><br/>In the next moment, his eyes emitted a scorching glow as he attacked Wang Xian directly.<br/><br/>“Attack!”<br/><br/>Wang Xian growled in a low voice. The king of watertentacles with the uninitiated holy wings flew to both sides while the Abyss Ghost Avatar was in the middle!<br/><br/>Wang Xian, on the other hand, relied on his speed and disappeared in an instant. He arrived at a position above the king of Waterspout.<br/><br/>“HMPH, your speed is not bad. However, with this speed, you still want to suppress me?”<br/><br/>The Golden Hoop Celestial plant demonic beast snorted coldly. Numerous golden branches extended out from his body.<br/><br/>There were golden leaves attached to the branches.<br/><br/>These leaves were extremely sharp.<br/><br/>His attack enveloped the king of Waterspout and the Netherworld Ghost Avatar.<br/><br/>“Bang! Bang! Bang!”<br/><br/>The sound of collision rang out once again. This time, Wang Xian’s body was sent flying backward.<br/><br/>“Roar! Roar! Roar!”<br/><br/>He let out a wild roar and instantly transformed into an azure dragon. With a wave of his dragon claws, he attacked Wang Xian one by one.<br/><br/>“Golden wild, annihilate them. TSK TSK, I really didn’t expect an azure dragon to have so many good fortune. Today, your good fortune all belongs to me!”<br/><br/>The Golden Hoop Sky plant demonic beast let out a wild roar and golden leaves swept towards Wang Xian and the rest.<br/><br/>It was like a hurricane blowing the extremely sharp leaves, cutting through the void and attacking indiscriminately.<br/><br/>When Wang Xian saw this attack, his expression changed slightly.<br/><br/>His figure flashed and he instantly arrived at the side of the five elements grinding mill. Relying on his speed, he gathered together with the water contact King’s Ghost Avatar.<br/><br/>“Defend!”<br/><br/>He growled in a low voice as layers of defense stood in front of him.<br/><br/>Boom! Boom! Boom<br/><br/>The terrifying attack landed on the ground. Wang Xian and the rest managed to defend against it.<br/><br/>“Divine dragon playing with beads!”<br/><br/>Wang Xian growled and released his strongest aspect attack.<br/><br/>The Shadow of a divine dragon appeared. It carried a dragon bead and attacked the golden hoop sky plant directly.<br/><br/>“Heaven Devouring!”<br/><br/>The water touch king shouted loudly. Black holes appeared in the surrounding river water. They gradually enlarged and headed straight for the Golden Hoop Sky plant.<br/><br/>“HMPH, a puny level two life form who is the ruler of the universe. How Dare You Provoke Me!”<br/><br/>The Golden Hoop Sky plant was furious when it saw that its attacks were being blocked one after another. Its body began to expand crazily.<br/><br/>Very soon, its body grew to a size of tens of thousands of meters. Numerous golden branches covered Wang Xian and the rest.<br/><br/>“Dragon King, we can’t defeat him.”<br/><br/>Water Touch King looked at the might of the Golden Hoop Celestial plant demonic beast and said.<br/><br/>It was easy to fight for a while, but it was impossible to defeat the other party.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian also understood that it was already good enough for them to fight against him when they joined forces. It was impossible for them to defeat the other party.<br/><br/>All he needed to do was to attract the other party.<br/><br/>Wang Xian flapped his uninitiated holy wings and instantly fled into the distance.<br/><br/>“If you want to escape, you must die. Seed of life, Soul Chase!”<br/><br/>When the Golden Hoop Sky plant demonic beast saw him fleeing, it waved its branches and a seed instantly shot toward Wang Xian.<br/><br/>“Huh?”<br/><br/>Wang Xian sensed this seed and his expression changed slightly. He wanted to dodge it immediately.<br/><br/>However, this strange seed entered his body directly.<br/><br/>When the seed entered his body, he didn’t feel any discomfort. Furthermore, the species disappeared instantly.<br/><br/>“What is this thing?”<br/><br/>His mind stirred. He immediately mobilized the power of the ancestral tree to search for this species.<br/><br/>However, the ancestral tree didn’t sense anything.<br/><br/>“That’s not right. This is a lock on my aura. When the seed entered my body, not only did it not have any side effects, but it allowed me to absorb it instantaneously and improve a little. However, there is a kind of energy in it. The other party can track me through this kind of energy.”<br/><br/>Wang Xian’s mind was filled with thoughts, and his eyes were sparkling.<br/><br/>“Hahaha, connect!”<br/><br/>At this moment, the Golden Hoop Celestial plant demonic beast let out a maniacal laugh from behind.<br/><br/>Wang Xian’s expression changed slightly. A golden leaf appeared on his body.<br/><br/>This leaf seemed to have grown out from his body, causing him to frown slightly.<br/><br/>“Is it some kind of method to prevent me from returning to the Divine Kingdom in an instant?”<br/><br/>He mumbled as a hint of seriousness appeared on his face. He flapped his incipient saint wings and flew forward rapidly.<br/><br/>“You can’t escape. You have my mark of life on you. You Can’t escape!”<br/><br/>The Golden Hoop Sky plant demonic beast said coldly as he chased after Wang Xian.<br/><br/>His speed was no slower than Wang Xian’s.<br/><br/>After all, his strength was one level lower than Wang Xian’s!<br/><br/>Feeling the pursuit from behind, Wang Xian’s expression turned slightly ugly. Ever since he became enemies with the Holy Dragon lineage, he had been pursued several times!<br/><br/>“After this, I must raise my combat strength to level three as soon as possible. Only then will I be able to be unafraid of any living beings below the peak of the Universe!”<br/><br/>Anger welled up in Wang Xian’s heart as he quickly flew up into the sky.<br/><br/>The Golden Hoop Sky plant demonic beast followed closely behind him. Golden Sharp branches attacked him from time to time.<br/><br/>“Bang!”<br/><br/>After flying for 20 minutes, Wang Xian broke through the ground of the encirclement.<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>At this moment, golden thorns gathered at the back and pierced through Wang Xian.<br/><br/>“Defend!”<br/><br/>He growled and a thick defense appeared behind him.<br/><br/>“Bang!”<br/><br/>The collision was heard and blood trickled out from the corner of Wang Xian’s mouth!\t\t\t\t\t\t</div>", "images": {}, "success": true}