{"id": 511, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072923.html", "title": "Chapter 3502 - 3502 3501 Battle-Lord Level 3", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3502 - 3502 3501 Battle-Lord Level 3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3502 3501 battle-lord level 3<br/><br/>“Lord, one of them is a powerful Green Dragon. He can instantly kill A Level 2 universe lord. Even two light dragons were killed by him.”<br/><br/>“He has a pair of powerful wings. Not only is it a treasure, but it can also display the speed of a level 3 universe Lord.”<br/><br/>Nine sky plant demon beasts were shuttling through the bottom of the river, and a Sky Plant Demon Beast Warrior reported to the Gold Ring Sky Plant Demon Beast.<br/><br/>“A pure-bred Green Dragon? I can just destroy it and absorb it as nourishment.”<br/><br/>The Gold Ring Sky Plant Demon Beast’s eyes shone, and a look of anticipation appeared on its face.<br/><br/>The Green Dragon was an extremely precious nourishment for him.<br/><br/>If he could absorb it, he might be able to increase his strength again.<br/><br/>The eight golden hoop sky plant beasts smiled when they saw their lord’s confidence.<br/><br/>Their lord was a mutated existence among the sky plant beasts. He had both wood and gold attributes and was extremely powerful.<br/><br/>The nine experts of the sky plant beasts flew towards the Azure Dragon Palace. They were very fast and the Dragon Palace was not far from them.<br/><br/>At this moment, in the Dragon Palace, the Green Dragon Whisker Shadow was refining this dragon palace.<br/><br/>Wang Xian began to devour all the resources and quickly converted them into Dragon Qi.<br/><br/>Although there were more resources here, there was still some distance to go before Wang Xian could achieve a breakthrough.<br/><br/>It would take some time for the Green Dragon Whisker Shadow to refine this dragon palace.<br/><br/>Furthermore, he could not completely refine it. He could only control this dragon palace simply.<br/><br/>Time passed by, and in front of the Dragon Palace, nine sky plant demon beasts appeared.<br/><br/>They glanced around.<br/><br/>“Hualala!”<br/><br/>Golden branches extended from the Golden Sky Plant Demon Beasts, and a golden mirror appeared.<br/><br/>“They have entered the Dragon Palace. Good, we can catch them in a jar and kill them all!”<br/><br/>He looked at the Dragon Palace and smiled.<br/><br/>“Sir, we can completely lock them in there.”<br/><br/>A sky-planting demonic beast said with shining eyes.<br/><br/>“OK!”<br/><br/>The Golden Ring sky-planting demonic beast nodded and flew to the sky above the Dragon Palace.<br/><br/>“Take out the devouring tree!”<br/><br/>He said.<br/><br/>“Yes, Sir!”<br/><br/>A sky-planting demonic beast waved his arm and a tree flew to the front of the Golden Ring sky-planting demonic beast.<br/><br/>The roots of this tree looked like a huge open mouth!<br/><br/>His roots landed on the tree one by one and waves of energy poured in.<br/><br/>In the next moment, the branches covered the Dragon Palace.<br/><br/>“Guard the four dragon gates. Kill anyone who comes out!”<br/><br/>The golden hoop sky plant ordered.<br/><br/>“Yes, my Lord!”<br/><br/>The eight heaven plant demonic beasts answered. They immediately came to the top of the four dragon gates and covered them with thorns.<br/><br/>“HMM?”<br/><br/>In the Azure Dragon Palace, Wang Xian was sitting cross-legged in the dragon palace absorbing resources. When he sensed the situation outside, he opened his eyes and looked over immediately.<br/><br/>At this moment, the Azure Dragon Whisker Shadow in the Dragon King’s Hall also opened his eyes immediately.<br/><br/>Buzz<br/><br/>With a thought, he could see everything clearly outside the Dragon Palace!<br/><br/>Whoosh! Whoosh! Whoosh! Whoosh<br/><br/>Azure Dragon Moon and the rest flew towards Wang Xian with a solemn expression.<br/><br/>“How is this possible? They escaped back to their divine kingdom in an instant. How did they rush over so quickly?”<br/><br/>An expert from the holy dragon lineage said with an awkward expression.<br/><br/>The expression of the Green Dragon Beard Shadow was also somewhat awkward.<br/><br/>“The opponent is very strong. If My senses are not wrong, he is a level three master of the universe.”<br/><br/>He spoke with a solemn expression.<br/><br/>A level three master of the universe was not someone they could contend against.<br/><br/>“The eight sky plant demonic beasts around are level two masters of the universe.”<br/><br/>Wang Xian sensed the outside and frowned slightly.<br/><br/>Logically speaking, the sky plant demonic beasts and the rest should have escaped back to their divine kingdom. If they wanted to rush over again, it would take a few months at the earliest.<br/><br/>If the distance was relatively far, it was possible to take a few years.<br/><br/>However, the other party had rushed over in just a dozen hours.<br/><br/>This was completely out of their expectations.<br/><br/>The other party had used that tree to entangle the entire Dragon Palace, and they were completely trapped.<br/><br/>Unless they gave up on this dragon palace.<br/><br/>“Not good. I can sense that the space around us has been sealed!”<br/><br/>At this moment, the expression of the Azure Dragon Whisker Shadow changed drastically as he spoke.<br/><br/>Wang Xian sensed for a moment. This space had indeed been completely sealed off.<br/><br/>He looked outside as his eyes sparkled.<br/><br/>“We have to break through. Otherwise, if the other party completely seals off the Dragon Palace, we will be in trouble!”<br/><br/>The Azure Dragon Whisker Shadow looked at Wang Xian with a serious expression and said.<br/><br/>“Brother Azure Dragon Whisker Shadow, how long will it take for you to take control of this Dragon Palace?”<br/><br/>Wang Xian asked him.<br/><br/>“At least three months!”<br/><br/>The figure with the azure dragon beard replied, “After I have basically refined this dragon palace, I will be able to utilize some of its power.”<br/><br/>“Three months?”<br/><br/>Wang Xian pondered for a moment. “I will first lure that level 3 master of the universe away to buy some time. If there is no chance, I will send someone to bring you away!”<br/><br/>“HMM? Dragon King, you want to pin down that master? No, this is too dangerous!”<br/><br/>Green Dragon Moon shook his head immediately.<br/><br/>“Hehe, don’t worry. Since I dare to make a move, I have confidence!”<br/><br/>Wang Xian smiled and squinted his eyes as he stared at the Golden Heaven Plant Demonic Beast.<br/><br/>If it didn’t have a powerful treasure, Wang Xian could definitely pin it down.<br/><br/>“Brother Green Dragon, please take control of this dragon palace as soon as possible. I’ll go out and give it a try.”<br/><br/>Wang Xian continued to speak to them.<br/><br/>“This…”<br/><br/>Qinglong Xuying’s expression changed. He cupped his hands at him and said, “Dragon King, you have to be careful!”<br/><br/>“Don’t worry. A disciple from my dragon palace will come over later. If there’s really no other way, they can bring you guys out of Here!”<br/><br/>Wang Xian spoke to them. His body moved and he flew towards a Dragon Gate.<br/><br/>At the entrance of the Dragon Gate, he set up a devil spirit altar and sent a message to an lie.<br/><br/>After receiving his reply, he stared outside.<br/><br/>“A level three master of the universe, I’ll give it a try today!”<br/><br/>Wang Xian mumbled.<br/><br/>The spirit spirit appeared on his shoulder while the ghost avatar appeared on one side.<br/><br/>The water touch king had been lying on the other shoulder while the five elements millstone was floating above his head.<br/><br/>Around him, the Taiji dragon plate was spreading the news.<br/><br/>In the next moment, his body immediately moved.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The Divine Dragon on the Five Elements Millstone let out a roar and directly blasted away the thorns that covered the Dragon Gate.<br/><br/>“The enemy is starting to counterattack!”<br/><br/>When the two Heaven Plant Demonic Beast powerhouses at the Dragon Gate saw that the thorns that were laid down were broken, their eyes focused, and a ghastly expression appeared on their faces.<br/><br/>They did not hesitate at all and directly bombarded the entrance.\t\t\t\t\t\t</div>", "images": {}, "success": true}