{"id": 518, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072937.html", "title": "Chapter 3509 - 3509 3,508 Seconds", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3509 - 3509 3,508 Seconds</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3509 3,508 seconds<br/><br/>“That group of Sky Plant Demonic Beasts hasn’t left yet. Is it because they didn’t receive the news of the death of the third-level Sky Plant Demonic Beast?”<br/><br/>With the activation of the incipient saint wings, Wang Xian entered the underground river at a terrifying speed.<br/><br/>After entering the underground river, his speed increased again.<br/><br/>In fact, they had already received the news of the death of the Golden Hoop Sky plant demonic beast.<br/><br/>Even the mirror image of the Golden Hoop Sky plant demon beast before it died had already been transmitted to the Sky Plant Demon Beast Race.<br/><br/>When he saw the mirror image, the leader of the Sky Plant Demon Beast was extremely speechless. His face was filled with embarrassment and anger as he cursed, “Idiot, you’re courting death.”.<br/><br/>If this wasn’t an idiot, then what was it?<br/><br/>In order to chase after a universe ruler Level 2 godly dragon, he actually dared to intrude into the territory of the elf race. Wasn’t this courting death for a purebred?<br/><br/>To charge into the territory of a peak race, one couldn’t escape even if one wanted to.<br/><br/>As for the Godly Dragon, it was also dead in their eyes.<br/><br/>Even the Golden Hoop Sky Plant Demon Beast was dead, not to mention the godly dragon.<br/><br/>To chase after a godly dragon, they lost their lives. It was extremely stupid.<br/><br/>When the eight sky plant demon beasts heard the news, apart from being shocked, they didn’t leave.<br/><br/>Lord Jin Huantian Zhi was dead, and so was the divine dragon.<br/><br/>This didn’t stop them from completely suppressing the Dragon Palace.<br/><br/>In the sky above the Dragon Palace, the tree was still devouring the entire Dragon Palace. Ninety percent of the Dragon Palace was covered by branches.<br/><br/>Soon, the entire Dragon Palace would be devoured.<br/><br/>At that time, they could easily take it away.<br/><br/>“Three days at most. Continue to transfer energy and guard the last Dragon Gate. Don’t let them escape!”<br/><br/>One of the heaven-planted demonic beasts shouted loudly.<br/><br/>The other seven nodded.<br/><br/>Swoosh<br/><br/>However, just as they finished their sentence, Wang Xian’s figure appeared in front of the Dragon Palace.<br/><br/>It was so quiet that the eight heaven-planted demonic beasts didn’t sense his arrival.<br/><br/>“You are courting death!”<br/><br/>Wang Xian looked at the eight sky-plant demonic beast powerhouses with a cold look in his eyes.<br/><br/>Whoosh<br/><br/>She flapped her incipient saint wings and instantly attacked the eight sky-plant demonic beast powerhouses.<br/><br/>Fast!<br/><br/>Extremely fast!<br/><br/>Before the eight sky-plant demonic beasts could react, Wang Xian’s figure had already passed through them.<br/><br/>The current Wang Xian’s speed was comparable to an existence at the level of a true ruler of the universe.<br/><br/>“PFFT! PFFT! PFFT!”<br/><br/>When Wang Xian’s figure arrived above the dragon palace, the sound of penetration was heard.<br/><br/>A faint smile appeared on his face.<br/><br/>“Bang! Bang! Bang!”<br/><br/>There were no screams or sounds. The eight corpses fell down directly.<br/><br/>Wang Xian waved his arm and collected all their corpses.<br/><br/>“Whoosh!”<br/><br/>His body moved and came to the Divine Tree of the Devouring Dragon Palace. He sized it up.<br/><br/>This was an innate supreme treasure and not a living divine tree.<br/><br/>A surge of energy landed on it. The branches covering the Dragon Palace were retracted quickly and disappeared.<br/><br/>“Oh?”<br/><br/>At this moment, in the Dragon Palace, the Green Dragon Whisker Shadow was refining the Dragon Palace to resist the suppression. When he saw the branches disappear in an instant, he was stunned.<br/><br/>“It’s the Dragon King! It’s the Dragon King!”<br/><br/>At this moment, at the entrance of the Dragon Palace, an expert from the ancestral dragon lineage looked outside and exclaimed.<br/><br/>“It’s really the Dragon King. Where are the experts from the sky-planting demonic beasts?”<br/><br/>The Green Dragon Whisker Shadow and the rest were slightly shocked and immediately walked out.<br/><br/>“Dragon King!”<br/><br/>They flew out and shouted at Wang Xian.<br/><br/>“Hehe, Brother Green Dragon Whisker Shadow, are you guys okay?”<br/><br/>Wang Xian looked at them and asked with a smile.<br/><br/>“Brother Wang Xian, we’re alright. are those powerhouses from the Sky Plant Demonic Beasts Alright?”<br/><br/>Green Dragon Beard Shadow asked with some doubt.<br/><br/>“It’s settled. Brother Green Dragon Beard Shadow, hurry up and refine the Dragon Palace!”<br/><br/>Wang Xian replied to him.<br/><br/>“Settled?”<br/><br/>Green Dragon Beard Shadow widened his eyes and was visibly moved. “Brother Wang Xian, I’ve almost refined the Dragon Palace. We can move it now.”<br/><br/>“Oh? Alright, let’s go back.”<br/><br/>Wang Xian nodded.<br/><br/>“Okay!”<br/><br/>The Green Dragon Shadow nodded.<br/><br/>“Brother Wang Xian, how did you get rid of the third-level master of the universe, the Sky Plant Demonic Beast?”<br/><br/>The Green Dragon Moon asked Wang Xian in astonishment.<br/><br/>“I didn’t get rid of it. I escaped to the border of the Elf tribe and they killed him.”Wang Xian looked at him.<br/><br/>“The Elves?”<br/><br/>Green Dragon Moon was slightly shocked.<br/><br/>“I was lucky this time.”<br/><br/>Wang Xian said. This time, he was indeed lucky.<br/><br/>It was fortunate that he had a companion elf. Otherwise, he might have been killed by the elves.<br/><br/>“It’s all thanks to brother Wang Xian. If it weren’t for you, we wouldn’t have gained anything.”<br/><br/>The figure with the Azure Dragon Beard said gratefully.<br/><br/>“Hehe, if it weren’t for you guys, I wouldn’t have gained so much either. Let’s go.”<br/><br/>Wang Xian shook his head and entered the Dragon Palace.<br/><br/>The figure with the Azure Dragon Beard took control of the Dragon Palace and flew out.<br/><br/>In the Dragon Palace, Azure Dragon Moon and the rest were extremely excited. Their arrival this time could be considered a complete success.<br/><br/>A group of experts from the ancestral dragon lineage invited Wang Xian and they celebrated.<br/><br/>For the next ten days, Wang Xian stayed in the Dragon Palace.<br/><br/>He was prepared to escort Green Dragon Beard Shadow and the rest to a safe place before leaving.<br/><br/>The current Wang Xian was no longer afraid of most of the existences in the heaven-opening primal continent.<br/><br/>According to the Elf tribe, the Masters of the universe realm were forbidden to interfere with their race. Currently, only those of the same level with innate supreme treasures could suppress him. He was almost invincible.<br/><br/>Even for the masters with innate supreme treasures, it was very difficult to kill him.<br/><br/>Time passed day by day. Wang Xian, Azure Dragon Moon, and the rest exchanged some things every day. Time passed very quickly.<br/><br/>A few months later, they came to the forest where they previously agreed to meet.<br/><br/>“Brothers, I’ll be leaving first. Be careful.”<br/><br/>Wang Xian cupped his hands and said to the experts of the ancestral dragon lineage.<br/><br/>“Alright. Brother Wang Xian, you must be careful too!”<br/><br/>The rest of them nodded and cupped their hands in response.<br/><br/>Wang Xian nodded and parted ways with them.<br/><br/>“Why do I feel that brother Wang Xian is stronger again?”<br/><br/>The eyes of the Green Dragon Xu Ying flickered slightly as he muttered as he watched Wang Xian disappear.<br/><br/>“Indeed. I Can’t see through him anymore.”<br/><br/>The green dragon nodded. “Moreover, his dragon palace is also very terrifying. There are definitely many thorned dragon species. Now, the Hundred Cities Alliance is almost crippled by the Dragon Palace!”<br/><br/>“It’s difficult to cripple them. The Hundred Cities Alliance is still too strong. Even though our ancestral dragon lineage knows that they are involved, we have turned a blind eye to it. The Dragon Palace has caused them great trouble, but their foundations are still intact. Their strength is still intact.”<br/><br/>The Azure Dragon Whisker Shadow said slowly.\t\t\t\t\t\t</div>", "images": {}, "success": true}