{"id": 516, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072933.html", "title": "Chapter 3507 - 3507 The Friendship Of The 3506 Archangels", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3507 - 3507 The Friendship Of The 3506 Archangels</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3507 The friendship of the 3506 Archangels<br/><br/>Just a drop of the elixir of life was absorbed by the ancestral tree. The energy contained in it could still allow Wang Xian to achieve a breakthrough in his strength.<br/><br/>He couldn’t imagine how terrifying the energy contained in the elixir of life was!<br/><br/>“Roar!”<br/><br/>The crazy energy transformed into Dragon Qi. He couldn’t help but let out a low roar and transformed into the body of a divine dragon.<br/><br/>A divine dragon that was emitting nine-colored rays of light was located below the ancestral tree.<br/><br/>“Nine attributes. His body contains nine attributes. Although the wind and thunder attributes have yet to be completely fused, this is… Heaven and earth!”<br/><br/>An archangel stared at Wang Xian’s dragon body and growled in a low voice with a face full of shock.<br/><br/>“The five elements and light and darkness have already completely fused with his body. In other words, he possesses seven attributes perfectly. Back then, the Five Elements Dragon King, one of the strongest existences in the Divine Dragon tribe, was also much weaker than him.”<br/><br/>“He is completely the fusion of the Five Elements Dragon King and the light and Dark Dragon King of the Divine Dragon Clan!”<br/><br/>A few archangels stared at Wang Xian’s body. They could not hide the shock on their faces.<br/><br/>It was the first time they had seen a divine dragon with seven attributes.<br/><br/>It was also the first time they had seen such a heaven-defying existence.<br/><br/>“Could it be that the last bit of luck of the Divine Dragon Clan is on him?”<br/><br/>An Archangel couldn’t help but exclaim.<br/><br/>“I’m going to break through him!”<br/><br/>More than 20 archangels watched Wang Xian break through.<br/><br/>Crack! Crack! Crack<br/><br/>Waves of draconic aura swept across the surroundings. It didn’t affect anything in the surroundings.<br/><br/>The Elf captain looked at everything in shock.<br/><br/>The Elixir of Life! Their tree of life actually gave him three drops of the elixir of life.<br/><br/>“Ding! Congratulations to host for breaking through to the level of a universe Knight Level 6. You have comprehended the law form: Dragon Breath of Life!”<br/><br/>Not long after, the system’s voice sounded, and Wang Xian was delighted.<br/><br/>Name: Wang Xian<br/><br/>Race: Yin-yang Wind Thunder Five Elements Divine Dragon (man-dragon unity)<br/><br/>Level: Universe Knight Level 6(the ninth form of the Divine Dragon Transformation)<br/><br/>Origin: 1% (99% needed for the next breakthrough)<br/><br/>Ability: ruling the water race (ruling the water race below one’s level)<br/><br/>Devouring living beings (devouring living beings to extract origin)<br/><br/>Control of the five elements<br/><br/>Technique: Dragon God transformation<br/><br/>Ability: soul absorbing, spirit attaching<br/><br/>Law Ability: Dragon Eye Lock, Five Elements Dragon Claw, Yin-yang breakthrough, eight luminaries Dragon Scale, Holy Dragon Shadow, Heavenly Dragon Eight Tribes, Dragon Tomb, Cloud Dragon Rising, true dragon body<br/><br/>Law form: eight Dragon Pillars, eight dragon clones, towering dragon horns, Mighty Heavenly Dragon, God’s tail playing with beads, Dragon Breath of life<br/><br/>Control Law: metal, wood, water, fire, Earth, light, dark wind and thunder<br/><br/>Kingdom of God: Dragon Palace<br/><br/>Possession of Dragon Palace: acquired.<br/><br/>Members of Dragon Palace: 1960,450<br/><br/>With a thought, the attributes appeared in Wang Xian’s mind, causing him to smile.<br/><br/>He opened his dragon eyes and scanned his surroundings. Immediately, he transformed into his human form and cupped his hands towards the tree of life.<br/><br/>“Thank you for the gift of the Tree of life. Thank you, everyone from the Elf tribe.”<br/><br/>Wang Xian said with gratitude.<br/><br/>The value of the elixir of life was priceless.<br/><br/>This was not something that could be exchanged for just because one had divine stones and treasures.<br/><br/>The only way to obtain the elixir of life was to obtain the tree of life.<br/><br/>However, the tree of life was the mother tree of the Elf tribe. To obtain a drop of it was equivalent to an extremely powerful fortune.<br/><br/>“The mother of the Tree of life gave you the liquid of life. Naturally, she has her own way of doing it. Welcome this divine dragon to our elf tribe.”<br/><br/>A big elf with a staff and accompanying elves in the middle smiled and said to Wang Xian.<br/><br/>“I was also being hunted down and accidentally barged into this place. Thank you, Elf tribe.”<br/><br/>Wang Xian cupped his hands at them once again.<br/><br/>“Hehe, this is a fortuitous encounter that belongs to you. It is also a fortuitous encounter that belongs to us.”<br/><br/>The Great Elf said faintly.<br/><br/>Whoosh<br/><br/>“Eh, isn’t this the aura that I sensed from the twelfth-grade water lotus? It is indeed the aura of the accompanying elf.”<br/><br/>At this moment, another great elf flew over.<br/><br/>Wang Xian looked over and his eyes sparkled. “Greetings to the Great Elf of the sound of Life!”<br/><br/>“You’re welcome.”<br/><br/>The Archangel of the sound of life shook its head and its gaze landed on Lingling.<br/><br/>At this moment, the water lotus in Lingling’s hand had turned into the size of a human head. After absorbing the liquid of life, Lingling lay in the Lotus in a deep sleep.<br/><br/>“Yinya, have you guys met before?”<br/><br/>A great elf looked at the sound of life and asked in puzzlement.<br/><br/>“I sensed this aura when I was snatching the twelfth grade water lotus not long ago. I didn’t expect to meet it so soon.”<br/><br/>The Voice of life replied with a smile.<br/><br/>“My friend the Dragon God, please come in.”<br/><br/>A big elf said to him.<br/><br/>“Thank you.”<br/><br/>Wang Xian spoke and nodded at them.<br/><br/>Following closely behind the group of Big Elves, Wang Xian followed them to a huge wooden house in the tree of life.<br/><br/>The things in the wooden house were very simple and natural.<br/><br/>Some fresh flowers were decorated and looked extremely beautiful.<br/><br/>“May I know how did this friend of the Dragon God obtain a companion elf?”<br/><br/>An Archangel looked at the half-life elf lying in the water lotus and could not help but ask.<br/><br/>“By chance, I encountered the fruit of the half-life elf. I once obtained some vitality fluid and placed it inside to nurture it.”<br/><br/>Wang Xian spoke and completely covered up the matter regarding the ancestral tree.<br/><br/>The secret of the ancestral tree and the system could not be known by anyone.<br/><br/>“HMM? That’s really a coincidence.”<br/><br/>A great elf raised his eyebrows and nodded. He did not probe further.<br/><br/>“I wonder if you are interested in joining our elf tribe.”<br/><br/>The Archangel who had an accompanying elf in the middle asked Wang Xian.<br/><br/>“Join the Elf clan?”<br/><br/>Wang Xian’s eyes flickered and he shook his head immediately. “I won’t hide it from you, senior Archangel. I Am the Dragon King Immortal of the Dragon Palace. I want to bring the Divine Dragon clan back to its peak.”<br/><br/>“Dragon King of the Dragon Palace? I have heard of this before. I didn’t expect you to be the Dragon King.”<br/><br/>On the right side, an archangel had heard of Wang Xian’s name before. He sized him up once again in surprise.<br/><br/>“Is it going to bring the Divine Dragon clan back to their peak?”<br/><br/>The voice of life smiled and exchanged a glance with the big elf beside him. “It’s really possible!”<br/><br/>“I’ve seen that Little Fellow from the ancestral Dragon Clan.”<br/><br/>A big elf who looked a little pale smiled, then, he looked at Wang Xian and said, “In terms of talent and opportunities, he is not as good as you. Now, if he wants to bring the divine dragon lineage back to the peak, it is very unlikely. On the other hand, your chances are very high.”<br/><br/>“Senior, you are too kind. However, it won’t be long before I bring the divine dragon lineage back to the peak.”<br/><br/>Wang Xian’s eyes were flashing with confidence.<br/><br/>Now that he had broken through, he was not far from that final step.<br/><br/>“With your luck, you might not have a 100% chance of breaking through to the realm of the universe’s ruler, but there is still a 90% chance. However, I have to remind you.”<br/><br/>The old Archangel looked at Wang Xian and pondered for a moment. “If you want to return the Dragon Palace to its peak and enter the ranks of the top races in the universe, it would be best if there are dozens of divine dragons at the realm of the universe’s ruler.”<br/><br/>“Huh?”<br/><br/>When Wang Xian heard his words, he was slightly surprised.<br/><br/>Why was it best if there were dozens of them?\t\t\t\t\t\t</div>", "images": {}, "success": true}