{"id": 528, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072957.html", "title": "Chapter 3519 - 3519 3518 Arrived At The Blood Plasma Area Again", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3519 - 3519 3518 Arrived At The Blood Plasma Area Again</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3519 3518 arrived at the blood plasma area again<br/><br/>“Dragon Palace, it won’t be long before I destroy all of you, completely.”<br/><br/>Alliance master Bai Cheng returned to the front of Bai Cheng Peak. When he saw Wang Xian’s figure disappear, his expression turned ugly.<br/><br/>This divine dragon from the Dragon Palace had completely exceeded his expectations.<br/><br/>With his strength and his foundation, he believed that it would be difficult for him to find an opponent of the same level.<br/><br/>Even if he were to encounter a great being of the same level from another universe pinnacle race, as long as he did not have an innate true treasure, he was confident that he could defeat him.<br/><br/>However, that great being from Dragon Palace was too fast!<br/><br/>This speed was already close to the level of a universe ruler!<br/><br/>“Alliance Leader!”<br/><br/>“Alliance Leader!”<br/><br/>At this time, a level two great being with the Combat Power of a universe ruler flew over and shouted at him.<br/><br/>“This dragon god of Dragon Palace is very powerful, but his power has been completely understood. Next time, we can easily kill him!”<br/><br/>Hundred City Alliance master said calmly with confidence.<br/><br/>“It’s alliance master. As long as the resources and treasures of the Holy Dragon lineage arrive, we will be able to easily kill him.”<br/><br/>An old man immediately said with a smile.<br/><br/>“Continue to gather all the elites and disciples of hundred city. It Won’t be long before we destroy that Dragon Palace!”<br/><br/>The Hundred Cities Alliance master said indifferently and flew toward the highest mountain in the center.<br/><br/>Landing on the top of the mountain, a confident smile appeared on his face.<br/><br/>Although he had been suppressed this time, the next time would be the death of the Divine Dragon!<br/><br/>Buzz<br/><br/>He came to the position of a teleportation array and disappeared in an instant.<br/><br/>When he reappeared, he had already arrived at the branch of the Sacred Dragon!<br/><br/>…<br/><br/>“Let’s Find a place to grind the five elements first. Perhaps the strength of the Tai Chi Dragon Disc has increased!”<br/><br/>Wang Xian left the Bai Cheng Peak and flew aimlessly in the sky above the inner continent. He was deep in thought.<br/><br/>Although the strength of the Bai Cheng Alliance leader was inferior to his, he still had some energy.<br/><br/>This was especially so when he was in his lair.<br/><br/>He had to think of a way to quickly improve the five elements grinding or the tai chi dragon disc.<br/><br/>After upgrading the Tai Chi Dragon Plate, he would be able to eliminate the alliance leader of the Hundred Cities.<br/><br/>“Should I continue to head to the land of the demonic bones?”<br/><br/>Wang Xian hesitated for a moment before flying in that direction.<br/><br/>The demonic skeletons in the land of the demonic bones could be absorbed by the Tai Chi Dragon Plate.<br/><br/>Secondly, the land of the blood plasma could allow the ancestral tree to bear the blood refinement fruit.<br/><br/>Upgrading and obtaining the blood refinement fruit were both the same. Furthermore, he was planning to get the members of the Dragon Palace to devour the blood refinement fruit to see how much of a difference it would bring.<br/><br/>Wang Xian pondered as he shuttled back and forth rapidly.<br/><br/>“I heard that the powerhouses of the Dragon Palace went to the Bai Cheng Peak and had a huge battle with the Bai Cheng Alliance Chief. Both parties were evenly matched!”<br/><br/>“I heard from the disciples of the Bai Cheng Peak that the powerhouse from the Dragon Palace seemed to have the upper hand!”<br/><br/>“The Dragon Palace is really strong now. They rushed to the Bai Cheng Peak confidently and fought with the Bai Cheng Alliance Chief.”<br/><br/>At this moment, while he was flying toward the land of the Devil’s bone, news of the battle between Wang Xian and the Hundred Cities Alliance leader was also spread out.<br/><br/>This shocked everyone!<br/><br/>The Dragon Palace was even more ferocious than they had imagined. They directly charged into the old dynasty of the Hundred Cities Alliance.<br/><br/>While the universe’s artificial intelligence was flying around, two months later, Wang Xian arrived at the front of the land of the Devil’s bone through the teleportation formation. Then, he continued flying and stepped into the land of the Devil’s bone.<br/><br/>Not long after, he arrived at the land of the blood plasma again.<br/><br/>This time, he landed at the center of the land of the blood plasma and dived down.<br/><br/>Now that Wang Xian had achieved a breakthrough in his strength, the land of the blood plasma was no longer a threat to him!<br/><br/>The entire land of the devil bones might no longer pose a threat to him.<br/><br/>Of course, it was rumored that there were devil skeletons at the level of the ruler of the universe here. However, it was unknown whether they were real or fake and had not been verified.<br/><br/>After landing at the center of the Land of blood and plasma, Wang Xian arrived at the deepest part of the land.<br/><br/>This location was located at the information center of the spiritual demon race. It was considered a relatively dangerous area.<br/><br/>Wang Xian had never rooted his ancestral tree here in the past.<br/><br/>That was because at that time, he was still not a match for a Master of the universe with level-three combat strength.<br/><br/>This time, he deliberately chose this place.<br/><br/>If a level three master of the universe demon skeleton really attacked him, he would be able to kill it.<br/><br/>Wang Xian was still very confident in facing a level three demon skeleton of the same level.<br/><br/>He sat cross-legged on the ground with ease. The ancestral tree was rooted in the ground.<br/><br/>“Eh?”<br/><br/>At this moment, Wang Xian realized that the speed at which the ancestral tree absorbed the underground energy was much faster. It was five to six times faster than before.<br/><br/>“My improvement has also increased the condensation of the blood refinement fruit by five to six times? Doesn’t that mean that I can produce a blood refinement fruit in three to four months?”<br/><br/>A look of pleasant surprise appeared on his face.<br/><br/>Wang Xian sat there quietly with his legs crossed. He concealed his aura and remained motionless.<br/><br/>A blood refinement fruit was formed rapidly.<br/><br/>The blood refinement fruit emitted an alluring aura.<br/><br/>At the center of the blood plasma land, there was no doubt that it was a bright lamp.<br/><br/>This might seem like an act of courting death to an ordinary powerhouse.<br/><br/>“Rustle! Rustle!”<br/><br/>After an unknown period of time, a soft sound was heard.<br/><br/>When Wang Xian heard this sound, his mind stirred slightly.<br/><br/>“Hiss! Hiss!”<br/><br/>At this moment, a blood-red, incomparably pure blood snake suddenly flew toward the blood-refining fruit.<br/><br/>It stuck out its tongue, which became very, very long as it attacked Wang Xian.<br/><br/>The blood-refined fruit had yet to mature. It wanted to kill Wang Xian and occupy this place.<br/><br/>“Hehe, a level one desolate beast with the combat strength of a universe Dominator!”<br/><br/>Wang Xian opened his eyes, and a cold look appeared in his eyes.<br/><br/>“Leave it to me, leave the Dragon King to me!”<br/><br/>On his shoulder, the water touch king said excitedly, and her figure disappeared instantly.<br/><br/>Soon, she flew over in satisfaction with a smile in her eyes.<br/><br/>“This should be a desolate beast condensed from the blood essence of the blood plasma land, right?”<br/><br/>Wang Xian asked the king of water tentacles.<br/><br/>“Hehe, yes, Dragon King. It’s useless to you if your level is too low. It can help me recover a little.”<br/><br/>The king of water tentacles said with a smile.<br/><br/>This kind of desolate beast condensed from blood essence was undoubtedly a great tonic.<br/><br/>It could be directly devoured and converted into pure energy.<br/><br/>Wang Xian didn’t say anything and continued to close his eyes.<br/><br/>The recovery of water touch was undoubtedly of great help to him.<br/><br/>“Over here, there is a powerful special energy coming from this side.”<br/><br/>As the blood refinement fruit grew, Wang Xian was in this place and attracted some living beings to come again.<br/><br/>This time, it was clearly a powerhouse of intelligent living beings.<br/><br/>As the voice rang out, Wang Xian opened his eyes and scanned his surroundings. Waves of energy were transmitted over.<br/><br/>Wang Xian scanned his surroundings with his mind and sensed the aura of an expert with level two combat strength who was the Master of the universe.<br/><br/>Buzz<br/><br/>At this moment, five figures appeared in his line of sight. Wang Xian looked over.<br/><br/>Three skeletons and two experts with darkness attribute.<br/><br/>“This fruit has already been occupied by me. All of you should leave immediately.”<br/><br/>Wang Xian gave them a faint warning.<br/><br/>“HMM?”<br/><br/>At this moment, the five figures also saw Wang Xian. They swept their gaze and landed on the blood refinement fruit beside Wang Xian!\t\t\t\t\t\t</div>", "images": {}, "success": true}