{"id": 520, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072941.html", "title": "Chapter 3511 - 3511 The Counterattack Of The 3,510 Dragon Palace Had Officially Begun", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3511 - 3511 The Counterattack Of The 3,510 Dragon Palace Had Officially Begun</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3511 The counterattack of the 3,510 Dragon Palace had officially begun<br/><br/>Weng<br/><br/>Daming city was a very powerful city in the Hundred City Alliance.<br/><br/>It had two universe master level great beings guarding it.<br/><br/>It was one of the top cities in the Hundred City Alliance.<br/><br/>Since the war between the Hundred City Alliance and the Dragon Palace broke out, cities with universe master level 2 power had been affected less.<br/><br/>At this time, the Great Ming city was obviously much livelier than other cities.<br/><br/>After all, there were too many disciples of the Hundred Cities Alliance. After a number of cities were destroyed and surrounded by the dragon race, although the disciples of the Hundred Cities Alliance rarely left the city, they could teleport to each other in the cities!<br/><br/>More than 90 cities were big enough to teleport to some stronger cities, which was also a kind of safety guarantee.<br/><br/>At this moment, although the Daming city was not as bustling as before, there were still many people walking around.<br/><br/>At the front of the Daming City, Wang Xian’s figure slowly appeared.<br/><br/>His gaze swept across the cities in front of him. He took out the universal AI and sent a message to the eight-headed demon Ao Yao and the rest.<br/><br/>“Dragon King, we are ready!”<br/><br/>Very soon, messages were sent back one by one.<br/><br/>“Attack at the same time in ten minutes. Once the alliance leader of the Hundred Cities Alliance is teleported over, escape immediately!”<br/><br/>Wang Xian gave the time to attack.<br/><br/>“Yes!”<br/><br/>The eight-limbed demon Ao Yao and the rest replied immediately.<br/><br/>Wang Xian looked at Daming city. He flapped his incipient saint wings and slowly approached it.<br/><br/>He could not guarantee that he would be discovered if he entered the city. Therefore, he was prepared to attack again in ten minutes!<br/><br/>“With this city, if I were to fly from this city gate to the opposite city gate, I would need thirty seconds at maximum speed!”<br/><br/>Wang Xian arrived at the city of Daming City and muttered.<br/><br/>Thirty seconds. He could turn one-third of the city into ruins!<br/><br/>“The counterattack of the Dragon Palace has just officially begun today. I would like to see how Your Hundred Cities Alliance will defend against it!”<br/><br/>Wang Xian’s eyes focused. He stood there quietly and waited for the time to come.<br/><br/>Ten minutes passed very quickly.<br/><br/>Boom<br/><br/>When the last second arrived, Wang Xian flapped the primaless saint wings and the five elements millstone appeared in his hand.<br/><br/>Waves of energy surged into it and turned into a deathly silent energy.<br/><br/>On his body, the leaf emitted a ray of light.<br/><br/>Under the perception of the outside world, this was a peculiar wood attribute energy.<br/><br/>Buzz<br/><br/>The Netherspirit avatar appeared beside him.<br/><br/>He charged towards Daming city.<br/><br/>The Five Elements Millstone in his hand released a destructive energy and covered the entire city.<br/><br/>It covered a third of the city’s width.<br/><br/>In the next moment, a bizarre and terrifying scene appeared.<br/><br/>Boom! Boom! Boom<br/><br/>Wang Xian’s speed was unleashed to the maximum. Everywhere he flew, he was struck by the destructive energy.<br/><br/>At the bottom, all the buildings collapsed. All the disciples of the Great Illumination City died instantly.<br/><br/>Other than the rumbling sound, there were no other screams.<br/><br/>Wang Xian stared at them. There was no mercy in his eyes.<br/><br/>Everyone who was still in the city of the Alliance of 100 cities were loyal and core disciples of the Alliance of 100 cities.<br/><br/>If they were still alive, they would attack the Dragon Palace in the future.<br/><br/>Both sides had to fight to the death!<br/><br/>Beep! Beep! Beep<br/><br/>When Wang Xian suddenly rushed into the city, the alarm of the city, which was located at the center of Daming City, suddenly sounded.<br/><br/>The urgent sound reverberated throughout the mayor’s residence, causing everyone to be slightly shocked.<br/><br/>“Look over there quickly. Oh My God, what is this?”<br/><br/>A few of the powerhouses in the mayor’s residence looked ahead. They saw a green glow that was like a poisonous fog shrouding the area below.<br/><br/>The buildings collapsed and the disciples’powerhouses died instantly.<br/><br/>It was as though Doomsday was coming!<br/><br/>Moreover, this doomsday was spreading towards them at a terrifying speed.<br/><br/>This caused their expressions to change drastically. Their faces were filled with fear.<br/><br/>“What?”<br/><br/>At this moment, in the middle of the Castellan’s residence, two old men flew to the sky in an instant and looked over.<br/><br/>They couldn’t see any figures. All they could see was a large patch of green poisonous fog enveloping them.<br/><br/>The speed was extremely terrifying!<br/><br/>“The war between the Dragon Palace and the Hundred Cities Alliance has officially begun!”<br/><br/>Wang Xian fixed his gaze in the direction of the city Lord’s mansion and locked onto the two figures.<br/><br/>They could not see Wang Xian because he was too fast!<br/><br/>However, Wang Xian could see them.<br/><br/>The two masters of the universe with level-two combat strength.<br/><br/>“Not good, run quickly, or we won’t make it in time!”<br/><br/>At this moment, the two masters of the universe with level-two combat strength in Daming City felt death and doomsday enveloping them. Their expressions changed drastically as they roared furiously.<br/><br/>They hurriedly flew downwards, wanting to open the defense of the grotto-heaven blessed land.<br/><br/>“It’s the voice of the Dragon Palace’s powerhouse. How is this possible? This is definitely the destructive power of a level 3 universe dominator. How can the Dragon Palace have such a terrifying powerhouse!”<br/><br/>When they heard Wang Xian’s voice, they roared in disbelief.<br/><br/>In their initial understanding, what kind of strength was the Dragon Palace?<br/><br/>A Level One universe dominator was already the strongest. Now, a level three universe Dominator had appeared!<br/><br/>This made them feel a little incredulous!<br/><br/>Boom<br/><br/>“Not good!”<br/><br/>Just as they were fleeing downwards, a pair of resplendent dragon horns suddenly attacked them.<br/><br/>The speed of the Dragon Horns’attack was even more terrifying!<br/><br/>When they saw this scene, their expressions changed drastically, and they hurriedly flew up into the sky to avoid this terrifying attack.<br/><br/>Hong<br/><br/>In the next moment, the entire city leader mansion below them was reduced to ruins.<br/><br/>One attack, just one attack!<br/><br/>“It’s definitely a great being with the Combat Power of a universe ruler at level three. Flee! All Disciples of Great Ming City, Flee!”<br/><br/>The two Level 2 universe masters roared in fear.<br/><br/>“Don’t even think about running!”<br/><br/>At this moment, a voice sounded in their ears. The next moment, their vision blurred and they saw a figure very close to them.<br/><br/>This figure was very familiar to them.<br/><br/>They had seen his portrait before.<br/><br/>Dragon Palace Dragon King!<br/><br/>“How could it be…”<br/><br/>Their eyes were wide open and their faces were filled with despair.<br/><br/>How could it be the Dragon King of the Dragon Palace?<br/><br/>How could he be so strong?<br/><br/>Boom<br/><br/>In the next moment, their vitality disappeared rapidly and they fell into endless darkness.<br/><br/>Wang Xian kept the corpse and did not stop. He continued to attack the front.<br/><br/>“Run!”<br/><br/>At this moment, the entire daming city was in chaos.<br/><br/>The sound of buildings collapsing, the sound of attacks, and the alarm of the city.<br/><br/>The end of the world was approaching.<br/><br/>They could only escape frantically. However, under this horrifying attack, the only ones who could escape were the disciples and powerhouses of Daming City who were not covered by Wang Xian’s attacks.<br/><br/>Even so, there were still many powerhouses’disciples who could not react in time.<br/><br/>Wang Xian’s speed was too fast!<br/><br/>It was so fast that it made them despair!<br/><br/>They did not even have time to escape back to their own divine kingdom.\t\t\t\t\t\t</div>", "images": {}, "success": true}