{"id": 529, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072959.html", "title": "Chapter 3520 - 3520 The Attraction Of The 3519 Blood Refinement Fruit", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3520 - 3520 The Attraction Of The 3519 Blood Refinement Fruit</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3520 The attraction of the 3519 blood refinement fruit<br/><br/>With the arrival of the five powerhouses, Wang Xian issued his own warning.<br/><br/>The main reason why he gave birth to the blood refinement fruit here was to attract the dire beasts and skeletons in the blood plasma land.<br/><br/>Wang Xian did not immediately launch an attack against these powerhouses.<br/><br/>Of course, this was also the reason why the other party did not attack Wang Xian immediately.<br/><br/>The warning sound entered the ears of the five of them. The five of them looked at each other and stared at the blood-refining fruit. Their eyes were burning with passion.<br/><br/>Although they did not know the specific function of this blood-refining fruit.<br/><br/>However, the energy transmitted from it made them feel that their blood was a little agitated. They wanted to devour it and assimilate it into their bodies.<br/><br/>They did not leave. A wave of energy covered Wang Xian.<br/><br/>They did not attack but were sensing him.<br/><br/>“Leave within three seconds. Otherwise, I will treat all of you as my enemies!”<br/><br/>Wang Xian sensed a surge of energy sweeping across his body. He gave a cold warning for the second time.<br/><br/>The five of them sensed Wang Xian but did not manage to find out his actual strength.<br/><br/>“You’re just putting on a show. We want this treasure!”<br/><br/>The eyes of the five experts sparkled. With a snort, they instantly attacked Wang Xian.<br/><br/>From their point of view, Wang Xian was using his aura to suppress them. was he not confident enough to make them retreat?<br/><br/>Was that possible?<br/><br/>If the other party was an expert, he would have attacked them long ago and made them scram!<br/><br/>This made them conclude that the fellow beside the blood refinement fruit was definitely not too strong.<br/><br/>As for why they could sense his actual strength, there were many treasures that concealed his strength.<br/><br/>“You’re courting death!”<br/><br/>Wang Xian saw their attacks and revealed a smile instead.<br/><br/>They didn’t cherish the opportunity that was given to them.<br/><br/>Did they think that they were easy to bully?<br/><br/>Huala<br/><br/>In the next moment, Wang Xian’s figure disappeared in an instant. He appeared directly in front of the level two skeleton that was the master of the universe. His palm grabbed him and a wave of energy completely imprisoned him.<br/><br/>“You don’t know whether you are dead or Alive!”<br/><br/>He said calmly.<br/><br/>“No, no, sir. Don’t kill me. Give me a Chance!”<br/><br/>At this moment, the level two skeleton of the universe dominator was completely dumbfounded!<br/><br/>Such terrifying speed and strength… was he a lord at the level of a universe dominator?<br/><br/>How could he be so terrifying?<br/><br/>How could they provoke such an existence.<br/><br/>“What?”<br/><br/>The other four experts were completely dumbfounded. They looked at this scene in horror and their hearts were pounding violently.<br/><br/>“Run!”<br/><br/>They didn’t hesitate and fled into the distance.<br/><br/>Boom<br/><br/>However, at this moment, an incomparably terrifying aura filled the surroundings.<br/><br/>The space seemed to have frozen. Their bodies were completely frozen and their faces were covered in cold sweat.<br/><br/>“I’ve given you all a Chance!”<br/><br/>Wang Xian said indifferently as he stared at the level two combat strength of the Master of the universe skeleton in front of him.<br/><br/>“Soul Catcher!”<br/><br/>The ghost fire in his pupils dimmed bit by bit.<br/><br/>“Summon the Kingdom of God over.”<br/><br/>Wang Xian ordered faintly.<br/><br/>Buzz<br/><br/>Slowly, an incomparably huge dark kingdom of God slowly appeared at the side.<br/><br/>Whoosh<br/><br/>Wang Xian didn’t wait for it to completely appear before he directly pulled it into the Dragon Palace!<br/><br/>With a wave of his arm, he killed it!<br/><br/>“No, no, no, don’t Kill Us!”<br/><br/>At the side, the bodies of the other four experts were completely restrained. They looked at this scene with fear on their faces as they shouted in despair.<br/><br/>“Soul capture!”<br/><br/>“Summon Your Own Kingdom of God!”<br/><br/>Wang Xian shouted softly. The other four experts immediately fell silent. Before the Kingdom of God appeared, they were pulled into the Dragon Palace by him.<br/><br/>“Hehe, this method is pretty good!”<br/><br/>A smile appeared on Wang Xian’s face.<br/><br/>In such a short period of time, he had reaped such a harvest. It was even faster than searching for treasures everywhere.<br/><br/>“Continue!”<br/><br/>Wang Xian continued to sit there with his legs crossed. Time passed day by day.<br/><br/>The following month was peaceful. No creatures came.<br/><br/>Another month passed. The blood refinement fruit was completely ripe.<br/><br/>Wang Xian looked at the ripe blood refinement fruit. He didn’t pluck it immediately. Instead, he continued to sit there with his legs crossed.<br/><br/>The second blood refinement fruit began to grow.<br/><br/>As time passed, waves of even more mysterious and alluring energy spread out in the surroundings.<br/><br/>Another three months passed. Wang Xian suddenly felt a wave of energy attacking him.<br/><br/>He immediately opened his eyes and headed towards a direction.<br/><br/>It was a blood-red worm. The worm had completely fused with the blood-red plasma surrounding it.<br/><br/>He only felt it when he was in front of Wang Xian.<br/><br/>“PFFT!”<br/><br/>Wang Xian waved his arm and grabbed the worm with his dragon claws.<br/><br/>“Dragon King!”<br/><br/>The voice of the King of water touch was heard. She looked at the worm with the level two combat strength of the Master of the universe.<br/><br/>Wang Xian waved his arm and threw it in front of her.<br/><br/>“Thank you, Dragon King. Thank you, Dragon King!”<br/><br/>She quickly sensed it and swallowed it.<br/><br/>This bug was formed from the blood essence. It had a great recovery effect on her.<br/><br/>Time passed day by day. The second blood refinement fruit was ripe.<br/><br/>The third blood refinement fruit was formed once again.<br/><br/>The two blood refinement fruits were located on this side. The energy emitted from them was getting more and more powerful. One could sense the alluring aura from afar.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Half a month later, figures appeared in Wang Xian’s line of sight!<br/><br/>There were more than a dozen figures. All of them had the combat strength of A Level One universe dominator.<br/><br/>“Leave immediately. I have already taken possession of this fruit!”<br/><br/>Wang Xian said faintly.<br/><br/>“This fruit?”<br/><br/>The more than a dozen figures who flew over saw Wang Xian. Their gazes landed on the fruit and their breathing was slightly hurried.<br/><br/>They could feel the agitation coming from their bodies.<br/><br/>More than ten people looked at each other before their eyes landed on Wang Xian again.<br/><br/>“Disappear from my sight within three seconds!”<br/><br/>Wang Xian issued a second warning.<br/><br/>“The fruit should be ripe. The other party didn’t pick the two ripe fruits. They must have intentionally attracted the demonic skeleton and the desolate beasts. Let’s Go!”<br/><br/>The dozen of them didn’t dare to stay any longer and immediately left this place.<br/><br/>They weren’t stupid. This was a dangerous place in the blood plasma region. The other party dared to sit here with his legs crossed and didn’t pluck the two ripe fruits. He must have attracted the desolate beasts and the demonic skeleton!<br/><br/>After the dozen of them left, Wang Xian closed his eyes.<br/><br/>“What kind of fruit is that? It can actually cause my bloodline to feel a strong throbbing!”<br/><br/>The dozen of them stopped immediately after they left the range of Wang Xian.<br/><br/>They spoke in astonishment.<br/><br/>“I have the same feeling. That fruit is definitely an extremely powerful treasure!”<br/><br/>The eyes of the dozen of them were burning with greed.<br/><br/>“However, that fellow’s strength is definitely not weak. It’s very likely that he has the combat strength of a level two universe overlord or above. Let’s report this matter to the elders in the clan and let them decide!”<br/><br/>The ten or so people hesitated for a moment and said.<br/><br/>Soon, their figures began to fade away!<br/><br/>They belonged to a very powerful race in the devil bone land.<br/><br/>The Devil Witch Race!\t\t\t\t\t\t</div>", "images": {}, "success": true}