{"id": 521, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072943.html", "title": "Chapter 3512 - 3512 The Counterattack Of The 3511 Dragon Palace Had Officially Begun", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3512 - 3512 The Counterattack Of The 3511 Dragon Palace Had Officially Begun</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3512 The counterattack of the 3511 Dragon Palace had officially begun<br/><br/>Boom! Boom! Boom<br/><br/>The sound of destruction reverberated in the sky above the city of Daming. The entire city of Daming was reduced to ruins at a terrifying speed.<br/><br/>A few seconds later, Wang Xian was floating in the sky above the city of Daming. He looked coldly at the city that looked like ruins.<br/><br/>“Is there no one to come and support us?”<br/><br/>Wang Xian mumbled and chuckled.<br/><br/>“Dragon King, there are treasures here. I will go and get them.”<br/><br/>King Aqua Touch’s eyes lit up as he stared at the ruins of Daming city below and shouted at Wang Xian.<br/><br/>“Alright!”<br/><br/>Wang Xian nodded and hovered above daming city.<br/><br/>He didn’t run away immediately. With his current strength, even if the alliance leader of the Hundred Cities Alliance was here?<br/><br/>So what!<br/><br/>With his strength, he could totally fight against him!<br/><br/>As for whether he could kill him, it would depend on the foundation of the Alliance leader of the Hundred Cities Alliance!<br/><br/>King water touch quickly collected the treasures of Daming City. Some water-elemental treasures were directly swallowed into his stomach.<br/><br/>Wang Xian sensed it and did not say anything!<br/><br/>King Water Touch’s current use was higher than the Heaven Array in the Dragon Palace.<br/><br/>After all, he did not have any restrictions when he reached the realm of the universe’s ruler.<br/><br/>It was extremely difficult for the Heaven Array to break through to the realm of the universe’s ruler.<br/><br/>At this stage, it was not a matter of resources, but one’s talent and luck.<br/><br/>Just as the Daming city was destroyed, the 14 cities closest to the Daming city also suffered a terrifying attack!<br/><br/>The attacks of the eight-headed fiend ao crab and the others caused the cities to be destroyed one by one.<br/><br/>Screams of pain spread to the 14 cities!<br/><br/>“Weng Weng Weng!”<br/><br/>Just as the 15 cities of Daming City were being attacked, the 108 mountains near the headquarters of the 100 Cities Alliance started to tremble.<br/><br/>This was a new warning method of the 100 cities alliance.<br/><br/>Once a city experienced a ripple of power at the universe ruler level, the mountains would tremble!<br/><br/>Now, 15 mountains were trembling. This meant that 15 cities were under attack!<br/><br/>Sou Sou Sou<br/><br/>In an instant, figures appeared above the 15 mountains.<br/><br/>The alliance leader of the 100 City Alliance stared at the 15 cities, his eyes shining with a terrifying light.<br/><br/>“15 cities have been attacked. Immediately send reinforcements and kill all the intruders!”<br/><br/>The alliance leader of the Hundred Cities Alliance roared with a dense expression!<br/><br/>“Sou!”<br/><br/>As the sound of his voice faded, he flew towards a mountain peak below.<br/><br/>On that mountain peak, there was a teleportation formation. He landed on the teleportation formation and immediately disappeared.<br/><br/>“Two people in a group, go and assist!”<br/><br/>Around them, there were 20 great beings of the Hundred City Alliance. They looked at each other and growled.<br/><br/>These 20 members were the trusted aides of the alliance leader of the Hundred City Alliance. They were all Level 2 universe masters.<br/><br/>They moved and headed toward the teleportation arrays on the mountain peaks.<br/><br/>As for some cities without support, they couldn’t care less!<br/><br/>Black Cloud City was one of the cities that had been attacked by the experts of the Dragon Palace!<br/><br/>A terrifying energy came from below one of the ruins.<br/><br/>Boom<br/><br/>The surrounding ruins immediately turned into ashes, and the Alliance Master of the Hundred Cities Alliance appeared there.<br/><br/>He sensed his surroundings with a gloomy expression.<br/><br/>At this moment, half of the city had turned into ruins, and two figures were still wreaking havoc in the sky ahead.<br/><br/>That enormous body and terrifying claws. Every time they waved, a large area would turn into ruins.<br/><br/>“A terrifying existence has descended. Let’s Escape!”<br/><br/>At this moment, the two devouring dragons sensed the power of the alliance leader of the Hundred City Alliance. Their expressions changed greatly, and they immediately roared.<br/><br/>Dragon Emperor had warned them to immediately flee the moment they encountered a universe ruler level 3 warrior.<br/><br/>They did not hesitate.<br/><br/>The two devouring dragons began to turn illusory.<br/><br/>“Courting Death!”<br/><br/>The alliance leader of the Hundred Cities Alliance saw the two devouring dragons turn illusory, and his face was filled with rage and blood.<br/><br/>His body shook, and his blood-red eyes on his chest shone with a red light.<br/><br/>A red light fell into the body of a devouring dragon.<br/><br/>However, the red light didn’t seem to have any offensive power, and it didn’t stop the devouring dragon from disappearing.<br/><br/>“Die!”<br/><br/>However, the Alliance Master of the Hundred Cities Alliance didn’t care and roared.<br/><br/>He stretched out an arm, and the red eye on his chest condensed into a ferocious blood eye.<br/><br/>The blood eye disappeared in an instant!<br/><br/>At the same time, the two devouring dragons in the Dragon Palace came back and let out a heavy sigh of relief.<br/><br/>“Ah!”<br/><br/>Suddenly, one of the devouring dragons let out a blood-red cry, and a blood-red eye suddenly appeared in front of him.<br/><br/>The Devouring Dragon’s body began to crumble, turning into blood and instantly dying.<br/><br/>This was the strange ability of Magi!<br/><br/>* Buzz! *<br/><br/>The soul-returning wood on the ancestral tree trembled, and the Devouring Dragon’s soul was absorbed, slowly bearing fruit.<br/><br/>…<br/><br/>“Who are you? How dare you attack the cities of Our Hundred City Alliance? You are courting death!”<br/><br/>At the same time, in another 10 cities.<br/><br/>20 universe rulers and level-two warriors of the Hundred City Alliance rushed over through the teleportation array.<br/><br/>When they saw the two universe rulers and level-two warriors wreaking havoc in the city, their expressions changed drastically, and they roared coldly!<br/><br/>“Hahaha, the Hundred City Alliance doesn’t recognize your grandfather, Dragon Palace? Are the two of you the only ones who came to support us?”<br/><br/>Ba Qi looked at them and sneered coldly.<br/><br/>“Dragon Palace!”<br/><br/>When they heard these two words, their eyes were filled with killing intent.<br/><br/>“Dragon Palace, you are courting death!”<br/><br/>The two great beings of the Hundred City Alliance roared furiously and charged toward Ba Qi and a Devouring Dragon.<br/><br/>“We are courting death! Haha! You are the ones who are courting death! This time, all 15 of your cities will be destroyed!”<br/><br/>Ba Qi laughed maniacally and started to fight with them.<br/><br/>Facing opponents of the same level, they were not afraid at all!<br/><br/>“Roar!”<br/><br/>The Devouring Dragon also roared maniacally and charged over, attacking with its claws.<br/><br/>A city couldn’t withstand the rampage of four universe masters with level-two Combat Power.<br/><br/>Their battle caused the buildings in the city to collapse!<br/><br/>“Run, run!”<br/><br/>“We can’t get close to this level of battle. All disciples, run!”<br/><br/>In the city, some of the surviving disciples and City Masters roared in fear when they saw the battle.<br/><br/>The same thing happened in the other nine cities!<br/><br/>Would the experts of the Dragon Palace be afraid of them if they met someone on the same level as them?<br/><br/>They would fight directly!<br/><br/>Soon, the color of the sky and earth changed in the sky above the cities.<br/><br/>Following that, the cities turned into ruins!<br/><br/>This was a disaster for the experts and disciples in the cities!<br/><br/>As for the city without the support of the Hundred Cities Alliance, it had already turned into ruins.<br/><br/>It was completely wiped out!\t\t\t\t\t\t</div>", "images": {}, "success": true}