{"id": 530, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072961.html", "title": "Chapter 3521 - 3521 3520 Water Touch King’S Upgrade! Go", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3521 - 3521 3520 Water Touch King’S Upgrade! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3521 3520 Water Touch King’s upgrade! Go<br/><br/>The group of experts left, but Wang Xian didn’t care. He sat there with his legs crossed and continued to wait quietly.<br/><br/>Time passed day by day again. In the middle, three reckless demon skeletons arrived and were easily killed by Wang Xian.<br/><br/>However, the strength of these demon skeletons was too weak!<br/><br/>The harvest wasn’t Big!<br/><br/>The third blood refinement fruit was growing rapidly.<br/><br/>The energy emitted by the three fruits filled the surroundings. If Wang Xian did not have sufficient confidence now, he would not dare to act so recklessly!<br/><br/>The allure of the blood refinement fruit was extremely terrifying!<br/><br/>Buzz<br/><br/>Half a month later, Wang Xian was sitting cross-legged. Suddenly, his expression changed.<br/><br/>He hurriedly opened his eyes and scanned his surroundings.<br/><br/>The space around him had changed. At this moment, he was completely in a sea of blood.<br/><br/>The blood refinement fruit was still beside him.<br/><br/>The sudden change made him look solemn.<br/><br/>“What’s the situation?”<br/><br/>He scanned his surroundings with his dragon eyes. His expression was unsightly!<br/><br/>He did not notice the situation around him and was suddenly pulled into this space!<br/><br/>This strange space was somewhat similar to Xiao Lan’s KUN domain!<br/><br/>“Dragon King, be careful. This is a special domain of a desolate beast. Those with such a domain are not weak. It should be a universe ruler level three desolate beast!”<br/><br/>Aqua Touch King’s voice sounded as her three bright eyes scanned the surroundings.<br/><br/>“Dragon King, kill him, kill him!”<br/><br/>At the same time, the king of water tentacles revealed an excited look in her eyes.<br/><br/>This desolate beast should be condensed from blood essence. Once she killed it and devoured it, her strength could possibly be restored to the level of a level three overlord of the universe.<br/><br/>“Can you increase your strength by devouring him?”<br/><br/>Wang Xian squinted his eyes slightly and asked.<br/><br/>“There’s a 70% chance!”<br/><br/>The King of water touch scanned his surroundings and replied.<br/><br/>“Alright!”<br/><br/>Wang Xian’s mind stirred. At his shoulder, the figure of the spirit slowly appeared.<br/><br/>After the spirit swallowed the liquid of life the last time, coupled with Wang Xian’s breakthrough, it fell into a deep sleep.<br/><br/>After nearly two years, it had already recovered.<br/><br/>After absorbing the liquid of life, the spirit was even more powerful in terms of support.<br/><br/>Especially in terms of healing.<br/><br/>At the same time, a shadow on Wang Xian’s body moved.<br/><br/>It was the ghost of the dead!<br/><br/>He didn’t even use the ghost of the dead during the last battle with the Bai Cheng Alliance leader.<br/><br/>At that time, the spirit of the dead had yet to awaken. If he used the ghost of the dead, it wouldn’t be enough to kill the Bai Cheng Alliance leader.<br/><br/>Splash<br/><br/>At this moment, at the front, the Sea of blood condensed into a ferocious two-headed monster. It attacked Wang Xian directly.<br/><br/>“Crash!”<br/><br/>Wang Xian’s figure flashed and his dragon claws attacked the monster instantly.<br/><br/>“Bang!”<br/><br/>The powerful force of the dragon claws struck the side and the monster collapsed immediately. Part of the blood water disappeared and the other part landed in the Blood Sea!<br/><br/>“Crash!”<br/><br/>The moment the two-headed monster disappeared, a tornado formed in the blood sea below and swept towards Wang Xian.<br/><br/>“Dragon King, the entire sea of blood is a part of that monster. Attack the Sea of blood directly!”<br/><br/>King watertouch saw through it and said.<br/><br/>“Alright!”<br/><br/>Wang Xian’s figure flickered as he flapped his incorporeal holy wings. The power of light gathered on the wings and attacked the Sea of blood directly.<br/><br/>Boom<br/><br/>Drops of blood burst out from the Sea of blood instantly and attacked the wings of light.<br/><br/>Boom! Boom! Boom<br/><br/>The sound of collision was heard and Wang Xian’s eyes turned cold.<br/><br/>“You’re courting death!”<br/><br/>“Lingling, assist!”<br/><br/>Wang Xian shouted coldly. He waved his dragon claws and condensed a seed. The seed was thrown downwards.<br/><br/>At the same time, a surge of energy surged into the seed. The seed instantly turned into a huge water lotus and took root in the Sea of blood. It was absorbing the energy of the Sea of blood crazily.<br/><br/>The spirit waved the water lotus staff in her hand. Majestic Wood attribute energy surged into the water lotus.<br/><br/>The absorption speed of the water lotus became even more terrifying.<br/><br/>“Boom! Boom! Boom!”<br/><br/>At this moment, the entire blood sea let out a rumbling sound. Huge waves surged up and covered the water lotus.<br/><br/>“Bang!”<br/><br/>A dull and loud sound was heard. An explosion occurred in the middle of the blood sea. A portion of the blood disappeared.<br/><br/>A shadow from Wang Xian’s body rushed into the blood sea and immediately transformed into the body of the demonic dragon.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The Netherspirit Avatar roared and swept out with his dragon tail.<br/><br/>“Boom!”<br/><br/>The entire blood sea surged. Wang Xian extended his Dragon Claw and transformed it into a radiant dragon claw that clawed downwards.<br/><br/>Similarly, a gigantic blood claw extended out from the blood sea to meet the Radiant Dragon Claw.<br/><br/>“Bang!”<br/><br/>The collision happened and the Blood Claw and the Light Dragon Claw disappeared.<br/><br/>“Crash!”<br/><br/>Wang Xian flapped his incipient saint wings and arrived at the other side of the blood sea in the next moment. His attack headed straight for the blood sea.<br/><br/>The spirit waved the water lotus staff and sent down bolts of lightning!<br/><br/>“Roar! Roar!”<br/><br/>The entire blood sea let out a roar. At this moment, Wang Xian felt that the scene around him had changed.<br/><br/>They reappeared at the land of blood plasma. Nothing around them had changed.<br/><br/>An extremely bright drop of blood was throbbing non-stop. In an instant, it escaped into the distance.<br/><br/>“Dragon King, capture him! capture him!”<br/><br/>King watertouch’s eyes were filled with excitement as he roared loudly.<br/><br/>“We can’t escape!”<br/><br/>Wang Xian’s eyes were glowing. The blood essence of a level three master of the universe was definitely a great tonic.<br/><br/>Any member of the Dragon Palace would be able to upgrade immediately if he were to devour it.<br/><br/>Of course, giving the water-touch King was the best choice.<br/><br/>The void-seeking enemy had already attached itself to this blood essence desolate beast. Wang Xian kept the blood refinement fruit and instantly arrived in front of it. His dragon claws clawed at it.<br/><br/>Under Wang Xian’s speed, those of the same level wouldn’t be able to escape at all!<br/><br/>“Roar!”<br/><br/>The blood essence desolate beast sensed Wang Xian’s speed and let out a furious roar. In the next second, he actually transformed into Wang Xian’s appearance. His arms turned into dragon claws and attacked.<br/><br/>“You’re courting death!”<br/><br/>Wang Xian looked at it with disdain and went forward to meet it.<br/><br/>The Netherworld Ghost appeared from the side and attacked as well.<br/><br/>Two against one!<br/><br/>“Roar!”<br/><br/>When the Blood Essence Desolate Beast saw the netherworld ghost appearing again, it opened its mouth and let out a ferocious roar. Its entire face started to change shape!<br/><br/>“Haha, Die!”<br/><br/>Wang Xian laughed out loud. The spirit waved the water lotus staff and released the branches of the trees!<br/><br/>Under the attack of Wang Xian who had taken out all his trump cards, the blood essence desolate beast was completely suppressed.<br/><br/>“Bang!”<br/><br/>The Dragon Claw collided with the Dragon Claw that he had simulated. The attack of the Netherworld Ghost landed directly on his body.<br/><br/>The branches of the spirit completely wrapped around him.<br/><br/>His body turned into a drop of blood essence once again!<br/><br/>Wang Xian extended his dragon claw and grabbed it in his hand. Waves of energy destroyed his soul power!<br/><br/>“Roar! Roar! Roar!”<br/><br/>Unreconciled roars rang out continuously. The sound became weaker and weaker.<br/><br/>“I’ve made a huge profit!”<br/><br/>Wang Xian sensed that his life force had completely disappeared. His eyes were filled with excitement.\t\t\t\t\t\t</div>", "images": {}, "success": true}