{"id": 533, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072967.html", "title": "Chapter 3524 - 3524 3523, The Source Of The Curse", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3524 - 3524 3523, The Source Of The Curse</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3524 3523, the source of the curse<br/><br/>Wang Xian’s Dragon Claw once again penetrated Wu Gui’s chest.<br/><br/>On his bamboo hat, the dark fog had disappeared, revealing an extremely pale and aged face!<br/><br/>At this moment, his eyes were filled with despair.<br/><br/>“Stop! If you dare to kill Wu Gui, my demonic shaman clan will definitely tear you into pieces and never let you reincarnate!”<br/><br/>Seeing Wang Xian’s hand piercing through Wu Gui’s body, sorcerer Li’s expression changed drastically as he roared furiously.<br/><br/>He had never expected that this opponent would be so terrifying!<br/><br/>He could actually defeat Wu Gui so easily!<br/><br/>If he had not alerted the enemy, this might not have been the outcome.<br/><br/>However, at this moment, it was no longer the time for him to regret. At this moment, he had to save Wu Gui!<br/><br/>He was one of the only three masters of the universe with level-three combat strength!<br/><br/>However, he was his best friend, an intimate partner who had fought side by side with him for billions of years!<br/><br/>“Let him go and I will compensate you with treasures!”<br/><br/>The wizard shouted sternly again!<br/><br/>“Hehe, if you want to kill me, you have to be prepared to die. Demon Wizards, you are courting Death!”<br/><br/>When Wang Xian heard his words, a cold and disdainful expression appeared on his face.<br/><br/>After being defeated, he was begging for mercy and sparing his life?<br/><br/>How could such a good thing happen!<br/><br/>Buzz<br/><br/>Wang Xian moved his Dragon Claw and the destructive force charged toward Wu Gui’s body.<br/><br/>Wizards who leaned toward formations were relatively weaker in terms of their physical bodies!<br/><br/>However, Wu Gui was strong enough. He even had a skeleton who could die in his place. He also had many trump cards.<br/><br/>Unfortunately, he had met Wang Xian!<br/><br/>Wang Xian was fighting against three people of the same level. He relied on his ghost clone and his spirit. It wouldn’t be a big problem for him to fight against five people!<br/><br/>Under such circumstances, he could easily kill Wu Gui by approaching his body.<br/><br/>If it wasn’t for his spirit, Wu Gui might have already escaped!<br/><br/>“You’re courting death!”<br/><br/>The Magus sensed that Wu Gui’s life force had disappeared. His eyes were blood-red as four terrifying monsters attacked Wang Xian.<br/><br/>“You’re courting death!”<br/><br/>He had dealt with it. Wang Xian could easily suppress a sorcerer when facing this one.<br/><br/>He flapped his incipient saint wings and instantly arrived at the side. His dragon claws clawed at him.<br/><br/>“Damn it, his speed is too fast. I’m not his match!”<br/><br/>Sorcerer Li sensed Wang Xian’s speed and his pupils constricted slightly. He gritted his teeth and the golden skull emitted a luster.<br/><br/>He didn’t Dodge. Instead, he charged straight at Wang Xian.<br/><br/>“Boom!”<br/><br/>The head and the Dragon Claw collided violently. Wang Xian revealed an astonished expression.<br/><br/>His golden skull actually caused blood to ooze out from Wang Xian’s palm.<br/><br/>“This powerful sorcerer from the demon shaman clan is not simple either. However, he is still far from it.”<br/><br/>Wang Xian’s eyes revealed a cold look. He flapped his incipient saint wings and attacked him again in an instant.<br/><br/>“Die!”<br/><br/>At this moment, the Wizard roared and threw out a skeleton. This skeleton was stained with a blood-red energy and exuded a terrifying aura!<br/><br/>When Wang Xian saw it, he quickly dodged to the side.<br/><br/>Buzz<br/><br/>However, the next moment, to his surprise, the Wizard with the combat strength of A Level 3 universe Knight of the Demonic Wizard clan slowly turned illusory!<br/><br/>? ? ? ?<br/><br/>Wang Xian watched his figure disappear, and a speechless expression appeared on his face.<br/><br/>He escaped!<br/><br/>This guy actually escaped!<br/><br/>Wang Xian thought he was going to fight him!<br/><br/>He shook his head and swept his gaze across the surroundings. When the other experts of the demonic wizard clan saw them fighting, they had already escaped!<br/><br/>“TSK TSK, another corpse with the combat strength of A Level 3 universe dominator. It can allow the strength of the Heaven Array to have a breakthrough!”<br/><br/>Wang Xian’s eyes sparkled with excitement.<br/><br/>After the breakthrough of the Heaven Formation, coupled with the fact that the king of water tentacles was about to regain his combat strength of a level three universe dominator, the Dragon Palace would have three level three universe Dominators with combat strength.<br/><br/>“When the time comes, I can charge straight into the Hundred City Peak. Even if he sets up a formation there, I will be able to destroy them completely.”<br/><br/>Wang Xian’s eyes were flashing with killing intent.<br/><br/>“However, the demon witch clan…”<br/><br/>He mumbled to himself as a contemplative look appeared on his face.<br/><br/>Wang Xian knew a little about the strength of the demon witch clan. There were three masters of the universe with level three combat strength in the clan. This number was more than that of the spirit demon clan.<br/><br/>It seemed that there were only two spirit demon clans!<br/><br/>Now that he had killed one demon witch, there were still two more left.<br/><br/>“Should I attack the demon shamans?”<br/><br/>He thought that he could give it a try.<br/><br/>However, if he wanted to give it a try, he would have to wait for the strength of the water touch king and the sky array to break through!<br/><br/>Let’s talk about it in the future!<br/><br/>His body moved, and he flew down again.<br/><br/>This time, he did not go to the previous position, but found a secret place.<br/><br/>Currently, the King of Water Touch and the Heaven Formation had yet to break through completely. In order to prevent the demon witches from making a comeback, he had to avoid their attacks slightly.<br/><br/>Arriving at a relatively secret location, the ancestral tree dived into the ground once again. The third blood-refining fruit continued to grow.<br/><br/>Just as Wang Xian was waiting for the third fruit to ripen once again.<br/><br/>There were many sinister and mysterious domains located in the land of the demon bones.<br/><br/>The entire domain was covered by a black formation. In the sky, the silhouettes of skulls were flying. Their eyes were emitting a blood-red glow.<br/><br/>The entire area was like hell. It was eerie and terrifying!<br/><br/>Within the formation in this area, one could vaguely see the castles.<br/><br/>These castles looked extremely ancient. There were even strange symbols drawn on them!<br/><br/>“Wu Gui was actually killed?”<br/><br/>In the middle of the empty space, there stood a castle. Within the castle, there was a skeleton-like figure holding a staff, looking at a divine tablet in his hand and growling in a low voice.<br/><br/>His voice was filled with terrifying fury!<br/><br/>“Clan leader, that Guy’s speed is too terrifying, and he has a strange clone. We are completely no match for him.”<br/><br/>Magus Li stood in front of the staff skeleton and reported with his head lowered.<br/><br/>“Damn it, Wu Gui fought side by side with us for billions of years and was actually killed. We must take revenge!”<br/><br/>The clan leader of the Magic Wizard clan roared with a sinister expression.<br/><br/>“Clan leader, if we want to take revenge, we must be fully prepared. The other party is very strong.”<br/><br/>The sorcerer said in a deep voice.<br/><br/>The enemy was not only very powerful, but also terrifying.<br/><br/>They could not understand why such a terrifying level 3 universe ruler had appeared in the land of the Devil Bones.<br/><br/>“Do you have any items on him?”<br/><br/>The clan leader of the Devil Witch Clan, Ghost Fire, stared at him and asked.<br/><br/>“Items?”<br/><br/>The wizard Li’s golden skull was shining and he stretched out his arm. “Leader, I have a bolt of energy that he put on me, Lightning!”<br/><br/>As he spoke, a bolt of lightning jumped on his palm and almost merged with a drop of his blood.<br/><br/>This was the power of the void.<br/><br/>He found that it would take some time for this bolt of lightning to be destroyed.<br/><br/>“Alright, that’s enough. Then kill him with a curse!”<br/><br/>The clan leader of the witchcraft clan said coldly.\t\t\t\t\t\t</div>", "images": {}, "success": true}