{"id": 536, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072973.html", "title": "Chapter 3527 - 3527 3526 Demon Extinguishing Wizard", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3527 - 3527 3526 Demon Extinguishing Wizard</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3527 3526 demon extinguishing wizard<br/><br/>The Dark Sphere was located in the sky above the castle. It was emitting a dark luster!<br/><br/>Crack Crack Crack<br/><br/>Roar Roar Roar<br/><br/>At this moment, the position in the sky had undergone an earth-shattering change!<br/><br/>The skulls that were suspended in the sky were surging crazily into the dark sphere.<br/><br/>At the same time, dark energy was attacking Wang Xian one after another.<br/><br/>Boom! Boom! Boom<br/><br/>The terrifying energy and its terrifying power made Wang Xian’s eyes freeze!<br/><br/>Crash<br/><br/>He flapped his incipient saint wings and easily dodged the attacks of the dark energy.<br/><br/>However, the dark energy seemed to have a tracking ability. It formed an encirclement and attacked Wang Xian.<br/><br/>Boom<br/><br/>More than a dozen dark spheres surrounded Wang Xian and exploded. They charged toward Wang Xian who was in the middle.<br/><br/>“Attacking the nest of the formation wizards is really troublesome!”<br/><br/>Wang Xian’s body trembled as he was surrounded by layers of defense!<br/><br/>The king of water tentacles also released his defense.<br/><br/>If Wang Xian was the only one defending, he would definitely be injured!<br/><br/>This attack power was equivalent to three Wang Xian attacking at the same time.<br/><br/>Wang Xian’s current advantage was his speed. In terms of defense, he was about the same level as the king of water tentacles.<br/><br/>In the face of an all-encompassing attack, there was nothing he could do!<br/><br/>However, he had the king of water tentacles by his side!<br/><br/>He was once the true ruler of the universe!<br/><br/>The two of them formed a defense around them and easily blocked the attack of this formation!<br/><br/>“You still dare to attack me. Today, I will bury you here. Die!”<br/><br/>At this moment, the wizard who was emitting golden light rushed over from below. He was roaring furiously.<br/><br/>His pupils were emitting a golden glow as he charged towards Wang Xian.<br/><br/>“HMPH, you dare to use a curse to kill me? Today will be the day that your demonic wizard clan will be exterminated!”<br/><br/>Wang Xian snorted coldly. His netherspirit clone appeared and attacked the Wizard.<br/><br/>The clone with the combat strength of a level three universe dominator was not at a disadvantage against a wizard with the same level three combat strength.<br/><br/>“Spirit Spirit!”<br/><br/>Wang Xian growled. The accompanying spirit spirit appeared by his side. It flapped its small wings and held the water lotus staff!<br/><br/>“Expel!”<br/><br/>Spirit Spirit looked at the surrounding darkness. She waved her staff and formed a space!<br/><br/>In this space, Wang Xian realized that his speed could be a little faster.<br/><br/>“TSK TSK, the accompanying spirit!”<br/><br/>The king of water tentacles couldn’t help but look at the spirit. She flew to the side from Wang Xian’s side and her body expanded to about ten meters.<br/><br/>She waved her tentacles one by one. There wasn’t any aura of a space beast on her body, and no one would associate her with a space beast!<br/><br/>“Kill!”<br/><br/>Wang Xian moved his body and attacked the castle directly.<br/><br/>“Roar! Roar! Roar!”<br/><br/>At this moment, a gigantic skull flew out from the dark sphere above the castle.<br/><br/>This skull was formed from countless small skulls. It was more than 10,000 meters in size and contained darkness and flames!<br/><br/>“How dare you attack our demon witches! Die!”<br/><br/>It roared and attacked Wang Xian and the rest.<br/><br/>“Dragon King, leave this guy to me!”<br/><br/>The king of water tentacles let out a low roar and attacked the gigantic skull with his tentacles.<br/><br/>The Space Beasts did not have a divine kingdom. Their strongest strength was their physical bodies.<br/><br/>They used their physical bodies as their divine kingdom. They possessed strange innate attacks and powerful strength.<br/><br/>“Roar! Roar!”<br/><br/>The skull roared and spat out black flames that enveloped the water-tentacle king.<br/><br/>“Little Magus, I’ll kill you today!”<br/><br/>The water-tentacle king roared, and water energy appeared on one of her tentacles. Her tentacles grew crazily and drilled towards the skull’s pupils.<br/><br/>How big was the body of the water-tentacle king at her peak?<br/><br/>It was no exaggeration to say that it was the size of more than ten stars.<br/><br/>In fact, when her tentacles were transformed, they could reach hundreds of millions of kilometers. She was practically invincible.<br/><br/>Although she had yet to recover from her serious injuries, she possessed the realm and combat ability of a ruler!<br/><br/>The tentacles easily passed through the flames and the tiny droplets of water energy protected her.<br/><br/>Boom<br/><br/>When the king of water tentacles was fighting with the skull, Wang Xian flapped his godless holy wings and instantly arrived above the castle.<br/><br/>The dragon tail appeared behind him and swept out.<br/><br/>Rumble<br/><br/>In an instant, more than half of the castle began to collapse!<br/><br/>“Not good. Three Masters of the universe with level three combat strength. That Demon Beast is extremely terrifying!”<br/><br/>At the same time, the leader of the Demonic Wizard clan, who was located in the center of the castle, saw Li being restrained by the Demon Beast. When he saw his formation being restrained by the Demon Beast and Wang Xian attacking him, his expression changed drastically!<br/><br/>“In the name of the king of skeletons, in the name of the father of skeletons, I summon you, the Skeleton Army, to destroy the enemy!”<br/><br/>The leader of the Demonic Wizard clan had an ugly expression on his face. He raised his head and raised the skeleton staff in his hand. His body rose slowly and he chanted loudly.<br/><br/>“Hualala!”<br/><br/>As he chanted and as the energy in his body spread downwards, the entire world seemed to have woken up, as if it had undergone an earth-shaking change.<br/><br/>At the position below, sleeping skeletons crawled out one after another. There was no end to them.<br/><br/>The skeleton clan was best at Army tactics.<br/><br/>Bug tactics!<br/><br/>Different from the Angel Army, their army was much larger.<br/><br/>Within a radius of hundreds of millions of kilometers, there were skeletons.<br/><br/>They emerged from the skeletons below. Their palms were emitting a strange dark luster.<br/><br/>“Huh?”<br/><br/>Wang Xian looked down and saw the skeletons. His gaze focused slightly.<br/><br/>Real skeletons!<br/><br/>If an ant wanted to bite an elephant to death, it first had to be able to break through the elephant’s defense.<br/><br/>It was the same for the weak to fight against the strong!<br/><br/>However, the real skeletons had an ability called armor-piercing!<br/><br/>Their bodies could easily penetrate the strong defense!<br/><br/>That was because they were skeletons, possessing corrosion and sharpness!<br/><br/>The Sea of skeletons of the skeleton clan was extremely difficult to deal with!<br/><br/>The number of skeletons was so huge that they could kill those who were stronger than them.<br/><br/>Wang Xian didn’t expect that the leader of the demon witch clan actually possessed a sea of skeletons.<br/><br/>No wonder there weren’t any castles around his castle. No wonder this place was extremely spacious!<br/><br/>It turned out that there was a skeleton navy corps below!<br/><br/>“Nine dragons formation, destroy!”<br/><br/>However, when this group of skeletons appeared, the formation of the Heaven Formation was already completed.<br/><br/>He swept his gaze over the surrounding skeletons and the formation descended.<br/><br/>“Roar Roar Roar!”<br/><br/>Nine Divine Dragons descended from the sky above the witch tribe and swept towards the sea of skeletons.<br/><br/>Each divine dragon had a body that was a million kilometers in size and emitted a terrifying dragon might.<br/><br/>Dragon tail swept, countless skeletons directly destroyed!\t\t\t\t\t\t</div>", "images": {}, "success": true}