{"id": 531, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072963.html", "title": "Chapter 3522 - 3522 3521 Water Touch King’S Upgrade! Down", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3522 - 3522 3521 Water Touch King’S Upgrade! Down</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3522 3521 Water Touch King’s upgrade! down<br/><br/>The drop of blood essence quickly lost its life force.<br/><br/>Water Touch King stared at the drop of blood essence with excitement!<br/><br/>The energy contained within the blood essence could allow it to recover a little.<br/><br/>It had already devoured all the water elemental resources in Daming City, and it had also devoured the blood essence of the blood essence desolate beast.<br/><br/>This blood essence desolate beast, which had the combat strength of a level three universe overlord, was almost done!<br/><br/>“Here!”<br/><br/>Wang Xian placed the corpse of the blood essence desolate beast in front of the water touch king.<br/><br/>She opened her mouth and immediately devoured it. Her eyes revealed an extremely excited expression.<br/><br/>“Dragon King, when I have completely recovered, I will protect you. When that time comes, we will be able to kill Gods, Buddhas, and Buddhas!”<br/><br/>The king of water touch let out an excited roar. Then, her body moved and disappeared in an instant.<br/><br/>She wanted to return to the divine kingdom and completely digest the corpse of this blood essence desolate beast!<br/><br/>A smile appeared on Wang Xian’s face.<br/><br/>This time around, he originally wanted to upgrade the five elements millstone or the Tai Chi Dragon Disc. He didn’t expect that he would be the first to upgrade the king of Water Touch!<br/><br/>However, there were huge benefits to upgrading the water touch king. In fact, this benefit was even greater than upgrading the five elements Millstone!<br/><br/>“My Luck this time is pretty good. Looks like the blood refinement fruit can indeed attract dire beasts and demonic skeletons!”<br/><br/>Wang Xian mumbled. His body moved and he sat cross-legged underground again.<br/><br/>Three blood refinement fruits appeared at the side. The third one was not fully ripe yet.<br/><br/>A wave of seductive energy that belonged to the blood-refining fruits spread out in all directions.<br/><br/>Just as Wang Xian was sitting cross-legged again and preparing to use the blood-refining fruits to attract the desolate beasts and demonic skeletons, more than a dozen figures flew over from the sky above the blood plasma land!<br/><br/>Among these dozen figures, there was one in the middle that was completely shrouded in darkness. He was wearing a bamboo hat on his head, so his true appearance could not be seen clearly.<br/><br/>The other dozen figures were human figures, but some of their bodies had already changed.<br/><br/>Three of them had skeletal limbs, and they looked very strange.<br/><br/>They were members of the demon witch clan.<br/><br/>The overall strength of the demon witch clan was not weaker than that of the spirit demon clan, and was even slightly stronger.<br/><br/>The difference was that the demon witch clan might not have the background of the spirit demon clan.<br/><br/>Even so, the Demon Wizard clan was still a huge force here.<br/><br/>Their top-tier combat power was slightly stronger than the Hundred City Alliance.<br/><br/>“Is it right below the blood plasma land?”<br/><br/>The figure wearing the bamboo hat said.<br/><br/>“Yes, Lord Wu Gui, it’s right below!”<br/><br/>A universe ruler level one combat power sorcerer immediately responded.<br/><br/>“Go Down!”<br/><br/>Wu Gui said indifferently, and with a flash of his body, he flew down.<br/><br/>A group of Demon Wizard clansmen immediately followed behind him.<br/><br/>Out of the 13 subordinates, only three were Level 1 universe ruler Magi. These three were the ones who had led the way last time.<br/><br/>The other 10 were all Level 2 universe ruler Magi.<br/><br/>As a magus, their combat power was extremely terrifying and strange.<br/><br/>“Lord Wu Gui, he’s right ahead!”<br/><br/>The three magi pointed ahead. “The other party might be a level 3 universe overlord, please be careful!”<br/><br/>“I can already feel an alluring energy fluctuation. This energy is extremely beneficial to the bloodline!”<br/><br/>At this moment, a blood red blazing light suddenly erupted from Wu Gui’s black bamboo hat.<br/><br/>He stared at the area below and slightly clenched his fist.<br/><br/>Obviously, this alluring aura made him very excited!<br/><br/>“The other party dared to use such a treasure as bait. His power should be at the level of a level three universe ruler!”<br/><br/>Wu Gui muttered, his tone carrying a grave expression.<br/><br/>“Lord Wu Gui, then do we still need to get the clan leader and the others to come over?”<br/><br/>A great being of the Demon Wizard clan asked.<br/><br/>“I’ll call your Lord Li over. You can set up an array formation here and completely lock the enemy in this area!”<br/><br/>Wu Gui nodded. “Lord Li, with our power, we can easily kill a level 3 universe ruler with our array formation!”<br/><br/>There were both those who specialized in arrays and those who specialized in bloodlines and bodies!<br/><br/>Wu Gui belonged to the category of Great Beings.<br/><br/>One of the great benefits of an array was that once an array was set up in advance, it could easily deal with two or three beings of the same level.<br/><br/>And the Li He was talking about was one who specialized in bloodlines and bodies!<br/><br/>Lord Li was assisted by the 10 Level 2 universe rulers, so Wu Gui was confident that he could easily kill the other party<br/><br/>“Yes, my Lord!”<br/><br/>The Great Beings of the demon witch clan immediately responded, and the 10 Level 2 universe masters immediately started to set up the array.<br/><br/>At this moment, Wu Gui set up a teleportation array in front of him and took out the universe AI.<br/><br/>In less than a few minutes, a figure appeared in the teleportation array.<br/><br/>It was a great being of the demon witch clan with a golden skull and blood-red limbs.<br/><br/>He was the demon witch clan’s Li!<br/><br/>There was only one word, Li!<br/><br/>Lord Li of the Demon Witch clan!<br/><br/>All the top-tier experts of the demon witch clan, except for the clan leader, had arrived!<br/><br/>“I Smell the aura of a treasure. A supreme treasure that can help improve one’s bloodline. It’s definitely a supreme treasure!”<br/><br/>The moment he appeared, his body began to tremble.<br/><br/>He looked down with a burning gaze, and his body was restless.<br/><br/>His four limbs seemed to be flowing with blood.<br/><br/>“Hehe, it’s definitely a rare treasure,”Wu Gui said. “But the opponent might be a level-three universe master. I need to make some preparations!”<br/><br/>Wu Gui laughed, and his voice was gloomy!<br/><br/>“Sure.”<br/><br/>Li nodded, “Wait for us to investigate the situation, to prevent him from leaving!”<br/><br/>“HM? Don’t alert the enemy!”<br/><br/>Wu Gui reminded indifferently.<br/><br/>“Hehe!”<br/><br/>The ghost fire in Li’s pupils jumped, carrying a strong sense of confidence.<br/><br/>He moved his palm, and a drop of blood on his palm turned into the shape of a desolate beast, directly drilling down.<br/><br/>Wu Gui took a glance and was very confident in Li’s methods.<br/><br/>His body moved and he began to set up an array formation around him. Once the array formation enveloped him, he was 100% confident that he would be able to obtain the treasures below.<br/><br/>As for that expert, if he dared to resist, he would kill him immediately!<br/><br/>Wang Xian sat cross-legged at the seat below and waited quietly for the desolate beast and demon skeleton to take the bait. He did not know that there were already experts eyeing him from above.<br/><br/>He didn’t expect that the dozens of figures that he let go would call over so many experts.<br/><br/>Buzz<br/><br/>“Dad, something is coming. It’s watching us!”<br/><br/>However, at this moment, Lingling’s voice suddenly rang in his mind, causing Wang Xian to be slightly stunned.<br/><br/>“Eh? Lingling, did you sense it?”<br/><br/>“Yes, Dad. It’s a drop of blood.”<br/><br/>Lingling confirmed it once again!<br/><br/>Ever since the last time Lingling devoured the liquid of life, she had obtained some additional abilities.<br/><br/>In terms of some special senses, she was even stronger than Wang Xian!\t\t\t\t\t\t</div>", "images": {}, "success": true}