{"id": 538, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072977.html", "title": "Chapter 3529 - 3529 3528 Demon Witch Clan’S Treasure!", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3529 - 3529 3528 Demon Witch Clan’S Treasure!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3529 3528 Demon Witch Clan’s treasure!<br/><br/>“Innate supreme treasure, it’s actually an innate supreme treasure!”<br/><br/>Wang Xian moved and instantly came to the side of the innate supreme treasure. He stared at the dark corpse with burning eyes.<br/><br/>Innate supreme treasure, this kind of treasure was the top-tier weapon in the universe.<br/><br/>The treasure of the Heaven’s origin creation only existed in legends!<br/><br/>A treasure of the innate supreme treasure level was something that even the real masters of the universe would find hard to possess.<br/><br/>For example, the demon witch clan only had this one innate supreme treasure in their entire clan!<br/><br/>The Demon Witch clan was much stronger than the Hundred Cities Alliance.<br/><br/>For a relatively powerful high-level clan to only possess an innate supreme treasure, one could imagine how precious it was.<br/><br/>“The source of the curse, the demon’s corpse!”<br/><br/>Wang Xian sized up this innate supreme treasure as his eyes sparkled.<br/><br/>This was the name of this innate treasure.<br/><br/>Wang Xian could also sense some of the functions of this innate treasure.<br/><br/>“I was almost killed by the curse. It’s the ability of this devil’s corpse. It’s Too Strange!”<br/><br/>Wang Xian mumbled. Just by using a bolt of lightning that he released, he almost took his life.<br/><br/>If there was a piece of flesh and blood, wouldn’t it be able to kill him directly.<br/><br/>How could someone of the same level block it?<br/><br/>It was simply killing without a trace!<br/><br/>Unfortunately, Wang Xian could not use this innate treasure. This required some abilities of a wizard!<br/><br/>He could not use it yet.<br/><br/>Furthermore, as it was an innate treasure, it was impossible for him to absorb it even if he wanted to.<br/><br/>That was because it was too strange and powerful!<br/><br/>Wang Xian kept it away.<br/><br/>“No!”<br/><br/>At this moment, another scream was heard.<br/><br/>Wang Xian looked over and saw that the king of water tentacles had joined hands with his netherspirit avatar to kill the level three master of the Demon Witch Race!<br/><br/>The remaining two level three masters of the demon witch race were all killed.<br/><br/>This made him smile.<br/><br/>“How dare you invade Our Demon Witch Race? You are courting death!”<br/><br/>“Lord Li!”<br/><br/>At this moment, the great disciples of the Demon Witch clan rushed over from the surrounding areas.<br/><br/>They were led by more than 20 Level 2 universe masters.<br/><br/>When they arrived, they happened to see their Lord Li being killed.<br/><br/>When they saw this scene, their expressions changed drastically.<br/><br/>“What a coincidence!”<br/><br/>SKY array swept his gaze over them. With a wave of his arm, the array formations enveloped them.<br/><br/>“Run, run, run! Lord Li and the others are dead, and the clan leader is doomed!”<br/><br/>“Run, run!”<br/><br/>Feeling the power of sky array, the Great Beings from the demon witch clan who had rushed over were completely dumbfounded!<br/><br/>F * ck…<br/><br/>This… why did the clan leader call them over?<br/><br/>Were they courting death?<br/><br/>Lord Li was killed, and the clan leader’s aura couldn’t be sensed anymore!<br/><br/>There were only three terrifying enemies with the power of a universe ruler at level three.<br/><br/>Why didn’t they flee here?<br/><br/>Were they waiting to die?<br/><br/>When they came, they weren’t as fast as when they fled now!<br/><br/>“Imprison them!”<br/><br/>Water touch emperor roared, “All of you, stay here!”<br/><br/>Her body shook, and Wisps of water mist spread out in all directions.<br/><br/>After the mist enveloped her, the entire world seemed to be frozen.<br/><br/>“What kind of strange ability is this!”<br/><br/>The powerful warriors of the demon witch clan trembled, their faces filled with fear.<br/><br/>The others didn’t pay any attention to them, fleeing for their lives.<br/><br/>Out of the 20 or so level 2 universe masters, 10 of them were enveloped by the mist, struggling violently.<br/><br/>It was as if they had fallen into a swamp, and it was very difficult for them to even move a single step.<br/><br/>“They are still too weak. More than half of them escaped!”<br/><br/>Water Touch Emperor was not very satisfied with his attack.<br/><br/>“Water Touch Emperor, you are already very powerful!”<br/><br/>When Tian Chen saw this terrifying attack, his eyes revealed a look of reverence.<br/><br/>With this power, he was definitely not a match for water touch emperor.<br/><br/>The Space Beast’s terrifying innate ability attack was too powerful!<br/><br/>Sky Array moved and killed ten great beings of the Demon Wizard clan.<br/><br/>Other than that, there were dozens of Level 1 universe masters and a group of wizards below the level of universe masters.<br/><br/>There were more than 100,000 of them.<br/><br/>Sky array easily killed them and put them into the Dragon Palace.<br/><br/>This was another huge amount of resources.<br/><br/>“Hahaha, Dragon King, it’s easy to kill them!”<br/><br/>King watertouch laughed loudly and flew towards Wang Xian.<br/><br/>During the battle just now, when the clan leader of the demon witch clan died, the condensed skull automatically lost its combat ability.<br/><br/>This was also the reason why King watertouch was able to spare the time to kill the wizard Li.<br/><br/>“The clan leader of the demon Shaman Clan has been killed. Search this place and see if there are any treasures.”<br/><br/>Wang Xian spoke to him.<br/><br/>“It’s the Dragon King. Leave this job to me!”<br/><br/>King watertouch’s eyes were burning with passion as he began to search immediately.<br/><br/>The nest of the demon Shaman clan would definitely have a lot of treasures. After all, such a force was much stronger than the Hundred Cities Alliance.<br/><br/>“Dragon King, there’s a divine kingdom over here!”<br/><br/>Soon, King watertouch discovered the Divine Kingdom of the clan leader of the demon Shaman Clan. He shouted at Wang Xian.<br/><br/>“All the treasures should be in his divine kingdom!”<br/><br/>Wang Xian swept his gaze across the surroundings and immediately flew towards King watertouch’s location.<br/><br/>Swoosh<br/><br/>At this moment, the Heaven Formation flew over as well.<br/><br/>There was an entrance at the bottom of the palace. Beneath the entrance was an incomparably huge divine kingdom.<br/><br/>At this moment, the energy of the divine kingdom was a little dim. The king of water touch had already entered it.<br/><br/>He entered it directly and immediately felt a surge of majestic energy.<br/><br/>It was the Divine Kingdom of the clan leader of the demon witches!<br/><br/>The entire divine kingdom was not big, but it was not small either. It was similar to the castle above.<br/><br/>There were many precious divine herbs and divine trees planted in the land of demonic bones.<br/><br/>“Dragon King, the Treasury is here!”<br/><br/>The voice of the King of water touch was heard. Wang Xian immediately flew over and came to the front of the Divine Kingdom’s treasury.<br/><br/>They entered the treasury and scanned the interior.<br/><br/>“There are so many innate spiritual treasures. Most of them are of the darkness attribute. These ten or so innate supreme treasures should be able to upgrade the Taiji Dragon Plate.”<br/><br/>He muttered to himself and continued walking inside.<br/><br/>Other than weapons, there were also some very special treasures.<br/><br/>There was even a high-tech Mech here. The energy and power of this mech was comparable to a Level 1 universe ruler.<br/><br/>“HM? What a coincidence!”<br/><br/>At this moment, a familiar energy came over. Sensing this energy, he immediately walked over.<br/><br/>On the table on the right, there was a blood-red skeleton leg and four blood-red fingers.<br/><br/>This skeleton leg was clearly the same as the pink skeleton that Wang Xian had obtained before.<br/><br/>He didn’t expect that there would be a part of the pink skeleton in the witch clan!<br/><br/>This part was an extremely precious treasure to the red bones of the spirit demon race.<br/><br/>According to them, if they could gather all the red skeleton parts, they might be able to open the door to the universe master level.\t\t\t\t\t\t</div>", "images": {}, "success": true}