{"id": 535, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072971.html", "title": "Chapter 3526 - 3526 3525 Demon Slayer", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3526 - 3526 3525 Demon Slayer</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3526 3525 demon Slayer<br/><br/>Weng<br/><br/>Time passed day by day, and the third blood refinement fruit gave off a mysterious and alluring energy.<br/><br/>It had matured!<br/><br/>When the third blood refinement fruit matured, a terrifying water attribute energy spread out from the Dragon Palace.<br/><br/>The array formation above the suppressed Dragon Palace started to crumble bit by bit.<br/><br/>“Buzz!”<br/><br/>“I can’t destroy the formation that is suppressing the dragon palace outside. Haha, I, the King of water tentacles, have recovered my combat strength to the third level of a universe dominator. Baili Bird Man, just you wait. I will pluck the bird feathers off your body before long.”<br/><br/>The king of water tentacles roared in excitement. Her body moved and disappeared in a flash.<br/><br/>The next moment, she appeared on Wang Xian’s shoulder.<br/><br/>As the water-tentacle king had become Wang Xian’s battle pet, she was able to appear directly in front of Wang Xian.<br/><br/>“Have you reached the third level of the Universe Dominator?”<br/><br/>Wang Xian saw the appearance of the octahedron and sensed the energy contained in its body. His eyes lit up as he asked.<br/><br/>“Yes, Dragon King!”<br/><br/>The water-tentacle king nodded. His eyes shone with excitement.<br/><br/>“Very well, let’s Go!”<br/><br/>Wang Xian smiled and kept the ripe blood refinement fruit.<br/><br/>He brought King Aqua Tentacle with him and flew out immediately.<br/><br/>“Dragon King, where are we going? Are we going to the Hundred Cities Alliance? My current strength has already broken through. I can definitely kill them!”<br/><br/>King Aqua Tentacle said confidently.<br/><br/>Now, even if she were to barge into the hundred cities peak, she was confident that she could kill the other party.<br/><br/>Of course, it would be a little difficult to kill the other party.<br/><br/>After all, he was a formation wizard.<br/><br/>However, with Wang Xian’s words, they were 100% confident.<br/><br/>“No, we are going to destroy the Demon Wizard clan!”<br/><br/>Wang Xian shook his head and said.<br/><br/>“Demon Wizard clan? It sounds like they are looking for destruction. However, the other party should be of the darkness attribute. No, no, it would be great if they were of the water attribute.”<br/><br/>King Aqua Tentacle muttered.<br/><br/>Wang Xian flew towards the Spellcaster clan quickly.<br/><br/>The Spellcaster clan was located in the land of bones and was not very close to the land of plasma.<br/><br/>Even he would need ten days to fly.<br/><br/>However, these ten days were just enough for heaven’s formation to achieve a complete breakthrough in its strength.<br/><br/>The Spellcaster clan lived in the land of bones. There were two types of spellcaster: skeleton and human spellcaster.<br/><br/>The human dark spellcasters occupied most of the land of the spellcasters. However, according to the information in the universe’s AI, the Chief of the spellcasters was a skeleton spellcasters.<br/><br/>However, regardless of what they were, Wang Xian had to destroy them this time.<br/><br/>After ten days of flying, Wang Xian arrived at the area in front of the spellcasters.<br/><br/>Just like the spirit spellcasters, they also had a city that was open to the public.<br/><br/>There were a large number of skeletons in the city as well as other powerhouses who came to the land of demonic bones.<br/><br/>When Wang Xian entered the city, he realized that this city was completely different from the city of the spiritual demon race.<br/><br/>The city of the spiritual demon race was made up of skeletons.<br/><br/>And here, there were many castles.<br/><br/>He raised his head and looked at the sky. He noticed that the skulls were emitting a blood-red glow. They were flying in the sky as if they were patrolling.<br/><br/>There were many of these skulls. The range of the skulls was as wide as the eye could see.<br/><br/>“The strongest universe knight is at the peak level. His combat strength has not even reached the first level of the Universe Dominator.”<br/><br/>Wang Xian looked at the skulls patrolling in the sky and muttered.<br/><br/>“An lie, bring the heaven array over!”<br/><br/>The strength of the Heaven Array had already made a breakthrough and it had been five days since then.<br/><br/>Wang Xian sent a message to order the heaven array to come over.<br/><br/>The matter of the monster race was very strong. Now, there were two masters of the universe with level-three combat strength, as well as that extremely strange attack method.<br/><br/>He had to be fully prepared.<br/><br/>With the help of the Heaven Array Water Touch King, even if the other party had an innate supreme treasure, Wang Xian was still very confident.<br/><br/>“Greetings, Dragon King!”<br/><br/>Soon, the figure of the heaven’s formation appeared and greeted him respectfully.<br/><br/>“Get Ready. We are going to attack a powerful race.”<br/><br/>Wang Xian instructed.<br/><br/>“It’s the Dragon King!”<br/><br/>The heaven’s formation nodded and followed beside him.<br/><br/>Wang Xian moved and flew towards the interior of the demon shaman race.<br/><br/>“Be careful. Don’t be discovered!”<br/><br/>They passed through the city of the demon witch clan and Wang Xian reminded the sky array.<br/><br/>He swept his gaze across the sky. Those dark skulls did not discover their figures.<br/><br/>As they continued flying forward, Wang Xian discovered that the places where the strong demon witch clan’s disciples lived were very scattered. It took them a few minutes to reach a castle, hundreds to thousands of demon witch clan’s disciples and strong ones lived in each castle.<br/><br/>“This demon witch clan is different from the other clans. They mainly use the method of teacher-disciple inheritance. Each castle represents a series of teachers for the Demon Witch clan. Each castle has a powerful strength.”<br/><br/>Wang Xian mumbled as he recalled the information regarding the demon witch clan.<br/><br/>There were very few disciples and powerhouses in the entire demon witch clan. There were only a few million of them. However, each of them was an elite and a powerhouse.<br/><br/>They flew all the way to the center. According to some information, the clan leader of the demon Shaman clan was at the center.<br/><br/>Although it was not a treasured land, it was said that there was the source of darkness there. It could help the powerhouses with the darkness attribute to cultivate.<br/><br/>Wang Xian and the rest had been concealing themselves all this while. Their speed of advancement was not very fast.<br/><br/>However, a day later, they arrived at the center.<br/><br/>It was a lonely castle. From Afar, it looked like a royal palace!<br/><br/>It didn’t look grand and huge, but it was filled with antiquity and mystery.<br/><br/>In addition, the ground here was paved with dry bones, which added to the mysteriousness and power.<br/><br/>“The leader of the demon Shaman Clan is a formation wizard. There must be a formation protecting his castle. Sky Formation, you will be at the back to resist with the formation.”<br/><br/>Wang Xian instructed sky formation.<br/><br/>“It’s the Dragon King!”<br/><br/>Sky Formation nodded and stood there without moving.<br/><br/>Wang Xian’s figure moved and flew forward in an instant.<br/><br/>His speed was extremely terrifying. At this point, he no longer concealed himself.<br/><br/>The other party was a level three battle-power wizard who was the Master of the universe. Even if they concealed themselves, it was impossible for them to infiltrate the other party’s lair. They would definitely be discovered!<br/><br/>Therefore, there was no need for him to hide anymore.<br/><br/>“HMM?”<br/><br/>At this moment, in the castle, when Wang Xian came to a certain area, the leader of the Spellcaster clan immediately sensed something.<br/><br/>Buzz<br/><br/>He waved the skeletal staff in his hand and everything outside appeared in front of him.<br/><br/>“It’s him. How dare he intrude into our spellcaster clan. He’s courting death!”<br/><br/>When he saw Wang Xian’s figure, anger appeared on his face. The fellow whom he had cursed to kill actually dared to intrude into the old dynasty of his spellcaster clan.<br/><br/>He actually dared to charge into his territory!<br/><br/>“Li, prepare to face the enemy. Kill this intruder and avenge Wu Gui!”<br/><br/>He growled and waved the skeletal staff in his hand. The entire castle immediately emitted a terrifying energy.<br/><br/>Above the castle, a dark sphere slowly rose.\t\t\t\t\t\t</div>", "images": {}, "success": true}