{"id": 534, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072969.html", "title": "Chapter 3525 - 3525 3524 Strange Curse Kill!", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3525 - 3525 3524 Strange Curse Kill!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3525 3524 strange curse kill!<br/><br/>“Clan leader, which treasure do you want to use?”<br/><br/>In the castle at the center of the Magus clan, when Magus Li heard the clan leader’s words, his eyes shone.<br/><br/>“That’s right, the vengeance of the Magus ghost must be avenged!”<br/><br/>The Magus clan leader said coldly.<br/><br/>With a move of his palm, the ground beneath him began to turn into nothingness!<br/><br/>Slowly, a great terror seemed to rise!<br/><br/>This was a corpse, a human corpse without a face!<br/><br/>The body was pitch black, emitting an extremely strange aura.<br/><br/>The Magus stared at the corpse, his eyes filled with fear.<br/><br/>This was a supreme treasure, an innate supreme treasure, and also the greatest trump card of the Magus clan!<br/><br/>The Magus clan was very famous in the devil bone land, and no one dared to provoke them. Even the spirit demon race feared the Magus clan!<br/><br/>It was rumored that the demon witch clan had terrifying and strange techniques, and they could easily kill even universe masters with level three battle power!<br/><br/>And the demon witch clan’s biggest reliance and strongest trump card was this innate true treasure.<br/><br/>It was a cursed sorcerer’s innate true treasure!<br/><br/>The clan leader of the Demon Witch clan was originally a skeleton with a physical body!<br/><br/>Because of this innate treasure, he mainly focused on curses and formations.<br/><br/>To change the direction of his cultivation for the sake of a treasure, one could imagine how powerful this innate treasure was!<br/><br/>The clan leader of the Demonic Wizard clan moved his palm, and lightning slowly fell toward the dark corpse beneath him.<br/><br/>When the corpse landed on the corpse, a strange scene appeared!<br/><br/>On the corpse, Wang Xian’s face slowly appeared.<br/><br/>The corpse had turned into Wang Xian’s appearance.<br/><br/>Buzz<br/><br/>Ten minutes later, the corpse was exactly the same as Wang Xian. Even the darkness on his body had completely disappeared.<br/><br/>“It’s him, clan leader, it’s him!”<br/><br/>The shaman stared at Wang Xian’s face and shouted loudly.<br/><br/>“That’s good. Next, we’ll kill him!”<br/><br/>The leader of the Demonic Shaman Clan revealed a cold smile. He waved his right hand and the skeleton staff in his hand slowly turned into a sickle.<br/><br/>The sickle of the Grim Reaper!<br/><br/>The sickle slashed directly at Wang Xian’s head from the center!<br/><br/>Crack! Crack<br/><br/>The sickle entered the head of the corpse beneath him and slowly entered the body.<br/><br/>At the same time, Wang Xian’s body, who was sitting cross-legged underground in the land of blood, trembled.<br/><br/>An incomparable terror descended on his heart.<br/><br/>His head, which was located in the middle, actually cracked open slowly. A wave of death enveloped him.<br/><br/>Wang Xian sensed this scene and goosebumps rose all over his body!<br/><br/>“What’s going on?”<br/><br/>His expression changed drastically. A wave of energy surged toward his head to treat the injuries that suddenly appeared on his head.<br/><br/>“This is… A Curse!”<br/><br/>“It’s definitely a curse!”<br/><br/>He growled in a low voice. With a thought, Lingling appeared beside him!<br/><br/>“Dad, you’ve been attacked by a strange energy!”<br/><br/>Lingling appeared and let out a sharp sound. She waved the water lotus staff in her hand and a wisp of wood attribute healing energy surged toward the top of Wang Xian’s head, healing the injuries on his head quickly!<br/><br/>“Block it for me!”<br/><br/>Wang Xian’s expression changed drastically. The surrounding light and darkness energy spread out and the Taiji Dragon Plate covered his head!<br/><br/>Crack! Crack<br/><br/>It was obvious that there was an invisible energy cutting his head. However, this time, the Taiji Dragon Plate blocked it. The healing of Ling Ling was also effective and allowed the wound to heal bit by bit!<br/><br/>“HMM?”<br/><br/>The clan leader of the witchcraft clan, who was located in the witchcraft clan, saw that the sickle was facing tremendous resistance and was even being slowly squeezed out. His expression changed slightly.<br/><br/>Black energy gradually surged out from the corpse that looked exactly like Wang Xian!<br/><br/>“Die!”<br/><br/>The clan leader of the witchcraft clan revealed a stern expression. Once the black energy surged out, it meant that the lightning that belonged to him was being consumed by the curse.<br/><br/>Once the Lightning was consumed and the curse was not killed, the corpse would return to its original state.<br/><br/>This also meant that the curse had failed!<br/><br/>Waves of energy surged into the scythe and the scythe sank into it once again.<br/><br/>“Ah!”<br/><br/>In the land of blood, Wang Xian could not help but let out a blood-curdling scream.<br/><br/>Under this terrifying attack, his head slowly cracked open.<br/><br/>This pain was extremely terrifying!<br/><br/>Lingling’s small face was flushed red. Waves of energy surged into Wang Xian’s head to stop the spread of the wound!<br/><br/>Buzz<br/><br/>The Netherspirit clone appeared at the side. Waves of energy surged into Wang Xian’s body to help him block the attack!<br/><br/>“Oh no, the power of a little thunderbolt is about to be completely depleted. If I have more items from the opponent, I can kill him!”<br/><br/>At this moment, following Wang Xian’s resistance, the corpse of the Demonic Wizard clan slowly returned to its original appearance.<br/><br/>The clan leader of the Demonic Wizard clan had an ugly expression on his face!<br/><br/>There were too few items that belonged to the aura of the other party. If he had the blood on his body, he would have the confidence to kill the other party completely!<br/><br/>Ten seconds later, the corpse returned to its original appearance. It was dark, eerie, and dead silent!<br/><br/>The clan leader’s expression did not look good!<br/><br/>Magus Li’s expression also did not look good!<br/><br/>“The other party is so strong. He actually managed to block your curse, clan leader!”<br/><br/>Magus Li said in a deep voice.<br/><br/>“The other party does have some strength, but he should have been heavily injured by now. Furthermore, he should have used a large number of life-saving treasures!”<br/><br/>The clan leader said coldly.<br/><br/>Under the attack of the sickle, the opponent’s injuries actually recovered a little. This was definitely a powerful life-saving treasure, a powerful divine herb medicinal pill!<br/><br/>“Clan leader, what should we do now?”<br/><br/>The Wizard asked.<br/><br/>“If there’s a chance, let’s take revenge for Wu Gui.”<br/><br/>The Demon Wizard clan leader pondered for a moment. He was a cursed wizard, and the innate supreme treasure in his hand was not a treasure that could be used to fight head-on.<br/><br/>The other party could fight against two of them and kill Wu Gui, so he had no way to do anything about it now.<br/><br/>Unless he could obtain some of the other party’s flesh and blood, then he was 100% sure that he could kill the curse!<br/><br/>Forget about it now!<br/><br/>As for whether he would have the chance in the future, he wasn’t sure either!<br/><br/>In short, this matter would be put aside for now!<br/><br/>Magus Li was silent for a moment before nodding his head.<br/><br/>“Phew!”<br/><br/>In the underground of the Land of blood plasma, Wang Xian sensed that the terrifying attack had disappeared. He heaved a heavy sigh.<br/><br/>“What a strange and terrifying attack. If I didn’t have a spiritual soul, I might have been killed!”<br/><br/>He mumbled as his eyes sparkled.<br/><br/>“Demon Witch Clan!”<br/><br/>Wang Xian was certain that the one who had cursed him was definitely the demon witch clan!<br/><br/>He had just killed the strongest expert of the demon witch clan and obtained the curse. It was definitely their doing.<br/><br/>“However, the other party did not succeed this time. Initially, I was still considering whether to attack your demon witch clan. Now, before I destroy the Hundred Cities Alliance, I will completely exterminate your demon witch clan!”<br/><br/>Wang Xian growled with a face full of killing intent!<br/><br/>This kind of attack from the enemy was too strange. They must not be left alive!<br/><br/>The strength of the Water Touch King and the Heaven Formation had reached the level of a Level 3 universe knight!\t\t\t\t\t\t</div>", "images": {}, "success": true}