{"id": 541, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072983.html", "title": "Chapter 3532 - 3532 3531 Tai Chi Dragon Plate Breakthrough, On The Eve Of The Great Battle!", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3532 - 3532 3531 Tai Chi Dragon Plate Breakthrough, On The Eve Of The Great Battle!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3532 3531 tai chi dragon plate breakthrough, on the eve of the great battle!<br/><br/>Spirit Red Bone became the next Scarlet Queen!<br/><br/>She had never thought that she would actually obtain such a powerful inheritance.<br/><br/>According to the inheritance memories in her mind, as long as she followed the cultivation method mentioned above, she would be able to become one of the top great beings in the universe.<br/><br/>Scarlet Queen, the Eternal Queen of the previous great calamity!<br/><br/>She was at level nine of the Universe Overlord realm, and her strength was unrivaled!<br/><br/>Everything was because of this figure in front of her. He helped her obtain the skull of the pink skeleton, gave her powerful treasures, and gave her the bloodline that gave birth to it.<br/><br/>She looked at Wang Xian in front of her and was filled with gratitude!<br/><br/>Other than her father, he was probably the man who treated her the best!<br/><br/>However, looking at her skeleton body, she suppressed all her thoughts.<br/><br/>Her Heart had already been born, her bloodline would also be born, and her flesh and blood would also grow rapidly.<br/><br/>“Success, Haha, Red Bone, it actually succeeded, our spirit demon race is about to rise up!”<br/><br/>Spirit Demon King’s face was filled with excitement as he roared, his entire body was filled with excitement!<br/><br/>Scarlet Queen’s inheritance, the inheritance of A Level 9 universe overlord!<br/><br/>She had inherited her cultivation method, inherited her bones, and now, she had given birth to a bloodline.<br/><br/>The current red spirit bone was the Scarlet Queen!<br/><br/>She had a 100% chance of breaking through to the realm of the ruler of the universe.<br/><br/>As for the missing hand bones, they could be born in the future when she possessed a bloodline.<br/><br/>She had obtained all the important parts of her body, including her skull, body, and legs. The other parts were no longer important!<br/><br/>“Congratulations!”<br/><br/>Wang Xian congratulated the red spirit bone!<br/><br/>It was now certain that as long as Ling Honggu did not die midway, he would be an existence at the level of a universe overlord in the future.<br/><br/>He would step into the ranks of the top races and become a person at the level of a ruler!<br/><br/>“Thank you, Wang Xian. Thank you!”<br/><br/>Ling honggu bowed to Wang Xian once again. “I will definitely repay your kindness tenfold in the future!”<br/><br/>“Everything is a coincidence. Everything is Fate!”<br/><br/>Wang Xian smiled. With the help of a Master of the universe in the future, it would be a huge battle strength for the Dragon Palace!<br/><br/>“After I have completely condensed my bloodline and physical body, I will look for you!”<br/><br/>Ling Honggu looked at him and said solemnly!<br/><br/>Wang Xian smiled and nodded.<br/><br/>“I will not disturb Miss Ling Honggu’s cultivation!”<br/><br/>As he spoke to Ling Honggu, he looked at the spirit demon king beside him.<br/><br/>“This… little brother Wang Xian, if you have nothing else to do, you can cultivate in our spirit demon race. It Won’t be long before Honggu can condense her physical body. By then, her strength will be invincible among universe knights!”<br/><br/>Ling Mowang said to Wang Xian.<br/><br/>“No!”<br/><br/>Wang Xian shook his head. “I still have to return to the Dragon Palace and destroy the Hundred Cities Alliance in an instant!”<br/><br/>“Oh?”<br/><br/>The Spirit Demon King raised his eyebrows slightly. “Little brother Wang Xian, if you want to destroy the Hundred Cities Alliance, our spirit demon race should help as well. I will bring some experts over.”<br/><br/>“There’s no need. I will only destroy it if I am confident. I don’t need the help of the spirit demon race at all. I will accept your kindness, Spirit Demon King!”<br/><br/>Wang Xian smiled and refused.<br/><br/>“Alright then. If you need any help, just tell us directly. If you need any treasures, we can lend you our innate treasures!”<br/><br/>The spirit demon king nodded and said with a smile.<br/><br/>“Alright. If you need anything, I’ll definitely let you know. Goodbye!”<br/><br/>Wang Xian nodded his head.<br/><br/>Wang Xian also appreciated the kindness of the spirit demon king and the rest!<br/><br/>The Spirit Demon King was personally bringing people to help?<br/><br/>Borrowing an innate treasure?<br/><br/>There was no need for that at all!<br/><br/>This time, Wang Xian had eliminated the demon shaman clan. There were seven level three masters of the universe in the Dragon Palace.<br/><br/>This was not even taking into account his netherspirit clone, Ling Ling, his own strength, the water touch king, and the Heaven Formation, which far surpassed those of the same level!<br/><br/>To Wang Xian, destroying the Hundred Cities Alliance was a piece of cake.<br/><br/>With a flash, Wang Xian’s figure disappeared. The next moment, he returned to the Dragon Palace!<br/><br/>When the spirit demon king saw his figure disappear, his eyes flickered slightly.<br/><br/>“He already has the confidence to destroy the Hundred Cities Alliance. The Dragon Palace really can’t understand it. This little brother Wang Xian’s improvement speed is really terrifying!”<br/><br/>The spirit demon king sighed slightly.<br/><br/>Beside him, Ling Honggu remained silent!<br/><br/>“Weng Weng!”<br/><br/>At this moment, Spirit Demon King’s universe ai shook violently. He opened it and his expression changed slightly.<br/><br/>“The demon witch clan was destroyed!”<br/><br/>When he saw the contents, he couldn’t help but Exclaim!<br/><br/>“HM? Father, the Demon Witch clan was destroyed? How… How is this possible?”<br/><br/>Spirit red bone asked in shock.<br/><br/>“They were indeed exterminated. It is unknown exactly what faction they were exterminated by. The scene was wiped out by powerful Magi. Only the masters of the universe ruler realm would be able to find out!”<br/><br/>Spirit demon king nodded his head heavily as his eyes flickered.<br/><br/>The Demon Witch clan was a clan that was even more powerful than the spirit demon clan!<br/><br/>And now, they were exterminated all of a sudden!<br/><br/>The Demon Witch clan and the Spirit Demon clan could be considered neighbors. They were both powerful factions in the land of the demon bones.<br/><br/>The sudden extermination of them left the spirit demon king a little apprehensive!<br/><br/>“Father, could it be done by Wang Xian and the Dragon Palace?”<br/><br/>Ling Honggu suddenly asked. She looked at her palm. It was the pink skeleton component that Wang Xian had given her.<br/><br/>“The pink skeleton component that she gave me today obviously had its spiritual intelligence wiped out long ago. Furthermore, he took out so many at once. It might be from the Demon Witch Tribe’s Treasury!”<br/><br/>Ling Honggu analyzed.<br/><br/>The eyes of the demon king of spirit sparkled. “It’s indeed highly possible, but we can’t be sure yet. However, the Dragon Palace wants to destroy the alliance of the hundred cities. We should be able to see some of it from now on!”<br/><br/>The Demon Witch clan’s destruction might have been done by Wang Xian. This caused the demon king of spirit to be extremely shocked.<br/><br/>There was a time when that Dragon King still needed his protection.<br/><br/>Now, his strength had already caused him to feel fear!<br/><br/>…<br/><br/>“One month later, I will destroy the Hundred Cities Alliance!”<br/><br/>Wang Xian, who had returned to the Dragon Palace, muttered with a smile on his face.<br/><br/>The reward this time was too great!<br/><br/>“I will upgrade the Tai Chi Dragon Disc First!”<br/><br/>Wang Xian moved his palm and a demon skeleton, the ruler of the universe, as well as more than 20 innate spiritual treasures with darkness attribute appeared.<br/><br/>The Tai Chi Dragon disc revolved around him as it was being publicized. Wang Xian threw the innate spiritual treasures into it one by one and turned them into pure energy.<br/><br/>While he was upgrading the Tai Chi Dragon Disc, it didn’t take long for the Heavenly Formation Water Touch King and the rest to return.<br/><br/>The resources of the demon witch clan began to enhance the strength of the powerhouses of the Dragon Palace.<br/><br/>Firstly, Ao Qitian, Ba Qi, Ao Yao, and Lei Ming, the four leaders, raised their strength to the level of a level three master of the universe.<br/><br/>The rest of the resources were used to raise the strength of the berserk dragon species, arrow dragon species, and the others.<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Hahaha!”<br/><br/>Just as Wang Xian and the rest began to raise their strength, a maniacal laughter came from within the hundred cities peak!<br/><br/>Within the central peak of the hundred cities peak, the Hundred Cities Alliance leader slowly stood up. His face was filled with excitement!\t\t\t\t\t\t</div>", "images": {}, "success": true}