{"id": 545, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072991.html", "title": "Chapter 3536 - 3536 3535 Was Easily Destroyed", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3536 - 3536 3535 Was Easily Destroyed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3536 3535 was easily destroyed<br/><br/>“Boom! Boom! Boom!”<br/><br/>When the Hundred Cities Alliance Master activated all the array formations on the hundred cities peak, the one hundred and eight mountains immediately began to tremble.<br/><br/>An illusion flew out from each mountain peak.<br/><br/>These illusions slowly solidified and formed a terrifying mountain peak.<br/><br/>On each mountain peak, there was a connate numinous treasure!<br/><br/>At this moment, the aura emitted from it was abnormally terrifying!<br/><br/>The virtual image of the largest mountain peak in the center immediately arrived below Hundred City Alliance Master.<br/><br/>He stood there, looking extremely terrifying!<br/><br/>“Hiss, what a terrifying aura! I feel that any mountain peak can crush us!”<br/><br/>A great being with the Combat Power of a universe ruler at level one felt the terrifying 108 mountains, and his face was filled with shock.<br/><br/>“Our Alliance master is so strong!”<br/><br/>“This is the place that our alliance master has been managing for billions of years. Here, Our Alliance Master can fight against two to three people of the same level!”<br/><br/>The experts of the Hundred Cities Alliance watched this scene with excitement!<br/><br/>“Die, Hahaha!”<br/><br/>The Alliance Master of the Hundred Cities Alliance roared. He waved the staff in his hand and numerous huge mountains charged toward Wang Xian and the Dragon Palace Army.<br/><br/>“Destroy these mountains!”<br/><br/>Wang Xian let out a low roar. He flapped his incipient saint wings and attacked the mountains directly.<br/><br/>Compared to the previous mountains, this time around, it was even more terrifying because they were in a formation!<br/><br/>Wang Xian’s attack power was about the same as those of the same level. It would be a little troublesome for him to destroy them!<br/><br/>“It’s the Dragon King!”<br/><br/>“It’s the Dragon King!”<br/><br/>At the side, Ao Qitian ao crab, Lei Ming, let out a low roar and attacked the mountains.<br/><br/>“Roar! Roar! Roar!”<br/><br/>They let out a wild roar and immediately transformed into gigantic demon monkeys, devouring dragons, and Lightning Dragons!<br/><br/>“Boom! Boom! Boom!”<br/><br/>At this moment, Wang Xian had already arrived in front of the mountains and punched them.<br/><br/>The mountain peaks formed by the formation were blasted apart!<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>At the same time, the ghost avatar immediately took away the innate numinous treasure on the mountain peaks!<br/><br/>The three innate numinous treasures were immediately obtained!<br/><br/>“Roar!”<br/><br/>At this moment, ao Qitian’s thunderous ao crab also rushed over.<br/><br/>This time, ao crab was not included in the elevation of the Dragon Palace’s experts.<br/><br/>Ao crab had devoured the Divine Kingdom of a level three universe dominator. The speed of his breakthrough had exceeded Wang Xian’s expectations!<br/><br/>Ao crab’s current realm had already reached the level of a universe dominator. Unfortunately, due to the dragon seed, he could only fight two levels higher.<br/><br/>However, this was not important. What was important was that ao Crab’s strength was also a level three universe dominator.<br/><br/>They rushed over and immediately bombarded the mountain peaks.<br/><br/>“Hong!”<br/><br/>In an instant, the mountain peaks were immediately destroyed. They stretched out their hands and grabbed at the connate numinous treasure.<br/><br/>“What!”<br/><br/>The instant ao crab, Ao Qitian, Lei Ming, and the others attacked, Alliance Master Bai Cheng’s face revealed a shocked expression.<br/><br/>The aura of a universe ruler at level three.<br/><br/>There were actually three universe rulers with level 3 combat power in the Dragon Palace!<br/><br/>“Damn it, no wonder they dared to invade my hundred city peak. It turns out that they have a powerful backer. Four universe rulers with level 3 combat power. Even if there are four of them, I will leave all of you here today!”<br/><br/>Hundred City Alliance Leader’s eyes were a little blood-red. The black dragon scales on his chest were slowly cracking, revealing blood-red eyes!<br/><br/>“There are actually four masters of the universe with level three combat strength in the Dragon Palace?”<br/><br/>“Hiss, how terrifying. However, our alliance leader still seems to be very confident!”<br/><br/>When everyone heard the alliance leader’s words and felt the aura of Ao Qitian and the rest, shock appeared on their faces!<br/><br/>Fortunately, their alliance leader was still full of confidence!<br/><br/>“Hehe, you are very confident. Do you also have experts? Helpers from the Holy Dragon Lineage?”<br/><br/>Wang Xian stared at the Bai Cheng Alliance leader with a mocking look in his eyes.<br/><br/>He was still so confident even after revealing the combat strength of four universe overlords. It seemed that the Bai Cheng Alliance leader had really obtained a powerful trump card!<br/><br/>“Helpers? I can destroy all of you by myself!”<br/><br/>The Bai Cheng Alliance leader roared with a cold expression. Each of his blood-red eyes stared at Wang Xian with a violent aura in them!<br/><br/>“Is that so? Haha!”<br/><br/>Wang Xian laughed out loud. His figure flashed and he charged straight at the leader of the Hundred Cities Alliance.<br/><br/>“Attack him and destroy this fellow!”<br/><br/>When the red-eyed man saw Wang Xian charging towards them, he immediately shouted out loud.<br/><br/>More than 30 masters of the universe with level two combat strength did not hesitate and charged straight at Wang Xian!<br/><br/>“You’re courting death!”<br/><br/>“Is Our Dragon King also someone you can attack?”<br/><br/>King of water touch, who was lying on Wang Xian’s shoulder, said indifferently. She moved her body and attacked the experts of the Hundred Cities Alliance!<br/><br/>“Water Explosion!”<br/><br/>She growled and water balls suddenly appeared around the universe Dominators in front of her.<br/><br/>The water balls exploded instantly!<br/><br/>“Ahhhhh!”<br/><br/>In an instant, more than a hundred masters of the universe with the combat strength of a master were instantly killed by the Water Touch King!<br/><br/>“What!”<br/><br/>At this moment, the sudden attack of the Water Touch King stunned the Alliance Master of Bai City!<br/><br/>This attack, this terrifying attack!<br/><br/>There was even a master of the universe with the combat strength of a level three master?<br/><br/>How was this possible?<br/><br/>Fog Grass!<br/><br/>This…<br/><br/>“Hehe!”<br/><br/>Wang Xian chuckled and charged at the Hundred Cities Alliance leader at a terrifying speed.<br/><br/>“Haha, a bunch of Trash, lackeys!”<br/><br/>King aqua tentacle laughed maniacally and roared with a face full of killing intent.<br/><br/>In her opinion, the Hundred Cities Alliance was a lackey of the Holy Dragon lineage.<br/><br/>And the Holy Dragon lineage was a lackey of the angel race.<br/><br/>Lackeys of lackeys, die!<br/><br/>“Not good, this is a demon beast with level three combat strength of a universe overlord. Alliance master, Save Us!”<br/><br/>At this moment, the expressions of the universe overlords of the Hundred Cities Alliance changed drastically.<br/><br/>There were also universe overlords with level three combat strength?<br/><br/>There were a total of five of them?<br/><br/>Save Them?<br/><br/>When Hundred Cities Alliance master saw this scene, his body trembled!<br/><br/>He controlled the array formation to fight against the three universe overlords with level three combat strength outside the Dragon Palace.<br/><br/>He also had to fight against Wang Xian who was charging at him!<br/><br/>This was already his limit!<br/><br/>Why did he still save them?<br/><br/>“Hold on, I will destroy this dragon king immediately!”<br/><br/>Alliance Master Bai Cheng Roared. He moved his palm. At this moment, he could no longer hide!<br/><br/>The strongest attack, the strongest innate supreme treasure!<br/><br/>“Supreme treasure innate, heavy kill Xuan Huang Talisman!”<br/><br/>He held the heavy kill Xuan Huang Talisman in his hand and charged straight at Wang Xian.<br/><br/>“Heavy!”<br/><br/>The heavy kill Xuan Huang Talisman expanded rapidly in the wind. The leader of Bai Cheng let out a low growl.<br/><br/>On the Xuan Huang Talisman, the word “Heavy”emitted a luster. An earthy yellow glow enveloped the surroundings.<br/><br/>“Eh? This Is? An innate treasure?”<br/><br/>Wang Xian felt the power of the heavy kill Xuan Huang Talisman and his pupils constricted slightly!<br/><br/>“You don’t have any helpers, but you have an innate treasure. Is this your trump card?”<br/><br/>He mumbled as his eyes sparkled!\t\t\t\t\t\t</div>", "images": {}, "success": true}