{"id": 544, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072989.html", "title": "Chapter 3535 - 3535 3534 Was Easily Destroyed", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3535 - 3535 3534 Was Easily Destroyed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3535 3534 was easily destroyed<br/><br/>“Dragon Palace, they should be members of the Dragon Palace. They are heading to the hundred cities peak. What are they going to do? Attack the Hundred Cities Alliance?”<br/><br/>“HMM? Members of the Dragon Palace? Big Brother, how did you know they are members of the Dragon Palace?”<br/><br/>“There is a kind of divine dragon in the Dragon Palace. It is that terrifying demon monkey. It is covered in dragon scales and is extremely violent when it fights. I have seen them fighting with the bounty hunters of the Hundred Cities Alliance. They are members of the Dragon Palace!”<br/><br/>A shocked voice came from the mouths of more than ten people.<br/><br/>They watched the army of the Dragon Palace quickly disappear from their sight. One by one, they looked at each other, their eyes filled with shock.<br/><br/>“Should we go there and take a look? What’s the situation?”<br/><br/>One of them opened his mouth and couldn’t help but ask.<br/><br/>More than ten people’s faces were filled with curiosity.<br/><br/>“I bought a high-tech telescope in the world of Science and technology not long ago. Why don’t we take a look from a distance?”<br/><br/>A middle-aged man couldn’t help but ask.<br/><br/>“Let’s go and take a look. As long as we’re far away, even if the Dragon Palace and the Alliance of Hundred Cities fight, it won’t affect us!”<br/><br/>A middle-aged man said, his eyes shining.<br/><br/>“Alright!”<br/><br/>More than ten people moved and immediately flew towards the hundred cities peak.<br/><br/>At the same time, Wang Xian and the powerful disciples of the Dragon Palace were rapidly approaching the hundred cities peak.<br/><br/>Wang Xian and the rest were very fast. With the help of the energy from the incipient saint wings, they arrived in front of the hundred cities peak in about half an hour.<br/><br/>At this moment, the hundred cities peak was still a little noisy. Countless powerful disciples were located inside.<br/><br/>However, in the sky, two legions were fighting and sparring.<br/><br/>Both sides were long-range attacking, and they were releasing long-range attacks to exchange blows!<br/><br/>This was a training exercise for the expedition to destroy the Dragon Palace in twenty days!<br/><br/>Because the legions had just been formed, they had to work together skillfully!<br/><br/>The sparring between the army and the Army allowed them to work together quickly.<br/><br/>Below them, countless disciples of hundreds of cities raised their heads and looked up with a trace of admiration and respect in their eyes.<br/><br/>Those who could enter the army of hundreds of cities were all elites of each city!<br/><br/>It wouldn’t be long before they set out to completely destroy the arrogant Dragon Palace!<br/><br/>Buzz<br/><br/>Just as they were practicing, the army of the Dragon Palace slowly appeared in the east of the Hundred Cities Peak!<br/><br/>At the same time, everything in the hundred cities peak was reflected in the eyes of the disciples of the Dragon Palace!<br/><br/>Wang Xian stared ahead with a cold look in his eyes!<br/><br/>“Increase the speed and completely surround the Hundred Cities Alliance!”<br/><br/>He growled and instantly increased the speed!<br/><br/>“Roar! Roar! Roar!”<br/><br/>Wang Xian’s voice was very loud. Everyone in the hundred cities peak could hear him clearly.<br/><br/>At this moment, even if Wang Xian didn’t say anything, they had noticed the arrival of the million-strong army of the Dragon Palace!<br/><br/>“Roar! Roar! Roar!”<br/><br/>Upon hearing Wang Xian’s order, the wild dragon species, imperial dragon species, Starwood species, Heavenly Thunder, Earth, fire, dragon, and Phoenix species, who were on the left and right sides, let out roars and flew rapidly to the two sides.<br/><br/>They formed an encirclement and flew away quickly!<br/><br/>In the middle, Wang Xian’s eyes revealed a cold expression.<br/><br/>The Arrow Dragon Seed and the Dragon Wizard were behind him and were approaching him quickly!<br/><br/>“Huh?”<br/><br/>The sudden arrival of the Dragon Palace’s army and the sudden roar caused the entire Hundred City Peak to fall silent!<br/><br/>They looked at the invading Dragon Palace’s army with astonishment on their faces.<br/><br/>What was going on?<br/><br/>Someone was attacking them?<br/><br/>Weren’t they led by the experts of the Dragon Palace?<br/><br/>How could they attack us?<br/><br/>All the experts and disciples of the Hundred Cities Alliance changed their expressions slightly!<br/><br/>Boom<br/><br/>At this moment, the Alliance Master of the Hundred Cities Alliance, who was on the central peak of the hundred cities peak, sensed the arrival of the army of the Dragon Palace through the array formation.<br/><br/>He was slightly stunned and flew out instantly. He floated in the air and looked in the direction of the Army of the Dragon Palace.<br/><br/>“The Dragon Palace?”<br/><br/>He stared at Wang Xian with a strong murderous look in his eyes. “The Dragon Palace, it’s really you. I didn’t go to exterminate you, but you came here to die instead. Hahaha, good, good, good!”<br/><br/>“Hehe, chief of the Hundred Cities Alliance, you are defeated. Today is the day you die. How dare you be so arrogant?”<br/><br/>Wang Xian stared at Chief of the Hundred Cities Alliance with a mocking look on his face.<br/><br/>In a while, he would like to see how the other party would dare to be so arrogant?<br/><br/>“Die. The one who died today is you. Coincidentally, we don’t have to look for the evil dragons of Your Dragon Palace anymore. We will kill you all today!”<br/><br/>Alliance master Bai Cheng Smiled sinisterly. He didn’t know how the Dragon Palace was so confident that they dared to attack him.<br/><br/>However, since they were here, he was confident that he could kill them all!<br/><br/>“All the powerful disciples of the Hundred Cities Alliance, prepare to tear the disciples of the Dragon Palace into pieces!”<br/><br/>Alliance Master Bai Cheng Roared and flew forward.<br/><br/>“Kill the enemy and destroy this group of Evil Dragons from Dragon Palace!”<br/><br/>“Kill them all! Leave No one alive!”<br/><br/>Below, many great beings with the Combat Power of universe masters followed closely behind Hundred City Alliance leader!<br/><br/>They stared at the million-strong army of Dragon Palace, and their eyes were filled with violent killing intent.<br/><br/>They had never expected that the army of Dragon Palace would charge over.<br/><br/>Why should they?<br/><br/>And at this moment, they did not retreat.<br/><br/>Their alliance leader had terrifying combat power!<br/><br/>All the power of their hundred cities was gathered here!<br/><br/>How could they not be a match for Dragon Palace?<br/><br/>One had to know that if their hundred cities joined forces, even the ancestral dragon bloodline would have to take them seriously!<br/><br/>The Combat Power of 300 to 400 universe masters was at the forefront among the high-level races!<br/><br/>Since the Dragon Palace came to seek death, they would tear this group of enemies apart and suppress this group of Evil Dragons!<br/><br/>“Kill, Kill, Kill!”<br/><br/>The Great Disciples of the 100 Cities Alliance roared, their eyes filled with killing intent and boiling.<br/><br/>Just a million troops dared to fight against tens of millions of them?<br/><br/>The Great Disciples of the 100 Cities Alliance were tens of millions, and all of them were elites.<br/><br/>How could your Dragon Palace compete with our tens of millions of elite troops!<br/><br/>All of them were filled with an imposing manner.<br/><br/>“Hehe!”<br/><br/>Wang Xian looked at them with a faint smile on his face.<br/><br/>This Hundred Cities Alliance was really confident!<br/><br/>“All the disciples of the Dragon Palace, kill them!”<br/><br/>Wang Xian saw that they had rushed to the edge of the hundred cities peak. Without any nonsense, he gave the order to attack!<br/><br/>“Roar!”<br/><br/>“Kill!”<br/><br/>All the disciples of the Dragon Palace roared furiously. Wang Xian moved and flew straight ahead.<br/><br/>His gaze was locked onto the chief of the Hundred City Peak. It was filled with coldness.<br/><br/>“You are courting death. Today, I shall fulfill your wish!”<br/><br/>The chief of the Hundred City Peak smiled sinisterly. With a move of his palm, his staff appeared in his hand.<br/><br/>He raised it high up and the entire formation of the Hundred City Peak started to move.<br/><br/>Hundred City Peak was his old nest, a nest that had been set up for billions of years!\t\t\t\t\t\t</div>", "images": {}, "success": true}