{"id": 542, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072985.html", "title": "Chapter 3533 - 3533 3532 Searching Dragon Ruler, Exterminating Dragon Palace?", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3533 - 3533 3532 Searching Dragon Ruler, Exterminating Dragon Palace?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3533 3532 searching Dragon Ruler, exterminating Dragon Palace?<br/><br/>“Just one more step, just one more step, and I’ll be able to break through my current shackles.”<br/><br/>Within the central mountain peak of Hundred City Peak, Hundred City Alliance leader looked at his body, his eyes shining with fervor.<br/><br/>He was one more step away from the true universe ruler realm!<br/><br/>Right now, his demon Dragon’s head and body were all covered in black scales.<br/><br/>These were dragon scales, pure-bred demonic dragon scales!<br/><br/>These dragon scales were the treasures he obtained from the Holy Dragon lineage.<br/><br/>At the same time, there was also a large amount of pure-bred demonic dragon bloodline!<br/><br/>This made him twice as strong as when he was fighting against Wang Xian!<br/><br/>Now, he was confident that he could fight against that powerhouse from the Dragon Palace!<br/><br/>“Of course, if I take it out, I can easily kill him!”<br/><br/>Hundred Cities Alliance master slowly took out a talisman. It was a yellow talisman.<br/><br/>The entire yellow talisman emitted a special energy.<br/><br/>The moment the yellow talisman appeared, the surrounding space seemed to be restricted!<br/><br/>There were two big words on the Yellow Talisman. One was heavy! The other was kill!<br/><br/>An innate true treasure. This was an extremely powerful innate true treasure.<br/><br/>However, the sacred dragon lineage lent it to him!<br/><br/>Even this innate true treasure wasn’t from the Sacred Dragon Clan, but from the Angel clan.<br/><br/>Even for a force like the Sacred Dragon Clan, it was rare to have one or two innate true treasures in the entire clan!<br/><br/>How could they still have spare innate true treasures to lend to him! !<br/><br/>This time, if it wasn’t for the power displayed by the Dragon Palace threatening the sacred dragon clan, they wouldn’t have lent the innate true treasure to him.<br/><br/>“Dragon searching ruler!”<br/><br/>The next moment, he moved his hand and another treasure appeared.<br/><br/>It was a dragon searching ruler that was emitting light!<br/><br/>On the dragon searching ruler, there was a divine dragon and a light chain that completely restrained the Divine Dragon!<br/><br/>It was said that this was a treasure created by the Archangels of the Angel race. It was used to search for the Divine Dragon Bloodline!<br/><br/>The range of this dragon-seeking ruler was very terrifying!<br/><br/>“Dragon Palace, your doomsday is coming, and I still lack the opportunity to make a breakthrough. This opportunity might be a pure-blooded godly dragon bloodline!”<br/><br/>Hundred City Alliance leader murmured.<br/><br/>“All great beings with power above that of a universe ruler of hundred cities, come here!”<br/><br/>He shouted softly, and his voice spread throughout the entire hundred city peak!<br/><br/>“The Alliance leader has ordered us to go!”<br/><br/>“Is revenge about to begin?”<br/><br/>The Great Beings of 100 cities flew toward the mountain in the center.<br/><br/>The leader was 35 universe rulers with level-two combat power.<br/><br/>There were more than 300 universe rulers with level-two combat power!<br/><br/>This was all the power of the 100 Cities Alliance, and all the universe rulers with level-two combat power.<br/><br/>This power far surpassed that of other powers.<br/><br/>Even the demon witch clan didn’t have so many great beings with the combat power of a universe ruler.<br/><br/>Even the demon witch clan and the Spirit Demon clan combined didn’t have so many great beings.<br/><br/>This was mainly because the Hundred City Alliance was a group of city alliances.<br/><br/>There were 100 cities, and even the weakest city had a great being with the Combat Power of a universe ruler at level one, let alone a top-tier city!<br/><br/>A total of nearly 400 universe master level great beings flew over and arrived at the central main peak.<br/><br/>They looked at the Alliance leader who was covered in dragon scales and giving off a powerful aura, and their eyes were filled with respect and excitement.<br/><br/>“Alliance leader, are we going to make a move?”<br/><br/>Red eyes stared at the Alliance leader and couldn’t help but ask first.<br/><br/>“Haha, that’s right, Our Hundred City Alliance is going to make a move. Within 10 years, I will destroy Dragon Palace!”<br/><br/>The Hundred Cities Alliance master laughed and roared with confidence!<br/><br/>“Alliance master, we are always ready for a battle. We are always ready to destroy the Dragon Palace!”<br/><br/>A City Lord roared with burning eyes.<br/><br/>Now, the Dragon Palace had forced them into this crowded hundred cities peak and turned them into stray dogs.<br/><br/>Right now, their greatest hope was to destroy the Dragon Palace!<br/><br/>“It will be here soon. Tell all the disciples and legions to get ready. In a month, we will start the operation to destroy the Dragon Palace!”<br/><br/>The Hundred Cities Alliance Master’s face was full of violent killing intent as he roared in a low voice!<br/><br/>“It’s the Alliance Master!”<br/><br/>The Hundred Cities Alliance Master’s experts immediately roared!<br/><br/>“Announce this news to the world. We, the Hundred Cities Alliance, will avenge ourselves!”<br/><br/>The Hundred Cities Alliance master roared in a low voice!<br/><br/>“Alliance master, do you have such confidence?”<br/><br/>Hearing that they would announce this operation to the world, one of the City Masters clenched his fists.<br/><br/>“I can easily kill that expert from the Dragon Palace. I Won’t be able to escape even if I wanted to!”<br/><br/>The Hundred Cities Alliance master said confidently.<br/><br/>“Congratulations to the city lord for greatly increasing his strength. We will definitely destroy the Dragon Palace this time!”<br/><br/>The city Lord immediately bowed excitedly!<br/><br/>“Congratulations to the city lord for greatly increasing his strength. We will definitely destroy the Dragon Palace this time!”<br/><br/>The other experts from the hundred cities immediately roared loudly!<br/><br/>“Go get ready. We will move out in a month!”<br/><br/>100 City Alliance leader waved his hand, his face filled with strong confidence.<br/><br/>With an innate true treasure in his hand, his power had reached the pinnacle of a universe knight. As long as he was not a great being at the universe ruler realm, 100 City Alliance leader was confident in dealing with him!<br/><br/>“It’s alliance leader!”<br/><br/>Everyone immediately moved out, forming an army and commanding their disciples!<br/><br/>Soon, an excited roar came from 100 city peak!<br/><br/>“We will destroy the Dragon Palace!”<br/><br/>“We will destroy the Dragon Palace!”<br/><br/>The roars shook the heaven and earth!<br/><br/>Soon, not long after, on the universe ai, Hundred City made a statement: one month later, we will destroy the Dragon Palace!<br/><br/>It was just a few words, and there were no other words!<br/><br/>They directly announced this matter, which showed hundred city’s confidence!<br/><br/>“HM? Hundred City actually made a statement to destroy the Dragon Palace? Where did their confidence come from? You should know that not long ago, Hundred City Alliance leader was completely suppressed by the Dragon Palace!”<br/><br/>“Yeah, why did they suddenly make such a statement? This kind of reputation-related statement is definitely not made randomly. Do they have the confidence to destroy the Dragon Palace?”<br/><br/>“What do they have to destroy the Dragon Palace with? How can they be so confident? Don’t tell me that Bai Cheng still has a trump card he hasn’t played yet?”<br/><br/>“Since they made such a statement, they must have the confidence. The foundation of the Alliance of Bai Cheng is still very deep!”<br/><br/>When the news of the Hundred Cities Alliance was released, it immediately caused a huge sensation.<br/><br/>At this moment, even the war between the Holy Dragon and the ancestral dragon was not as exciting as the war between the Hundred Cities Alliance and the Dragon Palace.<br/><br/>The Dragon Palace had attacked time and time again, and the Hundred Cities Alliance had been defeated time and time again!<br/><br/>Was it time for them to counterattack?<br/><br/>What other trump cards did they have?<br/><br/>All the powerhouses from the various factions were astonished!<br/><br/>Boom<br/><br/>At the same time, at the location of the Dragon Palace, a wave of light and darkness energy swept out in the surroundings.<br/><br/>Wang Xian looked at the extremely thick and heavy tai chi dragon plate that looked like an ink painting. His eyes shone brightly.<br/><br/>The Tai Chi Dragon Plate had broken through!<br/><br/>To be able to easily defend against the attacks of a level three overlord of the universe, his strength had become much more abnormal!<br/><br/>This caused him to reveal a trace of a smile.<br/><br/>In a few days, he would exterminate 100 cities!\t\t\t\t\t\t</div>", "images": {}, "success": true}