{"id": 547, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072995.html", "title": "Chapter 3538 - 3538 3537,000 Cities Were Destroyed, And The World Was Shocked", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3538 - 3538 3537,000 Cities Were Destroyed, And The World Was Shocked</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3538 3537,000 cities were destroyed, and the world was shocked<br/><br/>Weng<br/><br/>A special cloud appeared in the sky above Hundred City Peak, and a space-locking energy covered the entire hundred city peak!<br/><br/>Hundred City Alliance Master looked at the cloud that suddenly appeared in the sky and felt the energy of this array formation.<br/><br/>His body trembled violently!<br/><br/>This array formation was 100% from A Level 3 universe ruler!<br/><br/>There were level 3 universe masters around them?<br/><br/>There were more?<br/><br/>How many were there?<br/><br/>What kind of enemies did they provoke?<br/><br/>Initially, Hundred City Alliance leader was confident that he would destroy Dragon Palace, but this was the result!<br/><br/>The other party charged over and displayed unparalleled power!<br/><br/>This… Hundred City Alliance leader felt his vision go black, and his body trembled violently.<br/><br/>“How many level three universe masters are there in Your Dragon Palace? How many of them are there?”<br/><br/>He stared at Wang Xian with his eyes wide open and roared in a low voice!<br/><br/>Now, he was in despair!<br/><br/>The strength of the Dragon Palace and the Dragon King was too terrifying!<br/><br/>“Oh no, no, no, no. I Can’t return to my divine kingdom. The space around us is sealed!”<br/><br/>“It’s over. The space around us has been sealed. We can’t escape. We can’t escape!”<br/><br/>“There’s a teleportation array on the mountain peak. We can escape through it. Quick, quick, escape through the teleportation array!”<br/><br/>When the clouds covered the area, countless expert disciples of the Hundred City Alliance widened their eyes and felt their hearts crumble!<br/><br/>This space had been sealed!<br/><br/>Faced with the invincible power of the Dragon Palace, if they couldn’t escape, what awaited them was death!<br/><br/>They didn’t want to die!<br/><br/>They wanted to escape. They wanted to escape crazily!<br/><br/>And now, the only chance to escape was the teleportation formation!<br/><br/>“Don’t let the disciples of the Hundred Cities Alliance above the level of a universe Knight escape!”<br/><br/>Wang Xian’s gaze swept down. There were too many powerful disciples from more than 80 cities in the hundred cities peak!<br/><br/>They were densely packed!<br/><br/>Some of them wanted to escape through the teleportation formation.<br/><br/>As there were too many of them, Wang Xian didn’t want to create too many massacres!<br/><br/>However, those above the level of a universe knight shouldn’t think of escaping!<br/><br/>Firstly, their corpses were their resources. Secondly, it was to prevent them from taking revenge on the Dragon Palace in the future.<br/><br/>As for those below the level of a universe knight, the Dragon Palace could completely ignore them!<br/><br/>“It’s the Dragon King, Kill Everyone!”<br/><br/>“Keke Keke, Our Dragon King is merciful, the weak can live, those above the knight level can forget about escaping, if you dare to escape, our attacks will hurt the weak, don’t blame us for being cruel!”<br/><br/>The eight limpid demon Sha and the others roared.<br/><br/>In the Hundred Cities Alliance, the universe ruler level warriors were being suppressed and killed by the water touch king.<br/><br/>The other 100 cities alliance armies were like vegetables on a chopping board for the Dragon Palace Army!<br/><br/>They were being slaughtered at will!<br/><br/>There were no universe masters with the Combat Power of universe masters, and eight Qi had the combat power of a Level 3 universe master.<br/><br/>And they hadn’t even made a move yet!<br/><br/>They were being crushed, completely crushed!<br/><br/>“No, no, no!”<br/><br/>When those universe knights heard this, their faces were filled with despair.<br/><br/>They wanted to fly towards the teleportation formation on the mountain peaks, but they were directly shot to death by arrows!<br/><br/>The terrifying aftermath also caused some weaklings to die directly!<br/><br/>It could be said that these weaklings were killed by them!<br/><br/>Sometimes, in war, the weak were innocent!<br/><br/>However, the reason for one’s stance was that one had to pay the price!<br/><br/>They were just like commoners. It was already good enough that Wang Xian didn’t kill them!<br/><br/>If it was some other race war, it would be the end of the race!<br/><br/>Just like the war between the ancestral dragon lineage and the Holy Dragon lineage, it was the true end of the race war.<br/><br/>As long as it was the other party’s disciple, regardless of their strength, age, age, or age, they would be killed immediately!<br/><br/>“Dragon King, Dragon King, even if I have to die today, I will still exterminate you!”<br/><br/>When the leader of the Hundred Cities Alliance saw this scene that was almost a foregone conclusion, his body trembled violently as he roared in a stern voice!<br/><br/>With a move of his hand, the ‘kill’Word on the ‘kill’Xuan Yellow Talisman suddenly emitted a luster.<br/><br/>The earthen yellow energy in the surroundings slowly gathered together and formed a ‘kill’word that carried a terrifying energy!<br/><br/>“Huh?”<br/><br/>Wang Xian saw the innate supreme treasure releasing its power once again. He focused his gaze and looked at it coldly!<br/><br/>“Even if I die, I will kill you!”<br/><br/>Bai Cheng Alliance master roared ferociously, “Kill Xuan Huang Talisman, Kill!”<br/><br/>The “Kill”word was formed and locked onto Wang Xian.<br/><br/>At this moment, Wang Xian had a feeling that this “Kill”word seemed to have locked onto him. It seemed to have been imprinted onto his glabella!<br/><br/>This was a very strange feeling!<br/><br/>This was the power of an innate supreme treasure!<br/><br/>“Your attack is a little too late!”<br/><br/>Wang Xian looked at Bai Cheng Alliance leader quietly and said something that he didn’t understand!<br/><br/>“Die!”<br/><br/>At this moment, Bai Cheng Alliance leader didn’t say a single word to Wang Xian. He controlled the innate supreme treasure to attack him.<br/><br/>Hiss<br/><br/>Just as the heavy kill Xuan Huang Talisman was about to attack Wang Xian, the position of Bai Cheng Alliance Master’s head slowly cracked open!<br/><br/>It cracked open in an extremely strange manner!<br/><br/>The sudden strange attack made Bai Cheng Alliance master widen his eyes. He was filled with panic.<br/><br/>“Ah Ah Ah! No, no, no, what is this?”<br/><br/>Feeling the terrifying attack invading his body, Bai Cheng Alliance Master was completely devastated at this moment!<br/><br/>What kind of attack was this? Why was it so strange?<br/><br/>It was so unbelievable!<br/><br/>Even if it was a curse, it wasn’t so strange!<br/><br/>His head slowly cracked open. The heavy kill Xuanhuang talisman that he controlled trembled slightly.<br/><br/>Wang Xian looked at the leader of the Hundred Cities Alliance quietly. He watched as his body was slowly cracked open!<br/><br/>His eyes were wide open as he stared at Wang Xian. His body was trembling non-stop.<br/><br/>His ferocious face was filled with despair!<br/><br/>“Today, let’s completely destroy the Hundred Cities Alliance. A neutral force must join the war of the divine dragon lineage because of greed. They deserve to die!”<br/><br/>Wang Xian stared at the chief of the Hundred Cities Alliance coldly and said calmly.<br/><br/>When the chief of the Hundred Cities Alliance heard his words, he slowly closed his eyes.<br/><br/>All his unwillingness and anger had turned into helplessness at this moment!<br/><br/>He had lost. He had completely lost. He had buried the entire hundred cities alliance with him!<br/><br/>However, there was no chance for him to do it all over again!<br/><br/>His life force slowly disappeared until he fell downwards.<br/><br/>“The chief is dead. Our chief is dead!”<br/><br/>At this moment, a cry of surprise sounded. It caused all the experts and disciples of the Hundred Cities Alliance to lose their fighting spirit completely!<br/><br/>The Alliance Master was dead, and they swore that they were absolutely confident that they could destroy the Alliance Master of the Dragon Palace!<br/><br/>Under the attack of the Dragon Palace, he didn’t even have the chance to resist.<br/><br/>The gap between him and the Dragon Palace was too big!<br/><br/>“We’re finished, we’re completely finished!”<br/><br/>Some City lords were filled with despair when they saw this situation!<br/><br/>There was no hope of survival anymore!\t\t\t\t\t\t</div>", "images": {}, "success": true}