{"id": 546, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072993.html", "title": "Chapter 3537 - 3537 3536 Cities Will Be Destroyed. The World Will Be Shocked! Go", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3537 - 3537 3536 Cities Will Be Destroyed. The World Will Be Shocked! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3537 3536 cities will be destroyed. The world will be shocked! Go<br/><br/>Buzz<br/><br/>The grayish yellowish air shrouded the surroundings. Wang Xian instantly felt an extremely strong gravitational force landing on his body.<br/><br/>This gravitational force was not that kind of terrifying attractive force. Instead, it was that kind of pressure, the pressure from all directions.<br/><br/>Wang Xian instantly felt that his speed was greatly restricted!<br/><br/>“Lingling!”<br/><br/>Wang Xian let out a low growl and Lingling’s figure appeared beside him.<br/><br/>“Lingling!”<br/><br/>Lingling looked around and waved the water lotus staff in her hand. The earthen yellow gas in the surroundings slowly moved away!<br/><br/>“What?”<br/><br/>When Bai Cheng Alliance master saw Lingling appear and saw that the attack of the innate supreme treasure had been slightly neutralized, his face was filled with astonishment.<br/><br/>“What is that thing?”<br/><br/>He couldn’t help but let out a low roar!<br/><br/>“Tai Chi Dragon Disc!”<br/><br/>Wang Xian’s eyes flickered slightly. His body moved and the Tai Chi Dragon disc spun around him. He attacked Bai Cheng Alliance Master directly.<br/><br/>The spirit waved the water lotus staff and continuously expelled the earthen yellow aura in the surroundings. This allowed Wang Xian’s speed to be unimpeded!<br/><br/>“Damn it, what is this thing? !”<br/><br/>“Heavy Kill Xuan Huang Talisman, Heavy!”<br/><br/>Chief Bai Cheng roared in disbelief once again. Streams of earthy yellow aura rushed towards Wang Xian.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The Tai Chi Dragon Plate spun rapidly. Streams of ink-like energy rushed towards the surroundings.<br/><br/>Ling Ling also waved her staff to block the earthy yellow aura.<br/><br/>The Tai Chi Dragon Disc and the accompanying elf completely blocked the attack of the innate supreme treasure!<br/><br/>“Crash!”<br/><br/>Wang Xian flapped his uninitiated holy wings and instantly appeared in front of Bai Cheng Alliance Master. His dragon claws clawed at him!<br/><br/>“This speed!”<br/><br/>Bai Cheng Alliance Master’s pupils contracted slightly when he saw this scene!<br/><br/>The innate supreme treasure in his hand was actually useless!<br/><br/>The blood-red eyes on his body glowed and a blood moon appeared in the void.<br/><br/>Around the blood moon, an extremely terrifying dark demonic dragon slowly appeared!<br/><br/>The Blood Moon was in the sky and reflected on Wang Xian’s body.<br/><br/>The demonic dragon swayed and attacked Wang Xian.<br/><br/>“Bang!”<br/><br/>However, these attacks were still a little slow. Wang Xian’s dragon claws landed on Bai Cheng’s body.<br/><br/>The Demon Dragon Scales on the Bai Cheng Alliance leader’s body emitted a luster. He had completely withstood this attack!<br/><br/>“Bang!”<br/><br/>A loud collision sound was heard. He spat out blood directly!<br/><br/>“Roar!”<br/><br/>The Dark Demon Dragon in the sky charged at Wang Xian!<br/><br/>“Buzz!”<br/><br/>Wang Xian’s body trembled. The Ming Gui went up to meet it directly!<br/><br/>“Boom!”<br/><br/>The sound of collision was heard. The Dark Demon Dragon was easily blocked!<br/><br/>“No, what the Hell Is This?”<br/><br/>Hundred Cities Alliance Master looked over and roared.<br/><br/>This Dark Demon Dragon had the support of a red eye and a large array. It was absolutely terrifying!<br/><br/>However, a shadow flew out from the Dragon King’s body and easily blocked it!<br/><br/>This? ? ?<br/><br/>“Weng!”<br/><br/>Just as Hundred Cities Alliance Master was in a Daze, a shadow of Light and darkness strangely appeared behind him!<br/><br/>Bai Cheng Alliance Master didn’t notice the strange figure.<br/><br/>The sharp dagger landed on his body and cut off a piece of his flesh!<br/><br/>At this moment, Bai Cheng Alliance Master’s hair stood on end and his forehead was covered in cold sweat!<br/><br/>But what surprised him was that the figure attacked and flew backward.<br/><br/>“What is this thing?”<br/><br/>At this moment, Hundred Cities Alliance Master widened his eyes and roared in disbelief.<br/><br/>Just now, he thought that he was going to be seriously injured, but the other party only injured him and cut some flesh and blood!<br/><br/>This made him feel extremely fortunate!<br/><br/>In fact, it was not that Ao Yao did not want to severely injure him!<br/><br/>It was that the earth-yellow energy around him had greatly reduced his speed!<br/><br/>Even with his strange speed just now, he could only maintain it for an instant!<br/><br/>However, it was sufficient as long as he could get some of the opponent’s flesh and blood!<br/><br/>When Wang Xian saw Ao Yao’s attack, a smile appeared on his face.<br/><br/>He did not continue to attack. Instead, he stood in the air in front of him and scanned his surroundings with a smile on his face.<br/><br/>“Leader of the Hundred Cities Alliance, before you die, take a look at your surroundings and See How Your Hundred Cities Alliance was destroyed!”<br/><br/>He said indifferently, his eyes filled with contempt and mockery!<br/><br/>Today, he couldn’t escape!<br/><br/>When Alliance Master Bai Cheng heard Wang Xian’s words, he immediately looked around.<br/><br/>The formation of the Hundred City Peak had been activated. The strongest one was the 108 mountains, and each of them could erupt with terrifying offensive power!<br/><br/>But now, the mountains were starting to collapse one by one, and the innate spiritual treasures were being taken away one by one!<br/><br/>Without his control, the Great Array’s attack power was very weak. Under the attack of three universe masters with level-three Combat Power, it was rapidly collapsing.<br/><br/>At most, in a few dozen seconds, the 108 mountains would completely collapse!<br/><br/>And below, that terrifying and direct demon beast was slaughtering the universe masters with Combat Power of 100 cities.<br/><br/>More than 300 universe masters with combat strength were unable to stop her.<br/><br/>Every second, more than 10 universe masters with combat strength were killed!<br/><br/>They were no match for her!<br/><br/>At the front, the Army of the Dragon Palace rushed over.<br/><br/>His heart sank. What made him feel despair was that there was another universe master with level three combat strength who rushed over at the front.<br/><br/>His body trembled as he stared at Wang Xian.<br/><br/>“How many level three masters of the Universe do you have? Why are there so many Masters in Your Dragon Palace?”<br/><br/>Bai Cheng’s body trembled as he stared at Wang Xian and growled.<br/><br/>His face was filled with ferocity and madness!<br/><br/>How many level three masters of the universe did this reveal?<br/><br/>How could they defend against so many great beings?<br/><br/>“The enemy is too powerful. Alliance leader, the enemy is too powerful. We are no match for them!”<br/><br/>“No, no, no! Run! All the disciples and Great Beings of Veluriyam Bee Flower City, run! Run back to your God Country!”<br/><br/>“Alliance leader, we can’t hold on any longer. Run! All the disciples and Great Beings, run!”<br/><br/>At this moment, screams of pain could be heard.<br/><br/>Run!<br/><br/>The strength of the Dragon Palace was not something that they could withstand!<br/><br/>It was not something that the hundred cities could withstand!<br/><br/>They had too many top-tier experts!<br/><br/>Some City lords even directly ordered their disciples and experts to escape.<br/><br/>With one city lord leading the way, more and More City Lords roared loudly.<br/><br/>Some of the powerhouses swept their gaze over to the Hundred City Alliance’s leader. When they saw that he was completely unable to do anything to the Dragon King of the Dragon Palace, they felt despair in their hearts!<br/><br/>Escape. This time, their hundred city alliance was completely defeated.<br/><br/>They swore that they would never oppose the Dragon Palace and would never participate in the war again!<br/><br/>“Look, the powerhouses and disciples of Your Hundred City Alliance are already thinking of escaping!”<br/><br/>Wang Xian’s gaze swept over and slowly landed on the leader of the Hundred Cities Alliance. His gaze was filled with mockery.<br/><br/>“However, it won’t be so easy for them to escape.”<br/><br/>He added nonchalantly!<br/><br/>As soon as he finished his sentence, clouds appeared out of thin air above the hundred cities peak. A special energy enveloped the entire hundred cities peak!\t\t\t\t\t\t</div>", "images": {}, "success": true}