{"id": 540, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072981.html", "title": "Chapter 3531 - 3531 3530 Scarlet Queen’S Inheritance", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3531 - 3531 3530 Scarlet Queen’S Inheritance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3531 3530 Scarlet Queen’s inheritance<br/><br/>The Spirit Red Bone was located in the sky above the skeleton flames. Her head and legs would look strange if one took a closer look.<br/><br/>It seemed to be fused together using a special method!<br/><br/>Waves of powerful and strange energy covered her entire body as the flames fused with the darkness!<br/><br/>However, the energy in her body was a little unstable.<br/><br/>Sensing that someone had arrived, she opened her eyes and looked at her father. Then, she looked at Wang Xian with a surprised expression.<br/><br/>“Father, Wang Xian, why are you here?”<br/><br/>Her figure moved and landed in front of them. She shouted with a smile on her face.<br/><br/>“Yes!”<br/><br/>Wang Xian nodded at her with a smile.<br/><br/>“I brought little brother Wang Xian here. This time, he brought the pink skeleton parts again!”<br/><br/>As the Spirit Demon King spoke, he moved his palm and the parts appeared in front of Ling Honggu.<br/><br/>“This… with the addition of the pink skeleton leg, I’m only two arms away from gathering all the parts.”<br/><br/>Ling Honggu looked at Wang Xian in astonishment and cupped his hands. “Thank you, Wang Xian!”<br/><br/>“You’re welcome. I was also lucky to obtain the parts of the pink skeleton.”<br/><br/>Wang Xian shook his head. “However, I’m afraid I Won’t be so lucky to encounter the last part!”<br/><br/>“You’ve already helped me tremendously. Without You, it would be difficult for me to obtain even a head!”<br/><br/>Ling Honggu said gratefully.<br/><br/>“Oh right, father, I’ve obtained some memory inheritance. It’s a very powerful memory inheritance!”<br/><br/>At this time, she looked at her father and said excitedly.<br/><br/>“Powerful inheritance?”<br/><br/>Spirit Demon King’s eyes revealed a burning expression, immediately asking, “What powerful inheritance?”<br/><br/>“The inheritor is the former owner of this pink skeleton body, called Scarlet Queen, who possesses both fire and darkness attributes. According to the memory inheritance I obtained, she is an invincible existence at the universe ruler Level 9!”<br/><br/>Spirit Red Bone said excitedly.<br/><br/>“What?”<br/><br/>This made spirit demon king slightly shocked, his eyes filled with excitement, “Then red bone, do you have the confidence to break through to the Universe Overlord Level?”<br/><br/>“This… is still a bit difficult!”<br/><br/>Spirit red bone slightly frowned, he shook his head, “Scarlet Queen is a human powerhouse. I obtained her pink skeleton body, but it is not complete. Furthermore, it has experienced countless years of wear and tear, the wear and tear of the calamity. This is secondary. Most importantly, I do not have Scarlet Queen’s Bloodline.”<br/><br/>“Bloodline?”<br/><br/>Upon hearing this, the face of spirit demon king sank slightly.<br/><br/>“But father, even so, the probability of me breaking through to the level of a universe dominator is much higher than before. Furthermore, Wang Xian has brought these components with him this time. After I fuse them together with a portion of the inheritance, I will be able to kill a level three universe dominator in an instant!”<br/><br/>Ling Honggu said confidently!<br/><br/>“Good, good. I’m satisfied!”<br/><br/>A smile appeared on the face of the spirit demon king.<br/><br/>“If you have the bloodline of the Scarlet Queen, Honggu, do you have the confidence to break through to the level of a universe dominator?”<br/><br/>When Wang Xian heard Ling Honggu’s words, he was deep in thought!<br/><br/>“HMM?”<br/><br/>Ling Honggu looked at him in surprise. “Wang Xian, do you have the bloodline of the Scarlet Queen?”<br/><br/>“No!”<br/><br/>Wang Xian shook his head. “It’s just an attempt. I don’t know if it will succeed!”<br/><br/>“You can do that? How are you so powerful?”<br/><br/>Ling Honggu was stunned again when he heard his words.<br/><br/>After finding so many pink skeleton parts, he was now able to create the bloodline of the Scarlet Queen. This was something that could do anything!<br/><br/>“Little brother Wang Xian has already broken through to the level three combat strength of the ruler of the universe.”<br/><br/>The Spirit Demon King was also in awe. He looked at Wang Xian in astonishment and was filled with anticipation. “Little brother Wang Xian, you really have a way. If my daughter can give birth to the bloodline of the Scarlet Queen, my spirit demon race would be extremely grateful!”<br/><br/>Once the spirit red bone could really awaken the bloodline of the Scarlet Queen, it would definitely be able to advance to the realm of the universe dominator.<br/><br/>In that case, their spirit demon race would be able to step into the skeleton domain and become a member of the skeleton race, the peak race.<br/><br/>“I can give it a try!”<br/><br/>Wang Xian nodded his head.<br/><br/>Based on his current relationship with the spirit demon race, if the spirit red bone could break through to the realm of the ruler of the universe, it would definitely be of great benefit to the Dragon Palace.<br/><br/>He moved his palm and a blood refinement fruit appeared in his hand.<br/><br/>“Swallow It!”<br/><br/>Wang Xian said to the spirit red bone!<br/><br/>“This is?”<br/><br/>Ling Honggu looked at the fruit and felt a throbbing sensation in his body.<br/><br/>Even the eyes of the demon king, who was standing at the side, were glowing with a fiery glow.<br/><br/>The blood refinement fruit had a fatal attraction to them!<br/><br/>In the end, the demise of the demon witch clan was because of the blood refinement fruit.<br/><br/>If Wu Gui and the rest had not come because of the fatal attraction of the blood refinement fruit, they might not have offended a level three master of the universe.<br/><br/>The blood refinement fruit was definitely a precious treasure in the universe!<br/><br/>“The blood refinement fruit is also a very precious fruit to me. It can extract the purest and strongest bloodline in my body!”<br/><br/>Wang Xian introduced the fruit and handed it to Ling Honggu!<br/><br/>“Thank you, Wang Xian!”<br/><br/>Ling Honggu bowed slightly. At this moment, her head and body looked like a skeleton. There was really no sense of beauty!<br/><br/>Of course, Wang Xian didn’t have any thoughts about her either!<br/><br/>Ling Honggu took it and directly put it into her mouth before swallowing it into her stomach.<br/><br/>At the moment, the members of the Dragon Palace had yet to consume the blood refinement fruit in Wang Xian’s hands. Ling Honggu was considered to be the first person to consume it.<br/><br/>Buzz<br/><br/>A powerful blood aura rushed out from Ling Honggu’s body. This blood aura carried a hint of heat!<br/><br/>The Spirit Demon King was staring at it from the side. There was a hint of nervousness in his eyes.<br/><br/>“Crimson!”<br/><br/>At this moment, a voice suddenly came from the Red Spirit Bone’s body.<br/><br/>This voice did not come from the red spirit bone. It seemed to come from another dimension!<br/><br/>The meaning of the voice was: Crimson!<br/><br/>It was a word that people did not understand at all!<br/><br/>“Buzz!”<br/><br/>At this moment, a shadow slowly appeared. The shadow overlapped with the skeleton body of Ling Honggu.<br/><br/>It was the figure of a woman. Her eyes were closed and she was wearing a blood-red dress. It was extremely exquisite!<br/><br/>She was magnificent!<br/><br/>The Queen of Eternity!<br/><br/>When Wang Xian saw this shadow, two words flashed across his mind!<br/><br/>The shadow appeared briefly before completely entering the body of Ling Honggu!<br/><br/>“Dong Dong!”<br/><br/>At this moment, a weak sound came from within the body of the spirit red bone!<br/><br/>The spirit red bone lowered its head and looked at its own body.<br/><br/>“This is the sound of a heartbeat. It’s a heart. Red Bone, you actually gave birth to a heart!”<br/><br/>The excited voice of the spirit demon king came from the side!<br/><br/>Their spirit demon race belonged to the skeleton race. It was just that there were some mutations!<br/><br/>However, they were still essentially a skeleton race. Skeletons didn’t have hearts!<br/><br/>They didn’t have bloodlines or blood!<br/><br/>However, Ling Honggu had actually given birth to a heart. The heart was making blood!<br/><br/>Did he succeed?<br/><br/>“Did he succeed?”<br/><br/>Wang Xian looked over and his eyes were filled with anticipation.<br/><br/>“He succeeded!”<br/><br/>Ling Honggu looked at Wang Xian with excitement in his eyes. “I’ve obtained more inheritances. I’m the next Scarlet Queen!”\t\t\t\t\t\t</div>", "images": {}, "success": true}