{"id": 543, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15072987.html", "title": "Chapter 3534 - 3534 3533 Was Easily Destroyed", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3534 - 3534 3533 Was Easily Destroyed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3534 3533 was easily destroyed<br/><br/>“Dragon King!”<br/><br/>In the Dragon Palace, Prime Minister Gui sensed the breakthrough of Wang Xian’s Taiji Dragon Disc. He rushed over immediately and bowed respectfully.<br/><br/>“How are Ao Qitian and the rest doing?”<br/><br/>Wang Xian asked with a smile when he saw Prime Minister Gui.<br/><br/>“Dragon King, Ao Qitian and the rest are still four to five days away from breaking through!”<br/><br/>Prime Minister Gui said!<br/><br/>“Alright, order the other disciples of the Dragon Palace. After AO Qitian and the rest have broken through, we will destroy the Hundred Cities Alliance immediately!”<br/><br/>Wang Xian said.<br/><br/>“Yes, Dragon King. Dragon King, there is something very interesting. Look at the universe’s AI. The Hundred Cities Alliance has announced that they will destroy our Dragon Palace in a month!”<br/><br/>Prime Minister Gui spoke at this moment with a smile on his face.<br/><br/>“HMM?”<br/><br/>Wang Xian was slightly taken aback. He opened the universe’s AI in astonishment.<br/><br/>When he saw the information released by the Hundred Cities Alliance, his face was filled with astonishment.<br/><br/>“They are actually so confident? They can destroy our Dragon Palace?”<br/><br/>Wang Xian pursed his lips and a smile appeared in his eyes!<br/><br/>He had not destroyed the Hundred Cities Alliance yet. Now, the Hundred Cities Alliance had announced that they wanted to destroy them!<br/><br/>Who gave him such confidence?<br/><br/>“The last time I fought with the leader of the Hundred Cities Alliance, he clearly knew that he was weaker than me. Yet, he still dared to be so arrogant?”<br/><br/>Wang Xian mumbled as his eyes sparkled.<br/><br/>To be so arrogant, he must have a trump card?<br/><br/>Did the Holy Dragon Clan help them?<br/><br/>That was possible!<br/><br/>The Holy Dragon Clan was now the Lackey of the Angel clan, and the lackeys of the Angel clan were not only the Holy Dragon Clan, but also many powerful races.<br/><br/>For example, the Sky Plant Demon Beast clan that they met last time!<br/><br/>The Sky Plant Demon Beast clan was also a very powerful race.<br/><br/>Perhaps, the Holy Dragon clan saw that the Dragon Palace was too powerful, and they asked these races to help!<br/><br/>Sending one or two masters with level three combat strength who were universe overlords to help the Hundred Cities Alliance to destroy the Dragon Palace?<br/><br/>The possibility of that was very high!<br/><br/>“Hehe, this hundred cities alliance is really expanding. This time, I want to see how many helpers you have!”<br/><br/>Wang Xian chuckled. This time, the seven masters with level three combat strength were from the Dragon Palace.<br/><br/>Just Wang Xian alone could fight against six or seven masters of the same level. The Water Touch King and the Heaven Array could also deal with two or three of them.<br/><br/>Not to mention that the Heaven Array had an innate supreme treasure, the cursed source, the Devil’s corpse!<br/><br/>“Based on the current strength of the Holy Dragon lineage, there are definitely no more than two who came to help the Hundred Cities Alliance!”<br/><br/>Prime Minister Gui said with a smile.<br/><br/>The holy dragon lineage was weaker than the ancestral dragon lineage in terms of strength.<br/><br/>The reason why they could suppress the ancestral dragon lineage was because they had the angel race behind them. Hence, when they were fighting the ancestral dragon lineage, they would definitely not send more than two universe masters with level three combat strength.<br/><br/>Otherwise, the Holy Dragon lineage would not need the hundred cities alliance to make a move. They could send their own people to destroy the Dragon Palace!<br/><br/>“After Ao Qitian and the rest have made a breakthrough, they will immediately attack the Hundred Cities Alliance. Do we still need to wait for another month?”<br/><br/>Wang Xian said coldly.<br/><br/>Initially, he was prepared to wait for another month before making a move. Now, it seemed that there was no need at all!<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui immediately replied.<br/><br/>Time passed day by day, and Ao Qitian and Ao Yao’s breakthrough soon arrived!<br/><br/>In the past few days, the universe’s AI had been discussing the matter of the hundred cities. Many people were looking forward to how the hundred cities would destroy the Dragon Palace and what trump cards they had!<br/><br/>A big battle, and all the forces were ready to enjoy it.<br/><br/>From their point of view, this should be the decisive battle between the Hundred Cities Alliance and the Dragon Palace!<br/><br/>They were looking forward to it!<br/><br/>“Weng Weng!”<br/><br/>However, just as the universe AI was still discussing, at the position in front of the hundred cities peak.<br/><br/>This place was an hour’s flight away from the hundred cities peak. It wasn’t close, but it was definitely not far!<br/><br/>At this time, on the ground, figures slowly appeared.<br/><br/>The number of figures slowly reached over a million!<br/><br/>Each and every one of them emitted an extremely powerful position.<br/><br/>Especially those strange figures that were a combination of light and darkness. The moment they appeared, they slowly disappeared!<br/><br/>“Hehe!”<br/><br/>At the front, Wang Xian stood there quietly with a smile on his face!<br/><br/>“Dragon King, let’s go over and completely seal off the Bai Cheng Peak First!”<br/><br/>The sky array and Ao Yao walked to Wang Xian’s side and said respectfully.<br/><br/>“You guys go over first. After sealing off the area, send the message!”<br/><br/>Wang Xian nodded his head and swept his gaze across the members of the Dragon Palace behind him.<br/><br/>Yesterday, AO qitian, Ao Yao, and the rest had completed their breakthrough!<br/><br/>Today, he had brought over a million experts of the Dragon Palace through the dark violent teleportation!<br/><br/>Among the million disciples of the Dragon Palace, the weakest one was at the level of a universe knight!<br/><br/>Among them, the most powerful dragon species were the thorned dragon species and the poisonous horned dragon species.<br/><br/>The thorned dragon species had absorbed all the resources from a few cities. Among the dragon species of the Dragon Palace, they were the strongest.<br/><br/>Next was the dragon wizard dragon species. There were 10,000 of them.<br/><br/>In addition, other than Wang Xian and the other level three universe masters, there were 36 level two universe masters in the Dragon Palace!<br/><br/>The number of universe Dominators had reached 100!<br/><br/>This required the addition of the devouring dragon!<br/><br/>This power was already considered a very powerful existence!<br/><br/>Compared to the Hundred Cities Alliance, the number of universe Dominators was much lower!<br/><br/>However, this was nothing!<br/><br/>“It’s the Dragon King!”<br/><br/>Tian Chen and Ao Yao nodded. They moved and immediately flew toward the hundred cities peak.<br/><br/>They were both rank three cosmos rulers with combat strength. It was enough for them to seal the area!<br/><br/>They did not need the dragon sorcerer and the thorned dragon species to follow.<br/><br/>On the contrary, the thorned dragon species and dragon sorcerer might alert the enemy if they followed.<br/><br/>It was hard for them to be discovered!<br/><br/>The moment they sealed the entire space, the Hundred City Alliance would not be able to escape to their Cosmos God Nation!<br/><br/>“Dragon King, it has been sealed off!”<br/><br/>More than half an hour later, the Heaven Array and Ao Yao sent a message over!<br/><br/>Wang Xian revealed a smile as his gaze swept across all the members of the Dragon Palace behind him.<br/><br/>“Let’s go. Today, we will destroy the Hundred Cities Alliance!”<br/><br/>Wang Xian gave a light shout. His figure moved and the prieless sacred wings appeared behind him. A wave of energy enveloped all the disciples of the Dragon Palace!<br/><br/>“Destroy the Hundred Cities Alliance!”<br/><br/>The members of the Dragon Palace roared loudly. They immediately flew forward.<br/><br/>With the power of the incipient saint wings, their speed was extremely terrifying!<br/><br/>They flew along the way.<br/><br/>“What is that?”<br/><br/>Halfway through the journey, more than ten figures were flying in the sky. When they saw the experts of the Dragon Palace flying in the direction of the Hundred Cities Peak, they revealed a shocked expression.<br/><br/>“What a powerful force! What Force are they?”<br/><br/>Sensing the power of the Dragon Palace, the figures were shocked.<br/><br/>“What a rich aura of the Divine Dragon! They are from the Divine Dragon Bloodline!”<br/><br/>An expert in the center sensed it and growled in a low voice.\t\t\t\t\t\t</div>", "images": {}, "success": true}