{"id": 555, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073011.html", "title": "Chapter 3546 - 3546 3545, An Expert From The Ancestral Dragon Clan", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3546 - 3546 3545, An Expert From The Ancestral Dragon Clan</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3546 3545, an expert from the ancestral dragon clan<br/><br/>“Dragon King, the Sacred Dragon Clan has made such a declaration. It’s obvious that they want to declare war on us!”<br/><br/>All the members of the Dragon Palace had received this message.<br/><br/>Prime Minister Gui raised his eyebrows slightly when he saw this message!<br/><br/>Prime Minister Gui had also sent people to have a comprehensive understanding of the Sacred Dragon Clan!<br/><br/>According to his analysis, the Dragon Palace had nothing to fear at the moment!<br/><br/>The most important thing was that the strength of the Dragon King, the king of water touch and the heaven array could not be measured by common sense!<br/><br/>“If he wants to fight, we will fight with them!”<br/><br/>Wang Xian said calmly. They did not take the statement of the Holy Dragon lineage to heart.<br/><br/>With his current strength, even if the Holy Dragon King came, Wang Xian had a 70% chance of destroying him.<br/><br/>If he added the water touch king, Wang Xian had a 100% chance of killing him!<br/><br/>Although the Holy Dragon King had killed the leader of the ancestral dragon lineage, he did not believe that the other party was his opponent!<br/><br/>Especially after adding the water touch king!<br/><br/>One had to know that the Water Touch King was a space beast at the level of a true universe dominator. Now that she had recovered to the peak of a universe knight, she could not be compared to those of the same level!<br/><br/>An old monster like her who had been active for tens of billions of years had a terrifying accumulation and talent!<br/><br/>In Wang Xian’s opinion, the leader of the ancestral dragon lineage would at most be fifty-fifty with the king of water tentacles when using an innate supreme treasure!<br/><br/>After all, the king of water tentacles’previous realm and strength were all there!<br/><br/>“Tell all the disciples of our Dragon Palace to come back and get ready for battle at any time!”<br/><br/>Wang Xian instructed!<br/><br/>If it wasn’t for the fact that the base of the Holy Dragon lineage was located at the Divine Mountain of light, Wang Xian would have been prepared to visit their base!<br/><br/>He wanted to experience the strength of the Holy Dragon King!<br/><br/>However, the other party was located at the Divine Mountain of light. The defense and attack methods of that place would definitely be able to destroy Wang Xian easily!<br/><br/>However, as long as they made a move, as long as they said they were going to start a war, the Dragon Palace would accompany them to the end!<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded his head.<br/><br/>“Let me contact the ancestral dragon lineage and see what reaction they have!”<br/><br/>Wang Xian took out the universal AI and sent a message to the Azure Dragon Whisker Shadow and the rest!<br/><br/>“Hiss, the Holy Dragon lineage is about to take action. Those who submit to me will prosper and those who defy me will perish. The Holy Dragon King is trying to unify the Holy Dragon Lineage!”<br/><br/>“Unify the Holy Dragon lineage. The Holy Dragon King wants to be the king of the Holy Dragon Lineage!”<br/><br/>“The war is about to start again. There are still many experts in the ancestral dragon bloodline, especially the trusted aides of the leader of the ancestral dragon bloodline. I guess a big war will break out!”<br/><br/>“The leader of the ancestral dragon bloodline is dead. How long can the ancestral dragon bloodline last? And this time, the Dragon Palace is also involved. The Sacred Dragon bloodline obviously wants to destroy the Dragon Palace!”<br/><br/>“The battle for the throne of the Divine Dragon Tribe has begun. However, once the Holy Dragon tribe wins, I reckon that the Divine Dragon tribe will never be able to return to their peak in the future!”<br/><br/>“When the leader of the ancestral dragon tribe was still around, there was still hope for him to bring the Divine Dragon tribe back to their peak. Now that he has fallen, it’s basically impossible for the Divine Dragon tribe to return to their peak!”<br/><br/>When Wang Xian contacted the Azure Dragon Whisker Shadow and the rest, countless powerful disciples from various factions were discussing on the universal ai!<br/><br/>In the heaven-splitting primordial land, many living beings were very impressed by the leader of the ancestral dragon!<br/><br/>They were very impressed by the strength and ambition of the leader of the ancestral dragon!<br/><br/>In their opinion, the leader of the ancestral dragon was the only hope of the Divine Dragon Clan!<br/><br/>As for the Holy Dragon King, he had become a lackey. Once he unified the Divine Dragon Clan, it meant the decline of the Divine Dragon Clan!<br/><br/>But now that the leader of the ancestral Dragon Clan had fallen, the hope of the Divine Dragon Clan had been destroyed by more than half!<br/><br/>As for the Dragon Palace and the Dragon King, they didn’t think that the Dragon King was very strong!<br/><br/>They didn’t think that the hope of the Divine Dragon Clan was in the Dragon Palace.<br/><br/>The main thing was that even though the leader of the ancestral Dragon Clan had died, in their eyes, the ancestral dragon clan was still much stronger than the Dragon Palace.<br/><br/>The Dragon Palace was still the weakest of the three!<br/><br/>Therefore, the experts of the other races in the universe weren’t optimistic about the Dragon Palace!<br/><br/>At the same time, at the bottom of the ocean in the land of mountains and seas, there was a Dragon Palace!<br/><br/>It was a Golden Dragon Palace that was emitting majestic power!<br/><br/>In the Dragon King Palace of the Golden Dragon Palace, hundreds of experts of the ancestral dragon bloodline were gathered here!<br/><br/>Among them, Green Dragon Beard Shadow and Green Dragon Moon were all here!<br/><br/>On the Dragon Throne of the Dragon Emperor Palace, there sat a tall and sturdy old man in the shape of a human, with a pair of towering dragon horns on his head!<br/><br/>This was a senior of the ancestral dragon lineage, a great being of the ancestral dragon lineage who had the combat power of a universe ruler at level three.<br/><br/>He was also currently one of more than 10 great beings of the ancestral dragon lineage who had the combat power of a universe ruler at level three!<br/><br/>More than 100 Great Beings of the ancestral dragon bloodline were gathered here!<br/><br/>The death of the leader of the ancestral dragon bloodline and the announcement by the Sacred Dragon Bloodline made the Pinnacle Great Beings of the ancestral dragon bloodline unable to sit still!<br/><br/>The disciples of the Ancestral Dragon Bloodline, who had been scattered, began to gather!<br/><br/>“Senior Golden Dragon Emperor, we must avenge our leader!”<br/><br/>In the Dragon Emperor Palace, an old man stood in front and said with a face full of grief and indignation, “We must fight the sacred dragon bloodline to the end. Even if we have to die, we must make them pay the price!”<br/><br/>“The death of our leader is a deep-seated blood feud for all the disciples of the ancestral dragon bloodline. We will naturally take revenge.”<br/><br/>The burly old man on the dragon throne was expressionless. To be able to cultivate to such a realm, he no longer had the so-called impulse and fury!<br/><br/>He looked at all the disciples of the Holy Dragon bloodline in the hall as if he was looking at his own children!<br/><br/>“What we have to face now is how to fight against the Holy Dragon Bloodline.”<br/><br/>He said slowly!<br/><br/>He knew very well that their leader’s death had put them in a disadvantageous position. They were no longer a match for the Holy Dragon Bloodline!<br/><br/>What they should consider now was how to deal with the attack of the Holy Dragon Bloodline!<br/><br/>“Senior Golden Dragon King, where are the other seniors? If we join forces, it won’t be that easy for the Holy Dragon bloodline to deal with us, right?”<br/><br/>One of the ancestral dragon lineage asked.<br/><br/>“Out of the other dozen or so, three of them are in seclusion. We don’t know where they are and the rest are gathering. This time, we will work together. When the time comes, we will discuss how to counterattack!”<br/><br/>The Golden Dragon King did not hide anything.<br/><br/>“Senior Golden Dragon King, we have just received a message from the Dragon King of the Dragon Palace. The Dragon King of the Dragon Palace is asking us how to deal with the attack of the Holy Dragon lineage. I think we can work together with the Dragon Palace!”<br/><br/>At this moment, the Green Dragon Xu Ying in the middle saw the message sent by Wang Xian and said!<br/><br/>“Oh? The Dragon Palace? Xu Ying, do you know the Dragon King of the Dragon Palace?”<br/><br/>The Golden Dragon King’s eyes flickered as he asked.<br/><br/>“Yes, we have a good relationship with the Dragon King. Moreover, the Dragon King of the Dragon Palace is on the same side as us.”<br/><br/>The Green Dragon Xu Ying nodded.<br/><br/>“According to the strength displayed by the Dragon Palace, they should have at least three universe Dominators with level-three combat strength. They are indeed a great combat strength. where is the Dragon Palace Now?”<br/><br/>The Golden Dragon King asked.<br/><br/>“It’s at the river of Eternity.”<br/><br/>The Green Dragon Shadow replied.<br/><br/>“The river of Eternity is too far. It will take more than a year to fly there.”<br/><br/>The Golden Dragon King frowned!\t\t\t\t\t\t</div>", "images": {}, "success": true}