{"id": 554, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073009.html", "title": "Chapter 3545 - 3545 3544 Wanted To Rule Over The Divine Dragon Lineage!", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3545 - 3545 3544 Wanted To Rule Over The Divine Dragon Lineage!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3545 3544 wanted to rule over the divine dragon lineage!<br/><br/>“Let’s go back to the Dragon Palace First!”<br/><br/>After receiving the news that the leader of the ancestral dragon lineage was killed, Wang Xian did not continue his closed-door cultivation.<br/><br/>There should be some changes in the divine dragon lineage.<br/><br/>The Dragon Palace had a grudge against the divine dragon lineage. Now that the leader of the ancestral dragon lineage was killed, it could be said that the ancestral dragon lineage had lost this war!<br/><br/>Would the Holy Dragon lineage deal with the Dragon Palace next?<br/><br/>Would the holy dragon lineage make a huge move against the Holy Dragon lineage?<br/><br/>Although it was not clear yet, the dragon palace had to make some preparations!<br/><br/>The group of girls nodded their heads. They moved and returned to the Dragon Palace!<br/><br/>“Dragon King!”<br/><br/>Upon arriving at the Dragon Palace, Prime Minister Gui immediately came to Wang Xian and greeted him respectfully!<br/><br/>“Yes!”<br/><br/>Wang Xian nodded. “How’s the improvement of the purebred divine dragons in the Dragon Palace?”<br/><br/>“Dragon King, their combat strength has already reached the peak of a universe Knight.”<br/><br/>Prime Minister Gui immediately reported!<br/><br/>In the past one thousand years, every time Wang Xian obtained some blood refinement fruits, he would send the fruits to the dragon palace, allowing some of the disciples of the Dragon Palace to transform into purebred divine dragons!<br/><br/>In the past 1,000 years, the number of purebred divine dragons in the Dragon Palace had reached 2,000!<br/><br/>2,000 purebred divine dragons. Even when the ancestral dragon lineage and the Holy Dragon Lineage were added together, there were not so many of them.<br/><br/>Furthermore, the resources of the Dragon Palace were mainly focused on them, allowing them to reach the peak combat strength of a universe knight.<br/><br/>Out of the 2,000 pure-bred divine dragons, a mutated Divine Dragon was born!<br/><br/>Frost Divine Dragon!<br/><br/>Northern Frost!<br/><br/>Northern Frost was the only female disciple of Wang Xian. She had a mutated frost physique.<br/><br/>In the past, after she joined the Dragon Palace, she had the chance to become a mutated frost divine dragon.<br/><br/>But in the end, there was still something missing!<br/><br/>Now, this missing thing had been made up. Out of the 2,000 pure-bred divine dragons, northern frost became the only mutated divine dragon.<br/><br/>Mutated godly dragons were exceptionally powerful.<br/><br/>However, at the moment, they only had the combat power of a level-two universe ruler.<br/><br/>It was not easy for them to break through to the universe ruler realm.<br/><br/>However, when she reached the Pinnacle Universe Knight realm, she was able to fight against a great being at the universe ruler realm.<br/><br/>She still needed a lot of resources to get to this step!<br/><br/>“Prime Minister Gui, give the order to pay more attention to the situation of the Holy Dragon lineage and the ancestral dragon lineage. If they make any moves, we should be prepared!”<br/><br/>Wang Xian continued to instruct Prime Minister Gui.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded.<br/><br/>Wang Xian took out the universe AI and sent some messages to the Green Dragon, Moon, and Azure Dragon.<br/><br/>The leader of the ancestral dragon lineage had been killed. He wanted to know where the rest of the experts and disciples of the ancestral dragon lineage would go!<br/><br/>The Azure Dragon, Xu Ying, and the rest replied very quickly. For the time being, the ancestral dragon lineage did not have any reaction!<br/><br/>Currently, the ancestral dragon lineage was leaderless. However, there were still more than a dozen level 3 universe masters with combat strength in the ancestral dragon lineage. They were still waiting for the orders of these seniors.<br/><br/>Whether they wanted to avenge their leader or something else, they would have to wait for these seniors to make the necessary arrangements!<br/><br/>As for the other great beings of the godly dragon lineage, they did not have the power and authority to reunite them!<br/><br/>Obviously, the death of their leader, coupled with the fact that the ancestral dragon lineage had been separated for a long time, did not cause any reaction from the ancestral dragon lineage!<br/><br/>“Now that the ancestral dragon lineage is leaderless, I give the order that the Holy Dragon lineage will unify the godly dragon lineage. Those who do not join the Holy Dragon lineage will become the enemies of the Holy Dragon lineage. As for the enemies, the Holy Dragon lineage will directly eliminate them!”<br/><br/>At the same time, in the old dynasty of the Holy Dragon bloodline of the Divine Light Mountain, the Holy Dragon King gave an order. His eyes were filled with coldness.<br/><br/>Currently, the Holy Dragon bloodline only had the ancestral dragon bloodline of the Divine Light Dragon and the three forces of the Dragon Palace.<br/><br/>The leader of the ancestral dragon bloodline had been killed, so he was no longer a threat.<br/><br/>And once the leader of the ancestral dragon bloodline died, in the eyes of the Holy Dragon King, no one could threaten them.<br/><br/>The ancestral dragon bloodline was their enemy, not to mention the Dragon Palace, they were also enemies!<br/><br/>Since they were all enemies, they would either submit or Die!<br/><br/>While the leader of the ancestral dragon bloodline was killed, they would completely unify the Divine Dragon Bloodline!<br/><br/>As long as they unified the Divine Dragon Bloodline, he would be the king of the Divine Dragon Bloodline!<br/><br/>Therefore, he gave such an order.<br/><br/>The people of the Divine Dragon bloodline would either join the Divine Dragon bloodline or Die!<br/><br/>“It’s the Divine Dragon King!”<br/><br/>The experts of the divine dragon lineage replied excitedly.<br/><br/>“Haha, once we destroy them or not, we will represent the Divine Dragon Clan. The Divine Dragon Clan will also be renamed the Divine Dragon Clan!”<br/><br/>The Divine Dragon King laughed loudly, his eyes bursting with excitement!<br/><br/>“Father, give all the members of the Divine Dragon lineage one year to consider. One year later, I will personally go out and complete the great cause of unifying the divine dragon clan for Father!”<br/><br/>Below, the son of the Holy Dragon said with a face full of respect and fighting spirit!<br/><br/>“Alright!”<br/><br/>The holy dragon king smiled, “Once the leader of the ancestral dragon lineage dies, I will give you an innate treasure and no one will be your match. The Holy Dragon lineage will definitely be able to unify the Dragon God lineage. However, the only pity is that I didn’t get any information about the ancestral dragon kingdom from the ancestral Dragon King!”<br/><br/>“Ancestor Water Dragon’s divine kingdom isn’t that easy to obtain. However, in the future, Ancestor Water Dragon’s divine kingdom will definitely belong to father!”<br/><br/>The Holy Dragon Son flattered!<br/><br/>The Holy Dragon King nodded slightly and smiled.<br/><br/>Ancestor Water Dragon’s divine kingdom was after all a disciple of the divine dragon bloodline. It was impossible for others to covet it!<br/><br/>As long as he unified the Divine Dragon Bloodline, then Ancestor Water Dragon’s divine kingdom would definitely belong to him!<br/><br/>…<br/><br/>On the universe’s AI, the death of the ancestor dragon lineage’s leader was still the most shocking news!<br/><br/>Countless powerful disciples from various factions were discussing.<br/><br/>Not long after, another piece of news caused another huge commotion!<br/><br/>This news was released by the Holy Dragon lineage!<br/><br/>The Holy Dragon lineage was recruiting all the Dragon God lineage members, and in a year’s time, they would completely destroy the holy dragon lineage’s enemies!<br/><br/>This piece of news shocked many great beings.<br/><br/>The meaning of the Holy Dragon bloodline’s announcement was very obvious. They wanted to unify the Holy Dragon Bloodline!<br/><br/>Those who joined the Holy Dragon bloodline within a year were not enemies. Those who did not join were all enemies.<br/><br/>Everyone was shocked by this piece of news from the Holy Dragon Bloodline, but at the same time, they felt that it was natural!<br/><br/>Currently, the Holy Dragon lineage was the strongest, especially the Holy Dragon King. He was almost invincible under the realm of the universe’s ruler!<br/><br/>After the leader of the ancestral dragon lineage was killed by him, he was considered an invincible existence in the Holy Dragon lineage!<br/><br/>It was reasonable for an invincible existence to make such a statement!<br/><br/>Very soon, this news spread throughout the entire AI brain of the universe.<br/><br/>Wang Xian was the first to receive this news.<br/><br/>As expected, the Holy Dragon lineage was about to make a move against all the other disciples and powerhouses of the Holy Dragon lineage!\t\t\t\t\t\t</div>", "images": {}, "success": true}