{"id": 552, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073005.html", "title": "Chapter 3543 - 3543 3542, A Thousand Years! The Death Of The Leader Of The Ancestral Dragon!", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3543 - 3543 3542, A Thousand Years! The Death Of The Leader Of The Ancestral Dragon!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3543 3542, a thousand years! The death of the leader of the ancestral dragon!<br/><br/>Wang Xian had the idea of creating a purebred divine dragon army in his mind. He was ready to take action immediately.<br/><br/>He called Guan Shuqing and the other girls over. Wang Xian explained the situation to them.<br/><br/>After all, they would be in seclusion for at least 500 years this time. They had not been separated for so long!<br/><br/>Wang Xian was not even 100 years old yet!<br/><br/>In the heaven-opening primordial land, he was still a child who had not been weaned!<br/><br/>Since he would be in seclusion for such a long time this time, he naturally had to say something!<br/><br/>However, he did not need to cultivate all the time this time. He only needed to stay there and watch.<br/><br/>He could move around, but he could not go too far away!<br/><br/>Guan Shuqing and the other girls naturally had no objections. However, they had to stay by his side.<br/><br/>Such a matter was not a big problem.<br/><br/>In the following period of time, Wang Xian sent the Heaven Formation and began to set up the teleportation formation.<br/><br/>From the river of eternity to the land of the devil bones, the teleportation formation of the Land of blood!<br/><br/>Due to the distance being too far away, at least dozens of teleportation formations had to be set up for transit. Furthermore, it would take three to four years to set up.<br/><br/>Wang Xian did not wait for him to set up the teleportation formation. Instead, he brought the girls and flew towards the land of the Devil Bones!<br/><br/>When they arrived at the land of the demonic bone, Wang Xian brought them to the underground. Following that, the branches of the ancestral tree extended downwards and began to condense the blood refinement fruit!<br/><br/>Guan Shuqing and the group of girls began to build the surroundings.<br/><br/>Not long after, they turned this place into a cozy little palace!<br/><br/>At the top of the palace, the king of Water Touch was lying there silently as a guarding demonic beast!<br/><br/>The only ones who dared to build a palace in the land of blood plasma were Wang Xian and the rest!<br/><br/>Even the spirit demon king and the rest did not dare to be so impudent in the Land of blood plasma!<br/><br/>However, Wang Xian did not have any scruples!<br/><br/>Even if there was a real ruler of the universe in the land of Devil Bones!<br/><br/>With Wang Xian’s own strength and the king of water tentacles, he was completely capable of resisting a real ruler of the universe.<br/><br/>This was not Wang Xian’s own guess, but what the king of water touch said.<br/><br/>After all, she was once a space beast that was at the level of a true ruler of the universe!<br/><br/>Wang Xian, the five elements millstone, the incipient sacred wings, the Tai Chi Dragon Disc, the Netherworld Ghost Avatar, the Spirit Spirit, and the king of water touch had too many terrifying trump cards!<br/><br/>Following that, Wang Xian and the rest settled down in the land of blood!<br/><br/>The fruit of blood refinement could be produced once every half a year.<br/><br/>Time passed quickly. Wang Xian and the rest entertained themselves and cultivated in groups every day.<br/><br/>As for what was meant by cultivating in groups?<br/><br/>Did they understand dual cultivation?<br/><br/>Wang Xian and the rest were prepared to ask for some little divine dragons when they reached the level of a true universe overlord!<br/><br/>Time passed very quickly in the universe. The interior of the heaven-splitting chaotic land had also sunk into a short period of peace!<br/><br/>The battle formation between the Dragon Palace and the Hundred Cities Alliance had already ended.<br/><br/>The war between the ancestral dragon lineage and the Holy Dragon lineage, other than the fights between some disciples, did not have the battle prowess of a Master of the universe!<br/><br/>Five hundred years passed very quickly. Wang Xian had accumulated nearly a thousand blood refinement fruits in his hands!<br/><br/>However, Wang Xian did not stop.<br/><br/>That was because for the time being, there was nothing much happening in the Dragon Palace.<br/><br/>The members of the Dragon Palace also stepped into the inner parts of the heaven-opening primordial land to begin their training.<br/><br/>Most of them entered the mountains and seas. The Sea was the ultimate home of the Divine Dragon Clan.<br/><br/>The Divine Dragon Clan once occupied the Divine Dragon Island in the mountains and seas. No one knew what the current situation of the Divine Dragon Island was like.<br/><br/>Five hundred years passed, but Wang Xian did not stop.<br/><br/>One Glance, one thousand years. Very soon, one thousand years had passed!<br/><br/>“Hahaha, Ancestral Dragon King, I’m finally going to kill you. I’m finally going to kill you!”<br/><br/>At the same time, on the beach at the edge of the sea in the land of mountains and seas, a maniacal laughter rang out.<br/><br/>A divine divine dragon of light was suspended in the air. Around him was a dazzling dragon pearl.<br/><br/>Beside the Dragon Ball was a pair of terrifying dragon eyes of light!<br/><br/>Not only that, beside the Dragon Ball and the two dragon eyes was a book, a book of light.<br/><br/>On it was written the book of Taboo!<br/><br/>Beside the book of Taboo was the mountain of light.<br/><br/>Every treasure contained a terrifying energy!<br/><br/>Every single one of them was at the level of an innate supreme treasure.<br/><br/>The four innate supreme treasures floated around the Sacred Dragon King, causing his aura to be extremely terrifying!<br/><br/>Below him, there were five corpses, and each of them was a pure-blooded divine dragon.<br/><br/>There were two light divine dragons, one Earth Divine Dragon, one Golden Dragon, and one fire dragon. Right in the middle of these five divine dragon corpses, there was a gigantic divine dragon!<br/><br/>Water Divine Dragon!<br/><br/>The leader of the ancestral dragon lineage!<br/><br/>At this moment, his entire body was extremely weak, and his body was filled with tragic wounds!<br/><br/>“If I wasn’t severely injured, how could I be killed by a lackey like you, a thing that defiled the bloodline of the Divine Dragon!”<br/><br/>The leader of the ancestral dragon said with a face full of unwillingness.<br/><br/>He was unwilling to die in the hands of a lackey!<br/><br/>“Lackey? You’re courting death. In the future, I will spread your bones in my Dragon King Hall, and I will trample you under my feet for all eternity!”<br/><br/>Upon hearing his words, the Holy Dragon King roared furiously!<br/><br/>“Hahaha, a lackey is a lackey. You have forgotten the glory of your ancestor’s bloodline. Although I will die today, the glory of My Divine Dragon bloodline will never be covered by dust. In the future, there will be a divine dragon who will behead you to wash away the pollution of your Lackey’s Divine Dragon Bloodline!”<br/><br/>The leader of the ancestral dragon roared with wild laughter.<br/><br/>He firmly believed that the glory of the Divine Dragon bloodline would eventually come!<br/><br/>“You talk too much nonsense. Die for this king!”<br/><br/>When the Holy Dragon King heard the leader of the ancestral dragon, his eyes were filled with fury. He waved his dragon claws and the dragon pearl above his head directly attacked the leader of the ancestral dragon.<br/><br/>The leader of the ancestral dragon looked at this attack indifferently and quickly sent out messages.<br/><br/>“Boom!”<br/><br/>With a heavy blow, the leader of the ancestral dragon’s life force slowly disappeared!<br/><br/>The leader of the ancestral dragon, who had great ambitions and inherited the will of the Divine Dragon, had fallen!<br/><br/>This meant that the divine dragon lineage had disappeared for an era.<br/><br/>It meant that the divine dragon lineage had lost their faith!<br/><br/>“Hahaha, the divine dragon lineage, this king is respected. The Ancestral Dragon King, die!”<br/><br/>The Sacred Dragon King looked at the corpse below and couldn’t help but laugh maniacally.<br/><br/>He had finally killed the ancestor dragon!<br/><br/>In the future, the Dragon God lineage wouldn’t be his match!<br/><br/>As for the Dragon Palace, how could the dragon king compare to the Glorious Ancestor Dragon King?<br/><br/>The leader of the ancestor dragon lineage had been killed, the Sacred Dragon King naturally wouldn’t hide this news!<br/><br/>And very quickly, the picture of the leader’s corpse was sent to the universe AI.<br/><br/>On this day, 10,000 Dragons roared!<br/><br/>Countless godly dragons shed tears, and countless disciples of the ancestral dragon bloodline cried out in grief!<br/><br/>They roared in anger!<br/><br/>They never thought that their leader would be killed by Sacred Dragon Emperor!<br/><br/>However, the Ancestral Dragon Bloodline’s universe master level warrior received a message from the leader of the ancestral dragon bloodline!<br/><br/>There was only one message. It was not to avenge him, nor was it to destroy the Holy Dragon Bloodline.<br/><br/>It was to be careful of the Phoenix!\t\t\t\t\t\t</div>", "images": {}, "success": true}