{"id": 559, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073019.html", "title": "Chapter 3550 - 3550 3549’S Next Target, Dragon Palace!", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3550 - 3550 3549’S Next Target, Dragon Palace!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3550 3549’s next target, Dragon Palace!<br/><br/>“Holy Dragon Son, where’s our next target?”<br/><br/>In the sky above the water cloud race, Holy Dragon Son was smiling as he looked at some information on the universe ai!<br/><br/>Not long after, Great Beings from the Holy Dragon lineage flew over and asked!<br/><br/>“Next target!”<br/><br/>Holy Dragon Son’s eyes flickered.<br/><br/>He had a lot of information in his hands, and he also knew the location of the Dragon Palace where the three universe masters of the Ancestral Dragon Branch with level-three Combat Power were located!<br/><br/>If he went over now, he was confident that he could easily destroy them!<br/><br/>As for the others, with the Xun Dragon ruler in their hands, they would not be able to escape either!<br/><br/>“The next target will be the Dragon Palace. Since the Dragon Palace can destroy the Hundred City Alliance, there should be three or four universe masters with level-three combat power. After we destroy the Dragon Palace, there should be some sensible people from the ancestral dragon branch who will join our Holy Dragon Branch!”<br/><br/>The Holy Dragon Son made up his mind and smiled. “The target is the Dragon Palace. It’s also to prevent them from escaping. We’ll destroy them before they escape.”<br/><br/>“Maybe the Dragon Palace is already preparing to escape.”<br/><br/>An old man from the Holy Dragon lineage said with a smile!<br/><br/>“It’s possible!”<br/><br/>A great being from the Holy Dragon lineage laughed. “The Holy Dragon Son killed a universe master level 3 combat power great being so easily. The Dragon Palace must be very scared!”<br/><br/>“Hehe, regardless of whether they escaped or not, the next target will be them. This great being of the Dragon Palace killed a few pure-blooded dragons of Our Holy Dragon Bloodline. This time, I’ll take the head of the Dragon Palace Dragon King!”<br/><br/>The Holy Dragon Son sneered and looked ahead, “Let’s go, we’ll head there immediately!”<br/><br/>“Yes!”<br/><br/>The Great Beings of the Holy Dragon bloodline answered immediately!<br/><br/>Compared to the ancestral dragon bloodline, they didn’t think much of the Dragon Palace!<br/><br/>The son of the Sacred Dragon chose to destroy the Dragon Palace first because he wanted to shock the disciples of the Ancestral Dragon Bloodline!<br/><br/>Because the ancestral dragon bloodline had been separated, many disciples didn’t have a strong sense of belonging to the ancestral dragon bloodline!<br/><br/>At this time, destroying the Dragon Palace to establish their prestige would allow more divine dragon species to join the Sacred Dragon Bloodline!<br/><br/>The Sacred Dragon Bloodline welcomed dragon descendants with the bloodline of the Divine Dragon!<br/><br/>It would take dozens of years to fly from the sleeping Dragon Lake to the river of Eternity!<br/><br/>It would take more than a year even through the teleportation array!<br/><br/>The son of the Sacred Dragon was worried that the Dragon King of the Dragon Palace was too cowardly and led the experts and disciples of the Dragon Palace to escape!<br/><br/>…<br/><br/>“Dragon King, two green dragons are here to pay their respects!”<br/><br/>Just as the Holy Dragon Son and the rest of the experts were rushing toward the Dragon Palace, two guests arrived at the Dragon Palace!<br/><br/>Green Dragon Whisker Shadow and Green Dragon Moon!<br/><br/>It took them more than a year to get here from the Golden Dragon Palace!<br/><br/>“Huh?”<br/><br/>When Wang Xian heard Prime Minister Gui’s report, he was astonished.<br/><br/>Two Green Dragons. That must be the Green Dragon Whisker Shadow and Green Dragon Moon!<br/><br/>The two of them didn’t inform him in advance when they arrived!<br/><br/>“Let them in!”<br/><br/>Wang Xian instructed!<br/><br/>Prime Minister Gui nodded. Soon, the Green Dragon Whisker Shadow and Green Dragon Moon entered.<br/><br/>“Dragon King!”<br/><br/>When they arrived at the Dragon King’s Hall, the two of them cupped their hands toward Wang Xian!<br/><br/>“Brother Whisker Shadow and brother Green Dragon Moon, there’s no need to be so polite!”<br/><br/>Wang Xian looked at them and said with a smile.<br/><br/>“In the Divine Dragon Clan, the strong are respected. Brother Wang Xian has already broken through to the level three combat strength of a universe overlord. We should be like this. Furthermore, this time, we are here on behalf of the ancestral dragon lineage!”<br/><br/>Qinglongxu Ying said with a smile!<br/><br/>“On behalf of the ancestral dragon lineage?”<br/><br/>Wang Xian raised his eyebrows!<br/><br/>“Dragon King, recently, there has been bad news from our ancestral dragon lineage. I believe that Dragon King already knows that one of our universe overlords, senior que ya, who has a level three combat strength, was killed by the Holy Dragon Son and the rest.”<br/><br/>The Azure Dragon Shadow took a deep breath and said, “We came here under the orders of a Golden Dragon Senior. Now, our ancestral dragon lineage is no longer a match for the Holy Dragon lineage, especially against the Holy Dragon King. What our Golden Dragon Senior wants is to see if we can join forces to fight against the Holy Dragon lineage together!”<br/><br/>“Join forces to fight against the Holy Dragon lineage? That’s totally possible.”<br/><br/>Upon hearing their words, Wang Xian immediately nodded his head. “If the Holy Dragon lineage wants to unify the Holy Dragon tribe, those who follow me will prosper and those who defy me will perish. Since you are dead and I am dead, Let’s join forces to deal with them!”<br/><br/>“Dragon King, our Golden Dragon Seniors also have the same idea. However, there is one thing that we can not be sure of at the moment. That is, if we join forces, we will be able to withstand the attacks of the Holy Dragon Lineage!”<br/><br/>The figure with the azure dragon beard said, “The reason why the experts of the Holy Dragon lineage have not joined forces is that we do not have the confidence to deal with the Holy Dragon King. Once we join forces, we might be wiped out in one fell swoop!”<br/><br/>“Hehe, if we join forces, it will definitely be easy for us to deal with the Holy Dragon lineage.”<br/><br/>Upon hearing his words, Wang Xian said with a face full of confidence.<br/><br/>With the current strength of the Dragon Palace, Wang Xian dared to fight against the Holy Dragon lineage. If the experts from the ancestral dragon lineage were included, he was confident that he could suppress and even defeat the other party!<br/><br/>“HMM?”<br/><br/>When the Green Dragon Whisker Shadow, Green Dragon Moon, saw Wang Xian’s confident expression, he revealed a look of surprise.<br/><br/>“Then, we will send the news to our Golden Dragon Senior. As for the details of the alliance, we will need the Dragon King to discuss it with our Golden Dragon Senior!”<br/><br/>The Azure Dragon Whiskered Shadow said!<br/><br/>Wang Xian nodded his head!<br/><br/>The alliance with the ancestral dragon lineage would be easy to fight against the Holy Dragon lineage, Wang Xian thought!<br/><br/>Perhaps the only problem would be whether the angel race would send some high-level races to assist the Holy Dragon lineage!<br/><br/>There were quite a number of high-level races that were affiliated to the angel race.<br/><br/>The Holy Dragon lineage was only affiliated to them recently. Among their affiliated races, there were some that were comparable to the holy dragon lineage. In fact, they were even stronger than the Holy Dragon lineage!<br/><br/>After all, the rise of the lineage of the Holy Dragon did not last long!<br/><br/>The former leader of the ancestral dragon might have thought of this as well. This was also one of the reasons why he did not gather the disciples of the ancestral dragon experts!<br/><br/>The other experts of the ancestral dragon also understood!<br/><br/>However, since the situation had reached this stage, there were some concerns that could not be considered!<br/><br/>“Dragon King, you can access the universal AI. Our Golden Dragon Senior and the other lords would like to contact you through the Universal Ai!”<br/><br/>Soon, Azure Dragon Moon spoke to Wang Xian.<br/><br/>“Alright!”<br/><br/>Wang Xian nodded and Azure Dragon Moon pulled him into a group chat.<br/><br/>There were fifteen people in the group chat.<br/><br/>Wang Xian’s mind entered the universe’s AI. His vision changed and a special space appeared in front of him!<br/><br/>“Welcome, Dragon King!”<br/><br/>In the space, there were the shadows of thirteen divine dragons and dragon seeds. When they saw Wang Xian appearing, they greeted him!<br/><br/>“Greetings, Dragon Kings of the ancestral dragon lineage!”<br/><br/>Wang Xian swept his gaze across them. Among the top five dragon seeds, there was actually a berserk dragon seed!<br/><br/>There were pure-blooded divine dragons of gold, wood, water, fire, Earth, wind, thunder, and darkness, but there was no divine dragon of light!\t\t\t\t\t\t</div>", "images": {}, "success": true}