{"id": 551, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073003.html", "title": "Chapter 3542 - 3542 3541 Pure-Blooded Divine Dragon Legion, Mutated Divine Dragon!", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3542 - 3542 3541 Pure-Blooded Divine Dragon Legion, Mutated Divine Dragon!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3542 3541 pure-blooded Divine Dragon Legion, mutated Divine Dragon!<br/><br/>Move aside, Dragon Palace!<br/><br/>“The Dragon Palace has moved? Are they really going to enter our inner continent?”<br/><br/>“Not long ago, the Dragon Palace seemed to be at the edge of the continent. Where did they move to this time?”<br/><br/>When the Dragon Palace entered the inner continent of the heaven-opening primeval continent!<br/><br/>When the Dragon Palace flew in the sky unscrupulously, it caused quite a stir.<br/><br/>After all, how could a huge dragon palace fly over cities and races without attracting attention!<br/><br/>At the beginning, some powerful experts wanted to get close.<br/><br/>Some high-level races even forbade flying in the sky.<br/><br/>However, when the experts of the Dragon Palace showed their power, no one dared to get close.<br/><br/>Some high-level races also quietly watched the Dragon Palace pass by, not daring to stop it!<br/><br/>Some races even sent experts to welcome the Dragon Palace when they saw it pass by!<br/><br/>Now, after the Dragon Palace destroyed the Hundred Cities Alliance, they had a place in the entire universe!<br/><br/>They traveled quickly through the interior of the heaven opening primal continent, and time passed day by day.<br/><br/>It was rare for Wang Xian to have the time to accompany a group of girls to rest in the Dragon Palace!<br/><br/>On the universe’s artificial intelligence system, many powerhouses were filled with curiosity about the location of the Dragon Palace’s migration.<br/><br/>Some said that it was the headquarters of the Hundred Cities Alliance, while others said that it was somewhere else.<br/><br/>The entire universe’s artificial intelligence system was in a heated discussion.<br/><br/>The Dragon Palace’s migration this time took less time than expected!<br/><br/>More than a year later, they arrived at the river of eternity.<br/><br/>The water from the sky descended, and the Dragon Palace slowly landed here.<br/><br/>It landed in front of that Paradise!<br/><br/>The river of Eternity was a branch of the mountains and seas, and from here, one could directly enter the mountains and seas!<br/><br/>This was the ideal habitat for the Dragon Palace!<br/><br/>The Dragon Palace was located in the river of eternity. Within a few days, all the other forces in the mainland knew about it.<br/><br/>On the same day, the leader of the Thunder Ray tribe and the rest came to visit.<br/><br/>Wang Xian greeted them!<br/><br/>“Dragon King, what are our actions now?”<br/><br/>Prime Minister Gui asked as the Dragon Palace had settled down in the river of eternity.<br/><br/>Now that the Dragon Palace was powerful enough, the next development would be the same!<br/><br/>“Let’s settle down for now. If there are any disciples of the Dragon Palace who want to gain experience, let them enter the mountains and seas.”<br/><br/>Wang Xian instructed.<br/><br/>The strongest enemy of the Dragon Palace, the Hundred Cities Alliance, had been destroyed. There were no more enemies left!<br/><br/>As for the Holy Dragon lineage, he was not prepared to join the war between the ancestral dragon lineage and the Holy Dragon lineage because of the great distance between them.<br/><br/>Most importantly, up till now, Wang Xian still did not know where the battlefield between the ancestral dragon lineage and the Holy Dragon lineage was!<br/><br/>Now that the ancestral dragon lineage and the Holy Dragon Lineage were in a dispute, the leader of the ancestral dragon lineage did not say that he would gather all the ancestral dragon disciples to prepare for a great battle.<br/><br/>It was as if the battlefield of their group of powerhouses was in a very distant place!<br/><br/>In that case, there was no need for Wang Xian to join them directly.<br/><br/>After all, he had never met the leader of the ancestral dragon before!<br/><br/>“Also, I would like to announce that the dragon palace will be recruiting disciples with the bloodline of the Divine Dragon. Some demonic beasts of the water tribe can also come to the Dragon Palace. As long as they can pass the Dragon Gate, they can also join the Dragon Palace!”<br/><br/>Wang Xian instructed Prime Minister Gui.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded.<br/><br/>“Also, summon Lei Ming, the Water Dragon King, the Water Dragon Queen, the Fire Dragon, Ao Feng, the Divine Light Dragon, the Divine Dark Dragon, and the Golden Dragon.”<br/><br/>Wang Xian continued to instruct.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded.<br/><br/>Soon, a group of pure-blooded dragon species from the Dragon Palace flew over.<br/><br/>Currently, the Dragon Palace had seven types of divine dragons: Golden Dragons, water dragons, fire dragons, wind dragons, Thunder Dragons, light dragons, and Darkness Dragons.<br/><br/>Adding them up, there were a total of twenty of them!<br/><br/>Twenty pure-blooded divine dragons. That was not a large number.<br/><br/>“Greetings, Dragon King!”<br/><br/>The group of pure-blooded divine dragons bowed respectfully!<br/><br/>“Currently, there are already twenty pure-blooded divine dragons among you. Next, the Dragon Palace will create an army of pure-blooded divine dragons. After all, the foundation of the Divine Dragons is still pure-blooded divine dragons.”<br/><br/>Wang Xian looked at them, with a smile on his face, he said, “I have a treasure in my hands that can allow more purebred divine dragons to be born in the Dragon Palace. In the next period of time, you will select a purebred divine dragon candidate from all the members of the Dragon Palace. The number of each attribute is tentatively set at 100.”<br/><br/>“Oh? It’s the Dragon King!”<br/><br/>When the thunderous water dragon king and the rest heard Wang Xian’s words, they were delighted!<br/><br/>Purebred divine dragons were the foundation of the Dragon Palace. To be able to give birth to purebred divine dragons was of great benefit to the Dragon Palace.<br/><br/>That was because only purebred divine dragons could give birth to mutated divine dragons!<br/><br/>The strength of mutated Divine Dragons was one level stronger than purebred ones!<br/><br/>Among the current dragon species, only the dragon wizard dragon species could match up to the mutated divine dragons.<br/><br/>However, the dragon wizard dragon species had a huge flaw.<br/><br/>That was, they needed to control a large number of arrays.<br/><br/>As long as they controlled a lot of arrays, they could also compete with the mutated dragon species.<br/><br/>Unfortunately, even the sky array could not compete with the mutated dragon species of the same level.<br/><br/>Apart from the mutated dragon species, the Dragon Palace also had a powerful dragon species. In the past, they could fight four levels higher than the mutated dragon species, which was comparable to the mutated dragon species.<br/><br/>But now, as their strength increased, their potential seemed to be depleting rapidly.<br/><br/>With their potential reduced, they naturally couldn’t fight by four levels.<br/><br/>That was the Heaven Thunder Earth Fire Dragon Phoenix species!<br/><br/>Currently, the only mutated divine dragons in the Dragon Clan were Wang Xian’s sister and Qing Lan!<br/><br/>They were mutated bone dragons!<br/><br/>Apart from them, the Dragon Clan also had two creatures with greater potential.<br/><br/>Little Blue and little house!<br/><br/>Little Blue and little house were nurtured by the ancient god Feeding Kun master Lan Qingyue!<br/><br/>However, only when little blue and little house grew up could they be comparable to mutated divine dragons.<br/><br/>This growth required them to devour the bloodlines of a large number of peak races.<br/><br/>This was especially true for peak races like the Divine Dragons, phoenixes, and Divine Tigers.<br/><br/>If they devoured a large number of them, they could also be comparable to mutated divine dragons!<br/><br/>Mutated divine dragons were hard to come by. However, as long as the number of purebred divine dragons increased, they would naturally mutate.<br/><br/>Therefore, purebred divine dragons were the foundation of the Divine Dragons. They had to increase their numbers!<br/><br/>“Okay, you guys go ahead!”<br/><br/>Wang Xian spoke to them!<br/><br/>The group of purebred divine dragons nodded immediately and began to prepare.<br/><br/>Wang Xian looked at the blood refinement fruit in his hand. If he were to increase the number of purebred divine dragons in the Dragon Palace by nearly a thousand, he would need a thousand blood refinement fruits.<br/><br/>If he were to absorb them in the land of blood plasma, he would need more than five hundred years!<br/><br/>“About five hundred years. In fact, five hundred years is very short in the heaven-opening primordial land. Many powerhouses spend tens of thousands of years and hundreds of thousands of years in seclusion!”<br/><br/>He muttered to himself. This time, he was prepared to enter seclusion once!<br/><br/>Once he entered the land of blood plasma, he would obtain more blood refinement fruits!\t\t\t\t\t\t</div>", "images": {}, "success": true}