{"id": 556, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073013.html", "title": "Chapter 3547 - 3547 3546 Holy Dragon Son’S Expedition", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3547 - 3547 3546 Holy Dragon Son’S Expedition</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3547 3546 Holy Dragon Son’s expedition<br/><br/>The inner part of the heaven opening primal continent was usually very far away!<br/><br/>It would take him more than a year to reach the river of eternity from his Golden Dragon King Dragon Palace.<br/><br/>And this was when he was teleported through the middle teleportation array!<br/><br/>Without the teleportation array, he would have to fly for at least seven to eight years!<br/><br/>“It is indeed a little far!”<br/><br/>Green Dragon Beard Shadow and the others also frowned slightly!<br/><br/>At the moment, the ancestral dragon bloodline was very passive!<br/><br/>The Universe Masters and level three universe masters of the ancestral dragon bloodline didn’t dare to gather together.<br/><br/>Once they gathered together and the location was known by the Holy Dragon Bloodline, the Holy Dragon Emperor would directly lead the Great Beings to kill them. They weren’t a match for them.<br/><br/>However, in a situation like this, if they were to split up, there would be disadvantages as well!<br/><br/>The distance was too far, and it would be extremely difficult to support them!<br/><br/>If they were to gather together, they would be afraid of being wiped out in one fell swoop. If they were to split up, they would be afraid of being defeated one by one!<br/><br/>The current ancestral dragon lineage was very difficult!<br/><br/>“Sir Golden Dragon Emperor, if our ancestral dragon lineage were to gather all of our powers together with the powers of the Dragon Palace, we might be able to resist the holy dragon lineage!”<br/><br/>The figure with the Green Dragon Beard said!<br/><br/>“If the Dragon Palace has three or four universe masters with level 3 power, we might be able to resist some of them!”<br/><br/>Golden Dragon Emperor was silent for a while and nodded slightly!<br/><br/>“Shadow, Xiaoyue, you two go to the Dragon Palace and communicate with the Dragon Palace on behalf of the ancestral dragon bloodline. I’ll tell the other dragon kings that if we can’t do it in a year, we’ll work together!”<br/><br/>The Golden Dragon King continued!<br/><br/>“It’s senior Golden Dragon King. We will go to the Dragon Palace Now!”<br/><br/>The Green Dragon Shadow nodded.<br/><br/>“Go. Be careful!”<br/><br/>The Golden Dragon King waved his hand, and the Green Dragon Shadow and the Green Dragon Moon bowed to him.<br/><br/>Then, they bowed to the surrounding experts and left immediately!<br/><br/>“I hope the strength of the Dragon Palace doesn’t disappoint us!”<br/><br/>The Golden Dragon King mumbled!<br/><br/>The azure dragon whiskers rushed towards the Dragon Palace after they left!<br/><br/>In other places, the disciples of the ancestral dragon lineage were also gathered in the Dragon Palace of the level three universe masters.<br/><br/>According to the situation, they should deal with the next attack from the Holy Dragon lineage!<br/><br/>In the Dragon Palace of the Eternal Sky River, Wang Xian’s eyes flickered when he received the reply from the Azure Dragon Whiskers and the rest!<br/><br/>The current situation of the ancestral dragon lineage was indeed a little complicated!<br/><br/>They didn’t have a powerful base and they didn’t have the combat strength to fight against the Holy Dragon King.<br/><br/>It wasn’t the right thing to gather together or scatter!<br/><br/>They could only act according to the situation a year later!<br/><br/>“Let’s wait for a year then!”<br/><br/>Wang Xian muttered.<br/><br/>The Dragon Palace was in a passive position now. They couldn’t go to the Divine Mountain of light either. They could only wait for the other party to attack first!<br/><br/>However, the dragon clan’s thorny dragon seed would spread out in the surrounding area and monitor the Dragon Palace’s every move!<br/><br/>One year was very short!<br/><br/>Ten months later, at the Divine Mountain of light, the son of the Holy Dragon stood in front of a divine hall.<br/><br/>He was in the center, and around him, ten middle-aged elders with terrifying power stood there.<br/><br/>They were the peak experts of the Holy Dragon Bloodline.<br/><br/>Sitting on the throne in front of the Divine Hall, the Holy Dragon King looked at his son with dignity!<br/><br/>“Father, on this expedition, I will subdue the Holy Dragon bloodline, and those who obey the Holy Dragon bloodline will prosper, and those who defy the Holy Dragon bloodline will die!”<br/><br/>The Holy Dragon Son cupped his hands respectfully, “The leader of the ancestral dragon has been killed by father, so leave it to me!”<br/><br/>“Haha, Alright, I’ll take it from here!”<br/><br/>The sacred dragon laughed and said!<br/><br/>“Father, please wait for My Good News!”<br/><br/>The son of the sacred dragon said confidently!<br/><br/>This time, he would lead the 10 universe masters of the Sacred Dragon Clan into battle!<br/><br/>He would destroy all those who resisted!<br/><br/>He would lead the Holy Dragon bloodline to unify the Godly Dragon Race!<br/><br/>“I am here, waiting for your good news!”<br/><br/>Life Dragon Emperor said with a smile!<br/><br/>“Yes!”<br/><br/>Holy Dragon Son immediately responded, his gaze sweeping across the great beings beside him.<br/><br/>“Let’s go. The first target is that old fellow who is in closed-door cultivation. I will personally kill him one-on-one!”<br/><br/>Holy Dragon Son said confidently!<br/><br/>“Alright. This time, we’ll follow Dragon Son and help Lord Dragon King conquer the land of the Godly Dragon Race!”<br/><br/>The Great Beings of the Holy Dragon race smiled and flew out immediately.<br/><br/>Outside, 40 universe masters with level-two combat power immediately followed and flew out!<br/><br/>Today, the Holy Dragon Race announced that they would unite the godly dragon race for 10 months!<br/><br/>It was also the last two months since they had decided to make a move!<br/><br/>The reason why the Holy Dragon Son set off now was because they had already found a target!<br/><br/>A great being from the ancestral dragon clan who had been in seclusion for tens of millions of years!<br/><br/>A universe master level three great being from the ancestral Dragon Clan.<br/><br/>He wanted to kill this universe master level three great being and start the war for the unification of the Holy Dragon Clan.<br/><br/>He also wanted to warn all the great beings and disciples of the godly dragon race that those who followed him would be killed!<br/><br/>The Holy Dragon Son led the Great Beings of the Holy Dragon Race and launched an attack.<br/><br/>Before him, there was a dragon-headed ruler!<br/><br/>The whole ruler was emitting a strong light energy!<br/><br/>As long as there was a place where the light shone, the ruler would be able to find those with the Godly Dragon Bloodline!<br/><br/>This treasure was given to them by the King of Angels.<br/><br/>There were two of them, and they were called the parent ruler of the dragon seeking!<br/><br/>Unfortunately, one of the parent rulers was lost by that trash, the Alliance Master of the Hundred Cities Alliance!<br/><br/>It should have been taken by the Dragon Palace!<br/><br/>But that didn’t matter too much. They still had the parent ruler in their hands!<br/><br/>The Divine Dragon Child and the others flew quickly, hiding in the sky above the inner continent with the power of light!<br/><br/>Time passed bit by bit, and two months passed in the blink of an eye!<br/><br/>Two months later, a year had passed since the Sacred Dragon bloodline had made its announcement!<br/><br/>In the sky above a huge lake, the sacred dragon child and the others slowly appeared.<br/><br/>They looked down at the lake, and their faces were filled with coldness and coldness!<br/><br/>The lake below was called the Crouching Dragon Lake. When the Divine Dragon Clan was still alive, this was the residence of a Dragon King of the Dragon Palace!<br/><br/>After the Divine Dragon Clan was destroyed, this place was occupied by another clan!<br/><br/>It was a high-level clan, the water cloud clan!<br/><br/>The entire lake was covered in mist, and the mist was filled with mystery!<br/><br/>The son of the sacred dragon knew that this water cloud clan had been subdued by that expert from the ancestral dragon clan.<br/><br/>And that expert was in seclusion in the deepest part of the Wolong Lake!<br/><br/>“Hehe, I’ll kill you first to warn all those with the Divine Dragon Bloodline!”<br/><br/>Holy Dragon Son smiled and signaled to the Great Beings of Holy Dragon bloodline around him!<br/><br/>“Roar! Roar! Roar!”<br/><br/>In the next moment, 10 universe masters with level-three Combat Power and over 20 universe masters with level-two Combat Power.<br/><br/>They all roared in unison and transformed into godly dragon bodies.<br/><br/>A terrifying pressure spread downward!\t\t\t\t\t\t</div>", "images": {}, "success": true}