{"id": 553, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073007.html", "title": "Chapter 3544 - 3544 3543. Be Careful Of The Phoenix", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3544 - 3544 3543. Be Careful Of The Phoenix</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3544 3543. Be careful of the Phoenix<br/><br/>“Hiss! The leader of the ancestral dragon bloodline has been killed. He was killed by the Sacred Dragon Emperor. This… This is unbelievable!”<br/><br/>“The king of the ancestral dragon bloodline. This is a great being with great ambitions. He has the demeanor of a Godly Dragon King. He was killed!”<br/><br/>“How is this possible? The leader of the ancestral dragon bloodline is a very powerful great being. In my opinion, unless a great being at the universe ruler realm makes a move, it will be very difficult to kill him. What exactly happened?”<br/><br/>“The leader of the ancestral dragon clan was killed just like that. The war between the Holy Dragon Clan and the ancestral dragon clan will probably end with the victory of the Holy Dragon Clan. I really didn’t expect that the Holy Dragon Clan will be the leader of the Holy Dragon Clan!”<br/><br/>“And the Dragon Palace… It seems that the Dragon Palace and the Holy Dragon Clan aren’t on the same level!”<br/><br/>“Even the leader of the ancestral dragon clan was killed, so what about the Dragon Palace?”? “Even though the Dragon Palace has shown great power, there is still a huge gap between them and the ancestral dragon bloodline. The Dragon King can’t be compared to the leader of the Ancestral Dragon Bloodline, the Holy Dragon will be the king of the Dragon Bloodline!”<br/><br/>On the Universe AI, the news of the death of the leader of the ancestral dragon bloodline caused a huge sensation!<br/><br/>The leader of the ancestral dragon bloodline was once known as the strongest being below the universe ruler realm.<br/><br/>He was known as the Godly Dragon who had the possibility of stepping into the Universe Overlord realm!<br/><br/>He was known as the hope of the godly dragon lineage!<br/><br/>But now, he was actually killed and died at the hands of the Sacred Dragon Emperor!<br/><br/>This made many people feel regretful!<br/><br/>Compared to the sacred dragon emperor, they hoped that the leader of the ancestral dragon lineage could win!<br/><br/>Because the sacred dragon lineage had obviously become the lackeys of the angel race!<br/><br/>And the leader of the ancestral dragon said that everyone could become a dragon. He displayed his powerful ambition and breadth of mind, which won the admiration of many powerful disciples!<br/><br/>And now, he had actually fallen!<br/><br/>“The fall of the leader of the ancestral dragon bloodline also means that the last hope of the Holy Dragon bloodline has fallen. In the future, the Holy Dragon bloodline will probably never be able to step into the peak again!”<br/><br/>A powerful person said directly on the universe ai!<br/><br/>This sentence was acknowledged by many of the disciples of the race’s experts.<br/><br/>The strength and breadth of mind of the ancestral dragon leader was worthy of the King of the Divine Dragon lineage!<br/><br/>Unfortunately, the King was dead now!<br/><br/>The ancestral dragon lineage would either be hunted down by the divine dragon lineage or they might be disbanded!<br/><br/>This was because their backbone had already fallen!<br/><br/>Wang Xian had been in the land of blood plasma for a thousand years!<br/><br/>In this thousand years, he had harvested two thousand blood refinement fruits!<br/><br/>This also meant that the Dragon Palace could produce two thousand pure-bred divine dragons!<br/><br/>Originally, he was prepared to continue his seclusion.<br/><br/>In the current land of blood plasma, they had created a palace to stay in. This also attracted the attention of many living beings in the land of blood plasma.<br/><br/>There were demonic skeletons, desolate beasts, and skeleton powerhouses.<br/><br/>In the beginning, there were still living beings who came to harass them. After being easily killed by the king of water touch, it had completely become a forbidden land!<br/><br/>It had become a special forbidden land in the land of blood plasma!<br/><br/>“Buzz Buzz!”<br/><br/>Wang Xian, who was preparing to stay here for thousands of years, received the news from Prime Minister Gui.<br/><br/>The news was about the death of the leader of the ancestral dragon lineage!<br/><br/>When he saw the news, he was slightly stunned. A look of astonishment appeared on his face!<br/><br/>The leader of the ancestral dragon lineage was actually dead!<br/><br/>He was actually dead!<br/><br/>When he had just stepped into the inner regions of the heaven-splitting primordial land and heard that everyone could become a dragon, he was filled with admiration for the leader of the ancestral dragon lineage!<br/><br/>From the words of Green Dragon Moon and the rest, it could be seen that they respected their leader!<br/><br/>The leader of the ancestral dragon, who had the demeanor of a king, was actually killed by the Holy Dragon King!<br/><br/>“The Holy Dragon King actually killed the leader of the ancestral dragon, this…”<br/><br/>Wang Xian was also extremely shocked by this news. He took a deep breath and opened the universe AI.<br/><br/>When he saw the information on it, he couldn’t help but feel a little regretful!<br/><br/>Such a hero died just like that. Furthermore, he died at the hands of the traitors of the divine dragon lineage. It was really a pity!<br/><br/>“Xiao Xian, What’s Wrong?”<br/><br/>At the side, Guan Shuqing and the other girls looked at him and asked doubtfully.<br/><br/>“Take a look at the information on the universe’s AI!”<br/><br/>Wang Xian said to them!<br/><br/>“The leader of the ancestral dragon was actually killed by the Holy Dragon King!”<br/><br/>Very soon, the cries of the girls could be heard as well!<br/><br/>Wang Xian hesitated for a moment. He opened the communication channel of the Azure Dragon Moon Azure Dragon Whisker Shadow and the rest and sent a message.<br/><br/>He wanted to confirm the authenticity of this matter!<br/><br/>At the same time, a group of disciples of the Divine Dragon lineage, led by the Azure Dragon Beard Shadow, were kneeling in the Azure Dragon Palace.<br/><br/>They were heading in a direction with tear stains on their faces!<br/><br/>They were paying their respects to their leader, their king!<br/><br/>“Senior, the Dragon King sent an inquiry message!”<br/><br/>When Azure Dragon Moon saw the message from Wang Xian, she looked at Azure Dragon Beard Shadow!<br/><br/>“I’ve received it too!”<br/><br/>Azure Dragon Beard Shadow nodded his head.<br/><br/>“Senior, should we inform the Dragon King about the last message our leader sent?”<br/><br/>Azure Dragon Beard Shadow could not help but ask!<br/><br/>Although they did not understand the exact meaning of the last message, it was extremely important for their leader to send them the last message before he died!<br/><br/>“The Dragon King is on the same side as us.”<br/><br/>The Azure Dragon Beard Shadow was silent for a moment before he said, “With the fall of our leader, the future of our divine dragon lies in the hands of the seniors and that Dragon King.”<br/><br/>“Then let me tell the Dragon King the News!”<br/><br/>The Azure Dragon Moon said.<br/><br/>The Azure Dragon Beard Shadow nodded. “We can’t tell anyone else about this, but the Dragon King is still trustworthy!”<br/><br/>“He really fell!”<br/><br/>In the land of blood plasma, Wang Xian received a reply from the Azure Dragon Moon very quickly. When he saw the confirmation, his heart was filled with mixed feelings!<br/><br/>The king of a generation had passed away!<br/><br/>“Eh?”<br/><br/>At this moment, another message from the Azure Dragon Moon made him slightly stunned!<br/><br/>When he saw this message, Wang Xian’s eyes widened slightly. He was filled with shock!<br/><br/>The message was the one that the leader of the ancestral dragons had warned them before his death!<br/><br/>“Be careful of the Phoenix, be careful of the Phoenix?”<br/><br/>Wang Xian mumbled as his expression changed slightly!<br/><br/>Why should he be careful of the Phoenix?<br/><br/>Since ancient times, there were some races in the universe that used the dragon and Phoenix as their totems. As the saying goes, dragons and phoenixes were auspicious!<br/><br/>According to the records of the divine dragon lineage, the relationship between the Divine Dragon tribe and the Phoenix tribe was relatively good. They were relatively close!<br/><br/>Now, the leader of the ancestral dragon clan suddenly sent the words “Be careful of the Phoenix clan”!<br/><br/>What did this mean?<br/><br/>Why did he send such a message?<br/><br/>What kind of signal did it reveal?<br/><br/>Could he not trust the Phoenix Clan?<br/><br/>Or could it be that the Phoenix clan was disadvantageous to the Divine Dragon Clan?<br/><br/>Wang Xian’s eyes sparkled.<br/><br/>The Phoenix clan was an existence from the same era as the Divine Dragon Clan. They were also a relatively powerful existence among the peak races.<br/><br/>The Phoenix had risen from the dead!<br/><br/>Wang Xian shook his head and memorized this information in his heart. He stopped thinking about this matter.<br/><br/>The Phoenix clan was not something that he could touch right now!<br/><br/>“I wonder what the Holy Dragon Clan will do next? Where will the ancestral Dragon Clan Go?”<br/><br/>He mumbled.\t\t\t\t\t\t</div>", "images": {}, "success": true}