{"id": 565, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073031.html", "title": "Chapter 3556 - 3556 3555 Was Easily Killed", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3556 - 3556 3555 Was Easily Killed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3556 3555 was easily killed<br/><br/>“Run, run, run!”<br/><br/>The Sacred Dragon Son was killed, and Dragon Palace instantly killed one, one was killed by the Great Beings of Dragon Palace, and two escaped!<br/><br/>More than 20 universe masters with Level 2 Combat Power were all killed!<br/><br/>The remaining six universe masters with level 3 combat power almost peed their pants!<br/><br/>One of the light godly dragons self-detonated his dragon tail, and terrifying energy filled the surroundings.<br/><br/>He flew toward the black hole with all his might.<br/><br/>As long as he entered the black hole, he would have a chance to live!<br/><br/>He risked his life, and indeed, the experts of the Dragon Palace couldn’t break through!<br/><br/>That terrifying energy could heavily injure a level 3 universe master!<br/><br/>This light dragon risked his life to escape!<br/><br/>“Roar!”<br/><br/>The other five light dragons saw this scene, and their eyes revealed viciousness as they roared ferociously!<br/><br/>One of them was covered in shining dragon scales as they shot out in all directions!<br/><br/>This terrifying dragon scale attack caused the expressions of the experts from the Dragon Palace to slightly change.<br/><br/>Unless the three experts from the Dragon Palace surrounded one of them, they would not be able to block such a desperate attack!<br/><br/>Otherwise, they would not be able to block it!<br/><br/>This was also the reason why three experts of the same level had to join hands to kill one of them!<br/><br/>Once the other party erupted, the chances of him escaping was very, very high!<br/><br/>“You want to escape?”<br/><br/>However, at this moment, Wang Xian locked his gaze on the Divine Radiant Dragon, the Master of the universe with a level three combat strength. A cold look appeared in his eyes!<br/><br/>Whoosh<br/><br/>With the activation of the inoriginator holy wings, Wang Xian completely ignored the attacks of the radiant dragon scales. The Taiji dragon plate directly blocked the attacks from the outside!<br/><br/>“How can you escape so easily!”<br/><br/>Wang Xian’s voice was transmitted into his mind!<br/><br/>“What?”<br/><br/>When the Divine Light Dragon heard Wang Xian’s voice, his pupils constricted slightly and a look of astonishment appeared on his face!<br/><br/>He couldn’t help but look behind him.<br/><br/>“PFFT!”<br/><br/>However, at this moment, Wang Xian’s dragon claws grabbed onto his body and flung him backward!<br/><br/>“No, don’t kill me!”<br/><br/>The Divine Light Dragon roared in despair!<br/><br/>“Oh no!”<br/><br/>“Oh no!”<br/><br/>The other five experts from the holy dragon lineage swept their gaze over. Their hearts tightened and their faces were filled with fear!<br/><br/>“Explode!”<br/><br/>One of the divine light dragon self-detonated his innate spiritual treasure and flew desperately into the black hole.<br/><br/>The other four dragons were also trying their best to escape!<br/><br/>As long as they could escape, it did not matter how serious their injuries were!<br/><br/>“If you want to escape, Ao Qitian, Ba Qi, Ao Yao, we will lock onto a divine light dragon!”<br/><br/>Below them, the Heaven Array roared and defensive formations appeared around Ao Qitian and the others.<br/><br/>“Roar, Roar, Roar, kill them all and they dare to destroy our Dragon Palace? They don’t know death!”<br/><br/>Ao Qitian and the others roared. With the defense of the sky array, they charged into the palace!<br/><br/>With the sky array and their own defense, they could defend against the self-destruction of their bodies and the explosion of the innate numinous treasure!<br/><br/>“No, no, no!”<br/><br/>The locked divine light dragon trembled violently when he saw ao qitian and the others charging toward him.<br/><br/>He did not want to die!<br/><br/>However, when he saw ao Qitian and the rest charging over, his face was filled with despair!<br/><br/>On the other side, the king of water tentacles wanted to lock onto a divine light dragon. However, when he saw that they had already entered the black hole, he frowned slightly.<br/><br/>It was too late!<br/><br/>On Wang Xian’s side, it was also too late!<br/><br/>The Divine Light Dragon that had a level three combat strength and was risking his life wanted to escape. It was indeed very troublesome to stop him!<br/><br/>“Ao ao ao ao!”<br/><br/>Along with the painful roar of a light dragon, the other four light dragons disappeared!<br/><br/>“Peng!”<br/><br/>Ao Qitian grabbed the tail of the light dragon with one hand and threw it down heavily.<br/><br/>“Hong!”<br/><br/>Under their attack, the light dragon was on its last breath!<br/><br/>A terrifying battle ended very quickly!<br/><br/>From then on, 11 Universe Masters of the Holy Dragon bloodline with level-three Combat Power were killed. Five of them were killed, and six of them were heavily injured and fled!<br/><br/>And more than 20 universe masters with level-two Combat Power were all killed!<br/><br/>“Fortunately, they fled relatively quickly. Otherwise, none of them would have survived!”<br/><br/>Ba Qi flew over and said with a cold face!<br/><br/>“Even if they escaped, it doesn’t mean they can survive!”<br/><br/>At this time, the sky array flew over from below. He waved his arm and the puddles of blood in the surroundings flew towards his hand.<br/><br/>Of the six peak experts of the Holy Dragon lineage that escaped, only one didn’t leave any blood.<br/><br/>The rest left behind blood, dragon scales, and large dragon tails!<br/><br/>The sky array’s palm moved and the cursed source devil corpse appeared in front of him!<br/><br/>He sprinkled a pool of blood on the Devil’s corpse.<br/><br/>Soon, the entire Devil’s corpse began to change.<br/><br/>It transformed from the size of a human into the size of a divine dragon!<br/><br/>“Is this the innate supreme treasure?”<br/><br/>Lei Ming, Ao Qitian, and the other leaders of the Dragon Palace looked over with curious expressions!<br/><br/>Earlier, they had witnessed the power of the innate supreme treasure.<br/><br/>Of course, this was not the innate treasure of the son of the Holy Dragon!<br/><br/>The two innate treasures of the son of the Holy Dragon were easily suppressed by Wang Xian!<br/><br/>The power unleashed by the dusky scissors was terrifying.<br/><br/>The ability to cut through space was abnormally strange!<br/><br/>Wang Xian’s gaze swept across the Heaven Formation. The Heaven Formation knew what to do with the Devil’s corpse’s curse without him saying anything!<br/><br/>His gaze swept to the side as he looked at the two innate treasures. His eyes sparkled.<br/><br/>His body moved and he immediately appeared in front of the pair of dragon eyes. He stretched out his hand and grabbed them!<br/><br/>Buzz<br/><br/>When he touched them, a force of resistance was transmitted over!<br/><br/>“Scram! This is the innate treasure of the Holy Dragon lineage. Anyone who wants to take it is an enemy of the Holy Dragon Lineage!”<br/><br/>A strong resistance force was transmitted over. After the pair of dragon eyes encountered Wang Xian’s unfamiliar aura, they tried to break free and flew into the distance!<br/><br/>“Humph!”<br/><br/>Wang Xian snorted coldly and the five elements millstone directly pressed down on them!<br/><br/>Buzz Buzz Buzz<br/><br/>The pair of dragon eyes tried to break free, but the force on them could not break free from the suppression of the five elements millstone at all.<br/><br/>Wang Xian extended his dragon claws. Under the suppression of the two forces, the pair of dragon eyes stopped trembling and was held tightly in his hands!<br/><br/>He had obtained another innate supreme treasure. Moreover, this innate supreme treasure was useful to him!<br/><br/>After suppressing the two dragon eyes, Wang Xian stretched out his hand and grabbed at the other innate supreme treasure, the sacred peak.<br/><br/>Buzz<br/><br/>However, when the sacred peak sensed an unfamiliar aura, a wave of energy directly surged out!<br/><br/>When Wang Xian sensed this wave of energy, his expression changed slightly. His body couldn’t help but fly backward!<br/><br/>Crash<br/><br/>At this moment, a bright wing slowly condensed on top of the Holy Peak. The wing carried the Holy Peak and flew into the distance.<br/><br/>“Suppress!”<br/><br/>When Wang Xian saw this scene, his expression changed slightly. He instantly arrived at the top of the Holy Peak. Waves of the five elements power that had been extinguished pressed down.\t\t\t\t\t\t</div>", "images": {}, "success": true}