{"id": 561, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073023.html", "title": "Chapter 3552 - 3552 3551 Dragon Extermination Palace", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3552 - 3552 3551 Dragon Extermination Palace</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3552 3551 dragon extermination palace<br/><br/>“Hum!”<br/><br/>“Hu!”<br/><br/>Seeing the experts of the sacred dragon bloodline leave through the teleportation array, the experts of the city let out a sigh of relief.<br/><br/>They wiped the cold sweat off their foreheads.<br/><br/>They were extremely nervous just now!<br/><br/>They didn’t dare to disobey such an expert!<br/><br/>The Sacred Dragon bloodline wasn’t a kind bloodline!<br/><br/>Right now, the news of the ancestral dragon bloodline’s top warrior que ya being exterminated was known to all the races.<br/><br/>Similarly, the news of the water cloud race being exterminated was also known to them!<br/><br/>A high level race was easily exterminated by them.<br/><br/>Such a terrifying existence couldn’t be provoked, otherwise, they would be exterminated!<br/><br/>The Holy Dragon Son and the others quickly shuttled through the cities.<br/><br/>Soon, the information about the Holy Dragon Son and the rest of the powerful warriors spread to the AI of the universe!<br/><br/>Now, the war to unify the Holy Dragon Clan had begun, and this became the thing that attracted the most attention within the heaven opening primal continent!<br/><br/>The route of the Holy Dragon Son and the rest naturally attracted a lot of attention.<br/><br/>From the beginning when they were traveling through the teleportation arrays to the end when they were traveling through dozens of teleportation arrays, they soon discovered something!<br/><br/>That was, every time the Holy Dragon Son and the others were teleported, they would be closer to the Heavenly River!<br/><br/>In other words, their target could be the Dragon Palace!<br/><br/>Four months later, when the powerful disciples in the universe’s AI realized that the Holy Dragon Son and the others had flown for a period of time and arrived at a race’s place to teleport, they were completely certain of one thing!<br/><br/>“The Holy Dragon Son and the Holy Dragon Bloodline’s target is the Dragon Palace in the Heavenly River. There’s no mistake. Their route is definitely the Dragon Palace!”<br/><br/>“The second target of the Holy Dragon bloodline is the Dragon Palace? Are… are they going to destroy the Dragon Palace?”<br/><br/>“Are they going to attack the Dragon Palace? Will the Dragon Palace be able to resist the Holy Dragon Son and the others?”<br/><br/>“Absolutely not. Even if the Sacred Dragon King doesn’t attack, the Dragon Palace is no match for them!”<br/><br/>“I don’t know how the Dragon Palace can stop them. Should they run away or hide?”<br/><br/>The news about the next target of the Sacred Dragon Bloodline, the Dragon Palace, spread like wildfire!<br/><br/>All the powerful disciples of the races were talking about it!<br/><br/>The Dragon Palace, as well as all the strong disciples of the ancestral dragon lineage who had been paying attention to the movement of the Holy Dragon lineage, were also the first to receive the news!<br/><br/>“Eh? I didn’t expect the target of the Holy Dragon lineage to be our Dragon Palace?”<br/><br/>When Wang Xian saw the news, his face was filled with astonishment!<br/><br/>The Holy Dragon Son and the rest did not attack the scattered strong disciples of the ancestral dragon lineage. Instead, they chose the Dragon Palace!<br/><br/>“What do you mean? Are you afraid that we will escape or something?”<br/><br/>Wang Xian looked at the news and a smile appeared on his face.<br/><br/>According to the information on the universal AI, the Holy Dragon King did not make a move. Instead, it was the Holy Dragon Son who led a group of experts of the Holy Dragon lineage to make a move!<br/><br/>Wang Xian did not take the Holy Dragon son seriously at all.<br/><br/>When he learned that the Holy Dragon King had at least six to seven innate supreme treasures, Wang Xian might have taken him seriously!<br/><br/>How many innate supreme treasures could he have with him now that he only had one son of the Holy Dragon?<br/><br/>He did not believe that he would have three to four innate supreme treasures!<br/><br/>“Dragon King, according to the information we received, the Holy Dragon Son and the rest should have around ten level three masters, not more than thirteen to fourteen!”<br/><br/>Prime Minister GUI reported to Wang Xian!<br/><br/>“Hehe.”<br/><br/>Wang Xian smiled and said, “Get ready immediately. If they are here to attack us, receive them well and get the Heaven Array to set up a formation!”<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui also revealed a smile!<br/><br/>The Dragon Palace loved such opponents the most!<br/><br/>If the Holy Dragon King were to personally lead the Holy Dragon lineage to attack the Dragon Palace, it would be extremely difficult for the Dragon Palace to destroy the Masters of the other party!<br/><br/>However, they had only sent a portion of their experts.<br/><br/>Weren’t they here to deliver resources?<br/><br/>They would naturally give a warm welcome to such a good dragon!<br/><br/>Buzz! Buzz<br/><br/>At this moment, Wang Xian received a series of messages on the universal ai!<br/><br/>The Green Dragon Moon Azure Dragon Whisker Shadow and the Golden Dragon King had sent him messages!<br/><br/>They were all reminding Wang Xian to be careful or to immediately lead the experts of the Dragon Palace out of this place!<br/><br/>Wang Xian looked at the news and smiled!<br/><br/>From the perspective of the ancestral dragon lineage, although the Dragon Palace had some strength, they only had three to four universe masters with level-three combat strength at most!<br/><br/>How could three to four universe masters with level-three combat strength fend off the Holy Dragon Son and the rest?<br/><br/>They couldn’t fend them off at all!<br/><br/>“Don’t worry, nothing will happen to our Dragon Palace!”<br/><br/>Wang Xian replied them with a message, telling them not to worry!<br/><br/>He wanted to make the entire heaven-splitting primordial land boil again with this battle!<br/><br/>“HMM? The Dragon Palace is going to be in danger?”<br/><br/>At the same time, in the faraway land of the Devil Bones, the spirit demon king of the spirit demon race was located in a special space!<br/><br/>When he saw the information on the universe’s AI, he frowned slightly.<br/><br/>He looked ahead.<br/><br/>In front of him, the flesh and blood of the spirit red bone was gathering bit by bit, and the sound of her heart beating was heard.<br/><br/>At the same time, a powerful force shot out from her body!<br/><br/>Although she had not reached the level of a true universe overlord, she was already an extremely terrifying existence!<br/><br/>“Based on the current situation of the spirit red bone, it should only take two years for her flesh and blood to fully grow. When that time comes, she should be at the level of a half-step universe overlord, right?”<br/><br/>The Spirit Demon King mumbled. He took out the universal AI and immediately sent a message to Wang Xian!<br/><br/>In the Dragon Palace’s Dragon King Hall, Wang Xian was replying to some messages!<br/><br/>When he saw the message from the Spirit Demon King, a smile appeared on his face.<br/><br/>There was not much information about the spirit demon king. There were only six words.<br/><br/>Did he need support?<br/><br/>Perhaps, as long as Wang Xian said it, the spirit demon king would bring his people over!<br/><br/>“Thank you for your concern, senior spirit demon king. We can handle it. Don’t Worry!”<br/><br/>Wang Xian replied to him!<br/><br/>When the spirit demon king saw this message, a smile appeared on his face.<br/><br/>He still had a lot of faith in Wang Xian and the strength of the Dragon Palace!<br/><br/>The Spellcaster clan was a spellcaster clan, and the clan leader of the Spellcaster clan was an array spellcaster.<br/><br/>The Dragon Palace was able to break into the lair of an array spellcaster and kill him. In addition, they were able to kill another universe dominator with a level 3 combat strength.<br/><br/>This strength was definitely not something that only three or four universe rulers with level 3 combat strength could do!<br/><br/>At least six or seven!<br/><br/>Six or seven was just his guess, but using them for defense wasn’t a big problem!<br/><br/>Furthermore, the Dragon Palace’s strength might be even stronger!<br/><br/>“After red bones improves, with her personality, she will probably go out to help the Dragon King.”<br/><br/>The Spirit Demon King’s eyes flickered. He hesitated for a moment before taking out the cosmic AI and contacting someone.<br/><br/>That was someone he had never wanted to contact, but now, his daughter would eventually go to that person!<br/><br/>His daughter was also his pride!\t\t\t\t\t\t</div>", "images": {}, "success": true}