{"id": 569, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073039.html", "title": "Chapter 3560 - 3560 3559, The Decision Of The Ancestral Dragon Lineage!", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3560 - 3560 3559, The Decision Of The Ancestral Dragon Lineage!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3560 3559, the decision of the ancestral dragon lineage!<br/><br/>The Great Beings of the Holy Dragon lineage were killed by the Dragon Palace!<br/><br/>At this moment, other than the Holy Dragon lineage that was the most shocked with a trace of fear.<br/><br/>There was also the ancestral dragon lineage that was shocked and dumbfounded!<br/><br/>Especially the pinnacle great beings of the ancestral dragon lineage!<br/><br/>Not long ago, they had talked to the Dragon King on the universe AI. The Dragon King wanted them to gather at the Dragon Palace.<br/><br/>They didn’t agree because they didn’t have the confidence to go against the Holy Dragon King!<br/><br/>When the Holy Dragon Son led a group of experts to destroy the Dragon Palace, they also warned the Dragon King to avoid them!<br/><br/>After the Holy Dragon Son and the others entered the Eternal Sky River, the peak experts of the ancestral dragon lineage were paying attention to them!<br/><br/>They didn’t expect this outcome!<br/><br/>“This… Golden Dragon Emperor, just how strong is this Dragon Palace? The pictures that were sent out from the Dragon Palace showed five corpses of universe masters with level 3 combat power. These were the pinnacle warriors of the Holy Dragon lineage. Five out of 11 were killed? Not a single universe master with Level 2 combat power was left. This… This is too terrifying!”<br/><br/>In the virtual communication space on the Universe AI, the 13 pinnacle warriors of the ancestral dragon bloodline gathered once again today!<br/><br/>One of the Devil Dragons looked at Golden Dragon Emperor and couldn’t help but ask!<br/><br/>“This… I don’t know either!”<br/><br/>Golden Dragon Emperor shook his head when he heard what he said, his eyes filled with confusion!<br/><br/>Last time, they told Dragon King about the power of the sacred dragon bloodline and the ancestral dragon bloodline.<br/><br/>Back then, the Dragon King was very confident that he could resist them!<br/><br/>However, they didn’t believe it!<br/><br/>Now that they saw this result, they were in a Daze!<br/><br/>With the power of the Dragon Palace, did they really need them?<br/><br/>With such a battle record, they didn’t need to be pinnacle warriors of the ancestral dragon lineage to be able to resist the sacred dragon lineage, right?<br/><br/>Of the 11 universe masters with level 3 battle power, five of them were killed!<br/><br/>They hadn’t killed so many great beings since the conflict between the ancestral dragon bloodline and the Holy Dragon Bloodline!<br/><br/>The power displayed by the Dragon Palace shocked them!<br/><br/>“What should we do now? Should we talk to the Dragon Palace and join forces with them, or…”<br/><br/>A water dragon asked.<br/><br/>“So many great beings of the Holy Dragon bloodline were killed by the Dragon King. Now, they can’t deal with the Ancestral Dragon bloodline anymore. I think we should regroup and find a place close to the Dragon Palace!”<br/><br/>A divine dragon suggested!<br/><br/>His words made the divine dragons fall into deep thought.<br/><br/>The strength displayed by the Dragon Palace shocked them.<br/><br/>Furthermore, the Dragon Palace was not an enemy, but a friend. They could take care of each other!<br/><br/>After all, the sacred dragon lineage was their enemy.<br/><br/>“I think we can. In the future, if anyone from our ancestral dragon lineage can break through the shackles and reach the universe ruler realm, he will be the next leader of our ancestral dragon lineage. If there is a universe ruler realm expert born in the Dragon Palace, we can join the Dragon Palace. Our leader’s philosophy is to restore the glory of the divine dragon lineage, not to stick to our so-called ancestral dragon lineage!”<br/><br/>Golden Dragon King looked at them and said!<br/><br/>“Good, our leader disbanded the ancestral dragon lineage because of this idea. Whoever becomes a universe ruler will be the king of our Dragon Clan. We will ally with the Dragon Palace now. If the Dragon Palace really gives birth to a universe ruler-level dragon, then we will join the Dragon Palace!”<br/><br/>The Pinnacle Warriors of the ancestral dragon lineage around nodded slightly!<br/><br/>“Golden Dragon King, please contact the Dragon King and relay our message!”<br/><br/>The Fire Dragon King spoke!<br/><br/>The Golden Dragon King nodded and immediately sent a message to Wang Xian!<br/><br/>“These two treasures seem to be one. TSK TSK, to think that they can detect people with the bloodline of the Divine Dragon. Furthermore, their accuracy is extremely high. Are these treasures used to deal with the ancestral dragon lineage and our Dragon Palace?”<br/><br/>At the same time, in the Dragon King’s Hall, Wang Xian was looking at the treasures in his hands with a smile on his face!<br/><br/>Two treasures that looked like rulers!<br/><br/>The first ruler was obtained from the Alliance Master of the Hundred Cities while the second one was obtained from the son of the Divine Dragon!<br/><br/>This ruler was the most valuable treasure other than the innate supreme treasure, the Twin Dragon Eyes!<br/><br/>The dragon-seeking ruler was just like its name!<br/><br/>After sensing the effects of the dragon-seeking ruler, Wang Xian’s gaze landed on the twin dragon eyes in front of him!<br/><br/>This should be forged from the Dragon Eyes of a divine dragon who was in the realm of the ruler of the universe.<br/><br/>The dragon eyes contained a terrifying power of light!<br/><br/>The Twin Dragon Eyes had two very powerful functions.<br/><br/>One was the void light imprisonment!<br/><br/>Activating the Twin Dragon Eyes to identify the enemy, releasing fine lines of light to directly imprison the enemy!<br/><br/>The second was the Dragon Eye World.<br/><br/>The Dragon Eye World could be used for defense, but it could also give one the ability to perceive things!<br/><br/>The two abilities were powerful and strange!<br/><br/>The twin dragon eyes could be used by Wang Xian, and it could bring him a considerable improvement.<br/><br/>Wang Xian was prepared to refine it and fuse it into his dragon eyes!<br/><br/>The reason why the son of the Holy Dragon did not fuse it into his dragon eyes was because the twin dragon eyes had already been refined by the Holy Dragon King<br/><br/>In actual fact, this innate treasure belonged to the Holy Dragon King.<br/><br/>The son of the Holy Dragon could only unleash a portion of his abilities!<br/><br/>Buzz! Buzz<br/><br/>Just as Wang Xian was about to refine the two dragon eyes, the universe ai sent him a message from the Golden Dragon King.<br/><br/>After reading the message, he smiled and replied directly!<br/><br/>Wang Xian naturally had no objections to the decision of the ancestral dragon lineage!<br/><br/>Currently, the ancestral dragon lineage was on the same side.<br/><br/>Although the current Dragon Palace was not afraid of the Holy Dragon lineage at all!<br/><br/>However, the Holy Dragon lineage still had the angel clan behind them!<br/><br/>Having the ancestral dragon lineage as a comrade-in-arms was extremely beneficial to the Dragon Palace!<br/><br/>“After refining it, I’ll go and deal with the Holy Dragon Lineage!”<br/><br/>Wang Xian’s eyes sparkled.<br/><br/>He was not a passive person. The Holy Dragon’s son had already charged over. Now, the ancestral dragon lineage and the Dragon Palace were already at the point where they would not rest until one of them was dead!<br/><br/>Since that was the case, he would strike first!<br/><br/>Although he could not directly kill his way to the Divine Mountain of light, the Holy Dragon Lineage’s disciples were not only active in the Divine Mountain of light!<br/><br/>With the tracing Dragon ruler in his hands, he could totally hunt them down!<br/><br/>The other party had lost six experts at the peak, and there were still thirteen of them left!<br/><br/>Destroying the Holy Dragon lineage would bring great improvements to the Dragon Palace.<br/><br/>Furthermore, Wang Xian was not afraid even if it was the help of the races affiliated to the Angel Clan!<br/><br/>Back then, the experts of the Angel clan had killed him in an instant. Wang Xian had always remembered this grudge!<br/><br/>On the universal AI, all the experts’disciples were still discussing.<br/><br/>They were discussing what the Holy Dragon bloodline would do next!<br/><br/>They were discussing the current situation of the Holy Dragon Bloodline!<br/><br/>And at the Divine Light Mountain, the Holy Dragon King’s expression was extremely ugly!<br/><br/>His most outstanding son was killed, his innate true treasure was lost, and five pinnacle warriors were killed. This time, the Holy Dragon Bloodline’s losses were too huge!\t\t\t\t\t\t</div>", "images": {}, "success": true}