{"id": 562, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073025.html", "title": "Chapter 3553 - 3553 3,552 Moves To Kill The Son Of The Holy Dragon", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3553 - 3553 3,552 Moves To Kill The Son Of The Holy Dragon</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3553 3,552 moves to kill the son of the Holy Dragon<br/><br/>“Son of the Holy Dragon, we only need to fly for a month to reach the Dragon Palace in the Heavenly River!”<br/><br/>Time passed day by day. When the son of the Holy Dragon and his group flew out of a city, an old man said to the son of the Holy Dragon.<br/><br/>“Is there any other news about the Dragon Palace?”<br/><br/>The son of the Holy Dragon asked indifferently.<br/><br/>“There’s no other news about the Dragon Palace on the universe’s AI. They don’t seem to be doing anything, but that doesn’t stop them from leaving secretly!”<br/><br/>The old man said!<br/><br/>“Hehe, escape? If they’ve already escaped, then we’ll continue to chase!”<br/><br/>Holy Dragon Son’s eyes flashed with killing intent, and he said with confidence, “Even if they escape to the end of the universe, we can still capture them and kill them!”<br/><br/>The experts of the Holy Dragon lineage nodded with a smile!<br/><br/>And when Holy Dragon Son and the others flew out of the last city, the news on the universe AI quickly spread out!<br/><br/>“Holy Dragon Son and the others are going to exterminate the Dragon Palace. I wonder what the situation in the Dragon Palace is like now?”<br/><br/>“Anyone who is brave can go to the Heavenly River and take a look!”<br/><br/>“Hahaha, there really is a past. As long as there’s a special detection innate spiritual treasure or some high-tech telescopes in the technological world, we can watch from a distance and won’t be affected!”<br/><br/>“If there really is a fight, it’ll be a fight between universe masters with level three Combat Power. The area of impact will be very wide, and there might even be such a terrifying weapon as an innate true treasure!”<br/><br/>On the universe’s AI, a group of strong disciples from the various races were discussing!<br/><br/>There were really some brave people who were already flying towards the river of eternity.<br/><br/>They could not get close to a battle of this level, but they could watch it from afar through some treasures!<br/><br/>The possibility of being affected like this was very, very small!<br/><br/>In the Dragon Palace, Wang Xian looked at the messages on the universe’s AI, and a smile appeared on his face.<br/><br/>He scanned his surroundings and waited quietly!<br/><br/>In the past half a year, he could basically confirm that the holy dragon lineage had sent out 11 powerhouses this time!<br/><br/>11 level 3 universe masters with Combat Strength!<br/><br/>The reason for this number was that even if all the peak powerhouses of the ancestral dragon lineage gathered together to ambush them, they could still escape!<br/><br/>With such a number, they could advance and retreat easily!<br/><br/>“This time, I want at least half of you to stay!”<br/><br/>Wang Xian’s eyes sparkled!<br/><br/>One month passed very quickly!<br/><br/>The figures of the Holy Dragon Son and the rest arrived in the sky above the river of eternity. They flew towards the place where the water in the sky had landed with smiles on their faces!<br/><br/>Over there was the lair of the Dragon Palace!<br/><br/>“Hehe, a few decades ago, Lord Baili Archangel fought with a space beast here and easily injured it. He almost killed it. Today, let’s destroy the Dragon Palace Here!”<br/><br/>An elder looked forward and said with a smile.<br/><br/>“I wonder who gave the dragon palace the confidence to not run away. Hehe!”<br/><br/>The Holy Dragon Son looked at the dragon-seeking ruler in front of him. Under the guidance of the dragon-seeking ruler, there were a lot of people with divine dragon bloodline in front of him!<br/><br/>This meant that the Dragon Palace didn’t run away!<br/><br/>“Maybe they want to submit to the Holy Dragon Bloodline!”<br/><br/>A middle-aged man said with a smile!<br/><br/>“Haha, if they kneel down and submit to the Holy Dragon Bloodline, I can consider taking them into the Holy Dragon Bloodline!”<br/><br/>Holy Dragon Son laughed and sped up!<br/><br/>Hua La La<br/><br/>The water in the sky fell and made a noise. Holy Dragon Son and the others looked down and flew down.<br/><br/>“They’re here! Holy Dragon Son and the other great beings of Holy Dragon are here. 11 universe masters with Level-3 Combat Power and over 20 universe masters with Level-2 Combat Power. They’re so powerful!”<br/><br/>“Dragon Palace didn’t run away. I wonder what trump cards they have!”<br/><br/>“It’s obvious that Dragon Palace is no match for the Holy Dragon Bloodline. They’re not running away? Are they going to surrender?”<br/><br/>“That’s… very unlikely, right?”<br/><br/>“It’s hard to say. Maybe they really will surrender. The Holy Dragon bloodline is too powerful now, and they have the angel race behind them!”<br/><br/>At the same time, in an extremely far place around the water in the sky!<br/><br/>Many brave experts rushed over to watch the battle!<br/><br/>They used all kinds of methods to show the scene in the water in the sky!<br/><br/>They could see the Dragon Palace below!<br/><br/>However, they were too far away. It was fine when they were calm, but once there was a battle, they wouldn’t be able to see clearly.<br/><br/>However, they didn’t care. All they needed to know was the outcome of this battle!<br/><br/>Splash<br/><br/>The group of Holy Dragon Son and the rest landed in the river of eternity. They stared coldly at the Dragon Palace below them. The corners of their lips curled up slightly, and their faces were filled with a grim expression!<br/><br/>In the Dragon Palace, Wang Xian walked out slowly from the Dragon Gate. He looked at the group of Holy Dragon Son and the rest of the powerhouses in the sky!<br/><br/>“Hahaha, Dragon King of the Dragon Palace? Last time, because of the spirit demon king, I didn’t manage to kill you. I didn’t expect you to achieve a breakthrough in the blink of an eye!”<br/><br/>When the Holy Dragon Son saw Wang Xian’s figure, he immediately recognized him as the Dragon Palace expert whom he went to hunt last time!<br/><br/>However, he was stopped by the Spirit Demon King last time. The Spirit Demon King had an innate supreme treasure, and it was in the territory of the spirit demon race. He didn’t dare to fight freely!<br/><br/>The guy who was protected by the Spirit Demon King the last time was actually the Dragon King of the Dragon Palace?<br/><br/>He had just broken through to the third level of the universe dominator. How strong could he be?<br/><br/>Even if he had an innate supreme treasure, the Holy Dragon Son was confident that he could kill him easily!<br/><br/>“Hehe, Holy Dragon Son, long time no see!”<br/><br/>Wang Xian’s gaze swept past the Holy Dragon Son and the other experts of the Holy Dragon lineage. A faint smile appeared on his face!<br/><br/>“It’s been a long time!”<br/><br/>The son of the Holy Dragon saw Wang Xian’s indifferent expression. He swept his gaze across the surroundings and narrowed his eyes slightly. “Dragon King of the Dragon Palace, I’ll give you a choice. Kneel down and submit to our holy dragon lineage. I can spare your life!”<br/><br/>“You want us to submit to a bunch of lackeys? You want all the members of the Dragon Palace to be dogs?”<br/><br/>Wang Xian stared at the son of the Holy Dragon with a mocking expression. “Being dogs is an insult to us!”<br/><br/>“You’re courting death!”<br/><br/>The son of the Saint Dragon was instantly infuriated by Wang Xian’s words!<br/><br/>He, the son of the Saint Dragon, hated it the most when people said that they were dogs from the Angel clan!<br/><br/>If anyone dared to say that, he would make them suffer a fate worse than death!<br/><br/>“Dragon King of the Dragon Palace, I’m going to kill you. I’m going to place your head in our Dragon Palace as a decoration!”<br/><br/>The son of the Saint Dragon’s eyes turned blood-red. His eyes were filled with a sinister look!<br/><br/>“Roar Roar Roar!”<br/><br/>He roared and immediately transformed into the body of the Divine Light Dragon!<br/><br/>Wave after wave of terrifying auras charged downwards!<br/><br/>“You are courting death. We will welcome death and Destroy Your Dragon Palace. It Won’t be long before our sacred dragon lineage becomes the Divine Dragon Tribe!”<br/><br/>The experts from the sacred dragon lineage also roared with ice-cold faces!<br/><br/>Don’t know death, dare to insult them!\t\t\t\t\t\t</div>", "images": {}, "success": true}