{"id": 568, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073037.html", "title": "Chapter 3559 - 3559 3558 Holy Dragons Were Trash! Go", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3559 - 3559 3558 Holy Dragons Were Trash! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3559 3558 Holy Dragons were trash! Go<br/><br/>“Dragon King, the curse has been blocked. The other party must have used an innate supreme treasure to block the curse of the Devil’s Corpse!”<br/><br/>At the same time, in front of the Dragon Palace, when the heaven array was preparing to kill the second Holy Dragon, the Divine Light Dragon, who was a master of the universe with a level three combat strength, a surge of energy blocked the curse this time!<br/><br/>He frowned slightly and reported to Wang Xian!<br/><br/>“Was it blocked? The other party has an innate supreme treasure, and it should be a light-attributed innate supreme treasure. It’s only right for it to be blocked!”<br/><br/>Wang Xian spoke.<br/><br/>He wasn’t too surprised that the other party could block it!<br/><br/>The cursed source of the Devil’s corpse innate supreme treasure belonged to the darkness attribute while the light-attributed innate supreme treasure could somewhat restrain it!<br/><br/>With the foundation of the Holy Dragon lineage, it was normal for them to be able to withstand it.<br/><br/>He was already very satisfied with being able to eliminate one of them!<br/><br/>“Collect all the corpses. Hehe, I have gained a lot this time!”<br/><br/>Wang Xian swept his gaze across the surroundings and took out the universe AI. He took some photos and said with a smile on his face!<br/><br/>“It’s the Dragon King. I have indeed gained a lot this time!”<br/><br/>Prime Minister Gui and the rest flew over and said excitedly!<br/><br/>Five corpses of universe masters with level 3 combat strength and more than 20 corpses of universe masters with Level 2 combat strength!<br/><br/>This was enough to bring seven universe masters with level 3 combat strength to the Dragon Palace!<br/><br/>With the addition of these three, the number of experts in the Dragon Palace could break through 20!<br/><br/>Among the 20 universe masters with level 3 combat strength, a monster like Wang Xian and the strength of the Dragon Palace were among the top existences among the high-level races!<br/><br/>He took a few photos and returned to the dragon throne in the Dragon King Palace!<br/><br/>Following that, he uploaded all these photos to the universe’s AI under the name of the Dragon Palace. He even added some words on them!<br/><br/>Dragon Palace: do you think that this bunch of lackeys from the Holy Dragon clan want to unify the Holy Dragon Clan? Do you think that a bunch of dogs are worthy of unifying the Holy Dragon Clan? With such strength, they still dare to come and destroy our Dragon Palace. The Holy Dragon lineage, not only have you all degenerated into lackeys, you are also a bunch of trash. The bloodline of the Holy Dragon Clan has been tainted by you all.., if it wasn’t for the fact that the base of Your Holy Dragon lineage is located in the Angel clan, our Dragon Palace would be able to destroy you all right now, you dogs! That’s it?<br/><br/>Wang Xian sent the message. His eyes were filled with coldness!<br/><br/>He was filled with contempt towards the holy dragon lineage!<br/><br/>The magnificent bloodline of the peak of the universe had completely defiled them!<br/><br/>Why did he have to be a lackey no matter what!<br/><br/>Now, if the Holy Dragon lineage was not in the nest of the angel race, Wang Xian would definitely attack them directly and destroy them!<br/><br/>However, this time, he was also extremely humiliated on the universal ai!<br/><br/>After the other party sent over so many corpses and resources, Wang Xian was confident that he could destroy the current holy dragon lineage!<br/><br/>Even if the angel race might send their affiliated races to help, Wang Xian was not too afraid!<br/><br/>In a war, the Dragon Palace could improve rapidly!<br/><br/>With their current strength, it was sufficient for them to protect themselves. In that case, the outbreak of war would only make the dragon palace stronger and stronger!<br/><br/>After Wang Xian sent out this message, he didn’t bother about it anymore!<br/><br/>He knew that the Dragon Palace’s extermination of the experts of the Holy Dragon lineage would cause an uproar in the heaven-splitting chaotic land!<br/><br/>And it was just as he had expected!<br/><br/>This message from Wang Xian was accompanied by a bunch of photos!<br/><br/>In the photos, the corpses of the radiant divine dragon were clearly visible!<br/><br/>In particular, one of them was the corpse of the Holy Dragon’s son!<br/><br/>As the most outstanding son of the Holy Dragon King, many powerhouses knew the Holy Dragon’s son!<br/><br/>In particular, the fact that the Holy Dragon’s son had led the powerhouses of the Holy Dragon lineage to exterminate the Dragon Palace was known by all the disciples of the powerhouses of the various races!<br/><br/>Many of them were waiting for the news of this battle!<br/><br/>In their opinion, the Dragon Palace would lose and escape in this battle!<br/><br/>However, when they saw this message from Wang Xian, they instantly went into a frenzy!<br/><br/>“D * MN, is this for real? What’s going on? The Dragon Palace actually posted such information on the universe’s AI? These… These are all the corpses of the Great Beings of the Holy Dragon Lineage?”<br/><br/>“This… this… The Holy Dragon son of the Holy Dragon lineage led a group of great beings to exterminate the Dragon Palace and was killed? How is this possible? How is this possible!”<br/><br/>“Eleven universe masters with level 3 combat strength, and more than 20 universe masters with Level 2 combat strength. This force should be able to easily defeat the Dragon Palace, right?”? “What’s going on?”? “More than 30 light dragon corpses, and the Dragon Palace killed the Holy Dragon Son and the others?”<br/><br/>“The picture in the center shows the Holy Dragon Son. The Holy Dragon son of the Holy Dragon lineage was killed. How can the Dragon Palace be so terrifying?”<br/><br/>“Hiss, I can’t believe it. The Great Beings of the Holy Dragon lineage should have just arrived at the Dragon Palace not long ago, right? And they were killed? Killed!”<br/><br/>On the universe’s AI, all the creatures of the forces saw this sudden news and opened their eyes wide, full of disbelief!<br/><br/>The Warriors of the Holy Dragon were killed!<br/><br/>The 30-ODD corpses, the 30-odd corpses of the Light Dragon God!<br/><br/>This… completely exceeded their expectations!<br/><br/>Just how strong was the Dragon Palace?<br/><br/>How could this dragon palace be so terrifying!<br/><br/>The Dragon Palace had just destroyed the Hundred City Alliance not too long ago, yet their strength was actually hidden so deeply?<br/><br/>It was simply unbelievable!<br/><br/>Many great beings couldn’t believe it!<br/><br/>11 universe masters with level 3 battle strength had charged into the dragon palace, yet in such a short period of time, more than half of them had been annihilated!<br/><br/>Just how strong was the Dragon Palace?<br/><br/>They could only kill those of the same level in a 3-on-1 fight!<br/><br/>“No wonder the Dragon Palace didn’t respond to the attack of the Holy Dragon Bloodline. It seems that the Dragon Palace doesn’t put the Holy Dragon bloodline in their eyes at all!”<br/><br/>“The statement of the Dragon Palace is really awesome. They call the Holy Dragon bloodline a dog and a piece of trash. This dragon palace is so fierce!”<br/><br/>“Indeed, they are really too strong. I want to know how many experts there are in the Dragon Palace Right Now!”<br/><br/>On the AI, countless of the races were dumbfounded!<br/><br/>The Dragon Palace that could kill the Holy Dragon Lineage’s Holy Dragon Son and the rest of the experts was too terrifying!<br/><br/>Such strength could be ranked among the top among the high-level races!<br/><br/>They felt that this battle record was even stronger than the ancestral dragon lineage!<br/><br/>Wang Xian’s announcement made the entire heaven-splitting primordial land boil!<br/><br/>At this moment, other than the peak races, all the other races had to pay attention to the Dragon Palace!<br/><br/>This battle and this announcement from the Dragon Palace shocked everyone!<br/><br/>On the contrary, the Holy Dragon lineage had lost a lot of face this time!<br/><br/>A year ago, the Holy Dragon King of the Holy Dragon lineage killed the leader of the ancestral dragon lineage and announced that they wanted to unify the Holy Dragon lineage!<br/><br/>In the end, the son of the sacred dragon had just killed one of the peak experts of the ancestral dragon lineage, and almost all of them were killed by the Dragon Palace!<br/><br/>Furthermore, the Dragon Palace had bluntly said that the sacred dragon lineage was trash and a lackey!<br/><br/>This was a blatant humiliation!\t\t\t\t\t\t</div>", "images": {}, "success": true}