{"id": 563, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073027.html", "title": "Chapter 3554 - 3554 3,553 Moves To Kill The Son Of The Sacred Dragon", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3554 - 3554 3,553 Moves To Kill The Son Of The Sacred Dragon</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3554 3,553 moves to kill the son of the sacred dragon<br/><br/>“Roar! Roar! Roar!”<br/><br/>The Sacred Dragon Roared, and the experts of the Sacred Dragon bloodline immediately turned into their dragon bodies and stared at the Dragon Palace with cold faces.<br/><br/>Their overwhelming Majesty attacked the Dragon Palace!<br/><br/>The current Dragon Palace couldn’t withstand their attacks, and it looked like it was on the verge of collapse!<br/><br/>The experts of the sacred dragon bloodline locked their eyes on the Dragon Palace with cold faces!<br/><br/>“Don’t make a move. I want to kill this Dragon King of the Dragon Palace myself and take his head!”<br/><br/>The son of the Holy Dragon let out a low growl and spoke with a cold expression!<br/><br/>He swooped down and extended his dragon claws. The innate supreme treasure, double dragon eyes, and the innate supreme treasure, Holy Peak, slowly appeared behind him!<br/><br/>“Hehe, son of the Holy Dragon, do you want to fight one-on-one?”<br/><br/>Wang Xian stared at the son of the Holy Dragon with a hint of mockery in his eyes. His gaze swept across the innate supreme treasures on him.<br/><br/>There were only two of them. He thought there would be more!<br/><br/>“I’m going to pull out your tendons and Bones!”<br/><br/>The son of the Sage Dragon glared at Wang Xian with a murderous look as he spoke in a sinister tone!<br/><br/>“They’re fighting. They’re so fast. We can’t even see them when they’re fighting!”<br/><br/>“They’re fighting so quickly. The Dragon Palace seems to be on the verge of collapse. I think the Dragon Palace is doomed!”<br/><br/>“I think we can get closer. F * ck, it’s a real battle!”<br/><br/>From an extremely far distance, the group of bold powerhouses saw the son of Saint Dragon moving through various supporting tools. They shouted in a low voice with shock on their faces!<br/><br/>The only pity was that once the son of Saint Dragon moved, they wouldn’t be able to see clearly anymore!<br/><br/>Some of the powerhouses considered getting closer!<br/><br/>“One on one, I can easily kill you!”<br/><br/>Above the Dragon Palace, when the son of the sacred dragon heard Wang Xian’s words, his eyes were filled with disdain and coldness!<br/><br/>Not long ago, he easily killed a level 3 universe dominator of the ancestral dragon lineage.<br/><br/>Now that he was facing the Dragon King of the Dragon Palace, he was confident that he could easily kill him!<br/><br/>As for the possibility that there might be other level 3 universe Dominators in the Dragon Palace, he was not worried at all!<br/><br/>If there were any other masters of the Dragon Palace who dared to launch a sneak attack, the masters of the Holy Dragon lineage in the sky would smash them into pieces!<br/><br/>“Hehe!”<br/><br/>Wang Xian looked at the extremely confident son of the Holy Dragon and the corner of his mouth curled up slightly!<br/><br/>The incipient sacred wings slowly appeared behind him. The Five Elements Millstone and the Tai Chi Dragon Disc faintly appeared!<br/><br/>The Spirit Spirit also appeared in front of his shoulder. The water touch king was lying on his shoulder!<br/><br/>At this moment, Wang Xian started to move!<br/><br/>His figure immediately disappeared!<br/><br/>“HMM!”<br/><br/>At this moment, the pupils of the Holy Dragon Son shrunk slightly as he quickly scanned his surroundings!<br/><br/>He saw a figure charging towards him at a terrifying speed!<br/><br/>“Do you think I can’t See It?”<br/><br/>The holy dragon son growled in a low voice. His two dragon eyes emitted a luster as two rays of light shone directly towards Wang Xian’s body!<br/><br/>Whoosh<br/><br/>However, at this moment, the five elements millstone spun and the five divine dragons stuck their heads out and attacked the pair of dragon eyes directly!<br/><br/>Bang<br/><br/>The light shone by the pair of dragon eyes was blocked by the five elements millstone. Furthermore, the speed of the five elements millstone did not decrease as it struck towards the pair of dragon eyes!<br/><br/>“What? An innate supreme treasure?”<br/><br/>The son of the Saint Dragon’s face changed slightly when he saw that the attack of his innate supreme treasure, the pair of dragon eyes, was actually blocked!<br/><br/>“Let’s compete with innate supreme treasures. Haha, Good, Holy Peak!”<br/><br/>He let out a ferocious roar. The innate supreme treasure holy peak on his body trembled and immediately transformed into an incomparably terrifying giant peak that pressed down on Wang Xian!<br/><br/>Buzz<br/><br/>Wang Xian’s body trembled as the Ghost Avatar appeared from within his body!<br/><br/>The spirit waved the water lotus staff in her hand and waves of energy were injected into the ghost avatar!<br/><br/>“Roar!”<br/><br/>The Netherworld Ghost Avatar transformed into the form of a divine dragon and charged towards the Holy Peak!<br/><br/>“Boom! Boom!”<br/><br/>A violent collision sound was heard once again. The Netherworld Ghost Avatar had the support of Ling Ling and was able to resist the second innate treasure of the son of Sage Dragon!<br/><br/>Wang Xian stared at the son of Sage Dragon with a look of disdain.<br/><br/>“Crash!”<br/><br/>With the activation of the primaless saint wings, his speed increased explosively once again!<br/><br/>“What?”<br/><br/>At this moment, the son of the Holy Dragon was shocked!<br/><br/>His proud face was filled with shock, and his pupils could not help but shrink slightly!<br/><br/>“Not good!”<br/><br/>In the sky, the experts of the Holy Dragon lineage who were watching the battle indifferently had a drastic change in expression!<br/><br/>“Be careful, son of the Holy Dragon!”<br/><br/>The experts of the Holy Dragon lineage roared furiously and started moving immediately!<br/><br/>“This counts as three moves, I’ll kill you instantly!”<br/><br/>The Holy Dragon Son couldn’t see Wang Xian anymore. He wanted to fly up to the sky immediately, but a voice rang in his ears!<br/><br/>“Ah!”<br/><br/>The next moment, he felt an immense pain coming from his head.<br/><br/>The threat of death enveloped him!<br/><br/>“No!”<br/><br/>He roared furiously with a face full of shock and anger!<br/><br/>“Bang!”<br/><br/>However, the next moment, he saw his head being chopped off. His life force was rapidly dissipating!<br/><br/>“That’s it? You still dare to be arrogant in front of me?”<br/><br/>Wang Xian held the dragon head of the son of the sage Dragon and said with disdain and mockery.<br/><br/>That’s it?<br/><br/>That’s it?<br/><br/>The son of the sage Dragon’s eyes were wide open. The dragon blood on his body was gushing out continuously!<br/><br/>How was this possible?<br/><br/>He was the son of the Sacred Dragon!<br/><br/>With two innate supreme treasures, he could easily kill an existence of the same level!<br/><br/>However, in front of the Dragon King, he couldn’t even withstand three moves!<br/><br/>To say that it was three moves, he was probably overestimating himself!<br/><br/>The other two moves were used by the other party to block the attack of his innate supreme treasure!<br/><br/>“Let go of our son of the Sacred Dragon, Stop! If you dare to kill our son of the Sacred Dragon, our sacred dragon lineage will turn you into ashes!”<br/><br/>When the experts of the Holy Dragon lineage saw this scene, their eyes were about to pop out of their sockets. They roared and threatened!<br/><br/>Buzz<br/><br/>However, at this moment, the sky suddenly changed. The Shadows of the Divine Dragons appeared in the surroundings!<br/><br/>Space imprisonment!<br/><br/>“Eleven masters of the universe with level three combat strength dare to destroy my Dragon Palace?”<br/><br/>Wang Xian raised his head and looked at the sky. He smiled sinisterly and said, “Kill them!”<br/><br/>“Roar!”<br/><br/>In the next moment, terrifying roars came from the Dragon Palace!<br/><br/>Berserk Dragon, Thunder Dragon, Starwood Dragon, Venom Dragon!<br/><br/>Ao Qitian and the rest flew up into the sky!<br/><br/>The 11 level 3 masters of the universe were filled with killing intent.<br/><br/>“This is boring. I haven’t even made a move yet. Next, I’m going to slaughter a Lackey!”<br/><br/>King watertouch looked at the head of the Holy Dragon Son and fixed his gaze on a divine light dragon!<br/><br/>The Lackey of the Angel race was King watertouch’s enemy!<br/><br/>“Bang!”<br/><br/>Wang Xian waved his arm and the head and body of the Holy Dragon Son landed directly in front of the Dragon Palace!<br/><br/>He flapped his incorporeal sacred wings and immediately started to move!<br/><br/>“What? How is this possible?”<br/><br/>“How is this possible?”<br/><br/>When the Great Beings of Dragon Palace started to move, all the Great Beings of the sacred dragon lineage were completely stunned!<br/><br/>They felt the terrifying power of the Great Beings of Dragon Palace, and their expressions changed drastically!<br/><br/>That terrifying aura was much more powerful than theirs!<br/><br/>This Dragon Palace actually had over a dozen universe master level three Great Beings!\t\t\t\t\t\t</div>", "images": {}, "success": true}