{"id": 567, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073035.html", "title": "Chapter 3558 - 3558 The 3557 Holy Dragon Lineage Was Trash", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3558 - 3558 The 3557 Holy Dragon Lineage Was Trash</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3558 The 3557 Holy Dragon lineage was trash<br/><br/>“Lord Holy Dragon King, Lord Holy Dragon King!”<br/><br/>Urgent voices rang out in the sky above the Life Dragon King’s palace. The experts of the Holy Dragon lineage quickly flew over.<br/><br/>Among them, there were four experts who were emitting dense blood qi!<br/><br/>Those were injuries that they had not recovered from!<br/><br/>“Eh?”<br/><br/>In a room in the great hall, because he had killed the leader of the ancestral dragons, the Holy Dragon King was sleeping leisurely with a few mother divine light dragons in his arms. Suddenly, he sensed his subordinates rushing in and shouting loudly, and he was slightly stunned.<br/><br/>When he sensed the extremely weak bodies of four of the divine dragons, he was slightly shocked and immediately flew into the Great Hall.<br/><br/>“What happened?”<br/><br/>He came to the Dragon Chair in the hall and looked at the six subordinates who were flying towards him.<br/><br/>His face darkened as he looked at their bodies!<br/><br/>“Not good, Holy Dragon King. The Holy Dragon Son was killed by the Dragon King of the Dragon Palace. Our four brothers were also killed by the Dragon King!”<br/><br/>A terrified voice came out of the mouth of a divine dragon of light!<br/><br/>At this moment, his face was full of Panic!<br/><br/>The battle with the Dragon Palace was a nightmare to them!<br/><br/>That terrifying strength, the sacred dragon son was killed in three moves!<br/><br/>They risked their lives to escape from the Dragon Palace!<br/><br/>The strength of the Dragon Palace made them feel fear!<br/><br/>The strength of the Dragon Palace made them feel fear!<br/><br/>That Dragon Palace was too strong!<br/><br/>The 11 universe masters with level 3 battle strength couldn’t resist at all!<br/><br/>“What?”<br/><br/>Hearing this news, Sacred Dragon Emperor’s expression changed drastically. He stood up abruptly and roared in disbelief!<br/><br/>“Not only that, more than 20 of US Universe Masters with level-two Combat Power were all killed. We didn’t even have a chance to escape. We also risked our lives to escape!”<br/><br/>Another pinnacle great being from the sacred dragon lineage said, his breathing quickened!<br/><br/>“Ah Ah Ah Ah!”<br/><br/>However, all of a sudden, he had just finished speaking when he let out a terrified roar!<br/><br/>A great terror descended upon his head. He widened his eyes and slowly extended his arm to cover his head. His eyes were filled with Panic!<br/><br/>“Sir Holy Dragon King, Save Me, save me!”<br/><br/>His eyes were wide open as he frantically shouted!<br/><br/>“This…”<br/><br/>When the Holy Dragon King saw this scene, his expression changed drastically as he appeared beside the Divine Dragon and placed his palm on his head!<br/><br/>Waves of majestic light energy landed on his head!<br/><br/>However, the influx of light energy was unable to stop his head from continuing to split open!<br/><br/>“Ahhhh!”<br/><br/>Miserable screams continued to come out from his mouth as the life force in his body rapidly melted!<br/><br/>“No, no, no, no, no, no!”<br/><br/>Crazy Voices kept coming out of his mouth.<br/><br/>He didn’t want to die!<br/><br/>The other five divine light dragons around saw this scene, and their expressions changed drastically!<br/><br/>“Attack!”<br/><br/>The Holy Dragon King growled, trying to save and Block!<br/><br/>“Puff!”<br/><br/>But suddenly, it seemed like an incomparably sharp attack pierced through the body of this divine dragon, directly cutting it into two pieces. Moreover, a strange energy invaded his flesh and blood, and his life force disappeared!<br/><br/>“Bang!”<br/><br/>The Divine Dragon of light slowly returned to the appearance of a divine dragon, falling into the hall!<br/><br/>“This is a curse, this is the power of a curse. The Dragon Palace actually has a terrifying cursed magus? Not Good, we all left a large amount of blood there!”<br/><br/>A powerhouse saw his companion and powerhouse of the same race die in front of them in such a strange manner. His body trembled violently, and he cried out in fear!<br/><br/>They looked at each other with intense fear!<br/><br/>This Dragon Palace was too strange!<br/><br/>“Will the curse continue to descend?”<br/><br/>An injured old man with a weak body opened his mouth and asked!<br/><br/>However, no one answered him!<br/><br/>“What is going on? How can the Dragon Palace be so powerful? This king’s son, he… and all of you…”<br/><br/>The Holy Dragon King stood in front of the corpse of his subordinate and roared in disbelief!<br/><br/>All of a sudden, he felt incredulous!<br/><br/>His expression changed drastically!<br/><br/>“Ah!”<br/><br/>“I’m cursed, I’m cursed. I can feel it. Lord Holy Dragon King, Save Me!”<br/><br/>At this moment, another panicked voice came from the mouth of a middle-aged divine dragon beside him!<br/><br/>He held his head in despair!<br/><br/>“Damn it!”<br/><br/>The Divine Dragon King saw it and roared. With a move of his palm, an incomparably resplendent dragon pearl appeared in front of him.<br/><br/>The Dragon Pearl emitted a ray of light and enveloped it!<br/><br/>At the same time, a book also appeared in front of him. The words on the book emitted a bright light and landed on his body!<br/><br/>The two innate supreme treasures formed a defense on his body at the same time!<br/><br/>The effect of the two innate supreme treasures was also very obvious!<br/><br/>The crack on his head slowly disappeared!<br/><br/>“This is not just the power of the curse, it should be the power of the innate Supreme Treasure!”<br/><br/>The Sacred Dragon King sensed it through the innate supreme treasure and said with an extremely ugly expression!<br/><br/>His breathing was a little hurried and his expression was uncertain!<br/><br/>His gaze swept over the corpse at the side again and his body trembled!<br/><br/>“Tell me, what’s the situation?”<br/><br/>He growled in a low voice!<br/><br/>“Sacred Dragon King, our second target is the Dragon Palace. That Dragon Palace is very powerful. When we arrived, that Dragon King killed the sacred dragon son who had two innate supreme treasures in three moves.”<br/><br/>A great being beside him gulped, with lingering fear, he said, “Besides, with our strength, the Dragon King of the Dragon Palace can easily kill us. His strength is very terrifying. Besides, there are more than ten universe masters with level three combat strength. They are very powerful!”<br/><br/>The Dragon Palace was very powerful!<br/><br/>The Dragon Palace was very powerful!<br/><br/>This was what they felt!<br/><br/>In their eyes, the Dragon Palace was even stronger than the Sacred Dragon Clan!<br/><br/>Especially the Dragon King of the Dragon Palace, who was extremely powerful!<br/><br/>They even felt that the Dragon King of the Dragon Palace was not weaker than the Sacred Dragon King, or even stronger!<br/><br/>“Very powerful?”<br/><br/>The Sacred Dragon King looked at their fearful expressions and knew that they were really scared by the Dragon Palace this time!<br/><br/>Even when they fought with the great beings of the ancestral dragon lineage and fought with the leader of the ancestral dragon, they had never seen such expressions before!<br/><br/>Obviously, the power of the Dragon Palace and the power of the Dragon Palace were very strong!<br/><br/>“How can the Dragon Palace be so strong?”<br/><br/>Sacred Dragon Emperor’s expression was very ugly!<br/><br/>He had just killed a powerful enemy, the leader of the ancestral dragon lineage. He thought that the sacred dragon lineage could unify the godly dragon race, but he didn’t expect that a dragon palace would suddenly appear!<br/><br/>Furthermore, this Dragon Palace had killed six universe ruler level three great beings in one go!<br/><br/>There were six of them!<br/><br/>The death of so many pinnacle great beings had greatly damaged the power of their Holy Dragon Clan!<br/><br/>Hu<br/><br/>He clenched his fists tightly, and his expression changed!<br/><br/>His most outstanding son had been killed by Dragon Palace Dragon King!\t\t\t\t\t\t</div>", "images": {}, "success": true}