{"id": 564, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073029.html", "title": "Chapter 3555 - 3555 The Panicking Great Beings Of The Holy Dragon Bloodline", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3555 - 3555 The Panicking Great Beings Of The Holy Dragon Bloodline</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3555 The panicking Great Beings of the Holy Dragon Bloodline<br/><br/>“How can there be so many pinnacle great beings in Your Dragon Palace? How is this possible?”<br/><br/>The Holy Dragon Bloodline had 10 universe masters with level-three Combat Power, and over 20 universe masters with level-two Combat Power.<br/><br/>They looked at the scene in front of them and found it unbelievable!<br/><br/>Over 10 universe masters with level-three Combat Power?<br/><br/>The Holy Dragon bloodline had developed for countless years, and the angel race had rewarded them with some resources!<br/><br/>But what about Dragon Palace?<br/><br/>How long had it been, and it had already gained such terrifying power!<br/><br/>Most importantly, that Dragon King, the terrifying Dragon Palace!<br/><br/>He killed the Holy Dragon Son in three moves!<br/><br/>The Holy Dragon Son had two connate true treasures!<br/><br/>“Run, run, run! Run Now!”<br/><br/>Seeing the Great Beings of Dragon Palace charging at them, the 10 pinnacle great beings of the sacred dragon lineage did not hesitate and roared!<br/><br/>Run!<br/><br/>With the power of Dragon Palace, they were no longer a match for them!<br/><br/>This was the territory of Dragon Palace. If they were not careful, they might die here!<br/><br/>In addition, the 10 pinnacle great beings could still defend a little.<br/><br/>However, more than 20 universe masters with level-two combat power couldn’t withstand the attacks of the Dragon Palace!<br/><br/>They didn’t hesitate to flee!<br/><br/>“There’s a space-restricting array around us. Break this array!”<br/><br/>A light dragon roared in shock and anger!<br/><br/>“I’ll do it! Break It!”<br/><br/>The Light Dragon in the center roared, and a pair of scissors appeared in the sky above him.<br/><br/>The scissors were grey and looked as though they didn’t have any attributes!<br/><br/>The pair of scissors opened up and cut towards the void!<br/><br/>The Divine Light Dragon Phantom around them started to collapse rapidly!<br/><br/>“What? He’s the Dragon King. They have a powerful innate treasure in their hands!”<br/><br/>At the lower position, the heaven formation was slightly shocked when it saw its anti-air formation being broken!<br/><br/>“Kill as many as you can!”<br/><br/>Wang Xian’s gaze locked onto a divine light dragon and instantly arrived at his side!<br/><br/>“Scram!”<br/><br/>The expression of the divine light dragon changed drastically. It stirred up a terrifying dragon’s might and brought along endless power of light as it swept towards Wang Xian’s direction!<br/><br/>Faced with Wang Xian’s attack, he didn’t dare to be the slightest bit careless. The moment he made his move, he used his law projection!<br/><br/>Wang Xian’s expression didn’t change as the light swept across. The tai chi dragon around him revolved and his spirit waved the staff in his hand. A stream of energy covered his entire body!<br/><br/>“Die!”<br/><br/>Wang Xian’s arm turned into a dragon claw and clawed at the tail of the Divine Dragon of light!<br/><br/>“You’re courting death!”<br/><br/>When the Divine Dragon of light saw that Wang Xian dared to attack with his dragon tail, his expression turned ferocious!<br/><br/>This Dragon King was probably looking for trouble!<br/><br/>However, in the next second, his ferocious expression froze!<br/><br/>He felt that his dragon tail had collided with a terrifying force. An extremely powerful rebounding force rushed into his body!<br/><br/>“PFFT!”<br/><br/>He could not help but spit out a mouthful of fresh blood. He was severely injured in an instant!<br/><br/>Following that, he felt the world spinning. Waves of terrifying energy surged into his body and his life force rapidly disappeared!<br/><br/>“Bang!”<br/><br/>His body crashed heavily in front of the Dragon Palace. His life force gradually disappeared!<br/><br/>The second divine light dragon was killed instantly!<br/><br/>At this moment, a level three universe dominator without an innate supreme treasure could not even withstand a single move from Wang Xian!<br/><br/>“Kill!”<br/><br/>After the second divine dragon was killed, Wang Xian immediately locked onto the next moment!<br/><br/>“Not good, not good, third brother has been killed!”<br/><br/>The death of this divine light dragon caused the expressions of the surrounding experts of the Holy Dragon lineage to change drastically. They roared in fear!<br/><br/>Their faces were filled with shock!<br/><br/>A level three universe overlord with combat strength was killed in an instant?<br/><br/>Was the Dragon King of Dragon Palace a terrifying universe overlord?<br/><br/>How could he be so powerful?<br/><br/>“Fight with all your might!”<br/><br/>The Universe Overlord with level 3 Combat Power, the Light Dragon God, glanced down and roared in fear!<br/><br/>If they didn’t fight with all their might, if they didn’t run, they would all be killed!<br/><br/>Why was Dragon Palace so powerful?<br/><br/>Now, they finally understood why the Dragon Palace didn’t run away when they found out that they were coming!<br/><br/>Because the Dragon Palace wasn’t afraid of them at all!<br/><br/>They even felt that it would be difficult for them to kill the Dragon King alone!<br/><br/>It was too terrifying!<br/><br/>Boom! Boom! Boom<br/><br/>In the next moment, all the experts of the Sacred Dragon bloodline released their strongest energy in fear!<br/><br/>They wanted to escape!<br/><br/>“Cut the Air!”<br/><br/>The Divine Light Dragon with the innate supreme treasure roared and directly cut the space around his companion!<br/><br/>The space around his companion seemed to have been cut off, forming a separate space!<br/><br/>He quickly returned to his divine kingdom!<br/><br/>“Boom!”<br/><br/>Ao Qitian flew towards him, but was blocked by the strange space!<br/><br/>A light godly dragon was escaping!<br/><br/>“Ah! Ah! No! No!”<br/><br/>However, at this moment, a scream was heard again!<br/><br/>“What?”<br/><br/>The Pinnacle Great Beings of the Holy Dragon Branch, who were holding true treasures, looked over, and their eyes instantly turned blood-red!<br/><br/>More than 20 Great Beings of the Holy Dragon Branch, who were fighting level two universe masters, let out screams!<br/><br/>A dark and light figure was rapidly harvesting their lives!<br/><br/>They couldn’t resist at all!<br/><br/>“Thorned dragon seed, this is a strange thorned dragon seed!”<br/><br/>The Holy Dragon Great being who was holding an innate true treasure roared.<br/><br/>“Run!”<br/><br/>He controlled his innate true treasure to isolate his own space, and then he cut the space around his other companion!<br/><br/>“Run! Have you asked me?”<br/><br/>Water Touch Emperor roared, and drops of seawater covered the space that was cut off, completely blocking it!<br/><br/>The water current surged into the space, blocking the escape of the expert from the Holy Dragon lineage!<br/><br/>“What kind of attack is this? What kind of strange attack is this?”<br/><br/>The expert from the Holy Dragon lineage roared in disbelief.<br/><br/>With the obstruction of the water energy, he would be interrupted instantly when he returned to his divine kingdom!<br/><br/>“You are courting death!”<br/><br/>At this moment, Wang Xian’s figure flashed and attacked the Divine Light Dragon who was holding the innate treasure!<br/><br/>“Oh no, that Dragon King has locked onto me. He has locked onto me!”<br/><br/>At this moment, even though he was in a special space, the expert from the Holy Dragon lineage broke out in cold sweat instantly.<br/><br/>After witnessing Wang Xian’s strength, he didn’t dare to go against him!<br/><br/>The expert from the Holy Dragon lineage who was holding the innate treasure gritted his teeth. The grayish scissors in front of him slashed backward, creating a terrifying black hole in an instant!<br/><br/>“Run for your lives, Run!”<br/><br/>He didn’t dare to care about his other companions. He entered the black hole and disappeared!<br/><br/>“Ah!”<br/><br/>At this time, another scream came!<br/><br/>“Bird Man’s dog, die!”<br/><br/>The tentacles of the water-tentacle king squeezed into the space that was cut open and wrapped around the light dragon!<br/><br/>“Howl! Howl! Howl!”<br/><br/>Another scream was heard. Another level three universe master from the bloodline of the Holy Dragon died!<br/><br/>“No, no! Dragon Tail, explode!”<br/><br/>The level three universe masters from the bloodline of the Holy Dragon panicked when they saw this scene!<br/><br/>A great being exploded his dragon tail, creating a space for him to escape!\t\t\t\t\t\t</div>", "images": {}, "success": true}