{"id": 577, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073055.html", "title": "Chapter 3568 - 3568 Among The 3567 Heaven-Destroying Demonic Beasts", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3568 - 3568 Among The 3567 Heaven-Destroying Demonic Beasts</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3568 Among the 3567 heaven-destroying demonic beasts<br/><br/>“Damn it!”<br/><br/>The group of Level 3 universe masters of the heaven-destroying demonic beasts stared at the group of experts from the Dragon Palace in shock!<br/><br/>When they saw the dozen or so level 3 universe masters of the Dragon Palace, their expressions were abnormally ugly!<br/><br/>The Dragon Palace had already arrived at their lair, yet they didn’t even notice it!<br/><br/>“Kill!”<br/><br/>Wang Xian continued to lock onto the leader of the sky-planting demonic beast and shouted coldly!<br/><br/>The power of wind and thunder on the incipient Saint Wings burst out!<br/><br/>“Attack! This is the territory of the sky-planting demonic beast. With our strength, we can totally withstand it!”<br/><br/>When the leader of the sky-planting demonic beast saw Wang Xian charging at him again, his face was filled with vigilance!<br/><br/>He roared loudly and a branch extended out from his body!<br/><br/>On this branch, there was an incomparably resplendent leaf of the tree of light!<br/><br/>This leaf contained a terrifying power!<br/><br/>In the eyes of the leader of the sky-planting demonic beast, the instant kill earlier was caused by a sneak attack!<br/><br/>Now that he had taken out his innate supreme treasure and was in his complete form, even if he wasn’t a match for the Dragon King, he could still spar with him!<br/><br/>The resplendent leaf emitted a luster and dense leaves of the tree of light appeared around him in an instant!<br/><br/>These bright leaves attacked Wang Xian directly!<br/><br/>Even though Wang Xian was very fast, he was still able to lock onto them!<br/><br/>“Dragon King, leave it to me!”<br/><br/>However, the leader of the sky-planting demonic beast tribe thought that everything was too simple!<br/><br/>The water-touching King, who was on Wang Xian’s shoulder, started to move and welcomed the bright leaves of the innate treasure!<br/><br/>Splash<br/><br/>Her entire body turned into a ball of seawater and wrapped around the leaves!<br/><br/>The seawater completely wrapped around the leaves of the tree of light!<br/><br/>Wang Xian’s speed continued to attack the Chief of the sky-planting Demonic Beast tribe!<br/><br/>“What!”<br/><br/>The Chief of the sky-planting demonic beast tribe was slightly stunned when he saw his innate treasure being completely blocked by a demonic beast!<br/><br/>He quickly waved the branches on his body to resist!<br/><br/>However, the attack of the water touch king was not blocked. Instead, it covered the branch!<br/><br/>“What the Hell Is This?”<br/><br/>When the leader of the Sky Plant Demonic Beast saw this terrifying attack, his expression changed drastically. He couldn’t help but Roar in horror!<br/><br/>Buzz<br/><br/>At this moment, the five elements millstone flew out from Wang Xian’s body and directly covered the Sky Plant Demonic Beast Leader’s body!<br/><br/>“Roar! Roar! Roar!”<br/><br/>The five elements millstone enlarged and completely covered him. On top of it, the five divine dragons let out furious roars!<br/><br/>“Not good!”<br/><br/>Feeling this terrifying pressure, the sky plant chief’s face changed drastically. His eyes were filled with fear!<br/><br/>This five elements Millstone gave him a threat of death!<br/><br/>“Crash!”<br/><br/>At this moment, Wang Xian rushed in front of him again. His arm turned into a dragon claw.<br/><br/>The huge Dragon Claw attacked his body.<br/><br/>“Get lost!”<br/><br/>The leader of the Sky Plant Demonic Beast’s face changed drastically. With a ferocious expression, he roared and countless branches covered Wang Xian!<br/><br/>The branches attacked Wang Xian one by one. Around Wang Xian, the Taiji Dragon disc appeared!<br/><br/>The Taiji Dragon Disc spun and the branches landed on it. The Taiji Dragon Disc did not move at all!<br/><br/>On the contrary, a terrifying backlash force caused the branches to wither rapidly!<br/><br/>“Ah!”<br/><br/>A pained roar came from the leader of the Tianzhi Demonic Beast!<br/><br/>Wang Xian’s dragon claws landed on the main body of the leader of the Tianzhi Demonic Beast and sank straight into it!<br/><br/>The destructive force of the five elements was eroding his life force!<br/><br/>“No, no!”<br/><br/>The leader of the Tianzhi Demonic Beast felt his body disappearing and roared in horror!<br/><br/>Instant Kill, another instant kill!<br/><br/>Earlier, he thought it was because he was taken by surprise!<br/><br/>This time, he was prepared for everything, but he was still killed in an instant!<br/><br/>His strength was not weak among the level three combat strength of the Masters of the universe!<br/><br/>Furthermore, he had an innate supreme treasure!<br/><br/>Yet he was still killed in an instant!<br/><br/>Just how strong was the Dragon King?<br/><br/>“Die!”<br/><br/>The energy from Wang Xian’s body surged into the chief’s body!<br/><br/>His body began to wither rapidly!<br/><br/>His life force was disappearing rapidly!<br/><br/>Soon, his life force was completely gone, leaving behind an incomparably huge corpse!<br/><br/>However, the moment the chief’s life force dissipated, he sensed that a seed had awakened in the deepest part of the waterfall not far away!<br/><br/>On this seed, there were traces of extremely weak wind and thunder energy!<br/><br/>This was the power of the inceptive holy wings to search for enemies in the void!<br/><br/>“Oh? There’s a life-saving method?”<br/><br/>Wang Xian raised his eyebrows. However, this life-saving method only retained a sliver of hope of revival.<br/><br/>It wasn’t the kind of revival that could directly avoid a fatal blow!<br/><br/>“What!”<br/><br/>“Patriarch? Patriarch was killed again!”<br/><br/>“The Dragon King of the Dragon Palace is very powerful. We Aren’t his match!”<br/><br/>At this moment, the remaining peak experts of the sky plant demonic beast clan trembled when they sensed that their patriarch was killed again!<br/><br/>Their patriarch was killed again!<br/><br/>He was killed again!<br/><br/>How could the Dragon King of the Dragon Palace be so powerful?<br/><br/>How could they defend against such power!<br/><br/>“Run!”<br/><br/>All the peak experts of the sky plant demonic beasts were prepared to run away!<br/><br/>The Dragon King of the Dragon Palace was too powerful!<br/><br/>“Buzz!”<br/><br/>However, at this moment, just as they were about to run away, the entire world started to change color!<br/><br/>Nine-colored auspicious clouds appeared in the sky above them. These auspicious clouds shone with some light and scattered across the space!<br/><br/>“Not good, they have magi, powerful Magi!”<br/><br/>Seeing the nine-colored auspicious clouds suddenly appear and sensing the changes in the surrounding space, their expressions changed drastically!<br/><br/>“Ah!”<br/><br/>Right at this moment, a miserable cry was heard.<br/><br/>This miserable cry caused the peak experts of the Sky Plant Demon Beast clan to tremble once again!<br/><br/>They hurriedly looked to the side!<br/><br/>At the side, a strange black and white figure penetrated one of their companions!<br/><br/>In front of their companion, there was a strange dragon species that was exuding a strange and confusing aura!<br/><br/>Her human body and dragon tail were filled with strangeness.<br/><br/>Her long wavy hair was abnormally beautiful, and her every action was soul-stirring.<br/><br/>She had black and red eyes, and when she looked into his eyes, she felt extremely strange.<br/><br/>This was the charm dragon!<br/><br/>The Charm Dragon was born from a unique and strange ancestral witch’s corpse in the Dragon Palace. This ancestral witch was called the creator by the female snake that was saved by Wang Xian!<br/><br/>Later on, 1,000 dolphins turned into the charm dragon!<br/><br/>Now, the Dragon Palace had 1,000 Charm Dragons, and the leader of the Charm Dragon had a black spider lily!<br/><br/>Standing in front of the Sky Plant Demon Beast was the leader of the Charm Dragon!<br/><br/>With the black spider lilies in hand, the succubus guardian Dragon worked together with Ao Yao and easily killed a level 3 master of the Universe!<br/><br/>“Eh? The Succubus is really powerful and strange on the battlefield. If I had known earlier, I would have improved her strength!”<br/><br/>Wang Xian looked over and mumbled!\t\t\t\t\t\t</div>", "images": {}, "success": true}