{"id": 574, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073049.html", "title": "Chapter 3565 - 3565 3564, Strike First! Attack The Sky-Planting Demonic Beasts! Strike", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3565 - 3565 3564, Strike First! Attack The Sky-Planting Demonic Beasts! Strike</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3565 3564, strike first! Attack the sky-planting demonic beasts! Strike<br/><br/>“Among the six major races, the sky-planting demonic beasts are the furthest away from the angel race. Furthermore, they can teleport directly to the territory of the sky-planting demonic beasts from here!”<br/><br/>Wang Xian mumbled as his eyes sparkled!<br/><br/>His figure moved and disappeared in an instant!<br/><br/>Soon, he arrived at the location of a teleportation formation and teleported over immediately!<br/><br/>When he appeared again, Wang Xian had already arrived at a forest!<br/><br/>The huge forest and the huge trees formed a bustling area!<br/><br/>This forest was called the sky plant forest. The Sky Plant Forest was extremely vast and was also the base camp of the Sky Plant Demonic Beasts!<br/><br/>The Sky Plant Forest was not named after the sky plant demonic beasts!<br/><br/>Instead, the sky plant demonic beasts were named after the Sky Plant Forest!<br/><br/>The Sky Plant Demonic Beasts were the kings of this forest. The entire huge forest had produced about twenty mutated sky plant demonic beasts during this calamity!<br/><br/>The Golden Ring demonic beast that was killed by the elf tribe when they were chasing after Wang Xian was a mutated demonic beast!<br/><br/>Speaking of which, Wang Xian still had a lot of grudges with the Sky Plant Demonic Beasts!<br/><br/>If it wasn’t for the Elf tribe’s experts who attacked him last time, he might have been injured!<br/><br/>Wang Xian appeared in the teleportation formation in this area!<br/><br/>This prosperous area belonged to the periphery of the territory of the sky plant demonic beasts.<br/><br/>This was because the sky plant forest had all kinds of wood-type treasures and many wood-type dire beasts. Many wood-type cultivators would come here to train and look for treasures!<br/><br/>Wang Xian scanned his surroundings!<br/><br/>There were all kinds of wood-attributed creatures moving around. Among them, there were more demonic beasts!<br/><br/>The plant-attributed creatures were also classified as demonic beasts!<br/><br/>There were many trees running around and some flowers and plants!<br/><br/>Wang Xian had the cover of a treasure leaf. When the other experts sensed it, they would only be able to tell that he was a wood-attributed expert!<br/><br/>The surrounding creatures did not pay any attention to his appearance!<br/><br/>Wang Xian walked straight ahead and arrived in front of a huge tree!<br/><br/>The interior of the tree was hollowed out and the words ‘wine of life’were written on it!<br/><br/>Wang Xian walked in and ordered a bottle of wine casually. It was some delicacies unique to this place!<br/><br/>Wang Xian looked around while he was on top of the huge tree!<br/><br/>He searched through the universe’s AI and did not get much information!<br/><br/>Wang Xian took out the universe’s AI and contacted an lie!<br/><br/>An lie quickly replied.<br/><br/>He waved his arm and set up a demonic altar at the side!<br/><br/>A few seconds later, more than ten figures appeared beside Wang Xian!<br/><br/>The poisonous horned dragon species led by the eight-limbed demonic fiend appeared!<br/><br/>“Greetings, Dragon King!”<br/><br/>They looked at Wang Xian and immediately bowed respectfully!<br/><br/>“Yes!”<br/><br/>Wang Xian nodded his head. “Ba Qi, Mo Sha, you should have already received the news from the Holy Dragon lineage, right?”<br/><br/>“Dragon King, we have received the News!”<br/><br/>Ba Qi Mo Sha nodded his head!<br/><br/>Now, after obtaining the resources, Mo Sha’s strength had also undergone a breakthrough. He had reached the level of a level three universe overlord!<br/><br/>Behind them were all level one and level two venomous horned dragons!<br/><br/>“The six great races want to help the Holy Dragon lineage deal with us. We must make some preparations!”<br/><br/>Wang Xian looked at them and said, “This is the territory of the sky plant demonic beasts. Go and infiltrate the sky plant demonic beasts. This time, even if we can’t completely destroy them, we have to kill more than ten level three universe overlords!”<br/><br/>“HMM?”<br/><br/>The eyes of the eight-limbed demonic fiend and the rest flickered slightly. They looked around and said, “Dragon King, leave the task of gathering information to us. We will definitely gather important information about the sky plant demonic beasts as soon as possible!”<br/><br/>“HMM, you have to be quick. We will give you one month to gather information. We will take action immediately after one month.”<br/><br/>Wang Xian instructed them!<br/><br/>“It’s the Dragon King!”<br/><br/>The eight-limbed demonic fiend replied immediately. They gestured to their subordinates behind them and disappeared immediately!<br/><br/>This was not the center of the heaven-planted demonic beasts. Wang Xian had already sensed that there were not many experts around!<br/><br/>Therefore, no one would discover them!<br/><br/>Wang Xian set the time for him to attack the heaven-planted demonic beasts to one month later. He was mainly worried that the six major races and the Holy Dragon lineage would start to converge and unify the Holy Dragon Tribe!<br/><br/>In order to prevent all their experts from gathering together, Wang Xian had to launch an attack as soon as possible!<br/><br/>He had to catch them off guard!<br/><br/>“An lie, get all the masters of the Dragon Palace with level three combat strength ready. We will start the battle in one month!”<br/><br/>Wang Xian instructed an lie!<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded and disappeared!<br/><br/>Wang Xian sat there and took a sip of the heaven-planted demonic beast territory’s specialty wine. He scanned his surroundings coldly!<br/><br/>If the heaven-planted demonic beast race didn’t participate in their war, he wouldn’t attack them for no reason!<br/><br/>“This time, I want to see who will attack who and who will be exterminated!”<br/><br/>He mumbled as he sat there and waited for the news!<br/><br/>…<br/><br/>“Send the news to the other kings and get them ready. In a month’s time, they will gather at the sacred dragon lineage and March together with the Sacred Dragon King to unify the Divine Dragon Clan!”<br/><br/>At this moment, in the center of Tianzhi Forest.<br/><br/>In the center of Tianzhi Forest, there was a huge waterfall!<br/><br/>Below the waterfall was a huge river!<br/><br/>The trees here were even taller and more vibrant!<br/><br/>Beside the waterfall, there was a tree that was hundreds of thousands of meters tall. In the middle of the tree, there were two eyes and a mouth!<br/><br/>He looked down at his subordinates and ordered indifferently!<br/><br/>“It’s the clan leader!”<br/><br/>Below him, a dozen or so meter tall treemen immediately replied!<br/><br/>The Sky Plant Demonic Beast clan was dominated by the clan leader, but it was also divided into twelve kings!<br/><br/>The twelve kings represented the branches of the twelve sky plant demonic beasts!<br/><br/>They were an allied force.<br/><br/>But unlike the Hundred Cities Alliance, their alliance was even closer. The clan leader of the Sky Plant Demonic Beast clan held the power of life and death!<br/><br/>The statement of the Sacred Dragon Clan had been released!<br/><br/>Then, the unification of the Holy Dragon clan was about to begin!<br/><br/>This time, they only needed to send the pinnacle races of each race!<br/><br/>Besides, there were seven races in total, and they didn’t need all the great beings of each race to go!<br/><br/>They had gathered 80 universe masters with level-three combat power, which was enough to quickly unify the Holy Dragon Clan!<br/><br/>“This Holy Dragon clan is really useless. The third prince has given them so much support, yet they still need our help. How Useless!”<br/><br/>As the leader of the Sky Plant Demonic Beast tribe spoke, his enormous true body slowly shrank to a few meters in size.<br/><br/>At the root, a seed slowly flew to his body!<br/><br/>“I don’t know when the seed of advancement will be fully nurtured!”<br/><br/>The leader of the Sky Plant Demonic Beast tribe looked at the seed in front of him and muttered, “I hope it will mature before the calamity arrives!”\t\t\t\t\t\t</div>", "images": {}, "success": true}