{"id": 570, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073041.html", "title": "Chapter 3561 - 3561 3560 Dragon Tomb Of The Divine Dragon Clan!", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3561 - 3561 3560 Dragon Tomb Of The Divine Dragon Clan!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3561 3560 Dragon Tomb of the Divine Dragon Clan!<br/><br/>The Sacred Dragon King naturally knew everything that was on the universe’s AI!<br/><br/>He also knew that the Dragon Palace had insulted the Sacred Dragon Clan!<br/><br/>He looked at it and could do nothing but burn with rage!<br/><br/>The strength that the Dragon Palace had displayed and the description of the Dragon King from his subordinates gave him a feeling!<br/><br/>It was basically impossible for him to kill the Dragon King!<br/><br/>Even the current sacred dragon bloodline would find it difficult to destroy the ancestral dragon bloodline!<br/><br/>Not to mention that the ancestral dragon bloodline would definitely ally with the Dragon Palace!<br/><br/>The current sacred dragon bloodline couldn’t avenge their son and their subordinates at all!<br/><br/>His expression changed drastically as he took out a ball of light.<br/><br/>He moved and the ball of light floated in the air above him as he slowly knelt down.<br/><br/>“Greetings, Master!”<br/><br/>He called out to the ball of light with unusual respect!<br/><br/>“Buzz!”<br/><br/>The ball of light trembled slightly, and an archangel with twelve wings slowly appeared!<br/><br/>This was an archangel that looked unusually young, and he had an extremely handsome face!<br/><br/>“Tianguang, what’s the matter?”<br/><br/>This archangel looked down at the Sacred Dragon King and asked faintly!<br/><br/>“Master, Our Holy Dragon lineage is in trouble!”<br/><br/>The Holy Dragon King knelt there and told him everything that had happened with unusual respect!<br/><br/>The Archangel’s expression did not change at all when he heard his words!<br/><br/>“Why did a Dragon Palace suddenly appear?”<br/><br/>The archangel frowned slightly when he heard his words and shook his head. “Forget it, this is also good news. Last Time, you killed the leader of the ancestral dragon. This prince has received good news. Come with me!”<br/><br/>As the Archangel spoke, the ball of light emitted a luster!<br/><br/>The luster enveloped the Holy Dragon King!<br/><br/>In the next moment, the Holy Dragon King appeared above an island!<br/><br/>“CHIRP CHIRP CHIRP!”<br/><br/>Chirping sounds came from the surroundings.<br/><br/>This was the cry of a Phoenix!<br/><br/>“This is?”<br/><br/>The Holy Dragon King looked around and was slightly shocked. He quickly knelt down and bowed respectfully to the archangel in front of him. “Master!”<br/><br/>The young and handsome archangel in front of him was the Master of the Sacred Dragon King.<br/><br/>His identity was one of the descendants of the Archangel King, the third Prince of the Angel clan!<br/><br/>He was an extremely terrifying existence!<br/><br/>His strength was definitely not something that baili archangel could compare to!<br/><br/>“Come with me!”<br/><br/>The third Prince said indifferently to the Sacred Dragon King and brought him to the center of an island in an instant!<br/><br/>This was an incomparably huge island, and around the island were sculptures of Divine Dragons!<br/><br/>The Holy Dragon King sized up the surroundings, his eyes filled with shock!<br/><br/>This was his first time here, but he knew what this place was!<br/><br/>The Dragon Island of the Divine Dragon Clan!<br/><br/>The Peak Divine Dragon Clan, many divine dragons were scattered in the oceans and lakes of the universe!<br/><br/>However, most of the divine dragons, as well as the weaker ones, lived here.<br/><br/>Dragon Island!<br/><br/>This was a part of the mountains and seas!<br/><br/>The Peak Divine Dragons also occupied a place in the mountains and seas!<br/><br/>The various space beasts in the mountains and seas didn’t dare to step into the territory of the Divine Dragons!<br/><br/>The Sacred Dragon King looked around, his eyes shining!<br/><br/>The Dragon Island had obviously been occupied!<br/><br/>And the one who occupied it wasn’t the Angel clan, but the Phoenix clan, who used to have a very good relationship with the Divine Dragon Clan!<br/><br/>As for whether they occupied it to wait for the Divine Dragon Clan to return to glory, or something else, he didn’t know!<br/><br/>This kind of peak race matter was not something that the Holy Dragon King could guess!<br/><br/>“Third prince, come in!”<br/><br/>A voice entered their minds, following which the Holy Dragon King felt the surrounding scene change.<br/><br/>A Majestic Dragon’s might rushed over!<br/><br/>Under this dragon’s might, the Holy Dragon King seemed to feel that his ancestors were watching him, directly kneeling on the ground!<br/><br/>In front of him were nine statues, and each statue represented a pure-blooded divine dragon of one attribute!<br/><br/>The nine attributes of the Divine Dragon interweaved together, forming a sealed Dragon Gate!<br/><br/>At this moment, beside the Dragon Gate stood a blue figure, and on the back of the figure were some wings!<br/><br/>Those were Phoenix Wings!<br/><br/>The Phoenix clan not only had fire phoenixes, but also water phoenixes!<br/><br/>“Green River, how confident are you in your guesses!”<br/><br/>The third Prince looked at the Azure figure and asked!<br/><br/>“This time, 50% . Raise him to the universe ruler realm and test it out!”<br/><br/>Green River Water Phoenix glanced at Sacred Dragon King and said indifferently!<br/><br/>Sacred Dragon King’s body trembled when he heard this!<br/><br/>“It’s extremely difficult to rely on external forces to break through to the universe ruler realm!”<br/><br/>The third prince frowned slightly.<br/><br/>“This is your problem, third prince. Your Angel Race has a way, everything can be done at the same time. First, let him unify the Divine Dragon Race. I know about the matter in the universe AI. The more pure-blooded divine dragons of the Divine Dragon race, the better!”<br/><br/>The Green River Water Phoenix said indifferently.<br/><br/>The third prince frowned slightly and looked at him. “If the verification is successful, it will be very troublesome to cultivate the other eight attributes of the universe’s ruler-level Divine Dragons!”<br/><br/>“There’s no other way. The resources of the universe are only this much. Our actions are worth it. If you want to obtain the heart of Light and darkness, you have to give it a try!”<br/><br/>The Azure River Water Phoenix turned to him and said indifferently!<br/><br/>The third prince was slightly silent!<br/><br/>The Angel clan was divided into two large clans. One was the angel of light, and the other was the fallen angel of Darkness!<br/><br/>The Angel clan had two great Angel Kings.<br/><br/>The two great Angel Kings were brothers, and the Angel clan also had their heavenly yuan destiny, the Heavenly Yuan destiny of the light attribute!<br/><br/>The darkness-element heavenly yuan destiny also existed now.<br/><br/>This also meant that, after exhausting all his opportunities and lives, he could at most reach the level of his father King!<br/><br/>But he knew that there was a dragon king in the Dragon Palace who had both the light and darkness elements!<br/><br/>If he had both elements, he would have the chance to stand at a higher level than his father King!<br/><br/>And that Dragon King’s Supreme Treasure, the heart of Light and darkness, might be here!<br/><br/>The Dragon Tomb of the Divine Dragon Clan.<br/><br/>A place where even the Divine Dragon Clan would perish and the heavenly yuan fortunes wouldn’t be able to open it!<br/><br/>How could such a place not have treasures?<br/><br/>Hence, they tried everything they could to open it!<br/><br/>Now, the Green River Water Phoenix had obtained some guesses from the dragon blood of the leader of the Ancestral Dragon Clan!<br/><br/>And the possibility of this was very high!<br/><br/>That was to use the nine attributes, the universe ruler realm, and the purebred dragon blood as a guide to open this Dragon Gate!<br/><br/>To obtain the treasures of the Dragon Palace!<br/><br/>With the destruction of the Dragon Clan, the only unsolvable mystery was that all the treasures of the Dragon Clan had disappeared!<br/><br/>It was very likely to be here!<br/><br/>If it could be opened, the treasures inside might cause the peak races to boil!<br/><br/>After all, the Divine Dragon lineage originally had the Tian Yuan fortune!\t\t\t\t\t\t</div>", "images": {}, "success": true}