{"id": 576, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073053.html", "title": "Chapter 3567 - 3567 3566 Heaven-Destroying Demonic Beast Clan", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3567 - 3567 3566 Heaven-Destroying Demonic Beast Clan</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3567 3566 heaven-destroying demonic beast clan<br/><br/>“The innate supreme treasure in the son of Saint Dragon’s hand doesn’t really belong to him. The son of Saint Dragon is much weaker than you, clan leader!”<br/><br/>An expert from the heaven-destroying demonic Beast Clan said indifferently!<br/><br/>“The son of Saint Dragon isn’t as strong as me, but the Dragon King of Dragon Palace should be much stronger than me.”<br/><br/>The leader of the Sky Plant Demonic Beast Clan said. He agreed with the strength of the Dragon King of the Dragon Palace!<br/><br/>“Hehe, the ancestral dragon bloodline is just a pile of loose sand now. After killing the Dragon King of the Dragon Palace, the Divine Dragon clan will probably be unified. It will be too easy for the six great clans to join forces!”<br/><br/>“I’m interested in the corpse of a purebred divine dragon. This time, I’ll go and see if I can collect the corpse of a purebred divine dragon, Hehe!”<br/><br/>The Pinnacle Great Beings of the Sky Plant Demon Beast race started to talk. It wasn’t that important to help the Holy Dragon race unify the Holy Dragon Race!<br/><br/>The main thing was that they were too powerful!<br/><br/>This time, they had 70 to 80 universe master level three Great Beings, and it was easy for them?<br/><br/>Sou! Sou! Sou<br/><br/>While they were talking, the Pinnacle Great Beings of the Sky Plant Demon Beast Race arrived!<br/><br/>In less than half an hour, 14 top-notch experts had arrived!<br/><br/>Including the leader of the sky-planting demonic beast clan, there were a total of 15 experts!<br/><br/>Buzz<br/><br/>The moment all 15 of them arrived, a piece of news had already reached Wang Xian’s side!<br/><br/>Wang Xian and the rest gathered their thoughts and walked out from the giant tree!<br/><br/>The giant tree was very close to the 15 experts of the sky-planting demonic beast clan who were beside the waterfall!<br/><br/>It was only a distance of 10 million kilometers!<br/><br/>This distance was only an instant for experts of their level!<br/><br/>Wang Xian’s eyes were sparkling as he looked at the giant tree. He locked onto the leader of the Sky Plant Demonic Beast tribe in the middle and revealed a cold smile.<br/><br/>You Want to help the Holy Dragon tribe unify the Divine Dragon Tribe?<br/><br/>Since all of you are courting death, I will exterminate all of you today!<br/><br/>Whoosh<br/><br/>The uninitiated holy wings appeared on his back. The eyes of the experts from the Dragon Palace behind him focused!<br/><br/>Buzz! Buzz<br/><br/>At this moment, a message came from Mo Sha!<br/><br/>The teleportation formation had been completely destroyed!<br/><br/>“Attack!”<br/><br/>Wang Xian growled in a low voice. He flapped the uninitiated holy wings and his figure instantly moved!<br/><br/>His target was the chief of the Sky Plant Demonic Beast tribe!<br/><br/>At the same time, the king of water touch, Ling Ling, and the avatar of the Netherworld Ghost appeared beside him!<br/><br/>His speed instantly reached its peak!<br/><br/>Behind him, the experts of the Dragon Palace also exploded!<br/><br/>Only the sky array started to set up a formation to prevent them from escaping!<br/><br/>“Alright, everyone is here. Let’s Go…”<br/><br/>The Sky Plant Demonic Beast tribe leader said when he saw that everyone was here!<br/><br/>However, before he could finish speaking, he felt a great fear enveloping him!<br/><br/>He only felt a chill in his heart as he felt death descending!<br/><br/>“Not good!”<br/><br/>He looked forward hurriedly with a fearful expression!<br/><br/>His entire body was emitting green light and the power of light!<br/><br/>A fresh flower appeared above his head!<br/><br/>“Pu!”<br/><br/>However, in the next moment, Wang Xian’s dragon claw pierced through it instantly!<br/><br/>The destructive power filled his entire body and his life force was instantly extinguished!<br/><br/>“Bang!”<br/><br/>However, when Wang Xian felt that he had killed the leader of the Sky Plant Demonic Beast in an instant, he frowned slightly!<br/><br/>It was supposed to be a corpse, but it turned out to be a piece of wood!<br/><br/>He actually escaped a calamity!<br/><br/>“There’s a treasure that can save his life!”<br/><br/>He frowned slightly but didn’t stop his actions. Instead, he instantly attacked an expert at the peak of the Sky Plant Demonic Beast!<br/><br/>His speed was still terrifying!<br/><br/>It was obvious that the experts at the peak of the sky plant demonic beast had yet to react!<br/><br/>“Boom!”<br/><br/>The expert at the peak of the Sky Plant Demonic Beast who was attacked by Wang Xian felt threatened. His expression changed drastically. Numerous thorns formed a defense!<br/><br/>“Crash!”<br/><br/>However, Wang Xian wasn’t the only one who attacked this time. The Water Touch King, who was lying on his shoulder, also attacked instantly.<br/><br/>Wang Xian’s five elements millstone also attacked him!<br/><br/>“No, no, no, no!”<br/><br/>The Sky Plant Demonic Beast, who was at the peak of his race, felt this terrifying attack and roared in fear!<br/><br/>“Boom! Boom!”<br/><br/>However, he couldn’t Dodge at all. All kinds of attacks landed on his body!<br/><br/>However, what surprised Wang Xian was that when the destructive energy landed on his body, his vitality quickly disappeared.<br/><br/>After the attack, there was a species left at the position of his body!<br/><br/>This seed hurriedly fled to the side!<br/><br/>“There are so many life-saving methods!”<br/><br/>Perhaps it was his bad luck, or perhaps it was because the experts of the sky-planting demonic beast clan had too many life-saving methods!<br/><br/>Both the leader of the sky-planting demonic beast clan and this expert had dodged his fatal blow!<br/><br/>“Kill him!”<br/><br/>“How dare he attack our sky-plant demonic beasts! Kill him!”<br/><br/>At this moment, all the experts of the sky-plant Demonic Beasts also reacted and roared ferociously!<br/><br/>“Huala!”<br/><br/>“Who is it? How dare he intrude into our sky-plant demonic beasts? He is courting death!”<br/><br/>At the waterfall, a towering giant tree slowly emerged from within. His huge face and pupils stared at Wang Xian as he roared furiously!<br/><br/>He was the leader of the sky-planting demonic beasts who had used a life-saving item to escape!<br/><br/>At this moment, he was staring at Wang Xian’s figure with fear and anger as he roared ferociously!<br/><br/>If he didn’t possess a powerful treasure, he would have been killed!<br/><br/>Who was the other party?<br/><br/>He actually dared to invade the inner circle of the sky-planting demonic beasts!<br/><br/>Who Dared to seek death?<br/><br/>They were a subsidiary clan of the Angel Clan!<br/><br/>“HMPH, leader of the Sky Plant Demonic Beast clan, I didn’t expect you to have a life-saving method. Didn’t you guys want to help the Holy Dragon Clan? Today, My Dragon Palace will destroy you all!”<br/><br/>When Wang Xian saw the leader of the Sky Plant Demonic Beast clan appear again, his eyes revealed a cold killing intent!<br/><br/>Crash<br/><br/>As he spoke, he flapped his incipient saint wings and continued to attack the leader of the Sky Plant Demonic Beast clan!<br/><br/>He wanted to see how many life-saving treasures the other party had!<br/><br/>“Dragon Palace? Why Is it your Dragon Palace? Damn it, kill them!”<br/><br/>When the leader of the Sky Plant Demonic Beast tribe heard Wang Xian’s words, he revealed an incredulous expression!<br/><br/>When he saw the other party attacking him at a terrifying speed, he roared furiously!<br/><br/>“Today, our Dragon Palace will completely exterminate your Sky Plant Demonic Beast Tribe!”<br/><br/>However, as soon as he finished speaking, the experts of the dragon palace shouted with killing intent!<br/><br/>The experts of the Dragon Palace charged over!<br/><br/>“What? !”<br/><br/>“How come so many experts suddenly charged over?”<br/><br/>“Hiss, where’s the defense of our Sky Plant Demonic Beast Clan? How did they get in?”<br/><br/>The expressions of the experts of the Sky Plant Demonic Beast clan changed drastically when they saw this scene!<br/><br/>How did these experts of the Dragon Palace suddenly charge over?<br/><br/>They actually didn’t sense it!\t\t\t\t\t\t</div>", "images": {}, "success": true}