{"id": 571, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073043.html", "title": "Chapter 3562 - 3562 3561 Six Great Races", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3562 - 3562 3561 Six Great Races</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3562 3561 six great races<br/><br/>The Sacred Dragon King lay in front of the Dragon Gate, listening to the conversation between the third prince and the Water Phoenix. He lowered his head, not daring to speak!<br/><br/>At the same time, his eyes were filled with excitement!<br/><br/>From the conversation between the third Prince and the others, the Sacred Dragon King received a piece of news!<br/><br/>That was, they wanted to raise themselves to the universe ruler realm!<br/><br/>This was the universe ruler realm!<br/><br/>Universe rulers usually represented a pinnacle race.<br/><br/>His current strength, he thought he was already very strong, no one at the same level could match him!<br/><br/>He even had half a foot into the universe ruler realm, but he still didn’t have much confidence in whether he could break through to the universe ruler realm!<br/><br/>At this level, talents, bloodlines, and inheritances were of little help to him!<br/><br/>Many great beings were stuck at this level!<br/><br/>Especially the Great Beings from the pinnacle races!<br/><br/>The Great Beings from the pinnacle races relied on their bloodlines, physiques, and inheritances. With enough resources, it was not difficult for them to reach the Pinnacle Universe Knight Realm!<br/><br/>And the pinnacle of the Universe Knight realm was the Combat Power of a universe ruler at level three!<br/><br/>However, every top-tier race had many such great beings, and not even one in ten could make this leap!<br/><br/>Now, they were going to make him break through to the universe ruler realm?<br/><br/>Break through with a special method?<br/><br/>This made him extremely excited!<br/><br/>Only by truly stepping into the universe ruler realm could one be considered a top-tier great being in the universe.<br/><br/>“Alright, I’ll give it a try.”<br/><br/>The third prince looked at the Green River Water Phoenix and nodded.<br/><br/>To raise a pure-blooded divine dragon with the combat strength of a universe ruler to the universe ruler realm!<br/><br/>This was indeed very troublesome!<br/><br/>However, with his status as the third prince, he could still obtain some treasures that could help him raise his strength.<br/><br/>However, this was only helping him raise his strength.<br/><br/>For a breakthrough of this level, unless a great being at the heavenly creation level helped him to make a breakthrough, even the Angel King didn’t have 100% confidence that he could make a breakthrough.<br/><br/>Fortunately, the Holy Dragon King’s talent and current realm were very, very strong.<br/><br/>It was comparable to the Pinnacle Universe Knights of the Angel Race!<br/><br/>The possibility of a breakthrough was still very high!<br/><br/>“I’ll leave this matter to you, third prince.”<br/><br/>The Green River Water Phoenix said as she slowly disappeared!<br/><br/>The third Prince looked at Life Dragon Emperor beside him and waved his arm. A light enveloped them and they disappeared too!<br/><br/>When they reappeared, they were already in a palace of light!<br/><br/>Holy Dragon Emperor was still kneeling there respectfully!<br/><br/>“Later, I will find some treasures to help you break through. In addition, I will inform a few races to help you unify the Divine Dragon Clan!”<br/><br/>The third Prince looked at the Sacred Dragon King and said indifferently!<br/><br/>“Thank you master, Thank You Master!”<br/><br/>The Sacred Dragon King quickly bowed with excitement!<br/><br/>“Mm, the experts from the Dragon Palace and the ancestral dragon bloodline better subdue them. Don’t kill them if you can!”<br/><br/>The Sacred Dragon King continued!<br/><br/>“Yes, Master!”<br/><br/>The Sacred Dragon King replied respectfully!<br/><br/>The third prince waved at him, “Go back to your ancestral dragon lineage and wait for the News!”<br/><br/>The Sacred Dragon King stood up respectfully and flew out excitedly!<br/><br/>If he broke through, he would be the king of the Divine Dragon Race!<br/><br/>He would be the pinnacle of the universe!<br/><br/>This made him extremely excited!<br/><br/>“I hope you won’t disappoint me. Otherwise, this dog will be wasted!”<br/><br/>The third prince looked at the leaving figure of the Sacred Dragon King and muttered!<br/><br/>In reality, the third Prince and the Angel clan didn’t put the Sacred Dragon Clan in their eyes at all.<br/><br/>Even if it was put nicely, the Sacred Dragon King of the Sacred Dragon Clan was still the third Prince’s Mount!<br/><br/>What was a mount? It was just a slave!<br/><br/>It was just a dog!<br/><br/>If it wasn’t for the treasures of the Divine Dragon Clan, the third Prince wouldn’t have spent so many resources to raise a holy dragon lineage!<br/><br/>However, if he could open up the treasures of the Divine Dragon Clan, all the expenses would be worth it!<br/><br/>Time passed day by day.<br/><br/>In the Dragon Palace, a few months later, Wang Xian touched his eyes with a smile on his face.<br/><br/>The pair of dragon eyes had been integrated into his dragon eyes!<br/><br/>With the pair of dragon eyes, Wang Xian’s strength had improved significantly!<br/><br/>“Next, I’ll go and kill the Holy Dragon Lineage!”<br/><br/>Wang Xian muttered. He was prepared to use the dragon-seeking ruler to hunt down the strong disciples of the Holy Dragon lineage!<br/><br/>As for the Dragon Palace, he had nothing to worry about!<br/><br/>Now, the ancestral dragon lineage had begun their migration.<br/><br/>Their destination for this migration was not far from the Milky Way.<br/><br/>That was the edge of the ocean in the land of mountains and seas!<br/><br/>After the migration of the ancestral dragon lineage’s experts, the Dragon Palace would open up a teleportation formation with them so that they could provide support at any time!<br/><br/>On the Dragon Palace’s side, the number of experts who had killed the experts of the Holy Dragon lineage had reached 21!<br/><br/>Even if Wang Xian left with the king of water touch and the 13 experts from the ancestral dragon lineage, they would be able to withstand the attacks of the Holy Dragon lineage.<br/><br/>Even if the Holy Dragon lineage had helpers!<br/><br/>“Set off in a month!”<br/><br/>Wang Xian mumbled!<br/><br/>…<br/><br/>“Holy Dragon King!”<br/><br/>More than ten days passed. At the same time, six figures flew over from the Holy Dragon lineage of the Divine Mountain of light!<br/><br/>The six figures represented the chiefs of the six powerful races!<br/><br/>The treemen that looked like trees represented the Sky Plant Demonic Beast Branch!<br/><br/>The creatures that had bright wings and looked like insects were the light sound insects!<br/><br/>An extremely old man with a staff in his hand was from the god Shepherd clan!<br/><br/>A ball of black fog with a life aura represented the Black Fog Spirit clan!<br/><br/>A Ghoul race with the body of a human and a mouth that took up more than half of its body!<br/><br/>A light giant made of bright stones represented the light giant race!<br/><br/>The six great races were all affiliated races of the Angel Race!<br/><br/>Especially the god Shepherd race and the light giant race. Their strength was abnormally terrifying!<br/><br/>These were all affiliated races that had followed the angel race since the beginning of this era!<br/><br/>Each of them was stronger than the Holy Dragon Bloodline!<br/><br/>Moreover, although they were a high-level race and did not have the bloodline of a peak race, their race had many mutated bloodlines and physiques!<br/><br/>In terms of strength, they were still comparable to peak races!<br/><br/>“Clan leaders, I’ll have to trouble all of you!”<br/><br/>When the Holy Dragon King saw them, excitement appeared in his eyes and he immediately cupped his hands respectfully!<br/><br/>He was still very respectful towards the clan leaders of these six races!<br/><br/>Their strength was not weaker than the sacred dragon lineage!<br/><br/>Each race possessed a clan-guarding innate supreme treasure!<br/><br/>If they were willing to help, unifying the divine dragon lineage would be a piece of cake!<br/><br/>“We are following the orders of the third prince, and we will follow your orders, Sacred Dragon King, to unify the divine dragon lineage. With our strength, we can easily help you complete the unification!”<br/><br/>In the middle, a two-meter-tall white-haired elder holding a three-meter-tall staff said calmly!\t\t\t\t\t\t</div>", "images": {}, "success": true}