{"id": 575, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073051.html", "title": "Chapter 3566 - 3566 The 3565 War Broke Out!", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3566 - 3566 The 3565 War Broke Out!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3566 The 3565 war broke out!<br/><br/>One month was very short!<br/><br/>However, within this one month, with the abilities of the poisonous horned dragon seed and the others, it was very easy for them to latch onto the bodies of level one and level two universe masters!<br/><br/>However, latching onto the bodies of level three universe masters would require a great deal of luck!<br/><br/>Unfortunately, the two of them didn’t have that kind of luck!<br/><br/>It would take too little time to parasitize a level 3 universe ruler!<br/><br/>If they were given a few years, they would be confident!<br/><br/>But even so, within a short month, they parasitized a level 2 universe ruler.<br/><br/>The two masters that the eight-limbed demon Fiend had latched onto were one of the descendants of the leader of the sky-plant Demonic Beast!<br/><br/>The other one was the great elder of the sky-plant Demonic Beast tribe who was in charge of managing everything!<br/><br/>The Sky-plant demonic beast was divided into 12 branches, and the 12 branches were under the control of the great elder!<br/><br/>Wang Xian was staying in a tavern on the outskirts of the sky-plant demonic beast. Over the past month, information had been passed to him one by one!<br/><br/>He had sent all these information to the sky array and the rest!<br/><br/>On the 27th day, he had basically obtained all the information he could from the eight-limbed demon fiend!<br/><br/>Looking at the information that they had sent over, his eyes flickered slightly!<br/><br/>According to the information that they had received, four days later, the leader of the Sky Plant Demon Beast would personally lead 12 branches and 15 universe masters with Level-3 combat strength to the Holy Dragon lineage!<br/><br/>In addition, they would have two level 3 universe masters in charge of the tribe!<br/><br/>There were also a few level 3 universe masters who were in closed-door cultivation. Unless there was an emergency, they would not be able to contact them!<br/><br/>“Four days later, it seems like it’s the right time. 15 level 3 universe masters gathered together?”<br/><br/>Wang Xian’s eyes sparkled as he read the news!<br/><br/>There were currently 20 level-three Combat Strength Masters among all the Universe Masters in the Dragon Palace.<br/><br/>There were 15 of them gathered together in a short period of time!<br/><br/>However, at the moment, he, the water touch king, and sky array were sufficient to deal with all the level-three combat strength masters of the Universe Masters of the Sky Plant Demonic Beast!<br/><br/>Fifteen universe masters with level three combat strength could be killed quickly!<br/><br/>“Let’s go. This time, we will completely destroy the sky plant demonic beasts!”<br/><br/>After obtaining so much information, Wang Xian’s eyes flashed with a cold glint!<br/><br/>This time, the possibility of exterminating the entire sky plant demonic beast race was very high!<br/><br/>He sat in the restaurant and waited quietly!<br/><br/>Three days later, an Lie’s figure appeared in front of Wang Xian.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian nodded at him and their figures disappeared instantly!<br/><br/>When Wang Xian reappeared, he had already arrived at the core of the heaven-planted demonic beast race!<br/><br/>He was in the interior of a huge tree!<br/><br/>“Dragon King!”<br/><br/>Beside him, a treeman bowed respectfully to Wang Xian!<br/><br/>“Yes!”<br/><br/>Wang Xian nodded. “How’s the situation with the Demonic Beasts?”<br/><br/>“Dragon King, there’s no problem with the demonic beasts. Once we take action tomorrow, the demonic beasts will destroy all the teleportation formations immediately. They won’t have any support for the time being!”<br/><br/>Ba Qi, who was residing in the body of the great elder of the heaven-planted demonic beasts, reported respectfully!<br/><br/>“Alright, an lie, go and bring the heaven-planted demonic beasts over. Ba Qi, are you safe here?”<br/><br/>Wang Xian nodded his head and continued speaking to an lie Ba Qi!<br/><br/>“Don’t worry, Dragon King. There won’t be any problems. Although this place is very close to the waterfall where the heaven-planted demonic beasts will gather tomorrow, it is 100% safe. No one will doubt it!”<br/><br/>Ba Qi said confidently!<br/><br/>Wang Xian nodded his head!<br/><br/>At this moment, the heaven-planted demonic beasts didn’t expect that they had already arrived at their old dynasty!<br/><br/>They also didn’t expect that their powerhouses had already been parasitized by the powerhouses of the Dragon Palace!<br/><br/>It had only been more than a month since the statement of the Holy Dragon lineage was released. From their point of view, even if the Dragon Palace was really audacious and wanted to take revenge on the six great races, it would take them more than a year to rush over!<br/><br/>They would never have thought that Wang Xian had already arrived here a month ago!<br/><br/>It was also a coincidence that Wang Xian was able to make a move against the sky plant demonic beasts!<br/><br/>If he didn’t want to hunt down the experts and disciples of the Holy Dragon lineage, he wouldn’t have had the time to do so!<br/><br/>He wouldn’t have this opportunity!<br/><br/>An Lie’s figure disappeared. More than ten seconds later, the figures of Tian Chen, Ao Qitian, Ao Yao, and the rest appeared in front of Wang Xian!<br/><br/>“Greetings, Dragon King!”<br/><br/>When they saw Wang Xian, they immediately bowed respectfully!<br/><br/>“Okay, everyone, restrain your aura. Don’t be discovered. In ten hours, it will be time for us to make our move. Ba Qi, take out the map here!”<br/><br/>Wang Xian said to them!<br/><br/>“Yes!”<br/><br/>Ba Qi nodded. With a wave of his arm, the map of this area appeared in front of everyone.<br/><br/>Ba Qi explained to them one by one!<br/><br/>“We’ll Take Action Tomorrow. You set up the trap formation first. Each of you will take on one. I’ll hunt them down one by one!”<br/><br/>After Ba Qi finished his explanation, Wang Xian spoke to them!<br/><br/>The experts from the Dragon Palace nodded their heads. Their eyes were filled with killing intent.<br/><br/>“We’ll wait patiently. The chances of US killing them are still very high!”<br/><br/>Wang Xian smiled!<br/><br/>…<br/><br/>After more than ten hours, Ba Qi walked out and monitored all the news outside in the blink of an eye!<br/><br/>At the side of the waterfall, the leader of the sky-planting demonic beast tribe had turned into a towering giant tree and was rooted there!<br/><br/>After more than ten hours, figures flew over one by one!<br/><br/>They were all exuding a powerful aura!<br/><br/>The powerhouses of the sky-planting demonic beast tribe belonged to the plant-type demonic beast tribe. Every single one of them looked different from the ordinary powerhouses of the sky-planting demonic beast tribe!<br/><br/>They all belonged to the mutated Sky Plant Demonic Beast clan!<br/><br/>Because of the mutation, they possessed talents and bloodlines that were no weaker than the peak races!<br/><br/>However, such a mutation was something that could only be encountered by chance!<br/><br/>In the entire Sky Plant Demonic Beast clan and the entire sky plant forest, there were only over twenty mutated demonic beasts!<br/><br/>One had to know that the number of demonic beasts in the entire sky plant forest was extremely terrifying!<br/><br/>One by one, experts from the Sky Plant Demonic Beast Branch flew over and landed beside the Sky Plant Demonic Beast tribe leader!<br/><br/>“Tribe Leader!”<br/><br/>They bowed respectfully.<br/><br/>“Mm, we’ll set off immediately after everyone arrives!”<br/><br/>The Sky Plant Demonic Beast tribe leader’s body slowly shrunk as he spoke indifferently!<br/><br/>“Haha Tribe Leader, unifying the Divine Dragon tribe, our six great clans don’t need to send so many experts. Just one tribe with ten people is Enough!”<br/><br/>A treeman with a white branch said indifferently. His words didn’t show any respect to the Divine Dragon Clan!<br/><br/>“Just in case, the Dragon Palace doesn’t seem weak. The Dragon King of the Dragon Palace can easily kill the son of the Divine Dragon who has two innate treasures!”<br/><br/>The Sky Plant Monster Beast Clan Leader said indifferently!\t\t\t\t\t\t</div>", "images": {}, "success": true}