{"id": 578, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073057.html", "title": "Chapter 3569 - 3569 3568 Heaven-Planting Demonic Beasts", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3569 - 3569 3568 Heaven-Planting Demonic Beasts</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3569 3568 heaven-planting demonic beasts<br/><br/>“Hiss!”<br/><br/>The leader of the heaven-planting demonic beasts was killed, and another peak-level powerhouse was killed. The remaining 12 masters of the universe with Level-3 combat strength inhaled a mouthful of cold air!<br/><br/>Their faces were filled with astonishment!<br/><br/>“Fight for your lives, Run!”<br/><br/>The 12 peak-level powerhouses of the heaven-planting demonic beasts emitted a terrifying aura and fled to the distance rapidly!<br/><br/>“Hehe, none of you will be able to escape today!”<br/><br/>Wang Xian’s eyes revealed a cold expression as he flapped his incorporeal holy wings. His gaze locked onto a peak-stage sky-plant demonic beast and attacked it instantly!<br/><br/>“No!”<br/><br/>The peak-stage sky-plant demonic beast sensed that Wang Xian was charging at him. His face was filled with despair as he roared!<br/><br/>However, all his roars were useless. Wang Xian instantly rushed in front of him, grabbed his body with his dragon claws, and instantly killed him!<br/><br/>With the five elements grinding and the Tai Chi Dragon Disc, Wang Xian didn’t even need to use the power of the ghost avatar and the spirit spirit to easily kill opponents of the same level!<br/><br/>Especially these opponents who didn’t have any innate supreme treasures!<br/><br/>In an instant, one of the 15 universe masters with level 3 combat strength of the Sky Plant Demon Beast clan was severely injured and escaped with a treasure!<br/><br/>Three of them were killed!<br/><br/>One of them was their clan leader!<br/><br/>The other 11 peak experts of the Sky Plant Demon Beast clan were filled with despair when they saw this scene!<br/><br/>Their surroundings were sealed off by the powerful Wizards of the Dragon Palace. They couldn’t return to their divine kingdoms in an instant!<br/><br/>Under the siege of the powerhouses of the Dragon Palace, they had no ability to escape!<br/><br/>This was especially so for the Dragon King of the Dragon Palace.<br/><br/>His strength was simply too terrifying!<br/><br/>An instant kill of the same level!<br/><br/>Who could withstand this?<br/><br/>However, at this moment, they could not just stand there and wait for death. They could only defend with all their might!<br/><br/>“Next!”<br/><br/>After Wang Xian killed another one, he immediately attacked the next one!<br/><br/>Initially, the number of experts in the Dragon Palace was already more than that of the sky plant demonic beasts. Now that they had been killed consecutively, it had become a situation where two of them were attacking one at a time!<br/><br/>“No!”<br/><br/>“Save me!”<br/><br/>Another expert at the peak of the sky plant demonic beasts was locked onto by Wang Xian. That expert roared with a face full of despair!<br/><br/>There was no way to hide or escape!<br/><br/>There was only death. This was something that made them extremely desperate!<br/><br/>“PFFT!”<br/><br/>Wang Xian’s Dragon Claw passed through once again and another one was killed!<br/><br/>However, after killing a few more, Wang Xian realized that he could sense a weak energy under the waterfall.<br/><br/>That was also the energy left behind by the enemy in the Void!<br/><br/>This energy was very weak.<br/><br/>This made him have some guesses in his heart!<br/><br/>“Boom Boom Boom!”<br/><br/>Just when Wang Xian was about to attack the next heaven-planted demonic beast who was at the peak of his race, a rumbling sound was heard from the surroundings!<br/><br/>This rumbling sound was the warning voice of the Sky Plant Demonic Beast Race!<br/><br/>The commotion here had attracted the attention of the entire Sky Plant Demonic Beast Race!<br/><br/>“Someone has invaded our race, kill them!”<br/><br/>“There’s actually an enemy who has invaded the center of our race. Kill, Kill, Kill!”<br/><br/>“Disciples of the Sky Plant Demonic Beast Army, get ready!”<br/><br/>Roars could be heard from the outside!<br/><br/>At the same time, two gigantic trees soared into the sky from two different locations!<br/><br/>They were experts with the combat strength of a level three master of the universe!<br/><br/>They were also experts from the Sky Plant Demonic Beast clan who had stayed behind to guard the clan this time around!<br/><br/>They looked over and sensed the terrifying aura here. Their expressions changed slightly.<br/><br/>“Clan leader!”<br/><br/>They let out an angry roar and rushed over directly!<br/><br/>“I’ll leave this to you!”<br/><br/>Wang Xian’s eyes sparkled when he saw the two peak-level experts of the Sky Plant Demonic Beast!<br/><br/>He let out a low roar and flapped his incorporeal holy wings. Instantly, he flew towards the level 3 master of the universe on his right!<br/><br/>The other party was flying towards him. Behind him, a group of master-level and above experts of the Sky Plant Demonic Beast were also following behind him!<br/><br/>Their auras were extremely terrifying!<br/><br/>They were filled with endless killing intent!<br/><br/>An enemy had actually barged into their nest!<br/><br/>They were courting death!<br/><br/>Sou<br/><br/>However, at this moment, a group of great beings from the Sky Plant Demon Beast race sensed a terrifying attack coming toward them!<br/><br/>The great being with power at level three of a universe ruler at the front narrowed his eyes, and his face was filled with vigilance!<br/><br/>“Your speed is still too slow!”<br/><br/>All of a sudden, a voice rang in his ears. The Level 3 universe Dominator’s pupils contracted when he heard it!<br/><br/>“PFFT!”<br/><br/>But soon after, death came!<br/><br/>He didn’t even have time to react. He didn’t even look at Wang Xian!<br/><br/>He was killed instantly!<br/><br/>“Buzz!”<br/><br/>After killing, Wang Xian waved his arm, and the Five Elements Millstone shot toward the universe Dominators and above!<br/><br/>“Oh no!”<br/><br/>“What is this?”<br/><br/>“Our clan elder has been killed! He’s been killed!”<br/><br/>A terrified voice was heard. They stopped in their tracks and shouted in fear!<br/><br/>However, soon, screams were heard. Some of them didn’t even let out a scream!<br/><br/>“Break the formation around us. Quick, Quick!”<br/><br/>At this moment, on the battlefield beside the waterfall, a group of Sky Plant Demonic Beast clan’s peak experts saw their clansmen coming to their aid. They immediately roared loudly!<br/><br/>On the left side, another universe master level three great being who had come to their aid heard this and looked over. His expression changed drastically!<br/><br/>“Hold On!”<br/><br/>He roared and prepared to attack the array!<br/><br/>However, all of a sudden, his body tensed up and he hurriedly looked ahead!<br/><br/>When he saw another universe master level three great being who had come to their aid was instantly killed, he was instantly stunned!<br/><br/>He was killed in an instant!<br/><br/>A great being of the same level as him was killed in an instant!<br/><br/>He quickly glanced at the center of the battlefield!<br/><br/>When he saw the corpses one by one, his body trembled violently!<br/><br/>“Quick, break the array!”<br/><br/>In the center of the battlefield, an extremely anxious voice was heard!<br/><br/>I’ll break his Motherf * cker!<br/><br/>When the universe ruler level-three great being saw this scene, his eyes were wide open, and his heart was trembling violently!<br/><br/>Without any hesitation, he turned around and tried to escape!<br/><br/>The invading enemy was too terrifying. The Universe Master with level-three combat power who had come to support him was instantly killed!<br/><br/>If he went over, he would simply be courting death!<br/><br/>“Today, my Dragon Palace wants to Exterminate Your Sky Plant Demon Beast Race. None of you will be able to escape!”<br/><br/>Right at this moment, a voice entered his ears, causing his expression to change greatly!<br/><br/>“Hualala!”<br/><br/>His incomparably huge body flapped, and countless branches transformed into a terrifying attack, attacking towards the back without any difference!<br/><br/>However, he could sense in horror that a terrifying figure was revolving around him with a strange divine dragon treasure!<br/><br/>All of his attacks were blocked!<br/><br/>At the same time, he could sense a strange energy that was rebounding into his body!<br/><br/>What enemy is this?\t\t\t\t\t\t</div>", "images": {}, "success": true}