{"id": 587, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073075.html", "title": "Chapter 3578 - 3578 3577, In The Midst Of An All-Out War", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3578 - 3578 3577, In The Midst Of An All-Out War</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3578 3577, in the midst of an all-out war<br/><br/>Baili Archangel, the Holy Dragon, and the rest had left. So had the sound of life arrow!<br/><br/>Wang Xian returned to the Dragon Palace and sat on the Dragon Throne!<br/><br/>Prime Minister Gui and the rest of the experts had all arrived!<br/><br/>“Eight-limbed demonic fiend, get an lie to bring you to the ghouls, the god herders, the Giants of light, the lightsong insects, and the black fog spiritual race. Lock onto a race and infiltrate them to find out their situation.”<br/><br/>Wang Xian instructed the eight-limbed demon sha directly!<br/><br/>“It’s the Dragon King!”<br/><br/>The eight-limbed demon sha and the rest nodded their heads and replied immediately!<br/><br/>“The rest of the disciples of the Dragon Palace, get ready. There will be a huge battle soon!”<br/><br/>As Wang Xian spoke, a cold glint flashed in his eyes!<br/><br/>This time, the six races of the Holy Dragon lineage would return. After all, they would send out all their forces to attack the Dragon Palace!<br/><br/>Although he had destroyed the Sky Plant Demon Beast clan, they still had the Holy Dragon Clan, the Ghoul clan, the god Herder clan, the light giant clan, the light sound bug clan, and the Black Fog Spirit clan.<br/><br/>Currently, the Holy Dragon Clan had the least number of universe masters with level three Combat Power. However, with the other five races added together, gathering 100 universe masters with level three Combat Power shouldn’t be too much of a problem!<br/><br/>With 100 masters, it would be difficult for the Dragon Palace to deal with this force!<br/><br/>In addition to the resources and trump cards of their races, it would be difficult for the Dragon Palace to deal with them!<br/><br/>However, Wang Xian was not prepared to wait for the other party to attack first!<br/><br/>With an lie around, he could launch a sneak attack on the other party’s lair as long as all the Masters dared to come out in full force!<br/><br/>Then, Wang Xian would dare to destroy all the disciples and clansmen in their lair!<br/><br/>“It’s the Dragon King!”<br/><br/>The group of powerhouses from the Dragon Palace replied. Their eyes were filled with killing intent!<br/><br/>“An lie, bring us there!”<br/><br/>Wang Xian looked at an lie below and said directly!<br/><br/>He would let an lie bring them there first. He wanted to look for some opportunities first.<br/><br/>…<br/><br/>Buzz Buzz Buzz<br/><br/>At the same time, in the Palace of the Holy Dragon lineage!<br/><br/>The powerhouses from the ghouls, the god herders, the light giants, the hissing light bugs, and the black fog spiritual race from the five major races had left the Dragon Palace. They immediately regrouped in the Palace of the Holy Dragon lineage!<br/><br/>“We of the God shepherds have issued a notice that all the universe ruler-level great beings are ready.”<br/><br/>The patriarch of the god Shepherds said with a cold face!<br/><br/>“With all our power, we can still completely destroy that Dragon Palace!”<br/><br/>The old man of the Light Giants also said coldly!<br/><br/>The other three patriarchs nodded slightly and looked at the Holy Dragon Emperor!<br/><br/>“The third prince has sent me a message to kill everyone in the Dragon Palace except for the Purebred Divine Dragon!”<br/><br/>The Holy Dragon King looked at them and said, “Gather all our forces immediately and make a move!”<br/><br/>“Okay!”<br/><br/>“Okay!”<br/><br/>The clan leaders of the five great clans immediately nodded in agreement!<br/><br/>The Great Angel Baili had already given the order to kill, so they naturally had to complete this mission!<br/><br/>Although the Sky Plant Demonic Beast had been destroyed, they still had the confidence to destroy the Dragon Palace with all their strength!<br/><br/>“This time, in order to prevent any accidents, everyone should take out some trump cards!”<br/><br/>The Sacred Dragon King added!<br/><br/>The leaders of the five great races nodded, and their eyes flashed with a cold expression. They immediately returned to their own races and gave out orders!<br/><br/>Time passed very quickly. On the universe’s AI, the powerful disciples of the other races didn’t know that the Dragon Palace and an Archangel had engaged in a second round of confrontation with the sacred dragon lineage!<br/><br/>However, the powerful disciples of all the races knew that this might be the calm before the storm!<br/><br/>However, just as they had expected, a month later, some of the races near the corpse-eating ghost clan, the god Herder clan, the light giant clan, the light sound bug clan, and the Black Fog Spirit clan noticed that the five great races had started to move!<br/><br/>War machines rose up from within their clans, and a group of great beings gathered!<br/><br/>At the Mu God clan, an incomparably huge ancient corpse flew out from within the Mu God clan!<br/><br/>This incomparably huge corpse contained a terrifying murderous aura and terrifying power!<br/><br/>The corpse was a million kilometers in size, and it had an aged face that made one’s heart palpitate from afar!<br/><br/>This was the Mu God clan’s most powerful trump card, and it was even more powerful than their clan’s innate true treasures!<br/><br/>The so-called mu God Mu was an ancient god corpse!<br/><br/>The power of this god corpse was not something a level three universe master could contend against!<br/><br/>In the light giant clan, the great beings of other races saw more than a dozen incomparably huge giants flying in the void space while carrying a light mountain peak!<br/><br/>That terrifying light mountain peak caused the surrounding world to turn bright white!<br/><br/>In the light sound bug tribe, there were experts from other races who were densely packed with countless insects that gathered together to form an extremely terrifying devouring giant bug that shot straight into the clouds. It easily bit through the void and burrowed into the black hole!<br/><br/>In the corpse-eating ghost tribe, there were other races who discovered that it was like a swamp. The land that was filled with corrosion flew out of the corpse-eating ghost tribe’s territory. It carried the stench of blood and evil as it flew into the sky!<br/><br/>At the Black Fog Spirit clan’s location, a black fog that blotted out the sky flew out from their race, blotting out the sky. As for what was inside? No one knew!<br/><br/>The five great races underwent tremendous changes at the same time. Everyone knew that the five great races were about to make their move!<br/><br/>They were going to assist the sacred dragon lineage and prepare to attack the Dragon Palace!<br/><br/>Furthermore, the might of their attack was more terrifying than they had imagined!<br/><br/>“Isn’t that terrifying and ancient god corpse of the shepherds the most terrifying existence of the shepherds?”? “It’s said that that God corpse can easily kill any enemy below the universe ruler realm. It’s extremely terrifying. In order to fight against the Dragon Palace, they even used such a trump card?”<br/><br/>“The light sound bug race seems to be a light ray worm bred by their race, right? It’s said that the light ray worms can perfectly fuse together. It’s the light sound bug race’s trump card!”<br/><br/>“The five forces have started to move. I heard that they have used their strongest force and are determined to destroy the Dragon Palace. It seems that the destruction of the Sky Plant Demon Beast Clan has infuriated them!”<br/><br/>“The five forces, together with the Holy Dragon Bloodline, have gathered all their forces and brought out their trump cards. Will the Dragon Palace be their match? Will they be able to resist it?”<br/><br/>“Isn’t it difficult? If they can withstand it, then the dragon palace is truly heaven-defying!”<br/><br/>The news of the five forces’actions quickly spread through the universe ai!<br/><br/>At this moment, the heaven opening primal continent was once again in an uproar!<br/><br/>A battle at this level was no longer an ordinary one!<br/><br/>This was a top-tier battle between high-level races!<br/><br/>There were more than 100 universe masters with level 3 battle strength and above!<br/><br/>This power terrified the other races!<br/><br/>Everyone was talking about this battle!<br/><br/>At this time, the prediction of the outcome of the battle wasn’t one-sided!<br/><br/>This was because ever since the Dragon Palace entered the inner part of the heaven opening primal continent, they had always erupted and destroyed the other party when others thought that they couldn’t do it!<br/><br/>No one dared to say that the Dragon Palace would definitely lose this war!<br/><br/>All Wars had erupted!\t\t\t\t\t\t</div>", "images": {}, "success": true}