{"id": 583, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073067.html", "title": "Chapter 3574 - 3574 3573 Treasure Of The Sky Plant Demonic Beast Clan!", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3574 - 3574 3573 Treasure Of The Sky Plant Demonic Beast Clan!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3574 3573 treasure of the Sky Plant Demonic Beast Clan!<br/><br/>With a face full of killing intent, Archangel Baili flew toward the Sky Plant Demonic Beast clan!<br/><br/>The experts of the Sacred Dragon Clan and the other five great clans were also full of anger and killing intent!<br/><br/>How dare they threaten the five great clans?<br/><br/>“Is… is this the strength of the Dragon Palace? How could they destroy the Sky Plant Demonic Beast Clan?”<br/><br/>“How is this possible! The Sky Plant Demon Beast Clan, the Dragon Palace Dragon King and the others are actually so terrifying?”<br/><br/>At the same time, at the ancestral dragon lineage, the thirteen peak experts of the ancestral dragon lineage saw the information on the universe AI, and their faces were filled with shock!<br/><br/>What did they see?<br/><br/>The Holy Dragon lineage wanted to unify the Divine Dragon Clan, and they were prepared to advance and retreat with the Dragon Palace this time. They were ready for a great battle!<br/><br/>However, before the war broke out, the Dragon Palace destroyed the Sky Plant Demon Beast Clan!<br/><br/>This was the Sky Plant Demon Beast Clan, a powerful high-level race!<br/><br/>This required the Sky Plant Demon Beast clan to have at least two to three times the strength to enter the nest of the Sky Plant Demon Beast clan and destroy it!<br/><br/>Then, this required the Dragon Palace to have 40 to 50 universe Master Level 3 Warriors!<br/><br/>The Dragon Palace had so many experts?<br/><br/>With so many experts in the Dragon Palace and 13 of them, wouldn’t they be able to fight against the Holy Dragon Clan?<br/><br/>“Could it be that the Dragon Palace is the hope of the Divine Dragon Clan?”<br/><br/>The Golden Dragon King muttered.<br/><br/>The other 12 pinnacle experts of the Ancestral Dragon Clan were slightly silent!<br/><br/>Maybe that was the case!<br/><br/>The strength displayed by the Dragon Palace was still a huge gap even when compared to the ancestral dragon clan back then!<br/><br/>It was too strong!<br/><br/>While the outside world was in shock, Wang Xian was looking at a large number of treasures in the Dragon King Hall of the Dragon Palace!<br/><br/>This time, the Dragon Palace had obtained a huge harvest after exterminating the entire Sky Plant Demon Beast clan!<br/><br/>All the resources of the Divine Kingdom of the 16 level 3 masters of the Universe!<br/><br/>In addition to the resources of the entire Sky Plant Demon Beast clan!<br/><br/>These resources were extremely terrifying!<br/><br/>“I wonder if the resources I have increased are enough!”<br/><br/>Wang Xian mumbled.<br/><br/>His current strength had already reached the level of level-three combat strength of the Masters of the universe. If he were to increase his strength one more time, he would be able to possess the level-four combat strength of the Masters of the universe!<br/><br/>And at this stage, he would be able to contend against the real masters of the universe!<br/><br/>Wang Xian felt that it was still possible for him to achieve a breakthrough with the resources of the entire sky plant demonic beasts!<br/><br/>Of course, it was only a possibility!<br/><br/>This was because Wang Xian realized that there were no medicinal pills, divine herbs, divine trees, or divine fruits in the treasure vault of the entire sky plant demonic beasts!<br/><br/>As a species with wood attribute, it was very strange for him to not have these treasures!<br/><br/>However, he had obtained a piece of information from the memories of the leader of the Sky Plant Demonic Beasts!<br/><br/>The seed of advancement!<br/><br/>With a move of his palm, a seed appeared in his hand!<br/><br/>The species contained a majestic aura. As Wang Xian looked at the seed of advancement, his eyes sparkled!<br/><br/>This was the most precious treasure of the leader of the Sky Plant Demonic Beasts!<br/><br/>This was also the reason why the Sky Plant Demonic Beasts didn’t have any other wood attribute treasures.<br/><br/>Because most of the treasures had been absorbed by this seed!<br/><br/>The seed was like its name, able to allow a great being to break through the shackles and advance!<br/><br/>This race was incomparably precious, and in the heart of the Sky Plant Demon Beast clan leader, it was even more precious than a connate true treasure!<br/><br/>Right now, the race hadn’t reached the maturity stage. Once it reached that stage, after consuming it, it would be able to break through to the universe ruler realm!<br/><br/>The True Universe ruler realm!<br/><br/>This was definitely one of the most precious treasures in the universe!<br/><br/>One had to know that even the third Prince of the angel race didn’t have any methods to make the sacred Dragon King break through to the universe ruler realm!<br/><br/>But similarly, this advanced seed’s effects were extremely powerful. However, to be able to make it mature, the resources required were too huge!<br/><br/>The nurturing of one’s own body coupled with countless resources!<br/><br/>The leader of the sky plant demonic beasts had squandered the wood attribute resources that the entire race had accumulated. However, they had yet to mature even after being absorbed!<br/><br/>Although the treasures were heaven-defying, obtaining one was even harder than obtaining an innate treasure!<br/><br/>It was several times harder!<br/><br/>“Let’s try it on the ancestral tree.”<br/><br/>Wang Xian looked at this seed of advancement. With a move of his palm, a branch behind him slowly came before him!<br/><br/>He placed the seed of advancement on the branch and waited for the ancestral tree’s reaction!<br/><br/>Buzz<br/><br/>As expected, the seed of advancement slowly fused into the branch of the ancestral tree, forming a special seed!<br/><br/>At the same time, a stream of information was transmitted into Wang Xian’s mind!<br/><br/>“HMM?”<br/><br/>When he absorbed this information, his eyes flickered slightly!<br/><br/>After the ancestral tree absorbed the seed of advancement, it could bear such a fruit in the future!<br/><br/>However, to bear the seed of advancement, with the current level of the ancestral tree, it would take 10 million years for the seed to mature!<br/><br/>And to bear a seed of advancement, it would take 100 million years for it to mature!<br/><br/>In other words, 100 million years was enough for a Level 3 master of the universe to break through to the realm of a true master of the universe!<br/><br/>This was too long for Wang Xian and the Dragon Palace!<br/><br/>Of course, there was also a way to make the seed of advancement mature faster. It was to feed it with treasures, wood-type treasures!<br/><br/>However, the amount of treasures and resources required would be many, many!<br/><br/>“This seed of advancement is useful, but the period of maturity is too long. There are too many resources to nurture. We can only wait until the ancestral tree is upgraded!”<br/><br/>He mumbled!<br/><br/>Other than the most precious seed of advancement, the second most valuable item was the only innate treasure of the sky plant demonic beasts!<br/><br/>It was a leaf with the light attribute.<br/><br/>This leaf was called the time fragment!<br/><br/>The time fragment was an offensive innate treasure.<br/><br/>As long as there was light, it could be condensed into a terrifying leaf and used as a weapon to attack!<br/><br/>The attack of the time Shard was equally terrifying. It was still very useful to Wang Xian!<br/><br/>He was prepared to refine it!<br/><br/>At present, the Five Elements Millstone and the Tai Chi Dragon Plate could not absorb the innate treasures. They could only absorb them after they had a breakthrough!<br/><br/>However, it was extremely difficult for the five elements Millstone and the Tai Chi Dragon Plate to achieve a breakthrough. They needed too many innate spiritual treasures!<br/><br/>Other than this time fragment, there were also many other types of treasures.<br/><br/>There were a few hundred innate spiritual treasures. Most of them were of the wood attribute. It was unknown if they could help the five elements Millstone achieve a breakthrough!<br/><br/>After checking all the treasures and resources, Wang Xian began to devour and absorb the remaining treasures and resources!<br/><br/>Meanwhile, in the Dragon Palace, all the other disciples also began to improve!<br/><br/>How much could the resources of the entire Sky Plant Demon Beast clan increase the Dragon Palace?<br/><br/>The other Wang Immortals did not know, but there were 16 universe dominator level 3 corpses with combat strength alone.<br/><br/>There were 16 universe Dominators with level 3 combat strength in the Divine Kingdom!<br/><br/>This could increase the Dragon Palace by 24 universe Dominators with level 3 combat strength!\t\t\t\t\t\t</div>", "images": {}, "success": true}