{"id": 589, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073079.html", "title": "Chapter 3580 - 3580 Plan 3579", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3580 - 3580 Plan 3579</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3580 Plan 3579<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Inside the heaven-splitting primordial land, Wang Xian was flying forward rapidly!<br/><br/>He was already within the territory of the god-herding clan!<br/><br/>However, the current god-herding clan was a little desolate. There were very few experts and disciples of the god-herding Clan!<br/><br/>The god-herding clan had made some preparations!<br/><br/>The eight-limbed demonic fiend had already entered the lair of the god-herding clan. They had already parasitized the bodies of the disciples of the god-herding Clan!<br/><br/>However, the information they obtained was that all the disciples of the god-herding clan were either staying in their own divine kingdoms or their own grotto-heaven blessed land!<br/><br/>As for the grotto-heaven blessed land of the god-herding clan, it was able to withstand the attacks of a true master of the universe!<br/><br/>When Wang Xian received this news, he frowned slightly!<br/><br/>This was not good news.<br/><br/>Clearly, the god-herder tribe was well prepared to prevent the dragon palace from launching a Sneak Attack!<br/><br/>Furthermore, the god-herder tribe had already set up everything in the tribe!<br/><br/>In other words, most of the disciples had entered the grotto-heaven blessed land. Before the Dragon Palace was destroyed, they were only allowed to leave and not enter!<br/><br/>The rest of the disciples didn’t stay in the clan either!<br/><br/>This defense could be said to be foolproof!<br/><br/>Even if the Dragon Palace could really invade and attack, they could only destroy some buildings!<br/><br/>This was something that they could easily recover from!<br/><br/>They wouldn’t lose many disciples either. In fact, if all the disciples obeyed orders, not a single one of them would die!<br/><br/>It was not only the Divine Shepherd clan, but also the other three races like the giant of light!<br/><br/>As for whether there were other arrangements, Wang Xian did not know!<br/><br/>In short, this time, the Holy Dragon lineage and the five great races were unusually cautious!<br/><br/>However, no matter how cautious they were, they did not expect the Dragon Palace to have an existence like an lie!<br/><br/>To be able to ignore the defenses of the grotto-heaven blessed land.<br/><br/>Wang Xian flew quickly and arrived at the center of the territory of the god-herding race!<br/><br/>At the center of the god-herding race, there weren’t very many disciples around!<br/><br/>There were only a few scattered around.<br/><br/>These disciples thought that the Dragon Palace wouldn’t attack them, so they didn’t have any scruples.<br/><br/>There were very few such disciples, and their strength was neither strong nor weak!<br/><br/>They were all universe knights!<br/><br/>During this expedition, the majority of the experts from the five major races, including those above the universe dominator level, participated in it!<br/><br/>Only a very small number of experts above the universe dominator level were left to guard the place!<br/><br/>Wang Xian’s arrival did not attract any attention!<br/><br/>He hid his figure and looked around!<br/><br/>“Dragon King, over here!”<br/><br/>At this moment, a middle-aged man stood in a house and transmitted his voice to Wang Xian!<br/><br/>He looked over and arrived immediately!<br/><br/>“Dragon King!”<br/><br/>Ba Qi cupped his hands and bowed to Wang Xian!<br/><br/>“How’s the situation?”<br/><br/>Wang Xian asked!<br/><br/>“Dragon King, 70% of the disciples of the god-herding race are in the grotto-heaven blessed land. That grotto-heaven blessed land can withstand our attacks. The only way now is to get an lie to bring us in!”<br/><br/>Ba Qi reported.<br/><br/>“What we need to do is not to kill those ordinary disciples, but to attract the experts of the god-herding clan!”<br/><br/>Wang Xian opened his mouth and said with a thoughtful look on his face!<br/><br/>“There is a way to get an lie to send us the poisonous horned dragon seed in. Mo Sha and I will parasitize the experts in the grotto-heaven blessed land of the god-herding clan. However, Dragon King, you guys will attack the grotto-heaven blessed land from the outside and create the illusion that you can use treasures to break the grotto-heaven blessed land. This way, we can pass the information here to the patriarch of the god-herding Clan!”<br/><br/>“If that’s the case, they will definitely come to our aid. That way, we will be able to kill them!”<br/><br/>Ba Qi said!<br/><br/>“HMM, this is indeed a good idea. However, we still have to consider one more point. The group of the god-herding Clan has guessed the approximate strength of our Dragon Palace. The powerhouses of the god-herding clan should not be coming back alone. There should be powerhouses from other races coming to help!”<br/><br/>Wang Xian spoke!<br/><br/>“Dragon King, what we are most worried about now is whether the powerhouses of the Angel clan will come over. If they do, we will be in trouble!”<br/><br/>As Ba Qi spoke, he frowned slightly!<br/><br/>“The Elf clan has already paid attention to this matter. In that case, the Angel clan will not be involved. At most, they will provide treasures to help. They will not send the disciples of the powerhouses over. Otherwise, it would be a violation of the rules.”<br/><br/>Wang Xian spoke up!<br/><br/>If the top-tier races were to participate in the war between the top-tier races, how would they fight?<br/><br/>The rule of the top-tier races was that they were not allowed to participate in anything below the top-tier races!<br/><br/>“There’s no need to worry about the Angel tribe. They will definitely come back to rescue the god Shepherd tribe when they are attacked. However, if they come back to rescue us, the strength of the strong ones who return will definitely be able to fight against our Dragon Palace. When that happens, it will be extremely difficult to destroy them.”<br/><br/>Wang Xian continued to speak as his eyes sparkled!<br/><br/>This seemed to be a dead end!<br/><br/>It was easy to kill the ordinary disciples of the Divine Shepherd clan. However, it would be a little difficult to kill those experts!<br/><br/>The Divine Shepherd clan were not fools!<br/><br/>They would not say that the experts of the clan would come to rescue them even though they knew that they were no match for them.<br/><br/>“Dragon King, let’s target the other races then.”<br/><br/>Ba Qi pondered for a moment and said!<br/><br/>Wang Xian nodded his head slightly.<br/><br/>It was very easy for the other party to come back to support them!<br/><br/>The experts of the god Shepherd tribe could return to their divine kingdom in an instant and come to support them!<br/><br/>The experts of the other races could also return to their divine kingdom and rush over quickly through the teleportation formation!<br/><br/>However, it would take some time for them to reunite with their team after they returned!<br/><br/>Wang Xian didn’t believe that they could rush over from a distance without a teleportation formation!<br/><br/>If they had this ability, they wouldn’t need the six major races to take such a huge action!<br/><br/>All they needed to do was to send a few experts to the river of Everlast and use a special method to send them over in an instant!<br/><br/>Therefore, they were certain that the other party didn’t have an Lie’s ability!<br/><br/>Wang Xian took out the universal AI and sent a message to an lei, setting up a demonic altar!<br/><br/>Soon, an lie arrived.<br/><br/>“An lie, send the eight-limbed demonic fiend and the rest into the blessed land of the god Shepherd tribe in the next few days!”<br/><br/>Wang Xian instructed an lie!<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded and looked at Ba Qi.<br/><br/>“Send me and Mo Sha into the grotto-heaven blessed land first. We will think of a way to parasitize the bodies of the experts of the god-herding race in the grotto-heaven blessed land. After that, send over 1,000 poisonous horned dragon species over so that we can create false information!”<br/><br/>Ba Qi said!<br/><br/>“No Problem!”<br/><br/>An lie nodded.<br/><br/>“Also, after Ba Qi and the rest have settled their matters, you will bring Ao Yao and the rest of the heaven formation to follow the teams of the six major tribes of the Holy Dragon Tribe.”<br/><br/>Wang Xian instructed again.\t\t\t\t\t\t</div>", "images": {}, "success": true}