{"id": 585, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073071.html", "title": "Chapter 3576 - 3576 3575 Judgment?", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3576 - 3576 3575 Judgment?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3576 3575 judgment?<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>In the interior of the heaven-splitting primordial land, Baili Archangel was flying rapidly in the void!<br/><br/>It would take them a year to arrive at the Dragon Palace from the sky-plant Demonic Beast clan through the Midway Transit!<br/><br/>By the time he arrived, the Dragon Palace had already completed the upgrade!<br/><br/>Wang Xian had fused the time fragment innate treasure into his dragon scale, increasing his strength by a little!<br/><br/>According to his investigations, an expert could at most master three innate treasures. If there were more, it would be of little value!<br/><br/>The increase in strength would be smaller!<br/><br/>Of course, it was not useless. However, the effect of the innate treasure would be greatly reduced!<br/><br/>As time passed, all the expert disciples from the ancestral dragon lineage had gathered. They had fixed their nest in the ocean of the mountains and seas. It would only take one to two months to fly to the Dragon Palace!<br/><br/>Now, the ancestral dragon lineage was preparing to open up a teleportation array with the dragon palace so that both sides could quickly provide support!<br/><br/>One year passed very quickly. In the void in front of the Eternal Sky River, the figure of Baili Archangel appeared!<br/><br/>He flapped his twelve wings and stared in the direction of the Eternal Sky River with a face full of killing intent.<br/><br/>It was not his first time coming here. The last time, he came here for the Xiantian Supreme Treasure, the twelfth grade water lotus!<br/><br/>This was a very powerful Xiantian supreme treasure, but unfortunately, it had been destroyed by the space beast before it matured!<br/><br/>As a result, he had only obtained a portion!<br/><br/>And the Space Beast had also escaped!<br/><br/>This was his second time coming here.<br/><br/>“When the time comes, I will kill the Dragon King of the Dragon Palace and enslave all the other experts and disciples of the Dragon Palace!”<br/><br/>Looking at the position in front of him, the Great Angel Baili said to the Sacred Dragon King and the others behind him!<br/><br/>“It’s the Great Angel Baili!”<br/><br/>The Sacred Dragon King nodded with excitement in his eyes!<br/><br/>The fact that the Great Angel Baili of the Angel clan had taken action in person reduced many accidents!<br/><br/>The destruction of the sky plant demonic beast might not be a bad thing for him!<br/><br/>Boom<br/><br/>Baili Archangel entered the sky above the river of eternity. His terrifying aura wasn’t concealed at all!<br/><br/>His bright eyes stared at the ocean below and locked onto the dragon palace below the water in the sky.<br/><br/>A terrifying aura descended!<br/><br/>It was as if the world of light had descended and judged the human world!<br/><br/>“Dragon King!”<br/><br/>“Dragon King, there’s a terrifying figure of light flying towards our Dragon Palace. It should be an expert from the Angel clan!”<br/><br/>At the same time, the Dragon Palace received the news the moment Baili and the Archangels flew over!<br/><br/>Prime Minister Gui immediately came to the Dragon King’s Palace and reported with a solemn expression!<br/><br/>“HMM?”<br/><br/>Wang Xian’s eyes focused when he heard Prime Minister Gui’s words!<br/><br/>“Get all the experts of the Dragon Palace Ready!”<br/><br/>His figure moved and flew directly towards the Dragon Gate!<br/><br/>“Dragon King, I can sense it. It’s the aura of that Birdman. It’s the aura of that Birdman!”<br/><br/>At this moment, the figure of the king of water touch appeared beside Wang Xian. He roared with killing intent!<br/><br/>“That Birdman? Archangel Baili?”<br/><br/>Wang Xian heard his words and spoke!<br/><br/>“Yes, it’s him. It’s this Birdman!”<br/><br/>The king of water tentacles replied loudly!<br/><br/>When Wang Xian heard it, his expression turned slightly awkward!<br/><br/>More than a thousand years ago, the battle between the king of water tentacles and Archangel Baili was still vivid in Wang Xian’s mind!<br/><br/>At that time, he took out two innate treasures and even summoned a million strong Angel Army!<br/><br/>“Water touch, do you think we can fight against him if we join forces now?”<br/><br/>Wang Xian said to the king of Water Touch!<br/><br/>At this moment, Wang Xian’s strength was already terrifying enough. With all his trump cards and the king of water touch, would he be able to fight against the Great Archangel Baili?<br/><br/>“We can fight against him, but it’s impossible to defeat him!”<br/><br/>Water Touch King immediately said!<br/><br/>She was still very confident in fighting against him.<br/><br/>She had seen Wang Xian’s strength and knew all of his trump cards. Together with herself, she could definitely fight against a real master of the universe. However, it was impossible to defeat him!<br/><br/>“As long as we can fight against him!”<br/><br/>Wang Xian mumbled. They could fight against him, but what if they were to include the more than 50 other masters of the Dragon Palace who had level-three combat strength?<br/><br/>It was highly possible for them to defeat him together!<br/><br/>The Dragon Palace could already fight against a true master of the universe!<br/><br/>Whoosh<br/><br/>Wang Xian flew out of the Dragon Palace and immediately looked towards the west. His gaze was locked onto the terrifying figure that was like the sun!<br/><br/>His dragon eyes were sparkling. With the activation of his dragon eyes, the figure of 100 Archangels appeared clearly in his line of sight!<br/><br/>“Huh?”<br/><br/>However, when he looked behind him, his expression changed slightly!<br/><br/>Behind him, there were more than 60 level 3 universe masters with the Combat Power of Saint Dragon King and the others!<br/><br/>Along with the Army of 1,000,000 angels led by the Archangel, the Dragon Palace was no match for them!<br/><br/>However, the possibility of the Dragon Palace trying to escape was still very high!<br/><br/>In addition, the pinnacle races were forbidden to attack other races. This was a rule, and the Archangel would not dare to violate it!<br/><br/>Of course, the Dragon Palace had to be prepared for the other party to violate the rules!<br/><br/>“Dragon King of the Dragon Palace, grow out for my archangel!”<br/><br/>Baili Archangel landed in front of the Dragon Palace at a terrifying speed and shouted with a cold face, as if he was going to judge a criminal!<br/><br/>He knew the rules of the peak races, so he didn’t plan to destroy the entire Dragon Palace.<br/><br/>All he needed to do was to kill the Dragon King of the Dragon Palace!<br/><br/>As for the rest of the strong disciples of the Dragon Palace, he would leave them to the Holy Dragon King and the rest!<br/><br/>“Archangel Baili, I wonder why you have come to the Dragon Palace. The peak race is prohibited from interfering in the affairs of other races. They are also prohibited from attacking the strong disciples below the peak race!”<br/><br/>Wang Xian stared at Archangel Baili and said indifferently!<br/><br/>“You are the Dragon King of the Dragon Palace? You Dare to destroy the subsidiary races of My Angel Race. Today, I will kill you. Are you going to commit suicide or will you be judged by me?”<br/><br/>Archangel baili stared at Wang Xian and said expressionlessly!<br/><br/>He didn’t put a dragon palace in his eyes!<br/><br/>A Dragon King of the Dragon Palace. If he wanted to make a move, he could kill him instantly!<br/><br/>Wang Xian frowned slightly when he heard Archangel Baili’s words.<br/><br/>The other party disregarded the rules and used such an excuse to destroy him?<br/><br/>It seemed that he would have to meet the real ruler of the universe today!<br/><br/>Wang Xian clenched his fists as his eyes sparkled!<br/><br/>“Dragon King of the Dragon Palace, why aren’t you taking your own life to atone for your crime? Our Lord Baili Archangel is already merciful for not destroying your Dragon Palace directly!”<br/><br/>At the back, the Holy Dragon King stared at Wang Xian. His eyes were filled with violent killing intent!<br/><br/>This was the murderer of his son, as well as the murderer of the powerhouses of his holy dragon lineage!<br/><br/>“You have three seconds!”<br/><br/>Baili Archangel stared at Wang Xian and spat out another five words!<br/><br/>This was a high and mighty judgment!\t\t\t\t\t\t</div>", "images": {}, "success": true}