{"id": 581, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073063.html", "title": "Chapter 3572 - 3572 3571 Shook! The Sky Plant Demonic Beast Was Destroyed", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3572 - 3572 3571 Shook! The Sky Plant Demonic Beast Was Destroyed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3572 3571 shook! The Sky Plant Demonic Beast was destroyed<br/><br/>The Sky Plant Demonic Beast clan, along with the death of the Sky Plant Demonic Beast clan leader and the other experts, also represented the destruction of the entire clan!<br/><br/>The experts of the Dragon Palace began to harvest the resources of the Sky Plant Demonic Beast clan!<br/><br/>A powerful high-level clan had terrifying resources!<br/><br/>“There’s only the Sky Plant Demonic Beast clan left. Where are their people? Haven’t they come yet?”<br/><br/>At the same time, in a palace of the Holy Dragon lineage, the experts of the five great clans and the Holy Dragon lineage had all gathered!<br/><br/>They were all affiliated clans of the Sky Plant clan, so it was very easy for them to rush over.<br/><br/>They could directly use the teleportation array to reach a location of the Angel clan for a transit, and then they would be able to arrive at the Holy Dragon lineage!<br/><br/>If they were to calculate based on time, they would only need ten minutes to arrive!<br/><br/>Right now, the ghouls, the god herders, the light giants, the light sound bugs, and the Black Fog Spirit race had all arrived with level 3 universe masters. Only the Sky Plant Demon Beast Race had yet to arrive!<br/><br/>“Everyone, please calm down. Brother Sky Plant Demon Beast must have been delayed by a small matter. Let Me Ask Brother Sky Plant Demon Beast!”<br/><br/>The Sacred Dragon King saw the race experts urging him and said with a smile.<br/><br/>He took out the universe AI and opened it!<br/><br/>“HM?”<br/><br/>When he opened it and looked, he saw a message from the leader of the Sky Plant Demon Beast tribe!<br/><br/>Because he was calling the experts of the five great races just now, he didn’t check the message on the universe ai!<br/><br/>Now that he saw the message from the leader of the Sky Plant Demon Beast tribe, he immediately opened it!<br/><br/>“What?”<br/><br/>When he saw the message from the leader of the Sky Plant Demonic Beast tribe, he immediately sat up from the dragon chair with an extremely shocked expression on his face!<br/><br/>“Oh? What’s Wrong?”<br/><br/>In the surroundings, the experts from the five great races were also stunned when they saw the Saint Dragon King’s pale expression!<br/><br/>There were very few things that could cause them to be so shocked when they cultivated to their current realm!<br/><br/>“How… How is this possible? How is this possible?”<br/><br/>The Sacred Dragon King could not help but growl. His expression changed drastically, causing the surrounding experts to frown slightly and look at him!<br/><br/>“The Sky Plant Demonic Beast Clan has been invaded by the Dragon Palace. Including the clan leader of the Sky Plant Demonic Beast clan, they have all been killed. They were only resurrected through the grotto-heaven blessed land. The Sky Plant Demonic Beast clan is almost wiped out!”<br/><br/>The Holy Dragon King’s low roar continued. His words stunned all the experts of the five great clans, and their faces were filled with astonishment!<br/><br/>“How… How is this possible? How did the Dragon Palace suddenly attack the Sky Plant Demonic Beast Clan? How could they destroy the Sky Plant Demonic Beast Clan?”<br/><br/>The clan leader of the Black Fog Spirit clan instantly stood up and asked with a shocked face!<br/><br/>The black fog spiritual race had a closer relationship with the Sky Plant Demonic Beast Race. The tribe leader of the black fog spiritual race had a very good understanding of the strength of the Sky Plant Demonic Beast Race!<br/><br/>But now, the Sky Plant Demonic Beast race was suddenly exterminated?<br/><br/>They were a powerful high-level race. They had existed for more than 20 billion years. How could they be exterminated so easily?<br/><br/>“This is a message sent to me by the Sky Plant Demonic Beast tribe leader. I’m sending a message to him now, but I haven’t received any reply!”<br/><br/>The Holy Dragon King’s expression changed as he said this. His gaze swept across all the experts of the five great clans. “The leader of the Sky Plant Demonic Beast clan shouldn’t have said such a thing. Let’s go, we’ll go there immediately!”<br/><br/>“Okay, we’ll go to the Sky Plant Demonic Beast clan immediately!”<br/><br/>The experts of the five great clans didn’t hesitate at all. They immediately stood up and flew outside!<br/><br/>The leader of the Sky Plant Demonic Beast clan wouldn’t casually send such a message. Since he sent such a message, it also proved that something had definitely happened to the Sky Plant Demonic Beast Clan!<br/><br/>This caused them to be extremely shocked!<br/><br/>Did the Dragon Palace really exterminate the Sky Plant Demonic Beast tribe?<br/><br/>Buzz<br/><br/>They arrived in front of the teleportation formation of the Holy Dragon Tribe and immediately teleported away!<br/><br/>The next moment, they arrived at a divine mountain of light. There was a teleportation formation that led directly to the Sky Plant Demonic Beast tribe!<br/><br/>However, when they arrived, Angel Baili stood in front of the teleportation formation and frowned slightly!<br/><br/>“We pay our respects to Archangel Baili!”<br/><br/>The Sacred Dragon King and the others immediately bowed respectfully when they saw Archangel Baili!<br/><br/>“The position opposite the teleportation array has been destroyed.”<br/><br/>Archangel baili glanced at them and said!<br/><br/>“Destroyed?”<br/><br/>The Sacred Dragon King and the others’faces sank when they heard that!<br/><br/>“The Divine Tablet of the leader of the Sky Plant Demonic Beast tribe has been destroyed and is completely dead. We will first teleport to the black fog spiritual race and then go over to investigate!”<br/><br/>He stepped into a teleportation array!<br/><br/>“The clan leader is dead?”<br/><br/>The Sacred Dragon King and the others trembled when they heard this. They followed closely behind!<br/><br/>When they reached the Black Fog Spirit clan, he flapped his wings and wrapped all the experts around him. Then, he flew toward the sky plant clan!<br/><br/>As the distance was too far, even if it was baili archangel, even if it was an expert at the Cosmos ruler realm, it would still take four days!<br/><br/>However, when they rushed over, Wang Xian and the experts from the dragon palace had already finished harvesting all the resources of the Sky Plant Demonic Beast clan!<br/><br/>The Cosmos God countries that contained the disciples of the sky plant demonic beast experts were all thrown into the Dragon Palace!<br/><br/>This was not a small project. It took two days!<br/><br/>“It’s about time. An lie, go set up some devil spirit altars in the surroundings. It’s convenient to teleport here instantly. Let’s go back!”<br/><br/>Wang Xian instructed an lie. His gaze swept across all the disciples of the Dragon Palace as he said with a smile!<br/><br/>“It’s the Dragon King!”<br/><br/>The rest of the experts of the Dragon Palace nodded their heads with excitement. Their figures slowly disappeared!<br/><br/>In the next moment, Wang Xian also appeared in the Dragon Palace.<br/><br/>“Prime Minister Gui, clean up the results of this battle and bring some precious ones over!”<br/><br/>Wang Xian came to the Dragon King’s Palace and immediately gave an order to Prime Minister Gui!<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui replied immediately!<br/><br/>“Hehe, the rewards this time are definitely not cheap. It can increase the number of experts with level three combat strength who are the masters of the universe in the Dragon Palace by more than 20!”<br/><br/>Wang Xian sat on the dragon chair with a smile on his face!<br/><br/>He took out the universal AI and looked at the hottest news. The corner of his mouth curled up slightly!<br/><br/>At this moment, the decision of the six great races to help the Holy Dragon lineage unify the Divine Dragon tribe was still the hottest topic at the moment!<br/><br/>All the powerhouses of the various races were discussing when the holy dragon lineage would make their move!<br/><br/>They were discussing how the Dragon Palace and the Sacred Dragon bloodline would resist!<br/><br/>But this time, no one was optimistic about the Dragon Palace and the Sacred Dragon Bloodline, because this time, it was the alliance of the six great races!<br/><br/>It was the will of the light race!<br/><br/>There was an order from the light race behind it!<br/><br/>How could the Dragon Palace and the ancestral dragon bloodline resist the Order of a peak race?\t\t\t\t\t\t</div>", "images": {}, "success": true}