{"id": 582, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073065.html", "title": "Chapter 3573 - 3573 3572 Was In An Uproar. Just How Strong Was The Dragon Palace?", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3573 - 3573 3572 Was In An Uproar. Just How Strong Was The Dragon Palace?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3573 3572 was in an uproar. Just how strong was the Dragon Palace?<br/><br/>“Looks like no one is optimistic about the Dragon Palace and the ancestral dragon lineage. I’ll give you all a surprise then!”<br/><br/>Wang Xian looked at the matter regarding the six great races assisting the Holy Dragon lineage in unifying the divine dragon lineage on the universal AI and smiled!<br/><br/>He took out the universal AI and immediately posted a message on it!<br/><br/>There were pictures attached to this message!<br/><br/>These pictures were the corpses of the sky plant demon beasts and the scene of the destruction of the sky plant demon beasts!<br/><br/>He posted it in the name of the Dragon Palace!<br/><br/>When Wang Xian posted this message, it immediately caused a huge sensation!<br/><br/>In fact, the entire heaven-opening primordial land was in an uproar!<br/><br/>Because there had been a lot of news about the Dragon Palace in the past thousand years, many disciples had been paying attention to the accounts on the AI of the Dragon Palace!<br/><br/>When they saw the information and pictures of the Dragon Palace, they were all dumbfounded!<br/><br/>Dragon Palace: Sky Plant Demon Beasts, Ghouls, God herders, light giants, light sound insects, and black fog spiritual race want to help the Holy Dragon Clan unify the Divine Dragon Clan and make the Dragon Palace submit.., they are the enemies of our Dragon Palace. Today, we will destroy the Sky Plant Demonic Beast clan and warn the other five great clans. The Holy Dragon Clan is the enemy of our Dragon Palace. If we help them, they will be our mortal enemies. In the future, the Sky Plant Demonic Beast clan.., will also end up like you!<br/><br/>This was the message Wang Xian had posted. There were more than a dozen pictures attached below!<br/><br/>“D * mn, is this… is this real? Is this real? The Dragon Palace actually destroyed the Sky Plant Demonic Beast Clan?”<br/><br/>“Hiss, how is this possible? The Sky Plant Demon Beast clan was actually annihilated? It has only been a month since the six great races announced their assistance to the Sacred Dragon Clan, right? In such a short period of time, the Sky Plant Demon Beast clan was annihilated by the Dragon Palace?”<br/><br/>“This is simply unbelievable. The Sky Plant Demon Beast Clan has at least 10 to 20 universe masters with level 3 combat strength. How could they be annihilated so easily? They have stood tall in the universe for over 20 billion years!”<br/><br/>“That’s the corpse of the Sky Plant Demon Beast leader. If the Sky Plant Demon Beast was really destroyed by the Dragon Palace, how could the Dragon Palace be so powerful?”<br/><br/>“Does the Dragon Palace have a universe ruler level existence? How could they destroy the Sky Plant Demon Beast race so quickly? Even if they rushed over within a month, they wouldn’t be able to make it, right?”<br/><br/>Looking at this piece of information from the Dragon Palace, all the powerful disciples of the various races were stunned!<br/><br/>The Sky Plant Demonic Beast race was not weak!<br/><br/>It was a powerful existence decided by the subsidiary races of the Angel Race!<br/><br/>Most importantly, a month ago, the Sacred Dragon Clan announced that the six great races would help them unify the Divine Dragon Clan!<br/><br/>But now, the Sky Plant Demonic Beast was directly destroyed by the Dragon Palace!<br/><br/>And they directly warned that if they dared to help the Sacred Dragon Clan, the Sky Plant Demonic Beast would end up like them?<br/><br/>“This dragon palace is too powerful. Who is the one who destroyed who?”<br/><br/>“One of the six major races and the Holy Dragon lineage was destroyed before they could even make a move. This is simply terrifying!”<br/><br/>“How powerful is the Dragon Palace?”<br/><br/>With the picture posted by Wang Xian, no one would think that the news from the Dragon Palace was fake!<br/><br/>There was no need for the Dragon Palace to release fake news!<br/><br/>Then, the question was, how strong was the Dragon Palace?<br/><br/>What kind of strength did they have to be able to destroy an extremely powerful sky plant demonic beast clan in such a short period of time?<br/><br/>This was too terrifying!<br/><br/>With such strength, other than the peak race, who else would be a match for the Dragon Palace?<br/><br/>It was probably very, very rare, right?<br/><br/>Just as countless people were boiling with excitement, baili archangel flew towards the Sky Plant Demonic Beast clan along with the Holy Dragon King and the rest of the powerhouses!<br/><br/>As they did not need to fly by themselves, the Holy Dragon King would look at the information on the universe’s AI from time to time.<br/><br/>He wanted to know if the Sky Plant Demonic Beast clan was really exterminated!<br/><br/>Wang Xian’s information was quickly seen by him. When he saw the contents of the information, his expression turned extremely ugly.<br/><br/>“Lord Baili the Archangel, the Sky Plant Demonic Beast clan has been exterminated. The Dragon Palace has posted this information on the universe’s AI!”<br/><br/>The Sacred Dragon King looked at the Great Angel and said with an ugly expression!<br/><br/>The Sky Plant Demon Beast clan had really been exterminated!<br/><br/>A powerful high-level race had exterminated them before they could react. The strength of the Dragon Palace was simply too terrifying!<br/><br/>Their strength was much stronger than the Sacred Dragon Clan!<br/><br/>“HM?”<br/><br/>Hearing the Holy Dragon King’s words, Baili Archangel’s expression froze. He took out a universe AI and his expression turned cold when he saw this information!<br/><br/>“The Dragon Palace is courting death. How dare they exterminate the subsidiary races of My Angel Race!”<br/><br/>Baili Archangel growled with a face full of killing intent!<br/><br/>“Hua La!”<br/><br/>He flapped his twelve angel wings and quickly flew towards the sky plant forest of the Sky Plant Demon Beast!<br/><br/>At the side, all the experts of the other five races also opened their universe AI. When they saw the threatening statement from the Dragon Palace, their expressions turned ugly!<br/><br/>“How dare you threaten us?”<br/><br/>The patriarch of the Mu God clan looked at this message coldly and his expression was extremely ugly!<br/><br/>Their Mu God clan’s strength was much stronger than the sky plant demon clan!<br/><br/>However, it was very difficult to destroy them!<br/><br/>In other words, the dragon palace was much stronger than them!<br/><br/>After the sky plant demon beasts were attacked by the Dragon Palace, they should have asked for help!<br/><br/>However, when they received the news, the sky plant demon beasts had been destroyed!<br/><br/>This meant that the sky plant demon beasts were destroyed very quickly!<br/><br/>To be able to exterminate the Dragon Palace, which had over twenty universe masters with level-three Combat Power, how powerful were they?<br/><br/>How many universe masters with level-three Combat Power did they have?<br/><br/>According to the law that only three universe masters of the same level could kill one, the Dragon Palace had over sixty universe masters with level-three Combat Power?<br/><br/>If the great beings of the ancestral dragon lineage were to make a move this time, then the Dragon Palace had over forty universe masters with level-three Combat Power?<br/><br/>Close to 50?<br/><br/>This number was much more than their shepherd God Clan!<br/><br/>If it was the shepherd God clan that was attacked, even if they were not destroyed, it would still be extremely tragic!<br/><br/>“Great Angel Baili, you must avenge the brothers of the Sky Plant Demon Beast Clan!”<br/><br/>The Sacred Dragon King’s expression kept changing as he spoke to the Great Angel Baili!<br/><br/>Now that the dragon palace had displayed such terrifying strength, the Sacred Dragon King did not have the confidence to destroy them!<br/><br/>If the Angel clan made a move, if this great angel Baili made a move, things would be different!<br/><br/>“Humph!”<br/><br/>Baili snorted lightly and didn’t say anything!<br/><br/>He was a little angry at the destruction of the Sky Plant Demonic Beast Race!<br/><br/>The subsidiary race of their Angel clan was also destroyed by a high-level race?<br/><br/>Is simply courting death!\t\t\t\t\t\t</div>", "images": {}, "success": true}