{"id": 584, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073069.html", "title": "Chapter 3575 - 3575 3,574 Hundred Archangels Charged Over!", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3575 - 3575 3,574 Hundred Archangels Charged Over!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3575 3,574 hundred archangels charged over!<br/><br/>This time around, they had annihilated the Sky Plant Demon Beast clan. There were close to a hundred universe masters with level-two combat strength!<br/><br/>These close to a hundred universe masters with level-two combat strength could give birth to nine universe masters with level-three combat strength in the Dragon Palace.<br/><br/>All in all, this battle could give the Dragon Palace an additional 33 universe masters with level-three combat strength!<br/><br/>Including the original 20 from the Dragon Palace, there was a total of 53!<br/><br/>With such strength, even if he were to face the Holy Dragon lineage and the five great races head-on, Wang Xian had some confidence!<br/><br/>Especially with the help of the 13 peak experts from the ancestral dragon lineage!<br/><br/>The improvement of the Dragon Palace began!<br/><br/>The universe’s AI was still boiling. Everyone wanted to know what the Holy Dragon lineage would do next!<br/><br/>They wanted to know how the Angel clan would react!<br/><br/>After all, the Sky Plant Demon Beast clan was a subsidiary clan of the Angel Clan!<br/><br/>“Sou!”<br/><br/>Time passed day by day. At the edge of the Sky Plant Forest, a group of figures flew into the depths at a terrifying speed!<br/><br/>Soon, they arrived at the core of the Sky Plant Demon Beast clan’s territory!<br/><br/>Above the waterfall, Baili Archangel was floating. He looked down with an embarrassed expression!<br/><br/>The Sky Plant Demonic Beast clan was in a mess and had no chance of survival!<br/><br/>Although many experts of the Sky Plant Demonic Beast clan had escaped in this battle, there wasn’t a single disciple of the Sky Plant Demonic Beast clan in the Sky Plant Demonic Beast’s nest!<br/><br/>Those who died died and those who fled!<br/><br/>The entire Sky Plant Demonic Beast clan had completely ceased to exist!<br/><br/>“Dragon Palace!”<br/><br/>Angel Baili spat out two words with a face full of killing intent.<br/><br/>“Lord Angel Baili!”<br/><br/>On the side, the Sacred Dragon King and the other experts looked at him and shouted with unsightly expressions!<br/><br/>“Let’s go to the Dragon Palace!”<br/><br/>Angel Baili waved his arm and the innate supreme treasure trial cross appeared in his hand!<br/><br/>He slashed forward and a black hole appeared.<br/><br/>He led them into the black hole immediately!<br/><br/>He rushed at full speed!<br/><br/>He took out his connate true treasure!<br/><br/>With the power of a connate true treasure, every place he passed would be filled with immense power!<br/><br/>Especially the power of a connate true treasure that could cut open the void space of the heavenly desolate land, the terrifying power of Heaven and earth made all the living beings around him tremble!<br/><br/>Universe Masters rushed forward in a vast and terrifying manner!<br/><br/>However, the living beings around them could only feel a terrifying pressure coming from the place they passed by, but they didn’t know what was going on!<br/><br/>His speed was too fast!<br/><br/>He could reach the river of eternity in at most a year!<br/><br/>“I really didn’t expect that Dragon Palace Dragon King could raise the dragon palace to such a level in such a short time!”<br/><br/>At this moment, more than ten great elves were sitting in a space of the tree of life in the territory of the Elf clan.<br/><br/>The Voice of life looked at some information on the universal AI with a surprised expression!<br/><br/>“I think that the Dragon King seems to have obtained the powerful inheritance of the Divine Dragon Clan. Otherwise, he couldn’t have improved so quickly!”<br/><br/>A great elf beside him guessed!<br/><br/>“The power of the five elements, the power of light and darkness. Hehe, isn’t this the combination of the Divine Dragon Clan’s five elements Dragon King and the light and Darkness Dragon King? I wonder if he has obtained the inheritance of that Lord Water Dragon!”<br/><br/>A great elf said with a smile!<br/><br/>“It shouldn’t be. If that Dragon King of the Dragon Palace had obtained the inheritance of that Lord Water Dragon, he wouldn’t have advanced to become the only Yin-yang five elements divine dragon in the universe. The Yin-yang five elements divine dragon sounds very powerful and is very heaven-defying. In fact, he has no fate with the heavenly yuan. If he had obtained the inheritance of that Lord Water Dragon, he wouldn’t have needed to cultivate other attributes!”<br/><br/>In the center, an old Great Elf shook his head!<br/><br/>“That’s true. Now that the Dragon Palace has destroyed the Sky Plant Demon Beast Clan, the Angel clan will not let this matter rest, right? There might be archangels who will attack them directly!”<br/><br/>Life Sound Arrow looked at the great elves around him and said, “Although there is an agreement between our peak races, the Angel clan also has their own reasons. Although this reason is not enough, why don’t I Go?”<br/><br/>“Sure, remind the angel race not to break the rules recklessly!”<br/><br/>The old Great Elf nodded!<br/><br/>The relationship between the Elf race and the Divine Dragon race was quite good!<br/><br/>In the previous era, the Divine Dragon Race and the Elf race fought side by side!<br/><br/>This was also the reason why the ELF race was willing to help the Divine Dragon Race!<br/><br/>From their point of view, the ancestral Dragon Clan and the Dragon Palace belonged to the Orthodox lineage of the Divine Dragon Clan.<br/><br/>This was especially so for the Dragon King of the Dragon Palace who had obtained the Five Elements Dragon King and the light and Dark Dragon King!<br/><br/>The sound of Life Arrow flew out from the Elf clan and flew rapidly towards the river of eternity!<br/><br/>Time passed day by day!<br/><br/>Two months later, the Dragon Palace absorbed all the resources of the Sky Plant Demonic Beast clan!<br/><br/>To Wang Xian’s regret, he did not achieve a breakthrough!<br/><br/>With the amount of dragon Qi that he needed to upgrade, he might need to destroy a species like the sky plant demonic beasts to improve his strength!<br/><br/>The same thing happened at the five elements grinding mill. He was still a little short of a breakthrough!<br/><br/>Although Wang Xian did not improve, the improvement of the Dragon Palace this time was huge!<br/><br/>There were 33 masters of the universe with level three combat strength!<br/><br/>There were more than 400 masters of the universe with combat strength above level three!<br/><br/>This brought the combat strength of the Masters of the universe in the Dragon Palace to more than 1,200!<br/><br/>This number was four times that of the sky plant demonic beasts!<br/><br/>“Prime Minister Gui, send the prickly dragon seed halberd dragon guard to the surroundings of the river of eternity. be on alert for the Holy Dragon Lineage!”<br/><br/>Wang Xian ordered Prime Minister Gui.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui replied immediately!<br/><br/>Currently, although the Dragon Palace had exterminated the heaven-planted demonic beasts, the strength of the Holy Dragon tribe was still not to be underestimated!<br/><br/>The necessary precautions had to be taken!<br/><br/>“Once there is any movement from the five great races, get an lie to bring them over and attack the lair of the five great races. I wonder if there are any experts from the Angel tribe guarding the lair of the five great races.”<br/><br/>“Also, this time, if we exterminate the heaven-planted demonic beasts, will the angel race react? The ELF race has said that the peak races are not allowed to participate in the affairs of the other low-level races. I wonder if that’s true!”<br/><br/>Wang Xian mumbled to himself as he considered what was going to happen next!<br/><br/>After exterminating the heaven-planted demonic beasts, the Holy Dragon lineage would definitely react!<br/><br/>The only thing was that he didn’t know if the Angel tribe would react!<br/><br/>If the Angel tribe really reacted, the dragon palace would have to think of a way to avoid it!<br/><br/>At that time, the Elf tribe would be an escape route!<br/><br/>Of course, this was only the worst-case scenario!<br/><br/>Time passed day by day. Wang Xian didn’t act rashly anymore. He was waiting for the other party’s reaction!<br/><br/>However, there was no reaction from the Holy Dragon lineage. This made Wang Xian even more vigilant.\t\t\t\t\t\t</div>", "images": {}, "success": true}