{"id": 588, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073077.html", "title": "Chapter 3579 - 3579 3578 Reinforcements! Scarlet Queen!", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3579 - 3579 3578 Reinforcements! Scarlet Queen!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3579 3578 reinforcements! Scarlet Queen!<br/><br/>If the Dragon Palace could still hold off this battle, then the Dragon Palace would be too heaven-defying!<br/><br/>Then, the Dragon Palace might be able to bring the Divine Dragon clan to the peak again.<br/><br/>The battle between the Divine Dragon Clan and the five great clans against the Dragon Palace spread like wildfire, and the entire heaven opening desolate continent was talking about it!<br/><br/>“HM?”<br/><br/>At this moment, in the land of Devil Bones, in a secret palace in the center of the spirit demon race.<br/><br/>Spirit Red Bone looked at the information on the universe AI and frowned slightly!<br/><br/>“My granddaughter, what’s bothering you? You only have 1,000 years to break through. If you cultivate in seclusion for another 1,000 years, you’ll be able to break through the shackles!”<br/><br/>In front of them, a burly three-meter-tall skeleton was sitting at a table. Its entire body was emitting a dark glow.<br/><br/>In front of them, there was blood-red wine. It looked at Red Spirit Bone and said with a smile!<br/><br/>On one side, Devil King Spirit poured a glass of wine for the skeleton!<br/><br/>“Grandpa, I’m Going Out!”<br/><br/>The spirit red bone looked at the skeleton and said!<br/><br/>“What?”<br/><br/>The skeleton raised its voice, and its eyes flickered with ghostly fire. “Is it because of the Dragon Palace?”<br/><br/>“Yes, Grandpa. The Dragon Palace is under siege by the six great races of the Holy Dragon. I have to go and help them!”<br/><br/>The Spirit Red Bone said firmly!<br/><br/>“In another thousand years, you will break through!”<br/><br/>The skeleton said slowly!<br/><br/>“Grandpa, Ten Thousand Years is just a snap of the fingers for you. It Won’t be long before I leave!”<br/><br/>The Spirit Red Bone said!<br/><br/>“Alright, we have to return the karma that we owe each other. After helping the Dragon Palace, we will come back!”<br/><br/>The skeleton pondered for a moment and did not stop him. He nodded!<br/><br/>“Thank you, Grandpa!”<br/><br/>Spirit red bone flew over and responded with a smile!<br/><br/>“Hehe, I happen to have two connate true treasures here. One is of the fire element and the other is of the darkness element. You can refine them!”<br/><br/>Skeleton looked at her and smiled. “After you refine them, with the inheritance you have obtained, with your current power, it will be very difficult for a true universe ruler to kill them!”<br/><br/>“Thank you, Grandpa!”<br/><br/>Spirit Red Bone thanked him!<br/><br/>“No need to thank me. Among my descendants, you are the only one who has given me face. You are the only one who can break through to the universe ruler realm!”<br/><br/>The skeleton said with a smile!<br/><br/>“Grandpa, Father, I’ll take my leave then. Maybe I’ll have already broken through when I come back!”<br/><br/>Spirit Red Bone said with a smile!<br/><br/>“Be careful!”<br/><br/>Spirit Demon Emperor ordered her from the side!<br/><br/>Spirit red bone nodded, and a trace of confidence appeared on her face!<br/><br/>She waved her hand and left!<br/><br/>“Sigh, the five great races, plus the Holy Dragon lineage, are still a little dangerous for this child, Red Bone. It’ll be great if she can break through to the universe ruler realm!”<br/><br/>Spirit Demon Emperor saw his daughter disappear, and a trace of worry appeared in his eyes!<br/><br/>Although Spirit Red Bone was invincible in his eyes, the Holy Dragon bloodline had more than 100 level-3 universe masters.<br/><br/>And she had a powerful trump card!<br/><br/>“I’m not worried if she hasn’t made a breakthrough. If she does, the Great Beings of the angel race will join the war. Red Bone has the fruit of resurrection. Even if she dies, I’m confident that she will become a universe master again in 10,000 years!”<br/><br/>Skeleton said with a smile!<br/><br/>He was not too worried about red bone going out this time!<br/><br/>He was the king of a region of the skeleton race. His granddaughter had already obtained a powerful inheritance, which meant that she could definitely step into the universe ruler realm!<br/><br/>With his training, he was confident that he could make a breakthrough after 10,000 years!<br/><br/>“That’s true. With you around, father-in-law, I don’t have to worry about anything!”<br/><br/>The spirit demon king said with a slightly flattering tone!<br/><br/>…<br/><br/>“Are you here?”<br/><br/>At the same time, at the location of the Dragon Palace, Wang Xian saw the information on the universal AI. His eyes were sparkling!<br/><br/>He looked at the location in front of him. That was the territory of the god Herders!<br/><br/>Not long after the Holy Dragon King and the rest left, Wang Xian had an lie bring them over!<br/><br/>Now, the eight limbed demon fiend and the rest had infiltrated the lair of the god Herder tribe!<br/><br/>Since the other party had started to make a move, he had to destroy their lair first!<br/><br/>As for the next step, Wang Xian was prepared to engage in guerrilla warfare with them!<br/><br/>Unless the top experts of the Holy Dragon tribe and the six major tribes were gathered together, Wang Xian would be able to defeat them one by one!<br/><br/>Buzz Buzz<br/><br/>At this moment, Wang Xian’s universal ai trembled!<br/><br/>He looked at the message on the universal AI and was slightly stunned!<br/><br/>The message was sent by Ling Honggu. She was rushing towards the Dragon Palace.<br/><br/>“Princess Ling Honggu, Our Dragon Palace doesn’t need any help for the time being. Thank you very much. Don’t Worry!”<br/><br/>Wang Xian replied immediately!<br/><br/>“It’s alright. I have already flown out from my race. My current strength is very strong. I can even kill ten experts with the combat strength of a level three universe dominator. I can even fight against a true universe Dominator!”<br/><br/>Very soon, the message from Ling Hong Gu was sent over again!<br/><br/>When Wang Xian saw it, he raised his eyebrows slightly!<br/><br/>He had the confidence to fight against a Master of the Universe?<br/><br/>He could kill ten masters of the universe with level-three combat strength?<br/><br/>Even Wang Xian himself did not have such confidence now!<br/><br/>“Is it because of the powerful inheritance power?”<br/><br/>Wang Xian mumbled.<br/><br/>Inheritance and inheritance were still different!<br/><br/>For example, an ordinary peak race would receive the inheritance of a peak race when they were born!<br/><br/>As for the inheritance of the spirit red bone, it was the inheritance of a level nine universe overlord, the Scarlet Queen.<br/><br/>This inheritance also included the Scarlet Queen’s body bone. It was different from the inheritance of a peak race when they were born!<br/><br/>This could be understood as the scarlet queen reincarnating and re-cultivating!<br/><br/>This kind of inheritance was undoubtedly the most terrifying!<br/><br/>It could easily kill existences of the same level!<br/><br/>And the Scarlet Queen was a peak powerhouse from the previous calamity. Her strength was even more terrifying!<br/><br/>“Alright, then I’ll have to thank Princess Spirit Red Bone.”<br/><br/>Wang Xian thanked her!<br/><br/>Such a powerful strength of spirit red bone was a considerable boost to the combat strength of the Dragon Palace!<br/><br/>Currently, there were more than 50 level 3 universe masters in the Dragon Palace!<br/><br/>He alone was comparable to 10, spirit red bone was comparable to 10, and with the ancestral dragon bloodline, this was equivalent to more than 80 level 3 universe masters!<br/><br/>Even Sacred Dragon Emperor and the five races had 100 level 3 universe masters, they could still withstand it!<br/><br/>“I can’t just withstand it. I have to be able to destroy them completely!”<br/><br/>Wang Xian mumbled to himself. He had to lure some of the other party’s experts over first and then kill them!<br/><br/>“I wonder if the other party will come to rescue me after ambushing the old nest of the god herders. However, I’m afraid that the other party is prepared. Let’s give it a try first!”<br/><br/>Wang Xian mumbled to himself as he looked at the position in front of him!\t\t\t\t\t\t</div>", "images": {}, "success": true}