{"id": 597, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073095.html", "title": "Chapter 3588 - 3588 3587 Divine Dragons, Giants, And Insects Landed On The Ground", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3588 - 3588 3587 Divine Dragons, Giants, And Insects Landed On The Ground</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3588 3587 divine dragons, giants, and insects landed on the ground<br/><br/>More than 50 experts from the Dragon Palace rushed over directly!<br/><br/>It was a strange charming dragon!<br/><br/>It was a powerful frost divine dragon!<br/><br/>This terrifying attack caused the expressions of the experts from the Holy Dragon King and the other three races to change drastically!<br/><br/>Their original intention of surrounding and killing Wang Xian and Ling Honggu vanished immediately!<br/><br/>“Frost Divine Dragon, there’s actually a frost divine dragon in the Dragon Palace!”<br/><br/>The Holy Dragon King stared at bei Shuang, widened his eyes, and roared in disbelief!<br/><br/>Frost Divine Dragon!<br/><br/>Around them, the leader of the giant of light, the leader of the light sound insect clan, and the rest looked at him with an abnormally embarrassed expression!<br/><br/>Frost Divine Dragon, a mutated existence in the Divine Dragon Clan!<br/><br/>Even when the Divine Dragon clan was at their peak, they were still considered top-notch existences!<br/><br/>The top-tier races were considered top-tier, but the top of the top was a mutated existence!<br/><br/>The mutated Dragon God could almost represent the top-tier combat power in the universe!<br/><br/>With the same level of combat power, one-on-one could crush other existences with peak bloodline constitutions!<br/><br/>Currently, in the universe, the only known mutated purebred Dragon God was probably the Dragon Palace, the Frost Dragon God!<br/><br/>“Oh no, the Dragon Palace is very powerful and terrifying, especially the two terrifying existences on the left and right. Each of them can easily kill an existence of the same level. We are not their match. What is the situation on the Mu God clan’s side? !”<br/><br/>The light giant patriarch’s expression changed drastically when he saw this situation and he shouted in shock!<br/><br/>What is this situation?<br/><br/>What was going on?<br/><br/>Didn’t the Dragon Palace attack the ancestral dragon bloodline?<br/><br/>Why did they suddenly appear on their side?<br/><br/>“Bang! Bang!”<br/><br/>While they were talking, they heard a loud crash on the ground!<br/><br/>Three Corpses fell from the sky!<br/><br/>They hit the ground and made a loud noise!<br/><br/>It was the fall of a giant, a divine light dragon, and a peak race!<br/><br/>“Hiss, this… the experts of the Dragon Palace are attacking the Holy Dragon, the light giants, and the light sound insects. Some of their experts have been killed!”<br/><br/>“The fall of the giant dragon, this… this…”<br/><br/>“What a terrifying collision. The Dragon Palace is so powerful. How dare they attack the Holy Dragon!”<br/><br/>“The Dragon Palace is so powerful. Where are the experts of the Mu God clan, the Black Mist Spirit clan, and the ghouls? Why did they leave?”<br/><br/>“It’s definitely the dragon palace that lured them away. It’s hard to say who will win this battle!”<br/><br/>Not far away in Litian city, when the experts and disciples in the city saw the battle here, they almost wet their pants in fear!<br/><br/>That incomparably terrifying energy impact could destroy half of the city with a casual strike!<br/><br/>Under the ravaging of that energy, they didn’t even have the chance to escape!<br/><br/>Fortunately, they were a little further away from the battlefield!<br/><br/>Even so, when they saw the corpse of the divine dragon giant falling, they were filled with shock!<br/><br/>The strength displayed by the Dragon Palace made them extremely terrified!<br/><br/>“Kill!”<br/><br/>When Wang Xian saw the subordinates of the Dragon Palace charging over, he shouted coldly. He swayed his huge body of the divine dragon and locked onto a giant of light!<br/><br/>On the opposite side, a blood-red figure with red bones was floating in the air. When he heard Wang Xian’s order, his dress fluttered even though there was no wind!<br/><br/>A blood-red long belt surrounded his body, making him look like an ice-cold bloodthirsty beauty!<br/><br/>At the center of her brows, a wisp of flame emerged!<br/><br/>The flame emitted a dazzling light and looked extremely ethereal!<br/><br/>The blood-red ribbon and the dazzling flame at her glabella were all innate supreme treasures!<br/><br/>The innate supreme treasures that her grandfather gave her!<br/><br/>All of them had been refined by her!<br/><br/>She locked her gaze on the Sacred Dragon King of the sacred dragon lineage and charged straight at him!<br/><br/>“The Mu God clan and the others were lured away on purpose. We were tricked into leaving the mountain. They want to destroy us one by one. Let’s go back!”<br/><br/>The tribe leader of the giant of light could sense the terrifying power of the Dragon Palace!<br/><br/>Sensing the terrifying power from Wang Xian and Ling honggu, he spoke with an embarrassed expression!<br/><br/>The attack on the Divine Shepherd clan was the Dragon Palace’s plan!<br/><br/>They deliberately lured them away so that they could destroy them one by one!<br/><br/>The strength of the Dragon Palace was not their match. However, once they were separated, the Dragon Palace would be stronger than them!<br/><br/>“Alright!”<br/><br/>The Holy Dragon King and the leader of the Lightsong Bug clan nodded their heads with an unsightly expression!<br/><br/>“All Disciples, return to your divine kingdom immediately!”<br/><br/>The leader of the giant of light roared loudly!<br/><br/>“Hehe, you want to escape? Dream On!”<br/><br/>Wang Xian laughed coldly and roared with an icy-cold face. He immediately changed his target and spun his Tai Chi Dragon!<br/><br/>At the same time, the five elements grindstone expanded and appeared beneath him!<br/><br/>The king of water touch and the spiritual soul were moved. Waves of defense were added to Wang Xian’s body!<br/><br/>“Roar!”<br/><br/>Wang Xian roared and charged toward the three races!<br/><br/>“Arrogant!”<br/><br/>When the tribe leader of the light tribe, the giant of light tribe and the rest saw that Wang Xian was charging toward them directly, their expressions turned ugly!<br/><br/>A pair of horns of light appeared above the head of the tribe leader of the lightsong worm tribe. A beam of light beam shot out from the horns and shot toward Wang Xian in an instant!<br/><br/>More than ten giants waved their arms. The giant of light beam flew to the top of their heads and smashed toward Wang Xian again!<br/><br/>“Roar! Roar!”<br/><br/>With a focused gaze, the pair of dragon eyes that were integrated into the dragon’s eyes went straight toward the laser beam of the lightsong worm tribe!<br/><br/>Whoosh<br/><br/>The primaless Saint Wings were flapped, and the time Shard, which had fused with the dragon scale, went straight for the giant of Light Mountain!<br/><br/>“Giant Axe!”<br/><br/>However, the leader of the giant of light raised his arm, and an incomparably terrifying giant axe appeared in his hand. He swung it straight at Wang Xian!<br/><br/>At the surrounding area, the other elite disciples also attacked Wang Xian!<br/><br/>However, a large portion of the giant of light and the strong disciples of the Lightsong Bug clan attacked the strong disciples of the Dragon Palace!<br/><br/>It was impossible for all of them to surround and attack Wang Xian!<br/><br/>Wang Xian’s face turned cold when he saw their attacks!<br/><br/>The attack of the giant of light, the attack of the leader of the Lightsong Bug clan, and the terrifying giant of light.<br/><br/>Faced with their attacks, Wang Xian did not dodge at all this time!<br/><br/>The power of the Tai Chi Dragon Disc was channeled, and the five elements Millstone was channeled as well. The earth element was used for defense!<br/><br/>The water touch king and the spirit spirit had set up the strongest defense!<br/><br/>Boom! Boom! Boom<br/><br/>In the next moment, Wang Xian used his dragon body to meet them head-on!<br/><br/>The sound of explosions reverberated throughout the entire sky, and a terrifying energy spread out in all directions!<br/><br/>“All disciples, flee immediately!”<br/><br/>When the leader of the giant of light saw Wang Xian charging over forcefully, his expression changed. He was extremely embarrassed as he warned the leader of the giant of light, A Level 1 and Level 2 universe dominator!<br/><br/>This time, the six great races were attacking the Dragon Palace, bringing along all the universe Dominators and above with them.<br/><br/>Boom<br/><br/>However, at this moment, Wang Xian’s body shook, and a wave of dragon’s might charged forward!<br/><br/>Under this wave of Dragon’s might, the first and second order masters of the universe trembled slightly!\t\t\t\t\t\t</div>", "images": {}, "success": true}