{"id": 594, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073089.html", "title": "Chapter 3585 - 3585 3584, Destroy The Experts Of The Three Great Races", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3585 - 3585 3584, Destroy The Experts Of The Three Great Races</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3585 3584, destroy the experts of the three great races<br/><br/>“Hehehe, it’s a success. The Dragon King and the others have succeeded. Disciples of the god Herding clan, your doomsday has arrived. Do you want to destroy our Dragon Palace?”<br/><br/>Mo Sha, who was located in the Central Palace of the grotto-heaven blessed land, roared with a sinister face. With a move of his palm, a wave of energy was transmitted to the area below!<br/><br/>At the same time, the powerful defense around the grotto-heaven blessed land slowly began to dissipate!<br/><br/>The defense had disappeared!<br/><br/>Inside the grotto-heaven paradise, Ba Qi, who was parasitizing the guardian deity, revealed a smile on his face!<br/><br/>Outside, Wang Xian also revealed a smile when he saw this scene!<br/><br/>“What’s going on? The defense of our grotto-heaven paradise seems to have disappeared? What’s going on?”<br/><br/>“Hiss, what happened? Why did the defense suddenly disappear? How did it disappear so quickly?”<br/><br/>“No, no, no, the defense is gone, the defense is gone!”<br/><br/>The sudden disappearance of the defense of the grotto-heaven blessed land stunned all the disciples of the Mu God clan. Their bodies trembled as they roared in horror!<br/><br/>How did the defense suddenly disappear?<br/><br/>Was it dissolved by the terrifying treasure of the Dragon Palace?<br/><br/>How could it be so strange!<br/><br/>“Hahaha, disciples of the Mu God clan, die!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>The defense of the grotto-heaven paradise disappeared, and the powerhouses of the Dragon Palace let out cold roars.<br/><br/>Ao Qitian and the rest did not hesitate at all and flew directly into the grotto-heaven paradise!<br/><br/>The terrifying energy was wreaking havoc in the grotto-heaven paradise!<br/><br/>“No, no, no, no!”<br/><br/>A voice of fear and despair came from the mouths of the disciples!<br/><br/>Wang Xian’s figure moved, and he instantly rushed up with a cold smile on his face!<br/><br/>The strongest among the disciples of the herdsman clan was only at the level of a universe knight. How could they resist against Wang Xian and his group of more than 40 Level 3 universe masters?<br/><br/>With a sweep of the energy, countless disciples were easily killed.<br/><br/>They couldn’t even escape!<br/><br/>Buzz<br/><br/>Wang Xian waved his arm and a demonic altar appeared in front of him!<br/><br/>“Leave no one alive. Let’s finish this battle quickly!”<br/><br/>Ao Qitian and the rest roared. The disciples of the herdsman clan were quickly annihilated!<br/><br/>Forty Level 3 universe masters with combat strength were attacking at the same time. It was absolutely devastating in this small space!<br/><br/>In less than a second, all the disciples of the herdsman clan were killed!<br/><br/>Only those disciples with Resurrection Treasures escaped the calamity!<br/><br/>“Dragon King!”<br/><br/>After these disciples were killed, an Lie’s figure appeared!<br/><br/>“Let’s Go!”<br/><br/>Wang Xian swept his gaze across the surrounding experts of the Dragon Palace and gave an order!<br/><br/>“It’s the Dragon King!”<br/><br/>One by one, the experts of the Dragon Palace flew over and arrived around an lie!<br/><br/>Buzz<br/><br/>The next moment, their figures left!<br/><br/>There wasn’t even a corpse in the blessed land of the god Shepherd tribe!<br/><br/>“Dragon Palace, you are courting death!”<br/><br/>At this moment, figures were flying over from the deeper parts of the god Mu clan. Their bodies were emitting terrifying auras!<br/><br/>The patriarch of the god Mu clan was at the front. He stared in the direction of the Blessed Land and let out a furious roar!<br/><br/>“Boom! Boom! Boom!”<br/><br/>At this moment, hundreds of figures flew over from the left and right sides. They were also emitting vast and terrifying energy!<br/><br/>They were the experts of the black fog spirit race and the corpse-eating ghost race!<br/><br/>Before they left, the six great races had already set up interconnecting arrays so that they could quickly gather together!<br/><br/>“Oh?”<br/><br/>The experts of the Mu God race, the Black Fog Spirit race, and the corpse-eating ghost race flew over. As they got closer to the center, they revealed astonished expressions!<br/><br/>They didn’t sense any powerful energy in front of them. They didn’t even sense any living beings in front of them!<br/><br/>“What’s going on?”<br/><br/>A peak expert of the Mu God clan revealed an astonished expression. His gaze focused as he slightly increased his speed!<br/><br/>The patriarch of the Mu God clan also increased his speed as he rushed towards the grotto-heaven blessed land!<br/><br/>“This… this…”<br/><br/>However, when they saw the situation in the grotto-heaven blessed land, their faces were filled with astonishment and shock!<br/><br/>“How did the defense of the grotto-heaven blessed land disappear? Where are the disciples of our God Mu Clan? Where are the people of the Dragon Palace? What Happened?”<br/><br/>A peak expert of the god Mu clan growled in a low voice!<br/><br/>The patriarch of the god Mu clan stared ahead and suddenly had a bad premonition!<br/><br/>He immediately came to the sky above the Mu God clan’s grotto-heaven blessed land!<br/><br/>“What’s going on? Patriarch of the Mu God clan?”<br/><br/>The patriarchs of the Black Fog Spirit clan and the corpse-eating ghost clan flew over and asked curiously!<br/><br/>The Patriarch of the Black Fog Spirit clan scanned his surroundings. He had an extremely sharp nose, as though he could smell anything!<br/><br/>“I can smell death. There were countless deaths and injuries down here just a dozen seconds ago!”<br/><br/>The Patriarch of the Black Fog Spirit Race said with a grave expression!<br/><br/>His words caused the patriarch’s body to tremble, and his expression turned extremely ugly!<br/><br/>“A disciple of our Mu God race…”<br/><br/>When the surrounding experts of the Mu God race heard this, their eyes turned slightly red!<br/><br/>“My God Kingdom!”<br/><br/>The patriarch’s body trembled, and his God kingdom appeared behind him!<br/><br/>With a wave of his arm, a book flew out of his divine kingdom!<br/><br/>On the book, there were five big words written on the Patriarch’s family tree!<br/><br/>He flipped open the family tree and saw the words on it. His eyes almost popped out of their sockets!<br/><br/>The names on the family tree had decreased by 70% !<br/><br/>This also meant that 70% of their disciples had died!<br/><br/>“Dragon Palace, Dragon King!”<br/><br/>The patriarch of the shepherds, who was holding the family tree in his hand, let out a mournful roar!<br/><br/>70% of their disciples had died. This was the foundation of their shepherds!<br/><br/>How Long would it take for them to recover?<br/><br/>“All the disciples of our shepherds in the grotto-heaven blessed land have been killed. All of them have been killed!”<br/><br/>Around them, the experts of the shepherds trembled when they saw the furious patriarch. Their eyes were bloodshot!<br/><br/>Seventy percent of their disciples had been killed. This was an irreconcilable feud!<br/><br/>“Hiss, this… this… We rushed here so quickly, but our disciples were still killed?”<br/><br/>When the experts of the Black Fog Spirit clan and the corpse-eating ghost clan saw this scene, their expressions changed slightly!<br/><br/>The attack of the Dragon Palace was simply too fast!<br/><br/>The patriarch and the others had rushed over after receiving the message. Just like that, they were still too late!<br/><br/>They were shocked that they had broken through the defense of the blessed land so quickly!<br/><br/>“Hu hu!”<br/><br/>The experts of the shepherds were breathing fast, and their faces were extremely ugly!<br/><br/>The experts of the black fog spiritual race and the Ghoul tribe also had ugly expressions!<br/><br/>The Dragon Palace was stronger than they had imagined, and more cunning than they had imagined!<br/><br/>“Dragon Palace, I want all of your disciples to enjoy millions of years of torture. I want every one of your disciples to live in endless torture and pain. I want you to beg for Death!”<br/><br/>The patriarch of the god Mu clan raised his head and roared with a ferocious face!<br/><br/>He wanted to avenge his disciples and make the Dragon Palace pay ten times or a hundred times the price!\t\t\t\t\t\t</div>", "images": {}, "success": true}