{"id": 592, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073085.html", "title": "Chapter 3583 - 3583 3582 Luring The Tiger Away From The Mountain", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3583 - 3583 3582 Luring The Tiger Away From The Mountain</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3583 3582 luring the tiger away from the mountain<br/><br/>“Sou Sou Sou!”<br/><br/>Inside the heaven opening primal continent, the Sacred Dragon King and his team were flying at high speed. Not far from them, there was a city where they could teleport!<br/><br/>“Weng Weng Weng!”<br/><br/>Right at this moment, the tribal leader of the god Shepherd tribe was standing above the ancient god corpse. A hurried voice came from the universe ai!<br/><br/>He immediately opened it to take a look, and when he saw the contents, a cold killing intent rose from his body!<br/><br/>“HM?”<br/><br/>“Patriarch of the Mu God clan, what’s Wrong?”<br/><br/>In the surrounding area, Sacred Dragon Emperor and the others sensed the killing intent of the Patriarch of the Mu God clan. They were slightly stunned, and their faces were full of shock as they asked!<br/><br/>“The Dragon Palace ambushed our Mu God clan!”<br/><br/>The patriarch said with killing intent!<br/><br/>“Patriarch, with the defense of your grotto-heaven blessed land, you should be able to withstand the attack of a true universe overlord!”<br/><br/>The patriarch of the light giant clan said from not far away!<br/><br/>“Yes, I’ve already arranged everything in the clan. Nothing will happen. It’s just that some of the buildings will be destroyed by the beasts of the Dragon Palace!”<br/><br/>The clan leader of the god-herding clan nodded his head coldly!<br/><br/>“That’s good. The buildings can be restored quickly. This time, when we arrived at the Dragon Palace, all the disciples of the Dragon Palace, except for the purebred divine dragon, were killed!”<br/><br/>The Holy Dragon King spoke!<br/><br/>“I want to merge them into the god’s corpse and make them suffer great fear and pain!”<br/><br/>The clan leader of the god-herding clan spoke with a furious face.<br/><br/>…<br/><br/>“The grotto-heaven blessed land is right here!”<br/><br/>At the same time, Wang Xian and the rest arrived at the center of the god-herding Clan’s lair, right in front of the grotto-heaven blessed land!<br/><br/>The god-herding clan was located in a plain, right in the center. A huge defensive barrier was erected.<br/><br/>The entire area was about a hundred million kilometers wide!<br/><br/>The defensive barrier of the grotto-heaven blessed land was emitting a luster, just like the god of light grass that was gathered together!<br/><br/>They could see through the protective shield and see the situation inside!<br/><br/>“Dragon Palace, you guys actually dared to ambush us, the god herders. Haha, you guys didn’t expect this, did you? We have already made preparations. In less than a few levels, our clan leader and the rest will exterminate your Dragon Palace!”<br/><br/>In the interior of the grotto-heaven’s Protective Shield, the guardian deity roared coldly when he saw Wang Xian and the rest arriving!<br/><br/>“Today, you ambushed us, the god-herding clan. We will make you pay with your lives. Haha!”<br/><br/>“Haha, You Want To Ambush Us? Wishful thinking. Just wait for the judgment of our god-herding clan!”<br/><br/>In the grotto-heaven blessed land, a group of strong disciples of the god-herding clan roared!<br/><br/>“Hehe, do you think that our Dragon Palace doesn’t know that you are ready? Do you think that we can’t do anything to You?”<br/><br/>Wang Xian was floating in the sky above the blessed land of the god Herder tribe as he spoke with a cold smile on his face!<br/><br/>Around them, the experts from the spirit red bone tribe and the Dragon Palace were emitting a terrifying aura as they stared at them!<br/><br/>“Haha, this Blessed Land of ours can withstand the attacks of a true master of the universe. Do you really think that your dragon palace can break through our defenses?”<br/><br/>Inside the grotto-heaven paradise, the guardian deity laughed maniacally. “Even if I let you attack for ten years, you won’t be able to break through it. Soon, Your Dragon Palace will be attacked and destroyed by our clan leader.”<br/><br/>“Hmph, you can withstand the attacks of Masters of the Universe? Then I want to see if you can withstand the attacks of the Supreme Treasures of my Dragon Palace!”<br/><br/>Wang Xian sneered and waved his arm. A terrifying dragon head condensed in the sky!<br/><br/>Boom<br/><br/>Around him, the experts of the Dragon Palace waved their arms and channeled their energy into the dragon head in the sky!<br/><br/>Roar! Roar! Roar<br/><br/>An earth-shattering roar came from the dragon head. The terrifying dragon head looked abnormally terrifying!<br/><br/>In the grotto-heaven blessed land, all of the Mu God clan’s disciples could clearly see the terrifying dragon head!<br/><br/>“Lord Guardian Deity, the Dragon Palace’s Dragon King’s attack is so terrifying. Is that Dragon head a powerful treasure?”<br/><br/>Beside guardian deity, an expert of the Mu God clan asked loudly!<br/><br/>His words were clearly heard by all the Mu God clan’s disciples behind him!<br/><br/>“It’s a powerful true treasure. It should be an innate true treasure, but we don’t have to worry at all. Our Mu God clan’s grotto-heaven blessed land can not be broken by a universe ruler level four great being, and neither can their Dragon Palace!”<br/><br/>The Guardian God said confidently!<br/><br/>“I’ve heard from my great-grandfather that our grotto-heaven Blessed Land’s defense is abnormally strong. It can not be broken by any race other than a peak race!”<br/><br/>“That’s right, that’s right. I’ve also heard from my father that we are the safest within the paradise. Their wish to ambush us is destined to fail. When our clan leader reaches the Heavenly River of the Dragon Palace, it will be time for them to be annihilated and flee!”<br/><br/>Behind them, disciples shouted loudly!<br/><br/>“Attack!”<br/><br/>At this moment, they heard a cold roar coming from outside!<br/><br/>“Roar Roar!”<br/><br/>They saw an extremely terrifying attack heading towards their grotto-heaven blessed land’s defenses!<br/><br/>When they saw the incomparably terrifying dragon head, their hearts were slightly shocked!<br/><br/>If they did not have the grotto-heaven blessed land’s defenses, they would definitely die!<br/><br/>“Bang Bang!”<br/><br/>At this moment, an extremely terrifying roar sounded out. The terrifying dragon head landed on the grotto-heaven blessed land’s defenses. When the dragon head landed on it, they could clearly see it. At a close distance, they were extremely shocked!<br/><br/>When the dragon head landed on the defense of the grotto-heaven blessed land, there was not the slightest fluctuation in the defense!<br/><br/>“The defense of our grotto-heaven blessed land is still very strong!”<br/><br/>When the group of disciples of the god Herder clan saw it, they heaved a sigh of relief!<br/><br/>This gigantic dragon head looked extremely terrifying!<br/><br/>“Hehe, this is just the beginning. Do you think that the defense of your grotto-heaven Blessed Land is invincible? Just wait for it to shatter. If you want to destroy our Dragon Palace, I will destroy all of You First!”<br/><br/>At this moment, Wang Xian’s cold voice came from outside!<br/><br/>“Huh?”<br/><br/>All the disciples of the god of Mu clan frowned slightly when they heard the confident voice coming from outside!<br/><br/>Boom<br/><br/>At this moment, they saw the huge dragon head releasing a dark dragon breath!<br/><br/>The Dark Dragon Breath charged toward the defense of their grotto-heaven paradise!<br/><br/>In an instant, that area was enveloped by dark energy!<br/><br/>In front of them, the guardian deity’s eyes flickered when he saw this scene!<br/><br/>His right leg moved slightly, and a wave of energy spread towards the area that had been attacked!<br/><br/>This was a stream of venom. Without the attention of all the disciples of the God Shepherd clan, it had arrived at the area covered by the Black Dragon Breath!<br/><br/>The stream of Venom slowly dripped downwards!<br/><br/>“What!”<br/><br/>At this moment, the guardian God exclaimed and stared at the place where the venom dripped. “What’s going on? Why is there energy dripping into our grotto-heaven blessed land?”<br/><br/>“Eh?”<br/><br/>“What’s going on?”<br/><br/>The disciples of the shepherd God Clan in the grotto-heaven blessed land were slightly shocked when they saw this scene!<br/><br/>The Dragon King of the Dragon Palace and the others had invaded the place with energy?\t\t\t\t\t\t</div>", "images": {}, "success": true}