{"id": 593, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073087.html", "title": "Chapter 3584 - 3584 3583 Was Luring The Tiger Away From The Mountain", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3584 - 3584 3583 Was Luring The Tiger Away From The Mountain</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3584 3583 was luring the tiger away from the mountain<br/><br/>“What’s going on?”<br/><br/>“How can there be energy dripping down? With the defenses of our paradise, even universe masters and level four experts can’t break through it. How is this possible! ?”<br/><br/>Exclamations once again came from the experts surrounding the guardian deity!<br/><br/>The Guardian deity of the Mu God clan moved, his face solemn as he approached that area!<br/><br/>Behind him, thousands of strong disciples of the Mu God clan followed closely, their eyes fixed on that place!<br/><br/>“How is this possible? The defenses of our grotto-heaven blessed land are so strong, how could it be invaded? What kind of treasure does the Dragon King of the Dragon Palace have?”<br/><br/>The Guardian deity roared loudly with a face full of shock!<br/><br/>“Lord Guardian deity, there’s also corrosive poison pouring into our grotto-heaven blessed land. They’re corroding the defenses of our grotto-heaven blessed land!”<br/><br/>“At this rate of corrosion, it won’t be long before they are completely corroded. What should we do?”<br/><br/>“Damn it, how is this possible? How can they break through the defense of our grotto-heaven blessed land!”<br/><br/>“The Dragon King of the Dragon Palace must have a special and powerful treasure!”<br/><br/>The shocked voice came from the mouth of the experts of the god herding clan who were guarding around the guardian deity!<br/><br/>They were all shouting in shock!<br/><br/>Each and every one of them was filled with shock and disbelief!<br/><br/>The faces on their faces were, well, very lifelike, at the level of best actor!<br/><br/>That’s right, they were all best actor!<br/><br/>This drop of poison was released by the deity Guardians, which was also the host on their bodies!<br/><br/>As for the surrounding deity guardians, they had long been parasitized by the poisonous horned dragon seed!<br/><br/>It could be said that the 1,000 strong experts in this blessed land had all been parasitized!<br/><br/>They gathered in the surroundings and cried out in alarm. Behind them, all the disciples widened their eyes and revealed shocked expressions!<br/><br/>“How is this possible? They actually have a treasure that can penetrate our defenses!”<br/><br/>“Oh no, if our defenses are broken, won’t we be finished?”<br/><br/>“We’re finished, we’re finished. We have to get our clan leader and the others to come and rescue us. Otherwise, once our defenses are broken, we won’t be able to resist at all!”<br/><br/>The group of disciples started to Panic!<br/><br/>Their faces were filled with Panic!<br/><br/>“Not good, the poison invading is increasing. We have to report to the clan leader and the others immediately!”<br/><br/>At this moment, another great being shouted loudly!<br/><br/>“I’ll report it!”<br/><br/>Ba Qi, who was parasitizing the guardian deity’s body, curled the corner of his mouth slightly. He immediately took out his universe AI and sent out a message asking for help!<br/><br/>This time, Ba Qi, Mo Sha, and the others’parasitism went exceptionally smoothly!<br/><br/>This was because the only guardian deity with the combat power of a level 3 universe ruler was in the Central Palace of the grotto-heaven blessed land!<br/><br/>After they entered, the other party didn’t suspect anything and easily leeched on them!<br/><br/>The most important step of luring the tiger away from the mountain had been completed. Now, it was time to transfer the experts of the shepherd God clan over!<br/><br/>The message was sent out!<br/><br/>At the back, there were also many disciples who sent the message to their elders. Their father and the other experts who had followed their clan leader on the expedition!<br/><br/>…<br/><br/>In the expedition team of the Sacred Dragon King and the six great clans.<br/><br/>Because they had received the news that the clan had been ambushed by the Dragon Palace, they didn’t look too good!<br/><br/>Their bodies were also filled with a strong murderous aura!<br/><br/>However, they didn’t pay too much attention to it!<br/><br/>Their grotto-heaven blessed land had a terrifying defense!<br/><br/>But at the same time, the clan leader and the experts of the clan received messages one after another!<br/><br/>When they saw this message, their expressions changed greatly!<br/><br/>“Damn it, how is this possible? The Dragon Palace has a treasure that can break through the defenses of our clan’s grotto-heaven blessed land. Damn it!”<br/><br/>When the clan leader saw the message sent by the guardian deity, his expression was abnormally ugly!<br/><br/>“Clan leader, we have all received a message from our disciples. The other party has a terrifying divine dragon treasure that is eroding the defenses of our grotto-heaven blessed land. There is also a poison invading. Who knows how long the defenses can last!”<br/><br/>An expert from the god Shepherd clan walked over and said with an embarrassed expression!<br/><br/>“I have also received it. There is also a video sent by our disciples. The Dragon Palace has a special treasure!”<br/><br/>The experts surrounded them with extremely embarrassed expressions!<br/><br/>When the Sacred Dragon King and the others heard this message, their expressions changed slightly!<br/><br/>They did not have too much doubt that the Dragon Palace had a treasure that could break through the defenses of the powerful grotto-heaven blessed land!<br/><br/>That was because the Sacred Dragon King’s sacred dragon lineage had one!<br/><br/>However, such treasures were extremely rare. Among the six great races, including the Heaven Plant Demonic Beast race that had been exterminated, only the sacred dragon lineage had one of the seven high-level races!<br/><br/>They had never expected that the Dragon Palace would have one!<br/><br/>“Let’s go back immediately!”<br/><br/>The patriarch of the god Mu clan said with a gloomy face!<br/><br/>The defense of the grotto-heaven blessed land couldn’t be broken, and the disciples there couldn’t die!<br/><br/>Those were all the disciples of the Mu God clan, and they were the foundation of the Mu God clan!<br/><br/>“According to the plan!”<br/><br/>The patriarch of the Mu God clan looked at the experts of the Black Fog Spirit clan and the corpse-eating ghost clan.<br/><br/>“Okay, according to the plan, we will go to support them immediately!”<br/><br/>The patriarchs of the Black Fog Spirit clan and the corpse-eating ghost clan nodded.<br/><br/>“Go Back!”<br/><br/>The patriarch of the Mu God clan let out a low growl with a gloomy face and disappeared!<br/><br/>The experts immediately followed him!<br/><br/>“Sacred Dragon King, Patriarch of the light giant clan and Patriarch of the Light Sound Worm clan, wait for our news here!”<br/><br/>The patriarchs of the Black Fog Spirit clan said!<br/><br/>“Alright, if you run into any trouble, inform us immediately. We can rush over immediately!”<br/><br/>The clan leader of the light giant clan nodded his head!<br/><br/>The clan leaders of the Black Fog Spirit clan and the corpse-eating ghost clan nodded their heads and left immediately with a group of experts!<br/><br/>“This damned Dragon Palace can actually break open the Divine Shepherd clan’s grotto-heaven blessed land!”<br/><br/>The clan leader of the light sound insect clan saw them leave and said angrily!<br/><br/>“Hmph, they’re just delaying the time of destruction!”<br/><br/>The Sacred Dragon King said with a gloomy face!<br/><br/>“Let’s go, we will wait in the city in front of us!”<br/><br/>He looked forward and said!<br/><br/>The experts of the three great races immediately nodded!<br/><br/>However, in the city, several pairs of eyes watched the experts of the god Shepherd clan leave!<br/><br/>Seeing the Sacred Dragon King and the other two races flying toward them, a smile appeared on his face!<br/><br/>A message was quickly transmitted over!<br/><br/>“It’s a success!”<br/><br/>In the next moment, Wang Xian, who was in front of the protection of the Blessed Land of the god Shepherd tribe, received the message from an lie and the rest. A smile appeared on his face!<br/><br/>He had succeeded in luring the tiger away from the mountain!<br/><br/>The six races were divided into two forces. Three races came to provide support while the other three races waited there!<br/><br/>Inside the grotto-heaven blessed land, Ba Qi, who was parasitizing the guardian deity, also received this message!<br/><br/>In the palace in the center of the grotto-heaven blessed land, Mo Sha, who had been hiding inside, also received this message!\t\t\t\t\t\t</div>", "images": {}, "success": true}