{"id": 591, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073083.html", "title": "Chapter 3582 - 3582 3581 Attacked The God Shepherd Tribe!", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3582 - 3582 3581 Attacked The God Shepherd Tribe!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3582 3581 attacked the god Shepherd tribe!<br/><br/>“It’s time to act!”<br/><br/>All the high-end combat strength of the six great tribes of the Holy Dragon Lineage were heading towards the Dragon Palace!<br/><br/>In half a year’s time, they had covered half of the journey!<br/><br/>Wherever they went, the strong disciples of all the tribes were shocked beyond words!<br/><br/>The terrifying might of the six great tribes was suffocating!<br/><br/>Half a year later, the eight-limbed demonic fiend was ready. Wang Xian and the rest were also ready!<br/><br/>Buzz<br/><br/>“Greetings, Dragon King!”<br/><br/>In front of Wang Xian, Ling Honggu, and the rest, the figures of the powerhouses from the Dragon Palace slowly appeared!<br/><br/>Forty powerhouses with level-three combat strength, masters of the universe, stood in front of them in an orderly manner!<br/><br/>They looked at Wang Xian and bowed respectfully!<br/><br/>“An lie, how are the preparations on the Heaven Formation?”<br/><br/>Wang Xian took a look and asked an lie who was beside him!<br/><br/>“Dragon King, the Heaven Formation has been set up and is waiting for the other party!”<br/><br/>An lie reported with a smile!<br/><br/>“Very good, let’s do it!”<br/><br/>Wang Xian nodded his head and took the lead to fly forward!<br/><br/>In front of him was the lair of the god herders.<br/><br/>“Roar!”<br/><br/>The group of experts from the Dragon Palace let out a low roar and followed closely behind!<br/><br/>Ling Honggu scanned the surroundings.<br/><br/>There were not many strong disciples in the lair of the herdsman clan!<br/><br/>Only a few courageous and fearless disciples were strolling around!<br/><br/>After all, there were still a lot of disciples of the herdsman clan. Some of them did not think that the Dragon Palace would attack them!<br/><br/>Of course, there were also some disciples who thought that they were lucky!<br/><br/>The god-herding clan did not care about these disciples. After all, they could monitor the situation outside instantly when they were out in the open!<br/><br/>“Kill! Kill all the disciples of the god-herding clan. Destroy all the buildings!”<br/><br/>Wang Xian flew forward and commanded with a face full of killing intent!<br/><br/>The god-herding clan had sent out the ancient God’s corpse. If they wanted to destroy the Dragon Palace, they would have to face the revenge of the Dragon Palace!<br/><br/>“It’s the Dragon King!”<br/><br/>The disciples of the Dragon Palace immediately responded!<br/><br/>Wang Xian and the rest were very fast. There were no more experts around the Divine Shepherd clan!<br/><br/>The speed at which they flew over was far from what the disciples could react to!<br/><br/>Boom! Boom! Boom<br/><br/>After stepping into the territory of the Divine Shepherd clan, the experts of the Dragon Palace saw the disciples of the Divine Shepherd clan and sensed the aura of any life. Immediately, waves of terrifying energy engulfed them!<br/><br/>“What?”<br/><br/>Some of the disciples of the god-herding clan sensed the terrifying energy and turned their heads to look. Their faces were filled with despair!<br/><br/>Boom! Boom<br/><br/>A terrifying explosion sounded. Wang Xian and the rest were still flying forward rapidly!<br/><br/>The explosion from this side immediately attracted the attention of the disciples at the center of the god-herding clan.<br/><br/>They hurriedly flew out of the building and looked outside!<br/><br/>“No!”<br/><br/>However, at this moment, they felt death approaching!<br/><br/>An energy that could easily destroy them covered the area in front of them!<br/><br/>“Boom!”<br/><br/>The sound of an explosion rang out once again!<br/><br/>“An expert has invaded our mu God clan! An expert has invaded us!”<br/><br/>Some disciples shouted in horror!<br/><br/>They almost peed their pants and fled into the distance!<br/><br/>Some of them wanted to return to their God realms immediately!<br/><br/>“Weng!”<br/><br/>However, at this moment, a wave of despairing pressure covered them. Under this pressure, their bodies couldn’t move at all!<br/><br/>This was the dragon’s might, a terrifying dragon’s might!<br/><br/>“It’s the Dragon Palace, it’s the Dragon Palace’s experts. They actually dared to sneak attack our god Mu Clan!”<br/><br/>Those disciples’bodies trembled violently as they raised their heads with great difficulty to look outside.<br/><br/>“Roar! Roar! Roar!”<br/><br/>At this moment, a roar was heard. They saw waves of flames and terrifying torrents coming towards the center of their God Shepherd Race!<br/><br/>The violent attacks, whether it was the disciples or all the buildings, all suffered a devastating blow!<br/><br/>“It’s the experts of the Dragon Palace. They are here. Run, run!”<br/><br/>At this moment, the disciples of the shepherds, who weren’t hiding in the divine realm or the grotto-heaven blessed land, regretted their actions!<br/><br/>They shouldn’t have been so suicidal!<br/><br/>They shouldn’t have thought that they were lucky!<br/><br/>However, it was too late!<br/><br/>Waves of terrifying attacks covered them, and the center of the shepherds immediately fell into the flames of war!<br/><br/>“Oh?”<br/><br/>“Lord Guardian Deity!”<br/><br/>At the same time, it was located at the core of the shepherd God Clan!<br/><br/>This was the center of the shepherd God Clan, and it was also the strongest grotto-heaven blessed land of the shepherd God Clan!<br/><br/>Now, the defenses of the grotto-heaven blessed land had been activated, and a large number of the shepherd God clan disciples were located within the Grotto-heaven blessed land!<br/><br/>When the outside was attacked, the experts of the grotto-heaven blessed land immediately saw the information!<br/><br/>They immediately flew into the central palace and reported the situation to their guardian deity!<br/><br/>The Guardian deity of the Mu God race must be a level 3 universe overlord expert!<br/><br/>At the next moment, a figure rapidly flew towards the edge of the grotto-heaven paradise!<br/><br/>Behind him were the disciples of the experts of the Mu God race!<br/><br/>“What happened?”<br/><br/>“It seems that there are intruders from our clan. It’s the Dragon Palace! How dare they attack us!”<br/><br/>“Damn the Dragon Palace! They took advantage of the departure of our clan leader to attack us!”<br/><br/>In the grotto-heaven blessed land, the disciples of the clan also noticed the situation outside and immediately flew to the edge!<br/><br/>They looked outside with eyes full of killing intent!<br/><br/>“Whoosh!”<br/><br/>At this moment, a figure covered in armor and emitting golden light came to the edge. He stared ahead and the corners of his mouth curled up slightly!<br/><br/>“It’s the Dragon Palace. Damn the Dragon Palace. The patriarch and the others have guessed correctly. They might launch a sneak attack on our shepherd God Clan!”<br/><br/>He stared ahead and let out a furious roar filled with killing intent!<br/><br/>“Lord Guardian deity, they are destroying our home!”<br/><br/>A group of expert disciples flew behind him and roared angrily!<br/><br/>“Humph! Fortunately, the patriarch was prepared. The defense of our grotto-heaven paradise couldn’t even be broken by a universe overlord realm expert. Even a small dragon palace couldn’t be broken through. When our patriarch and the others step into the Heavenly River, the Dragon Palace will be destroyed!”<br/><br/>The Guardian deity said with a face full of killing intent!<br/><br/>At the same time, he took out the universe AI and immediately passed on the news of the Mu God clan being attacked to the clan leader!<br/><br/>“It’s fortunate that clan leader and the others had long warned us!”<br/><br/>“Damn the Dragon Palace. They are not far from destruction, yet they still dare to sneak attack us!”<br/><br/>“They are struggling on the verge of death. They are retaliating before they die, but our clan leader has already made preparations.”<br/><br/>Behind them, all the powerful disciples from the Mu God clan’s grotto-heaven blessed land flew over and roared with killing intent!<br/><br/>In the front, the guardian deity heard their low roars and a cold killing intent flashed in his eyes!<br/><br/>He didn’t know whether the Dragon Palace would be destroyed or not!<br/><br/>But all of you will die immediately!\t\t\t\t\t\t</div>", "images": {}, "success": true}