{"id": 595, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073091.html", "title": "Chapter 3586 - 3586 Among The 3,585 Experts From The Three Major Races", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3586 - 3586 Among The 3,585 Experts From The Three Major Races</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3586 Among the 3,585 experts from the three major races<br/><br/>“Buzz!”<br/><br/>Just as the pastors rushed over and saw that all their disciples had been killed, they were extremely furious!<br/><br/>It was located in the inner part of the heaven-opening primal continent, in front of Litian City!<br/><br/>Litian city was a neutral city that was not very strong. The strongest expert in the city was only a level one universe overlord!<br/><br/>On the right side of the city, Wang Xian and the rest slowly appeared!<br/><br/>“Dragon King, the Holy Dragon lineage, the giant of light tribe, the hissing light bug tribe, and the rest are in the east of Litian City. They are monitoring them from a distance!”<br/><br/>An Lie, who was at the side, said to Wang Xian!<br/><br/>“Okay!”<br/><br/>Wang Xian nodded his head and looked in that direction with a twinkle in his eyes!<br/><br/>Even though they were far away, they could feel the terrifying might coming from that direction!<br/><br/>“In order to prevent any accidents, we must act immediately. We can’t let them escape. We can’t let them return to their divine kingdom!”<br/><br/>Wang Xian swept his gaze across the group of experts from the Dragon Palace and gave an order!<br/><br/>“It’s the Dragon King!”<br/><br/>The group of experts nodded their heads.<br/><br/>“Hong Gu, I’ll have to trouble you to take action next. The two of US will kill the other party’s experts quickly and snipe those who want to escape immediately!”<br/><br/>Wang Xian looked at Ling Hong Gu and said!<br/><br/>Ling Hong Gu nodded. “Alright, I’ll do my best!”<br/><br/>“Let’s Go!”<br/><br/>Wang Xian and the rest concealed themselves and flew towards the team of the three major races of the Holy Dragon lineage!<br/><br/>The Heaven Formation had already set up a formation in the surroundings.<br/><br/>However, the other party had not entered the range of the formation!<br/><br/>This formation was just a barrier set up around them. If they were lucky, it would be of great use!<br/><br/>The three great races of the sacred dragon lineage floated in the void, quietly waiting for news from the shepherd God Race!<br/><br/>If the shepherd God Race asked for help, they could immediately return. If the problem over there was resolved, they could use a secret technique to summon it over and continue their journey!<br/><br/>They were in the void, waiting for the news!<br/><br/>Meanwhile, in Li Tian City, all the expert disciples sensed the terrifying energy not far away. Their faces were filled with shock!<br/><br/>“Why did the Sacred Dragon Clan suddenly stop at our side? What are they waiting for?”<br/><br/>“It seems like their team has lost some races. The Mu God clan, the Black Fog Spirit clan, and the corpse-eating ghost clan don’t seem to be here. What’s going on?”<br/><br/>“What happened to them? However, even with the power of the three great races, it still makes people feel despair. They are simply too strong!”<br/><br/>In Litian City, the strong disciples were discussing in low voices!<br/><br/>Wang Xian and the rest flew over from the sky above the city, staring at them with flickering eyes!<br/><br/>“Dragon King!”<br/><br/>From the side, the Heaven Formation knew that Wang Xian and the rest had arrived and immediately came forward to welcome them!<br/><br/>“Where is the formation set up?”<br/><br/>Wang Xian immediately asked the Heaven Formation!<br/><br/>“Dragon King, the formation is set up here. The three major races of the Holy Dragon lineage are not within the coverage area. If they were to fight, at most, they would drive the other party over here!”<br/><br/>The Heaven Formation pointed in a direction!<br/><br/>The Heaven Formation’s formation ambush had been prepared since a long time ago!<br/><br/>However, although they could calculate where the other party could reach, they could not calculate the exact location of the other party!<br/><br/>This also caused the formation to deviate slightly from the one they had set up!<br/><br/>However, the deviated distance was not too great. If they wanted to escape in this direction, they could just enter the formation!<br/><br/>“Okay!”<br/><br/>Wang Xian nodded his head. His eyes stared at the area that was shrouded by the light. Killing intent slowly appeared in his eyes!<br/><br/>“Do it. We’ll do it forcefully.”<br/><br/>He ordered and flew forward immediately. “Spirit Red Bones, we’ll take one on the left and one on the right. The rest of the disciples of the Dragon Palace, lure them to the formation. However, we can’t let them escape back to the Divine Kingdom!”<br/><br/>“Yes!”<br/><br/>The powerhouses of the Dragon Palace nodded their heads. Their eyes were filled with a violent killing intent!<br/><br/>The three major races, the Holy Dragon lineage, the giant of light tribe, and the hissing light bug tribe, were there to destroy the Dragon Palace.<br/><br/>Now, they were going to be attacked by the Dragon Palace!<br/><br/>The Heaven Formation moved and immediately flew to the side to set up the formation!<br/><br/>“Let’s do it!”<br/><br/>When Wang Xian sensed the fluctuation of the Heaven Formation, he and Ling Honggu took the lead and flew toward the Void where the three major races were at a standstill!<br/><br/>Their speed was very fast, and the experts from the Dragon Palace immediately followed closely behind!<br/><br/>Because the other party was in the void, it was impossible for them to launch a surprise attack!<br/><br/>Now, they could only launch an attack directly!<br/><br/>They could destroy the other party with their powerful strength!<br/><br/>“Eh?”<br/><br/>At the same time, the experts of the Sacred Dragon King and the others were sitting cross-legged in the void above them!<br/><br/>When they sensed the energy fluctuation coming from the right, they were stunned!<br/><br/>This was the fluctuation of a formation!<br/><br/>The formation was set up in the sky. At such a close distance, they could quickly discover it!<br/><br/>“Someone is attacking!”<br/><br/>At this moment, the leader of the light giant tribe looked to the right and roared!<br/><br/>“Courting death, someone actually dares to attack us!”<br/><br/>The leader of the light sound bug tribe immediately looked over and stared at them with cold eyes.<br/><br/>In their line of sight, they saw two figures attacking towards them at a terrifying speed!<br/><br/>Behind these two figures, were existences that were exuding a majestic aura!<br/><br/>There were no less than fifty of them!<br/><br/>“HMM?”<br/><br/>The Sacred Dragon King swept over, his icy cold eyes flashing with light!<br/><br/>“It’s the Dragon Palace, damn it, it’s the Dragon Palace!”<br/><br/>He roared furiously!<br/><br/>His eyes were filled with disbelief!<br/><br/>Why did the Dragon Palace suddenly attack them here?<br/><br/>Were they prepared for this?<br/><br/>Weren’t they attacking the god Shepherd tribe?<br/><br/>Luring the tiger away from the mountain?<br/><br/>“Attack, attack directly!”<br/><br/>The Holy Dragon King roared furiously with his hands tightly locked!<br/><br/>In an instant, waves of terrifying energy engulfed the Dragon Palace!<br/><br/>Wang Xian and Ling Honggu looked at each other. Both of them moved and split into left and right. They immediately increased their speed!<br/><br/>Whoosh<br/><br/>Wang Xian flapped his incorporeal holy wings and unleashed his maximum speed!<br/><br/>A blood-red glow burst out from Ling Honggu’s body. The Aura on his body was beautiful, bloody, and terrifying!<br/><br/>“What happened?”<br/><br/>“Hiss, what a terrifying aura. What happened over there? Did a terrifying figure appear?”<br/><br/>“What’s going on? There are experts attacking the races of the Holy Dragon lineage. This… this… what a terrifying aura!”<br/><br/>When the aura of Wang Xian and the rest was activated, it was located in Litian City.<br/><br/>All the powerful disciples suddenly felt this terrifying energy attack. All of them revealed astonished expressions!<br/><br/>They hurriedly looked towards the sky with their eyes wide open!<br/><br/>“Roar Roar Roar!”<br/><br/>At this time, a roar resounded through the entire world!<br/><br/>Someone actually wanted to attack the Holy Dragon lineage and their race!<br/><br/>This made them feel somewhat incredulous!\t\t\t\t\t\t</div>", "images": {}, "success": true}