{"id": 598, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073097.html", "title": "Chapter 3589 - 3589 3588 Divine Dragons, Giants, And Zerg Were Falling", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3589 - 3589 3588 Divine Dragons, Giants, And Zerg Were Falling</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3589 3588 divine dragons, giants, and Zerg were falling<br/><br/>Buzz<br/><br/>“Oh no, clan leader, we can’t escape. The Dragon King of the Dragon Palace is too terrifying. We can’t escape because we are being interfered with!”<br/><br/>The giant of light and the disciples of the Lightsong Zerg wanted to escape back to their divine kingdom. However, Wang Xian’s terrifying dragon might made it impossible for them to escape!<br/><br/>Under this terrifying draconic aura, they could not return to their divine kingdom in an instant!<br/><br/>“How could the Dragon King of the Dragon Palace be so terrifying? Other than that terrifying war pet, he actually has a companion elf on him. How is this possible!”<br/><br/>“D * mn it, the Dragon King is charging over. Protect the surrounding disciples!”<br/><br/>When the tribe leader of the giant of light and the rest saw that their powerful attack was easily resisted by Wang Xian, they looked extremely embarrassed!<br/><br/>Their attack had used the special giant of light of the giant of light of their race and their innate true treasure!<br/><br/>The chief of the light sound bug race had also used his innate true treasure!<br/><br/>Under such circumstances, under their combined attack, they were actually blocked by the Dragon King of the Dragon Palace!<br/><br/>This strength made them feel terrified!<br/><br/>One had to know that even with their combined attack and the attack of the innate true treasure, they were unable to resist the Dragon King of the Dragon Palace. Who else could withstand it?<br/><br/>Seeing that the terrifying divine dragon was charging at them recklessly, the tribe leader of the giant of light and the rest hurriedly protected the tier one and tier two masters of the universe around them!<br/><br/>“Roar!”<br/><br/>Wang Xian rushed into the group of the three major races. With invincible might, he charged straight at them!<br/><br/>“Ah!”<br/><br/>A tier one master of the universe who was affected immediately let out a blood-curdling scream!<br/><br/>Buzz<br/><br/>At this moment, Wang Xian’s body trembled and his netherspirit avatar appeared at the side!<br/><br/>Roar! Roar<br/><br/>A Netherspirit avatar suddenly appeared and attacked the surroundings!<br/><br/>“This Dragon King still has a trump card. This…”<br/><br/>When the leader of the giant of light saw the sudden appearance of the netherspirit, his expression changed drastically again!<br/><br/>“Defend!”<br/><br/>The leader of the luminous sound insect clan flapped his insect wings and let out a sharp roar.<br/><br/>The innate supreme treasure above his head shot out another laser beam and covered Wang Xian!<br/><br/>Buzz<br/><br/>Below Wang Xian, the five elements grinding mill spun and transformed into the Earth attribute for defense. The Tai Chi Dragon coiled around him while the water-touch king and the Spirit’s defense were attached to the surroundings!<br/><br/>Faced with their attacks, Wang Xian ignored them and charged straight at them!<br/><br/>This gave them no chance to escape!<br/><br/>Some of the Masters of the universe with level one and level two combat strength were even severely injured by this energy!<br/><br/>“Crimson, fire!”<br/><br/>Very soon, Wang Xian’s body charged toward the experts of the Holy Dragon lineage!<br/><br/>This time, the Holy Dragon lineage only sent 12 masters of the universe with level three combat strength. Furthermore, two of them were instantly killed by Ling Honggu the moment he arrived!<br/><br/>Now, Ling Honggu was attacking the Holy Dragon King and the rest. Faced with Ling Honggu’s attack, coupled with the attacks from the experts from the Dragon Palace behind them, the Holy Dragon King and the rest could only fend off the attacks with great difficulty!<br/><br/>The moment Wang Xian rushed over, the flame between Ling Honggu’s brows emitted a luster and directly covered all the disciples of the Holy Dragon lineage!<br/><br/>“Not good!”<br/><br/>When the Holy Dragon King saw Wang Xian rushing over and saw the terrifying and beautiful flame, his body trembled violently!<br/><br/>“Run!”<br/><br/>He hurriedly shouted at the surrounding level one and level two masters of the universe!<br/><br/>“Holy Dragon King, do you think you can unify the Holy Dragon lineage with just you alone? You are just a lackey and a piece of trash. I can easily destroy you!”<br/><br/>Wang Xian stared at the Holy Dragon King and said with disdain!<br/><br/>He carried his body and emitted dragon might. He flapped his primaless sacred wings and charged forward!<br/><br/>“Ahhhh!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>Wang Xian’s charge, the attacks of the members of the Dragon Palace, and Ling Honggu’s attacks.<br/><br/>Although the masters of the universe, such as the Holy Dragon King, who had level three combat strength, could dodge, those who had level three combat strength and below could not!<br/><br/>Facing the might of Wang Xian Ling and Hong Gu, the Saint Dragon Clan’s Level 1 and Level 2 universe masters let out miserable shrieks!<br/><br/>One by one, the divine light dragons and powerful dragon seeds fell down!<br/><br/>“Dragon Palace! Dragon King!”<br/><br/>Seeing this scene, the Saint Dragon King’s body trembled violently, and his eyes turned red as he roared!<br/><br/>“Roar!”<br/><br/>“Roar Roar Roar!”<br/><br/>At this time, more than 50 Great Beings from the Dragon Palace rushed over!<br/><br/>At this moment, they were very close to the great beings from the three races!<br/><br/>The Frost Dragon Northern Frost locked his gaze on a light giant and attacked it directly!<br/><br/>Ao qitian, Ao Qi, Ao Tu, and the others roared and locked onto a universe ruler level 3 great being!<br/><br/>A Level 3 universe dominator with combat strength from the Dragon Palace had locked onto a powerhouse of the same level!<br/><br/>“Kill!”<br/><br/>Wang Xian swayed his huge body and flapped his incipient saint wings. He quickly attacked the giant of light!<br/><br/>“No, we are no match for the Dragon Palace. Think of a way to escape!”<br/><br/>When the chief of the giant of light saw this scene, his expression was abnormally ugly!<br/><br/>If they were to say that they could only fight against the experts of the Dragon Palace, they had a high chance of winning!<br/><br/>However, there were two freaks, the Dragon Palace Dragon King and the red-clothed woman!<br/><br/>They felt that the Dragon Palace Dragon King’s strength and the red-clothed woman’s were almost the same as a true universe ruler!<br/><br/>Killing someone of the same level in an instant terrified them!<br/><br/>“Run!”<br/><br/>The chiefs of the Guangming Bugs did not hesitate and shouted loudly!<br/><br/>Run!<br/><br/>Because of the Dragon King and the lady in red, they had no choice but to run!<br/><br/>“Run!”<br/><br/>“Run!”<br/><br/>They did not hesitate and immediately fled to the back.<br/><br/>“You won’t be able to escape today!”<br/><br/>When Wang Xian saw that they wanted to escape, his eyes were filled with coldness!<br/><br/>His body shook and the five elements millstone below him attacked a giant of light!<br/><br/>“Roar! Roar!”<br/><br/>The giant of light roared as well. He raised his huge arm and turned around to attack the five elements Millstone!<br/><br/>“All of you, leave quickly!”<br/><br/>He roared loudly and his arm collided with the Five Elements Millstone!<br/><br/>Crack! Crack<br/><br/>However, the next moment, the sound of bones breaking was heard. This caused the giant of Light’s expression to change drastically. His eyes were filled with fear!<br/><br/>Wang Xian flapped his divine wings and extended his dragon claw towards the giant!<br/><br/>“Be careful!”<br/><br/>At the side, a giant of light saw this and his expression changed drastically. He clenched his fist and attacked Wang Xian directly!<br/><br/>“Mind Your Own Business First!”<br/><br/>Behind him, the Frost Dragon Beisheng extended his Dragon Claw. He clenched his fist in the air and white frost appeared around him, slowly covering him up!<br/><br/>“That’s right. Mind your own business first. Die, lackeys!”<br/><br/>When the water tentacle king saw this, he flew out from Wang Xian’s shoulder and attacked the giant of light!<br/><br/>Her body immediately turned into a hundred kilometers in size. Tentacles began to wrap around her crazily!\t\t\t\t\t\t</div>", "images": {}, "success": true}