{"id": 596, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073093.html", "title": "Chapter 3587 - 3587 3,586, Exterminating The Great Beings Of The Three Races", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3587 - 3587 3,586, Exterminating The Great Beings Of The Three Races</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3587 3,586, exterminating the great beings of the three races<br/><br/>Godly Dragon Roar!<br/><br/>Out of the more than 50 universe masters with Level 3 Combat Power, there were 12 pure-blooded godly dragons!<br/><br/>The rest, other than ao crab and the others, were all pinnacle dragon species!<br/><br/>Their roars were earth-shattering!<br/><br/>However, the Holy Dragon lineage, the light sound bug clan, and the light giant clan were all mutated great beings within their races!<br/><br/>Compared to the mutated powerhouses in the peak races, the members of the high-level races were more likely to mutate!<br/><br/>This was because there were very few treasures that could mutate the peak races. However, there were many more that could mutate the peak races!<br/><br/>However, the abilities of Wang Xian and Ling honggu were even more terrifying!<br/><br/>Boom! Boom! Boom<br/><br/>The tribe leader of the Holy Dragon King, the giant of light, the Lightsong Zerg, and the rest sensed the attack from the Dragon Palace. Without any hesitation, a terrifying energy engulfed all the members of the Dragon Palace!<br/><br/>Meanwhile, all the members of the Dragon Palace immediately released their energy to counterattack!<br/><br/>Wang Xian and Ling honggu were on the left and right respectively. They didn’t launch any attacks and attacked them at a terrifying speed!<br/><br/>With a terrifying speed, the two of them easily bypassed this terrifying attack and locked onto the experts of the three major races of the Holy Dragon lineage!<br/><br/>Whoosh<br/><br/>Wang Xian pushed his speed to the limit. On his shoulder, the water touch king was lying on one side while a spirit appeared on the other side. She waved the water lotus staff in her hand and waves of energy were injected into Wang Xian’s body!<br/><br/>His speed was even faster than the spirit red bone!<br/><br/>“There’s a figure rushing over. Be careful!”<br/><br/>When Wang Xian arrived at their side in the blink of an eye, numerous triangular eyes suddenly bloomed from the huge insects that had gathered together.<br/><br/>Those eyes locked onto Wang Xian and captured his movements.<br/><br/>However, even though he managed to capture it, it was useless!<br/><br/>Wang Xian’s speed was too fast!<br/><br/>He locked onto a huge giant of the giant of light!<br/><br/>The giant was at least 100,000 meters in size. Wang Xian instantly arrived in front of it.<br/><br/>“Starlight, be careful!”<br/><br/>Not far away, a giant warned loudly!<br/><br/>“Roar, light tremor!”<br/><br/>Starlight sensed the threat of death. His body trembled and a terrifying light fluctuation rushed towards his surroundings!<br/><br/>“Water Domain!”<br/><br/>When the king of water tentacles saw this attack, he let out a soft cry. The surrounding formed a water domain and enveloped Wang Xian!<br/><br/>Wang Xian was holding the five elements millstone in his hand!<br/><br/>“Die!”<br/><br/>The vibration of light was around him and was easily blocked by the water domain of the king of water tentacles!<br/><br/>He held the five elements millstone and sent waves of energy directly into it. Then, he smashed it forward!<br/><br/>Boom<br/><br/>“No, leader, save me!”<br/><br/>When starlight saw that his attack was blocked, he cried out for help in fear!<br/><br/>Crack! Crack! Crack<br/><br/>The five elements Millstone smashed into his body and his body trembled violently.<br/><br/>His life force quickly disappeared!<br/><br/>“Dragon King of the Dragon Palace!”<br/><br/>The giant of light looked over and roared furiously!<br/><br/>“Giant of Light, kill the Dragon King of the Dragon Palace for me!”<br/><br/>He roared furiously with a blood-red face and waved his arm.<br/><br/>At the back, a few level three masters of the universe, the giant of light, lifted the enormous giant of light and smashed it at Wang Xian!<br/><br/>The terrifying force was like the collapse of the heavens!<br/><br/>“His speed is too slow!”<br/><br/>Wang Xian swept his gaze across the area. His figure flickered and he disappeared immediately!<br/><br/>“He is very fast up there. He is comparable to a real universe dominator!”<br/><br/>The gigantic insects formed by the light chirping insects stared at Wang Xian with countless pairs of eyes and let out a roar!<br/><br/>“Sha, flame, Kill!”<br/><br/>However, at this moment, a cold and crisp voice was heard from the right!<br/><br/>A blood-red ribbon was heading straight for a divine radiant dragon of the Holy Dragon lineage!<br/><br/>The blood-red ribbon was beautiful and strange.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The Divine Radiant Dragon was shocked when he saw the blood-red ribbon that was heading towards him. He immediately let out a roar.<br/><br/>“You’re courting death!”<br/><br/>Beside him, another peak dragon of the Holy Dragon bloodline let out a roar and charged towards the blood-red ribbon together with him!<br/><br/>The Dragon Claw and Dragon Head formed by the light seemed to be about to devour it!<br/><br/>“Ka Ka!”<br/><br/>However, the blood-red ribbon was like a blood sword, easily piercing through the Dragon Claw and Dragon Head and continued to sweep towards them!<br/><br/>“Not good, send reinforcements immediately!”<br/><br/>At the side, Sacred Dragon Emperor saw this scene, and his expression changed drastically as he roared loudly!<br/><br/>“Instant life force, Destroy!”<br/><br/>Right at this time, the blood-red ribbon swept through the two universe masters of the sacred dragon lineage at a terrifying and strange speed.<br/><br/>The blood-red ribbon turned into a blood droplet that dodged and charged towards them!<br/><br/>A Light Dragon and a pinnacle dragon were instantly pierced through by the blood droplet!<br/><br/>Their bodies were slowly bleeding blood!<br/><br/>The blood covered their bodies, making them look extremely beautiful and miserable!<br/><br/>“Hou Hou Hou, how is this possible? Be careful, be careful of this great being from the Dragon Palace!”<br/><br/>Sacred Dragon Emperor was slightly stunned when he saw this strange scene, and he roared sternly!<br/><br/>In just a short moment, two universe master level three Great Beings of the Holy Dragon bloodline were killed!<br/><br/>This attack was too terrifying and strange!<br/><br/>How could the opponent be so powerful?<br/><br/>Even the leader of the ancestral Dragon Clan wasn’t this powerful!<br/><br/>“That’s a woman with the darkness and fire elements. She’s very powerful!”<br/><br/>In the middle, the gigantic light bug let out another warning sound!<br/><br/>However, his warning did not have any effect!<br/><br/>“Continue, kill!”<br/><br/>Wang Xian took a glance at the spirit red bone. When he saw that he had killed two level three masters of the universe by surprise, his eyes sparkled!<br/><br/>He let out a low roar and his body immediately transformed into the body of a divine dragon!<br/><br/>“Roar! Roar! Roar!”<br/><br/>A roar was heard.<br/><br/>“Disciples of the Dragon Palace, kill them all! Leave No one alive!”<br/><br/>Ao Qitian and the rest let out a furious roar in the front of the center.<br/><br/>“Strange, murderous, silent, and dark. Listen to the song of Despair!”<br/><br/>In the center, the leader of the Succubus Dragon slowly rose into the sky. She waved her extremely strange dragon wings and a black resurrection Lily slowly covered her body.<br/><br/>Waves of strange ripples covered the area in front of her!<br/><br/>“Freeze, winter world, Roar Roar!”<br/><br/>In the center of the group of powerhouses in the Dragon Palace, it was not ao Qitian, Ao Qi, Ao Tu, but the frost divine dragon, bei Shuang!<br/><br/>Wang Xian’s female disciple!<br/><br/>She was the mutated divine dragon of the Dragon Palace. Other than Wang Xian’s sister and wife, Fan Qinglan, bei Shuang was the only other mutated divine dragon!<br/><br/>The Frost Divine Dragon was an extremely terrifying existence regardless of whether it was in terms of attack or divine dragon!<br/><br/>She had almost no weaknesses and was so powerful that it made people despair!<br/><br/>She opened her dragon head and spat out a stream of white smoke. The void in front of her seemed to have been frozen!\t\t\t\t\t\t</div>", "images": {}, "success": true}