{"id": 604, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073109.html", "title": "Chapter 3595 - 3595 The Battle Of 3594 Came To An End. 41 Kills! Go", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3595 - 3595 The Battle Of 3594 Came To An End. 41 Kills! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3595 The Battle of 3594 came to an end. 41 kills! Go<br/><br/>“Ah! Ah! Ah!”<br/><br/>The Great Beings from the Holy Dragon Bloodline, the light sound bug clan, and the light giant kept screaming!<br/><br/>The three great races were now at a complete disadvantage in terms of power!<br/><br/>Currently, less than 20 Great Beings from the universe ruler Class 1 and 2 had survived!<br/><br/>Under the terrifying aftershocks of this battle, they could only try their best to Dodge and block!<br/><br/>The battle continued. In a short span of 10 minutes, the number of universe masters with level 3 combat power from the three races had increased from 20 to more than 30!<br/><br/>Only about 20 were still fighting!<br/><br/>And these 20 were all besieged by at least two universe masters with level 3 combat power from Dragon Palace!<br/><br/>Some of them were even surrounded and attacked by three of them!<br/><br/>“How can this Dragon King’s strength be so terrifying? How can he be so strong?”<br/><br/>“He clearly hasn’t stepped into the realm of a true universe master. How can he have such terrifying strength?”<br/><br/>The clan leader of the Guangming Insect clan roared in a low voice with an abnormally embarrassed expression as he fought with Wang Xian!<br/><br/>Wang Xian’s strength had completely exceeded his expectations!<br/><br/>He had risked his life using the forbidden technique. He had risked his life to increase his strength, but in the end, he was still unable to do anything to the Dragon King of the Dragon Palace!<br/><br/>How could an existence below the realm of a universe overlord be so terrifying?<br/><br/>He was attacking with all his might, constantly depleting his life force!<br/><br/>At this moment, he had no way out!<br/><br/>Hearing the screams of the powerful disciples around him, the clan leader of the Guangming Bug clan had a look of despair in his eyes!<br/><br/>“Sacred Dragon King, take out all your trump cards and let the disciples of the other races escape. Hurry! Hurry!”<br/><br/>The giant of light held the giant of light in one hand and the giant axe in the other. Sensing the situation around him, he roared with blood-red eyes!<br/><br/>Although he had used the forbidden technique, he was still suppressed by the red-clothed woman from the Dragon Palace!<br/><br/>His terrifying strength made him tremble!<br/><br/>If this went on, all the strong disciples from the three great races would die!<br/><br/>“I don’t have any more trump cards!”<br/><br/>The Sacred Dragon King roared with an ugly expression when he heard the light giant’s words!<br/><br/>His trump cards and the Sacred Dragon Bloodline’s trump cards were inferior to the light giant race and the light sound insect race.<br/><br/>Back then, he had used up most of his trump cards to deal with the ancestral dragon leader!<br/><br/>Other than some life-saving methods, other than one or two connate cardinal treasures, he had no other trump cards!<br/><br/>When the light giant tribe leader heard his words, he felt his vision go black!<br/><br/>His breathing was slightly hurried as his gaze swept the surroundings!<br/><br/>“Hong!”<br/><br/>He raised the light giant mountain in his hand and smashed it heavily towards the spirit red bone!<br/><br/>“Light giant tribe members, charge with me and flee!”<br/><br/>At this moment, he completely gave up on resisting and roared!<br/><br/>As for how many disciples could escape, he could no longer care about that!<br/><br/>Now, he could run as many as he could!<br/><br/>“I’ll cover the rear, you guys run!”<br/><br/>The clan leader of the Guangming Insect Clan roared with a face full of death!<br/><br/>“Roar Roar!”<br/><br/>He roared wildly, and blood slowly flowed out of the pupils on his body. The blood burned and turned into a terrifying power of light!<br/><br/>The light condensed into the shadows of the insects and attacked the powerhouses of the Dragon Palace from all directions!<br/><br/>“Huh?”<br/><br/>Wang Xian’s expression changed slightly as he sensed the attack from the leader of the luminous insects!<br/><br/>“What is this?”<br/><br/>At this moment, he saw the body of the leader of the luminous insects begin to crumble bit by bit. The crumbling body condensed into insects.<br/><br/>Each bug possessed an extremely powerful destructive power!<br/><br/>The tribe leader of the Lightsong Bug clan used up all his energy and flesh to fight for the last bit of time!<br/><br/>Among them, a portion of the bugs attacked the dragon pillars one by one!<br/><br/>The power of this attack was comparable to the full-force attack of a true universe overlord realm expert!<br/><br/>Twenty to thirty experts of the Dragon Palace were blocked by this terrifying attack. Even Wang Xian was blocked a little!<br/><br/>“Guangming Zerg, the mistake is that you have followed the wrong master. The mistake is that you want to destroy our Dragon Palace!”<br/><br/>Wang Xian flapped his divine wings and stared at the chief of the Guangming Zerg who was gradually dissipating as he spoke coldly!<br/><br/>“Chief!”<br/><br/>“Ji Ji Ji Ji!”<br/><br/>A sorrowful voice came from the front. The experts from the Guangming Zerg looked over with eyes filled with grief and indignation!<br/><br/>“Dragon Palace, our photonics insect race will not let you off. Just you wait, just you wait!”<br/><br/>“Run!”<br/><br/>The experts of the photonics insect race were fleeing and shouting!<br/><br/>They knew that their clan leader had fallen!<br/><br/>“Our Dragon Palace has been waiting. We don’t have any enmity with you. It’s you who wanted to destroy our Dragon Palace first. Since that’s the case, we must be prepared to be exterminated!”<br/><br/>A terrifying killing intent shot out from Wang Xian’s body once again. He moved his body and chased after them!<br/><br/>This attack from the leader of the luminous song bugs could not stop Wang Xian at all!<br/><br/>He locked onto an expert of the luminous song Bugs who was at the back. He swayed his huge body and channeled his energy into the five elements grinding mill. Then, he went straight for him!<br/><br/>“No!”<br/><br/>The powerhouse of the photoliths roared in despair!<br/><br/>“Go Down and accompany your tribe leader!”<br/><br/>Wang Xian said with a face full of killing intent!<br/><br/>Boom<br/><br/>The five elements Millstone smashed onto his body, causing his life force to disappear rapidly!<br/><br/>He immediately changed his target. At the back, a powerhouse of the Dragon Palace arrived and killed him!<br/><br/>“Dragon King, they have escaped the area of the formation. The attack of the tribe leader of the photoliths before he died was blocked for a while!”<br/><br/>The sound transmission from the heaven formation was transmitted over, but Wang Xian didn’t feel any fluctuations!<br/><br/>This time, it was a little difficult for the Dragon Palace to keep all their experts here.<br/><br/>He was already very satisfied with his current battle results!<br/><br/>Buzz<br/><br/>Wang Xian chased after them from behind. The pair of dragon eyes that had fused into the dragon eyes locked onto a light giant.<br/><br/>The Phantom image of the innate supreme treasure, the pair of dragon eyes, appeared around him, causing his body to tremble slightly!<br/><br/>“Clan leader, save me!”<br/><br/>He shouted with a face full of despair!<br/><br/>The clan leader of the light giant who was fleeing in front of him looked at him and gritted his teeth as he continued to flee!<br/><br/>“Peng!”<br/><br/>A terrifying attack landed on his body, instantly injuring him heavily and causing him to fall downwards!<br/><br/>The disciples of the Dragon Palace immediately surrounded him!<br/><br/>“Save me!”<br/><br/>At this moment, another desperate voice sounded from the side!<br/><br/>Ling Honggu dodged the attack of the Giant Light Mountain and chased after him as well!<br/><br/>An expert from the Holy Dragon lineage was left behind!<br/><br/>“Run back to your divine kingdom!”<br/><br/>The Holy Dragon King looked over and saw that he had pulled some distance away. He saw that Wang Xian and Ling honggu were targeting the other experts. His body trembled as he growled in a low voice!<br/><br/>His figure slowly disappeared!<br/><br/>The few experts at the front also hurriedly returned to their own divine kingdom!<br/><br/>The experts at the back were still too late. They were burning their lives to escape!<br/><br/>This was because they were burning their lives to escape. The only ones who could catch up to them were Wang Xian and Ling Honggu!<br/><br/>This allowed them to escape back to their own divine kingdom one by one!\t\t\t\t\t\t</div>", "images": {}, "success": true}