{"id": 605, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073111.html", "title": "Chapter 3596 - 3596 The 3595 Battle Came To An End, With 41 Kills", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3596 - 3596 The 3595 Battle Came To An End, With 41 Kills</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3596 The 3595 battle came to an end, with 41 kills<br/><br/>“Dragon Palace Dragon King, just you wait, I’ll Take My Revenge!”<br/><br/>As the leader of the light giant let out an angry roar filled with endless hatred, the leader of the light giant left!<br/><br/>Only two universe masters with level 3 Combat Power were escaping!<br/><br/>The last two great beings were filled with despair!<br/><br/>They even slowed down and gave up on running for their lives!<br/><br/>They couldn’t escape anymore!<br/><br/>Facing the Dragon King of the Dragon Palace and the lady in red, they couldn’t escape at all!<br/><br/>They stopped in despair and faced their impending death!<br/><br/>Wang Xian didn’t show any mercy and killed the last two level three masters of the universe!<br/><br/>As for the other levels, during the battle just now, a few of them who were extremely lucky managed to escape back to their divine kingdoms!<br/><br/>The rest of them were all killed!<br/><br/>The battle was officially over along with the miserable screams of the experts from the lightsong bug race and the giant of light!<br/><br/>The disciples from the Dragon Palace flew over from the back and collected the corpses!<br/><br/>Wang Xian looked at the places where they had disappeared one by one and smiled!<br/><br/>This battle was a complete victory!<br/><br/>“Their trump cards are still very powerful!”<br/><br/>Ling Honggu flew over and said with a twinkle in his eyes!<br/><br/>“Thank you for your help this time, Honggu. Otherwise, we wouldn’t have won!”<br/><br/>Wang Xian looked at Ling Honggu and thanked him!<br/><br/>The trump cards of the giant of light and the hissing light bug race were indeed stronger!<br/><br/>Especially the hissing light bug race’s desperate upgrade. They could pin him down with their forbidden techniques!<br/><br/>Without the spirit red bone, it would be difficult for the other experts of the Dragon Palace to withstand the enhancement of the tribe leader’s forbidden technique!<br/><br/>Even if they could withstand it, the dragon palace would not be able to wipe out so many of their experts!<br/><br/>“This is what I should do. It’s a pity that I didn’t leave more behind!”<br/><br/>The spirit red bone shook his head and said with a smile!<br/><br/>“It’s enough. Out of the experts from the three major races, only 13 of them managed to escape.”<br/><br/>Wang Xian said with a smile!<br/><br/>Out of the three races, the Holy Dragon, the giant of light, and the light sound bug race, there were 41 corpses of the level three universe Dominators!<br/><br/>As for how many of these 41 experts were resurrected through their life-saving treasures, it was no longer important to Wang Xian!<br/><br/>41 corpses could increase the number of level three universe Dominators in the Dragon Palace by 41!<br/><br/>This might not be all!<br/><br/>That was because they still had more than a thousand level one and level two universe masters’corpses left here!<br/><br/>This time, almost all the experts from the three major races were lost here!<br/><br/>“Dragon King!”<br/><br/>At this moment, Ao Qitian and the rest flew over and shouted respectfully!<br/><br/>“Have you collected all the corpses?”<br/><br/>Wang Xian looked at them and asked!<br/><br/>“Dragon King, all of them have been collected!”<br/><br/>The experts from the Dragon Palace nodded!<br/><br/>“An lie!”<br/><br/>He looked to the side and said to himself!<br/><br/>“Dragon King!”<br/><br/>An lie bowed respectfully!<br/><br/>“Let’s go. Take us to the god herders to see if they have escaped or if there is any situation!”<br/><br/>Wang Xian immediately gave the order!<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded and an energy enveloped all of them.<br/><br/>In the next moment, Wang Xian and the rest disappeared!<br/><br/>“This… is this battle over?”<br/><br/>“Over? It’s completely over? The duration of the battle was very short. The giant of light from the Holy Dragon lineage and the luminous song Zerg were completely defeated.”<br/><br/>“The strength of the Dragon Palace is really terrifying. The leader of the light sound bug race seems to have fallen completely. In order to let his underlings escape, he fell completely!”<br/><br/>“Even if the leader of the light sound bug race fought with his life, not many of the three races managed to escape. In the end, only about a dozen universe overlords and level 3 warriors managed to escape, right?”<br/><br/>“Hiss, the Dragon King and the others are too terrifying. This time, the Sacred Dragon clan is completely defeated. Who would have thought that it would end like this?”<br/><br/>In the direction of Sky City, some of the experts and disciples looked over, their faces filled with shock!<br/><br/>They had witnessed this battle. The three races of the Sacred Dragon Clan had no way of resisting!<br/><br/>The Divine Dragon, Giant, and bug race continued to fall from the skies!<br/><br/>Screams rang out continuously!<br/><br/>The universe dominator level 3 experts had been killed by the Dragon Palace!<br/><br/>There were over 40 of them!<br/><br/>What kind of concept was this?<br/><br/>The strength of the Dragon Palace had exceeded everyone’s expectations!<br/><br/>In the end, the Holy Dragon King, the giant of light, and the rest fled!<br/><br/>No one expected that the Dragon Palace would be able to resolve a war that would definitely destroy the dragon palace in such a manner. Not only that, the Dragon Palace had also suffered great losses!<br/><br/>Following that, in the heaven-opening primordial land, which race would dare to provoke the Dragon Palace?<br/><br/>Buzz<br/><br/>Just as everyone in Litian city was in a state of shock, Wang Xian and the rest, who were at the place of the God Shepherd tribe, made another comeback!<br/><br/>Now that the giant of light and the light-roaring bug tribe of the Holy Dragon lineage were almost wiped out, the only remaining members of the six major tribes were the god-herding tribe, the Black Fog Spirit tribe, and the Ghoul tribe!<br/><br/>Wang Xian was not afraid of these three tribes at all!<br/><br/>With their current strength, they could definitely make their way back and fight against the experts of the god-herding tribe, or even annihilate them!<br/><br/>When the territory of the god-herding tribe was near the center, Wang Xian appeared with more than 50 experts of the Dragon Palace!<br/><br/>“There is a majestic energy in the center. It should be the experts from the three races of the Divine Shepherd clan!”<br/><br/>As soon as he was teleported over, the water touch king immediately sensed something and spoke to Wang Xian!<br/><br/>“Let’s go and kill them!”<br/><br/>Wang Xian’s eyes were filled with a cold expression. He moved his body and flew directly toward the center of the Divine Shepherd clan!<br/><br/>Boom<br/><br/>A group of powerhouses from the Dragon Palace immediately followed behind!<br/><br/>At the same time, at the center of the Shepherd clan, the tribe leader and the rest did not leave!<br/><br/>They were still paying attention to some things on the universal ai!<br/><br/>They were paying attention to the battle between the Dragon Palace and the Holy Dragon lineage!<br/><br/>As they did not have the help of the luminous sound bug clan, it was impossible for them to rush over immediately.<br/><br/>They could only use the universe AI to check on the situation of the three races!<br/><br/>However, as time passed, their expressions became more and more unsightly!<br/><br/>From the beginning when the three races were fleeing, to being trapped by the array, to the screams and deaths, the expressions of the warriors of the three races became unusually gloomy!<br/><br/>“HM?”<br/><br/>At this moment, a terrifying energy fluctuation suddenly appeared on the right side, causing the patriarch and the others to be slightly shocked. They hurriedly looked to the right!<br/><br/>In the next moment, they saw many divine dragons flying toward them with terrifying dragon might!<br/><br/>The leader was the Dragon King of the Dragon Palace!<br/><br/>Seeing the experts of the Dragon Palace suddenly charging toward them, the patriarch and the others were a little confused!<br/><br/>What was going on?<br/><br/>The Dragon King of the Dragon Palace and the others suddenly charged back?<br/><br/>“Run!”<br/><br/>The patriarch, the Black Fog Spirit clan, and the Ghoul clan’s patriarch’s pupils constricted slightly. Without any hesitation, they immediately ordered.\t\t\t\t\t\t</div>", "images": {}, "success": true}