{"id": 600, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073101.html", "title": "Chapter 3591 - 3591 3,590 Experts Of The Three Races", "volume": 6, "volume_title": "Volume 6", "body": "<h1>Chapter 3591 - 3591 3,590 Experts Of The Three Races</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3591 3,590 experts of the three races<br/><br/>“Flee, flee, Flee!”<br/><br/>The Light Giant tribe leader roared.<br/><br/>The light giant tribe leader roared as well!<br/><br/>The nine peak experts of the light giant tribe couldn’t do anything to the red-robed woman from the Dragon Palace!<br/><br/>The light giant tribe’s trump card, the insect God formed to attack the Dragon King, had mysteriously lost one-fifth of its strength!<br/><br/>There was no way to fight!<br/><br/>Run, run for your life!<br/><br/>The tribe leader of the giant of light and the rest looked extremely embarrassed!<br/><br/>“Crash!”<br/><br/>At the back, Wang Xian continued to lock onto the giant of light and quickly arrived in front of him!<br/><br/>When the giant of light saw that the insect God could not stop Wang Xian, a hint of despair appeared in his eyes!<br/><br/>“I’ll fight it out with you!”<br/><br/>The giant of light, who knew that he could not escape, emitted an extremely dazzling light. He turned into a ball of light and charged at Wang Xian desperately!<br/><br/>This time, he knew that he would definitely die!<br/><br/>“Die!”<br/><br/>When Wang Xian saw the attack that he unleashed before his death, a cold expression appeared on his face!<br/><br/>This attack was not as strong as the attack of the insect god of the Guangming insect race!<br/><br/>Such an attack had no effect on him at all!<br/><br/>Boom<br/><br/>Wang Xian waved his dragon claws. A surge of energy was injected into the five elements grinding mill and was directed at the giant of light!<br/><br/>The terrifying collision sent the giant of light flying backward!<br/><br/>His body was broken and all his life force vanished instantly!<br/><br/>When Wang Xian saw this scene, a cold smile appeared on his face. His gaze was locked onto the other giant of light!<br/><br/>“If this continues, all of our disciples will die. Set up a defensive barrier and buy US one second!”<br/><br/>The giant of Light’s heart trembled violently when he saw another expert being killed. He roared loudly!<br/><br/>“Good!”<br/><br/>The clan leader of the luminous sound insect clan and the Holy Dragon King could also see the current situation!<br/><br/>If they continued to flee like this, more and more experts would be killed!<br/><br/>The more experts killed, the less likely they would be able to escape!<br/><br/>“Weng!”<br/><br/>“Welcome to the death space that belongs to all of you!”<br/><br/>However, at this moment, the color of the entire world changed. Huge pillars suddenly appeared in the surroundings!<br/><br/>There were nine pillars, and on each pillar was a huge divine dragon!<br/><br/>The Divine Dragon had nine attributes: metal, wood, water, fire, Earth, wind, lightning, light, and darkness!<br/><br/>The nine attributes interweaved to form a space!<br/><br/>A sealed space!<br/><br/>At the same time, this space also had a terrifying attack power!<br/><br/>“What is this?”<br/><br/>The nine dragon pillars that suddenly rose made all the experts of the Sacred Dragon King and the other two races look shocked!<br/><br/>They suddenly had a bad premonition!<br/><br/>“Ambush! The Dragon Palace has set up an array formation here. They intentionally sent us in this direction!”<br/><br/>The patriarch of the light giant tribe trembled. He looked around vigilantly and sensed the surrounding space!<br/><br/>“Roar! Roar! Roar!”<br/><br/>At this moment, the Divine Dragons on the nine dragon pillars roared in unison!<br/><br/>They spat out torrents of nine attributes and attacked them!<br/><br/>…<br/><br/>“Oh? Oh No, oh no!”<br/><br/>At the same time, located in the Shepherd clan, the Shepherd clan’s disciples were killed, so that the Shepherd clan they a group of strong men standing there with an embarrassed face!<br/><br/>At this time, all of a sudden black fog spirit clan patriarch saw the situation on the universe ai brain, the face suddenly changed greatly!<br/><br/>“Huh?”<br/><br/>His exclamation turns pale, causes the surrounding ghoul race and the herd God race a group of strong disciples to look over at once!<br/><br/>The clan leader of the Black Fog Spirit clan turned pale, this was definitely not a small matter!<br/><br/>“Oh no, the Holy Dragon Bloodline, the light giant clan, and the light sound bug clan have been attacked by the Dragon Palace. The other party is very strong, they are not a match at all. Clan leader of the corpse-eating ghost clan, clan leader of the Mu God clan, look at the information on your universe’s AI, it’s the Holy Dragon King and the others!”<br/><br/>The chief of the Black Fog Spirit Race said with an unsightly expression!<br/><br/>“What?”<br/><br/>His words caused the expressions of all the powerful disciples around to change drastically!<br/><br/>The Dragon Palace was actually attacking the Holy Dragon race, the light giant race, and the Light Sound Bug Race?<br/><br/>How was this possible?<br/><br/>They had just attacked the god-herding race’s lair, and now they were already attacking them?<br/><br/>And the Holy Dragon King and the others were not their match?<br/><br/>This? ? ?<br/><br/>“How did the Dragon Palace manage to instantly move from the shepherd God clan’s side to the Sacred Dragon King’s side? This Dragon Palace definitely has powerful treasures, and they must have paid a huge amount of resources and treasures.”<br/><br/>Teleporting over such a long distance was a huge expenditure for the six great clans!<br/><br/>However, the Dragon Palace also had such an ability!<br/><br/>“After breaking through the defense of your shepherd God Race’s grotto-heaven, they immediately teleported to where we were just now. The treasures in this dragon palace are absolutely terrifying. They must have obtained a very powerful Dragon King inheritance!”<br/><br/>The Chief of the Ghoul race said with a dark face!<br/><br/>“Not good, chief. I searched the universe AI for information about the Dragon Palace attacking the three races of the Holy Dragon Bloodline. I found that many Holy Dragons and Giants fell from the sky, and many universe masters with level 3 combat power were killed by them!”<br/><br/>At this time, a strong warrior of the Ghoul tribe shouted in shock!<br/><br/>“What? The three races of the Holy Dragon Emperor Have Universe Masters with level 3 battle strength killed?”<br/><br/>These words made their faces change again, and they all sank!<br/><br/>They also immediately searched the universe ai!<br/><br/>At this moment, the universe AI was completely boiling!<br/><br/>The Dragon Palace’s attack on the Holy Dragon Bloodline, the light giant clan, and the light sound bug clan’s three great clans had completely exploded on the universe’s AI!<br/><br/>The six great clans went to exterminate the Dragon Palace, and this matter was already under the attention of all the powerful disciples!<br/><br/>The Dragon Palace’s sudden attack on the Holy Dragon Bloodline’s three great clans was posted on the universe’s AI by the powerful disciples in Litian City, and it immediately caused a huge sensation!<br/><br/>Especially when they saw the figures of the Godly Dragon Giants falling one after another, they were even more shocked!<br/><br/>According to the news from Litian City, five or six universe masters with level 3 Combat Power had been killed!<br/><br/>As for those universe masters with Level 1 and Level 2 combat power, there were at least hundreds of them!<br/><br/>They looked at the information on the universe AI, and their bodies trembled violently!<br/><br/>“Luring the tiger away from the mountain, luring the tiger away from the mountain, the dragon palace is luring the tiger away from the mountain!”<br/><br/>The patriarch of the Mu God clan roared in a low voice!<br/><br/>Luring the tiger away from the mountain, the problem was that the Dragon Palace had succeeded!<br/><br/>The patriarch of the Mu God clan immediately sent a message to the Holy Dragon King and the others, but he didn’t get a reply!<br/><br/>Obviously, they hadn’t escaped yet!<br/><br/>“What should we do?”<br/><br/>The Patriarch of the Black Fog Spirit clan said with a gloomy face!<br/><br/>“There’s no other way. Even if we report this to the Angel clan, it’s useless. The Elf clan is watching over the Dragon Palace. The Angel clan can not interfere in our war!”<br/><br/>The patriarch of the god-herding clan’s face was extremely unsightly!\t\t\t\t\t\t</div>", "images": {}, "success": true}