{"id": 607, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073115.html", "title": "Chapter 3598 - 3598 3597", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3598 - 3598 3597</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3598 3597<br/><br/>“Okay!”<br/><br/>An lie nodded and immediately set up a devil spirit altar!<br/><br/>2<br/><br/>There were two other dragon wizards who were on the same level as the sky array!<br/><br/>The strength of a Dragon Wizard depended on the proficiency and quantity of the array!<br/><br/>The other two dragon wizards didn’t have as much experience as the sky array!<br/><br/>This also caused the difference in strength between them and the sky array!<br/><br/>The Dragon Wizard Dragon Seed was the one with the greatest potential in the Dragon Palace!<br/><br/>If they could master more array formations, it was very likely that they could rival the mutated Divine Dragon!<br/><br/>After an lie left, Tian Cheng and the other two dragon wizards immediately began to search for the divine kingdom!<br/><br/>With the corpses, it was very convenient for them to search for the divine kingdom!<br/><br/>“Over here!”<br/><br/>Soon, Tian Cheng and the others locked onto the three corpses and immediately flew over to search!<br/><br/>All the arrays of the light giant race had been destroyed, so the outside world couldn’t be teleported in!<br/><br/>This was to prevent accidents from happening!<br/><br/>…<br/><br/>“This… Dragon Palace killed a large number of great beings from the Holy Dragon Bloodline, the light sound bug race, and the light giant race? This dragon palace is so powerful!”<br/><br/>“How could they be so powerful? We were still thinking about how to defend against the invasion of the six great races, but they’ve already killed a large number of great beings from the Holy Dragon bloodline, the light giant race, and the light sound bug race. Dragon Palace and Dragon King are so powerful!”<br/><br/>At the same time, in the nest of the ancestral dragon bloodline!<br/><br/>The ancestral dragon bloodline had gathered together under the orders of a group of universe masters and level three Great Beings!<br/><br/>They had originally planned to fight against the six great races together with Dragon Palace, but in the end, such news came from the AI!<br/><br/>How powerful was this Dragon Palace?<br/><br/>How Strong was the Dragon King of the Dragon Palace?<br/><br/>Even when the leader of the Ancestral Dragon Clan was still alive, he was not so strong!<br/><br/>Even when their leader was still alive, he was only one of the disciples of the giant of light clan and the light sound insect clan!<br/><br/>But now, the Dragon Palace was fighting against three of them, and only a dozen of them escaped!<br/><br/>This terrifying power shocked them!<br/><br/>“With this power, the Dragon Palace doesn’t need us at all. No wonder the Dragon Palace hasn’t come to talk to us about how to join forces. It seems that the Dragon Palace doesn’t take us seriously at all!”<br/><br/>In the central hall of the Ancestral Dragon’s lair, Golden Dragon Emperor said with a slight sigh!<br/><br/>“Yes, according to the information on the AI, the Dragon Palace seems to have over 50 universe masters with level 3 combat power. However, the Dragon Palace and the other great being of the Dragon Palace are very powerful. They can easily kill a universe master with level 3 Combat Power!”<br/><br/>“They are so powerful that they can kill more than 40 universe masters with level 3 combat power when facing 50 universe masters from the three races. They are too powerful!”<br/><br/>The ancestral dragon warriors sighed.<br/><br/>They were shocked by the news!<br/><br/>The power of the Dragon Palace could easily kill their pinnacle ancestral dragon bloodline!<br/><br/>“The Dragon King of the Dragon Palace can lead our bloodline to the peak again!”<br/><br/>The Azure Dragon King said with a sigh!<br/><br/>With the strength of the Dragon Palace, the glory of the Divine Dragon bloodline depended on the Dragon Palace!<br/><br/>They also believed that the Dragon Palace would bring the Divine Dragon bloodline to the peak again!<br/><br/>The Dragon Palace was too abnormal in their eyes!<br/><br/>They had to consider whether or not they should join the Dragon Palace right now?<br/><br/>After this battle, the Dragon Palace would become the last hope of the Divine Dragon Clan.<br/><br/>The Angel clan, Divine Mountain of light.1<br/><br/>The three great clans had been defeated. The shepherd God Clan, the Black Fog Spirit clan, and the Ghoul clan had been scared away by the Dragon Palace!<br/><br/>After returning to their respective divine kingdoms, they immediately rushed toward the Divine Mountain of light!<br/><br/>They had followed the order of the Angel Race to attack the Dragon Palace, but they did not expect the situation to turn out like this!<br/><br/>This result made them extremely embarrassed and terrified!<br/><br/>“Buzz Buzz Buzz!”<br/><br/>Through the teleportation array, they arrived at a large hall of the angel race and waited there quietly!<br/><br/>“Where are the light giant tribe leader and the others?”<br/><br/>The tribe leaders came one by one and waited here!<br/><br/>The Sacred Dragon King looked at them and asked in a deep voice as he didn’t find the tribe leader of the light giant tribe!<br/><br/>“The Dragon Palace has entered the light giant tribe. The tribe leader of the light giant tribe has led the experts out of the tribe. Without a teleportation array, it will take them a few days to get here!”<br/><br/>The tribe leader of the Black Fog Spirit tribe said with a dark expression. He looked at an expert of the light sound insect tribe and asked, “How many peak experts do you have in your tribe?”<br/><br/>“There are only five left.”<br/><br/>This expert of the Guangming insect race had a strong killing intent as he growled in a low voice!<br/><br/>This time, the death of the tribe leader of the Guangming insect race was a great blow to them!<br/><br/>“Buzz!”<br/><br/>Just as he finished speaking, two figures appeared in front of them!<br/><br/>One figure stood in front while the other was one step back.<br/><br/>“We pay our respects to the third prince and the Archangel Baili!”<br/><br/>The Holy Dragon King and the others immediately bowed respectfully when they saw this!<br/><br/>“Yes!”<br/><br/>The third prince nodded his head faintly and swept his gaze across them, his expression somewhat gloomy.<br/><br/>“Third prince, the Dragon King of the Dragon Palace is very powerful and extremely terrifying. They lured away half of our experts. Our Holy Dragon lineage and the light giant tribe, the light sound bug tribe, are completely no match for them. This time, we were almost completely annihilated, and even the light sound bug tribe leader died!”<br/><br/>The Holy Dragon King hurriedly knelt on the ground and reported loudly!<br/><br/>“This is not your fault. The strength of the Dragon Palace has also exceeded my expectations.”<br/><br/>The third Prince said faintly.<br/><br/>The Holy Dragon Bloodline’s light giant and the light sound bug tribe had suffered such heavy losses. Naturally, it was not the Holy Dragon King’s fault!<br/><br/>The strength of the Dragon Palace was far beyond their expectations!<br/><br/>“Third prince, you must avenge our clan leader, our clan leader sacrificed his own life to let us escape!”<br/><br/>The light sound bug clan warrior knelt down and shouted in grief and indignation!<br/><br/>“Don’t worry, this king will not let them off!”<br/><br/>The third Prince spoke, his eyes twinkling as he looked below, “Then how strong is the Dragon Palace?”<br/><br/>“Third Prince, the Dragon Palace ambushed us this time with 54 level 3 universe overlords. However, the Dragon Palace Dragon King and the red-robed lady from the Dragon Palace are abnormally terrifying. They can easily kill us. Their strength is comparable to the true universe overlords!”<br/><br/>The Sacred Dragon King and the others immediately reported!<br/><br/>“Oh?”<br/><br/>His words made the Great Angel Baili, who was standing at the back, slightly raise her eyebrows, and her eyes slightly flickered!<br/><br/>“Yes, third prince. The tribe leader of the light giant and the eight experts of the light giant besieged the red-clothed woman of the Dragon Palace, but they were not her match. She is very terrifying, possessing both darkness and fire attributes!”<br/><br/>The expert of the light sound insect clan added!<br/><br/>“Huh?”<br/><br/>The third Prince also raised his eyebrows with a trace of surprise on his face!<br/><br/>There was actually such an expert from the Dragon Palace?\t\t\t\t\t\t</div>", "images": {}, "success": true}