{"id": 601, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073103.html", "title": "Chapter 3592 - 3592 Three Thousand Five Hundred And Ninety-One Experts From The Three Great Races Were Annihilated", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3592 - 3592 Three Thousand Five Hundred And Ninety-One Experts From The Three Great Races Were Annihilated</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3592 Three thousand five hundred and ninety-one experts from the three great races were annihilated<br/><br/>“Not good!”<br/><br/>At the same time, they were on the battlefield!<br/><br/>When the nine divine dragons on the nine enormous pillars attacked, the hearts of the Sacred Dragon King and the other experts trembled!<br/><br/>Too strong, too strong!<br/><br/>The array masters of the Dragon Palace had set up an array ahead of time!<br/><br/>If an array master could set up an array ahead of time, then when the array was set up, it could deal with three or four existences of the same level!<br/><br/>Furthermore, this formation didn’t look like it was set up by a level three Magus who was the Master of the universe!<br/><br/>The sudden appearance of the formation and the sudden sealing of the space caused them to fall into a desperate situation!<br/><br/>If they couldn’t break the formation here, they would only be left with death!<br/><br/>“The Holy Dragon lineage, the giant of light tribe, and the hissing light bug tribe, let’s see where you can escape to. If you want to destroy our Dragon Palace, today will be the day you die!”<br/><br/>Wang Xian stared at them, his eyes filled with cold killing intent!<br/><br/>These formations took more than a month to set up!<br/><br/>The offensive power of the entire formation was equivalent to two to three level three masters of the universe!<br/><br/>The most important thing was the sealing of the space!<br/><br/>Nine Dragon Pillars and nine elemental divine dragons were also nine types of seals!<br/><br/>Holy Dragon lineage, giant of light tribe, and Lightsong bug tribe, if they wanted to break the space seal, they needed to break these nine dragon pillars!<br/><br/>The dragon pillars could be moved and covered an unusually wide area!<br/><br/>However, if they wanted to destroy it, they would have to face Wang Xian and the experts from the Dragon Palace head-on!<br/><br/>“Destroy the formation. At this moment, don’t hold back any trump cards. Kill!”<br/><br/>The Holy Dragon King’s face turned as dark as blood when he saw this scene!<br/><br/>He roared and attacked the dragon pillars in front of him!<br/><br/>“Kill!”<br/><br/>Wang Xian also roared in a low voice. He locked onto the level three masters of the universe and charged straight at them!<br/><br/>“You Are the Holy Dragon King? Today, I will kill you!”<br/><br/>When Ling Honggu saw the Holy Dragon King attacking the Dragon Pillar, he waved his arm and a blood-red ribbon charged straight at him!<br/><br/>“Kill, Kill, Kill!”<br/><br/>The experts of the Dragon Palace immediately charged at them!<br/><br/>With the array formation blocking them, the distance between them was once again shortened. Next, it was time for a hand-to-hand combat!<br/><br/>Boom! Boom! Boom<br/><br/>Each of the experts of the Dragon Palace emitted a powerful energy. Ao Tu, who was wrapped in the earth element, directly charged forward!<br/><br/>Relying on his almost invincible defense of the same level, he was completely fearless!<br/><br/>The Frost Dragon Northern Frost swayed his huge body, and waves of icy aura directly charged forward!<br/><br/>The Strange Charming Dragon, a pure-bred gold, wood, water, fire, Earth, wind, lightning, and Dark Divine Dragon, charged forward!<br/><br/>The great battle had completely erupted!<br/><br/>“Block that red-clothed woman, I’ll destroy this formation!”<br/><br/>The Sacred Dragon King saw that the spirit red bone was attacking him, and his expression changed drastically as he roared at his subordinates!<br/><br/>“Roar! Roar! Roar!”<br/><br/>Immediately, a few divine dragons of light and the peak races attacked the spirit red bone!<br/><br/>“Do you not think highly of us?”<br/><br/>“Roar! Roar!”<br/><br/>Ao Qitian and the rest looked over. They waved the ocean-pacifying needles in their hands and attacked the Divine Dragons of light!<br/><br/>“Red Bone, kill the enemy’s powerhouses first. They can not destroy the formation by destroying a dragon pillar!”<br/><br/>Wang Xian swept his gaze over and transmitted his voice to Ling honggu!<br/><br/>“Alright!”<br/><br/>Ling Honggu’s eyes sparkled as she nodded her head. The Flames on her glabella bloomed as the blood-red energy from her body attacked a divine light dragon!<br/><br/>“Oh no!”<br/><br/>The body of the Divine Light Dragon that was targeted by Ling honggu trembled!<br/><br/>He had already witnessed how terrifying Ling Honggu was. He would be easily killed in a one-on-one fight!<br/><br/>“Save me!”<br/><br/>He hurriedly shouted!<br/><br/>However, the few universe masters of the Sacred Dragon lineage had no chance to come and support him!<br/><br/>Ao Qitian and the others rushed over. They wanted to Block AO Qitian and the others’violent attacks!<br/><br/>“Weng!”<br/><br/>A terrifying blood-red ribbon completely covered the surroundings of the radiant dragon and quickly shrank!<br/><br/>“Roar! Roar! Roar!”<br/><br/>The Light Dragon tried its best to resist, but it was completely useless!<br/><br/>“Ah! Ah! Ah! Ah!”<br/><br/>When the Great War broke out, the light giants of the Holy Dragon bloodline and the Great Beings of the light sound bug clan, who had the power of universe masters at Level One and level two, were doomed!<br/><br/>They were completely useless in this horrifying war!<br/><br/>Just this terrifying energy fluctuation was enough to kill them quickly!<br/><br/>More than a thousand universe masters with combat strength instantly lost half of them!<br/><br/>It was only a matter of time before the other half died!<br/><br/>“Dragon King of the Dragon Palace, if you want to kill us, we will also kill more than half of the experts from Your Dragon Palace!”<br/><br/>The leader of the Guangming Bug clan shouted when he saw this scene!<br/><br/>“With just you guys?”<br/><br/>Wang Xian sneered. He flapped his primaless sacred wings and came to the side of a level three master of the Phoebus tribe who was fighting with the Golden Dragon of the Dragon Palace. He clawed at him with his dragon claws!<br/><br/>“PFFT!”<br/><br/>The Phoebus tribe experts who were fighting with the Golden Dragon of the Dragon Palace had no way to resist Wang Xian’s sudden attack!<br/><br/>His body was directly penetrated by Wang Xian’s dragon claws!<br/><br/>“Today, all the experts of the three major races will die!”<br/><br/>Wang Xian let out a low growl and moved his body. He continued to attack the next level 3 universe dominator!<br/><br/>The number of level 3 universe Dominators of the three major races was about the same as the number of experts of the Dragon Palace!<br/><br/>The experts of the Dragon Palace were fighting them one-on-one while Wang Xian was hunting them down!<br/><br/>He went straight to a level-three universe dominator and was easily killed by Wang Xian while the opponent was still trying to defend against the attacks of the powerhouses of the Dragon Palace!<br/><br/>One move at a time. It was very easy!<br/><br/>The powerhouses of the three major races did not even have time to react!<br/><br/>In just a dozen seconds, Wang Xian had already killed more than ten level-three universe Dominators!<br/><br/>Up until now, 20 Level 3 universe masters had died in the three major races.<br/><br/>However, some of these masters had life-saving treasures, leaving behind a corpse to escape!<br/><br/>“Dragon King of the Dragon Palace, I will fight you to the death. I want you to die!”<br/><br/>The clan leader of the Guangming Insect clan saw the masters being killed by Wang Xian one by one. If this continued, all of them would die!<br/><br/>His eyes slowly revealed his will to die. His face was filled with madness!<br/><br/>“The insect God has entered the body, exterminating the Dragon King!”<br/><br/>The clan leader of the Guangming Insect clan roared loudly and spread his wings.<br/><br/>In the middle of the two wings, a huge mouth was torn open!<br/><br/>CHIRP CHIRP CHIRP CHIRP<br/><br/>Behind him, the condensed gigantic insect god turned into small insects and surged into his body!<br/><br/>“Clan leader!”<br/><br/>All the Great Beings of the Guangming Bug clan saw this scene, and their faces changed as they shouted loudly!<br/><br/>If the Bug God entered his body, he would die!<br/><br/>Even if he had a life-saving true treasure, it would be useless!\t\t\t\t\t\t</div>", "images": {}, "success": true}