{"id": 602, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073105.html", "title": "Chapter 3593 - 3593 3592 Forbidden Technique", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3593 - 3593 3592 Forbidden Technique</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3593 3592 forbidden technique<br/><br/>“Ah Ah Ah Ah!”<br/><br/>A painful scream came out from the head of the luminous song insect clan. His body was trembling violently.<br/><br/>He was going to start risking his life!<br/><br/>The hearts of the surrounding experts and disciples of the luminous song insect clan jumped violently when they saw this scene. Their eyes were blood red!<br/><br/>The most powerful trump card of their luminous song insect clan, the insect God invasion!<br/><br/>Initially, the tribe leader of the photophobia tribe didn’t want to take this step because once he took this step, it would mean death!<br/><br/>Death was inevitable!<br/><br/>However, at this step, if he continued, he would die slowly. He could only fight his way out!<br/><br/>Otherwise, the light bug tribe would be completely finished!<br/><br/>“Huh?”<br/><br/>Wang Xian saw the change in the body of the tribe leader of the photophobia tribe. He saw the power on his body rising continuously. He narrowed his eyes slightly!<br/><br/>He moved his body and flapped his incipient saint wings to attack him directly!<br/><br/>Buzz<br/><br/>The moment Wang Xian rushed over, the leader of the Guangming insects who was screaming in pain suddenly opened his blood-red eyes!<br/><br/>Crack! Crack! Crack<br/><br/>Following that, the skin on his body cracked open slowly. One by one, eyes popped out and stared at Wang Xian coldly!<br/><br/>There were at least a few million pairs of eyes on his gigantic body.<br/><br/>“Dragon King, I’ve locked onto you. Kill the disciples of my Guangming Zerg. I want all the powerhouses of Your Dragon Palace to be buried with you!”<br/><br/>The leader of the Guangming Zerg opened his sharp mouth and roared with a face full of bloodlust!<br/><br/>His eyes were filled with madness. He flapped his wings and attacked Wang Xian directly!<br/><br/>The moment he moved, the pupils of the countless bugs emitted a bright force and applied it on the leader of the hissing insects clan!<br/><br/>Buzz<br/><br/>In an instant, the leader of the hissing insects clan suddenly increased his speed. His pupils were locked onto Wang Xian.<br/><br/>The innate treasure above his head emitted a light blade from a pair of horns and attacked Wang Xian!<br/><br/>“HMM? His speed and strength have increased tremendously. He must have used a special secret technique!”<br/><br/>Wang Xian saw the changes in the body of the tribe leader of the lightsong bugs and his eyes flickered slightly!<br/><br/>Buzz<br/><br/>His body moved and his netherspirit clone appeared at the side. The five elements millstone was hovering below him!<br/><br/>“Divine tail pearl!”<br/><br/>He swung his divine dragon tail and injected a stream of energy from the five elements millstone into it. The Spirit’s blessing also landed on it!<br/><br/>A powerful law attack was launched. The divine tail twirled the Pearl and attacked the chief of the lamplight insect clan!<br/><br/>Boom<br/><br/>The divine tail twirled the Pearl and collided with the attack of the innate supreme treasure. It was defeated and continued to attack the chief of the lamplight insect clan!<br/><br/>The chief of the lamplight insect clan flapped his wings. Numerous huge eyes of light appeared and attacked the divine tail twirl directly!<br/><br/>Boom! Boom! Boom<br/><br/>The sound of explosions rang out. The chief of the Guangming Insect clan continued to attack Wang Xian!<br/><br/>“Kill!”<br/><br/>Wang Xian could feel the strength of the chief of the Guangming Insect clan. He focused his gaze and charged straight at him!<br/><br/>Bang! Bang! Bang<br/><br/>In close combat, he waved his dragon claws to meet the claws of the chief of the Guangming Insect Clan!<br/><br/>The sound of collision rang out. With the support of the Tai Chi Dragon Disc and the Five Elements Great Spirit Grinder, Wang Xian was still able to withstand the attacks of the chief of the Guangming Insect Clan!<br/><br/>This caused his expression to change slightly!<br/><br/>The secret technique of the chief of the lamplight insect clan was extremely powerful!<br/><br/>It allowed him to fight against a true ruler of the universe!<br/><br/>“Ghost Avatar!”<br/><br/>However, Wang Xian still possessed the ghost avatar. The Ghost Avatar roared and a black flame engulfed the chief of the lamplight insect clan!<br/><br/>Buzz<br/><br/>On the body of the chief of the lamplight insect clan, a portion of his pupils were looking at the ghost avatar, forming a light defense!<br/><br/>The attack of the Netherworld Phantom Avatar did not break through his defense!<br/><br/>“You’re courting death. Light wave, Block!”<br/><br/>The chief of the lamplight insect clan felt Wang Xian’s attack personally and his expression changed drastically!<br/><br/>He let out a wild roar and a wave of energy rippled out from his entire body. It shot out in all directions as if it wanted to destroy everything!<br/><br/>“Five Elements Millstone, five Dragons Chaos!”<br/><br/>Wang Xian let out a low roar. His dragon claws landed on the five elements millstone. All kinds of weapons shot out from it. Treasures of five attributes were like meteorites as they smashed towards the chief of the lamplight insect clan!<br/><br/>“Ghostly Fog!”<br/><br/>The Netherspirit avatar let out a low growl as the black fog filled with corrosive power enveloped the surroundings!<br/><br/>“Dodge!”<br/><br/>In the surrounding area, all the powerhouses felt the intense battle between Wang Xian and the chief of the Phoebus tribe. Their faces were filled with shock as they immediately dodged to the side!<br/><br/>Their battle was too terrifying!<br/><br/>“Ahhhh!”<br/><br/>At this moment, screams continued to ring out from the side!<br/><br/>Wang Xian’s side was temporarily blocked by the chief of the Guangming Insect clan. However, the experts of the giant of light clan and the Holy Dragon Clan were hunted down by Ling Honggu!<br/><br/>Ling Honggu’s current overall strength was even stronger than Wang Xian’s!<br/><br/>She only needed a thousand years of accumulation to reach the realm of the true ruler of the universe!<br/><br/>1,000 years was just a snap of the fingers for the heaven splitting primordial land!<br/><br/>In addition to its powerful inheritance, its combat strength was exceptionally terrifying!<br/><br/>In a short period of time, two more level 3 universe masters with combat strength were killed!<br/><br/>At this point, the number of peak experts from the three major races who died at the hands of Ling Honggu and Wang Xian had reached 24!<br/><br/>Now, they only had 30 universe masters with level 3 combat strength!<br/><br/>These 30 masters were being attacked by over 50 universe masters with level 3 combat strength from the Dragon Palace!<br/><br/>“Holy Dragon King, give me your book of Light Taboos!”<br/><br/>The leader of the light giant saw the situation here and glanced at the leader of the Light Sound Bug clan. He clenched his fist and shouted at Holy Dragon King!<br/><br/>“Good!”<br/><br/>The Holy Dragon King had just destroyed a dragon pillar, but he realized that it was useless. His expression was abnormally ugly!<br/><br/>He waved his arm, and a book was thrown towards the giant of light!<br/><br/>“Roar Roar Roar, forbidden technique, forbidden body, open!”<br/><br/>When the Holy Dragon King saw this, he gritted his teeth and roared furiously!<br/><br/>In the next moment, his body slowly grew bigger, and golden blood flowed out from his body.<br/><br/>The book of taboos came to the sky above him, and with a step of light, it stopped his blood from flowing out!<br/><br/>“Roar Roar Roar!”<br/><br/>The giant of light tribe leader’s body rapidly increased in size, quickly becoming more than ten times bigger!<br/><br/>The huge axe in his hand also looked much smaller at this moment!<br/><br/>“You dare to kill my giant of Light’s disciple, I will kill you!”<br/><br/>The leader of the light giant half of his body entered the clouds and waved his arm!<br/><br/>The huge mountain of light was easily caught in his hand!<br/><br/>He held the huge mountain of light and smashed it towards Ling Honggu!<br/><br/>“HMPH, you think you can kill me?”<br/><br/>Ling Honggu stared at the leader of the light giant with a disdainful expression!<br/><br/>She waved her arm and the blood-red belt on her back attacked the leader of the light giant!<br/><br/>The size of the spirit red bone was extremely small in front of it, but its terrifying power was still stronger!<br/><br/>The blood-red ribbon slowly emitted flames as it attacked the giant of light tribe leader!\t\t\t\t\t\t</div>", "images": {}, "success": true}