{"id": 612, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073125.html", "title": "Chapter 3603 - 3603 3602 Invincible Region’S Three Great Experts", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3603 - 3603 3602 Invincible Region’S Three Great Experts</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3603 3602 invincible region’s three great experts<br/><br/>“Whoosh!”<br/><br/>Baili Archangel flapped his wings and quickly flew towards the towering Magus Tower!<br/><br/>His speed was very fast. He ignored the surrounding gazes and stared at the residence of the Black Tower Magus!<br/><br/>“Whoosh!”<br/><br/>Very quickly, he arrived in front of the Magus Tower and stopped about 100 million kilometers away!<br/><br/>Above the Magus Tower, there was a circular fortress!<br/><br/>On top of the fortress, there was a huge eye that was emitting green and blood-red light!<br/><br/>He stopped in the air and looked at the Magus tower in front of him. There was no movement at all, and he frowned slightly!<br/><br/>“Buzz!”<br/><br/>His 12 wings lightly trembled, and a wave of energy rushed towards the surroundings!<br/><br/>The power of light spread towards the Magus Tower!<br/><br/>“Buzz! Buzz! Buzz!”<br/><br/>However, at this moment, a green light swept towards the surroundings from the top of the Magus Tower!<br/><br/>That incomparably large eye slowly focused on the body of the Archangel!<br/><br/>At this moment, the heart of the Archangel suddenly tightened, and a sense of threat enveloped his heart!<br/><br/>He seemed to have heard the chanting around him!<br/><br/>He could feel countless eyes staring at him from all directions!<br/><br/>At this moment, he actually felt a sense of death looming over him!<br/><br/>“As expected of a Magus from the black tower, to be able to bring me such a strong threat of death!”<br/><br/>Archangel baili stared at the circular castle of the Magus Tower and said with a grave expression!<br/><br/>The experts of the invincible region were indeed not to be underestimated!<br/><br/>Some old monsters had lived much longer than Archangel Baili!<br/><br/>There were even some old monsters that had lived for around 20 billion years!<br/><br/>These old monsters had not broken through for a long time, but they were trying to increase their strength!<br/><br/>They had all sorts of strange methods!<br/><br/>Even if it was a universe ruler level Archangel Baili, he would still be careful!<br/><br/>Take the Black Tower Magus in front of him!<br/><br/>Archangel Baili was certain that if he dared to attack him here, it was not certain who would die!<br/><br/>After all, this was the nest of the Black Tower Magi, surrounded by all sorts of strange formations!<br/><br/>“An Archangel, I wonder why a Little Magus like me is here!”<br/><br/>A door opened in the center of the Magus Tower Fortress, and an old man slowly walked out!<br/><br/>The old man had green pupils, and a pair of blood-red wings on his back!<br/><br/>The other places looked ordinary!<br/><br/>He was the famous wizard of the Black Tower!<br/><br/>An Archangel had come in person, and a wizard of the Black Tower who was only at the peak of the Universe Knight Realm still had to be respected!<br/><br/>Regardless of background, the other party’s strength was enough to make him meet!<br/><br/>“Under the orders of our third prince, we have come to invite the Black Tower Magus to assist a few high-level races and destroy a force!”<br/><br/>The Archangel, Baili, did not hide anything and spoke directly!<br/><br/>“The third Prince of the Angel Race? The Angel of Light?”<br/><br/>The Black Tower Magus was a little surprised to hear the words of the Archangel, a powerhouse from a peak race actually came to find him to take action.<br/><br/>“That’s right, our peak race can not interfere in matters of a high-ranked race. Tell me what you want, our third prince can give it to you!”<br/><br/>The Archangel looked at the Black Tower Magus and continued speaking!<br/><br/>The Black Tower Magus stared at the Archangel, his green eyes flashing with light!<br/><br/>He made a request to the third Prince of the Angel Race!<br/><br/>The third Prince of the Angel Race had an incomparably noble status, and was not an ordinary existence!<br/><br/>This was the second generation of the universe!<br/><br/>“I can make a move, the 12 wings of the universe ruler’s realm Dark Angel!”<br/><br/>The Black Tower Magus pondered for a moment, his eyes flashing as he spoke!1<br/><br/>“HM?”<br/><br/>Baili’s archangel frowned slightly when he heard his request.<br/><br/>He knew that the Black Tower Magus would definitely make a condition, because no one at this level could resist such a temptation!<br/><br/>But this Black Tower Magus’offer wasn’t small either!<br/><br/>The 12 pairs of wings of the ruler of the universe, the Dark Angel, was a treasure!<br/><br/>It was no less than a connate cardinal treasure!<br/><br/>“I’ll tell our third Prince your offer!”<br/><br/>Baili immediately took out the universe AI and sent the Black Tower Magus’offer!<br/><br/>“Weng Weng!”<br/><br/>At the same time, at the center of Dragon Island and Dragon Island.<br/><br/>The third prince stood quietly in front of the pillars where the divine dragons were.<br/><br/>Beside him, the Green River Phoenix was also standing there!<br/><br/>The third prince frowned slightly when he received the message from Baili’s Archangel.<br/><br/>A Universe Dominator’s realm and the twelve wings of the Dark Angel were very precious!<br/><br/>However, he immediately responded!<br/><br/>“A universe Dominator’s realm and the twelve wings of the Darkness Angel in exchange for the help of a powerful warrior. It’s really difficult to invite a powerful warrior from the Invincible Region!”<br/><br/>He spoke indifferently and looked at the water phoenix beside him!<br/><br/>“Your people are too useless!”<br/><br/>The Green River Water Phoenix glanced at him and said indifferently!<br/><br/>“It’s not that my people are useless. It’s that the strength of the Dragon Palace is indeed beyond our expectations. If nothing unexpected happens, it won’t be long before a universe Dominator Realm Warrior is born in the Dragon Palace!”<br/><br/>The third Prince opened his mouth and stared at her, “I’ve already paid a lot, whether the heart of Light and darkness is in there is still uncertain. Qing Jiang, you have to do something.”<br/><br/>Qing Jiang Water Phoenix stared at him, her eyes slightly flickering, “I’ll find you a master from the Invincible Region.”<br/><br/>“Who?”<br/><br/>The third prince stared at her and asked!<br/><br/>“The Supreme Water Demon King!”<br/><br/>The Green River Water Phoenix replied!<br/><br/>“I’ve heard of him. Is there anyone else?”<br/><br/>The third prince nodded and continued to ask!<br/><br/>Those who he had heard of were all top-tier existences in the Invincible Zone!<br/><br/>“No one. My subordinates only know this one.”<br/><br/>The Green River Water Phoenix shook her head!<br/><br/>“Okay!”<br/><br/>The third prince didn’t continue to make any requests and nodded!<br/><br/>He immediately passed this news to Archangel Baili!<br/><br/>“If we say that the Dragon Palace has given birth to a divine dragon at the realm of the ruler of the universe, it is also good news for us!”<br/><br/>After a few minutes of silence, the Green River Water Phoenix spoke!<br/><br/>“The elf race has some interaction with the Dragon Palace!”<br/><br/>The third Prince added indifferently!<br/><br/>This caused the Green River Water Phoenix to frown slightly and did not say anything!<br/><br/>“Alright, our third prince has agreed!”<br/><br/>At the same time, within the invincible region, the Great Angel Baili received a message from the third prince and replied to the Black Tower Magus in front!<br/><br/>“Alright!”<br/><br/>The Black Tower Magus revealed a smile. “Which force to destroy? If it’s too weak, then it’ll be meaningless!”<br/><br/>“Dragon Palace, the other party has two experts who can instantly kill a universe overlord rank 3 expert. I’ll continue to invite experts. You’re the first. The second great water demon king has already agreed. Find another one. Do you have any recommendations?”<br/><br/>2<br/><br/>Bailie Archangel asked him!<br/><br/>“Oh? They can instantly kill experts of the same level? Interesting, interesting. I want one of them!”<br/><br/>The Black Tower Wizard’s eyes shone as he said!\t\t\t\t\t\t</div>", "images": {}, "success": true}