{"id": 619, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073139.html", "title": "Chapter 3610 - 3610 The Gathering Of 3609 Powerhouses!", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3610 - 3610 The Gathering Of 3609 Powerhouses!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3610 The gathering of 3609 powerhouses!<br/><br/>Wang Xian only learned about the invincible zone not too long ago!<br/><br/>That was where the old monsters gathered. That was where the real powerhouses were!<br/><br/>As for the exact number of powerhouses in there, the disciples of the ordinary forces had no idea at all!<br/><br/>There was no clear answer on the universal AI either!<br/><br/>However, that was where a group of old monsters who wanted to break through were active. How could a group of old monsters be weak?<br/><br/>Wang Xian opened the universal AI and checked some information about the Tai Shui Demon King!<br/><br/>Information about the Tai Shui Demon King from more than 10 billion years ago appeared in front of Wang Xian!<br/><br/>Buzz Buzz<br/><br/>At this moment, Wang Xian’s universal ai trembled. He opened it and saw that it was a message from the Devil Dragon King of the ancestral dragon lineage!<br/><br/>A message about the invincible zone!<br/><br/>The message from the Devil Dragon King was that the former leader of the ancestral dragon had stepped into the invincible zone!<br/><br/>Furthermore, he had challenged some experts in the invincible zone!<br/><br/>In the end, he was defeated when he challenged the fifth expert and left the Invincible Zone!<br/><br/>The assessment of the leader of the ancestral dragon regarding the invincible zone was that it was not a gathering place for geniuses or monsters. Instead, it was a gathering place for a group of Old Monsters!<br/><br/>A group of old monsters who would do anything to increase their strength!<br/><br/>The Demon Dragon King reminded Wang Xian on the universal ai that he had to be careful.<br/><br/>Furthermore, the demon Dragon King said that the leader of the ancestral dragon once told him that there were a few terrifying existences in the invincible zone. These few terrifying existences were not ordinary experts. One of them, the Tai Shui Demon King, had mutated twice!<br/><br/>Wang Xian saw his message and smiled faintly!<br/><br/>Mutated twice?<br/><br/>He did not take this matter seriously at all!<br/><br/>What Supreme Water Demon King, what mutated twice, what Invincible Zone!<br/><br/>In Wang Xian’s eyes, all of them were trash!<br/><br/>That’s right, all of them were trash!<br/><br/>This was his confidence!<br/><br/>With his current strength, he could fight three of them by himself with the help of the primaless holy wings. With the five elements grinding, he could fight six of them by himself!<br/><br/>With the help of the Netherspirit avatar, he was able to fight against seven people by himself!<br/><br/>With the help of the spiritual spirit, he was able to fight against eight people by himself!<br/><br/>With the help of the Tai Chi Dragon Disc, this…<br/><br/>I’m sorry, I’m invincible. You can do whatever you want!<br/><br/>Now that there were no more than three powerhouses who were at level one of the Masters of the universe, Wang Xian felt that there was nothing he could do at all!<br/><br/>Speed plus defense, his strongest trump card!<br/><br/>“They’re just a bunch of trash who haven’t broken through for a long time. Without the ability to break through, they’re trying to think of ways to improve their combat strength. Hehe!”<br/><br/>Wang Xian shook his head!<br/><br/>They were all trash and did not care about them at all!<br/><br/>“Dragon King, did you see what happened on the universe’s AI?”<br/><br/>Prime Minister Gui had also received the challenge from the Tai Shui Demon King and came forward to ask!<br/><br/>“We are here to deliver resources. Don’t take it to heart!”<br/><br/>Wang Xian said with a smile!<br/><br/>In his opinion, the Tai Shui Demon King was just delivering resources to the Dragon Palace!<br/><br/>It was a good demon beast!<br/><br/>Putting everything else aside, the Dragon Palace could add another universe dominator level 3 combat strength expert!<br/><br/>He hoped that there would be more such fellows!<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui smiled. The strength of the Dragon Palace was already strong enough!<br/><br/>After absorbing the resources from last time, the number of universe dominator level 3 combat strength experts in the Dragon Palace had already exceeded 100!<br/><br/>There should have been more, but ten of them were level 3 universe Dominators and were used to increase bei Shuang’s strength!<br/><br/>Now that bei Shuang was at the peak of the Universe Knight realm, she could fight against a true universe dominator!<br/><br/>Then, how deep was the accumulation of the Tai Shui Demon King?<br/><br/>An expert from more than 10 billion years ago?<br/><br/>Let’s talk about it after we get bei Shuang!<br/><br/>The only Frost Dragon in the Dragon Palace!<br/><br/>The strongest mutated divine dragon!<br/><br/>As time passed, Wang Xian didn’t take the Taishui Demon King’s challenge to heart at all!<br/><br/>The experts of the Dragon Palace didn’t take it to heart either!<br/><br/>If they wanted to die, the Dragon Palace would welcome them!<br/><br/>Time passed quickly. The breakthrough of the Tai Chi Dragon Plate allowed Wang Xian to witness its strength!<br/><br/>Now, he was hoping to see when the five elements grinding could achieve a breakthrough!<br/><br/>The Taiji Dragon Disc’s breakthrough was achieved by absorbing more than two thousand innate numinous treasures of the light and dark attributes!<br/><br/>Then, because the five elements millstone had absorbed more innate numinous treasures in the past, it now needed to absorb about one thousand and five hundred innate numinous treasures of the five elements to break through!<br/><br/>More than one thousand and five hundred, unless they wiped out another two or three powerful high-level races, it would be very difficult to gather all of them!<br/><br/>Secondly, the current enemies, the ghouls, the black fog spiritual race, and the herdsman race, were all of the darkness attribute, except for the herdsman race, which had a mixed attribute!<br/><br/>This was not good!<br/><br/>I have to find an opportunity to eliminate these three races and exchange resources for the five-elemental innate spiritual treasures. When the five-elemental grinding breaks through, my strength will be greatly enhanced. When that happens, I will be able to defeat a level one master of the universe<br/><br/>Wang Xian thought to himself as a smile appeared on his face!<br/><br/>“Dragon King, we have found traces of some powerhouses around our dragon palace. These powerhouses are all at the third level of the Universe Dominator!”<br/><br/>More than half a year had passed very quickly. Prime Minister Gui suddenly came to report!<br/><br/>“Huh?”<br/><br/>When Wang Xian heard this news, he raised his eyebrows slightly.<br/><br/>Everyone knew that this was the territory of the Dragon Palace!<br/><br/>Under normal circumstances, there wouldn’t be any powerhouses wandering around the river!<br/><br/>To appear in someone else’s territory was equivalent to a provocation to a race!<br/><br/>Now that there were powerhouses with level three combat strength who were masters of the universe around the Dragon Palace, and they were still lingering here, the Dragon Palace had no choice but to pay attention to them!<br/><br/>“How many powerhouses are there? What are they doing around us?”<br/><br/>Wang Xian asked!<br/><br/>“I don’t know for now. The other party didn’t go too deep into our territory, but we found powerhouses from the Elf clan. There are also other powerhouses from other races that seem to be at the peak!”<br/><br/>Prime Minister GUI said with a slightly solemn tone!<br/><br/>This made him raise his eyebrows slightly. Powerhouses from the peak race?<br/><br/>What were they doing here in the Dragon Palace?<br/><br/>There were also powerhouses from the ELF race?<br/><br/>The Elf race was considered friendly to the Dragon Palace!<br/><br/>Why were they in the surroundings?<br/><br/>“Reporting to the Dragon King, Prime Minister Gui!”<br/><br/>At this moment, a halberd dragon guard flew over from the outside. “Dragon King, there are five powerhouses flying towards us from the outside. Their auras are extremely terrifying!”<br/><br/>“Huh?”<br/><br/>When Wang Xian heard his subordinate’s report, he raised his eyebrows slightly!<br/><br/>“Five?”<br/><br/>“Let’s Go!”<br/><br/>Wang Xian gestured to Prime Minister Gui and immediately flew out!<br/><br/>At the same time, in other parts of the Dragon Palace, the leader of the Halberd Dragon Guard, ao Yecha, more than a dozen purebred divine dragons, as well as bei Shuang and the rest immediately flew out!<br/><br/>“Everyone, stop. This is the domain of our Dragon Palace!”<br/><br/>Just as they flew out, the voice of the Halberd Dragon Guards was heard!<br/><br/>Wang Xian looked ahead and saw three angels. One was a blurry shadow, and the other was a terrifying figure with fangs flying over!<br/><br/>When Wang Xian saw these figures, he frowned slightly!<br/><br/>The three angels, the Angel of Darkness, could be recognized at a glance!<br/><br/>If his guess was right, that blurry figure was an expert from the Netherworld race!<br/><br/>As for the human-like expert with fangs and wings, he should be a demon!\t\t\t\t\t\t</div>", "images": {}, "success": true}