{"id": 616, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073133.html", "title": "Chapter 3607 - 3607 Under The Reputation Of The 3606 Invincible Region", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3607 - 3607 Under The Reputation Of The 3606 Invincible Region</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3607 Under the reputation of the 3606 invincible region<br/><br/>“Ka Ka Ka Ka!”<br/><br/>The Sacred Dragon King and the others bowed respectfully. Even the Great Angel Baili also bowed respectfully!<br/><br/>However, the faces of the Black Tower Magi, the Great Aqua Demon King, and the old scholar changed drastically. A terrifying aura surrounded them, resisting the third Prince’s Aura!<br/><br/>However, even if they resisted, they had no choice but to bend their bodies, covered in cold sweat!<br/><br/>“Greetings, third Prince!”<br/><br/>They hurriedly greeted him as well!<br/><br/>The third Prince’s strength was not something that an archangel like Baili could compare to. Similarly, it was also not something they could compare to!<br/><br/>“Not bad, your strength is not bad!”<br/><br/>The third prince sized up the three of them and nodded his head in satisfaction!<br/><br/>He moved his palm and took out a pair of black twelve-winged angel wings and a few books of light!<br/><br/>“This is your reward, I’ll give it to you in advance!”<br/><br/>With a wave of the third Prince’s arm, the 12 wings of the Dark Angel and the Book of light landed in front of the Black Tower Magus and the old scholar!<br/><br/>The Black Tower Magus’eyes lit up with joy.<br/><br/>The old scholar opened the book and flipped through it, a satisfied expression on his face!<br/><br/>“We can easily destroy a small dragon palace, don’t worry, third Prince!”<br/><br/>The Supreme Water Demon King glanced at the book and said respectfully to the third prince!<br/><br/>“Mm, I believe that the three experts of the invincible region, the two top experts of the Dragon Palace, have been killed. Leave the pure-blooded divine dragon behind. Don’t kill it. This is the light death region. It can seal a space and doesn’t require the control of Magi!”<br/><br/>The third Prince ordered and threw them a treasure!<br/><br/>“Yes!”<br/><br/>The Black Tower Wizards took the light death region and nodded respectfully!<br/><br/>“The Warriors of the Invincible Region?”<br/><br/>Hearing the third Prince’s words, the Holy Dragon King, the Patriarch of the Godly Mu clan, and the others were pleasantly surprised!<br/><br/>The Invincible region was the place where an old monster at the pinnacle level of a universe knight broke through!<br/><br/>The chances of breaking through here were very high, but it was also very dangerous!<br/><br/>Only those great beings who had not broken through for a long time would enter the invincible region!<br/><br/>Last time, the third Prince said to call the Great Beings from the invincible region over, but he did not expect them to come so quickly!<br/><br/>“I’ll leave it to you, I don’t want to mess it up!”<br/><br/>The third prince warned them, and his figure disappeared again!<br/><br/>“Sacred Dragon King, tell them about the Dragon Palace, these three are respectively the Black Tower Wizard, the old scholar, and the Supreme Water Monster Emperor!”<br/><br/>After the third prince left, the Archangel said to them!<br/><br/>“Supreme Water Monster King?”<br/><br/>As soon as the Archangel said that, the leader of the giant of light let out a shocked cry!<br/><br/>He looked at the Supreme Water Monster King with fear and fear in his eyes!<br/><br/>“Haha? Have you heard of my name?”<br/><br/>The Supreme Water Monster King looked at the leader of the giant of light and asked with a laugh!<br/><br/>“I’ve heard of the Supreme Water Demon King before I became the leader of the giant of light!”<br/><br/>The leader of the giant of light stared at the supreme water demon king with sparkling eyes and said!<br/><br/>That was 10 billion years ago!<br/><br/>“Let’s talk about the powerhouses of the Dragon Palace first.”<br/><br/>The Wizard of the Black Tower looked at them and said indifferently!<br/><br/>“There are more than 50 peak powerhouses of the Dragon Palace, which is not a lot. We have 71 on our side, but they have two very terrifying existences. One is the Dragon King of the Dragon Palace, and the other is a woman in red. They can kill us ordinary peak powerhouses in an instant.”<br/><br/>The light giant said with some fear in his heart!<br/><br/>“Oh? Are you stronger than me?”<br/><br/>The supreme water demon king waved his arm, and a terrifying energy directly charged toward the light giant tribe leader!<br/><br/>The light giant tribe leader sensed this terrifying aura, and his expression changed drastically. He hurriedly raised his arm to block!<br/><br/>Boom1<br/><br/>But in the next moment, he didn’t have the strength to resist at all, and his body flew backward!<br/><br/>The patriarch of the giant of light widened his eyes, full of shock!<br/><br/>“Hiss!”<br/><br/>At the side, the Sacred Dragon King and the others saw this terrifying power, and their pupils constricted, and they couldn’t help but take a deep breath!<br/><br/>This was an expert of the same level as them?<br/><br/>Wasn’t this too terrifying?<br/><br/>“As expected of an expert of the invincible zone, so strong, so terrifying!”<br/><br/>The clan leader of the god-herding clan was filled with shock when he saw this!<br/><br/>Such a great being could send the clan leader of the light giant flying with a casual wave of his hand. If he was serious, wouldn’t he be instantly killed?<br/><br/>The clan leader of the light giant was much stronger than an ordinary level three universe master!<br/><br/>They knew that the Great Beings from the invincible region were very powerful, but they didn’t expect them to be so abnormal.<br/><br/>“Let’s go. Don’t waste time. I want to compete with that Dragon King!”<br/><br/>The old scholar glanced at them and said!<br/><br/>“Old scholar, that Dragon King is mine. I said, I want to bring some dragon meat to my little ones!”<br/><br/>Taishui Monster King stared at the old scholar and said directly!<br/><br/>“Hehe, I now have the fan of Angel Feather and the bone-armor characters of the Black Tortoise clan. I just happen to lack a dragon throne of the Divine Dragon!”<br/><br/>The old scholar waved the fan in his hand and said indifferently to the monster king Taishui!<br/><br/>“HMM?”<br/><br/>When the Sacred Dragon King and the others heard the old scholar’s words, their eyes fell on the white fan in his hand, and their expressions changed again!<br/><br/>A fan made from the wings of an angel!<br/><br/>Wasn’t this guy afraid that the Angel Tribe would destroy him?<br/><br/>It seemed that they were also top-tier existences in the invincible region.<br/><br/>They naturally understood the invincible region, but what happened in the invincible region rarely spread to the outside world!<br/><br/>Because that was the place where a group of experts broke through, no expert would be so bored as to eat melons there!<br/><br/>Looking at the fan in the old scholar’s hand, they knew that this was also a terrifying existence, a madman!<br/><br/>“Alright, let’s set off immediately. As for which one of you fights the Dragon King, it depends on which one of you fights the Dragon King. Don’t mess up this matter, or our third prince won’t let the three of you off!”<br/><br/>Beside them, the Great Angel Baili frowned as he reminded them!<br/><br/>His words caused the old scholar and the Great Aqua Demon King to restrain themselves a little!<br/><br/>If the angel race wanted to deal with them, even if they did not break the rules, they would still have a way to deal with them!<br/><br/>In the invincible region, there were many experts from the angel race.<br/><br/>There were also crazy existences!<br/><br/>“My Lords, let’s set off. It will take more than a year to get there from here!”<br/><br/>The Sacred Dragon King looked at them and said!<br/><br/>“Alright, let’s Go!”<br/><br/>The Black Tower Magus nodded.<br/><br/>“Let’s Go!”<br/><br/>The Sacred Dragon King and the others were excited.<br/><br/>The pastoralist race, the light sound bug race, and the giant of light were also filled with ferocity and excitement!<br/><br/>Not long ago, the Dragon Palace had caused great losses to the four great races!<br/><br/>And now, the third Prince had invited three unfathomable experts from the invincible region!<br/><br/>This time, they would definitely destroy the Dragon King of the Dragon Palace and avenge their disciples, their experts, and their clan leader!<br/><br/>“That Dragon King of the Dragon Palace is mine!”<br/><br/>They teleported away and flew above the heaven-splitting chaotic land!<br/><br/>The Supreme Water Demon King roared and took out the universal computer to edit a message!<br/><br/>“I heard that the Dragon King of the Dragon Palace has appeared in the inner land. Hahaha, I, the Supreme Water Demon King, want to experience it. Dragon King, right? In one year, I will challenge you. Die!”\t\t\t\t\t\t</div>", "images": {}, "success": true}