{"id": 617, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073135.html", "title": "Chapter 3608 - 3608 3607 Legend Of The Supreme Water Demon King!", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3608 - 3608 3607 Legend Of The Supreme Water Demon King!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3608 3607 legend of the Supreme Water Demon King!<br/><br/>“I heard that a powerful warrior like Dragon Palace Dragon King has appeared in the inner continent. Hahaha, I, the supreme water demon king, would like to experience it. Dragon King, right? One year later, I will challenge you. Accept your death!”<br/><br/>“Hahaha!”<br/><br/>After the supreme water demon king sent out the message, he immediately started laughing maniacally.<br/><br/>On the side, Holy Dragon King and the others glanced at the supreme water demon king and were shocked!<br/><br/>Why was this Supreme Water Demon Emperor like a Madman?<br/><br/>“Legend has it that the invincible region is a place where Pinnacle Universe Knights enter in search of a breakthrough. There are many old monsters there, some of them have lived for more than 20 billion years!”<br/><br/>The clan leader of the god Mu clan glanced over and transmitted his voice to Sacred Dragon Emperor and the rest!<br/><br/>“Living for 20 billion years without a breakthrough, time will wear down a great being’s intelligence and temperament. Such a great being is terrifying!”<br/><br/>The light giant’s eyes flickered slightly!<br/><br/>As a peak expert of a high-level race, they had some understanding of the invincible zone.<br/><br/>However, none of their race’s experts had stepped into the invincible zone!<br/><br/>The most important reason was that in the past, they had heard that many experts of the angel race had fallen inside!<br/><br/>This made them somewhat fearful of the Invincible Zone!<br/><br/>Even great beings of the angel race had fallen inside. One could imagine the danger inside!<br/><br/>“I’ve heard of Tai Shui Demon King. He became a terrifying great being more than 10 billion years ago. I heard that he was the one who destroyed his own race. He was very vicious and cruel!”<br/><br/>The leader of the light giant race continued, “At that time, there were three or four universe masters and level-three great beings in Tai Shui Demon King’s race. All of them were killed by him. As for why he destroyed his own race, I don’t know!”<br/><br/>“Such an existence is the true monster level. I remember that when the Divine Dragon tribe was still in its glory, a Demon Beast killed a Dragon King of the Dragon tribe and escaped to the invincible zone. The Great Beings of the Divine Dragon tribe couldn’t find him!”<br/><br/>“There was indeed such a thing. At that time, a traitor appeared in the immortal nation and escaped to the invincible zone. However, the immortal nation didn’t go to find that traitor!”<br/><br/>The clan leaders of several races communicated with each other through voice transmission!<br/><br/>Obviously, they also had a trace of respect for the Invincible Zone!<br/><br/>Perhaps in a few billion years, before the arrival of the apocalypse, they wouldn’t be able to break through their cultivation bases. They would also go to the invincible zone to look for opportunities, to look for battles and battles to break through!<br/><br/>The group of people flew in the sky. They weren’t as Grand and mighty as last time.<br/><br/>They weren’t followed by the group of disciples like last time!<br/><br/>But this time, their strength was even more terrifying than last time!<br/><br/>Not a single peak expert of the six great races was left. There were also three peak experts of the invincible region!<br/><br/>“Clan leader, look at the universe’s AI. The Great Aqua Demon King actually posted the news of challenging the Dragon King on the AI. It has already caused a huge sensation!”<br/><br/>Time passed day by day. When they were on their way for more than a month, an expert from the black fog spirit clan suddenly exclaimed!<br/><br/>“Eh?”<br/><br/>The Black Fog Spirit clan’s clan leader, the shepherd God Clan’s clan leader and the rest of the experts were slightly stunned. They immediately opened the universe’s AI to take a look!<br/><br/>As expected, they saw an extremely explosive piece of news!<br/><br/>The news was that the great water demon king was challenging the Dragon King of the Dragon Palace. Furthermore, the Great Water Demon King wanted the Dragon King to die!<br/><br/>“Hahaha, I didn’t expect that there would be people who know about me. It seems that my reputation is still very well-known!”<br/><br/>When the supreme water demon king heard the exclamation of the Black Fog Spirit race expert, he also opened the universe AI.<br/><br/>When he saw that this news had already caused an uproar, he couldn’t help but laugh!<br/><br/>He was very satisfied with this situation!<br/><br/>“HM?”<br/><br/>At the side, the old scholar heard their words and slightly frowned.<br/><br/>He took out the universe AI and looked at it, his gaze slightly flickering!<br/><br/>At this moment, on the universe AI, the information regarding the supreme water demon king caused a commotion!<br/><br/>The Supreme Water Demon King hadn’t appeared within the eyes of the heaven opening primal continent for a very, very long time!<br/><br/>The people born in the last few billion years had never heard of this existence!<br/><br/>Those experts who had lived for ten billion years had long forgotten about it!<br/><br/>But now, it suddenly appeared!<br/><br/>At first, after the supreme water demon king posted the information on the Universe AI, it didn’t attract too much attention!<br/><br/>Only a few people knew about the sudden voice of this terrifying existence!<br/><br/>But as time passed, this matter gradually spread!<br/><br/>And the story of the Supreme Water Demon King was also spread!<br/><br/>Ten billion years ago, an extremely terrifying expert had stepped into the invincible zone. Now, he suddenly wanted to challenge the Dragon King and make him die. How could they not be shocked?<br/><br/>Especially since this matter was related to the Dragon King of the Dragon Palace!<br/><br/>“This… this supreme water demon king is really like some information said. is he an old monster from ten billion years ago? Is He an existence that stepped into the invincible zone ten billion years ago? He actually wants to challenge the Dragon King? He wants to kill the Dragon King?”<br/><br/>“This is already a stone hammer. The experts of the high-level races have confirmed it. He really is an expert from ten billion years ago. At that time, he destroyed his own race and killed three or four experts of the same level. His strength is extremely terrifying!”<br/><br/>“Why did the experts of the Invincible Zone suddenly challenge the Dragon King and want to kill him? Is it because the strength that the Dragon King of the Dragon Palace displayed last time attracted the attention of the experts of the Invincible Zone and wanted to challenge him?”<br/><br/>“Tai Shui Demon King, our race has an ancestor in the invincible region. Tai Shui Demon King is definitely one of the most terrifying existences in the invincible region. He even taught 10 universe masters with level 3 battle strength. Our ancestor said that Tai Shui Demon King can kill a universe master with level 3 battle strength in an instant. He is almost invincible in the same level!”<br/><br/>“This is an existence that has lived for more than 20 billion years. Although he hasn’t broken through to the universe ruler realm, he was able to kill three or four people of the same level with one strike 10 billion years ago. He must be even more terrifying now!”<br/><br/>“Not long ago, the Dragon King of the Dragon Palace led his warriors and killed dozens of peak warriors of the three great races. The Dragon King of the Dragon Palace also had the power to kill warriors of the same level in an instant. The Supreme Water Demon King was attracted by the Dragon King’s power. Do you want to Spar with him?”<br/><br/>“This isn’t sparring, this is a life and death battle!”<br/><br/>“The invincible region. I only heard about it after the Dragon Palace killed a group of experts from the three great races last time. After some investigation, that’s where the old monster is looking for a breakthrough. It’s absolutely terrifying!”<br/><br/>On the universe AI, countless expert disciples began to discuss!<br/><br/>The Invincible region wasn’t famous at first, but the last time the dragon palace displayed its terrifying strength, when someone evaluated how strong the Dragon Palace was, they used the technology world and the invincible region to compare.., many strong disciples only knew about the invincible zone!<br/><br/>After all, it was a place where old monsters sought to break through, so it was normal that many weak people didn’t know about it!<br/><br/>Not long ago, someone said that there were experts from the invincible zone who were going to fight to the death with the Dragon King of the Dragon Palace?\t\t\t\t\t\t</div>", "images": {}, "success": true}