{"id": 610, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073121.html", "title": "Chapter 3601 - 3601 3,600 Tai Chi Dragon Disks", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3601 - 3601 3,600 Tai Chi Dragon Disks</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3601 3,600 tai chi dragon disks<br/><br/>“Dragon King, we have obtained a lot of resources this time. We can help bei Shuang, Queen fan long, and Princess Xiao Yu break through to the level of a level four universe overlord. Do you want to help them break through?”<br/><br/>In the Dragon King Hall of the Dragon Palace, Prime Minister Gui asked Wang Xian, who was checking the resources!<br/><br/>“Let bei Shuang’s strength break through again!”<br/><br/>Wang Xian pondered for a moment and said!<br/><br/>This time, they had obtained enough resources to allow the mutated divine dragon in the Dragon Palace to reach the peak of the Universe Knight Realm!<br/><br/>Once they reached the peak of the Universe Dominator realm, they would truly be comparable to the masters of the universe!<br/><br/>Their strength was stronger than Wang Xian and Ling Honggu!<br/><br/>After all, this was a mutated divine dragon!<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded.<br/><br/>To elevate bei Shuang to the peak of the Universe Knight realm, he would need to consume the corpses of 10 universe masters with level three combat strength!<br/><br/>However, it was all worth it!<br/><br/>Bei Shuang’s elevation did not mean that the Dragon Palace had produced an expert at the Universe Dominator realm.<br/><br/>The Dragon Palace was still unable to elevate to the peak of the race!<br/><br/>The symbol of the peak of the race was a Master of the universe!<br/><br/>However, Wang Xian still remembered one sentence. Even if there were a few masters of the universe in the Dragon Palace, it was best not to expose them!<br/><br/>This was the advice of the Elf race to him!<br/><br/>Although Wang Xian did not know the reason, the elf race would not lie to him!<br/><br/>This time, after bei Shuang’s improvement, the strength of the Dragon Palace would receive another huge improvement!<br/><br/>After all, after bei Shuang’s improvement this time, she would not be at a disadvantage if she were to face an expert who was at the level of the Master of the universe!<br/><br/>“If the Tai Chi Dragon Plate can achieve a breakthrough, it should be no problem for me to fight against the Archangel Baili!”<br/><br/>Wang Xian’s gaze landed on the spot in front of him. The Tai Chi Dragon Plate was rapidly absorbing the innate spiritual treasures one by one!<br/><br/>The Yin and Yang were reversed. The innate spiritual treasures turned into energy and gathered inside. Every time the tai chi dragon plate absorbed an innate spiritual treasure, its luster became more profound!<br/><br/>Wang Xian was looking forward to the breakthrough of the Tai Chi Dragon Disc!<br/><br/>In the following period of time, the universe’s AI was still bustling with activity.<br/><br/>In the Dragon Palace, all the strong disciples of the Dragon Palace were improving their strength!<br/><br/>Halfway through, the strong practitioners of the ancestral dragon lineage arrived, but Wang Xian did not see them!<br/><br/>Now, the improvement of the Tai Chi Dragon Disc was the most important thing!<br/><br/>Once the Tai Chi Dragon Disc made a breakthrough, Wang Xian would have the confidence to face any schemes and tricks of the Holy Dragon lineage!<br/><br/>Even if the Angel clan gave the Holy Dragon King and the rest powerful innate treasures, he would still be able to find more helpers for them!<br/><br/>He was confident that he could deal with them!<br/><br/>Time passed day by day. The absorption rate of the innate spiritual treasures was very fast. Basically, he could absorb ten of them in a day!<br/><br/>However, it would still take more than half a year to absorb all of them!<br/><br/>Wang Xian used the time when the tai chi dragon plate absorbed the innate spiritual treasures to devour some of the resources on his own!<br/><br/>Hence, in the Dragon King’s Hall, Wang Xian transformed into a huge divine dragon and was absorbing a huge amount of resources!<br/><br/>Above him, the Tai Chi Dragon Disc was absorbing the innate spiritual treasures one by one!<br/><br/>Time passed very quickly. One month later, Wang Xian’s absorption was over.<br/><br/>Just as he expected, he was still lacking some resources before he could improve!<br/><br/>There were too many attributes. Sometimes, the amount of resources required would also be multiplied!<br/><br/>Time passed very quickly. Nine months was just a small amount of time for comprehension and cultivation!<br/><br/>“Hum!”<br/><br/>On this day, when the Tai Chi Dragon disk absorbed 2,000 innate supreme treasures, the transformation came!<br/><br/>“Roar!”<br/><br/>Roars came from the Tai Chi Dragon Disk!<br/><br/>The tai chi yin-yang eyes that represented the Dragons of darkness and light emitted dazzling light!1<br/><br/>The surrounding energy surged towards them crazily!<br/><br/>The two divine dragons seemed to be absorbing all the light and darkness, absorbing them into their bodies!<br/><br/>Following that, the light and darkness were completely absorbed into the yin-yang eye, the body of the Divine Dragons of light and darkness!<br/><br/>Waves of terrifying energy came from their bodies!<br/><br/>The two divine dragons slowly intertwined together, slowly fusing together!<br/><br/>The strange thing was that the two divine dragons began to merge and slowly merged into a divine dragon!<br/><br/>However, the surface of their bodies looked a little strange!<br/><br/>Darkness and light were irregularly located on the body of this divine dragon!<br/><br/>The two eyes and the two dragon horns were one light and one darkness respectively!<br/><br/>But the strange thing was that the dragon horns on the eye of light were indeed dark dragon horns!<br/><br/>The Light Dragon Horn on the Eye of darkness was indeed a bright dragon horn!<br/><br/>It was very strange, but the energy contained in it was extremely terrifying!<br/><br/>Slowly, the body of this divine dragon started to take shape and once again took the shape of a Taiji dragon coil!<br/><br/>The Taiji Dragon Coil spun slowly and was slightly illusory. In the next moment, it flew towards Wang Xian’s body!<br/><br/>Under the gaze of Wang Xian, the Taiji dragon coil landed on his clothes and covered him!<br/><br/>A Yin-yang divine dragon coiled around his entire body, making him look like a divine dragon!<br/><br/>“I’ve made a breakthrough!”<br/><br/>Wang Xian looked at his body with excitement in his eyes!<br/><br/>This transformation was definitely a qualitative transformation for the Tai Chi Dragon Coil!<br/><br/>He could feel the strength of the Tai Chi Dragon Coil.<br/><br/>It was so powerful that it was almost indestructible!<br/><br/>There was also a hint of strangeness!<br/><br/>“Good, good. Among those of the same level, I can be said to be invincible and undefeatable!”<br/><br/>Wang Xian felt the strength of the Tai Chi Dragon Plate and his eyes were filled with excitement!<br/><br/>The current him could easily kill the spirit red bone!<br/><br/>He had the advantage of speed and an invincible defense. Unless the spirit red bone continued to defend, he would be easily killed by Wang Xian!<br/><br/>In addition, Wang Xian realized that the breakthrough of the Taiji Dragon Plate this time had a few more powerful abilities compared to the past!<br/><br/>Offensive power!<br/><br/>The current Taiji Dragon Plate had a strong offensive power!<br/><br/>The Divine Light Dragon and the Divine Dark Dragon were not defensive divine dragons in the first place. They were merely the combination of yin and yang. The circulation of Yin and Yang formed a terrifying defense!<br/><br/>In fact, the Divine Dragon of light and the Divine Dragon of darkness were extremely powerful in their attacks!<br/><br/>Currently, if Wang Xian were to control the Taiji dragon disc to fight, the Taiji Dragon disc alone would be able to easily suppress the masters of the universe!<br/><br/>Other than that, there was another powerful ability!<br/><br/>It was called the yin-yang space.<br/><br/>The Taiji Dragon disc covered him, making him feel as though he was in another space.<br/><br/>This had a huge effect!<br/><br/>It was to be free from dust and karma!<br/><br/>It was also to be able to ignore any attacks such as curses!<br/><br/>Of course, there was a prerequisite. It could only withstand the attacks of an ancestral wizard at the first level of the Universe Dominator!<br/><br/>“It’s too powerful. The breakthrough of the Tai Chi Dragon disc is like the difference between a connate numinous treasure and a connate supreme treasure. It’s powerful and invincible!”<br/><br/>Wang Xian mumbled to himself. His eyes were filled with excitement!<br/><br/>The current him was in the realm of the Master of the universe. He was confident that he was invincible and undefeatable!<br/><br/>Who Dared to say that he was invincible? Who Dared to say that he was undefeatable?<br/><br/>He dared!\t\t\t\t\t\t</div>", "images": {}, "success": true}