{"id": 614, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073129.html", "title": "Chapter 3605 - 3605 3604 Arrogant Supreme Water Monster King!", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3605 - 3605 3604 Arrogant Supreme Water Monster King!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3605 3604 arrogant Supreme Water Monster King!<br/><br/>“Go Report to the Supreme Water Monster King, and then we’ll go out!”<br/><br/>Baili looked at the confident and arrogant old scholar and said!<br/><br/>“The Supreme Water Monster King is in the Supreme Water Palace, and there’s a teleportation formation on the mountain of books. Let’s go through the teleportation formation!”<br/><br/>The old scholar said indifferently and directly flew toward a teleportation formation!<br/><br/>The Archangel Baili and the others immediately followed behind him and arrived in front of the teleportation formation to start the teleportation!<br/><br/>* Buzz! *<br/><br/>After they were teleported, they immediately arrived at a slightly noisy place!<br/><br/>The Supreme Water Hall!<br/><br/>It was different from the place where the Black Tower Magi and the mountain of books were located. This place was obviously much more lively!<br/><br/>This was a group of dilapidated palaces in the void, and there were many palaces!<br/><br/>And around this dilapidated palace, there were many new palaces, and many demon beasts were flying around!<br/><br/>These demon beasts were all the descendants of the Supreme Water Demon King!<br/><br/>In the invincible zone, the Supreme Water Demon King was an exception.<br/><br/>He loved to fight, and he fought very crazily!<br/><br/>He had once fought with the old scholar, and no one knew the result of the battle. But the experts of the invincible zone only knew that both sides had been silent for hundreds of millions of years before they came out!<br/><br/>After coming out, supreme water demon Emperor became even more wanton, bringing many female demon beasts into the invincible region.<br/><br/>These female demon beasts gave birth to many, many descendants for him.<br/><br/>In the invincible region, only he alone occupied a domain, claiming to be the distant observer!<br/><br/>At the same time, in these endless years, after he had not broken through for a very, very long time, he began to nurture his own descendants with potential!<br/><br/>Out of all his descendants, ten great beings with the Combat Power of universe masters at level three had been born, and all of them were extremely powerful!<br/><br/>Tai Shui Demon Emperor even had a famous son, who was extremely powerful.<br/><br/>He had once killed five universe masters with the Combat Power of level three!<br/><br/>This had also made Tai Shui Demon Emperor’s reputation soar!<br/><br/>At the same time, he was also amazed at how Tai Shui Demon Emperor had nurtured so many powerful descendants!<br/><br/>“Archangel Baili, right? Our Monster King of the Taishui Empire invites you!”<br/><br/>Just as Archangel Baili and the others teleported over, a monster beast flew over and said to them!<br/><br/>“Lead the way!”<br/><br/>Archangel Baili said indifferently!<br/><br/>The monster beast nodded and immediately led the way, flying towards a palace in the center!<br/><br/>“TSK TSK, in the invincible region, only the monster king of the Taishui Empire is so high-profile. He occupies such a large area. Sooner or later, he will be slaughtered here!”<br/><br/>The old scholar’s face suddenly changed!<br/><br/>This face seemed to be a lot more ferocious.<br/><br/>“Hehe, maybe one of the descendants of the supreme water demon king will give birth to a ruler of the universe. After all, the probability of having more of them is much higher than ours!”<br/><br/>The Black Tower Magus looked around. In his green eyes, all the demon beasts around him were filled with dense blood qi.<br/><br/>They looked like devils from hell!<br/><br/>As the two of them spoke, they soon arrived in front of a large hall.<br/><br/>“Archangel Baili, our supreme water demon king is inside. Please come in!”<br/><br/>He led the Demonic Beasts to the front of the hall and gestured at them!<br/><br/>The expression on the Archangel’s face did not change as he flew forward!<br/><br/>* Boom! *<br/><br/>However, just as he passed through a large hall, an incomparably terrifying fist attacked the Archangel!<br/><br/>Sensing the power of this fist, his expression changed slightly!<br/><br/>His 12 wings immediately blocked the front, forming a powerful defense!<br/><br/>“Hong!”<br/><br/>The fist landed on the defense of his 12 wings, causing his body to tremble slightly, and his eyes flashed with a trace of solemnity!1<br/><br/>“Hahaha, as expected of a universe overlord realm expert. This fist of mine is still far from being able to kill him!”<br/><br/>Right at this moment, an extremely arrogant voice came from the palace!<br/><br/>A trace of anger flashed in the eyes of the Great Angel, Bai Lie, as he looked ahead with a cold gaze.<br/><br/>Provoking a universe ruler was something he could do in the invincible region!<br/><br/>His gaze landed on a throne at the end of a long road, where an incomparably burly demon beast was sitting!<br/><br/>Its head looked like beef, and its body was huge. It had a pair of horns, and its body was emitting a blue light!<br/><br/>Its face looked ugly as if it had fish scales growing on it!<br/><br/>“Let me test your strength. Are you qualified?”<br/><br/>With a cold glint in his eyes, the Archangel Baili waved his arm, and the twelve wings on his hand condensed into a sharp spear of judgment!<br/><br/>The spear of judgement shot towards the supreme water demon king at a terrifying speed!<br/><br/>Apart from not using any innate supreme treasures, he did not hold back at all!<br/><br/>A full-powered attack!<br/><br/>“Haha, Good!”<br/><br/>The supreme water demon king looked at this terrifying attack and a terrifying battle intent burst out from his eyes. He extended his arm and as if the starry sea had gathered on his fist, he met the spear of judgement head-on!<br/><br/>“Boom!”<br/><br/>The judgement spear collided with his fist, and his fist slowly absorbed the judgement spear!<br/><br/>The Fist absorbed all rivers!<br/><br/>Following that, his fist disappeared, but so did the spear!<br/><br/>Seeing this scene, the eyes of the Baili Archangel narrowed slightly!<br/><br/>“As expected of the Supreme Water Demon King.”<br/><br/>He said with a solemn expression!<br/><br/>His full-strength attack was actually blocked by the Supreme Water Demon King!<br/><br/>In other words, the supreme water monster king was not weaker than him!<br/><br/>“Hehe, as expected of the Supreme Water Monster King, twice mutated, Strong!”<br/><br/>The half of the old scholar’s ferocious face moved, and he said!<br/><br/>“It’s okay. Anyway, I will definitely advance one step before the calamity!”<br/><br/>The Supreme Water Monster King said with confidence, and his eyes stared at the old scholar, “At that time, I will use you as a stepping stone!”<br/><br/>“Hehe, before the Apocalypse? By that time, we will be two realms apart.”<br/><br/>The old scholar said indifferently, his face full of strong confidence!<br/><br/>That kind of confidence seemed to make him invincible!<br/><br/>“Taishui Monster King, have you received the News?”<br/><br/>Baili Archangel took a deep breath and said to the TAISHUI Monster King!<br/><br/>“I have received it. Leave the Dragon King to me. One on one, we will be the Dragon Slayer!”<br/><br/>The Supreme Water Demon King licked his lips and said!<br/><br/>“Hehe, the Divine Dragon Clan is the overlord of the water, the king of the ocean, the supreme water demon king. Can you do it?”<br/><br/>The Black Tower Wizard looked at the Supreme Water Demon King and said with a smile!<br/><br/>The Divine Dragon Clan was once the overlord of the ocean. Even the various space beasts in the mountains and seas were afraid of them!<br/><br/>The supreme water demon king was like a small fish in the eyes of the Divine Dragon Clan. It was not worth mentioning!<br/><br/>All creatures of the water race respected the divine dragons!<br/><br/>“Magus of the Black Tower, do you want me to give it a try?”<br/><br/>The supreme water demon king stared at the Magus of the black tower, his eyes flashing with battle intent!<br/><br/>“If you can give me enough compensation, I can train with you!”<br/><br/>The Magus of the black tower calmly replied, his green pupils unusually strange!\t\t\t\t\t\t</div>", "images": {}, "success": true}