{"id": 621, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073143.html", "title": "Chapter 3612 - 3612 3,611 Seconds, Destroy! Down", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3612 - 3612 3,611 Seconds, Destroy! Down</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3612 3,611 seconds, destroy! down<br/><br/>The killing intent of the demon Aksu suddenly erupted without any warning!<br/><br/>The terrifying killing intent caused the surrounding seawater to surge!<br/><br/>Aksu, the three Darkness Angels and the underworld race warriors, although they weren’t as strong as the water demon king.<br/><br/>But they weren’t ordinary Level 3 universe overlords that could compare!<br/><br/>They had lived for a long time and were confident that they could kill two people of the same level in a battle!<br/><br/>It would be no problem for one person to deal with three to four people of the same level!<br/><br/>Not to mention the fact that the five of them were working together. That would be even more terrifying!<br/><br/>“Is there something wrong with these guys?”<br/><br/>Wang Xian looked at the demon Akesu and was stunned. He could not help but ask!<br/><br/>Is this the entrance of the Dragon Palace?<br/><br/>This is the territory of the Dragon Palace!<br/><br/>Is He that arrogant?<br/><br/>When the elves heard Wang Xian’s words, they were puzzled.<br/><br/>Are they arrogant?<br/><br/>Isn’t that normal?<br/><br/>The five of them were an old monster from the invincible zone. He possessed the physique and bloodline of a peak race!<br/><br/>With the five of them working together, they could basically do whatever they wanted without going to the technological world in the inner land!<br/><br/>“Kill them!”<br/><br/>After Wang Xian finished his sentence, he sensed that the three dark angels and the Hades tribe expert were getting restless. He immediately gave the order!<br/><br/>As soon as he finished his sentence, the sky around the Dragon Palace immediately changed!<br/><br/>All of a sudden, this place seemed to have turned into a new world!<br/><br/>Numerous gigantic dragon pillars appeared around them. There were a total of forty-five dragon pillars. On each Dragon Pillar was a divine dragon!<br/><br/>On the body of this divine dragon was a thick chain!<br/><br/>When everything began to change, the forty-five divine dragons began to move.<br/><br/>Without any hesitation, they attacked the three dark angels, the demons, and the underworld race experts at a terrifying speed!<br/><br/>This sudden and terrifying change made the demon Aksu, who was bursting with a terrifying murderous aura, freeze. His pupils instantly widened as he stared at his surroundings in shock!<br/><br/>“Not good, this is a formation. There are a lot of formations here!”<br/><br/>When the three dark angels saw this sudden change, their expressions also changed drastically. Panic appeared in their eyes!<br/><br/>Only the people from the Dragon Palace were slightly speechless as they looked at the five experts from the peak races!<br/><br/>They did not understand why an old monster who had lived for so long would be so stupid?<br/><br/>This should not be the case!<br/><br/>Generally speaking, which old monster who had lived for billions of years was not proficient in calculations and extremely cunning?<br/><br/>These five were simply idiots!<br/><br/>Coming to the Dragon Palace’s territory to be arrogant, this did not even require the Dragon Palace’s experts to act!<br/><br/>Just the formation they set up was enough to kill it!<br/><br/>Even if they were old monsters, they should never underestimate a formation wizard!<br/><br/>Even if you were old monsters, you wouldn’t be a match for an ordinary formation wizard who had set up a formation!<br/><br/>Once the sky formation was set up, he wouldn’t be afraid even if ten universe masters with level 3 battle strength were to fight him!<br/><br/>This was the terror of a wizard!<br/><br/>Take the Black Tower Wizard’s lair, where Baili the Archangel was fighting him. The result would definitely be Baili’s death!<br/><br/>The Dragon Palace now had eight Dragon Wizards who had reached the Pinnacle Universe Knight Realm!<br/><br/>Along with the sky array…<br/><br/>The most important thing was that this was their Dragon Palace’s base, and the array set up around it was naturally extremely terrifying!<br/><br/>These five fellows, weren’t they courting death?<br/><br/>“They’re overconfident, there are many powerful wizards in the Dragon Palace!”<br/><br/>More than ten elven powerhouses saw this scene and pursed their lips.<br/><br/>The formation that appeared in an instant was too terrifying!<br/><br/>Even they didn’t expect the Dragon Palace to have such a terrifying formation!<br/><br/>It was no Wonder Aksu and the others were so arrogant!<br/><br/>The strength of the five of them working together was very strong.<br/><br/>Although they knew that the Dragon King of the Dragon Palace could instantly kill experts of the same level and that the Dragon Palace had more than 50 masters of the universe ruler realm, they could immediately escape if they couldn’t defeat them!<br/><br/>They were confident that they could escape!<br/><br/>However, now, they didn’t have any confidence!<br/><br/>The array formation of the Dragon Palace was too terrifying!<br/><br/>“Oh no, block it! Break this array formation!”<br/><br/>“How can the dragon palace have so many terrifying arrays?”<br/><br/>The three dark angels revealed a shocked expression and roared angrily!<br/><br/>They spread out their ten pairs of wings and blocked the attacks of the 45 divine dragons!<br/><br/>Boom! Boom! Boom<br/><br/>However, in the next moment, the godly dragons attacked them one by one!<br/><br/>Each godly dragon was as powerful as a full-power attack from a level-3 universe master!<br/><br/>At this moment, they were able to withstand the attacks of 45 Level-3 Universe Masters!<br/><br/>And they couldn’t Dodge the attacks!<br/><br/>“Not good, not good!”<br/><br/>When the expert from the nether race saw this scene, a look of shock appeared on his face!<br/><br/>His body trembled. Around him, there were actually four nether ghost avatars. Each of them was filled with a terrifying aura!<br/><br/>The strength of the nether race experts was usually related to the strength and number of their Nether Ghost Avatars!<br/><br/>And he had four avatars. Each of them had reached the peak of his original body!<br/><br/>“Huh?”<br/><br/>Wang Xian’s eyes flickered slightly when he saw the four netherspirit clones!<br/><br/>“Trap the expert of the Netherworld race!”<br/><br/>He spoke to the Heaven Array behind him!<br/><br/>“It’s the Dragon King!”<br/><br/>A terrifying attack. Ten of the forty-five divine dragons were shackled to the Netherworld race expert and his clones at the same time!<br/><br/>“No!”<br/><br/>When the Netherworld race expert saw the ten divine dragons attacking him, despair appeared on his face!<br/><br/>He couldn’t withstand ten divine dragons!<br/><br/>Boom! Boom! Boom<br/><br/>At the side, the impact of the Divine Dragons had already landed on the three angels and the demon!<br/><br/>A terrifying explosion rumbled in the space. The energy of the nine attributes made it impossible for them to see what was happening inside clearly!<br/><br/>However, they could clearly sense that the vitality of the three angels and the demon was declining rapidly!<br/><br/>After a round of attacks, Wang Xian was surprised that their life force didn’t disappear completely!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>At the back, Mu Zesen and the four dragon-type archers took out their bows and arrows. The terrifying arrows flew straight into the area!<br/><br/>“Ah!”<br/><br/>A miserable scream was heard. The three dark angels and the demon were killed immediately!<br/><br/>The Dark clan expert was completely trapped!<br/><br/>Immediately, 10 experts from the Dragon Palace flew over and captured him!<br/><br/>“Arrow Dragon Seed!”<br/><br/>The elves looked over, their eyes shining as they looked at Mou Zesen and the others!<br/><br/>The Arrow Dragon Seed was one of the few existences in the universe that could rival the Archers of the ELF race!<br/><br/>Of course, in the eyes of the elf race, their archery skills were invincible in the universe!<br/><br/>This was because the archery dragon’s long-range attacks were powerful, but close combat was not!<br/><br/>In a real fight, the archery dragon would not let the elf archers get close, and it was 50-50!<br/><br/>Once they got close, the archery dragon would definitely die!<br/><br/>“Dead, there are Magi in the Dragon Palace, at least ten powerful Magi!”<br/><br/>Glancing at the archery dragon, they looked towards the center!<br/><br/>Three Dark Angels and a demon were killed just like that!<br/><br/>And the experts of the Netherworld race were directly captured alive!<br/><br/>The whole process only took three seconds!\t\t\t\t\t\t</div>", "images": {}, "success": true}