{"id": 629, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073159.html", "title": "Chapter 3620 - 3620 3619, I Am Invincible. Therefore, All Of You Shall Die! Go", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3620 - 3620 3619, I Am Invincible. Therefore, All Of You Shall Die! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3620 3619, I am invincible. Therefore, all of you shall die! Go<br/><br/>“Huh?”<br/><br/>“Huh?”<br/><br/>“Huh?”<br/><br/>Wang Xian’s words stunned everyone. Be it the Black Tower’s Magi or the experts from the invincible region, they were all slightly stunned!<br/><br/>So arrogant?<br/><br/>So arrogant?<br/><br/>Did he have a trump card?<br/><br/>The Holy Dragon King and the rest were also slightly stunned. Their pupils contracted as they sized up the surroundings of the Dragon Palace. Their gazes landed on the elves!<br/><br/>This was their territory?<br/><br/>The elves were not allowed to participate in the war between them!<br/><br/>“Dragon King of the Dragon Palace? Very arrogant. I also want to ask if your dragon palace still has any trump cards and if there are any powerhouses at the level of the mutated Divine Dragon.”<br/><br/>The Black Tower Wizard stared at Wang Xian. With a move of his palm, he took out a compass!<br/><br/>There were only six red dots on this compass. He glanced at it indifferently and smiled!<br/><br/>“That’s all. It’s all on display. What about you guys?”<br/><br/>Wang Xian smiled and replied truthfully!<br/><br/>“We’re gone too. I’m the last one, so you guys are going to be destroyed!”<br/><br/>The wizard from the Black Tower stared at Wang Xian with his green eyes. He then looked at the elves and said, “The elves are not allowed to participate in our war, right?”<br/><br/>“Of course!”<br/><br/>The ELF experts nodded their heads!<br/><br/>They were not allowed to participate, even if it was an excuse to be a guest in the Dragon Palace and not to disturb us!<br/><br/>This was because there were old monsters from the Angel clan around. They were allowed to participate.<br/><br/>However, the old monsters from the Angel clan would also participate!<br/><br/>“Dragon King, take care of yourselves. If there’s no other way, just run away and come to our Elf clan!”<br/><br/>They spoke to Wang Xian before flying to the side!<br/><br/>“Everyone, don’t Worry!”<br/><br/>Wang Xian gestured to them with a smile on his face!<br/><br/>How could he not be happy when someone came to deliver resources to the Dragon Palace!<br/><br/>The experts from the invincible zone were indeed very strong!<br/><br/>However, if there were only three words, then sorry, none of them would be able to leave!<br/><br/>If there were four of them, none of them would be able to leave. However, if there were five words, they would be able to leave!<br/><br/>This was because Wang Xian could only fight against three at most!<br/><br/>This was his limit!<br/><br/>The strength of the supreme water demon king and the old scholar had indeed exceeded his expectations!<br/><br/>However, not long ago, Wang Xian’s strength had increased a little. He now had an additional netherspirit Avatar!<br/><br/>Therefore, he did not panic at all!<br/><br/>“Are you very confident?”<br/><br/>As the Black Tower Wizard spoke, he approached the Dragon Palace. The Holy Dragon King and the clan leader of the shepherd God clan followed behind him!<br/><br/>“The spell formation of your Dragon Palace is indeed very strong. It seems that you have many spell formation wizards who are at the peak of the Universe Knight Realm. If this spell formation were to unleash its full power, even the supreme water demon king would not be able to withstand it. Unfortunately, you have encountered a wizard from the Black Tower. Therefore, your trump card is useless!”<br/><br/>The wizard from the Black Tower stared at Wang Xian and said with a smile!<br/><br/>However, coupled with his green pupils, his smile gave off a sinister feeling!<br/><br/>“What?”<br/><br/>Wang Xian didn’t seem to have changed much after hearing his words. However, at the side, the expressions of the sky formation and a few dragon wizards changed drastically!<br/><br/>They were dragon wizards who specialized in formations. How could the wizard from the Black Tower say that their formations were useless?<br/><br/>“How is this possible? The formation we set up actually failed. When did the other party break it?”<br/><br/>A Dragon Wizard sensed it and his expression changed. He couldn’t help but Exclaim!<br/><br/>As top-tier Dragon Wizards of the Dragon Palace and peak universe knights, they didn’t even know that the formation they set up had been broken!<br/><br/>The other party’s methods shocked them!<br/><br/>The other party’s control over the formation also shocked them!<br/><br/>Even the sky formation was filled with a solemn expression!<br/><br/>This Black Tower Magus was extremely terrifying!<br/><br/>He was not a match for him at all!<br/><br/>“HMM? The Dragon Palace’s spell formation can actually fight against an expert like the Grand Aquatic Demon King?”<br/><br/>The Sacred Dragon King and the others followed behind. When they heard the Black Tower Magus’words, their faces were filled with shock and excitement!<br/><br/>They were shocked by the power of the Dragon Palace’s spell formation, but they were excited by how terrifying the Black Tower Magus was!<br/><br/>The Dragon King of the Dragon Palace was so confident. It must be because of the Dragon Palace’s spell formation that he dared to be so arrogant!<br/><br/>Now that the spell formation had disappeared and the black tower magi were so terrifying, the Dragon Palace was just waiting to die!<br/><br/>Their faces were filled with malevolence!<br/><br/>When the experts and disciples of their race were killed, they would capture all the non-purebred divine dragons of the Dragon Palace and torture them continuously!<br/><br/>They would torture them for tens of millions of years, hundreds of millions of years, to pay tribute to the experts and disciples of their race!<br/><br/>“In the invincible region, other than that crazy old witch, the Black Tower Magi are probably the strongest in terms of formations!”<br/><br/>“For an old monster of his level, unless the ancestral magi arrive, even the disciples and grand-disciples of the ancestral magi are no match for him!”<br/><br/>“The Black Tower Magi are truly terrifying. They took care of the Dragon Palace’s formation in the dark. The Dragon Palace’s formation should be one of their trump cards. Now that it’s gone, they’re probably finished!”<br/><br/>Some of the Old Monsters of the invincible region discussed and evaluated!<br/><br/>“The battle has begun. Seal, seal, and open a new space!”<br/><br/>The Black Tower Magus continued to speak with a smile. With a wave of his hand, a round ball flew out!<br/><br/>This was a sealing treasure given to them by the third prince!<br/><br/>Even the Black Tower Magus was slightly envious!<br/><br/>It was a pity that they could only use it with the third Prince’s restrictions!<br/><br/>This treasure was an innate true treasure that could seal space!<br/><br/>After the new space was opened, if they wanted to close it, they had to master this innate true treasure!<br/><br/>Of course, there was another way, to break it by force!<br/><br/>If one wanted to break it open by force, more than ten universe masters with level-three combat power could do it!<br/><br/>However, they needed to attack for dozens of seconds. Obviously, they wouldn’t give Dragon Palace this chance!<br/><br/>Usually, the supporting innate true treasures were all very powerful!<br/><br/>If the third prince himself controlled the innate true treasure to open the new space, then even a true universe master wouldn’t be able to open it!<br/><br/>The power of the innate true treasure was related to the strength of the user!<br/><br/>“Damn it, they want to use a powerful true treasure to seal this space, we can’t see anything!”<br/><br/>“A good challenge turned into extermination, the black tower wizards naturally want to seal the entire space, but unfortunately, we can’t see anything!”<br/><br/>“Disappointing, I was thinking of watching the Battle of top-tier Great Beings, but now I can’t see anything!”<br/><br/>When the Black Tower’s Wizards took out their innate treasures to seal this space, all the old monsters from the invincible zone shook their heads helplessly!<br/><br/>Naturally, they couldn’t let the Dragon Palace’s strong disciples escape after their entire clan was exterminated. It was normal for them to seal this space.<br/><br/>However, it was such a pity for them!<br/><br/>They hadn’t seen much of this battle yet!<br/><br/>If it was a life and death battle, they could still see some powerful combat abilities and techniques.<br/><br/>But now, they couldn’t see anything!<br/><br/>“Oh?”<br/><br/>Wang Xian saw that the other party had sealed off this space. He raised his eyebrows slightly. Very good, he liked it!<br/><br/>A group of guys came from thousands of miles away to deliver their heads. They even added a door to prevent him from escaping!<br/><br/>Hehe!<br/><br/>Good guy!\t\t\t\t\t\t</div>", "images": {}, "success": true}