{"id": 625, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073151.html", "title": "Chapter 3616 - 3616 3615 Mutated Divine Dragon Vs Two Mutated Demon Kings", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3616 - 3616 3615 Mutated Divine Dragon Vs Two Mutated Demon Kings</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3616 3615 mutated divine dragon vs two mutated demon kings<br/><br/>“HMM?”<br/><br/>Bei Shuang made a move and challenged Wang Xian to a battle. His eyes flickered slightly!<br/><br/>“That’s good too. You have just broken through not long ago. Why Don’t you temper yourself? I want to see how strong the old monster from the Invincible Zone is!”<br/><br/>Wang Xian did not reject.<br/><br/>The punch of the supreme water demon king was indeed very strong. It definitely reached the standard of a Master of the universe!<br/><br/>However, bei Shuang’s move blocked it directly!<br/><br/>In addition, bei Shuang had just broken through not too long ago. It was just the right time for her to give it a try.<br/><br/>Let this Taishui demon king be the Whetstone for her disciple!<br/><br/>If bei Shuang couldn’t do it, then Wang Xian would kill her!<br/><br/>“Eh?”<br/><br/>“This is? What a powerful aura, what a powerful ice-sealing force. It’s rumored that there’s a lady in red in the Dragon Palace who also has the strength to instantly kill a master of the universe with a level three combat strength. Is this the one?”<br/><br/>“This lady from the Dragon Palace is terrifying, but it seems to be different from the one in the universe ai!”<br/><br/>The elves who were watching from the side were shocked when they saw bei Shuang’s attack and how he blocked the attack of the Supreme Water Demon King!<br/><br/>This was the disciple of the Dragon King?<br/><br/>The other powerful warrior from the Dragon Palace mentioned in the universe ai?<br/><br/>“Little Demon King, how dare you act so impudently in front of our Dragon Palace. You want to challenge my master? You Don’t have the qualifications yet. Go Through Me First!”<br/><br/>Bei Shuang’s eyes were filled with excitement when she saw Wang Xian nodding his head.<br/><br/>She moved her body and charged straight towards the Tai Shui Demon King!<br/><br/>“Roar!”<br/><br/>At the same time, she raised her head and roared. Her entire body instantly turned into an ice-cold divine dragon!<br/><br/>Under the light, she was as beautiful as a diamond!<br/><br/>But more than that, she was powerful and terrifying!<br/><br/>Mutated Dragon, Ice Dragon!<br/><br/>“Mutated Dragon!”<br/><br/>More than 10 elves were shocked when they saw the ice transformation!<br/><br/>The mutated dragon was comparable to the royal family of their Elf race!<br/><br/>This was the pinnacle of the Pinnacle Race!<br/><br/>“HM? Ice Dragon, mutated dragon, Ice Dragon!”<br/><br/>“This Dragon Palace actually has a mutated dragon? Aren’t there only Dragon Palace Dragon King and a lady in red? The disciple of the Dragon King, a peak universe Knight Frost Dragon!”<br/><br/>“The Frost dragon is definitely a terrifying existence!”<br/><br/>When bei Shuang rushed over, the group of old monsters from the invincible region revealed shocked expressions!<br/><br/>Even some of the old monsters from the peak races had envious expressions in their eyes!<br/><br/>When the mutated divine dragon was at the peak of the Divine Dragon Clan, it would definitely become the overlord of a region!<br/><br/>“The disciple of the Dragon King? The Dragon Palace not only has the Dragon King and the lady in red, but there’s also a powerful mutated divine dragon?”<br/><br/>The Dragon Palace’s attack on the three great races was too far away and the energy was too terrifying, so the matter of the mutated Divine Dragon was not publicized!<br/><br/>Now that bei Shuang had appeared, many of the powerful disciples who came to watch the battle were shocked!<br/><br/>The strength of the Dragon Palace was even more terrifying than they had imagined!<br/><br/>“Eh? The disciple of the Dragon King? Are you looking for death, Little Dragon Cub? Are you looking down on me?”<br/><br/>The Tai Shui Demon King saw a frost divine dragon charging towards him. When he heard her words, a dark expression appeared on his face as he roared angrily!<br/><br/>He moved his hand and an azure blue glove appeared in his hand. His eyes were filled with killing intent as he stared at bei Shuang!<br/><br/>“Mutated purebred frost dragon, I will kill you now!”<br/><br/>The Supreme Water Demon King moved, carrying a terrifying might as he charged towards bei Shuang!<br/><br/>“Roar Roar!”<br/><br/>Bei Shuang transformed into a frost dragon, freezing the seawater in her path.<br/><br/>The Frost Dragon was also skilled in close combat!<br/><br/>She swayed her huge body as her dragon claws clawed towards the Supreme Water Demon King!<br/><br/>The enlarged supreme water demon king was also hundreds of thousands of meters in size. Her fists and Dragon Claws collided!<br/><br/>“Bang!”<br/><br/>An explosive collision sounded as northern Frost’s body could not help but fly backwards. However, at this moment, she adjusted her dragon might and swept towards the Supreme Water Demon King!<br/><br/>“Boom!”<br/><br/>A terrifying collision occurred as the Supreme Water Demon King’s arm smashed towards the dragon’s tail. This time, the Supreme Water Demon King’s body was sent flying backwards!<br/><br/>“Ka Ka Ka!”<br/><br/>Bei Shuang’s eyes revealed a serious expression. Without any pause, the surrounding river water condensed into terrifying ice arrows and shot towards the Supreme Water Demon King!<br/><br/>“Good, good, good. As expected of a mutated divine dragon. You have the qualifications to exchange blows with me!”<br/><br/>The supreme water demon king felt bei Shuang’s strength and his eyes were filled with brutality. With a loud roar, the ice arrow that was charging towards him turned into river water and shot towards bei Shuang!<br/><br/>“Law projection, frozen suffocation!”<br/><br/>Bei Shuang raised his head and spat out a mouthful of dragon breath. A wave of white energy swept forward!<br/><br/>“Look at my fist!”<br/><br/>The Supreme Water Demon King roared. The fist in his hand was like the sound of waves as it directly attacked the freezing breath!<br/><br/>“Crack Crack Crack!”<br/><br/>The sound of explosions could be heard.<br/><br/>“Sea explosion, explode for me!”<br/><br/>He roared again. The surrounding river water started to move and directly attacked bei Shuang!<br/><br/>“Freeze!”<br/><br/>Bei Shuang’s eyes revealed a serious expression. An extremely cold aura was emitted from her body. The river water that was surging towards her was slowly frozen!<br/><br/>“Hahaha, Tai Shui is furious!”<br/><br/>The Tai Shui Demon King laughed maniacally as his body expanded once again. The frozen river water slowly split apart as he charged towards bei Shuang’s melee attack!<br/><br/>This time, his attack was even more violent. The river water around him surged up as his every move carried a heaven-shaking might!<br/><br/>“This guy is very strong. He’s not weaker than the hundred bird men. Bei Shuang is in trouble!”<br/><br/>In front of the Dragon Palace, the Water Touch King looked at the battle in front of him. His pupils contracted slightly as he spoke!<br/><br/>“He is indeed worthy of being a double mutated existence. He is indeed terrifying!”<br/><br/>Wang Xian nodded his head in agreement!<br/><br/>“I didn’t expect there to be such a powerful expert at the peak of the Universe Knight Realm in the Universe.”<br/><br/>Beside him, Ling Honggu also frowned slightly!<br/><br/>She thought that her strength should be invincible at this level, but the appearance of Tai Shui Demon King shocked her!<br/><br/>Bei Shuang’s strength was not weaker than hers, or even stronger!<br/><br/>“The Frost Dragon of the Dragon Palace is very strong!”<br/><br/>“As expected of Tai Shui Demon King, this strength can indeed dominate an area in our invincible region, it’s too strong. However, that frost dragon is not weak either. After all, it’s a mutated purebred dragon, the disciple of the Dragon King is so strong, wouldn’t he be even stronger?”<br/><br/>“This Frost Dragon’s battle is a little immature. It should be because she doesn’t participate much in the battle. She is much weaker in the control of the battle. If she can not show her suppressive power, I’m afraid she is no match for the Supreme Water Monster King!”<br/><br/>In the surrounding area, the experts of the invincible zone stared at the battlefield with excitement in their eyes.<br/><br/>Such a great battle between experts was rare!<br/><br/>They might be able to learn something from it!\t\t\t\t\t\t</div>", "images": {}, "success": true}