{"id": 628, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073157.html", "title": "Chapter 3619 - 3619 3618, The Six Great Races Emerged! The Black Tower Magi!", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3619 - 3619 3618, The Six Great Races Emerged! The Black Tower Magi!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3619 3618, the six great races emerged! The Black Tower Magi!<br/><br/>“It’s done? They actually cracked the Dragon Palace’s spell formation so quickly?”<br/><br/>“Isn’t this too terrifying?”<br/><br/>“The old scholar said that he could destroy the Dragon Palace’s red-clothed woman in five minutes. Is that true?”<br/><br/>“The Dragon Palace’s Frost Divine Dragon is already at a disadvantage. Hiss, the three lords are too terrifying!”<br/><br/>The Holy Dragon King, Patriarch of the god-herding clan, and the others were shocked when they heard the Black Tower Magus’words!<br/><br/>The Black Tower Magus, the water demon king, and the old scholar were too terrifying!<br/><br/>They couldn’t understand why such a powerful expert hadn’t broken through to the universe ruler realm!<br/><br/>“Let’s go and completely seal off the Dragon Palace. The old scholar and the water demon king’s strength can kill the Frost Dragon and the red-clothed woman. The Dragon Palace can be destroyed!”<br/><br/>The Black Tower Magus said calmly!<br/><br/>“Yes, yes, Yes, my Lord. The Dragon King of the Dragon Palace is also very strong!”<br/><br/>The Sacred Dragon King and the others said excitedly!<br/><br/>“Dragon King of the Dragon Palace? Hehe, leave it to me, I’ll kill him!”<br/><br/>The Black Tower Magus said indifferently, not putting the Dragon King in his eyes at all!<br/><br/>The Black Tower Magus was confident that his strength was a little stronger than the water demon king and the old scholar!<br/><br/>As he spoke, he flew straight ahead!<br/><br/>The Sacred Dragon King, the Patriarch of the god-herding clan, and a group of over 70 experts followed behind with excited faces!<br/><br/>“Hehe, old scholar, water demon king, you two are fighting with each other. I’ll be the one to destroy the Dragon King!”<br/><br/>The Black Tower Wizard flew forward and spoke with a smile on his face!<br/><br/>His calm voice resounded throughout the sky above the heavenly river!<br/><br/>At the same time, he also calmly flew towards the direction of the Dragon Palace!<br/><br/>Surrounded by energy, he easily withstood the aftershocks of the battle between northfrost, the Supreme Water Demon King, the old scholar, and the Red Spirit Bone!<br/><br/>“Roar Roar Roar Dragon King of the Dragon Palace, today is the day you die. Kill my herdsman clan’s disciples, today I will make your lives a living hell!”<br/><br/>“Dragon Palace, Kill Our clan leader, today is the day you die. Our Light Sound Bug clan will torture all your disciples for hundreds of millions of years!”<br/><br/>“Dragon Palace Dragon King, die. Kill our light giant’s powerhouse, I will make you pay hundreds, thousands, thousands of times!”<br/><br/>The Black Tower Wizard’s sudden appearance didn’t wait for everyone to react.<br/><br/>Behind them, the Holy Dragon King, the light giant clan’s clan leader, the pastoralist clan’s clan leader, the Light Sound Bug clan’s new clan leader, the Black Fog Spirit clan’s clan leader, and the Ghoul clan’s clan leader!<br/><br/>They flew over with over 60 universe masters with level 3 battle-power, and their bodies were filled with an incomparably violent killing intent!<br/><br/>Waves of terrifying killing intent soared into the sky, and the entire Heavenly River instantly darkened!<br/><br/>The space was slightly distorted, and their auras instantly became incomparably solidified!<br/><br/>The killing intent of 71 universe masters with level 3 battle-power converged into a terrifying river!<br/><br/>It was as if they wanted to destroy everything!<br/><br/>“HM? What’s the situation?”<br/><br/>“Who’s that figure that suddenly appeared? He’s actually so familiar with the old scholar and the others. And what’s the situation with the 70 or so experts that suddenly appeared behind him?”<br/><br/>“That figure, that Green pupil, is a Black Tower Magus, a Black Tower Magus from our invincible region!”<br/><br/>“Hiss, what’s going on?”? The appearance of a Black Tower Magus and the sudden gathering of the three strongest experts of our invincible region in the Dragon Palace, and that group of experts, are they trying to destroy the Dragon Palace? This is premeditated, the supreme water demon king and the others have been invited here!”<br/><br/>As the Sacred Dragon King and the others roared, the surrounding experts of the invincible region saw the figure of the Black Tower Magus, and their faces were filled with shock!<br/><br/>Another top-tier expert of the Invincible Zone!<br/><br/>Their gathering was not as simple as challenging the Dragon King of the Dragon Palace. They wanted to destroy the Dragon Palace!<br/><br/>“Eh, the Sacred Dragon Bloodline, the shepherds, and the other six races. Aren’t they the subsidiary races of Your Angel Race? It seems that the supreme water demon king and the others were invited by your Angel Race to destroy the Dragon Palace!”<br/><br/>At a place in the Heavenly River, a few Old Monsters of the Divine Tiger Race looked at the Old Monsters of the angel race not far away and said!<br/><br/>“We don’t know that either!”<br/><br/>The Old Monsters of the angel race shook their heads!<br/><br/>Although they were the disciples of the angel race, they had not reached the universe ruler realm, so they were not qualified to participate in the affairs of the Angel Race!<br/><br/>“Interesting, it can be considered a one-on-one battle.”<br/><br/>The old monster of the Divine Tiger clan muttered, his gaze looking over, “Even the Black Tower Magus has come. It seems that the Dragon Palace is going to be destroyed!”<br/><br/>“If the Dragon Palace doesn’t have any trump cards, it should be finished. The Black Tower Magus can be ranked in the top three amongst the invincible region Magi!”<br/><br/>In other places, some experts saw the Black Tower Magus appear and spoke!<br/><br/>They did not expect that the Supreme Water Demon King’s challenge to the Dragon King was not a simple challenge.<br/><br/>Instead, he was invited by the Angel clan to destroy the Dragon Palace!<br/><br/>“What… What’s going on? These experts are all invited by the Holy Dragon Clan?”<br/><br/>“The Holy Dragon Clan’s six great clans should not have this strength. The Angel clan must have intervened and another expert appeared. is the Dragon Palace going to be destroyed?”<br/><br/>“The Angel clan must have intervened. It seems that the Angel clan will definitely lose the Dragon Palace. If the Angel clan wants to destroy them, what can the Dragon Palace do to stop them?”<br/><br/>“Hiss, the Dragon Palace is probably doomed today!”<br/><br/>The disciples of the powerful forces around looked shocked when they saw another super expert from the invincible region appear!<br/><br/>Another super terrifying expert had appeared!<br/><br/>“Oh no, Dragon King, you’re in trouble. Black Tower Magus, this is an extremely terrifying magus. He specializes in formations and curses, and his body has been modified. He’s definitely a terrifying existence!”<br/><br/>At this moment, in front of the Dragon Palace, more than ten elves saw the Black Tower Magus, and their eyes narrowed as they spoke!<br/><br/>The Black Tower Magus had actually come!<br/><br/>There were also more than 70 powerhouses behind him!<br/><br/>They were obviously here to destroy the Dragon Palace!<br/><br/>“Dragon King, we can not interfere in your grudges.”<br/><br/>More than ten elves could not interfere in this matter. They spoke to Wang Xian!<br/><br/>“Hehe, it is indeed the angel clan. It is indeed the six great clans.”<br/><br/>However, when they looked at Wang Xian, they saw that the Dragon King of the Dragon Palace was not worried at all. Instead, he laughed!<br/><br/>What the hell was this?<br/><br/>“But is the Angel clan looking down on me this time? They only brought three old men from the Invincible Region?”<br/><br/>Wang Xian continued to mumble!<br/><br/>When the elves heard that, they opened their mouths slightly.<br/><br/>What did the Dragon King of the Dragon Palace Mean?<br/><br/>“A bunch of lackeys of the angel clan. They have been torturing you since the start of the day. Now, they are not willing to give up. They even asked your master to bring three old men. Are these the only three? “Anyone else, come along. Don’t waste time!”<br/><br/>Wang Xian swept his gaze across the Wizards of the Black Tower and landed on the experts like the Holy Dragon King. He asked indifferently!\t\t\t\t\t\t</div>", "images": {}, "success": true}