{"id": 626, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073153.html", "title": "Chapter 3617 - 3617 3616 Spirit Red Bone Vs Old Scholar", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3617 - 3617 3616 Spirit Red Bone Vs Old Scholar</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3617 3616 spirit Red Bone vs Old Scholar<br/><br/>“Eh? It’s that Frost Dragon. What’s going on? What’s going on? How did that Frost Dragon break through? It actually has such terrifying strength?”<br/><br/>At this moment, in front of the river of eternity, the Supreme Water Demon King took the lead to challenge the Dragon King and pin him down!<br/><br/>If they rushed over again, that expert called old scholar would pin down another one!<br/><br/>Finally, that terrifying Black Tower Magus joined them in attacking the other experts of the Dragon Palace!<br/><br/>With the advantage of having the number of level 3 universe overlords and the existence of the Black Tower Magus, it wasn’t difficult to break through the Dragon Palace!<br/><br/>But what was going on now?<br/><br/>A Frost Dragon was fighting with the Supreme Water Demon King!<br/><br/>What was going on?<br/><br/>The Frost Dragon and the others knew, the Sacred Dragon King and the others had already seen it!<br/><br/>But what was going on?<br/><br/>The Frost Dragon King had broken through!<br/><br/>This was bad!<br/><br/>“This is bad! This is bad! Damn it! Damn it! How could this be? !”<br/><br/>The Holy Dragon King growled in a low voice, his face as dark as blood!<br/><br/>“Why is the Dragon Palace getting stronger every time? Why?”<br/><br/>The new leader of the Guangming Insect clan was on the verge of collapse. They were 100% sure that they could destroy the Dragon Palace, but the Dragon Palace had sent out another expert?<br/><br/>How could they survive this?<br/><br/>How could the Dragon Palace be so monstrous?<br/><br/>“That frost divine dragon has just broken through. It Won’t be a match for the Supreme Water Demon King. If we were to fight, the supreme water demon king would be able to destroy it!”<br/><br/>The Black Tower Magus’green eyes stared ahead as he spoke!<br/><br/>“In our plan, there were only two experts of the Dragon Palace’s level. Now that one of them has suddenly appeared…”<br/><br/>The patriarch of the god-herding clan’s face was as dark as blood!<br/><br/>The foundation of the god-herding clan had almost been destroyed by the Dragon Palace. Just as they were about to destroy the Dragon Palace, another expert appeared from the Dragon Palace!<br/><br/>“So be it. The Supreme Water Monster King killed the Frost Divine Dragon, and I killed the Dragon King. Black Tower, you killed the woman in red. Isn’t that enough? It’s very simple!”<br/><br/>The old scholar swept his gaze over the Sacred Dragon King and the others and said calmly!<br/><br/>“Lord Old Scholar, the Dragon King and the others of the Dragon Palace are very powerful. In a battle of your level, it would be difficult to determine life and death!”<br/><br/>The giant of Light Tribe leader looked at him and said with an ugly expression!<br/><br/>“What’s so difficult about that? Didn’t the third prince give us a treasure to seal the space? We’ll seal the space and fight to the death. Hehe, in a fight to the death, they’ll definitely die!”<br/><br/>The old scholar said nonchalantly!<br/><br/>“I already said before I came that I won’t attack the powerhouses of the Dragon Palace together with the others. One on one, there are exactly three of them. Then I’ll have some exercise. Old Scholar, if you choose the Dragon King, leave the last one to me!”<br/><br/>The Black Tower Magus said calmly!<br/><br/>“No Problem!”<br/><br/>The old scholar glanced at the supreme water demon king and muttered, “Compared to last time, there’s really no improvement at all!”<br/><br/>“Oh? Hehe, old scholar, I’m very curious, who won last time?”<br/><br/>The Black Tower Magus looked at him with some curiosity!<br/><br/>“He has a very strong trump card, making me not dare to kill him!”<br/><br/>The old scholar said indifferently!<br/><br/>The Black Tower Magus smiled and did not say anything else?<br/><br/>Was this the old monster of the Invincible Region?<br/><br/>The Sacred Dragon King and the others listened to the conversation between the Black Tower Magus and the old scholar, their expressions changing!<br/><br/>They would not join forces and only accept one-on-one attacks!<br/><br/>In this universe where the strong preyed on the weak, those who had such views were either crazy or extremely conceited!<br/><br/>They took a deep breath and looked at the two of them!<br/><br/>“I’ll go over first. Black Tower Magus, break the formation as soon as possible. I can sense that the Dragon Palace’s formation is not weak!”<br/><br/>The old scholar spoke to the Black Tower Magus!<br/><br/>“It’s indeed not weak. One minute, break the formation!”<br/><br/>The Black Tower Magus’green gaze once again looked in the direction of the Dragon Palace, his eyes flickering with light!<br/><br/>“Sou!”<br/><br/>As soon as the Black Tower Magus finished speaking, the old scholar flew in the direction of the Dragon Palace!<br/><br/>“Hehe, supreme water demon king, I already said that the Dragon Palace’s Dragon King is mine. Now it seems that it’s still mine. I, the old scholar of the invincible region, lack a dragon throne made of dragon bones. Dragon Palace’s Dragon King, Come!”<br/><br/>A carefree voice came out of the old scholar’s mouth, and at the same time, it reverberated in the sky above the Heavenly River!<br/><br/>Suddenly, a terrifying power erupted from the old scholar, causing all the surrounding experts to look shocked!<br/><br/>“Old Scholar? The old scholar of the Invincible Zone? This ghost-faced old scholar is here too?”<br/><br/>“What’s going on? The old scholar is here too? What’s going on? He wants to challenge the Dragon King of the Dragon Palace Too?”<br/><br/>“Another expert from the invincible zone. Why are they all here to challenge the Dragon King of the Dragon Palace? Is it because of the Dragon King’s Strength?”<br/><br/>Hundreds of experts from the invincible zone were shocked when they saw the old scholar!<br/><br/>In the invincible zone, there were not many experts who could match up to the great water demon king and the old scholar!<br/><br/>They felt a little strange when the two of them appeared at the same time!<br/><br/>“Eh? Old Scholar, this is an expert who is not weaker than the Great Water Demon King!”<br/><br/>At the side of the Dragon Palace, more than ten elves heard the voice and looked forward. When they saw the figure of the old scholar, their eyes flickered slightly!<br/><br/>“Eh?”<br/><br/>Wang Xian heard the exclamations around him and his eyes flickered.<br/><br/>Another expert from the invincible zone came?<br/><br/>This was a little strange!<br/><br/>“Dragon King, this is a little strange. Why are there two experts from the Invincible Zone challenging you all of a sudden? There’s something fishy going on!”<br/><br/>Prime Minister Gui couldn’t help but be suspicious when he saw an old monster from the Invincible Zone appearing again!<br/><br/>Wang Xian nodded his head.<br/><br/>“Wang Xian, I’ll do it. You take the back!”<br/><br/>Ling Honggu moved and said to Wang Xian!<br/><br/>“Alright, be careful!”<br/><br/>Wang Xian hesitated for a moment and nodded his head!<br/><br/>If this matter wasn’t so strange, then Wang Xian was prepared to do it himself!<br/><br/>However, it was still acceptable for a Tai Shui Demon King to challenge him.<br/><br/>After all, he wanted to challenge him a year ago!<br/><br/>However, another person called the old scholar appeared!<br/><br/>Was this a coincidence or something?<br/><br/>Wang Xian’s dragon eyes flickered as he looked in the direction where the old scholar was flying towards!<br/><br/>He could vaguely feel that someone was looking over there!<br/><br/>However, he didn’t take it to heart just now because there were many experts who were looking at the Dragon Palace!<br/><br/>There were at least several hundred of them, and every one of them was extremely terrifying!<br/><br/>These were all experts of the Invincible Zone!<br/><br/>Therefore, he hadn’t paid much attention to them, but now it seemed that…<br/><br/>“The experts of the invincible zone are related to the race of the Holy Dragon of the Angel Race?”<br/><br/>He murmured!<br/><br/>“Experts of the Invincible Zone, let me experience it for you. I want to see what abilities you old monsters have!”<br/><br/>At this time, beside him, spirit red bone was wearing a red dress.<br/><br/>He was like a city-toppling beauty that had walked out of the long river of time, carrying with her an elegant and terrifying energy as she directly attacked the old scholar!\t\t\t\t\t\t</div>", "images": {}, "success": true}