{"id": 638, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073177.html", "title": "Chapter 3629 - 3629 3628 The Third Prince’S Powerlessness!", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3629 - 3629 3628 The Third Prince’S Powerlessness!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3629 3628 the third Prince’s powerlessness!<br/><br/>“How could that Dragon King be so terrifying? How could he be so invincible?”<br/><br/>The Sacred Dragon King’s body trembled violently as he emerged from the Dragon Egg. His eyes were wide open and filled with shock.<br/><br/>He had witnessed Wang Xian’s invincibility with his own eyes!<br/><br/>He had witnessed the death of the supreme water demon king, the Black Tower’s Magus, and the old scholar!<br/><br/>He had witnessed the Dragon King’s terrifying strength!<br/><br/>In his opinion, even the strength of Archangel Baili was not as strong as the Dragon King of the Dragon Palace!<br/><br/>Facing such an enemy made him feel fear, fear, and despair!<br/><br/>“With such strength, even if I broke through to the universe ruler realm, I wouldn’t be a match for him, right?”<br/><br/>The Sacred Dragon King muttered, his expression constantly changing!<br/><br/>Yes, at this moment, he felt that even if he broke through to the universe ruler realm, he wouldn’t be a match for the Dragon King!<br/><br/>As the leader of the sacred dragon lineage, he knew how strong a true universe ruler was!<br/><br/>He was sure that he wasn’t as strong as the Dragon King!<br/><br/>“I have to tell this matter to the third prince, I hope… I hope the third prince has a way!”<br/><br/>The Sacred Dragon King hurriedly took out the universe ai, his arm trembling as he sent the message!<br/><br/>This time, the six races were completely defeated. All the Pinnacle Warriors were killed by the Dragon Palace!<br/><br/>Even if there were pinnacle warriors who were protected by treasures like him, it would be difficult to recover to the pinnacle within a few hundred million years!<br/><br/>It could be said that the six races were completely finished!<br/><br/>After the news was released, the Holy Dragon King lay there quietly. He had lost all his fighting spirit!<br/><br/>“Weng!”<br/><br/>In less than ten minutes, the third Prince’s figure appeared directly in the Sacred Dragon King’s Dragon Palace!<br/><br/>He appeared in front of him!<br/><br/>He frowned and looked at the Sacred Dragon King in front of him. There was an ugly expression between his brows!<br/><br/>“Greetings, third Prince!”<br/><br/>The Sacred Dragon King sensed the third Prince’s arrival and immediately bowed respectfully!<br/><br/>“Is that Dragon King really as strong as you said?”<br/><br/>The third prince stared at him and asked with an ugly expression!<br/><br/>“Lord Third Prince, I don’t dare to hide anything. That Dragon King is too strong, he is definitely stronger than the true ruler of the universe. The old scholar, the Black Tower Wizard and the Tai Shui Demon King couldn’t even withstand a single move from him. Lord Third Prince, our six great races are completely finished. 71 universe rulers with level 3 battle strength have all died, Lord third prince… “It’s our incompetence, it’s that Dragon King’s strength is terrifying!”<br/><br/>The Sacred Dragon King kneeled there and said with a sorrowful face!<br/><br/>This time, their sacred dragon lineage was completely finished!<br/><br/>Even he himself needed a large amount of resources to recover!<br/><br/>“Hu!”<br/><br/>The third prince stood there and took a deep breath, his eyes shining with light!<br/><br/>He was also very shocked by the Dragon King’s strength!<br/><br/>The third prince knew the strength of the old scholar and the Black Tower Wizard. This was definitely an existence that could rival a universe ruler!<br/><br/>However, being killed by the Dragon King, he was sure that the Dragon King was comparable to a Level 2 universe ruler!<br/><br/>“Is the Dragon King a universe ruler?”<br/><br/>He stared at the Sacred Dragon King and asked expressionlessly!<br/><br/>This was a very important point.<br/><br/>If the Dragon Palace Dragon King had the power of a universe dominator, then everything would be simple. He would send the experts of the Angel Race to directly destroy him!<br/><br/>“No, the Dragon King doesn’t have the aura of a universe dominator. He has an extremely terrifying treasure defense. Neither the old scholar nor the black tower wizards could break through his defense. Even the black tower wizards who used their lives to curse couldn’t break through the Dragon King’s Defense!”<br/><br/>As the Sacred Dragon King spoke, his eyes were filled with fear and fear!<br/><br/>“That Dragon King is almost invincible below the realm of a universe ruler!”<br/><br/>He couldn’t help but say another sentence!<br/><br/>In his heart, it might not be almost invincible, but invincible!<br/><br/>“Invincible?”<br/><br/>The third prince slightly raised his eyebrows and stood there quietly!<br/><br/>“Third prince, what should we do? What should we do?”<br/><br/>The Sacred Dragon King could not help but ask!<br/><br/>The third prince did not answer, but stood there quietly!<br/><br/>Now, the third Prince did not have any good ideas!<br/><br/>“It seems that the Dragon King of the Dragon Palace has inherited some of the fortune of the Divine Dragon Clan. There is a mutated frost divine dragon in the Dragon Palace, so the Dragon King should also be a pure-bred mutated divine dragon.”<br/><br/>As he spoke, a hint of jealousy flashed in his eyes, “And his mutation is probably not a simple mutation.”<br/><br/>The Sacred Dragon King lay there, respectfully waiting for the third Prince’s Order!<br/><br/>“You should recover as soon as possible. Don’t bother with the other matters!”<br/><br/>The third prince glanced at the Sacred Dragon King. As soon as he finished speaking, his figure disappeared!<br/><br/>The Sacred Dragon King sensed that the third prince had left. He raised his head in shock.<br/><br/>The third prince actually didn’t have the next order?<br/><br/>What was going on?<br/><br/>Could it be?<br/><br/>A trace of surprise and shock flashed through his eyes!<br/><br/>Could it be that the third prince couldn’t do anything to the Dragon King of the Dragon Palace?<br/><br/>The Sacred Dragon King pondered!<br/><br/>The possibility was really high!<br/><br/>“Green River!”<br/><br/>Not long after, the figure of the third Prince appeared at a place on the Dragon God Island of the Divine Dragon Clan!<br/><br/>Not far in front of him, the Green River Water Phoenix was standing there quietly!<br/><br/>“Failed?”<br/><br/>The Green River Water Phoenix obviously knew about this and turned to look at him!<br/><br/>“This Dragon Palace didn’t expect it to be a trouble, and that Dragon King shouldn’t be a simple mutated purebred divine dragon. He should be able to fight four or five level one masters of the universe, or even more!”<br/><br/>The third Prince opened his mouth and said with an ugly expression!<br/><br/>“If you have no way, then I have no way.”<br/><br/>The Green River Water Phoenix heard his words, and its expression also slightly fluctuated!<br/><br/>Before reaching the universe ruler realm, he was able to contend against five or six universe ruler level one experts. What kind of concept was this?<br/><br/>The special and powerful mutated Phoenix among their phoenixes, the Flameflame Phoenix, was only so-so!<br/><br/>And the Flameflame Phoenix of their Phoenix clan, there were only a few in the entire clan!<br/><br/>With such strength, the Dragon King’s talent and bloodline could probably be comparable to their flame Phoenix!<br/><br/>“Then we can only wait. With the strength that the Dragon Palace Dragon King displayed, he should be able to break through to the universe ruler realm soon.”<br/><br/>The third Prince said!<br/><br/>“Wait? Who knows how long we’ll have to wait!”<br/><br/>The Green River water phoenix frowned and muttered, “But there are existences below the universe ruler realm that can kill him? I saw on the universe ai that the Dragon Palace Dragon King is invincible!”<br/><br/>“Invincible?”<br/><br/>The third Prince’s eyes revealed a look of disdain, “He can’t be invincible below the universe ruler realm. Not to mention the mutant monsters of the peak races, even the space beasts can kill the Dragon King. In the invincible region, there are also old lunatics that can fight and even kill the Dragon King!”<br/><br/>“Unfortunately, whether it’s the space beasts, the Mutant Monsters of the peak races, or those old lunatics, they are not something we can move!”<br/><br/>Qingjiang Water Phoenix shook her head.\t\t\t\t\t\t</div>", "images": {}, "success": true}