{"id": 630, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073161.html", "title": "Chapter 3621 - 3621 3620, I Am Invincible. Therefore, You Will All Die", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3621 - 3621 3620, I Am Invincible. Therefore, You Will All Die</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3621 3620, I am invincible. Therefore, you will all die<br/><br/>“Buzz, Buzz, Buzz!”<br/><br/>A space covered an area of two billion kilometers around the heavenly river. The entire dragon palace was completely surrounded!<br/><br/>Even Monster King Tai Shui, Northern Frost, the old scholar, and Red Bone Spirit, who were fighting on the side, paused for a moment and looked in their direction!<br/><br/>The entire dragon palace had been sealed inside!<br/><br/>“Hahaha, Dragon King of Dragon Palace, let’s see how you can escape. With the three lords of the Invincible Zone here, prepare to die!”<br/><br/>“Dragon King of Dragon Palace, I want you to watch your disciples being killed and the experts of Your Dragon Palace Die!”<br/><br/>When the seal-type innate supreme treasure completely enveloped the dragon palace, excited voices came from the mouths of the Sacred Dragon King and the others!<br/><br/>How could they not be excited?<br/><br/>Ever since the Sacred Dragon clan prepared to deal with the Dragon Palace, they had suffered a lot!<br/><br/>The experts of the Sacred Dragon Clan were killed one by one by the Dragon Palace!<br/><br/>And it was even more so for the Mu God clan’s light giant clan and the others!<br/><br/>Originally, the six great clans assisted the Sacred Dragon Clan, but the Sky Plant Demon Beast clan was directly destroyed by the Dragon Palace!<br/><br/>The other five great clans, the elite disciples of the Mu God clan, were all destroyed and killed!<br/><br/>The giant of light and the light sound bug race were even more miserable. Only a few experts were left!<br/><br/>It was extremely tragic!<br/><br/>Now, it was time for them to take revenge!<br/><br/>“HMPH, you think you can destroy our Dragon Palace?”<br/><br/>The experts of the Dragon Palace stared at them, their eyes filled with coldness!<br/><br/>“We Are Enough!”<br/><br/>The Black Tower Magus glanced at the experts of the Dragon Palace, his face full of mockery.<br/><br/>“Great Water Demon King, old scholar, get rid of them as soon as possible. Don’t let anything happen to them!”<br/><br/>He looked at the great water demon king and old scholar beside him and said calmly!<br/><br/>“TSK tsk, I don’t want that Dragon King. I prefer the Frost Divine Dragon, the mutated Divine Dragon!”<br/><br/>The great water demon king’s eyes flashed with excitement as he stared at Northern Frost like a Hunter!<br/><br/>“I still have four minutes!”<br/><br/>The two old scholars floated in the air as they spoke!<br/><br/>“Alright, let’s do it!”<br/><br/>The wizard from the Black Tower said coldly as he locked his gaze on Wang Xian. “Come on, 1V1. Let me see the strength of a Dragon King like you!”<br/><br/>“Hahaha, good, good, good!”<br/><br/>When Wang Xian saw the confident expressions of the Wizards from the Black Tower, he couldn’t help but laugh out loud!<br/><br/>The incipient holy wings appeared directly behind him. On his clothes, two divine dragons of light and darkness, which looked like ink paintings, appeared slowly!<br/><br/>“Today, I’m here to experience the Old Monsters of the Invincible Zone. Speaking of which, I would like to see what qualifications you have to call yourselves Invincible!”<br/><br/>Wang Xian smiled as he flew slowly into the sky. His gaze slowly turned sinister!<br/><br/>“The invincible territory is just a name for a domain. No one dares to claim to be invincible, and no one can be invincible. I Can’t be invincible either. However, killing you is Enough!”<br/><br/>The wizard from the Black Tower said faintly!<br/><br/>“Hehe, to put it bluntly, all of you are just a bunch of trash who can’t break through for a long time. Naturally, you don’t dare to claim to be invincible because you bunch of trash are not qualified enough.”<br/><br/>Wang Xian flapped his wings slightly. “However, you bunch of trash don’t dare, but I Dare!”<br/><br/>As soon as he finished his sentence, his figure charged towards the black tower’s Magus at a terrifying speed!<br/><br/>His speed was extremely terrifying.<br/><br/>Wang Xian flew over, but he didn’t reveal the five elements grinding mill or the accompanying elf. Similarly, he didn’t even reveal his Netherspirit Avatar!<br/><br/>Just like that, he attacked Wang Xian at the speed of a level one master of the universe!<br/><br/>“Arrogant!”<br/><br/>A hint of anger flashed across the Black Tower’s Wizard’s eyes when he heard Wang Xian’s words. He moved his palm and five black fingers appeared out of thin air around Wang Xian and attacked him!<br/><br/>“What a fast speed to set up the formation. It was almost completed in an instant!”<br/><br/>When the heaven’s formation saw the Black Tower Magus making his move, a solemn expression appeared on his face!<br/><br/>This Black Tower Magus had a huge impact on the heaven’s formation and the Dragon Magi!<br/><br/>“Hehe, get ready to reap the rewards. Our Dragon King’s Tai Chi Dragon Disc has already made a breakthrough. They are here to deliver resources. Heaven’s formation, you and a few dragon Magi should hurry up and set up the formation. Don’t let them escape later!”<br/><br/>King Aqua Touch said to the sky formation with a smile on his face!<br/><br/>His gaze didn’t land on Wang Xian and the rest. Instead, it landed on the body of the Tai Shui Demon King.<br/><br/>“If I eat this fellow, I should be able to completely recover. The energy in this fellow’s body is so dense. He has accumulated so much energy, yet he still hasn’t broken through. What a waste, what a waste!”<br/><br/>She mumbled as her eyes were filled with a fiery aura!<br/><br/>Yes, she had already begun to consider if she should devour the water demon king!<br/><br/>That was because the water touch king knew how terrifying Wang Xian was!<br/><br/>This group of people was merely a dish!<br/><br/>Around them, Prime Minister Gui and the rest also smiled. There was not the slightest trace of worry on their faces!<br/><br/>“Oh? Those people from the Dragon Palace are actually so calm?”<br/><br/>“Clan leader, should we make our move now?”<br/><br/>“No need. As long as the three lords from the Invincible region kill the Dragon King and the rest, the rest of the experts from the Dragon Palace will not be able to achieve anything!”<br/><br/>The Holy Dragon King and the rest saw that the black tower magi were about to collide with the Dragon King and spoke!<br/><br/>They were not in a hurry to make their move. Today’s crucial victory and defeat was still at the hands of the three experts from the invincible region!<br/><br/>“Boom!”<br/><br/>At this moment, the five gigantic fingers of the Black Tower Wizard attacked Wang Xian. The terrifying power of his attack was no weaker than that of the TAISHUI demon king and the old scholar!<br/><br/>The five fingers smashed heavily at Wang Xian!<br/><br/>“Huh?”<br/><br/>However, when the five fingers landed on Wang Xian, the Black Tower Wizard did not see any resistance!<br/><br/>The attack landed directly on his body!<br/><br/>However, at this moment, the Black Tower Magus sensed a terrifying energy attacking him!<br/><br/>This energy made him feel as though his attack had landed on his body!<br/><br/>“Pu!”<br/><br/>At this moment, he was caught off guard and spat out a mouthful of blood?<br/><br/>“That’s it? Trash is trash!”<br/><br/>At this moment, a disdainful voice was heard. He saw the Dragon King of the Dragon Palace pass through his attack easily and arrive at a distance of 10,000 meters in front of him quickly!<br/><br/>This distance was already very close!<br/><br/>“If this is the case, die!”<br/><br/>At this moment, Wang Xian suddenly accelerated.<br/><br/>In an instant, he was only a few meters away from the Black Tower Magus!<br/><br/>The Black Tower Magus’expression changed slightly. Under his pitch-black Magus uniform, numerous hands suddenly appeared.<br/><br/>Each of the hands looked extremely terrifying and ferocious as they grabbed towards Wang Xian’s body!<br/><br/>“You’re courting death!”<br/><br/>His eyes were filled with malevolence and his expression was no longer as calm as before!<br/><br/>Wang Xian’s strength had completely exceeded his expectations!<br/><br/>However, as an old monster who had lived for a very long time, the black tower wizards were no longer ordinary wizards!<br/><br/>Ordinary Wizards were either good at formations, body modification, or something strange!<br/><br/>As for him, due to his long history, he had no flaws. He was good at everything!\t\t\t\t\t\t</div>", "images": {}, "success": true}