{"id": 639, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073179.html", "title": "Chapter 3630 - 3630 3629 Ancestral Dragon Clan Submitted", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3630 - 3630 3629 Ancestral Dragon Clan Submitted</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3630 3629 ancestral dragon clan submitted<br/><br/>The third prince and the Green River Water Phoenix didn’t think that the Dragon Palace Dragon King was invincible under the universe ruler!<br/><br/>Not to mention the abnormal space beasts in the universe, the freaks of the peak races!<br/><br/>Take the invincible region for example, there were some old guys who could be the opponent of the Dragon Palace Dragon King!<br/><br/>They stood at the core level of the peak races, they knew a lot of things!<br/><br/>They also knew many secrets of the invincible region.<br/><br/>For example, there was an old monster who once killed a pure-blooded dragon when the dragon God race was still around. In the end, he was chased by the Dragon King of the Dragon God race. After fleeing for his life, he hid in the invincible region, and now, he was still there!<br/><br/>For example, the invincible region was a special space formed from the battle between a group of Universe Masters and the Space Beast!<br/><br/>In fact, not all of those great beings died in that battle!<br/><br/>They knew that one of them was still alive. However, because his foundation was completely forced, he would never be able to recover to the universe ruler-level in his entire life!<br/><br/>Once a universe ruler-level great being was trapped at the pinnacle of universe knights forever!<br/><br/>In addition, he had lost all his family members, which made him a crazy demon!<br/><br/>At the same time, he was the biggest mad demon in the entire invincible region!<br/><br/>His power had reached an extremely terrifying level!<br/><br/>His realm would limit the power of a great being, but it was not impossible for him to try his best to improve his combat power!<br/><br/>Take the dark race for example. There was an old monster of the dark race in the invincible region, and he had a large number of dark ghost bodies!<br/><br/>One dark ghost body was almost as powerful as a universe master level three great being!<br/><br/>Because he had lived for a long time, and he had thought of ways to improve his power, he had nurtured a large number of dark ghost bodies!<br/><br/>What kind of concept was this?<br/><br/>If a Pinnacle Universe Knight had 20 dark ghost bodies, he could become a universe master level one great being!<br/><br/>What if he had 30,40, or 100 or 200?<br/><br/>Even a universe master at level two had to be careful!<br/><br/>After all, a few changes could cause a change in quantity!<br/><br/>Unfortunately, this level of great beings was not someone they could invite!<br/><br/>Those old lunatics would not give face to the third prince and Phoenix!<br/><br/>Therefore, the third prince and the Azure River Water Phoenix had no choice but to wait!<br/><br/>Wait for the Dragon King to break through and for the Dragon Palace to become a peak race!<br/><br/>This way, they would be able to make a move!<br/><br/>Even if the other party had the support of the Elves!<br/><br/>“HMM? Did you hear? The old scholar Taishui Demon King and the Black Tower Magus were killed by the Dragon King of the Dragon Palace outside!”<br/><br/>“Hiss, is this true? The three black tower’s Magi were all killed by the Dragon King? One killed three? With this strength?”<br/><br/>“With the personalities of the Black Tower’s Magi, they shouldn’t be joining forces. They also temper their invincible hearts and are always looking for a breakthrough. It’s impossible for them to join forces. But even so, the Dragon King of the Dragon Palace was able to kill the three black tower’s Magi. With this strength, those old lunatics shouldn’t be able to do it, right?”<br/><br/>“I don’t know, but the Dragon King of the Dragon Palace is definitely not to be underestimated. Two years later, the Dragon Palace will be holding an auction. At that time, they will be auctioning off innate supreme treasures with light, darkness, and metal attributes. This is an innate supreme treasure!”<br/><br/>“Two years later, let’s go take a look and see what the Dragon King looks like. Let’s also see if we can buy an innate supreme treasure!”<br/><br/>The news within the heaven opening primal continent spread very quickly!<br/><br/>At the same time, this news also spread to the invincible region!<br/><br/>There weren’t many pinnacle great beings in the invincible region, but there were definitely many!<br/><br/>Several thousand pinnacle universe knights, many of them had paid great attention to this when they heard that Tai Shui Demon King was going to challenge the Dragon King from the outside world!<br/><br/>A few hundred of them rushed over, but some didn’t!<br/><br/>However, when they heard the news, they were all shocked!<br/><br/>They were shocked by Dragon Palace Dragon King’s strength!<br/><br/>However, some of the pinnacle old monsters in the invincible region didn’t think that Dragon Palace Dragon King was invincible!<br/><br/>Because they had seen many terrifying existences during this long period of time!<br/><br/>Especially in the deepest part of the Invincible Zone!<br/><br/>They were very interested in the auction held by the Dragon Palace!<br/><br/>An auction of a treasure at the level of a connate true treasure would definitely attract huge attention and create a sensation!<br/><br/>At that time, even experts from peak races would come and bid for it!<br/><br/>The old monsters from the invincible zone were naturally very interested.<br/><br/>Connate true treasures were extremely precious!<br/><br/>“I have gained a lot of resources, but they are all corpses. The Holy Dragon lineage, the light giant tribe, the light sound bug tribe, the Black Fog Spirit tribe, and the Ghoul tribe are all light and dark attributes. The treasures of the experts are also light and dark attributes. They did not improve themselves enough. The other treasures were also placed in the Divine Kingdom!”<br/><br/>However, at this moment, when the entire heaven opening primordial land and even some of the experts from the peak races were discussing the Dragon Palace, they were discussing the Dragon King!<br/><br/>As the Dragon King, Wang Xian had checked all his gains<br/><br/>The corpse had been absorbed by the Dragon Pool. Next, it was time for the experts of the Dragon Palace to improve!<br/><br/>And the improvement of his own strength would only take place after the auction!<br/><br/>The auction two years later!<br/><br/>As long as he sold some innate supreme treasures, his strength and the five elements millstone would be able to improve!<br/><br/>By then, he would be able to contend against even a level two universe overlord, let alone a level one universe overlord.<br/><br/>Wang Xian thought to himself. He opened the universe’s AI to take a look, and a smile appeared on his face!<br/><br/>Next, he would be waiting for the auction two years later!<br/><br/>“Dragon King, a group of Dragon King powerhouses from the ancestral dragon lineage are requesting an audience. They said they want to join our Dragon Palace!”<br/><br/>Time passed day by day. Half a month later, thirteen dragon kings from the ancestral dragon lineage suddenly came to pay a visit!<br/><br/>When Wang Xian heard Prime Minister Gui’s report, he raised his eyebrows slightly. A look of surprise appeared on his face!<br/><br/>“Summon them over!”<br/><br/>He opened his mouth and said with a smile!<br/><br/>“We pay our respects to the Dragon King!”<br/><br/>Soon, the thirteen dragon kings from the ancestral dragon lineage walked into the Dragon King’s Hall!<br/><br/>They looked at the Dragon King on the dragon throne and felt the power emanating from him. Their eyes were filled with reverence!<br/><br/>Not long ago, they had already decided that once the Dragon King broke through to the universe dominator realm, their ancestral dragon lineage would immediately submit and join the Dragon Palace!<br/><br/>But now, even though the Dragon King hadn’t broken through, they had unanimously decided to join the Dragon Palace!<br/><br/>The battle half a month ago had given them a huge shock!<br/><br/>Three top-tier experts from the invincible zone and seventy-one experts from the Sacred Dragon tribe had all been wiped out by the Dragon Palace!<br/><br/>It had only taken ten minutes!<br/><br/>Compared to the Dragon Palace, the ancestral Dragon Tribe was nothing!<br/><br/>All the disciples of the ancestral Dragon Tribe knew that the Dragon Palace was their last hope!<br/><br/>There was an 80% chance that the Dragon King would lead their tribe back to their peak!<br/><br/>So they’ve decided to join the Dragon Palace!\t\t\t\t\t\t</div>", "images": {}, "success": true}