{"id": 632, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073165.html", "title": "Chapter 3623 - 3623 3622. Could There Really Be An Invincible Enemy In This World", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3623 - 3623 3622. Could There Really Be An Invincible Enemy In This World</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3623 3622. Could there really be an invincible enemy in this world<br/><br/>“How can the Dragon King of the Dragon Palace be so terrifying? This… this…”<br/><br/>The Supreme Water Demon King watched as the Dragon King killed the Black Tower Magi as easily as killing a dog. He opened his mouth in disbelief!<br/><br/>“The Black Tower Magi used their strongest curse. It is said that the Black Tower Magi have many life-saving treasures. After death, they can revive and directly curse to kill their own people. This time, the Black Tower Magi actually used their lives to curse to kill the Dragon King. Is it because the Dragon King gave him too much pressure?”<br/><br/>When the old scholar saw this scene, he suddenly became nervous.<br/><br/>This Dragon King was too terrifying, the Black Tower Magi didn’t even have the strength to resist!<br/><br/>Casually killing!<br/><br/>This made them extremely nervous!<br/><br/>The Black Tower Magi were being beaten up like this, they didn’t even have the strength to resist.<br/><br/>And now, he even used such a terrifying curse. If that Dragon King didn’t die, the consequences would be unimaginable!<br/><br/>The old scholar and the Tai Shui Demon King stared at him in a Panic!<br/><br/>As for the Saint Dragon King, the clan leader of the god-herding clan, and the other 70 or so level-3 masters of the universe, they were completely dumbfounded at this moment!<br/><br/>“HMM?”<br/><br/>Wang Xian flew towards the third life of the Black Tower Wizard. The number of life-saving treasures this fellow had was beyond his expectations!<br/><br/>And this curse of his actually came at the price of sacrificing himself!<br/><br/>This caused his eyes to flicker slightly!<br/><br/>Buzz<br/><br/>At this moment, the Tai Chi Dragon Plate seemed to have felt a surge of energy invading Wang Xian’s body and started to circulate automatically!<br/><br/>Wang Xian looked at it and revealed a smile on his face!<br/><br/>This made him think of an ability of the Tai Chi Dragon Plate!<br/><br/>Yin-yang space!<br/><br/>Located in the yin-yang space, Wang Xian seemed to be in another space and could ignore the curse!<br/><br/>Not only could he ignore curses, but this move could also withstand a terrifying attack!<br/><br/>Crack, crack, crack<br/><br/>When the yin-yang space was activated, sounds of cracking could be heard!<br/><br/>This surprised Wang Xian a little. The Curse of the Black Tower’s Magus was a little terrifying!<br/><br/>The Tai Chi Dragon Plate was almost unable to withstand it!<br/><br/>Fortunately, the curse didn’t last for long and the yin-yang space stabilized once again!<br/><br/>“No, no, no, this is impossible!”<br/><br/>In front of him, the Black Tower Magus saw Wang Xian standing there safe and sound. He was on the verge of collapse and was roaring in disbelief!<br/><br/>As soon as he finished speaking, the life force in his body seemed to have been sucked away!<br/><br/>He died again!<br/><br/>Wang Xian sensed another wave of energy appearing on the right. This time, it was very close to him!<br/><br/>He immediately rushed over. Before his body was fully formed, he grabbed Wang Xian’s neck and surrounded him with the tai chi dragon coil!<br/><br/>“You still have a lot of dog lives. I’d like to see how many lives you still have!”<br/><br/>As he spoke, a surge of energy rushed into the body of the Black Tower’s Magus!<br/><br/>This time, before he could even speak, he was easily killed by Wang Xian!<br/><br/>“Still?”<br/><br/>With the help of the primaless sacred wings, he could sense that the black tower’s Magus had resurrected once again!<br/><br/>Whoosh<br/><br/>The primaless sacred wings were flapped and he flew at a terrifying speed towards the other place where the black tower’s Magus had resurrected!<br/><br/>“No, no, no, don’t kill me!”<br/><br/>The Black Tower’s Magus roared in despair!<br/><br/>“Bang!”<br/><br/>However, what greeted him was Wang Xian’s fist, which killed him with a single punch!<br/><br/>This black tower’s Magus had already lost his will to fight!<br/><br/>After a few consecutive deaths, Wang Xian managed to block his strongest spell. He was already in despair!<br/><br/>After his fifth death, Wang Xian sensed that the black tower’s Wizard was completely dead!<br/><br/>Five corpses were left behind!<br/><br/>The energy contained in each of these corpses was more terrifying than the corpses of an ordinary level three master of the universe!<br/><br/>In other words, killing one was equivalent to killing five!<br/><br/>Not Bad, Wang Xian was very satisfied!<br/><br/>“Cough cough cough cough, cough cough cough cough!”<br/><br/>When the Black Tower Magus was completely killed by Wang Xian…<br/><br/>The sinister-looking old scholar let out a horrified cry!<br/><br/>He looked as though he had encountered a great terror as he watched in astonishment.<br/><br/>The Black Tower Magus had five lives. Such a large number of lives shocked them!<br/><br/>However, every single life was instantly killed by the Dragon King. This was… Too terrifying!<br/><br/>Was this a powerhouse on the same level as them?<br/><br/>Even those old freaks from the invincible region who had gone crazy couldn’t be this strong, right?<br/><br/>This was too terrifying, too terrifying!<br/><br/>“Alright, it’s your turn now. Supreme Water Demon King, didn’t you say that you wanted to challenge me? You wanted to kill me?”<br/><br/>After Wang Xian finished off the black tower’s Magus, his gaze landed on the Supreme Water Demon King!<br/><br/>This fellow was very arrogant, very arrogant!<br/><br/>Wang Xian was extremely displeased with him!<br/><br/>“Dragon King, kill him and give him to the little brother of the water tentacles. I’ll devour him and I’ll be able to recover!”<br/><br/>At this moment, at the back, the water tentacles king roared loudly!<br/><br/>“Alright!”<br/><br/>When Wang Xian heard it, he nodded with a smile on his face!<br/><br/>After devouring him, the water tentacles king would be able to recover?<br/><br/>That’s right. If that was the case, the Dragon Palace would have another powerhouse at the first stage of the Universe Dominator realm!<br/><br/>Very good!<br/><br/>“Eat me?”<br/><br/>Tai Shui Demon King saw the Dragon King lock onto him and heard the words of the water touch king behind the Dragon Palace. His body trembled violently!<br/><br/>He was actually going to be treated as food?<br/><br/>However, looking at this incomparably terrifying Dragon King, he felt some fear in his heart!<br/><br/>Sou<br/><br/>Bei Shuang saw his master lock onto him. His body moved and came to the side of the spirit red bone. His gaze locked onto the old scholar!<br/><br/>“Today, none of you can think of leaving. The second one to be killed is you, the Supreme Water Demon King!”<br/><br/>Wang Xian said coldly. His body moved and he attacked the supreme water demon king directly!<br/><br/>His speed was still extremely terrifying!<br/><br/>“This Dragon King’s defense is very terrifying. Can I break through his defense by myself? It’s not just his defense. attacking him seems to cause a strange backlash!”<br/><br/>The Taishui Demon King was no longer as arrogant as before. His forehead was filled with cold sweat!<br/><br/>He was not crazy yet. He had witnessed the Dragon King’s terror just now!<br/><br/>However, they were not far from each other. Now that the space was sealed, even he had to use his full strength to break through the sealed space!<br/><br/>However, the moment he broke through the space, he was already dead!<br/><br/>“Roar! I don’t believe that your defense is invincible!”<br/><br/>He roared with a ferocious look on his face. With his gigantic body and the innate treasure-grade gloves on his arms, he charged straight at Wang Xian!<br/><br/>There was nothing he could do. At this moment, he could only fight!<br/><br/>The taishui demon king did not hesitate at all!<br/><br/>Boom<br/><br/>Wang Xian flew over. Without any resistance, he crashed straight into him!<br/><br/>“Break the formation and escape!”<br/><br/>At this moment, the kind-looking old scholar saw this scene. Without any hesitation, he roared loudly!<br/><br/>The Lady in red from the Dragon Palace and the Frost Divine Dragon were attacking him!<br/><br/>The old scholar knew that he was no match for them in a perilous situation!<br/><br/>Not to mention, there was also that terrifying Dragon King!<br/><br/>At this moment, he had to escape!<br/><br/>“Escape? Escape?”<br/><br/>The Sacred Dragon King, the Patriarch of the god Shepherd tribe, the Patriarch of the light giant tribe, was stunned. They gulped.<br/><br/>“Escape!”<br/><br/>“This dragon king is too terrifying!”<br/><br/>A roar came from the patriarch of the Black Fog Spirit tribe!\t\t\t\t\t\t</div>", "images": {}, "success": true}