{"id": 634, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073169.html", "title": "Chapter 3625 - 3625 Could It Be That There Really Were Invincible Enemies In This World", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3625 - 3625 Could It Be That There Really Were Invincible Enemies In This World</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3625 Could it be that there really were invincible enemies in this world<br/><br/>“Did they call you old scholar? Now it’s your turn. Are You Ready to die?”<br/><br/>After Wang Xian killed the supreme water demon king, he looked at the old scholar and asked indifferently!<br/><br/>In fact, Wang Xian could sense that the supreme water demon king had escaped a calamity through his life-saving treasure!<br/><br/>However, his resurrection was different from the Black Tower’s wizards. He returned to his divine kingdom directly!<br/><br/>He looked at the last expert of the invincible zone with a hint of mockery and mockery on his face!<br/><br/>These three arrogant fellows. Today, Wang Xian was going to kill all of them!<br/><br/>They were too arrogant!<br/><br/>The old scholar’s body trembled as he glared at Wang Xian!<br/><br/>At this moment, it was difficult for him to escape!<br/><br/>“Red Bone Northern Frost, leave him to me. You guys go and destroy the experts from the six great races of the Holy Dragon Lineage!”<br/><br/>Wang Xian said to Ling Red Bone Northern Frost and the rest. He flapped his incipient holy wings and flew towards the old scholar!<br/><br/>“Come on, one on one!”<br/><br/>He smiled and extended his hand towards the old scholar!<br/><br/>One on one!<br/><br/>The old scholar’s gaze swept down and saw that the body of the Taishui Demon King was being rapidly devoured by an expert from the Dragon Palace. His body trembled violently!<br/><br/>The Wizards of the Black Tower and the Tai Shui Demon King were destroyed so quickly. How could they fight against the Dragon King!<br/><br/>“Let’s fight it out. If I can break through, I still have a chance to survive. If I can’t, I will die here today!”<br/><br/>The old scholar’s eyes showed his determination to die!<br/><br/>“Kill, Kill, Kill!”<br/><br/>The old scholar with a ferocious face roared and attacked Wang Xian directly!<br/><br/>Naturally, he could tell that Wang Xian possessed a terrifying defensive ability and the ability to backfire!<br/><br/>However, what else could he do if he didn’t attack?<br/><br/>Could he defend?<br/><br/>Was it possible to rely on defense to make the final breakthrough?<br/><br/>Therefore, he could only attack and rely on the breath in his heart to try to make a breakthrough!<br/><br/>This was his last hope!<br/><br/>If he couldn’t break through, he would definitely die!<br/><br/>Most importantly, he didn’t have any life-saving treasures. He only had one life!<br/><br/>The old scholar with a ferocious expression charged over. He used his body as the word of slaughter and charged at Wang Xian!<br/><br/>However, Wang Xian didn’t resist at all. He continued to use the Tai Chi Dragon Plate as a defense!<br/><br/>“Bang!”<br/><br/>The old scholar with a ferocious expression charged over and charged at the Tai Chi Dragon Plate!<br/><br/>But very soon, the golden word of slaughter began to break!<br/><br/>The fierce-looking old scholar died.<br/><br/>The kind-looking old scholar spat out blood heavily from his mouth!<br/><br/>He knew that he was completely finished!<br/><br/>Because the Dragon King didn’t retaliate at all and allowed him to attack. In the end, the backlash was enough to heavily injure him!<br/><br/>Under such circumstances, how could he use battle to break through?<br/><br/>This was similar to him smashing his head into the ground and killing himself. How could he break through in such a way?<br/><br/>Obviously, it was impossible!<br/><br/>“I don’t understand. How can you be so strong? With your strength, even those old freaks in the invincible zone can’t compare to you!”<br/><br/>The kind-looking old scholar felt some despair in his heart. He stared at Wang Xian and asked!<br/><br/>“You guys are very strong, but to put it bluntly, you’re all useless. You Can’t even break through. I’m stronger than you guys, isn’t that right?”<br/><br/>Wang Xian looked at him and said calmly!<br/><br/>His words made the old scholar’s face extremely awkward!<br/><br/>Shouldn’t that be right?<br/><br/>Shouldn’t that be right?<br/><br/>They had gone through the trials of time and were trying to improve their combat strength!<br/><br/>You are a dragon king of the same level. You are obviously not an old monster. What right do you have to compete with us?<br/><br/>However, there was nothing wrong with what the Dragon King said!<br/><br/>“You can die now!”<br/><br/>As Wang Xian spoke to the old scholar, he flapped his incipient saint wings and charged forward!<br/><br/>The old scholar’s expression changed drastically. He charged forward and attacked Wang Xian!<br/><br/>However, he couldn’t break through Wang Xian’s defense. The backlash caused him to be severely injured!<br/><br/>Wang Xian killed him easily!<br/><br/>“Kill!”<br/><br/>At the side, the 71 experts from the Holy Dragon King and the rest did not launch an attack just now!<br/><br/>This was because the dragon palace had more than 100 masters of the universe with level three combat strength.<br/><br/>They had powerful formations and terrifying weapons!<br/><br/>Coupled with the Frost Dragon God and the lady in red, they were no match for Wang Xian!<br/><br/>Therefore, they did not launch an attack!<br/><br/>However, if they didn’t launch an attack, the Dragon Palace would!<br/><br/>When the powerhouses of the Dragon Palace saw Wang Xian killing that pretentious old scholar, they immediately launched an attack!<br/><br/>“It’s your turn!”<br/><br/>Wang Xian said with a smile on his face. He flapped his incipient saint wings and charged toward the Holy Dragon King and the rest!<br/><br/>Bei Shuang and Ling Honggu also charged forward!<br/><br/>“Kill, Kill, kill! Kill the bunch of beasts of the Holy Dragon lineage. If they want to destroy our Dragon Palace, leave no one alive!”<br/><br/>“Kill them all! hahaha!”<br/><br/>The experts of the Dragon Palace roared with excitement!<br/><br/>At this moment, the Holy Dragon King and the others were in despair.<br/><br/>What could they use to resist?<br/><br/>The people of the Dragon Palace were too terrifying!<br/><br/>They were completely no match for them!<br/><br/>They couldn’t even escape!<br/><br/>“Kill, Kill, Kill, kill as many as we can! Let’s Kill!”<br/><br/>The Holy Dragon King’s body trembled as he roared with blood-red eyes!<br/><br/>He roared loudly as a few of his subordinates rushed over as well.<br/><br/>“We’re all going to die no matter what. Kill!”<br/><br/>The leader of the giant of light roared crazily as he charged over as well!<br/><br/>The experts from the other four races could only charge over as well!<br/><br/>However, the aura on their bodies was much weaker compared to the members of the Dragon Palace!<br/><br/>This was a battle that meant death!<br/><br/>They knew that they wouldn’t win!<br/><br/>The Dragon Palace was too terrifying!<br/><br/>Without any fighting spirit, coupled with Wang Xian’s frenzied hunting, the lives of 71 powerhouses from the six major races were quickly harvested!<br/><br/>“The Dragon Palace will be able to increase a lot of resources this time. This is a great harvest!”<br/><br/>“The treasures obtained this time around should be able to help the Dragon King achieve a breakthrough by selling some of them!”<br/><br/>“The experts from the invincible zone are really good people. The six great races are also good people!”<br/><br/>In front of the Dragon Palace, Prime Minister Gui and the weaker disciples of the Dragon Palace looked up at the battle in the sky!<br/><br/>They looked eager and helpless!<br/><br/>However, without exception, they were all very excited!<br/><br/>Prime Minister Gui and the civil officials of the Dragon Palace in particular had begun to calculate how much they would be able to obtain this time!<br/><br/>Wang Xian was killing quickly. The experts of the six major races had lost their fighting spirit. It was easy for him to kill them!<br/><br/>He could kill four to five of them in a second!<br/><br/>Coupled with the other members of the Dragon Palace, it was an easy massacre!<br/><br/>There was no need for the dragon palace’s formations or anything like that!<br/><br/>…<br/><br/>“What’s going on in there? I originally wanted to watch the battle between the top-notch experts. Now, I can’t even see anything!”<br/><br/>At this moment, around the Heavenly River, more than 200 experts from the Invincible Zone had come!<br/><br/>They looked at the Dragon Palace that was covered by the supreme treasure and felt a little helpless!<br/><br/>They couldn’t see the battle between top-tier experts!<br/><br/>In the heaven-splitting chaotic land, some other disciples who came to watch the battle were even more shocked when they saw the Dragon Palace covered by the Supreme Treasure!\t\t\t\t\t\t</div>", "images": {}, "success": true}