{"id": 636, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073173.html", "title": "Chapter 3627 - 3627 3626 Huge Resources Were Ready To Be Auctioned!", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3627 - 3627 3626 Huge Resources Were Ready To Be Auctioned!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3627 3626 huge resources were ready to be auctioned!<br/><br/>“Could it be that there really are unrivalled enemies in this world?”<br/><br/>The words of an old monster from the Holy Dragon bloodline caused all the experts from the unrivalled region to tremble!<br/><br/>Could it be that there really were unrivalled enemies in this world?<br/><br/>In the unrivalled region, the supreme water demon king, the old scholar, and the Black Tower Magi were definitely the most powerful people!<br/><br/>It was not that there were no people stronger than them in the invincible region, but most of them had already lost their rationality and mind!<br/><br/>Similar to desolate beasts, it was very difficult to communicate!<br/><br/>They were known as crazy demons!<br/><br/>But even those crazy demons found it very difficult to kill the supreme water demon king and the Black Tower Magi as well as the old scholar!<br/><br/>Even if the Black Tower Magi were not killed by the Dragon Palace Dragon King alone!<br/><br/>It had a lot to do with the Dragon King!<br/><br/>The Supreme Water Demon King and the Dragon Palace’s Frost Dragon!<br/><br/>They had witnessed the battle between the old scholar and the red-clothed woman of the Dragon Palace.<br/><br/>The two powerhouses of the Dragon Palace weren’t as strong as the supreme water demon king and the old scholar!<br/><br/>Then, after the innate true treasure sealed the Dragon Palace, the three of them disappeared within ten minutes!<br/><br/>According to the Great Beings of the Dragon Palace, they were all killed!<br/><br/>Similarly, along with the three great beings of the invincible region, there were also 71 universe masters with Level 3 combat power!<br/><br/>To be able to kill them all at the same time, how powerful was the Dragon Palace?<br/><br/>And how powerful was the Dragon King?<br/><br/>Was it really as they said, invincible below the universe master level?<br/><br/>The Great Beings of the invincible region were extremely shocked.<br/><br/>“That Dragon King’s strength is absolutely terrifying!”<br/><br/>The Elves looked at the Dragon Palace with their eyes wide open, their faces full of shock!<br/><br/>The Black Tower Wizard had already broken the array of the Dragon Palace, and the Dragon Palace was still able to kill them even after losing such a trump card. There must be a big reason for this, it was because of the Dragon Palace Dragon King!<br/><br/>“It’s definitely very terrifying. If that Frost Dragon God called the Dragon Palace’s Dragon King his master, then the Dragon King’s strength is definitely very terrifying. Moreover, I estimate that the Dragon Palace’s Dragon King is a mutated Divine Dragon!”<br/><br/>One of the Elves’eyes flickered as he spoke!<br/><br/>“There’s an 80% chance. Let’s go back and ask the Lord of the clan. They should know that if he’s also a mutated divine dragon and has our Elf clan’s companion Elf lord, he might really be able to easily defeat the Black Tower Magi and the others.”<br/><br/>The other elves nodded slightly!<br/><br/>Compared to the shock of the Great Beings of the invincible region, the disciples of the Great Beings of the inner continents were even more shocked!<br/><br/>Although they didn’t know how to describe the power of Tai Shui Yao Emperor and the others, they knew how powerful the Holy Dragon Bloodline, the god-herding race, the ghoul-eating race, the light sound bug race, the light giant race, and the Black Fog Spirit race were!<br/><br/>This time, they had 71 universe rulers with Level-3 Combat Power!<br/><br/>They were universe rulers with Level-3 Combat Power!<br/><br/>But now, they had no aura at all. Obviously, they had all been annihilated by Dragon Palace!<br/><br/>In just 10 minutes, 71 universe rulers with Level-3 Combat Power, plus three old monsters from invincible region, had all been annihilated by Dragon Palace!<br/><br/>The strength of the Dragon Palace was simply invincible!<br/><br/>“With this strength, are they invincible among the races below the peak?”<br/><br/>“More or less. I feel that the Dragon Palace is almost invincible among the races below the peak. I feel that even in the technological world, they are not as strong as the Dragon Palace, right?”<br/><br/>“It’s too terrifying. Just now, we thought that the dragon palace was going to be annihilated. In the end, all the experts from the invincible zone were killed. How strong are the Dragon Palace’s Dragon King and the rest?”<br/><br/>The strong disciples from various races were discussing in shock!<br/><br/>At the same time, in the Dragon Palace’s Dragon King Hall, Wang Xian was counting the spoils of war!<br/><br/>There were six innate treasures!<br/><br/>One from the supreme water demon king, one from the Black Tower’s wizards, one from the light giant tribe, one from the black fog spiritual race, one from the Ghoul tribe, and one from the god Shepherd tribe.<br/><br/>There was one from the water attribute, one from the darkness attribute, one from the light attribute, and one from the metal attribute!<br/><br/>There were six innate supreme treasures, and as for the number of innate spiritual treasures, there were more than 400 of them!<br/><br/>Speaking of which, the number of innate spiritual treasures obtained this time was completely incomparable to the previous harvest!<br/><br/>The previous harvest was more than 2,000!<br/><br/>But the value this time was higher than the previous harvest!<br/><br/>Even 1,000 connate true treasures for a connate true treasure might not be enough to make a great being willing to trade!<br/><br/>Other than these treasures, there were also corpses!<br/><br/>These corpses could give birth to more than 80 level 3 universe masters in Dragon Palace!<br/><br/>Just the Black Tower Magus alone could give birth to five or six level 3 universe masters in Dragon Palace!<br/><br/>The accumulation of these three old monsters in the invincible zone was too abundant!<br/><br/>“Although the harvest this time is huge, it can’t allow me and the five elements millstone to make a breakthrough. I need to exchange these innate supreme treasures for resources!”<br/><br/>Wang Xian looked at the harvest this time and mumbled!<br/><br/>The harvest was extremely rich, but it couldn’t be used!<br/><br/>For example, the resources that Wang Xian had improved himself, the five elements millstone needed to improve the five elements innate supreme treasures!<br/><br/>There was one innate spiritual treasure of the metal element, but at the moment, the five elements millstone could not absorb it!<br/><br/>“Prime Minister Gui, send out an announcement on the universe’s AI. Two years later, our Dragon Palace will hold an auction. At that time, we will auction the innate spiritual treasures of the light, metal, and darkness elements. We will auction all kinds of innate spiritual treasures of the light and darkness elements.”<br/><br/>Wang Xian pondered for a moment and gave an order to Prime Minister Gui!<br/><br/>There were many treasures in the Dragon Palace now, and many of them were useless!<br/><br/>The Dragon Palace also had the Divine Light Dragon. Innate supreme treasures were also very useful to Ao Yao and the rest!<br/><br/>However, for now, Wang Xian’s own strength was the most important!<br/><br/>He wanted to auction some treasures so that the five elements millstone and his own strength could achieve a breakthrough!<br/><br/>As long as the five elemental grindstone and his own strength achieved a breakthrough, he would be even more terrifying!<br/><br/>When the time came, someone at the level of the supreme water demon king would be instantly killed!<br/><br/>He would not be able to resist at all!<br/><br/>Even the Archangel, Bai lie, could be easily killed by Wang Xian!<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded immediately. With a move of his body, he immediately flew out of the Dragon Palace!<br/><br/>Many experts of the Invincible Zone hadn’t left the sky above the Heavenly River Yet!<br/><br/>“In two years, our Dragon Palace will hold an auction. There will be four or five innate supreme treasures for sale. They are mainly of light, darkness, and metal attributes. We welcome the experts of the invincible zone to come!”<br/><br/>The experts of the invincible zone were good customers for the auction of innate supreme treasures!<br/><br/>In addition, many of the old monsters in the invincible zone came from the peak races, so this matter could be spread to the peak races!<br/><br/>Ordinary high-level races couldn’t afford innate supreme treasures!<br/><br/>Only existences like the Mu God race could barely afford them!<br/><br/>However, there weren’t many powerful races like the Mu God race, so the peak races were the main customers!\t\t\t\t\t\t</div>", "images": {}, "success": true}