{"id": 649, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073199.html", "title": "Chapter 3640 - 3640 3639 Breakthrough", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3640 - 3640 3639 Breakthrough</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3640 3639 breakthrough<br/><br/>Two years later, I shall go to the invincible zone and sweep across!<br/><br/>When Wang Xian said this, everyone around was stunned and filled with astonishment!<br/><br/>The One Eye of the madness restriction that was filled with madness was also stunned for a moment!<br/><br/>Around them, the experts from the invincible zone pursed their lips and stared at Wang Xian with sparkling eyes.<br/><br/>They were going to sweep across the invincible region?<br/><br/>What… What arrogance!<br/><br/>In the invincible region, there were four to five thousand experts at the peak of the Universe Knight Realm!<br/><br/>Other than these experts, there were also a large number of desolate beasts and even space beasts!<br/><br/>These desolate beasts and space beasts were able to survive in the invincible region. Their strength was also extremely terrifying!<br/><br/>However, the Dragon King was going to sweep across them?<br/><br/>How Strong was his confidence?<br/><br/>There were quite a number of top-tier experts in the invincible zone, and there were more than a dozen crazy existences!<br/><br/>No one dared to confidently say that they were going to wipe out the entire invincible zone!<br/><br/>Especially those below the universe ruler realm!<br/><br/>“The Dragon King is so confident, he is actually going to wipe out the invincible zone!”<br/><br/>“Is he going to walk the path of invincibility? The Dragon King is too fierce, but I think that the Dragon King can really wipe out all the experts in the Invincible Zone!”<br/><br/>Some of the strong disciples around were discussing in slight shock. Their eyes were sparkling!<br/><br/>“Hahaha, wipe out the invincible zone? Then I shall wait for Dragon King’s arrival in the Invincible Zone. Two years later, I hope that Dragon King won’t disappoint me!”<br/><br/>The mad demon restriction suppressed the brutality in his heart. He laughed maniacally and flew into the distance!<br/><br/>“Hehe!”<br/><br/>Wang Xian looked at his figure and smiled faintly.<br/><br/>He was going to sweep across the invincible zone, not for the so-called invincible zone!<br/><br/>He could also sense the strength of the Mad Demon Prohibition!<br/><br/>It was indeed very strong, much stronger than the old scholar, the Tai Shui Demon King, and the rest!<br/><br/>However, Wang Xian felt that the strength of the mad demon prohibition could at most be comparable to the combined strength of the old scholar, the Tai Shui Demon King, and the Black Tower’s Wizards!<br/><br/>Wang Xian could suppress him, but it would be difficult to kill him!<br/><br/>However, the gains from this auction were enough for him to make a breakthrough in the five elements grinding and his strength!<br/><br/>After his breakthrough, he was confident that he could fight against a level two master of the universe!<br/><br/>As for those at the level of the mad demon restriction, he could easily destroy them!<br/><br/>When the time came, he would enter the Invincible Zone, kill some reckless fellows, kill some powerful desolate beasts, and obtain some resources!<br/><br/>After this upgrade, Wang Xian would need even more resources if he wanted to upgrade again!<br/><br/>And the Invincible Zone was a good place to obtain huge resources!<br/><br/>When the time came, he would sweep it clean!<br/><br/>“I’m looking forward to Dragon King going to the invincible zone. However, our invincible zone is not as simple as you think, Dragon King!”<br/><br/>At the side, a top-notch expert from the invincible zone smiled and said to Wang Xian. He moved and left immediately!<br/><br/>This expert didn’t think that Wang Xian had the ability to sweep the invincible zone!<br/><br/>Forget about sweeping the invincible zone, he might not even be a match for those powerful mad demons!<br/><br/>“Two years later, I will head to the invincible zone as scheduled to experience it!”<br/><br/>Wang Xian replied with a smile.<br/><br/>“Thank you, Dragon King!”<br/><br/>At this moment, at the front, sword god of cold light treated his injuries and cupped his hands toward Wang Xian to express his gratitude!<br/><br/>“In the territory of the Dragon Palace, we will not allow arrogant people to exist!”<br/><br/>Wang Xian waved his hand and said calmly.<br/><br/>“Everyone, you can return to your divine kingdom directly. I believe it will be safer here!”<br/><br/>Prime Minister GUI reminded.<br/><br/>Wang Xian moved his body and flew into the Dragon Palace!<br/><br/>Next, it was time for him to increase his strength!<br/><br/>When he arrived at the Dragon King’s Palace, Wang Xian moved his palm and a large amount of resources appeared in his hands!<br/><br/>At the same time, innate spiritual treasures with five elements attributes appeared at the side one after another!<br/><br/>The Five Elements Millstone appeared above the innate spiritual treasure and began to absorb it rapidly!<br/><br/>Meanwhile, Wang Xian also began to swallow pills one by one to improve himself!<br/><br/>When Wang Xian was making a breakthrough, news about this auction spread rapidly on the universe’s AI!<br/><br/>The arrival of a group of experts from the top races!<br/><br/>The arrival of the experts from the Invincible Zone!<br/><br/>The auction of all kinds of precious treasures!<br/><br/>An auction of such level was definitely unprecedented among the high-level races.<br/><br/>A powerful innate treasure and a rare life-saving fruit!<br/><br/>Similarly, the strength of the Dragon Palace caused quite a stir again!<br/><br/>Naturally, the news of Wang Xian going to sweep the invincible zone in two years’time was also spread with praises!<br/><br/>“The Dragon King of the Dragon Palace said that he would sweep the invincible zone in two years’time. This is simply too domineering. The Invincible Zone!”<br/><br/>“The Dragon King’s disciples are all Frost Divine Dragons. The Dragon King’s own strength is definitely abnormally terrifying. It’s not impossible for him to sweep the Invincible Zone!”<br/><br/>“It’s not that easy to sweep the invincible zone. The top-notch experts of the invincible zone are also very terrifying. The Frost Light Sword God who has an innate treasure can’t withstand an attack from an old monster of the Invincible Zone. He’s too strong!”<br/><br/>“If Dragon King can sweep through the invincible zone, then he’ll be truly invincible. In the future, it’s almost 100% certain that the dragon palace will break through to the peak race.”<br/><br/>On the universe’s AI, countless experts and disciples were discussing!<br/><br/>And the news that the Dragon Palace’s Dragon King was going to sweep through the invincible zone quickly spread to the invincible zone!<br/><br/>Some experts of the invincible zone scoffed at the Dragon Palace’s Dragon King’s words!<br/><br/>“This Dragon King is arrogant. who dares to say that he’s invincible in the invincible zone and wants to sweep across our invincible zone? I’m afraid that he won’t be able to get out once he comes in!”<br/><br/>“This time, the Dragon King of the Dragon Palace has provoked the mad demon prohibition. When he comes in, the mad demon prohibition will come and kill him!”<br/><br/>“If not for the many experts of the Dragon Palace there, the mad demon prohibition might have fought with the Dragon King of the Dragon Palace!”<br/><br/>Some of the old freaks from the invincible zone were conversing with each other!<br/><br/>An existence like the devil was not afraid of any experts of the same level!<br/><br/>They would not put the Dragon King of the Dragon Palace in their eyes!<br/><br/>As for the idea of sweeping across the invincible zone, they were a little disdainful!<br/><br/>They were certain that no one below the level of a universe overlord could sweep across the Invincible Zone!<br/><br/>Naturally, the Dragon King could not do it!<br/><br/>No matter how the AI discussed it or how the invincible zone disdained it.<br/><br/>In the Dragon King Palace, the aura of Wang Xian and the aura of the five elements millstone were getting stronger and stronger!<br/><br/>Wang Xian and the five elements millstone were not far from a breakthrough.<br/><br/>Especially Wang Xian.<br/><br/>Crack! Crack! Crack<br/><br/>“Ding! Congratulations to host for breaking through to the seventh level of a universe Knight.”<br/><br/>“Ding! Congratulations to host for breaking through to the seventh level of a universe knight. You have comprehended the law form: Shadow Dragon Substitute!”<br/><br/>Time passed day by day. Ten days later, an extremely terrifying dragon’s might and crisp sounds came from within Wang Xian’s dragon body!<br/><br/>At the same time, the system’s voice rang out!<br/><br/>Waves of terrifying aura surged out from his body!<br/><br/>He had broken through!<br/><br/>Wang Xian had broken through!<br/><br/>He was a level seven universe knight, but he had the strength to fight against a level four universe overlord!<br/><br/>In other words, among the top races, Wang Xian was at the level of an archangel!\t\t\t\t\t\t</div>", "images": {}, "success": true}