{"id": 641, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073183.html", "title": "Chapter 3632 - 3632 The 3631 Dragon Palace Was Upgraded", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3632 - 3632 The 3631 Dragon Palace Was Upgraded</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3632 The 3631 Dragon Palace was upgraded<br/><br/>“In the future, the Dragon King will be the only king of the Divine Dragon Clan. The Order of the Dragon King has to be obeyed. If you join the Dragon Palace, we will also be a part of the Dragon Palace. We will stand side by side with the Dragon King. Under the leadership of the Dragon King, we will strive to restore the glory of the Divine Dragon Clan as soon as possible!”<br/><br/>The 14 huge dragon palaces flew toward the Dragon Palace!<br/><br/>Looking at the Dragon Palace under the water in the sky, the thirteen Dragon Kings reminded all the disciples again!<br/><br/>“Yes!”<br/><br/>The disciples shouted!<br/><br/>Their eyes were full of passion!<br/><br/>There was their new king ahead!<br/><br/>The Dragon King of the Dragon Palace!<br/><br/>An existence much more powerful than the leader of the Ancestral Dragon Clan!<br/><br/>He was also an expert that all the godly dragon clans worshipped and admired!<br/><br/>“Dragon King, our new clansmen have arrived. There is good news. The ancestral dragon lineage has fourteen powerful dragon palaces. Thirteen of them are the true masters of the Universe!”<br/><br/>At the same time, in the Dragon Palace, Prime Minister Gui reported to Wang Xian excitedly!<br/><br/>“Huh?”<br/><br/>When Wang Xian heard Prime Minister Gui’s words, his eyes lit up and he revealed an excited expression!<br/><br/>“They have 13 dragon palaces of the universe overlord level. What are their attributes?”<br/><br/>He quickly asked!<br/><br/>As he spoke, he immediately flew towards the entrance of the Dragon Palace!<br/><br/>“Dragon King, they have all nine attributes!”<br/><br/>Prime Minister GUI said with some excitement!<br/><br/>The current Dragon Palace belonged to the acquired realm. In other words, it was equivalent to the Divine Kingdom of a universe knight!<br/><br/>Of course, a universe knight couldn’t break through the Dragon Palace’s defense!<br/><br/>If the Dragon Palace wanted to advance from the Houtian level to the Xiantian level, it needed to absorb nine types of God countries!<br/><br/>The Dragon Palace was naturally a god country too!<br/><br/>As long as it absorbed them, the Dragon Palace would be able to advance to the Xiantian level!<br/><br/>At this level, it could withstand the attacks of a universe ruler!<br/><br/>At the same time, the spirit energy, cultivation speed, and various other functions in the Dragon Palace would directly double!<br/><br/>Once the Dragon Palace was upgraded, they would have the ability to protect themselves!<br/><br/>By then, they would be able to withstand the attacks of a level four or five master of the universe!<br/><br/>“Good! Good!”<br/><br/>Wang Xian flew to the east gate of the Dragon Palace and looked at the fourteen dragon palaces in front of him. His eyes were filled with excitement!<br/><br/>The upgrade of the Dragon Palace was very important, but Wang Xian valued another point more!<br/><br/>The improvement of the ancestral tree!<br/><br/>The ancestral tree was now Wang Xian’s biggest trump card, and it was also the biggest trump card of the Dragon Palace!<br/><br/>After such a long time, he had also reached his current level. He had a vague feeling!<br/><br/>That was, the ancestral tree was originally left behind by the seniors of the Divine Dragon Clan for the inheritor of the Divine Dragon Clan!<br/><br/>Including his own system, it was all created by the seniors of the Divine Dragon Clan to assist the inheritor of the Divine Dragon Clan!<br/><br/>And he was this inheritor!<br/><br/>The bloodline of the ancient god Feeding Kun lord might have been left behind on Earth!<br/><br/>He even had some guesses about the current system!<br/><br/>This might be the product of gathering the final strength of the entire Divine Dragon Clan, all the technology of the Bug clan, and the Divine Dragon Palace merging into one!<br/><br/>This was also the reason why he could quickly improve and the Dragon Palace could quickly improve!<br/><br/>After all, the other dragon palaces didn’t have a dragon transformation pool!<br/><br/>It was impossible to say that they could easily transform into a peak dragon seed!<br/><br/>This was the ability of the insect race!<br/><br/>The insect race was extremely terrifying!<br/><br/>“As long as the Dragon Palace can devour these nine dragon palaces, it will be able to level up. At that time, there might be new changes to the ancestral tree!”<br/><br/>Wang Xian mumbled!<br/><br/>The dragon palaces of the thirteen experts of the ancestral dragon lineage weren’t built by them. Instead, they were obtained by a great opportunity!<br/><br/>After all, there were many dragon kings who were masters of the universe in their glory days. It was not impossible for some of the dragon palaces of Masters of the universe to be preserved!<br/><br/>“All members of the Dragon Palace, come and welcome our new members!”<br/><br/>Prime Minister Gui came to the back of Wang Xian and gave an order to all the members of the Dragon Palace!<br/><br/>After all, the Dragon Palace would be adding six million dragon species this time. They still needed to give a grand welcome!<br/><br/>“Yes!”<br/><br/>Prime Minister Gui’s name was announced, and a group of experts from the Dragon Palace flew over!<br/><br/>There were a total of two thousand pure-bred divine dragons!<br/><br/>Each and every one of them was at the peak of dragon species, and each and every one of them was exuding a powerful aura!<br/><br/>Guan Shuqing, Lan Qingyue, Sun Lingxiu, Tang Yinxuan, and the rest of the Dragon Queens also flew out. They came to Wang Xian’s side with smiles on their faces!<br/><br/>Among them, Xiao Yu and her husband, Feng Lingtian, were also following them!<br/><br/>Xiao Yu and fan Qinglan were exuding a dark and terrifying aura. This was the terrifying aura of the bone dragon!<br/><br/>Their strength had already reached the peak of the Universe Knight Realm!<br/><br/>They were on par with bei Shuang and could fight against a true level 1 universe dominator!<br/><br/>The gains from a few months ago and the improvement of the Dragon Palace were exceptionally terrifying!<br/><br/>Besides them, there were also 150 universe masters and level three Great Beings of Dragon Palace who were at the back!<br/><br/>Around them, the pinnacle races were lined up neatly!<br/><br/>“HM? Hiss, this is… Such a terrifying aura, this… this…”<br/><br/>Just as all the Great Beings of Dragon Palace came out, the 13 Godly Dragon Great Beings of universe masters and level three great beings of Dragon Palace who were at the front saw Dragon King, the Great Beings of Dragon Palace, and the dragon seed, their faces were full of shock!<br/><br/>They glanced around and found that there were 150 to 60 great beings with the same aura as them!<br/><br/>What did this mean?<br/><br/>Including the 10 great beings beside them, there were 150 to 60 Great Beings of the Dragon Palace!<br/><br/>In addition, they could vaguely feel that there were three to four great beings who were stronger than them!<br/><br/>This…<br/><br/>“My God, look over there, there are so many purebred dragons. There are at least 2,000 purebred dragons, right?”<br/><br/>At this moment, the disciples in the 14 dragon palaces were filled with disbelief!<br/><br/>What did they see?<br/><br/>More than 2,000 purebred dragons!<br/><br/>In their eyes, there were at least 200 to 300 purebred dragons in the entire universe!<br/><br/>However, there were at least 2,000 of them in the dragon palaces!<br/><br/>Furthermore, every single one of them was extremely powerful!<br/><br/>“Not only are there pure-blooded dragons, but there are also the thorned dragons, the berserk dragons, the imperial dragons, and the Arrow Dragons. Oh My God, this… this…”<br/><br/>At this time, the 13 universe master level three godly dragons were looking at them in shock!<br/><br/>They were looking at over 2,000 pure-blooded godly dragons, and they could sense the various pinnacle dragon-type legions. They were slightly dazed!<br/><br/>Was this the peak time of the Dragon Clan?<br/><br/>It wasn’t their first time coming to the Dragon Palace, but it was their first time seeing all the members of the Dragon Palace!<br/><br/>It could only be described as unbelievable!<br/><br/>“All disciples, pay respects to the Dragon King immediately!”<br/><br/>The Universe Master Level 3 water god Dragon shouted and flew out of the Dragon Palace first.<br/><br/>“Pay respects to the Dragon King, pay respects to the King!”<br/><br/>At this moment, he kneeled in the water and made a formal bow!<br/><br/>“Dragon King! Dragon King!”<br/><br/>All the other disciples flew over and kneeled in shock!\t\t\t\t\t\t</div>", "images": {}, "success": true}