{"id": 648, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073197.html", "title": "Chapter 3639 - 3639 3638 Invincible Region", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3639 - 3639 3638 Invincible Region</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3639 3638 invincible region<br/><br/>“Huh? Forbidden to take that great being’s innate true treasure, that water element innate true treasure long sword? And it has already sealed the other party?”<br/><br/>“It seems like forbidden to bid for that metal element innate true treasure didn’t succeed, so he’s a little unwilling, so he wants that great being’s water element innate true treasure. That guy is really unlucky!”<br/><br/>“That expert with the innate true treasure should not be an expert from the invincible zone. Now, he is really unlucky!”<br/><br/>In front of the Dragon Palace auction venue, some old monsters from the invincible zone who had not left saw this scene. They paused for a moment and looked over in astonishment!<br/><br/>“That expert from the invincible zone actually wants to snatch the innate true treasure of cold light sword God. This…”<br/><br/>“The coldlight sword God is very strong. He has an innate supreme treasure and wants to snatch the coldlight sword God’s innate supreme treasure in a one-on-one situation. Isn’t this a little too arrogant?”<br/><br/>Some of the strong disciples from the high-level races whispered to each other!<br/><br/>Wang Xian swept his gaze over and raised his eyebrows slightly. His gaze landed on the mad demon from the Invincible Zone!<br/><br/>“You want me to give you the coldlight innate supreme treasure? Wishful thinking. I have never seen such an arrogant fellow. Even the mad demon from the invincible region won’t be able to snatch my treasure!”<br/><br/>Coldlight sword God stared at the mad demon restriction with an embarrassed expression!<br/><br/>Having cultivated to his realm, he naturally knew about the invincible region and the mad demon from the Invincible Region!<br/><br/>However, it was impossible for him to give him his innate supreme treasure directly!<br/><br/>How could he give his own innate true treasure, which was something that even universe masters of Pinnacle Races would fight for!<br/><br/>With the innate true treasure in his hand, he believed that even if he was no match for Mad Demon from Invincible region, he could still defend against him!<br/><br/>Weng<br/><br/>However, as soon as cold light sword God finished speaking, a terrifying energy rushed toward him!<br/><br/>Mad devilish seal didn’t hesitate at all. His entire body was enveloped by blue and golden light, and behind him, the illusory image of a space beast appeared!<br/><br/>This space beast had two enormous horns, and it seemed as if it was about to break through the horizon!<br/><br/>The sudden attack of mad devilish seal caused cold light sword God’s expression to change drastically!<br/><br/>“Scram!”<br/><br/>“One sword to illuminate the nine regions!”<br/><br/>Cold Light Sword God’s face was ice-cold as he roared and directly used his law projection!<br/><br/>A dazzling sword light slashed directly at the mad devilseal!<br/><br/>“Peng!”<br/><br/>However, the Mad Devilseal didn’t Dodge at all. It went straight for the sword light!<br/><br/>The Astral Beast Phantom behind him completely surrounded his body!<br/><br/>The sword light landed in front of him and was easily blocked!<br/><br/>The Mad Devilseal continued to charge at frostlight Sword God!<br/><br/>“What? !”<br/><br/>Cold Light Sword God’s face changed drastically when he saw this scene, and his eyes were filled with fear!<br/><br/>“10,000 swords return, Defend!”<br/><br/>He waved his arm, and the cold light innate true treasure floated above his head, forming a terrifying defense!<br/><br/>This defense relied on the powerful power of the innate true treasure!<br/><br/>Pu<br/><br/>But in the next moment, Cold Light Sword God’s body flew backward, and blood and flesh spurted out of his mouth!<br/><br/>“Master!”<br/><br/>Behind him, a man and a woman who were protected by the energy saw this scene and their faces changed drastically as they shouted loudly!<br/><br/>They quickly flew to the front of cold light sword god, their faces filled with worry!<br/><br/>“What?”<br/><br/>“Hiss, this… that old monster from the invincible region has such terrifying strength. With a connate cardinal treasure in his hand, the incomparably powerful cold light sword God can’t even withstand a single move!”<br/><br/>“How… How is this possible? Is this the strength of a top-tier expert from the Invincible Zone? This is too strong, they’re not even on the same level!”<br/><br/>“Frost Light Sword God has a connate cardinal treasure, yet he can’t even withstand a single move from him?”<br/><br/>“Not good, Frost Light Sword God might be killed!”<br/><br/>The sudden battle had defeated Frost Light Sword God in a single move.<br/><br/>This scene shocked the disciples of the high-level races in the inner continent!<br/><br/>Cold Light Sword God was defeated in one move?<br/><br/>From the looks of it, killing him was a piece of cake!<br/><br/>Was this the strength of a top-level old monster in the Invincible Zone?<br/><br/>“You are courting death!”<br/><br/>Seeing cold light sword God being injured and sent flying away, crazy demon forbidden opened his eyes, which were full of coldness!<br/><br/>He spat out two words calmly and prepared to charge out again!<br/><br/>“This is the territory of the Dragon Palace. If you dare to make a move again, you will stay here forever!”<br/><br/>Seeing that the inhibition of madness was about to continue attacking, Wang Xian spoke directly!<br/><br/>What a joke!<br/><br/>This was the territory of the Dragon Palace, the territory of the Dragon Palace.<br/><br/>This was the venue for the auction of the Dragon Palace!<br/><br/>In the end, you were here to snatch treasures and even wanted to kill people. Are you looking down on the Dragon Palace?<br/><br/>Every race had a powerful and imposing presence!<br/><br/>Even if it was the gentle elf race, as long as the other races dared to step in, they would be killed immediately!<br/><br/>The Dragon Palace was not a peak race, but no one dared to be impudent here either!<br/><br/>The Mad Demon from the Invincible Zone?<br/><br/>The power of the Dragon Palace could instantly kill him!<br/><br/>Wang Xian’s words made the mad demon Prohibition’s attack stance pause slightly!<br/><br/>He looked at Wang Xian with a crazed gaze.<br/><br/>At this moment, all the experts of the Dragon Palace were staring at him. Their eyes were filled with coldness!<br/><br/>As long as he dared to continue attacking, he would die here. There was no doubt about that!<br/><br/>The old monster of the Invincible region, the mad demon prohibition, was very strong?<br/><br/>It was indeed very strong. However, there were 100 level 3 universe Dominators of the Dragon Palace around him!<br/><br/>Not to mention the terrifying array formation and northern frost!<br/><br/>As long as he dared to move, he would be instantly killed!<br/><br/>One of the eyes of the hex stared at Wang Xian. His pupils were beating non-stop and his eyes were filled with brutality!<br/><br/>“Three seconds, get out of Here!”<br/><br/>Wang Xian stared at him and continued to speak indifferently!<br/><br/>“The Dragon King has spoken!”<br/><br/>“Phew, the Dragon King has spoken. This time, the cold light sword God is saved. There are so many experts from the dragon palace here, and that old monster from the Invincible Zone doesn’t dare to make a move!”<br/><br/>“How domineering. The Dragon Palace already has a trace of pride among the peak races!”<br/><br/>“After all, this is the domain of the Dragon Palace. In fact, other experts can be impudent here. The Dragon Palace will not allow such a thing to happen!”<br/><br/>“The Dragon King’s strength is invincible among those below the level of the universe dominator. Although the experts of this invincible domain are terrifying, they are not a match for the Dragon King. The Dragon King also has an innate supreme treasure in his hands, and there might be more than one of them!”<br/><br/>When the disciples of the high-level races heard Wang Xian’s words, they looked at him with a hint of respect and admiration in their eyes.<br/><br/>The current Dragon Palace and the current Dragon King all had a faint sense of invincibility!<br/><br/>When some of the old freaks in the invincible zone saw this, their eyes sparkled.<br/><br/>“Dragon Palace’s Dragon King? Hehe, alright. I’m invincible below the ruler of the universe. If there’s a chance, let’s have a Spar!”<br/><br/>One of the eyes of the mad demon restriction twitched crazily. A ferocious look appeared on his face and the aura on his body was completely retracted!<br/><br/>“Spar?”<br/><br/>When Wang Xian heard his words, he pondered for a moment before the corners of his mouth curled up slightly.<br/><br/>“Let’s do it in two years. I’ll go to the invincible zone and sweep the area!”<br/><br/>He said faintly!\t\t\t\t\t\t</div>", "images": {}, "success": true}