{"id": 647, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073195.html", "title": "Chapter 3638 - 3638 3637 Invincible Zone", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3638 - 3638 3637 Invincible Zone</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3638 3637 invincible zone<br/><br/>The Dragon Palace’s auction this time was mainly for medicinal pills, divine herbs, and five elements innate spiritual treasures!<br/><br/>Therefore, they could use innate spiritual treasures to bid!<br/><br/>When the auction started, there was nothing much to say about this auction!<br/><br/>As long as you had enough treasures, you could bid for what you needed!<br/><br/>The items that the Dragon Palace took out this time were very large. Apart from a few innate spiritual treasures, there were also hundreds of darkness and light elements innate spiritual treasures!<br/><br/>There were also three soul returning fruits and all sorts of strange treasures!<br/><br/>Other than that, there were also some items that were auctioned by experts from high-level races!<br/><br/>The total number of items auctioned was over a thousand!<br/><br/>With over a thousand items, the speed of the auction was very fast.<br/><br/>In order to prevent those experts from the peak races from auctioning the items, the high-level races did not dare to make a move. Hence, they could hide their identities in this auction!<br/><br/>The auction officially began. One by one, the treasures were auctioned off.<br/><br/>Wang Xian sat there and watched with a smile on his face!<br/><br/>One by one, the items were auctioned off. Half a day later, the auction for the innate treasures began!<br/><br/>The first innate treasure was of the darkness attribute. The competition was very intense!<br/><br/>Not only did the powerhouses from the top-tier races make a move, there were also the powerhouses from the higher-tier races making a move in secret!<br/><br/>The high-level races couldn’t be underestimated. Many of them had accumulated over tens of billions of years.<br/><br/>A Universe Master of a pinnacle race might not be able to compete with them!<br/><br/>However, the first innate true treasure was obtained by a great being of the dark race!<br/><br/>The second innate true treasure was light-elemental, and this one was finally obtained by a great being of the Immortal Empire!<br/><br/>The third innate true treasure was of the metal element!<br/><br/>When this innate true treasure came out, the Mad Demon Seal of the Invincible region was used!<br/><br/>This mad demon from the invincible region had a lot of resources!<br/><br/>The more great beings they killed, the more they gained!<br/><br/>Even ordinary pinnacle race great beings didn’t have as many treasures as him!<br/><br/>Unfortunately, when he attacked, he met a great being from the Godly Tiger Race!<br/><br/>This great being’s power was above universe master level one!<br/><br/>When he made his move, the Mad Demon Seal of Invincible region was defeated!<br/><br/>Weng! Weng<br/><br/>When this metal-elemental innate true treasure was bid for by the great being of the godly tiger race, an intense energy fluctuation came from the back!<br/><br/>“A trash who can’t even control his mind is useless no matter how powerful he is.”<br/><br/>The black vulture king glanced at the restriction behind him and commented with disdain!<br/><br/>Wang Xian looked over curiously. He was very curious about the crazy demon of the Invincible Region!<br/><br/>Such an existence was stronger than the Tai Shui Demon King and the rest!<br/><br/>There were two reasons for such a strong person to become a crazy demon.<br/><br/>One was that he had not broken through for a long time and the passage of time had changed his mind!<br/><br/>The second reason was that they would think of ways to improve their strength after not breaking through for a long period of time. After their strength had increased, they did not have a corresponding realm to match with each other. It was easy for them to lose control, which meant that they could not control themselves!<br/><br/>This was the reason why they were crazy!<br/><br/>They had become stronger, but they were also crazy!<br/><br/>With such an existence, it would be even more difficult for them to break through!<br/><br/>Wang Xian sized up this old crazy demon called Ban with curiosity!<br/><br/>It shouldn’t be too much of a problem for him to deal with him!<br/><br/>Although he was very strong, he couldn’t kill the Supreme Water Demon King in an instant!<br/><br/>However, he didn’t even manage to get an item, yet the energy in his body was already emitting such a huge fluctuation. One could imagine how serious the situation was!<br/><br/>After the metal-elemental innate treasure was obtained by the Godly Tiger clan’s experts, there weren’t many items left!<br/><br/>Finally, there were three soul-returning embryo fruits!<br/><br/>These fruits had a fatal attraction to any Great Beings’disciples!<br/><br/>After all, these were treasures that were equivalent to having one more life!<br/><br/>To some Great Beings’disciples, these were even more important than innate true treasures!<br/><br/>Of course, the value of soul-returning embryo was much lower than that of innate true treasures!<br/><br/>The three soul-returning embryo fruits were auctioned off by the experts one by one, and the auction ended successfully!<br/><br/>“The auction ends here. Friends who have auctioned off the items can contact us to collect the items!”<br/><br/>As Prime Minister Gui spoke, some of the experts around him left immediately!<br/><br/>“Wang Xian, I’m going to leave with my father, Wang, and grandfather. Let’s meet again in a thousand years. By then, I’ll have reached the realm of the ruler of the Universe!”<br/><br/>Ling honggu bade farewell to Wang Xian directly!<br/><br/>“Hehe, alright, then I’ll see you in a thousand years!”<br/><br/>Wang Xian smiled and nodded at her.<br/><br/>“Haha, Little Brother Dragon King, I have high hopes for you. When the day comes when Honggu makes a breakthrough, I’ll invite you over to witness Honggu’s breakthrough together. I’ll also bring you to see our skeleton domain!”<br/><br/>The black vulture king laughed heartily as he spoke to Wang Xian!<br/><br/>“Alright, I will see you in a thousand years!”<br/><br/>Wang Xian nodded and agreed!<br/><br/>“Farewell!”<br/><br/>The spirit demon king cupped his hands. They returned to their divine kingdom and disappeared!<br/><br/>Wang Xian cupped his hands at them as well!<br/><br/>In the surrounding area, most of the experts from the peak races had disappeared!<br/><br/>They either returned to their divine kingdoms or returned to their races through special items!<br/><br/>Boom<br/><br/>“What are you doing?”<br/><br/>However, at this moment, a terrifying aura swept across the surroundings!<br/><br/>Following that, an urgent voice sounded.<br/><br/>“Huh?”<br/><br/>The sudden change of events stunned Wang Xian. He immediately looked ahead!<br/><br/>In front of them, a middle-aged man with a terrifying longsword in his hand stared ahead with a grave expression!<br/><br/>Beside the middle-aged man, there was a young man and a young girl!<br/><br/>They were looking at the figure in front of them with some fear!<br/><br/>In front of them, there was an old mad demon from the invincible region with blue and golden horns, ban!<br/><br/>At this moment, he opened one of his eyes strangely. However, his eyes were filled with madness!<br/><br/>Around the middle-aged man and the others, there was a blue light barrier that enveloped them.<br/><br/>Clearly, this blue light barrier could prevent the middle-aged man and the others from escaping!<br/><br/>“What? It’s cold light sword God. That’s the mad demon expert from the Invincible Zone. What is that Mad Demon expert doing? Why is he attacking Cold Light Sword God?”<br/><br/>“What happened?”<br/><br/>The sudden turn of events shocked everyone around, and they all looked over!<br/><br/>“Is it a spar or something? Cold Light Sword God is very powerful. He once swept through an entire region with a single sword strike, and with a connate cardinal treasure in his hand, he is nearly invincible. His reputation is very well-known!”<br/><br/>Some experts from the high-level races looked over and said in astonishment!<br/><br/>“Give me the innate true treasure in your hand within three seconds.”<br/><br/>At this moment, the opened eye was jumping crazily as if it was suppressing the violence in its body. It said in an extremely low voice!<br/><br/>He wanted the innate true treasure in cold light sword God’s hand!<br/><br/>An innate true treasure of water attribute!\t\t\t\t\t\t</div>", "images": {}, "success": true}