{"id": 655, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073211.html", "title": "Chapter 3646 - 3646 3645 Invincible Road 5", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3646 - 3646 3645 Invincible Road 5</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3646 3645 Invincible Road 5<br/><br/>“The power of the Mad Devil Prohibition is already much more powerful than Ordinary Level One masters of the universe, and the Dragon King is able to kill him. If we want to kill him, we need at least 50 experts of the invincible region to join hands.”<br/><br/>“Our Phoenix clan has about 100 experts in the invincible region, but at most, we can contact half of them. If we want to kill this Dragon King, it will be a bit troublesome!”<br/><br/>“I don’t know how the Dragon King offended our Lord. With the Dragon King’s strength, we will probably lose some experts if we kill him.”<br/><br/>The five members of the Phoenix clan discussed telepathically. They looked at the rapidly disappearing figure with a slightly solemn expression!<br/><br/>“The Dragon King must have gone to destroy the nest of the supreme water demon king. In the nest of the supreme water demon king, there are still 10 descendants of the supreme water demon king who have the combat strength of A Level 3 universe Dominator!”<br/><br/>In the surrounding area, the old monster who replied to Wang Xian spoke. His gaze was filled with respect as he looked in the direction where the figure disappeared.<br/><br/>Everyone was clear about the enmity between the Supreme Water Demon King and the Dragon Palace!<br/><br/>It was expected that the Dragon King would head to the nest of the Supreme Water Demon King!<br/><br/>After all, the supreme water demon king still had many descendants!<br/><br/>Since the Supreme Water Demon King wanted to destroy the Dragon Palace, the Dragon King would definitely not let the descendants of the supreme water demon king off!<br/><br/>“The supreme water demon king might not have perished. He might be recovering in his lair!”<br/><br/>An old monster glanced at him and said indifferently!<br/><br/>Some of the old monsters from the invincible region nodded slightly!<br/><br/>Although the supreme water demon king was killed, it was very likely that he had a life-saving treasure.<br/><br/>He might not have completely perished yet!<br/><br/>In fact, the supreme water demon king was not completely dead yet!<br/><br/>He could sense it when Wang Xian killed him.<br/><br/>The only ones who were truly dead were the old scholar and the Black Tower’s Magus!<br/><br/>The Supreme Water Demon King was not dead!<br/><br/>However, although he was not dead, his current strength was at most at the first or second level of a universe knight!<br/><br/>He might even be at the level of a divine emperor!<br/><br/>Although life-saving treasures could protect one’s life, they could not protect one’s cultivation base!<br/><br/>It was just like the soul-returning embryo fruit. The soul-returning embryo fruit could resurrect one. However, after being resurrected, one’s strength was very weak and was about the same as when one was just born!<br/><br/>Wang Xian quickly flew in the direction of the nest of the Tai Shui Demon King!<br/><br/>In the invincible zone, he could not find a map on the universe’s AI. As for the nest of the Tai Shui Demon King, Wang Xian could only ask for directions and search for it himself!<br/><br/>Wang Xian did not fly very fast. As he flew, he sized up his surroundings!<br/><br/>As a powerful battlefield, there were many wonders here after more than 10 billion years of development!<br/><br/>Occasionally, one could see some universe God kingdoms that were so dilapidated that they did not have much energy!<br/><br/>From the dilapidated buildings, one could see the glory of these God kingdoms!<br/><br/>Just as Wang Xian was flying in the invincible zone, the news of him stepping into the invincible zone and easily killing the forbidden spell of madness quickly spread throughout the invincible zone!<br/><br/>The Forbidden Spell of madness was a level of strength that far surpassed the Black Tower’s Magi, the old scholar, the Supreme Water Demon King, and the other two!<br/><br/>Some people even speculated that the strength of the forbidden spell of madness alone was enough to fight against the combined strength of the three magi of the Black Tower!<br/><br/>However, such an expert had clashed with the Dragon King and was preparing to fight him at the entrance!<br/><br/>In the end, he was killed in a short period of time. This news spread to the other experts of the invincible region and caused a huge sensation!<br/><br/>“F * CK, is this true? The Mad Hex was killed by the Dragon King?”<br/><br/>“Not only killed, there are more than a hundred experts present. The Dragon King easily suppressed the Mad Hex. He’s simply too powerful!”<br/><br/>“The Dragon King’s strength is heaven-defying. With his strength, how can he be so rational when his cultivation level has yet to catch up? Does he have some sort of treasure?”<br/><br/>“Even the mad demon seal was killed. In the invincible zone, there shouldn’t be more than five opponents of the Dragon King in a one-on-one situation. This includes a group of space behemoths and desolate beasts!”<br/><br/>The Old Monsters of the invincible zone were discussing in shock!<br/><br/>However, while they were discussing, the experts of the other races in the heaven opening desolate continent also received the news!<br/><br/>Many of the experts in the Invincible Zone had sent the news to the AI!<br/><br/>Once it was uploaded to the AI, the disciples of the experts who paid attention to it would naturally receive such arrogance!<br/><br/>“666, the Dragon King is awesome, the Dragon King is invincible. is that crazy hex the guy who tried to snatch the coldlight sword God back in the Dragon Palace’s territory? He actually blocked the dragon king at the entrance of the invincible zone and was easily killed, Hahaha!”<br/><br/>“The Dragon King is too fierce, isn’t he? That Crazy Hex is the most terrifying old crazy demon in the Invincible Zone, and he was easily killed by the Dragon King. The Dragon King is invincible!”<br/><br/>“The Dragon King is going to sweep the entire invincible zone. Invincible talent, so terrifying. He’s really strong. I worship him!”<br/><br/>“This is too fierce. The Invincible Zone is nothing in front of the Dragon King. I wonder how long it will take for the Dragon King to sweep the entire invincible zone!”<br/><br/>In the outside world, the powerful disciples of countless races were discussing animatedly!<br/><br/>This time, the entire universe witnessed the Dragon King’s Power and terror!<br/><br/>The Dragon King had also proven his formidable strength!<br/><br/>“The Dragon King’s strength is somewhat troublesome!”<br/><br/>At the same time, at a location within the invincible region, in a palace of light!<br/><br/>In the middle of a large hall, more than twenty angels gathered together. They frowned slightly as they looked at the other experts and some information on the universe’s AI!<br/><br/>“With more than twenty of us, even if we join forces and summon our own Angel Army, it would still be difficult to kill a crazy demon, right?”<br/><br/>An angel’s gaze swept across his companions, his brows furrowed tightly!<br/><br/>“With our strength and the Army of angels given to us by the third prince, it shouldn’t be a problem to kill the Dragon King. However, we will suffer a lot of losses!”<br/><br/>An angel’s gaze flickered.<br/><br/>“There’s nothing we can do about the losses. We have no choice but to obey the orders of the third prince. We have to find the Dragon King and kill him!”<br/><br/>An angel stood up and said!<br/><br/>“Don’t be so anxious. I think we can create some trouble for the Dragon King when we find him!”<br/><br/>An old-looking angel narrowed his eyes slightly.<br/><br/>“Oh?”<br/><br/>The other angels looked at him!<br/><br/>“Spread the word that the Dragon King has a treasure that can stabilize his mind.”<br/><br/>The Old Angel said with a smile!<br/><br/>The eyes of the other angels lit up.<br/><br/>“Haha, Good, good. Spread the news. In addition, let’s contact the fallen angels. With their help, we will have an easier time!”<br/><br/>The Angels said with laughter!<br/><br/>A treasure that could stabilize one’s mind was relatively rare, and it was not useful to many experts!<br/><br/>However, such a treasure would definitely have a fatal attraction to some experts in the invincible zone!<br/><br/>Especially to those crazy demons!\t\t\t\t\t\t</div>", "images": {}, "success": true}