{"id": 657, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073215.html", "title": "Chapter 3648 - 3648 3647 Trade", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3648 - 3648 3647 Trade</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3648 3647 trade<br/><br/>“We’re almost there!”<br/><br/>Wang Xian had been in the invincible zone for more than two months. He had some understanding of the situation in the Invincible Zone!<br/><br/>There was a huge crack in the void in the Invincible Zone!<br/><br/>There was a huge amount of energy gathered in it. There were all sorts of strange things that did not belong to the outside world!<br/><br/>Of course, some places were also empty!<br/><br/>After two months of flying, he had arrived in front of the territory of the Water Demon King!<br/><br/>Looking at the buildings that remained here, there was no longer any life in them. He raised his eyebrows slightly.<br/><br/>The water demon king and his children had escaped!<br/><br/>Wang Xian opened the universe’s artificial intelligence to take a look. There was no information on the universe’s artificial intelligence!<br/><br/>After all, there were too few creatures in the Invincible Zone!<br/><br/>Moreover, those who stayed here were all old monsters!<br/><br/>They rarely gossiped!<br/><br/>“Let’s escape then. Let’s continue to fly deeper. First, let’s hunt some desolate beasts and space beasts!”<br/><br/>Wang Xian mumbled!<br/><br/>This time, after entering this place, hunting desolate beasts and space beasts was his main target!<br/><br/>This time, he didn’t fly at a leisurely pace. Instead, he shuttled rapidly!<br/><br/>He maintained the speed of a level one master of the universe!<br/><br/>Even if he didn’t reach his maximum speed, he was still keeping his speed as a trump card!<br/><br/>However, even so, his speed was still extremely fast!<br/><br/>Time flew by quickly once again. Wang Xian rarely met other creatures while flying in the Invincible Zone!<br/><br/>“Eh, there seems to be a gathering place ahead!”<br/><br/>After flying for half a month, a territory of buildings appeared in Wang Xian’s line of sight!<br/><br/>There was a black tortoise-shaped mountain peak floating around in all directions!<br/><br/>“Black Tortoise, the image of the Black Tortoise, the peak race. Is this the gathering place of the old monsters of the Black Tortoise Race?”<br/><br/>Wang Xian guessed!<br/><br/>There were many places where the experts of the invincible zone gathered!<br/><br/>These places where the Old Monsters of the invincible zone could gather were also places where the divine kingdoms of the Masters of the universe who had died in battle were gathered.<br/><br/>This was because their divine kingdoms had been summoned over. After they died, they stayed here and formed a land of treasures!<br/><br/>However, the position in front was obviously occupied by an old monster from a peak race!<br/><br/>In the Invincible Zone, the old monsters from the peak race also had their own advantages.<br/><br/>They would not kill each other. Instead, they would form an alliance!<br/><br/>Wang Xian flew forward and planned to go around this area!<br/><br/>There was no need to provoke the gathering place of the old monsters of the Black Tortoise race in the Invincible Zone!<br/><br/>“HMM? Someone is flying over here with a huge amount of dragon power. Dragon King of the Dragon Palace?”<br/><br/>When Wang Xian was about to go around this area, he was in this area.<br/><br/>Lying on top of a pagoda and absorbing energy, Xuanwu opened his eyes and looked ahead!<br/><br/>His eyes flickered slightly!<br/><br/>“It should be that Dragon King. Rumor has it that he has a treasure that can stabilize his mind. Is it true or false?”<br/><br/>“Whether it’s true or false, let’s go and ask!”<br/><br/>At this moment, two other voices of communication came from the entire territory of the dilapidated divine kingdom!<br/><br/>Xuanwu, who was lying on top of the pagoda, moved and flew straight ahead!<br/><br/>At the same time, six old monsters of the Xuanwu clan flew towards Wang Xian from other locations!<br/><br/>“Eh?”<br/><br/>Wang Xian, who was flying, suddenly sensed the movements of the Xuanwu territory. He raised his eyebrows slightly and looked over immediately!<br/><br/>In his line of sight, seven Xuanwu were flying towards Wang Xian. Each of them had a powerful aura!<br/><br/>However, in Wang Xian’s eyes, they were a little weak!<br/><br/>“May I ask if you are the Dragon King of the Dragon Palace?”<br/><br/>One of the black tortoise looked at Wang Xian and asked directly!<br/><br/>“That’s right!”<br/><br/>Wang Xian looked at them and stopped in mid-air. His eyes sparkled as he replied!<br/><br/>If the seven black tortoise had malicious intentions, he didn’t mind killing them all!<br/><br/>In the invincible zone, killing them wouldn’t be a problem!<br/><br/>“It’s rumored that you have a treasure that can stabilize one’s mind. Can you sell some to us? We are willing to pay a high price to buy them!”<br/><br/>One of the Black Tortoise opened his mouth and asked. His eyes were twinkling as he sized up Wang Xian!<br/><br/>“A treasure that can stabilize one’s mind?”<br/><br/>Wang Xian was slightly stunned when he heard this. A hint of doubt appeared on his face. “Who said that I have a treasure that can stabilize one’s mind?”<br/><br/>“HMM? Dragon King doesn’t have one? Many experts in the invincible region have spread this news. A treasure that can stabilize one’s mind is extremely useful to many experts in the invincible region.”<br/><br/>That Xuanwu stared at Wang Xian, trying to determine if his words were true or false!<br/><br/>“Oh?”<br/><br/>Wang Xian raised his eyebrows. Someone actually said that he had such a treasure?<br/><br/>What was this?<br/><br/>His eyes flickered slightly.<br/><br/>However, Wang Xian did indeed have a treasure that could stabilize his mind!<br/><br/>The fruit of the womb!<br/><br/>The fruit of the womb could activate the spiritual intelligence of living beings!<br/><br/>This was a fruit that grew from a branch of a universe knight!<br/><br/>This fruit had always been of little value to Wang Xian!<br/><br/>It didn’t have much of an effect. Currently, there were thousands of such fruits on the ancestral tree of the Dragon Palace!<br/><br/>Taking the fruit could awaken one’s intelligence, and it could also stabilize one’s mind!<br/><br/>It was very useful for universe knights!<br/><br/>And in the invincible region, there was no being above the level of a universe knight!<br/><br/>“Yes, there is!”<br/><br/>He answered and a fruit appeared in his palm!<br/><br/>“Huh?”<br/><br/>The moment the Tachibana fruit appeared, the eyes of the seven Xuanwu experts lit up. Their eyes were filled with a fiery aura!<br/><br/>“If you want to exchange for it, you can take out enough treasures!”<br/><br/>Wang Xian said with a smile. Another ten tachibana fruits floated in front of him!<br/><br/>He wanted to see how strong the other party’s willpower was. If it wasn’t possible, it would be even better!<br/><br/>Of course, this was also because Wang Xian was more principled!<br/><br/>If it were anyone else who possessed his strength, they might have killed the experts of the Xuanwu clan as resources!<br/><br/>Wang Xian couldn’t do such a thing!<br/><br/>“Dragon King, what treasures do you wish to exchange for?”<br/><br/>The seven Xuanwu experts suppressed the greed in their hearts and asked Wang Xian!<br/><br/>“Five innate spiritual treasures, or ten times more than the divine fruits of the same level!”<br/><br/>Wang Xian said with a smile. He was asking for too much!<br/><br/>“Five innate spiritual treasures? Dragon King, your price is too high. This is merely a fruit at the peak of the Universe Knight Realm!”<br/><br/>His words made the seven black tortoise’s breathing slow!<br/><br/>This was a robbery!<br/><br/>A fruit at the peak of the Universe Knight realm was less than one-tenth of the value of an innate spiritual treasure. Now, he needed five to exchange for one fruit!<br/><br/>Although this fruit was more precious and had a great effect on the experts of the invincible region!<br/><br/>This was too much of a scam!<br/><br/>“It’s up to you whether you want to exchange or Not!”<br/><br/>Wang Xian replied with a smile!<br/><br/>“Alright, let’s Exchange!”<br/><br/>The seven black tortoise looked at each other, gritted their teeth, and nodded their heads!<br/><br/>They were all old freaks with four to five innate spiritual treasures in their hands. Some even had more than a dozen of them.<br/><br/>It was still possible to exchange for one!<br/><br/>Most importantly, this fruit was too important to some experts, comparable to their lives!\t\t\t\t\t\t</div>", "images": {}, "success": true}