{"id": 652, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073205.html", "title": "Chapter 3643 - 3643 3642 Road To Invincibility 2", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3643 - 3643 3642 Road To Invincibility 2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3643 3642 road to invincibility 2<br/><br/>Time passed day by day!<br/><br/>Wang Xian rushed towards the invincible zone. At the entrance of the invincible zone, more than a hundred old monsters from the invincible zone were gathered there!<br/><br/>In the middle, the mad restriction sat cross-legged without moving.<br/><br/>Due to the short period of time, there were not many old monsters gathered here!<br/><br/>Moreover, many old monsters rarely paid attention to the matters of the universe’s AI!<br/><br/>Therefore, to be able to gather over a hundred old monsters from the invincible region in such a short amount of time, it was already quite a number!<br/><br/>“I wonder when that Dragon King will come!”<br/><br/>“TSK TSK, if this is a fight, it will be interesting!”<br/><br/>“Yeah, I wonder who will be the victor. The Dragon Palace’s Dragon King is definitely not weak, not to mention the mad restriction. However, I feel that if it’s really a life and death battle, the Dragon Palace’s Dragon King might not dare to!”<br/><br/>“Haha, I think so too. If it’s really a life and death battle, the Mad Demon Prohibition will definitely not care whether you die or I live. His battle experience is definitely not something that the dragon king can compare to. If it’s an evenly matched match, the Dragon King should not dare to fight with the Mad Demon Prohibition!”<br/><br/>Around them, some old monsters from the Invincible Zone were discussing. Their eyes were sparkling as they watched!<br/><br/>“We’re Here!”<br/><br/>At the same time, in front of the Invincible Zone, Wang Xian was looking at the huge and deep entrance. His eyes were sparkling.<br/><br/>That was the entrance to the invincible zone. It led to a huge void rift domain!<br/><br/>This was a battlefield from the past. It was the battlefield between the powerhouses and the Space Beasts!<br/><br/>His body moved and he immediately flew towards the inside.<br/><br/>“Huh?”<br/><br/>When he arrived at the entrance, he immediately sensed that there were some powerhouses floating in the void at the entrance.<br/><br/>They didn’t move at all. They were just floating there!<br/><br/>Floating at the entrance?<br/><br/>This was a little strange!<br/><br/>“Are they waiting for me? or?”<br/><br/>Wang Xian’s eyes flickered slightly as he looked at the few locations!<br/><br/>The other party hadn’t sensed him yet. He was still standing there quietly!<br/><br/>The Tai Chi Dragon Disc on Wang Xian’s body rotated slightly as he flew into the area!<br/><br/>“Huh?”<br/><br/>When Wang Xian started to approach the invincible zone, the old monsters who were closer to him also noticed Wang Xian’s figure.<br/><br/>“A powerhouse has entered. Is it the Dragon King?”<br/><br/>Some of the old monsters looked at Wang Xian in astonishment!<br/><br/>“He has dragon might on him. It should be the Dragon King!”<br/><br/>“This should be the Dragon King. It should be him!”<br/><br/>As Wang Xian got closer and closer to them, the senses of some old monsters became clearer and clearer!<br/><br/>Among this group of old monsters, there were some disciples from the peak races. Naturally, they could recognize him by his aura!<br/><br/>“Oh? Is this to welcome me? Hehe!”<br/><br/>Wang Xian scanned his surroundings and sensed dozens of old monsters from the Invincible Zone. A smile appeared on his face!<br/><br/>He slowly shifted his gaze to the center!<br/><br/>There, a familiar figure was sitting cross-legged in the void!<br/><br/>This figure had obviously sensed Wang Xian’s arrival!<br/><br/>He slowly opened his eyes!<br/><br/>The moment he opened his eyes, a surge of violence surged into his surroundings!<br/><br/>What kind of gaze was that?<br/><br/>Crazy, Bloodthirsty, Numb, and sinister!<br/><br/>His defeated pupils were only a tiny bit black. He looked like a devil!<br/><br/>He stared at Wang Xian as his pupils continued to enlarge. Gradually, a blood-red color appeared in his pupils!<br/><br/>Crazy Demon Seal!<br/><br/>His eyes were not ordinary eyes, but forbidden pupils!<br/><br/>This pair of eyes were completely open. As long as he locked onto a target, he would emit a surge of energy to attack it!<br/><br/>He could not control this pair of eyes!<br/><br/>Hence, it was known as the mad restriction!<br/><br/>When he was not fighting, he would either open one of his eyes or close it!<br/><br/>For a powerhouse of such a realm, even if he closed his eyes, it would not affect him at all!<br/><br/>When Wang Xian and the mad restriction looked at each other, he immediately felt a wave of energy attacking him!<br/><br/>An illusion seemed to have appeared in front of his eyes.<br/><br/>In his hallucination, there was a monster trying to kill him!<br/><br/>Buzz<br/><br/>The tai chi dragon plate around Wang Xian rotated slightly and neutralized the attack of the Forbidden Spell of madness!<br/><br/>The backlash of the Tai Chi Dragon Plate was counter-attacking the forbidden spell of madness!<br/><br/>Buzz<br/><br/>At this moment, the forbidden spell of madness stood up immediately. The terrifying aura of the water and metal attributes on its body rushed out in all directions without any concealment!<br/><br/>A sea appeared out of thin air in the surroundings. In the sea, a golden mountain stood tall.<br/><br/>The prohibition of madness stood on the Golden Mountain. The two horns on its head emitted a glow and its body grew to a size of a million meters!<br/><br/>A violent aura surged towards Wang Xian.<br/><br/>“You can’t enter the Invincible Zone!”<br/><br/>The face of the prohibition of madness slowly turned ferocious as it spoke to Wang Xian in a sinister manner!<br/><br/>“Hehe, I didn’t expect you to wait for me at the entrance. You really seek revenge for the smallest grievance!”<br/><br/>Wang Xian stared at him and sensed his aura. A cold smile appeared on his face!<br/><br/>“The invincible region is my territory!”<br/><br/>The eyes of the Devil’s Bane were throbbing non-stop. The black spots in his eyes slowly turned blood red!<br/><br/>Boom<br/><br/>Just as he finished his sentence, a terrifying space beast flew out from his eyes.<br/><br/>This space beast had an incomparably huge white pupil. It looked extremely terrifying!<br/><br/>It attacked Wang Xian directly!<br/><br/>“Haha, Your Territory? With trash like you, I will kill you today!”<br/><br/>Wang Xian looked at him with disdain when he saw him attacking!<br/><br/>Whoosh<br/><br/>In the next moment, the incorporeal holy wings appeared behind him. Wang Xian used the speed of a level two universe Dominator to meet the space beast!<br/><br/>“What the F * ck, they’re fighting just like that?”<br/><br/>“They’re fighting right away. The aura of the mad demon prohibition is so terrifying. Even a level one universe dominator wouldn’t be a match for it, right?”<br/><br/>“The battle has begun. It seems that the mad demon prohibition wants to kill the Dragon King!”<br/><br/>When the Old Monsters of the invincible region saw the mad demon prohibition and the Dragon King fighting right away, they were astonished!<br/><br/>This was indeed a mad demon!<br/><br/>“Boom!”<br/><br/>Wang Xian flapped the primaless Saint Wings. With a move of his palm, the five elements millstone appeared in his hand. The five elements revolved on it and smashed toward the void Beast formed from energy!<br/><br/>“Boom!”<br/><br/>The destructive power of the Five Elements Millstone covered the void beast and caused it to collapse rapidly!<br/><br/>“Huh?”<br/><br/>The eyes of the inhibition of madness, who was standing on top of the Golden Mountain, narrowed slightly when he saw this scene. He opened his arms.<br/><br/>Boom! Boom! Boom<br/><br/>Numerous golden mountains were flowing in the surroundings. The phantom images of the giant beasts gradually appeared on the Golden Mountains!<br/><br/>“Roar! Roar! Roar!”<br/><br/>They roared and dozens of gigantic golden mountains smashed toward Wang Xian in unison!<br/><br/>“Five elements, innate technique!”<br/><br/>Wang Xian moved his body and flew to the center of the Five Elements Millstone. He took a light step!<br/><br/>The Five Elements Millstone had a breakthrough. Similar to the Tai Chi Dragon Plate, it not only increased one’s strength but also possessed terrifying abilities!<br/><br/>Compared to the improvement of the Tai Chi Dragon Plate, the improvement of the five elements Millstone was even stronger!<br/><br/>After all, the Five Elements Millstone was the fusion of five attributes, which was better than the fusion of light and darkness!\t\t\t\t\t\t</div>", "images": {}, "success": true}