{"id": 659, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073219.html", "title": "Chapter 3650 - 3650 3649 Seized The Treasure And Set Up An Ambush", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3650 - 3650 3649 Seized The Treasure And Set Up An Ambush</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3650 3649 seized the treasure and set up an ambush<br/><br/>Wang Xian flew past the Sea of demons and nothing happened!<br/><br/>This made him raise his eyebrows. He didn’t stay any longer and continued to fly deeper into the sea!<br/><br/>He was going to hunt some desolate beasts and space beasts when he entered the deeper part of the sea!<br/><br/>There were many desolate beasts and space beasts in the invincible region. Among them, there were thousands of level three masters of the universe!<br/><br/>“Let’s follow the trail and follow behind!”<br/><br/>More than ten demons sent a voice transmission when they saw Wang Xian leaving. Their demonic eyes shone with a blood-red luster!<br/><br/>Without any hesitation, they flew directly in the direction where Wang Xian disappeared!<br/><br/>Every peak race had their own terrifying aspects!<br/><br/>The strength of demons lay in their physical bodies, demonic eyes, and demonic wings!<br/><br/>Their eyes possessed powerful abilities!<br/><br/>Although Wang Xian’s figure had disappeared, they could still trace him through the traces.<br/><br/>“This Dragon King’s speed is too fast. We can’t keep up with him at all. We might lose him in a few days!”<br/><br/>After flying for more than ten minutes, a demon frowned slightly and said!<br/><br/>“His speed is comparable to a real master of the universe. We need to borrow other treasures. Let’s go, get on the ship. In addition, to prevent accidents, we have to make some plans!”<br/><br/>A demon waved his arm, and a dark ship appeared in front of them!<br/><br/>The ship had a huge sail with demon wings painted on it!<br/><br/>This was a true treasure at the level of a connate true treasure, a true treasure that could help with speed!<br/><br/>Sitting on the demon ship and injecting energy, it could burst out with great speed!<br/><br/>“Okay!”<br/><br/>A dozen demons immediately flew onto the ship.<br/><br/>“Contact the other circles in invincible region and see if they are interested. If I remember correctly, if we continue to fly deeper, we should be able to meet an area occupied by an old monster of the skeleton race, right? Contact Them!”<br/><br/>A demon said!<br/><br/>“Weng!”<br/><br/>At this time, the demon ship started to move, and the demon wings on the sail started to flutter strangely!<br/><br/>The devil ship instantly erupted with a speed that wasn’t any slower than a universe ruler realm warrior!<br/><br/>“The traces of the dragon king over here are very heavy, let’s lower our speed, don’t be discovered!”<br/><br/>A few hours later, a devil’s blood red eyes stared ahead, speaking to the Devil Ship’s master!<br/><br/>“Alright!”<br/><br/>The devil nodded, lowering his speed slightly!<br/><br/>“The Dragon King hasn’t changed his direction. Three days later, he should be able to reach the territory occupied by the old monsters of the skeleton clan. The Old Monsters of the skeleton clan are willing to take action. At the same time, the top-tier experts of our invincible territory, the star barbarian skeleton leader of the skeleton clan, will also take action. When the time comes, they will ask us to split it 50-50!”<br/><br/>“Okay, we agree. In order to prevent accidents, let the skeleton clan’s experts welcome us. The position in front of us can no longer be returned to the divine kingdom in an instant!”<br/><br/>At this moment, a few old demons beside them were conversing.<br/><br/>More than a dozen demons had already made their plans!<br/><br/>At the same time, in a faraway place in front of them, in the void, three incomparably huge space beast skeletons were floating!<br/><br/>These three space beast skeletons no longer had any energy on them, but their huge bodies covered a huge area!<br/><br/>Especially one of the space behemoths. Although its black skin had lost its energy, it still retained it and covered a large area!<br/><br/>This was a treasure land, occupied by the old monsters of the skeleton race!<br/><br/>At this time, seven to eight skeletons quickly flew out from under the cover of a space Behemoth’s skeleton in the center!<br/><br/>The ghostly flames in their eyes were dancing, and their bodies were emitting a dark aura!<br/><br/>“CHIRP CHIRP!”<br/><br/>Soon, an incomparably huge skeleton bird appeared below the eight powerhouses of the skeleton race!<br/><br/>The skeleton bird carried them and disappeared in an instant!<br/><br/>“Eh?”<br/><br/>In the void of the invincible zone, Wang Xian was shuttling back and forth rapidly.<br/><br/>At this moment, he suddenly exclaimed in surprise. His eyes were sparkling, and the corners of his mouth curled up slightly!<br/><br/>In the invincible zone, there were people who claimed that they had a treasure that could stabilize their minds. He added fuel to the fire by making this matter public and even quoted an extremely high price for the transaction.<br/><br/>This kind of behavior was simply courting death in the eyes of some old monsters in the Invincible Zone!<br/><br/>This kind of behavior was extremely dangerous!<br/><br/>Wang Xian also knew that it was extremely dangerous. Therefore, after the transaction with the Xuanwu clan was completed, he had been vigilant in his surroundings!<br/><br/>When he was flying, he would have one of his netherspirit avatars hide behind him and blend into the space meteorite!<br/><br/>He would monitor the back!<br/><br/>Furthermore, whenever he encountered a complicated terrain in front of him, he would have another netherspirit avatars check it out!<br/><br/>If he was on his guard, the chances of him ambushing him would be reduced by more than half!<br/><br/>However, at this moment, the Netherspirit avatars behind him sent a message!<br/><br/>A dark ship was following his tracks!<br/><br/>On the dark ship, the ghost avatar saw the silhouette of a demon!<br/><br/>A dark ship!<br/><br/>A demon!<br/><br/>This made Wang Xian instantly recall that when he passed by that area, there was no movement from that area!<br/><br/>It wasn’t that there was no movement, but that the demon was following behind him!<br/><br/>It was definitely not a good thing for them to follow behind him so sneakily!<br/><br/>“They must be following me to consume the fruit of the womb. They didn’t make any trade with me, so they must be trying to snatch it from me. The demons have a strong tracking ability.”<br/><br/>“Furthermore, they didn’t make a move immediately. Do they feel that they don’t have the ability, or do they want me to go deeper? It would be very difficult or even impossible for them to break through this void crack and return to their divine kingdom.”<br/><br/>“Or are they waiting for someone? Are they collaborating with other experts?”<br/><br/>Wang Xian analyzed but didn’t make a move immediately.<br/><br/>He stopped in the void and moved his body. Another Netherspirit clone flew forward.<br/><br/>He lowered his speed to the level of a level three overlord in the universe!<br/><br/>In this way, the Netherspirit clone could maintain a certain distance from him!<br/><br/>With this method, Wang Xian continued to fly!<br/><br/>“HMM? The Dragon King’s speed has decreased. We have to slow down!”<br/><br/>At the back, the demon controlling the demon ship stared ahead and suddenly spoke, causing the speed of the demon ship to drop drastically!<br/><br/>The rest of the demons nodded and observed their surroundings carefully!<br/><br/>Time passed little by little. The skeleton race experts in front were closing in quickly!<br/><br/>Behind them, more than a dozen old monsters of the demon race were maintaining a certain speed as they followed behind!<br/><br/>“There are skeleton race experts in front, and there are demon race experts behind. Hehe, interesting. They really want to snatch the treasure. They are going to join forces to attack!”<br/><br/>Two days later, the Netherspirit avatar in front returned immediately after seeing the skeleton race experts in front.<br/><br/>Wang Xian revealed a smile on his face!<br/><br/>It was time to reap the rewards!\t\t\t\t\t\t</div>", "images": {}, "success": true}