{"id": 650, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073201.html", "title": "Chapter 3641 - 3641 3,640 Breakthrough", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3641 - 3641 3,640 Breakthrough</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3641 3,640 breakthrough<br/><br/>Name: Wang Xian<br/><br/>Race: Yin-yang, wind-thunder, five elements divine dragon (man-dragon unity)<br/><br/>Level: Universe Knight Level 7(the ninth form of the Divine Dragon Transformation)<br/><br/>Origin: 1% (99% needed for the next breakthrough)<br/><br/>Ability: rule the water race (rule the water race below their own level)<br/><br/>Devour living beings (devour living beings to extract origin)<br/><br/>Control of the five elements<br/><br/>[ cultivation method: Divine Dragon Transformation ]<br/><br/>[ ability: soul-absorbing, spirit-attaching ]<br/><br/>[ ability: Dragon Eye Lock, Five Elements Dragon Claw, Yin-yang realm-breaking, eight luminaries Dragon Scale, Sacred Dragon Shadow, eight Heavenly Dragon Tribes, Dragon Tomb, Cloud Dragon Soaring, True Dragon Body ]<br/><br/>[ ability: octagonal dragon pillar, eight dragon avatars, Lofty Dragon Horns, Mighty Heavenly Dragon, Divine Tail Pearl, Life Dragon Breath, Shadow Dragon Avatars ]<br/><br/>Control Law: metal, wood, water, fire, Earth, light, dark wind and thunder<br/><br/>Divine Kingdom: Dragon Palace<br/><br/>Dragon Palace: Innate.<br/><br/>Members of Dragon Palace: 7960450<br/><br/>After a breakthrough in his strength, Wang Xian looked at his attributes and revealed a smile!<br/><br/>After this breakthrough, he had obtained a relatively powerful law aspect!<br/><br/>Shadow Dragon Avatar!<br/><br/>This was a life-saving method that could withstand fatal attacks.<br/><br/>After a breakthrough, a real master of the universe at level one could be killed instantly by Wang Xian if he was not careful!<br/><br/>With the help of the inoriginator sacred wings, his speed could reach the level of a Master of the universe at level two!<br/><br/>It would not be a problem for him to fight against three masters at Level One!<br/><br/>With the Tai Chi Dragon Plate, he would be even more powerful!<br/><br/>“Next, I have to upgrade the Five Elements Millstone.”<br/><br/>Wang Xian looked at the five elements millstone, which was absorbing the innate spiritual treasure, and a smile appeared on his face!<br/><br/>After the breakthrough of the Five Elements Millstone, his strength would be even more terrifying!<br/><br/>At that time, he wanted to see if there was anyone in the invincible zone who could fight against him!<br/><br/>The corner of his mouth curled up slightly. He wasn’t in a hurry to help the five elements millstone breakthrough. Instead, he came to the front of the ancestral tree!<br/><br/>His body moved, and two netherspirit avatars appeared beside him!<br/><br/>After his breakthrough, the Netherspirit Avatars had also completed their breakthrough!<br/><br/>The Netherspirit Avatars had also received an upgrade not long ago!<br/><br/>In the past, he could only have two netherspirit avatars, but after this upgrade, he sensed that he could add two more!<br/><br/>In other words, if he obtained another netherspirit, he could nurture two more!<br/><br/>By then, he would have four netherspirit avatars!<br/><br/>“I should be able to get netherspirit avatars in the invincible zone that I haven’t nurtured yet.”<br/><br/>Wang Xian mumbled to himself. After checking the current situation of the universe’s AI, he began to assist the five elements millstone to achieve a breakthrough as soon as possible!<br/><br/>Based on the current speed, the five elements millstone should take two months to complete its evolution!<br/><br/>Time passed day by day, and the universe’s AI was Abuzz with discussion.<br/><br/>After discussing the strength of the Dragon Palace, they discussed the Dragon King’s next move to sweep across the Invincible Zone!<br/><br/>There were all kinds of speculations!<br/><br/>“That Dragon Palace’s Dragon King is going to step into the invincible zone. This is an opportunity. We don’t have to wait for him to break through before we make a move!”<br/><br/>At the same time, on the Ocean Dragon Island in the mountain and sea, the Green River Phoenix looked at the third Prince with a twinkle in her eyes!<br/><br/>“This is indeed an opportunity. Now that the Dragon Palace has basically unified the Divine Dragon Bloodline, we must kill their leader, the Dragon King. If he goes to the invincible zone, we can make use of this opportunity. Otherwise, we might have to wait for 100,000,000,000,000, or even 10,000,000,000 years!”<br/><br/>The third prince nodded, his eyes shining!<br/><br/>All their previous plans had failed. The only way now was to destroy the Dragon King and destroy the Dragon Palace. Only then could they subdue him!<br/><br/>“This time, the two of us will make arrangements together. We must kill the Dragon King!”<br/><br/>The Green River Phoenix said to the third prince.<br/><br/>The third prince nodded heavily!<br/><br/>This time, he wanted to destroy the Dragon King. He couldn’t afford to lose!<br/><br/>“Do your best. That Dragon King is a bit strange!”<br/><br/>The Green River Water Phoenix added another sentence!<br/><br/>“Don’t worry. As long as he enters the invincible zone, I can send people into the invincible zone to make a move. I still don’t believe that he is a match for Our Angel Legion. However, that guy is indeed strange. You have to be prepared, Green River!”<br/><br/>The third prince nodded his head.<br/><br/>“Okay!”<br/><br/>Qing Jiang Water Phoenix nodded her head!<br/><br/>Now that the Dragon Palace and the Dragon King had displayed their formidable strength one after another, they already knew that the Dragon King was a little strange!<br/><br/>If they were to make a move again this time, they had to be fully prepared!<br/><br/>They had to kill him immediately!<br/><br/>With their abilities, they could do it!<br/><br/>Boom<br/><br/>Wang Xian didn’t know that the third prince and the Green River Water Phoenix were plotting to kill him!<br/><br/>In fact, he didn’t expect that the two powerhouses from the Angel clan would be plotting to kill him!<br/><br/>Two months passed very quickly. On this day, a powerful dragon’s might rose in the Dragon King’s Palace!<br/><br/>Roar! Roar! Roar<br/><br/>Dragon roars sounded one after another. In the middle of the Dragon King’s Palace, a gigantic millstone was floating there!<br/><br/>On top of the Millstone, five dragon heads were emitting a terrifying pressure!<br/><br/>“I’ve made a breakthrough!”<br/><br/>Wang Xian looked at the five elements millstone in front of him and smiled!<br/><br/>After the Five Elements Millstone had made a breakthrough, his strength would reach its strongest state!<br/><br/>Even if he were to face more than a dozen level one masters of the universe at the same time, he would be able to handle them with ease!<br/><br/>An existence at the level two realm of the Universe Dominator would be able to fight against them!<br/><br/>After all, his speed was not inferior to a powerhouse at the second level of the Universe Dominator!<br/><br/>“Prime Minister Gui!”<br/><br/>Wang Xian shouted softly!<br/><br/>“I’m Here!”<br/><br/>Prime Minister Gui entered and greeted respectfully!<br/><br/>“I’m preparing to head to the invincible region. I’ll leave the matters of the Dragon Palace to you!”<br/><br/>Wang Xian instructed him!<br/><br/>“Dragon King, do you want some powerhouses of the Dragon Palace to follow you?”<br/><br/>Prime Minister Gui asked!<br/><br/>“There’s no need. I can go there myself.”<br/><br/>Wang Xian shook his head. His current strength was not something that the leaders could compare to!<br/><br/>Bringing them there would not be of much help to him!<br/><br/>After giving some instructions, he flew out without hesitation!<br/><br/>His target was the invincible zone!<br/><br/>The Invincible Zone was very far from the Dragon Palace. It would take him more than a year to get there!<br/><br/>Wang Xian’s speed was very fast. He was at the second level of the Universe Dominator!<br/><br/>He could fly in the crack in the Void!<br/><br/>He had plenty of time to reach the invincible zone in two years!<br/><br/>This time, he didn’t keep a low profile when he went to the Invincible Zone!<br/><br/>“I’m already on the way to the Invincible Zone!”<br/><br/>When he came to a city to rest, Wang Xian sent a message through the universal ai!<br/><br/>As the Dragon King of the Dragon Palace, the message he sent naturally attracted a lot of attention!<br/><br/>The reason why Wang Xian sent this message was to inform the experts of the Invincible Zone!<br/><br/>The reason why he entered the invincible zone this time was for resources. It was to kill some desolate beasts and space beasts!<br/><br/>Of course, his statement was also to tell some fellows who were courting death.<br/><br/>If they wanted to fuck me, Wang Xian would be able to kill them with peace of mind!\t\t\t\t\t\t</div>", "images": {}, "success": true}