{"id": 656, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073213.html", "title": "Chapter 3647 - 3647 3646 Invincible Road 6", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3647 - 3647 3646 Invincible Road 6</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3647 3646 Invincible Road 6<br/><br/>The third prince and the Green River Water Phoenix didn’t get their men to work together.<br/><br/>Because in their opinion, since the Dragon King had entered the invincible territory, they could kill him with their own hands!<br/><br/>The other party was just a guarantee!<br/><br/>In fact, killing a dragon king in the invincible territory, if they still needed to work together, it would be too embarrassing!<br/><br/>Even if the Dragon King was a bit of a monster!<br/><br/>Take the third prince for example, he directly gave his subordinates an angel army. This army had 500 universe masters with level 3 combat strength.<br/><br/>With such strength, how could they not kill the Dragon King?<br/><br/>In fact, the dozens of angels in the invincible region all had a powerful angel army given to them by the third prince!<br/><br/>Each of them had 30 to 40 level 3 universe Dominators!<br/><br/>With this strength and this number, they could easily kill even a mad demon!<br/><br/>The only difference was that the strength that the Dragon King had displayed was a little terrifying!<br/><br/>If he could easily kill the mad demon restriction, they wouldn’t be able to stop him if he dragged some angels with him before he died!<br/><br/>Therefore, they were prepared to give the Dragon King some trouble!<br/><br/>A treasure that could stabilize one’s mind was extremely attractive to many experts in the invincible zone!<br/><br/>If some experts knew that the Dragon King had such a treasure, they would definitely have ideas!<br/><br/>And now that the Dragon King had displayed such strength and still dared to have ideas about him, he must be a top-tier mad devil in the Invincible Zone or an alliance!<br/><br/>No matter which one it was, as long as someone attacked the Dragon King, it would definitely not be easy!<br/><br/>Moreover, in the invincible zone, there was another characteristic!<br/><br/>The depths of the invincible zone could not be returned to one’s own divine kingdom in an instant!<br/><br/>Because this place belonged to a void crack. If one wanted to return, one needed to break the restriction of the void crack!<br/><br/>This restriction was not so easy to break!<br/><br/>At the very least, it was very difficult to break even an expert who was at level one or two, the ruler of the universe!<br/><br/>Of course, if one was strong enough, he could still return to his divine kingdom in an instant!<br/><br/>Therefore, they were not worried that the Dragon King would leave the Invincible Zone!<br/><br/>“Let’s go, Let’s Go!”<br/><br/>The group of angels looked at each other and flew out immediately!<br/><br/>In the direction of the Taishui Demon King’s Lair!<br/><br/>At the same time, news was spreading rapidly in the invincible zone!<br/><br/>Wang Xian didn’t know that the conspiracy against him in the Invincible Zone had begun!<br/><br/>However, even if he knew, he would be happier!<br/><br/>What was he doing here?<br/><br/>He was here to look for resources!<br/><br/>The reason why he came here in such a high-profile manner was to kill some people who were courting death and obtain their resources!<br/><br/>One had to know that killing any one of them here could increase the combat strength of a level three universe dominator in the Dragon Palace!<br/><br/>Why Not?<br/><br/>Wang Xian was also very confident in his own strength!<br/><br/>He wasn’t in his peak state when he killed the demon seal of Madness!<br/><br/>He hadn’t summoned the accompanying spirit yet. Similarly, he hadn’t summoned the two netherspirit avatars yet!<br/><br/>During the battle, he didn’t even rely on the power of the Tai Chi Dragon Disc!<br/><br/>He flew slowly in the invincible region, and time passed day by day!<br/><br/>The news of the Dragon King entering the invincible region had also spread throughout the invincible region!<br/><br/>Those who had some information channels had all received this news!<br/><br/>And at this moment, it was located in the nest of the Tai Shui Demon King!<br/><br/>The Tai Shui Demon Emperor occupied a territory due to his powerful strength. There were many disciples in his race, and among them were 10 universe masters with Level 3 Combat Power!<br/><br/>In the center of the Tai Shui Demon Emperor’s Nest, a god country was quietly floating there!<br/><br/>Around this god country, there were 10 God countries guarding it!<br/><br/>Within the god countries guarded by 10 God countries, a very old looking figure was sitting cross-legged on a throne!<br/><br/>The figure’s aura was extremely weak, as if he was going to age at any moment!<br/><br/>Below, ten universe masters with level 3 combat power stood there respectfully!<br/><br/>“Even the mad demon seal was killed by that Dragon King!”<br/><br/>The old figure’s body trembled slightly, and his expression was extremely unsightly!<br/><br/>“Father, according to the information we received, that Dragon King is flying towards us. Since he dares to come, we brothers will make sure he never returns. We will take revenge for you, Father!”<br/><br/>An old man in the middle said with a cold face!<br/><br/>“That’s right. With the defense of our Tai Shui Domain, as long as the Dragon King dares to come, the ten of us will join hands and use the attacks from the domain to absolutely destroy the Dragon King!”<br/><br/>Another old man beside him said with a face full of killing intent!<br/><br/>“It’s useless. The Dragon King is very terrifying, especially his defense!”<br/><br/>The frail old man on the throne was the supreme water demon king.<br/><br/>He had personally witnessed the Dragon King’s strength!<br/><br/>Facing the Dragon King, he couldn’t even break through his opponent’s defense!<br/><br/>“Father, don’t we have a chance?”<br/><br/>Hearing the Supreme Water Demon King’s words, the descendants of the supreme water demon king said with slight dissatisfaction!<br/><br/>With the combined strength of ten of them and the power of the supreme water domain, the mad demon could easily contend against them!<br/><br/>“Wait for my orders!”<br/><br/>The Supreme Water Demon King’s expression changed as he ordered!<br/><br/>At the same time, he took out the universe AI and sent a message!<br/><br/>When the supreme water demon king’s son heard his words, he didn’t dare to have any objections and waited respectfully!<br/><br/>The Supreme Water Demon King looked at the universe AI and waited quietly for a reply!<br/><br/>“Go to the Huang River Phoenix!”<br/><br/>After half an hour, the supreme water demon king raised his head, “That Dragon King, he won’t be able to leave the invincible region. Without US taking action, there will naturally be someone to destroy him!”<br/><br/>“Oh? It’s father!”<br/><br/>The descendants of the supreme water demon king were slightly stunned and immediately replied!<br/><br/>The huangshui Phoenix was the name of a domain. It was a domain occupied by the Phoenix Race’s Water Elemental Phoenix.<br/><br/>It was also a treasure land left behind by a water elemental universe overlord!<br/><br/>Very quickly, the disciples of the entire supreme water demon king race began to move!<br/><br/>The Grand Aquatic Demon King was the only clan in the Invincible Zone, and also the only unusual creature!<br/><br/>They left with such a big movement, which attracted the attention of many powerful people!<br/><br/>“They should be running away from that Dragon King!”<br/><br/>“Has the son of the Grand Aquatic Demon King started to run away?”<br/><br/>“Although the Grand Aquatic Demon King is dead, the ten guys among his sons are also very powerful. When they join hands, they are not weaker than their father. However, the Dragon King is even more terrifying, so they still ran away!”<br/><br/>“Some experts spread the news that the Dragon King has a treasure that can stabilize his intelligence. Is It True? This is very attractive to many experts!”<br/><br/>“I don’t know if it’s true or not, but the temptation of this treasure is too strong. For many experts, it is a life-saving treasure. I think many experts are tempted!”<br/><br/>The commotion in the water demon king’s domain caused many experts to discuss!<br/><br/>At the same time, another piece of news quickly spread in the invincible domain!\t\t\t\t\t\t</div>", "images": {}, "success": true}