{"id": 665, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073231.html", "title": "Chapter 3656 - 3656 3655 Was A Public Transaction", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3656 - 3656 3655 Was A Public Transaction</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3656 3655 was a public transaction<br/><br/>“According to the memories I obtained, many of these messengers are clones of the old monsters in the Invincible Zone. There are no rules in the invincible zone. Through this method, they can ensure their own safety!”<br/><br/>Wang Xian looked at the trading venue with his eyes glowing!<br/><br/>He hesitated for a moment before flying down!<br/><br/>Buzz<br/><br/>There was an array formation covering the area below. When he landed, he could easily enter it!<br/><br/>However, when he entered, he felt a powerful force suppressing him!<br/><br/>It was suppressing his strength. This suppressive force made him unable to unleash even one-tenth of his strength!<br/><br/>This array formation was left behind on this piece of land!<br/><br/>Its function was to protect and suppress!<br/><br/>If the outside world wanted to break through this formation, even a madman wouldn’t be able to do so!<br/><br/>As for the Suppressive Force, no powerhouse would be able to unleash even one-tenth of his strength!<br/><br/>This was a perfect trading location!<br/><br/>When Wang Xian entered, he didn’t attract the attention of too many powerhouses inside!<br/><br/>The entire trading location was very small, only covering an area of more than 10,000 kilometers!<br/><br/>There weren’t many experts walking around here. There was a signboard around each of the experts, and on it were the items that were being traded!<br/><br/>Wang Xian took a glance. There were many items that were being traded, including the corpses of the space behemoths!<br/><br/>He saw all kinds of divine herbs and treasures, innate spiritual treasures, gu worms, strange items, and even forbidden techniques.<br/><br/>“Eh, there are even Netherspirit Avatars?”<br/><br/>Wang Xian saw a signboard beside an illusory figure with the words ‘deal with Netherspirit’written on it.<br/><br/>An ownerless bait netherspirit!<br/><br/>Currently, with the improvement of the Dragon Palace and the ancestral tree, Wang Xian could have two more netherspirit avatars!<br/><br/>As long as he obtained netherspirit avatars, he could quickly reach the same level as himself!<br/><br/>Wang Xian’s current combat strength did not rely on the five elements millstone, the Tai Chi Dragon Disc, or the incorporeal sacred wings. He was also at the level of a true master of the universe at the first level.<br/><br/>His netherspirit avatar also possessed such strength!<br/><br/>Adding one more netherspirit avatar was equivalent to adding an ordinary master of the universe at the level of a first level expert. This increase was not small!<br/><br/>If he had all four of his netherspirit avatars, the strength he could unleash together would be even stronger than the five elements Millstone!<br/><br/>Wang Xian moved and arrived in front of the stall in an instant.<br/><br/>At the side of the stall, an expert from the Hades tribe glanced at him without saying a word!<br/><br/>“Five ordinary fruits to stabilize your mind in exchange for two Hades’avatars. Tell your master whether you want to trade or Not!”<br/><br/>Wang Xian said directly to the Hades tribe expert!<br/><br/>“Huh?”<br/><br/>“A treasure to stabilize your mind?”<br/><br/>That underworld race expert was slightly stunned. He revealed a stunned expression!<br/><br/>“What divine fruit? I need to take a look!”<br/><br/>That underworld race expert stared at Wang Xian and asked immediately!<br/><br/>Buzz<br/><br/>Wang Xian moved his palm and the soul-returning embryo fruit appeared in front of him!<br/><br/>“A fruit at the peak of the Universe Knight level. Its aura can indeed stabilize your mind. However, it’s too little to exchange for two underworld ghost avatars with five of them!”<br/><br/>The eyes of the expert from the netherspirit race lit up. He sized the fruit up carefully and said!<br/><br/>“Hehe, ask your master. If he wants to exchange, then so be it. If he doesn’t want to exchange, then so be it!”<br/><br/>Wang Xian said indifferently!<br/><br/>“HMM?”<br/><br/>The eyes of the expert from the Netherspirit race flickered. He slowly closed his eyes!<br/><br/>Buzz<br/><br/>However, very soon, Wang Xian suddenly felt that the aura of the expert from the Netherspirit race in front of him had changed!<br/><br/>The aura of his body was rising rapidly, and his temperament had also undergone a huge change!<br/><br/>A pair of deep eyes stared at Wang Xian.<br/><br/>Then, they slowly landed on the evergreen fruit in front of him.<br/><br/>“Dragon King of the Dragon Palace?”<br/><br/>The Hades expert in front of him asked with a hint of doubt!<br/><br/>“Oh? Yes!”<br/><br/>Wang Xian nodded and did not hide anything. He stared at him and asked, “Do you want to make a Deal?”<br/><br/>“I want to make a deal. I want more ordinary fruits.”<br/><br/>The expert from the Netherworld race said immediately!<br/><br/>“More ordinary fruits. That depends on whether you can produce enough items!”<br/><br/>Wang Xian smiled and said, “I only need two netherworld ghosts. I don’t want more!”<br/><br/>“Dragon King, your price is too high!”<br/><br/>The expert from the Netherworld race said!<br/><br/>“Rare goods can be obtained. You Don’t have to accept them!”<br/><br/>Wang Xian replied indifferently!<br/><br/>“Give me four of them!”<br/><br/>The expert from the Netherworld race moved his palm and two Netherworld ghosts and ten innate spiritual treasures appeared in his hand!<br/><br/>Wang Xian smiled when he saw this. With a move of his palm, four ordinary fruits appeared in his hand!<br/><br/>The trade was completed!<br/><br/>To Wang Xian, this trade was a bloody profit!<br/><br/>“Dragon King of the Dragon Palace?”<br/><br/>“The divine fruit to stabilize one’s mind?”<br/><br/>At this moment, an expert at the side saw the transaction and could not help but growl in a low voice!<br/><br/>“Hehe, that’s right. Consume the eternal embryo fruit to stabilize one’s mind. Your master wants to make a transaction. Take out the treasure and you should all know my transaction price, right?”<br/><br/>Wang Xian swept his gaze across the surroundings and said with a faint smile!<br/><br/>As he spoke, an identical figure appeared beside him. One of the figures moved and left the place immediately!<br/><br/>Wang Xian left a clone here to prevent a large number of powerhouses from attacking him!<br/><br/>As for his original body, he could hide in other places!<br/><br/>If it was a trade, the clone would complete it!<br/><br/>If someone wanted to attack him, it didn’t matter even if the clone died.<br/><br/>The treasures of his clone could also be placed in the divine kingdom, which was also the Dragon Palace!<br/><br/>This method was also used by many old monsters in this trading venue!<br/><br/>“There are still a few thousand pieces of the common embryo fruit ancestor tree. Currently, they are of no use to the Dragon Palace. If I can exchange them for a large batch of innate spiritual treasures and resources, it would be a huge benefit to the Dragon Palace!”<br/><br/>Wang Xian flew out of this continent. Sensing that there were many pairs of eyes staring at him, he immediately sped up!<br/><br/>Whoosh<br/><br/>He flew for half an hour and scanned his surroundings. Immediately, he flew towards the other side of the long river.<br/><br/>When he arrived at the territory of the desolate beast, the space behemoth, he hid directly on top of a tree!<br/><br/>Here, the trading ground was not too far away. Wang Xian hid on top of the tree and sensed everything that was happening in the trading ground!<br/><br/>“The Dragon King of the Dragon Palace is actually going to conduct a trade here!”<br/><br/>“Tell master immediately that a treasure that steadies one’s mind is a life-saving item for our master!”<br/><br/>“Such a divine fruit is extremely tempting to even the mad demons. It is also extremely useful to our master!”<br/><br/>At this moment, the arrival of Wang Xian at the trading ground had caused quite a stir!<br/><br/>The aura of some of the powerhouses who were masters of the universe with level-two combat strength changed instantly. It was obvious that they were occupied by the old monster’s mind as he looked at Wang Xian’s clone!<br/><br/>This clone of Wang Xian possessed the combat strength of a Master of the universe with level-three combat strength. He sat cross-legged and wrote down the rules of the trade while scanning the surroundings with a smile on his face!\t\t\t\t\t\t</div>", "images": {}, "success": true}