{"id": 669, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073239.html", "title": "Chapter 3660 - 3660 3659, Kill The Old Witch", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3660 - 3660 3659, Kill The Old Witch</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3660 3659, kill the old witch<br/><br/>In her line of sight, an incomparably terrifying divine dragon was attacking her!<br/><br/>Seeing this terrifying divine dragon, the old witch’s pupils slightly constricted, her face filled with shock!<br/><br/>“Dragon King of the Dragon Palace!”<br/><br/>She let out a low roar, and the tattoo on her face directly flew out from her face, forming an incomparably powerful mask array in front of her!<br/><br/>The mask-like formation emitted a strange energy as if it wanted to suck everything into this strange mask!<br/><br/>“Old Thing, you dare to Kill My clone and deal with me. Today is the Day You Die!”<br/><br/>When Wang Xian saw the mask formation, he waved his dragon claw and an illusory five elements millstone appeared in front of him. It charged straight at the mask formation!<br/><br/>“Boom!”<br/><br/>A terrifying collision was heard and the mask formation was instantly destroyed by Wang Xian.<br/><br/>“Crash.”<br/><br/>Wang Xian flapped his incipient saint wings and continued to attack the old witch at a terrifying speed!<br/><br/>Compared to Wang Xian, the old witch’s speed was much slower.<br/><br/>There were two types of wizards. One was the type of formation and the other was the type of body modification!<br/><br/>The old witch had lived for a long time. Basically, she was involved in both types!<br/><br/>However, she was still best at formations!<br/><br/>Her body was only comparable to the top-notch experts in the invincible zone!<br/><br/>This was already considered very powerful. However, from Wang Xian’s point of view, she was much weaker!<br/><br/>Wizards who specialized in formations were most afraid of close combat.<br/><br/>They were most afraid of powerhouses who were good at speed!<br/><br/>Wang Xian’s speed was the old witch’s greatest restraint!<br/><br/>“How did this Dragon King catch up to me so quickly? And how did he know my location!”<br/><br/>When the old witch saw Wang Xian charging towards her, her extremely old face revealed a look of fear!<br/><br/>As a wizard, she would never leave any trace of her presence or presence wherever she went!<br/><br/>It was impossible for others to track her down!<br/><br/>However, the Dragon King was able to lock onto her so quickly. This surprised and shocked her!<br/><br/>“Nine tentacles, get lost!”<br/><br/>The old witch saw Wang Xian appearing in front of her in an instant. Her eyes were beating wildly as she roared sinisterly!<br/><br/>This was because the tattoo on her face had disappeared. At this moment, it was as if her nose and mouth had all disappeared. She looked extremely horrifying!<br/><br/>At the position behind her, nine sticky tentacles suddenly emerged and swept towards Wang Xian!<br/><br/>“Ahhhh!”<br/><br/>Miserable screams could be heard coming from the tentacles.<br/><br/>Vaguely, one could see that there were snake-like dire beasts sealed on these tentacles!<br/><br/>The strength unleashed by each tentacle was not weaker than a level three master of the universe!<br/><br/>“Nine Dragon Clones!”<br/><br/>Wang Xian flapped his wings and nine clones appeared around his body. Each of the clones attacked one of the tentacles!<br/><br/>“Roar!”<br/><br/>“Ahhhh!”<br/><br/>The roars and screams resonated with each other. The nine dragon clones bit the tentacles of the old witch!<br/><br/>“Ahhhh!”<br/><br/>These nine tentacles were a modification of the old witch’s body. With just the strength of her body, there was a huge gap between her and Wang Xian’s strength!<br/><br/>Under the attack of the nine dragon clones, the nine tentacles started to break apart rapidly!<br/><br/>Wang Xian revealed a cold smile as he clawed at the old witch’s body with his dragon claws!<br/><br/>“Shadow Formation!”<br/><br/>When the old witch saw that her nine tentacles were easily broken, her expression changed drastically as she roared loudly!<br/><br/>The tattoo on his body slowly detached from his body once again!<br/><br/>His figure started to turn illusory!<br/><br/>“Huh?”<br/><br/>Wang Xian’s gaze turned cold when he saw the old witch’s body gradually disappearing in a strange manner!<br/><br/>“The Mighty Celestial Dragon!”<br/><br/>He growled in a low voice. An incomparably huge divine dragon appeared in the sky. It locked onto the old witch’s figure and attacked her directly!<br/><br/>However, the old witch’s somewhat illusory figure completely disappeared from Wang Xian’s line of sight!<br/><br/>When the Mighty Celestial Dragon saw that the target of its attack had disappeared, it didn’t stop. Instead, it changed its target and headed towards the void on the right. It attacked at a terrifying speed!<br/><br/>Wang Xian also flapped his divine wings and chased after her!<br/><br/>“This old witch really has some ability. She can imprint the formation on her body and activate it instantly. The formation just now should be a void teleportation formation. It can teleport a very long distance in an instant!”<br/><br/>Wang Xian sensed the old witch’s location through the power of void pursuit!<br/><br/>Following the Mighty Heavenly Dragon’s attack, he flew straight to the right!<br/><br/>The attack speed of the law aspect mighty heavenly dragon was extremely terrifying. It was comparable to following closely behind.<br/><br/>According to his senses, the old witch was a minute away from him!<br/><br/>This distance was already very far away!<br/><br/>If Wang Xian didn’t have the ability to search for enemies in the void, he would have been able to escape with this move!<br/><br/>“D * MN Dragon King, you actually forced me to use up a large number of formations on my body. Once I return to the nest, I will make your life a living hell!”<br/><br/>In the far void on the right, the old witch growled with a ferocious face. She looked ahead and flew rapidly towards the nest!<br/><br/>Her speed was still much slower than Wang Xian’s!<br/><br/>However, this was her limit!<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Old Witch, can you escape?”<br/><br/>Two minutes later, a voice suddenly resonated in the void!<br/><br/>“What?”<br/><br/>When the old witch heard this voice, her pupils constricted slightly. She immediately looked behind her with a face full of shock!<br/><br/>Boom<br/><br/>In her line of sight, the shadow formed by the energy that attacked her earlier was chasing after her rapidly!<br/><br/>At the back, the Dragon King followed closely behind!<br/><br/>“How are you still able to lock onto my position? I have already placed your flesh and blood back into the divine kingdom. How are you still able to lock onto it?”<br/><br/>The old witch stared at Wang Xian and let out a sharp questioning voice!<br/><br/>As a powerful Magus, the most powerful thing was to eliminate traces!<br/><br/>Wherever she went, there were no traces left behind!<br/><br/>Under such circumstances, how could she still be locked onto?<br/><br/>“Old Thing, I told you, you must die!”<br/><br/>“Crash!”<br/><br/>Wang Xian flapped his incorporeal holy wings and instantly appeared in front of her!<br/><br/>“Roar!”<br/><br/>The Mighty Heavenly Dragon also charged at the old witch!<br/><br/>“Eye of the Void!”<br/><br/>“Void Interpretation Formation!”<br/><br/>The old witch’s expression changed slightly. At the spot behind her back, numerous tattoos surged into her pupils!<br/><br/>The old witch was surrounded by a bubble!<br/><br/>The Mighty Celestial Dragon charged at her. However, when it reached in front of her and extended its dragon claws, the Dragon Claws went straight for her and did not touch her!<br/><br/>Wang Xian swept his gaze over and raised his eyebrows slightly!<br/><br/>“This formation is similar to the yin-yang space of the Tai Chi Dragon Plate. However, this is just to let you live a little longer!”<br/><br/>Wang Xian said coldly. With a move, he came in front of the old witch and locked onto her coldly!\t\t\t\t\t\t</div>", "images": {}, "success": true}