{"id": 664, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073229.html", "title": "Chapter 3655 - 3655 3654 Harvest", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3655 - 3655 3654 Harvest</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3655 3654 harvest<br/><br/>“Bang!”<br/><br/>The dragon claw clawed downwards. The leader of the Star Barbarians raised his head and looked up. The ghost fire in his eyes was extremely dim!<br/><br/>“We shouldn’t have come to hunt the Dragon King!”<br/><br/>His heart was filled with regret!<br/><br/>However, regret was useless!<br/><br/>“Bang!”<br/><br/>A terrifying energy attacked his life fire and destroyed all of his life force!<br/><br/>“Leader of the Star Barbarians!”<br/><br/>The other seven skeletons shouted in despair when they saw this!<br/><br/>“It’s your turn!”<br/><br/>However, at this moment, a calm voice was heard. Destruction had arrived!<br/><br/>This was not a battle of the same level!<br/><br/>It was much easier than when he was fighting against the ban on madness!<br/><br/>However, he had performed soul capture on the other skeletons!<br/><br/>Due to the huge difference in strength, he had successfully performed soul capture and obtained a lot of information!<br/><br/>“Roar!”<br/><br/>At the side, on the five elements grinding mill, the five elements divine dragons intertwined together and spewed out a long river of destruction, extinguishing the life flames of the other skeleton armies!<br/><br/>All the skeletons were destroyed!<br/><br/>The demons and skeletons that surrounded and killed Wang Xian were all dead!<br/><br/>“Hehe, the harvest this time is not bad!”<br/><br/>Wang Xian, who was floating in the void, swept his gaze across the surrounding void and revealed a smile!<br/><br/>The energy contained in each of the 15 demons he killed was two to three times, or even three to four times, that of an Ordinary Level 3 universe dominator!<br/><br/>The energy contained in the highest demon of Mount Aslie was more than 10 times that of an ordinary expert of the same level!<br/><br/>As for the eight skeleton experts, among their skeleton army, there were 30 skeleton subordinates of A Level 3 universe dominator!<br/><br/>Adding on their corpses, this harvest alone was enough to increase the dragon king by 70 to 80 level three universe dominator experts!<br/><br/>“This harvest is too great.”<br/><br/>Wang Xian’s eyes revealed a hint of excitement!<br/><br/>This trip to the invincible zone was the right one!<br/><br/>This was only the beginning. One had to know that there were thousands of desolate beasts and space beasts in the Invincible Zone!<br/><br/>If they were all eliminated, it would be extremely terrifying for the improvement of the Dragon Palace!<br/><br/>After collecting all the corpses, he swept his gaze across the two innate treasures in front of him!<br/><br/>One was the demon ship.<br/><br/>The other was a huge sword.<br/><br/>Wang Xian took the huge sword and waved it gently. Within the sword ray that he waved out, skeletons came out one by one!<br/><br/>These skulls were no different from the real ones!<br/><br/>This was an extremely powerful innate treasure!<br/><br/>Similarly, the demon ship was also extremely useful!<br/><br/>After putting away the two innate treasures, Wang Xian swept his gaze across the surroundings and flew deeper into the depths with a smile on his face!<br/><br/>No one knew about the battle here.<br/><br/>No one knew that the 15 powerful demons and eight powerful skulls had been killed by the Dragon King of the Dragon Palace!<br/><br/>In other parts of the invincible zone, some powerhouses were still plotting whether they should take action against the Dragon King and snatch the treasures in his hands!<br/><br/>There were also powerhouses who had joined forces to snatch the treasures. They were searching for Wang Xian in the Invincible Zone!<br/><br/>“The depths of the invincible zone is where the desolate beast space behemoth lives. It is also a place where the powerhouses of the invincible zone experience life-and-death experiences.”<br/><br/>After Wang Xian killed 23 experts, he continued to fly in the Invincible Zone!<br/><br/>He looked ahead and his eyes were shining!<br/><br/>The Old Monsters of the invincible zone not only fought against the experts of other races, but they would also fight against a group of desolate beasts and space beasts!<br/><br/>Once the desolate beasts and space beasts were killed, the corpses of the desolate beasts and space beasts would be a huge treasure to any expert!<br/><br/>Especially the space Behemoth’s corpse, there were treasures everywhere!<br/><br/>If he could kill more than a thousand desolate beasts or space behemoths, the enhancement to the Dragon Palace would be terrifying!<br/><br/>As he continued flying forward, he did not encounter any special treasure lands in the next few days!<br/><br/>After flying for half a month, he had completely entered the deepest part of the Invincible Zone!<br/><br/>“Forest? The deepest part of the Invincible Zone is a forest. There is a long river, a river of Starlight!”<br/><br/>At the deepest part, the scene in front of him was not as desolate as it was outside. Instead, it was a dense forest. A long river ran through the entire zone, as though it was a dividing line!<br/><br/>And at the limits of one’s vision, one could see large amounts of meteorites. The entire space was filled with vitality!<br/><br/>“The survival of the desolate beasts and the space behemoths both like to build their own nests and create their own environment.”<br/><br/>Wang Xian thought to himself as he continued to fly forward!<br/><br/>Soon, he arrived in front of the long river!<br/><br/>The entire river was more than a hundred million kilometers wide, but the length could not be seen!<br/><br/>It was a complete boundary!<br/><br/>He did not enter the opposite side of the river immediately. Instead, he flew upwards along the river!<br/><br/>This was because he had obtained a piece of information from the memories of the few skeletons!<br/><br/>On this long river, there was a trading ground!<br/><br/>Trading was an essential thing between the strong. Naturally, there was a trading ground!<br/><br/>However, this trading ground did not have any rules.<br/><br/>If they were to meet a fight, it was normal!<br/><br/>Other than the trading ground on this long river, there was another interesting thing. In this long river, there was a crazy demon floating along the long river!<br/><br/>He was known as the water ghost. When he went crazy, he would suffer from his crazy attacks without asking who the other party was!<br/><br/>More than a hundred experts had died at his hands!<br/><br/>He also had his moments of clarity. When he was clear-headed, he would sometimes appear at the trading ground.<br/><br/>In addition, at the edge of the river, there was a treasure ground. These treasure grounds gathered powerful circles!<br/><br/>That circle was called the demon breaker.<br/><br/>Sometimes, the desolate beasts or the space beasts across the long river would attack the experts here and kill the other old monsters in the Invincible Zone!<br/><br/>Wang Xian decided to go to the location of the trading venue to take a look and see the situation there!<br/><br/>If there weren’t many experts in the trading venue, he didn’t mind revealing the treasures in his hands to see if there were any fellows who were seeking death to ambush him!<br/><br/>He continued flying upwards. A few days later, a slightly dilapidated meteorite that looked like a continent appeared in his line of sight!<br/><br/>The continent was only about ten million kilometers in area. There were experts moving about on it!<br/><br/>Wang Xian flew over and sized up his surroundings!<br/><br/>Some of the experts also noticed Wang Xian’s arrival and sized him up as well!<br/><br/>Wang Xian ignored them and arrived at the center of the Continent in a flash!<br/><br/>“Eh?”<br/><br/>In the center of the continent was an area covered by a formation. There were many figures moving around in the area covered by the formation!<br/><br/>There were skeletons, humans, demonic beasts, and so on!<br/><br/>There were more than a thousand of them!<br/><br/>However, the strength of these humans and demonic beasts were not strong. Their strength was at the level of a level two overlord in the universe!<br/><br/>They were the messengers of these powerhouses. They could also be the service providers.<br/><br/>Or maybe there were some treasures here, and these people were in charge of sending messages and carrying out transactions.\t\t\t\t\t\t</div>", "images": {}, "success": true}