{"id": 668, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073237.html", "title": "Chapter 3659 - 3659 3658 Threats, Curses!", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3659 - 3659 3658 Threats, Curses!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3659 3658 threats, curses!<br/><br/>“I don’t have enough resources on hand. Give me 100 pills. If I can solve the problems in my body, if I can make a breakthrough, I will compensate you!”<br/><br/>The old witch stared at Wang Xian and spoke after hearing his words!<br/><br/>“Free prostitution?”<br/><br/>Wang Xian’s eyes revealed a mocking expression when he heard his words. “Get lost if you don’t have any items to trade. Don’t Disturb my business!”<br/><br/>“Hiss, this…”<br/><br/>“The Dragon King doesn’t give a damn about the old witch. He doesn’t give her any face at all!”<br/><br/>“Of course not. The old witch is very strong, but the Dragon King is definitely not weak either!”<br/><br/>When the old monsters around saw this sudden change, their eyes sparkled!<br/><br/>“Cough, cough. Dragon King, do you know that it’s best not to provoke a wizard? Otherwise, you will suffer a fate worse than death. Don’t worry, I will make you obediently take all of the changtai fruits on you!”<br/><br/>As the old witch spoke, the tattoo on her body seemed to have come to life as it spread towards Wang Xian’s clone!<br/><br/>“Huh?”<br/><br/>Wang Xian looked over and his eyes flashed with a cold glint. “Old Thing, you are courting death!”<br/><br/>“Cough, cough, is that so?”<br/><br/>The old witch gave a sinister smile. The tattoo spread to Wang Xian’s feet!<br/><br/>Wang Xian immediately felt a terrifying force restraining him!<br/><br/>In the trading ground, everyone’s strength would be suppressed.<br/><br/>However, this was only a clone of Wang Xian. His strength was not very strong. When faced with the old witch in front of him, he did not have the slightest ability to resist!<br/><br/>Crackle! Crackle<br/><br/>Wisps of lightning appeared around Wang Xian. The Lightning attacked the old witch in front of him!<br/><br/>Buzz<br/><br/>The old witch stood still and didn’t move. The tattoo on her body glowed and blocked it easily!<br/><br/>“Cough cough cough cough cough. Dragon King, you are very strong. However, you left this clone here to leave your biggest weakness. If you don’t give me all the fruits of the womb, I will destroy you and Your Dragon Palace!”<br/><br/>As the old witch spoke, Wang Xian’s clone, which was covered in tattoos, slowly melted and turned into flesh and blood!<br/><br/>From his legs, it slowly condensed into a piece of flesh and blood!<br/><br/>Wang Xian lowered his head and watched his clone being killed. He looked at the old witch calmly and said, “You will die!”<br/><br/>As soon as he finished his sentence, his entire clone was melted into a meatball!<br/><br/>“Cough, cough, cough. I will die?”<br/><br/>The old witch smiled sinisterly, stretched out her hand to take the blood ball, and walked straight outside!<br/><br/>“This… this… the old witch actually destroyed the clone of the Dragon King!”<br/><br/>“The old witch wants to use the clone of the Dragon King, and then cast a curse on its main body to make the Dragon King submit!”<br/><br/>“The old witch is the strongest wizard in our invincible region. If she curses the Dragon King in her own lair, then the Dragon King will be cursed to death at all times. How can the Dragon King Hide?”<br/><br/>“The price of the fruit is too high. If the old witch wants to deal with the Dragon King, the Dragon King will suffer!”<br/><br/>The old monsters in the invincible zone were shocked when they saw this scene!<br/><br/>Another terrifying existence in their invincible zone, another mad demon, the old witch attacked the Dragon King!<br/><br/>And she even killed the Dragon King’s clone!<br/><br/>This made them extremely shocked!<br/><br/>Some were astonished, while others were cheering!<br/><br/>The price of the Dragon King’s normal fetus clothes had already caused many old monsters to be extremely displeased!<br/><br/>The Old Witch held the meatball of Wang Xian’s clone in her hand. A smile appeared on her old and tattooed face as she flew straight ahead!<br/><br/>At this position, it was impossible to return to her divine kingdom in an instant unless one’s strength had reached a certain level!<br/><br/>Even the old witch couldn’t do it!<br/><br/>She wanted to return to her own nest and use the curse to kill the Dragon King and enslave him!<br/><br/>“HMPH, Old Thing, you’re courting death. Then I’ll Grant Your Wish!”<br/><br/>At this moment, Wang Xian, who was hiding on the tree, was sensing everything. His eyes were filled with cold murderous intent!<br/><br/>This old witch wanted to use the curse to make him submit to her. He had no chance to resist the long-distance curse!<br/><br/>Furthermore, she would do all of this in her own lair. When the time came, even if Wang Xian could find her lair, the old witch would not be afraid!<br/><br/>This was because in her own lair, she was confident that she could fight against three to four existences of the same level as her!<br/><br/>The Dragon King could kill the hex of madness. However, in her own lair, she was confident that she could fight against the Dragon King!<br/><br/>This was also the reason why she dared to kill Wang Xian’s clone without any scruples!<br/><br/>The Lair of a wizard was extremely terrifying!<br/><br/>Wang Xian could also guess the old witch’s thoughts!<br/><br/>Therefore, when the old witch made her move, he flew towards the direction of the trading ground!<br/><br/>This time, he unleashed his speed to the maximum!<br/><br/>With the speed of a level two master of the universe, he could reach the trading ground within ten minutes!<br/><br/>“This old witch has left the trading ground. Hehe, I can’t return to my divine kingdom in this space in an instant. I’ll be able to catch up to you within fifteen minutes, you old bastard!”<br/><br/>Wang Xian’s eyes sparkled!<br/><br/>His clone was killed, but Wang Xian had left the power of lightning on the old witch!<br/><br/>The void pursuit ability of the incorporeal holy wings!<br/><br/>Now that Wang Xian’s strength had improved, his ability to search for enemies in the void had also improved tremendously!<br/><br/>With his current strength, she could not sense the power of lightning on the old witch’s body at all!<br/><br/>Whoosh<br/><br/>Wang Xian flapped the incipient holy wings and chased after her at a rapid speed!<br/><br/>In front of the trading ground, the old witch was flying in a direction at the speed of a level one master of the universe!<br/><br/>Obviously, that direction was in the direction of her lair!<br/><br/>Behind her, the Old Monsters of the Invincible Zone didn’t dare to follow an existence like the old witch. They could only watch her leave quickly!<br/><br/>And what happened in the trading ground was also quickly spread!<br/><br/>After all, in the past few days, the Dragon King of the Dragon Palace had wantonly sold treasures to stabilize his mind, attracting a large number of old monsters to rush over!<br/><br/>There were still many old monsters on the way!<br/><br/>Now that such a thing had happened, it naturally caused a huge sensation!<br/><br/>Ten minutes was a very short time. If the old witch wanted to return to her lair, she would need a day at her speed!<br/><br/>“I can sense it, Old Thing!”<br/><br/>After ten minutes, Wang Xian had already sensed the old witch’s location. His dragon eyes were filled with killing intent!<br/><br/>Whoosh<br/><br/>He flapped his incipient saint wings and erupted at an extremely fast speed. The old witch’s figure soon appeared in his line of sight!<br/><br/>“Roar! Roar! Roar!”<br/><br/>Wang Xian instantly transformed into the body of a divine dragon. The tai chi dragon coiled around his body and the five elements millstone floated above him.<br/><br/>At this moment, Wang Xian unleashed most of his trump cards and strength to attack the old witch!<br/><br/>“What?”<br/><br/>The old witch who was flying rapidly ahead suddenly felt a terrifying force approaching her. Her pupils constricted slightly and she immediately looked behind her!\t\t\t\t\t\t</div>", "images": {}, "success": true}