{"id": 667, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073235.html", "title": "Chapter 3658 - 3658 3657, Under The Old Witch", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3658 - 3658 3657, Under The Old Witch</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3658 3657, under the old witch<br/><br/>“How is the effect of this so-called ‘Normal-fetus Fruits’?”<br/><br/>In the trading area, the expert of the Divine Tiger clan who had bought two normal-fetus fruits walked to the side!<br/><br/>Beside him, there were more than ten experts of the Divine Tiger clan. When they saw him swallow a normal-fetus fruit, they couldn’t help but ask!<br/><br/>“It’s useful, very useful. I can clearly find that my mind is much clearer.”<br/><br/>The expert from the Divine Tiger clan sensed the changes in his body and couldn’t help but let out a glow!<br/><br/>Without any hesitation, he immediately consumed the second pill!<br/><br/>“The effect is not bad. At least it has a significant effect on me. However, I estimate that the stronger one is, the lower the effect. I can only consume it in large quantities!”<br/><br/>The expert from the Divine Tiger clan continued to speak!<br/><br/>“Let’s go and trade some!”<br/><br/>The other experts from the Divine Tiger clan nodded their heads and walked towards Wang Xian’s clone!<br/><br/>“Dragon King, we want 30 pieces. Do you have any?”<br/><br/>More than a dozen experts from the Divine Tiger clan walked over and spoke directly.<br/><br/>“Forget about 30 pieces, we even have 300 pieces!”<br/><br/>Wang Xian smiled faintly and spoke to them!<br/><br/>“Huh?”<br/><br/>Upon hearing Wang Xian’s words, the more than ten experts of the Divine Tiger clan were slightly shocked. With a move of their palms, all the trading treasures appeared in front of them.<br/><br/>“We bought so many at one go. Can you give us one?”<br/><br/>An expert of the Divine Tiger clan could not help but speak up!<br/><br/>“If you buy 100, I can give you one. 30 is too little!”<br/><br/>Wang Xian rejected immediately!<br/><br/>This caused the Divine Tigers to frown slightly and did not say anything!<br/><br/>Wang Xian took out 30 normal birth fruits and stored more than 100 innate spiritual treasures into the Dragon Palace!<br/><br/>“Did you hear what the Dragon King Said? He can take out 300 of them too!”<br/><br/>“A fruit at the peak of the Universe Knight level. A divine fruit of this level is not precious to a peak race. However, divine fruits with this effect are very rare. For the Dragon King to be able to take out so many normal birth fruits, it must be because of a powerful divine tree in the Dragon Palace. This divine tree must have produced a large number of normal birth fruits!”<br/><br/>“That should be the case. To be able to take out 300 of them, it seems that the Dragon King should be able to obtain the longevity fruits very quickly. He has made a huge profit this time!”<br/><br/>“He has so many longevity fruits in his hands and is selling them at such an expensive price. This is simply robbing him of his money!”<br/><br/>In the surrounding area, when the experts heard Wang Xian’s words, their faces were burning with excitement and helplessness!<br/><br/>The price was too high!<br/><br/>However, since that was the case, there were also quite a number of experts who immediately walked towards Wang Xian to carry out the trade!<br/><br/>In just a short day, Wang Xian had traded more than 300 viviparous fruits!<br/><br/>“TSK TSK, the Old Monsters of the invincible zone are really worth quite a lot!”<br/><br/>Wang Xian, who was hiding on a tree, looked at the day’s harvest with a slightly excited expression!<br/><br/>This was more than 1,500 innate spiritual treasures. This harvest was simply too crazy!<br/><br/>However, the number of fruits he sold was less than one-tenth!<br/><br/>“Master, this Dragon King of the Dragon Palace has been trading for a day. I calculated that he should have traded more than 340 fruits. He should still have a lot of them with him!”<br/><br/>As time passed, more and more old monsters arrived!<br/><br/>Their subordinates reported the situation!<br/><br/>When they heard that there were more than 400 fruits, their breathing became extremely hot!<br/><br/>“How many of these fruits does the Dragon King have?”<br/><br/>Some old monsters couldn’t help but think in their hearts!<br/><br/>As time went by, the trade continued. Although there weren’t as many as at the beginning, there were still old monsters coming over to trade at all times!<br/><br/>This caused more and more experts to gather around the trading ground!<br/><br/>In a short period of time, there were more than a thousand!<br/><br/>“Almost 700 fruits have been traded. This is crazy. How much does the Dragon King have in stock?”<br/><br/>When it was close to the third day, some old monsters couldn’t help but exclaim in surprise!<br/><br/>Three days was very short for them!<br/><br/>But in these three days, they witnessed the trade of the Dragon King of the Dragon Palace!<br/><br/>This was simply violence, they had made a crazy profit!<br/><br/>“Madam Witch!”<br/><br/>“Madam Witch!”<br/><br/>At this moment, an extremely respectful voice suddenly sounded!<br/><br/>When the surrounding old monsters heard this address, their expressions changed slightly, and they hurriedly looked behind them!<br/><br/>Behind them, an old woman holding a magic staff walked over!<br/><br/>The old woman’s face was full of dense tattoos, and her exposed skin was also full of tattoos!<br/><br/>She was only about 1.5 meters tall and looked stooped. However, the old monsters around her were filled with wariness and fear when they saw her!<br/><br/>Some of the old monsters even directly hid far away.<br/><br/>“Old witch, he actually came. She actually came as well!”<br/><br/>An expert from the Black Tortoise tribe looked at this figure walking over and his pupils slightly contracted as he said solemnly!<br/><br/>The old witch ignored all the experts around her and walked straight into the trading ground!<br/><br/>He looked at Wang Xian and walked straight towards him!<br/><br/>“Lady Witch!”<br/><br/>“Lady Witch!”<br/><br/>Some of the old monsters from the invincible zone saw her and quickly made way for her!<br/><br/>The arrival of the old witch instantly attracted Wang Xian’s attention!<br/><br/>As he looked at this figure, information about her appeared in his mind!<br/><br/>The old witch!<br/><br/>An old monster of the Wizard clan.<br/><br/>She used to be an extremely terrifying mad demon. However, a long time ago, she used a special method to suppress her mind and made her stop being a mad demon!<br/><br/>However, her strength was definitely on the level of a mad demon. It was much stronger than the mad demon restriction!<br/><br/>Furthermore, he was publicly acknowledged as the strongest wizard in the invincible region!<br/><br/>He was also known as the old witch!<br/><br/>“Ten!”<br/><br/>The old witch walked to Wang Xian and spoke to him. Fifty innate spiritual treasures flew over!<br/><br/>“Alright!”<br/><br/>Wang Xian nodded his head and put them away. He immediately passed ten serval fruits to the old witch!<br/><br/>The old witch looked at the serval fruits and felt the aura they emitted. Her expression changed.<br/><br/>He opened his palm. The tattoo on his palm shimmered and the serval fruits disappeared!<br/><br/>The old witch did not leave. She continued to stand there as if she was waiting!<br/><br/>“Good, good!”<br/><br/>However, ten seconds later, a creepy and eerie voice came out of the old witch’s mouth. A strange look appeared in her turbid eyes. She stared at Wang Xian and held the magic wand in her hand tightly!<br/><br/>“One hundred fruits. Give me one hundred fruits!”<br/><br/>She spoke in a strange voice as she stared at Wang Xian with a burning gaze!<br/><br/>The Aura on the old witch’s body had also changed. Waves of energy were dissipating in the surroundings!<br/><br/>“HMM? What’s the situation?”<br/><br/>“The old witch wants one hundred fruits of the womb for the Dragon King. Do you want to trade or not?”<br/><br/>The sudden change made everyone slightly shocked. Some of the old monsters hurriedly retreated and stared at her!<br/><br/>“If you want it, trade with the item!”<br/><br/>Wang Xian looked at the change in the old witch in front of him. His eyes flickered as he spoke calmly!\t\t\t\t\t\t</div>", "images": {}, "success": true}