{"id": 661, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073223.html", "title": "Chapter 3652 - 3652 3651 Beheaded 23 Peak Race Experts! Hit", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3652 - 3652 3651 Beheaded 23 Peak Race Experts! Hit</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3652 3651 beheaded 23 peak race experts! hit<br/><br/>“Boom! Boom!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>Demonic wind formed on the left side, and a terrifying dark storm enveloped the entire space!<br/><br/>Fifteen demonic experts, each of them containing a powerful aura!<br/><br/>“Demonic ship!”<br/><br/>The Aslie Mountain Demon let out a low growl, and with a wave of his hand, the demonic ship floated in the storm and rapidly expanded!<br/><br/>The demon ship, which was originally a thousand meters in size, seemed to have expanded by tens of thousands of times in the face of the wind.<br/><br/>The entire ship was emitting a dark luster. The demon wings on the sails seemed to have survived as they flapped slightly!<br/><br/>A terrifying energy was brewing!<br/><br/>“Kill!”<br/><br/>On the right side, the star barbarian skeleton leader slowly raised the giant sword in his hand and let out a cold sound!<br/><br/>“Roar!”<br/><br/>“Crack!”<br/><br/>“Kill! Kill! Kill!”<br/><br/>In an instant, countless skeleton armies behind him let out roars!<br/><br/>“Kill! Kill!”<br/><br/>“Kill! Kill!”<br/><br/>The other seven skeleton experts also let out a furious roar!<br/><br/>“Demonic wind, engulf!”<br/><br/>The fifteen demons from Mount Aslie let out a furious roar as the terrifying demonic wind swept towards Wang Xian!<br/><br/>The demonic ship in the middle was emitting a deep and heart-palpitating luster as it locked onto Wang Xian!<br/><br/>“Hehe!”<br/><br/>Wang Xian looked at the demonic wind that was attacking him first. A cold smile appeared in his eyes!<br/><br/>The combined strength of the surrounding demons and skeletons was definitely stronger than the Mad Demon Prohibition!<br/><br/>However, to Wang Xian, the mad demon prohibition was even harder to deal with!<br/><br/>This was because the attack of the forbidden spell of madness was able to break through the defense of the Tai Chi Dragon Plate without Wang Xian’s blessing!<br/><br/>However, if they wanted to break through the defense of the Tai Chi Dragon Plate, they would need the combined attack of most of the demons and skeletons!<br/><br/>Once the attacks were scattered or launched one after another, it would be impossible to break through the defense of the Tai Chi Dragon Plate!<br/><br/>It was the same for the Skeleton Army!<br/><br/>The Tai Chi Dragon Plate was very different from ordinary innate defensive treasures!<br/><br/>It had its own life force and was formed by Wang Xian’s light and darkness avatars!<br/><br/>It didn’t need to be controlled or consumed to be able to erupt with terrifying strength!<br/><br/>Unlike other innate treasures, it didn’t need to be controlled!<br/><br/>“All of you will die!”<br/><br/>“Crash!”<br/><br/>Wang Xian moved his body and the incipient saint wings appeared behind him. In an instant, he attacked the fifteen demons!<br/><br/>His speed was at its maximum!<br/><br/>Other than the demon from Mount Aslie who could clearly see Wang Xian’s speed, it was difficult to see the rest!<br/><br/>“Bang!”<br/><br/>Wang Xian, who was flying, held the five elements millstone in his hand and took the lead to meet the demon’s ship.<br/><br/>The five elements millstone grew bigger and smashed towards the demon ship!<br/><br/>Boom<br/><br/>A violent collision sound was heard. The entire Tai Chi Dragon Disk was sent flying backward!<br/><br/>The Tai Chi Dragon disk circled around his body. Wang Xian completely ignored the attack of the demon wind and locked onto the demons one by one!<br/><br/>“PFFT!”<br/><br/>“What?”<br/><br/>At this moment, the demon from Mount Aslie spat out a mouthful of blood.<br/><br/>The attack from the innate treasure, the demon’s ship, had struck his body, causing him to be injured!<br/><br/>However, he was even more shocked by Wang Xian’s terrifying speed!<br/><br/>The Demon’s wind was, after all, one of the powerful means of the fifteen demons. Even if this attack was not their best, it could still be ranked among the best!<br/><br/>Coupled with his demon’s ship, he would have to use all his strength to block even the mad demon restriction!<br/><br/>However, what about the Dragon King?<br/><br/>He would fly over, ignore the Devil’s Wind, and send the demon ship flying?<br/><br/>No matter how strong he was, in their calculations, the Dragon King would have to resist there.<br/><br/>Once he resisted, the Skeleton Sea of the skeleton clan would be able to instantly surround the Dragon King!<br/><br/>Then, they would use the skeleton sea tactic to continuously surround and attack from the side. They were very confident that they could exhaust him to death!<br/><br/>One had to know that Mount Aslie was comparable to the old scholar Tai Shui Monster King’s level.<br/><br/>As for the star barbarian skeleton leader from the skeleton clan, his strength was close to the mad demon level!<br/><br/>Even if he was not a match for the mad demon restriction, he was not too afraid of it!<br/><br/>“What terrifying speed. This is bad. This Dragon King is trying to break them one by one. This is bad!”<br/><br/>The Aslie Mountain Demon’s expression changed drastically.<br/><br/>“Leader of the star barbarian skeletons, make your move. We can not be broken one by one!”<br/><br/>He quickly shouted at the leader of the star barbarian skeletons opposite him!<br/><br/>“Kill!”<br/><br/>When the leader of the star barbarian skeletons saw Wang Xian making his move and seeing his terrifying speed, the ghostly fire in his pupils kept jumping. Immediately, he let out a loud roar!<br/><br/>He held the huge black sword in his hand and flew over directly!<br/><br/>“Crack, crack, crack, Kill!”<br/><br/>At the side, the other seven skeleton experts followed from the left and right and charged over!<br/><br/>The entire Skeleton Navy corps followed behind them!<br/><br/>“In my opinion, you guys are worse off than that crazy demon seal. You’re courting death!”<br/><br/>Wang Xian flapped his incorporeal holy wings and locked onto a demon. He flew over at a terrifying speed!<br/><br/>With Wang Xian’s speed, he wasn’t afraid of being besieged the most!<br/><br/>Furthermore, they had yet to form a siege formation. They were simply courting death!<br/><br/>“Oh no, the Dragon King’s target is me. Demon Nightmare, control!”<br/><br/>“Nightmare Starry Sky, Kill!”<br/><br/>The expression of the skeleton powerhouse who was attacked by Wang Xian changed drastically. A blood-red energy surged towards Wang Xian from his demon eyes!<br/><br/>Splash<br/><br/>However, Wang Xian did not dodge at all. The tai chi dragon coiled around his body and his arms turned into Dragon Claws!<br/><br/>“Not good, support the Blackstone Flame!”<br/><br/>The pupils of the other fourteen demons contracted. They flapped their demonic wings, and weapons appeared in their hands one after another!<br/><br/>They slashed in Wang Xian’s direction at the same time!<br/><br/>However, in Wang Xian’s eyes, their speed was too slow!<br/><br/>The strength of this group of Old Demons from the invincible region was at most comparable to three to four ordinary level three masters of the universe!<br/><br/>It would be easy for them to fight against a level one master of the universe together!<br/><br/>However, Wang Xian was an existence who could fight against a level two master of the universe!<br/><br/>Especially when it came to speed, he was a level and a half higher than them!<br/><br/>Under his speed, the demons couldn’t keep up at all!<br/><br/>The energy on the Dragon Claw churned, and the destructive force of the five elements was applied to the arm, crushing the demon nightmare directly!<br/><br/>Boom<br/><br/>The Dragon Claw swept across and the demon was caught in his hand!<br/><br/>“Roar! Roar! Roar!”<br/><br/>The Five Elements Millstone flew out from Wang Xian’s body. It emitted the roar of the Divine Dragon and headed straight for the demon!<br/><br/>Bang<br/><br/>One move, instant kill!<br/><br/>“The first one!”<br/><br/>Wang Xian smiled faintly. His pair of dragon eyes stared at the next demon as he charged straight for the demon!<br/><br/>With the activation of the inoriginator holy wings, he disappeared once again!<br/><br/>“Oh no, let’s join forces to defend. Hold on, Hold On!”<br/><br/>When the demon from Mount Aslie saw one of his comrades being killed, his expression changed drastically as he roared loudly!<br/><br/>“Demon Protection!”<br/><br/>“Demon Wings, protect yourself!”<br/><br/>“Demon Lotus!”<br/><br/>The fourteen demons roared furiously as they closed in quickly. Layers of defense rose up!<br/><br/>“Break!”<br/><br/>Wang Xian held the five elements millstone in his hand. He circulated his energy and condensed it into a destructive sword that attacked the defense!<br/><br/>Crack! Crack<br/><br/>The destructive sword landed and all the defense collapsed immediately!<br/><br/>Crash<br/><br/>Wang Xian flapped his incorporeal holy wings and his body swayed. In an instant, he transformed into the body of a divine dragon and attacked!\t\t\t\t\t\t</div>", "images": {}, "success": true}