{"id": 662, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073225.html", "title": "Chapter 3653 - 3653 3652 Killed 23 Experts Of Peak Races! Get Down", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3653 - 3653 3652 Killed 23 Experts Of Peak Races! Get Down</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3653 3652 killed 23 experts of peak races! Get Down<br/><br/>“It’s over!”<br/><br/>When Wang Xian transformed into the body of the Divine Dragon and attacked them, the eyes of Aslie Mountain and the rest of the demons were filled with fear!<br/><br/>The strength of the Dragon King was far beyond their imagination!<br/><br/>“This strength is at the level of a universe knight? How is this possible? It’s one level higher than those crazy old demons. It’s simply unbelievable!”<br/><br/>The Aslie Mountain Demon couldn’t help but Roar in a low voice, his eyes filled with shock!<br/><br/>A pinnacle universe knight, how strong could he be?<br/><br/>The crazy demon level, in their eyes, was already at the pinnacle of the universe!<br/><br/>Even the other pinnacle races, those mutated beings, weren’t as monstrous as the Dragon King before them!<br/><br/>He ignored the attacks of the 15 powerhouses!<br/><br/>He easily killed one of their companions!<br/><br/>This strength made their bodies tremble!<br/><br/>“Roar!”<br/><br/>Wang Xian let out a wild roar. The five elements millstone fused into his body and his dragon tail swept out!<br/><br/>The current Wang Xian had the innate supreme treasure, dragon eyes, in his pupils. A water-elemental innate supreme treasure had also fused into his body.<br/><br/>With the two innate supreme treasures and the current Wang Xian, he had almost unleashed 90% of his trump cards!<br/><br/>The Tai Chi Dragon disc, the five elements grinding mill, and the speed of the incorporeal holy wings!<br/><br/>At present, other than the accompanying Elf and the Netherworld Ghost Avatar, Wang Xian had taken out everything else!<br/><br/>It was even stronger than when he used the mad demon restriction back then!<br/><br/>The main reason was to prevent the fifteen demons from joining hands with the eight powerhouses of the skeleton clan!<br/><br/>Before the other party could react, he had to destroy the powerhouses of the demon clan!<br/><br/>Once they were destroyed, the eight powerhouses of the skeleton clan would not be able to survive either!<br/><br/>“Boom!”<br/><br/>“Defend!”<br/><br/>The dragon tail swept over and the remaining fourteen demons roared in terror and despair!<br/><br/>The energy defense that they emitted was blocked. They could only use their physical bodies to defend themselves!<br/><br/>The demonic wings protected their bodies and blocked the attacks!<br/><br/>Boom<br/><br/>However, Wang Xian’s sweep landed on the five demons first. The destructive power and the terrifying power of the divine dragon caused the auras of the five demons to disappear instantly!<br/><br/>“Ah Ah Ah, blood qilin!”<br/><br/>“Our ancestors have descended into the protection of the Demons!”<br/><br/>When the demons at the back saw their five companions being killed instantly, their hearts tightened and they roared with all their might!<br/><br/>“Bang!”<br/><br/>“Bang!”<br/><br/>“Bang!”<br/><br/>A few loud bangs rang out consecutively!<br/><br/>It was useless!<br/><br/>Their defense was completely useless!<br/><br/>Wang Xian’s own attacks had the support of the five elements grinding. Even A Level 2 master of the universe had to put up a full-strength resistance!<br/><br/>They couldn’t even reach the level one masters of the universe. How could they resist!<br/><br/>Four loud bangs rang out consecutively. Another four demons were killed!<br/><br/>The demon called Aslie Mountain didn’t fight head-on.<br/><br/>The moment Wang Xian stopped attacking the other demons, he escaped from the range of the dragon tail!<br/><br/>The other demons also fled in a hurry!<br/><br/>They could not resist!<br/><br/>At this moment, they understood that the gap was too big!<br/><br/>The Dragon King was not someone they could surround and kill!<br/><br/>Even if there were powerhouses from the skeleton race!<br/><br/>Even if they surrounded the dragon king, he understood now that he would definitely not be able to kill the Dragon King. Instead, he would be killed instead!<br/><br/>However, it was too late!<br/><br/>“Kill!”<br/><br/>At this moment, a cold voice sounded!<br/><br/>Wang Xian instantly sensed a powerful attack coming towards him!<br/><br/>“Oh?”<br/><br/>Sensing this attack, he raised his eyebrows slightly!<br/><br/>This attack was very powerful. Some of it was much stronger than those of the Supreme Water Demon King’s level!<br/><br/>He turned his dragon head and saw an attack coming towards him!<br/><br/>A sword attack from the leader of the Star Barbarians was charging towards him with a surge of energy!<br/><br/>Amidst the traces of the sword, ferocious and terrifying skeletons emerged from the sword ray.<br/><br/>The terrifying sword ray was over a hundred million kilometers long. Over a hundred million kilometers, more than a billion skeletons emerged from the sword Ray!<br/><br/>They attacked Wang Xian in unison!<br/><br/>This attack was very strange and terrifying!<br/><br/>“The reinforcements from the leader of the star barbarian skeleton are here. The leader of the star barbarian skeleton is so strong. He is much stronger than we expected. Good, good, good!”<br/><br/>At the front, the remaining five demon powerhouses saw the attack from the leader of the star barbarian skeleton and their eyes lit up with hope!<br/><br/>“Magnificent dragon horns!”<br/><br/>Wang Xian looked at the sword radiance and the dragon horns emitted a radiance!<br/><br/>Boom<br/><br/>A nine-colored radiance and two extremely resplendent dragon horns surrounded by the Phantom of a Divine Dragon. They went straight for the sword radiance!<br/><br/>Boom! Boom! Boom<br/><br/>The dragon horns collided with the sword radiance and the skeleton that emerged from the sword radiance collapsed rapidly!<br/><br/>“You guys from the skeleton clan, don’t be anxious. After I kill the guys from the demon clan, it will be your turn!”<br/><br/>Wang Xian said calmly. He flapped his incipient saint wings and lightning flashed on them!<br/><br/>Crack! Crack! Crack<br/><br/>Wang Xian ignored the skeleton race experts who were charging at him. He continued to attack the remaining five demons!<br/><br/>“No, no, no, no. Leader of the star barbarian skeleton race, save us. Once we are killed, it will be difficult for you guys to escape!”<br/><br/>One of the demons felt that death was enveloping him. He shouted at the skeleton race experts with a terrified expression!<br/><br/>They were completely no match for the skeleton clan. The only thing they could count on now was the skeleton clan’s experts!<br/><br/>“It’s too late. Do you think that I don’t know that you bunch of death-seeking Fellows have been following me from behind?”<br/><br/>Wang Xian said with a face full of mockery. His dragon claws clawed at the demon!<br/><br/>“Ah!”<br/><br/>The miserable shriek was instantly heard. Wang Xian didn’t have the slightest fluctuation as he continued to lock onto the next demon!<br/><br/>“Run, run, run!”<br/><br/>At this moment, the remaining four skeletons roared with despair on their faces. They had completely lost their will to fight and turned around to escape!<br/><br/>The demon’s body trembled violently. With a wave of his arm, the demon’s ship appeared in front of him. He sat on it and tried his best to escape into the distance!<br/><br/>Crash<br/><br/>Wang Xian flapped his wings violently and the five elements millstone appeared in the middle of his two wings.<br/><br/>Under the flapping of the primaless saint wings, the five elements millstone attacked the demon of Asriel Mountain at an extremely terrifying speed!<br/><br/>“Hellfire, Burn!”<br/><br/>Behind Wang Xian, the leader of the starbarbarian skeletons and the rest saw this scene. The ghostly fire in the hole was throbbing non-stop as if they had encountered something terrifying!<br/><br/>The leader of the starbarbarian skeletons roared and brandished the huge sword in his hand in front of him.<br/><br/>The other seven skeletons also unleashed powerful attacks that were aimed at Wang Xian!<br/><br/>Buzz<br/><br/>Wang Xian’s body trembled as waves of energy surged into the Tai Chi Dragon Plate!<br/><br/>The Shadow of the Tai Chi Dragon Plate was behind him, blocking the attacks of the Hellfire and the rest!<br/><br/>Bang<br/><br/>In front of him, the demons of Mount Aslie who were fleeing felt a great sense of terror.<br/><br/>The massive five elements millstone collided with the demon ship once again!<br/><br/>The difference was that this time, he felt a terrifying suction force coming from behind him!<br/><br/>He felt as if the ship was spinning in circles!<br/><br/>The five elements millstone began to revolve!\t\t\t\t\t\t</div>", "images": {}, "success": true}