{"id": 663, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073227.html", "title": "Chapter 3654 - 3654 3653 Was Completely Destroyed", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3654 - 3654 3653 Was Completely Destroyed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3654 3653 was completely destroyed<br/><br/>Buzz! Buzz<br/><br/>The five elements grinding mill was operating as a terrifying energy tore apart the entire demon ship!<br/><br/>An innate treasure was not something that Wang Xian could destroy with his strength!<br/><br/>However, the energy from the destruction of the five elements surged into the demon ship and corroded it!<br/><br/>The demon from Mount Aslie, who was on the demon ship, trembled violently as a look of despair appeared in his eyes!<br/><br/>“Run!”<br/><br/>He let out a crazy roar and abandoned the demon ship, fleeing into the distance!<br/><br/>“Roar!”<br/><br/>However, the moment he fled, five divine dragons drilled out of the five elements millstone and attacked him!<br/><br/>The strength of the five elements millstone was comparable to an ordinary mad demon in the invincible region.<br/><br/>And a mad demon could kill the demon of Mount Aslie!<br/><br/>Faced with the attack of the five elements millstone, there was no way for him to dodge!<br/><br/>“No, no, no!”<br/><br/>A desperate roar was heard. At this moment, the demon from the Asreya Mountain had completely collapsed!<br/><br/>“Roar! Roar!”<br/><br/>The five divine dragons bit his body and pulled him directly to the top of the Five Elements Millstone!<br/><br/>“Crash!”<br/><br/>At the side, Wang Xian was swaying his huge dragon body. He flapped his incorporeal holy wings and killed all the other demons easily!<br/><br/>They had no way of resisting at all!<br/><br/>“Oh no, leader, that Dragon King is very strong!”<br/><br/>“Oh no, the 15 demons of the demon race were killed so easily. Leader, this Dragon King is not someone we can deal with. Once they die, we will not be their match!”<br/><br/>At this moment, the eight skeleton race experts at the back saw this scene. Their ghostly flames were jumping violently and were filled with fear!<br/><br/>They were prepared to join forces with the fifteen demons to deal with the Dragon King, forcing him to take out the treasure that could stabilize his mind. In the end, the fifteen demons were easily killed by the Dragon King!<br/><br/>Although these fifteen demons were not as strong as them, they were not much weaker than them!<br/><br/>However, they were easily killed by the Dragon King!<br/><br/>The strength of the Dragon King’s battle line also shocked them!<br/><br/>“Run!”<br/><br/>The star barbarian skeleton leader saw this scene and the ghost fire in his eyes kept jumping. He didn’t hesitate and ordered immediately!<br/><br/>Run!<br/><br/>The Dragon King’s strength wasn’t their match!<br/><br/>The star barbarian skeleton leader thought that he could fight against a mad demon with the seven Skeleton Warriors, but the Dragon King in front of him was even more terrifying than a mad demon!<br/><br/>This went against their understanding!<br/><br/>How could a universe knight level powerhouse be able to unleash such terrifying combat strength?<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>The leader of the Starbarbarian Skeleton’s mind was racing, but his movements were not slow. He was running away quickly!<br/><br/>“Since you are here, don’t even think about escaping. All of you can stay here!”<br/><br/>Wang Xian noticed the eight skeleton powerhouses who were trying to escape. His eyes revealed a cold expression!<br/><br/>Whoosh<br/><br/>He flapped his primaless holy wings and chased after them at a speed that was several times faster than theirs!<br/><br/>“Leader, that Dragon King’s speed is very fast. He can easily catch up to us!”<br/><br/>One of the skeleton experts could not help but take a glance at the back. In an instant, he shouted in horror!<br/><br/>“Skeleton Army, Defend!”<br/><br/>The leader of the star barbarian skeleton could sense that the dragon king was getting closer and closer to them. He shouted loudly!<br/><br/>“Skeleton Army, Kill!”<br/><br/>“My Minions, Kill!”<br/><br/>The other seven skeleton experts immediately ordered their subordinates to attack Wang Xian!<br/><br/>Crack! Crack! Crack<br/><br/>Roar! Roar<br/><br/>The rest of the skeletons did not dare to resist the order given by the skeleton experts.<br/><br/>Flames danced in their eyes as they stared at the sky. With their strength, they could not lock onto Wang Xian at all!<br/><br/>However, with the control of the eight skeleton experts, they immediately launched their attacks upwards!<br/><br/>Boom! Boom! Boom<br/><br/>“Hellfire, Burn!”<br/><br/>In an instant, the endless skeletons launched their attacks, covering the entire area!<br/><br/>The densely packed attacks caused the entire space to change color!<br/><br/>More ants could kill an elephant!<br/><br/>When all kinds of energy were gathered together, the power was extremely terrifying!<br/><br/>However, there was still a huge gap between Wang Xian and the Skeleton Navy!<br/><br/>“Let’s take this Skeleton Navy Corps and test out the strongest attack of the five elements Millstone!”<br/><br/>Wang Xian flapped his wings. The tai chi dragon coiling around him blocked the densely packed attacks!<br/><br/>He waved his dragon claws and the five elements millstone flew over immediately. Wang Xian opened his dragon head and a surge of energy from the five elements surged into the five elements Millstone!<br/><br/>At the same time, the five elements millstone began to spin. As it spun, it grew larger and larger!<br/><br/>The Divine Dragon on the five elements millstone began to turn illusory and gradually turned into a grayish, destructive color!<br/><br/>At this moment, the five elements millstone seemed to have undergone a transformation and turned into a terrifying world-destroying millstone!<br/><br/>A force that made one’s heart palpitate and despair fell forward!<br/><br/>“What kind of attack is this?”<br/><br/>Feeling the power from the five elements millstone, the star barbarian skeleton leader’s body trembled.<br/><br/>At this moment, the five elements Millstone had already reached a size of over 100 million km, it was far larger than a universe planet!<br/><br/>The entire millstone was filled with destructive power!<br/><br/>“Weng!”<br/><br/>The Five Elements Millstone quickly revolved, the destructive power was heading towards the skeleton army!<br/><br/>“Roar!”<br/><br/>Countless skeletons in the skeleton army raised their heads and looked at the world-destroying millstone in the sky in horror!<br/><br/>“Boom!”<br/><br/>As the Five Elements Millstone’s attack landed, it was accompanied by a terrifying impact.<br/><br/>The five elements millstone was like a meat grinder, and all the skeletons within its range were rapidly collapsing!<br/><br/>Their bodies were turned into pieces, completely turning into dried up bones!<br/><br/>The terrifying attack had caused half of the skeleton army and countless skeleton soldiers to die!<br/><br/>“Hiss, run, run!”<br/><br/>“This Dragon King isn’t someone we can deal with. Run!”<br/><br/>The eight skeleton experts were completely terrified when they saw this scene, and they didn’t have the slightest desire to fight!<br/><br/>The Skeletons’strongest technique was their skeleton army.<br/><br/>It was their enormous sea of skeletons!<br/><br/>The powerhouses of the skeleton clan were confident that they could fight against two or even three powerhouses of the same level because they relied on their skeleton army!<br/><br/>However, half of the skeleton army of the eight powerhouses had been destroyed by the Dragon King’s attack?<br/><br/>Such a powerful ability was simply not at the level of a universe Knight’s Attack!<br/><br/>It was hard for them to imagine what kind of terrifying existence they were facing!<br/><br/>“He is indeed very strong!”<br/><br/>Wang Xian looked at the power of the five elements annihilation plate. His eyes sparkled. He flapped his incipient holy wings and quickly chased after the eight skeleton experts!<br/><br/>Without the skeleton army, the skeleton experts were not very strong among those of the same level!<br/><br/>Wang Xian locked onto the leader of the star barbarian skeleton with a huge black sword in his hand. His dragon claws clawed at it directly!<br/><br/>“Get lost!”<br/><br/>The leader of the starbarbarian skeletons sensed that Wang Xian was attacking him. He slashed with his huge sword!<br/><br/>As the sword Ray was slashed out, countless skeletons seemed to emerge from the sword ray and lunged at Wang Xian!<br/><br/>Buzz<br/><br/>Wang Xian’s Dragon Horn glowed and easily destroyed the sword ray. His speed instantly increased and his dragon claws appeared above his head!\t\t\t\t\t\t</div>", "images": {}, "success": true}