{"id": 666, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073233.html", "title": "Chapter 3657 - 3657 3656, The Old Witch", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3657 - 3657 3656, The Old Witch</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3657 3656, the old witch<br/><br/>“That Dragon King has appeared in the trading area. I didn’t expect that he would dare to appear in the trading area!”<br/><br/>“Not only that, he has also publicly traded the divine fruits to stabilize his mind. Now, many old monsters in the Invincible Zone have received the news. I really didn’t expect that Dragon King to be so unscrupulous!”<br/><br/>“I heard that after his real body arrived, he left behind a clone and left. That Dragon King is still somewhat cautious. He isn’t arrogant to the point of thinking that he is invincible!”<br/><br/>“Let’s go. We have the treasures given to us by the third prince. Through his clone, we can find his real body!”<br/><br/>In the Invincible Zone, the news of Wang Xian appearing in the trading ground immediately spread to the ears of the old monsters of the Angel clan!<br/><br/>They all had their subordinates in the trading ground. The moment Wang Xian appeared, they naturally received reports from their subordinates!<br/><br/>This gave them a pleasant surprise!<br/><br/>They had been searching for the Dragon King during this period of time. However, the invincible zone was too big. Without any news or clues, it was difficult to find him!<br/><br/>More than a dozen experts from the Angel clan flew towards the trading ground without any hesitation!<br/><br/>It wasn’t just the Angel clan. In a forest located in the invincible zone, forty to fifty phoenixes flapped their beautiful wings and flew towards the trading ground!<br/><br/>In addition, other experts who had received the news also immediately rushed towards the trading ground!<br/><br/>Treasures that could stabilize one’s mind were extremely useful to most of the experts in the Invincible Zone!<br/><br/>In fact, all the top-tier Old Monsters of the Invincible Zone who had received the news all flew towards the trading ground!<br/><br/>For some top-tier old monsters, they were very close to the Mad Demon!<br/><br/>Once their strength continued to increase, they might not be able to keep up due to the increase in their strength. Once they could not keep up, they would become mad demons.<br/><br/>Therefore, this resulted in a treasure that stabilized their minds, which was very important to them!<br/><br/>When they obtained the treasure that could stabilize their minds through the trade of the Dragon King in the trading ground, many experts flew over!<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>In the trading ground, the Old Monsters of the Invincible Zone had left some treasures with their subordinates or avatars.<br/><br/>When they wanted to come over, they could easily teleport over!<br/><br/>Soon, figures appeared around the trading ground!<br/><br/>In some places, more than a dozen figures instantly appeared in the surroundings!<br/><br/>Their eyes scanned the surroundings, full of vigilance!<br/><br/>In the invincible zone, many people were opponents, and all of them were enemies!<br/><br/>There were no rules here. If you wanted to live here, you had to be careful!<br/><br/>After all, there were many powerhouses of the peak races gathered here, and many of these powerhouses were extremely strange!<br/><br/>The assassination of the nether race!<br/><br/>The strangeness of the Magus race!<br/><br/>The Skeleton Sea of the skeleton race!<br/><br/>“Enter!”<br/><br/>Some of the experts moved and immediately flew towards the trading ground!<br/><br/>The trading ground was a place left behind since the formation of the Invincible Zone. Once they entered, their strength would be greatly reduced!<br/><br/>However, this did not mean that they could not fight here. Hence, they were still extremely careful when they entered!<br/><br/>However, the trading area was very small. As soon as they entered, they could see Wang Xian’s avatar inside!<br/><br/>A signboard stood there, and everyone could see it clearly!<br/><br/>One soul-returning embryo fruit in exchange for five innate spiritual treasures!<br/><br/>“That’s the Dragon King. His aura is very weak. It’s an avatar!”<br/><br/>A divine tiger stared at Wang Xian, and his eyes were sparkling!<br/><br/>“I heard that this fruit is at the peak of the venerable realm. This is a huge demand!”<br/><br/>An old man moved and arrived in front of Wang Xian’s clone.<br/><br/>“Dragon King, can you show us one of the soul-returning embryo fruits?”<br/><br/>He asked Wang Xian!<br/><br/>“Sure!”<br/><br/>Wang Xian moved his palm and a fruit appeared in front of him.<br/><br/>The aura of the soul-returning embryo fruit dispersed in the surroundings!<br/><br/>All the experts could feel it easily!<br/><br/>“A fruit at the peak of the venerable realm. Your Price is too expensive!”<br/><br/>The old man looked at Wang Xian and said, “Such an expensive price might offend some people. Why not make some friends by being cheaper?”<br/><br/>“Offend people? If you can’t afford it, get lost. Don’t lose your life because of a fruit!”<br/><br/>Wang Xian looked at the old man in front of him and replied calmly!<br/><br/>His words made the old man’s face darken instantly!<br/><br/>His expression changed and he snorted softly!<br/><br/>“Hehe, if you want to trade, then trade. If you don’t want to trade, then get lost. This price will not change!”<br/><br/>Wang Xian scanned his surroundings and said expressionlessly!<br/><br/>“This dragon king is so arrogant!”<br/><br/>“There’s no other way. He clearly marked the price. It’s up to you whether you want to trade or Not!”<br/><br/>Some of the powerhouses frowned slightly when they heard his words!<br/><br/>“I want a longevity fruit!”<br/><br/>At this moment, a figure wearing a bamboo hat and completely shrouded in green energy walked over and took out five innate spiritual treasures!<br/><br/>Wang Xian moved his palm and traded with each other.<br/><br/>The first transaction was completed!<br/><br/>This made him secretly happy!<br/><br/>This was a pleasant surprise. When he came here, he didn’t expect that taking the ordinary embryo fruit would have such a use!<br/><br/>The innate spiritual treasures that he exchanged for no longer needed to be devoured by the Tai Chi Dragon Disc’s five elements Millstone.<br/><br/>This was because the enhancement of the Tai Chi Dragon Disc’s five elements millstone would probably require some unique treasures to be enhanced!<br/><br/>These treasures were similar to the twelfth grade water lotus!<br/><br/>Of course, if Wang Xian had a way to melt the innate supreme treasures, the Tai Chi Dragon Plate and the five elements millstone could also absorb the innate supreme treasures to improve themselves!<br/><br/>However, the innate supreme treasures were extremely sturdy. It would be extremely difficult to destroy them!<br/><br/>Therefore, these innate supreme treasures could be given to the powerhouses of the Dragon Palace!<br/><br/>Although the Divine Dragon didn’t need to use weapons such as knives, spears, clubs, and the like, some special innate supreme treasures could still improve the strength of the Divine Dragon!<br/><br/>Secondly, the innate spiritual treasures could be melted and could help the divine dragon nurture the Dragon Pearl!<br/><br/>These innate spiritual treasures were all prepared for the experts of the Dragon Palace!<br/><br/>The old monsters in the invincible zone were all extremely powerful existences that had lived for a long time and had many treasures in their hands!<br/><br/>Innate supreme treasures were rare, but there were still many in the universe of innate spiritual treasures!<br/><br/>This was because some innate numinous treasures could be forged later in life!<br/><br/>“Dragon King, I want two serval fruits!”<br/><br/>The first transaction was completed, and soon, an expert from the Divine Tiger clan came over. He took out the resources and spoke to Wang Xian!<br/><br/>When Wang Xian saw this, he immediately took out two serval fruits!<br/><br/>In the invincible region, most of the old monsters were still in awe of Wang Xian.<br/><br/>After all, the supreme water demon king, the old scholar, the Black Tower’s Magi, and even the mad demon restriction had all died at the hands of Wang Xian!<br/><br/>In the entire invincible region, there were probably no more than three people who could defeat this Dragon King in a one-on-one fight!<br/><br/>In fact, there were none!<br/><br/>Some old monsters who did not have a team or influence could only conduct transactions if they wanted to stabilize their minds and treasures!<br/><br/>Moreover, to many old monsters, some of the treasures in their hands were useless to them!\t\t\t\t\t\t</div>", "images": {}, "success": true}