{"id": 660, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073221.html", "title": "Chapter 3651 - 3651 3650 To Kill 23 Experts From The Peak Races! Go", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3651 - 3651 3650 To Kill 23 Experts From The Peak Races! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3651 3650 to kill 23 experts from the peak races! Go<br/><br/>It was time to reap the rewards!<br/><br/>Wang Xian floated in the void and did not continue flying!<br/><br/>He stood there indifferently, sensing the situation around him!<br/><br/>It was already difficult for him to return to his Cosmos God nation in the surrounding void!<br/><br/>He needed five to six seconds to open the void crack and exit!<br/><br/>The reason for this was due to the space behemoths!<br/><br/>The space behemoths did not have their own Cosmos God country. It could be said that their own bodies were their own God countries and the source of their energy. Hence, they could not escape immediately!<br/><br/>And some space behemoths had special abilities and special spaces!<br/><br/>For example, the Kun domain of the Kun could not escape back to their own god countries within the KUN domain!<br/><br/>In the invincible domain, there were remnants of the special substance of the space behemoths that had fallen during the Great War!<br/><br/>“Perfect. If those guys want to escape, they can only rely on flying!”<br/><br/>Wang Xian smiled. He swept his gaze across the front and back and turned his body sideways!<br/><br/>“Huh?”<br/><br/>“Then the Dragon King has stopped. Then the Dragon King has stopped?”<br/><br/>“Has he stopped? Did he discover us?”? “However, the star barbarian skeleton and the rest of the skeleton clan are only a minute away from us. That Dragon King can not escape. Brother Aslie Shan, control your demon ship and speed up!”<br/><br/>At the back, when Wang Xian stopped, the fifteen demons saw something through their eyes and immediately shouted!<br/><br/>“We have contacted the leader of the star barbarian skeletons and the rest. Hahaha, they are about to meet us. It is difficult for us to break through space and escape back to our divine kingdom. The Dragon King is Dead!”<br/><br/>“The Dragon King is too arrogant and arrogant. Forget it. We can only blame him for having the treasure in his hands!”<br/><br/>“With our strength, it shouldn’t be a problem to kill him easily!”<br/><br/>“There are fifteen of us, including the star barbarian skeleton leader and the other eight, especially the star barbarian skeleton leader. The Skeleton Army under his command is very terrifying!”<br/><br/>“With our strength, with Big Brother Aslie Shan and the star barbarian skeleton leader, it shouldn’t be a problem for us to kill the Dragon King!”<br/><br/>The eyes of the demons shone as they said confidently!<br/><br/>If they joined hands, it would be very terrifying!<br/><br/>The other side had the unrivaled territory’s top-tier old monster, the star barbarian skeleton leader, and they also had the powerful Aslie Mountain Demons.<br/><br/>There were more than twenty unrivaled territory experts and two peak race experts.<br/><br/>It was easy to kill an old monster.<br/><br/>Although the Dragon King could easily kill the Mad Hex, they also had the strength to kill the Dragon King!<br/><br/>One had to know that they were joining forces with the skeleton clan!<br/><br/>The skeleton clan’s skeleton sea tactic could easily exhaust the experts to death!<br/><br/>Coupled with the fact that they were attacking from the side, they didn’t know how they would lose this battle!<br/><br/>“We’ve seen the Dragon King. They haven’t escaped yet. They’re really confident. They’re actually waiting for us!”<br/><br/>Very soon, the demon from Mount Aslie, who was controlling the demon ship, saw the figure floating in the void in front of them. Excitement burst out from his demon eyes!<br/><br/>“He’s Here!”<br/><br/>Wang Xian, who was standing in the void, swept his gaze to the left.<br/><br/>His gaze swept across the fifteen demons on the demon ship, and the corners of his mouth curled up slightly!<br/><br/>He shifted his gaze to the right!<br/><br/>There, an incomparably huge skeleton bird was flying. In the sky above the skeleton bird, eight skeletons were standing there quietly!<br/><br/>One of the skeletons was holding a huge black sword and was standing in the middle!<br/><br/>“Dragon King of the Dragon Palace, huh? What a coincidence!”<br/><br/>The demon from Mount Aslie controlled the demon ship and slowly stopped in the air. He was sizing up Wang Xian with a smile on his face!<br/><br/>“What a coincidence!”<br/><br/>Wang Xian looked at Mount Aslie, who had the wings of the demon. It was extremely sturdy and had a deep aura. A faint smile appeared on his face!<br/><br/>“CHIRP CHIRP!”<br/><br/>On the right side, the skeleton bird stopped in mid-air and let out a cry. The eight skeleton experts on it did not make a move!<br/><br/>“I heard that the Dragon King has the divine fruits to stabilize his mind. I wonder if you can give all of them to us?”<br/><br/>The blood-red light in the eyes of the demon from Mount Aslie slowly seeped out. His entire body slowly expanded!<br/><br/>The aura of the demon spread out in all directions!<br/><br/>The fourteen demons in the surroundings moved their bodies and flew to the side. They flapped their gigantic demon wings and slowly surrounded them!<br/><br/>“Hehe, I heard that the heads of the demons are pretty good decorations. I can exchange the divine fruits for your heads!”<br/><br/>Wang Xian replied with a smile when he heard Mount Aslie’s words!<br/><br/>“TSK TSK TSK, looks like we have to take it ourselves?”<br/><br/>Aslie Shan flapped his demonic wings when he heard his words. His eyes revealed a sinister look as he laughed sinisterly!<br/><br/>“Aslie Shan, you guys are talking too much nonsense. I still want another divine dragon’s skeleton.”<br/><br/>The leader of the Star Barbarians, who was standing in the middle of the skull of the skull bird on the right side, said flatly!<br/><br/>“Hualalala!”<br/><br/>“Hualalala!”<br/><br/>“Hualalala!”<br/><br/>As soon as he finished speaking, the seven skeletons beside him immediately flew around!<br/><br/>In the next moment, a terrifying scene appeared in front of everyone!<br/><br/>Behind them, countless skeletons appeared out of thin air behind them!<br/><br/>With a glance, there was not a single editor in sight!<br/><br/>The strongest skeletons were the flying skeleton birds, the skeleton beasts lying on the ground, and the skeleton mages holding magic staffs that looked sinister and strange!<br/><br/>These skeleton mages were burning with black hellfire!<br/><br/>The Hellfire Corps and the Skeleton Navy corps were the symbols of the skeleton race!<br/><br/>Hellfire represented long-range, and the skeleton sea represented close combat!<br/><br/>They were all using human sea tactics!<br/><br/>Behind each skeleton old monster, the army had a range of over 100 million km!<br/><br/>Especially the Skeleton Army of the central star barbarian skeleton leader!<br/><br/>One glance couldn’t even see the end of it. The 10 skeletons around him, each of their auras were no weaker than an ordinary universe ruler level 3 warrior!<br/><br/>Even after witnessing the skeleton race’s 15 powerful demons, their eyes were filled with shock!<br/><br/>It was one of the top battle rules of the Clan: never engage in a 1v1 battle with a skeleton!<br/><br/>At the same level, the probability of the skeleton clan being invincible was higher!<br/><br/>“They really came prepared. Skeleton Sea, demon, very good. I will take the head of the demon. Skeleton Sea, I will destroy it!”<br/><br/>Wang Xian looked at the skeleton sea on his right and his eyes sparkled!<br/><br/>This was the first time he was facing an expert from the skeleton race!<br/><br/>It was really a tactic of using a sea of people!<br/><br/>It was overwhelming in terms of numbers!<br/><br/>The combined strength of these guys was much stronger than the Mad Demon Prohibition!<br/><br/>However, there was one thing. Unless they attacked at the same time, otherwise…<br/><br/>“Arrogant, TSK TSK tsk. Today, I Will Bury Your Dragon King in the Invincible Zone!”<br/><br/>The group of demons stared at Wang Xian coldly. Waves of demonic wind formed behind him!\t\t\t\t\t\t</div>", "images": {}, "success": true}