{"id": 679, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073259.html", "title": "Chapter 3670 - 3670 3669 Space Beasts, Demon Breaker", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3670 - 3670 3669 Space Beasts, Demon Breaker</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3670 3669 space beasts, Demon Breaker<br/><br/>The Space Beasts of the invincible region were all extremely powerful!<br/><br/>In fact, in the universe, the space beasts were the most powerful existences.<br/><br/>Any one of them had terrifying strength and talent.<br/><br/>Especially in the mountain and sea region.<br/><br/>In the mountain and sea region, there were some powerful space beasts that didn’t even have the ability to break through.<br/><br/>In other words, they could easily break through from the Universe Knight Realm to the universe ruler realm.<br/><br/>Kun was one of them, but they weren’t the only one in the universe.<br/><br/>Some terrifying space beasts, when the pinnacle race experts saw them, they would immediately flee.<br/><br/>Similarly, Kun used divine dragons and Phoenixes as food, and he also liked to devour other pinnacle race experts.<br/><br/>To be able to devour divine dragons and Phoenixes, one could imagine how terrifying his strength was.<br/><br/>“Let’s go and hunt down the space behemoths.”<br/><br/>Wang Xian said to Wu Sha.<br/><br/>In the Invincible Zone, Wang Xian didn’t think that any space behemoths could be his opponent.<br/><br/>With Wu Sha, he was confident that he could hunt down any space behemoths.<br/><br/>“It’s the Dragon King!”<br/><br/>Wu Sha nodded her head. With a move, she brought Wang Xian and flew to the right!<br/><br/>At this moment, they were deep in the area. The surrounding trees had already disappeared. The surrounding void was filled with huge meteorites.<br/><br/>Occasionally, they could see some dilapidated divine kingdom buildings.<br/><br/>“In that direction, there is a space beast called lava. It is a fire element space beast. It has an extremely huge body. In the area where it lives, it has a large number of fire meteorites. The strength of the lava space beast is similar to that of a mad demon.”<br/><br/>Wu Sha introduced to Wang Xian as she flew.<br/><br/>Wang Xian nodded and continued flying forward. The temperature in front of him was getting higher and higher.<br/><br/>Before long, meteorites emitting flames appeared in his line of sight.<br/><br/>Boom! Boom<br/><br/>Not far away, there was a sea of flames burning in the void.<br/><br/>“This is the Sea of flames, Dragon King. We have stepped into the territory of the Lava Space Beast. There are usually treasures in these sea of flames.”<br/><br/>As Wu Sha spoke, her body moved and flew straight into the Sea of flames.<br/><br/>Wang Xian followed beside her.<br/><br/>“There really are!”<br/><br/>At this moment, Wu Sha’s eyes lit up as she stared at a fiery-red meteorite in the Sea of flames.<br/><br/>This was an extremely strange fiery-red meteorite. Flames were constantly dripping down from the top!<br/><br/>The Flames dripped into the fiery-red meteorite and formed a small nest.<br/><br/>The entire flaming meteorite was extremely radiant and was also emitting a bright luster.<br/><br/>“Innate spiritual treasure.”<br/><br/>Wang Xian swept his gaze over and said.<br/><br/>“Yes, many innate spiritual treasures are formed naturally. The power of this innate spiritual treasure is not weak.”<br/><br/>The Wizard waved his arm and the wizard’s hand grabbed it over and handed it to Wang Xian.<br/><br/>“This place is really a treasure ground. I easily obtained an innate spiritual treasure.”<br/><br/>Wang Xian raised his eyebrows and said.<br/><br/>“The place where the space beast lives must be a treasure ground. However, in terms of treasures, the biggest treasure in this entire space is the lava space beast.”<br/><br/>Wu Sha said as she stared ahead. “We have already appeared in its territory and taken some things away. This lava space beast has yet to appear.”<br/><br/>“Let’s go ahead and continue to take a look. With the size of the space beast, it’s very easy to find it.”<br/><br/>As Wang Xian spoke, he continued to fly forward.<br/><br/>“Roar! Roar! Roar!”<br/><br/>After flying for another hour, violent sounds were suddenly heard.<br/><br/>The sudden roar stunned Wang Xian and the rest. They looked ahead in astonishment.<br/><br/>“HMM? This is the furious roar of the Lava Space Beast. What’s going on? Is it a battle between the Space Beasts? Or are there other experts who have stepped into his territory?”<br/><br/>Wu Sha said.<br/><br/>The two of them continued to fly forward. Soon, the scene in front of them appeared in Wang Xian and the rest’s sight.<br/><br/>“What is this?”<br/><br/>Wang Xian looked over and saw more than a hundred experts dressed in black were surrounding and attacking a gigantic space beast.<br/><br/>Among the over 100 experts, the weakest one was much stronger than the ordinary level three masters of the universe.<br/><br/>Two of them were stronger and were not weaker than the supreme water demon king and the rest!<br/><br/>In the sky above them, a water bottle-like innate true treasure was floating in the sky.<br/><br/>The water in the water bottle flowed down like a terrifying waterfall. It had a terrifying penetrating force!<br/><br/>Below was the lava space behemoth that was a million kilometers in size.<br/><br/>Its entire body was like a sea of fire. It stood upright in the void and its body was similar to that of a human.<br/><br/>On its body, streams of fiery lava were constantly exploding. It was like a flaming meteorite that was about to explode at any moment.<br/><br/>A huge rope was held in the hands of dozens of experts. They were prepared to attack the lava space behemoth.<br/><br/>“This is?”<br/><br/>Wang Xian swept his gaze over and looked at the hundred over experts in astonishment.<br/><br/>These hundred over experts were very strong. The innate treasure in their hands was also very powerful.<br/><br/>However, it was obvious that they were not experts from the same race.<br/><br/>Among these hundred over experts, there were phoenixes, divine tigers, human experts, and wizards.<br/><br/>There were even experts from other races.<br/><br/>It was rare to see more than a hundred experts of such strength working together in the Invincible Zone.<br/><br/>“They are demon breakers. They are experts from the circle of Demon Breakers.”<br/><br/>Wu Sha, who was at the side, recognized this group of experts and said to Wang Xian.<br/><br/>“Demon Breakers?”<br/><br/>Wang Xian nodded his head slightly. This was a circle of experts from the long river and belonged to half of the organizations.<br/><br/>The powerhouses in this organization had the goal of breaking through to the realm of the ruler of the universe.<br/><br/>They had also reached an agreement that once there were powerhouses who had broken through, they would impart their own breakthrough experience.<br/><br/>Such an organization had nearly 200 powerhouses. Among them, there was even a powerhouse who was at the level of a mad demon.<br/><br/>However, that mad demon rarely appeared. Clearly, he was not in a good condition either.<br/><br/>Wang Xian observed them from the side and realized that many of these demon breakers had bought ordinary fruit from him before.<br/><br/>Moreover, they had bought quite a number of them.<br/><br/>“It seems like they got there first.”<br/><br/>Wang Xian mumbled.<br/><br/>“Dragon King, with our strength, we can definitely chase away these demon breakers or even kill them. This lava space beast still belongs to us.”<br/><br/>Wu Sha said coldly.<br/><br/>Wang Xian’s eyes flickered slightly.<br/><br/>In the invincible zone, the strong preyed on the weak. It was even crueler than the outside world.<br/><br/>Killing and snatching treasures were common occurrences.<br/><br/>“Don’t come out for now. I’ll chase them away.”<br/><br/>Wang Xian said. His body moved and emitted a powerful aura as he flew forward.<br/><br/>Boom<br/><br/>When Wang Xian flew over, a terrifying aura surged toward the battlefield.\t\t\t\t\t\t</div>", "images": {}, "success": true}