{"id": 671, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073243.html", "title": "Chapter 3662 - 3662 3661 Killed The Old Witch", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3662 - 3662 3661 Killed The Old Witch</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3662 3661 killed the old witch<br/><br/>“Gulp!”<br/><br/>The illusionary little ghost swallowed Wang Xian’s flesh and blood and slowly transformed into Wang Xian’s appearance!<br/><br/>“Cough cough cough, this move comes from the attack of flesh and blood. Let’s see how you can dodge it!”<br/><br/>The old witch stared at the little ghost with Wang Xian’s face in front of her. Her eyes were filled with fury!<br/><br/>She quickly drew a complicated formation and the little ghost in the formation slowly disappeared!<br/><br/>In the Invincible Zone, Wang Xian was rushing towards the old witch’s lair. Suddenly, he sensed something in his heart!<br/><br/>Out of nowhere, Wang Xian sensed that there was more flesh and blood in his body!<br/><br/>This extra piece of flesh and blood did not have any resistance to his body. It was as if this was originally a part of his body!<br/><br/>The sudden change made Wang Xian’s eyes throb slightly!<br/><br/>He suddenly had a bad feeling!<br/><br/>However, that extra piece of flesh had already completely fused with his body. He could not expel it at all!<br/><br/>“What’s going on? Could it be a curse that directly attacks the origin of my body!”<br/><br/>Wang Xian’s eyes focused. He had a bad feeling in his heart!<br/><br/>Dong Dong<br/><br/>The next moment, he felt his heart beating violently!<br/><br/>Buzz<br/><br/>“Shadow Dragon Clone!”<br/><br/>Wang Xian felt that a great terror was about to descend upon his body. Without any hesitation, he immediately executed the law aspect that he had comprehended during this breakthrough!<br/><br/>Shadow Dragon clone!<br/><br/>This was a life-saving ability. By splitting a body, one could withstand a fatal attack!<br/><br/>“Die, die, die, die!”<br/><br/>The moment Wang Xian’s Shadow Dragon Avatar was completed, a series of eerie roars came from his original body!<br/><br/>This voice came from his physical body, but he couldn’t find any place. It was as if the voice came from his physical body automatically.<br/><br/>In his sight, Wang Xian’s physical body slowly collapsed and dissipated!<br/><br/>“What a strong curse, what a strange curse. It directly acted on my physical body. Even the tai chi dragon coil couldn’t withstand it!”<br/><br/>Wang Xian’s pupils contracted slightly when he saw this scene!<br/><br/>A vigilant look appeared in his eyes. With a thought, the Netherworld Ghost Avatar appeared at his side!<br/><br/>The four Netherworld Ghost Avatars were the last ones to be traded. Through the ancestral tree, they had already reached Wang Xian’s current realm!<br/><br/>The attack just now was extremely strange. Wang Xian didn’t know if it would continue.<br/><br/>If it did, he could try to transfer it to the Netherspirit’s avatar!<br/><br/>Time ticked by. After making sure that the curse attack didn’t continue, Wang Xian moved his body and continued flying toward the old witch’s lair!<br/><br/>“Is he dead?”<br/><br/>At the same time, in the old witch’s cabin in the forest, the old witch muttered as she sensed the disintegration of the piece of flesh and blood!<br/><br/>“With the Dragon King’s foundation, he should have a treasure that can bring him back to life. He should not be dead, but even if he is not dead, he will still be severely injured. I will use this time to recover my strength!”<br/><br/>The old witch muttered to herself!<br/><br/>This was the strongest curse. He did not want to kill the Dragon King completely. She also knew that such a strong person must have a way to revive and save his life!<br/><br/>But as long as she could severely injure the Dragon King, her goal would be accomplished!<br/><br/>She was also severely injured, and her strength was less than half of what it was when she was at her peak.<br/><br/>However, she did not leave this place and went to other places to recover her strength!<br/><br/>This was her old nest, and there were many arrays that she had set up here.<br/><br/>Now, even if she was seriously injured, in her old nest, with the help of the power of the old nest, she would be able to burst out with her strength at her peak outside!<br/><br/>On the contrary, once he left this place, his strength would be equivalent to half of his peak strength!<br/><br/>Therefore, it was safer in his lair!<br/><br/>The old witch waved her arm, and some bottles flew to her and were quickly absorbed by her!<br/><br/>While she was recovering, Wang Xian was still hurrying over!<br/><br/>The Shadow Dragon clone was already activated and could withstand the fatal attack!<br/><br/>For a short period of time, at least for three days, this move could no longer be used!<br/><br/>Wang Xian did not wait for the Shadow Dragon clone to be activated before he continued on his journey!<br/><br/>The old witch was already severely injured!<br/><br/>This was the best time to kill the old witch!<br/><br/>Once the old witch recovered to her peak condition and hid in her lair, it would be very difficult for Wang Xian to kill her!<br/><br/>To attack the lair of a powerful wizard, an old witch with the level of a crazy demon would be able to fight three to four, or even five!<br/><br/>With such strength, Wang Xian wouldn’t be able to kill her!<br/><br/>Now was the best time!<br/><br/>From Wang Xian’s point of view, the old witch’s lair wasn’t too far away. After ten hours, he came to a stop after sensing something!<br/><br/>“The old witch’s lair should be ahead. There must be a large number of formations set up in his lair. Illusory formations, defensive formations, attack formations, and strange formations!”<br/><br/>Wang Xian’s eyes flickered. He concealed all his energy and flew forward!<br/><br/>Soon, a small forest appeared in his line of sight. The small forest was not very big. It was only about ten million kilometers in size!<br/><br/>There were some trees planted in this void forest. Wang Xian could recognize a bunch of bamboos!<br/><br/>Above the forest, there was a small house floating in the air. The small house was not big, but it looked extremely ancient!<br/><br/>This piece of forest and a small wooden house were floating here. No matter how one looked at it, it looked extremely strange!<br/><br/>Wang Xian’s eyes flickered slightly as he continued to move forward!<br/><br/>Whoosh! Whoosh<br/><br/>When Wang Xian approached the small forest, the trees inside suddenly started to move without any wind!<br/><br/>This caused his gaze to freeze slightly!<br/><br/>Roar<br/><br/>All of a sudden, a roar was heard from within the small forest. A violent wind suddenly stirred up in the surroundings!<br/><br/>In the forest, a patch of trees was emitting a green glow. That glow condensed into the form of a wind demon!<br/><br/>The Wind Demon was lifelike. Its cold and violent eyes locked onto Wang Xian!<br/><br/>“What a strong observation ability. I was able to be discovered instantly when I was still some distance away from the forest. As expected of the strongest wizard in the Invincible Zone!”<br/><br/>Wang Xian’s eyes focused as a violent look appeared in his eyes as well!<br/><br/>“Today, I’m going to barge into your lair!”<br/><br/>“Roar!”<br/><br/>A violent roar came out from his mouth. Wang Xian transformed into the body of a divine dragon.<br/><br/>The tai chi dragon disc hovered around him, forming a terrifying defense!<br/><br/>“Boom!”<br/><br/>The five elements millstone appeared and hovered above his head. The earthy yellow energy completely enveloped Wang Xian!<br/><br/>“Buzz Buzz!”<br/><br/>In the next instant, four Netherspirit avatars appeared beside Wang Xian!<br/><br/>“Defense, Demon Break!”<br/><br/>The figure of the spirit appeared beside Wang Xian’s dragon head. He waved the water lotus staff in his hand gently.<br/><br/>Layers of defense landed on Wang Xian!<br/><br/>Crash<br/><br/>With the primaless saint wings flapping, Wang Xian stared at the small house in the forest. He charged forward at his maximum speed!<br/><br/>“Roar!”<br/><br/>The mad demon stared at Wang Xian and attacked him instantly!<br/><br/>The surroundings of the small house in the forest seemed to have been completely awakened. A terrifying energy was brewing!\t\t\t\t\t\t</div>", "images": {}, "success": true}