{"id": 670, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073241.html", "title": "Chapter 3661 - 3661 3660 To Kill The Old Witch", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3661 - 3661 3660 To Kill The Old Witch</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3661 3660 to kill the old witch<br/><br/>“You Damn Dragon King, I will kill you. I will kill you!”<br/><br/>The old witch looked at Wang Xian who was standing in front of her with a ferocious expression!<br/><br/>Lines of text were flickering in her pupils!<br/><br/>A special and strange formation was being released from her pupils!<br/><br/>“Hehe, Old Thing, I would like to see where you can run to!”<br/><br/>Wang Xian stared at her indifferently and said mockingly!<br/><br/>“You Want to kill me? Impossible!”<br/><br/>The old witch stared at him hatefully. She turned around and continued to flee backward!<br/><br/>Wang Xian waved his dragon claws, but it easily penetrated her body and couldn’t harm her physical body!<br/><br/>“Old Thing, do you think I can’t do anything to you just because you are hiding in this special domain?”<br/><br/>Wang Xian moved his body and flew side by side with the old witch!<br/><br/>However, this old witch seemed to be in another space and couldn’t touch her at all!<br/><br/>“Cough cough cough. Dragon King, I will let you know the consequences of offending a powerful wizard!”<br/><br/>The old witch turned her head and let out a ferocious roar!<br/><br/>“Hehe!”<br/><br/>Wang Xian chuckled and clenched his dragon claws. The Shadows of the two divine dragons, light and darkness, slowly gathered on top of it!<br/><br/>He hurled his dragon claw at the space where the old witch was!<br/><br/>Buzz<br/><br/>The Dragon Claw hurled over and the entire space shook!<br/><br/>Crack! Crack<br/><br/>At this moment, the sound of glass shattering was heard. The old witch’s figure became more and more real!<br/><br/>“You… you can actually break my space!”<br/><br/>The old witch stared at Wang Xian with a hint of despair in her eyes!<br/><br/>“I will return your flesh and blood to you. I will not curse you. Let Me Go!”<br/><br/>She stared at Wang Xian and roared in a deep voice!<br/><br/>“What right do you have to negotiate with Me Now?”<br/><br/>Wang Xian’s Dragon Claw slowly entered the collapsed space and clawed at the old witch!<br/><br/>The Dragon Claw was filled with the deathly stillness of the five elements and the strangeness of yin and yang!<br/><br/>“This body of mine is just one of them. If you kill this body of mine, my other body will curse you and kill you. You will suffer endless attacks. Let Me Go and I will return your flesh and blood to you. I will never attack you again!”<br/><br/>The old witch’s expression changed slightly when she saw the dragon claw grabbing her!<br/><br/>“More than one body? The strength of this body of yours is weaker than the mad demon restriction. However, it should take up a large portion of your strength. You can kill me if you want to, but you can give up if you want to?”<br/><br/>Wang Xian’s Dragon Claw held the old witch’s body and stared at her coldly with his dragon eyes!<br/><br/>“Cough cough cough, cough cough, if you kill this body of mine, then I will not rest until I am dead. I will show you how terrifying a Magus is!”<br/><br/>The old witch threatened ferociously!<br/><br/>“Bang!”<br/><br/>As soon as she finished speaking, Wang Xian clenched his dragon claws with force. The destructive power directly attacked her life force and killed her!<br/><br/>“Ah Ah Ah, Dragon King, I want you to die!”<br/><br/>The moment this body died, it was located in an area of the invincible zone.<br/><br/>In a small forest, there was a small house in the forest. A shrill voice came from inside the small house!<br/><br/>The small house did not look big, but the interior space was more than 10,000 kilometers!<br/><br/>Inside the small house, there were many bottles and jars!<br/><br/>Inside these bottles and jars, there were all kinds of colors and all kinds of strange biological limbs!<br/><br/>In the center, there were also special strips of cloth, on which there were pictures of arrays!<br/><br/>And in the center of these strips of cloth, there was an old woman sitting cross-legged!<br/><br/>The strips of cloth were connected to her body, as if they were sealing her!<br/><br/>This was the old witch’s ability to fight against the inner demons!<br/><br/>Her powerful strength made it impossible for her to control it, so she split her body into two.<br/><br/>This body suppressed this area and sealed it to prevent the two bodies from merging!<br/><br/>Although her strength would double after merging, she would lose her mind!<br/><br/>Now that the other body was dead, this body would be the only body of the old witch!<br/><br/>The runes on the surrounding cloth rushed towards her body. With the other body dead, this body didn’t need to worry too much!<br/><br/>Slowly, a terrifying aura came from the old witch’s body!<br/><br/>She moved her palm, and a meatball containing dragon might appeared in front of her, floating in the air!<br/><br/>“I will use the most evil curse to make you suffer the most painful attack. Dragon King, Dragon King, I will make you pay a thousand times, ten thousand times the price!”<br/><br/>The old witch murmured, and her ferocious face began to set up the array!<br/><br/>She wanted to use her curse spells to make the Dragon King submit to her and even die!<br/><br/>“You Old Fool, you’re courting death. This body is dead, but she obviously has other bodies!”<br/><br/>Wang Xian kept the old witch’s body into the Dragon Palace and sensed it with his mind!<br/><br/>His body moved and he continued to fly forward!<br/><br/>He could feel his piece of flesh and blood!<br/><br/>Wang Xian was flying at his fastest speed. With his explosive speed, he could feel that he was getting closer and closer to that piece of flesh and blood!<br/><br/>Buzz<br/><br/>However, after flying for two hours, he suddenly felt a great terror descending on him!<br/><br/>“Cough cough cough. Dragon King, Embrace your fear!”<br/><br/>A familiar voice suddenly rang in Wang Xian’s mind. His gaze focused and he stopped moving!<br/><br/>Buzz<br/><br/>The Tai Chi Dragon Plate appeared and the yin-yang space slowly enveloped Wang Xian!<br/><br/>In this space, Wang Xian was able to isolate all attacks and curses!<br/><br/>Clap, clap, clap<br/><br/>At this moment, Wang Xian saw drops of blood falling around the yin-yang space, producing a sound that sounded like raindrops!<br/><br/>Buzz, Buzz, Buzz, Buzz, Buzz<br/><br/>Soon, the sound of Raindrops disappeared and turned into a sound that was filled with magic!<br/><br/>This sound was extremely strange. It was filled with charm and attraction as if it could penetrate the defense of the Tai Chi Dragon Plate!<br/><br/>This caused Wang Xian’s expression to change slightly!<br/><br/>“Roar! Roar! Roar!”<br/><br/>At this moment, dragon roars filled with power rang out one after another. A holy dragon pressure came pressing down!<br/><br/>The sound rang in his ears. Wang Xian looked around. There were cracks in the yin-yang space!<br/><br/>“What a powerful and weird curse!”<br/><br/>Wang Xian mumbled and raised his head slowly. He seemed to be able to see a pair of ferocious faces staring at him!<br/><br/>“Old Thing, it’s useless!”<br/><br/>As he spoke, he continued flying forward!<br/><br/>“Defensive treasure, a powerful defensive treasure. It actually managed to block my curse. Dragon King, you are very strong. However, you met me. You will die eventually. You will die eventually!”<br/><br/>The old witch waved her arm when she saw Wang Xian blocking her curse!<br/><br/>Splash<br/><br/>The sound of bottles and jars colliding could be heard. Dozens of bottles came before her.<br/><br/>She opened the bottles and poured the liquid and the strange items in them in front of her!<br/><br/>Drops of liquid and pieces of strange items fused together to form the appearance of a little ghost.<br/><br/>But soon, the little ghost became illusory!<br/><br/>The old witch placed Wang Xian’s flesh and blood in front of the Little Ghost!\t\t\t\t\t\t</div>", "images": {}, "success": true}