{"id": 678, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073257.html", "title": "Chapter 3669 - 3669 3,668 Were Hunted Down In Large Numbers", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3669 - 3669 3,668 Were Hunted Down In Large Numbers</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3669 3,668 were hunted down in large numbers<br/><br/>There were only about 2,000 of the 5,000 floating wooden-winged birds!<br/><br/>The floating wooden-winged birds relied on their huge numbers to form a powerful attack.<br/><br/>Now, with half of them dead and injured, there were only about 2,000 of them left!<br/><br/>These 2,000-odd birds posed no threat to Wang Xian and Wu Sha!<br/><br/>Their combined strength was no longer able to fight against Wang Xian and the rest!<br/><br/>“Eight dragon clones!”<br/><br/>Following the attack of Wang Xian’s law form, 500 to 600 wooden-winged birds were easily killed.<br/><br/>There was no suspense in the battle that followed.<br/><br/>One by one, the wooden-winged birds were killed quickly.<br/><br/>Half an hour later, the last wooden-winged bird died.<br/><br/>“Dragon King, the wings of the floating wooden-winged birds are very useful. They can be used to forge a staff of the innate numinous treasure level, as well as other wind attribute treasures.”<br/><br/>Wu Sha looked at the corpses of the floating wooden-winged birds and said to Wang Xian.<br/><br/>The corpse of a floating wooden-winged bird might not be as valuable as an innate numinous treasure, but it was still extremely valuable.<br/><br/>There were about 5,000 floating wooden-winged birds. It was definitely a huge amount of resources.<br/><br/>“Okay.”<br/><br/>Wang Xian nodded with a smile. Compared to using them to forge innate spiritual treasures, the floating wooden-winged birds were more useful as resources for the Dragon Palace.<br/><br/>What did 5,000 level 2 universe dominator level floating wooden-winged birds mean to the Dragon Palace?<br/><br/>Currently, there were only about 2,000 universe dominator level experts in the Dragon Palace.<br/><br/>Among them, there were 200 masters with the combat strength of a universe dominator at level three.<br/><br/>This strength was very strong. However, just the corpses of these floating wooden-winged birds could increase the combat strength of the Dragon Palace by 5,000 Masters with the combat strength of a universe dominator at level two.<br/><br/>Or perhaps it could be 500 masters with the combat strength of a universe dominator at level three.<br/><br/>This could double Wang Xian’s strength, and it was more than double.<br/><br/>In addition, Wang Xian had also killed the experts of the mad demon prohibition and the skeleton clan in the invincible region. Needless to say, he had also killed the innate spiritual treasures!<br/><br/>“Not only the corpses of the floating woodwing birds, but also the floating woodwing birds’divine kingdom and some of the treasures in the Divine Kingdom.”<br/><br/>Wang Xian mumbled and was slightly excited. He looked at Wu sha and said, “Wu Sha, look for the floating woodwing birds’divine kingdom. Is it in their territory?”<br/><br/>“It’s the Dragon King!”<br/><br/>Wu Sha nodded and used her sorcery to search for the location of their nest.<br/><br/>Wang Xian kept all the corpses and threw them into the dragon palace. He asked Prime Minister Gui to get the disciples of the Dragon Palace to upgrade themselves.<br/><br/>“Dragon King, the Divine Kingdom of the floating woodwing birds is in their nest.”<br/><br/>Wu Sha confirmed it and said to Wang Xian.<br/><br/>Wang Xian nodded and flew towards the nest of the floating wooden winged birds.<br/><br/>The divine kingdom of the floating wooden winged birds was a little strange. It looked like a huge nest and was similar to the Dragon Cave in the Dragon Palace.<br/><br/>However, this did not affect the resources of the divine kingdom.<br/><br/>The Divine Kingdom could allow the devouring dragon to devour and increase its strength.<br/><br/>The Divine Kingdom of about 5,000 level 2 desolate beasts that were masters of the universe could increase the strength of the devouring dragon.<br/><br/>The Devouring Dragon’s strength was different from other races.<br/><br/>They inherited the characteristics of the bug race. As long as they had enough resources, they could continue to improve.<br/><br/>They didn’t have the shackles of the universe ruler realm.<br/><br/>However, there was one point. The Devouring Dragon could only fight two levels higher than the pinnacle races.<br/><br/>Secondly, if they wanted to have the strength of a universe ruler, they had to feed them with the god country of a universe ruler.<br/><br/>This was equivalent to killing a universe dominator and obtaining the divine kingdom to upgrade them.<br/><br/>This harsh condition was no less than a normal breakthrough.<br/><br/>In the nest of the floating woodwing bird, Wang Xian had obtained many unexpected surprises!<br/><br/>Powerful trees, divine herbs, and divine fruits!<br/><br/>As a wood-attributed dire beast, these things were indispensable to them.<br/><br/>“Let’s go to the next place.”<br/><br/>After collecting all the treasures in the nest of the floating woodwing bird, Wang Xian said to Wu Sha with a smile on his face.<br/><br/>“It’s the Dragon King. Not far from here, there is a powerful dire beast called the Horseshoe Crab Demonic Beast. It possesses extremely powerful strength and is comparable to some of the top old monsters in the invincible zone. However, it is very cunning and possesses the Phoenix bloodline. Its vitality is very strong and it is very difficult to kill it!”<br/><br/>Wu Sha introduced it to Wang Xian.<br/><br/>“Alright.”<br/><br/>Wang Xian nodded and proceeded to hunt the next target with Wu Sha!<br/><br/>Three days later, they arrived at the territory of the horseshoe crab.<br/><br/>“That horseshoe crab is very cunning. Once it senses any danger, it will definitely not come out. Initially, I wanted to kill it and extract some of its bloodline. However, once I unleash my powerful strength, I will lose my mind. This fellow will be able to get rid of me easily. Once I split my body, I won’t be able to kill it either.”<br/><br/>Wu Sha clearly understood this dire beast very well. She frowned and said that!<br/><br/>Wang Xian nodded his head.<br/><br/>Now, Wu Sha could kill that dire beast by herself. However, it might require some effort.<br/><br/>However, with Wang Xian around, everything would be much simpler.<br/><br/>Wu Sha used the Horseshoe Crab Demonic Beast’s aura to quickly lock onto its position.<br/><br/>“Kill it!”<br/><br/>The Horseshoe Crab Demonic Beast was a fire-type demonic beast. It was hidden in the roots of the trees. When it saw Wang Xian and Wu Sha, it didn’t hesitate at all and immediately fled in the interweaving roots of the trees!<br/><br/>It could feel the threat of death from Wang Xian and Wu Sha!<br/><br/>Crackle<br/><br/>When a bolt of lightning struck its body, the power of void pursuit entered its body!<br/><br/>A smile appeared on Wang Xian’s face. He flapped his divine wings and immediately gave chase.<br/><br/>With his speed, it was impossible for the horseshoe crab to escape!<br/><br/>Under the attacks of the energy, Wang Xian easily killed it.<br/><br/>“Next!”<br/><br/>After killing the horseshoe crab, Wang Xian continued to instruct Wu Sha!<br/><br/>With Wu Sha, who had lived in the invincible zone for billions of years, everything was simple!<br/><br/>In the following period of time, Wang Xian began to hunt the desolate beasts wantonly!<br/><br/>Small groups of desolate beasts, powerful single-bodied desolate beasts.<br/><br/>In the following year, Wang Xian was hunting!<br/><br/>And the harvest was abnormally rich.<br/><br/>The desolate beasts with the level two and level three combat strength of the universe dominator were rarely encountered outside unless they were in the mountains and seas.<br/><br/>And these gains were extremely huge resources for the Dragon Palace!<br/><br/>In this one year, more than 100 level three desolate beasts had died at the hands of Wang Xian.<br/><br/>As they continued to hunt, they went deeper and deeper.<br/><br/>“Dragon King, if we go deeper, we will be able to encounter some space beasts. Compared to desolate beasts, the space beasts in the invincible region are even more terrifying. The stronger the murderous aura and bloody aura of the space beasts, the more terrifying their strength.”<br/><br/>A year later, Wu Sha scanned her surroundings and spoke to Wang Xian.\t\t\t\t\t\t</div>", "images": {}, "success": true}