{"id": 672, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073245.html", "title": "Chapter 3663 - 3663 3662 Was Subdued", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3663 - 3663 3662 Was Subdued</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3663 3662 was subdued<br/><br/>“What? Someone actually dared to invade my lair? Who Is it, the Dragon King?”<br/><br/>The moment the array formation around the small house in the forest was activated, the old witch in the small house instantly opened her eyes and looked outside with an embarrassed expression!<br/><br/>When she saw that familiar figure, the old witch’s expression became even more embarrassed!<br/><br/>She stood up slowly. The roof and the surroundings of the entire small house were slowly flattened, forming a wooden board that was suspended in the air!<br/><br/>The old witch moved her palm and a staff with the nine-headed snake on it flew to her. She raised the staff in her hand and stared at Wang Xian who was charging towards her!<br/><br/>“Demon Spirit Formation, open!”<br/><br/>“Succubus formation, open!”<br/><br/>“Upper nine heaven-engulfing formation, open!”<br/><br/>“Nine beasts heaven-engulfing snake formation, open!”<br/><br/>“Kun is the eight directions formation, open!”<br/><br/>“Open, open, open!”<br/><br/>The old witch held the nine-headed snake staff in her hand and roared loudly in an ice-cold voice. Her pair of blood-red eyes stared at Wang Xian!<br/><br/>“Boom! Boom! Boom!”<br/><br/>Along with her every sound, the surroundings of the small house in the forest began to shake violently.<br/><br/>The entire void seemed to have undergone a huge change!<br/><br/>It was as if they were in a special domain. All sorts of demons and monsters appeared!<br/><br/>Black fog shrouded the area!<br/><br/>Pairs of blood-red pupils appeared in the fog!<br/><br/>Berserk dire beasts appeared in the surroundings one after another!<br/><br/>…<br/><br/>All kinds of formations rose up, and each of them was extremely terrifying!<br/><br/>They covered Wang Xian!<br/><br/>At this moment, Wang Xian had unleashed all his defenses!<br/><br/>Five Elements Millstone, Tai Chi Dragon Disc, Netherspirit Avatar, and Spirit Soul!<br/><br/>All his trump cards were unleashed, and all his defenses were stacked up!<br/><br/>Wizards, Old Witch. To Wang Xian, as long as he could get close to her, he would be able to kill her!<br/><br/>Therefore, he could not fight with her. He had to get close to her as fast as possible!<br/><br/>Then, he had to destroy her.<br/><br/>For this, Wang Xian took out all his trump cards!<br/><br/>How strong would Wang Xian’s trump cards be when added together?<br/><br/>With the help of the primaless saint wings, he was comparable to the mad demon prohibition.<br/><br/>The Tai Chi Dragon Disc and the primaless saint wings were comparable to two mad demon prohibition!<br/><br/>Four netherspirit avatars were more powerful than one mad demon prohibition!<br/><br/>In addition to that, there was also Lingling!<br/><br/>Wang Xian’s current strength was comparable to the combined strength of six experts at the level of Mad Demon Prohibition!<br/><br/>Even if the uninjured old witch was controlling the formation in her lair, she was still no match for Wang Xian!<br/><br/>Of course, if the old witch was at her peak, it would be extremely difficult for Wang Xian to kill her in her lair!<br/><br/>Now was his chance!<br/><br/>Wang Xian didn’t want her to live for too long against such a strange opponent and enemy!<br/><br/>With all his defenses on his body, Wang Xian swayed his huge dragon body and charged straight for the small house in the forest!<br/><br/>The wind demon charged over, but it was directly broken by Wang Xian’s defense and terrifying speed!<br/><br/>The pupils in the surrounding Black Fog and black fog appeared. The Ghost Avatar also released its blood-red pupils and looked at each other!<br/><br/>It caused the ghost avatar to collapse!<br/><br/>“Roar! Roar! Roar!”<br/><br/>In front of him, a giant snake with nine heads appeared. Each and every one of its ferocious heads tore at Wang Xian!<br/><br/>“Bang! Bang! Bang!”<br/><br/>However, under Wang Xian’s absolute defense, the head of the giant snake hit the snake and slowly began to collapse!<br/><br/>The trees in the forest at noon extended their demonic branches and twined around Wang Xian.<br/><br/>However, they were all useless!<br/><br/>The bamboo branches turned into terrifying sharp weapons and covered him!<br/><br/>“Bang! Bang! Bang!”<br/><br/>Only the sound of intense collisions could be heard. The bamboo branches broke one by one and fell into the air!<br/><br/>All the attacks were blocked by Wang Xian’s layers of defense!<br/><br/>“What? What a powerful defense!”<br/><br/>“Also, how could he have four netherspirit avatars? This is a unique innate ability of the netherworld race. How could the Dragon King control the Netherspirit Avatars?”<br/><br/>“That is the companion Elf of the Elf race. Ah, why does the Dragon King have so many trump cards?”<br/><br/>In the small house in the forest, the old witch’s expression changed drastically when she saw Wang Xian charging towards her relentlessly!<br/><br/>Netherspirit avatars!<br/><br/>Companion Elves!<br/><br/>These were the innate abilities and treasures of other peak races!<br/><br/>This Dragon King actually possessed them too!<br/><br/>Furthermore, the dozens of powerful arrays set up around his nest were actually unable to stop the Dragon King’s Attack!<br/><br/>Even though he was only half of his pinnacle stage, with all the arrays activated, he wasn’t afraid of facing other mad demons or even two of them!<br/><br/>But now, his arrays were actually unable to do anything to the Dragon King!<br/><br/>The defense around him was still intact!<br/><br/>“How could a universe knight have such terrifying strength? Even if it’s a treasure that can stabilize one’s mind, it shouldn’t be this strong!”<br/><br/>The old witch roared in disbelief!<br/><br/>Wang Xian stared at the old witch, his eyes filled with killing intent.<br/><br/>“I said, if you want to die, I won’t Let You Live!”<br/><br/>He said in a sinister tone.<br/><br/>“No, no, no, I haven’t broken through to the realm of the universe’s ruler. I haven’t taken the final step. I don’t want to die, I don’t want to Die!”<br/><br/>The old witch looked at Wang Xian’s invincible Aura and roared crazily!<br/><br/>She had cultivated for more than 10 billion years and had reached this stage!<br/><br/>Her lifelong wish was to break through to the realm of the universe’s ruler. She had even become her own inner demon!<br/><br/>Now that she was dead, she was unwilling to accept it!<br/><br/>It was fine for her to hear the Dao in the morning and die in the evening, but she had yet to see her own dao!<br/><br/>“If you don’t want to die, you have to die too!”<br/><br/>Wang Xian’s dragon claws clawed at her. The defensive formation around her quickly collapsed!<br/><br/>The old witch widened her eyes and looked at this scene. Her body trembled violently!<br/><br/>“I’m willing to submit. I’m willing to submit to Your Dragon King. Don’t kill me, don’t kill me!”<br/><br/>Suddenly, the old witch shouted loudly with a terrified expression!<br/><br/>“Huh?”<br/><br/>Wang Xian raised his eyebrows slightly when he heard her words!<br/><br/>The five elements millstone floated above the old witch’s head and stared at her.<br/><br/>“Submit?”<br/><br/>He sized up the old witch and asked faintly!<br/><br/>“Yes, I submit. I haven’t broken through yet. I haven’t become the Master of the universe. I submit. I want to become the Master of the universe.”<br/><br/>The old witch screamed at the top of her lungs!<br/><br/>Becoming the Master of the universe was her lifelong obsession!<br/><br/>“Alright, devour this drop of blood essence and enter my Dragon Palace. Then, Summon Your Divine Kingdom to the Dragon Palace!”<br/><br/>Wang Xian squinted his eyes slightly and instructed!<br/><br/>“Alright, Alright!”<br/><br/>The old witch replied immediately without any hesitation!<br/><br/>Wang Xian was indeed surprised by the old witch’s submission!<br/><br/>Normally, it would be extremely difficult for someone of such a level to make her submit!<br/><br/>“This should be related to her obsession. Her lifelong wish is to reach the realm of the ruler of the universe. Naturally, she doesn’t want to die if she doesn’t achieve it. Hehe!”<br/><br/>Wang Xian smiled. The old witch was definitely a terrifying existence, especially her curses and spell formations!<br/><br/>Even Wang Xian had to go all out to deal with her!<br/><br/>If such an existence could be subdued, it would be a significant improvement for the Dragon Palace. At the same time, it would also bring a huge amount of knowledge about wizards to the Dragon Palace!\t\t\t\t\t\t</div>", "images": {}, "success": true}