{"id": 675, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073251.html", "title": "Chapter 3666 - 3666 3665 Stepped Into The Territory Of The Space Behemoth", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3666 - 3666 3665 Stepped Into The Territory Of The Space Behemoth</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3666 3665 stepped into the territory of the space behemoth<br/><br/>The matter of the old witch being suspected to have been killed by the Dragon King caused a huge sensation!<br/><br/>However, Wang Xian was in the trading ground, carrying out transactions one after another with a smile on his face!<br/><br/>Every transaction was a huge harvest. Since he came to the invincible zone until today, the number of innate spiritual treasures in his hands had already reached around 5,000!<br/><br/>5,000 was a huge number!<br/><br/>One connate spirit treasure was equivalent to a clan treasure for some weaker races!<br/><br/>However, in the invincible region, the weak were stronger than Ordinary Level-3 universe masters. Many great beings could easily wipe out a strong race!<br/><br/>Take the Hundred City Alliance as an example. The Huge Hundred City Alliance was only a level-3 universe master!<br/><br/>An expert with such strength could easily build a faction and a city in the outside world!<br/><br/>They all had a lot of connate numinous treasures in their hands!<br/><br/>Five thousand connate numinous treasures could allow the experts of the Dragon Palace to cultivate their own powerful dragon balls!<br/><br/>In the following month, Wang Xian continued to conduct transactions in the trading ground!<br/><br/>However, as time passed, the number of transactions became fewer and fewer!<br/><br/>In the invincible zone, there were a limited number of experts. Basically, those who were able to get the news had already rushed over!<br/><br/>Meanwhile, Wang Xian had sold about 1,200 serval fruits. The number of innate spiritual treasures had also reached 6,000!<br/><br/>“There are fewer and fewer experts buying now.”<br/><br/>On the last day, Wang Xian stayed for a day and only one expert came to buy!<br/><br/>He had basically reached his saturation point!<br/><br/>“It’s time to go somewhere else!”<br/><br/>He swept his gaze across the surroundings and muttered to himself!<br/><br/>The transaction of the fruits was just an accident. Now, he had to proceed according to the original plan!<br/><br/>His body moved and he flew straight out!<br/><br/>“The transaction is completed. If you want to purchase the fruits in the future, you can forget about buying them in small quantities. If there are more than twenty of them, you can contact the AI in the Universe!”<br/><br/>Wang Xian’s clone said and flew in a direction!<br/><br/>“HMM?”<br/><br/>“How many fruits does the Dragon King still have? He has sold at least a thousand of them in the past month!”<br/><br/>“This Dragon King must have a powerful fruit tree. This fruit tree has a great effect on those top-notch experts. This time, the Dragon King has obtained a lot of innate spiritual treasures. He has made a huge profit!”<br/><br/>“The Connate Numinous Treasures he has obtained this time are worth at least four to five connate Numinous Treasures!”<br/><br/>In the trading ground, a group of old monsters and their subordinates were discussing when they saw Wang Xian leave!<br/><br/>“There’s the Dragon King’s aura on it. We should be able to find him through this!”<br/><br/>At a spot around the trading ground, an old monster looked at the evergreen fruit in his hand. He looked at his companions and said!<br/><br/>A few of his companions nodded.<br/><br/>“Let’s go to the domain of the desolate beasts and space behemoths. Wu Sha, are you familiar with the domain on the other side?”<br/><br/>At the same time, at a spot not far away from the trading ground, Wang Xian saw his clone returning and asked the old witch, Wu Sha!<br/><br/>“Dragon King, the domain of the space behemoths and desolate beasts is deep inside. They are very strong. Many powerful space behemoths are not even a match for me.”<br/><br/>Wu Sha stared at the forest area across the long river and spoke!<br/><br/>“Oh? Even such a powerful space behemoth hasn’t broken through?”<br/><br/>Wang Xian revealed a curious expression!<br/><br/>Powerful space behemoths should be easier for them to break through than the experts of other races!<br/><br/>“Those who have broken through will directly break through the space and leave the invincible region to head to the land of mountains and seas. Those who haven’t broken through will remain in this space!”<br/><br/>Wu Sha said, “The space beasts and desolate beasts in the invincible zone were mostly born from the energy from the bodies of the Dead Space Beasts. After they were born, they didn’t have any races. It was natural selection. Therefore, there was no such thing as a powerful space beast making a breakthrough and leading their own race to leave!”<br/><br/>“Because they were born from the flesh and blood of the space beasts, this also caused them to have some flaws. These flaws make it extremely difficult for them to make a breakthrough. There is a strong competition between the space beasts and desolate beasts. They might even kill and devour each other!”<br/><br/>Wang Xian nodded slightly when he heard Wu Sha’s introduction.<br/><br/>The space beasts and desolate beasts across the long river basically had no tribes. This was especially so for the space beasts. They fought on their own!<br/><br/>“There are strong tribes of the desolate beasts. Their strength is also relatively strong.”<br/><br/>Wu Sha added another sentence!<br/><br/>“Alright, do you know the location of the desolate beasts? Let’s go and hunt them!”<br/><br/>Wang Xian asked her!<br/><br/>“I know a little!”<br/><br/>Wu Sha nodded. Her body moved and she led the way towards the territory of the desolate beasts!<br/><br/>They came to the other side of the long river. The surrounding lush trees were growing. Unlike the old monsters in the universe, this place was filled with vitality!<br/><br/>“Dragon King, in that direction, about a day’s flying distance, there is a species of floating wood-winged birds. This species has a relatively large number, reaching about five thousand. However, their strength is at the level of a level two universe overlord. This is the limit of their bloodline growth!”<br/><br/>Wu Sha pointed in a direction and introduced to Wang Xian!<br/><br/>“More than 5,000 level two universe overlord desolate beast species?”<br/><br/>Upon hearing her words, Wang Xian’s eyes lit up!<br/><br/>What kind of concept was this?<br/><br/>If they could kill all of them, the Dragon Palace could increase the combat strength of more than 5,000 universe overlords!<br/><br/>The value was not too crazy!<br/><br/>“The floating wood wing birds are a race of desolate beasts. They are weak, but there are many of them. If you provoke one of them, you will be surrounded and attacked. If more than 5,000 of them attack me at the same time, I might even be killed by them at my peak. That’s why no one in the invincible region dares to provoke these guys!”<br/><br/>Wu Sha continued!<br/><br/>The quantitative change caused the qualitative change. More than 5,000 floating wood wing birds with level 2 combat power of universe rulers could be instantly killed by real universe rulers!<br/><br/>Even a mad demon wouldn’t dare to provoke them!<br/><br/>“More than 5,000 of them are indeed very strong.”<br/><br/>Wang Xian mumbled. If he didn’t have the witch gauze, he wouldn’t dare to provoke such a group of desolate beasts!<br/><br/>However, with the witch gauze, Wang Xian was confident that he could kill them all!<br/><br/>“Let’s go, let’s increase our speed!”<br/><br/>The prieless sacred wings flapped and enveloped the witch gauze. Wang Xian brought her along and flew towards the direction of the driftwood winged birds!<br/><br/>With his speed, Wang Xian arrived in front of the floating wooden winged birds in less than a day!<br/><br/>“Dragon King, over here. I will set up a formation here. You Go and attract them over. If we join forces, we will definitely be able to destroy them!”<br/><br/>The old witch witch gauze scanned her surroundings and said to Wang Xian!<br/><br/>“Alright!”<br/><br/>Wang Xian nodded. His eyes were filled with excitement!\t\t\t\t\t\t</div>", "images": {}, "success": true}