{"id": 680, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073261.html", "title": "Chapter 3671 - 3671 3670 Space Beasts, Under The Demon Breaker", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3671 - 3671 3670 Space Beasts, Under The Demon Breaker</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3671 3670 space beasts, under the demon breaker<br/><br/>“Boom! Boom!”<br/><br/>When Wang Xian flew straight ahead, the powerful force caused everyone’s expression to change slightly.<br/><br/>More than a hundred demon breaker suddenly felt a terrifying force charging towards them. Their expressions changed drastically.<br/><br/>“Who is it!”<br/><br/>They looked over hurriedly. Their faces were filled with a solemn expression.<br/><br/>Such a terrifying force was even more terrifying than the lava space beast they were fighting against!<br/><br/>“I want this lava space beast. All of you, leave immediately!”<br/><br/>Wang Xian flew straight ahead and swept his gaze across all of the powerhouses.<br/><br/>“Huh?”<br/><br/>“Retreat and get out of the Lava Space Beast’s attack range!”<br/><br/>“It’s the Dragon King! It’s the Dragon King from the Dragon Palace!”<br/><br/>The powerhouses from the Demon Breaker faction glanced at Wang Xian and shouted loudly!<br/><br/>All of them hurriedly retreated to prevent the lava space beast from attacking them.<br/><br/>At the same time, all of them had ugly expressions on their faces.<br/><br/>They were very strong and even had the confidence to kill this lava space beast.<br/><br/>However, the Dragon King who had suddenly appeared was even stronger.<br/><br/>It seemed that the old witch had already been killed by him.<br/><br/>The old witch was an extremely terrifying existence.<br/><br/>Even the Lord in their demon Breaker Circle didn’t dare to say that he could defeat the old witch.<br/><br/>More than a hundred demon breakers retreated out of the Lava Space Beast’s attack range and looked at Wang Xian with an embarrassed expression.<br/><br/>“Dragon King, what do you mean by this?”<br/><br/>An old man with an illusory palace above his head asked Wang Xian with a sullen face.<br/><br/>“I want this lava beast. All of you, leave this place immediately. Otherwise, don’t blame me for being impolite!”<br/><br/>Wang Xian swept his gaze across all the experts and replied indifferently.<br/><br/>“You… Dragon King, this lava beast is ours. We will lock onto it first.”<br/><br/>The old man who was in the illusory palace above his head had a solemn expression as he spoke!<br/><br/>“That’s right, Dragon King. We are not afraid of you since we are in the circle of Demon Breakers.”<br/><br/>A divine tiger who was sitting opposite the old man stared at Wang Xian and shouted.<br/><br/>“Hehe!”<br/><br/>Wang Xian smiled. With a move of his palm, a five elements millstone appeared in his hand.<br/><br/>On the five elements millstone, waves of terrifying aura swept across the surroundings.<br/><br/>“You guys didn’t provoke me, so I won’t fight with you. Leave this place within ten seconds!”<br/><br/>Wang Xian warned them lightly.<br/><br/>“What… What kind of treasure is that? Why is its aura so terrifying?”<br/><br/>“Let’s go. We Aren’t his match. He can kill the Mad Demon Prohibition. Old Witch, our strength isn’t something we can fight against.”<br/><br/>The expressions of the one hundred demon breaker changed drastically. They looked at each other and said in a low voice.<br/><br/>They glanced at the lava space beast with an unwilling expression. Then, they moved and retreated backward!<br/><br/>“Roar! Roar! Roar!”<br/><br/>When the Space Beast saw the group of people who were attacking him escaping, it roared furiously and stared at Wang Xian.<br/><br/>His eyes were filled with a brutal expression!<br/><br/>“Roar! Roar!”<br/><br/>He waved his arm and numerous huge meteorites smashed toward Wang Xian!<br/><br/>“Hehe, Demon Breaker, it’s best if you guys don’t have any plans. Get lost immediately.”<br/><br/>Wang Xian shouted in a low voice. With a move of his body, he attacked the lava space beast directly!<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>At the rear, the group of Demon Breaker flew back rapidly. Each and every one of them looked extremely embarrassed.<br/><br/>“The hunting plan that we have been planning for more than a hundred years was actually destroyed by the Dragon King. Once we kill this lava space beast, we will be able to improve greatly. I’m not willing to accept this!”<br/><br/>A fire attribute expert, whose face was filled with anger, roared in a low voice!<br/><br/>The expressions of the dozens of fire attribute experts beside him also changed.<br/><br/>“Why don’t we wait for him to kill the lava space beast before attacking him?”? The Lava Space Beast was very powerful. Even if the Dragon King could kill it, it would consume a large amount of energy. When the time came, we might be able to kill the Dragon King. Moreover, the Dragon King had a large number of treasures in his hands. If we were able to obtain them… ”…”<br/><br/>A fire phoenix flapped its wings and said with eyes full of killing intent!<br/><br/>His words caused the eyes of more than a hundred experts to freeze slightly.<br/><br/>“No, it’s too risky. The other party is an expert who can easily kill the Mad Devil Prohibition.”<br/><br/>An elder shook his head and objected.<br/><br/>“The Mad Devil Prohibition is not as powerful as the Lava Space Beast. However, if we want to sneak attack the Dragon King, the chances of success are too small.”<br/><br/>An expert from the Divine Tiger clan beside him shook his head.<br/><br/>“Are we just going to let go of our plan that has lasted for hundreds of years? For this plan, we have paid a huge price and prepared a lot of treasures.”<br/><br/>A fire attribute expert continued to speak unwillingly!<br/><br/>“Please report this matter to Lord Jin Hu. Lord Jin Hu has already reserved the heart of the Lava Space Beast!”<br/><br/>The experts of the Divine Tiger Clan said!<br/><br/>“Lord Jin Xu has just obtained more than 80 normal birth fruits. He should be stabilizing his mind now and might not be able to contact him.”<br/><br/>“Let’s give it a try!”<br/><br/>More than 100 experts of the demon breaker circle floated in the void and waited quietly.<br/><br/>They were very unwilling to have their prey snatched away by the Dragon King!<br/><br/>In their circle, there were mad demon level warriors guarding it, other than the mad demon level warriors, there were also two peak level existences!<br/><br/>With their strength, no power dared to provoke them.<br/><br/>Even the other Pinnacle Race’s circle, within the invincible region, had to fear them a little!<br/><br/>“HM? Lord Jin Yu has replied?”<br/><br/>The illusory palace’s old man above said, his face full of shock as he looked at the information on the Universe AI.<br/><br/>“What’s Wrong?”<br/><br/>The group of warriors stared at him.<br/><br/>“The golden bird is rushing towards us, it didn’t say what happened!”<br/><br/>The old man said to them.<br/><br/>“HM?”<br/><br/>His words made the surrounding 100 warriors look shocked!<br/><br/>“Hong Hong!”<br/><br/>At the same time, in a palace on the other side of the river, a figure was flying towards the other side of the river at a terrifying speed!<br/><br/>This figure had a pair of golden-blue wings that were shining with stars!<br/><br/>He had a tail that looked like a bee, and his tail had sharp thorns!<br/><br/>His body was similar to a human’s.<br/><br/>His pupils were like bees, and there were many golden spots in them.<br/><br/>At this moment, his pupils were shining with golden light!<br/><br/>“After digesting more than 80 fruits, I can temporarily suppress my mind. There won’t be any problems for at least 10,000,000 years<br/><br/>“In such a state, my mind is clear, and I even have a vague breakthrough method. If I can absorb enough fruits, I might be able to complete the breakthrough and never lose my mind again<br/><br/>“Normal fruit!”<br/><br/>“Normal fruit!”<br/><br/>Growls came out of his mouth!\t\t\t\t\t\t</div>", "images": {}, "success": true}