{"id": 688, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073277.html", "title": "Chapter 3679 - 3679 2678 Sensational News About The Crazy Golden Demon Before His Death", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3679 - 3679 2678 Sensational News About The Crazy Golden Demon Before His Death</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3679 2678 sensational news about the crazy golden demon before his death<br/><br/>“It’s the Dragon King!”<br/><br/>An lie appeared in front of Wang Xian and the rest and nodded respectfully!<br/><br/>Although an lie was very weak, teleporting into such a place was absolutely terrifying!<br/><br/>He had never encountered a place that could trap an lie!<br/><br/>An lie swept his gaze around and looked at the tai chi dragon plate around him. A smile appeared on his face. With a move of his body, he disappeared instantly!<br/><br/>Wang Xian stood in the void and waited quietly!<br/><br/>An lie entered a space in the dilapidated divine kingdom. He scanned his surroundings and disappeared instantly!<br/><br/>Soon, he came to a space filled with divine kingdoms. When he saw the large number of divine kingdoms inside, his eyes lit up!<br/><br/>Buzz<br/><br/>“Dragon King, I’ve found it!”<br/><br/>The next moment, an lie came to Wang Xian’s side and reported to him!<br/><br/>“Alright, Bring Us There!”<br/><br/>Wang Xian smiled!<br/><br/>This crazy golden crow and the rest must have relied on the strong defense here and thought that they couldn’t break through. Therefore, they didn’t leave!<br/><br/>However, they didn’t expect that there would be such a strange existence like an lie!<br/><br/>Buzz<br/><br/>Wang Xian and Wu Sha were enveloped by an lie. Their vision changed and huge divine kingdoms appeared in their line of sight!<br/><br/>Looking at these divine kingdoms, Wang Xian’s eyes were filled with excitement!<br/><br/>There were more than 150 divine kingdoms. Each divine kingdom contained a powerful energy!<br/><br/>This was the lair of the Invincible Zone’s powerhouses. They had all their treasures and resources!<br/><br/>“Hehe, there are still nine of them left Alive!”<br/><br/>Through Wang Xian’s senses, his eyes were glowing. He moved and attacked the nine powerhouses directly!<br/><br/>These nine powerhouses were all gathered together!<br/><br/>In the middle of the powerful divine kingdom!<br/><br/>“Huff! Huff!”<br/><br/>At this moment, the Mad Demon Jin Xu and the eight powerhouses who were resurrected with life-saving treasures did not sense the arrival of Wang Xian and the rest!<br/><br/>At this moment, they were standing in the main hall of the Mad Demon Jin Xu’s Divine Kingdom. Their breathing was somewhat hot as they stared in front of them!<br/><br/>In front of them, more than half of the treasures in the main hall were piled up!<br/><br/>There were all sorts of divine grass divine kingdoms, powerful books, desolate beast space behemoths’bodies and bones, and powerful connate numinous treasures!<br/><br/>There were so many that it was terrifying!<br/><br/>They gathered the treasures of more than a hundred experts together.<br/><br/>This was only a portion. There were still a portion of the divine trees and divine grass that were still growing in the divine kingdoms!<br/><br/>They did not take them over!<br/><br/>These treasures could help them recover their strength quickly and return them to their peak!<br/><br/>In fact, these treasures could even help them improve!<br/><br/>Their breathing was a little hurried and they were a little excited!<br/><br/>Maybe this time, they could benefit from this disaster!<br/><br/>“Distribute the treasures that can help you recover first. After you recover your strength, use these treasures to increase your strength again. As long as we recover to our peak, we will take revenge on the Dragon King of the Dragon Palace. We are not his match, but as long as we keep an eye on the disciple of the Dragon Palace, it will be enough!”<br/><br/>The Mad Demon Jin Yu stared at them and said!<br/><br/>“It’s Lord Jin Yu!”<br/><br/>Everyone nodded respectfully, their eyes burning!<br/><br/>“Boom!”<br/><br/>However, at this moment, the entire divine kingdom suddenly trembled!<br/><br/>“What?”<br/><br/>The sudden trembling of the mad demon Jin Yu’s divine kingdom caused all the experts to be slightly stunned, their faces filled with astonishment!<br/><br/>“Not good, someone is breaking into my God kingdom. How is this possible?”<br/><br/>The Demon God kingdom’s eyes widened as he roared in disbelief!<br/><br/>He could clearly sense a terrifying power invading!<br/><br/>His god Kingdom could not withstand this power!<br/><br/>“Hehe, Old Thing from the Demon Breaker Circle, after attacking me, you still want to deal with our Dragon Palace? Go To Hell!”<br/><br/>Crack! Crack! Crack<br/><br/>At this moment, a sound that sounded like the shattering of the Void was heard. A hole was torn in the Divine Kingdom of Jin Gui!<br/><br/>Wang Xian’s figure appeared in their line of sight!<br/><br/>His body contained a terrifying dragon’s might as he swept toward them!<br/><br/>This dragon’s might was enough to kill a level two master of the universe!<br/><br/>“It’s the Dragon King. How is this possible? How could he enter the core of the ancient Hengxu Divine Kingdom? How is this possible?”<br/><br/>Crazy Demon and the eight experts stared at this scene in disbelief and despair!<br/><br/>Wang Xian’s draconic aura swept across. The entire Crazy Demon’s divine kingdom was trembling, trying to resist the power of the draconic aura!<br/><br/>“It’s over!”<br/><br/>At this moment, crazy demon felt the power of the draconic aura. His eyes were filled with dead ashes!<br/><br/>However, at this moment, his eyes suddenly widened again. He stared at the familiar figure beside Wang Xian in shock!<br/><br/>“How is this possible? Old Witch, it’s You!”<br/><br/>He roared in disbelief!<br/><br/>The old witch was actually standing beside the Dragon King. This? ?<br/><br/>What was going on?<br/><br/>“Trying to kill the Dragon King, you’re really courting death!”<br/><br/>The old witch stared at Crazy Demon Jin Xu and said expressionlessly!<br/><br/>Crazy Demon Jin Yu’s body trembled violently and his eyes slowly turned blood red!<br/><br/>“Ahhhhh!”<br/><br/>At this moment, the eight subordinates in front of him were swept by the dragon’s might and their bodies quickly collapsed. They knelt on the ground and their life force quickly disappeared!<br/><br/>“Ahhhhh!”<br/><br/>When he saw this scene, his expression changed drastically and the dragon’s might rushed towards his body!<br/><br/>“Die!”Crazy Demon roared crazily, resisting.<br/><br/>His expression became savage, and he instantly took out the universe AI and sent out a message!<br/><br/>“A large amount of normal birth fruits can allow a top level great being and crazy demon to directly break through their shackles and break through to the universe ruler realm.”<br/><br/>His body started to crumble, but before he died, he still released this news!<br/><br/>A large number of normal birth fruits could help top-tier experts and crazy demons break through!<br/><br/>The main reason he sent out this news was to cause trouble for the Dragon King!<br/><br/>They even hoped that some experts had the strength to kill the Dragon King!<br/><br/>Even if he knew that the probability was very small!<br/><br/>But this was the only thing he could do before he died!<br/><br/>He wasn’t willing to die just like that.<br/><br/>He wanted to give the Dragon King a huge trouble!<br/><br/>Once this news was spread, he knew that many mad demons and old monsters in the invincible zone wouldn’t be able to sit still!<br/><br/>They would definitely think of ways to obtain a large number of normal birth fruits!<br/><br/>This was a conspiracy!<br/><br/>However, this news wasn’t fake!<br/><br/>If the mad demons obtained enough normal birth fruits, they would be able to make a 100% breakthrough!<br/><br/>Meanwhile, the top experts of the invincible zone would have a chance to achieve a breakthrough if they obtained a sufficient number of normal birth fruits!<br/><br/>“Bang!”<br/><br/>After he sent the message, he collapsed to the ground without any signs of life!<br/><br/>This time, he was completely dead!<br/><br/>“Hehe!”<br/><br/>Wang Xian noticed the small actions of the mad demon, but he didn’t stop him!<br/><br/>He swept his gaze forward with a burning look in his eyes!\t\t\t\t\t\t</div>", "images": {}, "success": true}