{"id": 689, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073279.html", "title": "Chapter 3680 - 3680 The 2679 Invincible Zone Was Shaken", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3680 - 3680 The 2679 Invincible Zone Was Shaken</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3680 The 2679 Invincible Zone was shaken<br/><br/>Treasures, a large number of treasures!<br/><br/>Wang Xian stared at the treasures in the hall with a fiery look in his eyes!<br/><br/>Such a large number of treasures were a huge amount of resources to Wang Xian!<br/><br/>Some of the medicinal pills, divine fruits, divine herbs, and the like were also able to strengthen the huge amount of dragon qi after he consumed them!<br/><br/>“Whoosh!”<br/><br/>He moved his palm and kept all the treasures.<br/><br/>He moved his body and began to check the treasures in the Golden Crazed Demon’s divine kingdom!<br/><br/>From the Golden Crazed Demon’s divine kingdom, Wang Xian had obtained many precious treasures!<br/><br/>Just the number of divine trees and herbs planted in the golden crazed demon’s divine kingdom numbered in the tens of thousands!<br/><br/>Furthermore, each level was extremely high!<br/><br/>An existence at the level of a crazed demon was already far stronger than a level one universe overlord!<br/><br/>His entire life’s collection was a huge number!<br/><br/>After searching around the golden crazed demon god country, he immediately went to the neighboring countries of the gods!<br/><br/>From these countries, Wang Xian also found a large number of divine trees and herbs!<br/><br/>Some of the divine trees were already at the level of a universe overlord, but there were no fruits on them yet!<br/><br/>Many of the powerhouses in the Demon Breaker’s circle were from the top races. They had all kinds of collections and items, as well as many precious treasures!<br/><br/>It took Wang Xian more than two hours to go through all the divine kingdoms. He kept all the medicinal pills, divine fruits, and other resources that he could use.<br/><br/>The rest were all sent to the Dragon Palace!<br/><br/>This time, the improvement of the devouring dragon was a little too much!<br/><br/>“Dragon King, before Jin Gui died, he sent out a piece of news. This news caused quite a stir in the invincible zone. You may need to be more careful from now on!”<br/><br/>After Wang Xian finished dealing with all the divine kingdoms, Wu Sha flew over and reported to him!<br/><br/>“Oh?”<br/><br/>Wang Xian raised his eyebrows and immediately took out the universal ai!<br/><br/>He had witnessed the little actions of the Mad Demon Jin Gui before he died!<br/><br/>He opened the universal AI and searched it. Very soon, he narrowed his eyes and the corners of his mouth curled up slightly!<br/><br/>Looking at his message, a faint smile appeared on Wang Xian’s face!<br/><br/>“Hehe, it was said that consuming a large number of normal birth fruits could help the mad demon achieve a breakthrough. This is indeed the case.”<br/><br/>Wang Xian said with a smile.<br/><br/>The actions of the crazy demon Golden Crow were very obvious!<br/><br/>He had gotten the experts from the Invincible Zone to surround and kill Wang Xian and snatch the treasures!<br/><br/>However, Wang Xian was not nervous at all. Instead, he was happy to see this!<br/><br/>It was very difficult for the crazy demon to join forces. Without the help of the crazy demon, he and Wu Sha would have no fear at all.<br/><br/>On the contrary, as long as there were experts who dared to target him, Wang Xian would definitely let them know what despair was!<br/><br/>“I’ll cultivate for a period of time first. Wu Sha, go and look for the location of that water demon. See if you can find him. Inform me immediately after you find him!”<br/><br/>Wang Xian looked at Wu Sha and instructed her!<br/><br/>This time, there was another water demon who came to surround and kill him.<br/><br/>It was an existence on the level of a crazy demon!<br/><br/>Wang Xian was prepared to find and destroy the water demon!<br/><br/>Since an old monster had attacked him, he would retaliate fiercely!<br/><br/>“It’s the Dragon King!”<br/><br/>Wu Sha nodded her head. After mastering the method to enter and exit the ancient Divine Kingdom of Hengxu, she left immediately!<br/><br/>Wang Xian didn’t leave immediately. He took out the resources he had obtained this time and began to devour them, converting them into Dragon Qi!<br/><br/>The harvest this time was too huge. He guessed that it could increase his strength by at least 70-80% .<br/><br/>It would only increase his strength by 20-30% !<br/><br/>“HMM? What’s going on? Why did the mad demon Golden Crow suddenly send such a message? He actually said that as long as there are enough fruits, the mad demon and top-tier experts would be able to break through the shackles?”<br/><br/>“Is this true? Why did the Mad Demon Golden Crow suddenly announce this?”<br/><br/>“What happened? is what crazy demon Jin Xu said true or false?”<br/><br/>When Wang Xian began to devour the resources and Wu Sha was searching for water demon in the long river, this piece of news about crazy demon Jin Xu caused a stir in the invincible zone!<br/><br/>Recently, the Invincible Zone had become much livelier due to the arrival of the Dragon King!<br/><br/>Now that a crazy demon had suddenly sent such a piece of news, many of the old monsters were shocked!<br/><br/>The words of crazy demon Jin Yu were still believable!<br/><br/>After all, he was a well-known existence in the entire invincible region!<br/><br/>The crazy demon among the old monsters, the strongest person in the circle of the strongest force in the invincible region, the demon breaker.<br/><br/>No matter what kind of identity it was, it was enough to prove the authenticity of crazy demon Jin Yu’s message!<br/><br/>In particular, in the invincible region, many old monsters had consumed the common embryo fruit, which indeed had great benefits!<br/><br/>This made them believe that the information about Jin Yu Mad Demon was not fabricated!<br/><br/>A piece of information that could make a great being achieve a breakthrough really shocked the invincible region!<br/><br/>The ultimate goal of every old monster in the invincible region was to achieve a breakthrough and become a universe master!<br/><br/>Now that there was such a chance, no great being was willing to give it up!<br/><br/>Especially for the top-tier experts in the invincible region, as well as those crazy demons!<br/><br/>“Crazy demons and top-tier experts can break through after consuming a large number of normal birth fruits. How many normal birth fruits does this require? Furthermore, the price of this divine fruit sold by the Dragon King is too high. It’s a complete rip-off!”<br/><br/>“That Dragon King should still have a lot of normal birth fruits. He said that if you want to buy them, you can contact him on the universe AI.”<br/><br/>“Too expensive, too expensive. If he wants more than 100 fruits, doesn’t that mean he has to trade with innate true treasures? Not every mad demon level existence has innate true treasures!”<br/><br/>Some of the old monsters were excited and excited!<br/><br/>This was the only way they had been able to break through their shackles for more than 10 billion years!<br/><br/>However, when they thought about the value of consuming the common fruit, they felt uncomfortable!<br/><br/>The price was too high!<br/><br/>Within 100 pieces, the top-tier old monsters in the invincible zone could exchange for it through gritted teeth. However, if they needed more than 100 pieces, then they wouldn’t have so many resources!<br/><br/>“HMM? Why did Crazy Demon Jin Yu suddenly announce this news? Does he have a grudge with the Dragon King? No matter what, we can add fuel to the fire and ignite it in the Invincible Zone!”<br/><br/>“That’s right. Now, we can basically lock onto the Dragon King’s position in the depths. If a large number of experts are tempted and a powerful mad demon attacks the Dragon King at the same time, perhaps the Dragon King will be killed without US taking Action!”<br/><br/>“Keep an eye on the Dragon King. Right now, the Dragon King is in high demand. There will definitely be a large number of experts eyeing him. If the Dragon King is killed by other mad demon experts, we have to get his body, or his flesh and blood, and hand it over to the third Prince!”<br/><br/>“I think it’s best if that Dragon King is seriously injured. We should suppress him and obtain those fruits.”<br/><br/>At the same time, at a certain place in the depths of the invincible zone, more than ten angels were discussing.<br/><br/>In front of them, there was a strange long-nosed demonic beast and a huge demonic beast with two eyes!<br/><br/>They had been tracking the figure of Wang Xian.\t\t\t\t\t\t</div>", "images": {}, "success": true}