{"id": 682, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073265.html", "title": "Chapter 3673 - 3673 3672 Launched A Surprise Attack", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3673 - 3673 3672 Launched A Surprise Attack</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3673 3672 launched a surprise attack<br/><br/>Whoosh<br/><br/>In the invincible zone, the water demon and the Golden Crow were flying towards the depths at a rapid speed!<br/><br/>Boom! Boom<br/><br/>At this very moment, at the position of the Lava Space Beast, Wang Xian and the lava space beast were engaged in a battle!<br/><br/>The Lava Space Beast was extremely powerful and had a terrifying physique!<br/><br/>However, Wang Xian relied on his advantage in speed to render the lava space beast completely defenseless!<br/><br/>“Dragon King, the more than 100 demon breaker experts have not left. They are standing in the void in front of us. I don’t know what they are planning!”<br/><br/>At this moment, a voice was transmitted into Wang Xian’s mind!<br/><br/>“Oh?”<br/><br/>When Wang Xian heard Wu Sha’s voice transmission, he raised his eyebrows slightly!<br/><br/>The main reason why he did not let Wu Sha make a move was because he wanted Wu sha to be on guard around him!<br/><br/>He didn’t have the intention to harm anyone, but he had to be on guard!<br/><br/>The hundred odd old monsters were very strong. Wang Xian wanted to prevent them from launching a sneak attack!<br/><br/>Of course, if they really launched a sneak attack, he would be happy to see it!<br/><br/>At that time, he would kill them all!<br/><br/>However, he was also curious about the fact that the hundred odd old monsters of the Demon Breaker didn’t leave!<br/><br/>Although they were very powerful, it was impossible for them to deal with him!<br/><br/>The news of him killing the mad demon restriction and even the experts speculating that the old witch had been killed by him had spread throughout the invincible region!<br/><br/>As long as one had a little bit of intelligence, they would be able to guess his strength. He was definitely not someone that a mad demon level expert could deal with!<br/><br/>He was not a lava space beast!<br/><br/>“Wu Sha, monitor them carefully. Also, set up some formations on the right side to prevent any special situations!”<br/><br/>Wang Xian’s eyes flickered as he ordered Wu Sha!<br/><br/>At the moment, no one knew about Wang Xian’s trump card!<br/><br/>However, his biggest trump card was Wu Sha!<br/><br/>Wu Sha was an existence on the level of a mad demon!<br/><br/>Furthermore, she was a Magus!<br/><br/>She was currently hiding in the dark. If there were really experts with ulterior motives who wanted to deal with Wang Xian, Wu Sha’s trump card would definitely be a terrifying existence!<br/><br/>Not many experts in the invincible region could withstand a trump card on the level of a mad demon!<br/><br/>“Yes!”<br/><br/>Wu Sha’s voice was heard!<br/><br/>“I want to see what kind of conspiracy you guys have!”<br/><br/>Wang Xian’s eyes flickered as he looked at the lava space behemoth in front of him. He decided to kill it slowly and preserve his trump card!<br/><br/>After all, the outside world didn’t know his full strength and trump card!<br/><br/>Slowing down the speed of killing the lava space behemoth would also give the group of Demon Breakers an illusion!<br/><br/>It was not an illusion that he was very strong!<br/><br/>Wang Xian could have killed the lava space behemoth in less than ten minutes, but he dragged it out forcefully.<br/><br/>“The battle over there is still ongoing. I don’t know the exact situation. Jiu Tong, go and check it out and see what the current situation is like.”<br/><br/>Time passed by minute by minute. An hour later, the powerful divine tiger spoke to an old monster!<br/><br/>“Alright, add some concealment spells and formations to my body. The Dragon King is too powerful, I’m afraid I’ll be discovered!”<br/><br/>Nine eyes nodded, his gaze sweeping the surroundings!<br/><br/>“Alright, with our formations covering you, the Dragon King won’t be able to discover you when he’s fighting against the Lava Space Beast. Furthermore, nine eyes, the distance your pupils can penetrate is very far!”<br/><br/>The magi nodded and immediately covered nine eyes with the formation!<br/><br/>Nine Eyes, an old monster beast!<br/><br/>With four claws, he could lie on the ground or stand up straight!<br/><br/>His powerful talent was his eye-bloodline technique!<br/><br/>On his face, there were nine eyes, nine eyes arranged in three rows!<br/><br/>Every time he opened his eyes, he would be able to unleash an even more powerful eye-bloodline technique!<br/><br/>At the same time, he was also conducting an investigation that the other old monsters could not compare to!<br/><br/>Nine Eyes’body was covered in a formation. His body moved and he crouched down, flying towards the direction of the battle!<br/><br/>They were not very far from the location of the battlefield. Very soon, he arrived near the aftermath of the battle!<br/><br/>He crouched there, and the eyes on his face slowly opened!<br/><br/>His deep pupils were emitting a bright power that dispelled all the obstacles.<br/><br/>The scene of Wang Xian fighting with the lava space beast was clearly transmitted into his pupils!<br/><br/>“This Dragon King is indeed powerful. His powerful speed is completely suppressing the lava space beast. His defense is extremely terrifying. From the looks of it, he should be able to kill the lava space beast easily!”<br/><br/>Nine eyes stared at Wang Xian who was fighting against the lava space beast as he muttered.<br/><br/>It was just as they had imagined. This Dragon King was very strong!<br/><br/>However, he was not strong enough to easily kill a crazy demon.<br/><br/>Furthermore, he had to fight against the Lava Space Beast for an hour before he was injured so much. That Dragon King was not truly invincible!<br/><br/>Buzz<br/><br/>His nine pupils flickered slightly. The scene of the battle was completely sealed in his pupils!<br/><br/>“Dragon King, there’s an expert from the demon breaker circle watching the battle on your side. Do you want me to go over and destroy him?”<br/><br/>Wang Xian, who was in the middle of the battle, heard Wu Sha’s voice transmission again!<br/><br/>“There’s no need. Let him monitor!”<br/><br/>Wang Xian replied immediately!<br/><br/>“Yes!”<br/><br/>Wu Sha replied. Her eyes flickered slightly as she continued to set up the formation in the surroundings!<br/><br/>After observing the battle for more than ten minutes, nine eyes moved his body and flew backward!<br/><br/>“How is the battle between the Dragon King and the lava space behemoth going now?”<br/><br/>When nine eyes arrived, more than a hundred experts from the Demon Breaker Circle immediately asked.<br/><br/>“You guys see for yourselves. I think it’s within our guesses!”<br/><br/>Jiu Tong’s pupils emitted a luster, completely displaying the battle scene just now!<br/><br/>“Oh?”<br/><br/>Looking at the battle displayed on the screen, the eyes of the old monsters flickered!<br/><br/>“Completely suppressing that lava space behemoth. Its speed is extremely terrifying, but its attack power seems to be much weaker. I think its strength is slightly lower than what we expected!”<br/><br/>“We guessed that his fighting strength is comparable to three mad demons. Now it seems that he should have used his other trump cards.”<br/><br/>“I think that even if he used his trump cards, he would at most be comparable to two and a half mad demons. However, this Dragon King should have a lot of innate supreme treasures. After all, his dragon palace once auctioned off innate supreme treasures!”<br/><br/>More than a hundred experts looked at the battle scene and guessed!<br/><br/>Although they were already very powerful, they were not as invincible as they had imagined!<br/><br/>“Lord Jin Yu will arrive in an hour. When he arrives, tell Lord Jin Yu about the situation!”<br/><br/>The old man in the illusory palace above said at this time!<br/><br/>The other old monsters nodded!<br/><br/>“Hualala!”<br/><br/>An hour passed very quickly. At the position behind them, a small river flew over at a terrifying speed!<br/><br/>In the small river, Jin Jin stood quietly inside!<br/><br/>“We’re Here!”<br/><br/>He looked ahead, his eyes shining!\t\t\t\t\t\t</div>", "images": {}, "success": true}