{"id": 683, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073267.html", "title": "Chapter 3674 - 3674 3673 Ambushed Them", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3674 - 3674 3673 Ambushed Them</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3674 3673 ambushed them<br/><br/>“Greetings, Lord Jin Hu!”<br/><br/>“Greetings, Lord Jin Hu!”<br/><br/>When Jin Hu and the water demon arrived, the demon Slayer and the other experts saw them and immediately bowed to Jin Hu!<br/><br/>Jin Hu was the strongest expert in the demon Slayer’s circle, and he was also a mad demon from the Invincible Zone!<br/><br/>“En!”<br/><br/>Jin Hu nodded at them.<br/><br/>“Hua La!”<br/><br/>At the side, the water flow slowly condensed into the shape of a human!<br/><br/>“En?”<br/><br/>When the experts in the demon breaker circle saw the figure formed by the water flow, they paused slightly, their faces full of astonishment!<br/><br/>“Water Demon!”<br/><br/>An expert couldn’t help but shout in a low voice.<br/><br/>“It’s water demon, paying respects to Lord Water Demon!”<br/><br/>The eyes of the surrounding experts turned cold, and they hurriedly cupped their hands!<br/><br/>Water demon swept his gaze at them and nodded indifferently!<br/><br/>“This time, I’ve invited water demon over. What’s the situation now?”<br/><br/>Jin Fu looked at them, swept his gaze forward and asked!<br/><br/>From here, they could sense the terrifying battle coming from the depths ahead!<br/><br/>“Lord Jin Fu, the Dragon King is still fighting with that lava space beast. This is a battle scene that I’ve investigated not long ago!”<br/><br/>Nine eyes looked at Jin Yu and said respectfully!<br/><br/>His eyes were shining, and the scene of the battle appeared in front of them once again!<br/><br/>“This dragon king is very strong!”<br/><br/>Water demon stared at the scene. “So strong that he hasn’t broken through to the Universe Dominator realm, yet he still hasn’t lost his mind.”<br/><br/>“That’s because this dragon king has enough ordinary fruits. He regularly takes many ordinary fruits!”<br/><br/>Looking at the screen, Jin Tao replied!<br/><br/>“So, just the Dragon King’s corpse is a treasure to us?”<br/><br/>Water Demon said indifferently.<br/><br/>“It should be of great use to us. From the battle scene, if we join hands, we have the confidence to kill him!”<br/><br/>Jin Tao said with a twinkle in his eyes!<br/><br/>The Dragon King showed great strength, but he felt that he could deal with it!<br/><br/>This place was different from the outside world. If one wanted to kill someone of the same level, they would need at least three experts to surround and attack him!<br/><br/>This was the invincible zone, so it would be difficult for anyone to escape!<br/><br/>As long as one side was slightly stronger than the other side, they would have a chance to kill the other side!<br/><br/>“Then let’s make a move. It would be best if we can capture him alive.”<br/><br/>Water Demon decided without the slightest hesitation!<br/><br/>“Alright!”<br/><br/>Jin Yuan also nodded his head heavily.<br/><br/>He had the same idea, especially after seeing the battle between the Dragon King and the lava space behemoth!<br/><br/>With all the experts working together, they could deal with it!<br/><br/>“Are we going to attack the Dragon King?”<br/><br/>“Destroy the Dragon King? If we have Lord Jin Fu and Lord Water Demon, our chances will be very high!”<br/><br/>“Lord Jin Fu and Lord Water Demon are ready to attack, they must be confident!”<br/><br/>“Kill that Dragon King. He dares to steal our lava space beast. Kill him.”<br/><br/>Hearing their words, the eyes of more than ten experts in the demon breaker circle lit up and said with slight excitement!<br/><br/>“Do we make a move on the Dragon King?”<br/><br/>Some old monsters’eyes flickered slightly!<br/><br/>The Dragon King was very powerful. There was a possibility of him dying when dealing with the Dragon King!<br/><br/>“Get ready to attack the Dragon King. I’ll take the body of the Dragon King and water demon. The Lava Space Beast belongs to you. Those who don’t agree, leave immediately!”<br/><br/>Jin Fu looked at all the experts and said calmly!<br/><br/>The experts in the demon breaker circle looked at each other.<br/><br/>“Kill! If we fight against an expert like the Dragon King, we might even be able to break through in the battle!”<br/><br/>“Haha, that Dragon King is very arrogant. He said that he wants to sweep through the entire invincible region. Then let us demon breakers destroy him!”<br/><br/>“That’s right. After we kill that Dragon King, he dares to snatch our space behemoth? Kill him!”<br/><br/>Soon, the group of experts laughed and said!<br/><br/>They were old monsters of the invincible region. They were not afraid of killing.<br/><br/>They were also not afraid of death at all!<br/><br/>Now, they wanted to kill the Dragon King who had robbed them of their space beast and ruined their plan. No one backed down!<br/><br/>Kill!<br/><br/>Moreover, as long as they killed the Dragon King, the Lava Space Beast would belong to all of them.<br/><br/>A space beast that was comparable to a mad demon was very precious to them!<br/><br/>Especially after Jin Peng didn’t want the heart of the Space Beast!<br/><br/>“Alright, in that case, let’s get ready to attack. In order to prevent the Dragon King from escaping, we will surround him.”<br/><br/>Jin Fu revealed a faint smile on his face as he ordered!<br/><br/>The group of old monsters nodded heavily.<br/><br/>“Be careful. The Dragon King’s speed is very fast. It’s easy for him to attack us one by one!”<br/><br/>The elder from the illusory palace above reminded.<br/><br/>“I’m in the center, Water Demon, Void Temple Immortal, and Bao Hu. I’m in the surroundings, with thirty to forty experts around me, to prevent that Dragon King from decapitating me with his powerful speed, to block his attack, and then suppress him!”<br/><br/>Jin Fu commanded!<br/><br/>“Alright!”<br/><br/>Water Demon didn’t have any objections. Although water demon and Jin Fu were on the same level, water demon was just a clone!<br/><br/>Jin Yu, who was the strongest, was a crazy demon at his peak!<br/><br/>Water Demon didn’t have any objections, so the other experts naturally didn’t have any objections!<br/><br/>Void Temple Immortal and Tiger God were both top-tier experts in the invincible zone. They led thirty to forty experts, which was enough to fight against crazy demon-level experts!<br/><br/>The experts in the demon-breaker circle were all very powerful!<br/><br/>In the invincible zone, they were also above-average existences!<br/><br/>“Surround them bit by bit. Pay attention. Once the Dragon King sees us, attack with full force!”<br/><br/>“That Lava Space Beast will also bring a lot of trouble to the Dragon King. It Won’t be difficult to kill or even suppress the Dragon King this time!”<br/><br/>With a wave of his hand, a golden mountain floated above his head. On top of the Golden Mountain, a special stream of water was rotating!<br/><br/>This Golden Mountain was an innate supreme treasure!<br/><br/>The stream of water on the Golden Mountain was added by Jin Xu. It was also an extremely powerful treasure!<br/><br/>He looked at his surroundings. Water Demon, the immortal from the Void Palace, and Bao Hu all had an innate supreme treasure appearing in front of them!<br/><br/>They slowly approached the front!<br/><br/>“Dragon King, they are approaching. I think they want to make a move on you!”<br/><br/>However, just as they were about to make their move, Wu Sha’s voice was transmitted into Wang Xian’s mind!<br/><br/>“Hehe, as expected!”<br/><br/>A cold smile appeared on Wang Xian’s face. He flapped his incipient saint wings and the five elements millstone smashed heavily onto the head of the Lava Space Beast!<br/><br/>“Roar! Roar! Roar!”<br/><br/>Instantly, the lava space beast let out a blood-curdling scream!<br/><br/>On Wang Xian’s body, there was a long gash!<br/><br/>The Lava Beast’s body fell to the ground, and its vitality quickly disappeared!<br/><br/>On the other hand, Wang Xian’s aura seemed to be much weaker!<br/><br/>“Eh?”<br/><br/>When the experts who were surrounding the lava beast heard the blood-curdling scream of the lava beast, their eyes narrowed slightly!<br/><br/>“Speed up, let’s see what happens first!”<br/><br/>The demon immediately sent a telepathic message to increase his speed!<br/><br/>Facing the Dragon King, he didn’t dare to be too careless!\t\t\t\t\t\t</div>", "images": {}, "success": true}