{"id": 686, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073273.html", "title": "Chapter 3677 - 3677 2676 Destroyed The Magic Breaker’S Circle", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3677 - 3677 2676 Destroyed The Magic Breaker’S Circle</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3677 2676 destroyed the Magic Breaker’s circle<br/><br/>“It’s over, it’s completely over!”<br/><br/>“Why is the Dragon King So Strong? We haven’t even seen the face of this magus hiding in the dark!”<br/><br/>“I don’t have any life-saving treasures, I haven’t broken through yet, I’m Not Willing!”<br/><br/>Bao Hu and the surrounding experts trembled violently, their faces filled with despair.<br/><br/>They looked at the Dragon King who was attacking them and the terrifying five elements grinding. They had no fighting spirit at all!<br/><br/>They could not resist at all!<br/><br/>In fact, they did not even see the Magus who was hiding in the dark!<br/><br/>It was not that they did not see it, but they did not have the chance to see it!<br/><br/>That Magus was obviously behind them, but because they were covered by the spell formation, they could not see the Magus behind them clearly!<br/><br/>Furthermore, the Dragon King had attacked them directly and did not allow them to see clearly!<br/><br/>Therefore, they did not realize that the one who attacked them was the old witch!<br/><br/>If they knew, they would probably be even more desperate!<br/><br/>“Innate techniques, all of you can go to hell!”<br/><br/>Wang Xian shouted softly. All kinds of powerful innate spiritual treasure energy burst out from the five elements millstone and covered them!<br/><br/>At the same time, he moved his body and charged towards Bao Hu directly!<br/><br/>The huge gap in strength made them unable to resist at all!<br/><br/>“We still have a chance. We still have a chance. Let’s Escape!”<br/><br/>The group of powerhouses who were initially following the water demon were the only ones who were not entangled yet.<br/><br/>They fled into the distance with terrified expressions!<br/><br/>“Ahhhh!”<br/><br/>However, the screams from behind continued to ring out.<br/><br/>A top-notch expert from the invincible zone, Bao Hu, was instantly killed!<br/><br/>Wang Xian flapped his wings and chased after them without any hesitation!<br/><br/>With his speed, how could these Old Monsters Dodge?<br/><br/>One by one, the old monsters were killed by Wang Xian easily. In less than ten minutes, all the experts were killed by him!<br/><br/>“Hehe, this is a good harvest!”<br/><br/>After killing more than 150 strong ones in the Demon Breaker Circle and Jin Gui, Wang Xian’s harvest this time was simply too great!<br/><br/>It was an innate treasure, the corpse of a powerful old monster!<br/><br/>There was also the corpse of a space beast!<br/><br/>All of these could bring huge improvements to the Dragon Palace!<br/><br/>“Dragon King, you are really strong. I only used a few formations and you killed all of them!”<br/><br/>Wu Sha flew out from behind and said respectfully and reverently!<br/><br/>Wang Xian’s strength had indeed shocked her greatly!<br/><br/>“It’s alright.”<br/><br/>Wang Xian smiled faintly. “Wu Sha, let’s go. We have to head to the nest of the demon breaker circle immediately. We have to be quick!”<br/><br/>As he spoke, he flapped his incipient saint wings and enveloped the demon breaker circle. Then, he flew out!<br/><br/>He flew out so quickly for the divine kingdom and its treasures!<br/><br/>Whether it was the mad demon Golden Crow or the other old monsters, all their treasures and resources were in their own divine kingdom!<br/><br/>Not to mention the value of the divine kingdom itself, but for other treasures, as the old monsters that had lived for billions of years in the Invincible Zone, would they not have good things?<br/><br/>At the very least, there would be no shortage of valuables like the godly tree god grass!<br/><br/>In fact, there would be a huge number of them!<br/><br/>Their savings, the valuables collected by the ten great beings, should be comparable to that of a powerful high-level race in the outside world!<br/><br/>Furthermore, they were high-level races with the Combat Power of several universe masters at level three!<br/><br/>It was not an exaggeration to say that if they were exterminated and their God country could be obtained, then they would be able to obtain all the valuables of more than a dozen high-level races!<br/><br/>In particular, there would be even more treasures in the Divine Kingdom of the Golden Crow Demon!<br/><br/>In fact, this could even bring a huge amount of dragon energy to Wang Xian. It would be a huge accumulation for his next upgrade!<br/><br/>“Wu Sha, use these corpses to find the location of their divine kingdom!”<br/><br/>Wang Xian passed the corpses to Wu Sha as he flew!<br/><br/>Wizards could use the corpses to find the location of the deceased powerhouses’divine kingdom!<br/><br/>“It’s the Dragon King!”<br/><br/>Wu Sha nodded and immediately opened her mouth to search!<br/><br/>“It’ll take about two hours to fly from here to the outside at my maximum speed!”<br/><br/>Wang Xian stared ahead as he muttered to himself!<br/><br/>This speed was already extremely terrifying!<br/><br/>However, he was a little worried that some of the revived powerhouses who had life-saving means would escape immediately!<br/><br/>This was especially so for Jin Shan. If he were to lead his divine kingdom to escape, he would suffer a great loss!<br/><br/>“Dragon King, from the looks of it, Jin Shan’s divine kingdom should be located in the nest of the Demon Breaker Circle. Many of the divine kingdoms of the Demon Breaker Circle’s experts are located in the same place.”<br/><br/>Not long after, Wu Sha spoke!<br/><br/>The Demon Breaker Circle could be said to be a faction!<br/><br/>A special faction in the Invincible Zone!<br/><br/>They were determined to build a peak race faction!<br/><br/>As a faction, they would naturally place their divine kingdom in their lair!<br/><br/>At least, 80% of the Demon Breaker Circle’s powerhouses were like that!<br/><br/>Wang Xian flew quickly!<br/><br/>“That Dragon King’s strength is so strong, so terrifying!”<br/><br/>“There’s also that formation. There should be a powerful Magus by the Dragon King’s side. Damn it, damn it, my cultivation base, my strength!”<br/><br/>At this moment, in the nest of the Demon Breaker Circle of the Invincible region.<br/><br/>The nest of the Demon Breaker Circle was located at the side of the long river. There, there was an extremely powerful god kingdom embedded in the void crack!<br/><br/>Even after more than 10 billion years, this broken God kingdom already contained powerful power!<br/><br/>This was a broken God kingdom at the universe ruler level, and it was not an ordinary one at the first or second stage of the universe ruler realm!<br/><br/>However, this god country was embedded in the void crack, and there was a void storm surrounding it!<br/><br/>If one wanted to take away this dilapidated god country, one had to deal with this void crack’s storm!<br/><br/>And this terrifying storm could easily kill a universe ruler level two great being!<br/><br/>Within this dilapidated god country, Crazy Jin’s God country was located within!<br/><br/>He stood within the Great Hall of the god country, his body trembling slightly, and his eyes filled with rage!<br/><br/>In just an instant, he had been instantly killed by Dragon King!<br/><br/>Fortunately, he had a life-saving true treasure!<br/><br/>But a life-saving true treasure could only save his life after all. His original body and the energy within his body had been completely lost!<br/><br/>Right now, he only had the power of a level two universe master.<br/><br/>To be able to retain such strength, he was already very strong!<br/><br/>But to recover to his peak, he needed too many resources and treasures!<br/><br/>“I don’t know what will happen to void Temple and the others. I was killed in an instant. Void Temple and the others are no match for the Dragon King, especially since he has a powerful wizard.”<br/><br/>“I didn’t expect to be ambushed by the Dragon King this time. Is there a strong person in the Demon Breaker Circle colluding with the Dragon King, or… ?”<br/><br/>Jin Fu’s expression kept changing!<br/><br/>At this moment, he felt something and quickly looked at a stone tablet in the hall!<br/><br/>When he saw the light spots on the stone tablet dim, his expression changed!\t\t\t\t\t\t</div>", "images": {}, "success": true}