{"id": 695, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073291.html", "title": "Chapter 3686 - 3686 3685 Tamed. Taming In Progress", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3686 - 3686 3685 Tamed. Taming In Progress</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3686 3685 tamed. Taming in progress<br/><br/>“Hades Ghost Avatar, what a powerful Hades Ghost Avatar. Is this the Dragon King’s Hades Ghost Avatar?”<br/><br/>When Wang Xian arrived with Ming shasheng.<br/><br/>Ming Shasheng looked at the four Hades ghost avatars surrounding the demonic wings with a shocked expression on his face!<br/><br/>Hades ghost avatars were unique to their Hades race.<br/><br/>It was also because of Hades ghost avatars that their Hades race was able to rank among the top races in the universe!<br/><br/>However, what shocked him was that the Dragon King also possessed the Netherworld Ghost clone?<br/><br/>The Netherworld Ghost clone was not something that only the netherworld race could refine. There was also the possibility of experts from other races refining it!<br/><br/>However, the probability of this happening was very small. It was less than one in a million!<br/><br/>In addition, only experts with the darkness attribute could refine it!<br/><br/>The Dragon King could actually possess it?<br/><br/>“Hehe!”<br/><br/>Wang Xian smiled faintly. He looked at the demonic wings in front of him and said directly, “Surrender or die. Choose One!”<br/><br/>“Oh no!”<br/><br/>The demonic wings had been suppressed all this while and had no ability to resist at all!<br/><br/>Now that he saw Wang Xian flying over, his expression changed drastically.<br/><br/>When he saw Ming Shasheng standing respectfully beside the Dragon King, his heart was filled with despair!<br/><br/>“Ming Shasheng, you actually submitted to the Dragon King.”<br/><br/>Demon wing stared at Ming Shasheng and said with an embarrassed expression.<br/><br/>“I’m willing to take out the innate supreme treasure to trade, and I’m also willing to take out some treasures to compensate!”<br/><br/>After he finished speaking, he looked at Wang Xian and continued speaking with a gloomy expression!<br/><br/>If he knew this would happen, he would have already taken out the innate supreme treasure to trade!<br/><br/>This Dragon King was too despicable!<br/><br/>Demonic Wings thought indignantly. When he saw Wang Xian looking at him mockingly, his expression changed slightly!<br/><br/>“I’ll give you five seconds to consider. Submit or Die!”<br/><br/>Wang Xian stared at him and gave him his final warning!<br/><br/>“Demonic wings, submit. You are not the disciple of a peak race. There’s nothing wrong with submitting to the Dragon Palace. After all, the Dragon Palace is going to advance to a peak race in the Universe!”<br/><br/>Ming Sha Sheng said indifferently to him!<br/><br/>This caused demon wing’s expression to constantly change, and he took a deep breath!<br/><br/>“I submit!”<br/><br/>He slightly lowered his head and said!<br/><br/>There was no other way, if he didn’t submit, he would be finished!<br/><br/>Submit!<br/><br/>Anyway, among the old crazy demons, the old witch, water demon, and Ming Sha Sheng had all submitted, it wasn’t shameful for him to submit!<br/><br/>Moreover, just as demon wing said, he wasn’t a powerhouse of a peak race, and after breaking through, he might be recruited by other peak race powerhouses!<br/><br/>It was not a bad idea to join the Dragon Palace Now!<br/><br/>If he didn’t join, he would die!<br/><br/>“Very good!”<br/><br/>Wang Xian revealed an excited expression. Next, he would make Shi Sen consume the dragon blood and transfer the Kingdom of God to the Dragon Palace!<br/><br/>After subduing the two of them, Wang Xian was a little excited!<br/><br/>Not only did he obtain all of their resources, but he could also have two powerful subordinates. It was a huge profit!<br/><br/>“Next, Shi Sen, Lei Shan, and sky-shrouding are the three crazy demons. Let them come all at once!”<br/><br/>Wang Xian, who had tasted the sweetness, was prepared to do the same. He took out the universal AI and sent a message to the three old crazy demons!<br/><br/>The message was received very quickly!<br/><br/>The old crazy demons did not hesitate at all when it came to a treasure that could allow them to achieve a breakthrough. They flew over at the fastest speed possible for fear of an accident!<br/><br/>After agreeing on a fixed time, Wang Xian began to absorb the resources of the demon wings and Ming Shasheng!<br/><br/>These old demons had a lot of resources. Each of them was comparable to the resources of a powerful high-level race!<br/><br/>Wang Xian was already close to achieving a breakthrough. According to his guess, after absorbing their resources, he should be able to achieve a breakthrough after absorbing the resources of one or two other demons!<br/><br/>Boom! Boom! Boom<br/><br/>While Wang Xian was absorbing the resources, figures flew over from the front of the ancient divine kingdom of Hengxu!<br/><br/>An earthen yellow stone man was emitting a heavy aura. He scanned his surroundings and slowly turned into an ordinary stone that was floating there!<br/><br/>Not long after, a dark cloud flew over. There seemed to be something inside the dark cloud. When he arrived, a branch extended out and stared at the stone that was floating to his right. It was glowing!<br/><br/>The Dark Cloud did not approach the stone. It was also waiting at the side!<br/><br/>The last one to arrive was an old monster that was purple all over and in human form. However, there was a lightning symbol between his brows!<br/><br/>He looked around and muttered, “Shi Sen, shading Tian, the two of you are here too!”<br/><br/>“Lei Shan, did you also receive the Dragon King’s message?”<br/><br/>The earthen yellow stone transformed into a native and asked Lei Shan!<br/><br/>Lei Shan nodded. “It should be time!”<br/><br/>“It’s Time!”<br/><br/>As soon as he finished his sentence, Wang Xian walked out from the inner part of the ancient Hengxu Divine Kingdom!<br/><br/>“Dragon King, do you have a large number of normal birth fruits?”<br/><br/>Lei Shan stared at Wang Xian and asked!<br/><br/>“That’s right, there are enough normal birth fruits. It’s enough for you to achieve a breakthrough!”<br/><br/>Wang Xian nodded his head faintly. With a move of his palm, 600 fruits flew towards them!<br/><br/>“Huh?”<br/><br/>Seeing the Dragon King giving them 200 fruits each, lightning blotting out the sky and Shi Sen were slightly taken aback!<br/><br/>He gave them the fruits just like that?<br/><br/>They hadn’t even started the trade yet!<br/><br/>They hadn’t even said what kind of items they wanted to trade with!<br/><br/>“You guys can take some to feel the effects first.”<br/><br/>Wang Xian looked at them with a smile on his face. He looked amiable!<br/><br/>The three old crazy demons were a little unsure of Wang Xian’s confidence. They only took some after a detailed inspection of the normal fetus fruits!<br/><br/>“It really works, it really works!”<br/><br/>Very soon, an excited voice came out from their mouths.<br/><br/>The eyes of the three crazy old men were filled with passion and excitement!<br/><br/>“Alright, as long as it works. The price is still the market price. However, you have a second choice. Join Our Dragon Palace and become a member of our Dragon Palace. Our Dragon Palace really hopes to have three powerhouses join us!”<br/><br/>Wang Xian continued with a smile on his face!<br/><br/>“Join the Dragon Palace? I’m sorry, Dragon King. I, Lei Shan, am used to freedom. Consuming the common embryo fruit is very useful to me. However, I don’t have enough resources now. After I make a breakthrough, we will return this favor to Your Dragon Palace!”<br/><br/>When Lei Shan heard Wang Xian’s words, his eyes sparkled as he spoke!<br/><br/>“Oh? You’re not joining? What about the two of you?”<br/><br/>Wang Xian slightly raised his eyebrows. He looked at sky-shrouding and Shi Sen and asked!<br/><br/>“We will remember this favor. We will return it to you in the future, Dragon King!”<br/><br/>Shi Sen stared at the ordinary fruit in his hand with a burning gaze and replied without raising his head!<br/><br/>Sky-shrouding didn’t say anything, but it was obvious that he had the same intention!<br/><br/>“That won’t do. If you don’t join us, the three of you will have to exchange resources!”<br/><br/>Wang Xian looked at them and shook his head!<br/><br/>“Hahaha, Dragon King, the fact that you have our favor is a huge opportunity for you and the Dragon Palace. You must seize this opportunity. Don’t miss it. Let’s meet again if we are fated!”<br/><br/>Lei Shan laughed and prepared to leave!<br/><br/>Sky shrouding and Shi Sen were also preparing to leave!<br/><br/>Obviously, they were not prepared to exchange resources!<br/><br/>Nonsense, the common fetus fruits were already in their hands. How could they be asked to exchange for a connate cardinal treasure?<br/><br/>Was that possible?<br/><br/>They were mad demons!\t\t\t\t\t\t</div>", "images": {}, "success": true}