{"id": 693, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073287.html", "title": "Chapter 3684 - 3684 3683 Was A Bold Deal. It Was A Trap On The Surface", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3684 - 3684 3683 Was A Bold Deal. It Was A Trap On The Surface</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3684 3683 was a bold deal. It was a trap on the surface<br/><br/>Before Demon Wings agreed to it, he had already received 200 fruits!<br/><br/>When Ming Shasheng saw how straightforward Wang Xian was, he was slightly stunned!<br/><br/>This time, he wasn’t here to make a deal!<br/><br/>A few hundred fruits were worth as much as a connate cardinal treasure!<br/><br/>And he didn’t have any connate cardinal treasure!<br/><br/>The resources in his hands could not be exchanged for a large number of fruits.<br/><br/>He was prepared to snatch them by force this time!<br/><br/>He was blindly confident in his own strength!<br/><br/>Although he was not a match for the Dragon King, it was no problem for him to fish in troubled waters!<br/><br/>He believed that there would be many old monsters with such thoughts. When the time came, he would rely entirely on his strength and luck!<br/><br/>However, he did not expect that with just a few words, he would give him the ordinary fetus fruits!<br/><br/>He did not even make an oath!<br/><br/>Ming shasheng sized up the ordinary fetus fruits in front of him and checked. There were no problems.<br/><br/>He opened his mouth and crushed the ordinary fetus fruits in his hand. They quickly turned into streams of energy and entered his body!<br/><br/>After continuously absorbing hundreds of ordinary fetus fruits, he could sense that his crazy state had disappeared!<br/><br/>Although it wasn’t completely gone, it wouldn’t be a problem for at least tens of millions of years!<br/><br/>Even if he fought with all his might, he could maintain it for a very long time!<br/><br/>He felt that his mind was clear now, and his blurry cultivation path was much fresher!<br/><br/>Perhaps, after absorbing all the fruits, he might really be able to break through?<br/><br/>Ming Shasheng’s breathing was slightly hurried!<br/><br/>Beside him, Demon Wings had also absorbed more than 100 normal fetus fruits. His eyes were filled with excitement!<br/><br/>What Crazy Jin Yong said was true!<br/><br/>With the help of the normal fetus fruits, they could achieve a breakthrough!<br/><br/>“Huhu, Dragon King, can you sell this normal fetus fruit at a cheaper price?”<br/><br/>Demon Wings asked Wang Xian, his eyes gleaming!<br/><br/>“The price will not change.”<br/><br/>Wang Xian shook his head!<br/><br/>“Hahaha, Price? This changtai fruit is already mine when it is in my hands. What Price? Hahaha, Thank You Dragon King for the Changtai fruit. We will meet again if we are fated!”<br/><br/>At this moment, Ming Shisheng, who was at the side, suddenly let out an excited laugh. He moved and immediately fled into the distance!<br/><br/>From the moment he spoke to the moment he left, he didn’t stop at all!<br/><br/>“Hehe, if you want to escape without paying any price, you’re courting death.”<br/><br/>Wang Xian wasn’t surprised at all when he saw Ming Shaisheng wanting to escape. He chuckled and flapped his incipient saint wings. He quickly chased after Ming Shaisheng!<br/><br/>His speed was far from what Ming Shaisheng could compare to!<br/><br/>“Should I exchange it with an innate supreme treasure, or?”<br/><br/>Demonic Wings’expression changed when he saw Wang Xian chasing after Ming Shaisheng!<br/><br/>The Dragon King’s behavior was a little strange. He didn’t complete the transaction and gave the fruits to them directly.<br/><br/>This was very strange. He felt that there was a conspiracy!<br/><br/>The Dragon King’s behavior was too bold.<br/><br/>“Let’s Go!”<br/><br/>A hint of sternness flashed in demonic wings’eyes.<br/><br/>The Dragon King was very bold. They were also very bold. They would naturally accept the two hundred fruits without paying any price!<br/><br/>As for the Dragon King’s Revenge, would he be afraid?<br/><br/>If he could really break through, he would be able to kill the Dragon King if he dared to take revenge!<br/><br/>Whoosh<br/><br/>The monster wings flapped their wings and instantly flew in the opposite direction of Wang Xian and the rest!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>“Monster Wings, you’ve also broken the rules. Either you submit or you die!”<br/><br/>Just as he was about to fly out, Wu Sha and water demon flew out from the Hengxu Ancient God nation at a terrifying speed and locked their eyes on the monster wings!<br/><br/>At the same time, four ghost clones appeared around Yao Yi and surrounded him!<br/><br/>“Eh? What? Old Witch! Water Demon!”<br/><br/>Yao Yi’s expression changed when he saw Wu Sha and water demon come out, and he stared at them. “You’ve submitted to the Dragon King?”<br/><br/>“Yes, what’s wrong with submitting to the Dragon King? It Won’t be long before we can break through, Hehe!”<br/><br/>Water demon stared at Demon Wing and said with a faint smile!<br/><br/>“Then what does the Dragon King mean by this? First, he generously gave us the fruit of servitude? What is he going to do now?”<br/><br/>Demon wing stared at them and asked with a gloomy expression!<br/><br/>“Do what? Of course, he wants you to submit. If you dream of taking away the fruit of servitude without any trade, you will naturally have to pay the price!”<br/><br/>Wu Sha said indifferently, a smile appearing on her face!<br/><br/>“Hehe, this Dragon King really has principles. He actually wants to use such a method to make us submit!”<br/><br/>Demon wing sneered and stared at them with an ice-cold expression as she mocked!<br/><br/>“Our Dragon King does have principles. If you were to trade normally, then we would trade normally. Unfortunately, if you don’t want to trade normally, then you can only be suppressed and killed!”<br/><br/>Water demon stared at the demonic wings, and the water flow of his body began to spread in all directions.<br/><br/>“Humph, old witch, water demon, just the two of you want to keep me here? Wishful thinking. I will not submit to the Dragon King, and the eternal fruit will also belong to me!”<br/><br/>The enormous wings of the demonic wings began to flap, and terrifying hurricanes gathered around him!<br/><br/>“Now, you have no choice. If you don’t submit, you will die. Our Dragon King has said that this is the original sin of Greed!”<br/><br/>As Wu Sha spoke, she waved the staff in her hand, and formations began to form rapidly!<br/><br/>Boom! Boom! Boom<br/><br/>At this moment, Wang Xian’s four Hades’avatars suddenly released a terrifying aura.<br/><br/>Four rays of dark light shot into the sky, completely enveloping the demonic wings in darkness!<br/><br/>“Eh? This Netherworld Ghost Avatar is so powerful. How can it be so powerful? Could it be that the Dragon King has subdued the other crazy demons of the Netherworld Race? No, only the crazy demons of the Netherworld race have such powerful power.”<br/><br/>Seeing the terrifying power of the four Netherworld Ghost Avatars, the demonic wings focused his gaze, and a trace of shock appeared in his eyes!<br/><br/>Water Demon, the old witch, and these four Netherworld Ghost Avatars could easily kill him!<br/><br/>“Damn it, this Dragon King is really shameless. If he wants to subdue us, he can just attack us directly? and he even resorted to such a little trick!”<br/><br/>Demon Wing’s expression was a little awkward!<br/><br/>This was the first time he had seen such a principled guy!<br/><br/>Yes, Wang Xian was very principled!<br/><br/>He didn’t like to force others to submit to him forcefully. If others didn’t provoke him, he wouldn’t kill them for no reason!<br/><br/>Therefore, Wang Xian was prepared to use such a method!<br/><br/>If the demon wings and Ming shisheng were to make a good deal, everything would follow the rules!<br/><br/>Alright then, you guys can leave after the deal is done!<br/><br/>However, if they were greedy, Wang Xian would be able to suppress them with peace of mind!<br/><br/>Either submit or Die!<br/><br/>Clearly, none of the Mad Demons in the Invincible Zone were kind!<br/><br/>“Damn it, how could this Dragon King’s speed be so terrifying? How could his strength be so strong?”<br/><br/>At the same time, Ming Shasheng, who was the first to escape, growled with an unsightly expression!<br/><br/>“Hehe, Ming Shasheng, you have lost your chance to choose. Surrender or Die!”<br/><br/>Wang Xian stared at Ming Shasheng and said with a smile.<br/><br/>This time, he should be able to reap a good harvest!\t\t\t\t\t\t</div>", "images": {}, "success": true}