{"id": 699, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073299.html", "title": "Chapter 3690 - 3690 The Words Of 3689 Dead People Could Not Be Trusted!", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3690 - 3690 The Words Of 3689 Dead People Could Not Be Trusted!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3690 The words of 3689 dead people could not be trusted!<br/><br/>“80% chance?”<br/><br/>At the radiant God Mountain of the Angel clan, in a towering mountain peak, the third Prince looked at the message sent by his subordinate and frowned slightly.<br/><br/>The Dragon King had entered the invincible zone. This time, in order to kill the Dragon King in the Invincible Zone, the third Prince had given his subordinate a powerful Angel Army!<br/><br/>In the third Prince’s opinion, the strength of this army of angels was enough to fight against a Level 2 universe dominator. Now, only 80% of them could kill the Dragon King!<br/><br/>“What a surprise!”<br/><br/>He looked at the data sent by his subordinates, “With the strength of the Dragon King, it’s very easy for him to kill A Level 1 universe Dominator!”<br/><br/>The third prince pondered for a moment and took out a divine stone of light. The divine stone of light floated in front of him!<br/><br/>“Third prince, what’s the matter?”<br/><br/>Soon, the image of the Green River Water Phoenix appeared in front of him. She looked at the third prince and asked calmly!<br/><br/>“Have your people work together with my people to kill the Dragon King completely!”<br/><br/>The third prince stared at the Phantom of the Green River Water Phoenix and said!<br/><br/>“Huh?”<br/><br/>The Green River Water Phoenix looked surprised. “My men are about to make their move. My men are enough to kill the Dragon King!”<br/><br/>“Let’s join forces. Just in case, the Dragon King is stronger than we thought!”<br/><br/>The third Prince said to her!<br/><br/>Originally, they thought that since they had sent someone to kill the Dragon King, it would be a piece of cake for them to kill him!<br/><br/>They were all top-notch experts of the peak race, and their statuses were also extremely noble.<br/><br/>Now, it seemed that things were not as easy as they thought!<br/><br/>“Alright, let’s let them join forces.”<br/><br/>The Green River Water Phoenix pondered for a moment and nodded lightly!<br/><br/>She knew that the third prince was a proud person. To kill a small figure and still want to join forces with her, that small figure must have exceeded his imagination, and he was not 100% sure.<br/><br/>And killing the Dragon King was also very important to her, so she agreed!<br/><br/>“Okay!”<br/><br/>The third prince nodded!<br/><br/>The Green River Water Phoenix’s figure disappeared, and soon sent a message!<br/><br/>The third Prince sent the message to his subordinates in the invincible zone, and his eyes flickered slightly!<br/><br/>“Kill the Dragon King, and it won’t be a big problem to subdue the Dragon Palace!”<br/><br/>He murmured.<br/><br/>As long as his subordinates in the Invincible Zone killed the Dragon King and brought his body over, the Dragon King would be dead for sure!<br/><br/>Regardless of whether the Dragon King had any treasures or not, he could easily kill him!<br/><br/>But he had to obtain the Dragon King’s corpse or his flesh and blood!<br/><br/>“Eh? The third prince sent us a message. He wants us to contact someone. Fire vanishing sky, Fire Phoenix, fire vanishing sky?”<br/><br/>Soon, more than ten angels in the Invincible Zone rushed to the trading center.<br/><br/>The angel in the center received the message from the third prince, and his eyes flickered!<br/><br/>“Phoenix Clan? Fire Vanishing Heaven? How did the third Prince find the Phoenix Clan?”<br/><br/>An angel asked in puzzlement!<br/><br/>“The matter of the third prince is not something that we can guess. Contact Fire Vanishing Heaven immediately. I wonder how much power the third prince has found for us!”<br/><br/>As the angel in the center spoke, he immediately began to make contact!<br/><br/>Just as the experts from the Angel clan and the Fire Phoenix clan were about to make their move, Wang Xian had already rushed to the Exchange Hall!<br/><br/>This time, he didn’t use his clone to come over for the sale. Instead, he came over in his true form!<br/><br/>With his current strength, he could already act without restraint in the Invincible Zone!<br/><br/>Even if there were a large number of experts surrounding him, he wasn’t afraid at all!<br/><br/>Hence, he didn’t need to use his clone to sell his goods like last time!<br/><br/>When he arrived above the continent of the trading ground, Wang Xian landed on a spot!<br/><br/>He didn’t enter the interior of the trading ground because there was a formation there. If he entered, his strength would be suppressed!<br/><br/>Therefore, he chose a spot outside!<br/><br/>After landing, he moved his palm and five hundred fruits floated around him. He stood there and scanned his surroundings!<br/><br/>“Oh? That’s the Dragon King. The Dragon King Is Here!”<br/><br/>“The Dragon King is here. He didn’t enter the inner part of the trading ground. He’s outside. Let’s go, Let’s Go!”<br/><br/>“The Dragon King is finally here!”<br/><br/>When the experts around the trading ground noticed Wang Xian’s arrival, they moved and rushed over immediately!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Soon, dozens of experts arrived around Wang Xian.<br/><br/>When they saw the 500 fruits floating in front of Wang Xian, their pupils constricted slightly and their faces were filled with shock!<br/><br/>“This… there are so many fruits. There are actually 500 of them. This is 500 of them!”<br/><br/>“Hiss, the Dragon King actually has so many fruits!”<br/><br/>“These 500 fruits, if we were to use the Dragon King’s trading price, we would need at least two to three innate treasures before we can trade them away!”<br/><br/>Dozens of experts looked at the 500 fruits with burning eyes!<br/><br/>They wanted to rush over and snatch them away!<br/><br/>However, it was a pity that the person in front of them was the Dragon King!<br/><br/>He was the Dragon King who had killed the mad demons and was close to sweeping the invincible region!<br/><br/>There was a vague saying in the invincible region.<br/><br/>One on one, the Dragon King was invincible!<br/><br/>Sweeping the invincible region, the Dragon King could be considered to have done it!<br/><br/>His terrifying strength had killed two mad demons in succession!<br/><br/>His strength was extremely terrifying!<br/><br/>When Wang Xian arrived at the trading ground, the news spread at a crazy speed. Many experts from the invincible zone flew over quickly!<br/><br/>A few minutes after Wang Xian arrived, hundreds of old monsters from the Invincible Zone had gathered around him!<br/><br/>Hundreds of old monsters stared at the 500 fruits with burning and greedy eyes.<br/><br/>Whoosh<br/><br/>At this moment, a figure carrying a bow flew over. His gaze swept across the fruits in front of Wang Xian, and a hint of passion flashed across his eyes!<br/><br/>“Dragon King, is what the Mad Demon said true? As long as a mad demon or a top-notch expert consumes a large amount of them, they will be able to achieve a breakthrough?”<br/><br/>The figure carrying the bow could not help but ask!<br/><br/>“HMM?”<br/><br/>“He is a top-notch expert of the Elf clan!”<br/><br/>“He is an Oakley archer of the Elf clan. The Elf clan seems to have a good relationship with the Dragon King!”<br/><br/>His words caused the surrounding experts to look expectant as they stared at Wang Xian!<br/><br/>“The Elf clan!”<br/><br/>Wang Xian looked at this expert of the Elf clan and sized him up before replying, “The words of a dead person can not be trusted!”<br/><br/>“The words of a dead person?”<br/><br/>The moment Wang Xian finished his sentence, all the old monsters around him were stunned. Their faces were filled with astonishment and shock!<br/><br/>What did he mean?<br/><br/>The words of a dead person?<br/><br/>“However, there is one thing that the mad demon Jin Gui was right about. A mad demon who consumed a large amount of ordinary fruit would have a 99% chance of breaking through. A top-notch expert might still be lacking!”<br/><br/>At this moment, Wang Xian’s voice rang out once again!\t\t\t\t\t\t</div>", "images": {}, "success": true}