{"id": 696, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073293.html", "title": "Chapter 3687 - 3687 3686 Was Subdued And Subdued", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3687 - 3687 3686 Was Subdued And Subdued</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3687 3686 was subdued and subdued<br/><br/>“Hehe!”<br/><br/>When Wang Xian saw that the three of them were about to escape, a smile appeared on his face. He stared at them mockingly and asked, “Can you guys leave?”<br/><br/>Buzz! Buzz! Buzz<br/><br/>As soon as he finished his sentence, the old witch, water demon, Ming shisheng, and demon wings slowly walked out from behind Wang Xian.<br/><br/>They looked at the three old crazy demons, Shi Senlei shimmering and blotting out the sky. Their eyes were filled with mockery!<br/><br/>“A bunch of idiots. You still want to escape? You’d better obediently submit to our Dragon King!”<br/><br/>Monster Wings said lightly!<br/><br/>Not long ago, he had just been suppressed. Now, seeing that these three old monsters of the same level as him were about to be suppressed, he was in a very good mood!<br/><br/>“Huh?”<br/><br/>“What? Old Witch, you’re not dead? And you, water demon, Ming Sha Sheng, and monster wings, you’ve submitted to the Dragon King?”<br/><br/>Lei Shan and the others, who were about to leave, saw the old witch and the others appear. Their pupils constricted slightly, and their faces were filled with shock!<br/><br/>They looked at them in disbelief.<br/><br/>The old witch, water demon, Ming shisheng, and Demon Wing were the Old Mad Demons of their invincible region!<br/><br/>The most supreme existences!<br/><br/>Now, they actually appeared at the same time, and they even submitted to the Dragon King?<br/><br/>This? ? ?<br/><br/>They found it unbelievable!<br/><br/>“I really didn’t expect that all of you would submit to the Dragon King. Hehe!”<br/><br/>The white clouds covered the sky. Slowly, branches extended out and stared at them warily as he spoke!<br/><br/>Whoosh<br/><br/>As soon as he finished his sentence, Wang Xian flapped the uninitiated holy wings on his back and instantly appeared at the place where they had to retreat!<br/><br/>“They have surrendered. It’s your turn now. Surrender or die. There’s no other choice!”<br/><br/>Wang Xian stared at them and said indifferently!<br/><br/>None of the lunatics in the invincible zone were kind, so he didn’t have to worry anymore!<br/><br/>Surrender or Die!<br/><br/>“Dragon King, you don’t put us in your eyes. Do you think that you can stop the three of us with just the three of you?”<br/><br/>Lei Shan’s expression slowly darkened as he stared at Wang Xian and said!<br/><br/>“It’s easy to kill all of you!”<br/><br/>Wang Xian looked at him and said indifferently!<br/><br/>“Hahaha, kill us? With just the five of you? arrogant. Dragon King, you’re too arrogant!”<br/><br/>Shi Sen let out a furious roar as his body slowly grew bigger. The khaki-colored energy on his body charged towards the surroundings!<br/><br/>“Killing the three of you is indeed not difficult!”<br/><br/>Wu Sha said slowly and the staff appeared in her hand. “Shi Sen, Lightning Flash, I advise you to submit now and suffer less physical pain!”<br/><br/>“HMPH!”<br/><br/>Lightning flash snorted and immediately transmitted his voice. “Sky shrouding, Shi Sen, attack the Dragon King and break through!”<br/><br/>“Crackle crackle!”<br/><br/>As soon as he finished his sentence, a terrifying power of lightning burst out from his body instantly!<br/><br/>Shi Sen raised his palm at the side and clenched it forcefully. An incomparably huge earthy yellow ball appeared in the sky above him!<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>Within the dark clouds, countless branches were attacking Wang Xian!<br/><br/>The three of them launched a terrifying attack at Wang Xian at the same time!<br/><br/>“Five Elements Millstone, activate!”<br/><br/>Wang Xian smiled faintly when he saw them attacking him. With a move of his palm, the five elements millstone appeared in front of him!<br/><br/>His palm landed on the Millstone and the five elements power surged into it to receive their attack!<br/><br/>At the same time, four Netherspirit avatars appeared beside him and also met their attack!<br/><br/>“Boom!”<br/><br/>“Boom!”<br/><br/>A terrifying collision sound rang out. The attacks of Shi Sen, Lei Shan, and sky shrouding landed on the attacks of the five elements millstone and the netherspirit avatars!<br/><br/>The energy surged and disappeared quickly!<br/><br/>Wang Xian managed to fend off their attacks alone!<br/><br/>“This is impossible!”<br/><br/>“This strength…”<br/><br/>Seeing that the Dragon King was able to fend off their attacks alone, the expressions of Lei Shan and the other two changed once again!<br/><br/>“You don’t know your limits. You insist on US teaching you a lesson!”<br/><br/>Ming shasheng let out a low growl. In an instant, more than 200 black shadows charged towards Shi Senlei and the rest!<br/><br/>The water demon wings also charged straight at them!<br/><br/>Wu Sha immediately set up a formation behind them!<br/><br/>“Hehe, I won’t shed tears until I see my coffin!”<br/><br/>Wang Xian moved his palm and the five elements millstone smashed towards Lei Shan!<br/><br/>The terrifying energy carried by the five elements grindstone caused Lei Shan’s expression to change drastically!<br/><br/>He quickly dodged to the side!<br/><br/>Crash<br/><br/>However, at this moment, Wang Xian moved and attacked Lei Shan in an instant!<br/><br/>“What speed! He’s too fast! His speed is too fast!”<br/><br/>When he saw Wang Xian attacking him, Lei Shan’s expression changed drastically again!<br/><br/>“Lightning, Bloodline Burst!”<br/><br/>At the spot between his brows, the lightning symbol emitted a glow and enveloped his entire body!<br/><br/>Crackle<br/><br/>In an instant, he burst out with a speed that was not inferior to Wang Xian’s and dodged backward!<br/><br/>“Eh? He can actually burst out with such a fast speed?”<br/><br/>The burst of lightning caused Wang Xian to reveal a stunned expression.<br/><br/>“Let me see how long you can hold on!”<br/><br/>Wang Xian’s eyes were locked on him as streams of wind and lightning attacked him!<br/><br/>“This Dragon King’s speed is terrifying. I Can’t do it. I have to escape immediately. I can only hold on for about ten minutes!”<br/><br/>Lei Shan’s expression was a little grave. He was like a real terrifying lightning bolt. With a light tap, he flew to the right!<br/><br/>Whoosh<br/><br/>Wang Xian flapped his genesis saint wings and chased after him immediately!<br/><br/>“Bind!”<br/><br/>At the same time, a spiritual figure appeared on his shoulder. She held the water lotus staff and bound Lei Shan!<br/><br/>“What the Hell Is This?”<br/><br/>Lei Shan’s expression changed drastically when he saw a surge of energy coming towards him!<br/><br/>The water energy was hindering his speed!<br/><br/>It reduced his speed by a lot!<br/><br/>“Dragon Breath of Life!”<br/><br/>Wang Xian opened his mouth and a torrent of energy rushed towards him!<br/><br/>His expression changed drastically as a lightning shield appeared around him.<br/><br/>The Lightning Shield rotated around him as he flew rapidly in an attempt to escape from this place!<br/><br/>“Dragon Claw!”<br/><br/>Wang Xian’s eyes focused as his arm turned into a dragon claw. The light and dark divine dragon on the Taiji Dragon disk immediately circled around him to strengthen him!<br/><br/>“Bang!”<br/><br/>A powerful force directly broke through the Lightning Shield around Lei Shan.<br/><br/>“This dragon king is too terrifying!”<br/><br/>In just an instant, Lei Shan realized how terrifying Wang Xian was. His heart pounded violently!<br/><br/>The Dragon Claw clawed at his body. The powerful force caused his body to tremble violently. He couldn’t help but fall downwards!<br/><br/>“PFFT!”<br/><br/>At the same time, he spat out a large amount of blood!<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>At this moment, the four Netherspirit avatars arrived at his surroundings. Wang Xian also continued to attack him!<br/><br/>“It’s over. They are not on the same level!”<br/><br/>Lei Shan’s expression changed drastically when he saw Wang Xian charging at him again!<br/><br/>He felt that he was on a completely different level from the Dragon King. He had no way of resisting at all!<br/><br/>Total Annihilation!\t\t\t\t\t\t</div>", "images": {}, "success": true}