{"id": 690, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073281.html", "title": "Chapter 3681 - 3681 2,680 Demons Were Mobilized", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3681 - 3681 2,680 Demons Were Mobilized</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3681 2,680 demons were mobilized<br/><br/>In the invincible region, because of a piece of information from the Mad Demon, countless old monsters were excited!<br/><br/>As time passed, news quickly spread throughout the invincible region!<br/><br/>Some old monsters confirmed on the universe’s AI that as long as there was a large number of normal birth fruits, it could indeed make powerful old monsters break the shackles of their realms!<br/><br/>Some old monsters also said that the Dragon Palace had the god Tree of normal birth fruits, and the Dragon King had a large number of normal birth fruits in his hands!<br/><br/>In short, all sorts of news quickly spread, almost reaching the ears of every old monster in the Invincible Zone!<br/><br/>“Boom Boom Boom!”<br/><br/>In the dark void of the Invincible Zone, an incomparably huge void beast skeleton floated in the Void!<br/><br/>From the inside of the giant skeleton, the sound of battle could be heard!<br/><br/>The terrifying black energy kept attacking the surroundings!<br/><br/>Dozens of black shadows could be vaguely seen fighting inside!<br/><br/>All of a sudden, strangely, all the shadows stopped fighting!<br/><br/>They moved and came to the head of the Void Beast!<br/><br/>There was an expert of the Dark clan standing there.<br/><br/>Black Shadows entered his body one by one!<br/><br/>These shadows were the avatars of the Dark Ghost!<br/><br/>Fifty to sixty shadows entered his body, but these shadows were only one-fifth of his!<br/><br/>“Taking the eternal fetus fruit, the hope of a breakthrough!”<br/><br/>He murmured, his blood-red eyes jumping continuously!<br/><br/>“This is my only hope, Dragon King of the Dragon Palace. It’s really expensive to trade five innate spiritual treasures for one eternal fetus fruit!”<br/><br/>The expert of the Dark Clan roared in a low voice.<br/><br/>“However, I must seize this opportunity, even if it means death!”<br/><br/>He continued and took out the universal AI.<br/><br/>His name was Ming Shisheng, an old monster from the invincible zone, an extremely terrifying existence!<br/><br/>He had hundreds of dark ghost bodies, and when they were unleashed at the same time, it was extremely terrifying!<br/><br/>Facing him was equivalent to facing hundreds of great beings of the same level.<br/><br/>How was he going to fight?<br/><br/>“Taking the eternal embryo fruit, looks like I’ll have to replace it!”<br/><br/>In another part of the void space in invincible region, this part of the void space was filled with violent and terrifying energy!<br/><br/>The storm of the void fissure swept through the surroundings, and the terrifying void storm could even tear apart an ordinary Level 3 universe master!<br/><br/>“I’m Here!”A demon bird spread its wings and said in the storm!<br/><br/>It flapped its wings slightly and took out the universe ai!<br/><br/>It was called demon wings, an ordinary name, but it was a mad demon!<br/><br/>“Is there really hope for a breakthrough? Is there really hope?”<br/><br/>In the chaotic space of the invincible zone, a yellowish stone man lying in the center of the meteorite opened his eyes, his expression excited!<br/><br/>He slowly stood up, and the tombstone-like meteorites directly collapsed. He quietly floated in the chaotic flow.<br/><br/>The massive meteorites hit his body and directly collapsed!<br/><br/>His name was Shi Sen, the Mad Demon of the Invincible Zone.<br/><br/>Not only these three places, but the old monsters of other places also looked at the information in their hands, their expressions extremely excited!<br/><br/>Some of the Mad Demons of the Invincible Zone were in a state of madness, but there were also some who used special methods to suppress themselves in order to prevent themselves from being in a state of madness!<br/><br/>But after receiving this news, none of the mad demons could sit still!<br/><br/>Not only the mad demons, some of the top experts of the invincible zone also couldn’t sit still!<br/><br/>Even if there was a one percent chance of breaking through, they would still fight for it with all their might!<br/><br/>Hence, all the mad demons and top-notch experts in the invincible zone started to move!<br/><br/>“Hu!”<br/><br/>Within the ancient god country of horizontal void, Wang Xian opened his eyes and smiled as he looked at the depleted resources ahead!<br/><br/>A month had passed. He had absorbed all the resources from the demon Raider Circle and the Divine Kingdom of the 150-ODD experts!<br/><br/>These resources were about 30% away from increasing his strength!<br/><br/>If I can obtain a few more resources from the Mad Demons, I should be able to increase my strength<br/><br/>Wang Xian calculated in his heart!<br/><br/>The strength of the mad demons was much stronger than that of a real master of the universe!<br/><br/>If he could make a breakthrough, he would have the strength of a Master of the universe at level two.<br/><br/>At that time, he would be even more terrifying!<br/><br/>Even if the Mad Demons of the Invincible Zone joined forces, Wang Xian would be able to destroy them!<br/><br/>“Eh, there’s a lot of information on the universe’s AI.”<br/><br/>At this moment, Wang Xian noticed the information on his universe’s AI and immediately opened it to take a look!<br/><br/>When he saw the contents, his eyes lit up!<br/><br/>There were many old freaks who contacted him, wanting to trade for the changtai fruit!<br/><br/>Wang Xian even received a message saying that they wanted to trade with him for the fruit!<br/><br/>“This…”<br/><br/>His eyes lit up.<br/><br/>There were many people who contacted him, a total of fifty to sixty people!<br/><br/>Furthermore, there were more people who wanted to trade!<br/><br/>At the very least, there were a dozen of them, and at the very most, there were dozens of them!<br/><br/>Wang Xian did not reply immediately. He opened the universe’s AI to check the situation.<br/><br/>From the looks of it, everything was related to the ingesting of the eternal fetus fruit and him.<br/><br/>The information regarding the Mad Demon Golden Roc before his death caused a huge commotion in the invincible zone!<br/><br/>Things were even crazier than what Wang Xian had imagined!<br/><br/>The importance of ingesting the eternal fetus fruit was even greater than what he had imagined!<br/><br/>Whoosh<br/><br/>At this moment, Wu Sha’s figure entered the interior.<br/><br/>“Dragon King, I’ve found the location of the water demon!”<br/><br/>Wu Sha reported to Wang Xian immediately!<br/><br/>“Oh? Have you found it?”<br/><br/>Wang Xian raised his eyebrows.<br/><br/>“This water demon is in the long river not far away from us. It only takes about ten minutes!”<br/><br/>Wu Sha nodded her head.<br/><br/>“Let’s go. Let’s get rid of this water demon first before dealing with other matters.”<br/><br/>He moved his body and flew out immediately!<br/><br/>The water demon had participated in the operation to attack him. It was an enemy that Wang Xian wanted to destroy!<br/><br/>After destroying him, not only would he be able to obtain the corpses of experts, he would also be able to obtain a lot of resources!<br/><br/>At this moment, he was not far from making another breakthrough.<br/><br/>“It’s the Dragon King!”<br/><br/>Wu Sha moved and followed closely behind.<br/><br/>“It’s in that direction. The distance is very close!”<br/><br/>The two of them flew out of the inner part of the transverse void ancient divine kingdom and Wu Sha pointed in a direction!<br/><br/>Wang Xian’s energy wrapped around him and he sped up. Soon, he arrived in the sky above the long river!<br/><br/>In less than ten minutes, he stopped in the air while Wu Sha pointed ahead.<br/><br/>“Water demon, it’s right there. Dragon King, if we get any closer, we will be discovered!”<br/><br/>Wu Sha warned!<br/><br/>“Make your move directly. Set up a formation at the back to prevent him from escaping!”<br/><br/>Wang Xian said. With a move of his palm, the five elements millstone appeared in his hand!<br/><br/>He flapped his incipient saint wings and flew rapidly into the long river!<br/><br/>As he got closer, Wang Xian immediately sensed the terrifying energy contained in the long river!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Four netherspirit avatars flew out from Wang Xian’s body and sealed off four different directions!\t\t\t\t\t\t</div>", "images": {}, "success": true}