{"id": 691, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073283.html", "title": "Chapter 3682 - 3682 2681 Water Demon Surrendered", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3682 - 3682 2681 Water Demon Surrendered</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3682 2681 water demon surrendered<br/><br/>“Water demon, come out now!”<br/><br/>Wang Xian shouted in a low voice and smashed the five elements millstone directly into the long river below!<br/><br/>The terrifying energy caused the river water to flow in all directions!<br/><br/>However, there was a lump of river water in the middle that did not move at all.<br/><br/>“What? The Dragon King actually found my location. My body has merged into the long river and it is very difficult for me to be discovered. How did he lock onto me? Could it be that the Crazy Gold Demon told him? No, it can’t be him.”<br/><br/>“A wizard, it’s a wizard. Only a powerful wizard can lock onto me. Could it be that the wizard beside the Dragon King is comparable to my strength?”<br/><br/>A voice came from the river.<br/><br/>Slowly, the entire river condensed into a huge face. The face stared at Wang Xian in the sky, and his expression changed slightly.<br/><br/>The body of the water demon was currently trying to merge with the entire long river!<br/><br/>During this period, his main body could not leave this place. Once he did, all his efforts would be for naught!<br/><br/>The previous thousands of years of cultivation and merging had completely failed. He had to start all over again!<br/><br/>Therefore, after his previous attack on the Dragon King failed, he did not move.<br/><br/>This was because the merging with the river made him extremely stealthy!<br/><br/>Moreover, the river flowed all the time. His body was also flowing along with the flow of the water!<br/><br/>However, the speed of the flow was a little slow!<br/><br/>The long river was so vast and the invincible zone was so vast. The chances of finding him were very, very small!<br/><br/>Unless it was a magus with a similar strength to him who had grasped his aura!<br/><br/>Otherwise, it was almost impossible to lock onto him!<br/><br/>“Water demon, isn’t it easy to find you?”<br/><br/>In the sky, Wu Sha was behind Wang Xian. She stared at him calmly and said, “It took me a month to find you. Your concealment ability is indeed very strong. It’s a pity that you met me!”<br/><br/>“You… You’re an old witch. You’re an old witch. Weren’t you killed by the Dragon King? You… you submitted to him? You were the one who used the formation to ambush him the last time. You actually submitted to the Dragon King!”<br/><br/>When water demon saw the old witch’s figure, his face was filled with shock!<br/><br/>She was the old witch, the number one Magus in the invincible region!<br/><br/>She wasn’t killed by the Dragon King but submitted to the Dragon King?<br/><br/>“The Dragon King made me regain my senses, he made me find a way to break through, why shouldn’t I submit!”<br/><br/>The old witch said indifferently.<br/><br/>But there was one thing she didn’t say, and that was if she didn’t submit, she would die!<br/><br/>But now, she was completely convinced!<br/><br/>She had already seen the way to break through the shackles, she had already seen the next path of cultivation!<br/><br/>“You’ve found a way to break through?”<br/><br/>Water Demon’s face was filled with shock.<br/><br/>His huge face flew out of the river and stared at the old witch!<br/><br/>“Hehe, this has nothing to do with you. You’re going to die!”<br/><br/>The old witch said faintly!<br/><br/>“Water Demon, you’re going to die!”<br/><br/>Wang Xian stared at him calmly and said faintly!<br/><br/>In the next moment, five Divine Dragons pulled the huge millstone and attacked water demon!<br/><br/>“I’m no match for them!”<br/><br/>“With the Dragon King’s speed, it’ll be hard for me to escape!”<br/><br/>“Also, is what the old witch said true? What Crazy Demon Jin Fu said is also true. Is it true that consuming the womb can help crazy demon break through?”<br/><br/>Water Demon’s expression changed drastically when he saw the five elements millstone attacking him!<br/><br/>He was clear about crazy demon Jin Fu’s strength. Not long ago, Crazy Demon Jin Fu had died in front of him. He was clear about the strength of the Dragon King and the old witch!<br/><br/>This was especially so for the Dragon King. He was extremely terrifying!<br/><br/>He was no match for them at all!<br/><br/>Was he going to be finished?<br/><br/>“Dragon King, don’t kill me. I’m willing to submit. I’m willing to fight for you. Don’t kill me.”<br/><br/>Water Demon’s mind was filled with thoughts. He made a decision in an instant and shouted loudly at Wang Xian!<br/><br/>“Huh?”<br/><br/>Wang Xian was slightly stunned when he heard his words.<br/><br/>This mad demon was going to submit without even fighting?<br/><br/>This was completely out of his expectations!<br/><br/>With a thought, the attack of the five elements grinding stopped!<br/><br/>Splash<br/><br/>Water Demon’s expression changed and condensed into the form of a water man. The water man was over 10,000 meters in size. He looked at Wang Xian and slowly half-knelt down!<br/><br/>“Water demon is willing to submit to the Dragon King and fight for the Dragon King. I beg the Dragon King not to kill me!”<br/><br/>Water Demon said respectfully!<br/><br/>This was his only way out.<br/><br/>At the same time, it was also his best choice!<br/><br/>With his strength, the chance of escaping from the hands of the Dragon King and the old witch was less than 1% !<br/><br/>Although he had a life-saving treasure, the old witch was a powerful wizard and could track him!<br/><br/>Secondly, the old witch’s words just now should not be fake!<br/><br/>The information about the crazy demon Jin Yu should not be fake either!<br/><br/>The longevity fruit in the Dragon King’s hands could allow them to achieve a breakthrough in their crazy demon!<br/><br/>This was a fatal temptation for him!<br/><br/>Under such circumstances, he knew how to make the right choice!<br/><br/>So what if he became the Dragon King’s subordinate? At the very least, he would have a chance to achieve a breakthrough!<br/><br/>He would be able to live!<br/><br/>“Don’t you want to try fighting me? But this is the right choice for you!”<br/><br/>Wang Xian moved his body and flew directly towards him!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>The four Netherspirit avatars around him immediately arrived around him.<br/><br/>The five elements millstone was also hovering above the water demon. If he made any rash moves, he would be instantly killed!<br/><br/>Wang Xian flew in front of him. With a move of his palm, a drop of pure divine dragon blood floated in front of him!<br/><br/>“Swallow it. Don’t resist. Also, Summon Your Universe God Kingdom over. I will suppress it in the Dragon Palace!”<br/><br/>Wang Xian gave him an order!<br/><br/>“It’s the Dragon King!”<br/><br/>Water Demon did not resist at all. Everything was done!<br/><br/>A minute later, water demon summoned his God kingdom and placed it in the Dragon Palace. This also meant that water demon was completely suppressed by Wang Xian, just like the old witch!<br/><br/>Wang Xian would not refuse a powerhouse of such level to submit to him!<br/><br/>“These are 200 fruits of the womb. After consuming 200 of them, the witch gauze has completely stabilized your mind and mind. Soon, you will be able to use your strength to break through the shackles and achieve a breakthrough. You shouldn’t have too much of a problem!”<br/><br/>After everything was settled, Wang Xian took out 200 fruits of the womb and handed them to the water demon. Then, he said calmly to him!<br/><br/>“Thank you, Dragon King. Thank you, Dragon King!”<br/><br/>Water Demon’s body trembled violently when he saw that he had obtained 200 fruits so easily. His face was filled with excitement as he bowed!<br/><br/>He thought that the Dragon King would reward him for taking the fruits based on his future performance. Now that he had obtained them so easily, he felt a trace of gratitude in his heart.<br/><br/>“Take it. Also, give me all the useless treasures in your hands, the divine tree, divine grass, and other resources.”<br/><br/>Wang Xian instructed him!<br/><br/>“Yes, everything of the water demon belongs to you, Dragon King!”<br/><br/>The water demon replied immediately!<br/><br/>“Hehe!”<br/><br/>Wang Xian smiled faintly. He didn’t expect that he could subdue the water demon so easily!<br/><br/>One had to know that the water demon was a crazy demon from the Invincible Zone!<br/><br/>After consuming the ordinary embryo fruit, it would rise to the level of a ruler in the future!<br/><br/>The Dragon Palace will have one more ruler!\t\t\t\t\t\t</div>", "images": {}, "success": true}