{"id": 692, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073285.html", "title": "Chapter 3683 - 3683 3682 Was A Bold Deal. It Was A Trap On The Surface! Let’S Go", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3683 - 3683 3682 Was A Bold Deal. It Was A Trap On The Surface! Let’S Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3683 3682 was a bold deal. It was a trap on the surface! Let’s Go<br/><br/>“Why don’t we subdue more old maniacs?”<br/><br/>Wang Xian’s eyes sparkled as he looked at the water demon who was quickly swallowing the fruits!<br/><br/>As long as the old witch had enough fruits, she would definitely be able to achieve a breakthrough!<br/><br/>The chances of producing a ruler-level powerhouse was extremely small!<br/><br/>Subduing them would allow them to obtain a master-level powerhouse. This would be of great benefit to the Dragon Palace!<br/><br/>Most importantly, after their breakthrough, they could not be judged by an ordinary master-level powerhouse!<br/><br/>Their combat strength was far beyond that of a master-level powerhouse!<br/><br/>Wang Xian took out the universe’s AI and looked at the private messages on it. His eyes sparkled!<br/><br/>There were some strong people who were willing to exchange their innate treasures with him for the serval fruits. There were also many old monsters who wanted to buy more than ten or twenty serval fruits!<br/><br/>Wang Xian was not sure if these were the real buyers. However, since they wanted to buy, he would naturally sell them!<br/><br/>At this moment, the resources that he needed for his breakthrough were not many anymore.<br/><br/>It was not very difficult for Wang Xian to obtain these resources!<br/><br/>He also had quite a number of normal birth fruits. Taking out another two to three hundred normal birth fruits to trade should be enough for him to improve!<br/><br/>“Let’s go to the ancient god Kingdom of Hengxu First!”<br/><br/>Wang Xian said to water demon Wu Sha as he flew towards the ancient god Kingdom of Hengxu.<br/><br/>After he arrived at the ancient god Kingdom of Hengxu, he opened the universe’s artificial intelligence to check one by one!<br/><br/>The universe’s artificial intelligence would have a name!<br/><br/>And a portion of the experts would use their natal names on the universe’s artificial intelligence!<br/><br/>Of course, there were also many who used fake names!<br/><br/>However, some of the Crazy Old Demons in the Invincible Zone used their real names on the universe’s artificial intelligence.<br/><br/>For example, Ming Sha Sheng, demon wings, and Shi Sen!<br/><br/>The names on their universe’s artificial intelligence were not hidden or altered!<br/><br/>Wang Xian looked at his private messages and found out the names one by one!<br/><br/>Ming shasheng, demon wings, Shi Sen, Lightning Flash, and blotting out the sky.<br/><br/>These names were all well-known in the Invincible Zone!<br/><br/>They were all powerful and terrifying maniacs!<br/><br/>These five maniacs had sent a message to Wang Xian, wanting to buy the longevity fruit in his hands!<br/><br/>As for whether they really wanted to trade with the item or directly snatch it by force, it was hard to say!<br/><br/>However, Wang Xian could call them over to take a look!<br/><br/>“Ming shisheng, demon wings, call them over first!”<br/><br/>Wang Xian was making a plan in his heart as he replied to them with a message!<br/><br/>He wanted to trade with them first!<br/><br/>As for choosing to trade with them first, he had his own ideas!<br/><br/>After sending the message, he received a reply very quickly!<br/><br/>The two crazy old demons, Ming Shasheng, would arrive in five days while the demonic wings would arrive in three days!<br/><br/>Wang Xian had promised them that they would carry out the trade at the ancient Divine Kingdom of Hengxu in five days!<br/><br/>“I hope they won’t let me down!”<br/><br/>Wang Xian said as he waited quietly!<br/><br/>In the invincible zone, the bunch of old monsters were still discussing the matter of consuming the eternal embryo fruit.<br/><br/>However, they had encountered a problem now. They did not know where the Dragon King was, and they could not contact him on the universe’s AI.<br/><br/>This made many experts slightly anxious!<br/><br/>But there was nothing they could do!<br/><br/>After receiving Wang Xian’s reply, Ming Shisheng and demon wings naturally would not spread the news!<br/><br/>They quickly flew towards the ancient Hengxu Divine Kingdom!<br/><br/>Huala<br/><br/>Three days passed, and demon wings, who had a pair of gigantic wings, flew over. He scanned his surroundings.<br/><br/>“The ancient void God nation is the lair of the Demon Breaker Circle. Right now, not a single expert from the Demon Breaker Circle has seen it. What Happened?”<br/><br/>“Why did Crazy Demon Jin Chi announce that news? And Why? Is it the Dragon King’s scheme, or… ?”<br/><br/>Demonic Wings looked around, his eyes filled with wariness!<br/><br/>He did not approach the ancient god nation, but waited quietly in the distance!<br/><br/>Weng! Weng! Weng! Weng<br/><br/>Two days passed once more, and a dark beam of light shot over!<br/><br/>“HMM?”<br/><br/>Demonic Wings looked at the dark beam of light, his eyes focused, and terrifying demonic qi surged out of his body as he stared at it with his sharp eyes!<br/><br/>“Demonic wings, it’s you. You received a message from the Dragon King as well?”<br/><br/>Ming Shasheng’s figure stopped in the air as he stared at demonic wings!<br/><br/>“That’s right, you received it as well? It seems like the Dragon King intentionally called the two of us here to make a deal!”<br/><br/>Demonic Wings said indifferently!<br/><br/>Ming shasheng looked at him and then scanned his surroundings!<br/><br/>Weng<br/><br/>At this moment, they saw a figure flying out from the ancient divine kingdom of Hengxu. His eyes were shining!<br/><br/>“Dragon King of the Dragon Palace!”<br/><br/>Demonic wings stared at that figure and shouted!<br/><br/>“Hehe, since the two of you are here, I naturally have to show myself and make the trade!”<br/><br/>Wang Xian looked at them and flew toward them with a smile on his face!<br/><br/>“I wonder how many ordinary embryo fruits the dragon king has. I want to make the trade with an innate treasure!”<br/><br/>Demonic wings stared at Wang Xian and said directly!<br/><br/>“I have many serval fruits in my hands. They are enough for you to stabilize your mind and make a breakthrough. If you want to stabilize your mind and make a breakthrough, you will need about 200 serval fruits. The price will be the same as before. However, I have another method of trade here.”<br/><br/>Wang Xian looked at them and said with a smile.<br/><br/>“This is the lair of the demon breaker in the ancient Divine Kingdom of Hengxu. It is the base of the demon breaker. Why are there no traces of them?”<br/><br/>Ming Shasheng suddenly asked an unrelated question. His pair of blood-red eyes stared at Wang Xian.<br/><br/>“The demon breaker and the demon breaker of the Demon Breaker tried to attack me but I have already destroyed them!”<br/><br/>Wang Xian replied indifferently!<br/><br/>His words made Ming Shisheng’s expression freeze!<br/><br/>“What’s the second way of Trade? With 200 fruits of the womb, can we really make a breakthrough?”<br/><br/>Demon Wings didn’t care about Jin Xu’s crazy state. He stared at Wang Xian and spoke with a slightly rapid breathing!<br/><br/>“The probability of a breakthrough is 95% .”<br/><br/>Wang Xian said plainly, “The second way of trade is for you to join the Dragon Palace. I will be the leader. I will immediately give you 200 fruits of the womb for free. I can also guarantee that you will be able to make a breakthrough soon.”<br/><br/>“HMM?”<br/><br/>“Join the Dragon Palace and you, the Dragon King, will be your leader?”<br/><br/>Demonic wings stared at Wang Xian and his expression changed slightly!<br/><br/>Wang Xian smiled and nodded. “If both of you agree, I can give you the fruits First!”<br/><br/>“Alright. If taking the fruits can really help me achieve a breakthrough in my strength, I am willing to join the Dragon Palace and you, the Dragon King, will be my leader!”<br/><br/>Ming Shasheng’s expression changed slightly as he spoke to Wang Xian!<br/><br/>“Sure. If you join the Dragon Palace, I won’t mistreat the two of you!”<br/><br/>As Wang Xian spoke, he waved his arm and 400 normal fetus fruits flew towards them!<br/><br/>“Huh?”<br/><br/>Demon Wings was stunned when he saw the normal fetus fruits flying towards him.<br/><br/>The Dragon King gave him 200 before he agreed to it?<br/><br/>This Is?\t\t\t\t\t\t</div>", "images": {}, "success": true}