{"id": 706, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073313.html", "title": "Chapter 3697 - 3697 3696 Was Shocked!", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3697 - 3697 3696 Was Shocked!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3697 3696 was shocked!<br/><br/>The powerhouses like the fiery vanishing sky, Gardecker Angel, and the rest felt their scalps go numb!<br/><br/>They felt their hearts beating violently!<br/><br/>These seven mad demons were actually the subordinates of the Dragon King!<br/><br/>This… how were they supposed to destroy the Dragon King?<br/><br/>Not to mention suppressing him!<br/><br/>With the seven mad demons and the Dragon King’s strength, they were no longer a match for him!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Just as Wang Xian finished his sentence, Wu Sha and the rest started to move.<br/><br/>The seven mad demons immediately surrounded them to prevent them from escaping!<br/><br/>Wang Xian stood there with a faint smile on his face!<br/><br/>The group of powerhouses from the angel race, along with the group of powerhouses from the Phoenix race, there were more than 800 level 3 battle-power masters who were masters of the universe. This was a huge boost to the Dragon Palace!<br/><br/>If they were all eliminated, the Dragon Palace would definitely receive a huge boost!<br/><br/>Of course, in his heart, Wang Xian already regarded them as the resources of the Dragon Palace!<br/><br/>“This… this is unbelievable. Seven Mad Demons and seven mad demons were all subdued by the Dragon King. All of them actually submitted to the Dragon King!”<br/><br/>“This is unbelievable. The Mad Demons of the Invincible Zone actually submitted to the Dragon King, and there were seven of them!”<br/><br/>“How did the Dragon King subdue them? With the seven mad demons submitting to the Dragon King, together with the mad restriction and the mad demons killed by the Dragon King, wouldn’t 90% of the Mad Demons of the invincible zone be suppressed by the Dragon King?”<br/><br/>At this moment, all the Old Monsters of the Invincible Zone who were watching the battle from afar were completely shocked!<br/><br/>This was a huge earthquake for them and the entire invincible zone!<br/><br/>The Dragon King of the Dragon Palace had made the entire invincible zone submit to him alone!<br/><br/>And the experts of the angel race and the Phoenix race wanted to kill the Dragon King?<br/><br/>It was impossible!<br/><br/>What they needed to consider now was to run!<br/><br/>Run for their lives!<br/><br/>“We can’t kill the Dragon King Anymore!”<br/><br/>Gardecker’s Angel looked at the fire vanishing sky fire eagle and the others and secretly transmitted his voice!<br/><br/>“Retreat!”<br/><br/>They didn’t hesitate at all!<br/><br/>If they couldn’t kill the Dragon King, then there was no need to make a move!<br/><br/>They only needed to report this matter to their third Prince and Qingjiang Phoenix!<br/><br/>This was already not a mission they could complete!<br/><br/>With seven crazy demon subordinates, the Dragon King was invincible in the invincible region. Unless their strength could be doubled, it would be difficult to destroy the Dragon King!<br/><br/>“Go!”<br/><br/>The Fire Eagle Phoenix growled and ordered all the experts!<br/><br/>“CHIRP CHIRP CHIRP!”<br/><br/>He flapped his Phoenix Wings and prepared to escape!<br/><br/>“Since you’re already here, just stay here!”<br/><br/>The demonic wings sneered when he saw that they were trying to escape!<br/><br/>He flapped his huge wings and arrived at their escape route!<br/><br/>Lei Shan also relied on his terrifying speed to block their escape route in an instant!<br/><br/>“Hehe, your Phoenix tribe was very arrogant just now. Therefore, I shall slaughter a fire Phoenix First!”<br/><br/>Wang Xian looked at them trying to escape with a cold expression on his face.<br/><br/>His gaze locked onto the Fire Eagle Phoenix, and the incipient holy wings appeared behind him!<br/><br/>Whoosh<br/><br/>The incipient holy wings were flapped, and Wang Xian’s figure disappeared instantly!<br/><br/>The next moment, he arrived above the Fire Eagle Phoenix. The distance between them was only about a thousand meters!<br/><br/>With such a terrifying speed, the Fire Eagle Phoenix didn’t even have the time to react!<br/><br/>“You said that I don’t even have the right to be your enemy. You said that you can destroy me easily!”<br/><br/>Wang Xian stared at the fire hawk Phoenix below and said calmly!<br/><br/>Wang Xian suddenly disappeared and his voice entered the fire hawk Phoenix’s ears. It happened in an instant!<br/><br/>All the old monsters and powerhouses present didn’t manage to react in time!<br/><br/>When the fire hawk heard the voice that was close to his ears and sensed Wang Xian’s figure, his pupils dilated rapidly. He immediately raised his head!<br/><br/>His gaze met with a pair of teasing eyes!<br/><br/>This made the heart of the fire eagle and Phoenix tighten. His eyes were filled with fear and shock!<br/><br/>“How is this possible?”<br/><br/>He couldn’t help but Roar!<br/><br/>How is this possible?<br/><br/>Why did the Dragon King suddenly appear in the sky above him?<br/><br/>“I can easily destroy a phoenix like you!”<br/><br/>Wang Xian stared at the fire eagle and Phoenix as he continued to speak indifferently!<br/><br/>He moved his palm and a grey long saber slashed towards his neck!<br/><br/>The speed of the long saber was very fast, and they were very close to each other.<br/><br/>It was so close that the Fire Eagle Phoenix couldn’t react at all!<br/><br/>“No!”<br/><br/>He could let out a wild roar. There was a hint of trembling in his voice, along with a strong sense of fear!<br/><br/>“PFFT!”<br/><br/>However, before he could finish his sentence, the long saber had already landed on his neck and chopped off his Phoenix head!<br/><br/>“Ahhhhh!”<br/><br/>The falling head was not a serious injury to a powerhouse of this level.<br/><br/>However, the intense pain and fear in his heart caused the Phoenix to let out an intense scream!<br/><br/>“With your strength, you still dare to tell me that I can kill you easily?”<br/><br/>Wang Xian stared at him. His face was filled with mockery and disdain!<br/><br/>With his current strength, he could easily kill a crazy demon!<br/><br/>And this fellow still dared to be impudent in front of him?<br/><br/>“No, no, no, don’t kill me!”<br/><br/>The Fire Eagle and Phoenix roared with despair. Their heads and bodies frantically fled into the distance!<br/><br/>“Naive, you still want to escape?”<br/><br/>Wang Xian flapped his divine wings. His figure instantly arrived at the head of the Fire Eagle and Phoenix. He stretched out his arm and transformed it into a dragon claw. He grabbed it directly and the destructive force surged towards its head!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Boom! Boom! Boom<br/><br/>The body that had lost its head flapped its huge wings violently. Waves of terrifying phoenix flames spread out in all directions!<br/><br/>Wang Xian’s eyes turned cold when he saw this!<br/><br/>He moved his body and waved his dragon claw. A huge grayish dragon claw grabbed onto the Phoenix’s headless body. The huge Dragon Claw clenched hard!<br/><br/>The Phoenix Flames on his body started to extinguish at a terrifying speed!<br/><br/>The extinguishing of the fire Phoenix’s life flames meant that he was completely annihilated!<br/><br/>However, Wang Xian did not kill him completely!<br/><br/>Instead, he threw it casually and a huge net enveloped it.<br/><br/>Wang Xian wanted to make it summon its divine kingdom before exterminating it!<br/><br/>“Hiss!”<br/><br/>“What kind of strength is this?”<br/><br/>At the same time, Wang Xian flipped his hand and suppressed a fire phoenix that was on the level of a mad demon. This caused the bodies of all the experts around to tremble violently!<br/><br/>Even Gardner’s Angel and the Fire Vanishing Heaven Phoenix trembled as they felt darkness before their eyes!<br/><br/>The Fire Eagle Phoenix was an existence that was comparable to a mad demon!<br/><br/>Such a terrifying expert was suppressed just like that?<br/><br/>He didn’t have the slightest bit of resistance!<br/><br/>He was like a toy!<br/><br/>Fear spread!<br/><br/>Despair filled their hearts!<br/><br/>Shock!\t\t\t\t\t\t</div>", "images": {}, "success": true}