{"id": 707, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073315.html", "title": "Chapter 3698 - 3698 3697’S Invincible Posture", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3698 - 3698 3697’S Invincible Posture</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3698 3697’s invincible posture<br/><br/>He destroyed a mad demon level existence with a flip of his hand?<br/><br/>When everyone saw this scene, their faces were filled with astonishment!<br/><br/>What kind of strength was this?<br/><br/>Was this the Dragon King’s strength?<br/><br/>“How is this possible? Fire Eagle is a mad demon level existence. Such a powerful existence couldn’t even put up a fight in front of Wang Xian!”<br/><br/>Huo Min Tian’s face was filled with fear as he growled in a low voice.<br/><br/>Such an expert was easily suppressed by the Dragon King!<br/><br/>What about them?<br/><br/>“Hiss, is this the true strength of the Dragon King? With such strength, how can an expert from the invincible zone resist?”<br/><br/>“That Fire Phoenix is an existence on the level of a mad demon. It was easily killed by the Dragon King like a toy. Such strength is enough to make one despair!”<br/><br/>“The Dragon King is so powerful. The mad demon easily suppressed it. No wonder the old witch and the others would submit to the Dragon King. No wonder!”<br/><br/>“With such terrifying strength, even if the old witch, water demon, and the other experts didn’t come over, even if the Dragon King fought against the experts of the angel and Phoenix clans alone, he wouldn’t be afraid at all, right? This strength is too strong!”<br/><br/>In the surrounding area, all the old monsters were so shocked that they couldn’t control themselves!<br/><br/>With such terrifying strength, they felt that the Dragon King alone was able to fight against the powerhouses from the angel and Phoenix clans!<br/><br/>“Damn it, is he the real ruler?”<br/><br/>Gardner’s angel stared at Wang Xian, and his forehead was filled with cold sweat!<br/><br/>The angels around him were also filled with fear!<br/><br/>“Break through! Run!”<br/><br/>Huo Min Tian let out a low roar and let out a crazy roar!<br/><br/>Run!<br/><br/>The crazy demon-level experts on their side were easily suppressed. The strength displayed by the Dragon King caused them to be filled with despair!<br/><br/>At this moment, they could only run!<br/><br/>Run for their lives!<br/><br/>Otherwise, they would be completely finished!<br/><br/>“Run! Run!”<br/><br/>The dozen or so angels of the angel race also let out a low roar. They waved their arms and a powerful army of angels protected their surroundings. Immediately, they broke through in the direction of the outer perimeter of the invincible region!<br/><br/>“Attack, don’t be entangled by these crazy demons!”<br/><br/>Gardecker Angel looked at the Lightning Flash Demon Wings and the others who were blocking their path and roared crazily!<br/><br/>At this moment, they began to fight with their lives on the line!<br/><br/>“CHIRP CHIRP CHIRP!”<br/><br/>The forty to fifty water phoenixes looked at each other in fear. They immediately controlled the Phoenix totem behind them and flew forward.<br/><br/>The gigantic water phoenix totem flapped its wings. The flow of water energy made it look exceptionally beautiful!<br/><br/>Waves of water mist spread out in the surroundings.<br/><br/>They wanted to escape immediately!<br/><br/>Buzz<br/><br/>Wang Xian stood in the air and looked at the group of powerhouses from the Angel Race and Phoenix race who were desperately trying to escape. A cold smile appeared on his face!<br/><br/>He waved his arm!<br/><br/>Buzz! Buzz! Buzz<br/><br/>The Five Elements Millstone and the Tai Chi Dragon Disc on the old witch immediately flew towards him!<br/><br/>The Tai Chi Dragon Disc was circling around him while the five elements millstone was suspended above his head!<br/><br/>Wang Xian raised his arm and a vast force of the five elements surged into the interior of the Five Elements Millstone!<br/><br/>He waved his arm and aimed at the Water Phoenix Totem.<br/><br/>Boom<br/><br/>At the next moment, the Five Elements Millstone brought along a terrifying force and directly attacked the Water Phoenix Totem!<br/><br/>With the support of Wang Xian, the Tai Chi Dragon Disc had a destructive force that was comparable to a level two master of the Universe!<br/><br/>“This is bad!”<br/><br/>“This is bad. The Dragon Palace has locked onto us. Save Us!”<br/><br/>Forty to fifty water phoenixes looked terrified when they saw the terrifying tai chi dragon disc attacking them!<br/><br/>They quickly turned around and controlled the huge Phoenix Totem!<br/><br/>“CHIRP CHIRP CHIRP!”<br/><br/>The Water Phoenix Totem let out a cry. It opened its mouth and waves of water energy that were like flames attacked the Tai Chi Dragon Disc!<br/><br/>“Boom Boom Boom Boom!”<br/><br/>The next moment, a violent collision sound was heard. Waves of water attribute flames landed in front of the five elements millstone and were quickly extinguished by the energy!<br/><br/>The five elements millstone carried a powerful might as it continued to attack the Water Phoenix Totem.<br/><br/>“We can’t defend against it. The Dragon King’s strength is not something we can contend against. We can’t defend against this terrifying treasure!”<br/><br/>A Water Phoenix roared with a face full of Panic!<br/><br/>“There are no experts who can support us. Continue to attack, Phoenix Water Flower!”<br/><br/>Their eyes were slightly red as they roared. The Water Phoenix totem emitted a blue light. An Ice Phoenix seemed to have formed as it once again attacked the five elements Millstone!<br/><br/>“Ka Ka Ka!”<br/><br/>However, the moment they collided, it quickly collapsed!<br/><br/>“Hong!”<br/><br/>The Five Elements Millstone carried an invincible might as it directly arrived in front of the Water Phoenix Totem. A terrifying destructive power surged towards the Phoenix Totem!<br/><br/>“Weng Weng Weng Weng!”<br/><br/>The Water Phoenix totem quickly collapsed under the attack of the Five Elements Millstone.<br/><br/>Finally, a scroll was left in the sky, a scroll of the Water Phoenix!<br/><br/>“PFFF! PFFF! PFFF!”<br/><br/>Below them, the water phoenixes who were suffering from the energy backlash spat out a huge mouthful of blood!<br/><br/>They were severely injured!<br/><br/>One strike, and another effortless strike. It directly destroyed the water phoenix totem which was comparable to the level of a mad demon!<br/><br/>Wang Xian looked at this scene and revealed a faint smile on his face!<br/><br/>He controlled the attack of the five elements grinding mill. It was even stronger than the full-force attack of an ordinary master level two expert!<br/><br/>It was also very easy to destroy the Water Phoenix Totem!<br/><br/>“Hahaha, the Dragon King is mighty. You should just obediently accept your death. It’s your stupidest decision to kill Our Dragon King!”<br/><br/>Lei Shan roared and moved, directly attacking the Army of angels in front of him!<br/><br/>“So what if it’s the angel race or the Phoenix Race? Die, Lotus of death, Bloom!”<br/><br/>The old witch held her staff in her hand, and a massive lotus of death formation condensed, directly blasting towards the group of Phoenix clan experts in front!<br/><br/>Ming shisheng, Shi Sen, demonic wings, water demon, and the others also charged towards them at the same time!<br/><br/>The baleful aura and terrifying power emitted from their bodies caused the angel clan and Phoenix clan experts to tremble violently!<br/><br/>“The Water Phoenix Totem was easily defeated by the Dragon King. The Dragon King is too powerful. He’s too powerful. There’s no way to defend against him!”<br/><br/>“We’re finished. If the Dragon King continues to attack, none of us will be able to escape!”<br/><br/>At this moment, they discovered something that made them despair!<br/><br/>The Dragon Palace had made two moves. One was to easily suppress the Fire Eagle Phoenix, and the other was to directly destroy the Water Phoenix Totem!<br/><br/>After making two moves, they were short of two powerful combat powers!<br/><br/>The Dragon King’s strength was so powerful that it made one’s hair stand on end!<br/><br/>If he continued to make moves, how would they win?<br/><br/>They even knew that the Dragon King would not let them leave!<br/><br/>He would not let them go!<br/><br/>At the thought of this, they almost lost their fighting spirit!<br/><br/>“You’re next!”<br/><br/>Wang Xian stood in the air and shifted his gaze to Gardecker’s Angel!<br/><br/>This was the leader of the Angel clan and the one who arrogantly said that he wanted to destroy them!\t\t\t\t\t\t</div>", "images": {}, "success": true}