{"id": 708, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073317.html", "title": "Chapter 3699 - 3699 In The Invincible Stance Of 3698", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3699 - 3699 In The Invincible Stance Of 3698</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3699 In the invincible stance of 3698<br/><br/>“Kill, Kill, kill, escape!”<br/><br/>The location of the exchange venue had become a battlefield. The powerhouses from the angel race and the Phoenix race were roaring crazily!<br/><br/>They were flying desperately towards the periphery of the invincible zone!<br/><br/>Wang Xian’s two attacks had caused them to completely collapse!<br/><br/>Now, they were not dying in silence. They were exploding in silence!<br/><br/>There was no time for hesitation. Run, Run Now!<br/><br/>Run for your lives!<br/><br/>The dozen angels of the Angel race used the battle angels as their sharp blades, trying to fight their way out!<br/><br/>At this moment, they completely disregarded the loss of the battle angels!<br/><br/>As long as they could get out of here alive, they would be lucky!<br/><br/>Wang Xian’s gaze locked onto Gardecker’s Angel. A smile appeared on his face as he flapped his genesis Saint Wings and flew towards him!<br/><br/>“Gardner’s Angel, right? I thought you mentioned earlier that you wanted to destroy him!”<br/><br/>Wang Xian’s flying speed was very slow. It was almost the same as an ordinary level three master of the universe!<br/><br/>He looked very relaxed. It was as though he was not in a battlefield but taking a stroll in his own backyard!<br/><br/>As he spoke leisurely, his voice entered Gardner’s ears!<br/><br/>His tone was as though he was talking to an old friend!<br/><br/>However, when Gardecker heard Wang Xian’s words, his body trembled violently!<br/><br/>He turned his head and looked at Wang Xian who was flying towards him. His eyes were filled with despair!<br/><br/>“Dragon King, if you dare to kill us, Our Angel tribe will not let you off. Our third prince will not let you off!”<br/><br/>Gardecker’s angel shouted in a threatening manner!<br/><br/>“Won’t let me off? Third Prince? Hehe!”<br/><br/>Wang Xian’s eyes sparkled and were filled with a cold expression.<br/><br/>“Your Angel tribe tried every means to kill me and destroy my Dragon Palace. Aren’t all your lackeys dead now? Do you think I won’t dare to kill you just because you used the name of the Angel tribe and the name of the third Prince?”<br/><br/>As Wang Xian spoke, he flew over!<br/><br/>“Kill, Kill, Kill!”<br/><br/>Gardecker’s expression changed drastically when he saw Wang Xian approaching. He ordered the Angel Army around him!<br/><br/>More than a hundred battle angels with level-three combat strength, the Masters of the universe, charged at Wang Xian rapidly!<br/><br/>Wang Xian looked over and a mocking expression appeared on his face!<br/><br/>Waves of destructive energy circulated around his body as the battle angels charged at him. The moment they got close to him, their bodies stiffened and their vitality quickly disappeared!<br/><br/>It couldn’t get close to Wang Xian at all!<br/><br/>At this moment, the battle between an ordinary level three universe master and Wang Xian was already too huge!<br/><br/>This was like the difference between an ordinary peak universe knight and a level two universe master!<br/><br/>How could an ordinary peak universe knight fight against a level two universe master?<br/><br/>Even if they had a large number, it would still be difficult for them to break through Wang Xian’s defense!<br/><br/>As for Wang Xian, all he needed to do was to release waves of destructive energy. If they were to get close to him, they would be able to kill him instantly!<br/><br/>Wang Xian flew towards Gardner’s angel without any obstruction!<br/><br/>“No, no, no!”<br/><br/>Gardner’s angel trembled violently when he saw Wang Xian approaching him continuously!<br/><br/>He retreated as despair lingered in his heart!<br/><br/>“Do you think you can escape today?”<br/><br/>Wang Xian stared at him and said with disdain!<br/><br/>“No, don’t kill me!”<br/><br/>Gardecker Angel was on the verge of breaking down as he roared. When he saw that Wang Xian had already flown to their side, he raised the huge sword in his hand and slashed at Wang Xian!<br/><br/>Wang Xian raised his palm and easily caught the huge sword. He stared at Gardecker Angel indifferently.<br/><br/>He exerted force with his palm and snatched the huge sword over. He stared at Gardecker Angel calmly!<br/><br/>His arm turned into a dragon claw and grabbed Gardecker Angel in his hand!<br/><br/>Faced with Wang Xian’s irresistible force, Gardecker Angel’s body trembled non-stop!<br/><br/>“Soul Catcher!”<br/><br/>Wang Xian stared at him and his mind stirred!<br/><br/>Gardecker Angel, who had completely collapsed, started to lose focus. His expression quickly turned sluggish!<br/><br/>“Gardecker Angel, send a message to your third prince immediately. Tell him that sooner or later, I will kill you and Rip Off Your Bird Wings!”<br/><br/>Wang Xian spoke to Angel Gardecker calmly!<br/><br/>The soul-possessed Angel Gardecker took out his universe artificial brain mechanically and sent a message to the third prince!<br/><br/>“Hehe!”<br/><br/>When Wang Xian saw him sending the message, a smile appeared on his face. With a wave of his arm, Gardecker’s body was directly thrown beside the Fire Eagle Phoenix!<br/><br/>After he was done, his gaze swept across the entire battlefield once again. His gaze landed on the Fire Eagle Phoenix!<br/><br/>“That Fire Phoenix, should I go over and kill you, or do you have to come over obediently?”<br/><br/>Wang Xian’s voice rang out and reached the ears of fire vanishing heaven!<br/><br/>At the same time, it also reached the entire battlefield. When Fire Vanishing Heaven heard this sentence, he looked over and swallowed a mouthful of saliva!<br/><br/>At this moment, the entire battlefield fell silent. There were even quite a number of experts who stopped their escape and looked in Wang Xian’s direction!<br/><br/>Gardecker Angel was being suppressed by Wang Xian. Many experts could feel it!<br/><br/>This could no longer be called suppression. It should be called crushing to death!<br/><br/>And the Dragon King’s words were also a form of judgment for the Fire Vanishing Heaven Phoenix!<br/><br/>A form of judgment that followed the law!<br/><br/>The angel race was judging the Dragon King?<br/><br/>This was the Dragon King judging the angel race and the Phoenix race!<br/><br/>“Cough cough, cough cough!”<br/><br/>Huo Min Tian let out a strange sound when he saw Wang Xian staring at him.<br/><br/>His eyes were filled with fear as he looked at Wang Xian!<br/><br/>Wang Xian was also looking at him in the same way. He was just looking at him calmly!<br/><br/>“This…”<br/><br/>“This is not a battle of the same level. Just the Dragon King alone can easily suppress all their powerhouses!”<br/><br/>“Invincible posture, invincible posture. The Dragon King stood there as if he was not standing on the battlefield, but standing high above in his own divine kingdom, judging some reckless people!”<br/><br/>“The Dragon King is simply invincible. Even when the battle broke out, the Dragon King did not take them seriously. He casually attacked and easily killed many experts. The gap is too big!”<br/><br/>Around the exchange venue, a group of old monsters from the invincible region who were watching watched this scene in astonishment.<br/><br/>At this moment, the battlefield was like a chessboard, and the Dragon King was a chess player. Whoever wanted to die would die!<br/><br/>He stood there invincible as though he was not affected by the war!<br/><br/>The experts from the Angel clan and the Phoenix clan were like ants at this moment!<br/><br/>“Dragon King, can you spare my life?”<br/><br/>Huo Min Tian looked at Wang Xian in despair and suddenly begged!<br/><br/>“What do you think? Hehe!”<br/><br/>Wang Xian laughed mockingly and flew towards him slowly!<br/><br/>He was still as calm as ever. It was as if he was taking a stroll and arrived in front of Huo Min Tian!<br/><br/>At this moment, Huo Min Tian didn’t even have the courage to resist. He slowly closed his eyes.<br/><br/>He was ready to receive Wang Xian’s judgment!<br/><br/>Buzz<br/><br/>Wang Xian stretched out his dragon claw and grabbed him. At the same time, he used the soul capturing technique!<br/><br/>Waves of information entered Wang Xian’s mind!<br/><br/>“Clear River Water Phoenix!”<br/><br/>A few seconds later, Wang Xian spat out five words softly!\t\t\t\t\t\t</div>", "images": {}, "success": true}