{"id": 705, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073311.html", "title": "Chapter 3696 - 3696 3695 Dragon King, We’Re Here! Let’S Go", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3696 - 3696 3695 Dragon King, We’Re Here! Let’S Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3696 3695 Dragon King, we’re here! Let’s Go<br/><br/>Wang Xian was about to make his move when he suddenly stopped!<br/><br/>The group of experts from the Angel clan and Phoenix clan who were surrounding Wang Xian also stopped at this moment!<br/><br/>They could sense that there was a terrifying expert flying towards them from the other side of the long river!<br/><br/>“There’s more than one expert!”<br/><br/>Fire Eagle Phoenix was the first to sense it. He looked towards the other side with his eyes shining brightly!<br/><br/>“Huh?”<br/><br/>Gardecker angel, Huo Min Tian, and the rest of the powerhouses also sensed it. They looked over!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>In their line of sight, seven figures were flying towards them at a terrifying speed!<br/><br/>They did not deliberately release their aura. However, all the powerhouses could sense a palpitating danger from their bodies!<br/><br/>The change in Wang Xian and the rest had also attracted the attention of the old monsters of the Invincible Zone who were watching the scene. They too looked towards the direction of the long river!<br/><br/>“This is? This Is?”<br/><br/>All of a sudden, an exclamation was heard. An expert of the invincible zone stared at the seven figures with a face full of shock. His eyes were filled with disbelief!<br/><br/>“It’s the crazy demons! It’s the crazy demon wings, the Crazy Demon Stone Forest, the crazy demon water demon, and the Crazy Demon Ghost! The crazy demon old witch! The Crazy Demons cover the sky! The Crazy Demon Lightning Flash! It’s them! What’s going on? They…”. “Why are all seven of them together?”<br/><br/>“Also, wasn’t the old witch killed by the Dragon King? Didn’t she die? wasn’t she killed by the Dragon King?”<br/><br/>The shocked voice made everyone’s eyes widen!<br/><br/>Crazy Demons and seven crazy demons flew over at the same time. This force was even stronger than the experts of the Phoenix clan and the Angel clan!<br/><br/>After all, they were the most powerful and invincible existences in the Invincible Zone!<br/><br/>Now that they had gathered together and flew over, everyone was shocked!<br/><br/>“Eh? Seven Mad Demons?”<br/><br/>When Huo Min Tian, gardecker, and Fire Eagle saw the seven mad demons flying over, their eyes were filled with a solemn expression!<br/><br/>With seven mad demons gathered together, no one in the invincible zone dared to look down on them!<br/><br/>“Why are the seven mad demons gathered together? The old witch isn’t dead yet. Could it be that they are here to deal with the Dragon King?”<br/><br/>An old monster guessed and said!<br/><br/>“It’s really possible!”<br/><br/>His words received the approval of the surrounding experts. Wasn’t it to deal with the Dragon King?<br/><br/>Then what was it for?<br/><br/>It was almost 100% to find the Dragon King!<br/><br/>As for why, it was self-evident!<br/><br/>“Oh? To deal with the Dragon King?”<br/><br/>Gardecker’s angel heard the exclamations around him and slightly raised his eyebrows. He also thought that this was the case!<br/><br/>The old witch had a feud with the Dragon King. This was something that all the experts in the Invincible Zone knew!<br/><br/>Now, the old witch had joined forces with the other crazy demons and gathered six other crazy demons to look for the Dragon King under the pretext of consuming the ordinary fetus fruit. This was also possible!<br/><br/>“If the seven crazy demons make a move, although they can definitely kill the Dragon King, there is a possibility of conflict because of consuming the ordinary fetus fruit. Crazy Demons are not so easy to deal with!”<br/><br/>Huo Min Tian looked at the seven mad demons who were getting closer and closer and frowned slightly!<br/><br/>“Boom! Boom! Boom!”<br/><br/>At this moment, Wu Sha and the other three arrived in front of the trading ground. They stopped in the air and looked around with shining eyes!<br/><br/>“Old Witch, this Dragon King belongs to us. I hope you don’t interfere!”<br/><br/>Gardecker’s angel stared at Wu Sha and the others and said, “This Dragon King has a grudge with our Angel clan. He must be killed by us!”<br/><br/>As Angel Gardecker spoke, the gazes of all the experts in the surroundings also focused on him.<br/><br/>This was a conversation between two powerful factions!<br/><br/>It was a conversation about splitting up the Dragon King!<br/><br/>From the looks of it now, the Dragon King was going to die completely today!<br/><br/>He was going to die completely in the invincible zone!<br/><br/>“Hehe!”<br/><br/>When Wu Sha Heard Angel Gardecker’s words, he smiled coldly and looked at Wang Xian. He bowed slightly and said, “Dragon King, we are here!”<br/><br/>“Dragon King, there are some reckless people who want to deal with you. We will help you kill them!”<br/><br/>Water demon spat out his cold words. The water flow on his body changed and formed a huge face!<br/><br/>“There are actually people who dare to deal with our Dragon King. They are really courting death. Dragon King, leave these guys to us!”<br/><br/>Ming shasheng also smiled coldly. His body flickered and numerous ghost avatars flew out from his body. His body was filled with violent killing intent!<br/><br/>“Haha, My Body Isn’t moving within the domain of the space behemoth. Perfect timing. You actually dare to deal with our Dragon King. Haha!”<br/><br/>Shi Sen also laughed wildly. His body rapidly expanded, forming a huge stone giant!<br/><br/>The seven mad demons all moved. A murderous aura that was like blood and hell spread out in all directions!<br/><br/>The entire void seemed to have frozen in an instant!<br/><br/>At this moment, everyone seemed to have really been frozen!<br/><br/>They stared blankly at the old witch water demon and the seven mad demons, and listened to their words in a daze!<br/><br/>Their pupils slowly began to dilate!<br/><br/>“What’s going on?”<br/><br/>After a full five seconds of silence, an expert cried out involuntarily!<br/><br/>What’s going on?<br/><br/>The old witch water demon, Ming Shisheng, and the seven mad demons actually cupped their hands and addressed the Dragon King directly?<br/><br/>They actually bowed to the Dragon King and respected him?<br/><br/>They were actually so respectful to the Dragon King?<br/><br/>This? ? ? ?<br/><br/>These were seven mad demons!<br/><br/>What the hell was going on?<br/><br/>The seven mad demons had submitted to the Dragon King?<br/><br/>“Hiss!”<br/><br/>The sound of gasping could be heard continuously. All the experts stared at this scene!<br/><br/>“What? How is this possible?”<br/><br/>When Gardecker Angel heard the words of the old witch and the other mad demons, his body trembled violently and he roared in disbelief!<br/><br/>How was this possible?<br/><br/>The old witch and the others had actually submitted to the Dragon King?<br/><br/>This was impossible!<br/><br/>They were crazy demons. How could they be so easily subdued?<br/><br/>They were extremely crazy when they fought. They weren’t even afraid of death. How could they be subdued?<br/><br/>Even if the dragon king had the common embryo fruit, the possibility of subduing the crazy demons was very small!<br/><br/>The expressions of the fire vanishing sky fire eagle and the rest of the Phoenix Angels changed drastically at this moment.<br/><br/>Their hearts pounded violently as they had a bad premonition in their hearts!<br/><br/>“You guys came at the right time. From now on, none of the powerhouses from the Phoenix and Angel clans can escape!”<br/><br/>Wang Xian spoke and instructed them indifferently!<br/><br/>“It’s the Dragon King!”<br/><br/>Wu Sha, Ming Sha and the other crazy demons immediately replied respectfully!<br/><br/>This scene once again caused all the experts of the invincible zone to be filled with shock!<br/><br/>The seven crazy demons had submitted to the Dragon King!<br/><br/>This was simply terrifying!<br/><br/>Such a dragon king could easily sweep through the entire invincible zone!<br/><br/>“Oh no!”<br/><br/>“Not good!”<br/><br/>At this moment, Gardecker’s angel, Huo Min Tian, and the other experts’expressions changed drastically!<br/><br/>They are in trouble!\t\t\t\t\t\t</div>", "images": {}, "success": true}