{"id": 702, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073305.html", "title": "Chapter 3693 - 3693 3692 Surrounded Them", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3693 - 3693 3692 Surrounded Them</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3693 3692 surrounded them<br/><br/>“Did the third prince ask the experts of the Phoenix tribe for help?”<br/><br/>More than ten angels looked at the group of people from the Phoenix tribe and the more than one hundred experts with shining eyes!<br/><br/>They glanced over one by one and found that there were 431 of them!<br/><br/>They didn’t see any mad demon level existences!<br/><br/>However, they felt a majestic energy from the huge fire Phoenix Egg!<br/><br/>“Brother Fire Vanishing Heaven, you should know the latest information about the Dragon King, right?”<br/><br/>Gardecker’s Angel’s gaze fell on the fire phoenix and said, “Our mission this time is to destroy the Dragon King. We can’t afford to make any mistakes. We have to cooperate well this time!”<br/><br/>“Dragon King? With our strength, we can directly kill the Dragon King!”<br/><br/>Huo Min Tian looked at them and said confidently!<br/><br/>“Oh?”? Brother Huo Min Tian didn’t get the latest information about the Dragon King, right? The Demon Breaker Circle that surrounded the golden crow and Crazy Demon were all killed by the Dragon King. Moreover, it’s basically confirmed that the old witch died at the Dragon King’s hands. With your strength, it might be a little difficult to kill the Dragon King 100% !”<br/><br/>Angel Gardecker raised his eyebrows and sized up the other party’s strength once again!<br/><br/>“Oh?”<br/><br/>Fire Vanishing Heaven raised his eyebrows slightly. “Our strength, when combined, is comparable to five mad demons. We should be able to destroy the Dragon King!”<br/><br/>“Five Mad Demons?”<br/><br/>Angel Gardecker revealed a surprised expression. “Five mad demons have a very high chance of destroying the Dragon King, but it’s still not 100% . But with us, it’s enough!”<br/><br/>“The Dragon King’s strength is indeed out of our expectations. We are all here to complete our mission. Naturally, we can not afford to have any mishaps. Gardecker’s Angel, how strong are you guys?”<br/><br/>Huo Min Tian swept his gaze over them and asked indifferently!<br/><br/>“Our side is not as strong as yours. We should be able to deal with four mad demons, right?”<br/><br/>Gardecker Angel said, a smile appeared on his face. “With such strength, we can already kill a ruler tier 2 existence. However, according to the information we received, the Dragon King’s speed is very fast. We can’t let them escape. In addition, we need to understand the situation on both sides first.”<br/><br/>“We have a water phoenix totem. We have fifty water phoenixes. Using treasures, we can burst out with the power of a Mad Demon!”<br/><br/>Beside the Fire Vanishing Heaven Phoenix, a Water Phoenix spoke indifferently!<br/><br/>“Behind me, there is a senior who is undergoing a special nirvana. Once a battle breaks out, he will break out of his shell and his strength will be comparable to a mad demon!”<br/><br/>Fire Vanishing Heaven looked at Gardecker Angel and continued to add!<br/><br/>“Our side is mainly the Angel Army. There are about 500 level 3 battle angels that are universe overlords!”<br/><br/>Gardecker’s Angel replied!<br/><br/>“Alright, that’s enough. In addition, we need to talk about the distribution of the normal fetus fruits in the Dragon King’s hands!”<br/><br/>Huo Min Tian said directly, “We want 60% of the normal fetus fruits!”<br/><br/>“HM?”<br/><br/>Gardecker’s Angel raised his eyebrows slightly when he heard his words, “Brother Huo Min Tian, it’s impossible for the Dragon King to bring the normal fetus fruits with him. There’s a high chance that he’s keeping them in his own divine kingdom!”<br/><br/>“Then we’ll suppress him and force him to bring out the fruits. Isn’t that enough?”<br/><br/>Fire Vanishing Heaven said indifferently as if he was talking about an insignificant matter!<br/><br/>Suppression and beheading were two different concepts!<br/><br/>The former was undoubtedly much more difficult than beheading!<br/><br/>However, Fire Vanishing Heaven’s face was filled with confidence as if it was a piece of cake!<br/><br/>“Hehe, indeed. With our strength, it’s very easy to suppress the Dragon King. Not long ago, we were planning to use another method to obtain some fruits. Since that’s the case, we have no objections if you guys take 60% !”<br/><br/>Gardecker Angel smiled and agreed!<br/><br/>“Alright, we have to make some preparations in advance. In order to prevent the Dragon King from escaping, we have to surround him first!”<br/><br/>Fire Vanishing Heaven said!<br/><br/>Gardecker angel nodded, “This is the most important problem. After the Dragon King sees our power, he will definitely think of a way to escape. Therefore, we can not let him escape. We have to surround the surroundings!”<br/><br/>“If that’s the case, then let’s Get Ready. We have to plan well. In addition, we will find dozens of people to buy the fruits to divert the Dragon King’s attention!”<br/><br/>Huo Min Tian ordered!<br/><br/>Gardecker nodded. The group of people moved and immediately flew towards the trading area!<br/><br/>“Seal the surrounding space. Seal all eight directions and then approach at the same time!”<br/><br/>The group of experts came to a spot hundreds of billions of kilometers in front of the trading ground and said!<br/><br/>“I need a day to wake Senior Fire Eagle Up. Give me a day!”<br/><br/>Fire Vanishing Heaven said to Gardecker Angel and the others!<br/><br/>“Brother Fire Vanishing Heaven, you need to prepare in advance!”<br/><br/>Gardecker angel frowned slightly. “Don’t drag it out too long. The longer you drag it out, the more unexpected things will happen!”<br/><br/>“Senior Fire Eagle doesn’t have much time to maintain his rationality, so we can’t prepare in advance. There won’t be too many unforeseen circumstances in a day’s time. If there really are any unforeseen circumstances, we will take action in advance. With our strength, there won’t be any problems!”<br/><br/>Fire Vanishing Heaven said faintly.<br/><br/>“Alright!”<br/><br/>Gardecker’s angel nodded.<br/><br/>At the location of the trading venue, Wang Xian didn’t know that a group of experts were gradually surrounding him!<br/><br/>He sat on a chair with a smile on his face as he carried out the transaction with ease!<br/><br/>During this period of time, he had sold more than a thousand serval fruits in his hands. There were less than a thousand serval fruits in his hands now!<br/><br/>As he sat there with ease, time passed bit by bit!<br/><br/>Buzz<br/><br/>A Day passed very quickly. Wang Xian suddenly felt a majestic power of flames coming from the front!<br/><br/>This power of flames was very pure and strong!<br/><br/>However, this power was also very far away from him!<br/><br/>If it wasn’t for his breakthrough this time, he might not have been able to sense it at all!<br/><br/>“To be able to emit such power, he must be an existence on the level of a mad demon. Could it be that he has a mad demon customer?”<br/><br/>Wang Xian thought to himself as he looked ahead with a smile!<br/><br/>“We can start now. Let’s go, Let’s Go!”<br/><br/>At this moment, Huo Min Tian, who was at the front, saw the senior who had broken out of the Phoenix Egg. He cupped his hands and immediately spoke to Angel Gardecker and the rest!<br/><br/>“Alright, let’s Go!”<br/><br/>Angel Gardecker nodded and immediately gestured to his companions around him!<br/><br/>The group of Water Phoenix and the rest of the experts also started to move and flew towards eight different directions!<br/><br/>They wanted to completely surround the Dragon King!<br/><br/>“I can only last for five hours. In five hours, I have to destroy the Dragon King. In addition, I have to obtain enough longevity fruits!”<br/><br/>In the center, the Fire Eagle and Fire Phoenix that had broken out of its shell flapped its huge phoenix wings and said!<br/><br/>“Senior Fire Eagle, with our strength, the Dragon King can instantly suppress us!”<br/><br/>Fire Vanishing Day said with a smile!\t\t\t\t\t\t</div>", "images": {}, "success": true}