{"id": 700, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073301.html", "title": "Chapter 3691 - 3691 Surrounded By The 3,690 People", "volume": 7, "volume_title": "Volume 7", "body": "<h1>Chapter 3691 - 3691 Surrounded By The 3,690 People</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3691 Surrounded by the 3,690 people<br/><br/>Based on Wang Xian’s experience, it was 100% possible for a mad demon to achieve a breakthrough after consuming a large amount of ordinary fruits!<br/><br/>However, it might not be so easy for a top-notch expert!<br/><br/>The probability was less than 10% !<br/><br/>It might even be lower!<br/><br/>“This… The mad demon consumed a large amount of ordinary fruits. is the probability of a breakthrough so crazy?”<br/><br/>“A 99% chance of a breakthrough? This is almost a 100% chance of a breakthrough!”<br/><br/>“Hiss, he’s too strong. However, the Dragon King seems to have said that the crazy demon is a dead man. What does this mean?”<br/><br/>Around them, the old freaks of the invincible zone listened to Wang Xian’s words in shock!<br/><br/>The effect of consuming the ordinary-fetus fruits, the probability of a crazy demon breaking through, and the effect of a top-notch powerhouse consuming it!<br/><br/>The 99% probability of a mad demon shocking them!<br/><br/>At the same time, Wang Xian’s words also shocked them!<br/><br/>He said that crazy demon Jin Xu was a dead man!<br/><br/>This sentence had already revealed a piece of information!<br/><br/>“Crazy Demon Jin Xu is dead. He is the leader of the Demon Breaker Circle. was he killed by the Dragon King?”<br/><br/>“When the Dragon King said this, he obviously meant that crazy demon Jin Xu was killed by him. Oh right, not long ago, I couldn’t contact an expert from the Demon Breaker Circle at all!”<br/><br/>“Indeed, the experts from the demon breaker circle seem to have vanished without a trace recently. Logically speaking, the ancient void God Kingdom isn’t too far away from here, so when they received the news that the Dragon King had sold the eternal fruit, there would definitely be experts coming over. But now, not a single one has come!”<br/><br/>“Could it be? Could it be that even the entire demon breaker circle has been destroyed by the Dragon King?”<br/><br/>At this moment, some of the old monsters thought of the Demon Breaker Circle and scanned their surroundings. They didn’t find any experts from the demon breaker circle and were discussing in astonishment!<br/><br/>It Can’t be?<br/><br/>The Demon Breaker Circle had been destroyed by the Dragon King?<br/><br/>Their eyes flickered!<br/><br/>“The Demon Breaker Circle has indeed been destroyed by me. Alright, let’s start selling it!”<br/><br/>Wang Xian heard the shocked discussions around him and said with a smile on his face!<br/><br/>He had nothing to hide since he had destroyed the demon breaker circle and the Demon Breaker Circle!<br/><br/>If he killed them, so be it!<br/><br/>“Hiss, the demon breaker circle has really been destroyed by the Dragon King?”<br/><br/>“Oh my god, there are more than a hundred experts in the Demon Breaker Circle. Among them, there are at least two top-notch experts!”<br/><br/>“The Demon Breaker Circle and the group of experts in the demon breaker circle would have no problem fighting against the three mad demons. They could even suppress them. However, they were actually destroyed. How powerful is the Dragon King?”<br/><br/>“If the demon breaker circle was also annihilated by the Dragon King, there is basically one thing that can be confirmed. The old witch can be sure that she was killed by the Dragon King!”<br/><br/>“This is too terrifying. The Crazy Demon Seal died at the hands of the Dragon King. The Crazy Demon Jin Xu died at the hands of the Dragon King. The old witch also died at the hands of the Dragon King. The three crazy demons and the Demon Breaker Circle are simply Invincible!”<br/><br/>Wang Xian admitted that he had destroyed the demon breaker circle. This caused a huge uproar!<br/><br/>The old monsters around were dumbfounded. They looked at Wang Xian in awe!<br/><br/>It had only been a few years since the Dragon King came to the invincible zone. In the end, he had killed three mad demons!<br/><br/>This battle record was invincible!<br/><br/>“Back then, the Dragon King said that he wanted to sweep the entire invincible zone. I think he has done it!”<br/><br/>“He is truly invincible under the dominance. He is an invincible existence!”<br/><br/>All the old monsters looked at Wang Xian in shock. Waves of emotions surged in their hearts!<br/><br/>In the invincible zone, there were only about ten known crazy demons. In the end, he easily killed three of them!<br/><br/>Invincible!<br/><br/>“Dragon King, I want to buy the eternal fetus fruits. I would like to ask you, Dragon King. If I want to achieve a breakthrough, what are the conditions for me to consume the eternal fetus fruits?”<br/><br/>The Elven expert who was carrying a bow and arrow on his back asked Wang Xian!<br/><br/>“The strength of a madman. Two hundred fruits of the womb can achieve a breakthrough of ninety-nine percent. If you, the top-notch expert of the elven race, wish to purchase it, I can give you a quarter of the price!”<br/><br/>Wang Xian looked at the top-notch expert of the Elven race and said!<br/><br/>The Elf clan had helped Wang Xian before. Therefore, Wang Xian had to return the favor to the experts of the Elf clan!<br/><br/>He had a large number of ordinary embryo fruits to begin with, and the price he offered was also very high.<br/><br/>If the top-notch expert of the Elf clan were to buy them, he could give them a quarter of the price.<br/><br/>This was his small return to the Elf clan!<br/><br/>“HMM?”<br/><br/>When the top-notch expert of the Elf clan heard this, his body trembled and his eyes were filled with excitement.<br/><br/>“Thank you, Dragon King. Oakley, thank you, Dragon King!”<br/><br/>Oakley, the top-notch expert of the Elf clan, bowed excitedly!<br/><br/>Wang Xian shook his head nonchalantly.<br/><br/>“Dragon King, I want to buy 200 of them!”<br/><br/>Oakley said to Wang Xian!<br/><br/>“Sure, you only need to take out 50 of the items to trade!”<br/><br/>Wang Xian nodded.<br/><br/>“This… This Oakley expert from the Elf clan has made a huge profit!”<br/><br/>“Damn, he is giving him a quarter of the price. This Dragon King is too generous!”<br/><br/>“It seems that the Elf clan has a benefactor, Dragon King, who has helped the Dragon Palace before. That’s why the Dragon King would sell it to him at such a low price!”<br/><br/>“This is a huge profit. Once Oakley has the strength of a mad demon, he will almost be able to achieve a breakthrough!”<br/><br/>When the surrounding powerhouses saw this, their faces were filled with envy!<br/><br/>After the transaction with Oakley was completed, Wang Xian nodded his head in gratitude!<br/><br/>Around them, some powerhouses immediately went forward to carry out the transaction!<br/><br/>Although taking the ordinary fruit would not allow them to achieve a breakthrough, they were still aware of some of the benefits of taking the ordinary fruit!<br/><br/>If they bought it now, they could make preparations for the future!<br/><br/>One by one, the experts took out their treasures and began to trade in an orderly manner. No one dared to cause trouble!<br/><br/>Needless to say, after learning that the Demon Breaker Circle and the Mad Demon Golden Crow had been destroyed by the Dragon King, who else would dare to cause trouble?<br/><br/>Even if all the experts present were to fight against the Dragon King, they might all be destroyed by the Dragon King!<br/><br/>“WHOOSH WHOOSH WHOOSH!”<br/><br/>Not long after, in the void beside the trading ground, a dozen or so enhancers from the angel race flew over. Their gazes immediately locked onto the position below!<br/><br/>“Eh? That Dragon King isn’t trading inside the trading ground, but outside?”<br/><br/>An angel raised his brows and spoke!<br/><br/>“Who cares where he is. Angel Gardecker, have you contacted the Heaven Extinguishing Fire Phoenix?”<br/><br/>An angel asked Angel Gardecker, who was in the middle of the group!<br/><br/>“Yes, they are coming this way. Let’s go. Don’t let the Dragon King find us. We will meet them at the river above!”<br/><br/>“Leave two people here to monitor the Dragon King’s every move. We can’t afford to make any mistakes this time!”<br/><br/>Angel Gardecker nodded and said to the two angels!<br/><br/>“Yes!”<br/><br/>The two angels nodded and flew toward the trading center!<br/><br/>The other dozen angels flew toward the upper reaches of the river!<br/><br/>But just as they stopped, news came one by one!\t\t\t\t\t\t</div>", "images": {}, "success": true}