{"id": 704, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073309.html", "title": "Chapter 3695 - 3695 3694 Dragon King, We’Re Here! Let’S Go", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3695 - 3695 3694 Dragon King, We’Re Here! Let’S Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3695 3694 Dragon King, we’re here! Let’s Go<br/><br/>“Hehe, Dragon King, why don’t you take out all the normal birth fruits!”<br/><br/>Gardecker’s angel stared at Wang Xian. When he saw how calm and composed he was, a mocking expression appeared on his face!<br/><br/>The Dragon King must not know how powerful they were!<br/><br/>“Looks like you guys want to snatch them by force. With just you bunch of trash?”<br/><br/>Wang Xian glanced at them and said nonchalantly!<br/><br/>“Dragon King, you are really arrogant!”<br/><br/>The Fire Eagle Phoenix stared at Wang Xian and his aura slowly became violent. He flapped his wings slightly and waves of heat waves surged towards the surroundings!<br/><br/>“Hiss, this… this is really to snatch the ordinary fruit!”<br/><br/>“It must be because the Dragon King has taken out too many ordinary fruit that they are coveting it. That’s why they have banded together and closed their eyes!”<br/><br/>“Will they be a match for the Dragon King? It seems like the Dragon King doesn’t care about them at all!”<br/><br/>“The Dragon King killed the crazy demon, the old witch, and the crazy demon restriction. He might not be afraid of them!”<br/><br/>“That Fire Phoenix is a crazy demon. and the totems behind the forty to fifty water phoenixes are no weaker than the crazy demon!”<br/><br/>Around the trading area, the group of old monsters from the Invincible Zone had a clear view of the situation before them. It was obvious that they wanted to intimidate the Dragon King!<br/><br/>They wanted to obtain the longevity fruit!<br/><br/>“I wonder if they can succeed. If they fight, they should be able to understand just how strong the Dragon King is!”<br/><br/>The group of Old Monsters thought to themselves!<br/><br/>“With just us!”<br/><br/>Gardecker’s eyes turned cold when he saw Wang Xian’s mocking expression!<br/><br/>He stared at Wang Xian and waved his arm. A powerful army of angels appeared behind him!<br/><br/>There were more than 10,000 battle angels in the entire army of angels!<br/><br/>At the front of the Army stood more than 100 battle angels with Level-3 combat strength, the Masters of the universe!<br/><br/>They held a huge sword in one hand and a shield in the other. They were like terrifying machines!<br/><br/>“Hehe, Dragon King, you dare to Offend Our Angel race. Today, you won’t be able to escape even if you have wings. Today, we will exterminate you. Not long after, we will exterminate your Dragon Palace. We will let you know the consequences of offending our Angel Race!”<br/><br/>At the side, an angel spoke with a cold expression. He waved his arm and a powerful Angel Army appeared behind him!<br/><br/>At the front, more than 30 battle angels with level three combat strength, masters of the universe, locked their eyes on Wang Xian with a cold expression!<br/><br/>“Dragon King, welcome the judgment of Our Angel Race!”<br/><br/>At the surrounding area, more than 10 other angels waved their arms and a powerful army of angels appeared.<br/><br/>The Battle Angels, who were emitting a terrifying aura, lined up neatly.<br/><br/>As long as they gave an order, they would be able to unleash the most terrifying attack!<br/><br/>In the entire Angel Army, there were 400 to 500 universe masters with level-three Combat Power!<br/><br/>Hiss<br/><br/>When the Angel Army appeared one by one, the Old Monsters of the invincible region around them were all looking at this scene in shock!<br/><br/>“Angel Army, what a terrifying Angel Army! There are actually 400 to 500 battle angels with level-three Combat Power as Universe Masters!”<br/><br/>“They have long planned this, there must be a strong warrior of the angel race involved, otherwise, how could there be such a terrifying Angel Army!”<br/><br/>“How terrifying, the strength of this Angel Army can easily tear apart a crazy demon. Such a powerful Angel Army, coupled with the strength of the Phoenix race, this Dragon King is finished!”<br/><br/>“This power is too strong. How can 400 to 500 level 3 universe masters and over 400 experts of the Phoenix clan resist?”<br/><br/>“The Dragon King is in trouble. The Army of angels is here to take revenge!”<br/><br/>All the Old Monsters of the invincible zone were shocked. They quickly flew back to avoid the explosion of the battle!<br/><br/>This force was more than enough to destroy a level two overlord realm powerhouse, let alone the Dragon King!<br/><br/>“HMM? Such a powerful Angel Army and the Phoenix Tribe’s powerhouse. You guys really think highly of me!”<br/><br/>Wang Xian looked at this powerful Angel Army and his eyes lit up. He said calmly!<br/><br/>His gaze swept across the Phoenix Tribe’s powerhouses. His eyes flickered as he continued, “Phoenix tribe, there shouldn’t be any fish in my dragon palace that you guys have enmity with. Why are you guys involved in this?”<br/><br/>“Do we need to tell you, Dragon King, that our Phoenix clan is doing things? Hehe, you are not worthy!”<br/><br/>Huo Min Tian stared at Wang Xian and said with disdain!<br/><br/>When Wang Xian heard their words, he narrowed his eyes slightly and his expression was filled with hostility!<br/><br/>“It seems that your Phoenix clan is also an enemy of our Dragon Palace!”<br/><br/>Wang Xian clenched his fists slightly. He recalled the words that the leader of the ancestral dragon had once passed to the experts in his clan!<br/><br/>Be careful of the Phoenix!<br/><br/>At that time, the experts from the ancestral dragon clan were extremely puzzled. Why should they be careful of the Phoenix?<br/><br/>From the looks of it now, Wang Xian knew that something was definitely involved!<br/><br/>Otherwise, why would so many Phoenixes and angels gang up on him just to take the eternal fruit?<br/><br/>This was clearly a little unreasonable!<br/><br/>“Dragon King, you think too highly of Your Dragon Palace. You want to make an enemy out of our Phoenix clan. You Don’t have the qualifications to do so. A small dragon palace is something that our Phoenix clan can destroy easily!”<br/><br/>Huo Ying stared at Wang Xian and said with disdain!<br/><br/>He didn’t think much of the Dragon King at all!<br/><br/>“Dragon King, if you don’t take out the ordinary birth fruit, we will attack you directly. I want to see how many seconds you can last against us!”<br/><br/>Angel Gardecker said with a smile on his face!<br/><br/>Now, their victory was already in their hands!<br/><br/>“Haha, the Angel Race and the Phoenix race are working together to deal with me. They are really giving me face!”<br/><br/>Wang Xian laughed out loud and stood up slowly. His gaze swept across his surroundings!<br/><br/>“Then, Dragon King, you can die in peace!”<br/><br/>Huo Min Tian flapped his phoenix wings and said in a sinister tone!<br/><br/>Boom! Boom! Boom<br/><br/>At the same time, an extremely terrifying pressure was emitted from his body!<br/><br/>In the surrounding area, the fire eagle and water phoenix totems, as well as the experts of the Phoenix clan, erupted with a terrifying and vast power at the same time!<br/><br/>“Judgement!”<br/><br/>Angel Gardecker roared loudly and an angel sword appeared in his hand!<br/><br/>“Clang! Clang! Clang!”<br/><br/>“Judgement!”<br/><br/>All the battle angels erupted in an instant. The power of light soared into the sky.<br/><br/>Judgement!<br/><br/>It locked onto Wang Xian!<br/><br/>“The aura is too strong, too terrifying!”<br/><br/>“The Dragon King is about to be besieged. It’s impossible to fight him alone!”<br/><br/>In the surrounding area, a group of old monsters from the invincible region trembled under the pressure. Their foreheads were covered in cold sweat!<br/><br/>They retreated in fear!<br/><br/>The change in the aura caused them to tremble. If they were in the middle of the aura, they would be crushed to death!<br/><br/>“Very good, 800 to 900 experts!”<br/><br/>Wang Xian looked at them with a smile on his face!<br/><br/>He could stretch his muscles!<br/><br/>The inoriginator holy wings appeared behind him. However, just as he was about to attack, he raised his eyebrows slightly and looked in the direction of the long river!\t\t\t\t\t\t</div>", "images": {}, "success": true}