{"id": 716, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073333.html", "title": "Chapter 3707 - 3707 Under The 3706 Void Pagoda", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3707 - 3707 Under The 3706 Void Pagoda</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3707 Under the 3706 Void Pagoda<br/><br/>With Wang Xian’s current strength, which was even stronger than the level two realm of the Universe Dominator, he was able to stop the void barrier from moving at all!<br/><br/>On the other hand, an lie was able to extend his hand and send it over. It was obvious that this energy was similar to the energy in an Lie’s body.<br/><br/>“Enter!”<br/><br/>Wang Xian said to an lie!<br/><br/>An lie nodded his head. With a move of his body, his figure disappeared immediately!<br/><br/>Wu Sha and the rest reached out to touch the spot beside him. They wanted to enter, but there was nothing they could do!<br/><br/>“Dragon King!”<br/><br/>The next moment, an Lie’s figure appeared. He looked at Wang Xian with a hint of shock in his eyes!<br/><br/>“What’s Wrong?”<br/><br/>Wang Xian looked at him!<br/><br/>“Dragon King, there are dozens of corpses inside. Take a look!”<br/><br/>As he spoke, Wang Xian felt the surrounding scenery change. It was as if he had entered a special space!<br/><br/>This space had no attributes and he could not feel any energy!<br/><br/>“Eh? Dragon King, I can feel that the energy in my divine kingdom has been isolated!”<br/><br/>Shi Sen suddenly exclaimed!<br/><br/>The energy had been isolated. This meant that they could not absorb the energy from the divine kingdom.<br/><br/>There was no energy in this place. Over time, their physical bodies would die here!<br/><br/>That was the true death!<br/><br/>“HMM, there is no energy around and the divine kingdom is isolated!”<br/><br/>Wang Xian nodded his head and looked ahead!<br/><br/>At this moment, they seemed to have entered the interior of the beehive. It was an oval-shaped space!<br/><br/>In front of this space, there were corpses!<br/><br/>There were the corpses of human experts and a few corpses of Space Beasts!<br/><br/>The corpses of space behemoths were obviously killed while the corpses of humans were entrenched there. It was as if they died because there was no energy to absorb!<br/><br/>“Dragon King, look at that corpse. It has golden skin, golden hair, and golden bones. This is a golden man. It’s a Golden Man!”<br/><br/>Suddenly, an exclamation was heard!<br/><br/>Wang Xian looked over and his gaze landed on the Golden Corpse!<br/><br/>The golden men were also known as the Golden God of War!<br/><br/>They were once the peak race before the last calamity.<br/><br/>“It’s really the golden men. Didn’t the golden men race perish in the last calamity? Why are there still their corpses here?”<br/><br/>Wu Sha asked with a face full of astonishment!<br/><br/>Wang Xian’s gaze flickered slightly. The golden men were the powerhouses of the peak race before the last calamity!<br/><br/>They were an existence with a terrifying physical body.<br/><br/>Wang Xian walked over and touched his bones with his hands. He could still feel an indestructible feeling!<br/><br/>“Just the bones left behind are definitely not weaker than a level six overlord when they were alive, or even higher!”<br/><br/>Wang Xian mumbled.<br/><br/>He did not expect to encounter such a miraculous thing this time!<br/><br/>To be able to encounter a race at the peak before the Cataclysm!<br/><br/>Wang Xian did not know much about the cataclysm. In fact, it seemed that all the peak races would keep the matter of the cataclysm a secret!<br/><br/>“Dragon King, there are treasures here!”<br/><br/>At this moment, a pleasantly surprised voice came from Lei Shan beside him.<br/><br/>Wang Xian looked over. There was a sword not far from the Golden Man’s corpse.<br/><br/>It was a golden sword!<br/><br/>The sword had already been sheathed, but even so, one could still tell that this sword was extraordinary!<br/><br/>Lei Shan stretched out his hand and took out the golden sword. He drew it out directly!<br/><br/>A sharp aura was emitted.<br/><br/>However, it seemed that the special ability had disappeared because he had not absorbed energy for a long time!<br/><br/>“This is definitely an innate treasure, a powerful innate treasure!”<br/><br/>Lei Shan opened his mouth and said!<br/><br/>Wang Xian nodded and walked over immediately. He held the Golden Sword in his hand and moved his palm!<br/><br/>Buzz<br/><br/>A wave of metallic energy was injected into the sword. A golden figure could be vaguely seen around the longsword. A sharp light swept across the surroundings!<br/><br/>It was a very powerful golden sword!<br/><br/>Wang Xian was slightly surprised.<br/><br/>“Dragon King, there are still treasures here. I don’t know if there is one, but there are a total of six innate treasures!”<br/><br/>At this moment, the voices of Wu Sha and the rest could be heard from the side!<br/><br/>Wang Xian flew over and immediately saw the treasures placed around the corpses!<br/><br/>Even though there was no energy, he could still tell that they were innate supreme treasures that could snatch the fortunes of the world!<br/><br/>There was a book, a seal, a chessboard, a dagger, a black paintbrush, and a painting.<br/><br/>Wang Xian swept his gaze across and waved his arm. One treasure after another floated around him!<br/><br/>Buzz<br/><br/>The six innate treasures were floating around him. All of a sudden, there were some changes to the painting!<br/><br/>The painting suddenly moved and a shadow slowly appeared!<br/><br/>The face of the shadow could not be seen clearly. It was in the form of a human and was wearing a windbreaker!<br/><br/>“Juniors, I don’t know if you are from the Void universe or the nine-origin universe. Just treat it as if you are the disciples of the nine-origin universe. It is fate that you are able to enter this place!”<br/><br/>At this moment, the Phantom suddenly spoke. It was obvious that the remaining energy had been activated!<br/><br/>Wang Xian looked over and revealed a curious expression!<br/><br/>Void Universe? Nine-origin universe?<br/><br/>“The corpses that you see are none other than us. We are all survivors of the previous calamity. The location that you are at is the enemy of our nine-origin universe. The Void Pagoda of the Void Universe, the Void Pagoda, and the war treasure of the Void Race of the Void Universe.”<br/><br/>“This treasure was left behind by the Wargod of the Golden Man, a peak race, during the previous calamity. We tried to crack it but failed… it was later snatched away by the Void Beasts of the Void Universe…”<br/><br/>Buzz<br/><br/>Wang Xian and the rest listened quietly as the Phantom spoke. Suddenly, the phantom trembled and slowly disappeared!<br/><br/>“What the F * ck, he disappeared without finishing his sentence? What’s going on?”<br/><br/>Demon Wings couldn’t help but shout loudly when he saw this scene!<br/><br/>The words of this phantom had really left them too confused and shocked!<br/><br/>9-origin universe, Void Universe, starry universe, what did all of these mean?<br/><br/>What about the Apocalypse?<br/><br/>They could confirm that the 9-origin universe was their universe, but what about the Void Universe?<br/><br/>Enemies of the nine-origin universe?<br/><br/>And what was the meaning of the space behemoths in the starry universe?<br/><br/>Weren’t the space behemoths the space behemoths in their universe?<br/><br/>When Wang Xian heard the words of the Phantom, his face was filled with curiosity.<br/><br/>“Void universe, Void Tower.”<br/><br/>Wang Xian mumbled as he looked at an lie who was beside him!<br/><br/>An lie had previously teleported to the coordinates in his mind and said that that world was very strange!<br/><br/>Furthermore, when Wang Xian received the genesis wings, he had inherited an image.<br/><br/>The owner of the Genesis Wings was fighting against a powerful existence that could teleport!<br/><br/>“Does this have anything to do with the Apocalypse? According to the time, there are still billions of years before the Apocalypse arrives.”<br/><br/>Wang Xian mumbled as he scanned his surroundings!<br/><br/>Apart from these corpses, there was nothing else in the oval-shaped space!<br/><br/>This space was only a few thousand kilometers in size. It was not very big. Obviously, this was only a small part of the Void Pagoda!\t\t\t\t\t\t</div>", "images": {}, "success": true}