{"id": 712, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073325.html", "title": "Chapter 3703 - 3703 3702 Angels And Phoenixes Died", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3703 - 3703 3702 Angels And Phoenixes Died</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3703 3702 angels and Phoenixes died<br/><br/>“Invincible City is rumored to be the final location of the war in the invincible region. There are a total of five to six Space Beasts’corpses there, and there are also seven to eight Cosmos God nation ruins. The energy there is chaotic, but to experts, it is a treasure ground for cultivation. Many experts from the invincible region gather there!”<br/><br/>Invincible city was a place where treasures were gathered in the invincible region!<br/><br/>There were seven to eight ruins of the divine kingdom and five to six corpses of space behemoths. The energy was extremely majestic!<br/><br/>There were quite a number of experts gathered there, but some of them came from various races!<br/><br/>Wu Sha wasn’t sure how many angels and Phoenix race experts there were!<br/><br/>However, there were definitely some there!<br/><br/>Wang Xian nodded his head slightly. With a move of his body, he flew rapidly towards invincible city!<br/><br/>His speed was very fast. In the land of the nine Netherworld fire, no powerhouse knew that more than 40 dark angels were killed!<br/><br/>A day later, Wang Xian arrived in front of invincible city.<br/><br/>It was more like a place where corpses and broken divine kingdoms gathered. The good thing was that it wasn’t too messy!<br/><br/>Wang Xian was at the front and could sense that there were quite a number of experts gathered in Invincible City!<br/><br/>There were at least seven to eight hundred of them!<br/><br/>There were even two experts engaged in a life-and-death battle at one of them!<br/><br/>“Surround the entire invincible city. I’ll enter!”<br/><br/>Wang Xian looked at Wu Sha and the rest and gave an order!<br/><br/>“It’s the Dragon King!”<br/><br/>Wu Sha and the rest nodded their heads. The seven mad demons exchanged a glance and flew straight into the surroundings!<br/><br/>They wanted to surround the entire invincible city!<br/><br/>Meanwhile, Wang Xian flew straight into the city and scanned the surroundings!<br/><br/>The peak races all had the unique aura of the peak races, the light and darkness powers of the Angel Race!<br/><br/>The Phoenix powers of the Phoenix race!<br/><br/>With just a little sensing, he could lock onto the angels and the Phoenixes!<br/><br/>“This is? The Dragon King!”<br/><br/>“Yes, he is the Dragon King. What is the Dragon King doing here?”<br/><br/>Wang Xian entered and swept his gaze across the surroundings unscrupulously. When some of the experts saw him, their faces were filled with reverence as they asked in astonishment!<br/><br/>A few days ago, Wang Xian was truly invincible in the invincible zone. Now that all the old freaks had met the Dragon King, none of them were disrespectful!<br/><br/>“Greetings, Dragon King!”<br/><br/>When some of the old monsters saw Wang Xian, they even bowed respectfully!<br/><br/>Wang Xian took a glance and continued to observe his surroundings!<br/><br/>“Eh, Brother Black open-air, look over there. is that? The Dragon King?”<br/><br/>On a high platform located in invincible city, waves of energy surged from below!<br/><br/>Above them, more than ten old monsters were sitting cross-legged. In front of them, there was a chessboard!<br/><br/>Suddenly, an old monster noticed Wang Xian in the distance and exclaimed in surprise!<br/><br/>More than ten old monsters looked over, and their eyes were sparkling!<br/><br/>Among them, there was an angel of Darkness, an angel of light, and the rest were old monsters from other races!<br/><br/>They looked at Wang Xian, and Wang Xian had already sensed them!<br/><br/>When Wang Xian saw that there were two powerhouses from the angel race among them, a faint smile appeared on his face!<br/><br/>He flew over immediately!<br/><br/>“HMM? Then the Dragon King Is Here!”<br/><br/>“The Dragon King’s strength is unrivaled. We have to be more respectful!”<br/><br/>More than ten powerhouses sent a voice transmission when they saw Wang Xian flying over!<br/><br/>“Greetings, Dragon King!”<br/><br/>They immediately bowed respectfully when they saw Wang Xian flying over!<br/><br/>The current Wang Xian was more than capable of receiving their great greetings!<br/><br/>Wang Xian nodded his head lightly. With a wave of his arm, two chains instantly shot towards the angel of light and the Angel of darkness.<br/><br/>“What!”<br/><br/>When the two angels saw Wang Xian suddenly attacking them, their expressions changed drastically!<br/><br/>“Dragon King, why are you attacking us?”<br/><br/>They wanted to dodge, but Wang Xian was too fast. They couldn’t react in time!<br/><br/>“You two!”The Angel of darkness shouted with an extremely embarrassed and furious expression!<br/><br/>“It’s because you are disciples of the Angel clan. You deserve to die!”<br/><br/>Wang Xian heard his words and said calmly. A surge of energy from the chains surged into their bodies!<br/><br/>“Ah!”<br/><br/>The two angels let out miserable screams. Their bodies trembled violently. In the next moment, Wang Xian pulled them into the dragon palace and suppressed them!<br/><br/>It was only because they were disciples of the Angel Race!<br/><br/>This was a race war!<br/><br/>After suppressing the two angels, Wang Xian swept his gaze across the surroundings and continued flying forward!<br/><br/>“Hiss!”<br/><br/>At the side, more than ten other experts were trembling. The moment Wang Xian made his move, they felt death!<br/><br/>When they saw Wang Xian leaving, they took a deep breath!<br/><br/>“This… is this the Dragon King’s strength? Black Open Sky and the rest don’t even have the strength to resist!”<br/><br/>“The Dragon King is actually killing the powerhouses of the angel race. is he here to clean up the powerhouses of the Angel Race?”<br/><br/>“This… killing the powerhouses of the angel race without any restraint, only the Dragon King can do that, right?”<br/><br/>The dozen or so powerhouses looked at this scene in shock. There was a hint of cold sweat on their foreheads as they spoke!<br/><br/>“Over there, I can sense the aura of the Phoenix Tribe’s powerhouses!”<br/><br/>Wang Xian looked to the right and immediately flew over!<br/><br/>His gaze was fixed on a building. His eyes flickered slightly as he swung his arm!<br/><br/>A grayish dragon claw clawed directly at that building!<br/><br/>“Who is it?”<br/><br/>A voice rang out from within the building. Following that, a Golden Phoenix flew out from within. It was emitting a golden glow!<br/><br/>“I, the Dragon King, am here to kill you!”<br/><br/>Wang Xian looked at the Golden Phoenix and spoke indifferently!<br/><br/>The Dragon Claw clawed at him once again!<br/><br/>“Dragon King? I didn’t offend you. Why did you attack me? Why did you kill me?”<br/><br/>The Golden Phoenix clearly didn’t know what was happening in the trading ground. He roared with a face full of shock and anger!<br/><br/>He flapped his golden wings and streams of terrifying golden light shot towards the Dragon Claw!<br/><br/>However, his attacks didn’t affect the dragon claw at all. It continued to claw towards him at a terrifying speed!<br/><br/>“It’s because of you phoenixes. You deserve to die!”<br/><br/>Wang Xian heard his words and spoke calmly!<br/><br/>The Dragon Claw grabbed his body directly!<br/><br/>A surge of energy surged into his body and obliterated his life force!<br/><br/>“What?”<br/><br/>“A battle has broken out over there. It’s the Dragon King. The Dragon King is killing the powerhouses of the Phoenix Tribe!”<br/><br/>The commotion over here had attracted the attention of many old freaks in the surroundings!<br/><br/>They looked over and saw a golden phoenix being suppressed by Wang Xian. Upon hearing his words, a look of shock appeared on their faces!<br/><br/>Because of You Phoenixes, you deserve to die?<br/><br/>The Dragon King is killing the experts of the Phoenix clan!<br/><br/>“The Dragon King is taking revenge. He is taking revenge for the Phoenix clan and the Angel clan who besieged him!”<br/><br/>“This is too unbridled, too powerful, directly killing the Phoenix clan and the Angel clan’s experts!”<br/><br/>They looked over, their faces filled with shock!<br/><br/>One had to know that behind the other party was a peak race!\t\t\t\t\t\t</div>", "images": {}, "success": true}