{"id": 713, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073327.html", "title": "Chapter 3704 - 3704 Three Thousand Seven Hundred And Three Experts From The Two Peak Races Had Escaped From The Invincible Zone!", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3704 - 3704 Three Thousand Seven Hundred And Three Experts From The Two Peak Races Had Escaped From The Invincible Zone!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3704 Three thousand seven hundred and three experts from the two peak races had escaped from the Invincible Zone!<br/><br/>“Bang!”<br/><br/>After suppressing another Golden Phoenix, Wang Xian moved his body and continued to scan the surroundings!<br/><br/>Wang Xian’s attack caused the entire invincible city to be completely shaken!<br/><br/>The news of the Dragon King killing the experts from the angel and Phoenix races in the invincible city was also spreading rapidly!<br/><br/>“Eh? There are dozens of powerhouses from the Angel clan here!”<br/><br/>Wang Xian ignored the powerhouses around him. He moved his body and sensed dozens of angels in front of him. He flew over immediately!<br/><br/>What happened next was as simple as before. When Wang Xian flew over, the dozens of angels could not put up any resistance at all.<br/><br/>Under the indignant, angry, and terrified expressions, they were all suppressed by Wang Xian!<br/><br/>What awaited them would be death!<br/><br/>Wang Xian had already listed the angel race as the strongest and they were enemies that would not rest until one of them was dead!<br/><br/>The continuous attacks of the angel race made Wang Xian decide that if he wanted to have sufficient strength, he would definitely make the angel race pay a heavy price!<br/><br/>“Oh no, the Dragon King is killing the experts of our Angel race crazily in Invincible City. Run!”<br/><br/>“We didn’t provoke the Dragon King. Why is he killing us? Could it be that they are blaming our Angel clan for the encirclement at the trade site?”<br/><br/>“A prince of our Angel clan has always wanted to destroy the Dragon King and the Dragon Palace. That prince should be the one who made the move at the trade site. Now, the Dragon King is looking for the experts of our Angel clan. Once he finds them, he will suppress and kill them. Let’s Run!”<br/><br/>There were still quite a number of experts of the Angel Clan in Invincible City!<br/><br/>This time, the Phoenix clan had sent out more than 90% of the Phoenixes in the invincible zone to attack Wang Xian!<br/><br/>As for the Angel clan, they did not send out many of them. The third prince had even ordered more than a dozen angels to lead the Angel Army to besiege the Dragon King!<br/><br/>Therefore, there were still a large number of old monsters of the Angel clan in the Invincible Zone!<br/><br/>The experts of the angel race in the invincible city felt extremely aggrieved when they heard the news. They didn’t dare to hesitate at all and hurriedly fled outside!<br/><br/>However, before they could escape, they saw many mad demons floating in the void around the invincible city, staring at them coldly!<br/><br/>“Oh no, it’s the mad demons subdued by the Dragon King. It’s over, it’s over!”<br/><br/>“Spread out and run. Damn it, the Prince of the light clan provoked the Dragon King. Why did he implicate us? Damn it!”<br/><br/>The group of angels looked around in horror. One of the Dark Angels roared with an abnormally ugly expression!<br/><br/>“You guys from the Angel clan still want to escape?”<br/><br/>Lei Shan showed his terrifying strength when he saw them. He instantly arrived in front of dozens of angels with a cold expression in his eyes!<br/><br/>The Angels of light were good at fighting in legions. They all had their own legions of angels.<br/><br/>However, the angels of darkness were different. They usually relied on their own strength and did not have an army of angels!<br/><br/>However, when the dozens of angels saw Lei Shan attacking them, their expressions changed drastically!<br/><br/>“Attack him!”<br/><br/>The dozens of angels gritted their teeth and roared loudly!<br/><br/>“Hahaha, with just you, I’ll play with you today. Old Witch, demonic wings, don’t make a move!”<br/><br/>Lei Shan laughed and roared loudly!<br/><br/>This was the first time he had fought so freely after regaining his consciousness!<br/><br/>It was perfect to fight dozens of angels one-on-one!<br/><br/>“Hehe!”<br/><br/>Wu Sha and the others laughed coldly in the surrounding area. They looked around but did not intervene!<br/><br/>“Boom! Boom! Boom!”<br/><br/>“That’s? The Dragon King’s subordinates, the Mad Demons, are fighting with the experts of the Angel Race!”<br/><br/>“The entire invincible city is now surrounded by seven mad demons. Moreover, that mad demon is just playing around. Only the Thunder Flash Mad Demon is attacking!”<br/><br/>“This… how can the experts of the Phoenix race and the Angel race in the Invincible City escape? They are dead meat!”<br/><br/>The battle here attracted the attention of many powerhouses in invincible city!<br/><br/>They looked over and their eyes sparkled as they discussed among themselves!<br/><br/>Following that, all the powerhouses in invincible city watched in awe as Wang Xian cleaned up the powerhouses from the Angel clan and the Phoenix clan one by one.<br/><br/>No one dared to stop him, nor did any powerhouse dare to say anything!<br/><br/>Even those powerhouses who had a good relationship with the angel and Phoenix clan were just watching from the side!<br/><br/>At this moment, no one dared to offend the Dragon King!<br/><br/>No one dared to provoke the Dragon King either!<br/><br/>Everyone in the Invincible region knew the Dragon King’s current strength!<br/><br/>After more than an hour, Wang Xian had cleaned up the entire invincible city!<br/><br/>Eighty-three powerhouses from the Angel clan and five powerhouses from the Phoenix clan were all suppressed by him!<br/><br/>“Let’s Go!”<br/><br/>After cleaning up, Wang Xian flew out from invincible city and spoke to Wu Sha and the rest!<br/><br/>“It’s the Dragon King!”<br/><br/>Wu Sha and the rest followed behind and disappeared into the void quickly!<br/><br/>“The seven mad demons have completely submitted to the Dragon King. It seems that the Dragon Palace will be able to advance to the peak of the race soon!”<br/><br/>“The Dragon Palace will be able to advance to the peak of the race. This is almost a hundred percent certain!”<br/><br/>“After all, the Divine Dragon Clan is the Divine Dragon Clan. Their bloodline is too strong!”<br/><br/>In Invincible City, a group of experts muttered as they watched them leave!<br/><br/>In the following period of time, Wang Xian led the seven crazy demons to hunt down the experts from the Angel clan and the Phoenix clan in the Invincible region once again!<br/><br/>This matter quickly spread throughout the invincible region!<br/><br/>“D * mn it. The angel of light has completely angered the Dragon King. Let’s escape from the Invincible Zone!”<br/><br/>“Let’s escape. As long as the Dragon King is around, we will be in great danger. Since the Dragon King is so arrogant in hunting down the powerhouses from our Angel clan, the Angel clan will pay a thousand times the price sooner or later!”<br/><br/>Half a month later, almost all the powerhouses in the Invincible Zone knew about this!<br/><br/>The experts of the angel and Phoenix clans also flew out of the Invincible Zone in fear!<br/><br/>Now, the Dragon King was unstoppable in the invincible zone. If they didn’t leave, they would die if they were met!<br/><br/>This made the old monsters of the angel and Phoenix clans extremely aggrieved, but they could only run away!<br/><br/>In the invincible zone, the experts of the angel and Phoenix clans couldn’t be seen in a short period of time!<br/><br/>“It has been five to six days since we have found the powerhouses from the Angel clan!”<br/><br/>A month later, Wang Xian frowned slightly and said.<br/><br/>“Dragon King, the news of you hunting the powerhouses from the angel and Phoenix clans has spread completely. The powerhouses from the two peak races should have escaped!”<br/><br/>Wu Sha said!<br/><br/>“That’s right, Dragon King. You single-handedly allowed the powerhouses from the two peak races to escape the invincible zone. This is the first time in more than 10 billion years that you have achieved such a feat!”<br/><br/>Ming Sha Sheng echoed from the side!\t\t\t\t\t\t</div>", "images": {}, "success": true}