{"id": 711, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073323.html", "title": "Chapter 3702 - 3702 The 3,701 Angels And The Phoenix Race Were Dead! Go", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3702 - 3702 The 3,701 Angels And The Phoenix Race Were Dead! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3702 The 3,701 angels and the Phoenix race were dead! Go<br/><br/>“Let’s Go!”<br/><br/>When Wang Xian heard Wu Sha and the rest’s report, a cold glint flashed in his eyes!<br/><br/>As long as he could find the powerhouses from the angel race and the Phoenix race in the invincible zone, he would not leave a single one alive!<br/><br/>“Dragon King, there are many powerhouses from the various peak races in that direction and the invincible zone. The number of powerhouses from each peak race would not be less than 300. There are at least 300 powerhouses from the angel race!”<br/><br/>Wu Sha introduced to Wang Xian!<br/><br/>Wang Xian nodded his head and flew over quickly!<br/><br/>The area of the invincible zone was still very huge. However, after Wang Xian’s strength had broken through, his speed had once again reached a terrifying level!<br/><br/>Now, it would only take him more than ten days to fly from one side to the other!<br/><br/>This speed was undoubtedly terrifying in the invincible zone!<br/><br/>Of course, Wang Xian’s current speed was comparable to that of a master at the third level. No matter how big the Invincible Zone was, it was still a territory that was destroyed on a battlefield!<br/><br/>Compared to the real universe and the heaven-splitting primordial land, it was still a drop in the bucket!<br/><br/>…<br/><br/>“I really didn’t expect that the Dragon King would have such terrifying strength. This time, more than a dozen angels of light and their powerful army were easily killed by the Dragon King!”<br/><br/>“The Dragon King’s strength is indeed quite abnormal. His talent should be top-notch even when he was at the peak of the Divine Dragon Clan. It seems that the third prince has always wanted to destroy that Dragon King with the angels of Light, right?”? “Now that he has failed three or four times, he has really lost the face of our Angel clan!”<br/><br/>“It’s enough for us to say these words here. We absolutely can’t say it outside. Otherwise, if we offend our superiors, we won’t even know how we died!”<br/><br/>“Hehe, the third prince tried so hard to kill a Dragon King. Now, the entire universe knows that our angel race has tried to kill the Dragon King time and time again, but failed in the end!”<br/><br/>“The main reason is that the dragon king is too monstrous!”<br/><br/>At the body of the nine Netherworld fire in the Invincible Zone, a group of dark angels gathered together and discussed!<br/><br/>The body of the Netherworld fire was the corpse of an enormous space beast.<br/><br/>The enormous corpse formed an area known as the body of the Netherworld fire. This was a paradise that was very suitable for dark attribute experts to cultivate!<br/><br/>And this place was also occupied by a group of dark angels!<br/><br/>Dozens of dark angels gathered together and discussed the most shocking matter in the invincible zone!<br/><br/>And this matter also involved their angel race!<br/><br/>“Now, it’s rumored that the mad demons can break through as long as they consume a large number of normal birth fruits. I don’t know if it’s true or not!”<br/><br/>“I think it’s very likely to be true. It’s also possible that the seven mad demons submitted to the Dragon King because of this reason!”<br/><br/>The two dark angels continued to talk!<br/><br/>“Unfortunately, the Dragon King is too powerful. It’s very difficult to obtain a large number of normal birth fruits from him unless it’s a trade. and the price that the Dragon King sells for is very high!”<br/><br/>One of the Dark Angels spoke and shook his head slightly!<br/><br/>The rest of the dark angels nodded silently!<br/><br/>If the Dragon King was not so powerful, they would definitely snatch it directly!<br/><br/>“Dragon King, it’s ahead!”<br/><br/>While they were discussing, what the Dark Angels did not know was that the Dragon King that they were discussing had already arrived in front of them!<br/><br/>Wu Sha pointed at the area in front of them and said to Wang Xian!<br/><br/>“The corpse of this space beast is really huge!”<br/><br/>Wang Xian looked at the huge corpse and revealed an astonished expression!<br/><br/>“Some experts have guessed that this corpse is at least the corpse of a space beast above level four, the ruler of the Universe!”<br/><br/>Lei Shan replied!<br/><br/>Wang Xian nodded his head. His dragon eyes scanned the area in front of him and he flew straight ahead!<br/><br/>He didn’t conceal his figure at all and didn’t restrain his aura at all. He flew straight into the area!<br/><br/>“Eh? Someone has broken in!”<br/><br/>At the same time, the group of Dark Angels inside the body of the Netherworld fire sensed something when Wang Xian entered the area!<br/><br/>This was their lair. Naturally, they had set up a perimeter around the area!<br/><br/>“Whoever dares to trespass into our territory is courting death!”<br/><br/>In the middle, a dark angel’s blood-red eyes stared outside. A pair of wings flapped slightly, and his body was filled with a tyrannical aura!<br/><br/>Their bodies moved, and dozens of dark angels immediately flew out!<br/><br/>When they had just flown out, they saw eight figures flying towards them!<br/><br/>The leader of the group was in the form of a human. He also had a pair of wings!<br/><br/>And around him…<br/><br/>When the group of Darkness Angels saw the group of figures around him, their bodies stiffened slightly. Their pupils constricted and their faces were filled with shock!<br/><br/>“That’s… The wings of the Mad Demon!”<br/><br/>“That’s the Mad Demon Shisen!”<br/><br/>“The Mad Demon Lightning Flash!”<br/><br/>The Demon Wings Shisen Lightning Flash and the rest were immediately recognized. In the next moment, all their gazes were focused on Wang Xian. Their eyes were filled with reverence!<br/><br/>It went without saying!<br/><br/>This was the Dragon King of the Dragon Palace!<br/><br/>“Greetings, Dragon King. May I know what business you have with us?”<br/><br/>The group of Darkness Angels was shocked. Looking at the Dragon King in front of them, their hearts felt numb. However, at this moment, they also knew that it was impossible to escape from the hands of the Dragon King!<br/><br/>They braced themselves and cupped their hands together as they asked!<br/><br/>“Why are you asking when you already know the answer? Of course, we are here to kill you angels!”<br/><br/>Ming shasheng stared at them and asked with a grim expression!<br/><br/>“Kill us? Dragon King, what the Radiant Angels did has nothing to do with us, the Darkness Angels!”<br/><br/>The expression of one of the Darkness Angels changed drastically as he shouted hurriedly!<br/><br/>“All of you are of the same race. I don’t care if you are the darkness angels or the radiant angels!”<br/><br/>Wang Xian’s eyes were filled with cold killing intent!<br/><br/>Although the angel race was divided into light and darkness, they were as one!<br/><br/>If the angel race wanted to kill him, would Wang Xian care if the other party was the angel of Darkness or the angel of Light?<br/><br/>They would all die!<br/><br/>“Crash!”<br/><br/>After he finished speaking, the uninitiated holy wings flapped violently and arrived in front of the dozens of angels of darkness at a terrifying speed!<br/><br/>At the same time, a wave of energy caught them completely!<br/><br/>“No, no, no, don’t!”<br/><br/>When they saw Wang Xian arriving in front of them in an instant, the angels of darkness shouted in horror and despair!<br/><br/>Buzz<br/><br/>However, at the next moment, a wave of energy enveloped them. Soon, they summoned the divine kingdoms one by one!<br/><br/>With a wave of his arm, Wang Xian killed a total of 48 angels of Darkness!<br/><br/>“Let’s go, let’s continue!”<br/><br/>Wang Xian kept the bodies and said to them calmly!<br/><br/>“It’s the Dragon King, the Dragon King, and another place. It’s the gathering place for many powerhouses. There are definitely powerhouses from the angel race there, and possibly the Phoenix race!”<br/><br/>Wu Sha continued to speak!\t\t\t\t\t\t</div>", "images": {}, "success": true}