{"id": 717, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073335.html", "title": "Chapter 3708 - 3708 3707 Entered The Interior Of The Void Pagoda", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3708 - 3708 3707 Entered The Interior Of The Void Pagoda</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3708 3707 entered the interior of the Void Pagoda<br/><br/>“What a pity. The energy consumption of this phantom is too much. There are some things that he didn’t finish. This should be related to the Cataclysm!”<br/><br/>Wu Sha and the rest scanned their surroundings and frowned slightly!<br/><br/>The words of that phantom were related to the big secret of the entire universe. However, it was a pity that he didn’t finish his sentence!<br/><br/>Wang Xian scanned his surroundings and could only make a slight guess!<br/><br/>He checked his surroundings bit by bit. The results were pretty good.<br/><br/>“An lie, let’s go to the deepest part of the Void Pagoda!”<br/><br/>Since he didn’t find anything else, Wang Xian instructed an lie!<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded and followed Wang Xian to the barrier!<br/><br/>Wang Xian looked at an lie. He nodded and stretched out his hand.<br/><br/>“No, Dragon King. This is not an energy barrier. I need to teleport over!”<br/><br/>An lie could not extend his arm and spoke!<br/><br/>Wang Xian nodded his head.<br/><br/>Buzz<br/><br/>The next moment, an Lie’s figure disappeared. Very soon, he returned!<br/><br/>“Dragon King, this is a space that is exactly the same as this!”<br/><br/>An lie returned and spoke to him!<br/><br/>“Bring us there!”<br/><br/>Wang Xian said. Instantly, they arrived at another space!<br/><br/>This space was the same as the previous space. The difference was that there was nothing in it.<br/><br/>“Continue!”<br/><br/>Wang Xian continued to instruct!<br/><br/>An lie continued to teleport and check out some situations!<br/><br/>This time, an lie teleported over without checking out a single space.<br/><br/>After dozens of seconds, an lie returned to him!<br/><br/>“How is it?”<br/><br/>Wang Xian asked him.<br/><br/>“Dragon King, many places are the same as here. However, I found the location of a Hall!”<br/><br/>An lie replied.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian’s eyes lit up as he spoke!<br/><br/>Buzz<br/><br/>The next moment, they came to a strange hall!<br/><br/>The entire hall was very strange. There were chairs on the walls around them, and each chair was five meters in size!<br/><br/>A blank ball was floating above the chair in the center of the Hall!<br/><br/>This chair was even more majestic. It was about ten meters long, and strange patterns were carved on it!<br/><br/>The entire hall was extremely solemn.<br/><br/>There were patterns carved on the ground!<br/><br/>These patterns were all creatures that looked like demon beasts. They prostrated on the ground as if they were worshipping the surrounding chairs!<br/><br/>“There are more than ten thousand chairs. This chair is very strange, and the material is also very strange.”<br/><br/>Wu Sha flew in front of a chair and looked at it curiously!<br/><br/>The Magus lineage was the most knowledgeable lineage in the universe. The material that Wu Sha had never seen before was already very rare!<br/><br/>“Is this something from the Void World? It feels a little strange here!”<br/><br/>Ming shasheng scanned his surroundings and looked around with a face full of curiosity as well!<br/><br/>“An lie, can you sense anything?”<br/><br/>Wang Xian asked an lie!<br/><br/>“Dragon King, that transparent sphere is very strange. It gives me a strong feeling of energy.”<br/><br/>An lie pointed at the sphere and said!<br/><br/>Wang Xian flew over and sized up the sphere. He sensed it but nothing happened!<br/><br/>An lie stretched out his hand and placed his palm on the sphere. He hesitated for a moment before injecting some energy into it!<br/><br/>Buzz<br/><br/>At this moment, when an Lie’s energy was integrated into the sphere, the entire sphere emitted a special energy!<br/><br/>This energy felt a little hollow and a little strange!<br/><br/>The sphere lit up slowly and a ray of light shone downwards!<br/><br/>When the energy landed there, the entire space seemed to have undergone a change!<br/><br/>An incomparably huge space seemed to have appeared out of thin air!<br/><br/>The appearance of the space caused Wang Xian and the rest to be slightly stunned!<br/><br/>This was an exceptionally huge space. In the middle of the space, there was an incomparably huge statue!<br/><br/>The statue looked completely like a human. However, the difference was that the eyes of this statue had white pupils!<br/><br/>It had completely empty white eyes!<br/><br/>The clothes on its body seemed to be woven from scales!<br/><br/>Around this gigantic statue, there were a large number of corpses.<br/><br/>A large number of corpses that looked like demonic beasts!<br/><br/>There were so many corpses that one could not see the end of it!<br/><br/>“What a huge space. This void pagoda actually contains such a huge space?”<br/><br/>Wu Sha and the other seven mad demons revealed shocked expressions on their faces!<br/><br/>It was as though there was a planet hidden in this hall.<br/><br/>Wang Xian looked over and flew over immediately!<br/><br/>He sized up the gigantic statue and sensed that there were no energy fluctuations. After that, he flew around to take a look!<br/><br/>There were no living creatures in the entire space!<br/><br/>His gaze landed on the building below the statue and he flew over immediately!<br/><br/>The entire statue was about a million kilometers in size. Around the statue was a gigantic white building!<br/><br/>He entered the White Building and scanned the area!<br/><br/>This building was a little more normal, but many of the patterns on the building looked very strange!<br/><br/>The huge patterns seemed to be telling the history of the development of a race!<br/><br/>Wang Xian kept walking forward and realized that at the end was the foot of the statue.<br/><br/>However, there was an entrance at the foot of the statue. It was as if the entire statue was hollow!<br/><br/>When Wang Xian entered, he immediately sensed a special energy.<br/><br/>This energy was the same as the one on an Lie’s body!<br/><br/>“Dragon King, this energy contains the power of space. This energy is very strange. I feel like I can absorb it!”<br/><br/>At this moment, an lie, who was at the side, said in astonishment!<br/><br/>“Is that so?”<br/><br/>Wang Xian raised his eyebrows slightly and looked up!<br/><br/>There was a seat at the top.<br/><br/>The seat was located in the statue. It looked very strange no matter how one looked at it!<br/><br/>He flew over immediately and came to the side of the seat!<br/><br/>There were two balls and a few strange items on the seat. Wang Xian hesitated for a moment and sat on it!<br/><br/>He didn’t feel anything strange or odd!<br/><br/>“An lie, sit on it and try. This seat contains the power of space!”<br/><br/>Wang Xian said to an lie!<br/><br/>An lie nodded his head and sat on the chair. Energy surged into it!<br/><br/>Buzz<br/><br/>In the next moment, an Lie’s figure seemed to merge with the entire chair. Wang Xian could feel a strong pressure coming from an Lie’s body!<br/><br/>“What is this?”<br/><br/>A look of astonishment appeared on his face!<br/><br/>“Dragon King, this… This statue is not an ordinary statue. It’s a void armor. Through this void armor, I can see the entire space. In addition, I have obtained some information.”<br/><br/>As an lie spoke, his eyes shone. “I am now able to control the entire void pagoda. In addition, I have also obtained some information.”<br/><br/>“Information? What information?”<br/><br/>Wang Xian immediately asked an lie!<br/><br/>“Dragon King, this Void Pagoda is a war treasure belonging to the Void Royal Army. The previous owner has the strength of the Prince of the void. As for the exact level of the Prince of the void, I am not sure. There are a few treasures here that are very precious!”<br/><br/>An lie said.\t\t\t\t\t\t</div>", "images": {}, "success": true}