{"id": 718, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073337.html", "title": "Chapter 3709 - 3709 3708 Void Fusion, A Nine-Origin Divine Dragon!", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3709 - 3709 3708 Void Fusion, A Nine-Origin Divine Dragon!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3709 3708 void fusion, a nine-origin divine dragon!<br/><br/>“Treasure?”<br/><br/>Wang Xian’s eyes sparkled when he heard his words. His gaze landed on a few items at the side!<br/><br/>Other than the two balls that were connected to the seat, there were three other treasures!<br/><br/>One was a scroll, one was a dagger, and one was a box. There should be something in the box!<br/><br/>“Yes, Dragon King. These are all rare treasures!”<br/><br/>As an lie spoke, he picked up the scroll and said, “Dragon King, this is an escape scroll. You can use this scroll to instantly escape from any terrain or domain. You can use it three times!”<br/><br/>“This dagger belongs to the previous owner of the Void Pagoda. You have to possess spatial ability to use it. And inside this box is a treasure of the Void Universe, an extremely precious treasure!”<br/><br/>As an lie spoke, he opened the last box. Inside was a ball of white liquid.<br/><br/>“This is called void fusion. It allows an item that is compatible with oneself to fuse perfectly into one’s body. This is especially so when it comes to fusing with one’s bloodline. This is the most precious of the three treasures.”<br/><br/>Wang Xian’s eyes sparkled as he looked at the liquid that had fused with the void!<br/><br/>This was indeed a rare treasure!<br/><br/>A scroll that could ignore all restrictions was a treasure that could save one’s life!<br/><br/>And this void fusion was interesting!<br/><br/>At the same time, it was extremely useful. Such an item was even more of a treasure to a Magus!<br/><br/>“It can perfectly fuse something that fits one’s body into one’s own body!”<br/><br/>Wang Xian mumbled as his eyes sparkled!<br/><br/>He moved his body and the Genesis wings appeared behind his back!<br/><br/>Speaking of which, the genesis wings could be considered as a part of Wang Xian’s body, but it had yet to achieve a perfect fusion!<br/><br/>The power of wind and thunder was only circulating on the genesis wings. On the Genesis Wings was Wang Xian’s clone Dragon Soul!<br/><br/>This fusion was not perfect yet!<br/><br/>At present, Wang Xian’s corpse was very strange. The five elements were fused, the light and darkness were fused, and the wind and thunder were attached!<br/><br/>The five elements were completely fused with the body. The light and darkness were only at the heart. They were not completely fused with the five elements!<br/><br/>On the other hand, the wind and thunder were not even at the stage of fusing. They were merely attached!<br/><br/>“Why don’t I use this void fusion on the inceptive sage wings and my body, allowing it to reach the stage of the heart of Light and darkness?”<br/><br/>Wang Xian mumbled to himself!<br/><br/>He felt that he could give it a try!<br/><br/>After further fusion, Wang Xian felt that his strength should be able to increase with the convenience of speed and attack!<br/><br/>He calculated in his heart and kept the void fusion and scroll.<br/><br/>As for that dagger, only an lie could use it himself!<br/><br/>“Is there anything else besides these in this void Pagoda?”<br/><br/>Wang Xian asked an lie!<br/><br/>“That’s all, Dragon King. Now, I can simply control this void pagoda. Do you want to take it away?”<br/><br/>An lie asked!<br/><br/>“What’s the use of this Void Pagoda?”<br/><br/>Wang Xian asked him!<br/><br/>“The Void Pagoda has a powerful offensive ability. Currently, I can’t use it by myself. Furthermore, the Void Pagoda is equivalent to a temporary training ground for the void Royals in other universes. Our nine-origin universe has the energy of the void, but it will take a very long time to absorb it.”<br/><br/>“The defense of the Void Pagoda is also very terrifying. This kind of Void Pagoda is also a treasure to the void Royals!”<br/><br/>An lie replied!<br/><br/>“In order to not attract attention, the void pagoda can be placed here. An lie, it’s easy for you to come over!”<br/><br/>Wang Xian pondered for a moment and said!<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded!<br/><br/>After looking around once more, an lie opened the prohibition of the Void Pagoda. Wang Xian could come to any place in the Void Pagoda!<br/><br/>After taking a look around and failing to find any treasures, Wang Xian was ready to return!<br/><br/>“Let’s return to the Dragon Palace. The group of Space Beasts have escaped and the matters in the invincible zone have been settled.”<br/><br/>Wang Xian said to an lie!<br/><br/>“Yes!”<br/><br/>An lie replied immediately!<br/><br/>Wu Sha and the other crazy demons naturally followed Wang Xian back to the Dragon Palace!<br/><br/>With an lie around, they returned to the Dragon Palace in an instant!<br/><br/>“Greetings, Dragon King!”<br/><br/>As soon as Wang Xian returned, Prime Minister Gui who sensed something immediately rushed over and greeted him respectfully!<br/><br/>“Alright, go and arrange a place for Wu Sha and the rest to stay. Also, Don’t Disturb Me!”<br/><br/>He instructed Prime Minister Gui!<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui replied immediately and left with Wu Sha and the other seven crazy demons!<br/><br/>Wang Xian moved his palm and the void fusion appeared in his hand!<br/><br/>According to the method that an lie had mentioned, Wang Xian fused his own energy and blood into the void fusion!<br/><br/>Very soon, Wang Xian sensed that the void fusion seemed to have become a part of him!<br/><br/>It had formed a perfect fusion with him!<br/><br/>With a thought, Wang Xian controlled the void fusion to land on the top of the uninitiated holy wings and gradually surrounded them!<br/><br/>When the uninitiated holy wings were wrapped, he could clearly feel that his connection with the uninitiated holy wings had deepened!<br/><br/>There was even a feeling of being connected by blood!<br/><br/>One had to know that the uninitiated holy wings were the wings of a powerful demonic beast. That demonic beast had the ability to search for enemies in the Void!<br/><br/>Even though it had been a long time since Wang Xian obtained it, external objects were still external objects after all.<br/><br/>Due to the Dragon Soul of his clone, he could be considered to be half-fused with Wang Xian!<br/><br/>And now, Wang Xian could clearly sense the complete fusion of the incipient saint wings with his body!<br/><br/>“Ding! The incipient saint wings have perfectly fused with the host. Congratulations to the host for comprehending the law aspect: the transformation of the Netherworld Dragon and the birth of the wind and Thunder Dragon!”<br/><br/>“Ding! The fusion of the incipient saint wings is complete. The host’s yin-yang wind and Thunder Five Elements Divine Dragon has transformed into a nine-origin divine dragon!”<br/><br/>Just when the incipient holy wings had completely fused, the system’s voice suddenly rang out. This caused Wang Xian to immediately open his eyes and let out a dazzling luster!<br/><br/>Name: Wang Xian<br/><br/>Race: Nine-elemental Divine Dragon (man-dragon unity)<br/><br/>Level: Universe Knight Level 8(Divine Dragon Transformation, ninth transformation)<br/><br/>Origin: 1% (99% needed for the next breakthrough)<br/><br/>Supernatural ability: ruling the water tribe (ruling the water tribe below one’s level)<br/><br/>Devour living beings (devour living beings to extract origin)<br/><br/>Control of the five elements<br/><br/>Cultivation Method: Divine Dragon Transformation<br/><br/>Ability: soul-absorbing, spirit-attaching<br/><br/>Laws and abilities: Dragon Eye Lock, Five Elements Dragon Claw, Yin-yang realm-breaking, eight luminaries dragon scale, Sacred Dragon Shadow, Heavenly Dragon Eight Tribes, Dragon Tomb, Cloud Dragon Rising, true dragon body<br/><br/>Laws and abilities: eight dragon pillars, eight dragon avatars, towering dragon horns, Mighty Heavenly Dragon, God’s tail playing with beads, Dragon Breath of life, Shadow Dragon Avatars, Netherworld Dragon chasing, Netherworld Dragon Transformation, wind and Thunder Dragon Birth!<br/><br/>Control laws: metal, wood, water, fire, Earth, light, darkness, wind and thunder<br/><br/>Kingdom of God: Dragon Palace<br/><br/>Dragon Palace: Innate.<br/><br/>Members of Dragon Palace: 7960450<br/><br/>“He actually became a nine-origin divine dragon?”<br/><br/>Wang Xian stood in the Dragon King’s Hall. The nine attributes of metal, wood, water, fire, Earth, light, darkness, wind and thunder surrounded him.<br/><br/>The power of the five elements was hidden in his body. The power of Light and darkness was located on the surface of his body while the power of wind and thunder surrounded him!<br/><br/>All kinds of strange phenomena made Wang Xian look as if he contained a world!\t\t\t\t\t\t</div>", "images": {}, "success": true}