{"id": 715, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073331.html", "title": "Chapter 3706 - 3706 On Void Pagoda 3705", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3706 - 3706 On Void Pagoda 3705</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3706 On Void Pagoda 3705<br/><br/>“Dragon King, it’s right ahead.”<br/><br/>Just as the outside world was in a state of shock, Wu Sha and the rest, who were in the territory of the space behemoths in the invincible zone, pointed to the front and spoke to Wang Xian!<br/><br/>In the front, there was an incomparably huge nest in their line of sight.<br/><br/>This was a nest that was like a beehive. It contained a terrifying energy!<br/><br/>This energy made Wu Sha and the Rest’s hearts palpitate. They didn’t dare to enter recklessly!<br/><br/>“What is this? Do you guys know?”<br/><br/>Wang Xian stared at them and raised his eyebrows slightly!<br/><br/>The horrendous building that was like a beehive in front of them was very strange. It contained a very powerful aura!<br/><br/>Even Wang Xian felt that this aura was a little terrifying!<br/><br/>To be able to make him feel terrifying, one could imagine that it was definitely not an ordinary thing!<br/><br/>“I don’t know!”<br/><br/>Wu Sha shook her head.<br/><br/>“It is indeed a little strange. This place is already at the deepest part of the Invincible Zone. In the past, there were powerful space beasts running amok here. Even with our strength, we wouldn’t be able to come here.”<br/><br/>Ming shisheng said from the side. A thoughtful look appeared on his face. “I remember a senior once said that he went to the deepest part of the invincible zone and saw an unusable treasure. It should be this treasure!”<br/><br/>“Unusable treasure?”<br/><br/>Wang Xian was puzzled when he heard his words!<br/><br/>“Yes, I don’t understand why that senior said that either. However, he should be referring to the nest in front. This nest doesn’t look like a dilapidated divine kingdom!”<br/><br/>Ming shasheng nodded and said!<br/><br/>“Indeed, it doesn’t look like it!”<br/><br/>Lei Shan looked ahead and nodded faintly. “However, this building is still here. It wasn’t taken away by the powerhouses of the peak races. There must be a special reason!”<br/><br/>Wang Xian nodded his head slightly. “A bunch of space beasts are hiding in here?”<br/><br/>“Not Here!”<br/><br/>Wu Sha nodded her head. “Dragon King, according to my array formation, they are hiding in there. Look, beside this strange building, there is a dilapidated divine kingdom!”<br/><br/>Wang Xian looked over and indeed, beside this beehive, there was a dilapidated divine kingdom of the void!<br/><br/>More than half of the Void Kingdom had entered the beehive!<br/><br/>“Let’s Go!”<br/><br/>Wang Xian looked at the dilapidated divine kingdom that had entered the beehive and flew over!<br/><br/>At the same time, he sent a message to an lie!<br/><br/>When he was near the beehive building, Wang Xian suddenly sensed a familiar aura from it!<br/><br/>He raised his gaze and set up a demonic altar in front of him!<br/><br/>“Greetings, Dragon King!”<br/><br/>The next moment, an Lie’s figure appeared in front of Wang Xian and greeted him!<br/><br/>“Eh?”<br/><br/>Wu Sha and the rest were astonished when they saw an lie’s sudden appearance.<br/><br/>He directly ignored space and the void barrier of the invincible zone. This ability was a little strange!<br/><br/>“Eh? Dragon King, this strange building gives me a very familiar feeling, a feeling of space!”<br/><br/>An Lie, who had just appeared, looked at the Beehive building and said with a puzzled expression!<br/><br/>“Is that so?”<br/><br/>Wang Xian saw that his eyes were sparkling. Space was an Lie’s way of addressing his ability!<br/><br/>Be it teleportation or teleportation, an Lie’s ability involved space!<br/><br/>And in the universe, there was no space attribute!<br/><br/>Of the nine great attributes of the universe origin, the origin attribute combined and evolved into other special attributes, but there was no space attribute!<br/><br/>And there was no so-called time attribute!<br/><br/>But dark lie controlled space, which was very strange!<br/><br/>This was related to the devil spirit altar and the monsters that he had met before!<br/><br/>This beehive building had a space that dark lie was familiar with?<br/><br/>“An lie, enter the dilapidated divine kingdom next to it first. Be careful when you enter. There are some powerful cosmic scavs inside!”<br/><br/>Wang Xian’s eyes flickered slightly. The Tai Chi Dragon Disc was attached to an Lie’s body as he spoke to him!<br/><br/>“Alright, Dragon King!”<br/><br/>An lie shifted his gaze and landed in the dilapidated divine kingdom beside him.<br/><br/>The next moment, his figure disappeared!<br/><br/>“Dragon King, what is this?”<br/><br/>Lei Shan and the rest saw an lie disappear in an extremely strange manner. They were astonished.<br/><br/>They could sense that an lie did not seem to be very strong. However, his ability to appear and disappear without a trace astonished them.<br/><br/>Wang Xian did not answer them. He stood there quietly!<br/><br/>Buzz<br/><br/>Very soon, an Lie’s figure appeared beside Wang Xian and nodded at him.<br/><br/>“Let’s go. Don’t resist.”<br/><br/>Wang Xian ordered Wu Sha and the rest. An Lie’s energy enveloped them and they disappeared in an instant!<br/><br/>After they entered, Wang Xian scanned his surroundings!<br/><br/>This was the interior of a normal dilapidated divine kingdom.<br/><br/>He didn’t see any signs of the space behemoth!<br/><br/>“HMM? The aura of the space behemoth is still here, but it seems to have left.”<br/><br/>Wu Sha sensed her surroundings and held a compass in her hand. She frowned slightly!<br/><br/>“The space Behemoth’s intelligence is not low. They might have already left!”<br/><br/>Shi Sen said!<br/><br/>Wang Xian scanned his surroundings and stared at the spot in front of him!<br/><br/>He moved and flew over immediately.<br/><br/>As he flew forward, Wang Xian realized that the space in front of him seemed to be separated!<br/><br/>And a part of this divine kingdom had merged into another space!<br/><br/>“Could it be inside?”<br/><br/>Water Demon flew over and made a guess.<br/><br/>Wu Sha held the wizard compass and frowned. She couldn’t figure out anything!<br/><br/>“An lie, can you sense anything?”<br/><br/>Wang Xian stared ahead and asked!<br/><br/>“Dragon King, this energy that separates the void is similar to the energy in my body!”<br/><br/>An Lie’s eyes sparkled as he said.<br/><br/>The birth of an lie was very coincidental and strange. It could not be replicated!<br/><br/>And an Lie’s upgrade was also very strange. He needed to absorb the energy of the Devil Spirit Altar.<br/><br/>In his mind, there was an icon of the devil spirit altar, densely packed with countless icons.<br/><br/>He could teleport directly, but the place where he teleported was very strange, very strange.<br/><br/>That place didn’t seem to be the interior of the heaven-opening primordial land.<br/><br/>There were also strange creatures there.<br/><br/>With Wang Xian’s current horizons, he still didn’t understand what that place was.<br/><br/>In short, everything seemed very strange.<br/><br/>He was also very curious about this beehive building that was similar to the dark intense energy.<br/><br/>“Go in and take a look. You must be careful.”<br/><br/>Wang Xian spoke to him!<br/><br/>“Dragon King, I don’t think I need to teleport.”<br/><br/>As an lie spoke, he walked to the energy that divided the void and extended his hand to touch it!<br/><br/>His palm easily passed through it.<br/><br/>“Huh?”<br/><br/>Wang Xian raised his eyebrows slightly when he saw this. He also walked over and extended his palm!<br/><br/>However, his palm was blocked outside!<br/><br/>The power of the five elements was condensed, but it had no effect on this energy.\t\t\t\t\t\t</div>", "images": {}, "success": true}