{"id": 722, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073345.html", "title": "Chapter 3713 - 3713 3712 Divine Dragons Were Not To Be Offended", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3713 - 3713 3712 Divine Dragons Were Not To Be Offended</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3713 3712 divine dragons were not to be offended<br/><br/>“Eh? The aura of the Yalong?”<br/><br/>“Sir from the Dragon Palace, there are no Yalong in our clan!”<br/><br/>A few experts from the god Hunter clan were slightly shocked when they heard Lei Ming’s words and immediately replied!<br/><br/>“Eh? What Happened?”<br/><br/>“It’s a true dragon from the Dragon Palace. He said that we have Yalong here. Do We Have Yalong in our clan?”<br/><br/>“The Dragon Palace released the news a year ago. They said that they have enslaved Yilong and forbade the killing of Yilong.”<br/><br/>Some of the strong disciples of the god Hunter clan looked over in surprise!<br/><br/>In the central hall of the god Hunter clan, a young man saw the huge divine dragon in front of him. His pupils constricted and his eyes showed Panic!<br/><br/>“Bring that Asian dragon here in ten seconds. If that Asian dragon is not enslaved by you and is willing, then you will be safe. If you enslave someone with the bloodline of the Divine Dragon, then you will be destroyed!”<br/><br/>Lei Ming stared at them and said with a dignified face!<br/><br/>The divine dragon must not be offended!<br/><br/>Now that the Dragon Palace had risen, no force could offend the Dragon Palace!<br/><br/>And no force could offend someone with the bloodline of the Divine Dragon!<br/><br/>Once they were discovered, they would be destroyed!<br/><br/>“What? The Dragon Palace is so powerful!”<br/><br/>“The Dragon Palace made a statement a year ago. I didn’t expect it to come here directly. Do We have a quasi-dragon in the god-hunting clan?”<br/><br/>“Oh no!”<br/><br/>All the powerful disciples of the god-hunting clan heard Lei Ming’s words, and their faces changed slightly. They looked a little panicked!<br/><br/>“Whoosh!”<br/><br/>At this moment, an old man flew out from the center of the god-hunting clan, he cupped his hands toward Lei Ming and said, “Lord of the Dragon Palace, there is indeed no Asian dragon in our god-hunting clan. If this Lord Dragon God doesn’t believe us, you can come in and look for him!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>Hearing his words, Lei Ming’s body moved, and his huge dragon body flew directly toward the center of the god-hunting clan!<br/><br/>He stretched out his dragon claw and clawed downwards!<br/><br/>“Sir from the Dragon Palace, we are already willing to let you search for him personally. We have proven our innocence. Please do not attack us!”<br/><br/>When the old man saw Lei Ming forcefully break through their building, his heart pounded violently, and he could not help but say this!<br/><br/>Lei Ming ignored him, and his dragon claw grabbed downwards.<br/><br/>The defense of the hunting God clan’s estate-world was opened.<br/><br/>However, the defense of the hunting God clan’s estate-world was only able to withstand a level 2 universe ruler’s Attack!<br/><br/>It was broken through by Lei Ming!<br/><br/>“Not good!”<br/><br/>A young man standing around the hunting God clan’s main hall saw the location of Lei Ming’s attack. His heart was beating fast, and his eyes were filled with fear!<br/><br/>“Pu!”<br/><br/>A God country was directly grabbed by Lei Ming, and the energy rebounded on that young man’s body, causing him to spit out fresh blood!<br/><br/>“Peng!”<br/><br/>The God country shattered. Lei Ming stared inside and locked onto a dragon lady with dragon horns!<br/><br/>This dragon Lady’s eyes were somewhat dull. When she saw Lei Ming, her body trembled violently!<br/><br/>“I am a true dragon of the Dragon Palace. I have ordered the Dragon King to patrol the universe God Dragon Bloodline. If you are imprisoned or enslaved, I will make the decision for you!”<br/><br/>Lei Ming stared at this Dragon Lady and asked!<br/><br/>A powerful dragon aura surrounded her!<br/><br/>“Lord, Lord True Dragon, save me!”<br/><br/>That Dragon Lady immediately knelt down and begged!<br/><br/>“Alright!”<br/><br/>Lei Ming heard her words and moved his Dragon Claw. A bolt of lightning wrapped around her, causing her to quickly fly up into the sky!<br/><br/>“Those who offend the Dragon God race will die!”<br/><br/>Lei Ming growled, and an extremely vast power of lightning erupted from his body towards his surroundings!<br/><br/>The surrounding areas were instantly covered by lightning!<br/><br/>“Not good, our young Patriarch’s divine kingdom actually has an inferior dragon!”<br/><br/>“Oh no!”<br/><br/>Some of the god Hunter clan’s powerful disciples saw this scene and revealed terrified expressions!<br/><br/>Their young patriarch had enslaved an inferior dragon!<br/><br/>He had hidden the ya long in his own divine kingdom!<br/><br/>This…<br/><br/>“The Thunder Dragon destroys the world, the divine dragon is not to be offended!”<br/><br/>Lei Ming growled and countless bolts of lightning fell down. The destructive power made all the god Hunters’experts look terrified and desperate!<br/><br/>“It’s over, the young clan leader’s matter has been discovered!”<br/><br/>“No, no, no!”<br/><br/>At this moment, all the god Hunters’disciples felt the space around them change drastically.<br/><br/>Boom! Boom! Boom<br/><br/>The next moment, the entire god Hunter tribe was covered in lightning.<br/><br/>“Roar! Roar! Roar!”<br/><br/>Lei Ming released a powerful Dragon’s might. The dragon’s might swept across and the dragon’s breath descended.<br/><br/>“No, that’s the ya long that the young tribe leader enslaved. What does that have to do with us? No, no.”<br/><br/>“Damn Young tribe leader.”<br/><br/>The world was destroyed and the Lightning Dragons wreaked havoc.<br/><br/>Lei Ming released all of his strength. All the buildings of the god Hunter tribe quickly collapsed and disappeared.<br/><br/>With their strength, even escaping was extremely difficult.<br/><br/>In the sky, the imprisoned ya Longnu couldn’t help but cry when she saw this scene.<br/><br/>In less than a few minutes, the entire god-hunting clan was destroyed.<br/><br/>“You can go find your family. Without a family, you can live in a neutral city, or you can go to the Dragon Palace of the Eternal Sky River. If you can pass through the Dragon Gate, you can become a disciple of the Dragon Palace. If you can’t, you can live in the surroundings.”<br/><br/>Lei Ming killed the god Hunter tribe and said to the Dragon Lady. He waved his arm and some divine stones landed beside him!<br/><br/>He swayed his huge body and left immediately!<br/><br/>The god Hunter Tribe’s lair had completely turned into ruins!<br/><br/>“Thank you, Lord Dragon God! Thank you, Lord Dragon God of the Dragon Palace!”<br/><br/>The dragon lady floated in the air and immediately knelt down as she said gratefully.<br/><br/>Her eyes were filled with excitement and excitement.<br/><br/>As well as the pride and pride from her bloodline and heart!<br/><br/>In the future, no one would dare to bully her!<br/><br/>Such a scene didn’t only happen in the god-hunting clan, but also in other races.<br/><br/>The Dragon Palace’s order had been issued a year ago, and the experts of the other races in the heaven opening primal continent also paid great attention to it.<br/><br/>But even if they were paying close attention to it, as long as I hid the Yalong in my own divine kingdom, wouldn’t everything be fine?<br/><br/>How could the Dragon Palace know that they were enslaving the Yalong in the grotto-heaven blessed land?<br/><br/>This wasn’t a fluke, but their naive belief!<br/><br/>But this time, they were wrong!<br/><br/>There was a huge gap between the peak races and the advanced races!<br/><br/>The current Dragon Palace could already be said to have stepped into the threshold of the peak races!<br/><br/>Wu Sha’s strength was comparable to a rank 1 magus.<br/><br/>The dragon searching compass she created could already be said to be a treasure created by a peak race expert!<br/><br/>It naturally had an effect that these high-ranked races couldn’t imagine!<br/><br/>This caused this group of lucky experts and races to suffer a disaster!<br/><br/>When the experts and races were destroyed by the Dragon Palace’s Divine Dragon, this news spread at a terrifying speed!<br/><br/>The action of the Dragon Palace, the strength of the Dragon Palace, caused a great uproar!\t\t\t\t\t\t</div>", "images": {}, "success": true}