{"id": 728, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073357.html", "title": "Chapter 3719 - 3719 The 3718 Throne Was Not Something That Could Be Easily Done?", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3719 - 3719 The 3718 Throne Was Not Something That Could Be Easily Done?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3719 The 3718 throne was not something that could be easily done?<br/><br/>“With the Dragon King’s strength, he is not qualified to sit side by side with our king. Although the Dragon King is invincible in the invincible region, there is no universe dominator in the invincible region after all.”<br/><br/>“I heard that the Dragon King of the Dragon Palace and the granddaughter of the black vulture king, Princess Ling Honggu, have a very good relationship. It is possible that this is the reason. Moreover, the Dragon King’s strength is much stronger than a universe dominator at level one!”<br/><br/>At the bottom, some skeletons were discussing in secret!<br/><br/>The skeleton clan valued the strong as their king.<br/><br/>They were all the subordinates of the black vulture king. The black vulture king did not say anything, and their king did not say anything either. Naturally, they could not say anything either.<br/><br/>“This must be the Dragon King. Hehe, the Dragon Palace’s battle record is quite brilliant.”<br/><br/>At the side, a skeleton looked at Wang Xian and said with a smile.<br/><br/>“I’m impressed. I Can’t be compared to the seniors!”<br/><br/>Wang Xian smiled and cupped his hands at them.<br/><br/>“Haha, Dragon King, you’re too modest. With your potential, you might surpass us in a short time.”<br/><br/>The black vulture king smiled and introduced him to Wang Xian. “Come, Dragon King, let me introduce you. This is king Gbagbo, King Kushan, King Yama, and King Tan. These are my friends!”<br/><br/>“Greetings, everyone!”<br/><br/>Wang Xian cupped his hands at them.<br/><br/>“Haha, I look forward to another peak race in the universe. I also look forward to reaching the level of a universe overlord.”<br/><br/>King Yama smiled at Wang Xian and said!<br/><br/>They were friends of the black vulture king. Naturally, they would give him face.<br/><br/>Wang Xian had a simple conversation with them. His gaze swept across the surroundings. He was a little surprised by the skeleton experts present.<br/><br/>The skeleton race was a peak race that had just been born during this calamity.<br/><br/>However, just a single black vulture king had summoned some good friends and skeleton kings. There were more than 100 ruler-level experts who had arrived. This made him extremely surprised!<br/><br/>How could the skeleton race have so many ruler-level experts?<br/><br/>This made him a little puzzled and surprised!<br/><br/>“WHOOSH WHOOSH WHOOSH!”<br/><br/>“Hahaha, black vulture king, I only have a granddaughter who has advanced to the ruler-level of the universe. To think that there would be so many of them. TSK TSK.”<br/><br/>At this moment, a powerful voice was heard from the back!<br/><br/>Wang Xian looked over and his eyes flickered slightly.<br/><br/>This was a skeleton king with more than thirty skeleton kings. The four skeleton kings in the lead all had the level of a universe dominator at level two.<br/><br/>The one who spoke was a skeleton king with a long tail that looked like a lizard man!<br/><br/>His entire body was blood-red and was filled with a violent aura.<br/><br/>His entire body was like a blood-red metal that radiated sharpness.<br/><br/>The three skeleton kings beside him also carried powerful auras.<br/><br/>Behind him was a group of skeleton kings at the ruler realm.<br/><br/>Another thirty or so rulers had arrived.<br/><br/>“Haha, Lizard King, I’m happy that my granddaughter has broken through. If you have any grandchildren who have broken through, you can invite me.”<br/><br/>The black vulture king stood up and laughed.<br/><br/>“Hehe!”<br/><br/>The lizard king laughed coldly. “It’s just an additional ruler. I’m not that bored.”<br/><br/>“I heard that your granddaughter has obtained a powerful inheritance. Looks like her future potential is not simple. We will have to experience it later.”<br/><br/>Beside the Lizard King, a skeleton king said with a smile.<br/><br/>“Alright.”<br/><br/>The black vulture king nodded.<br/><br/>Four Skeleton Kings flew over. Wang Xian could tell that the black vulture king and the lizard king were not on good terms. Clearly, there was some enmity between them.<br/><br/>However, he did not know why he was invited over.<br/><br/>He did not understand the rules of the skeleton clan either.<br/><br/>“Yama King, Fishy King, you old guys are here too.”<br/><br/>The Lizard King came to the side and swept his gaze across the few skeleton kings beside the black vulture king.<br/><br/>“Hehe, of course we have to come over!”<br/><br/>Yama king replied to him indifferently.<br/><br/>“Haha!”<br/><br/>The Lizard King laughed out loud and sat on the throne beside him. He suddenly turned his head and looked at Wang Xian. “You haven’t broken through to the realm of the ruler of the Universe?”<br/><br/>“Dragon King of the Dragon Palace!”<br/><br/>Wang Xian looked at him and cupped his hands indifferently!<br/><br/>“Dragon King of the Dragon Palace? I’ve heard of him.”<br/><br/>The Lizard King’s pupils were flickering with ghostly flames as his gaze landed on the black vulture king. He spread his hands on the throne and said, “Black vulture king, don’t let any random kid sit beside us. His qualifications and strength are not enough!”<br/><br/>“HMM?”<br/><br/>The black vulture king heard his words and looked at him. “Lizard king, it’s my territory. I’ll make the decision!”<br/><br/>“It’s your territory, but if any of you can sit beside me, that would be disrespectful to me.”<br/><br/>The Lizard King said indifferently as his fingers tapped on the chair!<br/><br/>“Alright, Lizard King. Today is my granddaughter’s celebration.”<br/><br/>The Black Vulture King’s voice turned solemn as he spoke.<br/><br/>“Am I Wrong?”<br/><br/>The Lizard King looked at him. His gaze swept across the few skeleton kings beside him as he asked with a smile.<br/><br/>“The Lizard King is right.”<br/><br/>One of the skeleton kings chimed in and looked at Wang Xian.<br/><br/>Wang Xian sat there and raised his eyebrows. He placed both of his hands on the seat and looked at the Lizard King. “Lizard King, do you have a problem with me?”<br/><br/>“Oh?”<br/><br/>When the lizard king heard Wang Xian’s question, the ghostly fire in his eyes grew even more intense. He stared at Wang Xian coldly.<br/><br/>“If you have a problem with me, just tell me, Lizard King!”<br/><br/>Buzz<br/><br/>As soon as Wang Xian finished his sentence, his figure and throne disappeared instantly.<br/><br/>When the Lizard King saw Wang Xian disappear, his pupils contracted slightly.<br/><br/>“Today is a celebration for our friends. Let’s celebrate with a toast.”<br/><br/>A voice suddenly appeared on the right side.<br/><br/>In the next moment, a wine cup was suspended in front of the Lizard King. The wine was poured into the cup!<br/><br/>Wang Xian appeared one meter to the right of the Lizard King. He raised the wine glass and gestured at the Lizard King with a smile.<br/><br/>The ghostly fire in the Lizard King’s eye dimmed instantly. He raised his tail slightly and stared at Wang Xian with vigilance and shock.<br/><br/>Buzz<br/><br/>The wine glass in front of him moved slightly and appeared in front of the Lizard King.<br/><br/>The Lizard King looked over and clenched his fist slightly. A wave of energy covered the wine glass!<br/><br/>An invisible resistance began!<br/><br/>“Hahaha, as expected of the Dragon King who can bring the Divine Dragon clan back to the peak of their race.”<br/><br/>A second later, the Lizard King laughed out loud. He reached out his hand and took the wine cup. He downed the wine cup and laughed out loud.<br/><br/>“The Lizard King is awesome!”<br/><br/>Wang Xian smiled and raised his wine cup to toast. His figure and the throne disappeared in an instant and he returned to his previous position!<br/><br/>Upon seeing this scene, the expressions of the skeleton king and his subordinates froze slightly.<br/><br/>Even the black vulture king was slightly shocked!<br/><br/>Just now, when Wang Xian suddenly came to the side of the Lizard King, they didn’t notice him.<br/><br/>However, when he returned to his original position, they were all looking at him.<br/><br/>However, they only saw a blurry shadow flash by.<br/><br/>What did this mean?<br/><br/>It meant that the Dragon King was much faster than they were, even on a different level!\t\t\t\t\t\t</div>", "images": {}, "success": true}