{"id": 720, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073341.html", "title": "Chapter 3711 - 3711 3710 Re-Established The Might Of The Dragon God", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3711 - 3711 3710 Re-Established The Might Of The Dragon God</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3711 3710 re-established the might of the Dragon God<br/><br/>“Dragon King’s order, Dragon Palace’s order. From today onwards, no disciple of any race or faction in the universe is allowed to hunt and sell the Dragon God’s bloodline. Without the consent of the Dragon God’s bloodline, they are forbidden to be used as mounts, and they are forbidden to enslave the Dragon God’s bloodline.”<br/><br/>“It is forbidden to transfer the body of the Dragon God’s bloodline, and it is forbidden to extract the dragon God’s bloodline. Once discovered, the entire race will be exterminated!”<br/><br/>Very soon, this news spread at a terrifying speed on the universal AI and within the heaven-splitting primordial land!<br/><br/>Furthermore, the divine dragon that carried the will of Wang Xian came to the periphery of the surrounding starry skies and heaven-splitting primordial land. He also released this news on the universal ai!<br/><br/>The moment this news was released, it caused a huge sensation!<br/><br/>“This… This dragon king is making such a domineering announcement. This is simply the prestige of the re-established Divine Dragon Clan. is the Dragon King preparing to elevate the Dragon Palace to the peak of the race in the future?”<br/><br/>“Hiss, this announcement is extremely powerful. Ever since the fall of the Divine Dragon Clan, many experts from the races in the universe, especially wizards, coveted the bloodline of the Divine Dragon and transferred the body of the Divine Dragon bloodline to themselves. Now that this news is out, it is completely the prestige of the re-established Divine Dragon. Some races are probably going to be in trouble!”<br/><br/>“After the destruction of the Divine Dragon Clan, many magi coveted the bloodline of the Divine Dragon. Many experts took pride in having a dragon steed. Now that the dragon palace has risen, the prestige of the Divine Dragon has returned!”<br/><br/>“This time, many races will suffer. If they still dare to deal with the Dragon Steed, they will probably be destroyed by the Dragon Palace!”<br/><br/>“I don’t know how strong the Dragon Palace is now, but the strength of the Dragon King alone can sweep through the entire invincible region. The strength of the Dragon King now is no weaker than a true ruler of the Universe!”<br/><br/>Within the heaven opening primal continent, the powerful disciples of the various races were discussing!<br/><br/>This news from the Dragon Palace also shocked them!<br/><br/>This could be a sign that the Dragon Palace had advanced to a peak race!<br/><br/>The glory and magnificence of the Divine Dragon Clan had gradually been revealed!<br/><br/>Within the heaven opening primal continent, the various powers attached great importance to this announcement and order from the Dragon Palace!<br/><br/>Some forces that hunted and even kept the Yalong immediately let them go!<br/><br/>Some disciples with Yalong mounts also immediately let their mounts go!<br/><br/>They all knew that the Dragon Palace’s order wasn’t a simple announcement!<br/><br/>With the current might of the Dragon Palace, if they were discovered, their entire clan might be exterminated!<br/><br/>If the Dragon Palace wanted to become a peak race in the future, they had to make an example out of the others. They had to show the power of the Divine Dragon.<br/><br/>To provoke the dragon palace at this time was courting death.<br/><br/>Besides, in the current universe, besides the peak race, which other force could compete with the Dragon Palace?<br/><br/>No, not a single one.<br/><br/>Didn’t you see that the Dragon King dared to kill the Phoenix and the Angel in the Invincible Zone?<br/><br/>He even killed a Phoenix and an angel to escape the Invincible Zone?<br/><br/>If the Dragon King dared to do that, then it was needless to say that he would kill them<br/><br/>All the high-level races in the heaven opening primal continent were like that, not to mention the outer area of the heaven opening primal continent!<br/><br/>As soon as the Dragon Palace stepped into the heaven opening primal continent, they had carved out a bloody path in the outer area!<br/><br/>Now that they had received this news, they only needed to look up the information of the Dragon Palace on the universal ai to know how terrifying the Dragon Palace was!<br/><br/>The outer races naturally didn’t dare to touch the prestige of the Dragon Palace!<br/><br/>“HM? A powerhouse of the Divine Dragon Clan has issued a statement on our side, forbidding the hunting and selling of the inferior dragons. Furthermore, this is an order from the Dragon Palace, an order from the Dragon King?”<br/><br/>“Dragon Palace? Didn’t they enter the heaven opening primal continent over a thousand years ago? Why did they suddenly issue such a statement on our side?”<br/><br/>“I don’t know. Back then, the Dragon Palace was invincible in our side, especially during the landing battle. It was a heaven-defying move!”<br/><br/>“The Dragon Palace should be very powerful now. However, aren’t the forces of the heaven-opening desolate continent forbidden from interfering in our affairs?”<br/><br/>“Quickly search for the current situation of the Dragon Palace. My God, the Dragon Palace is almost invincible in the heaven-opening desolate continent. They are known as invincible beings below the peak races!”<br/><br/>“Really? How is this possible? The Dragon Palace has only been in the heaven-opening desolate continent for more than a thousand years!”<br/><br/>The universe outside the heaven-opening desolate continent was completely different from the continent!<br/><br/>If they didn’t search for some information, they wouldn’t know the information on the heaven-opening desolate continent!<br/><br/>The interior of the heaven-opening desolate continent and the surrounding starry sky were completely different worlds!<br/><br/>They were slightly surprised when they saw the experts of the Dragon Palace release the information in their area!<br/><br/>Some experts searched the information of the Dragon Palace and were immediately shocked!<br/><br/>However, although they were shocked, many disciples of the experts only discussed it and didn’t take it to heart!<br/><br/>It was because the emperor was far away!<br/><br/>Secondly, there was a rule in the universe that the powerful ones in the heaven opening desolate continent couldn’t slaughter the races and powerful ones on their side for no reason!<br/><br/>“Let’s ignore this news from the Dragon Palace for the time being. The Dragon Palace hasn’t reached the peak of the race yet. Their claws can’t reach us. We’ve even nurtured thousands of mounts with the bloodline of the Divine Dragon. This is the most precious treasure of our Imperial Dragon.”<br/><br/>On a planet in the starry sky, the clan leader of a force said with a twinkle in his eyes!<br/><br/>“Clan leader is right. Although the Dragon Palace is strong, it can’t reach us yet. However, I’ve checked that the Dragon Palace is likely to advance to the peak of the race. Clan leader, we still need to make some arrangements!”<br/><br/>An elder replied!<br/><br/>“Yes, we need to make some preparations. How troublesome. I didn’t expect the Divine Dragon Clan to rise so quickly. Damn it!”<br/><br/>The clan leader in the center frowned and cursed!<br/><br/>The news from the Dragon Palace touched the interests of many clans and even touched the foundation of some clans!<br/><br/>Dragon Knights were very well-known no matter where they were!<br/><br/>The news from the Dragon Palace made the term Dragon Knight disappear completely!<br/><br/>However, it was still the same. The sky was high, the emperor was far away, and there were some rules. The forces surrounding Lu Xingkong completely ignored the rules of the Dragon Palace!<br/><br/>Although some forces ignored the order of the Dragon Palace, there was one thing that all the sub-dragons and those with the bloodline of the divine dragon were extremely excited when they heard the news!<br/><br/>“Thank you, Dragon King. We finally have another powerful leader!”<br/><br/>“If the Dragon Palace can reach the peak of the race, then no one in the universe would dare to enslave us, the Yalong, and worship the Dragon King!”<br/><br/>Some of the people with the Dragon God bloodline looked in the direction of the heaven-splitting chaotic land and knelt down, worshipping excitedly!\t\t\t\t\t\t</div>", "images": {}, "success": true}