{"id": 726, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073353.html", "title": "Chapter 3717 - 3717 3716 Spirit Demon Clan Invited Lan Qingyue For A Breakthrough", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3717 - 3717 3716 Spirit Demon Clan Invited Lan Qingyue For A Breakthrough</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3717 3716 spirit demon clan invited Lan Qingyue for a breakthrough<br/><br/>“It’s the Dragon King!”<br/><br/>Wu Sha and the rest replied respectfully when they heard Wang Xian’s words.<br/><br/>They immediately flew towards their own residence.<br/><br/>“Dragon King, our Dragon Palace has already given birth to a true ruler. We can now advance to the peak race and regain the glory of the Divine Dragon Clan.”<br/><br/>Prime Minister Gui walked over excitedly and said.<br/><br/>“It’s no problem for us to advance to the peak race. However, we are still lacking to regain the glory of the Divine Dragon Clan. The news of Wu Sha and the rest breaking through has been hidden for the time being.”<br/><br/>Wang Xian said with a smile.<br/><br/>Prime Minister Gui nodded from the side.<br/><br/>“You should have seen Wu Sha and the rest breaking through just now. I hope that more and more disciples in our Dragon Palace can break through to the ruler realm.”<br/><br/>He glanced around and said.<br/><br/>“All of you will work hard to cultivate and strive to break through the shackles!”<br/><br/>The disciples of the Dragon Palace who had reached the peak of the supremacy realm bowed and said.<br/><br/>Wang Xian nodded.<br/><br/>Currently, there were more than 1,500 powerhouses in the Dragon Palace who had reached the third level of the ruler realm.<br/><br/>As for those who had reached the peak of the supremacy realm, there were more of them.<br/><br/>After all, the devouring dragon could only fight two levels higher.<br/><br/>However, there were no shackles for the devouring dragon to break through.<br/><br/>Similarly, it was also very troublesome for them to advance. Although there were no shackles, they needed to devour the Divine Kingdom of a master level powerhouse.<br/><br/>Or it could be a supreme treasure of this level.<br/><br/>In total, there were about 1,500 powerhouses.<br/><br/>These 1,500 had already reached the peak. As for how many of them could break through and how long it would take for them to break through, Wang Xian had no idea.<br/><br/>A Universe Knight at the peak would take different times to complete the breakthrough.<br/><br/>Some could take tens of thousands of years, while others could take hundreds of millions of billions of years.<br/><br/>Of course, the 1,500 disciples of the Dragon Palace at the peak of the supremacy could also break through within a few years.<br/><br/>In short, it was uncertain.<br/><br/>However, the Dragon Palace had a dragon field. In the Dragon Field, it could greatly improve the comprehension ability of all the members of the Dragon Palace.<br/><br/>The effect of the Dragon Field of the Divine Dragon Clan in the past was not as powerful as the effect of the dragon palace like Wang Xian.<br/><br/>Logically speaking, the chances of the improvement of the experts of the Dragon Palace were much higher when they were cultivating in the dragon field.<br/><br/>After Wu Sha and the rest had improved, they did not disrupt Wang Xian’s plan.<br/><br/>He continued to return to the land of Devil Bone’s blood plasma and began to condense the blood refinement fruit.<br/><br/>Time passed quickly. The number of purebred divine dragons in the dragon palace had increased from 2,000 to more than 5,000.<br/><br/>However, as the Dragon Palace did not obtain a large amount of resources, it did not receive much improvement.<br/><br/>One day, a thousand years later, Wang Xian suddenly received an invitation.<br/><br/>The invitation was sent to him by the Spirit Demon King. He was invited to participate in the celebration of his daughter, Ling Honggu.<br/><br/>Yes, Ling Honggu had a breakthrough!<br/><br/>She had achieved a breakthrough more than ten years ago and became an existence at the level of a universe overlord.<br/><br/>The spiritual demon clan had also joined the skeleton clan completely.<br/><br/>With the presence of the spiritual red bone’s grandfather, the black vulture king, they naturally joined the black vulture King’s camp.<br/><br/>Now, the black vulture king was going to hold a celebration for the spiritual red bone.<br/><br/>Wang Xian immediately replied.<br/><br/>He was in the land of the demon bones and was very close to the spiritual demon clan from here!<br/><br/>He wasn’t in a hurry even though the distance was very close.<br/><br/>“Buzz Buzz!”<br/><br/>At the same time, in the Dragon Palace, where the Dragon Queens lived.<br/><br/>Lan qingyue, who was cultivating, suddenly sensed a majestic energy surging toward her. Her expression changed slightly, and she immediately opened her eyes.<br/><br/>In her eyes, the small house and Little Blue’s huge bodies appeared!<br/><br/>The Little Blue House in her eyes emitted a vast and terrifying aura. They seemed to be floating in the ocean, and the energy around them was rolling. It was a shocking scene.<br/><br/>The gray energy slowly surrounded them like a nirvana egg!<br/><br/>In the Dragon Palace, Lan Qingyue’s figure was also slowly covered by the gray energy.<br/><br/>The huge commotion on his side immediately attracted the attention of a group of girls.<br/><br/>Guan Shuqing and the other girls flew over. When they saw Lan Qingyue covered in energy, they were shocked.<br/><br/>“This situation seems like the scene when Wu Sha and the rest broke through. Could it be that Qingyue is about to break through?”<br/><br/>“It should be that Xiao Lan’s small house broke through. Qingyue received the energy feedback and also broke through.”<br/><br/>Guan Shuqing, Feng Luan, and the rest immediately spoke up.<br/><br/>They passed the news to Wang Xian immediately.<br/><br/>“Dragon Queens, what happened?”<br/><br/>Prime Minister Gui sensed the commotion and flew over immediately.<br/><br/>“Prime Minister Gui, Call Wu Sha and the others over to see if Qing Yue is making a breakthrough.”<br/><br/>Feng Luan immediately instructed Prime Minister Gui.<br/><br/>“It’s the Dragon Queen!”<br/><br/>Prime Minister Gui did not dare to be negligent. He moved his body and immediately called Wu Sha and the others over.<br/><br/>Currently, the seven of them were the strongest in the Dragon Palace.<br/><br/>“Greetings, Dragon Queens!”<br/><br/>Wu Sha and the others flew over and immediately bowed.<br/><br/>“Wu Sha, take a look. Is Qingyue making a breakthrough?”<br/><br/>Guan Shuqing quickly said.<br/><br/>“In this situation, she should be making a breakthrough.”<br/><br/>Wu Sha and the others looked over and revealed surprised expressions. “The Blue Dragon Queen is making a breakthrough. This is unbelievable.”<br/><br/>Water Demon and the rest were a little surprised. This dragon queen of theirs had made a breakthrough just like that?<br/><br/>“Eh? Shu Qing, what happened to Qing Yue? Did she make a breakthrough?”<br/><br/>At this moment, Wang Xian, who had just received the message, immediately returned. Sensing the terrifying energy here, he immediately teleported over.<br/><br/>His gaze landed on Lan Qingyue as his eyes sparkled.<br/><br/>“Xiao Xian, we don’t know either. We were cultivating when a surge of majestic energy suddenly came from Qingyue’s side. Moreover, her current situation is very similar to when Wu Sha and the rest broke through.”<br/><br/>Guan Shuqing and the other girls spoke up.<br/><br/>“Don’t worry, they are breaking through!”<br/><br/>Wang Xian looked over and felt that Lan Qingyue’s body was undergoing a qualitative change. His eyes sparkled.<br/><br/>“I really didn’t expect that Xiao Lan’s little house and the rest had achieved a breakthrough.”<br/><br/>Wang Xian spoke.<br/><br/>When they arrived at the inner part of the heaven-splitting primordial land, Xiao Lan’s little house and the rest had entered the mountains and seas to train.<br/><br/>It had only been a thousand years and they had already achieved a breakthrough. This speed was really terrifying.<br/><br/>“The breakthrough of Xiao Lan’s little house was fed back to Qing Yue. This ancient god Feeding Kun master is really terrifying. No wonder he was once surrounded and destroyed.”<br/><br/>Wang Xian stared at Lan Qingyue.<br/><br/>“Qing Yue is really going to break through? So Fast!”<br/><br/>The group of girls looked on in astonishment.<br/><br/>Under the huge amount of resources, the group of girls had already accumulated to the peak of universe knights.<br/><br/>Furthermore, they had all turned into purebred divine dragons.<br/><br/>However, they felt that it would still take some time and opportunities for them to break through. They did not expect Qing Yue to break through so quickly.<br/><br/>“Qing Yue is making a breakthrough. With Xiao Lan and Xiao House, the true ruler of the universe in the Dragon Palace has reached the top ten!”<br/><br/>Wang Xian watched with a smile.\t\t\t\t\t\t</div>", "images": {}, "success": true}