{"id": 724, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073349.html", "title": "Chapter 3715 - 3715 3714", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3715 - 3715 3714</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3715 3714<br/><br/>“Have the experts of the Dragon Palace Gone Mad? The Divine Dragons are destroying the races in our galaxy without any hesitation!”<br/><br/>“It’s too terrifying. The Divine Dragon destroyed the entire planet with a wave of its claw. The fundamental planet of the Tianyi sect has been under their control for hundreds of millions of years. They spent a lot of money to build and set up countless defensive and attacking planets, but they disappeared with a breath of dragon breath. The experts of the Dragon Palace are too terrifying!”<br/><br/>“Isn’t it the rule of the top races in the land of desolation that the experts of the land of desolation are not allowed to attack the forces around us? How dare the Dragon Palace go against their rules? is the Dragon Palace courting death?”<br/><br/>“The Dragon Palace is too ruthless. As long as any race enslave the dragon bloodline, they will all be destroyed. The terrifying dragon power alone can destroy a force. It’s simply overwhelming. They can destroy a race with one breath. It’s too terrifying!”<br/><br/>“More than a dozen forces of different races have been destroyed by the Divine Dragons. The Dragon Palace announced a year ago, and now it’s completely done. Those forces that were lucky have completely collapsed this time!”<br/><br/>“It’s a battle on a completely different level. Why didn’t the experts of the peak races of the heaven-splitting chaotic continent show up?”<br/><br/>When the Sixty Divine Dragons flew over from the Dragon Palace, the doomsday for some races had already begun.<br/><br/>Many races thought that because of the rules, the experts of the Dragon Palace wouldn’t attack them.<br/><br/>But now it seemed that they were completely wrong.<br/><br/>Not only did the dragon palace attack, but they also destroyed the races as they had said a year ago!<br/><br/>In a short time, more than ten races were destroyed by the Divine Dragons!<br/><br/>One Dragon Breath, one Dragon Claw, and one dragon tail.<br/><br/>They were all easily destroyed!<br/><br/>At this moment, all the powerful forces in the surrounding starry sky knew how terrifying the Dragon Palace was and how terrifying the Dragon God was.<br/><br/>Those who were lucky, those who still enslaved the Dragon God’s bloodline, had extremely pale faces.<br/><br/>Some of them quickly let go of the ya long.<br/><br/>Some of them wantonly posted information on the universe’s AI.<br/><br/>The powerhouses of the Dragon Palace broke the rules and requested the powerhouses of the peak races to destroy them!<br/><br/>They requested the peak races to protect the weak!<br/><br/>One by one, information flashed on the universe’s AI!<br/><br/>However, very quickly, a few more explosive messages appeared in the surrounding starry skies.<br/><br/>“The Dragon Palace released a statement a year ago. You Bunch of reckless brats still didn’t listen. At that time, you should have already searched the Dragon Palace’s situation and were still lucky. You deserved to be destroyed. Why Don’t you take a look at the current situation of the Heaven opening primal continent? “Now, all the high-level races in the heaven opening desolate continent have been defeated by the Dragon Palace. They wish that the Dragon Palace will rise to the peak.”<br/><br/>“It won’t be long before the Dragon Palace will rise to the peak. Do you think the other peak races will offend the Dragon Palace for You?”? “Besides, the Dragon Palace used to be the descendant of the Divine Dragon Clan. When the Divine Dragon Clan was at the peak, who dared to enslave the Ya Long?”? Now that the Divine Dragon Clan is at its peak, its prestige naturally has to be restored<br/><br/>“Just wait for your death. No one will help you. Now that the powerhouses of the inner forces of the heaven-opening desolate continent think that the dragon palace is about to advance to the peak race, the prestige of the future peak race is naturally not something that you can provoke.”<br/><br/>In the surrounding starry sky, some powerhouses’disciples released information that attracted a lot of attention.<br/><br/>Soon after, the powerful disciples began to search for information about the inner parts of the heaven opening primal continent and the Dragon Palace.<br/><br/>When they saw the 240 level 3 universe dominator true dragons of the Dragon Palace destroying the races one by one in the heaven opening primal continent, they were extremely shocked!<br/><br/>Then, there was silence.<br/><br/>The Dragon Palace was invincible in the inner parts of the heaven opening primal continent, so what was their little surrounding starry sky?<br/><br/>With the Dragon Palace’s terrifying strength and potential, the so-called rules could no longer restrain the Dragon Palace!<br/><br/>This was because the Dragon Palace of the Divine Dragon Clan was about to step into the peak again.<br/><br/>Therefore, the Dragon Palace’s announcements and some of its prestige could not be violated by other weak races.<br/><br/>Otherwise, where would the prestige of the peak race be?<br/><br/>In the past, when the Divine Dragon Clan was at the peak, who dared to enslave the inferior dragons and call themselves Dragon Knights?<br/><br/>They were simply courting death.<br/><br/>Now, it was just a return to the past.<br/><br/>Even the Angel clan and the Phoenix Clan, who had a grudge against the Dragon Palace and Wang Xian, did not say anything.<br/><br/>This was because although the dragon palace had broken the rules this time, according to the rules, the punishment would only be to kill the Divine Dragon who made a move.<br/><br/>As a peak clan, it was completely unnecessary to cause the dragon palace to harm some experts in such a way.<br/><br/>Even the third prince and the others looked down on them!<br/><br/>They also had their own pride and pride.<br/><br/>If they wanted to attack, they would either completely destroy the Dragon Palace or not.<br/><br/>The angel race and the Phoenix race didn’t say anything, and the other peak races wouldn’t offend the Dragon Palace!<br/><br/>They wouldn’t offend a force that was almost 99% capable of reaching the peak race for no reason!<br/><br/>In the end, just as the experts from the factions surrounding Lu Xingkong had expected, the factions that enslaved the people with the divine dragon bloodline were annihilated one by one. In the end, no experts from the peak of the race came out to make a decision for them!<br/><br/>This allowed all the factions surrounding Lu Xingkong to witness the might of the Dragon Palace once again!<br/><br/>The Divine Dragon lineage and the Dragon Palace had truly risen!<br/><br/>In the following period of time, the factions surrounding Lu Xingkong issued statements one by one and began to lick the Dragon Palace!<br/><br/>Wang Xian didn’t pay too much attention to this matter. The only thing that made him a little wary was the reaction of the angel and Phoenix clans!<br/><br/>However, he heaved a sigh of relief when the other party didn’t respond!<br/><br/>“I should be able to calm down for a period of time and go to the land of blood plasma.”<br/><br/>Wang Xian mumbled!<br/><br/>In the land of blood plasma, the ancestral tree could condense the fruit of blood refinement, increasing the number of purebred divine dragons in the Dragon Palace.<br/><br/>At its peak, the Dragon Palace had a million purebred divine dragons. Now, because of the existence of the Dragon Transformation Pool, the Dragon Palace was able to produce a large number of peak races.<br/><br/>Although the number of purebred divine dragons didn’t need to reach a million, it needed to reach at least hundreds of thousands!<br/><br/>That was because the mutation of a purebred divine dragon was the true strength!<br/><br/>“Currently, my strength has increased, the level of the Dragon Palace has increased, and the ancestral tree has also increased. The speed of condensing blood-refining fruits should be able to increase a lot.”<br/><br/>As he spoke, he gave some instructions and flew directly toward the blood plasma land!<br/><br/>In the past, he could condense two blood refining fruits in a year. Now, the number should be able to double.<br/><br/>“400,000 purebred divine dragons. This is more or less enough.”<br/><br/>He thought to himself. The Dragon Palace was probably going to face a peak race next.<br/><br/>It was the enemy of the apocalypse, so he had to be prepared.\t\t\t\t\t\t</div>", "images": {}, "success": true}