{"id": 734, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073369.html", "title": "Chapter 3725 - 3725 The Universe Was Boiling!", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3725 - 3725 The Universe Was Boiling!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3725 The universe was boiling!<br/><br/>The peak races didn’t ask about the high-level races. They had already stood at the peak.<br/><br/>Most of the resources in the nine-origin universe were also occupied by them.<br/><br/>The peak races wouldn’t fight with the high-level races for some newly-born treasures.<br/><br/>It could be said that they didn’t care about anything outside of their own precious land.<br/><br/>The disciples of the peak races all cultivated in their own races.<br/><br/>Even the skeleton race that liked to fight and the dark race that kept on killing and devouring were just internal fights.<br/><br/>They had no interest in the high-level races.<br/><br/>Now that the twelve peak races had issued statements at the same time, it could be said that all the races were boiling.<br/><br/>“What does the statement of the peak races mean? The passage between the nine-origin universe and the starry universe has been opened, and we can enter the Starry Universe?”<br/><br/>“There are other universes outside of us. We Are Disciples of the nine-origin universe? What’s over there in the Starry Universe?”<br/><br/>“Calamity? In the future calamity, the peak races say that we only have a chance to survive if we become rulers? What exactly is the situation of the calamity?”<br/><br/>“Hiss, why do I feel a chill when I see the information of the peak races?”<br/><br/>All the forces and disciples of the Heaven Opening Primal Continent felt a chill when they saw the information sent by the peak races.<br/><br/>Especially when the dark race and the skeleton race announced that they would enter the starry universe if they wanted to survive the calamity.<br/><br/>The dark race even said that they might die if they entered the starry universe, but if they didn’t, they would definitely die when the calamity arrived.<br/><br/>In addition, every peak race revealed the terror of the calamity.<br/><br/>That was, if they didn’t have enough power, they would be exterminated.<br/><br/>Even the high-level races didn’t know much about the calamity.<br/><br/>In addition, there were still billions of years before it would arrive, so not many experts cared.<br/><br/>But now, from the information of the peak races, they knew how terrifying the calamity was.<br/><br/>A few billion years was indeed far away from them.<br/><br/>However, no matter which high-level race it was, when they saw this information, they immediately gathered all the experts.<br/><br/>The powerful high-level races could easily last for a few billion years.<br/><br/>Even some top-level high-level races could last for tens of billions of years without any problems.<br/><br/>Now that they saw the information about the top-tier races, they instantly became nervous.<br/><br/>Which race wanted to face extinction?<br/><br/>No one wanted to be exterminated.<br/><br/>“There’s no need for the top-tier races to plot against us. They should be telling the truth. I think we can go and take a look.”<br/><br/>“Yes, there’s no need for the top-tier races to lie to us. Any top-tier race’s ruler could exterminate all of our high-tier races. There’s a vague legend in the universe about the calamity. It says that even the top-tier races might not be able to survive the calamity.”<br/><br/>“But why would the pinnacle races tell us about this? Do they want us to help them explore the path, or do they want us to give birth to great beings among our high-level races?”<br/><br/>“It’s possible. Perhaps the stronger our universe is, the easier it will be to resist the calamity.”<br/><br/>The Great Beings of some races were discussing and speculating.<br/><br/>There was no need for the peak races to lie to them, and it wasn’t worth being lied to by twelve peak races working together.<br/><br/>Secondly, from the information of the peak races, they also knew that the peak races didn’t have any ill intentions towards them.<br/><br/>All the races in the universe knew the strength of the peak races, and that was on a different level from them. As long as one had some thoughts, they would know that this was the peak races wanting to give birth to more experts in the universe.<br/><br/>In fact, that was indeed the case. The purpose of the pinnacle races was to increase the overall power of the 9-origin universe.<br/><br/>The second reason was to let them explore the way.<br/><br/>It was difficult for even the pinnacle races to explore a huge universe and a universe born of a space beast.<br/><br/>This required a large number of great beings’disciples.<br/><br/>And before the calamity arrived, the more great beings in the 9-origin universe, the better.<br/><br/>Perhaps, some great beings would be able to obtain great opportunities in the starry universe and become top-tier Great Beings.<br/><br/>This was not impossible.<br/><br/>If there were really great beings who were extremely lucky, they might be able to become rulers in a few billion years.<br/><br/>After all, that was an undeveloped universe.<br/><br/>“An unknown universe, a universe full of dangers and opportunities. We still have to go and take a look.”<br/><br/>“Yes, we have to go. It’s already very difficult for us to improve and break through.”<br/><br/>Immediately, many powerful disciples of countless races prepared to head to the starry universe.<br/><br/>They all knew that there might be dangers there, but at the same time, the chances of obtaining opportunities were also higher.<br/><br/>Especially the old monsters from the invincible region. When they received the news, they were extremely excited.<br/><br/>Without any hesitation, they immediately flew towards the depths of the mountains, seas, and oceans.<br/><br/>“The twelve peak races have announced it at the same time. It seems that there will be many strong disciples from the nine-origin universe going over this time.”<br/><br/>In the Dragon Palace, Wang Xian’s eyes were sparkling as he read the news.<br/><br/>The Allure of a new universe was something that many strong practitioners could not resist.<br/><br/>This was especially so for those powerhouses who had not broken through for a long time.<br/><br/>They were prepared to head over to seek opportunities.<br/><br/>If they were lucky, they might soar into the sky.<br/><br/>This was not impossible.<br/><br/>Wang Xian looked ahead as his eyes sparkled.<br/><br/>There was an array formation in front of him. In this array formation, there was a dynamic perspective.<br/><br/>In front of the perspective, there was a vast expanse of empty space. In front of him, there were huge planets and meteorites.<br/><br/>Some planets had all kinds of plants growing on them, giving off strong vitality.<br/><br/>However, there were no ordinary creatures on this planet.<br/><br/>There were only a lot of special plants.<br/><br/>This was the perspective of Little Blue House and the others.<br/><br/>No matter where Little Blue House went, Lan Qingyue could contact them and see what they saw.<br/><br/>Little Blue House had already entered the starry universe. Lan Qingyue ordered them to explore this new universe.<br/><br/>During this period of time, he had seen some of the appearance of the starry universe and obtained some information.<br/><br/>The resources in the starry universe were indeed more abundant.<br/><br/>“Dragon King, many of the experts of the races have already flown to the depths of the mountains and seas. Even the top races have a large number of experts’disciples rushing over there.”<br/><br/>Prime Minister Gui stood at the side and spoke to Wang Xian.<br/><br/>“We have to go, but we have to be careful.”<br/><br/>Wang Xian nodded and said, “I’ll go over first to take a look at the situation. After I inform them, the group of disciples will go over.”<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded.<br/><br/>Wang Xian gave some instructions and flew out of the Dragon Palace towards the depths of the mountains, seas, and oceans.<br/><br/>The members of the Dragon Palace had to enter the starry universe, but they had to be careful of the experts when they went in.<br/><br/>The strong ones of the Angel clan and the Phoenix clan.\t\t\t\t\t\t</div>", "images": {}, "success": true}