{"id": 730, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073361.html", "title": "Chapter 3721 - 3721 The Secret Of The 3720 Universe, The World Passageway Opened! Go", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3721 - 3721 The Secret Of The 3720 Universe, The World Passageway Opened! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3721 The Secret of the 3720 universe, the world passageway opened! Go<br/><br/>“HM? What a strange blood sea, it can actually completely absorb the attacks of the three Skeleton Kings!”<br/><br/>“What powerful strength, just breaking through and already possessing such terrifying combat strength, no wonder black vulture emperor said that his granddaughter’s potential in the future is higher than his!”<br/><br/>The battle erupted, the spirit red bone easily absorbed the attacks of the three skeleton kings!<br/><br/>The blood-red sea of blood continued to attack forward!<br/><br/>And the Spirit Red Bones’figure completely merged into the blood sea, completely invisible!<br/><br/>“Her Highness Princess Spirit Red Bones is so strong!”<br/><br/>“She is indeed very strong. This is a battle on a completely different level.”<br/><br/>“The three skeleton kings are completely not the strength of her highness Princess Spirit Red Bones!”<br/><br/>All the skeleton experts in the surroundings looked at this scene with a bewildered expression!<br/><br/>Wang Xian looked over. Ling Honggu’s strength was indeed not something that the Skeleton King, who was at the level of a dominator, could compare to!<br/><br/>Even if it was a one-on-three fight, she could easily destroy it.<br/><br/>Ling Honggu’s strength might not be as strong as the mutated divine dragon, but it was not much!<br/><br/>Most importantly, her inheritance had not been completely fused. Once it was fused, it should be comparable to an existence at the level of the mutated divine dragon.<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>In the battle above, blood-red strips of cloth strangely flew out from three directions, wrapping around the three skeleton kings!<br/><br/>The expressions of the three skeleton kings changed slightly. They hurriedly tried to dodge and block, but the strange power of the blood sea made it impossible for them to resist!<br/><br/>“We admit defeat. The strength of the princess is really terrifying!”<br/><br/>The three skeleton kings shouted in shock!<br/><br/>As soon as the three Skeleton Kings finished their words, the blood sea and the energy disappeared, revealing the figure of the spiritual red bones!<br/><br/>“Haha, Good, Good!”<br/><br/>Seeing this, the black vulture king said happily, “Is there anyone among you who is willing to follow the Red Bones?”<br/><br/>“Your subordinate is willing to follow your highness the princess. In the future, Your Highness the Princess Will Be Your King!”<br/><br/>“Your subordinate is willing to follow your highness the Princess!”<br/><br/>Soon, five skeleton kings walked out from the black vulture King’s subordinates and kneeled down!<br/><br/>“Sure, red bones. In the future, they will follow you and fight for you!”<br/><br/>Seeing this, the black vulture king nodded with a smile. He looked at an army in front of him and said, “In addition, the black shark army will follow Red Bones. She will live, you will live, she will die, and you will die!”<br/><br/>“Yes, we pay our respects to the Red Bone Queen!”<br/><br/>The entire black shark army was filled with powerful skeletons. There were hundreds of thousands of them, but they were all elites. They immediately knelt down and bowed!<br/><br/>“The black vulture king really dotes on his granddaughter. He actually gave her such power!”<br/><br/>The skeleton kings around them looked at them in shock.<br/><br/>The five Skeleton Dominators were all at the first level of the Skeleton Dominator realm. They were powerful, and they also had their own army.<br/><br/>Along with the powerful Black Shark Army, this power was terrifying!<br/><br/>“Hehe, black vulture emperor, you called us here to ask for gifts, right? Hehe, I have eight gold warriors here, I’ll give them to your granddaughter!”<br/><br/>One skeleton emperor said with a smile, with a wave of his arm, eight gold warriors with the strength of a universe ruler at the third level appeared in front of the spirit red bone!<br/><br/>“I have some small toys here.”<br/><br/>The other skeleton emperors waved their arms and gave out some gifts!<br/><br/>Black Vulture Emperor looked at them and smiled!<br/><br/>“Hahaha, Haha, come here, Red Bone, thank them!”<br/><br/>Black Vulture Emperor waved at the spirit red bone happily.<br/><br/>The spirit red bone immediately flew over and thanked the skeleton emperors!<br/><br/>“Congratulations, I happen to have a treasure that you can use!”<br/><br/>Wang Xian looked at Ling honggu. With a move of his palm, a flame armor appeared in front of him and flew towards her.<br/><br/>“Huh?”<br/><br/>Ling Honggu was slightly stunned when she saw it.<br/><br/>The black vulture king and the skeleton kings around him were shocked.<br/><br/>Innate Supreme Treasure!<br/><br/>This was an innate supreme treasure!<br/><br/>It was an innate supreme treasure that ordinary masters of the ruler realm did not have!<br/><br/>There were not many innate supreme treasures in the universe, especially those that corresponded to one’s own attributes. The number of innate supreme treasures that one could obtain was even less!<br/><br/>The innate supreme treasure armor that Wang Xian handed over was obviously a defensive type of supreme treasure!<br/><br/>Any fire attribute master could use it!<br/><br/>“Such a valuable treasure is given away directly. It seems that the Dragon King has a good relationship with the black vulture King’s granddaughter!”<br/><br/>The Skeleton Kings thought to themselves!<br/><br/>“Wang Xian, this… this is too valuable!”<br/><br/>Ling Honggu opened his mouth when he saw it!<br/><br/>“Take it. I have obtained more than ten innate treasures in the invincible zone!”<br/><br/>Wang Xian smiled. In the entire invincible zone, he had obtained more than ten innate treasures.<br/><br/>Although he could use every attribute, too many of them were useless to him!<br/><br/>As for the experts of the Dragon Palace, it was the best choice for them to cultivate their own dragon balls!<br/><br/>“Alright!”<br/><br/>Red spirit bone smiled at him and put them away!<br/><br/>“Hehe, Hehe!”<br/><br/>On the side, Demon King Spirit couldn’t help but laugh when he saw this.<br/><br/>Red spirit bone not only had a powerful grandfather, but he also had a good relationship with the Dragon King. He was very excited to have two powerful backers!<br/><br/>When the black vulture king saw Linghong Gu take it, he also smiled.<br/><br/>There were rarely any affairs between powerhouses, but he was very happy to see this scene!<br/><br/>In his opinion, the Dragon King’s potential was much stronger than his granddaughter’s.<br/><br/>Linghong gu saluted the skeleton kings one by one.<br/><br/>After dozens of minutes, the black vulture king waved his arm, and they came to a palace!<br/><br/>There were eleven seats in the palace. It was obvious that they were for Wang Xian, the red bones, and the skeleton kings!<br/><br/>When Wang Xian saw the situation, he frowned slightly.<br/><br/>“We, the nether bone king, have sent news that the passageway to the aristocratic families is about to be opened. Let’s discuss the matter of entering!”<br/><br/>The black vulture king looked at them and spoke directly!<br/><br/>“HMM?”<br/><br/>When Wang Xian heard the black vulture King’s sudden words, he revealed a shocked expression!<br/><br/>“Dragon King, you have yet to receive any news about this matter. However, it won’t be long before the entire heaven opening and primal continent will know about it!”<br/><br/>The black vulture king saw Wang Xian’s shocked expression and spoke to him.<br/><br/>“World Passageway? The passageway to the universe? From our nine-origin universe to other universes?”<br/><br/>Wang Xian asked in surprise.<br/><br/>“Yes! It seems that you know a little about it, Dragon King. This time, the world passageway was opened by the group of Space Beasts in the mountains and seas. They were also the ones who opened the door to their hometown, which led to the Space Beast World, which is also the space universe!”<br/><br/>The black vulture king continued to explain to Wang Xian!<br/><br/>“Space Universe?”<br/><br/>Wang Xian nodded his head slightly.<br/><br/>He had some understanding of the starry universe from the Void Pagoda. The Starry Universe was a universe created by the space behemoths.<br/><br/>Speaking of which, the space behemoths in the nine-origin universe belonged to outsiders.<br/><br/>As for the reason behind this, he wasn’t sure. However, he should be able to ask the black vulture king this time.<br/><br/>To understand the secrets of the universe.\t\t\t\t\t\t</div>", "images": {}, "success": true}