{"id": 737, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073375.html", "title": "Chapter 3728 - 3728 3727 Vast Resources In The Universe", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3728 - 3728 3727 Vast Resources In The Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3728 3727 vast resources in the universe<br/><br/>Buzz<br/><br/>In an unfamiliar void space, a dark void pagoda appeared out of thin air.<br/><br/>Not far away, there was a star. The star contained a majestic life force. Above the star, there was a large amount of vegetation.<br/><br/>“This place seems to be very far away from the universe passage.”<br/><br/>Wang Xian stood beside an lie. He looked at the monitoring station and scanned his surroundings. A look of shock appeared in his eyes.<br/><br/>Wang Xian knew that this was the place where Xiao Lan’s small house and the rest had walked to.<br/><br/>It took Xiao Lan’s small house and the rest an entire day to arrive at this distance.<br/><br/>One could imagine how far this distance was.<br/><br/>“Yes, Dragon King. The distance we are at is already very far away.”<br/><br/>An lie stood up and nodded.<br/><br/>“Alright, an lie. Contact Prime Minister Gui immediately and bring the strong disciples of the Dragon Palace over. As for how they will act, let them decide for themselves. Also, tell them to be careful of the strong ones from the Phoenix and Angel clans. Once they meet them, escape immediately.”<br/><br/>Wang Xian instructed an lie.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded.<br/><br/>“Keep in touch with all the disciples who have entered the starry universe. Also, an lie, you have to be careful. Don’t let the strong ones from the peak races know of your ability. It’s best if the Void Pagoda is not discovered.”<br/><br/>Wang Xian pondered for a moment and continued to instruct.<br/><br/>An Lie’s ability was similar to the void Royals in the Void Universe. It was best not to let the other peak races know about it.<br/><br/>“Yes!”<br/><br/>An lie nodded.<br/><br/>“I’ll leave this to you. I’ll go take a look around.”<br/><br/>As Wang Xian spoke, he gestured to an lie. The next moment, he appeared outside.<br/><br/>Now that an Lie’s strength had increased, it was not a small trump card for the Dragon Palace.<br/><br/>Right now, it was not a problem for him to kill a level one overlord in an instant.<br/><br/>When he arrived outside, Wang Xian instantly felt that his strength had been suppressed.<br/><br/>His ability to fight above his level had been suppressed by three levels.<br/><br/>However, if a powerhouse from the peak race of the nine-origin universe came in, Wang Xian’s strength could also be comparable to a level two overlord.<br/><br/>After all, their strength was also suppressed.<br/><br/>However, if they were to face a powerful space beast from the starry universe, they would probably not be able to do so.<br/><br/>A space beast at the peak of the supremacy level was able to fight against Wang Xian.<br/><br/>Of course, due to Wang Xian’s speed, the accompanying Elf and the Netherspirit avatar, Wang Xian’s strength was still at an almost invincible level at the level two overlord realm.<br/><br/>“Even the innate treasure has been suppressed. This suppression is really strong. It seems that it’s best not to provoke the space beasts in the starry universe.”<br/><br/>Wang Xian mumbled.<br/><br/>Xiao Lan and the rest followed the group of Space Beasts in the mountain and sea realm and flew deeper into the universe.<br/><br/>Wang Xian was only familiar with the surroundings of their route. He was not familiar with the other places.<br/><br/>He still needed to explore everything on his own.<br/><br/>In addition, in the starry universe, the universe’s artificial intelligence could no longer be used. If he wanted to communicate, he needed to use the communication stone plate.<br/><br/>Wu Sha made a communication stone plate that belonged to the Dragon Palace. The disciples of the Dragon Palace in the starry universe could communicate on the communication stone plate.<br/><br/>“Let’s go and take a look at that planet.”<br/><br/>Wang Xian’s figure moved and quickly approached the planet. His dragon eyes scanned the planet continuously, and his eyes slowly emitted a luster.<br/><br/>“This planet…”<br/><br/>Wang Xian flew over and immediately felt waves of majestic energy coming from above.<br/><br/>His body moved and he immediately flew over.<br/><br/>“There’s a treasure!”<br/><br/>His body moved and immediately came to the top of his interest. As he sensed the energy, he instantly arrived at the ocean of the planet’s ocean.<br/><br/>In his sight, he saw a special blood-red vine growing in the deepest part of the ocean.<br/><br/>This vine contained rich water elemental energy.<br/><br/>Wang Xian entered the ocean. With a wave of his arm, he pulled the entire vine up and used his hand to sense it. He looked a little excited.<br/><br/>“This kind of treasure contains a very high level of energy. It’s comparable to the divine grass and divine fruit of the Overlord level.”<br/><br/>He mumbled. A random planet already had such a treasure. There should be countless of such planets in a universe.<br/><br/>If there were such treasures every week, wouldn’t he be crazy?<br/><br/>“There is one more thing that is very strange. The entire planet is so full of life, yet there are no living things.”<br/><br/>Wang Xian mumbled.<br/><br/>He felt that this might be related to the characteristics of the universe.<br/><br/>If it was a nine-origin planet, a planet could give birth to life in a few million years, or even less.<br/><br/>There was another point. The Space Beasts in the starry universe contained special energy within their bodies.<br/><br/>Just like Xiao Lan and the rest, the energy within their bodies didn’t belong to any attribute.<br/><br/>Their advancement also depended on devouring other creatures.<br/><br/>On the contrary, they didn’t really like these divine herbs and fruits.<br/><br/>Wang Xian’s eyes flickered slightly. He kept the vines and continued his search on the planet.<br/><br/>Very soon, he found many resources that were useful for cultivation.<br/><br/>Apart from these, he also found some special fruits.<br/><br/>These fruits did not have nine attributes. Instead, they contained a special energy.<br/><br/>Wang Xian took out the one with the smallest energy. After hesitating for a moment, he swallowed it directly.<br/><br/>After it entered his stomach, the fruits were digested quickly.<br/><br/>A special energy entered his body. This energy was very strange and could transform his physical body.<br/><br/>The energy made his physical body stronger.<br/><br/>“These fruits are useful after consumption, but the effect is minimal. These should be the fruits that the space beasts like to eat.”<br/><br/>Wang Xian mumbled.<br/><br/>“This space universe is a huge treasure trove to the nine-origin universe. I can now guess why the calamity is so intense.”<br/><br/>He guessed in his heart.<br/><br/>The Cosmic Tribulation was coming, and the universe passage was opened. This meant that one could enter another universe.<br/><br/>And this also caused a problem.<br/><br/>That was, things that were very common in one universe were huge treasures for the other universe.<br/><br/>This would naturally cause a fight.<br/><br/>And the treasures of the other universe were even more precious to the other universe, so they would also fight over them.<br/><br/>A huge war would break out here. As time passed, when the Apocalypse arrived, they would fight to the death.<br/><br/>Of course, this was just Wang Xian’s guess. The apocalypse was so intense. This might just be one of the reasons. There should be other aspects as well.<br/><br/>“Continue to explore. If I can find 100,000 such planets, I will be able to make a breakthrough!”<br/><br/>As Wang Xian spoke, he looked in a direction. With a move of his body, he immediately flew over!<br/><br/>Tens of thousands of planets were considered a drop in the ocean in the nine-origin universe.<br/><br/>It was definitely not a small number in the starry universe. He felt that it should not be difficult.<br/><br/>With the resources on one planet, 100,000 planets were enough for him to make a breakthrough!<br/><br/>An excited look appeared in his eyes as he quickly disappeared into the starry universe.<br/><br/>The experts who had entered the peak race soon saw the vast resources in the starry universe.\t\t\t\t\t\t</div>", "images": {}, "success": true}