{"id": 739, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073379.html", "title": "Chapter 3730 - 3730 Opportunity And Danger", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3730 - 3730 Opportunity And Danger</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3730 Opportunity and danger<br/><br/>The core of the entire vine contained a tremendous amount of energy.<br/><br/>Wang Xian kept it in his hand and sensed the energy. A smile appeared on his face.<br/><br/>The essence of the space beasts were all concentrated in his body. After absorbing it, it would be of great use to the cultivators in the nine-origin universe.<br/><br/>The harvest this time was no less than the last time.<br/><br/>After he put it away, he scanned his surroundings and flew in a certain direction!<br/><br/>Not long after, Wang Xian discovered another life planet. It had only been a few hours.<br/><br/>The life planet was emitting a surging flame energy.<br/><br/>He flew over and immediately discovered an incomparably huge volcano in the center of the entire planet.<br/><br/>There was a special type of metal around the entire volcano.<br/><br/>Wang Xian sensed it carefully. After finding no signs of life, he landed beside the volcano.<br/><br/>“This fire attribute divine stone is very suitable to be used to create spiritual treasures. It is also considered a precious treasure in the nine-origin universe.”<br/><br/>Wang Xian looked at the metal and his eyes sparkled.<br/><br/>In the starry universe, other than some special space beasts that fed on these metal ores, these metal ores were rarely consumed.<br/><br/>Unlike the nine-origin universe, weapons were also a part of one’s own strength. Basically, every powerhouse had several weapons.<br/><br/>However, the space beasts did not use weapons. This also resulted in many metal ores here.<br/><br/>The metal ores that needed to be fought over in the nine-origin universe could be seen everywhere here.<br/><br/>“TSK TSK, the resources in the universe are really rich!”<br/><br/>Wang Xian sighed slightly and stored all the metals.<br/><br/>Following that, he began to search the entire planet.<br/><br/>After storing a large number of divine herbs, pills, and metals, Wang Xian continued on to the next planet.<br/><br/>At this speed, it wouldn’t be long before he could gather all the resources that he needed to upgrade.<br/><br/>“Roar!”<br/><br/>While flying in the air, Wang Xian suddenly heard a roar.<br/><br/>He swept his gaze over and a solemn expression appeared on his face.<br/><br/>Without any hesitation, Wang Xian immediately changed his direction and flew toward another direction.<br/><br/>At this moment, there was no need to offend these space beasts.<br/><br/>After a while, a vibrant continent appeared in his line of sight.<br/><br/>The continent plate that was suspended in the void was covered with a lush forest.<br/><br/>Wang Xian entered and began to search for treasures.<br/><br/>For the next month, Wang Xian flew continuously in the starry universe.<br/><br/>Once he sensed the aura of the space beasts, he immediately hid.<br/><br/>For more than a month, Wang Xian also realized that there were quite a number of space behemoths in the starry universe.<br/><br/>While flying, he would encounter space behemoths every day. There were both strong and weak ones.<br/><br/>For the time being, Wang Xian did not provoke them.<br/><br/>In this short month, he had harvested a large number of treasures and found more than a hundred life planets.<br/><br/>Each life planet had a bountiful harvest.<br/><br/>“Even at this speed, I only need about a thousand years to gather all the resources needed for my breakthrough.”<br/><br/>Wang Xian smiled and continued flying forward.<br/><br/>“HMM? Another Life Planet!”<br/><br/>Soon, Wang Xian saw a planet. This planet was four to five times larger than the one he had encountered not long ago.<br/><br/>“That is?”<br/><br/>Before he could get close, a strong energy was transmitted over.<br/><br/>He stared at the location above the planet with a look of shock in his eyes.<br/><br/>It was a tree that looked extremely thick. The tree was not very tall, but it occupied an area of at least tens of thousands of kilometers.<br/><br/>On this tree, there was a fruit.<br/><br/>The fruit was at least thousands of kilometers in size.<br/><br/>This was the largest fruit that Wang Xian had ever seen.<br/><br/>Most importantly, there was a strong attraction force coming from within this fruit.<br/><br/>“This… this is such a huge fruit. It contains a lot of energy.”<br/><br/>Wang Xian looked around in slight shock. He did not sense any other life force and was suspended in the air above the fruit!<br/><br/>Compared to the entire fruit, he looked extremely tiny.<br/><br/>“The energy contained in this fruit is extraordinary!”<br/><br/>Wang Xian’s eyes were burning with excitement.<br/><br/>This single fruit was ten times more than what he had gained in the past month!<br/><br/>“This starry universe is really full of treasures!”<br/><br/>As Wang Xian spoke, he slowly landed on the fruit!<br/><br/>Buzz<br/><br/>Just as his body landed on the fruit, he suddenly felt the sky turn dark.<br/><br/>A white light, which was like a cloud, instantly enveloped him.<br/><br/>The sudden change gave Wang Xian a slight shock.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The next moment, he felt a great terror coming from below him.<br/><br/>A pair of gigantic eyes suddenly appeared on the left and right of the fruit.<br/><br/>This pair of eyes was utterly defeated and contained a strange energy.<br/><br/>“Oh no, this entire planet is a space beast!”<br/><br/>Wang Xian felt the terrifying power of this space beast and his expression changed drastically!<br/><br/>He did not hesitate and wanted to flee into the distance.<br/><br/>Buzz Buzz<br/><br/>However, at this moment, Wang Xian noticed strangely that the white clouds around him suddenly surged into his body. An extremely heavy force was transmitted to him.<br/><br/>He felt as though his body was being suppressed by an endless mountain. His speed had been reduced to the extreme.<br/><br/>“What is this Space Beast?”<br/><br/>Wang Xian’s expression changed drastically. Without any hesitation, a scroll appeared in his palm.<br/><br/>He opened the scroll and a surge of energy enveloped him.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The space beast below seemed to have sensed something. A huge cloud of mist in its eyes enveloped him.<br/><br/>Fortunately, Wang Xian’s figure disappeared in the next instant!<br/><br/>The scene around him changed. Wang Xian realized that he was surrounded by fiery-red meteorites.<br/><br/>Each of the meteorites carried a powerful force as they flew in the void.<br/><br/>“Huff! Huff!”<br/><br/>Wang Xian heaved a sigh of relief and wiped the cold sweat off his forehead.<br/><br/>He looked at his body and still felt extremely heavy.<br/><br/>“What Kind of space beast is this? What a strange attack. If I were to run slower, I would probably be left there!”<br/><br/>Wang Xian mumbled with lingering fear.<br/><br/>The danger level was really high.<br/><br/>“There are many treasures in the universe, but it is indeed very dangerous.”<br/><br/>Wang Xian’s eyes flickered. If he didn’t have such an escape treasure like the space scroll, he would definitely die.<br/><br/>One had to know that his current strength was comparable to a level two universe overlord.<br/><br/>“Looks like I’ll have to let the ghost avatar explore next time. This way, my safety will be greatly improved.”<br/><br/>Wang Xian mumbled to himself. He was still a little careless.<br/><br/>Sweeping his gaze around, Wang Xian sent a message in the communication stone plate of the Dragon Palace, reminding all the disciples of the Dragon Palace to be on guard.<br/><br/>“Continue!”<br/><br/>After sending the message, Wang Xian cleaned up the strange energy in his body. He scanned his surroundings and flew in one direction.<br/><br/>It was a random teleportation from the spatial scroll. He had no idea how far away he was from before!\t\t\t\t\t\t</div>", "images": {}, "success": true}