{"id": 733, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073367.html", "title": "Chapter 3724 - 3724 The 3723 Space Beast Roared As The World Passageway Opened", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3724 - 3724 The 3723 Space Beast Roared As The World Passageway Opened</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3724 The 3723 Space Beast roared as the world passageway opened<br/><br/>“Has it been opened?”<br/><br/>Wang Xian’s eyes sparkled when he heard the message from Lan Qingyue.<br/><br/>Just as the black vulture king had said, the resources of the nine-origin universe had been taken over by the various peak races!<br/><br/>When the last calamity had just ended, the surviving peak races had taken over all the treasure lands.<br/><br/>With time, all kinds of races were born, but most of the treasures could still be easily obtained by the peak races.<br/><br/>95% of the resources in the entire nine-origin universe were concentrated in the peak races.<br/><br/>This was also the reason why the peak races were so powerful.<br/><br/>It was already very difficult for the Dragon Palace to improve.<br/><br/>This time, the opening of the space passage was an opportunity for the Dragon Palace.<br/><br/>Of course, it was also an opportunity for the experts of the other races in the entire nine-origin universe.<br/><br/>However, there might be a strong crisis mixed in with this opportunity.<br/><br/>The Space Universe was a universe that was born from Space Beasts. Even the rulers had to be careful there.<br/><br/>After all, one could not escape in an instant. Many life-saving treasures were useless. If they died, they would really die!<br/><br/>“Prime Minister Gui!”<br/><br/>Wang Xian came to the Dragon King Palace and transmitted his voice to Prime Minister Gui.<br/><br/>“Dragon King!”<br/><br/>Soon, Prime Minister Gui flew over and cupped his hands respectfully.<br/><br/>“There’s a message for you to accept. Also, tell the disciples of the Dragon Palace who are at the peak of the Universe Knight Realm to prepare themselves.”<br/><br/>Wang Xian waved his arm and a stream of information from the black vulture king and the rest entered Prime Minister Gui’s mind instantly.<br/><br/>Prime Minister GUI took in the information and nodded immediately.<br/><br/>“We don’t know much about the starry universe. As for the next step of entering the starry universe, let them decide whether to form a team or act alone.”<br/><br/>As Wang Xian spoke, he sensed the soul-returning embryo fruits on the ancestral tree.<br/><br/>Recently, the soul-returning embryo fruits had not been used. As a result, the number of soul-returning embryo fruits in the Dragon Palace had reached more than 4,000!<br/><br/>“In addition, gather more than 2,000 other strong disciples of the Dragon Palace and let them enter as well. Everyone who enters will get a soul-returning embryo fruit.”<br/><br/>Wang Xian continued to give orders.<br/><br/>“It’s the Dragon King. I’ll immediately gather all the leaders and experts to discuss this matter.”<br/><br/>Prime Minister Gui said.<br/><br/>“HMM, there’s no rush. It’ll probably take some time to cross the universe passage.”<br/><br/>Wang Xian said.<br/><br/>Prime Minister Gui nodded his head.<br/><br/>This time, Wang Xian was prepared to send the experts from the Dragon Palace over.<br/><br/>After reaching the peak of the venerable realm, fighting was a shortcut to breaking through.<br/><br/>This was also the reason why there were so many experts heading to the invincible zone.<br/><br/>Wang Xian opened the universe’s AI to take a look. After realizing that this information had not been spread out, he was not in a hurry and waited quietly.<br/><br/>At the same time, he asked Lan Qingyue to keep an eye on the situation at Xiao Lan’s little house.<br/><br/>“Hum”<br/><br/>Time passed day by day. A year passed in the blink of an eye. However, on this day, a roar that shook the heavens and earth was suddenly heard from the depths of the distant mountains and seas.<br/><br/>This vast voice seemed to have spread throughout the interior of the entire heaven-splitting primordial land.<br/><br/>When Wang Xian heard this voice, he could vaguely feel a powerful pressure from this roar.<br/><br/>His body moved and he flew to the sky above the Dragon Palace in an instant. He looked into the depths of the mountains, seas, and oceans.<br/><br/>“What level of Space Beast did this roar come from? This voice carries a strong pressure…”<br/><br/>He mumbled and looked in the direction of the ocean in shock.<br/><br/>He stopped in the void for a long time. After no second roar was heard, he returned to the Dragon Palace!<br/><br/>“Dragon King, half a year later, our peak races will issue a statement on the universe’s AI. The world passageway leading to the starry universe will be opened. At that time, we will encourage the strong disciples of the high-level races to enter and explore the way!”<br/><br/>“Dragon King, you can wait for a few hundred years or even a thousand years before you enter. If you enter first, there might be some danger.”<br/><br/>At this moment, a message from the black vulture king was sent over.<br/><br/>When Wang Xian saw it, he replied with gratitude.<br/><br/>“Xiao Xian, Xiao Lan and Xiao Zhai have entered the starry universe. Along with them are almost all the starry beasts in the mountain and sea region.”<br/><br/>At this moment, Lan Qingyue flew over and said to Wang Xian.<br/><br/>“HMM? Did Xiao Lan and Xiao Zhai head to the starry universe? Then let them enter first. Qingyue, there is some special information regarding the starry universe. Tell Prime Minister Gui and I immediately. We might be entering the starry universe in half a year.”<br/><br/>Wang Xian’s eyes were sparkling as he spoke.<br/><br/>“Alright!”<br/><br/>Lan qingyue nodded.<br/><br/>Xiao Lan’s little house belonged to the bloodline of the Space Beasts. Since they were space beasts, the starry universe was their home.<br/><br/>With them leading the way, it was great news for the Dragon Palace.<br/><br/>At this moment, the entire heaven opening desolate continent was boiling because of this terrifying roar.<br/><br/>This roar spread far and wide within the heaven opening desolate continent.<br/><br/>Many powerful disciples heard it.<br/><br/>Many powerful disciples were discussing in shock.<br/><br/>…<br/><br/>Half a year passed quickly. However, on this day, a piece of news suddenly made the entire heaven opening primal continent and even the entire nine-origin universe boil!<br/><br/>This news came from the peak races.<br/><br/>It came from more than one peak race.<br/><br/>Angels, demons, Phoenixes, divine tigers, Xuanwu, elves, shamans, skeletons, saints, dark races, immortal kingdoms, and royal races.<br/><br/>Currently, there were a total of twelve peak races in the nine-origin universe.<br/><br/>These twelve peak races released news one after another on the same day.<br/><br/>Elf clan: in the depths of the mountains and seas, the path between the nine-origin universe and the starry universe was opened. In the starry universe, the place where the space beasts were born, countless resources and treasures were waiting to be explored, this was an opportunity for all the races in the nine-origin universe.<br/><br/>Demon Race: The Apocalypse is still a few billion years away. If you don’t want to be wiped out, you can only become stronger. The Starry Universe is the only way for all the races to survive.<br/><br/>Skeleton Race: you are very lucky. Before the apocalypse, a passageway appeared between the nine-origin universe and the starry universe. There is a way to become stronger. Entering the space behemoths to seek opportunities is the only chance to survive the Apocalypse!<br/><br/>Angel clan: those who enter the starry universe and break through to the ruler realm can join My Angel clan. The Angel clan will be your strongest backer in the future apocalypse.<br/><br/>Divine Tiger Clan: Ruler Realm Warrior can join My Divine Tiger clan. My Divine Tiger clan will organize strong disciples to enter the starry universe. Disciples with level 2 battle strength and above can join.<br/><br/>The Nether clan: If you enter the Starry Universe, you may die, but if you don’t, you will definitely die in the calamity. The Starry Universe will improve itself, and it will be your only hope of surviving in the future calamity.<br/><br/>…<br/><br/>The Twelve Peak races simultaneously released information on the Universe AI.<br/><br/>In an instant, the universe was detonated!\t\t\t\t\t\t</div>", "images": {}, "success": true}