{"id": 738, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073377.html", "title": "Chapter 3729 - 3729 The Cub Of The 3728 Space Beast", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3729 - 3729 The Cub Of The 3728 Space Beast</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3729 The Cub of the 3728 Space Beast<br/><br/>“So many resources. There are so many resources and treasures on a Planet?”<br/><br/>The Wizards who first entered the universe floated above a planet, their eyes burning.<br/><br/>A planet with so many resources was a drop in the ocean in the universe.<br/><br/>From this, it could be seen that the starry universe definitely had a huge amount of resources.<br/><br/>The other pinnacle races would soon receive the information, and they would use the communication compass to immediately send it out!<br/><br/>With so many resources and treasures, it was enough for them to take a risk.<br/><br/>“The great beings that have entered have sent news that the starry universe has a large amount of resources, and the resources on a planet are comparable to the collection of the weak and small high-level races. You can take the risk to enter.”<br/><br/>“Before entering, each of you has a communication stone plate. You can transmit information within this communication stone plate. In addition, if you discover a treasure and there are space beasts guarding it, you can tell this news to any peak race. If the treasure is obtained, the person who discovers it will receive 5% of the resources.”<br/><br/>“Or if it’s a treasure that satisfies you. Don’t worry, our peak races won’t kill people and steal treasures just because of some treasures.”<br/><br/>There were still a few powerful wizards who didn’t enter the Wizard clan.<br/><br/>After they received the news, they looked around and said directly.<br/><br/>This time, all the peak races didn’t hide anything from the high-level races.<br/><br/>There were two reasons. One was that the starry universe was a complete and powerful universe, and its area was very large. It wasn’t something that their peak races could explore in a short time.<br/><br/>The second reason was that the disciples of the other high-level races would be able to bring some information and find more treasure grounds.<br/><br/>In addition, they were very weak. The treasures that they could get their hands on were not worth the attention of the peak races.<br/><br/>Some precious treasures that they could not get their hands on could be reported to their peak races.<br/><br/>This could be considered a win-win situation.<br/><br/>“HM? Are there really many treasures?”<br/><br/>“I’ll say it again. The Lords of the pinnacle races don’t need to lie to us. If they want to find coolies, they can totally enslave us. Come, let’s go in!”<br/><br/>“Let’s go in!”<br/><br/>Some great beings pondered for a moment and immediately entered the inner space of the starry universe!<br/><br/>Soon, more and more great beings entered.<br/><br/>All the strong disciples knew that only by entering this place would they be able to obtain a huge opportunity.<br/><br/>Only then would they have the chance to step onto the peak of the universe.<br/><br/>…<br/><br/>Wang Xian didn’t know the location of the entrance to the starry universe. At this moment, Wang Xian was flying rapidly in the void.<br/><br/>At this moment, all the strong disciples from the Dragon Palace had also entered.<br/><br/>They flew towards the surroundings of the starry universe!<br/><br/>I Can’t be too fast. I have to be alert of my surroundings. If I encounter a powerful Cosmic Beast, my strength would be suppressed. It would be dangerous<br/><br/>Wang Xian thought to himself as he kept scanning his surroundings.<br/><br/>“There’s a planet over there!”<br/><br/>After flying for a few hours, a planet with life appeared in Wang Xian’s sight.<br/><br/>He moved his body and came to the surroundings of the planet. He observed it carefully.<br/><br/>This planet was similar to the previous one. It was filled with forests, oceans, mountains, and grasslands.<br/><br/>“Eh, that’s not right. The branches are moving again. They are moving even though there is no wind.”<br/><br/>However, Wang Xian soon noticed the high mountains on the planet.<br/><br/>The high mountains were exceptionally eye-catching. They towered into the clouds. On top of the high mountains, there was a group of special plants.<br/><br/>The plants were gray in color. At the top of a tall mountain, there was a branch swaying.<br/><br/>This branch was alive!<br/><br/>“It seems that some planets still have life.”<br/><br/>Wang Xian mumbled as he sized up this branch.<br/><br/>He realized that this branch was actually connected to all the surrounding mountain branches.<br/><br/>In addition, he also discovered a problem. The resources on this planet were not as much as the resources he encountered in the previous one.<br/><br/>In fact, there was not even half of it.<br/><br/>“Interesting. I can’t sense the strength of this branch. I can test it out.”<br/><br/>Wang Xian thought to himself. He waved his arm and the five elements millstone appeared in his hand. It fell directly toward the branch below.<br/><br/>Whoosh! Whoosh! Whoosh! Whoosh<br/><br/>The branch seemed to have sensed some threat and aimed at the position of the Five Elements Millstone.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>When the five elements millstone approached, countless branches suddenly shot into the sky and attacked the five elements millstone.<br/><br/>“Huh?”<br/><br/>Wang Xian was slightly stunned. He waved his hand and a wave of energy landed on the five elements millstone. On the Five Elements Millstone, an azure dragon stretched out and attacked the branches directly!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>However, the next moment, a scene that shocked Wang Xian happened.<br/><br/>The branches on the planet’s high mountain began to shake rapidly. Following that, Wang Xian realized that every part of the entire planet was shaking.<br/><br/>It was as though they had encountered a terrifying earthquake.<br/><br/>Following that, countless branches extended out from the planet. The densely packed branches were extremely terrifying!<br/><br/>It was a terrifying existence that was rooted in the planet.<br/><br/>“Eh? What’s Going On? Is this a space beast? A Wood Elemental Space Beast? Is He resting here? Or did this planet give birth to this space beast?”<br/><br/>Wang Xian was extremely astonished. However, these countless branches did not give him any sense of threat!<br/><br/>“Destroy it!”<br/><br/>He waved his arm and transformed into a flaming dragon claw. A terrifying flaming dragon claw clawed downwards!<br/><br/>“Pitter-patter!”<br/><br/>“Boom Boom!”<br/><br/>Then came the sound of a violent attack.<br/><br/>“Bzzz bzzz!”<br/><br/>And the countless branches, but also issued a strange sound.<br/><br/>“The five elements perish, die!”<br/><br/>This huge branch only possessed the combat strength of the peak of the venerable, much weaker than Wang Xian.<br/><br/>The power of a wipe-out swept past, a branch of the moment lost vitality.<br/><br/>Boom! Boom! Boom<br/><br/>The branches seemed to be feeling extremely hopeless as they trembled violently.<br/><br/>The entire planet shook violently as it cracked open slowly.<br/><br/>The planet had collapsed.<br/><br/>At the center of the cracked planet, a powerful energy was transmitted over.<br/><br/>At the core of the planet, a ball of green energy was gathered together.<br/><br/>The energy was filled with vitality and other unique auras. It was mainly wood-type with other unique energies mixed in.<br/><br/>“What is this?”<br/><br/>Wang Xian was astonished. He felt that this energy had a great effect on his cultivation.<br/><br/>“Could it be that the branch is a space beast that was born on this planet? Most of the energy and resources of the entire planet were absorbed by this Space Beast Cub?”<br/><br/>He guessed and the more he thought about it, the more likely it was.<br/><br/>The entire planet was like a mother’s womb, giving birth to a powerful and terrifying life form!<br/><br/>This was also the reason why the space behemoth had such a huge body and didn’t need the Kingdom of God.<br/><br/>“If that’s the case, I have to be more careful!”<br/><br/>Wang Xian thought to himself.\t\t\t\t\t\t</div>", "images": {}, "success": true}