{"id": 731, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073363.html", "title": "Chapter 3722 - 3722 The Secret Of The 3721 Universe, The World Passage Opened! Down", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3722 - 3722 The Secret Of The 3721 Universe, The World Passage Opened! Down</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3722 The Secret of the 3721 Universe, the World Passage opened! down<br/><br/>“The opening of the World Passage is an opportunity and a crisis for us. The Dark Bone King has ordered us all to enter. The universe is rumored to be very strong, so we need to be prepared. Whether we should work together or act alone, we have to discuss it.”<br/><br/>The Tan King looked at them and said.<br/><br/>“If we enter another universe, we will definitely be suppressed. Furthermore, if we enter that place, we can not return to our own god country in an instant. If we die, we might really die. It is very dangerous.”<br/><br/>A skeleton king frowned and said!<br/><br/>“It is indeed dangerous, but that is the universe. That is the world where the Space Beasts are born. The resources there are much more than our 9-origin universe.”<br/><br/>Lizard King said indifferently, his eyes shining, “We can enter together.”<br/><br/>“If we work together, first of all, we have to put aside the grudge between you and black vulture king. Besides, we need to practice. After all, this time we’re entering another universe, and it’s a powerful one.”<br/><br/>A Skeleton King looked at them and said!<br/><br/>“Alright!”<br/><br/>The black vulture king glanced at the lizard king and replied in a deep voice.<br/><br/>The nine skeleton kings were conversing.<br/><br/>Wang Xian listened quietly at the side. From their conversation, he had gained some information.<br/><br/>The black vulture king and the rest were subordinates of the nether bone king. When the world passageway was opened, the nether bone king allowed them to enter the starry universe.<br/><br/>If they entered another universe, they would be repelled by the other universe. Their strength would be suppressed and they would not be able to teleport back instantly.<br/><br/>If they died there, unless they had a special universe true treasure, they would really die!<br/><br/>It was very dangerous.<br/><br/>But at the same time, the starry universe was also a huge treasure for them.<br/><br/>The living beings in the starry universe were much fewer than those in the nine-origin universe.<br/><br/>That was the home of the Space Beasts, which also made them very rich in resources.<br/><br/>Some of the treasures might allow the strong to easily break through the shackles.<br/><br/>They could even modify their own bloodline.<br/><br/>After all, the bloodline ability and unique body of the space beasts were too powerful.<br/><br/>Wang Xian listened to their discussions and revealed a contemplative look.<br/><br/>“There are still billions of years before the cataclysm. When that time comes, it will be truly tragic. Therefore, the sudden opening of this world passageway is an opportunity for us in the nine-origin universe. When that time comes, the strong practitioners of our peak races should allow the strong disciples of the high-level races to enter in order to obtain more strong practitioners and better deal with the Cataclysm.”<br/><br/>As the black vulture king spoke, Wang Xian’s eyes flickered when he heard this.<br/><br/>“Let’s Go and prepare first. Then, we will gather at Lord Nether Bone King’s place.”<br/><br/>The lizard king swept his gaze across them and spoke.<br/><br/>“Alright!”<br/><br/>The group of skeleton kings nodded and gestured to the black vulture king before leaving.<br/><br/>Wang Xian watched them leave before his gaze landed on the black vulture king.<br/><br/>“Hehe, Dragon King, do you have a lot of questions?”<br/><br/>The black vulture king looked at Wang Xian and asked with a smile.<br/><br/>“Indeed. There are many things that I don’t know about your conversation.”<br/><br/>Wang Xian nodded.<br/><br/>“It’s normal that you don’t know. Regarding the Cataclysm, regarding the universe world, even the disciples of the peak races don’t know about it. Only those who have advanced to a ruler are qualified to know about it.”<br/><br/>Black Vulture king smiled, he continued, “With your current strength, Dragon King is qualified to know about it. As for the cataclysm, it’s more like a big war. A big war between universes. Every big war is a cleansing and reincarnation of the universes.”<br/><br/>“A big war? Grandpa, why do the universes have a big war?”<br/><br/>Red Bone asked curiously.<br/><br/>“Because of the resources.”<br/><br/>Black vulture answered, “There are other universes besides the 9-origin universe. Every 30 billion years, the universes will get close to each other, and there will be a universe passage. Once the passage is opened, there will be a war.”<br/><br/>“In some universes, the terrifying beings that live there are bloodthirsty, and they kill crazily. In some universes, they can teleport, and they are the biggest enemies of our 9-origin universe, the Void Universe. In other universes, the Space Beasts also kill, and they devour flesh and blood to improve themselves.”<br/><br/>“When the various universes are near, it is basically a bloody battle. Sometimes, all the living beings in the entire universe will be massacred. We can only wait for the various universes to separate before giving birth to the living beings after some time.”<br/><br/>“However, fortunately, the strength of our nine-origin universe is not bad. In the last two eons, there were a few peak races that survived. However, the chances of weaker races and living beings are much lower.”<br/><br/>As the black vulture king spoke, Wang Xian Ling and Hong Gu revealed shocked expressions.<br/><br/>The entire universe would be exterminated?<br/><br/>What level of war was this?<br/><br/>“Is it so tragic?”<br/><br/>Wang Xian asked in surprise.<br/><br/>The black vulture king nodded. “It is recorded that it was very tragic. Before the last eons, five peak races were exterminated. Our skeleton race was born in this era. However, our skeleton king survived the last eons.”<br/><br/>“Grandfather, can’t you hide and not participate in the war?”<br/><br/>Spirit Red Bone asked curiously.<br/><br/>“It’s useless. The weak will die. Take our enemies from the Void universe as an example. They enter our universe and can teleport. You have nowhere to hide. Some space beasts have terrifying abilities too.”<br/><br/>“There’s also a race called the ghost race. They can’t be killed or destroyed. They can only be suppressed. This race can sense the location of living beings.”<br/><br/>The black vulture king shook his head.<br/><br/>“Indestructible? Indestructible?”<br/><br/>Ling Honggu’s eyes widened in shock.<br/><br/>“You can say that. Of course, there is a way to kill them. That is the Heaven’s origin Destiny Treasure.”<br/><br/>As the Black Vulture King spoke, he shook his head. “However, there are not many such treasures in the entire universe.”<br/><br/>“There are actually such terrifying races.”<br/><br/>Wang Xian was also slightly speechless.<br/><br/>“That’s right. There are no experts who can guarantee that they will be able to survive the calamity. Even the peak races do not have a 100% guarantee that they will be able to survive.”<br/><br/>The black vulture king nodded.<br/><br/>“Black Vulture King, your skeleton race seems to be very strong at the moment.”<br/><br/>Wang Xian said to him.<br/><br/>“Haha, it’s true. Although our skeleton race only broke through in this era, we have inherited a powerful ability. In the previous calamity, countless experts turned into withered bones. Our skeleton race was born from withered bones and gathered our strength from the corpses. This is the greatest advantage of our skeleton race.”<br/><br/>“In the last calamity, some remains of corpses and Bones made us stronger. Our skeleton race was also born in death and war.”<br/><br/>The black vulture king laughed and said.\t\t\t\t\t\t</div>", "images": {}, "success": true}