{"id": 744, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073389.html", "title": "Chapter 3735 - 3735 3734 Ice Metal!", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3735 - 3735 3734 Ice Metal!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3735 3734 ice metal!<br/><br/>The corpse of the metal plate was similar to those metal meteorites, but it was completely different.<br/><br/>There was a hint of metal attribute in it!<br/><br/>Wang Xian’s eyes sparkled as he looked at it.<br/><br/>The entire corpse of the space beast was incomparably huge, comparable to a small planet!<br/><br/>Wang Xian waved his arm and the five elements millstone landed beside the corpse. The Millstone announced that it was destroying the corpse of the Space Beast!<br/><br/>“It can absorb!”<br/><br/>Soon, Wang Xian realized that the five elements millstone could absorb this corpse. His eyes were sparkling.<br/><br/>After absorbing this corpse, the five elements millstone should be able to achieve a significant improvement.<br/><br/>He scanned his surroundings and observed carefully.<br/><br/>The entire area was huge. He had this space beast on his side. Perhaps, there were also such space beasts around.<br/><br/>If he could kill one or two more of them, he should be able to achieve another breakthrough with the strength of the five elements grinding.<br/><br/>After all, this space beast contained too much metal!<br/><br/>He scanned the area for a while and didn’t find the first space beast. Instead, he saw a metal flying over from the storm.<br/><br/>The metal wasn’t big and the space beasts around the storm weren’t interested. Wang Xian moved his body and flew over immediately.<br/><br/>After obtaining another piece of metal easily, a smile appeared on his face.<br/><br/>The speed of obtaining metal meteorites here was several times faster than in the starry sky!<br/><br/>Almost every few hours, one could see a metal meteorite flying out from within!<br/><br/>Although there were no space beasts like this, one could obtain a metal meteorite every day. If one were to stay here for more than a hundred years, it would be enough to accumulate enough resources to break through the five elements grinding mill!<br/><br/>“It would be great if I could obtain the corpses of the space beasts at the center of the storm continent.”<br/><br/>Wang Xian fantasized, but he didn’t dare to get close to those space beasts.<br/><br/>This space beast outside was already so powerful. It would be easy for the space beasts at the center of the storm continent to kill him.<br/><br/>Wang Xian found a better location and hovered in the void, waiting quietly.<br/><br/>Time passed by quickly again. It was different from what Wang Xian had expected.<br/><br/>A hundred years had passed, but he did not manage to gather all the metals required for the five elemental millstone and the Tai Chi Dragon Plate to achieve a breakthrough.<br/><br/>The main reason was that fifty years later, the meteorites that were swept into the sky had turned into a large amount of seawater.<br/><br/>The seawater was condensed under the terrifying force of the storm and formed into crystals. These crystals were helpful to the cultivation of water element cultivators, but they were not too precious.<br/><br/>For a total of fifty years, these crystals flew out. Occasionally, there were some metallic ores mixed within.<br/><br/>This reduced his harvest by about ten times.<br/><br/>Even the group of space beasts beside the storm continent were lying there motionlessly, as if they had entered a deep sleep.<br/><br/>“I’ll wait for another ten years. If it’s still like this, I can consider changing to another place!”<br/><br/>Wang Xian looked ahead, his eyes gleaming!<br/><br/>The speed at which he obtained the metal meteorites had been reduced by a lot. It was better to search for life planets in other places.<br/><br/>However, there was another advantage here. It was safer!<br/><br/>Boom! Boom! Boom<br/><br/>The terrifying sound of the storm kept ringing in his mind. Wang Xian stood in the void and watched quietly!<br/><br/>All of a sudden, a piece of metal that was not very big flew out from the storm. However, it was extremely dazzling.<br/><br/>At this moment, a piece of metal that was emitting an icy cold glow was like a piece of ice!<br/><br/>The entire piece of ice was thousands of meters big, but the energy contained within it was extremely terrifying!<br/><br/>The storm that was engulfing this piece of metal seemed to have been sealed. The speed of the storm that was engulfing the surrounding area had decreased by a lot.<br/><br/>The appearance of a special piece of metal immediately attracted the attention of a gigantic galactic beast that was sleeping.<br/><br/>The Galactic Beast raised its head and stared at the special piece of metal. It did not devour it immediately!<br/><br/>However, after hesitating for dozens of seconds, the galactic beast immediately swayed its gigantic body and flew towards the special piece of metal.<br/><br/>“Roar Roar Roar!”<br/><br/>At this moment, another space beast flew up and roared towards the space beast in front of it.<br/><br/>When the space beast in front heard this majestic roar, it shook its incomparably huge body and slowly stopped, not daring to fight with it.<br/><br/>The Space Beast opened its huge mouth and directly swallowed the icy metal!<br/><br/>“Pu!”<br/><br/>However, in the next instant, the icy metal pierced through his head and continued to fly into the distance!<br/><br/>“Roar Roar Roar!”<br/><br/>The Space Beast felt the pain and let out an incomparably intense scream!<br/><br/>Some of the surrounding space beasts raised their heads and looked over, their gazes somewhat fearful as they glanced at the icy metal.<br/><br/>“Roar Roar!”<br/><br/>The Space Beast continued to roar in pain while the rest of the space beasts lowered their heads slightly.<br/><br/>“Eh? This… this ice metal can actually penetrate the head of the space beast in an instant. This…”<br/><br/>Wang Xian was shocked when he saw this scene.<br/><br/>The strength of the space beast was terrifying. However, it was penetrated by the ice metal in an instant. The ice metal was definitely not simple!<br/><br/>Wang Xian’s eyes lit up as he looked at the piece of ice metal.<br/><br/>Without any hesitation, he flew straight towards the piece of metal!<br/><br/>When he was close to the piece of metal, an extremely cold dao seeking sensation came from it. It made him feel as though his breathing had stopped for a moment.<br/><br/>“Just a piece of metal is already so powerful. This… This is simply unbelievable.”<br/><br/>Wang Xian sensed it and his expression changed slightly. He waved his arm slightly and a thorn twined towards the surface!<br/><br/>However, the thorn twined around the surface and was slowly cracked by the frost. It was completely useless.<br/><br/>Wang Xian tried to block it with his other attributes but failed!<br/><br/>This piece of ice metal was still flying forward at a rapid speed!<br/><br/>Wang Xian frowned slightly. Without any hesitation, he flew straight to the front and struck the meteorites one by one.<br/><br/>Regardless of the meteorites, they would shatter immediately upon impact.<br/><br/>Wang Xian did not stop. The meteorites continued to bombard and fly forward.<br/><br/>Although the ice metal was very special, its speed was completely reduced when faced with Wang Xian’s continuous obstructions and collisions with the meteorites!<br/><br/>This made him happy. He continued to slow down the speed of the ice metal!<br/><br/>“I’ve succeeded!”<br/><br/>He followed this piece of ice metal for a total of five days. During these five days, he kept trying to stop it.<br/><br/>On this day, this piece of ice metal finally stopped.<br/><br/>When he saw this scene, his eyes lit up.<br/><br/>An ice metal that could easily pass through the head of a powerful space beast must be extraordinary!<br/><br/>One must know that the group of interstellar behemoths was extremely terrifying.<br/><br/>Wang Xian immediately approached the ice metal and the extreme cold came again.<br/><br/>The white special metal meteorite was shining with a luster.\t\t\t\t\t\t</div>", "images": {}, "success": true}