{"id": 748, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073397.html", "title": "Chapter 3739 - 3739 3738 Succeeded. Escape! Go", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3739 - 3739 3738 Succeeded. Escape! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3739 3738 succeeded. Escape! Go<br/><br/>Wang Xian’s eyes sparkled as he read the news.<br/><br/>He had taken the bait!<br/><br/>Perhaps the powerhouses from the angel race would never have thought that this was a trap and that no one would dare to hunt them.<br/><br/>However, although he had taken the bait, it was still uncertain if he would succeed.<br/><br/>If a battle Angel who was in the third stage of the Dominator realm appeared, he would not be a match for her.<br/><br/>He could only slip away!<br/><br/>“I hope I won’t encounter such a situation.”<br/><br/>Wang Xian mumbled. This was an attempt. If it went well, it would be easier for him to make a move in the future.<br/><br/>He scanned his surroundings and waved his arm. An innate spiritual treasure with darkness attribute appeared in front of him.<br/><br/>It was a dark cloud. Wang Xian entered it and the dark cloud slowly hid in the dark void.<br/><br/>Two days passed quickly. An archangel with twelve wings flew over and scanned his surroundings with a twinkle in his eyes.<br/><br/>When he saw the dozen or so life planets, hesitation appeared in his eyes.<br/><br/>His gaze swept over again and landed on Wang Xian’s position.<br/><br/>Whoosh<br/><br/>He flapped his wings slightly and arrived at the side of Wang Xian in an instant. He said faintly, “Come out!”<br/><br/>“This power should be an angel who is in the second level. I’m Lucky!”<br/><br/>Wang Xian looked at the Archangel in front of him with excitement in his eyes!<br/><br/>In the next moment, he didn’t hesitate at all. He exerted his speed to the maximum and attacked the Archangel directly!<br/><br/>“Huh?”<br/><br/>The Archangel suddenly felt a fatal threat coming at him. His heart tightened and a white feather immediately appeared in his hand!<br/><br/>Boom<br/><br/>Wang Xian stared at the 12-winged Angel with a cold look in his eyes. The five elements were grinding towards him!<br/><br/>At such a distance and at such a speed, the 12-winged angel had no chance to resist!<br/><br/>The terrifying energy landed on the body of the 12-winged angel. However, very soon, he frowned slightly.<br/><br/>“What a strong defense!”<br/><br/>A pair of pure white wings appeared in front of him and helped him block this fatal blow!<br/><br/>“You’re courting death. Who Are You?”<br/><br/>The twelve-winged angel stared at Wang Xian with an extremely embarrassed expression.<br/><br/>Someone actually attacked him!<br/><br/>Was it the disciple who asked for help from the Angel Race?<br/><br/>Was this a trap?<br/><br/>Could it be that there were experts from other peak races who wanted to attack the angel race?<br/><br/>No, this possibility was very small. There was no need for the other peak races to offend the Angel Race.<br/><br/>The starry universe was filled with treasures. There was no need to start a dispute at this time.<br/><br/>Then what was the reason?<br/><br/>This twelve-winged angel did not understand. He dodged the fatal attack and then saw another wave of attacks coming towards him.<br/><br/>“Damn it! This guy is not weaker than me!”<br/><br/>The 12-winged Angel cursed. While his defense was still there, he waved his arm, and a million-strong Angel Army appeared around him.<br/><br/>At the front of the Angel Army were six battle angels at the first level of universe masters.<br/><br/>The rest of the powerful battle angels were holding long swords and shields, Spears, and staffs!<br/><br/>“Attack this guy!”<br/><br/>The twelve-winged angels roared furiously!<br/><br/>“Kill!”<br/><br/>“Kill!”<br/><br/>“Fight for Your Excellency!”<br/><br/>One by one, the Battle Angels roared and attacked Wang Xian with spears and light attacks!<br/><br/>“Hehe!”<br/><br/>Wang Xian chuckled when he saw their attacks. He stared at the Battle Angels and four ghost clones appeared beside him.<br/><br/>Two of the Avatars moved and instantly attacked the Army of angels!<br/><br/>“You are from the Netherworld race!”<br/><br/>The 12-winged angel saw the sudden appearance of the Netherspirit avatars beside Wang Xian and shouted sternly!<br/><br/>Buzz<br/><br/>Wang Xian waved his arm and the five elements millstone appeared in the sky above him. On the five elements millstone, he also possessed that piece of ice metal!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>His body moved and he quickly attacked the 12-winged Angel!<br/><br/>The other two netherspirit avatars were also at his left and right positions!<br/><br/>Boom! Boom<br/><br/>Following the same pattern, the fire phoenix that ignited the flames of life last time unleashed a terrifying combat strength.<br/><br/>This time, the 12-winged Angel possessed a powerful defensive treasure. Wang Xian still used the ice metal to collide with it!<br/><br/>With Wang Xian’s strength and the two netherspirit avatars, he could easily suppress the 12-winged Angel!<br/><br/>“Damn it, what is he trying to do? This Netherworld race guy actually ambushed me. Did he kill the messenger? or?”<br/><br/>The 12-winged Angel had an ugly expression on his face. With a move of his palm, a huge sword appeared in his hand. He kept slashing at the incoming dark energy!<br/><br/>However, under the attack of Wang Xian and the ghost avatar, he could only be trapped on the spot. There was no way for him to break free!<br/><br/>Buzz<br/><br/>At this moment, under the control of the five elements millstone, the piece of ice metal smashed heavily at the 12-winged Angel!<br/><br/>“What is this thing?”<br/><br/>Seeing the ice metal attacking him, the 12-winged Angel’s expression changed drastically!<br/><br/>However, at this moment, Wang Xian and his netherspirit avatar were surrounding him with layers of attacks. There was no way for him to dodge them!<br/><br/>“Slash!”<br/><br/>When the 12-winged angel saw the ice metal smashing towards him and sensed the terrifying energy coming from it, his expression changed drastically.<br/><br/>The long sword in his hand smashed down heavily!<br/><br/>“Bang!”<br/><br/>“Crack! Crack!”<br/><br/>However, cracks appeared on the huge sword as it stood on the ice metal. The ice metal continued to smash towards him at a terrifying speed!<br/><br/>“Oh no, what the Hell Is This?”<br/><br/>The 12-winged Angel’s expression changed drastically as fear appeared in his eyes.<br/><br/>“Bang!”<br/><br/>“Crack! Crack! Crack!”<br/><br/>A muffled sound of collision rang out. The 12-winged Angel’s expression changed drastically as he spat out a large mouthful of blood!<br/><br/>Cracks appeared on the defense in front of him. The feathers in his hand were also somewhat illusory!<br/><br/>It’s over. I don’t have a treasure that can resurrect me<br/><br/>Despair welled up in his heart as his vision turned black!<br/><br/>“You guys from the Angel Clan, die!”<br/><br/>Wang Xian rushed over at this moment. With a wave of his arm, the five elements millstone landed in his hand. A surge of energy was channeled into it. The five elements millstone spun rapidly and smashed towards his body!<br/><br/>The terrifying speed and powerful energy landed on his body in an instant, causing his body to fly downwards continuously. His life force was also disappearing rapidly!<br/><br/>The kill was completed!<br/><br/>A smile appeared on Wang Xian’s face as he quickly put away the corpse. As for the Army of angels, they were completely helpless under the attack of the two netherspirit avatars!<br/><br/>“Haha, it’s still better to hunt down the powerhouses from the angel and Phoenix clans in the Starry Universe!”<br/><br/>Wang Xian smiled.\t\t\t\t\t\t</div>", "images": {}, "success": true}