{"id": 745, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073391.html", "title": "Chapter 3736 - 3736 3735 Was Fighting For The Treasure And Coincidentally Met The Phoenix Clan!", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3736 - 3736 3735 Was Fighting For The Treasure And Coincidentally Met The Phoenix Clan!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3736 3735 was fighting for the treasure and coincidentally met the Phoenix clan!<br/><br/>“Huff! Huff!”<br/><br/>Wang Xian took a deep breath and stared at this piece of ice metal. He circulated all the energy in his body and approached it.<br/><br/>His palm landed gently on it and instantly, he felt a feeling of being frozen.<br/><br/>One had to know that Wang Xian’s strength was not weak at the moment. Although he was suppressed in the starry universe, the strength of his physical body was still there.<br/><br/>This ice gave him a feeling of wanting to freeze himself.<br/><br/>“Can this metal five elements millstone devour it?”<br/><br/>Wang Xian could not help but have some doubts. After hesitating for a moment, he levitated the five elements millstone above him.<br/><br/>The five elements millstone was propagandized as it grinded the entire ice metal like a Millstone.<br/><br/>After waves of energy landed on it, only tiny ice shards fell from it.<br/><br/>Wang Xian raised his eyebrows. It could be devoured, but it would take a very long time!<br/><br/>“As long as it can be devoured, it will be fine. After the five elements Millstone has devoured it, it will definitely be able to improve again.”<br/><br/>Wang Xian mumbled as he scanned his surroundings.<br/><br/>In five days, he had already flown a long distance. He was hesitating whether he should return to his previous position or go somewhere else!<br/><br/>Forget it, I should go somewhere else to continue exploring<br/><br/>After hesitating for a while, he still made up his mind!<br/><br/>It was not enough. Wang Xian had set up a devil spirit altar here. Through this devil spirit altar, he could get an lie to teleport him over instantly!<br/><br/>Not only that, Wang Xian was prepared to set up a devil spirit altar whenever he encountered some treasure lands in the future. This way, even if he did not come himself, he could still get the disciples of the Dragon Palace to come over!<br/><br/>“Let’s go. The harvest over the past 200 years is already pretty good!”<br/><br/>A smile appeared on Wang Xian’s face. With a move of his body, he flew to the left!<br/><br/>The left direction was the place to leave this place. He had already checked it out.<br/><br/>While flying in the void, he kept the five elements millstone and let it absorb the ice metal bit by bit.<br/><br/>After flying in the void for ten years, Wang Xian finally flew out of the area covered by the meteorites.<br/><br/>“I don’t know where this place belongs to the starry universe. Let’s Go!”<br/><br/>He scanned his surroundings and could only identify one direction as he flew aimlessly!<br/><br/>“Eh? My Luck is really good!”<br/><br/>After flying for more than ten days, more than ten life planets lined up in the void in front of him.<br/><br/>Each planet exuded a rich vitality and was lush and green.<br/><br/>Wang Xian increased his speed and soon arrived in front of the planets. His gaze swept across them.<br/><br/>“There’s something wrong with those two planets.”<br/><br/>Soon, Wang Xian noticed some problems. There were signs of life on two of the planets!<br/><br/>Buzz<br/><br/>Wang Xian moved his body and two Hades’avatars appeared beside him. They immediately flew towards the two planets.<br/><br/>As the two netherspirit avatars got closer, they were even more certain that there were space beasts on the two planets.<br/><br/>This caused a hint of wariness to appear on his face!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>At this moment, two more Netherspirit avatars appeared around him. These two avatars flew rapidly towards the other life planets and collected the divine fruits and herbs on them!<br/><br/>“Whoosh! Whoosh! Whoosh! Whoosh!”<br/><br/>“It’s right here, my lords. There are more than ten life planets and two space beasts here!”<br/><br/>At this moment, waves of energy and a faint sound came from the back.<br/><br/>Wang Xian was slightly stunned. Waves of dark energy instantly filled his entire body and enveloped him completely.<br/><br/>He tried his best to suppress the dragon aura on his body as he looked towards the back!<br/><br/>As his gaze swept over, more than a dozen figures flew over.<br/><br/>At the leader’s position were three fire phoenixes. They flapped their Phoenix Wings and looked abnormally holy.<br/><br/>Around them were more than a dozen demonic beasts that also had wings.<br/><br/>“Huh?”<br/><br/>More than ten figures flew over. At this moment, they noticed Wang Xian who was floating in the air. Their eyes were sparkling.<br/><br/>The three fire phoenixes looked at Wang Xian and sized him up.<br/><br/>“Oh no, there are other experts!”<br/><br/>More than ten demonic beasts frowned when they saw Wang Xian’s figure. Their faces were filled with vigilance!<br/><br/>“Which race is he from? Dark Energy. He doesn’t look like the Netherworld race or the skeleton race.”<br/><br/>“I can’t sense his aura. He might be an expert from one of our high-level races.”<br/><br/>More than ten demonic beasts transmitted their voices and stared at Wang Xian with flickering eyes.<br/><br/>“Who is that expert in front of us? This is where we discovered him. Leave quickly!”<br/><br/>One of the demonic beasts stared at Wang Xian and said directly.<br/><br/>“I didn’t expect to meet a disciple from the nine-origin world!”<br/><br/>Wang Xian swept his gaze across them and narrowed his eyes slightly. His gaze landed on the three fire phoenixes.<br/><br/>Wang Xian did not sense any threat from the three fire phoenixes.<br/><br/>This time, there were quite a number of experts from the various peak races who entered this place. However, the top-notch experts among the Dominators did not enter.<br/><br/>All of them were below the fourth or fifth level of the Dominators.<br/><br/>With Wang Xian’s current strength, he did not care much about encountering some peak races.<br/><br/>“The treasure will belong to whoever has the strength to obtain it.”<br/><br/>Wang Xian stared at them and said faintly.<br/><br/>“Fire and wind. Without the two space beasts, they aren’t very strong. I think we can subdue them!”<br/><br/>“Good. The Space Beast Mount is so impressive. It will be of great help to us when we grow up.”<br/><br/>At the center, the three fire phoenixes suddenly spoke.<br/><br/>It seemed like they didn’t take Wang Xian seriously at all.<br/><br/>In fact, that was exactly the case.<br/><br/>The most important point was that they didn’t sense the aura of a ruler from Wang Xian.<br/><br/>Any powerhouse who broke through to the ruler realm would have some changes in their aura and temperament.<br/><br/>Other Great Beings might not be able to notice these changes, but as a ruler great being, they could sense it in an instant.<br/><br/>That figure hadn’t even broken through to the universe ruler realm, so there was no need to pay any attention to him.<br/><br/>Even if he was from another pinnacle race and hadn’t reached the ruler realm, they didn’t need to take him seriously!<br/><br/>“If that’s the case, let’s do it!”<br/><br/>The three fire phoenixes looked at each other, flapped their wings, and flew straight ahead!<br/><br/>When they came to the right of Wang Xian, their eyes swept over him. The Phoenix in the middle said directly, “I don’t care which race you are from. Get out of here immediately. This place belongs to US NOW!”<br/><br/>“Huh?”<br/><br/>When Wang Xian heard their words, he raised his eyebrows slightly. His eyes were sparkling!<br/><br/>After the Fire Phoenix in the middle finished speaking, it turned its head and locked its gaze on a life planet.<br/><br/>They could sense the aura of the space behemoth on this life planet.<br/><br/>“Phoenix Clan!”<br/><br/>When Wang Xian heard their soft cries and felt his strength, a cold smile appeared on his face!<br/><br/>The next moment, the primaless saint wings on his back flapped and disappeared instantly!<br/><br/>When he appeared, he was already in front of a fire Phoenix!\t\t\t\t\t\t</div>", "images": {}, "success": true}