{"id": 749, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073399.html", "title": "Chapter 3740 - 3740 3739 Successful, Escape! Down", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3740 - 3740 3739 Successful, Escape! Down</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3740 3739 successful, escape! down<br/><br/>One Level 2 universe ruler Angel, six level 1 battle angels, and a million strong Angel Army.<br/><br/>There were over 100 peak universe ruler Knight Level Battle Angels.<br/><br/>This batch of goods could add 200 to 300 peak knight level disciples to the Dragon Palace!<br/><br/>This was simply a huge harvest!<br/><br/>This was faster than searching for the resources of thousands of life planets!<br/><br/>Moreover, Wang Xian had also obtained a lot of resources and treasures from this angel. These resources and treasures were at least comparable to the harvest of hundreds of life planets!<br/><br/>This was simply too much!<br/><br/>He grinned and couldn’t help but laugh.<br/><br/>“However, I often do such things myself. I can’t even do it consecutively!”<br/><br/>He mumbled to himself. After killing this angel, Wang Xian was not prepared to continue his actions.<br/><br/>If a ruler-level Angel was killed, the angel race might suspect that they had encountered a powerful cosmic beast.<br/><br/>However, if powerful angels were killed consecutively, the angel race would definitely investigate.<br/><br/>Wang Xian did not have the ability to fight against them. After this operation, it would take at least another hundred years for him to take action again.<br/><br/>It was best to be careful.<br/><br/>Similarly, it was the same for the Phoenix race.<br/><br/>After more than a hundred years, he was prepared to continue his mission!<br/><br/>Now, he would first head to the starry universe to search for resources.<br/><br/>Wang Xian was planning in his heart. Although it was nice to directly hunt down the powerhouses of the angel race and the Phoenix race, they were still a peak race after all. He had to be careful!<br/><br/>“Huh?”<br/><br/>Just as Wang Xian left and the Angel was killed by him, the angel race received the news.<br/><br/>They immediately sent their powerhouses to investigate the news.<br/><br/>Every ruler-level angel was their core combat strength.<br/><br/>Once they appeared, they had to investigate it.<br/><br/>Was it swallowed by the space behemoth or something else happened.<br/><br/>However, because the rules of the universe were different from the energy here in the universe, some methods could not be used!<br/><br/>Wang Xian did not care if the angel race would check it out.<br/><br/>At this moment, he was flying in a direction that was very, very far away!<br/><br/>“My current position should not be too far away from the exit. Continue to go deeper!”<br/><br/>Wang Xian continued to fly forward, searching for life planets.<br/><br/>Time passed by quickly.<br/><br/>Fifty years was just a snap of the fingers!<br/><br/>“I’m now one-fifth away from the resources for the next upgrade. My speed isn’t slow at all!”<br/><br/>Wang Xian was floating above a planet as he muttered.<br/><br/>He took a break and looked ahead before continuing to fly!<br/><br/>“Huh?”<br/><br/>After flying for another day, he looked ahead and discovered two life planets!<br/><br/>This made him smile!<br/><br/>With a move, Wang Xian flew over immediately.<br/><br/>“There are more treasures in these two life planets!”<br/><br/>Wang Xian sized them up and revealed a smile on his face. Then, he started to collect the treasures quickly!<br/><br/>“Roar!”<br/><br/>All of a sudden, a roar was heard. Wang Xian, who was collecting the resources, was slightly stunned.<br/><br/>He flew to the sky in an instant.<br/><br/>“Boom! Boom! Boom!”<br/><br/>The next moment, a space beast with countless claws flew over rapidly. Its body was exuding a violent aura.<br/><br/>When Wang Xian saw it, his eyes narrowed. His face was filled with vigilance!<br/><br/>“This Space Beast’s strength has reached the Overlord level!”<br/><br/>His body moved and he quickly retreated backward.<br/><br/>The Overlord Level Space Beast was no longer something that Wang Xian could deal with!<br/><br/>With the suppression of the World origin, he could only escape.<br/><br/>“Run!”<br/><br/>Wang Xian didn’t hesitate at all and turned around to flee into the distance.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>In the next moment, he felt a terrifying tentacle flying toward him.<br/><br/>These tentacles left the body of the space beast directly. Their speed was abnormally terrifying!<br/><br/>“What the F * ck!”<br/><br/>Wang Xian looked over and revealed an expression of shock and anger. He activated his incipient saint wings to the maximum and flew into the distance rapidly!<br/><br/>“Spirit Spirit!”<br/><br/>Sensing the speed of the tentacles, his mind moved and the spirit spirit appeared beside him. “Boost!”<br/><br/>He shouted again and the spirit spirit immediately boosted his speed!<br/><br/>With the boost from the spirit spirit, Wang Xian’s speed increased a little!<br/><br/>“Ghost Avatar!”<br/><br/>At the same time, he immediately summoned his ghost avatar and fled in the direction of his surroundings!<br/><br/>At the back, hundreds of tentacles had locked onto him and were rapidly approaching him.<br/><br/>“These tentacles are so fast!”<br/><br/>Wang Xian’s expression changed slightly. In just a dozen seconds, he was caught up!<br/><br/>“Change form of the Netherworld Dragon!”<br/><br/>His body trembled.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>The whistling sound of the tentacles was heard. In the next moment, Wang Xian disappeared.<br/><br/>If he didn’t leave this place, he would definitely be severely injured.<br/><br/>“Run!”<br/><br/>After switching to a Netherworld Ghost clone, Wang Xian continued to fly into the distance!<br/><br/>“I got rid of it!”<br/><br/>After flying for some distance, he heaved a sigh of relief when he saw that the space beast was no longer chasing after him!<br/><br/>“That space beast actually discovered me so quickly. I didn’t even notice it.”<br/><br/>He mumbled as his eyes sparkled!<br/><br/>He hesitated for a moment and could only fly to the right!<br/><br/>“Roar! Roar! Roar!”<br/><br/>However, after flying for half an hour, a familiar roar was heard again.<br/><br/>This made Wang Xian’s expression freeze.<br/><br/>He quickly looked over.<br/><br/>“What’s the situation? Is It still that Space Beast? Is it chasing after me?”<br/><br/>“No, it shouldn’t be chasing after me. The position isn’t right!”<br/><br/>Wang Xian’s expression changed slightly. Without any hesitation, he continued to escape!<br/><br/>This time, he reacted faster than the last time and escaped further.<br/><br/>It was a close call.<br/><br/>“What’s going on? Why did I encounter this Space Beast Again?”<br/><br/>Wang Xian mumbled and frowned slightly.<br/><br/>He was sure that the last space beast chasing him was the same as this one.<br/><br/>However, it was a little strange that he was being chased the moment he entered this place!<br/><br/>“There’s a possibility!”<br/><br/>Wang Xian had a serious expression on his face.<br/><br/>That was that a ruler-level space beast had its own domain.<br/><br/>This was not impossible. On the contrary, the possibility was very high!<br/><br/>A ruler-level space beast was already a top-notch existence!<br/><br/>They had their own domain and territory. Anyone who entered recklessly would be considered as an invasion.<br/><br/>They would be attacked by them!<br/><br/>“My position shouldn’t be the center of the Space Beast. If that’s the case, I’m afraid it won’t be so easy to obtain a large amount of resources!”<br/><br/>He muttered.<br/><br/>However, all of this was just his guess. He still needed to test it out himself.<br/><br/>If that was the case, he would either change his direction and not go to the ruler-level space beast domain, or he would destroy the space beast.<br/><br/>At the moment, it was impossible for him to destroy the Dominion Level Space Beast!\t\t\t\t\t\t</div>", "images": {}, "success": true}