{"id": 741, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073383.html", "title": "Chapter 3732 - 3732 3731 Five Elements Grinding Tai Chi Dragon Disc For A Breakthrough!", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3732 - 3732 3731 Five Elements Grinding Tai Chi Dragon Disc For A Breakthrough!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3732 3731 five elements grinding tai chi dragon disc for a breakthrough!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Wang Xian quickly shuttled through the meteorites and headed in the direction where the meteorites were coming from.<br/><br/>“I found another one!”<br/><br/>On the left and right, four netherspirit avatars were flying at the same speed. When Wang Xian sensed this special and powerful metal, a smile appeared on his face. With a move of his body, he instantly transformed into a netherspirit, he immediately intercepted this piece of metal!<br/><br/>“It’s the third piece. Let’s continue!”<br/><br/>A smile appeared on Wang Xian’s face as he looked ahead. With a move of his body, he continued flying forward.<br/><br/>His speed was not slow as time passed by day by day.<br/><br/>Around his body, the Five Elements Millstone and the Tai Chi Dragon disc were absorbing pieces of powerful metal to strengthen themselves.<br/><br/>This kind of special metal was not something that could be encountered frequently. Sometimes, Wang Xian would encounter it in one or two days, and sometimes, he would not even encounter it for more than ten days!<br/><br/>Fortunately, he could receive some goods every month.<br/><br/>This made Wang Xian sigh again that this was a land of treasures!<br/><br/>He kept flying in the direction where the meteorites came from. After a few years, Wang Xian did not know how far he had flown, but he still could not see the end!<br/><br/>He did not stop. Although obtaining these metals would not improve his own strength, it could improve the tai chi dragon plate and the five elements millstone.<br/><br/>With the Tai Chi Dragon Plate and the five elements millstone improving, his strength would naturally improve as well.<br/><br/>Buzz! Buzz<br/><br/>After flying for about ten years, a majestic energy suddenly came from the area in front of Wang Xian and above his head.<br/><br/>Wang Xian looked over and his eyes were filled with excitement.<br/><br/>“I’ve made a breakthrough. What a coincidence! The Tai Chi Dragon Plate and the five elements millstone have made a breakthrough at the same time!”<br/><br/>Wang Xian was pleasantly surprised.<br/><br/>The two treasures that could not be upgraded in the nine-origin universe had made a breakthrough in ten years here!<br/><br/>In these ten years, Wang Xian had obtained more than a hundred pieces of special metals. After absorbing all of these metals, the two treasures had been upgraded.<br/><br/>After upgrading, Wang Xian could possess the invincible defense of a level two universe dominator.<br/><br/>The five elements millstone could possess three level two universe Dominators.<br/><br/>Adding on Wang Xian’s own strength, he was already strong enough to fight against a level three universe dominator!<br/><br/>Of course, in this starry universe, Wang Xian’s strength would be suppressed by three levels!<br/><br/>Boom! Boom<br/><br/>The two treasures emitted radiance as they slowly completed their transformation.<br/><br/>When Wang Xian saw this scene, a smile appeared on his face.<br/><br/>“Continue. Perhaps staying here for a thousand years will allow the Tai Chi Dragon Disc and the five elements millstone to improve once again.”<br/><br/>Wang Xian’s eyes revealed an excited expression. His body moved and he continued to fly forward.<br/><br/>Countless meteorites passed by him quickly. After the breakthrough of the Five Elements Millstone and the Tai Chi Dragon Disc, Wang Xian’s strength had received a huge boost.<br/><br/>It was even easier to intercept some special metal meteorites.<br/><br/>However, whether he could encounter the metal meteorites or not depended on luck!<br/><br/>Time passed by once again. In the blink of an eye, the passageway between the starry universe and the nine-origin universe had been opened for more than a hundred years.<br/><br/>In this short span of more than a hundred years, everything about the starry universe had spread to the nine-origin universe at a terrifying speed.<br/><br/>“The starry universe is full of treasures. A Life Planet already has a large number of treasures!”<br/><br/>“It’s too unbelievable. The entire starry universe seems to have not been exploited at all. There are too many treasures!”<br/><br/>“Fortune often comes with danger. The five cauldrons demon clan’s ancestor was swallowed by an extremely terrifying space beast in the sky above a Life Planet!”<br/><br/>“Entering the starry universe, if one can stay there for hundreds of millions of years without dying, one’s strength will definitely rise to a terrifying level!”<br/><br/>One by one, information was transmitted from the starry universe, shocking everyone.<br/><br/>Following that, more and more powerful disciples stepped into the starry universe.<br/><br/>Even if there was danger, what was this little danger compared to opportunities?<br/><br/>More than ten years after Wang Xian stepped into the starry universe, Prime Minister Gui and the rest decided to send 100,000 disciples of the Dragon Palace in.<br/><br/>Even if it was a little risky.<br/><br/>At most, they would let an lie run a little longer and bring the soul-returning wood branches to treat him.<br/><br/>There were simply too many resources in the starry universe.<br/><br/>In fact, this was normal.<br/><br/>The number of creatures in the starry universe was billions of times less than the nine-origin universe!<br/><br/>In the entire starry universe, there were no other creatures except for the space beasts, which resulted in all the treasures born in the past 20 billion years.<br/><br/>In addition, many space beasts were not interested in the fruits with attributes, which resulted in many treasures being preserved.<br/><br/>Of course, the risk was not small.<br/><br/>“HMM? It’s been over a hundred years, and the Dragon Palace hasn’t sent any powerful warriors into the Starry Universe?”<br/><br/>At the same time, the third prince stood at the entrance of the starry universe and slightly frowned. He looked at the burly battle angel beside him and asked.<br/><br/>“Third prince, I don’t sense any disciples with the Divine Dragon bloodline entering.”<br/><br/>The twelve-winged battle Angel shook his head. He had been standing there the whole time and had sensed the treasure, so it was impossible for him not to sense it.<br/><br/>“It shouldn’t be. Could it be that the Dragon King’s Dragon Palace hasn’t sent any powerful disciples in yet?”<br/><br/>The third prince murmured and looked to the side.<br/><br/>Beside him, the Clear River Phoenix shook her head.<br/><br/>“Buzz!”<br/><br/>At this moment, many terrifying figures flew over. The third Prince looked over and his eyes flickered slightly!<br/><br/>“Big Brother!”<br/><br/>He looked over at a figure and called out!<br/><br/>“Elder!”<br/><br/>“Elder!”<br/><br/>“Ancestor Huang!”<br/><br/>In the surrounding area, many experts from the peak races also called out to the terrifying figures flying over.<br/><br/>“Mm, we’ve entered the starry cosmos. Third brother, continue watching!”<br/><br/>A 12-winged battle angel called Big Brother by the third Prince looked at him and said indifferently.<br/><br/>The third prince nodded.<br/><br/>In the next moment, more than ten terrifying figures immediately flew into the starry cosmos!<br/><br/>The auras emitted from their bodies were all top-tier masters in the ruler realm.<br/><br/>And there was a reason why the top-tier races only sent more than ten experts into the starry cosmos after a hundred years!<br/><br/>If too powerful experts entered the starry cosmos, it might cause the terrifying starry behemoths in the starry cosmos to reject and be angry.<br/><br/>After all, they were intruders, and the aura of the intruders was different from that of the space beasts.<br/><br/>For example, in the 9-origin universe, unless it was in the mountain and sea area, once space beasts appeared in other places, they would definitely be hunted.<br/><br/>It was the same in the starry universe. If some weaker beings entered, the terrifying beings in the starry universe might not mind. However, if they entered the great beings, then their unconsciousness represented an invasion, and they might suffer the backlash of countless space beast great beings.<br/><br/>This time, the twelve peak races each sent a strong one in as a test.<br/><br/>If it caused a backlash from the space beast, then they could only take it back.<br/><br/>Lions wouldn’t care if an ant entered their territory, but they would care if a wolf entered.\t\t\t\t\t\t</div>", "images": {}, "success": true}