{"id": 746, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073393.html", "title": "Chapter 3737 - 3737 3736 Made His Move To Kill", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3737 - 3737 3736 Made His Move To Kill</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3737 3736 made his move to kill<br/><br/>“Huh?”<br/><br/>Wang Xian’s figure disappeared in an instant and immediately caught the attention of the fire phoenix in the middle.<br/><br/>When he saw Wang Xian appearing beside them in an instant, his pupils contracted slightly!<br/><br/>“Damn it, not good, Dodge!”<br/><br/>He shouted in a hurry!<br/><br/>However, he came to his senses. The fire phoenix beside him did not react in time!<br/><br/>Wang Xian stretched out his arm. There was a claw of darkness on his palm as he clawed at the Fire Phoenix beside him!<br/><br/>The Claw of Darkness in his hand was an innate supreme treasure that he obtained from the Invincible Zone!<br/><br/>With the Five Elements Millstone and the Tai Chi Dragon Plate, the innate supreme treasure did not have much effect on Wang Xian.<br/><br/>Wang Xian basically did not use innate supreme treasures!<br/><br/>However, this time, he deliberately changed to an innate supreme treasure!<br/><br/>The Terrifying Claw of Darkness entered the fire Phoenix’s body directly. It followed his blood and went straight to its heart.<br/><br/>Every innate treasure possessed a strange and terrifying ability.<br/><br/>For example, this claw of darkness was called The Claw of the heart of the black magic. Once it entered the body, it would enter the heart directly.<br/><br/>The power of this innate treasure was very strong. Of course, in Wang Xian’s opinion, it was more convenient to use the five elements Millstone!<br/><br/>“Ah!”<br/><br/>The Heart Claw of the black magic entered his body, causing the fire Phoenix to let out an intense scream.<br/><br/>He turned his head and stared at Wang Xian in horror.<br/><br/>However, under the cover of darkness, he could only see a blood-red pupil!<br/><br/>“Damn it!”<br/><br/>At the side, the hearts of the other two fire phoenixes were thumping violently!<br/><br/>They had completely ignored this figure just now because they could not sense the aura of the ruler from his body.<br/><br/>However, this sudden burst of strength had actually killed their companion in an instant.<br/><br/>One had to know that their companion had the strength of a ruler at level one!<br/><br/>“Which peak race are you from? You’re courting death!”<br/><br/>The Fire Phoenix in the middle was slightly stronger. He opened his mouth and a stream of flames shot towards Wang Xian!<br/><br/>“You’re the ones courting death!”<br/><br/>“Phoenix Clan? Hehe, die!”<br/><br/>Wang Xian’s eyes revealed a cold expression that was filled with killing intent.<br/><br/>He had always kept the account of the invincible region in his heart!<br/><br/>Buzz! Buzz! Buzz<br/><br/>As soon as he finished his sentence, four netherspirit avatars appeared around him. They stared at him coldly and charged towards him without any hesitation!<br/><br/>“Netherspirit avatars? Are you from the Netherspirit Race? Damn it!”<br/><br/>When the Fire Phoenix saw this, a cold expression appeared on his face.<br/><br/>Wang Xian flapped his incorporeal holy wings that were shrouded in darkness. Wind and thunder flashed and instantly locked onto the other fire Phoenix!<br/><br/>Three Fire Phoenixes, two level one masters of the universe, and one level two master of the universe!<br/><br/>Four netherspirit avatars were attacking the level two master while he was attacking the level one master!<br/><br/>“Not good, we are no match for him!”<br/><br/>The fire phoenix in the middle sensed the strength of the netherspirit avatars. Its pupils constricted slightly and a look of horror appeared on its face!<br/><br/>“Run!”<br/><br/>The other fire Phoenix was even more terrified!<br/><br/>He couldn’t see Wang Xian at all. He looked around in Panic!<br/><br/>“A Lord Fire Phoenix was actually killed. Hiss!”<br/><br/>“Oh no, we have encountered an expert!”<br/><br/>“It’s an expert from the Netherworld race. We have suffered. Let’s escape quickly!”<br/><br/>When the other demonic beasts saw a fire phoenix being killed in an instant, their faces were filled with horror.<br/><br/>They didn’t hesitate at all and hurriedly fled into the distance!<br/><br/>“PFFT!”<br/><br/>However, at this moment, they heard the sound of penetration!<br/><br/>“Ah Ah, Big Brother, save me!”<br/><br/>A scream came again.<br/><br/>They couldn’t help but turn around and see that their pupils contracted and their hearts tightened!<br/><br/>“The three fire phoenixes are no match for the enemy. Run!”<br/><br/>“The enemy is very terrifying!”<br/><br/>More than ten demonic beasts felt their scalps become troublesome and ran away desperately!<br/><br/>“Lord of the Dark clan, we don’t mean to offend you. We are willing to give this place to you. We are willing to leave this place!”<br/><br/>When the last fire Phoenix saw his companion being killed instantly, he widened his eyes in horror!<br/><br/>The other party had the ability to easily destroy them.<br/><br/>And in this starry universe, they could not return to their divine kingdom in an instant.<br/><br/>“None of you can escape!”<br/><br/>Wang Xian easily killed the second fire Phoenix. His gaze landed on the last fire Phoenix and his eyes were filled with coldness!<br/><br/>With a wave of his arm, a demonic ship flew out from his palm instantly.<br/><br/>The demonic ship expanded by a million times and charged towards the escaping demonic beasts!<br/><br/>“Ahhhh!”<br/><br/>“No, no, no, don’t Kill Us!”<br/><br/>The demonic beasts had no room to resist. With their speed, they were much slower than the demonic ship.<br/><br/>This demonic ship was also an innate treasure!<br/><br/>Even in the nine-origin universe, they had yet to reach the Overlord realm. They were basically cannon fodder!<br/><br/>The demonic ship easily caught up to them and crashed into their bodies. They were instantly killed!<br/><br/>“You… We don’t have a deep grudge against each other. Why do you want to Kill Us All? !”<br/><br/>When the Fire Phoenix, who was at the Overlord realm level two, saw that Wang Xian was not going to let even a dozen demonic beasts off, his expression changed drastically!<br/><br/>“Die!”<br/><br/>Wang Xian ignored him. With a move of his body, he dashed forward with his four Netherspirit avatars!<br/><br/>“Chirp, chirp, Chirp!”<br/><br/>“It’s not that easy to kill me. Nirvana, Burn!”<br/><br/>The eyes of the Fire Phoenix were filled with fury. He spread his phoenix wings and the raging flames of life began to burn.<br/><br/>The Flames of life burned and the terrifying power of the flames swept across the surrounding starry sky!<br/><br/>Among the dozens of planets in the distance, two of them started to move!<br/><br/>“If you want to kill me, then you must be prepared to die together with me!”<br/><br/>The fire Phoenix’s eyes were burning with flames as it roared in an eerie manner.<br/><br/>His strength had increased by a lot in an instant!<br/><br/>The terrifying thing about the Phoenix tribe was that they were burning their own fire of life.<br/><br/>Under the burning of the fire, their strength would increase tremendously.<br/><br/>When the Phoenix clan fought with their lives on the line, it was extremely terrifying!<br/><br/>“Humph!”<br/><br/>Wang Xian snorted coldly. With a thought, the five elements millstone appeared in the sky instantly. Above the five elements millstone, there was another piece of ice metal!<br/><br/>“Confine!”<br/><br/>Wang Xian shouted softly. Streams of dark force were released towards the Fire Phoenix.<br/><br/>The Four Ghost Clones were also released!<br/><br/>“CHIRP CHIRP CHIRP!”<br/><br/>Facing Wang Xian’s attack, the Fire Phoenix let out an angry roar. Terrifying Flames were burning as it struggled to break free!<br/><br/>“Roar Roar Roar!”<br/><br/>However, at this moment, the five elements were grinding in the air. Five divine dragons stretched out and let out roars. They struck the ice metal heavily!<br/><br/>The entire piece of metal was attacking the Fire Phoenix at a terrifying speed!<br/><br/>“Boom! Boom! Boom!”<br/><br/>The Fire Phoenix saw a piece of ice metal flying towards it. It raised its head and spat out the fire of Phoenix’s life.<br/><br/>However, when the terrifying fire landed on it, the ice metal did not change at all. It continued to smash towards the Fire Phoenix at a terrifying speed!<br/><br/>“Bang!”\t\t\t\t\t\t</div>", "images": {}, "success": true}