{"id": 742, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073385.html", "title": "Chapter 3733 - 3733 The Source Of The 3732 Meteorites! The Continent In The Middle Of The Storm!", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3733 - 3733 The Source Of The 3732 Meteorites! The Continent In The Middle Of The Storm!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3733 The source of the 3732 meteorites! The continent in the middle of the storm!<br/><br/>Wang Xian didn’t know the location of the entrance. He was still shuttling through the meteorites at a rapid speed!<br/><br/>When he encountered some metal meteorites, he immediately intercepted them.<br/><br/>Time was the most worthless in the universe. A hundred years passed in the blink of an eye once again. During these hundred years, he had still harvested quite a number of metal meteorites.<br/><br/>However, the tai chi dragon plate and the great grinding of the five elements required too much metal to achieve a breakthrough!<br/><br/>“Where is the end of these meteorites? I have been flying for two hundred years. Other than the meteorites being a little slower, nothing else has changed.”<br/><br/>Wang Xian frowned slightly. He had been flying for two hundred years. This distance was already very far, but he still had not reached the end.<br/><br/>This made him a little hesitant.<br/><br/>The starting point couldn’t be the starting point of the universe, right?<br/><br/>“I’ll fly for another hundred years. If I still can’t reach the end, I’ll fly to the side myself!”<br/><br/>Wang Xian made up his mind and continued to fly forward at a rapid speed!<br/><br/>Boom! Boom! Boom<br/><br/>However, the speed of the meteorites in the surroundings had dropped to a very low level in less than a hundred years.<br/><br/>At the same time, a terrifying rumbling sound was heard.<br/><br/>“What’s the situation?”<br/><br/>Wang Xian looked ahead. The rumbling sound came from the front.<br/><br/>As far as his eyes could see, he didn’t see anything.<br/><br/>His eyes flickered as he continued to fly forward.<br/><br/>As he got closer, the sound became louder and more terrifying. It was somewhat deafening!<br/><br/>However, after flying for a full day, a shocking scene appeared in his sight!<br/><br/>“That is?”<br/><br/>His gaze focused as he looked ahead. He felt his heart clench!<br/><br/>In front of him, a shocking scene was reflected in his eyes!<br/><br/>It was a huge and direct continent. Wang Xian couldn’t sense how big the continent was.<br/><br/>The sky above the continent seemed to have been torn apart.<br/><br/>A terrifying tornado stood there.<br/><br/>An extremely huge tornado swept across the entire continent.<br/><br/>Countless rocks on the continent were swept into the sky and flew towards him.<br/><br/>Some of the rocks were turned into powder.<br/><br/>Some of the rocks were emitting a thick luster!<br/><br/>Wang Xian felt that as long as he entered this terrifying storm, he might be torn to pieces!<br/><br/>It was too terrifying!<br/><br/>It was so terrifying that he was somewhat shocked!<br/><br/>“Roar!”<br/><br/>At this moment, a roar was heard.<br/><br/>Wang Xian looked over and saw a gigantic astral beast that was emitting a metallic luster all over its body flying towards the edge of the terrifying storm.<br/><br/>There was an earthy yellow piece of metal there.<br/><br/>The entire piece of metal was hundreds of times larger than what Wang Xian had obtained. It was at least hundreds of thousands of meters in size.<br/><br/>However, the size of the space beast was even more terrifying.<br/><br/>The Space Beast opened its mouth wide and directly swallowed the piece of metal.<br/><br/>The huge piece of metal was directly swallowed into its stomach!<br/><br/>It was as if it had eaten its fill. It swayed its huge body and floated on a huge meteorite beside it!<br/><br/>Wang Xian looked at this scene and pursed his lips. His gaze swept across his surroundings.<br/><br/>“There are so many space beasts!”<br/><br/>One wouldn’t know if one didn’t observe. The moment he took a look, Wang Xian’s pupils constricted slightly.<br/><br/>In his line of sight, there were a total of ten space beasts. They were lying on some meteorites. Some of them were sleeping while others were staring at the location of the storm as if they were waiting for some metal meteorites!<br/><br/>“This… there are so many space beasts. These space beasts feed on these metals.”<br/><br/>Wang Xian mumbled.<br/><br/>This was the source of the meteorites!<br/><br/>However, this source was too terrifying!<br/><br/>As he was too far away, he couldn’t sense the strength of these space beasts.<br/><br/>However, they could easily crush some meteorites. Their strength could easily destroy Wang Xian.<br/><br/>He wasn’t a match for it.<br/><br/>“The space beasts here seem to be of the same race. They have a metallic appearance and a huge metallic tail. Especially their tails, they seem to be very strong!”<br/><br/>Wang Xian analyzed and didn’t dare to get closer. He stood on a meteorite at the back and watched from afar.<br/><br/>The rumbling sound entered his ears. Wang Xian’s gaze swept across the loyalty of the storm.<br/><br/>He realized that a lot of metals were flying out from here.<br/><br/>Some of the larger metals were directly eaten by some space beasts.<br/><br/>There were only some small metals. These space beasts didn’t seem to care about them and didn’t devour them!<br/><br/>With a glance, he could discover more than a dozen pieces!<br/><br/>“So the metals that I obtained were all things that these space beasts didn’t take a fancy to!”<br/><br/>Wang Xian mumbled to himself. His gaze swept across the huge metal that occasionally flew out. His eyes were burning with passion!<br/><br/>If there were three to four pieces of such huge metal, the Tai Chi Dragon Plate and the five elements millstone would be able to improve again!<br/><br/>“Forget it. The strength of these space beasts should be above the Overlord realm. I’m not their match. It would be good if I could obtain those small-sized ones!”<br/><br/>Wang Xian’s eyes flickered. He looked at the few metals flying over and hesitated for a moment. Then, he moved his body and flew over immediately!<br/><br/>He didn’t dare to unleash all of his power and quickly caught up with the three pieces of metal.<br/><br/>The Netherspirit Avatar, the Tai Chi Dragon Plate, and the five elements grinding were all intercepted together!<br/><br/>“Bang! Bang! Bang!”<br/><br/>The intense sound of collision was heard. However, the intense sound of collision was completely covered by the sound of the storm.<br/><br/>The group of Space Beasts did not notice it.<br/><br/>This made him slightly relieved.<br/><br/>“Roar! Roar! Roar!”<br/><br/>However, just when he was about to put away all three pieces of metal, an angry voice was suddenly heard!<br/><br/>The sudden voice caused him to be slightly shocked.<br/><br/>He quickly looked over!<br/><br/>“F * ck!”<br/><br/>In his line of sight, a strange space beast with a body like a meteorite and a huge mouth was attacking Wang Xian furiously.<br/><br/>His entire body was khaki-colored and was almost no different from a meteorite!<br/><br/>His body was filled with an aura that was hard and unrivaled!<br/><br/>He opened his mouth and a golden energy stone was attacking Wang Xian!<br/><br/>Wang Xian immediately kept the metal and moved his body. He waved his arm!<br/><br/>A Dragon Claw met his attack directly.<br/><br/>“Boom!”<br/><br/>The sound of an explosion was heard. The attack of the Space Beast was defeated by Wang Xian directly.<br/><br/>Sensing the attack power, Wang Xian heaved a sigh of relief.<br/><br/>Luckily, it was within the range of resistance!<br/><br/>This space beast could fight!<br/><br/>“This fellow must have picked up some scraps here!”<br/><br/>He mumbled as he stared at Wang Xian. Then, he scanned his surroundings vigilantly!<br/><br/>“Roar! Roar! Roar!”<br/><br/>This space beast roared furiously once again and attacked Wang Xian!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Wang Xian moved his body and his four netherspirit avatars instantly passed through the meteorites one by one. Demonic Dragon Claws attacked him one after another!<br/><br/>“Annihilate! Charge!”<br/><br/>Wang Xian waved his arm and five dragon heads extended out from the Taiji Dragon Plate in the sky. A terrifying torrent gushed out directly!<br/><br/>The torrent gathered together and formed a terrifying annihilating force!\t\t\t\t\t\t</div>", "images": {}, "success": true}