{"id": 743, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073387.html", "title": "Chapter 3734 - 3734 3733, Exterminate", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3734 - 3734 3733, Exterminate</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3734 3733, exterminate<br/><br/>Boom! Boom! Boom<br/><br/>When the unique space beast saw Wang Xian’s attack, the metallic light on its body spread out in all directions!<br/><br/>In the surrounding area, the meteorites seemed to be attracted by a huge force as they attacked Wang Xian and the Netherworld Ghost clone directly.<br/><br/>A violent explosion sounded.<br/><br/>Wang Xian’s attacks were blocked one after another!<br/><br/>“It’s not much stronger than me. I Can Fight!”<br/><br/>Wang Xian stared at this terrifying space beast. His body moved and instantly transformed into the body of a divine dragon!<br/><br/>Around him, the four Netherspirit Avatars also transformed into the Netherworld Dragon. They stared coldly at the Space Beast!<br/><br/>Roar! Roar<br/><br/>The Space Beast was enraged. It raised its head slightly and its body began to transform.<br/><br/>Its entire body was like a transformer, turning into a huge beast!<br/><br/>A space beast with eight arms!<br/><br/>“Huh?”<br/><br/>Wang Xian looked over and revealed a surprised expression!<br/><br/>The Space Beast’s body had changed into another form. This space beast was really not simple!<br/><br/>“Towering Dragon Horn!”<br/><br/>Wang Xian’s dragon horn emitted a ray of light and attacked him directly!<br/><br/>At the same time, the four netherspirit avatars attacked him directly!<br/><br/>“Boom!”<br/><br/>When the space beast saw the attack from Wang Xian’s law projection, it did not show any fear. It raised its two arms and attacked him directly!<br/><br/>A heavy muffled sound was heard. The Space Beast could not help but fly backward!<br/><br/>At this moment, the attacks from the four Netherspirit avatars also arrived at the same time!<br/><br/>“Bang! Bang! Bang! Bang!”<br/><br/>His other six arms met the attacks of the ghost clones directly!<br/><br/>“His body is like an indestructible metal. The defense of this space beast is too tough!”<br/><br/>Wang Xian frowned slightly when he saw this scene!<br/><br/>He extended his Dragon Claw and the five elements millstone floated above his head. The tai chi dragon disk floated around him and flew directly toward him!<br/><br/>This space beast was obviously more proficient in close combat. When it saw Wang Xian’s attack, its huge fist struck towards him directly!<br/><br/>“Let’s test his fist attack First!”<br/><br/>Wang Xian did not Dodge. His Dragon Claw met his fist directly.<br/><br/>On his Dragon Claw, tai chi rotated.<br/><br/>“Bang!”<br/><br/>A terrifying collision sound rang out again. The Space Beast’s fist landed on Wang Xian’s dragon claw but it did not break through the Tai Chi Dragon Disc’s defense!<br/><br/>At the same time, a powerful backlash from the Taiji Dragon Plate was launched at him!<br/><br/>“Good!”<br/><br/>Wang Xian sensed this scene and his face lit up with joy. This space beast was unable to break through the defense of the Taiji Dragon Plate.<br/><br/>Once it was unable to break through, it would pose no threat to him!<br/><br/>Buzz! Buzz<br/><br/>Roar! Roar<br/><br/>Above Wang Xian’s head, on the Taiji Dragon Plate, five dragon heads stretched out and smashed heavily at the Space Beast!<br/><br/>Crack! Crack! Crack<br/><br/>An earthy yellow energy was suspended on his body to defend against the Attack!<br/><br/>“Mighty Heavenly Dragon!”<br/><br/>Wang Xian let out a wild roar. A huge phantom of a divine dragon was launched at him from above!<br/><br/>“Netherspirit Avatars, Kill!”<br/><br/>The four netherspirit avatars moved and attacked the space beast from all directions at the same time!<br/><br/>Boom! Boom! Boom<br/><br/>The attacks landed in front of him one after another. The earthy yellow energy was destroyed.<br/><br/>His body was like a piece of metal, with cracks appearing on it!<br/><br/>There was no flesh or blood. It was as though it was made of metal!<br/><br/>Boom<br/><br/>It opened its mouth and numerous sharp metals covered the surroundings.<br/><br/>“Physical attacks can be ignored!”<br/><br/>Wang Xian sensed his attack. With a thought, the four netherspirit avatars approached him in an instant. The attacks continued to land on his body!<br/><br/>The space beast seemed to not understand why its opponent completely ignored its attacks. A hint of unease appeared in its huge pupils!<br/><br/>He realized that the enemy was a little difficult to deal with!<br/><br/>“This Space Beast’s attacks are biased towards physical attacks. The special characteristics of the netherspirit avatars can almost ignore its attacks!”<br/><br/>Wang Xian’s eyes sparkled as he controlled the Netherworld Ghost Avatar to attack continuously!<br/><br/>Boom! Boom! Boom<br/><br/>The Furious Space Beast attacked the Netherworld Ghost Avatar with its eight arms at the same time. A golden glow was emitted from its arms.<br/><br/>This attack was mixed with metal elements!<br/><br/>When Wang Xian saw the Space Beast attacking the Netherworld Ghost Avatar, he controlled the five elements grinding mill to continue attacking it!<br/><br/>At the same time, eight dragon pillars rose from the surrounding area. On each dragon pillar, there were divine dragons!<br/><br/>Boom! Boom! Boom<br/><br/>The sound of the collision was heard again.<br/><br/>The battle with this space behemoth was somewhat primitive. It was a direct confrontation!<br/><br/>The defense of this space behemoth was very terrifying and its destructive power was also very strong.<br/><br/>In addition, it could control the meteorites in the surroundings. If it wasn’t for Wang Xian’s strength being stronger and the Netherworld Phantom Avatar being more special, it would be difficult to fight against it at the same level!<br/><br/>Cracks appeared on the body of the space beast and it became more and more violent!<br/><br/>“Roar!”<br/><br/>His gaze was locked onto Wang Xian. At this moment, he completely ignored the attack of the ghost avatar and attacked him.<br/><br/>Since the start of the battle, he knew that Wang Xian was the master of everything.<br/><br/>Furthermore, Wang Xian’s threat was even greater!<br/><br/>“Hehe!”<br/><br/>Wang Xian smiled when he saw that the astral beast was charging at him despite the attacks of the Netherworld Phantom Avatar!<br/><br/>Four Netherworld Phantom avatars were rapidly approaching him. They were only 10,000 meters away from him!<br/><br/>Thick metal defenses rose around the Astral Beast. Its gaze was still fixed on Wang Xian.<br/><br/>Its fist emitted a luster as it attacked Wang Xian!<br/><br/>“Transformation of the Netherworld Dragon!”<br/><br/>When the eight arms of the space beast were about to strike Wang Xian, his body began to turn illusory!<br/><br/>In the next moment, his body was transformed into the Netherworld Ghost clone above the Space Beast!<br/><br/>“Life of the wind and Thunder Dragon, Kill!”<br/><br/>The divine wings of the primaless Saint released a terrifying force of wind and thunder in an instant. It condensed into a divine dragon with wind and thunder coiling around it as it charged downwards!<br/><br/>At such a close distance, the space beast couldn’t Dodge at all!<br/><br/>“Five Elements Annihilation Disc!”<br/><br/>At the same time, the Five Elements Great Mill also released its greatest attack. An incomparably large mill followed the wind and thunder dragon and crushed downwards!<br/><br/>“Roar Roar Roar!”<br/><br/>The space beast sensed the threat of death and roared in terror!<br/><br/>“Boom Boom Boom!”<br/><br/>The attacks landed on his body one after another. His body began to collapse and split open piece by piece.<br/><br/>Wang Xian stretched out his dragon claw and grabbed at a spot that had split open. Immediately, he grabbed it in his hand!<br/><br/>The destructive force washed away the collapsed spot and gradually lost its vitality!<br/><br/>Wang Xian waved his dragon claw and countless chains wrapped around his body!<br/><br/>“Kill his life force!”<br/><br/>Wang Xian shouted in a low voice. The energy released from the five elements grinding continued to attack!<br/><br/>The life force of the Space Beast was disappearing rapidly!<br/><br/>Soon, a gigantic corpse was left behind!<br/><br/>Wang Xian looked at the corpse and his eyes glowed!<br/><br/>The corpse of the space beast was very strange. It was exactly the same as metal.\t\t\t\t\t\t</div>", "images": {}, "success": true}