{"id": 740, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073381.html", "title": "Chapter 3731 - 3731 3730 Special Metal", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3731 - 3731 3730 Special Metal</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3731 3730 special metal<br/><br/>“This piece of Void is very special. The dense meteorites are moving rapidly.”<br/><br/>Wang Xian was flying in this piece of void. However, after flying for half an hour, he realized that there were still meteorites with flames in front of him.<br/><br/>This was another piece of starry sky.<br/><br/>As he did not have a map of his surroundings, he could only continue flying forward.<br/><br/>After flying for another three to four hours, he realized that the speed of the meteorites in front of him was getting faster and faster!<br/><br/>At this speed, even Wang Xian had to use all his strength to avoid them?<br/><br/>This made him frown slightly!<br/><br/>“Could it be that I’m going in the wrong direction?”<br/><br/>He mumbled to himself. However, Wang Xian did not stop. Three to four hours was nothing to him.<br/><br/>The speed at which he continued flying forward was getting faster and faster.<br/><br/>A day later, Wang Xian couldn’t even keep up with the speed of these meteorites!<br/><br/>“I can’t do it anymore. I Can’t continue anymore!”<br/><br/>Wang Xian stopped and stood in the air with a slight frown.<br/><br/>He hesitated for a moment and looked at the meteorites around him as well as the position behind him.<br/><br/>Rumble<br/><br/>However, at this moment, a loud sound was heard. Wang Xian looked over and saw a black meteorite colliding with another one!<br/><br/>The other one was smashed into pieces in an instant.<br/><br/>“Huh?”<br/><br/>Wang Xian’s gaze swept over and landed on the black meteorite. His eyes were sparkling.<br/><br/>A dark energy was transmitted from the black meteorite. The energy of the entire meteorite was extremely pure.<br/><br/>The surrounding meteorites were moving at a terrifying speed. The black damage was able to smash the other damage into pieces. One could imagine how sturdy it was!<br/><br/>“The speed of the surrounding meteorites is so fast. If they hit an innate spiritual treasure, even an innate spiritual treasure might be hit. However, that black meteorite…”<br/><br/>Wang Xian raised his eyebrows and looked at the dark glow. With a thought, he instantly flew towards a meteorite!<br/><br/>Bam<br/><br/>His body landed on the meteorite and the Thorns pinned him down. Wang Xian’s body shook and four ghost clones appeared around him.<br/><br/>“These casualties are flying at a high speed. Other than the flames from the friction on the surface, there are no other attacks. The ghost clones can ignore physical attacks. They have a huge advantage here.”<br/><br/>Wang Xian thought to himself. The four Hades’avatars locked onto the black meteorite that was flying at a high speed. With a move of their bodies, they flew over at a high speed!<br/><br/>Buzz Buzz Buzz<br/><br/>The four Hades’avatars approached. Streams of dark energy were swirling towards the black damages!<br/><br/>The speed of the damages instantly decreased.<br/><br/>Boom<br/><br/>However, just as the damages decreased, the meteorite that was flying from behind hit it and produced an intense sound.<br/><br/>The dark force that was wrapped around the meteorite collapsed instantly. The black meteorite continued to fly forward!<br/><br/>“This won’t do. I Can’t let the meteorite at the back collide with it!”<br/><br/>Wang Xian moved his body and the five elements millstone appeared in his hand. “Let’s continue!”<br/><br/>The four netherspirit avatars continued to wrap themselves around the meteorite. The powerful force caused the impact to be reduced bit by bit!<br/><br/>Wang Xian looked behind him. When he saw the meteorites chasing after him, he waved his arm.<br/><br/>The five elements millstone crashed directly into the meteorites behind him!<br/><br/>Boom<br/><br/>The losses at the back were crushed and scattered in all directions!<br/><br/>Roar! Roar! Roar<br/><br/>Five Divine Dragons emerged from the five elements millstone. They raised their heads and attacked the losses at the back.<br/><br/>Under the control of the Ghost Avatar, the speed of the black meteorite became slower and slower. In the end, it came to a complete stop.<br/><br/>Wang Xian moved his body and arrived in front of the black meteorite immediately!<br/><br/>The meteorite was only a thousand meters in size. Its extreme speed made it look like it had no impurities at all!<br/><br/>Wang Xian placed his arm on it and immediately felt a pure force of darkness.<br/><br/>This was a type of metal, a special and powerful metal!<br/><br/>At the very least, Wang Xian had never seen such a powerful metal in the nine-origin universe.<br/><br/>“Oh right, I wonder if the tai chi dragon plate can absorb it!”<br/><br/>With a thought, the Tai Chi Dragon Plate appeared in front of Wang Xian.<br/><br/>He placed this powerful meteorite on top of the Tai Chi Dragon Plate!<br/><br/>Buzz<br/><br/>The Tai Chi Dragon Disk began to operate. It slowly destroyed the energy and essence of this meteorite and slowly absorbed it!<br/><br/>“It’s useful!”<br/><br/>Soon, Wang Xian’s face lit up with joy and excitement.<br/><br/>It was useful. The tai chi dragon disk could absorb it. He could sense that the tai chi dragon disk had gotten a little stronger.<br/><br/>“If I can get enough of these metallic meteorites, I will have a chance to break through the Five Elements Millstone and the Tai Chi Dragon Disk!”<br/><br/>Wang Xian was delighted!<br/><br/>This material was slightly different from innate supreme treasures. Innate supreme treasures contained a kind of soul!<br/><br/>If one wanted to absorb an innate supreme treasure, the innate supreme treasure would resist on its own. It was impossible to do so with the Tai Chi Dragon Disc and the Five Elements Millstone.<br/><br/>On the other hand, this meteorite was purely made of metal. As long as it was worn out and absorbed bit by bit, it would be fine.<br/><br/>“If I can encounter the first meteorite, I should be able to encounter the second one!”<br/><br/>As he mumbled to himself, he jumped down from a meteorite and stared at the spot in front of him!<br/><br/>At the same time, he ordered his four Hades’avatars to fly forward and monitor the surrounding area.<br/><br/>With the addition of the Hades’avatars, Wang Xian could monitor a large area!<br/><br/>Following that, Wang Xian stood there and waited quietly.<br/><br/>Time passed by minute by minute. However, thousands of meteorites flew past in front of him every second.<br/><br/>Each meteorite carried a terrifying amount of energy.<br/><br/>A few hours later, Wang Xian suddenly had a thought.<br/><br/>A Hades Ghost Avatar saw a special meteorite.<br/><br/>It was a golden meteorite. Under the terrifying speed, it emitted a golden glow!<br/><br/>“Netherworld Dragon Transformation!”<br/><br/>His body moved and instantly replaced the Netherworld Ghost Avatar. At the same time, his body trembled and four Netherworld Ghost Avatars instantly appeared in front of him!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Wang Xian scanned his surroundings and immediately flew towards the metal!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>The Netherworld Ghost Avatar was entangled by streams of dark energy. Wang Xian similarly released numerous thorns to prevent it from flying.<br/><br/>The five elements millstone hovered behind him and attacked the meteorite behind him to prevent it from colliding with him!<br/><br/>“This golden meteorite is even bigger than the one with the dark attribute. Very good. It seems that there is hope for the Tai Chi Dragon Disc and the five elements millstone to achieve a breakthrough!”<br/><br/>Wang Xian smiled.<br/><br/>This made him sigh again. The Starry Universe was really full of treasures!<br/><br/>“If a large number of strong disciples enter the nine-origin universe, there will definitely be many strong ones. Perhaps some high-level races will be able to advance to the peak races!”<br/><br/>As he spoke, the opportunities here were huge!<br/><br/>After settling the golden meteorite, Wang Xian continued to scan the surroundings.<br/><br/>This time, his luck was not as good as before.<br/><br/>Ten days later, he encountered another metal that was flying over.<br/><br/>It was a fire-attributed meteorite metal.<br/><br/>“Let’s go to the source and take a look!”<br/><br/>After keeping it, Wang Xian searched while flying in the direction of the meteorite.\t\t\t\t\t\t</div>", "images": {}, "success": true}