{"id": 753, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073407.html", "title": "Chapter 3744 - 3744 The Deal Between 3743 And The Scientist!", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3744 - 3744 The Deal Between 3743 And The Scientist!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3744 The deal between 3743 and the scientist!<br/><br/>“Oh?”<br/><br/>Wang Xian looked at the scientist in this technological world. His eyes were sparkling.<br/><br/>“Metal, wood, water, fire, Earth, light, and darkness. I want these metals with seven attributes. I can give you the metals with the other two attributes!”<br/><br/>He said faintly.<br/><br/>Since the scientists in this technological world had discovered this place, it meant that this place had been exposed.<br/><br/>The information here had already been spread by him.<br/><br/>Once he expelled them, then he might spread the news.<br/><br/>Once he spread the news, then this place would definitely be occupied by the powerhouses of the pinnacle races.<br/><br/>After all, the metal here was a precious treasure to any race in the 9-origin universe.<br/><br/>“Good!”<br/><br/>Lin Wenluo nodded immediately when he heard that. A smile appeared on his face!<br/><br/>He was already very satisfied to be able to occupy two out of the nine types of metal!<br/><br/>In addition, due to the storm, the number of wind-type metal was slightly more than the other types of metal!<br/><br/>He was already very satisfied to be able to occupy some of them from the Dragon King!<br/><br/>“How are you going to solve the concealment problem here?”<br/><br/>Wang Xian looked at him and asked faintly.<br/><br/>“Dragon King, speaking of which, it’s not easy to conceal this place. I can only create some models of the space beasts around the storm continent to intimidate them. They should be able to hold on for a period of time!”<br/><br/>Lin Wenluo said, “As the space beasts around the storm continent are made of metal, it’s difficult to sense their aura. Hence, it’s impossible to be discovered by the simulation. As long as I create a nest of the space beasts here, no other peak species would dare to interfere recklessly!”<br/><br/>“Other than that, I will build some models of these space beasts and use them to devour and intercept these metals. In this way, it will create an illusion in the outside world that these metal meteorites are all occupied by the Space Beasts!”<br/><br/>Wang Xian raised his eyebrows slightly when he revealed his plan.<br/><br/>“This is a good idea!”<br/><br/>As he spoke, there were already many space beasts in the storm continent. Based on the terror of those space beasts, even the peak races didn’t dare to approach them.<br/><br/>The probability of being discovered by simulating the same space beasts was very small.<br/><br/>After all, the space beasts belonged to this universe. There was no way to detect the strength of a special space beast.<br/><br/>“What level do you belong to in the technological world?”<br/><br/>Wang Xian looked at Lin Wenluo and asked!<br/><br/>“Dragon King, I am one of the nine great scientists in the technological world.”<br/><br/>Lin Wenluo replied respectfully.<br/><br/>The Dragon Palace was now between a high-level race and a peak race. The technological world was also far from it.<br/><br/>“Your technological world is exploring this starry universe and has a unique advantage, right?”<br/><br/>Wang Xian looked at him and continued to ask with a twinkle in his eyes.<br/><br/>“Indeed, it has a huge advantage.”<br/><br/>As Lin Wenluo spoke, the mech on his body unfolded and his figure was revealed.<br/><br/>His figure was wearing thick armor, making him look a little bloated!<br/><br/>“But now, our technological world is basically about to disband!”<br/><br/>As he spoke, a bitter look appeared on his face.<br/><br/>“Oh?”<br/><br/>When Wang Xian saw this, he raised his eyebrows slightly.<br/><br/>“Now, the other eight top scientists in our technological world have been recruited by the top races. It can be said that the technological world no longer exists!”<br/><br/>Lin Wenluo said bitterly, there was a hint of confusion in his eyes. “The development of our technological world has always been severely limited. That is in terms of resources. The most important aspect is also in terms of metals. Without top-notch metals, our technology has been trapped here for billions of years. The appearance of the starry universe has made the top races promise to recruit the other eight scientists.”<br/><br/>“Then why didn’t you join a peak race?”<br/><br/>Wang Xian looked at him.<br/><br/>“Because the world of technology was established by my grandfather!”<br/><br/>Lin Wenluo said slowly.<br/><br/>“Hehe!”<br/><br/>Wang Xian smiled and didn’t ask any more questions. He moved his palm and some metal meteorites appeared in his hand. “I have some wind and thunder attribute metals here. If you have any treasures that satisfy me, we can carry out the trade!”<br/><br/>These wind and thunder attribute metals were what he had obtained over the past few hundred years. To him, they were useless.<br/><br/>There were more than a dozen of them. To Lin Wenluo, it was definitely not a small amount!<br/><br/>“HMM?”<br/><br/>Lin Wenluo’s eyes lit up when he saw this. Following that, a contemplative look appeared in his eyes. “The Dragon King might not even be interested in the things I have here. This is the only one.”<br/><br/>As he spoke, he took out an item. It was a special leather item with specks of light on it.<br/><br/>“What is this?”<br/><br/>Wang Xian looked at this special item with a curious look on his face.<br/><br/>“This is the latest item that I have researched. However, it is indeed a failed item.”<br/><br/>As Lin Wenluo spoke, he waved his arm. The leather item floated in the air and could be enlarged or shrunk. It looked very mystical.<br/><br/>“Even though it’s a failed product, it’s indeed the highest level of research I’ve achieved so far. It’s made from a very strange and special beast skin that was left behind from the previous calamity. Its main function is to mimic the shape of the beast. It’s a perfect mimic. In my original plan, it was to mimic the appearance of a space beast before traveling through the Universe!”<br/><br/>He continued.<br/><br/>“Why is it called a failure?”<br/><br/>Wang Xian looked at him.<br/><br/>“Because I can’t simulate the energy of the space beast. For example, if I put on this beast skin, I can transform into the appearance of the Space Beast in front of me. I can almost restore it to its original appearance. However, the attributes of the space beast are very special. It will be discovered by the Space Beast!”<br/><br/>As Lin Wenluo spoke, one robot after another flew to the side of the Beast Skin.<br/><br/>Soon, the beast skin landed on the robot’s body and began to transform. Slowly, an incomparably huge space beast appeared in their line of sight.<br/><br/>Wang Xian looked at the space beast with an astonished expression.<br/><br/>He actually couldn’t sense that the robot was only wearing a beast skin.<br/><br/>One had to know that he was only a dozen meters away and couldn’t sense it even from such a close distance. The ability to transform was a little terrifying!<br/><br/>“In addition, if I offend the Dragon King, he can even transform into the form of a Divine Dragon!”<br/><br/>As Lin Wenluo spoke, a lifelike flaming divine dragon appeared in front of him.<br/><br/>Other than the fact that the flaming divine dragon didn’t emit any aura, even Wang Xian couldn’t tell if it was real or fake!<br/><br/>“Your research is really impressive. What if we fight?”<br/><br/>Wang Xian looked over and asked.<br/><br/>“If we were to fight, we would be able to sense it. In addition, there are some space beasts and some powerhouses who have special racial talents. Hence, they have a huge flaw. However, I can guarantee that the Dragon King would be covered with this. It wouldn’t be too much of a problem to fly around the storm continent. I’ve tested it before.”<br/><br/>Lin Wenluo said with a smile.<br/><br/>“Your research is really strange, but it’s not worth much. I’m willing to trade for three pieces of Metal!”<br/><br/>Wang Xian said with a smile.\t\t\t\t\t\t</div>", "images": {}, "success": true}