{"id": 755, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073411.html", "title": "Chapter 3746 - 3746 3745 Beneath The Heart Of Fire Treasure", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3746 - 3746 3745 Beneath The Heart Of Fire Treasure</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3746 3745 beneath the heart of fire treasure<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>Wang Xian flew rapidly in the starry universe. His target was the heart of Fire Treasure Ground!<br/><br/>There were many cultivation treasure grounds in the universe, especially some of them. Cultivating in them was like riding a rocket!<br/><br/>In a universe, there would always be those extremely powerful treasure grounds!<br/><br/>A precious treasure ground like the nine-origin universe had already been occupied by the peak races.<br/><br/>There was a reason why the pinnacle races had so many rulers, and one of the reasons was the precious place.<br/><br/>That was the truly terrifying grotto-heaven blessed land!<br/><br/>Unfortunately, this kind of grotto-heaven blessed land was something other great beings couldn’t come into contact with.<br/><br/>Moreover, the energy within this kind of grotto-heaven blessed land was also limited.<br/><br/>For example, for a period of time, it could only store a fixed amount of energy.<br/><br/>As the disciples of the pinnacle races increased in number, their blessed land was not enough for them to use.<br/><br/>This flame heart treasured land was obviously comparable to the blessed land occupied by the pinnacle races.<br/><br/>Perhaps it was because some space beasts were not of the fire element, and the number of space beasts was much less than the life forms of the 9-origin universe, so it was not consumed.<br/><br/>“The distance is a little far. I didn’t expect that in less than a thousand years, the strong disciples of the nine-origin universe have already explored to such a depth!”<br/><br/>Wang Xian looked at the distance and muttered.<br/><br/>The deeper he went, the more space there was for the space beasts of the dominator level to occupy a territory. However, there were always many gaps.<br/><br/>There were many strong races in the nine-origin universe. They could still explore a path through various means!<br/><br/>Wang Xian flew rapidly according to the route on the communication stone plate.<br/><br/>“I’m finally almost there!”<br/><br/>Time passed day by day. Ten years later, Wang Xian suddenly realized that the number of experts’disciples around him had increased by a lot.<br/><br/>There were even many experts’disciples from the peak races.<br/><br/>“The thing that Lin Wenluo created can be used!”<br/><br/>Wang Xian’s eyes flickered slightly. For the time being, he didn’t want others to know his identity.<br/><br/>This was also to prevent the Angels and the Phoenix clan from having experts chasing after him.<br/><br/>With a wave of his arm, he wore the beast skin that could take shape on his body. His aura was completely concealed.<br/><br/>Some flames bloomed on Wang Xian’s body. At this moment, he was completely a fire cultivator.<br/><br/>Due to the uniqueness of this beast skin, even if they were to fight, they wouldn’t realize that he was the Dragon King of the Dragon Palace!<br/><br/>With this thought in mind, Wang Xian slowed down his speed and flew forward.<br/><br/>As he got closer, Wang Xian noticed that there were more and more strong disciples around him.<br/><br/>After flying for another day, he saw that there were at least a million strong disciples gathered in front of him.<br/><br/>In front of this group of strong disciples, there was an extremely huge and strange domain.<br/><br/>In front of him, there were numerous suns, which could be said to be fiery planets.<br/><br/>In the middle of more than a hundred flaming planets, there was a gigantic meteorite that was as big as a basin. Above the meteorite, there were streaks of red light.<br/><br/>Looking from the sky, one could see that in the middle of this meteorite, there was a pure red flaming liquid.<br/><br/>The Flames turned into liquid and seemed to contain a terrifying energy.<br/><br/>On the surrounding flaming planets, one could see many strong disciples cultivating on it.<br/><br/>Wang Xian continued to fly forward, his eyes gleaming.<br/><br/>“Is this where the Skyfire Grandmaster made his breakthrough? The power of the flames here is so dense!”<br/><br/>“This is simply a paradise for fire-attributed cultivators. It’s a pity that I’m not a fire-attributed cultivator!”<br/><br/>“Look over there. There are over a thousand fire phoenixes occupying a flaming planet over there. There are so many phoenixes coming over!”<br/><br/>Voices of discussion could be heard from the surrounding areas.<br/><br/>Wang Xian looked over and saw that there were indeed many fire attribute experts around.<br/><br/>After all, an ancestor of a high-level race had made a breakthrough!<br/><br/>“Why are there no experts going to the fiery liquid in the center? The energy there should be the most, right?”<br/><br/>Wang Xian looked at the few people who were conversing beside him and could not help but ask.<br/><br/>“HMM? Go to the center. Who Dares to go there? There are 70 to 80 space beasts there?”<br/><br/>When an expert heard Wang Xian’s words.., he replied, “You must be a newcomer, right?”? The center was known as the center of the fiery heart treasured land. There were more than 100 flaming planets guarding it. However, the center had already been occupied by a powerful space beast. Not long ago, an expert from the Phoenix tribe tried to enter the center but was swallowed by a Space Beast!”<br/><br/>“You didn’t see it. The other experts from the Phoenix tribe didn’t dare to save him. They were afraid of angering the other Space Beasts.”<br/><br/>As the expert spoke, he looked towards the center of the Land of fire.<br/><br/>“Oh? Is That So?”<br/><br/>Wang Xian raised his eyebrows. “Where did the Skyfire Grandmaster achieve his breakthrough?”<br/><br/>“The Skyfire Grandmaster obtained a Supreme Treasure from a flaming planet and achieved a breakthrough!”<br/><br/>The expert spoke with envy and yearning in his eyes. “The Skyfire Patriarch was able to break through on a flaming planet. If he were to enter the heart of the Land of fire, wouldn’t his improvement speed be even more terrifying?”<br/><br/>“Enter the heart of the Land of Fire? Forget about it. There are seventy to eighty space beasts, and every one of them is an existence above the level of a ruler. This is the starry universe. Even if a peak race were to come, they would have to die.”<br/><br/>His companion beside him said.<br/><br/>Wang Xian nodded his head slightly. After hesitating for a moment, he flew forward.<br/><br/>As he neared the flaming planets, Wang Xian instantly sensed a majestic energy being transmitted over.<br/><br/>This energy was actually even denser than the dragon palace.<br/><br/>One had to know that the energy in the Dragon Palace was extremely terrifying.<br/><br/>“This is just getting closer. If it is really located at the center of the heart of fire treasure ground, wouldn’t it mean that my cultivation speed would be tens of thousands of times faster?”<br/><br/>Wang Xian mumbled.<br/><br/>When he flew to a fiery planet, Wang Xian instantly felt a wave of heat and energy rushing over and washing his body.<br/><br/>On the fiery planet, he could see many strong people occupying a place and starting to cultivate.<br/><br/>“A fire element cultivator cultivating on this fiery planet is hundreds of times faster than the Dragon Palace. How terrifying!”<br/><br/>As he spoke, he looked towards the center of the fiery heart land.<br/><br/>On the fiery planet closest to the center of the fiery heart land, there were many fire phoenixes cultivating.<br/><br/>The fire energy there should be denser than that of Wang Xian’s planet.<br/><br/>However, the Phoenixes did not dare to step into the center of the fiery heart land.<br/><br/>They did not even dare to step to the edge!<br/><br/>He hesitated for a moment and approached little by little. He floated in the void in front of the center and looked down.<br/><br/>The location at the center was like a huge basin.<br/><br/>This basin was the size of more than ten planets.<br/><br/>Seventy to eighty space beasts could be seen inside.<br/><br/>These seventy to eighty space beasts did not belong to the same race but were divided into several types.<br/><br/>Without exception, their bodies contained a terrifying power of flames.<br/><br/>“There is no conflict between these space beasts. It is obvious that they have reached an agreement. They belong to at least seven to eight space beast races.”<br/><br/>Wang Xian watched and considered if there was a way to enter.\t\t\t\t\t\t</div>", "images": {}, "success": true}