{"id": 752, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073405.html", "title": "Chapter 3743 - 3743 3742 Met An Expert From The World Of Technology", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3743 - 3743 3742 Met An Expert From The World Of Technology</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3743 3742 met an expert from the world of Technology<br/><br/>“Boom!”<br/><br/>When the Three Angels released their army of Angels, an aura of despair spread out.<br/><br/>A terrifying millstone appeared above them at a terrifying speed.<br/><br/>Their entire space was instantly enveloped.<br/><br/>“What’s This?”<br/><br/>The three first-stage ruler Realm Angels looked up, their faces filled with despair.<br/><br/>Boom<br/><br/>A grayish energy swept over and the three angels lost their vitality instantly.<br/><br/>The current five elements grinding could even suppress and kill a master of level three. The Angels who were masters of Level One were even more helpless.<br/><br/>In fact, before they died, they didn’t even know what kind of enemies they had encountered.<br/><br/>After destroying them, Wang Xian appeared at the side. With a wave of his arm, he kept their corpses.<br/><br/>After checking the treasures in their hands, a smile appeared on his face.<br/><br/>Not bad.<br/><br/>The three angels had been in the starry universe for hundreds of years. The resources they had collected were not lower than what he had obtained last time.<br/><br/>“Next, the Phoenix Clan!”<br/><br/>A smile appeared on Wang Xian’s face. He kept the two space beasts and flew into the distance.<br/><br/>After flying for more than ten days, he stopped and took out his communication stone plate.<br/><br/>This time, he was also very lucky. Two level 2 universe Dominator Phoenixes flew over and were easily killed by Wang Xian.<br/><br/>These two level 2 universe dominator phoenixes could increase the number of disciples at the peak of the Universe Knight Realm in the Dragon Palace by 200!<br/><br/>“Hehe, this is the golden belt for killing and arson. This is the fastest way to obtain resources. Unfortunately, I can’t do it all the time!”<br/><br/>He muttered and contacted an lie, asking him to send the bodies of the Phoenix and the Angel to the Dragon Palace!<br/><br/>The last time he killed the angel and the Phoenix, this time, he could bring 600 to 700 Pinnacle Knights to the Dragon Palace.<br/><br/>This increased the number of Pinnacle Knights in the Dragon Palace.<br/><br/>It might not be long before a ruler was born in the Dragon Palace.<br/><br/>After all, with more masters at the peak of the master level, there would always be disciples who could make a breakthrough.<br/><br/>“Let’s go back!”<br/><br/>After killing two masters at the second stage of the master level in the Phoenix Clan, Wang Xian was prepared to return to the storm continent.<br/><br/>He could only step into the territory of the master level Space Behemoth after the Five Elements Millstone had made another breakthrough.<br/><br/>“HMM? There’s movement from the peak race?”<br/><br/>Wang Xian flew towards the storm continent. As he flew, he took out his communication stone plate to check on some information.<br/><br/>When he saw a piece of information, his eyes narrowed slightly.<br/><br/>Some of the strong disciples had discovered that the strong practitioners from the peak races were surrounding and attacking the ruler-level space beasts!<br/><br/>“Every ruler-level space beast occupies a huge life planet. Once they destroy the ruler-level space beasts, they will be able to reap a huge harvest. The peak races still have a huge advantage!”<br/><br/>Wang Xian sighed in his heart. He increased his speed and wanted to improve the five elements grinding as soon as possible.<br/><br/>“Huh?”<br/><br/>When they arrived at the front of the storm continent, they suddenly saw a large number of robots and spaceships floating in front of them.<br/><br/>“This is?”<br/><br/>Wang Xian was slightly stunned when he saw this. He narrowed his eyes.<br/><br/>He quickly hid his figure and looked ahead.<br/><br/>Beep! Beep! Beep<br/><br/>However, just as he was about to conceal himself, a voice rang out.<br/><br/>Not far away from him, there was an extremely tiny detector.<br/><br/>“I’ve been discovered!”<br/><br/>Wang Xian looked over and his eyes sparkled!<br/><br/>Since he had been discovered, there was nothing for him to hide!<br/><br/>His body moved and Wang Xian sized up the large number of spaceship robots in front of him before flying straight over.<br/><br/>These robots and spaceships were obviously the underlings of the technological world.<br/><br/>And in front of them, there must be experts from the technological world.<br/><br/>Wang Xian had no qualms about the technological world. Their strongest destructive power was not even able to threaten existences at the third level of the universe overlord.<br/><br/>Crack! Crack! Crack<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>“Warning, this place has already been attacked by our technological world’s combat skills. Retreat from our territory immediately!”<br/><br/>Numerous small-sized aircraft flew over and completely surrounded Wang Xian. The robotic voice warned him.<br/><br/>Wang Xian swept his gaze across the area. With a wave of his arm, a wave of energy landed directly on these aircraft.<br/><br/>“Bang, Bang, Bang!”<br/><br/>In an instant, all the aircraft in the surroundings collapsed instantly.<br/><br/>He looked ahead and swept his gaze across the machines coldly. “I’ve discovered this place for hundreds of years. Is this your territory?”<br/><br/>“This is? Analyzing the opponent’s strength, a universe knight? No… No, the energy in his body is terrifying. Analyzing the opponent’s bloodline, the probability of the Divine Dragon race bloodline is 80% .”<br/><br/>“The opponent’s strength is too strong. He’s not a match, he’s not a match!”<br/><br/>At the center of the front, a mech was analyzing Wang Xian’s information. His eyes revealed a hint of shock.<br/><br/>“Based on the data analysis, there is an 83.3% chance that the opponent is the Dragon King of the Dragon Palace!”<br/><br/>Another piece of information entered the mech’s mind, causing his eyes to flicker slightly.<br/><br/>The cultivation system in the technological world was the most unique. They were constantly climbing up the technological tree.<br/><br/>But in the end, they were stuck at the boundary of being the ruler.<br/><br/>From the perspective of the scientists in the technological world, they were stuck there not because of the limits of technology, but because they did not have sufficient metal materials and special energy.<br/><br/>Through their secret research, they also had a trump card that could fight against the Dominators.<br/><br/>Of course, it could only fight against the first level of the Dominators directly, and this trump card required the help of an innate supreme treasure.<br/><br/>This also made them realize that to completely break through the shackles of their current science and technology, they needed enough powerful metals and special energy.<br/><br/>And this was a treasure land that had been discovered by accident in the world of Science and technology, which was extremely important to them.<br/><br/>However, the Dragon King in front of them was obviously not someone they could afford to offend.<br/><br/>“Scientist Lin Wenluo from the world of technology pays his respects to this powerhouse. I believe you must be the Dragon King of the Dragon Palace, right? We were in the wrong just now and offended you, Dragon King!”<br/><br/>The scientist in the mech, Lin Wenluo, flew over and bowed to Wang Xian.<br/><br/>The Mech on his body seemed to be made of metal, but it had the flexibility of a living creature.<br/><br/>“I’ve already occupied this area. All of you, leave immediately!”<br/><br/>Wang Xian stared at the mech and said coldly.<br/><br/>His words.., lin Wenluo’s expression changed slightly in the mech. “Dragon King, the metal here is very important to our technological world. Can you let us occupy a little bit of space? We can take action on the metal that you don’t need. We can even intercept the metal. Dragon King, you can pick first and leave the rest to us!”<br/><br/>“Hehe, I can occupy this place by myself. Why should I share it with you guys?”<br/><br/>Wang Xian looked at Lin Wenluo and said with a faint smile.<br/><br/>“We can help you cover this place up. Sooner or later, other powerhouses will discover this place. If we cover it up, the chances of discovery will be much lower.”<br/><br/>Lin Wenluo said in a deep voice.\t\t\t\t\t\t</div>", "images": {}, "success": true}