{"id": 758, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073416.html", "title": "Chapter 3751 - 3751 In The Midst Of The Death Of The 3750 Skyfire Patriarch", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3751 - 3751 In The Midst Of The Death Of The 3750 Skyfire Patriarch</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3751 In the midst of the death of the 3750 Skyfire Patriarch<br/><br/>Boom! Boom! Boom<br/><br/>A surge of energy suddenly rose up and attracted the attention of all the strong disciples around.<br/><br/>Wang Xian flew into the air and looked over curiously.<br/><br/>On a flaming planet on the right, an enormous sun suddenly rose up in the sky.<br/><br/>Beneath the Sun, there was a majestic shadow!<br/><br/>“What’s going on? What Happened?”<br/><br/>“Is there a treasure coming out? Let’s go, Let’s go and take a look!”<br/><br/>“Quick, there might be a treasure coming out!”<br/><br/>On the surrounding flaming planet, the experts looked over. Their eyes glowed and they immediately flew over.<br/><br/>Wang Xian swept his gaze over and narrowed his eyes. He had a surprised expression on his face.<br/><br/>“Is there an expert who has broken through to the second stage of the Universe Overlord Realm? An expert from a peak race?”<br/><br/>He mumbled to himself and hesitated for a moment. Then, his body moved and flew over as well!<br/><br/>“Hahaha, there are no treasures here. There’s only your flame Lord!”<br/><br/>“Congratulations, Patriarch, for your breakthrough again!”<br/><br/>“Congratulations, Patriarch, for your breakthrough again!”<br/><br/>At that moment, wild, excited laughter rang out, accompanied by respectful shouts.<br/><br/>These voices caused the surrounding experts to pause for a moment.<br/><br/>“What? Patriarch Skyfire made another breakthrough?”<br/><br/>“Patriarch Skyfire made another breakthrough? Patriarch Skyfire? How is this possible? It’s only been a hundred thousand years, and Patriarch Skyfire made another breakthrough?”<br/><br/>“Hiss, Patriarch Skyfire has made another breakthrough. Doesn’t that mean that he now has the strength of a ruler at the second stage? This… just how big of an opportunity did Patriarch Skyfire obtain last time?”<br/><br/>The experts flying over narrowed their eyes slightly, and their faces revealed an incomparably shocked expression!<br/><br/>Patriarch Skyfire was the first known existence to break through to the ruler realm in the starry cosmos.<br/><br/>He was also the first expert to discover the fiery heart land.<br/><br/>However, he had broken through again in just a hundred thousand years?<br/><br/>This made them feel a little incredulous.<br/><br/>How long had it been?<br/><br/>He had advanced from the first level of ruler realm to the second level of ruler realm?<br/><br/>“It’s really terrifying. The Skyfire sect has already advanced to the peak race. Now that Patriarch Skyfire has advanced again, the Skyfire sect has once again experienced tremendous development!”<br/><br/>“It’s hard to imagine what kind of treasure the Skyfire Patriarch has obtained to be able to advance so quickly. It’s too heaven-defying!”<br/><br/>“The Skyfire Patriarch should be the one who has obtained the greatest opportunity out of all the experts.”<br/><br/>The surrounding discussions and shock continued to ring out.<br/><br/>“Haha, Our Skyfire sect is recruiting fire attribute experts to join us. I will personally guide those who have reached the peak of the venerate realm!”<br/><br/>At this moment, the shadow of the Sun above the fiery planet slowly solidified. Terrifying Flames enveloped it, making it look extremely terrifying!<br/><br/>The sun above his head had risen two levels in a row. In this place, he was worthy of being called the Flame Sovereign King!<br/><br/>Even on the fiery planet occupied by the distant fire Phoenix, there were experts looking over with sparkling eyes.<br/><br/>“This sky fire ancestor has definitely obtained an extremely powerful treasure. He has broken through to the ruler realm in such a short period of time and rose another level. He has a treasure in his hands!”<br/><br/>One of the fire phoenixes looked over, and his expression changed slightly.<br/><br/>He flapped his wings slightly, and a thoughtful expression appeared on his face.<br/><br/>“100% . This rate of improvement is too terrifying. He definitely has an extremely valuable treasure in his hands!”<br/><br/>The eyes of one of the fire phoenixes next to him were also slightly burning!<br/><br/>This rate of improvement was too heaven-defying!<br/><br/>It was so heaven-defying that they were somewhat jealous.<br/><br/>“Why don’t we…”<br/><br/>A fire Phoenix’s eyes flashed as he looked at his companion beside him. A trace of killing intent flashed in his eyes.<br/><br/>“If we attack, it might not be a good influence.”<br/><br/>The fire Phoenix beside him turned into human form and frowned slightly.<br/><br/>“Not a good influence? Our Phoenix clan doesn’t need to care about the opinions of ants. The calamity is still a few billion years away. We have to increase our strength as soon as possible!”<br/><br/>The Fire Phoenix spoke!<br/><br/>“If our clan’s Lord finds out about this, he might blame us!”<br/><br/>The other fire Phoenix was still hesitant!<br/><br/>“My Grandfather is an elder. It’s fine. If we can obtain a supreme treasure, it’ll be worth it!”<br/><br/>The fire Phoenix’s eyes slowly revealed a look of determination. He looked at his companion beside him and said, “If you don’t make a move, then I’ll make a move!”<br/><br/>“Alright, if he really has a powerful supreme treasure in his hands, then it’s worth it to make a move!”<br/><br/>The hesitant fire phoenix gritted his teeth and his eyes revealed killing intent.<br/><br/>They looked at each other before their bodies moved and immediately flew forward!<br/><br/>“Huh?”<br/><br/>At a position not far from them, several fire phoenixes noticed their actions and their eyes flickered slightly.<br/><br/>“If I knew this would happen, I would have made the first move!”<br/><br/>One of the fire phoenixes mumbled as he looked at them indifferently!<br/><br/>“Eh?”<br/><br/>Wang Xian was floating in front of the flaming star. Looking at the mighty Phoenix tribe in front of him, his eyes sparkled.<br/><br/>However, at this moment, he felt something and looked to the side.<br/><br/>Two fire phoenixes were flying towards them at a rapid speed.<br/><br/>According to Wang Xian’s senses, they had the strength of a level three universe overlord.<br/><br/>“CHIRP CHIRP!”<br/><br/>“Hehe, flame sovereign king, who dares to call themselves flame sovereign king in front of us fire phoenixes? What arrogance!”<br/><br/>Suddenly, a Phoenix cry was heard along with a voice.<br/><br/>“Huh?”<br/><br/>In the sky above the blazing planet in front, Skyfire Patriarch, who was under the sun, looked over and his expression froze.<br/><br/>“Oh? Fire Phoenixes? The two fire phoenixes? What are they doing?”<br/><br/>“Are they dissatisfied with the Skyfire Patriarch? Calling themselves the flame monarch in front of the Fire Phoenixes?”<br/><br/>“It should be that this title has angered the Fire Phoenixes.”<br/><br/>When the surrounding disciples saw this, they were slightly shocked as they transmitted their voices in a low voice!<br/><br/>“Sirs, I was boasting shamelessly just now and offended the two fire phoenixes. Please forgive me!”<br/><br/>The Skyfire Patriarch hurriedly explained when he saw the two fire phoenixes fly over.<br/><br/>He lowered his attitude very, very low!<br/><br/>Although he had broken through to the second stage of the ruler realm, he didn’t dare to be arrogant in front of the Phoenixes!<br/><br/>After all, they were a powerful peak race, and there was still a huge gap between him and them!<br/><br/>“Peak races are not to be offended. Anyone who dares to offend a peak race will have to pay a terrible price!”<br/><br/>A fire phoenix stared at him and coldly said. A faint aura surged out from him!<br/><br/>His words caused Patriarch Skyfire’s expression to change dramatically, and a solemn and embarrassed expression appeared in his eyes!<br/><br/>“Milord, I was wrong just now. I spoke too much. If you want to punish me, Punish Me!”<br/><br/>At this moment, a middle-aged man was kneeling on the ground and shouting in fear!<br/><br/>“Patriarch Skyfire, come with us!”<br/><br/>The two fire phoenixes frowned slightly when they saw this. Their gazes landed on Patriarch Skyfire as they coldly ordered!<br/><br/>Their words caused Patriarch Skyfire’s heart to tighten once again!\t\t\t\t\t\t</div>", "images": {}, "success": true}