{"id": 750, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073401.html", "title": "Chapter 3741 - 3741 3740 Hours Of Accumulated Time!", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3741 - 3741 3740 Hours Of Accumulated Time!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3741 3740 hours of accumulated time!<br/><br/>“Let’s give it a try. If that’s the case, we’ll be in Big Trouble!”<br/><br/>Wang Xian mumbled to himself. He moved his body and prepared to fly around the area.<br/><br/>After flying for more than ten days, Wang Xian felt that he should have left the territory of the space beast. He began to search around the area!<br/><br/>“There’s a life planet ahead!”<br/><br/>Three days later, he found a life planet. He scanned his surroundings and a ghost avatar appeared around him. He flew towards the life planet ahead!<br/><br/>At the same time, he controlled another ghost avatar to fly towards the back just in case!<br/><br/>“This planet is also rich in resources!”<br/><br/>The Ghost Avatar’s gaze swept across this planet. Wang Xian’s eyes sparkled!<br/><br/>The Avatar immediately entered the planet and began to gather resources!<br/><br/>Boom! Boom! Boom<br/><br/>However, in less than ten seconds, he felt a terrifying aura rushing towards him!<br/><br/>This made Wang Xian’s hair stand on end. He swept his gaze across the planet. Without any hesitation, he fled into the distance!<br/><br/>He slipped away!<br/><br/>If he didn’t slip away, he would be done for!<br/><br/>At the same time, Wang Xian’s expression turned ugly. His guess had been confirmed!<br/><br/>The space beasts at the ruler level would occupy a territory. These vital planets were their assets.<br/><br/>Once there were intruders, they would launch an attack!<br/><br/>Furthermore, the speed of these space beasts was extremely terrifying!<br/><br/>Perhaps some of the space beasts possessed abilities similar to that of the Kun. Coupled with the fact that they were familiar with their own domains, they were able to rush over in an instant.<br/><br/>Let’s continue to watch. If this is still the case, I shall fly towards the rear<br/><br/>Wang Xian made up his mind!<br/><br/>A month later, when he encountered another space beast, he completely gave up on the idea of continuing to probe deeper.<br/><br/>It was too dangerous!<br/><br/>If he encountered two or three ruler-level space beasts, he would be completely finished!<br/><br/>“Go Back!”<br/><br/>Without any hesitation, he flew towards the back.<br/><br/>The back should be in the direction of the opening of the passage. There were no ruler-level space beasts nearby.<br/><br/>He flew towards the back. Along the way, he also encountered some life planets. However, some of the life planets no longer had any treasures.<br/><br/>Clearly, someone had taken away the treasures on this life planet!<br/><br/>On the way, Wang Xian even met some of the strong disciples from the nine-origin universe.<br/><br/>He did not talk to them and continued flying.<br/><br/>A year later, he stood in the void and looked forward helplessly.<br/><br/>The end of the universe!<br/><br/>The Universe had an end.<br/><br/>And the end of the universe was Chaos!<br/><br/>His side was still filled with life. and in front of him, there was chaos. It was as if the heaven and earth had not opened. There was no energy or life in it.<br/><br/>The end of the universe!<br/><br/>Wang Xian had yet to see the end of the nine-origin universe, but he did see the end of the starry universe!<br/><br/>“The space here is a little weaker. The passage between the starry universe and the nine-origin universe is at the edge of the starry universe.”<br/><br/>Wang Xian frowned slightly as he spoke.<br/><br/>Once they were close to the center, it would be the world of the space behemoths.<br/><br/>A ruler-level space behemoth here would require a ruler of level four of the nine-origin universe to be able to fight against it. The suppression was too great!<br/><br/>“During the calamity, the passageway would be opened wide and the suppression would disappear. That would be the best opportunity. Now, for the nine-origin universe, entering the starry universe is too dangerous!”<br/><br/>As he spoke, the starry universe was still a treasured land for the strong disciples of the nine-origin Universe!<br/><br/>“It might be very difficult for me to improve and make a breakthrough now.”<br/><br/>He frowned slightly. If he wanted to make a breakthrough, he would need the resources of at least 10,000 life planets. Initially, he thought it would be easy, but the result was not so simple!<br/><br/>I should go to that huge storm continent<br/><br/>Wang Xian thought to himself. Currently, although his strength could not be improved, he could still find the resources that were improved by the Tai Chi Dragon Disk and the five elements grinding mill.<br/><br/>He took out his communication compass and sent a message to an lie!<br/><br/>Buzz<br/><br/>“Dragon King!”<br/><br/>Soon, an lie appeared beside Wang Xian and bowed to him!<br/><br/>“Take me to a place. I have set up a demonic altar there. How are the other disciples of the Dragon Palace doing?”<br/><br/>Wang Xian asked.<br/><br/>“Dragon King, the rest of the brothers of the Dragon Palace are doing well so far. There aren’t many casualties. However, they have discovered that the depths of the starry universe are still quite dangerous.”<br/><br/>An lie replied.<br/><br/>Wang Xian nodded. “Tell them that the space behemoths that are at the Overlord level near the center have their own domains. Once they enter, they will be attacked. Tell them to be careful.”<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded his head. The next moment, the images around them changed and they arrived at the area where the meteorites were.<br/><br/>“Is there any situation over at the blue-green Moon Dragon Queen’s side?”<br/><br/>Wang Xian continued to ask an lie.<br/><br/>Currently, only an lie could easily travel between the dragon palace and this side. Therefore, he was the one who relayed everything to them.<br/><br/>“Not yet. The Dragon Queen said that Xiao Lan and Xiao House have followed a group of space behemoths to the center of the starry universe. They are now fighting for territory and are in a war.”<br/><br/>An lie replied.<br/><br/>Wang Xian nodded his head slightly. The space behemoths that used to exist in the nine-origin universe had gained sentience due to the characteristics of the nine-origin universe.<br/><br/>Compared to the space beasts in the universe, they had more intelligence.<br/><br/>However, having more intelligence did not mean that they were invincible when they entered the universe.<br/><br/>I have to raise my strength to the point where I can kill a level one ruler space beast as soon as possible. Otherwise, it would be difficult to obtain a large amount of resources in the universe<br/><br/>Wang Xian thought to himself.<br/><br/>He needed to raise his strength twice more.<br/><br/>Of course, after raising his strength twice, he would be able to truly break through to the Overlord realm. By then, he would not only be able to kill a level one overlord Beast.<br/><br/>He would be able to kill a level two overlord Beast as well.<br/><br/>After all, he did not have the peak of this realm. He could directly leap from level nine to level one overlord Beast!<br/><br/>“This is difficult. The Five Elements Millstone and the Tai Chi Dragon Plate can raise my strength by two levels!”<br/><br/>He moved his body and flew towards the front of the storm continent.<br/><br/>The five elements millstone, that piece of ice metal, could be upgraded by at least one level.<br/><br/>It could even be upgraded by one and a half levels. The five elements millstone might be the first to possess the combat strength of a dominator at level four!<br/><br/>At that time, he would be able to fight against a dominator-level space beast!<br/><br/>“Let’s do it. I’ll stay here for tens of thousands of years!”<br/><br/>Wang Xian thought to himself. He would hunt down the experts from the Phoenix and Angel race along the way and slowly develop himself.<br/><br/>He was not in a hurry anyway. He would wait until the Tai Chi Dragon Plate and the five elements millstone had broken through two levels before he left.<br/><br/>Having made up his mind, he scanned his surroundings and continued to collect pieces of metal meteorites!\t\t\t\t\t\t</div>", "images": {}, "success": true}