{"id": 754, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073409.html", "title": "Chapter 3745 - 3745 On The 3744 Heart Of Fire Treasure Ground", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3745 - 3745 On The 3744 Heart Of Fire Treasure Ground</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3745 On the 3744 heart of fire treasure ground<br/><br/>“Alright!”<br/><br/>Lin Wenluo agreed to the transaction. Although this item of his was made of precious and special animal hide, it wasn’t of much use to him.<br/><br/>In particular, in his opinion, this was a failure.<br/><br/>“Dragon King, other than this treasure, I wonder if you are interested in some technological items, such as some reconnaissance aircraft?”<br/><br/>Lin Wenluo continued to ask.<br/><br/>“I can take a look.”<br/><br/>Wang Xian nodded his head.<br/><br/>Lin Wenluo immediately took out some treasures that were used for reconnaissance and began to explain to Wang Xian.<br/><br/>Some of the items in the technological world were still very useful.<br/><br/>Their reconnaissance particle robot was a very, very small robot that could fly very far. It was very powerful when used for reconnaissance!<br/><br/>This was not something that Wang Xian and the rest of the experts could do!<br/><br/>There was a huge advantage to this kind of detection in advance. That was to predict the danger in advance. In addition, if there were more of them, it could also be used for detection and searching.<br/><br/>The speed of this kind of indiscernible detection robot was comparable to that of a venerable at level seven or eight. It was considered the highest technology in the technological world.<br/><br/>Wang Xian made some trade with it.<br/><br/>After the trade, Wang Xian controlled it for a while. A satisfied expression appeared on his face.<br/><br/>Lin Wenluo was also very satisfied with the position at the side.<br/><br/>When they were making the trade, Lin Wenluo had already disguised the surrounding positions. The models of the space beasts were lying around. Some of the space beasts even moved around a little. It was indeed a great deterrent.<br/><br/>In particular, there would be terrifying space beasts flying towards the storm from time to time, devouring pieces of metal.<br/><br/>With that group of terrifying existences, very few experts dared to set foot here. They wouldn’t suspect these fake space beasts either.<br/><br/>Lin Wenluo, who had the world of technology, simulated the space beasts to intercept pieces of meteorites. This didn’t require Wang Xian to do anything.<br/><br/>He sat there with his legs crossed and helped the great mill of five elements and the Tai Chi Dragon disc to speed up the absorption process.<br/><br/>Lin Wenluo was in the body of a space beast not far away. He was studying something.<br/><br/>Time passed day by day. A few hundred years passed in the blink of an eye.<br/><br/>In the middle of the time, Wang Xian had used the same method twice to hunt down the powerhouses from the angel and Phoenix clans.<br/><br/>However, he had attacked twice again. The first time, he was hunting for a ruler-level existence. The second time, he was hunting for a supremacy-level existence!<br/><br/>“Over the past two hundred years, a group of peak-level races have gradually entered the depths. Some ruler-level space beasts were also killed by them. This has also caused the number of ruler-level powerhouses in the vicinity to decrease!”<br/><br/>Wang Xian looked at the information on the communication stone plate. His eyes were sparkling!<br/><br/>“Eh, this is?”<br/><br/>All of a sudden, Wang Xian’s gaze landed on a piece of news. His eyes were filled with shock.<br/><br/>“Fiery heart treasured land!”<br/><br/>He immediately opened it to take a look. His eyes were filled with shock.<br/><br/>“This fiery heart treasured land is simply a holy land for fire attribute cultivators. A fire Phoenix has broken through and reached the ruler-level!”<br/><br/>“This… The Skyfire Patriarch has obtained a powerful treasure in the Fire Heart Treasure Land. He has broken through. This is unbelievable. The Skyfire Patriarch has become a ruler!”<br/><br/>“The Skyfire Patriarch has broken through? Hiss? This is too shocking. Doesn’t that mean that the Skyfire sect can advance to the peak race, even the weakest peak race?”<br/><br/>“This is the first high-level race’s expert to complete a breakthrough. This is something unimaginable in our nine-origin universe.”<br/><br/>“There’s actually an expert who broke through. This is too terrifying!”<br/><br/>Below this message, there were countless messages!<br/><br/>There was actually an expert from a high-level race who broke through. Just how big of an opportunity did he obtain?<br/><br/>Secondly, in the past, from the end of the quantum tribulation until now, in the nine-origin universe, there had been more than 20 billion years. Other than the current peak races, no other high-level race’s expert had broken through to the ruler realm.<br/><br/>However, in less than a thousand years after reaching the starry universe, there had actually been experts who had broken through!<br/><br/>This was absolutely something that shocked everyone.<br/><br/>At the same time, the group of high-level race experts’disciples became even more excited.<br/><br/>Although the starry universe was relatively dangerous, the opportunities were tens of thousands of times more than the nine-origin universe, hundreds of thousands of times more!<br/><br/>If one was lucky here, one could really soar to the sky.<br/><br/>The Skyfire Patriarch was an example!<br/><br/>Besides the news of the Skyfire Patriarch, there were also a large number of strong disciples who claimed that there were many fire attribute experts who were making breakthroughs in the HOTHEART treasured land!<br/><br/>When Wang Xian saw this news, his eyes revealed a look of shock!<br/><br/>“There are actually experts who have made a breakthrough so quickly.”<br/><br/>Wang Xian mumbled as his eyes sparkled!<br/><br/>He checked the location of the heart of fire treasure ground and revealed a hesitant expression!<br/><br/>Buzz! Buzz! Buzz<br/><br/>At this moment, waves of dark and light energy came from the side.<br/><br/>Wang Xian looked over and revealed a smile.<br/><br/>The Tai Chi Dragon Plate had achieved a breakthrough!<br/><br/>Currently, the five elements grinding tai chi dragon plate possessed the power of a ruler at level three.<br/><br/>With these two treasures, Wang Xian could escape with his life under the attack of a ruler-level space beast!<br/><br/>“If the five elements grinding wants to break through, it will probably take thousands of years at this rate of harvest!”<br/><br/>Wang Xian’s gaze swept across the five elements grinding as he muttered to himself!<br/><br/>With a thought, he took out the universe AI and contacted Wu Sha and the rest.<br/><br/>Wu Sha and the rest had already entered the starry universe and everyone had some gains.<br/><br/>After asking around, he called Wu Sha who was currently studying something over.<br/><br/>With a move, he flew to the outside and set up a demonic altar!<br/><br/>“Dragon King!”<br/><br/>Soon, an lie brought Wu sha over and Wu Sha called out respectfully.<br/><br/>“Follow me!”<br/><br/>Wang Xian nodded at her and led him forward!<br/><br/>“Lin Wenluo!”<br/><br/>When they reached their previous position, he called out to Lin Wenluo!<br/><br/>“HMM? Dragon King, what are your orders?”<br/><br/>Soon, Lin Wenluo walked out and asked respectfully.<br/><br/>“I will leave this place. Wu Sha will guard this place for me. If you have any problems, Tell Wu Sha!”<br/><br/>Wang Xian said to Lin Wenluo.<br/><br/>“Luo, one of the nine great scientists in the world of Science and Technology?”<br/><br/>Wu Sha looked at Lin Wenluo and slapped him in the face!<br/><br/>“HMM? A Dominator? A Dominator? Dragon King, Your Dragon Palace has a Dominator?”<br/><br/>Lin Wenluo looked at Wu Sha and checked her strength. Soon, she was shocked and said in shock!<br/><br/>“Hehe, if there’s anything, just tell Wu Sha. Wu Sha, take note of this place as well!”<br/><br/>Wang Xian said to them!<br/><br/>“It’s the Dragon King!”<br/><br/>Wu Sha nodded.<br/><br/>“Okay!”<br/><br/>Wang Xian responded and flew out.<br/><br/>He was prepared to head to the heart of fire treasure land!<br/><br/>“I really didn’t expect the Dragon Palace to have a master.”<br/><br/>Lin Wenluo watched Wang Xian leave and looked at Wu Sha with a sigh.<br/><br/>“Hehe, there are many things that you didn’t expect. The world of technology is interesting. Although it’s different from the lineage of wizards, they are all pursuing the truth!”<br/><br/>Wu Sha looked at him and said faintly.\t\t\t\t\t\t</div>", "images": {}, "success": true}