{"id": 756, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073412.html", "title": "Chapter 3749 - 3749 3748 Broke Through! Broke Through! Down", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3749 - 3749 3748 Broke Through! Broke Through! Down</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3749 3748 broke through! Broke through! Down<br/><br/>12 peak race level 8 rulers were all killed by the space beast. This caused a huge commotion.<br/><br/>This caused the peak race to be extremely embarrassed.<br/><br/>None of the rulers who entered the level 8 realm managed to escape. This meant that one thing was certain. If a ruler level 8 or above entered the universe, it would cause the space beast to chase after them.<br/><br/>After all, the universe was the territory of the space beasts.<br/><br/>They could allow the weak and ants to enter their world, but once the experts entered, it would be considered an invasion.<br/><br/>Such a powerful space beast race might give the order to hunt them down.<br/><br/>Therefore, after this investigation, the peak race didn’t dare to let any level 8 overlords or above enter.<br/><br/>After all, nurturing a ruler level 8 required too many resources.<br/><br/>Those who were able to cultivate to the ruler level 8 realm were basically existences that had survived the calamity.<br/><br/>In other words, they had experienced a calamity!<br/><br/>Only a small number of geniuses were born within this calamity.<br/><br/>After this matter, the pinnacle races also ordered that no ruler level 8 or above was allowed to enter the space beasts. If they really angered a few terrifying space beast races, all the experts and disciples of the 9-origin universe would die.<br/><br/>Other than this piece of news that caused everyone to be excited, there were also a few pieces of news that caused a huge commotion in the past 20,000 years!<br/><br/>Another ruler level expert had been born.<br/><br/>And the number wasn’t just one, there were more than 20 of them!<br/><br/>These 20 + were experts from the invincible region, as well as experts from high-level races.<br/><br/>These 20 + didn’t include the disciples of the peak races.<br/><br/>And these were only known. How many were unknown?<br/><br/>No idea!<br/><br/>Besides, these weren’t the disciples of the pinnacle races.<br/><br/>In short, the breakthroughs of these great beings caused a huge uproar.<br/><br/>This was something that the disciples of the 9-origin universe didn’t dare to imagine.<br/><br/>The news caused more and more great beings from the 9-origin universe to come. Even if it was dangerous, it was worth the risk.<br/><br/>Because some opportunities were too terrifying!<br/><br/>In fact, this was normal.<br/><br/>The Starry Universe was a powerful universe that was no weaker than the nine-origin universe.<br/><br/>The entire nine-origin universe had given birth to 12 pinnacle races, and it had given birth to a large number of rulers.<br/><br/>As for the Starry Universe? Even though the space beast had used up 50-60% of the treasures with nine attributes, there was still 40-50% left.<br/><br/>Logically speaking, if these treasures and resources were all obtained by the strong disciples of the nine-origin universe, it was possible for hundreds of thousands or even millions of masters to be born.<br/><br/>This was the importance of opportunities and resources.<br/><br/>Wang Xian did not know what was happening in the outside world. He kept on cultivating and forgot about time and even space.<br/><br/>10,000 years, 20,000 years, 50,000 years, 150,000 years!<br/><br/>“Boom!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>Roar after Roar exploded in Wang Xian’s mind again. Waves of energy rose in his body.<br/><br/>Wang Xian, who was already prepared, completely covered up these waves of energy.<br/><br/>“Ding! Congratulations to host for leveling up and breaking through to the first level of the Universe Dominator.”<br/><br/>“Ding! Congratulations to host for breaking through and opening up the domain of the nine-origin Dragon Realm.”<br/><br/>Name: Wang Xian<br/><br/>Race: Nine-origin Divine Dragon (man-dragon unity)<br/><br/>Level: Universe Overlord Level 1(nine transformations unity)<br/><br/>Origin: 1% (99% needed for the next breakthrough)<br/><br/>Supernatural ability: ruling the water tribe (ruling the water tribe below one’s level)<br/><br/>Devouring creatures (devouring creatures to extract the origin)<br/><br/>Control of the five elements<br/><br/>Cultivation Method: Divine Dragon Transformation<br/><br/>Supernatural ability: soul capturing, spirit attaching<br/><br/>Law Divine Ability: Dragon Eye Lock, Five Elements Dragon Claw, Yin and yang breaking realm, eight luminaries Dragon Scale, Sacred Dragon Shadow, Heavenly Dragon Eight Tribes, Dragon Tomb, Cloud Dragon Rising, True Dragon Body<br/><br/>Law aspect: eight Dragon Pillars, eight dragon clones, towering dragon horns, Mighty Heavenly Dragon, divine tail playing Pearl, Dragon Breath of life, Shadow Dragon Clone, Netherworld Dragon chasing, Netherworld Dragon Transformation, life of wind and Thunder Dragon, Mad Dragon Star Explosion!<br/><br/>Domain: Nine-origin Dragon Domain<br/><br/>Control Law: metal, wood, water, fire, Earth, light, dark wind and thunder<br/><br/>Divine Kingdom: Dragon Palace<br/><br/>Dragon Palace: Innate.<br/><br/>Members of the Dragon Palace: 8060450<br/><br/>“I have made another breakthrough in 150,000 years!”<br/><br/>Wang Xian smiled and was a little excited!<br/><br/>He had made two breakthroughs since he cultivated 160,000 in this fiery heart treasure land.<br/><br/>This time, it was a qualitative breakthrough.<br/><br/>An existence comparable to a ruler of level six. With his current strength, he could kill a ruler of level three space behemoths in the starry universe!<br/><br/>This strength was already very terrifying!<br/><br/>“The next time I want to make a breakthrough, I’ll probably have to seclude myself for a few million years. The speed of my improvement is getting slower and slower.”<br/><br/>Wang Xian mumbled.<br/><br/>He was already very satisfied with his improvement to such an extent!<br/><br/>His gaze swept to the side as his eyes sparkled.<br/><br/>According to his investigation, the three space beasts closest to him should be at the third level of the Overlord realm.<br/><br/>With his strength, he could definitely fight against three of them alone.<br/><br/>Of course, he didn’t intend to attack these three space beasts. He didn’t want to die yet!<br/><br/>Instead, after this improvement, he could secretly call over the fire attribute experts from the Dragon Palace.<br/><br/>If the fire-type powerhouses in the Dragon Palace could cultivate here, Wang Xian was sure that among the disciples at the peak of the venerable stage who had cultivated here for tens of thousands of years, at least five out of ten would be able to break through.<br/><br/>Yes, that was how terrifying it was!<br/><br/>The energy here was too terrifying!<br/><br/>As for the five who were unable to break through this shackle, Wang Xian also had a way to make them break through.<br/><br/>That was to absorb energy at all costs and consume the ordinary embryo fruit.<br/><br/>Just like Wu Sha and the rest of the crazy demons, they would use their strength to break through the bottleneck!<br/><br/>In other words, as long as they cultivated here and accumulated enough time, coupled with treasures like the ordinary embryo fruit, the chance of breaking through was 100% .<br/><br/>This was definitely a crazy thing!<br/><br/>Wang Xian’s eyes were filled with excitement. He took out the communication stone plate made by Wu Sha and immediately sent a message!<br/><br/>“What’s the current situation of the disciples of the Dragon Palace?”<br/><br/>After sending this message, he waited quietly.<br/><br/>“Dragon King, in the past 20,000 years, 13 of our disciples have broken through to the ruler realm. Furthermore, due to your resources and the resources obtained by the disciples of the Dragon Palace, there are about 3,500 disciples at the peak of the venerable realm. We have gained a lot. However, in the past 20,000 years, more than 20,000 disciples of our Dragon Palace have fallen.”<br/><br/>Soon, an lie, who was in charge of delivering the message, sent a message.<br/><br/>At first, the Dragon Palace only sent a few thousand disciples into the starry universe.<br/><br/>But with time and the powerful resources in the starry universe, the Dragon Palace sent more than 100,000 strong disciples into the starry universe.<br/><br/>But the death rate was almost one in five or six, which was a very large number.<br/><br/>Fortunately, there was an lie, who could resurrect him with the soul-returning tree branch.<br/><br/>In total, the Dragon Palace’s strength had improved greatly in the past 20,000 years.<br/><br/>There were 13 more masters in the ruler realm.<br/><br/>That was very good!\t\t\t\t\t\t</div>", "images": {}, "success": true}