{"id": 763, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073426.html", "title": "Chapter 3756 - 3756 The Battle Between 3755 Dragons And Phoenixes Was Shaking", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3756 - 3756 The Battle Between 3755 Dragons And Phoenixes Was Shaking</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3756 The battle between 3755 Dragons and phoenixes was shaking<br/><br/>Boom! Boom! Boom<br/><br/>Wang Xian’s speed was already much faster than the overlord level six fire Phoenix.<br/><br/>The moment he flew over, the Overlord level six fire Phoenix did not show any signs of Panic!<br/><br/>He could also see that Wang Xian’s speed was much faster than his. However, he could sense that his attack power was still at the Overlord Level Six!<br/><br/>As long as he used an area-of-effect attack to block and counterattack, he could dominate the attack power of someone at level six.<br/><br/>As for the Fire Phoenix, they were best at area-of-effect attacks!<br/><br/>“CHIRP CHIRP!”<br/><br/>“Dragon King, today is the Day You Die!”<br/><br/>He roared with a cold face. He flapped his phoenix wings violently and locked onto Wang Xian’s blurry figure. Then, he launched an attack!<br/><br/>Boom! Boom! Boom<br/><br/>Streams of flames turned into Phoenix Spirits and launched an attack on a large area.<br/><br/>The fire phoenixes in the surroundings also unleashed their strongest attacks. They charged toward the position where the Fire Phoenix, who was at the level six overlord realm, was attacking.<br/><br/>“Roar! Roar! Roar!”<br/><br/>Wang Xian chuckled and let out a roar.<br/><br/>He charged toward the fire Phoenix directly!<br/><br/>On the left and right side, the four netherspirit avatars were emitting dark, dark powers of darkness.<br/><br/>The four powers of darkness completely blocked the fire Phoenix, who was in the level six realm, as well as all the other attacks.<br/><br/>It was like a spear of darkness that pierced through the blazing flames!<br/><br/>“Huh?”<br/><br/>The Flames were broken through by the darkness. The Fire Phoenix, who was in the level six realm, was slightly stunned. It was filled with astonishment.<br/><br/>“What’s going on? What’s that darkness?”<br/><br/>As the surroundings were enveloped by Wang Xian’s cloud and mist dragon, the fire phoenixes could not see what was happening in the distance.<br/><br/>However, when they saw a wave of darkness resisting their attacks and charging straight at them, their pupils constricted slightly. Their faces were filled with shock.<br/><br/>“What is this? An avatar of the Netherworld Ghost?”<br/><br/>The Fire Phoenix, who was in the sixth level, looked at Wang Xian and the ghost avatar charging at them with a look of astonishment.<br/><br/>Ghost Avatar?<br/><br/>This was the exclusive ghost avatar of the Netherworld race.<br/><br/>How did it appear?<br/><br/>How did it possess the aura of the Dragon King?<br/><br/>Wasn’t he of the wood attribute?<br/><br/>Boom! Boom<br/><br/>At this moment, Wang Xian flapped his primaless saint wings and increased his speed. They charged at them abruptly.<br/><br/>The invincible attack gave off a feeling of being able to destroy everything!<br/><br/>The surrounding flames retreated rapidly.<br/><br/>Their domain was directly torn apart by Wang Xian!<br/><br/>“Oh no, this is bad. This Dragon King actually has a Netherworld Ghost Avatar!”<br/><br/>“How is this possible? Hiss!”<br/><br/>The Fire Phoenix, who was led by a level six overlord, looked horrified when it saw Wang Xian and the Netherworld Ghost Avatar charging over.<br/><br/>Each of the Netherworld Ghost Avatar had the strength of a level six ruler of the universe.<br/><br/>This was equivalent to them fighting against five level six rulers.<br/><br/>Even if the fire Phoenix used the flames of life to unleash a powerful attack, it could only deal with two to three Netherworld Ghost Avatars.<br/><br/>However, one had to know that burning the power of life would reduce one’s lifespan. It might even cause one’s strength to drop later on.<br/><br/>The price was extremely high!<br/><br/>However, at this moment, even if he paid a huge price, the fire Phoenix, who was at the level 6 ruler realm, wasn’t confident in fighting back.<br/><br/>Especially since the Dragon King of the Dragon Palace had a terrifying speed.<br/><br/>Facing this speed, he could only continuously release aoe attacks.<br/><br/>If he didn’t use AOE attacks, he would expose his weakness and be killed.<br/><br/>However, what should he do now?<br/><br/>A hint of fear appeared in his eyes!<br/><br/>“Roar! Roar! Roar!”<br/><br/>Wang Xian and his ghost avatar let out a furious roar at the same time and rushed over.<br/><br/>“Phoenix Nirvana, Burn the Flames!”<br/><br/>“Chirp! Chirp! Chirp! Chirp!”<br/><br/>When the Fire Phoenix, who was at level six, saw this, his heart trembled violently. He let out a roar and burned his life force.<br/><br/>Boom! Boom! Boom<br/><br/>The Shadows of the Fire Phoenixes rushed out from its body and attacked its surroundings.<br/><br/>The indiscriminate attacks caused a huge change in the fire phoenixes around it!<br/><br/>“Let’s escape quickly. This kind of battle is not something we can participate in!”<br/><br/>One of the Fire Phoenixes roared with a face full of fear!<br/><br/>The battle between six existences at level six was so terrifying that it could kill an expert at level one, level two, or even level three in an instant!<br/><br/>The group of Fire Phoenixes didn’t dare to get close!<br/><br/>“Die!”<br/><br/>Wang Xian saw the fire phoenix burning its life force and unleashing its terrifying strength.<br/><br/>However, the so-called explosion could completely suppress the fire phoenix even if Wang Xian didn’t make a move.<br/><br/>The four ghost avatars continued to charge forward. He flapped his incorporeal holy wings and instantly appeared behind the Fire Phoenix!<br/><br/>“This is bad, I’m in Big Trouble.”<br/><br/>Sensing that Wang Xian had appeared behind him, his body trembled violently.<br/><br/>“CHIRP CHIRP!”<br/><br/>He quickly turned his body to the side. The feathers on one of the Phoenix Wings attacked Wang Xian crazily.<br/><br/>He was already burning a large amount of his life force.<br/><br/>In this state, he could not hold on for five minutes.<br/><br/>After five minutes, he would die immediately!<br/><br/>However, Wang Xian would not give him five minutes.<br/><br/>When he saw the flaming feathers shooting toward him, his figure became slightly illusory.<br/><br/>The Netherworld Ghost had transformed!<br/><br/>The next moment, his figure appeared on another Netherworld Ghost’s body!<br/><br/>“Crash!”<br/><br/>He flapped his primaless Saint Wings and charged forward in an instant. His dragon claws grabbed onto another of his phoenix wings.<br/><br/>“RIP!”<br/><br/>A violent sound was heard.<br/><br/>“Ahhhh!”<br/><br/>A miserable scream was heard.<br/><br/>“Boom! Boom! Boom!”<br/><br/>At this moment, three netherspirit avatars charged forward. The terrifying power of darkness penetrated his body directly.<br/><br/>The body of the Flaming Phoenix was penetrated by the darkness. The life force of the Fire Phoenix, which was the ruler of the sixth level, was disappearing rapidly.<br/><br/>“Next, it’s Your Turn!”<br/><br/>Wang Xian did not bother about this fire phoenix anymore. He swept his gaze around and instantly started to move.<br/><br/>A Fire Phoenix, which was the ruler of a level six fire Phoenix, burned its life force and barely managed to resist for dozens of seconds.<br/><br/>What about the other fire phoenixes?<br/><br/>What could they use to resist?<br/><br/>They could not resist at all!<br/><br/>Wang Xian flashed and instantly arrived beside a fire phoenix that was the ruler of a level five fire Phoenix. He swept his dragon claws and killed it immediately.<br/><br/>Following that, he swiped his dragon tail and landed on the body of a fire phoenix that was at the level four overlord realm. The terrifying dragon tail caused a large amount of blood to spurt out from his body and he collapsed instantly!<br/><br/>It was an absolute speed and a huge difference in strength.<br/><br/>Right now, they had no way of resisting at all!<br/><br/>“No, no, no, Dragon King. If you kill us, our Phoenix clan will definitely not let you off!”<br/><br/>A roar filled with unwillingness and anger rang out!<br/><br/>“What’s going on?”<br/><br/>“Damn it, activate the domain of the Fire Phoenix World. Kill!”<br/><br/>At this moment, the fire phoenixes on the fiery star not far away had already charged over. They immediately erupted with all their fire power and charged towards the area covered by the domain.\t\t\t\t\t\t</div>", "images": {}, "success": true}