{"id": 764, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073428.html", "title": "Chapter 3757 - 3757 The Battle Of 3756 Had Gained Fame", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3757 - 3757 The Battle Of 3756 Had Gained Fame</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3757 The Battle of 3756 had gained fame<br/><br/>The 170 to 80 fire phoenixes who were at the ruler realm and above flew over and heard the miserable screams.<br/><br/>All of the experts trembled violently.<br/><br/>They immediately released their domain worlds and prepared to join the battle!<br/><br/>Boom<br/><br/>However, the moment their domain worlds opened, a shockwave spread out from the central battlefield.<br/><br/>In the blink of an eye, they could sense that the domains of the various flame worlds in the center of the battlefield were rapidly disappearing.<br/><br/>The power of the flames within them was also collapsing at a terrifying rate.<br/><br/>Boom! Boom! Boom! Boom<br/><br/>Chirp! Chirp! Chirp<br/><br/>Terrifying explosions rang out, as well as the cries of the Phoenixes!<br/><br/>Everyone in the area could sense that the flames within were rapidly extinguishing, and the life flames of the fire phoenixes were also rapidly extinguishing!<br/><br/>“Support senior and the others!”<br/><br/>The hearts of the 170 to 80 ruler-level fire phoenixes in the area began to pound when they saw this, and they roared loudly!<br/><br/>“Run! Run!”<br/><br/>However, at this moment, a shrill, terrified voice sounded from within the domain.<br/><br/>Run! Run!<br/><br/>This was a command to all the fire phoenixes in the area!<br/><br/>Yes, run!<br/><br/>The fire phoenixes within the domain were being hunted down one by one.<br/><br/>They had no strength to resist, nor did they have the strength to resist.<br/><br/>They couldn’t even escape.<br/><br/>Sensing that their companions were coming to support them, they could only let out their final roars!<br/><br/>“Bang!”<br/><br/>However, as soon as they finished speaking, the next instant, the sound of the battle completely disappeared.<br/><br/>The Flames slowly disappeared from the corner of their eyes!<br/><br/>“This… What on Earth happened?”<br/><br/>“That’s the scream of the Fire Phoenix. It’s the scream of the Fire Phoenix. It Can’t be, right?”<br/><br/>“Hiss, the Fire Phoenix has been killed again. Their life force has completely disappeared!”<br/><br/>At this moment, a shocked voice sounded from the surrounding area. All the powerful disciples stared at the center of the battlefield in shock.<br/><br/>“Is… is this the strength of the Dragon King of the Dragon Palace? The Fire Phoenix, who was a level 6 ruler, was killed!”<br/><br/>“The speed of the Dragon King is terrifying. He is already considered an expert among the rulers. In the universe, the only ones who can defeat him are us peak race rulers at the Level 7 realm!”<br/><br/>“So powerful. The Fire Phoenix, the ruler of the level 6 realm, has been killed so quickly. This time, the Phoenix race has encountered a tough opponent!”<br/><br/>The experts of the peak races were also shocked and widened their eyes.<br/><br/>The Dragon King’s growth speed was too heaven-defying!<br/><br/>His strength was beyond their expectations.<br/><br/>They were already amazed that he had the strength of a level 6 sovereign!<br/><br/>However, the Fire Phoenix was killed by him in such a short time.<br/><br/>This? ?<br/><br/>“Senior and the others have been killed. The enemy is very powerful. Run!”<br/><br/>At this moment, the most terrified and shocked ones were the experts of the Phoenix clan who had flown over.<br/><br/>They could clearly sense that their seniors, the experts of the Fire Phoenix clan, had no aura at all.<br/><br/>Clearly, they had been killed!<br/><br/>To be able to kill their senior, a level 6 ruler of the universe, the enemy wasn’t someone they could defend against!<br/><br/>Flee!<br/><br/>They immediately made the right choice.<br/><br/>“Hong Hong Hong!”<br/><br/>Without any hesitation, the fire phoenixes turned around and fled into the distance!<br/><br/>“Hua La!”<br/><br/>“Flee? Do you think you can escape? Do You Want to kill me? Do you want to leave so easily? is that possible?”<br/><br/>At this moment, 170 to 80 fire phoenixes saw a terrifying figure suddenly appear in their path of retreat.<br/><br/>That terrifying speed, some of the weaker ones didn’t even have time to react!<br/><br/>They looked at the massive divine dragon’s body and the Majestic Dragon Head, their expressions extremely unsightly!<br/><br/>They knew that once the Dragon King wanted to kill them, they wouldn’t be able to escape!<br/><br/>“Dragon King, do you really want to become enemies with our Phoenix Clan? Does the Dragon Palace really want to become enemies with us?”<br/><br/>One of the fire phoenixes’expression changed drastically as he spoke!<br/><br/>“Hehe, stupid thing, you still dare to utter such nonsense at this moment!”<br/><br/>“Die!”<br/><br/>Upon hearing his words, Wang Xian’s eyes were filled with disdain.<br/><br/>Everyone knew very well who was going to make an enemy out of whom.<br/><br/>If it weren’t for the fact that the Phoenix clan wanted to kill him in the invincible zone, would he interfere in this matter?<br/><br/>In the end, the Phoenix tribe did not put him in their eyes at all and treated him as an ant that they could easily kill!<br/><br/>However, this ant now possessed a strength that shocked them.<br/><br/>Boom<br/><br/>“The divine tail plays with the Pearl!”<br/><br/>Wang Xian flew over and swept his dragon tail across.<br/><br/>The divine tail plays with the pearl. It was an extremely huge phantom image of a dragon tail with an extremely bright dragon pearl on it.<br/><br/>The dragon bead contained a terrifying aura. With a sweep of the dragon tail, the entire dragon bead was like a terrifying meteorite.<br/><br/>“Defend!”<br/><br/>“Bang, Bang, Bang!”<br/><br/>A terrified roar was heard, followed by the sound of a collision.<br/><br/>They could not defend against it!<br/><br/>In an instant, dozens of fire phoenixes were killed in one move.<br/><br/>The terrifying collision force made them lose all their breath!<br/><br/>Whoosh<br/><br/>Wang Xian flapped his wings and continued to fly over!<br/><br/>His Dragon Claw attacked a fire Phoenix that was at level five of the Universe Dominator!<br/><br/>“Dragon Breath of Life!”<br/><br/>He grabbed the Dragon Claw and the law form, Dragon Breath of life, surged towards his body.<br/><br/>The Dragon Breath of life swept past and was also instantly killed!<br/><br/>He had no ability to retaliate!<br/><br/>“Is this the strength of the Dragon King?”<br/><br/>The bodies of the surrounding experts trembled and their eyes were filled with reverence!<br/><br/>This was the Dragon King’s strength.<br/><br/>One by one, the ruler-level fire phoenixes were crazily slaughtered and were completely unable to retaliate.<br/><br/>After the last calamity, who else could crazily slaughter the experts of the peak races?<br/><br/>In fact, after the last calamity, the group of high-level races had never heard of anyone slaughtering the experts of the peak races at the ruler-level.<br/><br/>Even among the peak-level races, masters of the master level rarely had conflicts, let alone a life-or-death battle!<br/><br/>However, today, they saw that more than a hundred, or even about two hundred, masters of the master level had fallen.<br/><br/>This shocked them, but at the same time, they also deeply respected and worshipped the Dragon King!<br/><br/>“This Phoenix clan is really used to being arrogant. They think that they can kill whoever they want. This time, the Dragon King has taught them a huge lesson!”<br/><br/>“Even at this time, they still say that they really want to become enemies with the Phoenix Clan? It’s Your Phoenix clan that wants to exterminate the Dragon King. Now that their strength is inferior to the Dragon King, saying such words is really despicable!”<br/><br/>Some of the surrounding expert disciples could not help but speak up.<br/><br/>The scene before their eyes and the battle in front of them made them feel extremely excited!<br/><br/>The matter today was really too arrogant of the Phoenix clan. They did not put existences below the peak of the clan in their eyes at all.<br/><br/>An existence that treated them like ants, they naturally hoped that the other party would be killed!\t\t\t\t\t\t</div>", "images": {}, "success": true}