{"id": 761, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073422.html", "title": "Chapter 3754 - 3754 3753 Made His Move And Killed The Fire Phoenix", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3754 - 3754 3753 Made His Move And Killed The Fire Phoenix</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3754 3753 made his move and killed the Fire Phoenix<br/><br/>When Wang Xian heard the threat of the Fire Phoenix, his eyes were filled with coldness!<br/><br/>In the nine-origin universe, if there were no rules of the peak race, the Dragon Palace would have been destroyed by the angel race or the Phoenix race.<br/><br/>Now that they were in the starry universe, there were no rules. The strong were King.<br/><br/>With the suppression of the rules of the starry universe, the ruler of level eight and above did not dare to step into the starry universe.<br/><br/>With Wang Xian’s current strength, what was there to be afraid of?<br/><br/>He had been sullen for so long in the nine-origin universe.<br/><br/>Now that his strength had broken through, he didn’t care about any peak race.<br/><br/>As long as someone dared to provoke him, he would kill them.<br/><br/>At worst, he could use the Void Pagoda to bring the Dragon Palace to the starry universe.<br/><br/>With the Void Pagoda and an Lie’s ability, he could now bring the Dragon Palace to the other side!<br/><br/>“Die!”<br/><br/>Wang Xian arrived beside another fire phoenix in an instant. His eyes were filled with cold disdain.<br/><br/>A threat of death was approaching.<br/><br/>“No, no, no!”<br/><br/>“Senior of the clan, save me!”<br/><br/>The fire Phoenix’s body trembled violently. Sensing Wang Xian’s terrifying speed, his face was filled with shock as he cried out for help!<br/><br/>“Eh?”<br/><br/>The moment his voice fell, the group of Fire Phoenixes immediately looked over at the fiery planet that the fire Phoenix occupied.<br/><br/>They were neither close nor far away from this place. They did not see the first fire Phoenix being killed.<br/><br/>When they heard this cry for help, the fire phoenixes immediately soared into the sky.<br/><br/>They flapped their Phoenix wings and immediately flew over.<br/><br/>“CHIRP CHIRP CHIRP!”<br/><br/>The cries of the Phoenixes rang out one after another.<br/><br/>“Who is it? How dare you attack my Phoenix Race!”<br/><br/>A fire Phoenix who was exuding an extremely powerful aura roared with an ice-cold face!<br/><br/>“PFFT!”<br/><br/>However, the moment he finished his sentence, Wang Xian’s Dragon Claw grabbed onto the fire Phoenix and killed it completely!<br/><br/>He swept his gaze over and immediately saw more than twenty fire phoenixes flying towards him.<br/><br/>Each of the fire phoenixes was emitting monstrous flames.<br/><br/>“You are courting death. Regardless of which peak race you are from, you will have to pay the price for daring to kill a disciple of our Phoenix race!”<br/><br/>When they saw the Phoenix being killed, the Phoenixes’faces were filled with fury.<br/><br/>A terrifying killing intent swept over.<br/><br/>The terrifying flames did not burn at all. Instead, it made one feel cold all over!<br/><br/>“Hiss, this Dragon King killed another fire Phoenix in an instant. His strength is too strong!”<br/><br/>“Not good, the rest of the fire phoenix experts are coming over!”<br/><br/>“Oh no, the Dragon King is in trouble!”<br/><br/>In the surrounding area, the group of experts’disciples watched. When they saw Wang Xian killing another fire phoenix in an instant and the group of Fire Phoenixes charging over, their expressions changed slightly.<br/><br/>They were somewhat shocked by the Dragon King’s strength.<br/><br/>Similarly, they did not wish for the Dragon King to be surrounded and killed.<br/><br/>“This Dragon King’s strength is really strong. His rise is simply too fast. He killed a phoenix at the third level of the Overlord realm in an instant. With this strength, is he at the fifth level of the Overlord Realm?”<br/><br/>“This Dragon King must have had a great opportunity. More than a hundred thousand years ago, his combat strength was only comparable to the second level of the Overlord Realm, right? How can he be so terrifying now?”<br/><br/>“This Dragon King must have obtained the powerful inheritance of the peak Divine Dragon Clan. Otherwise, he wouldn’t have improved so quickly. However, this time, he might be in trouble. A group of fire phoenixes have already attacked. It will be very difficult for him to escape!”<br/><br/>On a fiery planet not far away, dozens of experts of the divine tiger clan looked over with astonished expressions.<br/><br/>They did not expect the Dragon King to be able to unleash such terrifying strength.<br/><br/>“Huh?”<br/><br/>When Wang Xian saw more than 20 fire phoenixes from the Phoenix clan flying over, a cold look flashed in his eyes.<br/><br/>“A fire Phoenix at the sixth level of the universe dominator. The rest are all below the sixth level!”<br/><br/>He waved his arm and kept the fire Phoenix’s corpse. His eyes flickered slightly.<br/><br/>Although the flame heart treasure land was a huge treasure land, because it couldn’t enter the core area, there weren’t many powerful experts cultivating here.<br/><br/>After all, after reaching the ruler realm, it would be very difficult to break through on the planet of the Flame Heart Treasure Land.<br/><br/>Even if one could break through, it might take hundreds of millions of years, or even longer.<br/><br/>He might as well go to the starry universe to look for other opportunities.<br/><br/>It was already a special situation for there to be a powerhouse who was at the level six realm!<br/><br/>Boom! Boom! Boom<br/><br/>More than twenty fire phoenixes flew over and instantly surrounded him in the center. All of them stared at him with murderous looks.<br/><br/>Seeing the corpses of their own kind being collected, the fire phoenixes became even more furious.<br/><br/>“Hehe, you killed the little one, and now the old one is here?”<br/><br/>Wang Xian stared at them without any fear. His eyes swept across them and his face was filled with mockery.<br/><br/>“The might of the Divine Dragon, the Dragon King of the Dragon Palace? Your Dragon Palace is really courting death. You even dare to kill the experts of our Phoenix clan. Now, I can announce that the end of Your Dragon Palace is coming!”<br/><br/>In the center, the Fire Phoenix who was at the level six of the universe Dominator said with a grim expression!<br/><br/>Killing the experts of their Phoenix clan at the level of the Dominator had already crossed the bottom line of the peak race.<br/><br/>They must destroy the Dragon Palace!<br/><br/>Otherwise, where would the dignity of their Phoenix clan be?<br/><br/>“Hehe, the experts of your Phoenix clan want to kill me. Don’t tell me that I should just stand here and let them kill me? Can’t I retaliate?”<br/><br/>When Wang Xian heard their words, killing intent slowly blossomed in his eyes as he spoke in a similarly sinister tone!<br/><br/>“You deserve to die, Dragon King of the Dragon Palace. After we destroy you, our Phoenix clan will issue a kill order to destroy your Dragon Palace. You Reckless Thing, you dare to provoke our Phoenix clan just because you have obtained some inheritance. Do You Think Your Dragon Palace is a peak Dragon Clan?”<br/><br/>The Fire Phoenix in the middle, who was at the level six of the Overlord Realm, roared coldly. He flapped his wings and an incomparably resplendent flame feather flew straight towards Wang Xian!<br/><br/>“Die, you courting death!”<br/><br/>He roared in a low voice!<br/><br/>“Killing an expert of our Phoenix clan is an unpardonable crime. You shall be buried along with the entire Dragon Palace!”<br/><br/>“You Damned Thing. Very soon, the divine dragon bloodline will disappear completely.”<br/><br/>The fire phoenixes around also said coldly.<br/><br/>“It’s over!”<br/><br/>“The Phoenix clan is too powerful and overbearing. They want to destroy the Dragon King and the Dragon Palace!”<br/><br/>“The Dragon Palace will be in big trouble now. The Dragon King shouldn’t have provoked the Phoenix clan. But didn’t the Divine Dragon Clan have a good relationship with the Phoenix clan in the past? Why is the Phoenix clan treating the Divine Dragon clan like this now?”<br/><br/>The expressions of the surrounding disciples changed slightly when they saw that the Dragon King was surrounded.<br/><br/>More than twenty fire phoenixes charged over. One of them had a very terrifying aura!<br/><br/>How could the Dragon King block them?\t\t\t\t\t\t</div>", "images": {}, "success": true}