{"id": 765, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073430.html", "title": "Chapter 3758 - 3758 The Battle Of 3757 Became Famous", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3758 - 3758 The Battle Of 3757 Became Famous</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3758 The Battle of 3757 became famous<br/><br/>“Run, run quickly!”<br/><br/>At this moment, nearly half of the 170 to 80 fire phoenixes were killed by Wang Xian in the battlefield.<br/><br/>The rest of the fire phoenixes were screaming in fear and despair.<br/><br/>They couldn’t fight back, they couldn’t resist.<br/><br/>Run, run, run!<br/><br/>Whoosh<br/><br/>They flapped their Phoenix Wings and flew in all directions frantically.<br/><br/>Now, they had to flee as fast as they could!<br/><br/>“Their speed is too slow!”<br/><br/>Wang Xian looked at the group of Fire Phoenixes who were trying to escape with a mocking expression on his face.<br/><br/>Their speed was too slow. Was it possible for them to escape?<br/><br/>Splash<br/><br/>Roar! Roar! Roar<br/><br/>Wang Xian moved his body and chased after them at a terrifying speed!<br/><br/>Bang! Bang! Bang<br/><br/>“Ah! Ah!”<br/><br/>“Save me!”<br/><br/>“Dragon King, our Phoenix clan will not let you off!”<br/><br/>Screams of pain rang out continuously as the fire phoenixes were killed one by one.<br/><br/>These were the fire phoenixes of the Overlord level!<br/><br/>These were the powerhouses of the peak race!<br/><br/>They were dying rapidly one by one!<br/><br/>“Run, run, run! All the Fire Phoenixes, Run Now!”<br/><br/>“Pu!”<br/><br/>At the last moment, a fire Phoenix roared loudly at the disciples on the Flaming Planet!<br/><br/>Those disciples were the phoenixes who had yet to reach the Overlord realm.<br/><br/>They heard the screams and watched the experts of their race being killed from afar. Their bodies trembled violently.<br/><br/>“Run, run!”<br/><br/>They stepped into the teleportation formation in panic and left immediately!<br/><br/>In the surrounding area, all the experts’disciples looked at Wang Xian’s massacre with deep shock on their faces.<br/><br/>This was the Dragon King of the Dragon Palace.<br/><br/>Nearly 200 fire phoenixes were easily killed by him.<br/><br/>It was extremely terrifying!<br/><br/>Wang Xian could sense the fire phoenixes fleeing rapidly on the distant flaming star. He ignored them.<br/><br/>Those fire phoenixes that were below the level of a ruler could not be compared to these fire phoenixes that were at the level of a ruler.<br/><br/>Furthermore, in order to prevent the space beasts in the heart of the fire treasure land from suddenly going berserk, the fire phoenixes were prepared to escape immediately.<br/><br/>Therefore, even if Wang Xian flew over immediately, the fire phoenixes could still escape.<br/><br/>However, if they could escape, none of the Dominators could escape.<br/><br/>One by one, the fire phoenixes were killed by him easily until the last one.<br/><br/>There were a total of 201 corpses.<br/><br/>201 dominators.<br/><br/>They were all kept.<br/><br/>“Phew, this time, the Phoenix tribe has really offended them!”<br/><br/>Wang Xian killed all of them, and his eyes were sparkling.<br/><br/>He still felt a little pressure to kill these 201 fire phoenixes.<br/><br/>This pressure came from the entire Phoenix clan.<br/><br/>“If the Dragon Palace wants to rise up quickly, there is only one way to do so. Furthermore, the Phoenix clan and the Angel clan are enemies to begin with!”<br/><br/>Wang Xian clenched his fists, and a determined look appeared in his eyes.<br/><br/>He scanned his surroundings and flew straight towards a flaming star.<br/><br/>“Dragon King is awesome!”<br/><br/>“Dragon King is awesome!”<br/><br/>“Well done!”<br/><br/>At this moment, voices were heard from the surrounding. Following which, more and more voices were heard.<br/><br/>They were shouting loudly and their faces were filled with excitement.<br/><br/>When Wang Xian heard them, he smiled faintly.<br/><br/>“I want to use this teleportation formation!”<br/><br/>Wang Xian came to the front of a teleportation formation and said!<br/><br/>“Please, Dragon King. You can use it directly!”<br/><br/>The expert who was in charge of the teleportation formation said respectfully.<br/><br/>Wang Xian nodded. He stepped into the formation and disappeared immediately!<br/><br/>When he reappeared, he realized that he had teleported a long distance away.<br/><br/>He flew rapidly in the direction of the storm continent.<br/><br/>It had been more than 100,000 years. There should be a lot of metal meteorites stored in the storm continent.<br/><br/>It should be enough to upgrade the Tai Chi Dragon Plate and the five elements millstone.<br/><br/>Currently, the Tai Chi Dragon Plate and the five elements millstone were only comparable to the level four overlord realm.<br/><br/>He was still two levels away from his current strength!<br/><br/>“I wonder how many metal meteorites there are.”<br/><br/>Wang Xian mumbled as he flew rapidly in the air.<br/><br/>With his current strength as a master of the sixth level and his speed as a master of the seventh level, flying in the air was already very terrifying!<br/><br/>However, after Wang Xian left, the place where the heart of the fire treasure ground was in an uproar.<br/><br/>The group of strong disciples were arguing non-stop.<br/><br/>Very soon, a piece of news quickly spread to every strong person on the communication stone plate.<br/><br/>Including the experts of the peak races.<br/><br/>There were many messages, but some were quite popular!<br/><br/>“After hundreds of thousands of years, the Skyfire Patriarch made another breakthrough and reached the second level of universe dominator. However, he was killed by the experts of the Phoenix clan because they coveted his fortune and treasures!”<br/><br/>“Two fire phoenixes killed the Skyfire Patriarch and stole his treasures. Then, they saw the Dragon King and were killed by him. Almost 200 fire phoenixes at the level of universe Dominator attacked the Dragon King when they saw their experts killed. However, they didn’t expect that the Dragon King of the Dragon Palace had invincible strength and killed more than 200 fire phoenixes at the level of universe Dominator!”<br/><br/>“The Phoenix clan is extremely despicable. They killed the Skyfire Patriarch in order to seize the opportunity and then killed the Dragon King. However, the Dragon King killed them all. The Dragon King of the Dragon Palace seems to have the terrifying strength of A Level 6 universe Dominator!”<br/><br/>“Is this the pinnacle clan, the Phoenix Clan?”? The Skyfire Patriarch made another breakthrough, but it aroused the greed of the Phoenix clan. They killed the Skyfire Patriarch and deserved to be killed by the Dragon King. They supported the Dragon King. In the future, all the experts who obtained the opportunity should know the Phoenix clan’s face.”<br/><br/>One by one, the news spread crazily in the communication stone plate.<br/><br/>The contents of this communication stone plate were owned by all the disciples who had entered the starry universe and could see the contents.<br/><br/>When the other disciples saw the information, they were dumbfounded and shocked.<br/><br/>The Skyfire Patriarch made another breakthrough!<br/><br/>The Skyfire Patriarch was killed by the Fire Phoenix!<br/><br/>The Fire Phoenix wanted to kill the Dragon King!<br/><br/>The Dragon King killed all of them.<br/><br/>The Dragon King killed all of the 200 ruler-level fire phoenixes.<br/><br/>This information instantly made all the disciples boil.<br/><br/>Even the experts of the peak races were stunned when they saw this information!<br/><br/>“Is this true? How can the Dragon King of the Dragon Palace be so terrifying?”<br/><br/>“F * ck, the Skyfire Patriarch made another breakthrough?”? “The Skyfire Patriarch made another breakthrough in such a short time. But the experts of the Phoenix clan are too despicable. They want to take the opportunity of the Skyfire Patriarch. How despicable!”<br/><br/>“Never mind the strength of the Dragon King. Why does the peak race want to take the opportunity of the Skyfire Patriarch? Is it easy for the Skyfire Patriarch to cultivate until now?”? “Don’t tell me that once the powerful disciples of the high-level races break through, they will be hunted down by the peak races? “They will be killed and robbed of their treasures<br/><br/>“The opportunities of the nine-origin continent have always been occupied by the peak races. Now, we have risked our lives to come to the starry universe and finally obtain the opportunities. After that, we have become the stepping stones for the peak races, and the opportunities are taken away by the peak races?”<br/><br/>The moment the information from the flame heart land came out, it caused an intense shock!<br/><br/>This shock was unprecedented!\t\t\t\t\t\t</div>", "images": {}, "success": true}