{"id": 760, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073420.html", "title": "Chapter 3753 - 3753 3752 Took Action And Killed The Fire Phoenix", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3753 - 3753 3752 Took Action And Killed The Fire Phoenix</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3753 3752 took action and killed the Fire Phoenix<br/><br/>“Dragon King of the Dragon Palace?”<br/><br/>When the two fire phoenixes heard Wang Xian’s words, their faces darkened as they stared at him coldly.<br/><br/>Dragon King of the Dragon Palace.<br/><br/>Naturally, they had heard of this name before.<br/><br/>They even knew about some things in the invincible region.<br/><br/>At that time, a large number of disciples from the Fire Phoenix tribe besieged the Dragon King. In the end, they were all killed by him!<br/><br/>Upon hearing Wang Xian’s words and seeing his mocking expression, the two fire phoenixes looked extremely embarrassed.<br/><br/>They actually said publicly that they had killed him for the opportunity of the Skyfire Patriarch.<br/><br/>If this was publicized, it would indeed have a great impact on their fire Phoenix tribe.<br/><br/>“Dragon King of the Dragon Palace, do you know what you are talking about?”<br/><br/>A fire Phoenix stared at him with a face full of murderous intent.<br/><br/>“What am I talking about? I’m telling the truth, isn’t That So? There were so many strong disciples around who were watching. They were not deaf or blind. Everyone had their own opinions about what happened just now. Just this reason alone was enough to kill the Skyfire Patriarch who had obtained the opportunity with great difficulty. Hehe, is this the Phoenix Clan? I’ve seen it for myself!”<br/><br/>Wang Xian continued to speak, his eyes filled with mockery.<br/><br/>When the surrounding strong disciples heard that, their faces were filled with admiration.<br/><br/>Everyone had witnessed what had just happened clearly.<br/><br/>It was obvious that the fire Phoenix had killed someone to steal the treasure.<br/><br/>Otherwise, why would they keep the corpse after killing it?<br/><br/>It was too obvious!<br/><br/>At the same time, they also felt a sense of sorrow for the dead rabbit.<br/><br/>Regardless, the Skyfire Grandmaster had broken through to the Overlord realm from a high-level race due to the opportunity he had obtained. He had become an existence that many strong disciples of high-level races yearned for.<br/><br/>Then, because he had obtained a huge opportunity, he was killed by the experts of the Phoenix Race?<br/><br/>Because the fire Phoenix wanted to take his opportunity?<br/><br/>That was simply too tragic.<br/><br/>Just as the Dragon King of the Dragon Palace had said, the resources of the nine-origin universe were already occupied by the peak races. In the end, he risked his life to obtain a huge opportunity, but it was also snatched away by the experts of the peak races?<br/><br/>Who could accept this?<br/><br/>Today, it was the sky fire ancestor. If he were to obtain an opportunity tomorrow and be discovered by the peak races, would he be killed as well?<br/><br/>Although there was no fairness in the universe, the actions of the peak races made them feel a chill and horror!<br/><br/>“You are misleading everyone. Dragon King of the Dragon Palace, I think you are courting death!”<br/><br/>The faces of the two fire phoenixes darkened. They flapped their wings and roared with killing intent.<br/><br/>“Go to hell!”<br/><br/>One of the fire phoenixes flapped its wings and charged forward!<br/><br/>“Haha, I’ve Bewitched the masses. Fire Phoenixes, justice is in the hearts of the people. Your actions are no different from treating the strong disciples from the top races as ants. In the future, once a strong disciple from a high-level race obtains a great opportunity, I think you will also kill him and seize the opportunity. Your Phoenix race is really despicable!”<br/><br/>When Wang Xian saw a fire phoenix attacking him, his eyes were filled with disdain as he shouted loudly.<br/><br/>“Dragon King, be careful!”<br/><br/>“Oh no, Dragon King, this is going to be troublesome. The strength of these two fire phoenixes is extremely terrifying!”<br/><br/>“Oh no, although the Dragon King is very strong, he is definitely not a match for the fire phoenixes. Currently, the Dragon Palace has yet to reach the peak of their race!”<br/><br/>When the Fire Phoenix launched its attack, some of the strong disciples could not help but discuss.<br/><br/>This time, they stood beside the Dragon King.<br/><br/>Everything just happened as the Dragon King had said.<br/><br/>This made every strong disciple feel very aggrieved.<br/><br/>Could it be that the strong disciples of the high-level races did not have the time to stand out?<br/><br/>Could it be that they had obtained the opportunity to become the wedding dress for the peak race?<br/><br/>At this moment, all the strong disciples hoped that the Dragon King could escape from this place as soon as possible.<br/><br/>“You are deceiving the masses with your evil words and slandering my Phoenix race. Today, I will kill you, the Puny Dragon King!”<br/><br/>When the Fire Phoenix who was charging over heard the sounds around him, his eyes were filled with a violent killing intent.<br/><br/>“CHIRP CHIRP!”<br/><br/>He let out a phoenix cry. A ball of flames gathered in front of him and rushed towards Wang Xian.<br/><br/>“Do you really think that I am the Skyfire Patriarch and that I am at Your Mercy?”<br/><br/>Wang Xian looked at his attack with a cold expression on his face.<br/><br/>Buzz<br/><br/>In the next moment, before the Phoenix Flames could reach him, he had already disappeared.<br/><br/>Wang Xian’s figure appeared beside the Phoenix.<br/><br/>It was only a dozen meters away.<br/><br/>“Brother Ming, be careful!”<br/><br/>When the other fire Phoenix saw Wang Xian appearing beside his companion in a strange manner, his pupils contracted slightly and he shouted loudly in a hurry!<br/><br/>“I have been stating a fact all this while. However, you guys want to kill me. Then, die!”<br/><br/>Wang Xian stared at the fire phoenix beside him. His arm turned into a dragon claw and instantly entered the fire Phoenix’s body!<br/><br/>“What!”<br/><br/>“How is this possible?”<br/><br/>The body of the fire phoenix that was attacked trembled violently. His eyes widened and were filled with disbelief.<br/><br/>Why did the Dragon King of the Dragon Palace appear beside him in an instant?<br/><br/>Why couldn’t he sense his speed?<br/><br/>He was an existence at level three of the Universe Dominator!<br/><br/>A level three being who couldn’t even sense the speed of the Dragon King. How Strong was he?<br/><br/>How Strong was he?<br/><br/>A level five universe overlord?<br/><br/>“Pu!”<br/><br/>However, he didn’t have time to think too much. He could feel the life force in his body rapidly draining away!<br/><br/>“AH, Phoenix Pan!”<br/><br/>Sensing the approaching death, he roared with all his might!<br/><br/>“HMPH!”<br/><br/>However, a cold snort entered his mind, and a violent tremor formed in his body.<br/><br/>He felt his breathing become sluggish and his energy went out of control. His consciousness gradually became blurry!<br/><br/>“I am not someone that a small fire phoenix like you can kill.”<br/><br/>Wang Xian stared at him with a cold expression. With a wave of his arm, his body disappeared instantly!<br/><br/>In the next moment, he attacked another fire Phoenix!<br/><br/>“How dare you! How dare you kill an expert of my Phoenix Clan? Dragon King of the Dragon Palace, you are courting death. You are completely courting death. My Phoenix clan will definitely exterminate your Dragon Palace!”<br/><br/>The other fire Phoenix saw this scene and saw Wang Xian attacking him. It roared furiously with a face full of shock and anger!<br/><br/>This Dragon King of the Dragon Palace had actually killed a companion of the same level as him in an instant!<br/><br/>He had killed a fire phoenix at the third level of the universe dominator.<br/><br/>The third level of the universe dominator. Their strength was already very strong.<br/><br/>However, this Dragon King was actually able to kill him in an instant.<br/><br/>How Strong was the Dragon King?<br/><br/>And what level was the Dragon King at?<br/><br/>“Hiss, this… this… that fire Phoenix was actually killed in an instant by the Dragon King!”<br/><br/>“Killed in an instant? What kind of strength is the Dragon King, how can he be so terrifying?”<br/><br/>“Too strong, simply too strong. He’s the ruler of a third level fire Phoenix, and the Dragon King is also a ruler? He’s even more terrifying than before!”<br/><br/>At this moment, a shocking voice rang out from the surrounding area.<br/><br/>All the strong disciples stared blankly.<br/><br/>He had instantly killed a fire phoenix that was a ruler of a level three realm.<br/><br/>Was this the Dragon King?\t\t\t\t\t\t</div>", "images": {}, "success": true}