{"id": 767, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073434.html", "title": "Chapter 3760 - 3760 The Fury Of The Phoenix Clan!", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3760 - 3760 The Fury Of The Phoenix Clan!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3760 The Fury of the Phoenix Clan!<br/><br/>Boom<br/><br/>“Damn Dragon King! He killed an expert of the Phoenix clan! He is courting death!”<br/><br/>In the World Passage, a fire Phoenix whose body was covered in flames roared coldly!<br/><br/>According to the news from the disciples, the 201 fire phoenixes in the hotheart land had all been killed by the Dragon King of the Dragon Palace.<br/><br/>This was definitely the greatest loss to their Phoenix clan since the last calamity.<br/><br/>It was also the first time they had suffered such a loss.<br/><br/>Over 200 universe ruler level experts, these were experts that their Phoenix clan had spent a large amount of resources to nurture.<br/><br/>They actually lost over 200 of them in one go!<br/><br/>The Phoenixes’expressions were abnormally ugly!<br/><br/>“I didn’t expect, I really didn’t expect that Dragon King’s strength could actually kill a level 6 universe dominator.”<br/><br/>Not far away, the Green River Phoenix frowned when she heard this news.<br/><br/>The Dragon King’s strength had completely exceeded her expectations.<br/><br/>More than 100,000 years ago, he had plotted with the Angel Race’s third Prince to kill the Dragon King.<br/><br/>At that time, even though the Dragon King was invincible in the invincible zone, she did not take him to heart.<br/><br/>Because, even if you had the strength of a level two or even level three universe dominator, in her eyes, you could still be killed easily.<br/><br/>But Now?<br/><br/>That Dragon King actually had the strength to kill a level six universe dominator.<br/><br/>This was a little terrifying!<br/><br/>Especially the speed of his growth.<br/><br/>With this speed, would he soon reach the seventh, eighth, or even ninth level?<br/><br/>If that was the case, it would be terrifying!<br/><br/>Too terrifying!<br/><br/>She suddenly felt that the ant in her eyes had already grown into a huge beast.<br/><br/>And it was an extremely powerful huge beast, one that was enough to cause their Phoenix clan to suffer heavy losses.<br/><br/>“Elder, not only this matter, within the communication stone plate, that group of reckless high level races actually slandered our Phoenix clan.”<br/><br/>Beside him, a Phoenix spoke to the fire Phoenix in the center, his expression extremely ugly.<br/><br/>The public opinion within the communication stone plate was too strong, even the universe AI had some information appearing.<br/><br/>It wouldn’t be long before the entire nine-origin universe knew about this.<br/><br/>This would greatly affect the reputation of the Phoenix clan.<br/><br/>“We don’t need to care about the information of those ants. The most important thing now is to kill that Dragon King.”<br/><br/>The elder of the central Phoenix clan growled with a gloomy face.<br/><br/>This matter was a huge humiliation and loss to the Phoenix clan.<br/><br/>The Dragon King of the Dragon Palace had killed more than 200 of their ruler-level experts. They had to take revenge!<br/><br/>“Elder, the Dragon King already has the strength of a ruler-level expert. We will send people to the Dragon Palace to destroy it now.”<br/><br/>A Phoenix said with a face full of killing intent!<br/><br/>The Dragon King’s strength had obviously reached the ruler-level, which meant that the Dragon Palace had completely entered the ranks of the peak races.<br/><br/>Then they could directly send experts to destroy the Dragon Palace.<br/><br/>They didn’t need to care about some rules anymore!<br/><br/>“I’ll inform the other elders about this matter and ask them to go there personally to destroy the Dragon Palace.”<br/><br/>The elder in the center said with a murderous aura.<br/><br/>The group of fire phoenixes nodded slightly.<br/><br/>“Elder, I’ve received news on my side. Some of the information in the communication stone plate was deliberately slandered by that group of high-level races. It was the Dragon King of the Dragon Palace who first provoked the members of our Phoenix clan, so the experts of our Phoenix clan attacked him. That Dragon King had long planned it!”<br/><br/>A fire Phoenix reported to the Elder.<br/><br/>“Eh? The Dragon King deliberately wants to be enemies with our Phoenix Clan?”<br/><br/>Elder Phoenix’s eyes turned cold as he said in a cold voice!<br/><br/>“Because of the Green River Water Phoenix, our Phoenix clan has long been enemies with the Dragon King of the Dragon Palace. This time, he must be taking revenge on purpose!”<br/><br/>The Fire Phoenix said as he looked to the side.<br/><br/>The Green River Water Phoenix frowned slightly.<br/><br/>“Elder, in the past, I sent some disciples to kill him in the invincible zone. But I didn’t expect that an ant like him could grow to such an extent.”<br/><br/>The Green River Water Phoenix saw the elder looking at her and immediately replied!<br/><br/>“No matter what, the Dragon King must die. If you want to kill the Dragon King, I’ll teach you. Go into the starry universe and kill the Dragon King.”<br/><br/>The Fire Phoenix Elder ordered the Green River Water Phoenix.<br/><br/>“Yes, Elder!”<br/><br/>The Green River Water Phoenix’s expression was a little ugly, and she nodded with a cold face.<br/><br/>She was a water phoenix at the seventh level of the ruler realm, and she could completely enter the starry universe!<br/><br/>The Green River Water Phoenix was relatively talented, and she also had a large background. She originally didn’t want to enter the starry universe.<br/><br/>After all, the dangers inside were rather high and she did not lack resources.<br/><br/>But now, she had no choice but to enter because this matter had a lot to do with her.<br/><br/>“Dragon King of the Dragon Palace!”<br/><br/>A hint of viciousness flashed across her eyes.<br/><br/>She had never expected that an ant that used to be an ant would need to be dealt with by herself now.<br/><br/>…<br/><br/>Wang Xian did not know about the matter on the communication stone plate for the time being. When he was flying in the starry universe, he had already given an order to an lie, Prime Minister Gui, and the rest.<br/><br/>Transfer the Dragon Palace!<br/><br/>He would rely on the Void Pagoda to transfer the Dragon Palace!<br/><br/>He would first transfer the Dragon Palace to a secret place in the nine-origin universe before making a decision later.<br/><br/>Wang Xian had originally planned to transfer the Dragon Palace to the nine-origin universe. However, after hesitating for a moment, he gave up.<br/><br/>The changes in the starry universe were even greater. The nine-origin universe was so big. With an Lie’s void pagoda to transfer the Dragon Palace, it was very easy to find a secret place.<br/><br/>Even experts from peak races were hard to find.<br/><br/>After giving orders to the Dragon Palace, he quickly flew toward the storm continent.<br/><br/>Because of the teleportation and his speed, it didn’t take long for him to arrive at the front of the storm continent.<br/><br/>He quickly flew over and arrived at the place where the meteorite was flying. He glanced over and smiled.<br/><br/>Everything was calm.<br/><br/>He looked towards the location of the storm on the windstorm continent. An extremely terrifying space beast was flying towards a metallic meteorite at high speed and devouring it in one gulp.<br/><br/>“The fourth level of a universe overlord.”<br/><br/>He swept his gaze over and thought to himself. Then, he swept his gaze over the space beasts.<br/><br/>The strongest space beasts of this race should be around the sixth or seventh level of a universe overlord.<br/><br/>After all, this place did not belong to the center of the universe.<br/><br/>Even so, this group of space beasts was still not something that the current Wang Xian could contend against.<br/><br/>Right now, he could only kill space beasts at the third level of the Dominator realm.<br/><br/>It would be difficult for him to fight against a fourth level dominator.<br/><br/>After all, his strength was suppressed by three levels!\t\t\t\t\t\t</div>", "images": {}, "success": true}