{"id": 762, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073424.html", "title": "Chapter 3755 - 3755 3754. The Battle Between Dragons And Phoenixes", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3755 - 3755 3754. The Battle Between Dragons And Phoenixes</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3755 3754. The battle between dragons and Phoenixes<br/><br/>The commotion in the vicinity of the heart of fire treasure ground had attracted the attention of all the strong disciples.<br/><br/>They were staring at the area and fixed their eyes on it.<br/><br/>They were staring at the attack that was heading towards the Dragon Palace.<br/><br/>Was the Dragon King about to fall?<br/><br/>How could they defend against that terrifying attack?<br/><br/>“I don’t care what race you are or what your background is. As long as you want to kill me, I will kill him. If you want to destroy my Dragon Palace, I will destroy him!”<br/><br/>Wang Xian swept his gaze across them and looked at the flaming wings that were attacking him.<br/><br/>He extended his palm and immediately transformed it into a dragon claw.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The next moment, an earth-shattering roar was heard.<br/><br/>Wang Xian had transformed into a divine dragon!<br/><br/>He had the body of a gigantic divine dragon and had a leaf that blocked his vision. From the outside world, he looked like an Azure Dragon.<br/><br/>However, there was a pair of strange wings on his back. The energy on these wings was a little violent!<br/><br/>Boom<br/><br/>Wang Xian’s Dragon Claw landed directly on the flaming feathers. A wave of energy extinguished the flames immediately!<br/><br/>“What?”<br/><br/>When the fire Phoenix saw that Wang Xian had actually blocked his attack, he was slightly stunned. His face was filled with shock.<br/><br/>This attack was at the level of a level six overlord of the universe!<br/><br/>However, it was blocked by the Dragon King of the Dragon Palace.<br/><br/>What did this mean?<br/><br/>It meant that the Dragon King of the Dragon Palace also possessed the strength of a level six overlord.<br/><br/>“The ones who will die are all of you!”<br/><br/>Wang Xian stared at them. His eyes were filled with rage.<br/><br/>“Soaring clouds!”<br/><br/>“Eight Dragon Pillars!”<br/><br/>Wang Xian let out a low growl and instantly cast his law projection!<br/><br/>The surroundings were instantly shrouded in clouds and mist. With the violent flapping of the inoriginator holy wings, Wang Xian’s figure disappeared instantly!<br/><br/>“Be careful, this Dragon King’s strength is at level six of the Universe Dominator!”<br/><br/>When the Fire Phoenix, who was at level six of the Universe Dominator, saw this scene, his pupils constricted slightly as he roared loudly!<br/><br/>“Bang!”<br/><br/>“Ahhhh!”<br/><br/>However, in just an instant, screams of agony were heard!<br/><br/>Wang Xian’s speed was already comparable to the ruler of level seven. Among this group of Phoenixes, only one was at the ruler of level six while the rest were below the ruler of level six.<br/><br/>Furthermore, there were a few who were at the ruler of level one and level two!<br/><br/>They surrounded Wang Xian, but when faced with Wang Xian’s counterattack, they had no time to react!<br/><br/>The dragon tail swept out, and the fire phoenixes were instantly killed!<br/><br/>“Damn it, activate the domain space!”<br/><br/>The Fire Phoenix, who was at level six, roared immediately.<br/><br/>“Fire Phoenix World!”<br/><br/>He continued to roar wildly. Streams of flames rose into the surroundings instantly.<br/><br/>The terrifying flames seemed to cover the entire space.<br/><br/>“Fire Phoenix World!”<br/><br/>“Fire Phoenix World!”<br/><br/>The other fire phoenixes heard this and hurriedly shouted.<br/><br/>Their voices trembled slightly.<br/><br/>They didn’t expect that this Dragon King actually had the strength of a ruler at the sixth stage and instantly killed four or five of their fire phoenixes!<br/><br/>The fire phoenixes instantly unleashed their strongest techniques.<br/><br/>A domain was the symbol of a ruler-level expert.<br/><br/>Once a domain was activated, one’s strength would increase exponentially.<br/><br/>In a domain, one was the ruler!<br/><br/>The only one who wanted to deal with a domain was a domain!<br/><br/>“Hehe, with just you guys? All of you will die today!”<br/><br/>Wang Xian glanced at them with disdain and his body trembled slightly.<br/><br/>Nine Origins Dragon Domain<br/><br/>Buzz<br/><br/>In an instant, the entire battlefield underwent a huge change!<br/><br/>The energy began to distort and flames shot out in all directions. It was as if this place had become a separate world!<br/><br/>In the surrounding area, a group of expert disciples flew backwards with faces full of shock.<br/><br/>“This… The Dragon King’s strength is so strong. The Dragon King was actually able to withstand the attack of a ruler-level rank six fire Phoenix. Is this the Dragon King’s strength?”<br/><br/>“Hiss, the Dragon King’s strength isn’t weaker than a ruler-level rank six!”<br/><br/>“Oh my God, a few more fire phoenixes have been killed by the Dragon King!”<br/><br/>The group of expert disciples who were flying backward shouted in shock!<br/><br/>A hundred thousand years ago, although the Dragon King was called Invincible, he was only below the ruler-level.<br/><br/>At most, he could only kill a level one ruler-level existence.<br/><br/>Now?<br/><br/>In just a hundred thousand years, he had the strength of a level six ruler-level existence?<br/><br/>Wasn’t this too insane?<br/><br/>How could an expert break through so quickly?<br/><br/>“Hiss!”<br/><br/>The sudden outbreak of a huge battle and the sensing of Wang Xian’s strength caused the group of Godly Tigers on the flaming star not far away to take in a breath of cold air.<br/><br/>The other experts from the peak races around also trembled. They were filled with disbelief!<br/><br/>“Could it be that the Dragon King obtained the inheritance of the water god Dragon at his peak?”<br/><br/>“There’s only one explanation. Only the Dragon King obtained the inheritance of the water god Dragon. Otherwise, he wouldn’t be able to break through so quickly!”<br/><br/>The Godly Tigers roared in a low voice!<br/><br/>There was only one explanation!<br/><br/>To be able to raise his strength to such an extent in over a hundred thousand years was simply terrifying.<br/><br/>It was an incredible existence even among the peak races.<br/><br/>There could only be one explanation for this, and that was that the Dragon King had obtained the inheritance of the water god Dragon Lord.<br/><br/>The Divine Dragon Clan had supreme experts!<br/><br/>At its peak, the Divine Dragon Clan was also a relatively powerful existence among the peak races.<br/><br/>It was because the Divine Dragon Clan had an existence at the heavenly yuan creation level back then.<br/><br/>It was also because the Divine Dragon Clan had an existence at the Heavenly Yuan creation level. The Divine Dragon clan was known as the king of the water clan, the overlord of the ocean!<br/><br/>Once the dragon’s might was unleashed, all the water clan members submitted!<br/><br/>The Dragon King might have obtained the inheritance of that person!<br/><br/>“CHIRP CHIRP CHIRP!”<br/><br/>“Not good, our Senior Luan and the others have encountered an expert. Go over immediately!”<br/><br/>“Stop cultivating for the time being and go over immediately to provide support.”<br/><br/>At the same time, on a planet occupied by a group of fire phoenixes not too far away, a large number of fire phoenixes were cultivating.<br/><br/>Some of them were at the ruler level, but 80% of them were below the ruler level.<br/><br/>When the nearly 200 ruler level fire phoenixes saw the situation here, they flapped their enormous flaming wings and immediately flew over.<br/><br/>A phoenix cry sounded!<br/><br/>“Who dares to provoke US fire phoenixes? Are you courting death?”<br/><br/>“Which peak race’s powerhouse?”<br/><br/>Many fire phoenixes who had been cultivating in seclusion did not know what was happening in front of them. All of them roared with murderous intent!<br/><br/>“Overlord level six, I’ll Kill You First!”<br/><br/>At the same time, they were located in various domains. When the Fire Phoenix World and the nine-origin Dragon Domain appeared, it was as if they were in a special world!<br/><br/>In this world, there was Wang Xian’s domain and the Fire Phoenix World.<br/><br/>When the domain collided with the domain, a special energy burst out!<br/><br/>Wang Xian could sense that his domain was resisting against their domain.<br/><br/>His gaze locked onto the fire Phoenix that was at the level six of the Overlord realm. In an instant, he charged towards him!<br/><br/>The incorporeal holy wings burst out with all its power. At the same time, four Netherspirit avatars appeared beside him.<br/><br/>He wanted to kill this master of the sixth level, the Fire Phoenix!\t\t\t\t\t\t</div>", "images": {}, "success": true}