{"id": 776, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073452.html", "title": "Chapter 3769 - 3769 3768 Started Its Attack", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3769 - 3769 3768 Started Its Attack</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3769 3768 started its attack<br/><br/>Boom! Boom<br/><br/>As soon as Wang Xian finished his sentence, a wave of energy covered him. The crushing force of the energy caused his body to collapse.<br/><br/>“Ah!”<br/><br/>The angel who was at the level-five realm let out another desperate scream.<br/><br/>This time, he had no chance of resurrection.<br/><br/>Wang Xian waved his arm and casually kept the corpse. He looked at the other six angels.<br/><br/>“Run!”<br/><br/>The other six angels screamed in horror and despair. They wanted to escape immediately!<br/><br/>The body of one of the angels slowly disappeared. It was obvious that there was a treasure that could allow them to escape instantly.<br/><br/>Wang Xian looked over. With a wave of his arm, the force of wind and thunder instantly landed on their bodies.<br/><br/>“Explode!”<br/><br/>Five of the Angels were instantly severely injured and died in the terrifying explosion of wind and thunder.<br/><br/>The remaining one spat out a mouthful of blood and disappeared!<br/><br/>“Hehe, can you escape?”<br/><br/>Wang Xian laughed mockingly. He could sense that the last angel that escaped was ten minutes away from him.<br/><br/>However, he didn’t need ten minutes.<br/><br/>“Netherdragon’s pursuit!”<br/><br/>Wang Xian closed the primaless saint wings behind him. A surge of darkness energy was used from his body.<br/><br/>In the next moment, his figure slowly disappeared.<br/><br/>The Netherworld Dragon’s pursuit. This was the first time Wang Xian had used this law form.<br/><br/>The Netherworld Dragon’s pursuit was different from the Netherworld Dragon’s transformation. With the transformation of the Netherworld Dragon, he could instantly arrive at the location of the Netherworld Ghost Avatar and replace it.<br/><br/>As for the Netherworld Dragon’s pursuit, as long as he injected his energy into the enemy’s body, he could instantly arrive at the enemy’s side.<br/><br/>“Hu hu Hu!”<br/><br/>In the same area of the Void, the angel who had escaped was panting heavily. His eyes were filled with fear and relief.<br/><br/>“Damn it, that Dragon King is so terrifying. How did the third prince provoke such an enemy?”<br/><br/>He cursed angrily with an embarrassed expression. His body moved and he prepared to escape.<br/><br/>However, he suddenly widened his eyes and stared at the spot beside him in disbelief.<br/><br/>Beside him, a figure slowly materialized.<br/><br/>That was the Dragon King of the Dragon Palace!<br/><br/>“How is this possible!”<br/><br/>He roared in disbelief.<br/><br/>Crack! Crack<br/><br/>However, before he could make a move, he was grabbed by the neck and was strangled.<br/><br/>“You can’t escape!”<br/><br/>“Soul Catcher!”<br/><br/>Wang Xian used the soul catcher’s power. His body trembled and his pupils started to dilate!<br/><br/>“Bang!”<br/><br/>A few minutes later, Wang Xian waved his arm and killed the soul catcher and kept him in the mother nest.<br/><br/>“The harvest is not bad. Moreover, some of the powerhouses of the Angel clan are unhappy about the third Prince’s matter. Hehe.”<br/><br/>A smile appeared on his face as he absorbed the information obtained from the soul catcher. The corners of his mouth curled up slightly.<br/><br/>The Angel clan had become enemies with the Dragon Palace for no reason, which made some masters of the ruler realm a little unhappy.<br/><br/>Seven Angels, the highest level of the ruler realm was level five. His corpse could bring 100,000 peak venerables to the Dragon Palace!<br/><br/>100,000 was a huge number!<br/><br/>There were also some resources, some treasures, and three innate supreme treasures.<br/><br/>One of the innate treasures was very useful. It was a mirror with the light attribute.<br/><br/>It could retrace the happenings in a space, and it could give chase to the living beings.<br/><br/>This was a supportive innate treasure. It was comparable to the chasing ability of a powerful wizard.<br/><br/>“Next, it’s time to change to another place. It’s time to change to the Phoenix clan.”<br/><br/>Wang Xian moved and flew forward at a terrifying speed. He disappeared into the starry sky quickly.<br/><br/>When the seven experts of the Angel clan died, the Angel clan immediately received news of their deaths.<br/><br/>This caused some of the experts of the Angel clan to frown slightly.<br/><br/>“They are carrying out the orders of the third prince. It should be related to the Dragon King of the Dragon Palace.”<br/><br/>“Maybe they were killed by the Dragon King of the Dragon Palace!”<br/><br/>A few level 7 rulers were chatting in the communication stone plate, and they passed the news to the third prince.<br/><br/>“Eh?”<br/><br/>When the third Prince received the news, his face turned ugly.<br/><br/>Seven experts of the Angel clan had been killed.<br/><br/>Among them, there was a level 5 ruler.<br/><br/>And 70% of their deaths were caused by the Dragon King.<br/><br/>The Dragon King had formed a feud with the Angel Clan because of his third prince.<br/><br/>In the end, it was his fault.<br/><br/>“Damn it, we have to kill the Dragon King as soon as possible!”<br/><br/>The third prince growled with an ugly expression.<br/><br/>He could feel that some experts of the Angel clan were unhappy with him.<br/><br/>Although he was the Prince of the angel race, his influence in the angel race was inferior to that of an elder.<br/><br/>The descendants of some elders, some other powerhouses and even the angel of darkness were naturally unhappy with him provoking an enemy and implicating the angel race.<br/><br/>Wang Xian did not know that the third prince was furious from embarrassment. He flew deeper into the sky for a few months based on the map he obtained. When he came to the top of a meteorite, he took out his communication stone plate, he sent a message to the Phoenix clan.<br/><br/>Similarly, this message was given to them as an expert from a high-level race in the universe.<br/><br/>After sending the message, Wang Xian began to wait quietly.<br/><br/>The Phoenix clan did not know what happened to the Angel clan.<br/><br/>The Angel clan could not say that an expert from their side had been killed by the Dragon King of the Dragon Palace. They would either spread the news or tell the Phoenix clan about it.<br/><br/>They would keep such matters a secret!<br/><br/>After he sent the news over, the Phoenix clan quickly sent their experts over.<br/><br/>Two level two masters of the universe, two water phoenixes.<br/><br/>More than ten days later, Wang Xian saw the appearance of these two water phoenixes and instantly flew over to absorb their souls.<br/><br/>The water phoenixes, who were masters of level two, could not put up any resistance at all.<br/><br/>After taking care of the two water phoenixes, Wang Xian still ordered them to send a message to the clan.<br/><br/>It was a message about being ambushed by the powerhouses of the Dragon Palace.<br/><br/>The difference was that they said that they were attacked by the other party, but they were still struggling to hold on!<br/><br/>“Hang in there. We will send the powerhouses closest to you to reinforce them immediately and kill those damn fellows of the Dragon Palace!”<br/><br/>A message was sent to the Phoenix clan immediately.<br/><br/>“Very good. Killing the experts from My Dragon Palace? I want to see who killed who.”<br/><br/>Wang Xian looked at the message sent by the Phoenix clan’s experts. His eyes were filled with a cold expression.<br/><br/>He wanted to play with the Phoenix clan this time.<br/><br/>With the soul capturing technique, Wang Xian could obtain a lot of information about them.<br/><br/>With this information, he wanted to see who would kill who.<br/><br/>Over a thousand years, they had killed more than a hundred disciples of the Dragon Palace.<br/><br/>However, he only needed to kill two masters at the second level to earn it.<br/><br/>He wanted to see who would be the first one to succumb in the end!<br/><br/>“Act real and attack me!”<br/><br/>Wang Xian ordered the two phoenixes who were controlled by the soul capturing technique.\t\t\t\t\t\t</div>", "images": {}, "success": true}