{"id": 777, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073454.html", "title": "Chapter 3770 - 3770 3769 Aurora Domain, Targeting The Angel Clan’S Experts", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3770 - 3770 3769 Aurora Domain, Targeting The Angel Clan’S Experts</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3770 3769 Aurora Domain, targeting the Angel clan’s experts<br/><br/>“Over here, in this starry sky, I can already sense the aura of our Phoenix clan’s experts.”<br/><br/>In a stretch of void space, over ten phoenixes were rapidly flying over here.<br/><br/>Phoenixes were divided into three types, golden, water, and fire phoenixes. Over ten phoenixes were rapidly flying over here.<br/><br/>Soon, they saw seven to eight divine dragons surrounding the two experts of their Phoenix race.<br/><br/>The entire space was enveloped by the divine dragons. The two experts of their Phoenix race were struggling to hold on.<br/><br/>“Eh? Two experts of our Phoenix race are trapped?”<br/><br/>One of the water phoenixes stared at the battlefield in front of them. His eyes focused and revealed a cold expression.<br/><br/>“Can you see the strength of those divine dragons clearly?”<br/><br/>One of the fire phoenixes frowned and asked.<br/><br/>“I can’t sense their exact strength. However, according to the Yi San’s energy, they should be at the second stage of the ruler realm. Attack and kill these divine dragons. They are courting death. How dare they ambush the experts of our Phoenix Clan?”<br/><br/>One of the Golden Phoenixes roared with killing intent.<br/><br/>“Destroy the powerhouses of the Dragon Palace. That Dragon King actually dared to kill the powerhouses of our Phoenix clan. Let them die.”<br/><br/>The dozen of Phoenixes didn’t hesitate at all. They charged straight into the battlefield.<br/><br/>“Hehe!”<br/><br/>On the battlefield, Wang Xian used his energy to condense into the form of a divine dragon to besiege the two phoenixes whose souls had been absorbed by him.<br/><br/>Upon seeing their arrival, a cold smile appeared on his face.<br/><br/>Boom<br/><br/>With a wave of his arm, he killed the two phoenixes directly. A destructive force of the five elements swept towards the dozens of phoenixes.<br/><br/>“Eh? What?”<br/><br/>“Not good!”<br/><br/>The sudden change in the battlefield caused the dozens of phoenixes who flew over to support him to be slightly shocked. Their faces revealed a look of horror.<br/><br/>As they felt the energy that was attacking them and the two phoenixes who were killed instantly, they had a bad premonition in their hearts.<br/><br/>“This is an ambush. Run!”<br/><br/>A Golden Phoenix that was at the level five Overlord realm roared in fear. He flapped his golden wings and tried to flee into the distance.<br/><br/>“Crash!”<br/><br/>“All of you can stay here!”<br/><br/>Wang Xian flapped his divine wings and appeared at the position where they had to retreat. With a wave of his arm, the five elements millstone enveloped them.<br/><br/>The Five Elements Millstone, which had already reached the level of a dominator at level six, expanded and enveloped the sky of more than ten fire phoenixes.<br/><br/>The terrifying millstone emitted a force that made the more than ten phoenixes feel despair!<br/><br/>“It’s the Dragon King of the Dragon Palace! It’s the Dragon King!”<br/><br/>The more than ten fire phoenixes sensed the despair energy coming from above and felt the destructive force washing over their bodies. The Golden Phoenix burned his life force in fear as he resisted this attack.<br/><br/>Around him, seven to eight Phoenixes had already lost their life force.<br/><br/>Only a few of them, who were at the fourth or fifth level, were holding on.<br/><br/>“That’s right, it’s me!”<br/><br/>Wang Xian sneered. He pressed down with his palm and the five elements millstone fell from above.<br/><br/>“Ahhhh, our Phoenix clan will not let you off!”<br/><br/>Miserable cries rang out. Wang Xian did not show any signs of being affected.<br/><br/>The last five phoenixes were easily killed by him.<br/><br/>“Eh?”<br/><br/>However, he soon noticed that some of the Phoenixes didn’t die completely due to their life-saving treasures. They must have been resurrected somewhere.<br/><br/>This feeling came from the power of the incipient holy wings.<br/><br/>The Void Lock of the incipient holy wings could give him a vague feeling.<br/><br/>However, he didn’t pay too much attention to the resurrection of the Phoenixes.<br/><br/>He had killed two rulers at the fifth stage and four world-level phoenixes. He had gained quite a lot this time.<br/><br/>He put away the corpses and flew in a certain direction.<br/><br/>The two peak races should be able to guess what had happened to the angel race and the Phoenix race.<br/><br/>It would be difficult to kill the experts of the two peak races in this way.<br/><br/>He needed to find another way.<br/><br/>“CHIRP CHIRP CHIRP!”<br/><br/>At the same time, in the 9-origin universe, a holy domain covered by the Wutong Divine Tree, flames, rivers, and Golden Mountains were all emitting a majestic energy.<br/><br/>On a Wutong divine tree, a young fire Phoenix emerged from its shell and let out an angry cry.<br/><br/>This fire Phoenix looked as if it had just been born, but its eyes were filled with anger and hatred.<br/><br/>He flapped his wings and a universe ai appeared. He immediately sent a message.<br/><br/>“Huala!”<br/><br/>Soon, an enormous fire phoenix flew over and hovered above the fire Phoenix.<br/><br/>“Elder, it was the Dragon King who killed me. It was the Dragon King. The rescue in the starry universe was a trap set by the Dragon King of the Dragon Palace. More than ten of our powerhouses were killed by the Dragon King!”<br/><br/>He reported to the fire Phoenix Elder who was in the sky with a face full of anger.<br/><br/>“Okay.”<br/><br/>A hint of coldness flashed across the eyes of the fire Phoenix Elder as he nodded his head.<br/><br/>…<br/><br/>After hunting down the experts of the Phoenix and Angel Race, Wang Xian had already thought of what kind of existence the dragon palace would have to face in the future.<br/><br/>However, since he had made his move, he didn’t regret it.<br/><br/>He flew quickly in the starry universe.<br/><br/>His target was the Aurora Domain!<br/><br/>The Aurora Domain was another treasure trove discovered by a group of strong disciples in the nine-origin universe. Although it was not as strong as the Flame Heart Treasure Trove, it was also a treasure trove for the cultivation of light and darkness elemental experts.<br/><br/>Wang Xian obtained some information from the memories of the strong disciples of the angel race.<br/><br/>There were strong disciples of the angel race cultivating there.<br/><br/>In terms of hatred, the Angel clan was ranked ahead of the Phoenix clan.<br/><br/>All along, it was the third prince who sent his subordinates to deal with the Dragon Palace.<br/><br/>The Aurora Domain was already located in a deeper part of the starry universe!<br/><br/>Wang Xian flew for a few years before he reached the front of the laser domain.<br/><br/>This was a very special starry domain. Numerous special meteorites filled this space.<br/><br/>These meteorites emitted special energy, and the energy between the meteorites was different.<br/><br/>Because of the collision of the special energy, this space had a special change.<br/><br/>The light here seemed to be material. There were black light and white light.<br/><br/>Two kinds of light interweaved the entire space.<br/><br/>And these two kinds of light belonged to the light and darkness power.<br/><br/>These light rays could be absorbed. This was comparable to directly absorbing divine stones for cultivation.<br/><br/>To the experts with the light and darkness attributes, this place was heaven.<br/><br/>After this place was discovered, a large number of experts with the light and darkness attributes came here to cultivate.<br/><br/>There were even two existences in the ruler realm born here.<br/><br/>Wang Xian looked at the special spatial domain in front of him. His eyes sparkled as the power of darkness rose from his body and flew into it.<br/><br/>After entering the domain, Wang Xian waved his arm and realized that he could hold the energy of light and darkness in his hand. It looked unusually mystical.<br/><br/>He had a thought and absorbed it before he continued flying forward.\t\t\t\t\t\t</div>", "images": {}, "success": true}