{"id": 774, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073448.html", "title": "Chapter 3767 - 3767 3766, Let’S Go", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3767 - 3767 3766, Let’S Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3767 3766, let’s go<br/><br/>“Prime Minister Gui, what’s the current situation in the past 1,000 years?”<br/><br/>Wang Xian took out his communication stone plate and sent a message to Prime Minister Gui.<br/><br/>“Dragon King, currently, around 500,000 disciples of the Dragon Palace have entered the starry universe. In the past 1,000 years, more than 100 disciples have been killed by the powerhouses of the Angel clan and the Phoenix Clan.”<br/><br/>“Dragon King, I have discovered a problem. When the angel and Phoenix clans encountered the pure-blooded divine dragon of our Dragon Palace, they didn’t kill him directly. Instead, they wanted to capture him alive.”<br/><br/>Prime Minister GUI reported back.<br/><br/>“HMM?”<br/><br/>Wang Xian’s eyes flickered slightly.<br/><br/>Over 1,000 years, more than 100 disciples of the Dragon Palace had died at their hands. This was not a small number.<br/><br/>One had to know that these were disciples at the peak of the venerable realm.<br/><br/>Over a thousand years, more than a hundred disciples at the venerable realm had died. This speed of death was something that even the peak races could not withstand.<br/><br/>“Tell all the disciples to be more careful, especially those who have broken through to the ruler realm.”<br/><br/>Wang Xian sent a message and looked at the location in front of him.<br/><br/>His body moved and he quickly flew into the distance.<br/><br/>This time, he flew towards a place that was deeper than the starry universe!<br/><br/>As he flew, Wang Xian took out his communication stone plate and searched for some information.<br/><br/>“Level One Danger Zone, this is it!”<br/><br/>His gaze locked onto the nearest area and Wang Xian quickly flew over.<br/><br/>Level One Danger Zone was a division made by the group of strong disciples in the communication stone plate.<br/><br/>The so-called level 1 Danger Zone was the zone that ruled the level 1 space behemoth.<br/><br/>Now that this zone had been swept by the top-tier races, it was much safer. This allowed many powerful disciples of the top-tier races to enter and look for opportunities.<br/><br/>The top-tier races had destroyed a level 1 space behemoth, so they couldn’t search every corner of the zone.<br/><br/>If they were lucky, they might be able to obtain some treasures.<br/><br/>In these hundreds of thousands of years, there were experts who obtained the pups of a level one ruler-level astral beast.<br/><br/>These pups possessed the strength to grow to the ruler-level!<br/><br/>For those who obtained the pups, it was undoubtedly a huge opportunity.<br/><br/>Wang Xian flew rapidly in the starry universe. Compared to the nine-origin universe, the starry universe was still too quiet.<br/><br/>The number of living beings could not be compared to the nine-origin universe at all.<br/><br/>After flying for a few months, he arrived in front of a group of life planets.<br/><br/>The resources in the life planets had already been taken away by the other strong disciples.<br/><br/>He took out the communication stone plate and sent a message to the Angel clan.<br/><br/>“I met over a dozen disciples of the Dragon Palace!”<br/><br/>It was similar to how Wang Xian hunted the strong disciples of the Angel clan and the Phoenix clan back then.<br/><br/>He still used this method.<br/><br/>Didn’t they say that he would be rewarded if he were to inform the disciples of the Dragon Palace?<br/><br/>What if I were to inform all of you personally?<br/><br/>Wang Xian revealed a smile on his face. He moved his body and entered a life planet. The aura of a divine dragon was emitted.<br/><br/>This aura was very weak. Some of the powerhouses at the overlord level could sense it easily.<br/><br/>After entering, he waited quietly.<br/><br/>On the communication stone plate, the experts from the Angel clan sent a message that they would rush over very soon.<br/><br/>Wang Xian took a look and smiled.<br/><br/>“Let’s go, there are actually more than a dozen disciples from the Dragon Palace. Killing them would be quite a harvest!”<br/><br/>At the same time, in a piece of void space, three angels were flying rapidly. Their eyes were filled with excitement.<br/><br/>Now, the Angel clan had given the order to destroy the Dragon Palace. Over the past thousand years, they had killed many experts of the Dragon Palace.<br/><br/>They found that all the disciples of the Dragon Palace who entered the starry universe had the strength of peak-stage venerables.<br/><br/>And they were all peak-stage dragon species or pure-blooded divine dragons.<br/><br/>The corpses of peak-stage races were very precious treasures in themselves.<br/><br/>In addition, they often had the resources they had harvested in the universe, which made the experts of the angel race very willing to hunt down the disciples of the Dragon Palace.<br/><br/>After all, they couldn’t kill the disciples of the other peak races wantonly.<br/><br/>“Hehe, indeed, killing a disciple of the dragon palace is worth at least ten thousand years of our search!”<br/><br/>An angel said with a smile.<br/><br/>They flapped their twelve wings and flew quickly.<br/><br/>A month later, they arrived at their destination!<br/><br/>“According to the position of the communication stone plate, this is the place. where is the guy who reported it?”<br/><br/>An angel looked at the location information in the communication stone plate and glanced around, frowning slightly!<br/><br/>“I sensed the aura of the Divine Dragon!”<br/><br/>One of the angels said faintly and looked at the location of the dozens of life planets!<br/><br/>“Let’s Go There First!”<br/><br/>The last Angel said and flew straight ahead.<br/><br/>“Be careful, the Dragon Palace should have a ruler-level existence!”<br/><br/>The other two angels reminded him and flew over as well.<br/><br/>“Haha, the Dragon Palace’s improvement speed is indeed terrifying, but we have the Angel Army. Even if we encounter a ruler-level dragon God, we can still suppress it!”<br/><br/>The angel in front of them said confidently.<br/><br/>“Hehe!”<br/><br/>However, just as he finished speaking, a laugh suddenly sounded in their ears!<br/><br/>Hearing this voice, they were slightly stunned and their expressions changed.<br/><br/>“Whoosh!”<br/><br/>At this moment, they saw a figure appear out of thin air in front of them. That young figure was staring at them with a smile on his face.<br/><br/>When they saw the figure that appeared out of nowhere, the three angels’pupils contracted slightly. A solemn expression appeared on their faces.<br/><br/>“Three trash who are at the first level of the ruler realm! How disappointing!”<br/><br/>Wang Xian stared at them and said indifferently!<br/><br/>“Who… Who Are You?”<br/><br/>An angel’s expression changed as he stared at Wang Xian. When he asked this question, he had a guess in his heart!<br/><br/>“Me? I’m the one who tipped you off!”<br/><br/>As Wang Xian spoke, his figure flashed once again.<br/><br/>In the next second, he was only ten meters away from the three angels!<br/><br/>“Oh no!”<br/><br/>“Oh no, you’re the Dragon King!”<br/><br/>When the three angels saw this terrifying speed, their eyes revealed a look of horror!<br/><br/>He was the Dragon King!<br/><br/>He was definitely the Dragon King!<br/><br/>“Smart. That’s why you’re all going to die, Soul Catcher!”<br/><br/>Wang Xian stared at them and smiled faintly.<br/><br/>A surge of energy directly rushed into their minds.<br/><br/>Soul catcher!<br/><br/>Originally, the probability of success in using the Soul Catcher’s power against a peak race was very low.<br/><br/>This was because as a peak race, they had special protection in their souls.<br/><br/>However, these three angels were still too weak for Wang Xian!<br/><br/>The gap between them was still too big.<br/><br/>After successfully capturing the soul, the three angels stood in front of him in a daze.<br/><br/>“How many powerhouses in your angel race who are at the seventh level have entered the starry universe? Where Are They Now?”<br/><br/>Wang Xian asked a question and looked at them with a twinkle in his eyes.\t\t\t\t\t\t</div>", "images": {}, "success": true}