{"id": 771, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073442.html", "title": "Chapter 3764 - 3764 3763 Recruited Lin Wenluo", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3764 - 3764 3763 Recruited Lin Wenluo</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3764 3763 recruited Lin Wenluo<br/><br/>The exposure of the storm continent was definitely not good news for Wang Xian.<br/><br/>Coupled with the exposure of his news, Wang Xian could also predict that the powerhouses from the Phoenix clan and the Angel clan would definitely come to attack him.<br/><br/>This made him frown slightly.<br/><br/>The breakthrough of the Five Elements Millstone and the Tai Chi Dragon Plate still required a lot of resources.<br/><br/>If he continued to stay here for a few million years, it should not be a big problem for the Five Elements Millstone and the Tai Chi Dragon Plate to break through to the level 6 overlord realm.<br/><br/>However, now that they were discovered, it might be a little troublesome!<br/><br/>“My strength is not strong enough to ignore the powerhouses of the Phoenix clan and the Angel clan.”<br/><br/>He was deep in thought.<br/><br/>Although it was said that only the strongest level 7 overlord realm powerhouses could enter the starry universe, the current Wang Xian was still not a match for a level 7 overlord realm powerhouse.<br/><br/>Wang Xian would also be in trouble if he was besieged.<br/><br/>Especially if the opponent had a strange and powerful treasure that he did not know about. Even if he had a trump card to escape, he could not guarantee his survival.<br/><br/>The most important thing now was to raise his strength to the level of a master of level seven, or to raise the Taiji dragon disc and the five elements millstone completely.<br/><br/>If the Tai Chi Dragon Disc and the five elements millstone were to be raised to the level of a dominator at level six, he would be able to fight against an expert at the level of a dominator at level seven.<br/><br/>Compared to the former, the latter might be faster.<br/><br/>“Get ready to leave. Our cooperation can end!”<br/><br/>Wang Xian pondered for a moment and said to Lin Wenluo.<br/><br/>Now that this place was exposed, there was no need to continue the cooperation!<br/><br/>It would be extremely difficult for Wang Xian to occupy this place again!<br/><br/>“Alright!”<br/><br/>Lin Wenluo nodded his head with a face full of regret.<br/><br/>He didn’t have the background of a peak race. It was already impossible for him to continue staying here!<br/><br/>He didn’t say too much. With a face full of regret, he started to put away the surrounding mecha and spaceships.<br/><br/>Wang Xian swept his gaze across the area. With a wave of his arm, he checked the storage space of Crestford.<br/><br/>“Huh?”<br/><br/>When he saw the items inside, he was slightly stunned. A look of shock appeared on his face!<br/><br/>In Lin Wenluo’s storage space, there were a large number of metal meteorites!<br/><br/>The number of these metal meteorites was several times more than what Wang Xian had obtained over the past 100,000 years!<br/><br/>The densely packed metal meteorites gave off a thick and sharp aura, causing his eyes to glow with excitement.<br/><br/>“What’s going on?”<br/><br/>“Why does he have so many metal meteorites?”<br/><br/>Wang Xian’s eyes were flashing with excitement.<br/><br/>At this moment, he suddenly recalled something that Kristen had said. He had rushed over from the end of the group of meteorites.<br/><br/>The end of the group of meteorites?<br/><br/>He went there and searched for a large number of metal meteorites at the end of the group.<br/><br/>Before they arrived, there were a large number of metal meteorites that no one had picked up.<br/><br/>It was coincidentally found by Kristen.<br/><br/>This was a great opportunity for anyone, even for a peak race!<br/><br/>“Someone really sent me a pillow when I was asleep!”<br/><br/>Wang Xian couldn’t help but laugh.<br/><br/>With so many metal meteorites, the five elemental millstone and the Tai Chi Dragon Plate, they could be upgraded to the level of a master of level six.<br/><br/>There might even be many more attributes left in the five elements.<br/><br/>“Hehe.”<br/><br/>He smiled and looked at Lin Wenluo who was beside him. “Lin Wenluo, what are your plans for the future?”<br/><br/>“Plans?”<br/><br/>Lin Wenluo suddenly heard Wang Xian’s words. He pondered for a moment and looked at him. “Dragon King, I don’t have any plans for the time being. Maybe I will continue to look for a place to do research!”<br/><br/>“Although your idea is good. You want to preserve the last spark of the world of Science and Technology. However, with the backing of a peak race, there is a huge gap between you and yourself. You should have seen it too.”<br/><br/>“In a few million years, you might have a gap with other scientists!”<br/><br/>Wang Xian looked at him and said faintly.<br/><br/>“HMM? What do you mean, Dragon King?”<br/><br/>Lin Wenluo looked at him when he heard his words.<br/><br/>“Join the Dragon Palace and join in the name of the world of technology. I can provide you with the things you need.”<br/><br/>Wang Xian spoke and waved his arm. A large number of metal meteorites appeared around him.<br/><br/>Lin Wenluo was slightly stunned when he saw these metal meteorites.<br/><br/>These metal meteorites were much more than what he had collected over the past hundred thousand years.<br/><br/>Moreover, he could tell that these metallic meteorites were not what he had collected over the past 100,000 years.<br/><br/>His expression changed. He was tempted, but he struggled.<br/><br/>With his strength, it would be too easy for him to find a background of a peak race.<br/><br/>As long as he released the word, the 12 peak races would throw an olive branch at him.<br/><br/>However, the reason why he did not want to join a peak race was because he wanted to protect the technological world created by his ancestors!<br/><br/>“Think about it. I can let you retain your identity as a member of the technological world. You can be said to be a subordinate of the Dragon Palace. I will provide you with resources. I can give you these 14 metal battle angels. My sincerity should be more than that of the peak race. At the very least, if you join the peak race, it’s impossible for you to obtain too precious a treasure.”<br/><br/>Wang Xian continued to speak to him.<br/><br/>The technology in the technological world was still of great use.<br/><br/>It could be seen from the fact that the top races wanted to recruit them.<br/><br/>Furthermore, the technology and battleships in the technological world were indeed very powerful.<br/><br/>Wang Xian felt that he could complement the fire hammer clan.<br/><br/>Currently, the development of the Fire Hammer clan in the Dragon Palace was also restricted.<br/><br/>The Fire Hammer clan could only fight two levels above them. They were already weak to begin with. Furthermore, they were restricted by forging.<br/><br/>Now, they needed to change the direction of their development.<br/><br/>There were some similarities between forging and technology, so they could learn from it.<br/><br/>When Lin Wenluo heard Wang Xian’s words, he looked at the 14 metal battle angels with a burning gaze.<br/><br/>He had spent a huge amount of resources to create only one battle beast. However, the strength of one battle beast was only comparable to one of the metal battle angels.<br/><br/>Among the fourteen metal battle angels, one was of a higher level. This was something he had yearned for before.<br/><br/>Now, as long as he agreed to the Dragon King’s conditions, he could obtain it.<br/><br/>He was a little tempted.<br/><br/>Most importantly, he could retain his identity as a member of the technological world!<br/><br/>“Okay!”<br/><br/>After hesitating for a while, Lin Wenluo still agreed.<br/><br/>He now knew that it was impossible for him to improve quickly by relying on himself.<br/><br/>It might not even be long before the eight scientists who defected to the peak race would be much more powerful than him.<br/><br/>The conditions given by the Dragon King were much better than the conditions given by the peak race.<br/><br/>In addition, the current Dragon Palace was also in the stage of development. He could be considered as a contributor to the founding of the country.<br/><br/>He felt that he could take a gamble.<br/><br/>With the resources given to him by the Dragon King, he would create a peak race.<br/><br/>His name was the world of Technology!\t\t\t\t\t\t</div>", "images": {}, "success": true}