{"id": 775, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073450.html", "title": "Chapter 3768 - 3768 3767 Was In Action", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3768 - 3768 3767 Was In Action</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3768 3767 was in action<br/><br/>“Twenty-five of us who are masters of level seven have entered the starry universe. Some of the powerhouses are cultivating on the light nucleus island while some are in the aurora domain. There are also some who are looking for opportunities.”<br/><br/>Under the control of the soul, the three angels of light revealed the information they knew.<br/><br/>“Twenty-five masters of level seven? Is this the foundation of the Angel Race?”<br/><br/>Wang Xian’s eyebrows twitched violently when he heard his words.<br/><br/>This number had completely exceeded his expectations.<br/><br/>“Where is the Light Core Island?”<br/><br/>Wang Xian continued to ask the three angels of light.<br/><br/>Wang Xian knew about the aurora domain. It was a special domain that was filled with light and darkness. It was a paradise for light and darkness attribute cultivators.<br/><br/>As for the Light Core Island, he did not know its location.<br/><br/>“The Light Core Island is in the starry universe. We have a map here with a mark on it. This is a treasure land that our angel race obtained. It will be of great benefit to our Angel of Light.”<br/><br/>The three angels of light replied.<br/><br/>Wang Xian nodded his head slightly.<br/><br/>“Also, send an urgent message to ask for help from the experts of your angel race. Tell them that you have been besieged by the experts of the Dragon Palace. You have encountered a trap. The ones who besieged you are more than a dozen level one masters of the Dragon Palace and an existence at level two.”<br/><br/>Wang Xian pointed at the angel in the middle and ordered him.<br/><br/>“Yes!”<br/><br/>The angel nodded mechanically and immediately sent an urgent message!<br/><br/>“Very good, you can die now!”<br/><br/>When Wang Xian saw that he had sent the message, he waved his arm and killed the three angels.<br/><br/>The three angels were easily killed before they could even release their battle angels.<br/><br/>Wang Xian closed his eyes and absorbed some information from their minds. A smile appeared on his face.<br/><br/>With a wave of his arm, a storage treasure flew over from an angel’s corpse. After he opened it, he took out a map.<br/><br/>This map was drawn by the angels. It was a place that they had explored before.<br/><br/>Wang Xian took a look and his eyes sparkled.<br/><br/>This map was dozens of times more detailed than the one in the communication stone plate.<br/><br/>Other than this map, there were also some resources and some battle angels.<br/><br/>There were three angels and twelve battle angels.<br/><br/>After sending the message, Wang Xian didn’t leave. Instead, he waited here.<br/><br/>“Three angels were attacked by the disciples of the Dragon Palace. They lost contact after sending the last urgent message.”<br/><br/>At the same time, on a huge island.<br/><br/>The third prince sat cross-legged on a ball emitting light and closed his eyes to cultivate.<br/><br/>Beside him, an angel reported to the third prince.<br/><br/>The third Prince opened his eyes and asked, “What message did they send?”<br/><br/>“According to the message sent by that disciple, he said they were ambushed by the Dragon Palace. There were more than ten universe masters at the first level and a master at the second level ambushed them. After this message was sent, his life force disappeared. He must have been killed by the masters of the Dragon Palace.”<br/><br/>The angel reported.<br/><br/>“Over a dozen universe overlords at the Type 1 realm, and one at the Type 2 realm?”<br/><br/>When the third prince heard this, his eyes gleamed.<br/><br/>“The Dragon Palace has indeed given birth to many overlords, and there are quite a few of them.”<br/><br/>His lips curled, his eyes gleamed, “Send a type 4 or type 5 overlords to take a look. If we can find any of them, kill all of them, and suppress them. As long as they can suppress them, this prince will be rewarded.”<br/><br/>“It’s the third prince.”<br/><br/>The angel nodded and replied immediately.<br/><br/>“In addition, in the future, someone will send a message to the disciples of the Dragon Palace. Send a sovereign above the type 2 realm to hunt them down.”<br/><br/>The third prince continued to instruct.<br/><br/>“Yes!”<br/><br/>The angel continued to reply.<br/><br/>The third prince sat cross-legged with a smile on his face. He hesitated for a moment before sending a message to the Green River Water Phoenix.<br/><br/>“The Dragon Palace has produced many masters in the ruler realm. There should be many purebred divine dragons. This might be an opportunity for us!”<br/><br/>After sending the message, he waited quietly.<br/><br/>“It is indeed an opportunity for us. I will keep an eye out for it.”<br/><br/>Not long after, a message was sent. When the third prince saw it, a faint smile appeared on his face.<br/><br/>…<br/><br/>“Three experts of our Angel race were ambushed at the front.”<br/><br/>A month later, six or seven experts of the angel race flew over from a void in the starry universe.<br/><br/>The leader of the experts had the strength of a level five universe dominator.<br/><br/>The others were all at level two and above.<br/><br/>“You said that the third prince provoked an enemy, and now we have to deal with it. It’s really…”<br/><br/>“Alright, let’s not talk about the third Prince’s matter. Now that the third prince has personally come to the starry universe, he wants to get rid of that Dragon King!”<br/><br/>“I have to say, that Dragon King is really terrifying. He has improved too quickly. If he continues to grow like this, the third prince will be in trouble!”<br/><br/>The seven angels said as they flew to the front and hovered around to size up the surroundings.<br/><br/>“I can sense that the three powerhouses of our angel race disappeared here. Let’s go back and take a look at the powerhouses of the Dragon Palace.”<br/><br/>In the middle, the strongest level five overlord spoke faintly.<br/><br/>“Yes!”<br/><br/>At the side, an angel nodded and took out a mirror.<br/><br/>“They are here as expected!”<br/><br/>At this moment, on a life planet in front, Wang Xian saw the seven angels and sensed their strength. A smile appeared on his face.<br/><br/>Killing them would be considered a small gain.<br/><br/>Whoosh<br/><br/>He moved and appeared behind the seven angels in the next instant!<br/><br/>Buzz<br/><br/>A wave of energy enveloped them instantly.<br/><br/>“Not good!”<br/><br/>The angel who was at the level five realm was the first to react. A look of horror appeared on his face.<br/><br/>“Too slow!”<br/><br/>A soft voice entered their ears, causing the hearts of the seven angels to beat violently.<br/><br/>“PFFT!”<br/><br/>The next moment, Wang Xian’s Dragon Claw grabbed the angel who was at the level five realm and clenched it forcefully!<br/><br/>“Ah!”<br/><br/>A miserable scream sounded instantly. However, Wang Xian sensed a bright force and shot to the side instantly.<br/><br/>In the next second, an angel who was at the level five realm with a missing arm appeared at the side.<br/><br/>“Oh? There’s still a powerful life-saving treasure?”<br/><br/>Wang Xian saw that his figure disappeared instantly. The terrifying energy enveloped him once again.<br/><br/>“Dragon King, it’s you. It’s actually you. This is a trap!”<br/><br/>The angel roared with a face full of fear!<br/><br/>“You guessed it right. However, if you want to die, blame it on your third prince. My revenge is just the beginning!”<br/><br/>Wang Xian said faintly.\t\t\t\t\t\t</div>", "images": {}, "success": true}