{"id": 772, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073444.html", "title": "Chapter 3765 - 3765 3764, The Third Prince Had Entered The Dragon Palace, And There Was A Kill Order For The Two Peak Races!", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3765 - 3765 3764, The Third Prince Had Entered The Dragon Palace, And There Was A Kill Order For The Two Peak Races!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3765 3764, the third Prince had entered the Dragon Palace, and there was a kill order for the two peak races!<br/><br/>“Hehe, alright. I will get someone to bring you back to the Dragon Palace later. However, since you have joined the Dragon Palace, you have to sign a witchcraft contract. After you arrive at the Dragon Palace, I will pass it to some people. You will pass on all the technological knowledge to them. In the future, if nothing goes wrong, they will also belong to the technological world of the Dragon Palace.”<br/><br/>When Wang Xian heard Lin Wenluo’s agreement, a smile appeared on his face.<br/><br/>When Lin Wenluo heard Wang Xian’s words, his eyes flickered.<br/><br/>He was a little surprised that the Dragon King wanted to develop his own technology.<br/><br/>“I can pass on the knowledge that I know, but I’m not responsible for whether they can master it or not. After all, knowledge requires a long period of accumulation and experimentation.”<br/><br/>Lin Wenluo said.<br/><br/>“Sure!”<br/><br/>Wang Xian nodded his head and looked at Wu Sha. “An lie will come to pick you up later. I’ll leave Lin Wenluo’s matter to you!”<br/><br/>“It’s the Dragon King!”<br/><br/>Wu Sha nodded her head immediately.<br/><br/>After Wang Xian gave his instructions, his body moved and he flew into the distance.<br/><br/>After flying for a day, he stopped.<br/><br/>He did not leave the vicinity of the meteorite in the storm continent. Instead, he found a meteorite and hid within it.<br/><br/>Before he had absolute power, he was not prepared to fight head-on with the Phoenix clan and the Angel clan!<br/><br/>“Begin the upgrade!”<br/><br/>Looking at the metal resources in the storage space, a smile appeared on his face.<br/><br/>He immediately began to upgrade the Five Elements Millstone and the Tai Chi Dragon Disc.<br/><br/>With his help, the absorption speed would increase by hundreds of times!<br/><br/>“Dragon King, D * mn Dragon King, I’m going to kill you, I’m going to kill you!”<br/><br/>At the same time, the 9-origin universe’s Angel Race’s Holy Mountain of light was located in a special holy mountain.<br/><br/>On the Holy Mountain, there were palaces and buildings made of metal. It looked extremely sci-fi.<br/><br/>Inside the palace, an extremely furious voice sounded!<br/><br/>A golden old man came out of a nutrient fluid box. His eyes were blood red.<br/><br/>He was killed by the Dragon King!<br/><br/>All his resources and his huge opportunity had disappeared!<br/><br/>For crestfall, his luck had improved after he joined the angel race and entered the starry universe.<br/><br/>Especially when he encountered a huge opportunity. This opportunity was simply a huge opportunity for him.<br/><br/>He had found a treasure ground that contained a large amount of extremely powerful metallic materials.<br/><br/>These metallic materials were coveted by even the peak races.<br/><br/>To him, they were even a huge treasure.<br/><br/>For this reason, after he obtained the metallic meteorite, he immediately kept it.<br/><br/>He didn’t dare to take it back, because once the angel race found out, half of his metallic materials would definitely be taken away by the angel race.<br/><br/>Therefore, he had always carried it with him.<br/><br/>He had created thirteen battle angels with the strength of a ruler at the second level.<br/><br/>Together with the Battle Angel who was a ruler at the third level.<br/><br/>Together with the background of his Angel clan, unless he was killed by the Space Beast, no one could take away his treasures.<br/><br/>But he did not expect to meet the Dragon King.<br/><br/>The Dragon King directly killed him and took away his opportunity.<br/><br/>This made him extremely furious, and the killing intent in his heart couldn’t be suppressed at all!<br/><br/>This was even worse than killing him.<br/><br/>Those huge metal materials could make him greatly improve!<br/><br/>Now everything was gone, gone!<br/><br/>“I want the Dragon King to die, I want the Dragon King to Die!”<br/><br/>He roared crazily and immediately took out the universal AI to pass the news to the powerhouses of the Angel race and the third prince.<br/><br/>He was even considering whether to pass it on to the Phoenix race.<br/><br/>After hesitating for a while, he still didn’t pass it on.<br/><br/>He knew that the third prince had a great enmity with the Dragon King of the Dragon Palace.<br/><br/>The third Prince would tell the Phoenix race.<br/><br/>“Huh?”<br/><br/>At the entrance of the World Passage, the third Prince received this message. He frowned slightly, and his eyes were shining.<br/><br/>He hesitated for a moment and immediately passed the message to the experts of the Angel clan in the starry universe.<br/><br/>The third Prince’s strength was only at the level 7 of the universe dominator.<br/><br/>Although he was the third prince, the experts of the Angel clan who could reach the level 7 of the universe dominator were not something he could dispatch.<br/><br/>He could only spread the news and ask some experts with good relationships to kill the Dragon King.<br/><br/>Of course, they still had to occupy the storm continent!<br/><br/>“The Dragon King of the Dragon Palace is improving too fast. We can’t let him continue to improve!”<br/><br/>The third prince stood there and hesitated for more than ten minutes before looking to the side.<br/><br/>“Elder, I’m going to enter the starry universe.”<br/><br/>In the end, he decided to personally enter the starry universe and spoke to the elder beside him.<br/><br/>“HM? Third Prince, are you going to enter the Starry Universe?”<br/><br/>The elder was slightly stunned and looked at him.<br/><br/>“Yes, I have to take care of some things!”<br/><br/>The third prince nodded and replied.<br/><br/>“Alright, third prince, be careful!”<br/><br/>The elder nodded and did not stop him.<br/><br/>There was no need to stop him.<br/><br/>The few outstanding sons of the King of angels of light all had life-saving treasures.<br/><br/>Just like the first prince, although he had fallen in the starry universe, he had now been resurrected!<br/><br/>The third prince also had life-saving treasures.<br/><br/>The elder would not stop the third Prince’s actions.<br/><br/>“Let me destroy the Dragon King Myself!”<br/><br/>His eyes were cold as he flew towards the starry universe.<br/><br/>It was time to get rid of this problem!<br/><br/>Wang Xian did not know that his enemies, the Green River Phoenix and the third prince, had already entered the starry universe.<br/><br/>At a location not far from the storm continent, he had been upgrading the five elements Millstone and the Tai Chi Dragon Disc.<br/><br/>Time passed day by day and he was not disturbed at all.<br/><br/>The entire starry universe was so big, and it was an unfamiliar universe to the great beings of the 9-origin universe. To find a person here was even harder than finding a needle in a haystack!<br/><br/>As time passed, good news kept coming from the Dragon Palace.<br/><br/>First of all, over at the Flame Heart Treasured Land, a group of fire attributed great beings of the Dragon Palace were cultivating there. There were 1,000 peak-stage venerables, and in a few thousand years, 10 of them had broken through!<br/><br/>The increase of ten in a few thousand years was absolutely terrifying!<br/><br/>At the same time, this also represented the terror of the heart of the fire treasure ground!<br/><br/>However, two thousand years later, two pieces of news suddenly reached Wang Xian.<br/><br/>Similarly, these two pieces of news caused a huge sensation.<br/><br/>The Phoenix clan and the Angel clan had issued a kill order on the communication stone plate!<br/><br/>“Any disciple of any clan or clan that meets a disciple of the Dragon Palace will receive a drop of the Phoenix Essence Blood. Disciples of the Phoenix Essence Blood will receive a drop of the Phoenix essence blood if they meet a disciple of the Dragon Palace. Disciples of the Phoenix Essence Blood will receive a drop of the Phoenix essence blood if they meet a disciple of the dragon palace at the peak of the venerable realm.”<br/><br/>“The Dragon King of the Dragon Palace will receive a battle angel of the same level if he meets a disciple of the Dragon Palace that meets a disciple of the Dragon Palace that meets an expert of the Angel clan.”<br/><br/>Two messages suddenly appeared on the communication stone plate.\t\t\t\t\t\t</div>", "images": {}, "success": true}