{"id": 773, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073446.html", "title": "Chapter 3766 - 3766 3765 Five Elements Grinding Tai Chi Dragon Plate Breakthrough", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3766 - 3766 3765 Five Elements Grinding Tai Chi Dragon Plate Breakthrough</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3766 3765 five elements grinding tai chi dragon plate breakthrough<br/><br/>The Phoenix clan and the Angel Clan suddenly issued a kill order in the communication stone plate, shocking everyone.<br/><br/>In fact, they had no choice but to issue the kill order.<br/><br/>It had been thousands of years since the Phoenix clan’s experts had been exterminated!<br/><br/>During these thousands of years, they wanted to find the Dragon King, but they couldn’t even find a trace of him.<br/><br/>Especially after the Green River Water Phoenix entered the starry universe, it was like a headless fly.<br/><br/>The Dragon King had killed two hundred of their ruler-level fire phoenixes, but where could they find him?<br/><br/>The Starry Universe was so big, and they did not know much about it. How could they take revenge on the Dragon King?<br/><br/>It was like looking for a needle in a haystack!<br/><br/>For thousands of years, there was no news from the Green River Water Phoenix and the strong practitioners of the Phoenix clan.<br/><br/>The third Prince had also encountered the same problem when he had entered the universe.<br/><br/>It was too difficult to find and kill the Dragon King in the universe!<br/><br/>Besides that, the Dragon Palace, the Dragon Palace, was nowhere to be found.<br/><br/>This made them extremely angry.<br/><br/>With no other choice, the third Prince and the Green River Phoenix decided to issue a kill order!<br/><br/>“F * ck, the Phoenix clan and the Angel clan issued a kill order against the Dragon Palace and the Dragon King at the same time. They… They want to completely destroy the Dragon Palace!”<br/><br/>“Hiss, it seems that the revenge of the Phoenix Clan has really begun!”<br/><br/>“Thousands of years have passed, and the Phoenix clan probably didn’t find any trace of the Dragon King, so they issued the kill order. Even the Angel clan has joined in. Did the Dragon King kill the experts of the Angel Clan?”<br/><br/>“The Angel clan has always wanted to kill the Dragon King. I’m afraid they didn’t expect the Dragon King to grow so fast and so terrifying, did they?”<br/><br/>“The Phoenix clan actually uses the Phoenix essence blood as a reward. If a disciple of the Dragon Palace reports to them, they will be rewarded. Let me say this first. If a disciple of the Dragon Palace reports to the Phoenix clan, from their ancestors to their disciples and grand-disciples, all of them will die!”<br/><br/>“Support the people above. It would be better if such a despicable clan like the Phoenix clan were all destroyed by the Dragon King!”<br/><br/>“Support the Dragon King and kill the Phoenix clan. Whoever reports the news to the Phoenix clan is worse than a dog or a beast!”<br/><br/>After the two killing orders were issued, all the powerful disciples in the starry universe were in an uproar.<br/><br/>Thousands of years ago, when the Dragon King killed all the powerful disciples of the Phoenix clan, the Phoenix clan’s actions were scolded by countless powerful disciples.<br/><br/>Now that they had issued the killing orders, the powerful disciples of the high-level races started to scold the Phoenix clan again, expressing their support for the Dragon King.<br/><br/>Many powerful disciples even said that they would never report to the Dragon Palace disciples.<br/><br/>This time, even the killing order of the Angel clan was affected.<br/><br/>This was the first time in history!<br/><br/>“A bunch of damn ants!”<br/><br/>At the same time, in front of the Stormwind continent, this place had been occupied by the strong disciples of the Angel clan.<br/><br/>Looking at the information on the communication stone plate, the Green River Phoenix’s eyes were full of coldness.<br/><br/>On the side, the third prince’s eyes sparkled, “That Dragon King has improved very fast. In order to avoid a long delay, we must destroy him as soon as possible!”<br/><br/>“The most important goal now is to destroy the Dragon King. As for the powerful disciples of the Dragon Palace, since the Dragon King has improved so much, there should be a pure-blooded divine dragon in their Dragon Palace who has also broken through to the ruler realm. This might be good news for us!”<br/><br/>The Green River Water Phoenix gritted her teeth and said!<br/><br/>The third prince nodded and was silent for a while. “Let’s wait for the news. Although those ants are shouting happily in the communication stone plate, they know how to choose.”<br/><br/>“Okay!”<br/><br/>The Green River Water Phoenix nodded and glanced in the direction of the storm continent. “I’ll go and gather with the other experts of the Phoenix clan first. If you have any news, let me know immediately!”<br/><br/>“Alright!”<br/><br/>The third prince nodded and stood there quietly.<br/><br/>…<br/><br/>“The Angel clan and Phoenix clan have issued a killing order against the entire Dragon Palace. HMPH!”<br/><br/>Wang Xian looked at the two pieces of news with a cold look in his eyes.<br/><br/>The news was sent by Prime Minister Gui.<br/><br/>Currently, after the Dragon Palace had more than a million disciples at the peak of the venerable realm, a portion of them had already entered the starry universe.<br/><br/>The killing orders of the two peak races had a great impact on the Dragon Palace!<br/><br/>On the communication stone plate, although many powerful disciples said that they wouldn’t inform the Phoenix clan of the news of the disciples of the Dragon Palace, the probability of informing the angel clan was very high.<br/><br/>Moreover, some powerful disciples might also inform the Phoenix clan.<br/><br/>After all, the rewards of the Phoenix clan were enough to tempt the powerful disciples of any high-level race.<br/><br/>The blood of the Phoenix.<br/><br/>The disciples of the Dragon Palace might be greatly affected.<br/><br/>However, Prime Minister Gui had already informed all the strong disciples of the Dragon Palace to pay attention to their own safety.<br/><br/>“After the breakthrough of the Five Elements Millstone and the Tai Chi Dragon Plate, I will play with the two great races!”<br/><br/>Wang Xian’s eyes were filled with coldness.<br/><br/>As long as the Tai Chi Dragon Plate and the five elements Millstone made a breakthrough, he would have the strength to fight against a master of level seven.<br/><br/>At that time, unless the two races could send out a large number of masters of level seven to surround and attack him.<br/><br/>Otherwise, it would be wishful thinking to kill him!<br/><br/>As he thought to himself, Wang Xian looked at the five elements Millstone and the tai chi dragon plate in front of him. A smile appeared on his face.<br/><br/>In a maximum of a thousand years, they would be able to reach the stage where they could dominate the sixth stage!<br/><br/>“Break through as soon as possible!”<br/><br/>With this thought in mind, Wang Xian began to assist the Tai Chi Dragon Disc and the five elements millstone in improving themselves.<br/><br/>A thousand years passed in the blink of an eye. Waves of mighty energy were impacting the surroundings.<br/><br/>A large millstone that was emitting the power of the five elements and had the patterns of five divine dragons on it was rotating slowly.<br/><br/>Beside it, a Yin-yang tai chi dragon disc was also rotating. It was emitting the power of light and darkness<br/><br/>Wang Xian smiled when he saw this scene.<br/><br/>He had broken through!<br/><br/>He had finally broken through again.<br/><br/>The Five Elements Millstone and Tai Chi Dragon Disc had both been upgraded to the level six overlord realm.<br/><br/>Two treasures, including himself, four netherspirit avatars, and the accompanying Elf!<br/><br/>With his current strength, he could instantly kill a level six overlord.<br/><br/>“With my current strength, I can fight against a group of peak races!”<br/><br/>Wang Xian smiled as he felt the strength of the Five Elements Millstone and the Tai Chi Dragon Plate.<br/><br/>His eyes flickered slightly as he took out the communication stone plate. He looked at all kinds of information and made a plan in his heart!<br/><br/>“The angel race has occupied the storm continent. They should have some arrangements and can’t go there. Now, in the starry universe, they have also discovered some other treasured lands. Although they haven’t reached the level of the fiery heart treasured land, they are still very precious.”<br/><br/>“However, there is another way!”<br/><br/>He murmured!\t\t\t\t\t\t</div>", "images": {}, "success": true}