{"id": 778, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073456.html", "title": "Chapter 3771 - 3771 Another Plan For The Peak Race Of 3770", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3771 - 3771 Another Plan For The Peak Race Of 3770</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3771 Another plan for the peak race of 3770<br/><br/>“There are a lot of strong disciples in the Aurora Domain. There’s even a teleportation array here.”<br/><br/>Entering the interior of the Aurora Domain, Wang Xian saw that it was extremely lively.<br/><br/>A large number of strong disciples were cultivating inside.<br/><br/>This number was not less than a few hundred million.<br/><br/>Wang Xian even saw a large number of skeletons. The densely packed skeletons were absorbing the power of darkness and improving bit by bit.<br/><br/>“There are many strong skeleton clan members. The number is a little terrifying.”<br/><br/>As he flew deeper into the forest, Wang Xian realized that there were many strong skeleton clan members here.<br/><br/>They even summoned their skeleton army and occupied a large area of space.<br/><br/>Wang Xian scanned his surroundings.<br/><br/>“The peak races will occupy a piece of land. The Angel clan should be alone in a place.”<br/><br/>Wang Xian thought to himself. He concealed his aura and flew around. He flew very slowly and observed his surroundings carefully.<br/><br/>There were a large number of special meteorites in the Aurora Domain. These meteorites were floating there quietly.<br/><br/>There were strong disciples cultivating on the meteorites. There were also strong disciples capturing the light and dark rays in the void and storing them.<br/><br/>The light and dark rays were produced at a very fast speed, and they were not completely consumed.<br/><br/>“It really is a holy land for cultivation!”<br/><br/>Wang Xian looked around and muttered.<br/><br/>Such a holy land for cultivation did not exist in the nine-origin universe.<br/><br/>As Wang Xian flew around, he realized that this space was very large.<br/><br/>As he walked deeper, the number of strong cultivators increased. The light and dark rays became denser as well.<br/><br/>“Huh?”<br/><br/>After flying forward for more than ten days, Wang Xian suddenly saw two lines of words in the sky.<br/><br/>The domain of the angel race.<br/><br/>The domain of the Angel race.<br/><br/>Two lines of words were exactly the same. They were condensed from the power of light and the power of darkness respectively.<br/><br/>The two lines of words were suspended in the sky and were emitting a lustrous glow.<br/><br/>This meant that the area ahead was occupied by the strong disciples of the angel race.<br/><br/>Wang Xian’s eyes sparkled when he saw this information.<br/><br/>According to the information Wang Xian received, there were more than 10,000 strong experts of the angel race in the Aurora Domain.<br/><br/>Among them, the Dominators also occupied a large portion of the land.<br/><br/>There was even an existence who was at the level of a dominator at level seven.<br/><br/>Since Wang Xian wanted to deal with the angel race, he naturally wanted to play a big game!<br/><br/>Wang Xian looked at the territory and fell into deep thought.<br/><br/>In the Aurora Domain, there were many experts from the angel race. Not only were they in the seventh level of the angel race, there were more than a dozen of them who were in the sixth level.<br/><br/>With such strength, Wang Xian was no match for them.<br/><br/>Although he was no match for them, it would not be a problem for him to escape.<br/><br/>As long as he launched an unexpected attack, he would be able to kill more than a thousand experts from the angel race, or even more.<br/><br/>However, first, he needed to understand the situation in the innate angel race clearly.<br/><br/>He needed to understand the location of the expert who was at the seventh level.<br/><br/>“I need to understand the situation inside. Otherwise, if I act Rashly, I’m afraid I Won’t be able to kill many experts of the angel race.”<br/><br/>Wang Xian mumbled to himself as a thoughtful expression appeared on his face.<br/><br/>He had a way. He could wait here. If any experts of the angel race came out, he could capture them and search their memories.<br/><br/>This method was feasible.<br/><br/>However, he might not be able to search for detailed information.<br/><br/>“There is another method. Ba Qi has already broken through. He has already reached the first stage of the ruler realm. He can let Ba Qi parasitize an angel.”<br/><br/>Wang Xian thought to himself. After hesitating for a moment, he took out his communication stone plate and sent a message to an lie and Ba Qi.<br/><br/>Not long after, Ba Qi’s figure appeared beside Wang Xian.<br/><br/>“Greetings, Dragon King!”<br/><br/>Ba Qi bowed respectfully to Wang Xian.<br/><br/>“HMM, not bad. Among the poisonous horned dragon species, is there anyone who has the hope of breaking through to the first level of the Overlord Realm?”<br/><br/>Wang Xian looked at Ba Qi and asked with a smile.<br/><br/>“Dragon King, the demonic fiend should be breaking through soon. In addition, the 10,000 disciples of our poisonous horned dragon species have all reached the peak of the supremacy realm. I estimate that there should be five or six more within 10,000 years.”<br/><br/>Ba Qi said.<br/><br/>“Alright, have you achieved any breakthroughs after your breakthrough?”<br/><br/>Wang Xian asked Ba Qi.<br/><br/>“Dragon King, we are now living in the body of an expert. It is even more secretive, especially when we are living in the body of an expert with darkness attribute. Even if he is much taller than us, we wouldn’t be able to tell if we don’t use our energy to detect him!”<br/><br/>Ba Qi said with a smile.<br/><br/>The Venom Serpent Dragon was a new dragon of the Divine Dragon Clan. In the past, when the Divine Dragon Clan was at its peak, there was no such dragon.<br/><br/>The Venom Serpent Dragon was very strong and very strange.<br/><br/>It could live in the body of an expert and obtain his memories.<br/><br/>In the past, this was a weapon that the Dragon Palace could use to destroy one enemy after another.<br/><br/>However, the Venom Serpent Dragon’s parasitism wasn’t without flaws.<br/><br/>Even though it was a few levels higher than them, they could still see through it.<br/><br/>Now that they had made a breakthrough, they were even more secretive and difficult to discover.<br/><br/>Especially when they were parasitizing the bodies of the strong ones of the darkness attribute. Unless those strong ones used their energy to investigate carefully, they would not be able to discover that they were parasitized.<br/><br/>“Very good.”<br/><br/>Wang Xian nodded his head. “We will wait around here and see if there are any angels of the darkness attribute that can leave this place. Once there are those that can leave, parasitize them. I will let you enter them to understand some of the situation.”<br/><br/>“Alright, Dragon King. No problem.”<br/><br/>Ba Qi nodded his head heavily.<br/><br/>“Stay here and guard. Be careful and don’t sense anything.”<br/><br/>Wang Xian reminded Ba Qi and the energy enveloped his body.<br/><br/>The two of them were like the ordinary disciples of high-level races, absorbing the energy around them.<br/><br/>Time passed day by day. Wang Xian’s mind was constantly sensing the situation of the angels.<br/><br/>There were angels entering, but no angels came out for a long time.<br/><br/>“Let’s go, let’s go to the elders of the Angel clan.”<br/><br/>“I really didn’t expect that the elders of the Angel clan would take a liking to us. This is great. Haha, to be able to cultivate in the depths of the Aurora Domain.”<br/><br/>“I heard that the other peak races are also recruiting high-level races. However, only the angel clan offers more benefits.”<br/><br/>“Maybe it has something to do with the Dragon Palace? I heard that there are some powerhouses from the Dragon Palace who are deliberately giving out fake news to ambush the powerhouses from the angel race. That’s why the angel race wants to recruit some high-level races. I wonder if it’s true or not.”<br/><br/>Just as Wang Xian was quietly waiting for the news, a piece of news suddenly came from a spot not far away.<br/><br/>He was slightly stunned when he heard it. He opened his eyes and looked over.<br/><br/>In his line of sight, more than a thousand strong disciples of the demonic beast race were flying towards the territory of the angel race.<br/><br/>Listening to their words, Wang Xian raised his eyebrows slightly. His eyes were sparkling.<br/><br/>The peak race had other plans?\t\t\t\t\t\t</div>", "images": {}, "success": true}