{"id": 782, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073464.html", "title": "Chapter 3775 - 3775 3774 Killed 2,000 Angels With A Single Strike", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3775 - 3775 3774 Killed 2,000 Angels With A Single Strike</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3775 3774 killed 2,000 angels with a single strike<br/><br/>“Dragon King of the Dragon Palace!”<br/><br/>Wang Xian disappeared instantly. The level seven Angel flew over and slashed the air with his sword.<br/><br/>“D * MN Dragon King of the Dragon Palace. He is courting death. He is provoking our angel race. He is courting his own death!”<br/><br/>Around them, more than ten level six angels flew over. Their faces were filled with anger and flames.<br/><br/>Looking at the scene around them, their bodies trembled violently.<br/><br/>“Ah Ah Ah Ah!”<br/><br/>“Ah, it hurts, it hurts!”<br/><br/>At this moment, miserable screams could be heard from the surrounding area. The strong disciples of the angel race were screaming in pain.<br/><br/>Wang Xian instantly unleashed his strongest strength during the attack just now.<br/><br/>The territory of the angel race was not very big to begin with. If Wang Xian were to spread his energy, he could basically cover half of their territory.<br/><br/>However, even if Wang Xian did not cover them, his attack was comparable to that of a master of level seven. The terrifying aftershock swept across the surroundings.<br/><br/>This was a considerable impact to some masters of the universe who were below level four.<br/><br/>Some disciples below the Master of the universe were even killed by this impact.<br/><br/>This was especially true for the disciples of the high-level races behind them.<br/><br/>They had joined the angel race and brought a large number of disciples here in order to improve quickly.<br/><br/>Many of them only had the strength of a level 3 or 4 universe knight.<br/><br/>With such strength, they died instantly in the face of the terrifying aftershock.<br/><br/>Even if they were not at the center of the attack, the aftershock still caused a small portion of the disciples of the high-level races to die instantly.<br/><br/>Most of the other disciples were also seriously injured.<br/><br/>They looked at the center of the attack in a daze.<br/><br/>Even if the attack of the Dragon King was not aimed at them, their disciples were still killed by the aftermath.<br/><br/>Was it right or wrong for them to participate in the war between the Dragon Palace and the Angel Clan?<br/><br/>Was It Worth It?<br/><br/>“Help, check some injuries!”<br/><br/>The Archangel, who was a master of the seventh level, said with a gloomy face.<br/><br/>One by one, the level six archangels began to treat the injured disciples.<br/><br/>One of the Archangels counted the injuries and flew over with a gloomy face.<br/><br/>“Sir, the Dragon King killed 2,000 angels, of which about 300 were above the level of a ruler. Most importantly, their bodies were taken away by the Dragon King, and their army of Angels was also taken away by the Dragon King.”<br/><br/>The angel flew over and reported to the Archangel, who was at the ruler level of the seventh level.<br/><br/>“Hu hu!”<br/><br/>Hearing his words, the Archangel, who was at the ruler level of the seventh level, looked extremely embarrassed.<br/><br/>More than 300 ruler-level powerhouses. This was a great loss to the Angel clan.<br/><br/>There were not many ruler-level powerhouses in the Angel clan. Their strength lay in their army of angels.<br/><br/>Every angel represented an army.<br/><br/>Now, the Dragon King had taken all of them away.<br/><br/>On the surface, they had lost so many angels, but in fact, their losses were many times greater than that.<br/><br/>“The Dragon King used a special treasure to leave this place. Damn it, our Angel clan has suffered a great loss this time.”<br/><br/>The Archangel, who was a dominator of the seventh level, said with a gloomy face.<br/><br/>“This… that Dragon King really deserves death. However, the enemy that your third prince has provoked has not been dealt with after so long. Instead, it has caused our angel clan to suffer such a great loss. Your third prince has to give an explanation.”<br/><br/>At this time, a sixth level ruler, a dark angel, flew over and said with a gloomy face.<br/><br/>“Let Our Elder, the King of angels of light, decide on this matter. I don’t have any solutions here.”<br/><br/>The angel who was at the seventh level of the ruler realm spoke to him with a gloomy expression.<br/><br/>The Dark Angel nodded with an unsightly expression.<br/><br/>This time, their dark angel had suffered a great loss.<br/><br/>The third prince had to bear some responsibility.<br/><br/>“Hehe, everything is as I expected. The harvest this time is not bad!”<br/><br/>At the same time, outside the Aurora Domain, Wang Xian instantly appeared. A smile appeared on his face.<br/><br/>The harvest this time was pretty good.<br/><br/>With a single strike, 300 angels in the ruler realm died at his hands.<br/><br/>Among them, there were five who were in the fifth level of the ruler realm.<br/><br/>In the middle, Wang Xian had collected all the corpses.<br/><br/>The harvest from the Army of angels inside was more than the harvest from the corpses.<br/><br/>Although it was a waste of an opportunity to use the spatial scroll.<br/><br/>In Wang Xian’s opinion, it was worth it.<br/><br/>Secondly, this time, he had dealt a heavy blow to the morale of the Angel clan.<br/><br/>“Next, should I look for the strong disciples of the Phoenix Clan?”<br/><br/>He mumbled as his eyes sparkled.<br/><br/>His body moved and he immediately flew forward.<br/><br/>Since he had attacked the Angel clan, he had to be even with the rain and dew.<br/><br/>Even if he couldn’t kill them as wantonly as he did this time, he could still kill them one by one.<br/><br/>This way, he could obtain resources much faster than if he were to search for life planets.<br/><br/>However, after attacking the Angel clan, he had to be more careful.<br/><br/>If nothing unexpected happened, the situation on the Angel clan’s side might be spread out.<br/><br/>However, it was as expected by Wang Xian.<br/><br/>Not long after he left, some of the strong disciples in the vicinity of the territory of the Angel clan in the Aurora Domain saw the situation over there. They saw the horrifying battle and saw the angry roars coming from there, they were shocked.<br/><br/>“What happened to the Angel Clan? What exactly happened?”<br/><br/>“It seems to be the Dragon King of the Dragon Palace? No Way, the Dragon King of the Dragon Palace entered and launched an attack?”<br/><br/>“Although it ended quickly, the attacks were so terrifying!”<br/><br/>Some of the strong disciples around flew over and looked at the territory of the Angel clan in shock.<br/><br/>“That light shield can withstand any attack from a ruler of the seventh level. It seems that the Dragon King of the Dragon Palace really killed his way into their territory. It seems that he ran away after killing some strong disciples.”<br/><br/>An expert of the skeleton clan flew over and looked inside with curiosity. He said with a smile.<br/><br/>“This Dragon King of the Dragon Palace is really fierce. It seems that he has made things difficult for the Angel clan. I wonder how many experts of the Angel clan he has killed this time.”<br/><br/>“He must have killed a lot of experts. He even used such a treasure.”<br/><br/>Another expert of the skeleton clan and the Dark clan flew over and laughed and talked as if they were watching a joke.<br/><br/>The Dragon King of the Dragon Palace was fighting with the Angel clan and the Phoenix clan, and the other peak clans were just spectators.<br/><br/>Seeing the current situation, they were just watching the show.<br/><br/>They were even gloating when they saw the Angel clan being attacked.<br/><br/>While they were watching the show, the news also spread to the communication stone plate.<br/><br/>When the news of the Aurora Territory of the Angel clan being attacked by the Dragon King appeared, it immediately caused a huge shock.\t\t\t\t\t\t</div>", "images": {}, "success": true}