{"id": 787, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073474.html", "title": "Chapter 3780 - 3780 3779 Was Boiling With Excitement As He Announced The Results Of The Battle", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3780 - 3780 3779 Was Boiling With Excitement As He Announced The Results Of The Battle</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3780 3779 was boiling with excitement as he announced the results of the battle<br/><br/>That’s right, Wang Xian wanted to announce his performance.<br/><br/>Now, the peak races were recruiting high-level races as their subordinate races.<br/><br/>This would bring great benefits to every peak race.<br/><br/>Wang Xian naturally wanted to destroy such a matter.<br/><br/>He wanted to see which high-level race would dare to join the Phoenix race and the Angel race after he announced the results of the battle.<br/><br/>Other than that, Wang Xian also wanted to tell all the experts of the other races.<br/><br/>The Dragon Palace might be weaker than the peak races, but they weren’t afraid of any peak races.<br/><br/>So what if they were experts of the peak races?<br/><br/>They would be killed without fail!<br/><br/>Of course, Wang Xian knew the consequences of announcing the corpse. He would be hunted down by the Phoenixes of the Angel clan and the Phoenix clan.<br/><br/>But would he be afraid?<br/><br/>With the resources in his hands, he would call Xiao Lan’s little house over when the time came.<br/><br/>He was not afraid at all when an expert of the peak race who was at level eight could not step into the starry universe.<br/><br/>He would be done if he did it!<br/><br/>Taking out the communication stone plate, Wang Xian released all the corpses of the Phoenix clan and the Angel clan. Then, he took a photo.<br/><br/>Following that, he uploaded them onto the communication stone plate.<br/><br/>There was also a line of text attached.<br/><br/>The text was very short: anyone who wants to join the Angel clan and the Phoenix clan should consider it carefully. Don’t become an underground skeleton!<br/><br/>After a short line of text, he uploaded it directly.<br/><br/>After that, he didn’t bother with it anymore. Instead, he contacted Lan Qingyue.<br/><br/>He wanted to meet with the Little Blue House.<br/><br/>He wanted to raise the strength of the Little Blue House as soon as possible.<br/><br/>Lan Qingyue received his message and immediately asked an lie to bring him over.<br/><br/>“Little Xian!”<br/><br/>Upon seeing Wang Xian, Lan Qingyue revealed a smile on her face.<br/><br/>The current Lan Qingyue also did not have the suppression of the starry universe. As a level one overlord, he was completely capable of fighting against a level four overlord.<br/><br/>“Qingyue, contact Xiao Lan’s little house and ask them to come over and join us. I have a lot of resources here. It’s enough for them to achieve a huge breakthrough!”<br/><br/>Wang Xian said to Lan Qingyue.<br/><br/>“HMM, that’s simple. After Xiao Lan’s little house has achieved a breakthrough and merged with the starry universe, I can instantly reach the place where Xiao Lan’s little house is. At that time, I’ll just ask an lie to bring us over!”<br/><br/>Lan Qingyue said with a smile.<br/><br/>“Is the place where Xiao Lan’s little house is located safe? We can go to their place first.”<br/><br/>Wang Xian raised his eyebrows and asked.<br/><br/>“Currently, it’s very safe. However, there are many space beasts around them. Moreover, they are located in the deepest part of the starry universe. That is the area where the top-tier space beasts are located.”<br/><br/>Lan Qingyue replied.<br/><br/>“Alright, I will find a safe place first. When the time comes, I will get an lie to summon Xiao Lan’s little house over!”<br/><br/>Wang Xian thought for a moment and nodded.<br/><br/>“Xiao Xian, I can cultivate the third kun now. Do you want to cultivate it?”<br/><br/>Lan Qingyue looked at him and asked.<br/><br/>“Can you cultivate the third kun now? Alright, I will cultivate it immediately.”<br/><br/>Wang Xian’s eyes lit up and he immediately said.<br/><br/>There were quite a number of corpses in his hands now. The space beasts that he had nurtured had an instinctive advantage in the starry universe.<br/><br/>This was much more suitable than upgrading the disciples of the Dragon Palace.<br/><br/>“Alright!”<br/><br/>Lan qingyue nodded her head.<br/><br/>Just as Wang Xian was about to upgrade Xiao Lan’s little house, the information that he had posted on the communication stone plate, which was located in the entire nine-origin universe, was completely in full swing.<br/><br/>Not only was it in full swing, it should be in full swing!<br/><br/>The few pictures that Wang Xian had posted made all the disciples of the powerhouses of the various races widen their eyes in shock and disbelief.<br/><br/>Even the powerhouses of the other peak races were dumbfounded!<br/><br/>“What the F * ck? What the F * ck? What’s going on? This is the information that the Dragon King of the Dragon Palace has posted. How is this possible? Oh my ancestor, how is this possible?”<br/><br/>“There are so many corpses of experts from the Phoenix clan and the Angel clan. Just by looking at these corpses, I can feel a huge pressure. Are these all ruler-level corpses?”<br/><br/>“I am a disciple of a peak race. I can tell you clearly that these are all the corpses of experts above the ruler-level. There are more than 300 corpses from the Angel clan. Among them, there are five at the ruler-level level five, and even more at the ruler-level four. As for the Phoenix clan, there are seven at the ruler-level five, and 20 at the ruler-level world. This is crazy!”<br/><br/>“Is this the Dragon King of the Dragon Palace? He’s so fierce even when facing two peak races. The Phoenix clan and the Angel clan were completely killed by the Dragon King!”<br/><br/>“Now I can see that the kill order of the two peak races is a complete joke!”<br/><br/>“The Dragon King is directly threatening the other peak races. With the Dragon King’s words, who would dare to join the Phoenix clan and the Angel Clan?”<br/><br/>Soon, the entire communication stone plate was in an uproar.<br/><br/>Everyone looked at the corpses in shock.<br/><br/>Especially when the experts of the Phoenix clan and the Angel clan looked at the corpses, their eyes were filled with flames of anger.<br/><br/>While they were angry, they were also a little scared.<br/><br/>After all, the experts of the same clan who were killed by the Dragon King had reached the fifth or sixth level of a ruler.<br/><br/>What kind of concept was this?<br/><br/>This meant that they might be killed by the Dragon King of the Dragon Palace in the starry universe.<br/><br/>Looking at these corpses, even the experts of their peak race felt a trace of fear and fear in their hearts.<br/><br/>“Patriarch, what should we do? We’ve already joined the angel race. What’s going on now?”<br/><br/>“This Dragon King is too strong. His strength is too terrifying. If they want to destroy our clan, they can easily destroy us!”<br/><br/>At this moment, the group of high-level clans that had joined the Angel clan and the Phoenix clan almost cried when they saw this information!<br/><br/>They thought that with the strength of the Phoenix clan or the Angel clan, the Dragon King of the Dragon Palace would be a coward?<br/><br/>If he was discovered by the experts of the Angel clan and the Phoenix clan in the future, he would be easily destroyed.<br/><br/>Even the last time the Dragon King of the Dragon Palace ambushed the Angel clan’s territory in the Aurora Domain, they thought so too.<br/><br/>Because the foundation and strength of the two peak races were too strong.<br/><br/>But now that they saw that so many of the masters of the two races had been killed by the Dragon King, what were they?<br/><br/>Most importantly, the Angel clan and the Phoenix clan couldn’t do anything to the Dragon King at the moment.<br/><br/>The kill order had been issued, but not only did they not kill many disciples of the Dragon Palace.<br/><br/>Instead, their own masters’disciples were killed randomly.<br/><br/>“Especially since the Dragon King dared to release these photos and provoke the Phoenix clan and the Angel clan, it seems that he is not afraid of their revenge at all. The Dragon King must have his own trump card!”<br/><br/>Some experts sighed slightly.\t\t\t\t\t\t</div>", "images": {}, "success": true}