{"id": 784, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073468.html", "title": "Chapter 3777 - 3777 3776. Under The Good News From The Little Blue House", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3777 - 3777 3776. Under The Good News From The Little Blue House</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3777 3776. Under the good news from the Little Blue House<br/><br/>The Little Blue House belonged to the bloodline of the Space Beasts.<br/><br/>However, they also belonged to the living beings of the 9-origin universe.<br/><br/>Even the space beasts of the mountain and sea land also belonged to the living beings of the 9-origin universe.<br/><br/>However, the bloodline of the space beasts flowed within their bodies.<br/><br/>All the space beasts of the mountain and sea land were extremely unfamiliar when they returned to the space universe.<br/><br/>The Starry Universe also had a great repulsion toward them, and their strength was also greatly suppressed.<br/><br/>However, their roots were in the starry universe, so even though the starry universe had a great repulsion toward them, they were still able to fuse with the starry universe.<br/><br/>The group of Space Beasts still had a way to fuse with the starry universe.<br/><br/>This fusion was to remove the repulsion of the starry universe toward them.<br/><br/>They were also fusing with the starry universe, which meant that they would be a member of the starry universe in the future, completely separated from the 9-origin universe.<br/><br/>Little Blue and little house had also fused with the starry universe.<br/><br/>And this fusion had lasted for over 100,000 years.<br/><br/>According to the information little house little blue had sent, their fusion was fast. The stronger they were, the longer the fusion would take.<br/><br/>After Xiao Lan’s small house had merged, the Suppressive Force had completely disappeared.<br/><br/>In other words, the current Xiao Lan’s small house was comparable to a level four master of their nine-origin universe in the starry universe.<br/><br/>This was definitely good news for Wang Xian and the Dragon Palace.<br/><br/>Xiao Lan’s small house no longer had the suppressive force of the starry universe. This was their home ground. Once Xiao Lan’s small house could be upgraded, it would be a huge battle strength for the Dragon Palace in the starry universe!<br/><br/>“Now that the Little Blue House no longer has the suppression power, they can totally upgrade their strength!”<br/><br/>Wang Xian looked at the news with excitement in his eyes.<br/><br/>Now, thanks to the Little Blue House, even Lan Qingyue could enter the starry universe without such suppression.<br/><br/>Moreover, the upgrade of the Little Blue House was to devour powerful creatures.<br/><br/>In the past, Kun had been feeding on the divine dragons, phoenixes, and other powerhouses of the peak races.<br/><br/>It was impossible to devour the Divine Dragons, but it was not a problem to devour the dragon blood.<br/><br/>In addition, it was not possible to devour the Phoenixes in the past, but it was possible now!<br/><br/>Wang Xian still had the corpses of the Phoenix and Angel races in his hands.<br/><br/>With so many corpses, Little Blue House would definitely be able to improve greatly.<br/><br/>In fact, as long as they were promoted to the level four of the Universe Dominator, the peak races would not be able to do anything to Wang Xian against the Dragon Palace.<br/><br/>Once they advanced to the fourth level of the Universe Dominator, Xiao Lan’s little house would be able to fight against those at the seventh level of the universe dominator.<br/><br/>Then, what was there to be afraid of for Wang Xian and the Dragon Palace?<br/><br/>The peak races?<br/><br/>Direct and direct!<br/><br/>The Angel Race? The Phoenix Race?<br/><br/>Direct battle!<br/><br/>If Xiao Lan and little house were stronger, wouldn’t That Be a slaughter?<br/><br/>Wang Xian’s eyes revealed an excited look.<br/><br/>He looked at the corpses of the peak races in his hands and the corner of his mouth curled up slightly.<br/><br/>“Looks like I have to store the corpses of the Phoenix and Angel races properly and upgrade Xiao Lan and Xiao Zhai.”<br/><br/>Wang Xian’s eyes were shining.<br/><br/>Once Xiao Lan’s Xiao Zhai was upgraded, the benefits would be too great!<br/><br/>His eyes were shining as he continued flying forward.<br/><br/>The resources in his hands could upgrade Xiao Lan’s Xiao Zhai to a considerable level.<br/><br/>At the very least, they would be able to reach the level of a Level 3 universe dominator. It was hard to say if they would be able to reach the level of a Level 4 universe dominator.<br/><br/>However, if Wang Xian could kill the next target, Xiao Lan’s little house might be able to reach the level of a Level 5 universe dominator.<br/><br/>At that time, they could even fight against existences at the level 8 universe dominator.<br/><br/>Many other plans could also be carried out.<br/><br/>He thought to himself and pushed his speed to the limit.<br/><br/>A year passed very quickly. Wang Xian was flying at high speed.<br/><br/>The distance from the Phoenix tribe to surround and kill the space behemoth was getting closer and closer.<br/><br/>“By the time I arrive, the Phoenix tribe should have already made their move. I wonder if the space behemoth has been killed. I hope not.”<br/><br/>He mumbled.<br/><br/>The Space Beast was not that easy to kill. Wang Xian felt that it would take a long time for three level six universe Dominators and the rest of the Phoenixes to kill a level three universe dominator.<br/><br/>Some battles might last for one to two years.<br/><br/>Wang Xian comforted himself in his heart and continued to fly forward.<br/><br/>A few months passed once again and his speed slowed down.<br/><br/>This was because according to the memories of the Phoenix Tribe’s experts, they were in the void ahead.<br/><br/>As for the exact location, he wasn’t sure.<br/><br/>He scanned his surroundings and sized up his surroundings vigilantly.<br/><br/>This was because the Phoenix tribe’s experts were hunting the space behemoths. It could be an ambush or a trap.<br/><br/>Therefore, he had to be careful.<br/><br/>He advanced cautiously bit by bit. After more than ten hours, Wang Xian suddenly felt waves of terrifying energy fluctuations coming from the front.<br/><br/>His eyes lit up and he flew over carefully.<br/><br/>“Roar! Roar! Roar!”<br/><br/>When he rushed over, he felt waves of terrifying energy surging over.<br/><br/>In his line of sight, an incomparably huge space behemoth was emitting a monstrous aura.<br/><br/>This space beast was like a gorilla, its body was terrifying and its entire body was pitch black.<br/><br/>The black fur on its body was like an extremely sharp metal weapon.<br/><br/>However, at this moment, the gorilla-like space beast was completely trapped by the water ropes.<br/><br/>The water ropes came from three directions and each of them grabbed onto the claws of the three water phoenixes.<br/><br/>Around them, there were twenty water phoenixes attacking the space behemoth continuously.<br/><br/>Under the restraint of the water rope, the space behemoth could not break free at all.<br/><br/>In fact, the water rope did not move at all.<br/><br/>Furthermore, the twenty water phoenixes, who were at level four or five and were masters of the universe, were attacking the space behemoth continuously. Numerous wounds appeared.<br/><br/>“Eh?”<br/><br/>Wang Xian looked at the battle in front of him with a surprised expression.<br/><br/>The three water phoenixes, who were at the sixth level of the universe Dominators, had completely restrained the space behemoth, rendering it unable to resist at all.<br/><br/>This suppression was extremely powerful.<br/><br/>Wang Xian stared at the water rope. He could sense a terrifying restraining spell from it.<br/><br/>“This water rope is not simple. I feel that even a master of level seven could be completely bound by this water rope.”<br/><br/>Wang Xian made a judgment in surprise.<br/><br/>“As expected of a peak race. Even if a master of level eight could not enter, their background and techniques are still not something that the dragon palace can compare to.”<br/><br/>Wang Xian stared at it and sensed with his mind.<br/><br/>In the end, he had a judgment. Once he was bound by this water rope, he would probably not be able to break free.<br/><br/>However, his speed was very fast. The other party might not be able to bind him.<br/><br/>However, Wang Xian did not dare to gamble. If this water rope possessed a special energy, he would be at a huge disadvantage!<br/><br/>“At this speed, this space beast will be grinded to death by the group of water phoenixes within a few months.”<br/><br/>Wang Xian calculated in his heart.\t\t\t\t\t\t</div>", "images": {}, "success": true}