{"id": 781, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073462.html", "title": "Chapter 3774 - 3774 3,773 In One Strike, Killing 2,000 Angels! Hit", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3774 - 3774 3,773 In One Strike, Killing 2,000 Angels! Hit</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3774 3,773 in one strike, killing 2,000 angels! Hit<br/><br/>A group of strong disciples from the Silver Light sect followed the angel who was at level two.<br/><br/>Wang Xian was behind him as he scanned his surroundings.<br/><br/>Everything in his surroundings was consistent with the information sent by Ba Qi.<br/><br/>His eyes were sparkling as he looked ahead.<br/><br/>“If it’s in front, then I can make my move. I have to make the most of my attack!”<br/><br/>Wang Xian thought to himself.<br/><br/>At this moment, the octahedron that was parasitizing the angel of Darkness had already left this area.<br/><br/>Once Wang Xian launched his attack, the entire space might be sealed by the powerful treasures of the angel race.<br/><br/>Wang Xian did not leave his ghost avatar outside.<br/><br/>As he was too far away, he was afraid of any accidents. Hence, he prepared to use the spatial scroll to escape immediately.<br/><br/>He still had two more chances to use the spatial scroll. This time, he would use it on the angels.<br/><br/>As he continued to fly forward, Wang Xian looked to his left and right.<br/><br/>The light and darkness here were much more substantial compared to the outside world.<br/><br/>On every meteorite in the surroundings, there were a large number of strong disciples of the Angels cultivating.<br/><br/>The territory occupied by the Angels was not very big. At the very least, under Wang Xian’s full speed, he could reach the end from the edge in a second.<br/><br/>The group of strong disciples of the angel race was rather dense!<br/><br/>At the edge of the territory, all the strong disciples of the angel race who were below the Overlord level were cultivating.<br/><br/>After flying forward for half an hour, Wang Xian had a serious expression on his face.<br/><br/>In front of him, he could already sense the aura of a large number of powerhouses of the Overlord level of the Angel Race!<br/><br/>His gaze landed on a huge meteorite. There were hundreds of Dominators on it.<br/><br/>From the first stage of the Dominator realm to the third or fourth stage of the Dominator realm, there were all of them!<br/><br/>This place was already at the center of the territory of the angel race.<br/><br/>“Attack in ten seconds!”<br/><br/>Wang Xian looked ahead and followed the team slowly.<br/><br/>He also began to accumulate energy slowly.<br/><br/>One second, two seconds, three seconds…<br/><br/>In ten seconds, Wang Xian accurately arrived at his expected position.<br/><br/>Boom<br/><br/>In an instant, a vast and terrifying aura burst out from his body.<br/><br/>The terrifying power of the domain instantly enveloped the entire space.<br/><br/>The Five Elements Millstone flew out, and the Tai Chi Dragon Disc flew out.<br/><br/>Four netherspirit avatars flew out.<br/><br/>The accompanying Elf spirit appeared, and waves of energy were added to his body.<br/><br/>“Five Elements Annihilation Disc!”<br/><br/>Wang Xian roared furiously. He waved his arm and the five elements Millstone attacked the meteorite that had a few hundred ruler-level angels.<br/><br/>The five elements Millstone unleashed its strongest attack, the five elements annihilation disc.<br/><br/>Five Elements Annihilation Disc.<br/><br/>“Mad Dragon Star Explosion!”<br/><br/>The Five Elements Millstone’s attack began. At the same time, Wang Xian unleashed his strongest law.<br/><br/>Mad Dragon Star Explosion. A terrifying and direct attack was directed towards another area where the angels were gathered.<br/><br/>At the same time, four netherspirit avatars were attacking the surroundings.<br/><br/>They instantly transformed into the bodies of divine dragons. The terrifying energy attacked the angels on the meteorites one by one!<br/><br/>The terrifying attack caused the entire space to shake tremendously.<br/><br/>The Tai Chi Dragon Disc also transformed into two divine dragons, light and darkness, that intertwined together and attacked the surroundings.<br/><br/>It seemed like there were five to six attacks, but they were all carried out at the same time!<br/><br/>Rampage, horror, and destruction instantly descended upon this space!<br/><br/>“Wow!”<br/><br/>At the spot in front of Wang Xian, the group of strong disciples from the silver light sect felt the terrifying and unbridled power of Wang Xian. All of them spat out blood and their bodies collapsed instantly, exterminating the king instantly!<br/><br/>“No, no, no!”<br/><br/>“This… is the Dragon King of the Dragon Palace, the Dragon King of the Dragon Palace!”<br/><br/>In front of them, the sect master of the Silverlight sect and the powerful ones felt the power of the onslaught. Their faces were filled with astonishment.<br/><br/>They roared crazily.<br/><br/>They could see their bodies crumbling and disappearing bit by bit.<br/><br/>Why did the Dragon King of the Dragon Palace suddenly appear here?<br/><br/>Why did he suddenly launch an attack here?<br/><br/>Why!<br/><br/>Why!<br/><br/>They were terrified, desperate, and unwilling!<br/><br/>They didn’t want to die!<br/><br/>“HMPH, a bunch of people who are courting death. How dare they get involved in the war between the Dragon Palace and the Angel Race!”<br/><br/>Wang Xian’s cold voice traveled into his mind.<br/><br/>In the next moment, they lost consciousness.<br/><br/>Even the powerhouse who was leading the way, who was at level two, lost his life under the terrifying pressure from Wang Xian.<br/><br/>At this moment, Wang Xian unleashed all of his strength.<br/><br/>Boom! Boom! Boom<br/><br/>“Ahhhh!”<br/><br/>In the surrounding area, all the powerhouses of the angel race did not expect that someone would attack them here.<br/><br/>Someone actually dared to step in and attack them.<br/><br/>All the disciples of the Angel Race who were cultivating didn’t have the time to react.<br/><br/>When they sensed it, the devastating attack had already landed on them.<br/><br/>All of them let out desperate roars!<br/><br/>A large number of angels died instantly.<br/><br/>There was no time to escape!<br/><br/>Whoosh<br/><br/>Wang Xian flapped his incipient saint wings and didn’t fly towards the corpses instantly.<br/><br/>After killing them, Wang Xian naturally had to collect all the corpses. Only then would he be able to maximize the benefits.<br/><br/>“Not good, someone actually dares to attack our Angel Race!”<br/><br/>“Damn it, you’re courting death!”<br/><br/>In just a second, the group of strong disciples of the angel race from other places looked over. All of them looked extremely embarrassed as they roared loudly.<br/><br/>In the middle, an archangel flew directly into the sky. He was holding a bright ball in his hand.<br/><br/>The ball instantly released a bright power that enveloped the entire space.<br/><br/>He stared in Wang Xian’s direction with an extremely embarrassed expression.<br/><br/>He locked onto Wang Xian and recognized him instantly.<br/><br/>Even though he had never met Wang Xian before, he could guess that the one who attacked was the Dragon King of the Dragon Palace!<br/><br/>That was because in the entire nine-origin universe, the only one who had the strength to attack them was the Dragon King of the Dragon Palace.<br/><br/>“Dragon King, you are courting death. I will kill you today!”<br/><br/>The Archangel roared ferociously as he felt the experts of the angel race being killed in an instant.<br/><br/>“Hahaha, Angel race, since your third Prince wants to kill me, I will kill you. Today is just the beginning. All of you, just wait and see. There are still some reckless fellows from the high-level races who have interfered in our war with the angel race. Just wait and see!”<br/><br/>Wang Xian heard the furious roar of this level-seven Archangel.<br/><br/>As he felt a surge of energy charging towards him, he scanned his surroundings.<br/><br/>He realized that the entire space was shrouded in light.<br/><br/>He let out a maniacal laugh. The five elements grinding tai chi dragon disc and the Netherspirit Avatar returned instantly. He took out a spatial scroll and crushed it without hesitation!<br/><br/>In the next moment, before the level 7 master of the Angel race could rush over, he had already disappeared.\t\t\t\t\t\t</div>", "images": {}, "success": true}