{"id": 789, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073478.html", "title": "Chapter 3782 - 3782 3781 Upgrade Of Xiao Lan’S Small House", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3782 - 3782 3781 Upgrade Of Xiao Lan’S Small House</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3782 3781 upgrade of Xiao Lan’s small house<br/><br/>“Let’s do it here. Bring Xiao Lan’s small house over.”<br/><br/>After Wang Xian released the news, he had been searching for a secret place.<br/><br/>After finding a location, he spoke to Lan Qingyue and an lie who were beside him.<br/><br/>“Alright, Xiao Xian!”<br/><br/>Lan qingyue nodded her head and disappeared in an instant.<br/><br/>An lie was waiting quietly by the side.<br/><br/>“Dragon King, I’m going over!”<br/><br/>Sensing the appearance of the demonic spirit altar and the disappearance of an lie, Wang Xian immediately set up a demonic spirit altar as well!<br/><br/>An incomparably huge void pagoda appeared very quickly. In the next second, Xiao Lan and Xiao House appeared in the sky above the Void Pagoda.<br/><br/>“Dragon King!”<br/><br/>“Dragon King!”<br/><br/>Xiao Lan and Xiao Zhai appeared. They looked at Wang Xian and shouted respectfully immediately.<br/><br/>“Oh? Xiao Lan and Xiao Zhai, can you guys talk now?”<br/><br/>Wang Xian smiled when he heard their words.<br/><br/>Xiao Lan and Xiao Zhai nodded their gigantic heads.<br/><br/>“Xiao Lan and Xiao Zhai are very smart.”<br/><br/>Lan qingyue flew to Wang Xian’s side with a smile on her face.<br/><br/>“Hehe, alright. Next, Xiao Lan House and the rest of you, quickly increase your strength here!”<br/><br/>As Wang Xian spoke, he moved his palm and placed a large number of corpses of the Phoenix clan and Angel clan in front of them.<br/><br/>“Woo Woo!”<br/><br/>“Thank you, Dragon King!”<br/><br/>“Thank you, Dragon King!”<br/><br/>When Xiao Lan House saw the large number of corpses of experts from the peak races, her eyes were filled with excitement. She immediately opened her mouth and said.<br/><br/>“Can these corpses help you to advance to the level of a ruler at level five?”<br/><br/>Wang Xian asked them.<br/><br/>“Dragon King, I’m afraid these corpses are not enough. Even if we were to devour them all by ourselves, it would still be insufficient!”<br/><br/>Xiao Lan’s small house replied, “There are too few corpses at the level of a ruler at level six.”<br/><br/>“It shouldn’t be a problem for the two of you to devour all of them and advance to the level of a ruler at level four, right?”<br/><br/>Wang Xian continued to ask.<br/><br/>“No problem. After we level up, we will still have a lot of resources left. The Master of the Dragon Queen can nurture another companion for us. It will be sufficient for him to level up to the level of a ruler at level four.”<br/><br/>Xiao Lan replied.<br/><br/>“Alright, let’s level up to the level of a ruler at level seven first!”<br/><br/>Wang Xian said with a smile on his face.<br/><br/>Xiao Lan and the small house immediately responded. They opened their mouths and the corpses entered his stomach.<br/><br/>Gray energy surged from their bodies.<br/><br/>“Xiao Xian, I’ll nurture another Kun!”<br/><br/>Lan Qingyue said with a smile.<br/><br/>“Yes, three kun. With their strength, our dragon palace will have some ability to fight against the peak races in the Starry Universe!”<br/><br/>Wang Xian nodded his head.<br/><br/>With the addition of the Little Blue House and one kun, they would be able to fight against three masters at the seventh level.<br/><br/>“Also, it’s best if you can improve yourself as soon as possible.”<br/><br/>Wang Xian said.<br/><br/>Now, as long as he improved a little, his strength would be terrifying.<br/><br/>With the help of the Netherspirit avatar, he could really fight against any peak races in the starry universe.<br/><br/>Of course, it was just a fight.<br/><br/>The top races had many trump cards. For example, the powerful water rope that he encountered last time and the defense of the angel race in the Aurora Domain.<br/><br/>These methods were not something that Wang Xian could compare to.<br/><br/>However, if the other party wanted to kill him, the possibility was too low.<br/><br/>However, Wang Xian still needed a lot of resources to level up.<br/><br/>Now that he had killed so many powerhouses from the angel and Phoenix clans, the resources in his hands were still half of what he needed to level up.<br/><br/>If I can kill another two or three powerhouses who are at the level six of the ruler realm, the resources i need to break through on my own will be enough<br/><br/>Wang Xian thought to himself.<br/><br/>His gaze swept to the side. Lan Qingyue had already started to cultivate the third kun.<br/><br/>He used the communication stone plate to contact prime minister turtle and asked about the situation.<br/><br/>When he got the situation of the Dragon Palace, a smile appeared on his face.<br/><br/>There were thirty-nine level one masters in the Dragon Palace!<br/><br/>The fire heart treasure land was a huge treasure for fire element cultivators.<br/><br/>The Dragon Palace had a lot of fire element cultivators. There were seven to eight hundred pure-blooded divine dragons.<br/><br/>However, the number of purebred divine dragons in the Dragon Palace is still a little low. There are only a few thousand of them. I need to increase them a little. Since I have nothing to do during this period of time, I might as well make a trip back to the nine-origin universe and wait for Xiao Lan’s little house to be upgraded before making my move<br/><br/>He pondered in his heart and sent a voice transmission to Lan Qingyue, asking him to stay here by himself!<br/><br/>“An lie, bring me back to the nine-origin universe.”<br/><br/>Wang Xian instructed an lie who was beside him.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded. In the next second, they returned to the Dragon Palace!<br/><br/>The current Dragon Palace was located in a secret place at the edge of the nine-origin universe.<br/><br/>It would take hundreds of thousands of years for a peak race to find this place, even if they were to search with all their might!<br/><br/>If it wasn’t for an lie, the Dragon Palace wouldn’t have come here.<br/><br/>“Bring me to the heaven-splitting primordial land. Did you leave behind the demon spirit altar there?”<br/><br/>After returning to the Dragon Palace, Wang Xian asked an lie again.<br/><br/>“I left behind the Dragon King!”<br/><br/>An lie nodded. In the next moment, the surrounding scenery changed again and they arrived at the heaven-splitting primordial land.<br/><br/>Wang Xian’s figure moved. His gaze swept across his surroundings. He felt a destructive force coming from his body.<br/><br/>In the starry universe, his strength was suppressed by three levels. Here, he could travel to an extremely distant place with a sway of his body.<br/><br/>This feeling of not being suppressed by the universe made him feel very comfortable.<br/><br/>“Hehe!”<br/><br/>As he flew rapidly in the sky above the nine-origin universe, he realized that the heaven-splitting chaotic land was no longer as lively as it used to be.<br/><br/>According to the records on the communication stone plate, 30% of the disciples of the high-level races had entered the starry universe.<br/><br/>This was definitely an explosive number!<br/><br/>A large number of disciples had entered the starry universe, which also made the heaven opening primal continent much quieter.<br/><br/>Apart from the peak races, there were only a few weaklings who remained here.<br/><br/>And these weaklings, because of the departure of the strong, were able to occupy a very good training ground. Their strength could increase by tens of times compared to before.<br/><br/>Overall, this was a very good thing for the nine-origin universe.<br/><br/>After arriving at the land of blood plasma, Wang Xian went straight to the deepest spot.<br/><br/>He sat cross-legged at the seat below. The roots of the ancestral tree pierced into the ground and condensed the blood-refining fruit.<br/><br/>Time passed quickly.<br/><br/>However, in just a few decades, Wang Xian received a message.<br/><br/>It was an urgent message from Prime Minister Gui.<br/><br/>When he saw this message, he frowned slightly.<br/><br/>The strong practitioners of the Phoenix and Angel clans were hunting down the strong disciples of the Dragon Palace.<br/><br/>In just a few decades, more than 2,000 disciples of the Dragon Palace were killed or injured.<br/><br/>“It seems that the angel and Phoenix clans are really going all out. They must have powerful treasures to search for the disciples of the Dragon Palace.”<br/><br/>Wang Xian mumbled.<br/><br/>“Tell all the disciples of the Dragon Palace to hide in an Lie’s void pagoda. Don’t go out for the time being.”<br/><br/>He immediately sent a message.<br/><br/>Everything can wait until the Little Blue House completes its upgrade!\t\t\t\t\t\t</div>", "images": {}, "success": true}