{"id": 785, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073470.html", "title": "Chapter 3778 - 3778 3777 Was In An Uproar As The Battle Results Were Announced", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3778 - 3778 3777 Was In An Uproar As The Battle Results Were Announced</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3778 3777 was in an uproar as the battle results were announced<br/><br/>The battle ahead continued. Wang Yun watched quietly.<br/><br/>The Space Beast didn’t have the slightest ability to resist.<br/><br/>The powerful binding force amazed Wang Xian.<br/><br/>He watched from the side for half a month.<br/><br/>“I can’t wait until the space beast is killed by them. If the water rope can bind me, I’ll be in trouble.”<br/><br/>After watching from the side for half a month, Wang Xian was ready to make his move.<br/><br/>He couldn’t wait any longer.<br/><br/>His gaze swept across the other 20 water phoenixes.<br/><br/>There were six level five masters of the universe. The remaining 14 were all Level Four Masters of the universe.<br/><br/>If he made his move in an instant, it shouldn’t be too much of a problem to destroy them.<br/><br/>After destroying them, the other three level six masters of the universe would definitely fall into a passive position.<br/><br/>At that time, it would be impossible for the Space Beasts to restrain them. The attacks of the space beasts, coupled with his own attacks, would be enough to kill the three water phoenixes.<br/><br/>As he calculated in his heart, Wang Xian didn’t hesitate anymore. His body moved and he flew directly towards the battlefield.<br/><br/>His gaze was locked onto a level 5 master of the universe.<br/><br/>His speed was pushed to the limit in an instant.<br/><br/>“Crash!”<br/><br/>“There’s an intruder. Be careful!”<br/><br/>However, the moment Wang Xian flew towards them, before he arrived in front of them, a water phoenix holding a water rope with a Phoenix Claw roared loudly.<br/><br/>His gaze was locked onto Wang Xian’s position.<br/><br/>“Eh? He actually discovered himself. It seems that experts at this level have quite a few tricks up their sleeves.”<br/><br/>Wang Xian focused his gaze and didn’t hesitate at all.<br/><br/>“Nine-origin Domain!”<br/><br/>The domain was activated instantly and enveloped the group of water phoenixes who were at the fourth or fifth level.<br/><br/>“Oh no, be careful!”<br/><br/>“The one who dared to attack us should be the Dragon King of the Dragon Palace!”<br/><br/>The group of water phoenixes sensed this energy and their expressions changed drastically as they roared sternly.<br/><br/>“Damn the Dragon King of the Dragon Palace!”<br/><br/>When the three water phoenixes who were holding onto the water rope saw this scene, their expressions were abnormally ugly.<br/><br/>“Trap that Dragon King!”<br/><br/>They gritted their teeth and made a unanimous decision.<br/><br/>The three water phoenixes flapped their wings. The water rope instantly detached from the body of the space behemoth and enveloped Wang Xian.<br/><br/>The water rope completely ignored Wang Xian’s domain and coiled towards his body.<br/><br/>“What? What kind of treasure is this?”<br/><br/>Wang Xian revealed an astonished expression. His body moved and he quickly flew backward.<br/><br/>The moment he made his move, not only did he not manage to kill a water phoenix, he was even forced to retreat in an instant. This was something that he did not expect.<br/><br/>One must know that his current strength was sufficient to fight against a powerhouse who was at the seventh level of the Overlord realm.<br/><br/>“I still can’t underestimate the foundation of a peak race!”<br/><br/>Wang Xian thought to himself. He unleashed the incipient saint wings to its limit and instantly escaped from the area covered by the water rope.<br/><br/>“Roar!”<br/><br/>However, the moment they attacked Wang Xian with the water rope, the freed space beast went berserk.<br/><br/>Its entire body was covered in blood. It was extremely violent as it locked onto a level six water phoenix overlord and attacked him.<br/><br/>“This damn Dragon King has ruined our plan.”<br/><br/>The level 6 water Phoenix looked extremely embarrassed. They quickly controlled the water rope and tried to entangle the space beast again.<br/><br/>However, just as Wang Xian saw them attacking the space beast, his figure moved and four ghost clones appeared. They attacked the level 4 and Level 5 Water Phoenix once again.<br/><br/>“Netherworld avatars? How is this possible? How did the Dragon King Have Netherworld Avatars?”<br/><br/>Seeing the Netherworld avatars attacking them, the group of water phoenixes looked shocked as they roared loudly.<br/><br/>Netherworld avatars were the foundation of the Netherworld race. The reason why the Netherworld race was so powerful was largely due to the Netherworld avatars.<br/><br/>However, most of the Netherworld race experts who had reached the Overlord realm only had one netherworld avatars.<br/><br/>Two of them were already very rare.<br/><br/>Three of them were even more abnormal.<br/><br/>This was because although the underworld ghost clone was very strong, it was very troublesome to cultivate.<br/><br/>Unless there were underworld race experts who had lived for a long time and had devoured their own kind of experts.<br/><br/>Otherwise, most of the underworld race experts only had one or two underworld ghost clones.<br/><br/>How did the Dragon King Have Netherworld Ghost Clones?<br/><br/>And there were four of them?<br/><br/>This was simply unbelievable.<br/><br/>Wang Xian stared at them with a cold smile on his face.<br/><br/>The four Netherworld Ghost clones attacked the group of water phoenixes from four different directions, basically sealing off the surroundings.<br/><br/>The Netherworld Ghost clones were like black dragons, baring their fangs and brandishing their claws as they charged forward.<br/><br/>“Four Netherworld Ghost Clones? How is this possible? According to the rumors, the Dragon King has a companion elf. Why does he have Netherworld Ghost Clones?”<br/><br/>The three level 6 masters who had trapped the space beast saw this scene and their brows twitched.<br/><br/>They knew that the Dragon King had the combat strength to kill A Level 6 master of the universe.<br/><br/>But they didn’t know that he had four ghost doppelgangers.<br/><br/>Adding the rumored companion elf, they were practically invincible in the same level.<br/><br/>The three level 6 masters looked at each other with ugly expressions.<br/><br/>“Quick, come to our side!”<br/><br/>One of the level 6 water phoenixes hurriedly shouted!<br/><br/>In the current situation, they had already given up on the idea of continuing the battle.<br/><br/>They were not a match for the Dragon King at all. Moreover, there was a space beast here.<br/><br/>In the current situation, they could only escape.<br/><br/>As for escaping, they had a way!<br/><br/>“Quick, quick, go to the three seniors!”<br/><br/>When the group of water phoenixes heard the words of the three level six water phoenixes, they immediately approached them in a loud voice.<br/><br/>“Eh? At this time, we still have to gather together. Are you confident that you can escape?”<br/><br/>When Wang Xian saw this scene, his figure disappeared instantly.<br/><br/>His body instantly overlapped with a netherspirit clone and replaced it.<br/><br/>At the same time, he waved his arm and the five elements Millstone flew forward. The enormous five elements magic disc directly blocked the path of the water phoenixes and the three level six water phoenixes!<br/><br/>“Crash!”<br/><br/>He moved his body and flapped the primaless sacred wings to attack the water phoenixes again.<br/><br/>“Not good!”<br/><br/>The expressions of the twenty water phoenixes changed drastically when they saw that the path was blocked.<br/><br/>“This is the transformation of the Netherworld Ghost clan. How did this Dragon King know this too?”<br/><br/>The three water phoenixes, who were in the sixth stage of the ruler realm, who were controlling the space behemoth, narrowed their eyes slightly when they saw Wang Xian. Their expressions turned ugly instantly.<br/><br/>“Not only that, there’s also this terrifying millstone. What kind of treasure is this?”<br/><br/>Another expert who was in the sixth stage of the ruler realm roared.<br/><br/>They had their own trump cards, but they discovered that the Dragon King also had a terrifying trump card!<br/><br/>And his trump card was extremely terrifying!\t\t\t\t\t\t</div>", "images": {}, "success": true}