{"id": 793, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073486.html", "title": "Chapter 3786 - 3786 3785 Made Another Breakthrough", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3786 - 3786 3785 Made Another Breakthrough</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3786 3785 made another breakthrough<br/><br/>The third prince didn’t look too good!<br/><br/>He hadn’t had a good time ever since he provoked the Dragon Palace.<br/><br/>Even now, although the matters on the storm continent had nothing to do with him, it was still their Angel clan’s loss.<br/><br/>Most importantly, so far, they hadn’t found any traces of the disciples of the Dragon Palace except for the more than two thousand disciples they had killed in the beginning.<br/><br/>That was one thing.<br/><br/>Another thing was that the third prince now realized the seriousness of the problem.<br/><br/>The Dragon Palace used to be a small, high-level race.<br/><br/>He did not put it in his eyes at all.<br/><br/>But now, the Angel clan and the Phoenix clan had started to kill the disciples of the Dragon Palace crazily. The three thousand disciples they had killed were all at the peak of the venerable realm.<br/><br/>What kind of concept was this?<br/><br/>More than 3,000 disciples at the peak of the venerable realm had been discovered by them.<br/><br/>How many disciples of the Dragon Palace had they not discovered?<br/><br/>All of them were at the peak of the venerable realm?<br/><br/>Then, with so many disciples at the peak of the venerable realm, how many of them had broken through to the ruler realm?<br/><br/>When they thought of this, they were terrified!<br/><br/>Maybe the Dragon Palace would continue to develop like this.<br/><br/>The Dragon Palace might have thousands of experts at the ruler realm.<br/><br/>At that time, their Angel clan would be in big trouble!<br/><br/>At that time, the Dragon Palace could really pose a threat to their Angel clan!<br/><br/>Then he would be a sinner of the Angel clan!<br/><br/>“Third prince, what should we do now? We can’t find the disciples of the Dragon Palace at all. They seem to have disappeared into thin air, as if they are no longer in the starry universe!”<br/><br/>An expert of the Angel clan said to him from the side.<br/><br/>“Let us go to the storm continent to have a look first. Let’s Go There!”<br/><br/>The third Prince said with a gloomy face.<br/><br/>“Third prince, could it be that the situation in the storm continent is related to the Dragon King of the Dragon Palace? After all, that place was once occupied by the Dragon King of the Dragon Palace? Could it be that the Dragon King of the Dragon Palace used some kind of method to lure the space beasts there?”<br/><br/>A Level 7 universe dominator, the Dark Angel, guessed with a twinkle in his eyes.<br/><br/>His words made the third prince’s face turn even gloomier.<br/><br/>“According to the information reported by the reincarnated angel, there is no sign of the Dragon King. Moreover, the three level 4 universe Dominators are not something that the Dragon King can lure over!”<br/><br/>The third Prince said coldly!<br/><br/>When the Dark Angel saw that, he did not say anything!<br/><br/>“Let’s go and take a look!”<br/><br/>…<br/><br/>Time passed day by day. Wang Xian was in the Dragon Palace, and his dragon energy was increasing rapidly.<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Roar! Roar!”<br/><br/>A few years later, a terrifying roar and a dragon’s roar came from Wang Xian’s body!<br/><br/>“Ding, congratulations to host for increasing your level. You have broken through to the second level of the Universe Dominator.”<br/><br/>“Ding, congratulations to host for increasing your level. The nine origins dragon field has been strengthened.”<br/><br/>Name: Wang Xian<br/><br/>Race: Nine Origins Divine Dragon (man-dragon unity)<br/><br/>Level: second level of the Universe Dominator (nine transformations return to one)<br/><br/>Origin: 1% (99% needed for the next breakthrough)<br/><br/>Supernatural ability: ruling the water tribe (ruling the water tribe that is lower than your level)<br/><br/>Devouring creatures (devouring creatures to extract origin)<br/><br/>Control of the five elements<br/><br/>Cultivation Method: Divine Dragon Transformation<br/><br/>Divine ability: soul-absorbing, spirit-attaching<br/><br/>Law Divine Ability: Dragon Eye Lock, Five Elements Dragon Claw, Yin-yang realm-breaking, eight luminaries dragon scale, Sacred Dragon Shadow, Heavenly Dragon Eight Tribes, Dragon Tomb, Cloud Dragon Rising, true dragon body<br/><br/>Law aspect: eight dragon pillars, eight dragon avatars, towering dragon horns, Mighty Heavenly Dragon, God’s tail playing Pearl, Life Dragon Breath, Shadow Dragon Avatars, dark dragon chasing, Dark Dragon Transformation, wind and Thunder Dragon Birth, Mad Dragon Star Explosion!<br/><br/>Domain: Nine Origins Dragon Domain<br/><br/>Control Law: metal, wood, water, fire, Earth, light, dark wind and thunder<br/><br/>Divine Kingdom: Dragon Palace<br/><br/>Dragon Palace owned: innate.<br/><br/>Dragon Palace members: 8060450<br/><br/>The system’s voice rang out, and nine-colored Divine Dragon Phantoms appeared around Wang Xian’s dragon body.<br/><br/>He lay there quietly, as if he was a divine being that could not be looked at directly.<br/><br/>Wang Xian slowly opened his eyes, and there was a glow in them.<br/><br/>He had made a breakthrough. He had finally made another breakthrough!<br/><br/>The current him was comparable to an existence at the seventh level of the universe dominator.<br/><br/>In the entire nine-origin universe, Wang Xian was the only one who had the ability to increase his speed and fight against those of a higher level.<br/><br/>Buzz! Buzz<br/><br/>His body moved and four Netherspirit avatars appeared around him. They were the Dragons of darkness with the darkness attribute.<br/><br/>He swept his gaze across and revealed a smile!<br/><br/>He flapped his incipient saint wings slightly and transformed into his human form.<br/><br/>Sensing the power coming from his body, he moved his palm and the five elements grinding mill rotated above him.<br/><br/>“Very strong!”<br/><br/>Wang Xian smiled but didn’t leave immediately. Xiao Lan and the rest would probably take a long time to achieve their breakthrough!<br/><br/>With a wave of his arm, the light judgement formation of the angel race appeared in front of him.<br/><br/>This light judgement formation could create a strike that could kill a level seven overlord.<br/><br/>If it wasn’t for Lan Qingyue, Xiao Lan would have been severely injured in an instant.<br/><br/>It would take at least a few hundred million years for her to recover!<br/><br/>“This light judgement formation is not an innate treasure. It is formed by fourteen mountains of light. There is a statue of the angel of light on it. It needs to be controlled by these sharp swords!”<br/><br/>Wang Xian looked at the treasure with a glint in his eyes.<br/><br/>This treasure was indeed very strong. It was not bad for defense.<br/><br/>However, he still did not dare to use it.<br/><br/>“Let’s see if the tai chi dragon plate can swallow it. If it can swallow it, the energy contained in this angel’s judgement is enough to break through the Tai Chi Dragon Plate!”<br/><br/>He mumbled and the Tai Chi Dragon Plate appeared below.<br/><br/>The two divine dragons of darkness and light started to reverse. Wang Xian moved his palm and energy was added to it. Little by little, it began to destroy the Divine Mountain of light that was Angel’s judgment!<br/><br/>One of the mountains was slowly being absorbed with the help of the Tai Chi Dragon Plate and Wang Xian.<br/><br/>“It’s working!”<br/><br/>Wang Xian’s eyes lit up when he saw this scene.<br/><br/>“If the Tai Chi Dragon Plate can achieve another breakthrough, it will be a complete slaughter when I face an expert who is at level seven!”<br/><br/>His eyes were filled with excitement, and he immediately began to help the Tai Chi Dragon Plate Devour Angel’s judgement!<br/><br/>Time passed quickly again.<br/><br/>Xiao Lan and the others were also improving quickly.<br/><br/>The Tai Chi Dragon Plate was also absorbing quickly.<br/><br/>Buzz! Buzz! Buzz<br/><br/>A few thousand years later, the tai chi dragon plate trembled violently.<br/><br/>Roar! Roar! Roar<br/><br/>The entire dragon plate slowly solidified and turned into two true light and dark dragons!<br/><br/>The pupils of one light and dark divine dragon were dark while the pupils of the other light and dark divine dragon were bright!<br/><br/>Waves of powerful aura surged out in all directions.<br/><br/>There were only three out of the fourteen light and dark divine mountains in the light judgment formation above.<br/><br/>The rest were all absorbed!<br/><br/>The Tai Chi Dragon Disc was completed all of a sudden.<br/><br/>Wang Xian’s strength had received another huge boost.<br/><br/>The two light and Dark Divine Dragons of the Tai Chi Dragon disc revolved and circled around Wang Xian, forming an extremely powerful defense!<br/><br/>It could withstand the attack of a master of level seven.<br/><br/>Once it was blocked, the attack would rebound!\t\t\t\t\t\t</div>", "images": {}, "success": true}