{"id": 790, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073480.html", "title": "Chapter 3783 - 3783 2782 Xiao Lan’S Small House Was Upgraded", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3783 - 3783 2782 Xiao Lan’S Small House Was Upgraded</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3783 2782 Xiao Lan’s small house was upgraded<br/><br/>Prime Minister Gui listened to Wang Xian’s orders and ordered all the disciples of the Dragon Palace not to go out for the time being.<br/><br/>Wang Xian even ordered them to leave the fiery heart treasured land for the time being.<br/><br/>He left an lie there to watch.<br/><br/>Time passed by quickly. In the blink of an eye, a thousand years had passed.<br/><br/>A piece of good news reached Wang Xian.<br/><br/>The upgrade of Xiao Lan’s small house was over!<br/><br/>Both of them had advanced to the level four of the Universe Overlord. In the starry universe, they were strong enough to fight against nine-origin universe masters who were at the level seven of the universe overlord.<br/><br/>Wang Xian was not in a hurry to go back and plan what to do next. He was still waiting.<br/><br/>He was waiting for the third kun to advance to the level four of the universe overlord.<br/><br/>With three Kun at the level four of the universe overlord, he could carry out some plans.<br/><br/>After a few thousand years, the news that the third Kun had completed its upgrade came!<br/><br/>Wang Xian opened his eyes and stood up with a smile on his face.<br/><br/>He sent a message to an lie and asked him to rush over immediately.<br/><br/>Very soon, an lie appeared beside him.<br/><br/>In the next second, he disappeared without a trace!<br/><br/>When they reappeared, they were already beside the three gigantic space beasts.<br/><br/>Xiao Lan’s little house and the last one, Xiao Bai.<br/><br/>“Xiao Xian!”<br/><br/>Lan qingyue smiled when she saw him coming over.<br/><br/>“Eh? Qingyue, you have also broken through? You have also reached the level of a ruler at level four?”<br/><br/>Wang Xian looked at her with a surprised expression.<br/><br/>“Yes, Xiao Lan’s little house and Xiao Bai have improved. The strength that they have given me back is enough for me to reach the level of a ruler at level four.”<br/><br/>Lan Qingyue said with a smile.<br/><br/>“I didn’t expect you to improve so quickly, qingyue.”<br/><br/>Wang Xian shook his head.<br/><br/>He had spent so much time. It was extremely difficult for him to improve by one stage.<br/><br/>On the other hand, Lan Qingyue had made a rapid breakthrough under the help of Xiao Lan and the others.<br/><br/>It was really incomparable!<br/><br/>“Xiao Xian, I heard from Prime Minister Gui that the Angel clan and the Phoenix clan are hunting down the disciples of our Dragon Palace. This time, we will teach them a good lesson.”<br/><br/>Lan Qingyue’s eyes sparkled as she spoke.<br/><br/>“Yes!”<br/><br/>Wang Xian nodded. “I have already planned everything. However, I will not attack the Angel race this time. Qingyue, don’t attack them openly either. Just let Xiao Lan and the rest do it.”<br/><br/>“As long as Xiao Lan and the rest can kill some sixth-level masters of the universe or a large number of fifth-level masters, they will be able to gather the resources I need to upgrade. Once I upgrade, I will have no fear of the two peak races.”<br/><br/>He spoke.<br/><br/>He had already made his plan and had already chosen his target.<br/><br/>He was just waiting for Xiao Lan and the rest. Now, the time was ripe and he could make his move!<br/><br/>“Okay, I will listen to your instructions, Xiao Xian!”<br/><br/>Lan qingyue nodded.<br/><br/>“The two peak races must have some kind of treasure that can search for the Masters of Our Divine Dragon Race. Now that we have entered Xiao Lan’s body, his body should be able to block such a search!”<br/><br/>Wang Xian said to Lan Qingyue.<br/><br/>“There shouldn’t be a problem. Xiao Lan and the rest have another space in their bodies. In addition to Xiao Lan and the rest’s current strength, it’s basically impossible to find them.”<br/><br/>Lan qingyue nodded. Their bodies moved and flew into Xiao Lan’s stomach.<br/><br/>Lan Qingyue waved her arm and Xiao Lan and the rest’s vision appeared in front of them.<br/><br/>“Xiao Lan, I’ll pass you the map and fly over there.”<br/><br/>Wang Xian saw that the communication stone plate could no longer communicate with them and knew that they were in a special space.<br/><br/>The communication stone plate was no longer effective. However, he had memorized the current map in his mind and passed it to Xiao Lan immediately.<br/><br/>“It’s the Dragon King!”<br/><br/>Xiao Lan nodded. After receiving the map from Wang Xian, she swayed her huge body slightly.<br/><br/>In front of her, a huge black hole appeared.<br/><br/>Xiao Lan dived into the black hole directly. Xiao Bai immediately followed behind her and disappeared in an instant!<br/><br/>The Way Xiao Lan and the rest were hurrying on their way was also very abnormal to Wang Xian.<br/><br/>At that time, there was a disadvantage to hurrying on their way. If they were to enter the territory of an even stronger person, they might be attacked.<br/><br/>However, that direction had already been explored by all the strong disciples of the nine-origin universe.<br/><br/>There was no danger there at all.<br/><br/>Xiao Lan and the rest were hurrying along while Wang Xian was chatting with Lan Qingyue.<br/><br/>More than a year passed very quickly. Wang Xian looked at the place in front of Xiao Lan and the rest with a smile on his face.<br/><br/>“Xiao Lan, lower your speed.”<br/><br/>Wang Xian ordered immediately. He looked at LAN qingyue and said, “Qingyue, I’m afraid you’ll have to go there to scout ahead of time.”<br/><br/>“No problem. I can communicate with Xiao Lan’s little house now. I can reach them in an instant. There won’t be any problems. Moreover, the Masters of the nine-origin universe at level eight don’t dare to step in. It’s fine.”<br/><br/>Lan Qingyue said with a smile.<br/><br/>Wang Xian nodded his head.<br/><br/>She moved and immediately flew forward.<br/><br/>She passed through the flying meteorites quickly and completely concealed herself.<br/><br/>Wang Xian’s first target was the storm continent.<br/><br/>The reason why he chose this place was firstly because of the metal meteorites here.<br/><br/>Secondly, ever since the scientists who had joined the angel race found out about it, it didn’t take long for the angel race to occupy this place.<br/><br/>The angel race had sent quite a number of great beings and armies to guard this place.<br/><br/>Among them, there were also quite a number of angels at the level six of the universe ruler realm.<br/><br/>In addition, their angel race had some defensive war weapons, which were enough to fight against a great being at the level seven of the universe ruler realm.<br/><br/>With such power, they could occupy this place.<br/><br/>Lan Qing Yue quickly flew inside. With her power, it would be very difficult for the other party to discover her if she was careful.<br/><br/>“There are eight level six angels in the Universe Overlord realm. There are more than a dozen bright mountains around. There are many statues of angels on the mountains. This should be a defensive treasure. I’m not sure how strong it is exactly!”<br/><br/>Lan qingyue came to the front of the storm continent. Looking at the area occupied by the angel race, she muttered.<br/><br/>Her figure flashed and disappeared.<br/><br/>In the next moment, she appeared beside Wang Xian!<br/><br/>“Xiao Xian, I’ve already checked. There are eight angels who can sense the level six realm. There’s also a defensive treasure. I don’t know how strong it is!”<br/><br/>“I think we can attack it directly!”<br/><br/>Lan Qingyue said to him.<br/><br/>“Sure. Have Xiao Lan, Xiao Bai, and the others lock down the left, right, and rear areas respectively.”<br/><br/>Wang Xian immediately said.<br/><br/>Block off the left, right, and rear. In front of them was the storm continent. There were even more space beasts there, so they didn’t dare to escape there.<br/><br/>If they could kill all eight level six angels, the resources they had should be enough to upgrade themselves!<br/><br/>Wang Xian thought to himself as his eyes sparkled.<br/><br/>Xiao Lan, Xiao Bai, and the rest received the order and immediately flew forward.\t\t\t\t\t\t</div>", "images": {}, "success": true}