{"id": 795, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073490.html", "title": "Chapter 3788 - 3788 The 3787 Dragon King Had Arrived!", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3788 - 3788 The 3787 Dragon King Had Arrived!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3788 The 3787 Dragon King had arrived!<br/><br/>The opening of a new world passage did not attract his attention!<br/><br/>“Demon?”<br/><br/>However, at this moment, in front of the storm continent, the third prince was standing on one side of a group of meteorites.<br/><br/>He suddenly picked up the finger dragon bell in his hand and began to change on the needle of the Finger Dragon Bell, pointing in a certain direction!<br/><br/>“A person with the Divine Dragon bloodline has appeared. According to the energy shown on the Finger Dragon Bell, that Dragon King should have appeared!”<br/><br/>The third Prince said, his eyes filled with killing intent.<br/><br/>“Let’s go. There’s nothing happening on the storm continent. Let’s go hunt the Dragon King!”<br/><br/>An angel said coldly.<br/><br/>“Let’s Go!”<br/><br/>The third prince didn’t hesitate. A divine mountain appeared beneath them, and a pair of wings slowly appeared. It looked very strange.<br/><br/>The entire mountain quickly flew in one direction.<br/><br/>The speed of the Divine Mountain was very fast, not any faster than a ruler at the 8th rank.<br/><br/>However, no matter how fast they were, they were still not as fast as little blue and the others.<br/><br/>Little Blue was a space traveler.<br/><br/>Along the way, he met some experts from the 9-origin universe.<br/><br/>However, after they felt the terrifying might, little blue and the others had already disappeared!<br/><br/>Without the strength of a ruler above level five, they could not see their speed at all.<br/><br/>After flying in the air for two years, Wang Xian and the rest finally arrived at the territory in front of the royal family’s trading grounds!<br/><br/>“Qingyue, let Xiao Lan and the rest stay here first. We will go there first.”<br/><br/>Wang Xian’s eyes flickered as he said to Lan Qingyue.<br/><br/>“Sure. I can let Xiao Lan and the rest go to the Kun’s territory first. Without the strength of a ruler at level seven or eight, it will be difficult to discover them.”<br/><br/>Lan qingyue nodded. “And now that they have broken through, not only can I reach them in an instant, they can also come to me in an instant!”<br/><br/>“That’s even better!”<br/><br/>The corners of Wang Xian’s mouth curled up slightly. The two of them moved and flew rapidly towards the royal family’s trading ground!<br/><br/>The figure of Xiao Lan and the rest slowly disappeared!<br/><br/>After flying for more than ten days, they had completely stepped into the surroundings of the trading ground.<br/><br/>From Afar, they could see some huge life planets!<br/><br/>There were still many strong disciples flying around the life planets.<br/><br/>Wang Xian flew over without any concealment. He could sense the divine dragon aura on his body as long as he sensed it.<br/><br/>As he continued flying forward, life planets that were connected to each other appeared one after another!<br/><br/>In the middle, there was a special planet.<br/><br/>This planet was rectangular in shape and there was a plant growing on it. This plant was exuding a strong vitality.<br/><br/>On the plant, there were some fruits that were on the level of a ruler.<br/><br/>However, these fruits were not ripe yet.<br/><br/>The entire plant blotted out the sky and the Sun, and it was even bigger than a planet!<br/><br/>And that rectangular planet was like a long corridor!<br/><br/>This was the core of the royal family’s trading ground, the famous trading corridor in the starry universe!<br/><br/>In this trading corridor, there were many buildings.<br/><br/>There were buildings in the style of the Elf clan, and buildings in the style of the Angel clan.<br/><br/>There were also buildings in the styles of the divine tiger, Black Tortoise, celestial nation, saint, and so on.<br/><br/>These buildings represented the base of a peak race in the trading ground.<br/><br/>Through telepathy, one could sense a large number of disciples from the peak races.<br/><br/>Among them, the angels and Phoenixes were not in the minority.<br/><br/>There were even powerhouses from the angels and Phoenixes stationed here.<br/><br/>In short, there were a large number of strong disciples from the peak races gathered here.<br/><br/>Wang Xian flew straight in and soon arrived at the planet in the long trading corridor.<br/><br/>“Huh?”<br/><br/>When he flew over, an expert from the Celestial Nation, who was in an illusory palace above his head, looked at Wang Xian. His eyes were filled with astonishment.<br/><br/>He sensed it slightly and could feel a powerful divine dragon pressure from Wang Xian’s body.<br/><br/>His expression changed slightly and he quickly lowered his head. He glanced at Wang Xian with some respect and walked to the side.<br/><br/>However, a storm was brewing in his heart!<br/><br/>The Dragon King of the Dragon Palace had actually come to the long corridor to trade?<br/><br/>Furthermore, he was so casual with a lady from the Dragon Palace by his side.<br/><br/>This? ? ? ?<br/><br/>Was the Dragon Palace not afraid of the powerhouses from the Angel and Phoenix clans?<br/><br/>Could it be that the rules of the royal clan forbade anyone from fighting?<br/><br/>However, could this rule restrict the Phoenix clan and the Angel Clan?<br/><br/>Wang Xian ignored the powerhouse from the celestial nation. He moved and came to the long trading corridor with LAN Qingyue.<br/><br/>“Let’s find a place to drink tea!”<br/><br/>Wang Xian brought Lan Qingyue and flew to a place with a smile on his face.<br/><br/>They flew all the way to a place not far away from the encampment of the Angel clan and the Phoenix clan.<br/><br/>He saw a teahouse that was used for eating and relaxing. He entered the teahouse directly.<br/><br/>When Wang Xian walked all the way here, he attracted the attention of many experts around him.<br/><br/>They looked at the Dragon King of the Dragon Palace in a daze. Their faces were filled with shock.<br/><br/>“Hiss, am I seeing things? The Dragon King of the Dragon Palace actually appeared here?”<br/><br/>“No, it’s the Dragon King of the Dragon Palace. It’s 100% true. The dragon aura of the Divine Dragon can’t be hidden. My God, this… This Dragon King of the Dragon Palace actually dares to come here?”<br/><br/>“According to the rules of the royal family, any strong disciple is forbidden to fight here. However, the Dragon King of the Dragon Palace and the Phoenix clan and the Angel clan are mortal enemies. Why would the two peak races be afraid of this rule?”<br/><br/>“The Dragon King of the Dragon Palace is really unscrupulous. Isn’t he afraid of the Angel clan and the Phoenix Clan? I heard that the Angel clan and the Phoenix clan have deployed a large number of experts to hunt down the experts of the Dragon Palace.”<br/><br/>“They must have some trump cards. You should know that the Phoenix clan and the Angel clan have never been able to gain any advantage over the Dragon King!”<br/><br/>Discussions could be heard in the surroundings.<br/><br/>At the same time, the news that the Dragon King of the Dragon Palace had arrived at the long trading corridor was spreading at a terrifying speed.<br/><br/>This news had spread to all the top races and all the powerhouses.<br/><br/>The speed at which it spread was extremely terrifying!<br/><br/>“Bring out the most precious specialty food and bring out the best tea!”<br/><br/>However, at this moment, Wang Xian walked into the teahouse with a carefree expression and instructed the staff of the hotel.<br/><br/>“Yes, yes, it’s the Dragon King!”<br/><br/>A disciple in the teahouse immediately replied respectfully.<br/><br/>Cold sweat appeared on his forehead. While he was preparing the food, he was also preparing to store some precious items.<br/><br/>He was even considering whether he should escape now?<br/><br/>“I should escape. After I have served the food, I should leave this place. My life is more important!”<br/><br/>He mumbled.<br/><br/>At the same time, as the host of this place, as the creator of the trading venue, as well as the creator of the rules of this area, the royal family received the news of Wang Xian’s arrival at the first instance.\t\t\t\t\t\t</div>", "images": {}, "success": true}