{"id": 798, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073496.html", "title": "Chapter 3791 - 3791 3,790 Seconds", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3791 - 3791 3,790 Seconds</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3791 3,790 seconds<br/><br/>“What?”<br/><br/>“Hiss, how is this possible? What a terrifying power!”<br/><br/>“This… this… level seven overlord. This Dragon King is an existence at level seven overlord. He has broken through to level seven overlord!”<br/><br/>At this moment, all the strong disciples of the Phoenix clan and the Angel clan were feeling the terrifying aura from Wang Xian’s body. When they felt the terrifying aura from the Netherworld Ghost Avatar, their faces were filled with shock.<br/><br/>The sound of their great archangel of drought letting them escape in fear and the voice of the Lord Water Phoenix, who was the overlord of the seventh level, letting them escape was also heard by them!<br/><br/>At this moment, the hearts of all the strong disciples of the Angel clan and the Phoenix clan were thumping violently!<br/><br/>How could this Dragon King of the Dragon Palace break through so quickly?<br/><br/>They were filled with disbelief and shock!<br/><br/>“Roar!”<br/><br/>However, they were still too slow to escape!<br/><br/>All the powerful disciples of the Angel clan and Phoenix clan had surrounded Wang Xian.<br/><br/>The distance between them was very close.<br/><br/>From their point of view, they had already surrounded the dragon king of the Dragon Palace!<br/><br/>However, what they did not know was that they were surrounded by the Dragon King of the Dragon Palace!<br/><br/>At such a close speed, the divine dragons of the four netherspirit avatars spat out terrifying flames and directly covered all the powerful disciples of the Angel clan!<br/><br/>“Angel Kingdom’s Domain!”<br/><br/>“Fire Phoenix’s Nirvana Domain!”<br/><br/>The pupils of the archangel of drought and the Water Phoenix, who was at level seven, contracted slightly. They instantly unleashed their domains!<br/><br/>“Crash!”<br/><br/>However, the moment they unleashed their domains, Wang Xian charged forward instantly.<br/><br/>The domain that they had just unleashed was directly broken through by Wang Xian!<br/><br/>“Get lost!”<br/><br/>When the archangel of drought saw Wang Xian rushing over, his expression changed drastically. With a loud roar, he waved his arm and an incomparably huge army of angels appeared behind him!<br/><br/>At the same time, the domain that belonged to him was pressing towards Wang Xian!<br/><br/>“Hehe!”<br/><br/>Wang Xian snorted coldly. The tai chi dragon around him spun and charged straight into the domain.<br/><br/>Rip<br/><br/>The sound of the domain breaking could be heard from the archangel of drought. When he saw this scene, his pupils constricted slightly and his face was filled with astonishment.<br/><br/>His domain was actually being charged at by someone of the same level?<br/><br/>How was this possible?<br/><br/>Crash<br/><br/>Wang Xian flapped his divine wings and instantly appeared in front of the archangel of drought. His arm transformed into a dragon claw as he clawed at him!<br/><br/>With Wang Xian’s current strength, the divine wings of drought and the Tai Chi Dragon Disc after his breakthrough, he could definitely fight against six of them by himself!<br/><br/>Unless there were experts of the same level who possessed extremely terrifying treasures, they were no match for him!<br/><br/>The archangel of drought had his own trump card, which was that his Angel Army had a battle Angel who was in the seventh level.<br/><br/>However, there was still a huge gap between this trump card and Wang Xian!<br/><br/>The Dragon Claw clawed at his body. He hurriedly raised his arm to block it!<br/><br/>Boom<br/><br/>However, his defense was unable to block Wang Xian’s attack!<br/><br/>The Dragon Claw coupled with the impact force of the Tai Chi Dragon Plate immediately broke through his defense and caught him in his hand.<br/><br/>The Tai Chi Dragon Plate began to spin, crushing him as if it was made of metal!<br/><br/>“Ah!”<br/><br/>Archangel withering in pain, his body began to collapse!<br/><br/>At the same time, his domain began to collapse!<br/><br/>With a single move, Archangel withering was instantly killed!<br/><br/>He kept Archangel Withering’s corpse, and with a wave of his arm, all the Battle Angels lost their masters and were kept by him.<br/><br/>His gaze landed on the level seven water Phoenix!<br/><br/>“It’s your turn!”<br/><br/>Wang Xian moved his body and flapped his incipient saint wings. He locked onto the Water Phoenix and charged directly into his domain!<br/><br/>“Oh no, archangel of drought was killed by the Dragon King!”<br/><br/>“How is this possible? Archangel of drought was killed by the Dragon King in an instant!”<br/><br/>When archangel of drought’s domain collapsed, the level six experts of the angel race sensed that archangel of drought’s aura had also disappeared. They widened their eyes and roared in disbelief!<br/><br/>“Hiss, how is this possible?”<br/><br/>“With such strength, the Archangel was killed instantly by the Dragon King. He was killed instantly in just one move!”<br/><br/>“What kind of strength is the Dragon King? Level eight overlord? No, he hasn’t reached that yet. It’s the Dragon King’s trump card that is too terrifying. His speed and defense are both extremely terrifying!”<br/><br/>“This… this…”<br/><br/>In the surrounding area, the royal family’s experts sensed that the archangel of drought was instantly killed by Wang Xian. Their bodies trembled as they roared in shock!<br/><br/>“The Archangel of the Angel family, the overlord of the level seven realm, was instantly killed?”<br/><br/>“Is the Dragon King of the Dragon Palace Invincible? How did he improve so quickly?”<br/><br/>“He instantly killed the overlord of the level seven realm. This strength…”<br/><br/>In the long corridor, the experts of the other peak races and the disciples of the high-level races were stunned!<br/><br/>They had never thought that this would happen.<br/><br/>Even if there were experts who thought highly of the Dragon King, they would at most think that the Dragon King had a trump card.<br/><br/>But now it seemed that this was more than a trump card.<br/><br/>The Dragon King was obviously here to kill the experts of the angel and Phoenix races.<br/><br/>Surround the Dragon King?<br/><br/>The Dragon King is here to kill you!<br/><br/>However, no one expected the strength that the Dragon King displayed.<br/><br/>Everyone knew that the Dragon King was only able to kill a level 6 sovereign not long ago.<br/><br/>How long had it been before he broke through again!<br/><br/>“It’s too scary to provoke such an enemy!”<br/><br/>Some experts of the peak races murmured.<br/><br/>At this moment, all the experts from the peak races felt that the Dragon King was extremely terrifying!<br/><br/>His speed of improvement was terrifying!<br/><br/>“Nirvana of the Phoenix!”<br/><br/>“Unleash the wings of the Water Phoenix, kill!”<br/><br/>When the Water Phoenix, who was at the seventh level, saw Wang Xian charging at him, his expression changed drastically. He immediately ignited his flame of life and attacked Wang Xian.<br/><br/>The water energy contained a faint blood-red color. Countless wings condensed into a terrifying Phoenix head and its extremely sharp mouth attacked Wang Xian!<br/><br/>“Hehe!”<br/><br/>Wang Xian snorted coldly. He waved his arm and a stream of energy wrapped around his surroundings to defend himself.<br/><br/>At the same time, the Taiji dragon coiled around him.<br/><br/>Boom<br/><br/>The energy struck his body. The defense in front of him collapsed and landed on the Taiji dragon coiled.<br/><br/>The Taiji dragon coiled changed its shape. The black and white patterns were like dragon scales.<br/><br/>The attack landed on it but was completely blocked.<br/><br/>At the same time, a backlash force rushed towards Water Phoenix!<br/><br/>“Pu!”<br/><br/>The next moment, he spat out blood and his body trembled violently.<br/><br/>“What kind of strange weapon is this?”<br/><br/>Water Phoenix, who was at the seventh level of the Dominator realm, had a look of despair in her eyes.<br/><br/>“Pu!”<br/><br/>Wang Xian flew over and his dragon claws penetrated his body. The energy that was extinguished rushed into his body!<br/><br/>The second ruler in the seventh level was still killed instantly!\t\t\t\t\t\t</div>", "images": {}, "success": true}