{"id": 797, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073494.html", "title": "Chapter 3790 - 3790 3789 Insta-Killed A Ruler Of The 7Th Rank", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3790 - 3790 3789 Insta-Killed A Ruler Of The 7Th Rank</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3790 3789 insta-killed a ruler of the 7th rank<br/><br/>“Eh?”<br/><br/>When the royal experts heard the words of the angel and Phoenix experts, they felt a little helpless.<br/><br/>They looked at each other, and an old man in the center shook his head.<br/><br/>“Weng!”<br/><br/>The expert in the center moved his hand, and a model of the trading corridor appeared in his hand.<br/><br/>With a move of his hand, waves of energy shot towards the model in his hand.<br/><br/>“Weng!”<br/><br/>In the next moment, the entire trading gallery was enveloped by a wave of energy.<br/><br/>A thick, earthy yellow energy covered the entire trading gallery.<br/><br/>However, only the angel race and the Phoenix race were not covered by the energy.<br/><br/>This was a defensive technique of the royal family.<br/><br/>“What is this?”<br/><br/>“The energy actually covered the entire trading gallery. This powerful defensive power can at least block the attacks of a ruler at the seventh rank.”<br/><br/>“It should be able to withstand the attack of a master at the eighth level. After all, a peak race is a peak race. No wonder the royal family said that this place was very safe. It is indeed very safe.”<br/><br/>When the surrounding experts and disciples saw the sudden appearance of the defense, they revealed a trace of surprise and a smile.<br/><br/>At the same time, they also let out a sigh of relief.<br/><br/>After all, the Dragon King of the Dragon Palace and the Phoenix clan of the Angel clan were at a high level.<br/><br/>Once they were affected, they could die instantly.<br/><br/>…<br/><br/>“What?”<br/><br/>At this moment, in the void, the third prince and the experts of the Angel clan were flying in the void.<br/><br/>Suddenly, a message came.<br/><br/>When the third prince saw this message, he slightly raised his eyebrows and looked surprised.<br/><br/>“How dare the Dragon King of the Dragon Palace appear in the Trading Gallery?”<br/><br/>The third prince murmured. He hesitated for a moment and immediately sent a message.<br/><br/>But soon, he received a message.<br/><br/>“Third prince, if you don’t come, the Dragon King of the Dragon Palace and the experts of the Phoenix clan will kill him!”<br/><br/>It was a message from the archangel of drought.<br/><br/>He frowned slightly when he saw this confident message.<br/><br/>He had a bad premonition that the Dragon King would appear in the long trading corridor so brazenly!<br/><br/>However, when he sent another message, the archangel of drought did not reply immediately!<br/><br/>In the long trading corridor, after the archangel of drought received the reply from the third prince, he immediately gestured to the experts of the Phoenix clan across from him.<br/><br/>Buzz! Buzz<br/><br/>Without any hesitation, he shot out a sword of light.<br/><br/>A water sword slashed directly into the restaurant below!<br/><br/>“Dragon King of the Dragon Palace, come out and face your death. Since you dare to come here, leave your corpse behind!”<br/><br/>The Archangel of droughts roared with a grim expression!<br/><br/>Boom<br/><br/>Two sharp swords landed in the restaurant and the entire restaurant exploded instantly.<br/><br/>Wang Xian sat there. The tai chi dragon plate wrapped around him and Lan Qingyue. He sat there quietly without moving!<br/><br/>The two attacks landed on his body and were easily blocked by the Tai Chi Dragon Plate.<br/><br/>Furthermore, a strong backlash force attacked the archangel of droughts and the Water Phoenix.<br/><br/>“Huh?”<br/><br/>“What?”<br/><br/>The expressions of the archangel of droughts and the Water Phoenix who was in the seventh level of the realm changed slightly.<br/><br/>Their bodies trembled as a surge of energy blocked the backlash!<br/><br/>A solemn look appeared in their eyes instantly.<br/><br/>“It’s that Dragon King!”<br/><br/>“It’s him!”<br/><br/>“Eh? He was actually able to block the casual attack of our archangel of drought. As expected of the Dragon King, he was able to kill a powerhouse at the sixth level of the Overlord realm easily.”<br/><br/>The group of angels and Phoenixes around didn’t notice the backlash of the Archangel of drought and the others. Their gazes were locked onto the position below.<br/><br/>Wang Xian was sitting in front of a table. Opposite him was a woman.<br/><br/>The tai chi dragon coiled around and blocked the surrounding energy!<br/><br/>At this moment, Wang Xian raised his head and swept his gaze across all the Angels and Phoenixes. A faint smile appeared on his face!<br/><br/>“Very good. All of them are here. There are over 2,000 angels and over 3,000 phoenixes. Hehe, this should be the most I can kill.”<br/><br/>Wang Xian spoke and said faintly.<br/><br/>The trading corridor was a very lively place. Disciples below the level of the Masters of the two peak races were all here.<br/><br/>There were quite a number of them!<br/><br/>“Arrogant Dragon King, today is the Day You Die!”<br/><br/>A phoenix that was in the level six realm heard Wang Xian’s words and said with a ghastly expression.<br/><br/>“Is that so? Then let’s see who dies first today!”<br/><br/>Wang Xian smiled and looked at Lan Qingyue beside him. “Let me do some exercise and kill them all!”<br/><br/>Lan qingyue nodded with a smile.<br/><br/>Buzz<br/><br/>Wang Xian’s voice disappeared and his figure instantly appeared in the middle of the group of experts from the Angel and Phoenix clans.<br/><br/>This terrifying speed caused many of the experts from the angel and Phoenix clans to be unable to see clearly.<br/><br/>When the archangel of drought and the Water Phoenix, who was the overlord of level seven, saw this scene, their pupils constricted slightly.<br/><br/>The bad premonition in their hearts just now became even more intense!<br/><br/>Wang Xian stood there quietly and turned around gently. Around him, Netherworld avatars appeared one after another!<br/><br/>“Netherworld avatars. These are the Netherworld avatars of our Netherworld race. This Dragon King actually possesses them. How Strange. Did he obtain some treasures of our Netherworld Race?”<br/><br/>“According to the records, it’s not that there are no experts of other races who have Hades’ghost clones of our Hades race. This Dragon King is very lucky, but I don’t know that he only has Hades’ghost clones of our Hades race and the accompanying elves of the ELF race. Isn’t this luck too heaven-defying?”<br/><br/>“That’s not right. Did you see the Dragon King’s speed just now?”<br/><br/>Not far away, hundreds of underworld race experts looked over and began to discuss.<br/><br/>But at this moment, an underworld race expert suddenly asked in shock.<br/><br/>Because of the underworld ghost avatar, they had somewhat neglected the Dragon King’s speed just now!<br/><br/>“Also, why does the energy of this underworld ghost avatar feel much stronger than my Underworld Ghost Avatar?”<br/><br/>An expert of the Netherworld race, who was at level six, growled in a low voice. His eyes were filled with disbelief!<br/><br/>Could it be that this Dragon King was powerful?<br/><br/>“Die!”<br/><br/>Wang Xian stared at them with a cold expression on his face. The four Netherworld ghost avatars around him instantly transformed into divine dragons and attacked all the experts of the angel race and Phoenix race!<br/><br/>“Roar Roar Roar!”<br/><br/>“Roar Roar Roar Roar!”<br/><br/>A dragon’s roar sounded and the four netherspirit avatars let out a terrifying roar.<br/><br/>The power of a level seven overlord erupted at this moment!<br/><br/>“Hiss!”<br/><br/>The hearts of the archangel of drought and the Water Phoenix who was a level seven overlord trembled violently.<br/><br/>“Run, run, all the powerhouses of the Angel clan and Phoenix clan, run!”<br/><br/>They hurriedly shouted.<br/><br/>At this moment, they realized that the Dragon King’s strength had already reached the seventh level ruler realm.<br/><br/>Moreover, with his terrifying speed and the four ghost clones, they were no match for him!\t\t\t\t\t\t</div>", "images": {}, "success": true}