{"id": 796, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073492.html", "title": "Chapter 3789 - 3789 3788 Instantly Killed A Level 7 Overlord", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3789 - 3789 3788 Instantly Killed A Level 7 Overlord</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3789 3788 instantly killed a level 7 overlord<br/><br/>“The Dragon King of the Dragon Palace has come to our place?”<br/><br/>It was located in the middle of the trading corridor. This was where the royal family’s base was.<br/><br/>The royal family was a relatively low-key race among the twelve peak races.<br/><br/>Their strength might be slightly weaker among the peak races.<br/><br/>The royal family was mainly based on the family situation. Among the peak races, they were the only family that existed.<br/><br/>It was also the strongest family in the nine-origin universe.<br/><br/>However, even if they were weak, it was only for other top-tier races.<br/><br/>Their strength was still unattainable for the top-tier races.<br/><br/>Moreover, their family’s patriarch was also a powerhouse who survived the last calamity. There were still some peak-level masters in the family.<br/><br/>“Then why did the Dragon King of the Dragon Palace come to our place? To make a Deal?”<br/><br/>In the middle of the palace of the royal family, more than ten elders were sitting there, frowning slightly.<br/><br/>“I don’t know!”<br/><br/>An elder shook his head, “But the Dragon King of the Dragon Palace has swaggered into our place. The Angel clan and the Phoenix clan will definitely take action. They will definitely attack the Dragon King. What should we do?”<br/><br/>“It is indeed a troublesome matter. If there is only one peak race, they will still be wary of us. However, the angel and Phoenix clans are relatively strong among the peak races.”<br/><br/>An old man of the royal clan shook his head. He felt that it was very troublesome!<br/><br/>“Both sides have reached a point where they will not rest until one of them dies. Why don’t we leave the Dragon King here and do the two peak races a favor?”<br/><br/>An old man suggested.<br/><br/>“No, absolutely not. The Dragon Palace once sold a kind of soul-returning embryo fruit. With our arrangement here, it’s very easy to kill the Dragon King, but the Dragon King can definitely be resurrected. Once resurrected, our royal family will become the enemy of the Dragon Palace. The Dragon King’s growth rate is a bit strange, so it’s best not to interfere.”<br/><br/>“There’s no need to offend such an enemy just because of the favor between the angel race and the Phoenix race.”<br/><br/>As soon as he finished speaking, an old man immediately refused!<br/><br/>“If they want to fight, let them fight outside!”<br/><br/>After a few seconds of silence, an old man opened his mouth and said.<br/><br/>Everyone nodded.<br/><br/>“Deacon, the powerhouses from the angel race and the Phoenix race are gathering!”<br/><br/>At this moment, an expert from the royal clan flew over and reported loudly.<br/><br/>“Let’s go out!”<br/><br/>“The Angel and Phoenix clans both have level seven masters here. They’ll probably attack the Dragon King directly.”<br/><br/>As the experts from the royal clan spoke, they moved and flew out quickly.<br/><br/>When they flew out, they immediately saw a group of Angel and Phoenix clan’s experts floating in the air.<br/><br/>Waves of terrifying auras rushed towards their surroundings.<br/><br/>“Hehe, they are really fast!”<br/><br/>Wang Xian sat in the teahouse with a smile on his face. He sensed the auras of the experts around him and smiled.<br/><br/>“Two of them are at the level seven realm, thirteen of them are at the level six realm, and there are many others who are below the level six realm!”<br/><br/>Lan Qingyue sat at the side as she spoke with a twinkle in her eyes. A smile appeared on her face.<br/><br/>“HMM, very good. Killing them will bring a huge boost to the Dragon Palace. We will also be able to obtain a large amount of resources!”<br/><br/>Wang Xian nodded with a smile.<br/><br/>“According to my investigation on the communication stone plate, the Phoenix clan and the Angel clan have a base here. There should be a lot of treasures and resources here.”<br/><br/>Lan Qingyue said!<br/><br/>“That’s even better!”<br/><br/>Wang Yun nodded.<br/><br/>“Xiao Xian, should we make a move now?”<br/><br/>Lan Qingyue asked.<br/><br/>“No, let’s wait for them to make a move first. Let’s see what attitude the royal clan has.”<br/><br/>Wang Xian shook his head.<br/><br/>The main reason he came here was to destroy the powerhouses of the Angel clan and the Phoenix clan and obtain some resources.<br/><br/>He also told all the clans that the dragon palace was not to be trifled with.<br/><br/>He naturally would not provoke the royal clan for no reason.<br/><br/>He acted according to the rules of the other party.<br/><br/>Of course, if the powerhouses of the Angel clan and the Phoenix clan broke the rules here and they did not stop him, then he would not abide by the rules here.<br/><br/>The strength of the royal clan was relatively weak among the peak clans. Since the Angel clan and the Phoenix clan had provoked them, he was not afraid of anything else.<br/><br/>“Mm!”<br/><br/>Lan qingyue nodded.<br/><br/>“This Dragon King of the Dragon Palace is really arrogant. He actually dares to come here. Is he provoking us? Hehe, very good, very good!”<br/><br/>Outside the restaurant, a group of angels and Phoenixes had completely locked onto the restaurant.<br/><br/>The leader of the angels of light was flapping his wings, his entire body emitting a terrifying killing intent.<br/><br/>“Archangel of drought, join forces and kill him.”<br/><br/>A water phoenix flapped his wings and looked at the Archangel.<br/><br/>“Okay!”<br/><br/>“Surround the surrounding area!”<br/><br/>Archangel of drought immediately responded and ordered the surrounding experts of the Angel clan.<br/><br/>“Chirp! Chirp!”<br/><br/>The phoenixes chirped and their eyes were full of killing intent.<br/><br/>“Hiss, is there going to be a fight?”<br/><br/>“The Dragon Palace and the Phoenix clan of the Angel clan are mortal enemies. They are definitely going to fight!”<br/><br/>“Why did the Dragon King of the Dragon Palace come here? Isn’t he courting death?”? “There are seventh-level masters of the Angel clan and the Phoenix clan here. There are also many masters of other levels. According to the combat strength displayed by the Dragon King of the Dragon Palace, he is no match for them. Now, the Dragon King of the Dragon Palace is completely surrounded!”<br/><br/>“I don’t know what the Dragon King is going to do, but I’m afraid he will be in big trouble.”<br/><br/>“What about the royal clan? This is the territory of the royal clan. Will the throne let them fight here?”<br/><br/>In the surrounding area, all the powerhouses and disciples looked over in shock.<br/><br/>They were all discussing among themselves.<br/><br/>At the same time, this news spread quickly in the communication stone plate.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>“Phoenix clan, Angel clan, and Dragon King of the Dragon Palace in the restaurant, if you are going to fight, please go to the sky. Don’t fight in the territory of our royal clan.”<br/><br/>At this moment, a group of experts from the royal clan flew over and said to them with a frown!<br/><br/>“Everyone from the royal clan, this Dragon King must die. Today, we will use your venue. All the losses will be borne by our two peak clans. Moreover, we will give your royal clan a satisfactory compensation!”<br/><br/>The archangel of drought looked at them and said faintly.<br/><br/>“That’s right, royal family. We will borrow this space for the time being. Please be flexible. Today, we must kill this Dragon King. We can not let him leave!”<br/><br/>The Water Phoenix, who was in the seventh level, also said.\t\t\t\t\t\t</div>", "images": {}, "success": true}