{"id": 794, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073488.html", "title": "Chapter 3787 - 3787 3786, The Second Universe Passage, Trading Planet!", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3787 - 3787 3786, The Second Universe Passage, Trading Planet!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3787 3786, the second universe passage, trading planet!<br/><br/>“Hehe, the Tai Chi Dragon Disc has been upgraded. I can now easily kill a level seven overlord powerhouse.”<br/><br/>Wang Xian smiled. His current strength was already very terrifying!<br/><br/>He could fight against ten level seven overlord powerhouses by himself.<br/><br/>Of course, it would be difficult if the opponent had a supreme treasure.<br/><br/>If the other party was an angel who was at level seven and possessed a battle angel who was at level seven, Wang Xian wouldn’t be able to deal with ten of them.<br/><br/>In short, his strength was already very terrifying!<br/><br/>“The upgrade of the Xiao Lan House should be almost complete. I can find a target myself!”<br/><br/>Wang Xian narrowed his eyes slightly. His expression was cold and sinister.<br/><br/>He sent a message to LAN qingyue. He learned that the improvement of Xiao Lan’s small house and the rest was coming to an end.<br/><br/>Wang Xian took out his communication stone plate and began to check the current situation in the starry universe.<br/><br/>After checking, he had a general understanding in his heart.<br/><br/>Currently, a large number of disciples from the nine-origin universe had entered the starry universe. However, there was one place that the experts from the nine-origin universe had yet to enter.<br/><br/>That was the center of the starry cosmos. It was also known as the Infinite Starry Space Domain.<br/><br/>There were streams of starlight blooming there. It was the center of the Space Behemoth.<br/><br/>Even the great beings of the peak races didn’t dare to enter.<br/><br/>In addition, there were many dangerous places in the starry cosmos that no one dared to enter!<br/><br/>Basically, the disciples and Great Beings of the 9-origin universe were still active at the edges.<br/><br/>During this period of time, many experts had advanced to the ruler realm. It could be said that they had obtained a huge opportunity.<br/><br/>A group of high-level races defected to the peak races and formed many large forces.<br/><br/>The peak races also took out resources and cultivation methods to teach their subordinate races. This allowed more experts to break through.<br/><br/>Everything was flourishing.<br/><br/>However, compared to the other peak races, the Phoenix clan and the Angel clan were in a worse situation.<br/><br/>Because of their conflict with the Dragon Palace, the Dragon King had killed a large number of experts. Now, the high-level races didn’t dare to join them.<br/><br/>What a joke. If they joined them, what if they were killed by the Dragon King?<br/><br/>At present, other than the Dragon Palace, the Angel clan, and the Phoenix clan, they were relatively stable.<br/><br/>However, this stability was only what everyone saw.<br/><br/>The other high-level races didn’t know how many experts the peak races had lost in order to explore the depths and obtain treasures.<br/><br/>Stability was still stable!<br/><br/>Many high-level races had benefited greatly.<br/><br/>During these 100,000 years, a trading area had been formed in the starry cosmos!<br/><br/>This trading area was once occupied by a Level 4 space beast.<br/><br/>Now that it was occupied by a pinnacle race, they had created a trading area!<br/><br/>This trading area was later occupied by other pinnacle races, becoming the largest trading area in the starry cosmos!<br/><br/>The angel race and the Phoenix race also had a large number of strong disciples coming here.<br/><br/>According to the records on the communication stone plate, hundreds of millions of powerful disciples had gathered there.<br/><br/>They were even building a teleportation array from the entrance of the universe passage to this place!<br/><br/>The trading area was very important to the peak races.<br/><br/>If the other high-level races obtained treasures, they could also exchange for the items they liked here.<br/><br/>“This trading venue can be the first target. This is because there are enough powerhouses from the angel race and the Phoenix race here. However, the royal family is prohibited from fighting there.”<br/><br/>“I wonder if the powerhouses from the angel race and the Phoenix race will take action when they meet me? Will the royal family stop them?”<br/><br/>“Since the Dragon Palace wants to rise up in power, they must have the strength to stand on equal footing with the peak races. At least in the starry universe!”<br/><br/>Wang Xian’s eyes shone brightly as he made up his mind!<br/><br/>More than a thousand years passed in an instant. On this day, good news came from Little Blue’s little house!<br/><br/>They had a breakthrough!<br/><br/>Along with it was Lan Qingyue’s breakthrough!<br/><br/>The strength that came back to him also allowed him to advance to the level 5 ruler realm.<br/><br/>Lan Qingyue and the rest could fight against four experts of the level 8 ruler realm in the starry universe.<br/><br/>Invincible.<br/><br/>Wang Xian smiled and called an lie over. His body moved and he instantly arrived at Lan Qingyue’s side.<br/><br/>“Xiao Xian!”<br/><br/>Lan Qingyue looked at Wang Xian with a smile on her face!<br/><br/>“Alright, Alright. After you guys upgrade, we can only have five peak races in the starry universe. Let’s go and have a good fight with them!”<br/><br/>Wang Xian said with a smile on his face.<br/><br/>“Alright!”<br/><br/>Lan qingyue nodded her head heavily.<br/><br/>“Let’s go, Xiao Lan and Xiao Bai. Target, ahead!”<br/><br/>Wang Xian held Lan Qingyue’s hand and jumped to the top of Xiao Lan’s head, pointing to the front.<br/><br/>Let’s Go!<br/><br/>In the trading ground of the peak races!<br/><br/>“Woo Woo!”<br/><br/>Xiao Lan let out a low growl. She swayed her huge body and flew straight ahead.<br/><br/>Xiao Zhai and Xiao Bai accompanied him on both sides, their bodies exuding a savage and ancient aura.<br/><br/>They were the most terrifying space beasts!<br/><br/>The host of the starry universe!<br/><br/>Xiao Lan and Xiao Zhai roared as they flew, flying rapidly toward the exchange field.<br/><br/>However, at the same time, the entire 9-origin universe’s great disciples did not step into another starry space.<br/><br/>This starry sky belonged to the opposite direction of the path between the starry sky and the 9-origin universe.<br/><br/>That was the opposite direction.<br/><br/>On this day, in the sky above this starry sky, an extremely terrifying crack suddenly appeared slowly.<br/><br/>Space tore apart, the world changed, and the entire space shook!<br/><br/>This scene was like a universe being torn apart by a terrifying existence!<br/><br/>The spatial crack grew bigger and bigger, and from here, one could see a real world slowly appearing!<br/><br/>This scene was extremely shocking.<br/><br/>If the disciples of the 9-essences universe saw it, they would definitely know that this was a world passageway!<br/><br/>A Brand New World Passageway.<br/><br/>An unknown universe passageway!<br/><br/>As time passed, the crack grew bigger and bigger, and the space became more and more stable!<br/><br/>And that world became clearer and clearer!<br/><br/>One could vaguely see a stout figure holding an incomparably huge heart as he quietly floated there.<br/><br/>Around him, stout existences were injecting waves of energy into the heart.<br/><br/>The crack had been broken by the heart!<br/><br/>A brand new universe passage had been completely opened!<br/><br/>“The mass of the universe has suddenly loosened. Something special must have happened in the universe. The Gods of faith, step into the universe to seek resources and prepare for the Great War in the future!”<br/><br/>“Remember, don’t provoke the powerful space beasts, don’t step into the infinite space of the universe, and focus on finding treasures.”<br/><br/>A voice came from that universe!\t\t\t\t\t\t</div>", "images": {}, "success": true}