{"id": 791, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073482.html", "title": "Chapter 3784 - 3784 The First Step Of 2783’S Counterattack", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3784 - 3784 The First Step Of 2783’S Counterattack</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3784 The first step of 2783’s counterattack<br/><br/>“Recently, Our Angel clan and the Phoenix clan seem to be in a bit of trouble. The elders have issued an order. I wonder if the third prince has killed the Dragon King of the Dragon Palace.”<br/><br/>“I don’t think so. If he has killed the Dragon King, the third Prince should have announced it. This time, the third prince has caused us a lot of trouble. If he can’t kill the Dragon King, he’ll have to bear the consequences!”<br/><br/>“Hehe, the third prince didn’t expect the Dragon King to grow so terrifying. Oh right, we have to be careful. I heard that the Dragon King has the strength to kill a master of the sixth level. He also has powerful treasures and a ghost clone.”<br/><br/>“Haha, if the Dragon King dares to come here, he will never come back. Our Holy Angel Judgement Formation can kill a master of the seventh level in one blow.”<br/><br/>“That’s right. Although the Aurora Domain was ambushed by the Dragon King, our place is different from the Aurora Domain.”<br/><br/>In the front of the storm continent, eight angels were chatting idly.<br/><br/>Around them were more than ten level five masters of the universe.<br/><br/>This was all the power they had to guard this place.<br/><br/>The number of masters didn’t need to be too many. As long as they were strong enough, it would be enough!<br/><br/>Although the number of strong warriors here wasn’t as great as the Aurora Domain, their defensive and counterattack abilities were stronger than the Aurora Domain.<br/><br/>Most importantly, the Dragon King had only ambushed the weak of the angel race. Even the universe dominator level 6 warriors weren’t attacked.<br/><br/>“I hope the third prince can get rid of the Dragon King as soon as possible. Our Angel race can not afford to lose face.”<br/><br/>An angel said faintly.<br/><br/>“Buzz! Buzz!”<br/><br/>Just as he finished speaking, the sound of alarm around them suddenly sounded.<br/><br/>Here, the basic vigilance and defense were still based on the means of the technological world.<br/><br/>Crestford was also located here, in a metal fortress, and was conducting research.<br/><br/>When the alarm sounded, the group of angels immediately looked over.<br/><br/>Crestfall’s gaze also focused as he instantly rushed out of the fortress.<br/><br/>“It’s the Astral Beast!”<br/><br/>Through the information transmitted from the alarm, crestfall’s gaze stared to the right as he shouted with a grave expression!<br/><br/>“Wu Wu!”<br/><br/>At this moment, all the Angels heard the roar of the Astral Beast.<br/><br/>“This might?”<br/><br/>The group of Angels felt a savage aura rushing over and their expressions changed slightly.<br/><br/>Over 20 angels swiftly flew into the sky and looked over.<br/><br/>In their line of sight, Little Blue’s incomparably huge body appeared.<br/><br/>He had an extremely terrifying huge body, like a terrifyingly bloated swimming fish.<br/><br/>He had a pair of wings that were like fins and wings.<br/><br/>The Aura on his body wasn’t concealed at all.<br/><br/>With this roar, even the space beast race from the two storm continents looked over.<br/><br/>“A Level 4 universe overlord Space Beast. Damn it, why is this thing here? If it was in the 9-origin universe, I would have killed it!”<br/><br/>The group of angels looked over, their eyes revealing a cold and embarrassed expression.<br/><br/>“If it wasn’t for the suppression of the space universe, we could have easily killed it. However, this space beast is courting death. It has already entered the range. Attack and kill it!”<br/><br/>“Hahaha, if we can get our hands on this Space Beast’s corpse, it’ll be pretty good!”<br/><br/>The two level 6 rulers laughed loudly.<br/><br/>Crestus flew over. Hearing their words, he let out a slight sigh of relief!<br/><br/>“Attack!”<br/><br/>The five angels looked at each other. A sharp sword appeared in their hands, and they swung it heavily!<br/><br/>In the surrounding area, the angel statues on the Sacred Mountain of light waved the huge swords in their hands.<br/><br/>A beam of light shot out from the huge swords and formed a blade.<br/><br/>More than ten blades merged together and slashed directly at the space beast.<br/><br/>And that Space Beast was Xiao Lan!<br/><br/>“Eh? This attack!”<br/><br/>At this moment, Wang Xian and Lan Qingyue, who were inside Xiao Lan’s body, felt this attack. Their expressions changed slightly.<br/><br/>This attack was completely out of their expectations.<br/><br/>The reason why Xiao Lan’s figure rushed out in an instant was to test out the attacks from the dozens of radiant mountains.<br/><br/>“Xiao Lan, use all your strength to block it!”<br/><br/>Lan qingyue also felt the terror of this attack. She shouted at Xiao Lan!<br/><br/>Gray energy burst out from her body. A phantom image of a Kun appeared.<br/><br/>Lan Qingyue waved her arm, and the image of the Kun entered Little Blue’s body, directly passing through his body.<br/><br/>A Kun image formed around him, completely protecting him!<br/><br/>“Wu Wu!”<br/><br/>Little Blue’s body trembled slightly, and the flesh on his body began to squirm. A gray energy was attached to his body.<br/><br/>“Boom!”<br/><br/>In the next second, the terrifying holy light sword directly stood above little blue.<br/><br/>Lan Qingyue’s all-out defense was quickly destroyed by the Holy Sword of light.<br/><br/>The attack was still aimed at little blue’s body.<br/><br/>“Boom!”<br/><br/>An extremely dull sound rang out as gray energy surged out of Little Blue’s body.<br/><br/>An extremely terrifying crack quickly appeared.<br/><br/>It covered a third of Little Blue’s body.<br/><br/>It went deep into a fifth of Little Blue’s body.<br/><br/>“Wu Wu!”<br/><br/>Blue let out a scream. If Lan Qingyue hadn’t blocked this attack, it would have been enough to split blue into two.<br/><br/>“Wu Wu!”<br/><br/>“Wu Wu Wu!”<br/><br/>When Blue’s scream sounded, the same roar came from the front and right.<br/><br/>In the next moment, Little House and Little White appeared on the left and back of the experts of the Angel clan!<br/><br/>Little House and little white swayed their enormous bodies and directly attacked the Divine Mountains of light!<br/><br/>“What! ?”<br/><br/>“Not good, one attack didn’t kill that Space Beast, and two more space beasts came!”<br/><br/>“Oh no, the next attack of the Angel Judgement Formation will take a few seconds, the formation is going to be destroyed!”<br/><br/>At this moment, all the Angels had ugly and shocked expressions on their faces when they saw little white and little white suddenly appear.<br/><br/>Their eyes were filled with Panic!<br/><br/>“Bang! Bang! Bang!”<br/><br/>At this moment, little white and Little White’s bodies had already arrived in front of the Divine Mountain of light. They directly collided with it.<br/><br/>In an instant, five or six divine mountains of light collapsed!<br/><br/>They continued to attack the group of angels.<br/><br/>“Damn it, we’re not their match. Run!”<br/><br/>One of the Angels hurriedly roared and flew toward the teleportation formation in front of them.<br/><br/>“Wuuu!”<br/><br/>However, at this moment, Little House let out a wild roar. Gray energy instantly enveloped them and pulled them into the Kun domain!<br/><br/>The group of angels, who were the strongest rulers of the sixth stage, were still a little slow.\t\t\t\t\t\t</div>", "images": {}, "success": true}