{"id": 803, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073506.html", "title": "Chapter 3796 - 3796 The 3795 Powerhouses Were Gathered, And The Roar Of The Kun Was Heard", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3796 - 3796 The 3795 Powerhouses Were Gathered, And The Roar Of The Kun Was Heard</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3796 The 3795 powerhouses were gathered, and the roar of the Kun was heard<br/><br/>The time was getting closer and closer to the date of three years.<br/><br/>Wang Xian was still the same as before. He didn’t care if the powerhouses from the angel and Phoenix clans would come or Not!<br/><br/>He was living a leisurely life every day.<br/><br/>“They’re here!”<br/><br/>On this day, Wang Xian and Lan Qingyue were sitting by a lake in the long trading corridor, enjoying the scenery.<br/><br/>Lan Qingyue suddenly spoke up!<br/><br/>“Oh? They’re finally here!”<br/><br/>Wang Xian wasn’t as strong as Lan Qingyue, so he didn’t sense it.<br/><br/>“How strong are they?”<br/><br/>He asked!<br/><br/>“Xiao Xian, all of them are at the level seven overlord realm. There are a total of 28 of them!”<br/><br/>Lan Qingyue replied.<br/><br/>“28 of them? If we add in some battle angels, there should be more than 30 of them.”<br/><br/>Wang Xian mumbled. At this moment, he also sensed an extremely terrifying aura flying towards him.<br/><br/>Looking over, one figure after another slowly appeared!<br/><br/>Angels!<br/><br/>Phoenixes!<br/><br/>They flew over from all directions as though they were afraid that Wang Xian would escape.<br/><br/>They were extremely confident!<br/><br/>Wang Xian’s eyes sparkled when he saw them.<br/><br/>Buzz! Buzz! Buzz<br/><br/>At this moment, streams of energy suddenly rose from the side of the long trading corridor.<br/><br/>The thick, earthy yellow energy enveloped the entire long trading corridor!<br/><br/>“Dragon King, if there is a huge battle, please head to the sky, Dragon King!”<br/><br/>A voice sounded out of thin air. All the strong disciples in the long trading corridor could hear it clearly!<br/><br/>“Don’t Worry!”<br/><br/>Wang Xian replied with a smile when he heard the voice of the royal family.<br/><br/>His body moved and he flew out directly.<br/><br/>“They’re here!”<br/><br/>“They’re here, they’re here, the strong practitioners of the Phoenix and Angel families are here!”<br/><br/>“The Phoenix and Angel families are unwilling to give up this opportunity. They’re really here. Look, they’re all at the level seven realm. They’ve surrounded the surroundings!”<br/><br/>“Oh my God, 28 masters of Level Seven, a total of 28. Have the Angel clan and the Phoenix clan gathered all the Masters in the Starry Universe?”<br/><br/>“The war is about to start. With the strength displayed by the Dragon King of the Dragon Palace, he is no match for them at all. But the Dragon King seems to be very relaxed. Does he have any trump cards?”<br/><br/>“What a terrifying aura. If this great battle were to start, would the defenses of the royal family be able to withstand it?”<br/><br/>When everyone heard the voice of the royal family’s experts, their faces revealed shock.<br/><br/>They hurriedly raised their heads and looked up into the sky!<br/><br/>At this moment, the experts of the other peak races in the long trading gallery flew up one by one and watched from below.<br/><br/>They were all filled with anticipation and excitement.<br/><br/>A battle between experts of such a level had not occurred for more than 20 billion years!<br/><br/>More than 20 billion years!<br/><br/>What a long time!<br/><br/>Now, a terrifying battle was about to erupt!<br/><br/>“The Angel Race and the Phoenix race have 28 experts at the seventh level. They definitely have powerful trump cards in their hands. I feel that with the strength that the Dragon King has displayed, they are completely unable to resist!”<br/><br/>A great elf at the seventh level said with a twinkle in his eyes.<br/><br/>“If the Dragon King can face them head-on and survive, then the Dragon King’s strength is too terrifying!”<br/><br/>The Skeleton Race’s master said loudly not far away.<br/><br/>It was as if he was answering the Great Elf’s words!<br/><br/>“Indeed. If the Dragon King can still resist it, we have to consider our relationship with the Dragon Palace!”<br/><br/>An expert from the Divine Tiger Clan said faintly.<br/><br/>“I think the Dragon King wants to play with the two peak races. If the Dragon King can resist it, then the development and improvement of our other peak races, which are worth more than 20 billion, will be too rubbish!”<br/><br/>On the nether race’s side, a master at the seventh level said.<br/><br/>“You can’t say that. The Dragon King of the Dragon Palace improved so quickly because he has the heritage of the Divine Dragon Clan, and even the inheritance of the Water Dragon King.”<br/><br/>An expert from the celestial nation shook his head.<br/><br/>“Anyway, it’s going to be interesting. The Dragon King definitely inherited the inheritance of the Water Dragon King, and even the inheritance of the Five Elements Dragon King, the Light Dark Dragon King, and the others. Some of the Angels and Phoenixes will accept it!”<br/><br/>The experts from the saint lineage laughed softly.<br/><br/>A group of experts who were at level seven, the leader of a peak race, began to chat in the long trading corridor.<br/><br/>They expressed their opinions!<br/><br/>Similarly, their conversation could also represent the opinions of most of the experts’disciples.<br/><br/>At the same time, this news was also transmitted to the communication stone plate in a frenzy.<br/><br/>“Which one is the third prince and the Green River Water Phoenix? Come out for a moment and let me see which two have been trying to kill me.”<br/><br/>Wang Xian was floating in the air above the long trading corridor. His gaze swept across the surroundings as he asked nonchalantly!<br/><br/>“I was careless and allowed an ant to grow to this stage. However, today, I want to completely eliminate this ant.”<br/><br/>The third prince stared at Wang Xian and said coldly!<br/><br/>“I’m an ant. interesting. This one should be the third prince of the Angel of Light, right? Since you say I’m an ant, Let’s have a one-on-one fight to see if there’s a good-for-nothing being arrogant or if there’s a good-for-nothing borrowing the power of the race. Haha!”<br/><br/>Wang Xian looked at the third prince and couldn’t help but laugh out loud.<br/><br/>He was really arrogant. At this stage, he still dared to call him an ant!<br/><br/>He was probably a retard!<br/><br/>In the surrounding area, a group of powerhouses from the peak races couldn’t help but shake their heads when they heard the third Prince’s words.<br/><br/>They were already at this stage, yet they were still trying to act cool?<br/><br/>Didn’t they know what was going on?<br/><br/>Look at himself. Look at how the Angel race was being forced to this stage?<br/><br/>When the third prince heard Wang Xian’s words, his expression turned gloomy instantly.<br/><br/>“Which one is the Green River Water Phoenix? Let Me See. By the way, the third prince might want to kill me because of his lackeys. What about you, Green River Water Phoenix? I’m very curious. Why do you always want to kill me? Can you tell me?”<br/><br/>Wang Xian swept his gaze across the group of Phoenixes and continued to ask with a smile on his face!<br/><br/>“Naturally, I have my own plans to kill you.”<br/><br/>The Green River Water Phoenix stared at Wang Xian and replied coldly.<br/><br/>This was a cold and beautiful water phoenix.<br/><br/>“That can be considered as a reason. I have another question. Before the leader of the ancestral dragon lineage died, he said that the divine dragon lineage should be careful of Phoenixes. What is the reason?”<br/><br/>Wang Xian asked another question.<br/><br/>It was as if this was not a huge battle but a solution to the question in his heart.<br/><br/>“That’s because the Divine Dragon Island is currently occupied by the Phoenix tribe. As for the leader of the ancestral dragon tribe, I don’t mind.”<br/><br/>The Green River Phoenix answered without hiding anything.<br/><br/>“I see!”<br/><br/>Wang Xian nodded his head. A satisfied expression appeared on his face.<br/><br/>That was all he had to say!\t\t\t\t\t\t</div>", "images": {}, "success": true}