{"id": 804, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073508.html", "title": "Chapter 3797 - 3797 With The Gathering Of 3796 Powerhouses, The Roar Of The Kun Was Heard", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3797 - 3797 With The Gathering Of 3796 Powerhouses, The Roar Of The Kun Was Heard</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3797 With the gathering of 3796 powerhouses, the roar of the Kun was heard<br/><br/>The Divine Dragon Island was the lair of the Divine Dragon Clan.<br/><br/>Every peak race occupied a powerful grotto-heaven blessed land!<br/><br/>The Divine Dragon Island of the Divine Dragon clan naturally had a grotto-heaven blessed land that even the peak races coveted.<br/><br/>After the Divine Dragon clan was annihilated, it was normal for the Phoenix clan to occupy it!<br/><br/>Wang Xian had already asked all the questions in his heart.<br/><br/>What he needed to do next was to reap the rewards!<br/><br/>He narrowed his eyes slightly and swept his gaze across all the strong disciples of the Angel tribe and the Phoenix tribe.<br/><br/>“Alright, I’m done with my questions. Come on, let me experience the strength of your Phoenix tribe and the Angel tribe. Hehe, let’s see if I can stay here today!”<br/><br/>Wang Xian stretched his body and said to them with a smile on his face!<br/><br/>“Go All Out!”<br/><br/>The Green River Water Phoenix let out a low roar. Without any hesitation, he waved his arm and a phoenix totem rose into the sky. On this totem, there was an extremely terrifying Phoenix essence blood!<br/><br/>This surging essence blood was enough to shock all the experts!<br/><br/>“CHIRP CHIRP CHIRP!”<br/><br/>“CHIRP CHIRP CHIRP CHIRP!”<br/><br/>At the position beside the Green River Water Phoenix, the two water phoenixes let out a roar and flew directly towards the Phoenix Totem.<br/><br/>As they flew above the totem, the aura on their bodies rapidly rose.<br/><br/>This kind of rising state was far more terrifying than burning their lives!<br/><br/>Waves of terrifying energy rushed towards the surroundings!<br/><br/>“Archangel’s secret message!”<br/><br/>The third prince did not hesitate at all and directly took out his strongest trump card!<br/><br/>With a wave of his arm, the Archangel’s secret message book flew towards the sky.<br/><br/>Page after page of terrifying weapons slowly materialized and appeared in the void.<br/><br/>That extremely terrifying weapon of light was aimed in Wang Xian’s direction!<br/><br/>The third prince stared at Wang Xian, his eyes filled with coldness and coldness.<br/><br/>“Dragon King of the Dragon Palace, you are too arrogant. How dare you ignore us? You will definitely die here today, CHIRP CHIRP CHIRP!”<br/><br/>The Green River Water Phoenix waved its arm again. A Water Phoenix’s wings slowly appeared and flew towards the surroundings.<br/><br/>A special energy sealed the entire void.<br/><br/>Wang Yun instantly felt a powerful suppressive force. This suppressive force made him feel that he was already trapped in this space!<br/><br/>“Water language space!”<br/><br/>The Green River Water Phoenix shouted in a low voice!<br/><br/>“Hahaha, good, good, good!”<br/><br/>When the third prince saw this scene, his eyes revealed an excited expression. He waved his arm.<br/><br/>In the storage space, five battle angels flew out.<br/><br/>Each battle Angel had the strength to dominate the seventh level.<br/><br/>In the hands of these five battle angels, they were holding their own hearts!<br/><br/>The transparent white hearts shot out rays of light which fell directly on Wang Xian.<br/><br/>Wang Xian instantly had a strange feeling, a feeling of being completely locked on!<br/><br/>“Bang, Bang, Bang!”<br/><br/>When this feeling appeared, the five battle angels began to crumble slowly. A terrifying power of light surged into the hearts of light!<br/><br/>The hearts of light flew towards the surroundings, completely sealing off this space.<br/><br/>In an instant, the Green River Water Phoenix and the third prince took out all their trump cards!<br/><br/>They displayed all their trump cards.<br/><br/>All for the sake of killing Wang Xian!<br/><br/>This was especially so for the third prince. He had completely sealed off this space at the cost of losing five battle angels who were at the seventh level of the ruler realm!<br/><br/>It could be said that he had paid a huge price!<br/><br/>“Hahaha, Dragon King of the Dragon Palace, let’s see how you will escape this time. I have sacrificed five battle angels. Even if you have the ultimate treasure to escape, don’t even think about escaping!”<br/><br/>The third Prince’s face was filled with excitement and savage laughter as he stared at him and roared!<br/><br/>This time, they could finally destroy the Dragon King.<br/><br/>As long as they brought the Dragon King’s corpse back, they would have a way to directly kill his resurrected body through the corpse.<br/><br/>In other words, the Dragon King of the Dragon Palace would die without a doubt!<br/><br/>The hatred in his heart was finally resolved!<br/><br/>The Dragon Palace wouldn’t be able to do anything in the future!<br/><br/>“Hiss, this… this…”<br/><br/>However, at this moment, all the disciples of the peak races and high-level races were dumbstruck when they saw this scene.<br/><br/>All of them were filled with shock.<br/><br/>“I can sense an unrivaled power from the two phoenixes. This is the power of an eighth-level ruler. Even if it’s temporary, it’s still extremely terrifying. The Phoenix clan actually used such a trump card!”<br/><br/>“Doesn’t this mean that the Dragon King of the Dragon Palace is going to deal with two level eight overlords?”<br/><br/>“Not only that, but there’s also the weapon condensed from the book of the Angel clan. Each weapon contains a sense of energy that can heavily injure or even kill a level seven overlord!”<br/><br/>“They actually revealed all their trump cards in an instant. Is this… is this the trump card of the Angel clan and the Phoenix Clan? It’s too terrifying!”<br/><br/>“Isn’t the Dragon King a little careless? The third Prince of the Angel Race sacrificed five battle angels of the seventh level of the ruler realm to form a trap. This is a sure-kill Dragon King!”<br/><br/>“This is too ruthless. This is a barrier formed by five battle angels of the seventh level of the ruler realm. The Dragon King can’t escape at all!”<br/><br/>“The Dragon King is still a little careless. No, it should be said that the Green River Water Phoenix and the third Prince are too crazy. The killing intent of the Angel Race and the Phoenix race is too strong!”<br/><br/>The experts of the peak race looked at him in shock.<br/><br/>Especially the third Prince’s method of directly sacrificing five level seven battle angels. This was too ruthless!<br/><br/>How could the Dragon King of the Dragon Palace resist?<br/><br/>“This Dragon King is in big trouble. How can the Dragon King Resist?”<br/><br/>“Yes, how can he resist? This force is too strong.”<br/><br/>“It’s over, it’s over. The Dragon King was too careless this time. There’s no chance of escaping. According to the methods of the angel race and the Phoenix race, as long as we get the Dragon King’s corpse, even if it’s a resurrected body, we can destroy it completely, right?”<br/><br/>The powerful disciples of the high-level races also widened their eyes.<br/><br/>This was the foundation of the peak race.<br/><br/>This was the terror of the peak race!<br/><br/>This was the angel race and the Phoenix race!<br/><br/>They had to admit that this kind of foundation and strength could only be looked up to by the high-level races.<br/><br/>If they wanted to surpass it, even if they obtained a huge opportunity in the starry universe, it would still be difficult!<br/><br/>“Hehe, are you going to reveal all your trump cards? You guys are really strong. It seems like you guys hate me very much and want to leave me here completely!”<br/><br/>Wang Xian swept his gaze across and narrowed his eyes slightly. There was a look of astonishment in his eyes!<br/><br/>“Hahaha, Dragon King, you must die!”<br/><br/>The third prince stared at Wang Xian and roared furiously with a ferocious expression!<br/><br/>This time, the Dragon King could forget about escaping!<br/><br/>“You guys are indeed very strong. I’m not your match and you guys can indeed kill me!”<br/><br/>Wang Xian looked at them and spoke with a smile on his face.<br/><br/>“I’m not your match. So, I can only let my wife Take Action!”\t\t\t\t\t\t</div>", "images": {}, "success": true}