{"id": 806, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073513.html", "title": "Chapter 3803 - 3803 3802 Was Boiling With Excitement And Shock!", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3803 - 3803 3802 Was Boiling With Excitement And Shock!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3803 3802 was boiling with excitement and shock!<br/><br/>The experts from the top ten races, who were masters of the seventh level, sent out their congratulations.<br/><br/>This was also the recognition of the Dragon Palace!<br/><br/>The recognition of the Dragon King!<br/><br/>This also meant that they did not wish to be enemies with the Dragon King of the Dragon Palace!<br/><br/>“Thank you!”<br/><br/>When Wang Xian heard their congratulations, a smile appeared on his face and he nodded his head faintly.<br/><br/>“Let’s Go!”<br/><br/>With a wave of his arm, he collected all the corpses around him.<br/><br/>At the same time, with a wave of his arm, a sharp sword instantly pierced through the bodies of the third prince and the Green River Water Phoenix.<br/><br/>He killed them completely.<br/><br/>In the future, the third prince and the Green River Water Phoenix would no longer be enemies with Wang Xian!<br/><br/>Lan qingyue nodded her head and looked at Xiao Lan, Xiao Bai, and the rest.<br/><br/>“Wu Wu Wu!”<br/><br/>“Wu Wu Wu!”<br/><br/>They let out a low roar and a black hole appeared in front of them.<br/><br/>Wang Xian, Lan Qingyue, and the rest arrived on Xiao Lan’s body.<br/><br/>Xiao Lan swayed her body and entered the black hole. She disappeared immediately.<br/><br/>Xiao Zhai and Xiao Bai followed closely behind!<br/><br/>They left.<br/><br/>They left behind a group of powerful disciples who were still in shock!<br/><br/>In this battle, all the experts of the angel race and the Phoenix race had died.<br/><br/>The two peak races had sent 27 experts at the seventh stage of the ruler realm.<br/><br/>Their trump cards didn’t even count the Angel Army of the angel experts.<br/><br/>It was too tragic!<br/><br/>It was too tragic!<br/><br/>With so many losses, even the peak races would be heartbroken.<br/><br/>These experts were all top-tier existences in any peak race.<br/><br/>However, they had all died in one go!<br/><br/>“Now, the entire communication stone plate is in an uproar.”<br/><br/>At this moment, an expert from a high-tier race exclaimed.<br/><br/>That’s right, the entire communication stone plate was in an uproar.<br/><br/>A large amount of information was transmitted from the communication stone plates of the peak races.<br/><br/>The experts of the peak races, who were at level seven, took a deep breath.<br/><br/>“The Dragon Palace is going to rise up. The Dragon King has the strength to kill a level seven expert at will. The Dragon Queen of the Dragon Palace has the strength of a level eight expert, and she has three kun. She is the legendary ancient god feeding the Kun master. In the future, I suggest that we keep a good relationship with the Dragon Palace and the Dragon King. We can not offend them!”<br/><br/>This was what every tier 7 sovereign realm expert said to the experts of their respective races.<br/><br/>It was also what they felt was the most correct suggestion.<br/><br/>In addition, they also sent a message: The Angel race and the Phoenix Race’s 27 Tier 7 sovereign realm experts, along with their powerful trump cards, were all annihilated. The two peak races were in trouble!<br/><br/>This was another message they sent to their race.<br/><br/>In fact, they didn’t need to send this message to know.<br/><br/>In the communication stone plate, various news about this battle had already been sent over.<br/><br/>There were also a large number of pictures.<br/><br/>The extremely terrifying kun!<br/><br/>The powerful ancient god Feeding Kun Lord!<br/><br/>The third Prince of the Radiant Angel Race who was trampled under the Dragon King’s feet.<br/><br/>The Green River Water Phoenix that was pulled by the Dragon King through the chains.<br/><br/>The corpses of Phoenixes and angels.<br/><br/>These pictures were uploaded to the communication stone plate, causing a huge shock.<br/><br/>“My God, how is this possible? Is this the trump card of the Dragon King of the Dragon Palace? Is this the strength of the Dragon Palace?”<br/><br/>“The ancient god Feeding Kun master? This is a terrifying existence in the legends. The Dragon Palace actually has such an existence.”<br/><br/>“Invincible. The strength displayed by the Dragon King of the Dragon Palace is simply invincible. Especially those three kun. Even looking at the pictures, it gives people a feeling of terror.”<br/><br/>“Is this still the third Prince of the Angel Race? Is this still the Green River Phoenix of the Phoenix Race? Why do I feel like it’s not even as good as a dog? Dragon King of the Dragon Palace, this time you’re trampling on the face of the angel race and the Phoenix Race!”<br/><br/>“Hahaha, awesome, it’s so awesome to watch these videos. The Dragon King of the Dragon Palace didn’t offend you. You’ve always wanted to kill the Dragon King and destroy the Dragon Palace. Are you finished now? You’re not even as good as a dead dog!”<br/><br/>“Dragon King: What Third Prince of the Angel Clan? What Water Phoenix of the Phoenix Clan? I’m still trampling on you, you piece of trash!”<br/><br/>“Dragon King Niu di (breaking sound!)”<br/><br/>In the entire communication stone plate, countless strong disciples sent out shocking messages.<br/><br/>Some gloated, some supported the Dragon King, and some cheered.<br/><br/>Most of the strong disciples were still very excited when they saw this scene.<br/><br/>After all, they also felt a sense of joy when they saw the high and mighty experts of the Angel clan and the Phoenix clan being stepped on.<br/><br/>After all, the Dragon King of the Dragon Palace had climbed up step by step, and the Dragon King of the Dragon Palace had been fighting back passively from the beginning to the end.<br/><br/>Peak Race?<br/><br/>Arrogant?<br/><br/>Are they still arrogant now?<br/><br/>Awesome!<br/><br/>The communication stone plate was boiling, and countless expert races shouted, “The Divine Dragon Clan has returned!”!<br/><br/>The once peak race had once again returned under the leadership of the Dragon King!<br/><br/>The 13th peak race, the Dragon Palace!<br/><br/>The disciples of the various powerful races were discussing, and the disciples of the peak races were also discussing.<br/><br/>At this moment, only the experts of the angel race and the Phoenix race felt a chill in their hearts.<br/><br/>27 level 7 sovereign realm experts had been killed!<br/><br/>All of them had been killed by the Dragon King of the Dragon Palace!<br/><br/>But that wasn’t the most important thing. The most important thing was that the Dragon King of the Dragon Palace and the others were too terrifying!<br/><br/>What should they do next?<br/><br/>But at this moment, a piece of news blew up the entire communication stone plate and all the experts in the nine-origin universe.<br/><br/>The news came from the Dragon King: Next, I will clean up all the powerful disciples of the Phoenix clan and the Angel clan in the starry universe. I will kill every single one of them until they all get out of the starry universe.<br/><br/>When all the powerful disciples saw this news, their eyes sparkled.<br/><br/>The Dragon King of the Dragon Palace started his real counterattack.<br/><br/>At this time, it was no longer the two peak races killing the powerful disciples of the Dragon Palace.<br/><br/>It was the Dragon Palace killing the Angel clan and the Phoenix clan.<br/><br/>It had completely changed!<br/><br/>“What should we do? What should we do now? The Dragon King of the Dragon Palace and the others are so powerful. Should we retreat to the nine-origin universe?”<br/><br/>“Damn it, damn it. It’s all that trash third Prince’s fault. He brought such a terrifying enemy to our Angel clan. He deserves to die.”<br/><br/>“The Green River Water Phoenix should have a resurrection treasure. Ask her to give an explanation to the powerful disciples of our Phoenix clan. Make her pay the price in blood!”<br/><br/>The powerful disciples of the Angel clan and the Phoenix clan in the starry universe were dumbfounded.<br/><br/>In particular, many powerful disciples had obtained many treasures and opportunities in the starry cosmos.<br/><br/>Right now, the exploration of the starry cosmos had not even reached one-fifth. Let them leave?<br/><br/>Then how much would they lose?<br/><br/>This was a treasure trove. They could not search for treasures here. The losses were too great!\t\t\t\t\t\t</div>", "images": {}, "success": true}