{"id": 801, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073502.html", "title": "Chapter 3794 - 3794 3793 The Third Prince’S Excitement And Faith!", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3794 - 3794 3793 The Third Prince’S Excitement And Faith!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3794 3793 the third Prince’s excitement and faith!<br/><br/>Speaking of which, Wang Xian also wanted to see the true strength of LAN Qingyue and Xiao Lan.<br/><br/>He could give it a try this time.<br/><br/>Of course, he wasn’t sure if the Angel clan and Phoenix clan would send more powerhouses over.<br/><br/>If they did, it would be perfect.<br/><br/>If they didn’t come, he wouldn’t have much to lose!<br/><br/>“Look at the communication stone plate, the Dragon King actually sent a message. He wants to wait for the experts of the Angel clan and the Phoenix clan in the trading gallery for three years. Is this… is this a provocation?”<br/><br/>“The Dragon King: ‘I’ll give you three years in the trading gallery. Hurry up and send someone to kill me. Otherwise, you won’t have a chance in the future!’can I understand it that way?”<br/><br/>“Hiss, this is completely looking down on the Phoenix clan and the Angel clan. Will they send experts over?”<br/><br/>“If they send experts over from the nine-origin universe, unless it’s a master of the ninth level, they won’t be able to make it in time. However, once a master of the ninth level steps in here, he will definitely be sensed by the powerful space beasts in the starry universe and be annihilated. Therefore, the only ones who can make it here are the third prince and the Green River Water Phoenix!”<br/><br/>“This is obviously aimed at the third prince and the Green River Water Phoenix. There are many experts around the third prince and the Green River Water Phoenix. They are here specifically to hunt down and kill the Dragon King. Could it be that the Dragon King still has a trump card?”<br/><br/>“No Way. If the Dragon King still has a trump card, it would be too terrifying. This should be a form of provocation to the third prince and the Green River Water Phoenix!”<br/><br/>“The Dragon King is too ferocious. This is a direct confrontation!”<br/><br/>When Wang Xian’s message was sent out, the entire communication stone plate was in an uproar.<br/><br/>The Dragon Palace actually didn’t leave after killing the powerhouses of the Angel and Phoenix clans?<br/><br/>This was a blatant provocation!<br/><br/>They still wanted to play in the trading gallery for three years?<br/><br/>Wasn’t this too much?<br/><br/>Did they still have a trump card or were they teasing the two peak races?<br/><br/>But regardless of which one it was, the Dragon King’s actions were all very impressive!<br/><br/>“This is? He wants to truly steel the peak races and test his limits? To see the strength of the peak races?”<br/><br/>In the long trading corridor, when the royal family’s experts received this news, they were all somewhat dumbstruck.<br/><br/>Three years, three years. In the starry universe, many of the angel and Phoenix race’s experts could still make it!<br/><br/>Especially the third prince, Qingjiang Water Phoenix, and the rest of them. They should have already made it here!<br/><br/>They looked at the figure in astonishment. They did not understand what the Dragon King was trying to do.<br/><br/>However, his actions were undoubtedly a sign of confidence.<br/><br/>“He’s showing off!”<br/><br/>A powerhouse who was at level seven, the ruler of a peak race, commented indifferently!<br/><br/>He was showing off his abilities!<br/><br/>…<br/><br/>“Huh?”<br/><br/>At the same time, the third prince also saw the news about Wang Xian. When he saw it, his body trembled again. His eyes were filled with madness and violent killing intent.<br/><br/>“Good, good, good. That Dragon King actually dared to wait for us at the long trading corridor. He actually waited for me arrogantly there. This time, I must kill him. I must!”<br/><br/>The third prince roared crazily at this moment.<br/><br/>The Dragon King of the Dragon Palace had now become his inner demon. He must be destroyed. He must be destroyed!<br/><br/>“Eh?”<br/><br/>The surrounding experts of the Angel clan also saw this news. Some of the experts of the Angel clan slightly frowned.<br/><br/>“This Dragon King actually dared to wait for us at the trade corridor. Does he have any trump cards? Does he have some kind of conspiracy? We shouldn’t go there rashly!”<br/><br/>A dark angel frowned and said.<br/><br/>He had a bad premonition!<br/><br/>Was the Dragon King so easy to kill?<br/><br/>Was the Dragon King so stupid?<br/><br/>He definitely had some trump cards and backing!<br/><br/>“Rush over recklessly? Now that the Dragon King is there, it’s our only chance. If we don’t go this time, we won’t have much of a chance. We have to go, and we have to destroy the Dragon King as soon as possible!”<br/><br/>The third Prince roared crazily!<br/><br/>“Contact the Phoenix clan. If we go, we have to join forces with the Phoenix clan. Otherwise, it will be very difficult to keep the Dragon King!”<br/><br/>An angel of light looked at the third prince and said!<br/><br/>“Of course, the Green River Water Phoenix of the Phoenix clan has the treasures of the Phoenix clan. If they use the treasures, they can kill an eighth level ruler. We have the same here.”<br/><br/>The third Prince did not lose his mind.<br/><br/>He wanted to destroy the Dragon King of the Dragon Palace more than anyone else!<br/><br/>But he also knew that the Dragon King was not that easy to kill.<br/><br/>But as long as he joined forces with the Green River Water Phoenix, he still had 90% confidence!<br/><br/>Even if he could not truly destroy the Dragon King, as long as he brought his corpse back, his father would naturally have a way to completely destroy the Dragon King of the Dragon Palace!<br/><br/>And he also knew that this was the last chance to kill the Dragon King!<br/><br/>If he couldn’t kill him this time, he would be completely finished!<br/><br/>At first, he thought that he had no chance, but the Dragon King gave him one last chance, and he had to take this chance!<br/><br/>“Go!”<br/><br/>He growled and quickly flew towards the long corridor.<br/><br/>At the same time, he spread the news to the Green River Water Phoenix one by one!<br/><br/>The Green River Water Phoenix also led the experts and flew towards the long trading corridor.<br/><br/>They were all at their maximum speed, afraid that the Dragon King of the Dragon Palace would leave!<br/><br/>Naturally, Wang Xian did not leave. After the battle ended, the experts of the royal family removed their defenses.<br/><br/>This caused him and Lan qingyue to wander around the surroundings.<br/><br/>Although he had displayed great strength this time around, none of the peak races came to express their goodwill.<br/><br/>After all, the battle between the Dragon Palace and the Phoenix Race’s Angel race was not over yet.<br/><br/>Furthermore, the angel race and the Phoenix race were too strong. Although they had suffered a great loss, they were not foolish enough to befriend the Dragon King and offend the two peak races.<br/><br/>Wang Xian did not care. However, it would not be long before they would be shocked by the strength of the Dragon Palace!<br/><br/>Wang Xian and Lan Qingyue settled down in the long trading corridor for a short while. They strolled around leisurely and traded some novel items.<br/><br/>This also caused the communication stone plate to be filled with information about Wang Xian and the rest.<br/><br/>What did the Dragon King do today? which shop did he go to? This made many strong disciples talk about it with great interest!<br/><br/>Wang Xian’s reputation was also increasing at a terrifying speed.<br/><br/>Back when the Phoenix clan killed the Skyfire Patriarch, it was the first time Wang Xian displayed his strength. He had attracted a large number of supporters.<br/><br/>Now, as Wang Xian’s strength was getting stronger, more and more supporters were gathered.<br/><br/>Many of the disciples of the high-level races were even shouting and waiting for the Dragon King to bring the Angel clan and Phoenix clan down to the peak.<br/><br/>They were waiting for the Dragon King to completely destroy them!<br/><br/>Sometimes, when Wang Xian saw them, he would also smile faintly.<br/><br/>Of course, no one believed their words. Even the strong disciples of the high-level races who said these words did not believe his words. They were just joking.<br/><br/>However, Wang Xian believed it!<br/><br/>He would!\t\t\t\t\t\t</div>", "images": {}, "success": true}