{"id": 802, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073504.html", "title": "Chapter 3795 - 3795 The 3794 Experts Gathered Together, Roaring Of Kun", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3795 - 3795 The 3794 Experts Gathered Together, Roaring Of Kun</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3795 The 3794 experts gathered together, roaring of Kun<br/><br/>Time passed day by day, and one to two years quickly passed.<br/><br/>During these one to two years, the trading gallery became more and more lively!<br/><br/>The disciples of the experts who were not far from the trading gallery all rushed over.<br/><br/>They were not here for anything else but to see the Dragon King.<br/><br/>In addition, they were also a little curious whether the experts of the Angel clan and the Phoenix clan would rush over within three years.<br/><br/>If they did, a great battle would break out.<br/><br/>They wanted to see how deep the Dragon King’s Trump card was.<br/><br/>Similarly, they wanted to see the great battle between the top experts of the peak races.<br/><br/>Many disciples of the top experts of the high-level races rushed over.<br/><br/>Similarly, the disciples of the other peak races also rushed over.<br/><br/>Among them, there was no lack of level seven masters.<br/><br/>However, no experts from the angel and Phoenix clans came over.<br/><br/>They didn’t dare to come over either. If they did, they would definitely be killed by the Dragon King.<br/><br/>Who Dared to come!<br/><br/>“It’s been more than two years. Why aren’t the experts from the angel and Phoenix clans here yet? Are they really intimidated by the Dragon King?”<br/><br/>“It’s really possible. After all, the Dragon King of the Dragon Palace dared to wait for the two peak races here for three years. He must have other things to rely on. They may not be 100% sure that they can deal with the Dragon King.”<br/><br/>“If they don’t take action this time, they won’t be able to kill the Dragon King in the future. Moreover, with the Dragon King’s growth rate, the angel and Phoenix clans will probably encounter the most terrifying enemies in the future!”<br/><br/>“If the angel and Phoenix clans can’t deal with the Dragon King after this, the Dragon Palace will definitely rise in power.”<br/><br/>In the communication stone plate, a large number of strong disciples discussed this matter every day.<br/><br/>Everyone was looking forward to it. They were looking forward to the outbreak of the war.<br/><br/>“Xiao Xian, there are already close to twenty level seven masters in this long trading corridor.”<br/><br/>At a corner of the long trading corridor, Lan Qingyue and Wang Xian were eating leisurely.<br/><br/>The entire long trading corridor was considered to be a beautiful place. It would take them a few years to walk around it.<br/><br/>They were very comfortable here.<br/><br/>Lan Qingyue was able to fight against level eight masters in the nine-origin universe. Therefore, she could sense the arrival of every level seven master.<br/><br/>“HMM, I wonder if the experts from the angel race and Phoenix race are still coming. There’s still half a year’s time.”<br/><br/>Wang Xian nodded and smiled.<br/><br/>“I think they will still come. Even if they came earlier, they might still be making some preparations.”<br/><br/>Lan Qingyue pondered.<br/><br/>“Preparations? When the time comes, we will fight them here. If they really have some extremely powerful treasures, we will slip away immediately!”<br/><br/>Wang Xian smiled.<br/><br/>He wasn’t a stupid person. Once he realized that something was wrong, he would leave immediately.<br/><br/>In any case, the resources he had were enough to upgrade little blue and the others. When he returned, he did not believe that the trump cards of the Angel clan and Phoenix clan could still deal with a ruler of the 9th rank.<br/><br/>“Hehe, don’t underestimate my strength.”<br/><br/>Lan qingyue smiled.<br/><br/>The two of them chatted and laughed.<br/><br/>At the same time, they were about a month away from the ruler of the long trading corridor.<br/><br/>The third Prince and the other powerhouses of the Angel clan were floating there quietly.<br/><br/>They were waiting there quietly.<br/><br/>They were waiting for the powerhouses of the Phoenix clan.<br/><br/>With their strength, they knew that the chances of destroying the Dragon King were a little low.<br/><br/>If the Dragon King wanted to escape, there was a high chance that he would be able to escape!<br/><br/>“Crash!”<br/><br/>A few days later, the sound of flapping wings could be heard from a distance.<br/><br/>The third Prince opened his eyes and looked behind him. His eyes were shining.<br/><br/>“Green River Water Phoenix, you’re finally here!”<br/><br/>The third prince stared at her and said.<br/><br/>“I’m here. Show me all your trump cards. Don’t hold anything back.”<br/><br/>Green River Water Phoenix said directly!<br/><br/>They wouldn’t hold anything back in this alliance!<br/><br/>“Alright, I have 25th rank 7 rulers here, and my biggest trump card is the Archangel’s secret message.”<br/><br/>The third prince immediately took out his trump card.<br/><br/>This was a book, a very special book.<br/><br/>There were pictures drawn on the book. There was the Sword of light, the shield of light, the spear of light, and the Cross of light.<br/><br/>There were more than a dozen of them.<br/><br/>“Archangel’s secret message. There are thirteen attacks and one defense. It requires the control of thirteen angels at the seventh level of the ruler realm. Each attack is comparable to the strongest attack of a ruler at the eighth level of the ruler realm.”<br/><br/>“If it is used consecutively, it can severely injure an existence at the eighth level of the ruler realm. With our help, it can even kill him!”<br/><br/>“Of course, this might require a long battle.”<br/><br/>The third Prince said.<br/><br/>“Alright, I have a Phoenix totem here, and it contains a large amount of phoenix essence blood. With the help of the Phoenix Totem, a ruler Level 7 Phoenix and I can erupt with the strength of a ruler level 8. The duration is also enough to wear down a ruler level 8 expert.”<br/><br/>The Green River Water Phoenix’s eyes flickered as it said!<br/><br/>In the starry cosmos, it was somewhat different from the nine-origin cosmos.<br/><br/>In the nine-origin cosmos, if one wanted to destroy an existence at the same level, they needed three to do so.<br/><br/>This was because the nine-origin cosmos could escape back to their own Cosmos God nation at any time.<br/><br/>Hence, the three of them were required to constantly drag the other party down, preventing him from escaping.<br/><br/>But it was different here in the starry cosmos!<br/><br/>One could not escape in an instant when fighting against someone of the same level. If the battle continued, one-on-one battles could result in death.<br/><br/>If it was two-on-one, they could basically kill them!<br/><br/>Hence, they did not need to have the strength of the 9-origin Cosmos to kill them.<br/><br/>This was very good news for the third prince and the Green River Water Phoenix.<br/><br/>“Good, good!”<br/><br/>A long-lost smile appeared on the third Prince’s face.<br/><br/>His gaze swept past the Green River Water Phoenix. Besides her, there were twelve other phoenixes.<br/><br/>Each of them was an existence at the seventh level of the ruler realm.<br/><br/>“With our strength, we can destroy the Dragon King. What we need to pay attention to now is that we can’t let the Dragon King escape.”<br/><br/>The Green River Water Phoenix said.<br/><br/>“Then we need to think of a way to make it impossible for him to escape.”<br/><br/>The third prince frowned slightly.<br/><br/>“I have a treasure here that can trap the Dragon King for a while, but it won’t last long!”<br/><br/>The Green River Water Phoenix said.<br/><br/>“How long?”<br/><br/>The third Prince’s eyes lit up and immediately asked.<br/><br/>“At most one minute!”<br/><br/>The Green River Water Phoenix replied.<br/><br/>“One minute is enough. If you can trap it for one minute, I have a great formation here. Give me one minute, and I can completely trap it!”<br/><br/>The third prince gritted his teeth, and his eyes shone.\t\t\t\t\t\t</div>", "images": {}, "success": true}