{"id": 800, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073500.html", "title": "Chapter 3793 - 3793 3792 Provoked Them And Waited For Them For Three Years!", "volume": 8, "volume_title": "Volume 8", "body": "<h1>Chapter 3793 - 3793 3792 Provoked Them And Waited For Them For Three Years!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3793 3792 provoked them and waited for them for three years!<br/><br/>“Hu hu!”<br/><br/>In a corner of the universe, dozens of figures stopped and floated in the air.<br/><br/>The leader in the center was breathing a little fast and had a ferocious look on his face.<br/><br/>His body trembled slightly and the killing intent from his body rushed toward the surroundings.<br/><br/>“Dragon King of the Dragon Palace, I want you to die!”<br/><br/>He raised his head and roared angrily.<br/><br/>The experts of the Angel clan looked at him coldly.<br/><br/>They had naturally received the message on the communication stone plate.<br/><br/>The Dragon King of the Dragon Palace had easily killed two level seven rulers.<br/><br/>Moreover, he had four netherspirit avatars.<br/><br/>The Angel clan also knew that the Dragon King of the Dragon Palace had a resurrection treasure!<br/><br/>Putting aside the resurrection treasure, with the current strength of the Dragon Palace, it was already very difficult for them to kill him!<br/><br/>Unless they surrounded the dragon king of the Dragon Palace.<br/><br/>Otherwise, how could they kill him?<br/><br/>According to the information from the long trading corridor, the Dragon King of the Dragon Palace didn’t rely on the ghost clone to kill two existences at the seventh level ruler realm in an instant.<br/><br/>That meant that he could at least fight against four existences at the same level.<br/><br/>With the ghost clone, he could fight against eight existences at the same level alone.<br/><br/>And with the speed that was said to be comparable to the eighth level of the ruler realm, how could they kill him?<br/><br/>This time, in order to kill the Dragon King, they had indeed obtained some powerful trump cards.<br/><br/>This trump card was enough to kill an existence at the eighth level of the ruler realm.<br/><br/>However, there was a prerequisite. If they wanted to meet the Dragon King, they had to lock onto him.<br/><br/>With the speed that the Dragon King had displayed, unless the Dragon King came to cause trouble for them, or if they found the Dragon King, the Dragon King would not run away and fight with them.<br/><br/>Otherwise, they would not be able to kill him!<br/><br/>All of this was because of the third prince.<br/><br/>The loss of the Angel clan to the Dragon King of the Dragon Palace was already terrifying enough!<br/><br/>This time, they had lost thousands of strong disciples.<br/><br/>And according to the Dragon King, if he didn’t send the third Prince’s head over, he would continue to kill!<br/><br/>If the Dragon King wanted to kill their ordinary disciples, how could the Angel clan resist?<br/><br/>Even if they were masters of the Angel clan, would they need seven or eight of them to act together?<br/><br/>The experts of the Angel clan felt helpless!<br/><br/>The Dragon King of the Dragon Palace was growing too fast!<br/><br/>At the same time, the third prince also understood his current situation!<br/><br/>He also understood the current situation.<br/><br/>He was also helpless.<br/><br/>He didn’t think that he would come to this point!<br/><br/>If he couldn’t deal with the Dragon King of the Dragon Palace, he would have to bear all the consequences. He would even become a thoughtless battle angel.<br/><br/>His body was trembling slightly.<br/><br/>Similarly, when he received the news from the Green River Water Phoenix, he was completely silent.<br/><br/>…<br/><br/>“My gains this time should be enough for little blue house and the rest to break through again. Moreover, it will also allow the more than eight million disciples of the Dragon Palace to advance to the peak of the supremacy realm!”<br/><br/>At the long trading corridor, Wang Xian finished the tea in his cup and was calculating in his heart.<br/><br/>Three Corpses of a level seven overlord were sufficient for Xiao Lan and Xiao Bai to level up once again.<br/><br/>After all, Xiao Lan and Xiao Bai only had a level five overlord.<br/><br/>By devouring the corpses of a level seven overlord, coupled with a group of level six overlords, it would not be a big problem for them to break through to the level six overlord realm.<br/><br/>Once they reached the level six overlord realm, only a nine-origin universe master at the level nine overlord realm would be able to fight against them.<br/><br/>“Are we waiting for a few thousand years, or should we continue to fight?”<br/><br/>Wang Xian’s eyes sparkled.<br/><br/>Currently, he was the only one who had displayed his strength. Qing Yue and the rest had yet to make a move.<br/><br/>Qing Yue and the rest could fight against the masters of the nine-origin universe who were at the level eight realm.<br/><br/>“I really don’t believe that the Angel Race has the strength to defeat two masters of the level eight realm.”<br/><br/>Wang Xian mumbled to himself. He had an idea.<br/><br/>That was to continue!<br/><br/>It might be risky to continue, but Wang Xian felt that it was not a big problem!<br/><br/>Powerful treasures could indeed allow them to fight against opponents of a higher level.<br/><br/>However, such treasures were definitely not something that a powerhouse could use.<br/><br/>For example, the Aurora Domain, the defensive barrier of the Angel Race’s territory needed to be set up in advance.<br/><br/>Just like in the storm continent, the angel judgement formation of the angel race also needed to be set up in advance!<br/><br/>Moreover, when it was used, it required many experts to control it.<br/><br/>After all, it was a large level higher than the enemy. The level of the ultimate treasure needed to be very, very high.<br/><br/>Unless, they had a heaven-grade treasure.<br/><br/>However, this was obviously impossible!<br/><br/>In other words, if Wang Xian continued to deal with the powerhouses of the Angel clan, the success rate would reach 80% .<br/><br/>Now was the time for the Angel clan and the Phoenix clan to be furious.<br/><br/>However, Wang Xian could not afford to be arrogant!<br/><br/>Wang Xian took out his communication stone plate. The corners of his mouth curled up slightly. The editor sent a message: “Little Scoundrels of the Angel clan and the Phoenix clan, I will be waiting for you in the long trading corridor for three years.” “If you guys come over in three years, I can continue playing with you guys. After three years, I will exterminate your Angel clan and Phoenix clan one by one!”!<br/><br/>After the message was sent out, Wang Xian couldn’t help but laugh.<br/><br/>He would give them three years to stimulate the angel clan and Phoenix clan. He would see if they would still send experts over. At the same time, he would also give himself a guarantee.<br/><br/>If he wanted to reach the universe passage from the trade corridor, even if there was a teleportation formation in the middle, with Wang Xian’s speed, it would take him five to six years to reach it!<br/><br/>In other words, this would prevent the Angel clan from sending a large number of experts over.<br/><br/>The experts here could not come over. In the universe, the only ones who could rush over were the third prince, Qing Jiang Shui Feng Huang, and the rest!<br/><br/>If they came, they could kill them.<br/><br/>After killing them, they would bring Xiao Lan and the rest to level up. When they returned, they would wipe out the entire Angel clan and Phoenix clan!<br/><br/>“Qingyue, we will stay here for another three years. Within these three years, there will be powerhouses coming over. They might need your help. If there are no powerhouses coming over, we will leave!”<br/><br/>Wang Xian said to Lan Qingyue.<br/><br/>“HMM? Sure. Since I broke through, I have yet to make a move. I don’t even know how strong I am.”<br/><br/>Lan qingyue nodded her head in excitement.<br/><br/>The ancient god Feeding Kun master was an extremely terrifying and powerful inheritance.<br/><br/>Lan Qingyue was the only inheritor of the ancient god Feeding Kun master.<br/><br/>The former ancient god Feeding Kun master was an expert of the inheritance. He was destroyed by the combined efforts of the Divine Dragon Clan and the Divine Tiger clan of the Phoenix clan.<br/><br/>This was because this terrifying existence mainly fed on the divine dragons, phoenixes, and Divine Tigers.<br/><br/>This was the reason why they had been destroyed, and also the reason why they were so powerful.<br/><br/>An ordinary ruler at the eighth rank in the nine-origin universe might not be a match for LAN Qingyue and the others.<br/><br/>Thus, Lan Qingyue and the three Kun masters might not be able to only fight against four ruler at the eighth rank.<br/><br/>It may be five, or six!\t\t\t\t\t\t</div>", "images": {}, "success": true}