{"id": 808, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073517.html", "title": "Chapter 3805 - 3805 3804’S Conditions", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3805 - 3805 3804’S Conditions</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3805 3804’s conditions<br/><br/>Phoenix clan: we, the Phoenix clan, are willing to seek peace with the Dragon Palace, turn hostility into friendship, and meet the future together. The actions of the Qing River Water Phoenix do not represent the will of our Phoenix clan, and we are willing to offer compensation.<br/><br/>Angel clan: because of the conflict between the third Prince of the Angel of light and the Dragon Palace, we, the Angel clan, will descend the third Prince into a battle Angel. We, the Angel clan, do not wish to be enemies with the Dragon King of the Dragon Palace, i hope that the Dragon King can consider the relationship between the two parties. We are willing to compensate the third prince for his personal matters.<br/><br/>Just as the communication stone plate was boiling with excitement, just as all the powerful clans were shocked by the strength of the Dragon Palace and the battle.<br/><br/>Two pieces of news suddenly exploded like a terrifying bomb once again, causing all the powerful disciples to boil with excitement.<br/><br/>All the powerful disciples, including those from the peak races, were dumbfounded when they saw the two pieces of news.<br/><br/>What did this mean?<br/><br/>It meant that the two peak races, the angel race and the Phoenix race, had bowed to the Dragon Palace!<br/><br/>“Crazy! The two peak races have made such a declaration? This is unbelievable!”<br/><br/>“Holy Sh * t! The Phoenix race and the angel race are going to make peace with the Dragon Palace? This is unbelievable! This is the Phoenix race and the Angel Race! How could the Dragon Palace force them to such an extent?”<br/><br/>“Demoting the third Prince to a battle angel, this is equivalent to turning the third Prince into a battle puppet, this punishment is very terrifying!”<br/><br/>“The Phoenix clan and the Angel Clan’s strength is very terrifying, but they actually lowered their heads!”<br/><br/>“Not lowering their heads? If they don’t lower their heads now, what can they do? Once the Dragon King says that he really wants to drive the Angel clan and the Phoenix clan out of the starry universe, then the losses of the Angel clan and the Phoenix clan will be very terrifying!”<br/><br/>“Seeking peace with the Dragon Palace is the only choice. Otherwise, the angel race and the Phoenix race might be far surpassed by other peak races. The Dragon King of the Dragon Palace has the ancient god Feed Kun master and is already invincible in the starry universe!”<br/><br/>“I really didn’t expect that the Dragon King of the Dragon Palace would actually force the two peak races to such an extent.”<br/><br/>“From today onwards, the Dragon Palace will rise.”<br/><br/>All the powerful disciples were shocked when they saw this news.<br/><br/>The two peak races had lowered their heads, and the reputation of the dragon palace had increased tremendously.<br/><br/>Now, all the peak races had acknowledged the Dragon King of the Dragon Palace.<br/><br/>“HMM?”<br/><br/>At the same time, in the storm continent of the universe.<br/><br/>Xiao Lan, Xiao Bai, and the rest were undergoing their upgrades.<br/><br/>The rewards this time were too great!<br/><br/>So great that over eight million disciples of the Dragon Palace were able to reach the peak of the Universe Knight Realm.<br/><br/>So great that there was still dragon blood left that couldn’t be used up!<br/><br/>This was the energy of dozens of level seven rulers!<br/><br/>Apart from that, Wang Xian also received a large amount of resources.<br/><br/>The resources of dozens of level seven masters, especially the third Prince and Qingjiang Water Phoenix.<br/><br/>It was not an exaggeration to say that these resources could help Wang Xian improve immediately.<br/><br/>A large amount of resources, a large amount of treasures.<br/><br/>This time, the strength of the Dragon Palace would be greatly enhanced.<br/><br/>There was a benefit to having a large amount of resources, other than the over eight million disciples of the Dragon Palace who had all advanced to the peak of the supremacy realm.<br/><br/>Another benefit, over there, is to shorten the Dragon Palace master realm of the strong accumulation.<br/><br/>Strength has reached the realm of mastery, although each level of ascension is dependent on one’s own understanding.<br/><br/>But in this process, there is also a process of energy accumulation.<br/><br/>For example, the ascendant needs 100 energy and his own perception, so a large amount of resources can enable the ascendant to quickly accumulate from 0 to 100, energy accumulation is completed, and then only rely on understanding!<br/><br/>Once he comprehended, he would complete the breakthrough.<br/><br/>This would reduce the process of accumulation.<br/><br/>This could shorten a very, very terrifying time.<br/><br/>Therefore, the resources were still useful to the Dragon Palace.<br/><br/>Wang Xian was calculating a large amount of resources when he suddenly received a message from Prime Minister Gui. When he saw these two messages, the corners of his mouth curled up slightly.<br/><br/>“I really didn’t expect this. I really didn’t expect the Phoenix and Angel clans to bow their heads. Hehe.”<br/><br/>He was a little surprised by these two pieces of information.<br/><br/>However, this also showed that they attached great importance to the starry universe.<br/><br/>They didn’t want to lose the starry universe, and they would rather pay a price.<br/><br/>Looking at these two pieces of information, Wang Xian’s eyes flickered slightly, and a thoughtful look appeared on his face.<br/><br/>Should he continue to be enemies with the Phoenix clan and the Angel Clan?<br/><br/>Or should he make peace with them.<br/><br/>It was universally acknowledged that the Angel clan possessed a heaven’s fate level existence.<br/><br/>It was uncertain whether the Phoenix clan possessed it or not.<br/><br/>However, it was very likely that they possessed a fire attribute heaven’s fate.<br/><br/>If they continued to make enemies with them, they might have to face two heaven’s fate level existences.<br/><br/>Of course, Wang Xian also knew that this peace request of theirs might only be on the surface.<br/><br/>If there was an opportunity in the future, they would definitely stab the Dragon Palace in the back.<br/><br/>“It’s useless to continue being enemies with them. I might as well agree to their request for peace. However, since they agreed to their request for peace, they will have to pay a price!”<br/><br/>Wang Xian narrowed his eyes slightly.<br/><br/>He was pursuing the maximization of benefits.<br/><br/>Of course, it wasn’t just the maximization of benefits. It was a wish in Wang Yun’s heart.<br/><br/>This wish was to transfer the Dragon Palace to the Divine Dragon Island.<br/><br/>The Divine Dragon Island was once the base camp of the Divine Dragon Clan. It was the root of the Divine Dragon clan.<br/><br/>He could propose conditions to the angel clan for them to hand over the Divine Dragon Island.<br/><br/>Other than that, he could also ask the Angel clan to take out a large amount of resources to increase his strength.<br/><br/>Currently, Wang Xian’s strength was comparable to an existence at level seven of the Overlord realm. The resources in his hands could allow him to reach level eight of the Overlord realm.<br/><br/>He could ask the Angel clan for resources that could allow him to advance to the level of a dominator at level nine.<br/><br/>Other than that, Wang Xian also wanted to ask them for resources to upgrade the Five Elements Millstone and the Tai Chi Dragon Plate.<br/><br/>At the thought of this, the corner of his mouth curled up slightly.<br/><br/>In this case, his strength would be able to increase exponentially.<br/><br/>Wang Xian took out the communication stone plate and immediately sent out the conditions he wanted to Prime Minister Gui.<br/><br/>Prime Minister Gui could negotiate with them through the universal AI and the Phoenix clan and the Angel clan.<br/><br/>Wang Xian didn’t make many requests, only five.<br/><br/>The ownership of the Divine Dragon Island.<br/><br/>It was enough for him to upgrade to the level of a master of level nine.<br/><br/>It was enough for him to upgrade the five elements grinding and tai chi dragon plate to the level of a master of level nine.<br/><br/>These were his conditions.<br/><br/>This was an extremely terrifying amount of resources.<br/><br/>“I wonder if the two peak races will agree to it.”<br/><br/>Wang Xian mumbled to himself with some uncertainty.<br/><br/>Just the amount of resources he needed to upgrade was already very huge.<br/><br/>In addition, he also needed to add the Divine Dragon Island.<br/><br/>After sending out the news, Wang Xian began to wait quietly.<br/><br/>If he could succeed, it would be a huge upgrade for himself and the Dragon Palace.\t\t\t\t\t\t</div>", "images": {}, "success": true}