{"id": 816, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073533.html", "title": "Chapter 3813 - 3813 3812 Discussed The Countermeasures", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3813 - 3813 3812 Discussed The Countermeasures</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3813 3812 discussed the countermeasures<br/><br/>“Facing the belief universe, there’s no doubt that if we want to fight, we have to fight for enough resources. Furthermore, the experts of the belief universe are also considered resources to us.”<br/><br/>“In addition, those of the belief universe have already entered the starry universe. With their universe’s style of doing things, they will definitely attack the disciples of our nine-origin universe. This time, the disciples of our Immortal Empire will be the first to be attacked.”<br/><br/>The Immortal King of the Immortal Empire said.<br/><br/>“The belief universe has a powerful aggressiveness. If they encounter the disciples of the experts of our nine-origin universe, they will definitely want to control them.”<br/><br/>The Elven queen nodded.<br/><br/>“Then there’s no need to say anything. If they encounter the gods of the belief universe, directly kill them.”<br/><br/>The Skeleton King, who was at the peak of the ruler realm, said directly.<br/><br/>A few experts from the peak races nodded.<br/><br/>“Not only that, since we are enemies, we still have to hunt down the disciples of the powerful experts who believe in the universe.”<br/><br/>On the side of the voodoo race, a powerful wizard spoke.<br/><br/>Wang Xian was not sure about this wizard, but it was possible that he was an ancestral wizard.<br/><br/>Clearly, there must have been a powerful conflict between the voodoo race and the belief universe during the last great calamity.<br/><br/>“That’s fine. The gods of the belief cosmos contain a huge amount of power of faith in their bodies. This power of faith is extremely useful to us and can greatly increase the chances of our disciples breaking through.”<br/><br/>An angel at the peak of the ruler realm from the Angel tribe had a glint in his eyes.<br/><br/>The power of faith was a special type of energy that was slightly related to the soul. It contained pure blessing power.<br/><br/>The holy spirits of the nine-origin universe could absorb it to improve their comprehension, which also meant that they could increase the probability of a breakthrough.<br/><br/>If a great being at the pinnacle of the Knight level could kill a pinnacle of the knight level gods and absorb their power of faith, the probability of a breakthrough could be increased several times.<br/><br/>This was a very terrifying improvement.<br/><br/>Especially for the disciples of Great Beings who were about to breakthrough.<br/><br/>When the calamity arrived, the reason why a huge battle broke out was because the creatures of the other universe or the other universe had true treasures that made other universes envious.<br/><br/>Not to mention the belief universe, they also wanted to develop the creatures of the 9-origin universe into their own believers to increase their power.<br/><br/>The belief universe meant that the more believers there were, the stronger they were, and the stronger the gods would be.<br/><br/>“The belief universe is very terrifying. After being baptized by their belief runes, the living beings will become their loyal subordinates. The strong ones are fine, but they can only destroy their memories. For the weak ones, they can even retain their memories and obtain important information from them.”<br/><br/>The Elven queen said at this moment.<br/><br/>“We have to be careful on this point. We have to tell the information of the belief universe to all the strong disciples in the nine-origin universe.”<br/><br/>The Immortal King of the immortal nation nodded and said!<br/><br/>“Mm, apart from that, I suggest that each peak race establish a team to hunt the gods of the universe.”<br/><br/>The Wizard continued.<br/><br/>“There is indeed a need for that!”<br/><br/>The expert of the Phoenix race nodded.<br/><br/>“Since we are going to fight against those guys from the belief universe together, then we will completely unite together. We will share the information. If we encounter a powerful team of gods, then we will join hands.”<br/><br/>“Also, if any of the peak races are in danger and help us, the other peak races will come to our aid immediately.”<br/><br/>An expert from the saint’s lineage said.<br/><br/>“Sure.”<br/><br/>The experts from the peak races nodded.<br/><br/>“Our Voodoo race can create a compass to test the belief of the gods. I still have some here. They are all from the past. I will give you some.”<br/><br/>The Voodoo Race Wizard waved his arm and black compasses flew towards Wang Xian and the rest of the experts from the peak races.<br/><br/>Each peak race had over a hundred of them.<br/><br/>Clearly, this was a detection treasure that the voodoo race had created in the last calamity to deal with the faith of the gods.<br/><br/>“Thank you, ten-handed ancestral wizard.”<br/><br/>The Immortal King from the Celestial Nation thanked the Wizard.<br/><br/>Ten-handed ancestral wizard?<br/><br/>When Wang Xian heard this name, his eyes flickered.<br/><br/>The ancestral wizard lineage was extremely mysterious and powerful.<br/><br/>The time that they were born was not any shorter than that of the Divine Dragon Clan.<br/><br/>They had also gone through several eons.<br/><br/>Although there had never been an existence on the level of Heaven’s origin creation, if the twelve ancestral wizards of the Wizard Clan joined forces, it was rumored that they could contend against the Heaven’s origin creation.<br/><br/>In short, in the nine-origin universe, the voodoo race was the most mysterious.<br/><br/>“Thank you, ten-handed ancestral wizard.”<br/><br/>Wang Xian and the other experts from the other peak races also expressed their gratitude.<br/><br/>“Other than that, we have to be careful. The gods who believe in the universe might accept the space behemoth as a believer.”<br/><br/>The ten-handed ancestral wizard added another sentence.<br/><br/>The experts from the peak races nodded their heads.<br/><br/>“Since that’s the case, let’s make a decision. On the communication stone plate, our thirteen peak races will open up a channel. Only those at the seventh stage of the ruler realm can enter. This will also prevent some disciples from being forcefully taken in as believers by the gods of the cosmos, revealing some of their actions and secrets.”<br/><br/>The Immortal King of the Immortal Empire spoke.<br/><br/>The experts from the peak races nodded their heads in agreement.<br/><br/>“If you are confident, kill more of the gods who believe in the universe. Killing more will be beneficial to the peak races.”<br/><br/>The ten-handed ancestral sorcerer spoke again at this moment. He suddenly looked at Wang Xian.<br/><br/>“Dragon King, Your Dragon Palace has the ancient God, Kun master. He is not suppressed by the universe in the starry universe. If you have the strength, you can kill more. It will be beneficial to your dragon palace. Of course, you have to pay attention to the trump card of the belief universe. They might be able to deal with Kun who is at the fifth level. Anyway, let me give you a reminder, Dragon King.”<br/><br/>The ten-handed ancestral wizard said to Wang Xian.<br/><br/>“Thank you for your reminder, ten-handed ancestral wizard. I understand.”<br/><br/>Wang Xian nodded as his eyes flickered.<br/><br/>If the power of faith in the bodies of the gods of the universe had the same effect as the baptism of the Dragon Pool, Wang Xian would definitely hunt down the gods of the universe without hesitation.<br/><br/>As for being careful, Wang Xian didn’t really care.<br/><br/>The current Lan Qingyue and Xiao Lan weren’t at the level of a ruler at level five, but at level six.<br/><br/>The gods who believed in the universe would also be suppressed when they entered the starry universe.<br/><br/>Xiao Lan and the rest could fight against existences at the level nine of a ruler. He really didn’t believe that the opponent’s trump card could deal with Xiao Lan and the rest.<br/><br/>“With the current strength of the Dragon Palace, they indeed have a huge advantage in the starry universe.”<br/><br/>The Elven queen looked at Wang Xian and said with a smile.<br/><br/>The rest of the experts from the peak races also nodded slightly.<br/><br/>However, they did not say anything!\t\t\t\t\t\t</div>", "images": {}, "success": true}