{"id": 812, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073525.html", "title": "Chapter 3809 - 3809 3,808 Years Was The Beginning Of The Collision Between The Two Universes", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3809 - 3809 3,808 Years Was The Beginning Of The Collision Between The Two Universes</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3809 3,808 years was the beginning of the collision between the two universes<br/><br/>The improvement of the Dragon Palace could be seen with the naked eye. Although compared to the peak races, the dragon palace was still much weaker.<br/><br/>However, the Dragon Palace still had time.<br/><br/>It still had billions of years to go.<br/><br/>During these billions of years, Wang Xian believed that the Dragon Palace would be able to complete the curve and overtake the car. It would face the arrival of the catastrophe.<br/><br/>Especially during these few billion years, Wang Xian was confident that he would be able to reach a terrifying level of strength.<br/><br/>Facing the Apocalypse.<br/><br/>The disciples of the Dragon Palace had completely integrated into the other races. They competed and befriended each other.<br/><br/>The other peak races were also polite to the disciples of the Dragon Palace.<br/><br/>After all, this was the starry universe. In this place, the Dragon Palace was invincible.<br/><br/>After all, the angel race and the Phoenix race had both bowed their heads to the Dragon Palace to seek peace!<br/><br/>“Next, I can go to the depths of the starry universe to take a look!”<br/><br/>Wang Xian mumbled. His body moved and he immediately flew towards a place.<br/><br/>With his current situation, he could use the tai chi dragon disc to increase his speed to the level nine of a ruler.<br/><br/>Therefore, he didn’t need to use the primaless sacred wings to fly.<br/><br/>The speed of someone at level nine in the universe was already very fast in the starry universe!<br/><br/>…<br/><br/>At the same time, when Wang Xian was flying towards the depths of the starry universe, he was at the right side of the starry universe.<br/><br/>In more than a million years, the powerful disciples of the nine-origin universe had already reached an extremely deep level in their exploration of the starry universe!<br/><br/>Although it couldn’t be said that they had searched all around the core, they had already explored more than half of it.<br/><br/>A large number of resources and treasures had been collected, and a large number of great beings’disciples had obtained opportunities.<br/><br/>At present, there were already a few hundred ruler-level great beings born in the high-level races!<br/><br/>The transformation of their bloodlines and the improvement of their physiques had allowed them to complete the qualitative transformation.<br/><br/>On the surface, a few hundred high-level race experts had completed their breakthroughs. There might be many more that hadn’t been announced.<br/><br/>After all, there were too many disciples of high-level race experts!<br/><br/>“Let’s continue flying forward. There’s still an unexplored area over there. We should be able to obtain some treasures.”<br/><br/>The nine origin universe and the Starry Space Passage were basically at opposite sides of this passage.<br/><br/>More than ten figures were flying at high speed.<br/><br/>They were the experts of the immortal empire.<br/><br/>Now that the resources in the outer regions of the starry space were becoming less and less, they could only come to places far away to see if they could find some resources.<br/><br/>The place they had reached now was basically at the end of one direction of the starry space!<br/><br/>There weren’t many powerful space beasts here, so they were relatively safe.<br/><br/>“Sou Sou Sou!”<br/><br/>When they continued flying forward, they suddenly saw a figure flying towards them.<br/><br/>“Eh? There’s someone ahead, what’s the situation?”<br/><br/>The Immortal Empire’s disciples had astonished looks in their eyes. They immediately stopped and their eyes flickered as they sized up the group of Immortal Empire’s disciples.<br/><br/>In front of them, the dozens of figures flying over also had astonished looks on their faces as they sized up the immortal empire’s disciples.<br/><br/>“Something’s wrong. The Aura on their bodies is completely different from ours. It’s also completely different from our nine-origin universe. The energy on their bodies is also very strange.”<br/><br/>Very quickly, an immortal nation’s expert said with surprise in his eyes.<br/><br/>“Which race are you from?”<br/><br/>He hesitated for a moment and asked the other party.<br/><br/>On the opposite side, the expressions of the more than twenty figures didn’t change when they heard the immortal nation’s expert’s words.<br/><br/>They looked at each other, and their eyes flickered with a luster!<br/><br/>“You aren’t creatures from the Starry Cosmos!”<br/><br/>The middle-aged man in the lead among the twenty plus figures stared at the group of Immortal Empire’s expert disciples and asked.<br/><br/>When his words rang out, the expressions of the immortal empire’s expert disciples also changed.<br/><br/>Their language didn’t belong to the nine-origin cosmos.<br/><br/>The nine-origin Cosmos had its own language.<br/><br/>And what they said could confirm that it didn’t belong to the nine-origin universe.<br/><br/>The reason they could hear it was because of the spiritual communication.<br/><br/>Through the spiritual transmission, they could understand what the other party was saying.<br/><br/>“You aren’t from the starry universe either. Which Universe are you from? How can you enter the Starry Universe?”<br/><br/>The leader of the immortal nation asked with a shocked face.<br/><br/>They actually met other universe masters, this… How was this possible?<br/><br/>There were other universe masters entering the Starry Universe?<br/><br/>It wasn’t just their nine-origin universe here?<br/><br/>This wasn’t good news for the nine-origin universe.<br/><br/>Because the competitors had appeared!<br/><br/>“Kill them!”<br/><br/>But at this time, the leader of the middle-aged man immediately roared and moved, attacking the dozen or so immortal nation masters.<br/><br/>“Weng!”<br/><br/>The middle-aged man in the lead waved his arm, and a strange weapon appeared in his hand. He directly swept it across.<br/><br/>An attack that contained a special energy attacked them.<br/><br/>The attributes of this attack were very strange. It seemed to contain an invincible will and the determination of thousands of creatures!<br/><br/>It was very special, very strange, and also very powerful!<br/><br/>This caused the expressions of the dozen or so experts from the immortal empire to change.<br/><br/>“Courting death, kill them!”<br/><br/>The expert from the Immortal Empire roared madly. His body trembled, and an illusory image of the immortal empire floated in the air above them.<br/><br/>On the illusory image, an incomparably huge palm directly condensed and shot towards them!<br/><br/>The attack of the middle-aged man rapidly collapsed under this huge palm!<br/><br/>“Oh? Not Good, this group of people’s strength is very strong!”<br/><br/>The expression of the middle-aged man in the lead changed, and he cried out in alarm.<br/><br/>“Kill them!”<br/><br/>However, the eyes of the immortal nation’s expert shone, and he immediately roared loudly.<br/><br/>He could not see through the energy used by the other party, so he naturally could not see through the other party’s strength.<br/><br/>However, after exchanging blows, he knew that he was one level higher than the other party!<br/><br/>Since the other party wanted to kill them.<br/><br/>Then they also wanted to kill the other party.<br/><br/>He wanted to know which universe these creatures came from.<br/><br/>They actually entered the starry universe just like their 9-origin universe!<br/><br/>This was a potential competitor, or even an enemy!<br/><br/>“Run, we aren’t their match!”<br/><br/>The middle-aged expert on the other side roared and immediately flew back.<br/><br/>A shadow slowly appeared behind him. The Shadow had the appearance of a human. They sat there quietly as if they were chanting and blessing!<br/><br/>The middle-aged expert’s speed soared and he immediately flew back.<br/><br/>The middle-aged expert and the others naturally came from the faith of the gods who believed in the universe.<br/><br/>Their power was the power of faith.<br/><br/>It was not the power of metal, wood, water, fire, and earth, but a special kind of energy.<br/><br/>The power of faith had no weaknesses and no disadvantages.<br/><br/>As long as there were many believers, the believers gave up a lot of power, and the believers were strong, the power of their faith in the gods would become stronger.<br/><br/>When the experts of the faith in the gods and the immortal empire started to fight, it also represented the collision between the nine-origin universe and the Faith Universe. Begin!\t\t\t\t\t\t</div>", "images": {}, "success": true}