{"id": 811, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073523.html", "title": "Chapter 3808 - 3808 3807 Lasted For Millions Of Years. It Was The Beginning Of The Collision Between The Two Universes", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3808 - 3808 3807 Lasted For Millions Of Years. It Was The Beginning Of The Collision Between The Two Universes</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3808 3807 lasted for millions of years. It was the beginning of the collision between the two universes<br/><br/>Time passed by slowly!<br/><br/>Wang Xian was waiting for the transformation of the Tai Chi Dragon Disc and the Great Mill of the five elements in front of the storm continent.<br/><br/>Similarly, Xiao Lan, Xiao House, and Xiao Bai were also upgrading themselves.<br/><br/>The ancient gods were feeding the Kun master. There was one thing that was extremely terrifying.<br/><br/>The Space Beasts in the starry universe also had their own shackles when they broke through!<br/><br/>After reaching the ruler realm, they also needed to comprehend to break through.<br/><br/>However, as long as little blue and the others had enough resources, they wouldn’t have any shackles to break through.<br/><br/>Perhaps when they reached the peak of the ruler realm, they would encounter shackles!<br/><br/>This time, the improvement was very slow. Little Blue, little white, and the others used a full 5,000 years to complete the breakthrough!<br/><br/>They broke through to the level 6 ruler realm.<br/><br/>This power could no longer be compared to the Great Beings of the 9-origin universe!<br/><br/>Compared to the Great Beings of the 9-origin universe who entered the starry universe, Little Blue and the others had become invincible beings.<br/><br/>Even if they had a large number of true treasures and a large number of weapons, they were still no match for little blue and the others.<br/><br/>The Gap was too big!<br/><br/>Unless a master of the ninth level of the nine-origin universe, an existence at the pinnacle could enter the starry universe.<br/><br/>Unfortunately, they couldn’t!<br/><br/>When Xiao Lan and the rest broke through, they were located on the other side of the storm continent.<br/><br/>The powerful space beast stared coldly at Xiao Lan, Xiao Bai, and the rest and let out a warning roar.<br/><br/>When Wang Xian and the rest saw the situation, they distanced themselves from the Space Beast.<br/><br/>Now that Wang Xian and the rest had improved their strength, they could already sense the strength of the space beast there.<br/><br/>The strongest person had the strength of a ruler at level seven.<br/><br/>It was also because the strongest person in the nine-origin universe needed to be at the peak of the ruler realm to be able to fight against them!<br/><br/>“It would be great if my strength could occupy the center of the storm continent. With so many terrifying metal materials, it would definitely be a significant improvement for the Dragon Palace.”<br/><br/>Wang Xian mumbled to himself.<br/><br/>After Xiao Lan and the rest had improved, Wang Xian had instructed Lan Qingyue and the rest to move around by themselves!<br/><br/>Xiao Lan and the rest’s strength was already considered pretty good in the starry universe. They could definitely search for some treasured lands and opportunities.<br/><br/>As for Wang Xian, he still had to wait for the absorption of the Tai Chi Dragon Disc and the Five Elements Millstone.<br/><br/>It was a little difficult for the five elements Millstone and the Tai Chi Dragon Disc to absorb these materials and metals.<br/><br/>After all, this was equivalent to a strong cultivator cultivating and consuming a large amount of resources.<br/><br/>Absorbing these resources would also require a large amount of time.<br/><br/>Time passed by quickly. A million years would only pass by quickly.<br/><br/>When Wang Xian was in the depths of the storm continent, he had built a temporary residence!<br/><br/>During this million years, a large portion of the time was spent with Guan Shuqing and the other girls accompanying him.<br/><br/>Boom! Boom! Boom<br/><br/>On this day, waves of vast energy were transmitted from both sides at the same time.<br/><br/>Wang Xian sensed it and his eyes revealed an excited expression.<br/><br/>His body moved and he immediately flew out of the palace.<br/><br/>Looking at the terrifying energy emitted from the Tai Chi Dragon Disc and the five elements millstone on the left and right, Wang Xian’s eyes revealed an excited expression.<br/><br/>He had broken through!<br/><br/>They had broken through at the same time!<br/><br/>More than 900,000 years ago, the Five Elements Millstone and the Tai Chi Dragon Disc had already broken through to the eighth level of the Overlord realm.<br/><br/>Now, they had reached the ninth level of the Overlord realm.<br/><br/>Wang Xian waved his arm and the Tai Chi Dragon Disc came before him. It hovered around him and slowly formed a black robe.<br/><br/>The dragon heads of the Divine Dragons of light and darkness were located on his left and right shoulders respectively.<br/><br/>Wang Xian instantly felt an extremely powerful force surging into his body.<br/><br/>Wang Xian’s current strength was only at the level seven of the Overlord realm. He did not dare to increase his strength.<br/><br/>He did not dare to use the power of the Tai Chi Dragon Disk to unleash the strength of the Overlord realm of level nine after the tai chi dragon fatty circled around him.<br/><br/>Moreover, he could basically ignore the attacks of one or two experts at the Overlord realm of level nine.<br/><br/>With a wave of his arm, the five elements millstone came to the sky above him.<br/><br/>“Roar!”<br/><br/>“Roar! Roar!”<br/><br/>Above him, the five divine dragons roared and gradually shrunk into the shape of a crown.<br/><br/>On the crown, the Golden, Wood, water, fire, and Earth Divine Dragons raised their heads, making the entire crown look extremely majestic.<br/><br/>The Five Elements Millstone was also able to fight against three masters of the ninth level.<br/><br/>Even though Wang Xian had yet to level up, he could still kill an existence at the level nine of the ruler realm in an instant.<br/><br/>After all, the core of the Five Elements Millstone and the Tai Chi Dragon Disc were formed by his clone back then with the help of the five elements origin and the heart of Light and darkness.<br/><br/>“Very good, very powerful!”<br/><br/>Wang Xian revealed a satisfied expression. With the improvement of the Tai Chi Dragon Disc and the Five Elements Millstone, he could head deeper into the starry universe!<br/><br/>He could explore the entire starry universe!<br/><br/>During these million years, the reputation of the Dragon Palace grew day by day.<br/><br/>Especially when Lan Qingyue led Xiao Lan and the rest away and occupied a treasured land, the reputation of the Dragon Palace grew.<br/><br/>In addition, during these million years, the disciples of the Dragon Palace entered the starry universe one after another.<br/><br/>There were a few million disciples who entered. None of them were weaker than the peak of the venerable realm.<br/><br/>This discovery shocked the other races in the nine-origin universe.<br/><br/>Even the peak races were shocked by the number of Dragon Palace’s venerable realm experts.<br/><br/>But although they were shocked, they weren’t too surprised.<br/><br/>The existence of the peak of the venerable realm, for those who had the bloodline of the peak races, as long as they had enough resources, they could mass produce them!<br/><br/>However, they didn’t want to waste so many resources on experts below the ruler realm.<br/><br/>It was a better choice to increase the strength of experts above the ruler realm.<br/><br/>However, over the past million years, the number of experts at the ruler realm in the Dragon Palace had increased dramatically.<br/><br/>This increase was enormous!<br/><br/>Over the past million years, there had been an increase of 1,000 existences at the first level of the ruler realm.<br/><br/>There were two main reasons for this terrifying increase.<br/><br/>One was the fire heart treasure land, which only disciples of the Dragon Palace could enter.<br/><br/>This fire heart treasure land was comparable to the core treasure land of a peak race.<br/><br/>Hundreds of disciples of the fire-elemental Dragon Palace had made breakthroughs here.<br/><br/>The second was the baptism Dragon Pool on the Divine Dragon Island, which allowed many water-elemental disciples of the Dragon Palace to make breakthroughs!<br/><br/>These two places were also the most precious places for the peak races.<br/><br/>Although there were a lot of people who had reached the ruler realm in a million years, it was still normal.<br/><br/>In this one million years, there were more than a dozen level 2 rulers of the Dragon Palace.<br/><br/>The seven mad demon Shaman Veils, water demons, demon wings, Shi Sen, Ming Sha Sheng, Thunder Flash, and Sky Shrouding were the first to break through and reach the ruler realm.<br/><br/>There were also Little Yu, Fan Qing Lan, and bei Shuang.<br/><br/>They were all mutated divine dragons.<br/><br/>When mutated divine dragons broke through their shackles, they had a huge advantage.<br/><br/>Their breakthrough was comparable to an ordinary ruler at the third level.\t\t\t\t\t\t</div>", "images": {}, "success": true}