{"id": 817, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073535.html", "title": "Chapter 3814 - 3814 3813 Announced, Dragon Palace Hunting Squad", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3814 - 3814 3813 Announced, Dragon Palace Hunting Squad</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3814 3813 announced, Dragon Palace Hunting squad<br/><br/>Demon clan: “The appearance of a powerful enemy, the appearance of beings who believe in the universe, the enemy of the nine-origin universe, the demon clan will establish a hunting squad for beings who believe in the universe.<br/><br/>“Beings who believe in the universe possess the power of belief, and the strangest method is to use belief runes to control other beings, making them become their own believers and be driven by them forever.<br/><br/>The disciples of the other races paid attention. If they encountered creatures that didn’t have the nine attributes of the nine-origin universe, they would immediately run away and pass their information to any peak race.<br/><br/>“All the high-level races can join our demon race and hunt creatures that believe in the universe.”<br/><br/>The witch race: “Powerful Enemies have appeared. Creatures that believe in the universe have appeared in the starry universe. Creatures that believe in the universe, enemies of the nine-origin universe. The witch race will form a team to hunt creatures that believe in the universe…”<br/><br/>The Angel Clan:”…”<br/><br/>The Phoenix Clan:”…”<br/><br/>The Immortal Nation:”…”<br/><br/>The Saint:”…”<br/><br/>The Dragon Palace:”…”<br/><br/>After the thirteen peak races finished their discussion, they immediately sent this news to every expert and disciple in the nine-origin universe in the name of the peak races.<br/><br/>Their announcement was mainly to tell the disciples of the experts of the high-level races.<br/><br/>At present, many of the high-level races had already pledged allegiance to the pinnacle races.<br/><br/>However, there were still some who had not pledged allegiance.<br/><br/>This news was also a reminder to them.<br/><br/>After all, it was a collision between two universes. Every disciple of a great being from the nine-origin universe was on their side.<br/><br/>Once a large number of disciples from the nine-origin universe were taken in as believers by the belief universe, the nine-origin universe would also encounter great trouble.<br/><br/>The belief universe was able to break through another universe during the last calamity because of this method of taking in disciples and breaking through the internal structure.<br/><br/>Wang Xian also made a statement in the name of the peak race.<br/><br/>However, after he made the statement, he made another statement.<br/><br/>Dragon Palace: The Dragon Palace is recruiting aquatic creatures. Those who join the Dragon Palace will receive the Divine Dragon Bloodline!<br/><br/>Currently, the Dragon Palace had over eight million strong disciples. This was not a large number. Among the peak races, it was considered a small number.<br/><br/>He decided to recruit more disciples. At the very least, he wanted the number of disciples in the Dragon Palace to reach 10 million.<br/><br/>10 million was one of Wang Xian’s goals.<br/><br/>It was also a number that Wang Xian wanted to maintain.<br/><br/>To allow all 10 million disciples of the Dragon Palace to advance to the peak of the supremacy realm, this was an exceptionally terrifying combat strength.<br/><br/>Those who had broken through to the ruler realm would be able to form a ruler army in the future.<br/><br/>They would be able to better welcome the arrival of the Apocalypse!<br/><br/>“Hiss, what’s going on? The belief universe? What is the belief universe? The 13 peak races are making such a statement at the same time. is something big about to happen?”<br/><br/>“Oh my God, the 13 peak races are making such a statement at the same time. This is too shocking. Are we going to fight against the experts of the belief universe in the Starry Universe?”<br/><br/>“No Way, all the pinnacle races are making such a statement at the same time. This…”. “Is the starry universe going to become dangerous?”? “The Pinnacle races have all formed hunting squads and are all working together. This is insane. The 13 pinnacle races are working together to fight against the other universes!”<br/><br/>“I feel like a great war is about to break out.”<br/><br/>“I heard from the Great Beings of the witch clan that we will send more great beings over to hunt down the disciples of the Great Beings of the belief universe.”<br/><br/>“Hunting down the creatures of the belief universe and obtaining the heart of belief will help us break through the shackles!”<br/><br/>When the 13 pinnacle races released the news at the same time, it caused a huge uproar.<br/><br/>Belief Universe?<br/><br/>A Great War broke out?<br/><br/>The 13 pinnacle races working together?<br/><br/>Every piece of news shocked the hearts of the disciples of the high-level races in the nine-origin universe.<br/><br/>This news was too shocking!<br/><br/>Very soon, Wang Xian’s second statement also caused a huge uproar.<br/><br/>“The Dragon Palace actually wants to recruit disciples and will reward the Divine Dragon Bloodline?”<br/><br/>“Wow, no way. The Dragon Palace is provoking disciples. This is a heaven-sent opportunity for us aquatic creatures.”<br/><br/>“Although the Dragon Palace’s current strength is not enough among the peak races, the Dragon King’s potential is too terrifying. In a short period of time, he could easily kill a level seven ruler. He also has the extremely terrifying ancient god, Kun master, and is invincible in the starry universe. The Phoenix clan and the Angel clan all bow to the Dragon Palace. Joining the Dragon Palace is definitely an opportunity for all the aquatic creatures’experts.”<br/><br/>“There are so many powerful beings in the Dragon Palace. In the past million years, I have never seen anyone below the peak of the venerable realm in the Dragon Palace. I want to join.”<br/><br/>This news from the Dragon Palace attracted many aquatic creatures.<br/><br/>The other races felt a little regretful when they saw it.<br/><br/>However, compared to this news from the Dragon Palace, the news about the belief universe was too shocking. It made all the powerful disciples in the nine-origin universe talk about it.<br/><br/>Even the strong disciples from the peak races.<br/><br/>To them, this was the first time they had met a living being from another universe!<br/><br/>“Prime Minister Gui, form a hunting team in the Dragon Palace and bring out the strongest strength of our Dragon Palace. Also, the advancement seed on the ancestral tree should have matured. Just give it to a disciple of the Dragon Palace to consume!”<br/><br/>Wang Xian was located at the cosmic passageway and sent a message to Prime Minister Gui.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui replied very quickly.<br/><br/>“Also, ask Lan Qingyue to place a kun in the hunting squad of the Dragon Palace.”<br/><br/>Wang Xian mumbled.<br/><br/>The current strength of the Dragon Palace was still too weak. Even if the hunting squad was successfully established, the strongest person was only bei Shuang, who had the strength equivalent to a ruler at the third level.<br/><br/>This hunting squad could be said to be very weak when compared to the peak races.<br/><br/>However, with a Kun following them, things were different!<br/><br/>He got Lan Qingyue to bring the other two Kun to continue searching for opportunities in the starry universe, and the other Kun to hunt.<br/><br/>Wang Xian himself was prepared to hunt and see.<br/><br/>He wanted to see if he could meet any creatures who believed in the universe. After killing them, he wanted to see if the so-called heart of faith was worth it.<br/><br/>If there were ten-handed ancestral witches who could increase their strength significantly, Wang Xian would start a large-scale hunt.<br/><br/>Currently, the Dragon Palace did not lack resources. Many of its disciples had already advanced to the peak of the supremacy realm.<br/><br/>In addition, those who were at the ruler realm had all reached the peak of the first and second stage of the ruler realm.<br/><br/>If killing and obtaining the heart of faith could help the disciples of the Dragon Palace to make a rapid breakthrough, the strength of the Dragon Palace would be able to increase explosively.<br/><br/>After all, the shackles were the most important for those at the peak of the venerable realm and above.<br/><br/>Breaking through the shackles was far more troublesome than accumulating resources.<br/><br/>He moved and immediately flew toward the interior of the starry sky.<br/><br/>The other peak races also started to prepare.<br/><br/>This was an opportunity, but it could also be a disaster!\t\t\t\t\t\t</div>", "images": {}, "success": true}