{"id": 819, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073539.html", "title": "Chapter 3816 - 3816 3815 Muddy Land, On The Giant Space Beast", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3816 - 3816 3815 Muddy Land, On The Giant Space Beast</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3816 3815 muddy land, on the Giant Space Beast<br/><br/>“Oh?”<br/><br/>Wang Xian’s eyes sparkled when he heard Lan Qingyue’s information.<br/><br/>They had encountered a treasure land?<br/><br/>The place that Lan Qingyue could reach was beyond the reach of the experts from the other peak races.<br/><br/>The treasure land inside was definitely not simple!<br/><br/>“Where is it? How many level six space beasts are there?”<br/><br/>Wang Xian quickly asked.<br/><br/>“There should be seven or eight.”<br/><br/>Lan qingyue said, “I’m not sure either. However, after your tai chi dragon disc and the Great Mill of the five elements have been upgraded, we can definitely go there.”<br/><br/>“Let’s go.”<br/><br/>Wang Xian nodded. “Let’s go and take a look. Since we entered the starry universe from the Dragon Palace, we have yet to find our own paradise.”<br/><br/>When the Dragon Palace entered the starry universe, they didn’t occupy any precious land in the past.<br/><br/>The rest of the peak races had all found their own paradise in the starry universe.<br/><br/>Such a paradise would be a great improvement for their disciples!<br/><br/>“Alright!”<br/><br/>Lan qingyue nodded. The two of them moved and immediately arrived at the small house.<br/><br/>Xiao Lan was now flying toward the trading corridor. He would meet up with the experts of the Dragon Palace and form a hunting team.<br/><br/>Of course, Xiao Lan’s arrival was mainly to protect them.<br/><br/>After all, the disciples of the Dragon Palace were too weak.<br/><br/>With Xiao Lan, he could rival a powerful team of a peak race.<br/><br/>“In that direction, the starry sky is a bit strange. It’s All Black and red. If you enter there, you will be covered by a red poisonous fog.”<br/><br/>Lan qingyue said, “When Xiao Lan and the rest entered, we were warned by the space behemoths inside. We saw seven to eight space behemoths that were at level six. However, we didn’t see any of the better ones. If there was a higher level, they wouldn’t warn us but would attack US directly.”<br/><br/>Wang Xian nodded his head slightly. Xiao Zhai brought them and flew towards that direction quickly.<br/><br/>Their speed was very fast. This place was not too far away from the place that Lan Qingyue mentioned.<br/><br/>Soon, an area shrouded in black and red appeared in his line of sight.<br/><br/>Wang Xian looked over and his eyes sparkled.<br/><br/>“There’s something strange in here. In the deepest part of the area, the black and red energy has gathered together and turned into a solid substance. It’s like strange flesh and blood!”<br/><br/>He opened his mouth and said.<br/><br/>“Yes, this should be a special type of energy. The space beasts in there are also very strange in size. It’s a little disgusting, just like an octopus without claws.”<br/><br/>Lan qingyue nodded.<br/><br/>“Let’s go. If there are only seven or eight space beasts at the level six of the ruler realm, we can completely occupy a territory and even kill them.”<br/><br/>Wang Xian’s eyes sparkled.<br/><br/>The Tai Chi Dragon disc and the five elements grinding mill were able to fight against six level six space beasts.<br/><br/>If Lan Qingyue and the rest were to unleash their full power, they should be able to fight against four to five.<br/><br/>If Xiao Lan was here, they would be even stronger.<br/><br/>“Woo Woo!”<br/><br/>The small house let out a low growl and immediately flew in.<br/><br/>“Hualala!”<br/><br/>“Hualala!”<br/><br/>“Roar Roar Roar!”<br/><br/>At this moment, a series of strange sounds came from inside.<br/><br/>Following that, in Wang Xian’s line of sight, he saw octopuses that looked like they had no tentacles flying over.<br/><br/>Their bodies were black with a red dot on them. They looked a little scary.<br/><br/>Two gigantic eyes were staring at the small house and Wang Xian and the rest.<br/><br/>There were a total of five of these space beasts staring at them.<br/><br/>In addition, there were other space beasts that were relatively weaker inside.<br/><br/>Wang Xian waved his arm and the five elements millstone floated in the air. In an instant, it became bigger. Its size was the same as the small house and the rest.<br/><br/>A terrifying energy charged at them.<br/><br/>“Let’s go, small house. Let’s go in and advance.”<br/><br/>Wang Xian ordered the little house and the rest.<br/><br/>“Roar Roar Roar!”<br/><br/>“Roar Roar!”<br/><br/>“Roar Roar!”<br/><br/>When the five space beasts saw that they were continuing to fly in, they issued a warning.<br/><br/>“Hualala!”<br/><br/>At this moment, at the back, three more space beasts who were at level six flew over and stared at Wang Xian and the rest.<br/><br/>Other than that, there were dozens of space beasts who were also warning them. It was obvious that they didn’t want them to enter this place.<br/><br/>“Woo Woo!”<br/><br/>Xiao Zhai let out a low growl and transmitted the message that he wanted to enter.<br/><br/>Lan Qingyue’s body shook as well. The powerful force that belonged to the ancient god Feed Kun master swept forward.<br/><br/>The Space Beasts on the opposite side were slightly agitated.<br/><br/>“Roar! Roar!”<br/><br/>All of a sudden, the red dot on the Space Beast’s body, which was located in the middle, emitted streams of blood-red light and attacked Wang Xian and the rest.<br/><br/>When Wang Xian saw the group of space beasts on the opposite side attacking, a sinister look appeared in his eyes.<br/><br/>“Qingyue, destroy them!”<br/><br/>Wang Xian growled in a low voice. With a wave of his arm, the five elements were ground together with the roar of the Divine Dragon. Streams of terrifying power of the five elements covered the space beast directly.<br/><br/>From this side, Wang Xian could sense that there was a special and powerful energy inside.<br/><br/>Therefore, he had to enter this place.<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>On the other side, the space behemoths were all roaring. Streams of blood-red energy were pouring over.<br/><br/>“There’s a fish in the north, Kun Xiao!”<br/><br/>Lan Qingyue let out a low growl. A stream of energy surged into the small house and Xiao Bai’s bodies.<br/><br/>The ancient gods fed the Kun masters, and their strongest point was to fight together with their own kun.<br/><br/>In the past million years, Lan Qingyue had also killed a level six ruler-level astral beast. She was already very experienced in battle.<br/><br/>“Wu Wu Wu!”<br/><br/>“Wu Wu Wu!”<br/><br/>Xiao Zhai and Xiao Bai opened their mouths at the same time. Their Kun howls were not a sound wave attack. Instead, the gray energy condensed into a terrifying giant mouth of the Kun.<br/><br/>The giant mouth of Kun devoured the group of Space Beasts.<br/><br/>Wang Xian also clenched his fists and charged forward.<br/><br/>The Light and Darkness Powers on the Fat Tai Chi Dragon instantly condensed into two divine dragons of light and darkness and attacked at the same time.<br/><br/>Boom! Boom! Boom<br/><br/>In the next moment, the sound of collision was heard. The terrifying energy charged into the surroundings.<br/><br/>Wang Xian’s figure moved. He locked onto a space beast and attacked it directly.<br/><br/>When the space beast saw Wang Xian attacking him, its blood-red eyes emitted a blood mist which instantly enveloped the entire space!<br/><br/>“Kun’s Domain!”<br/><br/>Xiao Bai and Xiao Zhai let out a low roar. A wave of energy blocked his domain attack.<br/><br/>The gray energy collided with the blood-red energy and caused the energy to dissipate!<br/><br/>“Roar!”<br/><br/>“Roar!”<br/><br/>The other seven space beasts saw it and immediately attacked the small house and the rest.<br/><br/>“Qing Yue, help me block the other seven. I’ll kill this guy first!”<br/><br/>Wang Xian shouted in a low voice. Borrowing the power of the Tai Chi Dragon Plate, he attacked the space beast once again.\t\t\t\t\t\t</div>", "images": {}, "success": true}