{"id": 818, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073537.html", "title": "Chapter 3815 - 3815 3,814, The Battle Between The Two Universes", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3815 - 3815 3,814, The Battle Between The Two Universes</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3815 3,814, the battle between the two universes<br/><br/>“I really didn’t expect that there would be disciples from the nine-origin universe in the Starry Universe!”<br/><br/>Just as the pinnacle races of the nine-origin universe started to form an army to hunt the disciples of the Great Beings from the belief universe.<br/><br/>It was located at the entrance of the starry universe and the belief universe.<br/><br/>At this moment, a large number of gods from the belief universe were gathered there.<br/><br/>Especially the gods in the center. Their bodies were surrounded by divine sounds, and countless figures were singing and praising around them.<br/><br/>The starry universe, to the experts who believed in the universe, also had a terrifying suppressive force.<br/><br/>The powerful gods who believed in the universe also didn’t dare to step into the starry universe.<br/><br/>Because this was the starry universe.<br/><br/>The Starry Beasts in the starry universe didn’t have intelligence, but the starry universe began to have heavenly yuan destiny level starry beasts.<br/><br/>They had the consciousness of territory and territory.<br/><br/>They might not care if some ants entered their territory, but if a lion entered, it would definitely be destroyed.<br/><br/>The powerful gods who believed in the universe didn’t dare to take a step over.<br/><br/>In fact, they had already sent in experts.<br/><br/>But they had already been destroyed by the powerful space beasts in the starry universe.<br/><br/>At this point, they also understood the rules of the starry universe.<br/><br/>“The strength of the nine-origin universe isn’t weak. However, in the last calamity battle, our belief universe won a great victory. Our strength has doubled and has already far surpassed the nine-origin universe. There are actually disciples of the nine-origin universe here. Let’s use them to test our strength. If the strength of the nine-origin universe isn’t enough, when the calamity arrives, we can consider developing them into our believer universe!”<br/><br/>One of the gods said indifferently.<br/><br/>“Hahaha, with the strength of our belief universe, when the calamity arrives, we won’t be afraid of any universe. We want the resources of the starry universe, and we also want the creatures of the nine-origin universe. We’ll develop them into our believers and increase our strength.”<br/><br/>One of the gods said with a laugh.<br/><br/>“The nine-origin universe might have discovered our arrival, so we have to be careful. Especially the witches and demons of the nine-origin universe, they are very difficult to deal with.”<br/><br/>A pantheon expert said indifferently.<br/><br/>“In these million years, how many level 5 space beasts have become our believers?”<br/><br/>A pantheon expert asked.<br/><br/>In these million years, after some exploration of the starry universe.<br/><br/>The next exploration method of the Pantheon universe was different from the starry universe.<br/><br/>The strength of the Pantheon came from the power of faith. The more believers they had, the stronger they would be, and the stronger they would be.<br/><br/>And in order to better explore the starry universe, their initial target was the level 5 space behemoths.<br/><br/>And the level 5 space behemoths needed their level 7 gods to work together. They needed to spend a lot of time imprinting faith runes before they could collect them bit by bit.<br/><br/>For this, a large number of level 7 gods worked together.<br/><br/>Even the matter of exploring the starry universe was put on hold.<br/><br/>And their cooperation also allowed them to gain a huge harvest.<br/><br/>“Eight, eight level 5 space beasts have been subdued, which is equivalent to eight of US level 8 gods.”<br/><br/>An expert of the gods spoke.<br/><br/>They believed in the universe, and level 8 gods couldn’t enter the starry universe.<br/><br/>Once they entered, they would be attacked by the space beasts.<br/><br/>The level eight gods’strength was comparable to a ruler at level eight.<br/><br/>“Eight level five? I don’t know how long the nine origin universe has been in the universe. They must have the strength to deal with level eight space beasts. When can they tame a level six space beast?”<br/><br/>An expert asked.<br/><br/>“It’s very difficult to tame level six star beasts. We need to tame at least 70 to 80 level five star beasts and then besiege that level six star beast. It’ll take tens of millions of years before it’s possible.”<br/><br/>One of the gods replied.<br/><br/>“It’s too long. Tens of millions of years. When that time comes, the experts of the 9-origin universe will get a lot of the resources of the starry universe. Let’s do it. The races of the 9-origin universe have their trump cards, and so do we.”<br/><br/>An expert from the gods in the center ordered.<br/><br/>“Alright, let’s test the strength of this nine-origin universe. If they really can’t do it, we will destroy them when the calamity arrives. hahaha!”<br/><br/>Wild laughter rang out as the orders from the belief universe were quickly transmitted out.<br/><br/>…<br/><br/>“The disciples of the experts from the belief universe don’t even know where they are now. We can first meet up with Lan Qingyue and enter the depths of the starry universe to look for some resources.”<br/><br/>Wang Xian was flying rapidly in the starry universe. He was not prepared to meet the strong disciples who believed in the universe at the first opportunity.<br/><br/>This was a waste of time. It might take hundreds of years or even more to search for them.<br/><br/>He could go to the center of the starry universe now.<br/><br/>With Wang Xian’s current strength, he could already go to the center of the starry universe to take a look since he was able to kill a level six cosmic beast.<br/><br/>Of course, he still did not dare to go to the boundless starry universe.<br/><br/>The boundless starry universe was just like the center of the nine-origin universe’s heaven-opening desolation continent.<br/><br/>At the center of the heaven-opening desolation continent, there were twelve peak races. There were many experts who were at level six and above.<br/><br/>It was the same for the boundless starry universe.<br/><br/>If a level seven cosmic beast came, Wang Xian and the rest would be devoured.<br/><br/>However, they could go to places that other peak races could not enter at the moment.<br/><br/>There was definitely a large number of resources and treasures there.<br/><br/>Wang Xian would go and take a look again when the strong disciples from the belief universe had completely appeared and started to collide with the nine-origin universe.<br/><br/>He sent a message to LAN qingyue.<br/><br/>Very soon, Lan Qingyue replied.<br/><br/>In these million years, Lan Qing Yue’s harvest wasn’t cheap.<br/><br/>With little blue and the others, they hunted some level 5 space beasts, and even a level 6 space beast.<br/><br/>However, this wasn’t suitable. It wasn’t worth it to hunt experts from the 9-origin universe.<br/><br/>After all, although their strength was suppressed, the energy within their bodies wasn’t small.<br/><br/>However, other than the corpses of some space beasts, they had also obtained a lot of resources from a large number of life planets.<br/><br/>Wang Xian decided to meet up with Lan Qingyue and continue his exploration.<br/><br/>After flying for a few years, Xiao Lan and the rest finally appeared in Wang Xian’s line of sight.<br/><br/>“Qingyue!”<br/><br/>He flew over quickly and shouted.<br/><br/>“Xiao Xian.”<br/><br/>Lan Qingyue greeted him with a smile. “What’s the situation in the belief universe? Why did another universe suddenly appear?”<br/><br/>“I don’t know either. However, we don’t have to worry. In the starry universe, Our Dragon Palace is not afraid of them at all!”<br/><br/>Wang Xian shook his head with a smile. “Perhaps, they can bring us some benefits.”<br/><br/>“That’s good. Oh yes, Xiao Lan and I have discovered a treasure land. However, there is a race of space beasts there. There are several space beasts that are at level six.”<br/><br/>Lan qingyue smiled and said.\t\t\t\t\t\t</div>", "images": {}, "success": true}