{"id": 815, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073531.html", "title": "Chapter 3812 - 3812 3811 Under The Belief Universe", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3812 - 3812 3811 Under The Belief Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3812 3811 under the belief universe<br/><br/>“The cultivation method of the belief universe is to collect the power of faith. They develop believers and make them offer their faith. They collect the power of faith through the heart of faith.”<br/><br/>“The power of faith is unclear. It is the exclusive power of that universe, but it has very powerful means. The gods who believe in the universe have all kinds of powerful means, especially when they are in a life-or-death situation. They can make their believers sacrifice their lives in a faraway place and then burst out with abnormally terrifying strength.”<br/><br/>“When we encounter gods who believe in the universe, it’s best to first involve them when they erupt. Their eruptions are limited, just like the Phoenix race’s burning of life.”<br/><br/>“In addition, the belief universe is very powerful. It even requires our attention. The belief runes they condensed gather the wills of countless believers. Once these belief runes are injected into the bodies of other living beings, they will be washed away by the countless belief wills, forcefully turning them into believers who believe in themselves.”<br/><br/>“As long as it’s a living being, they can control it through this method.”<br/><br/>The Elven queen introduced to Wang Xian and the experts of the skeleton race.<br/><br/>Every universe had its own strengths and characteristics.<br/><br/>The methods of believing in the universe were also very strange.<br/><br/>“To think that they could forcefully make an expert become their own disciple. Such methods are really terrifying.”<br/><br/>Wang Xian sighed slightly.<br/><br/>“Indeed, they are very powerful. However, their faith runes have little effect on the voodoo race and the saint’s lineage. They are even immune to them. This is because the spirit and will of the voodoo race and the dark race are extremely terrifying and unique.”<br/><br/>The Elven queen nodded her head.<br/><br/>At this moment, he looked around and said, “All the peak races are here.”<br/><br/>Wang Xian looked over and saw the Phoenix race, the angel race, the royal race, and so on. A group of experts flew over from the starry universe.<br/><br/>In the surrounding area, a group of experts from the peak races had also arrived.<br/><br/>“Since they are all here, let’s begin!”<br/><br/>The Skeleton King, who was at the peak of the ruler realm, looked towards the celestial nation and said.<br/><br/>“Since all the thirteen peak races are here, let’s begin!”<br/><br/>An expert at the peak of the Dominator realm from the celestial nation nodded and said.<br/><br/>Out of the thirteen peak races, apart from the Dragon Palace where Wang Xian was the only one who came, hundreds of experts from the other peak races had come.<br/><br/>Every peak race had an existence at the peak of the Dominator realm.<br/><br/>One could imagine how much importance they placed on this matter.<br/><br/>“Let’s begin!”<br/><br/>An old man from the shaman tribe wearing a bamboo hat let out a hoarse voice.<br/><br/>The experts from the Angel tribe and the Phoenix tribe swept their gaze across the surroundings and landed on Wang Xian. They froze for a moment.<br/><br/>However, they did not reveal any hostility.<br/><br/>Since they had already sought peace, it was impossible for them to show a look of deep hatred after meeting him.<br/><br/>There was no need for that either.<br/><br/>“According to the report of a fourth level ruler disciple from our immortal empire, an expert from the belief universe was discovered in an extremely deep location in the starry universe, which is opposite to our tunnel.”<br/><br/>“After the disciple from our immortal empire was injected with the belief rune, he had no choice but to commit suicide and was resurrected!”<br/><br/>The Immortal King of the Immortal Empire said.<br/><br/>Immortal King was the name of an expert at the peak of the Immortal Empire’s ruler realm.<br/><br/>In the Immortal Empire, there was an unknown immortal king.<br/><br/>“To be able to control the faith runes of a ruler at the fourth level, then the one who attacked should be the faith gods of a ruler at the sixth level.”<br/><br/>An expert from the saint lineage spoke.<br/><br/>“Because the cultivation system is different, we don’t know the exact strength.”<br/><br/>The Immortal King of the Immortal Empire shook his head. “The Faith Universe entered the starry cosmos. We don’t know when it entered. We must be prepared. When our two universes meet, there is no possibility of peaceful coexistence!”<br/><br/>“Indeed, there is no possibility of peaceful coexistence. In the last Great War of the apocalypse, although they were not mortal enemies with us, they created quite a bit of trouble for us when we were fighting against the Void Universe. If it wasn’t for the fact that we have a troublesome enemy, the Void Universe, we would have definitely destroyed the group of people who believe in the gods.”<br/><br/>The wizard wearing a bamboo hat from the Wizard clan suddenly said!<br/><br/>“It’s true that worshipping the gods is not a good thing. In the last calamity, they broke through a universe and incorporated it into their faith. Now that they can break through the barriers of the starry universe, they must have broken through to another universe.”<br/><br/>“With the resources of the two universes, their strength must have received a terrifying increase. With the aggressive nature of worshipping the gods, they will definitely want to plunder more universes when the calamity arrives.”<br/><br/>The Elven Queen spoke.<br/><br/>Their words revealed a corner of the universe, causing Wang Xian’s eyes to reveal a look of astonishment.<br/><br/>He didn’t expect this belief universe to be so strong.<br/><br/>“Our nine-origin universe has a grudge against them to begin with? Then we can’t let them obtain more resources from the starry universe.”<br/><br/>The expert from the Divine Tiger Clan spoke.<br/><br/>In this era, the Saint Bloodline, the Divine Tiger Bloodline, the skeleton clan, the immortal nation bloodline, and the royal clan were the newly born pinnacle races of the universe.<br/><br/>They didn’t know much about the previous calamity.<br/><br/>Of course, they weren’t completely ignorant. There were still some old fellows among their pinnacle races who knew some things.<br/><br/>This was because those who established the Saint Bloodline, the Divine Tiger Bloodline, the skeleton clan, and the immortal nation were all experts who had survived the previous calamity.<br/><br/>However, they didn’t come this time, nor did they tell their clansmen about this matter.<br/><br/>After all, the calamity would only arrive in a few billion years.<br/><br/>“The calamity will arrive in a few billion years. Just like before, the Void Universe is our number one enemy. This is without a doubt. The belief universe was also our enemy in the past. Their strength is getting stronger and stronger, and they will invade other universes. Therefore, we need to increase our strength as soon as possible.”<br/><br/>“Currently, due to the opening of the cosmic passageway and the birth of the skeleton race’s powerhouses, our nine-origin universe is much stronger than the last cataclysm.”<br/><br/>A female demon powerhouse from the demon race said with a smile.<br/><br/>She flapped her wings.<br/><br/>“Keke, is that so? It seems that the number of powerhouses in your previous peak races is not that many!”<br/><br/>The Skeleton King, who was not far away from Wang Xian, said with a smile.<br/><br/>The skeleton race was born in this era. Due to their uniqueness, they could be said to have been born from the remains of the deceased from the previous calamity.<br/><br/>Therefore, the strength of the skeleton race was really strong.<br/><br/>Even if there were a few top races in the calamity, they would not underestimate the existence of the skeleton race.<br/><br/>“Now we have to make a good strategy!”\t\t\t\t\t\t</div>", "images": {}, "success": true}