{"id": 810, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073521.html", "title": "Chapter 3807 - 3807 The Foundation Of The 3806 Divine Dragon Clan Had Been Obtained!", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3807 - 3807 The Foundation Of The 3806 Divine Dragon Clan Had Been Obtained!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3807 The foundation of the 3806 Divine Dragon Clan had been obtained!<br/><br/>Prime Minister Gui and the others slowly came to the sky above the Divine Dragon Island.<br/><br/>There was only one divine Dragon Island. The other islands could only be said to be subsidiary islands of the Divine Dragon Island.<br/><br/>At the center was an incomparably huge island. The island was lush and green, and nine types of energy surged from below.<br/><br/>At the center was a water pillar. When the water pillar reached the top, it looked like a water god Dragon!<br/><br/>The water pillar contained a special energy.<br/><br/>“This should be the legendary baptism dragon pool. It’s the most useful baptism dragon pool for water elemental dragons!”<br/><br/>Prime Minister Gui looked at the water pillar that had condensed into the shape of a water god Dragon, and his eyes were filled with excitement.<br/><br/>Baptism Dragon Pool!<br/><br/>This was the place where the Heavenly Yuan Destiny Realm powerhouses of the Divine Dragon Clan broke through. This baptism dragon pool had a terrifying effect on water element cultivators.<br/><br/>And this effect was baptism!<br/><br/>The so-called baptism was to increase the comprehension ability of the water element divine dragon and increase the chances of breaking through.<br/><br/>If it was said that one out of ten fire element divine dragons could break through easily during normal cultivation, then it would be the same.<br/><br/>With the help of the baptismal dragon pool, four or five of the fire divine dragons could easily make a breakthrough.<br/><br/>Moreover, even if their cultivation had been raised to the ruler realm, it would still greatly increase their comprehension ability for a breakthrough.<br/><br/>This was definitely a rare treasure for the Divine Dragon Clan.<br/><br/>Because the baptismal dragon pool had been modified by the water divine dragon of heavenly fate, it could only be effective on the Divine Dragon Clan’s experts.<br/><br/>This was also one of the reasons why the Phoenix clan was willing to give up this place.<br/><br/>The leader of the water dragons stared at the baptismal dragon pool with a burning face. This could greatly increase the strength of the Water Dragon God clan.<br/><br/>“Come, let’s go down.”<br/><br/>Prime Minister Gui said and immediately flew down.<br/><br/>When they landed, Prime Minister Gui looked at the dragon pools that were completely devoid of energy.<br/><br/>These dragon pools were different from the baptismal dragon pools.<br/><br/>Below these dragon pools was an enormous paradise that had been transformed by the Divine Dragon clan into dragon pools.<br/><br/>There were ninety-nine dragon pools.<br/><br/>They could see Wisps of energy condensing in these dragon pools.<br/><br/>This was a real dragon pool. The other dragon pools in the Dragon Palace were just imitations.<br/><br/>Of course, the Dragon Transformation Pool in the Dragon Palace was different from this one.<br/><br/>The dragon pools were supported by the blessed land, and the energy generated here was comparable to the fire heart land.<br/><br/>Unfortunately, the energy here had been completely consumed.<br/><br/>However, as time passed, the energy would gradually gather.<br/><br/>“In a few hundred million years, the energy generated will be enough for the Dragon Palace to produce hundreds of masters at the first level of the ruler realm.”<br/><br/>Prime Minister Gui said.<br/><br/>“If there is still energy here, that would be great!”<br/><br/>Ao Tu said slowly!<br/><br/>“Let’s go. According to the records, the Treasure House of the Divine Dragon Clan is located below.”<br/><br/>As Prime Minister Gui said, they moved and flew down.<br/><br/>Soon, they arrived in front of a dragon gate.<br/><br/>Around the Dragon Gate, there were nine dragon pillars, divided into nine attributes.<br/><br/>“The Dragon Gate is closed, let’s see if it can be opened.”<br/><br/>Prime Minister Gui moved his palm, but the Dragon Gate didn’t move at all.<br/><br/>The Water God Dragon Leader also gave it a try, then shook his head.<br/><br/>“The treasure vault of the Divine Dragon Clan doesn’t seem to open, and neither does the Phoenix clan.”<br/><br/>Prime Minister Gui frowned slightly. He took out the universe AI and sent a message, setting up a devil spirit altar.<br/><br/>Their message was transmitted through an lie!<br/><br/>However, this time, he summoned an lie over.<br/><br/>Very quickly, an lie arrived and quickly left!<br/><br/>Not long after, an Lie’s figure appeared at the Starry Universe Windstorm Continent.<br/><br/>“Dragon King, this is the resource that Prime Minister Gui asked me to send over. In addition, they have already arrived at the Divine Dragon Island. Currently, many of the resources on the Divine Dragon Island have been consumed. The only thing that is of great use is the dragon baptism pool. Also, the treasure vault of the Divine Dragon Clan has never been opened. Prime Minister Gui and the rest have tried some methods but have not been able to open it.”<br/><br/>An lie reported to him.<br/><br/>“Oh?”<br/><br/>Wang Xian raised his eyebrows and smiled. “Alright, get Prime Minister Gui to transfer the Dragon Palace over and take over the Divine Dragon Island.”<br/><br/>Take over the Divine Dragon Island and return the Divine Dragon clan to their rightful place.<br/><br/>In the future, they would change their name to the Dragon Palace!<br/><br/>As for the treasure vault of the Divine Dragon Clan on the Divine Dragon Island, he would let Prime Minister Gui and the others try to open it first.<br/><br/>He wasn’t planning to return to the nine-origin universe when his strength didn’t allow him to think that he could avoid the peak of the ruler realm.<br/><br/>This was also to prevent accidents from happening.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded.<br/><br/>“In addition, let the disciples of the Dragon Palace step into the starry universe. Let the water-elemental disciples of the Dragon Palace continue to cultivate in the fiery heart treasured land.”<br/><br/>He continued to instruct.<br/><br/>An lie answered from the side and left immediately!<br/><br/>Wang Xian watched him leave. He took a look at the storage space in his hands and revealed an excited look.<br/><br/>Resources, a large amount of resources.<br/><br/>These resources were sufficient to raise his strength to the level of a ruler at level four. In other words, he could be comparable to a ruler at level nine.<br/><br/>In addition, the metal inside was also sufficient to raise the Tai Chi Dragon Disc and the five elements millstone to the level of a ruler at level nine.<br/><br/>He was definitely a very terrifying existence.<br/><br/>“I will not raise my strength for now. I will raise the Five Elements Millstone and the Tai Chi Dragon Disc first.”<br/><br/>Wang Xian looked at these resources and pondered.<br/><br/>He could not increase his strength.<br/><br/>Once his strength was too strong, it would attract the attention of the starry universe and the powerful Space Beasts. Those space beasts would come and hunt him down.<br/><br/>To him, this was actually a bad thing.<br/><br/>Therefore, Wang Xian could not increase his strength for now.<br/><br/>Once he increased his strength, the starry universe would not be able to accommodate him.<br/><br/>He had to return to the nine-origin universe.<br/><br/>Currently, the nine-origin universe was even more dangerous.<br/><br/>“If the Tai Chi Dragon Disc and the five elements millstone can increase my strength, it would be equivalent to an increase in my own strength. By then, with the help of the Five Elements Millstone and the Tai Chi Dragon Disc, it would be equally terrifying!”<br/><br/>Wang Xian revealed a smile as he scanned his surroundings.<br/><br/>Xiao Lan and the rest were still improving. He took out the metal and placed it on the Tai Chi Dragon Disc and the Five Elements Millstone.<br/><br/>If Wang Xian wanted to help them improve, their speed would be much slower.<br/><br/>After all, their strength was on the same level as the Tai Chi Dragon Plate and the five elements Millstone!<br/><br/>Time passed day by day.<br/><br/>After the battle between Wang Xian and the Phoenix clan of the Angel clan had ended and both parties had temporarily reconciled, the strong disciples in the nine-origin universe had temporarily calmed down.<br/><br/>The group of strong disciples focused on exploring the starry universe once again.<br/><br/>As time passed, more and more strong people obtained resources and achieved breakthroughs.<br/><br/>More and more strong people of the high-level races transformed and reached the level of a ruler.<br/><br/>This was a great opportunity.<br/><br/>However, what they didn’t know was that at the end of the starry universe opposite them, there were also a large number of unfamiliar creatures exploring the starry universe.<br/><br/>Sooner or later, they would meet!\t\t\t\t\t\t</div>", "images": {}, "success": true}