{"id": 822, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073545.html", "title": "Chapter 3819 - 3819 The 3818 Cursed Dragon Killed The Level Seven Space Behemoth! Go", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3819 - 3819 The 3818 Cursed Dragon Killed The Level Seven Space Behemoth! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3819 The 3818 cursed dragon killed the level seven space behemoth! Go<br/><br/>Boom! Boom! Boom<br/><br/>The Space Behemoth, which was the ruler of a level six space behemoth, erupted with a terrifying energy when it devoured all the space behemoths of the same race as well as the meatball!<br/><br/>This energy rose rapidly, causing Wang Xian and the rest to look fearful.<br/><br/>Lan qingyue held a grayish chain in one hand. The chain wound around the grayish long spear and attacked the space behemoth directly.<br/><br/>However, just as she was about to reach the space beast, a blood ball formed into a shield!<br/><br/>Buzz<br/><br/>The spear landed on it and was slowly devoured by it.<br/><br/>“Not good, Xiao Xian. This space beast is undergoing a transformation. It seems to be about to break through!”<br/><br/>Seeing this scene, Lan Qingyue felt its terrifying power. Her expression changed drastically as she exclaimed!<br/><br/>At this moment, Wang Xian’s expression also changed!<br/><br/>In the universe, a level seven cosmic beast was comparable to the nine-origin universe. It was an existence at the peak of the universe’s ruler.<br/><br/>Wang Xian was very strong with the help of the Five Elements Millstone and the Tai Chi Dragon Disk.<br/><br/>Lan Qingyue and the rest were also very strong.<br/><br/>However, even if they joined forces, they were still not a match for a level seven cosmic beast.<br/><br/>Especially after this space beast had improved, its strength and attack power were extremely strange!<br/><br/>“Retreat!”<br/><br/>Wang Xian made a prompt decision and shouted at LAN Qingyue immediately!<br/><br/>Without any hesitation, they immediately flew backward.<br/><br/>The upgraded Space Beast was able to kill Wang Xian and the rest one by one!<br/><br/>“Roar! Roar! Roar!”<br/><br/>At this moment, an incomparably violent roar was emitted from the Space Beast’s mouth!<br/><br/>At the lower position, the substance that looked like flesh and blood actually started to move.<br/><br/>One after another, claws attacked Wang Xian and the rest.<br/><br/>“Tai Chi Dragon Plate!”<br/><br/>“Five elements grinding!”<br/><br/>“Defend!”<br/><br/>Wang Xian immediately unleashed all his defenses!<br/><br/>“Wu Wu Wu!”<br/><br/>“Wu Wu Wu!”<br/><br/>Xiao Bai and the rest let out a wild roar and opened their mouths.<br/><br/>At this moment, Xiao Bai’s body suddenly shrunk a lot.<br/><br/>Little House swallowed its body into his mouth.<br/><br/>Lan Qingyue’s body moved and came into Little White’s mouth.<br/><br/>This scene was like a big kun calling out to Little Kun.<br/><br/>Lan Qingyue was in the center.<br/><br/>Ultimate Defense!<br/><br/>This kind of defense was the most powerful defense of the ancient god Feeding Kun Lord!<br/><br/>Overlapping, defense!<br/><br/>“Little Xian, come to me!”<br/><br/>Lan qingyue shouted!<br/><br/>Wang Xian moved and flew over immediately.<br/><br/>Boom! Boom! Boom<br/><br/>In the next second, the claws collided with the five elements grinding tai chi dragon plate and the defense of LAN Qingyue and the rest.<br/><br/>An impact force was transmitted, and their bodies flew forward instantly.<br/><br/>“Escape immediately!”<br/><br/>Wang Xian ordered!<br/><br/>Without any hesitation, the small house fled into the distance quickly!<br/><br/>Lan qingyue waved her arm and waves of energy surged into the small house’s body to strengthen it.<br/><br/>“I really didn’t expect this space beast to be able to complete such a terrifying transformation, devouring and becoming stronger!”<br/><br/>Wang Xian looked behind him and his expression turned ugly!<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Roar! Roar!”<br/><br/>Seeing that his first round of attack was blocked, the Space Beast’s eyes were bloodshot as he stared at Wang Xian and the rest. He quickly chased after them!<br/><br/>“This won’t do. This fellow’s speed is very fast!”<br/><br/>Wang Xian looked behind him. His expression darkened as he spoke.<br/><br/>The Space Beast was comparable to the pinnacle level of the nine-origin universe. Under such circumstances, even the strongest experts from the various peak races could only fight against it!<br/><br/>Unless they used their trump cards, they would be able to kill it.<br/><br/>Such an existence was not something Wang Xian and the rest could fight against!<br/><br/>Of course, if Wang Xian absorbed all the resources to improve himself, he could still fight against it with his many trump cards.<br/><br/>However, he had no way to fight back now.<br/><br/>Without the speed of the incipient saint wings, he had no way to fight back!<br/><br/>“Roar!”<br/><br/>At this moment, the space beast suddenly opened its mouth and spat out a space beast phantom that was exactly the same as it.<br/><br/>The Shadow of the space beast emitted a terrifying energy aura.<br/><br/>Wang Xian and the rest were in front of them. When they felt this energy, their expressions froze!<br/><br/>The five elements grinding and the tai chi dragon disc had unleashed their defense to the maximum!<br/><br/>The bodies of Xiao Zhai, Xiao Bai, and Lan qingyue emitted a grayish energy.<br/><br/>Boom<br/><br/>A terrifying vibration was transmitted over. Wang Xian could instantly sense that the tai chi dragon disc had collapsed!<br/><br/>He couldn’t even use the backlash!<br/><br/>“Oh no!”<br/><br/>His expression changed slightly!<br/><br/>Fortunately, although the Taiji Dragon Plate had collapsed, they managed to withstand this attack.<br/><br/>But what about the next attack?<br/><br/>“Xiao Xian, this space beast is catching up. He’s very fast!”<br/><br/>Lan Qingyue said anxiously.<br/><br/>“Hang in there and see if we can get rid of this guy!”<br/><br/>Wang Xian gritted his teeth. For such a powerful existence to be born in this precious land, it must be extraordinary!<br/><br/>Wang Xian had to get his hands on it.<br/><br/>He took out his communication stone plate and immediately contacted an lie, sending him a message!<br/><br/>An lie immediately replied when he received the message!<br/><br/>Wang Xian quickly set up a demonic altar in front of him!<br/><br/>“Eh? Xiao Xian, what are you doing?”<br/><br/>Lan Qingyue looked at him with her eyes gleaming.<br/><br/>“It’s not very effective against the intelligent angels and Phoenixes. However, our Dragon Palace has a great weapon against the space beasts without intelligence!”<br/><br/>Wang Xian growled in a low voice!<br/><br/>Buzz! Buzz! Buzz<br/><br/>As soon as he finished his sentence, an Lie’s figure appeared in front of him.<br/><br/>Other than an intense, there were also many black figures.<br/><br/>The aura of each black figure wasn’t very strong, but it was very strange.<br/><br/>This was the cursed dragon!<br/><br/>The cursed dragon that had turned into a curse!<br/><br/>The cursed dragon had many strengths, and its attacking methods were also very weak.<br/><br/>There was no strength that could surpass one’s cultivation level.<br/><br/>At the peak of the venerable realm, in terms of combat strength, it was definitely the weakest!<br/><br/>However, the strength of the cursed dragon didn’t lie in its own combat power, but in the cursed power that was killed!<br/><br/>The cursed creature was an existence that even a ruler realm expert didn’t want to provoke.<br/><br/>The backlash of the cursed creature was enough to kill an ordinary ruler realm expert!<br/><br/>Although the space beast in front of them was comparable to a peak 9-origin universe ruler, the cursed dragon of the Dragon Palace wasn’t something an ordinary cursed creature could compare to.<br/><br/>Their curses were even more terrifying and powerful.<br/><br/>This was the only great killing weapon in the Dragon Palace.<br/><br/>Of course, this great killing weapon was slightly more useless!<br/><br/>This was because all the powerhouses in the nine-origin universe could sense the cursed power of the cursed dragon.<br/><br/>They would not be stupid enough to kill the cursed dragon. They would transfer it to.<br/><br/>This was also the reason why Wang Xian did not order it to deal with the angel and Phoenix clans.<br/><br/>That was because it was not very useful!<br/><br/>However, it could be used to deal with the space behemoths in the starry universe!<br/><br/>Tens of thousands of cursed dragons appeared in front of Wang Xian and the rest, flapping their wings!<br/><br/>They were waiting for the order!\t\t\t\t\t\t</div>", "images": {}, "success": true}