{"id": 829, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073558.html", "title": "Chapter 3831 - 3831 3830 Killed Again!", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3831 - 3831 3830 Killed Again!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3831 3830 killed again!<br/><br/>Heavenly Palace, one of the 24 palaces in the belief universe.<br/><br/>Heavenly Palace was one of the top three existences in the 24 palaces. There were a large number of gods in the palace.<br/><br/>In the belief universe, the powerful gods could sense the death of a god they believed in.<br/><br/>They could get the news from the believers of the dead gods.<br/><br/>Once they died, the believers of the gods of death would lose their sense of the gods, and they would be able to sense that the gods they believed in had died.<br/><br/>In the Heavenly Palace, more than ten rank seven gods, more than 4,000 gods, and tens of thousands of elite disciples had died after breaking through. The expression of this expert from the Heavenly Palace changed greatly!<br/><br/>The death of so many gods was a huge loss for the heavenly palace.<br/><br/>“What’s Wrong?”<br/><br/>At the side, an old woman looked at the middle-aged man. She noticed his change and asked in surprise.<br/><br/>“Tens of thousands of our gods and disciples have all died in a short period of time. More than 4,000 of our gods have died, and more than a dozen of our Tier-7 gods have died.”<br/><br/>The middle-aged man said with a gloomy face.<br/><br/>“What? How did so many of them suddenly die? Could it be that they were killed in a battle with the nine-origin Universe?”<br/><br/>The old woman’s expression changed slightly, and she quickly asked.<br/><br/>“No, they didn’t go to kill the gods and disciples of the nine-origin universe. They should be at the black scripture treasured land. All the gods and disciples there should have been killed in a short period of time. They might have encountered a level six space beast, or they might have been level seven or even level eight!”<br/><br/>The middle-aged man said, and with a wave of his arm, a special communication device appeared.<br/><br/>“Among them, there are a few who have life-saving treasures. I’ll ask around!”<br/><br/>The middle-aged man sent a message.<br/><br/>After waiting for more than ten minutes, a message arrived.<br/><br/>“The Black Codex Treasured Land has been attacked, and they haven’t found any enemies. It should be a powerful space beast.”<br/><br/>The middle-aged man looked at the message and said with a gloomy face!<br/><br/>This caused the old woman to frown slightly. “Send someone over to investigate. Let’s see what kind of space beast it is.”<br/><br/>“Yes, the location of the Black Codex Treasure Land isn’t too close to the center of the nine-origin universe. We need to send experts over to investigate the specific situation.”<br/><br/>The middle-aged man nodded. “In addition, inform the gods of the other palaces about this news. Let them make some preparations.”<br/><br/>As he spoke, his gaze swept the surroundings. He continued, “Also, let them send some experts over to investigate.”<br/><br/>“That’s right. This time, when we entered the starry universe, our 24 palaces made an agreement. For such a thing to happen, we indeed need them to conduct some investigations.”<br/><br/>The old woman nodded.<br/><br/>…<br/><br/>“More than a dozen tier 7 gods from the heavenly palace were silently annihilated. Even the gods who survived with their life-saving treasures didn’t know how they died. This time, we have to be careful. If that space beast is still there, let’s test it out and leave immediately!”<br/><br/>A year later, more than 20 figures flew over from the area in front of the Black Scripture treasured land, which was called by the belief universe.<br/><br/>They were fighting on a ship that was emitting a luster, and they were staring ahead vigilantly.<br/><br/>More than 20 seventh-level gods with powerful treasures were prepared to come over and check it out to make a response.<br/><br/>After all, such a powerful space beast was moving around in this area, which posed a huge threat to the disciples of the belief universe.<br/><br/>They had to deal with it!<br/><br/>They had to investigate it thoroughly and prepare for a response.<br/><br/>“It’s right in front. Let’s Go!”<br/><br/>The voice continued to ring out. On the flying boat, more than twenty figures were staring at the black scripture treasured land.<br/><br/>Wang Xian was moving forward carefully. His gaze was constantly scanning the place!<br/><br/>He slowly approached the black scripture treasured land.<br/><br/>“Eh?”<br/><br/>At the same time, Wang Xian, who was hiding in the space above the black scripture treasured land, sensed that the gods of faith were rushing over. His eyes were sparkling.<br/><br/>He looked over and saw a boat flying over.<br/><br/>On the boat, there were 23 level seven gods.<br/><br/>“There are so many experts in this universe of faith. To send 23 level seven gods to investigate at once, how impressive!”<br/><br/>Wang Xian sized up the boat and sighed in his heart.<br/><br/>His gaze landed on the boat. He could feel an extremely powerful defensive force from it.<br/><br/>This was a boat formed from the terrifying power of faith.<br/><br/>It had a powerful defense!<br/><br/>The boat flew towards the black scripture treasure land and soon arrived not far from Wang Xian.<br/><br/>They did not notice Wang Xian who was hiding here.<br/><br/>Wang Xian smiled when he saw them coming over!<br/><br/>This time, he was still not prepared to show himself. Waves of dark and light forces were spreading towards them.<br/><br/>“Eh? Did you guys sense that there seems to be a huge wave of terror enveloping us?”<br/><br/>Suddenly, on the boat, the eyes of one of the faith gods focused as he spoke!<br/><br/>“There is indeed a heart-palpitating feeling. To be able to cause us to feel such a heart-palpitating feeling, it must be a sixth or even seventh level ruler Realm Astral Beast. Damn it, that Astral Beast didn’t leave!”<br/><br/>A Level 7 god of faith nodded and stared in the direction of the Black Codex. His eyes were filled with vigilance and solemnity.<br/><br/>This terrifying power was definitely a powerful space beast.<br/><br/>“Roar Roar Roar!”<br/><br/>At this moment, a roar sounded. They felt that the space around them had undergone a huge change.<br/><br/>Terrifying Light and darkness instantly covered them!<br/><br/>“Not good, that Space Beast’s strength is extremely terrifying. Run!”<br/><br/>One of the belief gods hurriedly shouted.<br/><br/>The ship beneath them released a belief defense!<br/><br/>The defense completely enveloped them.<br/><br/>“Ka Ka Ka!”<br/><br/>“Not good!”<br/><br/>“It’s over!”<br/><br/>However, this defense didn’t even last a second. It instantly collapsed, and an unrivalled pressure enveloped them.<br/><br/>The faces of the twenty-three level seven pantheon gods were filled with astonishment.<br/><br/>A few level seven pantheon gods released a pillar of light of faith from their bodies and disappeared instantly!<br/><br/>However, the remaining nineteen pantheon gods could only feel the terrifying arrival in astonishment!<br/><br/>“PFFT! PFFT! PFFT!”<br/><br/>The terrifying pressure and energy caused them to die instantly!<br/><br/>There was no room for them to struggle!<br/><br/>The Gap was too big!<br/><br/>Wang Xian smiled when he saw this scene.<br/><br/>No matter how powerful they were or how powerful the treasures they possessed, they could at most fight against a level five Cosmic Beast, which was only at level eight.<br/><br/>If they were a little stronger, they could fight against four to five level eight existences.<br/><br/>However, Wang Xian’s tai chi dragon plate could easily kill a level nine cosmic beast.<br/><br/>They didn’t have the ability to resist at all.<br/><br/>Nor did they have the ability to resist.<br/><br/>This time, they were killed instantly before they could see what was attacking them.<br/><br/>“I reckon they will be more obedient after this. Perhaps they will treat this place as a forbidden area!”<br/><br/>Wang Xian kept the corpse and smiled.\t\t\t\t\t\t</div>", "images": {}, "success": true}