{"id": 824, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073549.html", "title": "Chapter 3821 - 3821 3820 Special Energy And The Black Resurrection Lily!", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3821 - 3821 3820 Special Energy And The Black Resurrection Lily!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3821 3820 special energy and the Black Resurrection Lily!<br/><br/>In the past, most of the places that other peak races could occupy were occupied by type 5 space beasts.<br/><br/>Furthermore, there were at most two or three Type 5 space beasts!<br/><br/>And this was the place where a Type 6 race or even a Type 7 space beast was born.<br/><br/>This was a world of difference!<br/><br/>The difference was huge!<br/><br/>All universes had an iron law. Only powerful treasure lands could give birth to experts. If it wasn’t for special circumstances, powerful treasure lands would be occupied by experts.<br/><br/>Take the fiery heart treasure land as an example. It was a treasure land.<br/><br/>The center was occupied by various space races.<br/><br/>The strongest race had an existence at the level of a ruler at level eight.<br/><br/>Such a powerful existence, coupled with the suppression of the starry universe, was not something that a great being from the 9-origin universe could occupy.<br/><br/>Another example was the storm continent, which was also occupied by a powerful pinnacle race.<br/><br/>Their power was also not something that the 9-origin universe could occupy!<br/><br/>Of course, there was also a possibility that there was a special situation. It was because the space beasts did not like this treasured land, so it was not occupied.<br/><br/>The possibility was too low, especially for a powerful treasured land!<br/><br/>Wang Xian and the rest flew forward and landed on the special material!<br/><br/>Stepping on this material, it was soft. It was like an incomparably huge piece of flesh.<br/><br/>Wang Xian reached out his hand and dug into it. However, the terrifying hardness was completely out of his expectations.<br/><br/>“What’s going on? I can’t even damage it?”<br/><br/>Wang Xian’s face was filled with astonishment.<br/><br/>“It’s indeed very tough. Even a space beast that’s in the eighth or ninth level would find it difficult to destroy it, right?”<br/><br/>Lan Qingyue waved her arm and a grayish long spear pierced downwards.<br/><br/>However, it did not destroy it at all!<br/><br/>Wang Xian frowned slightly. “There seems to be the power of darkness in here. There is also a special life force. The fusion of darkness and life force?”<br/><br/>He placed his palm on it and tried to absorb it!<br/><br/>However, he could not absorb this energy!<br/><br/>“I can’t absorb it?”<br/><br/>Wang Xian was a little surprised. He moved his body and immediately floated in the air, scanning the area.<br/><br/>“Eh?”<br/><br/>At this moment, he noticed a huge pit in front of him.<br/><br/>This pit had a special meatball growing out of it.<br/><br/>This meatball was swallowed by the Interstellar Beast!<br/><br/>It was also because of this meatball that the interstellar beast had completely elevated to the level of a ruler at level seven.<br/><br/>Otherwise, he wouldn’t be able to elevate himself by fusing with the other space beasts.<br/><br/>Wang Xian flew to the location of this huge pit. A dense and strange energy was surging over.<br/><br/>This energy was somewhat intoxicating, but it also made him alert.<br/><br/>He had a premonition that if he were to directly absorb this energy, it would probably be dangerous for him.<br/><br/>It was an energy that was filled with temptation but also contained vitality!<br/><br/>He waved his arm and dug out a piece of flesh from the inside.<br/><br/>It was like flesh and blood.<br/><br/>“This energy is so strange!”<br/><br/>Lan qingyue sized it up with a curious look on her face. “Xiao Xian, what do you think this energy is for? was the space beast swallowing a special divine herb?”<br/><br/>“Divine herb? It’s possible.”<br/><br/>When Wang Xian heard this, he raised his eyebrows slightly.<br/><br/>He hesitated for a moment. With a move of his palm, a wisp of ancestral tree extended out.<br/><br/>However, after the ancestral tree extended out, it was obvious that it was not interested in the piece of flesh in its hand.<br/><br/>When Wang Xian saw it, he frowned again.<br/><br/>Occupying this place, it couldn’t be that it was useless to the Dragon Palace, right!<br/><br/>Buzz<br/><br/>However, at this moment, a scene that surprised Wang Xian appeared.<br/><br/>On the branch of the ancestral tree, a flower appeared.<br/><br/>When Wang Xian saw this flower, his eyes lit up instantly.<br/><br/>“Black Resurrection Lily!”<br/><br/>That’s right, black resurrection Lily!<br/><br/>This was a treasure that Wang Xian obtained when he destroyed a race.<br/><br/>A dead black resurrection Lily!<br/><br/>Later on, due to the ancestral tree, it was resurrected proudly!<br/><br/>After being resurrected, the black resurrection Lily grew. Now, there were hundreds of black resurrection Lily in the Dragon Palace!<br/><br/>These black resurrection Lily were all used by the charming dragon clan.<br/><br/>The Charming Dragon clan was a very rare dragon species in the Dragon Palace.<br/><br/>Back then, the Dragon Palace obtained the corpse of an ancestral witch, and with this corpse, they gave birth to a charming dragon species.<br/><br/>Both of them were peak dragon seeds, replacing the Dolphins from before.<br/><br/>However, due to the limited energy of that ancestral witch’s corpse, it could only give birth to 1,000 charming dragons.<br/><br/>There was no doubt about the strength of the charming dragons. Coupled with the black resurrection Lily, they were very powerful.<br/><br/>Now that Wang Xian thought about it, that ancestral witch’s corpse must be extraordinary!<br/><br/>Wang Xian even suspected that the ancestral witch’s corpse, which could give birth to a peak dragon seed, must be an existence that was comparable to the 12 ancestral witches of the voodoo race.<br/><br/>Of course, this was just a guess!<br/><br/>As for the Resurrection Lily, the angel race possessed the resurrection Lily. They possessed the radiant resurrection Lily!<br/><br/>This was the ultimate treasure of the angel race. Very few people possessed this treasure.<br/><br/>Wang Xian had never seen it before, and neither had the third prince used it before.<br/><br/>Clearly, this treasure could only be used under special circumstances or for special powerhouses.<br/><br/>However, after Wang Xian obtained the black resurrection Lily, although it was resurrected, it grew very slowly.<br/><br/>The Black Resurrection Lily that the Dragon Palace had now was only at the peak of the venerable realm!<br/><br/>This might have something to do with the level of the ancestral tree.<br/><br/>After all, the ancestral tree had yet to recover to the level of the Heaven’s fate.<br/><br/>It was still unable to evolve the divine tree on its branches.<br/><br/>This was especially so for a special treasure like the Black Resurrection Lily.<br/><br/>The black resurrection Lily poked out from the ancestral tree and immediately took root on this piece of flesh.<br/><br/>Very soon, the flesh and blood were quickly absorbed by the Black Resurrection Lily.<br/><br/>The entire black resurrection Lily looked like it was emitting a beautiful black glow!<br/><br/>It was filled with a strange attraction!<br/><br/>Wang Xian’s eyes sparkled. With a move of his body, he immediately arrived at the location of the deep pit.<br/><br/>This pit was originally the place where the unique flesh and blood plant grew.<br/><br/>He placed the black resurrection Lily in it.<br/><br/>Buzz<br/><br/>In an instant, the entire black resurrection Lily started to sway. It seemed to be extremely excited.<br/><br/>Waves of energy surged towards it.<br/><br/>The blood-red energy also surged into it!<br/><br/>Wang Xian raised his eyebrows.<br/><br/>“The energy in this pit has actually greatly enhanced the black resurrection Lily. Does that mean that it can also enhance the charming dragon seed?”<br/><br/>Wang Xian mumbled.<br/><br/>As the demonic dragon seed was born from the ancestral witch’s corpse, the energy in their bodies was also very strange.<br/><br/>Although it was said to be of the darkness attribute, there were some differences!<br/><br/>All in all, it was a little strange. It was very compatible with the Black Resurrection Lily!<br/><br/>Since the black resurrection Lily could absorb energy here, the demonic dragon seed should be able to do the same!\t\t\t\t\t\t</div>", "images": {}, "success": true}