{"id": 828, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073556.html", "title": "Chapter 3830 - 3830 3829 Killed Those Who Believed In The Gods", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3830 - 3830 3829 Killed Those Who Believed In The Gods</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3830 3829 killed those who believed in the gods<br/><br/>“This harvest is simply too great!”<br/><br/>Wang Xian looked at all his gains and revealed an excited look in his eyes!<br/><br/>The corpses of tens of thousands of believers and disciples of the universe.<br/><br/>Although there were only about 4,000 believers of the gods and most of them were believers of the gods and below, this was also a very terrifying resource for the Dragon Palace.<br/><br/>Consuming large amounts of those low-level faith hearts would also have a huge effect!<br/><br/>With so many faith hearts, the improvement speed of the disciples of the Dragon Palace could be increased by a hundred times!<br/><br/>“This time, so many pantheon and disciples in the belief universe have been hunted down. They should have already received the news!”<br/><br/>Wang Xian stood in the sky above this treasured land with a smile on his face!<br/><br/>He was not prepared to leave immediately.<br/><br/>With so many gods of belief being killed, the belief universe would definitely send experts of the gods to investigate.<br/><br/>At that time, as long as Wang Xian waited here, he would be able to kill some gods of belief again.<br/><br/>Apart from that, Wang Xian was prepared to study this treasured land.<br/><br/>Every treasured land had its own uniqueness!<br/><br/>The effects of this land of treasures were indeed very great. Even for the disciples of the Dragon Palace, it was of great use.<br/><br/>In addition, he was curious about the black liquid in the lake!<br/><br/>This liquid was very special.<br/><br/>It was like a special mineral metal, a special substance.<br/><br/>For some reason, it turned into a liquid!<br/><br/>This liquid seemed to be of the same energy as the entire land of treasures.<br/><br/>However, even with Wang Xian’s strength, he could not break through this land of treasures!<br/><br/>Wang Xian landed in a lake and entered it.<br/><br/>He quietly sensed the energy inside.<br/><br/>“It’s very special. It can change the physical body and increase the strength of the physical body.”<br/><br/>Wang Xian sat cross-legged inside for a few days and slowly opened his eyes.<br/><br/>He took out his communication stone plate and sent a message to an lie.<br/><br/>Buzz<br/><br/>A few minutes later, an Lie’s figure appeared in the demonic altar in front of Wang Xian. At the same time, there was another figure beside him.<br/><br/>Ao crab!<br/><br/>Dragon of devouring!<br/><br/>The elevation of the Dragon of devouring was somewhat special. It had completely inherited the characteristics of the bug race. Only by devouring a large number of resources, treasures, and divine kingdoms could it be elevated.<br/><br/>If it were to devour metals, it could also upgrade the devouring dragon.<br/><br/>However, all the metals obtained from the storm continent were used by Wang Xian himself.<br/><br/>This also resulted in the devouring dragon being very weak.<br/><br/>It was the weakest existence in the Dragon Palace!<br/><br/>This was because their elevation was different from the rest of the disciples in the Dragon Palace.<br/><br/>If they wanted to break through, they needed to devour the divine kingdom of the ruler level.<br/><br/>Of course, if they had the resources that were comparable to the divine kingdom of the ruler level, they would be able to do so as well.<br/><br/>The Devouring Dragon was mainly of the darkness and earth attributes, followed by the power of the physical body!<br/><br/>The bug race relied on their own power, corrosive power, and the power of the Earth attribute.<br/><br/>Wang Xian could feel that this special treasure land should be useful to the devouring dragon.<br/><br/>“Greetings, Dragon King!”<br/><br/>Ao he bowed respectfully to Wang Xian.<br/><br/>“Ao he, come and see if you can absorb the energy here.”<br/><br/>Wang Xian instructed ao he.<br/><br/>Ao he inherited the bug race. As long as the bug race had energy, they could devour it.<br/><br/>The powerful energy should be able to improve them.<br/><br/>“It’s the Dragon King!”<br/><br/>Ao crab nodded and swayed his huge body. The scales on his body opened up and waves of black energy surged into his body!<br/><br/>Feeling this energy, ao crab’s eyes shone.<br/><br/>“Dragon King, the level of this energy is very high. We, the devouring dragon, can indeed absorb it. Furthermore, I can feel my strength and body increasing rapidly. I can replace the ruler of the Divine Kingdom!”<br/><br/>Ao crab said excitedly!<br/><br/>At this moment, the improvement of the Devouring Dragon had stagnated for a very, very long time!<br/><br/>“Does this mean that you can achieve a rapid breakthrough by absorbing this energy?”<br/><br/>Wang Xian stared at him and asked.<br/><br/>“Yes, Dragon King. Our Devouring Dragon has achieved a breakthrough to the ruler level. If we want to improve, we have to look at the level of the devouring materials and the divine kingdom. For example, when we reach the first stage of the ruler level, if we want to break through to the second stage, we have to have the materials or the divine kingdom to allow us to break through. We have to absorb items that are stronger than us and forcefully change the energy in our bodies to complete the breakthrough!”<br/><br/>“We don’t have the shackles to break through, but we need materials or divine kingdoms that are of a higher level than us.”<br/><br/>Ao crab said!<br/><br/>This method of breaking through sounded simple, but it was actually very difficult.<br/><br/>For example, how could one obtain a divine kingdom at the ruler realm level 2 by relying on oneself?<br/><br/>Especially, there was a very important point.<br/><br/>That was, the devouring dragon could only fight two levels above them.<br/><br/>In other words, their strength at the ruler realm level 2 was only comparable to the ruler realm level 1.<br/><br/>This was very awkward.<br/><br/>Breaking through required one to obtain a divine kingdom and materials at Level 1, but their combat strength was one level weaker than those at the same realm.<br/><br/>There was only one way for a ruler Realm Level 1 devouring dragon to kill a ruler realm level 2 expert and obtain a divine kingdom.<br/><br/>That was to have thousands of devouring dragons at the same realm as him.<br/><br/>To win with numbers, Hunt high-level ones, and complete the breakthrough!<br/><br/>Of course, the characteristics of the insect race also made the number of devouring dragons terrifying!<br/><br/>If ao crab was willing, he could even give birth to billions or billions of devouring dragons.<br/><br/>But without energy, it would be much weaker!<br/><br/>“Then, how much can the energy here increase your strength?”<br/><br/>Wang Xian looked at him and asked.<br/><br/>Ao crab shook his head. “Dragon King, my strength is relatively weak. I don’t know either!”<br/><br/>“Then, you and your subordinates can increase your strength here first. I will guard this place for you guys.”<br/><br/>Wang Xian nodded and said to him.<br/><br/>However, according to Wang Xian’s guess, since this place could allow level seven gods to cultivate in it, the energy contained in this treasure land was at least at the level of a ruler at level eight.<br/><br/>Perhaps it could allow the devouring dragons of the Dragon Palace to achieve a huge improvement.<br/><br/>After all, the improvement of the devouring dragons was not restricted. As long as there was energy, their speed of improvement would be terrifying!<br/><br/>Buzz! Buzz! Buzz<br/><br/>At this moment, ao crab’s body trembled. Two million devouring dragons emerged from his body.<br/><br/>An army of Devouring Dragons was lying in the lake and absorbing the energy rapidly.<br/><br/>Wang Xian saw that his eyes were glowing.<br/><br/>His body moved and he flew towards the sky, hiding in the sky above this treasured land.<br/><br/>The concealment of the light and darkness forces made him feel as if he was in another dimension!<br/><br/>Wang Xian was waiting quietly here, the Guardian.<br/><br/>“HMM? How could so many gods and believers of our Heavenly Imperial Palace die instantly?”<br/><br/>At the same time, at the right of the passage to the belief universe, a group of gods were floating in the air.<br/><br/>A middle-aged man suddenly opened his eyes and his expression changed slightly.\t\t\t\t\t\t</div>", "images": {}, "success": true}