{"id": 827, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073554.html", "title": "Chapter 3829 - 3829 3828 Hunted And Killed The Gods", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3829 - 3829 3828 Hunted And Killed The Gods</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3829 3828 hunted and killed the gods<br/><br/>The strong pressure was extremely stimulating to the physical body. Once he adapted to the pressure here, he would be able to travel at a much faster speed to other places.<br/><br/>Wang Xian was flying above this area as he scanned his surroundings.<br/><br/>“HMM?”<br/><br/>At this moment, he saw a puddle in front of him.<br/><br/>The water in the puddle was black and emitted a special energy.<br/><br/>There were hundreds of disciples from the belief universe in the black puddle. Their strength was comparable to that of a venerable.<br/><br/>They sat cross-legged in the puddle and waves of energy surged into their bodies.<br/><br/>Wang Xian flew over. The disciples from the belief universe did not sense his arrival at all!<br/><br/>When he entered the puddle, he could sense that the black water contained a powerful energy.<br/><br/>This energy could greatly enhance his physical body.<br/><br/>After sensing it for a while, his eyes flickered slightly.<br/><br/>The enhancement of his physical body here was indeed very strong.<br/><br/>The disciples of the Dragon Palace could also receive a huge improvement when they cultivated here.<br/><br/>In addition, he felt that the black water was emitting the same energy as the entire area.<br/><br/>It was as if the black water was the same substance as the stars!<br/><br/>It was just that the black water had turned into a liquid and could be absorbed!<br/><br/>Wang Xian probed around. With a wave of his arm, he killed the disciples who believed in the gods in the puddle.<br/><br/>Following that, his body moved and he immediately flew forward.<br/><br/>At the position in front of him, he could sense the aura of a large number of gods who believed in the universe.<br/><br/>Soon, he arrived in front of an even bigger puddle. There were more than a thousand gods and disciples who believed in the universe in this puddle.<br/><br/>This time, Wang Xian flew over. With a wave of his arm, the power of Light and darkness enveloped the puddle and silently destroyed it all.<br/><br/>At this point, they didn’t even know how they died!<br/><br/>After destroying it, Wang Xian continued flying forward. Every time he encountered a puddle, he could see thousands of gods and disciples who believed in the universe cultivating inside.<br/><br/>Wang Xian flew over and silently destroyed them all!<br/><br/>In addition, Wang Xian performed soul capture twice and obtained all the information about this place from them.<br/><br/>In the middle of this land of treasures, there was a huge puddle.<br/><br/>It couldn’t be called a puddle, it should be called a lake!<br/><br/>In the lake, there were 3,000 gods who believed in the universe and 15 level seven gods!<br/><br/>When Wang Xian saw that most of the gods who believed in the universe were cultivating, his eyes sparkled with excitement!<br/><br/>The energy of these gods who believed in the universe was in the heart of faith.<br/><br/>In other words, destroying them wouldn’t be able to turn them into dragon blood.<br/><br/>However, their faith could greatly increase and shorten the breakthroughs of the disciples of the Dragon Palace.<br/><br/>With enough resources and faith in the Dragon Palace, the speed of the ruler-level experts of the Dragon Palace would reach a terrifying level!<br/><br/>Under normal circumstances, it would take tens of millions of years or even hundreds of millions of years for a ruler-level expert to advance from a ruler-level one to a ruler-level one with sufficient resources.<br/><br/>If two or three out of ten peak venerables were able to break through to the ruler-level, then it would be the same for two or three out of ten peak venerables.<br/><br/>If a ruler-level rank 1 was able to advance to the ruler-level rank 2, then it would be the same for two or three out of ten people!<br/><br/>However, there was a huge gap between peak venerables and a ruler-level rank 1!<br/><br/>Other than that, only two or three out of ten people would be able to break through to the ruler-level rank 3!<br/><br/>The probability was so low.<br/><br/>This was also the reason why there were so few top-tier experts.<br/><br/>Sometimes, in order to break through a shackle, a ruler realm expert would need hundreds of millions of years or even billions of years.<br/><br/>However, if one had the heart of faith, it would be different.<br/><br/>If ten rulers at the first stage of the ruler realm absorbed the heart of faith of the same level, then seven or eight of them would be able to break through to the second stage of the ruler realm.<br/><br/>Furthermore, with sufficient resources, this period of time would be even shorter.<br/><br/>If there was no limit to the supply of the heart of faith, it would be able to achieve 100% !<br/><br/>This was the strength of the heart of faith!<br/><br/>The power of faith could help all living beings to break through!<br/><br/>Wang Xian looked at the more than 3,000 believers of the gods in front of him. His eyes were filled with passion!<br/><br/>Between the universe and the universe, many of them were mortal enemies who would not rest until one of them died.<br/><br/>This had nothing to do with right or wrong. It was only about the faction.<br/><br/>When the nine-origin universe and the disciples of the belief universe met, both parties did not hesitate at all.<br/><br/>The belief universe wanted to develop the disciples of the nine-origin universe into their own believers to increase their strength.<br/><br/>The Salvation Universe wanted to kill the belief gods to increase their strength.<br/><br/>In a battle, there was almost no possibility of reconciliation!<br/><br/>Therefore, Wang Xian was not at all uncomfortable with killing the belief universe’s gods!<br/><br/>This was the law of the universe. The strong survived while the weak were ants!<br/><br/>They were even ants who could not think!<br/><br/>Buzz<br/><br/>Just as all the gods who believed in the universe were cultivating, Wang Xian waved his arm. A tai chi pattern on the Tai Chi Dragon disk instantly covered the entire deep pit.<br/><br/>More than ten level seven gods instantly sensed the arrival of a great terror and the threat of death.<br/><br/>However, in the next second, they saw nothing and sensed nothing. They were suppressed by a terrifying energy.<br/><br/>Then, they lost all consciousness.<br/><br/>“Weng Weng Weng!”<br/><br/>“Weng Weng Weng Weng!”<br/><br/>Among them, dozens of rays of light of faith enveloped the bodies of the gods of faith, causing their bodies to slowly disappear.<br/><br/>They used a very special method to escape!<br/><br/>Among them, there were three level seven gods of faith.<br/><br/>When Wang Xian saw this scene, there were no fluctuations.<br/><br/>It was normal for the Gods of faith in the universe to possess a treasure that could save their lives.<br/><br/>In addition, when Wang Xian made his move just now, the Gods of faith in the universe did not sense who was dealing with them.<br/><br/>They didn’t even sense anything.<br/><br/>There was a very high possibility that they would think that it was the Cosmic Beast’s attack on them!<br/><br/>After all, to be able to wipe out more than 3,000 gods in an instant, including more than a dozen level seven gods, it was definitely the strength of level nine or above.<br/><br/>And in the universe, the only one who could possess such strength was the Cosmic Beast.<br/><br/>At this moment, no one knew that Wang Xian possessed such terrifying strength.<br/><br/>No one knew that Lan Qingyue and the rest had already elevated their strength to the level of a ruler at level six.<br/><br/>After killing over 3,000 experts of the all gods in an instant, he waved his arm and collected all the corpses.<br/><br/>Then, he continued to fly forward.<br/><br/>In front of him, there were tens of thousands of disciples of experts who believed in the universe.<br/><br/>There were also hundreds of strong people of the Pantheon level.<br/><br/>Wang Xian relied on the tai chi dragon disc to conceal his figure and fly over, silently exterminating all of them.<br/><br/>He did not erupt with any energy or battle.<br/><br/>He killed them easily!\t\t\t\t\t\t</div>", "images": {}, "success": true}