{"id": 820, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073541.html", "title": "Chapter 3817 - 3817 3816 Muddy Land, Under The Space Beasts", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3817 - 3817 3816 Muddy Land, Under The Space Beasts</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3817 3816 muddy land, under the space beasts<br/><br/>“Alright!”<br/><br/>When Lan Qingyue heard Wang Xian’s words, her eyes lit up.<br/><br/>She stared at the space beasts and waved her arm!<br/><br/>Buzz! Buzz! Buzz<br/><br/>In an instant, waves of grey energy burst out from their bodies.<br/><br/>This grey energy seemed to be corporeal.<br/><br/>In the surroundings, it instantly formed a grey sea.<br/><br/>“Kun rises from the sea!”<br/><br/>Lan Qing Yue shouted softly, directly standing in the air above little white and little white.<br/><br/>The grey sea surged towards the other 7 Cosmos!<br/><br/>The terrifying energy caused the 7 ruler level 6 Cosmos Beasts to feel a sense of threat!<br/><br/>One of the Cosmos Beasts flew out from its body, attacking Lan Qing Yue and the others!<br/><br/>“Woo Woo Woo!”<br/><br/>“Woo Woo Woo Woo!”<br/><br/>Xiao Zhai, Xiao Bai and the rest let out a low roar. The gray energy on their bodies condensed into fish and covered them.<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>The intense sounds of collision and explosion continued to ring out.<br/><br/>The terrifying shockwaves came towards Wang Xian.<br/><br/>However, the shockwaves of this battle were easily blocked by the Tai Chi Dragon Plate when they landed on Wang Xian’s body!<br/><br/>Lan Qingyue and the rest, together with the five elements millstone, were enough to help him to pin down seven level six cosmic beasts.<br/><br/>As for him, he only needed to fight against a level six cosmic beast.<br/><br/>He rushed over and his body was surrounded by light and dark divine dragons.<br/><br/>“Roar!”<br/><br/>When the Cosmic Beast saw Wang Xian rushing over, its blood-red eyes revealed a brutal look.<br/><br/>It was also rushing towards Wang Xian. Its body looked extremely soft and was filled with a sticky feeling.<br/><br/>That blood-red light dot contained a strange energy!<br/><br/>“Roar!”<br/><br/>Wang Xian waved his arm and punched forward.<br/><br/>The two energy dragons, light and darkness, were attacking him.<br/><br/>“Buzz!”<br/><br/>On the space beast opposite him, a blood-red light dot instantly went up to him.<br/><br/>The Dot of light did not have any strange shapes or any rules. Its attack looked very primitive.<br/><br/>However, this blood-red dot of light contained a terrifying power.<br/><br/>The Dot of light collided with the light and dark energy divine dragon and slowly dissipated.<br/><br/>The light and dark energy divine dragons continued to attack it.<br/><br/>It shook its huge body and directly collided with the light and dark energy divine dragon.<br/><br/>Its entire body was like a strange piece of flesh and blood.<br/><br/>As the light-dark divine dragon entered his body, his body continued to squirm.<br/><br/>When Wang Xian saw this scene, his expression did not change. He continued to fly towards him at the same speed.<br/><br/>The space beast emitted a glow and welcomed him.<br/><br/>The collision began!<br/><br/>Buzz<br/><br/>The red light spots on the Space Beast’s body started to stir. Its flesh and blood squirmed. Suddenly, a terrifying bloody mouth appeared in front of Wang Xian!<br/><br/>This bloody mouth went straight for Wang Xian to devour him.<br/><br/>Wang Xian did not attack. The Taiji Dragon on his body spun and charged straight into the space.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The interstellar beast let out a joyful sound as if it was celebrating the end of this great battle.<br/><br/>Wang Xian was devoured by it. A terrifying energy charged towards him.<br/><br/>However, at this moment, Wang Xian revealed a smile on his face.<br/><br/>The strongest aspect of the Tai Chi Dragon Plate was its defense.<br/><br/>At the same time, it could carry out a terrifying backlash.<br/><br/>As long as one could not break through the Tai Chi Dragon Plate’s defense in an instant, one would suffer a terrifying backlash.<br/><br/>In terms of offensive power, the Tai Chi Dragon Plate was much better than the five elements grinding mill.<br/><br/>However, in terms of defense and the backlash, the Tai Chi Dragon Plate was extremely terrifying.<br/><br/>Wang Xian was swallowed by the Space Beast and was attacked instantly.<br/><br/>The Tai Chi Dragon Disc began to spin to protect Wang Xian. At the same time, waves of cursed energy rushed into the Space Beast’s body.<br/><br/>“Ahhhhh!”<br/><br/>Soon, the space beast that was celebrating suddenly let out a horrifying scream.<br/><br/>Its body started to bleed and a large amount of blood gushed out.<br/><br/>Waves of terrifying energy attacked his body.<br/><br/>At the same time, a wave of energy was pressing towards Wang Xian, trying to force him out!<br/><br/>“Since I’m already here, do you still want me to leave?”<br/><br/>Wang Xian chuckled. He waved his arm and the light and darkness forces charged towards the body of the space beast.<br/><br/>Boom<br/><br/>The instinctive counterattack caused blood-red meatballs to appear in the body of the space beast.<br/><br/>These meatballs attacked Wang Xian.<br/><br/>Boom! Boom! Boom<br/><br/>The meatballs exploded with a terrifying energy and engulfed Wang Xian in an instant.<br/><br/>“Woo! Woo!”<br/><br/>However, a miserable scream came from the mouth of the space beast. It twisted its body crazily and its vitality was decreasing at a terrifying speed.<br/><br/>“Die!”<br/><br/>Wang Xian smiled when he saw this scene.<br/><br/>If it wasn’t for the space beast swallowing him into its stomach, it would take a long time for Wang Xian to kill it.<br/><br/>However, swallowing him into its stomach and attacking him indiscriminately was completely self-defeating.<br/><br/>Its attack couldn’t break the Taiji Dragon Plate. Furthermore, it was attacking inside its body. It was as if it was attacking itself without putting up any defense.<br/><br/>This caused his vitality to be depleted rapidly.<br/><br/>Wang Xian moved his body and charged directly at the flesh and blood on top of him.<br/><br/>“Roar Roar Roar!”<br/><br/>In the next second, he transformed into an incomparably huge divine dragon body. The Taiji Dragon Plate covered his body and directly broke through the body of the Space Beast.<br/><br/>The terrifying wounds and the injuries just now caused his life force to drop drastically.<br/><br/>Death!<br/><br/>“The first one, the first one has been eliminated. There are still seven left. Next, it will be simple!”<br/><br/>Wang Xian’s eyes focused.<br/><br/>Lan Qingyue and two Kun were sufficient to deal with five of them easily. The Tai Chi Dragon Disk was also able to deal with three of them.<br/><br/>Now, another one had died.<br/><br/>They had already formed a powerful suppressive force.<br/><br/>Wang Xian transformed into his divine dragon form. He stared at the nearest space beast that was in the level six realm and charged straight at it!<br/><br/>“Roar! Roar! Roar!”<br/><br/>The space beast that was at the level six realm let out a terrified roar when it saw Wang Xian killing one of its clansmen and charging at it!<br/><br/>“Roar! Roar! Roar!”<br/><br/>However, in the next second, his roar became excited.<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>At the back, more than a dozen space beasts below the level six realm responded. They flew towards the space beast in unison.<br/><br/>Under Wang Xian’s astonished gaze, the more than ten space beasts at level four and five surged into the body of this space beast.<br/><br/>They fused perfectly.<br/><br/>They were like flesh and blood as they fused together perfectly.<br/><br/>The strength of the space beast that was fused had obviously increased a little.<br/><br/>“If you fuse, all of you will die!”<br/><br/>Wang Xian let out a low growl and charged at it without slowing down.<br/><br/>“Roar! Roar!”<br/><br/>At this moment, an identical body suddenly appeared on the body of the interstellar beast that had been fused with a level six overlord.<br/><br/>The entire body elongated and this body attacked Wang Xian directly.\t\t\t\t\t\t</div>", "images": {}, "success": true}