{"id": 825, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073551.html", "title": "Chapter 3822 - 3822 3821 Demonic Dragon Species Upgrade", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3822 - 3822 3821 Demonic Dragon Species Upgrade</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3822 3821 demonic dragon species upgrade<br/><br/>Buzz! Buzz! Buzz<br/><br/>“Greetings, Dragon King!”<br/><br/>In this dirty land, one figure after another appeared beside Wang Xian. They bowed respectfully to Wang Xian.<br/><br/>There were more than a thousand figures. They had demonic bodies and a pair of dark wings!<br/><br/>Their eyes were blood red and filled with demonic beauty!<br/><br/>Charming dragon species!<br/><br/>These were the 1,000 charming dragon species from the dragon palace.<br/><br/>Wang Xian asked an lie to bring all of them over.<br/><br/>Out of the 1,000 charming dragon species, only the leader of the charming dragon species had broken through to the Overlord realm.<br/><br/>The rest were all at the peak of the venerable realm!<br/><br/>“Let’s see if you can absorb the energy here!”<br/><br/>Wang Xian scanned them and felt that the energy in the body of the charming dragon species was somewhat similar to the energy here. He opened his mouth and said!<br/><br/>“It’s the Dragon King!”<br/><br/>The group of charming dragons nodded their heads. Their eyes were sparkling as they looked to the side.<br/><br/>Their bodies moved and they immediately flew to the side.<br/><br/>“The energy of the charming dragon is similar to this!”<br/><br/>Lan Qingyue spoke from the side!<br/><br/>Wang Xian nodded his head.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Soon, the charming dragons entered the deep pit one by one and their bodies sank into it!<br/><br/>“Dragon King, we can absorb this energy and feel that we are improving at a very fast speed. Most importantly, by absorbing this energy, our comprehension ability will increase by a lot!”<br/><br/>Very soon, the charming dragon leader’s body landed on the special substance. His eyes shone brightly.<br/><br/>“Oh? Is That So?”<br/><br/>Wang Xian’s eyes shone brightly.<br/><br/>“Yes, this is a very strange feeling. This place is like our mother nest. We can grow rapidly here. It seems like we can continue to grow without any shackles!”<br/><br/>The leader of the Charm Dragon said!<br/><br/>When Wang Xian heard that, his eyes lit up!<br/><br/>He waved his arm and placed the black resurrection Lily inside. “Both of you will ascend together with the Black Resurrection Lily. Let’s see if the black resurrection Lily and all of you will undergo any transformation!”<br/><br/>“It’s the Dragon King. The black resurrection Lily can absorb the energy here. Currently, they are only at the peak of the venerable realm. Their effects and mystical abilities have not been displayed at all!”<br/><br/>The leader of the Charm Dragon responded immediately!<br/><br/>“Let’s go and take a look at this area. There are some special divine herbs growing here. They should be useful to you guys as well!”<br/><br/>Wang Xian was delighted. With a wave of his arm, he brought the leader of the Charm Dragon and flew forward.<br/><br/>This muddy land was not small. Even Wang Xian could sense some majestic energy here.<br/><br/>This majestic energy did not come from this place itself. Instead, it came from various special divine herbs.<br/><br/>They flew over and soon noticed a strange divine herb!<br/><br/>The divine herb was the same color as the material underneath the energy. The energy was the same as well.<br/><br/>It was just that it contained more energy!<br/><br/>Wang Xian and the rest landed at the side and looked at it carefully.<br/><br/>“Eh? This strange divine herb seems to have the aura of life!”<br/><br/>Lan Qingyue suddenly exclaimed in surprise and said!<br/><br/>“Indeed!”<br/><br/>Wang Xian nodded. His eyes were sparkling. He placed his palm on it and immediately sensed it.<br/><br/>“This? ? These aren’t divine herbs, nor are they plants!”<br/><br/>Under his sensing, Wang Xian immediately made a judgment!<br/><br/>These weren’t divine herbs at all!<br/><br/>“They are life forms. These are space behemoths that were born in this space!”<br/><br/>Wang Xian said in surprise.<br/><br/>This thing that looked like divine herbs was only a hundred meters in size.<br/><br/>However, it wasn’t a plant but a life form. It was a space behemoth!<br/><br/>“Dragon King, I feel that if I absorb this thing, I can improve immediately!”<br/><br/>At this moment, the leader of the charm dragon was staring at this space beast that had yet to be born!<br/><br/>“You can level up directly? Is there no shackle?”<br/><br/>Wang Xian looked at her and asked with a twinkle in his eyes.<br/><br/>“Yes, Dragon King. According to my guess, there should be no shackle. The energy here is very similar to the energy in the body of our charm dragon. It seems that after absorbing it, we will be able to complete the breakthrough naturally!”<br/><br/>The Charming Dragon said!<br/><br/>“An lie, bring back the corpses that you brought back to the Dragon Palace.”<br/><br/>Wang Xian instructed an lie immediately.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded and his figure disappeared instantly.<br/><br/>A few seconds later, an Lie’s figure appeared. The corpses of the space beasts were placed at the side.<br/><br/>“Can you devour these corpses?”<br/><br/>Wang Xian looked at the leader of the Charm Dragon and asked!<br/><br/>“Yes!”<br/><br/>The eyes of the leader of the charm dragon emitted a fiery glow as he nodded his head.<br/><br/>“Xiao Xian, it seems that the corpse that gave birth to the charm dragon seed in the Dragon Palace, the ancestral wizard, must have transplanted this energy from the starry universe to allow the charm dragon seed to absorb this energy.”<br/><br/>Lan Qingyue said to Wang Xian as she made her guesses.<br/><br/>Wang Xian nodded his head. “That should be the case. Furthermore, the space behemoth that was fighting with us was able to achieve a breakthrough by devouring each other. That should be their talent.”<br/><br/>The special talent of the space behemoth was to rapidly fuse the energy of the same species to achieve a breakthrough!<br/><br/>The charming dragon seed seemed to have such a talent as well!<br/><br/>“Go and fuse with it and see if you can achieve a breakthrough quickly!”<br/><br/>Wang Xian ordered the leader of the Charm Dragon.<br/><br/>If the charm dragon could make a quick breakthrough here, the Dragon Palace would have an additional 1,000 strong combat strength!<br/><br/>The current combat strength of the Dragon Palace was entirely dependent on him and Lan Qingyue.<br/><br/>The other strongest ones were bei Shuang and the rest who were at the ruler level two!<br/><br/>Such strength was too weak among the peak races!<br/><br/>“It’s the Dragon King!”<br/><br/>The leader of the charm dragon nodded and flapped her wings to arrive in front of the enormous corpse!<br/><br/>She spread her wings and slowly landed on the corpse.<br/><br/>Following that, waves of energy surged into her body.<br/><br/>The leader of the Charm Dragon absorbed the enormous corpse at a terrifying speed.<br/><br/>At the same time, the energy in her body was also increasing at a crazy rate.<br/><br/>“This is really a rapid increase. This is simply too amazing!”<br/><br/>Lan Qingyue looked at it with a surprised expression.<br/><br/>“It should be related to the inheritance and this special treasure land!”<br/><br/>Wang Xian’s eyes flickered slightly.<br/><br/>After all, the Succubus Dragon Seed was born from the ancestral witch’s corpse. In their bloodlines, there might be the inheritance of the ancestral witch.<br/><br/>Just like the inheritance of the Scarlet Queen, the advancement of the Spirit Red Bone did not have any restrictions!<br/><br/>As long as there was sufficient energy, one would be able to break through quickly.<br/><br/>The succubus dragon seed should also have this inheritance in its body.<br/><br/>However, this inheritance, this rapid advancement, seemed to require some kind of special energy.<br/><br/>And this place possessed this special energy!<br/><br/>If Wang Xian didn’t guess, the space beast that was born before the last breakthrough that the space beast devoured, once it was born, it would have the ability to approach or even dominate the seventh level.<br/><br/>This also meant that this treasured land could directly give birth to an existence on the level of a ruler.<br/><br/>It possessed a powerful special ability that ignored the shackles that the ruler level needed to break through step by step!\t\t\t\t\t\t</div>", "images": {}, "success": true}