{"id": 839, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073578.html", "title": "Chapter 3841 - 3841 3840 Army Of Faith, Exterminating The Entire Palace Of Gods", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3841 - 3841 3840 Army Of Faith, Exterminating The Entire Palace Of Gods</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3841 3840 Army of faith, exterminating the entire palace of gods<br/><br/>“Roar!”<br/><br/>The Type 6 ruler-class Astral Beast roared out.<br/><br/>The millions of gods and followers of the Army of faith unleashed their strongest attacks.<br/><br/>The power of faith gathered on the pearl.<br/><br/>The entire Pearl released a terrifying power of faith!<br/><br/>The 100 or so Type 7 gods on the astral beast all took out powerful treasures of faith.<br/><br/>They also poured their faith energy into the pearl.<br/><br/>This pearl was a famous treasure of the Qianyuan Palace, the life and Death Prophecy Pearl.<br/><br/>The Life and Death Prophecy Pearl could predict life and death.<br/><br/>It was also a powerful faith treasure.<br/><br/>Pouring in faith energy could reverse life and death!<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>When the endless power of faith poured into the life and death prophecy bead, the entire life and death prophecy bead exploded with a terrifying power of faith.<br/><br/>The scene inside the prophecy bead changed!<br/><br/>The situation in which they were doomed to die changed.<br/><br/>At the same time, the power of faith inside the life and death prophecy bead directly opened up an enormous umbrella of faith.<br/><br/>This umbrella of faith directly faced the attack of the Tai Chi Dragon disc and the five elements grinding mill!<br/><br/>“Boom!”<br/><br/>Following that, the sound of collision was heard, and a terrifying energy rushed out in all directions!<br/><br/>“Ahhhh!”<br/><br/>“Ahhhh!”<br/><br/>However, at this moment, the Army of faith of the Qian Yuan Palace, the believers below the level of gods, let out miserable cries.<br/><br/>The terrifying aftermath made them unable to withstand it.<br/><br/>The bodies of more than a million believers collapsed and died quickly!<br/><br/>“Eh?”<br/><br/>At this moment, Wang Xian, who was in the front, saw this scene and revealed a look of astonishment.<br/><br/>His attack was actually blocked.<br/><br/>One had to know that the full-strength attack of the Tai Chi Dragon disc and the five elements grinding was comparable to the full-strength attack of six level nine gods.<br/><br/>They actually managed to block it.<br/><br/>This surprised Wang Xian a little!<br/><br/>“Divination, enemy!”<br/><br/>At this moment, the Pantheon gods at the center of the Level Seven Space Beast let out a low roar. With a wave of their arms, the corpses of the surrounding believers entered the life and death divination bead.<br/><br/>In the next moment, Wang Xian’s figure appeared.<br/><br/>“Someone is attacking us. It should be an expert from the nine-origin universe.”<br/><br/>When the level seven pantheon in the center saw Wang Xian’s figure, his expression changed drastically as he shouted loudly!<br/><br/>“He actually discovered me!”<br/><br/>When Wang Xian saw this scene, his face revealed a look of astonishment.<br/><br/>It seemed that he could not underestimate this belief universe!<br/><br/>Even with his current strength, he was already very powerful!<br/><br/>“So be it if you discovered me. I will exterminate all of you. This amount of resources is already huge enough for the Dragon Palace!”<br/><br/>Wang Xian’s eyes sparkled as he growled in a low voice!<br/><br/>“Attack!”<br/><br/>With a thought, the five elemental millstone and the Tai Chi Dragon disc came crashing down on them.<br/><br/>The terrifying aura and energy gathered around them.<br/><br/>The Tai Chi Dragon Disc and the five elemental millstone went up and down and attacked them from both directions.<br/><br/>The terrifying energy attacked them once again.<br/><br/>At this moment, the scene of their deaths appeared once again on the life and Death Prophecy Bead!<br/><br/>“Not good!”<br/><br/>“The opponent’s strength is too terrifying. We can’t defend against it!”<br/><br/>Seeing the result on the life and Death Prophecy Bead, all the gods of the Qianyuan Palace revealed shocked expressions.<br/><br/>The first attack had caused all their believers to die.<br/><br/>They could no longer resist this attack!<br/><br/>Even if they released all the power of faith again…<br/><br/>They still couldn’t resist it!<br/><br/>“Who are you? If you dare to kill us, our Qianyuan Palace won’t let you off.”<br/><br/>The rank 7 gods in the center of the Qianyuan Palace roared with their eyes wide open.<br/><br/>This mysterious existence who attacked them was probably going to wipe them out this time.<br/><br/>There were over 80,000 gods in the million-strong army of the Qianyuan Palace!<br/><br/>Once all of them died, the losses would be extremely heavy.<br/><br/>“Hehe, you won’t let me off? I am the Dragon King of the nine-origin Universe’s Dragon Palace. I am here to accompany you at any time. However, none of you can think of escaping today. Die!”<br/><br/>Wang Xian did not hide the fact that he was discovered.<br/><br/>Moreover, even if he wanted to hide it, the universe would discover that it was him through his face!<br/><br/>Therefore, he decided to not hide it at all!<br/><br/>In the starry universe, Wang Xian was not afraid of any enemies!<br/><br/>“Dragon King of the Dragon Palace, Dragon King of the Dragon Palace, just you wait. Just you wait, give us the Qianyuan Palace, give us the belief universe, and we will definitely annihilate all of you!”<br/><br/>A level seven pantheon roared with a sinister and violent expression!<br/><br/>“HMPH, then I want to see who will kill who!”<br/><br/>Wang Xian stared at them coldly.<br/><br/>“Roar Roar Roar!”<br/><br/>“Roar Roar Roar!”<br/><br/>At this moment, the roars of the five elements Millstone and the Tai Chi Dragon Plate could be heard.<br/><br/>Waves of energy attacked them directly!<br/><br/>“No, no, no!”<br/><br/>“We can’t escape, we can’t escape!”<br/><br/>“Get the palace master and the rest to avenge us. We must destroy the Dragon Palace and avenge us!”<br/><br/>Roars and despairing voices rang out. The gods felt this unrivaled power and their bodies trembled violently.<br/><br/>They were going to die!<br/><br/>Only the gods who had treasures could be revived. Most of the gods were dead this time. They were completely dead!<br/><br/>They were unwilling to accept this!<br/><br/>Boom! Boom<br/><br/>At this moment, the energy from the Tai Chi Dragon Disc and the five elements millstone collided together. The gods in the center and the Space Beast who was at level six were losing their vitality under this force.<br/><br/>In the end, there was still a huge gap between their strength and Wang Xian’s!<br/><br/>Buzz<br/><br/>At this moment, Wang Xian waved his arm and saved the lives of a few gods.<br/><br/>Soul capture was unleashed and waves of information entered his mind.<br/><br/>The rest of the gods turned into corpses.<br/><br/>Wang Xian waved his arm and collected all the corpses. A smile appeared on his face.<br/><br/>The harvest this time was too great!<br/><br/>There were more than 80,000 gods in the army of one million believers!<br/><br/>Among them, there were more than 100 masters at level seven.<br/><br/>With these resources, the strength of the Dragon Palace would be able to obtain a terrifying increase.<br/><br/>By then, as long as there were sufficient resources, the improvement of the disciples of the Dragon Palace would be much easier.<br/><br/>Perhaps in a few tens of millions of years, the number of masters at the level of the Dragon Palace could reach more than 100,000.<br/><br/>The speed of improvement was absolutely terrifying.<br/><br/>“Qianyuan Palace? So this is the army sent by the Qianyuan Palace to the battlefield of the nine-origin universe. The 24 palaces are working together to eliminate all the strong disciples in the nine-origin Universe?”<br/><br/>Wang Xian kept the corpse and began to check the information he obtained.<br/><br/>Looking at this information, his eyes were filled with astonishment.<br/><br/>With the 24 palaces working together, each palace had a million troops.<br/><br/>All of them had powers that were not weaker than the Qianyuan Palace. The strength of these 24 palaces was rather terrifying!<br/><br/>One had to know that each palace had sent out more than 100 level seven pantheon!\t\t\t\t\t\t</div>", "images": {}, "success": true}