{"id": 832, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073564.html", "title": "Chapter 3834 - 3834 3033 Lan Qingyue Entered The Battlefield", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3834 - 3834 3033 Lan Qingyue Entered The Battlefield</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3834 3033 LAN Qingyue entered the battlefield<br/><br/>Time passed. Wang Xian was in the void space of the Virtual Spirit Treasure Ground, waiting quietly there.<br/><br/>He was very patient. He sat cross-legged in the illusory space and had been hiding all this while!<br/><br/>In the center of the Virtual Spirit Treasure Ground, a group of gods who believed in the universe were creating a powerful god of war.<br/><br/>Millions of years passed in the blink of an eye!<br/><br/>During these millions of years, Wang Xian did not receive any improvements, nor did he gain any treasures!<br/><br/>However, for the treasures in front of him, this time was not wasted.<br/><br/>Wang Xian’s current resources were enough for him to increase by two levels!<br/><br/>However, he could not make another breakthrough in the starry universe.<br/><br/>Once he made a breakthrough, he would be attacked by powerful Cosmic Beasts!<br/><br/>Over the past few million years, he would occasionally pay attention to the war between the 9-origin universe and the belief universe.<br/><br/>The current war wasn’t that bitter.<br/><br/>It had always been a guerilla war.<br/><br/>He would find some information about the other party and then set up an ambush!<br/><br/>Now, the 9-origin universe and the belief universe had changed from a Legion to a small group!<br/><br/>After that, they were gradually divided into two battlefields.<br/><br/>This was because both sides had more or less grasped each other’s power!<br/><br/>The rulers and the gods were engaged in a great battle at the center, where they fought while harvesting resources!<br/><br/>The followers of the rulers and the followers of the belief universe were engaged in a great battle at the opposite location!<br/><br/>This great battle that lasted for millions of years didn’t reduce the power of the 9-origin universe. Instead, it gave birth to many great beings at the ruler level.<br/><br/>If it was in the 9-origin universe, the great beings of many high-level races wouldn’t have a high chance of making a breakthrough, even if it was during the catastrophe!<br/><br/>However, in the starry universe, not only did they have a large amount of resources, as long as they could hunt down a disciple of the same level in the belief universe, they would be able to make a breakthrough.<br/><br/>Then their chances of making a breakthrough would increase by 50% !<br/><br/>This gave birth to a large number of great beings at the ruler level in just a few million years.<br/><br/>Among the high-level races, there were no less than a thousand known masters who had broken through.<br/><br/>After all, there were too many disciples of the masters of the high-level races. Even if the thirteen peak races were added together, they were still less than one-tenth of them.<br/><br/>The high-level races were improving rapidly. The rest of the peak races were also improving tremendously.<br/><br/>The Dragon Palace had even added a few thousand masters at the Overlord level.<br/><br/>On the Dragon Palace’s side, although Wang Xian had always been there, the resources that the Dragon Palace obtained were not less than the other peak races.<br/><br/>This was because with Lan Qingyue and the others around, the Dragon Palace had gained a lot!<br/><br/>The birth of a large number of masters had also caused many masters’Disciples in the nine-origin universe to rush in!<br/><br/>After all, it would only take a few decades for an ordinary advanced race to give birth to a newborn!<br/><br/>The race’s reproduction was extremely fast!<br/><br/>With the deaths of living beings, even more living beings came from the 9-origin universe to look for opportunities!<br/><br/>They either became stronger, died, or became ordinary.<br/><br/>This kind of battle lasted for more than 10 million years!<br/><br/>After more than 10 million years, the belief universe seemed to have sent even more experts into the battlefield.<br/><br/>This time, they led a total of eight ruler level 5 space beasts.<br/><br/>This resulted in a sudden attack on the nine-origin universe, killing a few experts of the voodoo race.<br/><br/>A large number of skeleton armies were destroyed!<br/><br/>There were also other peak races who were accepted as believers!<br/><br/>Due to the sudden change, the other peak races contacted Wang Xian and wanted Lan Qingyue to bring Kun to participate in the battle!<br/><br/>During this period of time, Lan Qingyue had been searching for resources and did not participate in this battle.<br/><br/>After all, the resources of the Dragon Palace were still too little. It would be of great benefit to the development of the Dragon Palace if they occupied more precious lands.<br/><br/>As for the war, they could participate in it anytime!<br/><br/>At that time, with Xiao Lan and the rest’s strength, wouldn’t they be easily defeated?<br/><br/>Therefore, Wang Xian only took a look at the war formation and did not take it to heart.<br/><br/>“Do you want to let the Dragon Palace participate in the war?”<br/><br/>Wang Xian looked at the group of experts from the peak races in the individual communication group. They wanted the Dragon Palace to help them restrain the eight space behemoths who were at the level of a ruler of level five!<br/><br/>“That works too!”<br/><br/>Wang Xian thought for a moment and sent a message in the communication stone plate!<br/><br/>“Yes, our Dragon Palace will send a Kun to join the battle!”<br/><br/>After this message was released, he told Lan Qingyue about it as well!<br/><br/>This time, he would send Xiao Lan over!<br/><br/>The news that Xiao Lan, Xiao Bai, and the rest had advanced to the level 6 overlord realm was unknown even in the nine-origin universe.<br/><br/>Everyone thought that Lan Qingyue and the rest could only match up to the level 8 overlord realm on their side.<br/><br/>In fact, they could already reach the level 9 overlord realm!<br/><br/>Sending one over was already enough. Moreover, it could also conceal the strength of the Dragon Palace.<br/><br/>“HMM?”? “Dragon King, one Kun can only hold back two level five space beasts at most. Can the Dragon Palace send out all their forces?”? “It’s the war between our nine-origin universe and the belief universe now. Furthermore, the gods that you’ve killed belong to Your Dragon Palace.”<br/><br/>Wang Xian’s message had just been sent over when an expert from the voodoo race spoke in the communication group.<br/><br/>“That’s right. I think Dragon King, you guys can get the Blue Green Moon Dragon Queen to lead all the Kun to the battlefield. You guys have killed a large number of worshippers. This will be of great benefit to the development of Your Dragon Palace!”<br/><br/>The expert from the Divine Tiger Race also spoke up.<br/><br/>“I have a Kun that just broke through not long ago. Sending that one is enough!”<br/><br/>At this moment, Lan Qingyue sent a message in the group chat.<br/><br/>When this message was sent, the entire group was silent for a few seconds.<br/><br/>Even for the experts of the peak races, when they saw this message, they were also..? ? ?<br/><br/>? ? ? ?<br/><br/>Broke through?<br/><br/>A Kun that the ancient god of Dragon Palace had raised a Kun master and a Dragon Queen had broken through?<br/><br/>Wouldn’t that mean that it was now comparable to their peak race’s ruler, level nine?<br/><br/>In the starry cosmos, wouldn’t they be able to sweep through the disciples of their 9-origin Cosmos and belief cosmos?<br/><br/>Of course, sweeping through might be a little exaggerated. If a few powerful peak races really wanted to go all out, if they really wanted to go all out with treasures, they would be able to bring out their overlord Level 9 strength.<br/><br/>However, among the peak races, less than half were able to do so.<br/><br/>And this was despite their losses!<br/><br/>But now, they already possessed the combat strength of a ruler at the ninth level?<br/><br/>This was too crazy!<br/><br/>This Dragon Palace was simply invincible in the STARRY COSMOS!<br/><br/>“Congratulations to the Kun raised by the Dragon Queen for breaking through. With Your Kun, we can completely wipe them out.”<br/><br/>An expert from the shaman race sighed and said with respect!<br/><br/>“Tell me the position of the Cosmos Gods that you believe in. I will bring the Kun over and destroy them!”<br/><br/>Lan qingyue directly said!<br/><br/>The peak races immediately responded!<br/><br/>Following that, Lan Qingyue led little blue into the battlefield.\t\t\t\t\t\t</div>", "images": {}, "success": true}