{"id": 836, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073572.html", "title": "Chapter 3838 - 3838 The 3837 Soul Battleship’S Strength Increased Explosively!", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3838 - 3838 The 3837 Soul Battleship’S Strength Increased Explosively!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3838 The 3837 soul battleship’s strength increased explosively!<br/><br/>“Two treasured lands have been occupied consecutively. What should we do now? If the nine-origin universe really came to an agreement with those space beasts, then we have no chance of contending against them.”<br/><br/>“That’s not right. I don’t think there will be any agreement. With the strength of those space beasts, it’s simply too easy for them to destroy the gods they believe in. They can even easily destroy all of our gods and disciples.”<br/><br/>The elder’s guess was refuted by an elder beside him.<br/><br/>According to the information they had received, the space beasts that had opened the passage between the nine-origin universe and the space universe were very powerful. If they really attacked them, the gods they believed in in the space universe wouldn’t be able to resist at all.<br/><br/>“Could it be that only some of the space universes have reached an agreement with the nine-origin Universe?”<br/><br/>The elders of the order palace frowned slightly, their expressions unsightly.<br/><br/>No matter what, their order palace had suffered heavy losses this time.<br/><br/>They had even lost the extremely powerful void spirit treasured land.<br/><br/>Now, they didn’t dare to send their disciples into the Void Spirit treasured land.<br/><br/>That was because they had already set up a powerful defensive force in the Void Spirit treasured land, along with a group of experts and faith books.<br/><br/>Such a force was instantly killed, and they didn’t even know what the enemy was like. This force wasn’t something they could contend against!<br/><br/>“Tell all the gods and disciples to be careful.”<br/><br/>A palace’s powerful gods also slightly frowned as they spoke!<br/><br/>The Starry Universe was a huge treasured land to them. Just because of this small loss, they couldn’t make all the gods and disciples withdraw.<br/><br/>They believed in the development of the gods by absorbing believers to increase their strength.<br/><br/>The Space Beasts in the starry universe did not have high intelligence. Their bodies were terrifying. Every time they took in a space beast as a believer, the power of faith that was born was extremely terrifying!<br/><br/>It was only two treasure grounds that were in trouble. It was not enough to force them to withdraw.<br/><br/>However, it was necessary to be careful!<br/><br/>They decided to continue to wait and see!<br/><br/>Time passed quickly once again. At the location of the virtual spirit treasure land, Wang Xian was constantly nurturing that soul battleship!<br/><br/>He was nurturing it bit by bit, striving to reach the stage where he could control it at will!<br/><br/>At the side, the four netherspirit avatars were condensing their soul power, preparing to turn it into powerful weapons.<br/><br/>Millions of years passed once again.<br/><br/>Wang Xian was standing on a very special ship.<br/><br/>The ship looked illusionary and seemed to have no energy at all.<br/><br/>At the bow of the ship, there was a huge dragon head. The body of the ship was also occupied by a divine dragon!<br/><br/>The entire ship was filled with a mighty aura.<br/><br/>Wang Xian moved his body and flew forward at a terrifying speed!<br/><br/>The illusory ship was like a phantom in the universe. It looked somewhat mystical.<br/><br/>“Yes, yes, it’s very fast!”<br/><br/>Wang Xian stood on the soul warship with a smile on his face.<br/><br/>Over the past two million years, this soul warship had been completely nurtured by him. It was able to achieve the state of being one with him.<br/><br/>With a thought, he could fly out quickly.<br/><br/>The Soul Battleship’s attack power was very strong, but it didn’t have many offensive techniques.<br/><br/>It also didn’t contain any other energy.<br/><br/>It was the purest soul power.<br/><br/>This soul power had a special characteristic with the ghost clone. It completely ignored physical attacks.<br/><br/>In addition, the soul battleship’s function didn’t contain any physical attacks. It could only attack the souls of living beings.<br/><br/>However, because of this, the attack power of the soul battleship was very strange and terrifying.<br/><br/>After all, it would not attack the physical body when it charged forward. Instead, it would attack the soul directly. If one was not careful, he or she might be severely injured.<br/><br/>After the soul battleship was nurtured, Wang Xian’s strength had improved significantly.<br/><br/>Due to the uniqueness of this soul battleship, it was not a problem for it to fight against a powerhouse who was at the level nine realm and the level nine pantheon of gods.<br/><br/>The things that he had obtained over the past 10 million years were totally worth it!<br/><br/>In addition, during the past few million years, Wang Xian’s own strength and the Netherworld Ghost Avatar had also received a considerable improvement.<br/><br/>Four Netherworld Ghost Avatars had condensed two soul armors that were comparable to a master of level seven.<br/><br/>With two Netherworld Ghost Avatars, their strength could fight against two opponents of the same level.<br/><br/>Such an improvement would be extremely terrifying if it was placed in the hands of other peak races in the nine-origin universe.<br/><br/>However, over the past few million years, Wang Xian was able to discover that the soul power in the black hole was not endless. The birth of soul power required time!<br/><br/>In other words, by wantonly consuming the soul power here, the soul power here would become less and less.<br/><br/>“This is normal. If there is no end to it, then this is illogical. If there is no end to it, it is only a matter of time before the soul power is used to create an expert at the peak level.”<br/><br/>As Wang Xian spoke, he controlled the soul battleship and flew directly to the sky above the black hole.<br/><br/>Buzz Buzz Buzz<br/><br/>Waves of energy emitted from the soul battleship and attracted a large amount of soul power from the surroundings.<br/><br/>The soul battleship was built with the soul energy here. Naturally, it could gather the soul energy here.<br/><br/>Moreover, its gathering speed was hundreds of times faster than the four netherspirit avatars!<br/><br/>They were on completely different levels!<br/><br/>“I can continue to stay here. I can gather all the Soul Energy Here!”<br/><br/>Wang Xian made up his mind. He wasn’t prepared to leave!<br/><br/>Time began to pass quickly again.<br/><br/>In the entire Dragon Palace, all the strong disciples were cultivating and accumulating.<br/><br/>Because they had the faith heart provided by Wang Xian, they didn’t need to participate in this war.<br/><br/>The strength of the strong disciples of the Dragon Palace was increasing at a terrifying rate.<br/><br/>In the faith universe, they seemed to have calmed down as all the strong disciples of the two treasured lands were destroyed.<br/><br/>Even in the battle with the nine-origin universe, a large number of powerful disciples had been withdrawn.<br/><br/>Another ten million years passed, and the nine-origin universe and the belief universe had also sunk into a short period of peace.<br/><br/>The powerful disciples of the two universes began to focus on searching for treasures and resources.<br/><br/>As for Lan Qingyue, he also began to search for treasures and resources with little blue and the others.<br/><br/>This allowed the Dragon Palace to obtain a large amount of resources. They didn’t have to worry about resources at all.<br/><br/>10 million years.<br/><br/>20 million years.<br/><br/>30 million years.<br/><br/>The Starry Universe fell into a rare period of peace.<br/><br/>Wang Xian was also constantly gathering the soul energy here during these 30 million years.<br/><br/>In these 30 million years, Wang Xian had mastered three soul items that were comparable to soul battleships.<br/><br/>Two of them had been successfully nurtured by him.<br/><br/>As for the last one, it would take him a few million years to successfully nurture it.<br/><br/>When he condensed the third soul treasure of this level, the soul power in the virtual spirit treasure ground was almost depleted.<br/><br/>Only the sky above the black hole was still emitting soul power.<br/><br/>However, it would probably take him 10 to 20 billion years to accumulate to the same level as before!\t\t\t\t\t\t</div>", "images": {}, "success": true}