{"id": 837, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073574.html", "title": "Chapter 3839 - 3839 3838, The Improvement Of The Various Peak Races", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3839 - 3839 3838, The Improvement Of The Various Peak Races</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3839 3838, the improvement of the various peak races<br/><br/>“This virtual spirit land is temporarily crippled!”<br/><br/>Wang Xian stood at the center of this land of treasures.<br/><br/>The surrounding spiritual energy had already disappeared. Only some of it was being emitted from the black hole.<br/><br/>This was a land of treasures.<br/><br/>It was not inexhaustible.<br/><br/>It required time to accumulate.<br/><br/>However, if he wanted to accumulate to the state that Wang Xian was in when he first arrived, the next calamity might end!<br/><br/>“We can leave this place now. Ao crab has already absorbed all the energy in the Black Codex Treasure land more than ten million years ago. Even for the charming dragon species, he has already absorbed all the energy!”<br/><br/>Yes, the special energy in the treasure land was not infinite.<br/><br/>Over at the Black Codex Treasure Land, ao crab had millions of devouring dragons. The speed of his devouring was terrifying.<br/><br/>More than ten million years ago, it had already absorbed all the energy in the black scripture treasured land.<br/><br/>The black liquid had already been used up.<br/><br/>To recover again, it would take a long time.<br/><br/>And the Ao Crab’s strength had also reached the level of a ruler at level 5, comparable to a ruler at level 4 amongst the pinnacle races of the 9-origin universe.<br/><br/>In addition, out of the 1,000 charm dragon species, 100 had reached the level of a ruler at level 7, while the rest were at level 6.<br/><br/>During this period, the strength of the Dragon Palace had received a terrifying replenishment!<br/><br/>The number of overlord powerhouses had also reached 40,000!<br/><br/>This was a very powerful number!<br/><br/>“The increase in the number of overlord powerhouses in the Dragon Palace should be comparable to the total number of the other 12 peak races.”<br/><br/>Wang Xian spoke. After all, they had killed too many powerhouses who believed in the gods this time.<br/><br/>“Next, I will continue to search for the precious land occupied by the universe of belief. After that, I will destroy them and claim them as my own!”<br/><br/>Wang Xian made up his mind. With a move of his body, he immediately flew into the distance.<br/><br/>He was prepared to continue searching and hunting!<br/><br/>Standing on the soul battleship, Wang Xian quickly flew in one direction.<br/><br/>Apart from this soul battleship, there were two other Wang Xian now. Two Soul Spears!<br/><br/>These two soul spears would definitely be an extremely terrifying killing weapon after they were shot out.<br/><br/>Most importantly, after the soul spears were successfully nurtured, Wang Xian could retrieve them instantly after he shot them out.<br/><br/>With his current strength, it was simply too easy for him to kill a level nine overlord!<br/><br/>With his strength, he could fight against eight to nine existences at the level nine overlord realm.<br/><br/>Buzz, Buzz, Buzz<br/><br/>Just as Wang Xian was flying, messages suddenly came from the communication stone plate!<br/><br/>When Wang Xian opened the communication stone plate and saw the messages, he was slightly stunned.<br/><br/>“Dragon King, there is a sensational news from the peak race. The Voodoo race has created a powerful voodoo puppet with the body of a space beast. It is comparable to a level nine powerhouse. This time, they have killed a large number of powerhouses who believed in the universe.”<br/><br/>“The demon race has nurtured a few fifth-level space beasts. They’ve also attacked the gods who believe in the universe, but they’re not weak either. The two sides fought for a long time before splitting up.”<br/><br/>“In addition, according to what we know, the other peak races are also looking for ways to increase their strength. There’s a rumor from the skeleton race that they’re nurturing a powerful space beast skeleton.”<br/><br/>“I guess that the other peak races are doing the same thing.”<br/><br/>Prime Minister Gui sent the message. When he saw the message, he was shocked.<br/><br/>The other peak races were already thinking of ways to resist the suppression of the universe.<br/><br/>Perhaps the peak races had been preparing for this research since the beginning!<br/><br/>The initial method was to tame the space beast and raise its strength after taming it.<br/><br/>The Space Beast wouldn’t be suppressed here. With the power of the pinnacle races, they could easily capture a ruler level four space beast, tame it, and give it a large amount of resources to nurture.<br/><br/>After all, it was only a ruler level four space beast. For the pinnacle races, nurturing it wasn’t difficult.<br/><br/>For a level four space beast, it would be comparable to a level eight space beast in the nine-origin universe when it was nurtured to a level five space beast.<br/><br/>Moreover, as these space beasts belonged to the living beings in the universe, they would not attract the attention of the powerful space beasts.<br/><br/>In fact, in the universe, as long as it was not a level eight space beast, it would not attract the attention of the king of the Space Beasts.<br/><br/>“The peak races are indeed the peak races!”<br/><br/>Wang Xian mumbled as his eyes sparkled.<br/><br/>However, although their improvement was terrifying, on the surface, the strength of the Dragon Palace was still very terrifying.<br/><br/>More than 30 million years ago, Xiao Lan’s strength was displayed.<br/><br/>The other peak races also knew that the ancient god Feeding Kun master had three kun. More than 30 million years ago, one Kun had reached the ruler of level six. Then, more than 30 million years later.., the other two Kun masters might have also reached the level of a ruler at level six.<br/><br/>In addition to the ancient god Feeding Kun master, the Dragon Palace had the strength to fight against four experts at level nine.<br/><br/>Among the peak races, they should still be considered the strongest.<br/><br/>However, the peak races now all had their own trump cards.<br/><br/>“Xiao Lan and the rest are still some distance away from leveling up. I wonder how much they have leveled up from the other peak races.”<br/><br/>Wang Xian mumbled, “I have to hunt down some of the gods who believe in the universe as soon as possible.”<br/><br/>He scanned his surroundings. While nurturing the last soul treasure, he was also looking for the powerhouses in the belief universe.<br/><br/>…<br/><br/>“The nine-origin universe has been very arrogant recently. They have killed a large number of our powerhouses consecutively. It’s time to kill them all!”<br/><br/>At the same time, at the passage of the belief universe, a great being of the gods glanced at all the great beings in the surrounding palaces and said.<br/><br/>“Indeed. With some arrangements, we can capture all the great beings and disciples of the 9-origin universe in one go!”<br/><br/>The elder of the decree palace nodded and agreed.<br/><br/>“Each palace will send out a top-tier combat power, and 24 of them are enough to destroy them. The Great Beings and disciples of the entire 9-origin universe, as well as the resources, will be divided equally among the 24 palaces.”<br/><br/>At the right rear, a great being from a palace glanced around and said!<br/><br/>“Sure!”<br/><br/>The gods from the other palaces nodded.<br/><br/>Over the past tens of millions of years, they had already understood everything about the 9-origin universe. Most of the elite disciples, rulers, and Great Beings Below Level-8 had already arrived in the 9-origin universe.<br/><br/>Now, it was time to capture all the Great Beings’disciples from the 9-origin universe in one fell swoop!<br/><br/>Capture them all in one fell swoop. Those who couldn’t be taken in as believers were all annihilated.<br/><br/>Those who could be taken in as believers were subdued. Then, they would reproduce and give birth to more disciples of the 9-origin universe.<br/><br/>Then, the resources of the starry universe would be used by them as they pleased.<br/><br/>Those who couldn’t be used could be given to the believers of the 9-origin universe to increase their strength.\t\t\t\t\t\t</div>", "images": {}, "success": true}