{"id": 833, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073566.html", "title": "Chapter 3835 - 3835 In 30,34,20 Million Years, She Had Become A God Of War!", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3835 - 3835 In 30,34,20 Million Years, She Had Become A God Of War!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3835 In 30,34,20 million years, she had become a god of War!<br/><br/>Lan Qingyue stepped into the battlefield.<br/><br/>A group of peak races gave her information, and he destroyed them.<br/><br/>However, this time, only the shamans and the skeleton race gave her two pieces of information.<br/><br/>One was about the eight space beasts, and the other was about a powerful army that believed in the universe.<br/><br/>Lan Qing Yue brought little blue over and easily destroyed them, obtaining the Faith Hearts of over 3,000 gods.<br/><br/>Among them, the number of level seven gods also reached 18!<br/><br/>The Faith Hearts of ordinary believers of the universe, however, obtained a total of over 20,000!<br/><br/>This battle was quite rewarding.<br/><br/>However, after Lan Qing Yue finished off these two faith universe combat powers, the other pinnacle races didn’t send her any more messages.<br/><br/>The gods who believed in the universe were a double-edged sword to the peak races!<br/><br/>They wanted to destroy them and obtain the heart of faith.<br/><br/>But they hoped that their peak races would destroy them.<br/><br/>And not the other peak races.<br/><br/>The Dragon Palace had destroyed so many gods who believed in the universe this time, so obtaining the heart of faith was very terrifying.<br/><br/>Naturally, there would be many more experts born than them.<br/><br/>These hearts of faith were something they coveted!<br/><br/>Hence, the other peak races did not report any news.<br/><br/>Wang Xian, Lan Qingyue, and the rest did not care.<br/><br/>Compared to the number of gods and believers in the universe on the battlefield, Wang Xian’s side had more!<br/><br/>It was much more convenient to hunt here than on the battlefield!<br/><br/>If Wang Xian was not afraid of killing the gods who believed in the universe out of the starry universe, he would have acted wantonly long ago!<br/><br/>He would not have hidden his identity at all!<br/><br/>…<br/><br/>“Damn it, we suffered such heavy losses this time. Eight level five sovereign Kun were killed, and more than a dozen level seven gods were killed.”<br/><br/>At the passageway between the starry universe and the universe of belief, an old man from a palace had a gloomy and unsightly expression.<br/><br/>“In the Dragon Palace of the nine-origin universe, there is a powerful ancient god who feeds the Kun Lord Dragon. His Kun is not suppressed in the starry universe, and the Kun that attacked should have reached level six sovereign!”<br/><br/>Not far away, another expert from another palace said with a slight frown.<br/><br/>“This is indeed a huge problem. I really didn’t expect that there would be such a mysterious existence in the nine-origin universe.”<br/><br/>The old man frowned and scanned his surroundings.<br/><br/>Clearly, the other forces of the palace had also received this news.<br/><br/>They could take in some experts of the nine-origin universe as disciples, so they naturally had a very good understanding of the news of the nine-origin Universe!<br/><br/>They were clear about all the forces and Great Beings in the nine-origin universe.<br/><br/>Although a powerful Kun was very troublesome for them, it was not to the extent that they could not do anything about it!<br/><br/>Just like the Decree Palace, they had built a faith-based war god. It would take some time before it could be completed.<br/><br/>The other palaces were also carrying out some preparations!<br/><br/>The surrounding great beings of the various gods didn’t speak, and soon, they became completely silent.<br/><br/>They weren’t too surprised that such a powerful being could erupt from the nine-origin universe.<br/><br/>After all, the nine-origin universe was considered a relatively powerful existence among all the other universes!<br/><br/>Time continued to pass.<br/><br/>The war between the nine-origin universe and the Faith Universe was completely eased because of Lan Qing Yue’s sudden attack.<br/><br/>Many disciples of great beings once again stepped into the path of searching for treasures.<br/><br/>Occasionally, there would be some small-scale battles.<br/><br/>A few million years passed once again!<br/><br/>“Weng Weng Weng!”<br/><br/>At the same time, at the location of the Void Spirit treasured land, waves of powerful energy surged toward the surroundings!<br/><br/>At the center of the Void Spirit treasured land, around the black hole, the belief wargod that had been forged with soul energy had also reached the final stage.<br/><br/>“It has already been 20 million years. With the help of the power of the virtual spirit land, they managed to build an existence that is comparable to a level nine pantheon in more than 20 million years. This is considered to be very fast!”<br/><br/>Wang Xian looked ahead with a twinkle in his eyes.<br/><br/>20 million years seemed to be a long time. However, compared to hundreds of millions of years or one billion years, it was nothing.<br/><br/>If one was created in twenty million years, ten could be created in two hundred million years.<br/><br/>This was a great deal!<br/><br/>“Hahaha, is it going to succeed?”<br/><br/>At this moment, an excited voice was heard.<br/><br/>Wang Xian looked at the voice and immediately saw more than ten figures flying over. Each of them was an existence at the level of a seventh-level pantheon.<br/><br/>When he saw them, a smile appeared on his face.<br/><br/>“The creation of the belief god of war has been completed. The next step is to insert some memories into it!”<br/><br/>At the center, an elder from the law enforcement palace spoke without even turning his head back!<br/><br/>“Good, good, good. With this belief god of war, we can step into more places. Haha!”<br/><br/>More than a dozen level seven pantheon flew over from behind and spoke with smiles on their faces!<br/><br/>They floated in front and raised their heads to look at this god of faith.<br/><br/>“Come, let’s start injecting the memories!”<br/><br/>The elder from the decree palace smiled and flipped through the book in his hand!<br/><br/>When the book was flipped open, Faith Runes appeared one after another and surged towards the god of faith!<br/><br/>“It’s time to make a move. We can’t let them bestow the god of faith with memories and Wisdom!”<br/><br/>Wang Xian muttered to himself when he saw this scene!<br/><br/>He had waited for 20 million years for this scene. It was a full 20 million years before they were able to complete the creation of this god of war.<br/><br/>Once Wang Xian was able to obtain this god of war, his combat strength would be comparable to that of a level nine pantheon, not to mention other things.<br/><br/>This harvest could be said to be incomparably huge!<br/><br/>Of course, there was also the faith heart of these 10,000 or so gods.<br/><br/>It was worth it to wait for 20 million years!<br/><br/>Buzz<br/><br/>Buzz! Buzz<br/><br/>Just as they were imparting memories to the god of war, Wang Xian started to move.<br/><br/>Waves of light and darkness energy suddenly enveloped the entire space.<br/><br/>In addition, what they could not see was that outside of the light and darkness, there was a force of five elements!<br/><br/>To be on the safe side, Wang Xian instantly used all the power of the Five Elements Millstone and the Tai Chi Dragon Disc.<br/><br/>This was a strength that was comparable to six level nine pantheon gods!<br/><br/>When the terrifying and vast energy enveloped them, the faces of all the gods of faith suddenly changed.<br/><br/>“What’s going on? What Happened?”<br/><br/>“Oh no, what a terrifying energy! What a terrifying pressure!”<br/><br/>“What’s going on? What kind of existence is attacking us?”<br/><br/>At this moment, all the gods of faith scanned their surroundings with a look of horror. Their eyes were filled with vigilance.<br/><br/>Boom<br/><br/>However, in the next second, a wave of energy engulfed them!<br/><br/>This wave of energy was mixed with light and darkness as well as the five elements. The seven types of energy had almost merged together to form a strange energy!<br/><br/>Of course, this strange energy was also deliberately created by Wang Xian!<br/><br/>He didn’t want these people who believed in the universe to escape from the universe because they knew he was too strong.<br/><br/>To him, these people who believed in the gods were mature leeks!\t\t\t\t\t\t</div>", "images": {}, "success": true}