{"id": 842, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073584.html", "title": "Chapter 3844 - 3844 3,843,10 Palaces Joined Forces To Destroy The Dragon King", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3844 - 3844 3,843,10 Palaces Joined Forces To Destroy The Dragon King</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3844 3,843,10 palaces joined forces to destroy the Dragon King<br/><br/>“What’s the situation?”<br/><br/>Wang Xian sensed the terrifying power of faith and his gaze focused!<br/><br/>This power of faith was more than ten times stronger than the million-strong army of the Qianyuan Palace that he had encountered previously!<br/><br/>This power of faith was almost tangible.<br/><br/>He hesitated for a moment and his gaze focused slightly. He stared ahead vigilantly.<br/><br/>Wang Xian also knew that the belief universe must have received the news that he had destroyed the million-strong army of the Qian Yuan Palace.<br/><br/>After they received the news, they would either retaliate or evade.<br/><br/>However, based on Wang Xian’s understanding of the strength of the 24 palaces, they would not evade. Instead, they would retaliate. Instead, they would seek revenge on him.<br/><br/>“However, how did they know my location? Is there some special method?”<br/><br/>Wang Xian mumbled to himself as he became more and more vigilant.<br/><br/>If a power that believed in the universe wanted to deal with him, he had to be extremely vigilant!<br/><br/>The Five Elements Millstone and the tai chi dragon disc floated directly around him.<br/><br/>The soul battleship was ready to burst out with its fastest speed at any time!<br/><br/>Buzz! Buzz! Buzz<br/><br/>At this moment, Wang Xian sensed a powerful energy before the gods of the belief universe arrived.<br/><br/>“The Dragon King of the Dragon Palace is right in front. Don’t let him escape!”<br/><br/>Soon, an army that was ten times stronger than the Qianyuan Palace appeared in his line of sight.<br/><br/>It was not one army, but ten.<br/><br/>Each army was as strong as the Qianyuan Palace!<br/><br/>In the middle of a few armies, there were also space beasts that were at level six.<br/><br/>There was even one army with ten space beasts that were at level five.<br/><br/>Ten armies flew over, accompanied by a cold voice.<br/><br/>When Wang Xian saw this scene, his eyes narrowed slightly and a shocked expression appeared on his face.<br/><br/>“F * ck!”<br/><br/>He could not help but curse. His expression was a little ugly.<br/><br/>Ten armies of the palace!<br/><br/>The gods who believed in the universe actually sent out ten armies of a million to deal with him!<br/><br/>It was no problem for each palace to deal with a level six astral beast.<br/><br/>In addition to the trump cards of the million-strong army, they could even destroy a level six astral beast.<br/><br/>With this force, even if Wang Xian had the tai chi dragon plate, the five elements grinding mill, and four powerful soul treasures, he was still no match for them.<br/><br/>“He really sees me!”<br/><br/>When Wang Xian saw this, he didn’t hesitate at all. He turned around and fled into the distance!<br/><br/>“I see the Dragon King of the Dragon Palace. He wants to escape. Stop Him!”<br/><br/>“Kill him. He dares to kill the gods and believers of our universe. He’s courting death!”<br/><br/>“Spear of faith, Attack!”<br/><br/>At this moment, the level seven gods of the Faith Army of the ten palaces also saw Wang Xian.<br/><br/>Seeing that he wanted to escape immediately, a cold expression appeared on his face. He immediately shouted loudly.<br/><br/>At the center, a few hundred level seven gods waved their arms. A surge of faith power was injected directly into the arrow that was guiding Wang Xian.<br/><br/>Following that, the haircutter was like a long spear as he attacked Wang Xian at a terrifying speed!<br/><br/>The power of faith was invincible!<br/><br/>“Whoosh!”<br/><br/>“What a fast speed!”<br/><br/>Wang Xian sensed the speed of the spear of faith and his expression changed slightly.<br/><br/>He moved his body and the Five Elements Millstone released a five elements spear directly towards the spear of faith.<br/><br/>“Boom!”<br/><br/>A violent collision sound was heard and the two spears collapsed at the same time.<br/><br/>“The power of this faith spear is enough to kill a level six space beast!”<br/><br/>Wang Xian’s expression changed slightly when he saw the terrifying collision.<br/><br/>The opponent had come prepared. The power of just one strike was enough to withstand the full-force strike of the Five Elements Millstone.<br/><br/>I’m not their match.<br/><br/>He thought to himself. He immediately controlled the soul battleship and fled into the distance.<br/><br/>His speed was very fast. With the Five Elements Millstone and the Tai Chi Dragon Disc, he was much faster than the ten palaces’army.<br/><br/>“Eh? He was able to withstand the attack of the spear of faith in an instant. As expected of the army that was able to destroy the heaven origin palace. This Dragon King of the Dragon Palace is indeed not simple.”<br/><br/>When the gods of the ten palaces saw this scene, their expressions changed slightly.<br/><br/>“He wants to escape. We can’t let him escape. Chase after him!”<br/><br/>“Think of a way to stop him!”<br/><br/>When the group of level seven gods saw that Wang Xian wanted to escape, they hurriedly shouted out loud!<br/><br/>“Transfer of faith!”<br/><br/>“All of you attack and help me pin him down. I will go in front of him and pin down his strength!”<br/><br/>At the Army of a palace, a level seven God roared and his body began to turn illusory!<br/><br/>Below him, the Space Beast, which was the ruler of level six realm, also began to turn illusory slowly!<br/><br/>“Attack!”<br/><br/>When the other pantheon gods saw his figure gradually disappearing, they let out a loud roar!<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>The Space Beast began to roar as waves of terrifying and vast energy began to condense.<br/><br/>The other experts who believed in the Pantheon gods also immediately condensed powerful attacks and attacked Wang Xian.<br/><br/>However, the distance between them and Wang Xian was very far. Many of their attacks could not reach such a long distance.<br/><br/>Only five to six attacks were attacking Wang Xian!<br/><br/>When Wang Xian saw the power behind him, his eyes narrowed slightly!<br/><br/>“Roar! Roar! Roar!”<br/><br/>On the Five Elements Millstone and the Tai Chi Dragon Disk, the seven divine dragons also let out roars.<br/><br/>Defense, defense!<br/><br/>The Five Elements Millstone released a line of defense, and the Tai Chi Dragon disk spun. Behind the Five Elements Millstone’s defense, yin and Yang began to spin.<br/><br/>Boom<br/><br/>The Five Elements Millstone’s power was shattered, and the remaining power fell on the Tai Chi Dragon Disk.<br/><br/>The Tai Chi Dragon disk spun and slowly blocked it.<br/><br/>At the same time, a backlash force charged toward the attacking gods.<br/><br/>“Oh? Not Good, I can feel a great terror descending on me!”<br/><br/>“Oh no, what kind of strange attack is this? An unknown force is attacking us!”<br/><br/>Soon, the expressions of the dozens of rank 7 gods changed, and they roared in embarrassment!<br/><br/>“Pray, quickly pray for our faith and get rid of all negative things!”<br/><br/>One of the rank 7 gods roared.<br/><br/>Buzz! Buzz! Buzz<br/><br/>Buzz! Buzz! Buzz<br/><br/>The Pantheon and tens of millions of believers in the surrounding area immediately began to pray!<br/><br/>Waves of faith power entered their bodies to resist the strange backlash.<br/><br/>A huge amount of faith power entered his body. The backlash power in their bodies was instantly cleared!<br/><br/>“It’s enough!”<br/><br/>“Stay here for us!”<br/><br/>“Web of faith, Trap!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>At this moment, in front of Wang Xian, hundreds of level seven pantheon gods and a level six space beast suddenly appeared in front of him.<br/><br/>Hundreds of pantheon gods and level six space beasts immediately unleashed their strongest attacks.<br/><br/>“Huh?”<br/><br/>Seeing the Pantheon gods who suddenly appeared in front of him, Wang Xian’s expression froze slightly. He was filled with astonishment!\t\t\t\t\t\t</div>", "images": {}, "success": true}