{"id": 843, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073586.html", "title": "Chapter 3845 - 3845 3844 Escaped And Counterattacked", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3845 - 3845 3844 Escaped And Counterattacked</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3845 3844 escaped and counterattacked<br/><br/>A huge net covered Wang Xian.<br/><br/>Wang Xian looked at the huge net, and his eyes were shining.<br/><br/>At the back, the Tai Chi Dragon Plate and the five elements grinding mill were blocking the attack.<br/><br/>“Die!”<br/><br/>The gods in front looked at Wang Xian, and their eyes were shining coldly.<br/><br/>At this moment, the Dragon King of the Dragon Palace was completely restrained by them.<br/><br/>Once he was restrained, with their strength, they would be able to easily keep the Dragon King of the Dragon Palace Here!<br/><br/>Their eyes revealed a sinister and cold expression.<br/><br/>“Hehe, you want me to Die?”<br/><br/>When Wang Xian heard their words and saw their excited expressions, his eyes revealed a cold expression.<br/><br/>With a move of his palm, a soul spear appeared in his hand.<br/><br/>All the energy in his body surged into the soul spear and shot straight ahead.<br/><br/>The target was the space behemoth that dominated the sixth level.<br/><br/>At the same time, after the first soul spear was shot out, another soul spear appeared in his hand and met the huge net directly.<br/><br/>In addition, the soul battleship under him charged straight ahead!<br/><br/>In an instant, not only did Wang Xian not stop, he even sped up!<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>When the soul spear was hurled at the level six ruler-level Astral Beast.<br/><br/>The level six ruler-level astral beast immediately sensed the immense danger and rushed forward with a roar.<br/><br/>A surge of energy charged straight at the soul spear!<br/><br/>The other soul spear easily pierced through the web of faith and attacked the gods in the belief universe.<br/><br/>“Not good, this is a level 9 treasure!”<br/><br/>“It’s a soul weapon condensed from souls. Be careful, he still has a powerful trump card!”<br/><br/>When the Web of faith was pierced through, the gods in front of them who were trying to block it all changed their expressions and quickly tried to dodge!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>However, at this moment, the soul battleship was approaching at an extremely fast speed.<br/><br/>The distance between Wang Xian and them was very, very close!<br/><br/>He stared at the gods and moved his body!<br/><br/>Buzz! Buzz! Buzz<br/><br/>In the next second, four Netherspirit avatars appeared around him.<br/><br/>Each of the avatars was wearing a soul armor and held a soul spear in their hands.<br/><br/>These were the soul armors and soul spears that they had condensed.<br/><br/>Now, the Ghost Avatars possessed soul armors and soul spears that could dominate the level seven realm. This allowed their strength to approach the three level seven pantheon gods.<br/><br/>The four ghost avatars started to move instantly.<br/><br/>Wang Xian’s figure also started to move instantly.<br/><br/>His speed was extremely terrifying. When he unleashed his maximum speed, it was comparable to the speed of the level eight pantheon gods.<br/><br/>At the same time, with a thought, the two soul spears that were sent out instantly appeared in his hands.<br/><br/>He waved his hand again. One of them attacked the level six space beast while the other attacked the Pantheon!<br/><br/>The soul battleship charged towards the level six space beast!<br/><br/>After doing all this, Wang Xian locked onto a level seven pantheon and his figure disappeared instantly.<br/><br/>“Oh no, come and help us!”<br/><br/>“Quick, quick, he has too many trump cards in his hands. Come and help us!”<br/><br/>Terrified voices came from the Pantheon in front of them.<br/><br/>There were more than a hundred level seven pantheon and a level six astral beast.<br/><br/>This force was already very powerful!<br/><br/>However, their strength was not enough to deal with three soul attack treasures that were comparable to a level nine pantheon!<br/><br/>Boom! Boom! Boom<br/><br/>The Soul Spear attacked the hundreds of level seven pantheon. The power that was comparable to the level nine pantheon instantly caused the dozens of level seven pantheon to have no time to react.<br/><br/>The terrifying soul spear and the aftershocks instantly killed them with heavy injuries!<br/><br/>In addition, Wang Xian and his netherspirit avatar instantly arrived beside the five level seven pantheon.<br/><br/>The five level seven Pantheon’s expressions changed drastically and they immediately started to defend.<br/><br/>“Boom!”<br/><br/>“Ah Ah!”<br/><br/>“Save me!”<br/><br/>However, faced with the strength of Wang Xian and the rest, they were completely helpless in a one-on-one situation.<br/><br/>They were instantly killed!<br/><br/>“Roar Roar Roar!”<br/><br/>“Roar!”<br/><br/>From below, the soul spear attacked the level six astral beast once again. This time, there was an additional soul battleship!<br/><br/>Two attacks collided with the level six astral beast.<br/><br/>The level six astral beast let out a blood-curdling scream!<br/><br/>Wang Xian killed one of the level seven pantheon gods. With a wave of his arm, another soul spear appeared in his hand.<br/><br/>He shot it at the other level seven pantheon gods again!<br/><br/>To the level seven Pantheon Gods, an invincible force swept towards them!<br/><br/>“Save us!”<br/><br/>“Hurry up, save us!”<br/><br/>Seeing this scene, they roared towards the front with their eyes wide open.<br/><br/>They were no match for the Dragon King of the Dragon Palace.<br/><br/>“Hurry Up!”<br/><br/>“Attack!”<br/><br/>Behind them, the gods and believers of the other nine palaces quickly flew towards them.<br/><br/>“Five elements disc destruction!”<br/><br/>However, at this moment, the five elements millstone immediately unleashed its strongest attack.<br/><br/>An incomparably huge five elements magic disc was heading towards them.<br/><br/>On the Tai Chi Dragon Disc, two divine dragons of light and darkness were also heading towards the experts from the nine temples.<br/><br/>“Damn it, block it!”<br/><br/>The gods from the nine temples immediately roared.<br/><br/>Although they could completely suppress the tai chi dragon disc and the five elements millstone, they still needed to do some blocking.<br/><br/>“Ahhhh!”<br/><br/>However, just as they were fending off the attacks, dozens of level seven gods were killed by the soul spears on Wang Xian’s side!<br/><br/>“Run, run, run!”<br/><br/>When the remaining level seven gods saw this scene, their faces were filled with fear.<br/><br/>They quickly roared in fear and immediately landed on the space beast as they gave the order loudly.<br/><br/>“Roar, Roar, Roar!”<br/><br/>The space beast that was at the level six realm unleashed all of its energy and immediately fled to the side with dozens of level seven gods.<br/><br/>Wang Xian did not give chase. With the power of the soul battleship and the two soul spears, he could not destroy the space beast that was at the level six realm easily.<br/><br/>After all, the soul spears and the soul battleship were different from the Tai Chi Dragon Plate Five Elements Millstone.<br/><br/>The Tai Chi Dragon Disc’s five elements Millstone could unleash all of its strength without Wang Xian’s control.<br/><br/>The Soul Spear and the soul battleship required him to control them himself!<br/><br/>Wang Xian kept all the corpses and flew forward immediately.<br/><br/>Buzz! Buzz! Buzz<br/><br/>The Tai Chi Dragon Disc and the five elements millstone flew toward Wang Xian instantly.<br/><br/>Whoosh<br/><br/>In the next second, Wang Xian stood on the soul warship and flew into the distance rapidly.<br/><br/>His speed was much faster than the speed of the ten palaces army.<br/><br/>“Damn it!”<br/><br/>“Oh no, the Dragon King of the Dragon Palace is about to escape!”<br/><br/>“Continue the pursuit! Continue the pursuit!”<br/><br/>When the gods of the ten palaces saw this scene, they looked extremely embarrassed.<br/><br/>When the ten palaces joined hands, not only did they not leave the Dragon King of the Dragon Palace behind, but they were also killed by him.<br/><br/>This was simply a slap to their faces!\t\t\t\t\t\t</div>", "images": {}, "success": true}