{"id": 846, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073592.html", "title": "Chapter 3848 - 3848 The 3847 Terrifying Sacrifice", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3848 - 3848 The 3847 Terrifying Sacrifice</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3848 The 3847 terrifying sacrifice<br/><br/>“Hehe, as expected!”<br/><br/>Wang Xian flew forward. When he felt the terrifying attack coming from behind, his eyes lit up instantly.<br/><br/>His eyes lit up with joy. Without any hesitation, he waved his arm.<br/><br/>“Roar Roar Roar!”<br/><br/>In an instant, cursed dragons appeared behind Wang Xian one after another and went to receive the energy.<br/><br/>With the attack of five space beasts and 500 cursed dragons, there was a 100% chance that the curse could be killed!<br/><br/>Wang Xian was not sure about the rest of the attacks!<br/><br/>However, faced with this terrifying attack, Wang Xian released more than 20,000 cursed dragons.<br/><br/>The 20,000 cursed dragons roared and charged towards the streams of energy without hesitation.<br/><br/>“What is this?”<br/><br/>They saw the cursed dragons that were going up against their attacks.<br/><br/>The gods of the ten palaces were extremely astonished.<br/><br/>Boom! Boom! Boom<br/><br/>In the next moment, the cursed dragons were struck by the streams of energy and died instantly. They had no ability to resist at all!<br/><br/>However, after they cursed, streams of cursed energy surged towards them.<br/><br/>This was especially so for the five space beasts that were at the sixth level.<br/><br/>In order to avoid any accidents, Wang Xian had ordered 500 cursed dragons to kill them. This was already a lot.<br/><br/>According to his calculations, two to three hundred of them should be enough to kill them completely.<br/><br/>There were at least 500 to 600 gods at the seventh level and a large number of gods at the sixth level. They used the attack of their treasures to kill 20,000 cursed dragons instantly.<br/><br/>The energy continued to attack Wang Xian.<br/><br/>Wang Xian hurriedly tried to block it!<br/><br/>Boom! Boom! Boom<br/><br/>Waves of energy were blocked by Wang Xian. In the next moment, he turned around and stared at the million-strong army of the ten palaces. His eyes revealed a ghastly expression.<br/><br/>“You Want to kill me? Today, I will see who will kill who!”<br/><br/>He said with a ghastly expression. The Soul Spear appeared in his hand!<br/><br/>Next, he was ready for a big battle!<br/><br/>“You guys from the nine-origin universe actually dared to kill the gods that we believe in. Today is the day you die. After you destroy us, we will also destroy your Dragon Palace.”<br/><br/>When a level seven God from the decree palace heard Wang Xian’s words, his eyes were filled with sharp killing intent.<br/><br/>Their decree palace had suffered heavy losses at the hands of the Dragon King of the Dragon Palace!<br/><br/>“Hehehe, then let me see who will be the one killing who today!”<br/><br/>Wang Xian sneered as he stared at the five space beasts. The corners of his mouth curled up slightly.<br/><br/>“Awoooo!”<br/><br/>“Awoooo!”<br/><br/>At this moment, the curse began to descend. A large amount of terrifying black energy flowed out from the mouths of the five space beasts.<br/><br/>A strange black energy coiled around the five level six space beasts.<br/><br/>This strange black energy was eroding their life force.<br/><br/>“Eh? What’s going on?”<br/><br/>The sudden change caused the expressions of the level 7 gods on the five Space Beasts to change.<br/><br/>“Not good, I feel an invasion of energy. What a terrifying energy!”<br/><br/>“I can feel it too. It’s a curse. We’ve suffered a terrifying curse!”<br/><br/>At this moment, the hearts of the Tier 7 and tier 6 gods that had attacked earlier suddenly pounded.<br/><br/>They could feel a terrifying energy gradually enveloping their bodies, dissipating their life force.<br/><br/>This energy was terrifying and strange!<br/><br/>“It’s a curse. It should be related to the 20,000 creatures. It’s a curse. Quick, move the curse!”<br/><br/>Half of the seventh-level gods of the ten palaces were covered by the curse. Black curse power surged out from their bodies.<br/><br/>The curse was quickly wiping out their vitality.<br/><br/>This caused their expressions to change drastically.<br/><br/>“Faith, shift the curse!”<br/><br/>The eyes of the seventh-level and sixth-level gods who were cursed focused. They roared loudly.<br/><br/>“Buzz Buzz Buzz!”<br/><br/>“Buzz Buzz Buzz!”<br/><br/>Buzz Buzz Buzz<br/><br/>The next second, Wang Xian saw the scene of countless believers worshipping in the sky above them.<br/><br/>The entire void was filled with the shadows of the believers.<br/><br/>At this moment, wisps of black curse power were transferred to the shadows of the believers above them from the bodies of the cursed gods.<br/><br/>“Ahhhh!”<br/><br/>“Ahhhh!”<br/><br/>Following that, miserable screams were heard. One could see the illusory figures of the believers showing pained expressions. Slowly, the illusory figures belonging to them collapsed.<br/><br/>This represented the death of a believer.<br/><br/>A large number of believers were enveloped by the black curse power and died quickly!<br/><br/>“Huh?”<br/><br/>When Wang Xian saw this scene, his gaze focused slightly.<br/><br/>They actually transferred the curse on their own believers to help them bear the power of the curse.<br/><br/>However, they didn’t show any signs of abnormality.<br/><br/>The transfer of the curse astonished Wang Xian!<br/><br/>“Qingyue, make your move!”<br/><br/>Wang Xian saw that the situation was continuing. With a low growl, Lan qingyue instantly appeared beside him!<br/><br/>“Woo Woo Woo!”<br/><br/>“Woo Woo Woo Woo!”<br/><br/>Following that, a black hole appeared behind Lan Qingyue. From the black hole, Xiao Lan and the rest flew out!<br/><br/>“Whoosh! Whoosh!”<br/><br/>Without any hesitation, Wang Xian threw out the soul spear in his hand!<br/><br/>The five elements grinding mill and the tai chi dragon disc directly attacked them.<br/><br/>Xiao Lan, Xiao Bai, and the rest also let out a roar and directly attacked the army of the ten palaces who believed in the universe.<br/><br/>Roar! Roar! Roar<br/><br/>At the same time, the auras of the five Cosmic Beasts who were at the sixth level of the ten palaces were getting weaker and weaker. They were slowly dying.<br/><br/>This caused the ten palaces to instantly lose five of their top-notch combat strength.<br/><br/>On the other hand, Wang Xian had increased the combat strength of LAN Qingyue and the rest by four top-notch combat strength.<br/><br/>Under this situation, the strength of Wang Xian and the rest had already surpassed the million-strong army of the ten palaces.<br/><br/>In addition, among the million-strong army of the ten palaces, half of the level-seven and level-six gods were resisting the power of the curse.<br/><br/>“Oh no, damn it, we’ve been ambushed!”<br/><br/>“That’s the ancient god of the Dragon Palace, the kun-rearing master. They are actually hiding here. All of our space beasts have died!”<br/><br/>When the gods of the ten palaces saw this scene, their expressions changed drastically as they roared loudly.<br/><br/>Originally, they were in an absolute situation of suppression. However, they didn’t expect the situation to turn out like this in the blink of an eye!<br/><br/>All the gods revealed ugly expressions on their faces.<br/><br/>“We need to remove the curse power in our bodies. We can’t make a move for a short period of time.”<br/><br/>The gods who were cursed also roared with extremely ugly expressions.<br/><br/>They knew that they were in trouble!<br/><br/>They didn’t know why they were suddenly struck by such a strange and terrifying curse, and they needed to resist it now.<br/><br/>And if they resisted, then the true treasures they believed in the universe wouldn’t be able to be controlled and used.<br/><br/>This was a huge crisis for them!<br/><br/>The gods who believed in the universe looked extremely grave.<br/><br/>“Sacrifice! Sacrifice! We’ll definitely destroy them today!”<br/><br/>Soon, a Level 7 god from the Decree Palace roared with blood-red eyes.<br/><br/>They still had a trump card!\t\t\t\t\t\t</div>", "images": {}, "success": true}