{"id": 847, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073594.html", "title": "Chapter 3849 - 3849 Under The 3848 Terrifying Sacrifice", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3849 - 3849 Under The 3848 Terrifying Sacrifice</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3849 Under the 3848 terrifying sacrifice<br/><br/>Sacrifice!<br/><br/>When the one million followers of the ten palaces heard this sentence, their bodies trembled violently.<br/><br/>The belief universe had a big killer weapon, and that was sacrifice!<br/><br/>Sacrificing their own followers would cause the gods to burst out with terrifying strength.<br/><br/>Similarly, if they sacrificed other followers, they would also be able to achieve a terrifying amplification!<br/><br/>“Every Legion, sacrifice one-fifth of their strength to block the Dragon King and the others. Quick!”<br/><br/>A rank 7 god from the decree palace shouted!<br/><br/>“Sacrifice!”<br/><br/>“Sacrifice!”<br/><br/>The experts from the other palaces roared without any hesitation.<br/><br/>With a wave of their arms, a large number of believers behind them were enveloped.<br/><br/>The believers who were enveloped by the power of faith were filled with despair.<br/><br/>However, they did not hesitate at all. They sat cross-legged and the heart of faith slowly flew above their heads.<br/><br/>To the experts who believed in the universe, the heart of faith was their lifeblood and also their source of power.<br/><br/>However, their sacrifice could cause their heart of faith to erupt with extreme energy.<br/><br/>It could cause them to burst out with pure and terrifying power of faith.<br/><br/>After the heart of faith was suspended in the air, a level seven pantheon flew directly to the sky.<br/><br/>In the sky above him, the illusory images of the believers appeared one after another. This illusory image began to collapse slowly.<br/><br/>The believers were sacrificing. The powerful believers around them were also sacrificing.<br/><br/>They were sacrificing their own lives to obtain the most powerful power of faith!<br/><br/>“Eh?”<br/><br/>Wang Xian was astonished when he saw this scene!<br/><br/>His eyes focused and revealed a look of astonishment.<br/><br/>“Attack!”<br/><br/>Wang Xian shouted out in a hurry.<br/><br/>The soul spear in his hand shot forward.<br/><br/>Two Soul Spears covered the area where the two level seven gods were.<br/><br/>The Five Elements Millstone and the Tai Chi Dragon Plate attacked the gods who had sacrificed themselves.<br/><br/>An incomparably powerful force covered them.<br/><br/>“Block this attack and buy us some time!”<br/><br/>The group of rank 7 gods roared loudly when they saw this terrifying attack!<br/><br/>“Boom! Boom! Boom! Boom!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>The tens of millions of gods and believers of the ten palaces all released powerful attacks and met it head-on.<br/><br/>However, the attacks from the soul spear and the Tai Chi Dragon Plate were not something that they could fight against together.<br/><br/>Not to mention Xiao Lan, Xiao Bai, and Lan Qingyue.<br/><br/>The terrifying attack came crashing down.<br/><br/>“PFFT! PFFT! PFFT!”<br/><br/>“PFFT! PFFT! PFFT!”<br/><br/>In an instant, at least a million worshippers and believers were engulfed by the terrifying energy wave and died instantly.<br/><br/>“Continue!”<br/><br/>When Wang Xian saw this scene, he moved his body and the soul battleship beneath him charged forward.<br/><br/>Lan Qingyue and the rest launched the second round of attacks.<br/><br/>“Faith, Barrier!”<br/><br/>At this moment, a level seven God who was concentrated by the sacrificial energy moved his palm and a staff of faith appeared in his hand.<br/><br/>This staff was formed from the pure power of faith.<br/><br/>With a wave of his arm, a barrier appeared in front of the 1,000,000 troops of the 10 palaces.<br/><br/>“Faith, Rain!”<br/><br/>Another rank 7 god that was blessed roared.<br/><br/>“Hua la la!”<br/><br/>In an instant, the rain formed by faith dripped down from the sky.<br/><br/>This rain of faith contained a special energy.<br/><br/>When the rain fell on the bodies of the gods and disciples of the Faith Universe, it had a strengthening effect. When it fell on other living plants, it had a terrifying offensive effect.<br/><br/>“Faith Destruction Palm!”<br/><br/>Another voice sounded and attacked little blue.<br/><br/>“Faith Heart Piercing Spear!”<br/><br/>The level 7 gods that were strengthened exploded with a terrifying power.<br/><br/>This power was not weaker than the level nine gods.<br/><br/>This was the power of sacrifice.<br/><br/>“What a powerful attack!”<br/><br/>Wang Xian’s expression changed slightly when he saw this scene.<br/><br/>The Soul Spear’s attack landed on the barrier and was completely blocked.<br/><br/>The powerful destructive palm of faith landed on Xiao Lan’s body and caused her to fly backward.<br/><br/>“However, the price to pay is also very high.”<br/><br/>Wang Xian mumbled as he watched.<br/><br/>The strength that they displayed was very terrifying. However, it was indeed a short-term improvement based on the strength of countless believers and the lives of the 200,000 gods and believers in each palace.<br/><br/>What was sacrificed was not just the strength of the believers. The level seven gods would not live for long either.<br/><br/>Since all his believers had died, he would drop down to the realm of the Pantheon. He might even die directly.<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>“Dragon King of the Dragon Palace, you made us pay such a huge price. We will not let you off. We will never let you off!”<br/><br/>A level seven pantheon that was sacrificed was filled with violent killing intent as he shouted sternly!<br/><br/>“Let’s Retreat!”<br/><br/>Wang Xian looked at their terrifying strength and spoke to Lan Qingyue directly.<br/><br/>He didn’t intend to continue fighting with them!<br/><br/>The sacrificial power of the gods of the universe was temporary and couldn’t be sustained for long.<br/><br/>In that case, he might as well leave and avoid their attacks!<br/><br/>Furthermore, the cursed level seven gods had been gradually transferred by them and were gradually recovering.<br/><br/>Once they had recovered, they would be able to unleash their terrifying strength with the help of the ultimate treasure in their hands!<br/><br/>Wang Xian was prepared to fight and retreat.<br/><br/>He would continue to kill them after the energy from their sacrifice had completely disappeared.<br/><br/>At this moment, they were no longer a match for the gods.<br/><br/>“Alright!”<br/><br/>Lan qingyue nodded and immediately gave the order to retreat to Xiao Lan’s small house!<br/><br/>Wang Xian did not hesitate and retreated immediately!<br/><br/>“Damn it, stay behind for us!”<br/><br/>The ten gods who were sacrificed roared ferociously. They immediately chased after them.<br/><br/>Boom! Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>The five elements grinding mill and the Tai Chi Dragon Plate immediately formed a defense.<br/><br/>They immediately fled into the distance!<br/><br/>“Ahhhh! Die! Die! Die! Die! Die!”<br/><br/>The level seven gods who had sacrificed themselves unleashed attacks one after another as if they didn’t care about their lives. They attacked Wang Xian and the rest.<br/><br/>However, their attacks were all blocked by the Five Elements Millstone, the Tai Chi Dragon Plate, and Lan Qingyue.<br/><br/>In the blink of an eye, Wang Xian had pulled a huge distance away from them!<br/><br/>“The curse on our bodies has been shifted. We Can’t let the Dragon King escape. Chase after him!”<br/><br/>At this moment, the gods who had gotten rid of their curses roared and began to chase after him.<br/><br/>After the curse was lifted, they used their most precious treasures to unleash a burst of power that was sufficient to fight against Wang Xian and the rest.<br/><br/>After the sacrifice, even if the five sixth level Astral Beasts died, they were still much stronger than before.<br/><br/>However, this strength could not be maintained for long.<br/><br/>Once the power of the sacrifice began to disappear, they would not be a match for the Dragon King!\t\t\t\t\t\t</div>", "images": {}, "success": true}