{"id": 848, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073596.html", "title": "Chapter 3850 - 3850 3849 Fragment Of Heaven’S Origin Creation", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3850 - 3850 3849 Fragment Of Heaven’S Origin Creation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3850 3849 fragment of Heaven’s origin creation<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>Wang Xian began to flee. The strength of his belief in the gods of the universe had far exceeded his expectations.<br/><br/>Out of the 20,000 cursed dragons, only five of them, which were at level six, were killed.<br/><br/>Even a level seven or even level six god was not killed by the curse.<br/><br/>The powerful transfer of the curse had completely exceeded Wang Xian’s expectations.<br/><br/>“Every universe can not be underestimated. They all have their own strengths.”<br/><br/>Wang Xian mumbled.<br/><br/>However, this time, it was not too much of a loss. After the five level six cosmic beasts were killed, his crisis would be resolved.<br/><br/>Although they were still chasing after him, he was no longer afraid!<br/><br/>Wang Xian was fleeing at a terrifying speed!<br/><br/>“Go, Go!”<br/><br/>“Damn it, we’ve suffered heavy losses again this time. If we can’t kill the Dragon King, we’ll suffer a huge loss!”<br/><br/>“Quick, Quick!”<br/><br/>At the back, a group of the ten palaces Army who believed in the universe was chasing after them. Their expressions were abnormally ugly.<br/><br/>However, in the beginning, a part of them relied on the speed of a level six astral beast. Now that the Astral Beast was killed, it was too difficult for them to catch up to Wang Xian!<br/><br/>The gods also realized this point.<br/><br/>However, if they were to stop and not pursue, their losses this time would be too great!<br/><br/>Five level six Astral Beasts!<br/><br/>There were also a large number of gods and believers who died due to the sacrifice.<br/><br/>It could be said that their losses this time were very great.<br/><br/>However, such a huge loss was unable to keep the Dragon King of the Dragon Palace.<br/><br/>This? ? ?<br/><br/>One had to know that they had used the power of the ten palaces this time.<br/><br/>They believed in the universe, and the twenty-four palaces used the power of the ten palaces, which was almost half of their power.<br/><br/>And the result was so tragic.<br/><br/>This was a huge loss of face.<br/><br/>It wasn’t just a matter of face. Once the Dragon Palace Dragon King escaped, how could they resist when the Dragon Palace Dragon King hunted the gods they believed in the universe in the future?<br/><br/>They couldn’t always gather together?<br/><br/>If the Dragon Palace Dragon King couldn’t deal with them alone, how could they destroy the entire nine-origin universe?<br/><br/>How could they chase the nine-origin universe out of the Space Beasts?<br/><br/>They chased after him and passed the news over at the same time.<br/><br/>They knew that they had failed.<br/><br/>The power of the ten palaces wasn’t enough to kill the Dragon Palace Dragon King.<br/><br/>…<br/><br/>“What?”<br/><br/>At the same time, the elders of the twenty-four palaces in the belief universe received this message and their expressions turned ugly.<br/><br/>They looked at each other and their expressions turned ugly.<br/><br/>“What’s Wrong?”<br/><br/>The elders of the twenty-four palaces who were not involved looked over and asked curiously.<br/><br/>“Our ten palaces have failed to join forces. The Dragon King of the Dragon Palace killed five level 6 space beasts. In addition, we had no choice but to use the power of sacrifice. Now that the Dragon King of the Dragon Palace has escaped, it’s very difficult to kill him.”<br/><br/>The elder of the Decree Palace said with a gloomy face.<br/><br/>“What? The combined power of the ten palaces was defeated by the Dragon King of the Dragon Palace, and your ten palaces suffered heavy losses?”<br/><br/>An elder of a palace said in shock when he heard this.<br/><br/>The eyes of the surrounding elders of the various palaces also focused, and their faces were filled with solemnity.<br/><br/>They knew how powerful the combined forces of the ten palaces were.<br/><br/>However, not only did they let the Dragon King of the Dragon Palace escape, but they also let the Dragon King of the Dragon Palace cause them to suffer such heavy losses?<br/><br/>This was simply unimaginable.<br/><br/>Were all the experts of the nine-origin universe this terrifying?<br/><br/>“That Dragon Palace isn’t simple. It’s not without reason that he was able to make two peak races bow their heads from a high-level race.”<br/><br/>The elder of the Heavenly Palace said with a gloomy face.<br/><br/>“The strength displayed by this Dragon Palace Dragon King is even stronger than the other peak races in the nine-origin universe. Damn it, we have to destroy him. Otherwise, all our plans will be useless.”<br/><br/>“Moreover, we must always be on guard against the Dragon King’s attack.”<br/><br/>An elder of a palace looked around with a gloomy face.<br/><br/>The other elders of the 24 palaces also nodded.<br/><br/>The Dragon King of the Dragon Palace had to die. Otherwise, they would be in big trouble!<br/><br/>“The strength of the 10 palaces didn’t kill him. Are we going to let the 24 palaces attack together?”<br/><br/>An elder frowned and couldn’t help but say.<br/><br/>Gathering the power of the twenty-four palaces to attack a dragon king of the Dragon Palace was a bit absurd in their eyes!<br/><br/>“That Dragon King is running away now. If we chase after him with a large number of great beings, he might escape to the nine-origin universe. When that time comes, he and the peak races of the nine-origin universe will join forces, and it will still be a big problem for us. We must use other methods to get rid of him as soon as possible.”<br/><br/>The elder from the Decree Palace said, he looked toward one direction. “Nine Star Palace and your seven palaces, didn’t you once fight over a fragment of a Supreme Treasure?”? “That fragment has great destructive power. If you send people to gather all the fragments together, they should be able to kill a peak ruler, right?”<br/><br/>“Star field fragment?”<br/><br/>The elders of nine star palace frowned slightly. “The star field fragment is with our palace master. We have one fragment, and they have seven.”<br/><br/>“At this time, we have to put aside our differences and deal with the Dragon King First.”<br/><br/>An elder of the gods looked at them and reminded them.<br/><br/>“Yes, the star field fragment has a terrifying attack power. If we can gather it, it will be a destiny true treasure. We have one fragment here, and your seven palaces also have seven. With seven of them working together, killing a peak ruler shouldn’t be a problem.”<br/><br/>The elders of nine star palaces hesitated for a moment, then looked at the elders of the other seven palaces and said.<br/><br/>They had once fought an eight palace war over a treasure.<br/><br/>At that time, many of the level seven and level eight gods had died.<br/><br/>Thus, the eight palaces had always been in a state of open and hidden strife.<br/><br/>But now, facing the starry universe and facing the same enemy, they could still work together.<br/><br/>“Okay!”<br/><br/>The elders of the other seven palaces hesitated for a moment and nodded.<br/><br/>They had fought and killed each other because of this true treasure.<br/><br/>But at this time, they could also join forces to fight the Dragon King of the Dragon Palace.<br/><br/>“If that’s the case, then send powerful warriors over as soon as possible and kill the Dragon King of the Dragon Palace as soon as possible.”<br/><br/>The elders of the Decree Palace said.<br/><br/>The elders of the nine stars palace nodded.<br/><br/>With the star field fragment and the group of experts, killing the Dragon King of the Dragon Palace wouldn’t be a big problem.<br/><br/>The star field fragment was an existence of a supreme treasure of creation.<br/><br/>And a Supreme Treasure of creation was the Heavenly Yuan creation of the nine-origin universe.<br/><br/>Such a supreme treasure was a very powerful existence in every universe.<br/><br/>Even a fragment could cause a fight among the peak races.<br/><br/>Even at the expense of sacrifice.\t\t\t\t\t\t</div>", "images": {}, "success": true}