{"id": 845, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073590.html", "title": "Chapter 3847 - 3847 3846 Escaped And Counter-Attacked", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3847 - 3847 3846 Escaped And Counter-Attacked</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3847 3846 escaped and counter-attacked<br/><br/>“Back then, when I used the cursed dragons to kill a level seven Astral Beast, 2,000 cursed dragons killed a level seven Astral Beast.”<br/><br/>Wang Xian mumbled as he pondered in his heart.<br/><br/>In essence, the level seven pantheon was on the same level as the level seven Astral Beast!<br/><br/>Due to the suppression of the astral universe, the level seven pantheon was much weaker.<br/><br/>However, the power of the curse was directed at the physical body.<br/><br/>Wang Xian was not sure how many cursed dragons he would need to kill a level seven God.<br/><br/>If he needed too many, it would not be worth it.<br/><br/>However, Wang Xian estimated that he would not need 2,000 cursed dragons to kill a level seven God.<br/><br/>After all, to resist the power of the curse, he needed both his physical body and energy to resist the power of the curse at the same time.<br/><br/>Although the physical body of the level seven gods did not change, their energy was greatly suppressed.<br/><br/>“Let’s give it a try. At most, these cursed dragons will take tens of millions of years to recover. After all, the cursed dragons of the Dragon Palace are useless for the time being!”<br/><br/>Wang Xian mumbled.<br/><br/>Moreover, this time, the main force that Wang Xian used the cursed dragons to deal with was not the level seven gods, but the space behemoths that ruled the level six realm.<br/><br/>Currently, the powerhouses from the ten palaces had five space beasts at the level six realm.<br/><br/>This was one of their greatest combat strength.<br/><br/>He only needed to use the cursed dragon to kill these five space beasts that were at the level six realm. Then, he would be able to fight head-on with the ten palaces!<br/><br/>As he was thinking, Wang Xian was considering if he should call Lan Qingyue and the rest over.<br/><br/>“I think it’s better to call them over. If we can destroy the tens of millions of legions of the ten palaces, it would be extremely terrifying for the improvement of the Dragon Palace!”<br/><br/>As Wang Xian spoke, he asked an lie to bring Lan qingyue over.<br/><br/>Lan Qingyue was not involved in the war against the belief universe at the moment. She was currently searching for resources and treasures.<br/><br/>After receiving Wang Xian’s message, she immediately asked an lie to bring her over!<br/><br/>“Xiao Xian!”<br/><br/>Lan Qingyue looked at Wang Xian with a smile on her face!<br/><br/>“Qingyue, come with me to deal with the ten legions of the belief universe. Get Xiao Lan and the rest to leave this place first. When the battle breaks out, immediately summon them over!”<br/><br/>Wang Xian instructed Lan Qingyue.<br/><br/>“Alright, Xiao Xian.”<br/><br/>Lan qingyue nodded. Then, she looked at the 20,000 cursed dragons around her in surprise. “Xiao Xian, is the opponent very strong?”<br/><br/>“Very strong. There are 24 temples in the belief universe. Not long ago, I destroyed a million-strong army from one temple. Now, there are 10 million-strong armies from ten temples chasing after me. Each temple has combat strength comparable to Xiao Lan. In addition, each temple has more than 100 rank seven pantheon gods.”<br/><br/>Wang Xian said with a smile.<br/><br/>“Is the belief universe so strong? The strength of these 10 temples is comparable to the strength of our nine-origin universe, right?”<br/><br/>Lan Qingyue’s face was filled with astonishment!<br/><br/>“It shouldn’t be that strong. The peak races of our nine-origin universe should still be hiding their strength. Moreover, after tens of millions of years, they should have also experienced a huge improvement.”<br/><br/>Wang Xian guessed.<br/><br/>At that time, they had just entered the starry universe not long ago when Wang Xian had a huge battle with the Phoenix race of the angel race.<br/><br/>At that time, they were able to bring out a combat strength that was comparable to the level eight overlord realm.<br/><br/>If Lan Qingyue and the other two Kun beasts had not displayed their terrifying strength, they might not have lowered their heads.<br/><br/>Now that tens of millions of years had passed, the peak races should have prepared more and done more!<br/><br/>Lan qingyue nodded.<br/><br/>“However, I feel that the number of gods who believe in the universe should be much more than the rulers of our nine-origin universe.”<br/><br/>Wang Xian added another sentence.<br/><br/>This time, the number of gods who were chasing after him had reached 800,000.<br/><br/>This number was absolutely terrifying!<br/><br/>“Xiao Xian, will the other party chase after us? Do We need to wait here?”<br/><br/>Lan Qingyue asked.<br/><br/>“Yes, just wait here. Don’t come out for now and hide yourself!”<br/><br/>Wang Xian nodded.<br/><br/>Lan qingyue nodded.<br/><br/>Following that, she hid herself in the life planet, completely concealing her aura!<br/><br/>At the same time, a group of cursed dragons gathered around him!<br/><br/>Time passed day by day.<br/><br/>“Did you find him? That Dragon King actually stopped!”<br/><br/>Ten days later, at the back, the eyes of the ten legion gods of the belief universe lit up when they saw the direction guided by the power of belief.<br/><br/>“The Dragon King must be hiding. Does he think we can’t lock on to him?”<br/><br/>A rank seven god of the palace said excitedly, his eyes shining!<br/><br/>“The Dragon King suddenly stopped. We have to be careful. He looks very cunning!”<br/><br/>A rank seven god of the decree palace hesitated and reminded.<br/><br/>“No matter what, since he’s stopped, we have to act. We’ve already investigated this domain, and there’s no danger. We’ll immediately surround him and completely destroy him!”<br/><br/>The Gods of faith at the side spoke up!<br/><br/>Since they were going to lock onto the Dragon King, they couldn’t stop just because of some misgivings.<br/><br/>Moreover, they had already figured out the Dragon King’s strength!<br/><br/>“Let’s do it. Even if he still has a trump card, we can still deal with him!”<br/><br/>A rank seven pantheon said!<br/><br/>The strength of their ten palaces could be compared to fifteen or sixteen rank nine pantheon.<br/><br/>And the strength that the Dragon King displayed was only comparable to seven or eight rank nine pantheon.<br/><br/>Under such circumstances, they did not believe that the Dragon King of the Dragon Palace could double his strength!<br/><br/>“Five legions, attack from the left. We will attack from the right. We will trap him directly!”<br/><br/>The level seven pantheon gods of the Heaven Imperial Palace spoke to them!<br/><br/>The ten pantheon gods nodded. They moved and immediately surrounded Wang Xian.<br/><br/>“They are here!”<br/><br/>Not long after, Wang Xian faintly sensed the arrival of the army of the gods from the belief universe.<br/><br/>A smile appeared on his face!<br/><br/>Wang Xian did not hesitate at all. He waved his arm and placed the cursed dragon and Lan Qingyue in the mother nest. Then, he moved and fled straight ahead!<br/><br/>He knew that the army of the ten palaces from the belief universe wanted to surround and attack him.<br/><br/>Therefore, he was prepared to flee ahead and let the high-end combat strength of the belief universe chase after him.<br/><br/>This was especially so for the five space beasts that were at the level six of the Dominator realm.<br/><br/>“He wants to escape and chase after him. This time, I will definitely leave him here!”<br/><br/>“Roar Roar Roar!”<br/><br/>The gods of the belief universe sensed that Wang Xian had started to escape and immediately roared loudly!<br/><br/>Their bodies moved and immediately increased their speed.<br/><br/>The five space beasts at the level six of the Dominator realm roared and also increased their speed. They were at the front.<br/><br/>“Hold him back!”<br/><br/>A level seven God looked at Wang Xian and roared loudly!<br/><br/>“Roar!”<br/><br/>“Roar!”<br/><br/>The five level six space beasts immediately attacked.<br/><br/>At the same time, some of the gods began to use their treasures to form waves of terrifying energy!\t\t\t\t\t\t</div>", "images": {}, "success": true}