{"id": 857, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073614.html", "title": "Chapter 3859 - Chapter 3859: 38,583,000,000 Years Later", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3859 - Chapter 3859: 38,583,000,000 Years Later</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3859: 38,583,000,000 years later<br/><br/>Translator: 549690339<br/><br/>The eight level seven gods were not as lucky as Wang Xian.<br/><br/>They were attacked by a crystal creature.<br/><br/>The strength of this crystal creature was about the same as the crystal creature that Wang Xian had dealt with back then!<br/><br/>With the strength of the eight level seven gods and the starfield fragment in their hands, they were able to kill it in an extremely short period of time.<br/><br/>“What kind of creature is this? Isn’t there only a Space Beast in the Universe?<br/><br/>How can there be such a creature? And it’s so powerful?”<br/><br/>After the eight level 7 gods killed it, they looked at the corpses that were suppressed by the Starfield fragment and let out a sigh of relief.<br/><br/>The battle just now had shocked them a little about the crystal creature’s speed.<br/><br/>Its strange speed was like teleportation.<br/><br/>It could even enter the crystals and disappear.<br/><br/>If they did not have the starfield fragment, it would be very difficult to kill it.<br/><br/>“If this crystal creature was stronger, the starfield fragment would not be able to kill it. ”<br/><br/>One of the tier 7 gods said with a serious expression.<br/><br/>Even if they had dealt with this trouble,.<br/><br/>This was still the first creature they had encountered, and it was already so powerful.<br/><br/>Was there an even stronger existence inside?<br/><br/>The other seven gods also nodded with grave expressions.<br/><br/>“Let’s go. Be careful from now on.”<br/><br/>One of the tier 7 gods said.<br/><br/>The eight of them continued to walk forward.<br/><br/>However, this time, they became even more vigilant.<br/><br/>Their speed had also been reduced by several levels.<br/><br/>“This won’t do. The faith tracking is about to disappear! ”<br/><br/>Half a month later, one of the Tier 7 gods raised his head to look at the tracking energy in the sky and spoke.<br/><br/>The other seven gods also revealed helpless expressions.<br/><br/>The faith tracking energy had already been used up.<br/><br/>If they wanted to continue tracking, they had to use it again.<br/><br/>However, this tracking ability wasn ‘t something they could succeed with just a few of them.<br/><br/>This chasing ability required a huge amount of faith power.<br/><br/>It required at least a few million legions to successfully use it.<br/><br/>But now, the legions that they believed in the universe couldn’t step into this ocean.<br/><br/>Because of the star chain, they couldn’t leave this place.<br/><br/>“Let’s stick to our original plan. Even if we don’t move, we’ll still have to waste time here. ”<br/><br/>One of the gods said.<br/><br/>This was also the order of the elders of the 24 palaces in the universe.<br/><br/>(‘We can’t waste time either. Let’s slowly search here.”<br/><br/>One of the gods looked at them.<br/><br/>The other seven nodded and continued to fly in the direction of the faith tracking.<br/><br/>However, without the guidance of the faith tracking, it would be thousands of times more difficult to find the Dragon King of the Dragon Palace.<br/><br/>The celestial chain, the ultimate treasure of the Heaven’s origin destiny, was too terrifying!<br/><br/>Even if it was a fragment of the Heaven’s origin destiny.<br/><br/>Time passed little by little.<br/><br/>Wang Xian told Lan Qingyue about the situation here.<br/><br/>He asked Lan Qingyue not to come here for the time being. Instead, she would bring Xiao Lan and the rest to continue their advancement.<br/><br/>When Xiao Lan and the rest had broken through, she would come here to save him.<br/><br/>Then, she would destroy the eight level seven pantheon gods.<br/><br/>After Lan Qingyue received the news, she nodded her head heavily and immediately led Xiao Lan and the rest to search for resources and treasures to advance.<br/><br/>Ten million years passed in the blink of an eye.<br/><br/>During these ten million years, Wang Xian successfully nurtured another soul item.<br/><br/>The soul spear that was destroyed by the fragments of the Starfield was also replaced.<br/><br/>During these ten million years, the eight gods did not pursue him.<br/><br/>Halfway through, Wang Xian tried to get an lie to bring him back, but he still failed.<br/><br/>This meant that he was still in this blockade.<br/><br/>Wang Xian guessed that this blockade was not unsolvable.<br/><br/>A powerful force could break this blockade directly.<br/><br/>However, he did not have the power at the moment, so he could only wait.<br/><br/>During these tens of millions of years, the Dragon Palace was developing at a terrifying speed.<br/><br/>After obtaining the million-strong army that Wang Xian brought back for an lie and the heart of faith, the improvement of the disciples of the Dragon Palace was almost without any shackles.<br/><br/>There were over 80,000 gods in the million-strong army.<br/><br/>There were over 100 rank seven gods.<br/><br/>This made the improvement of the Dragon Palace extremely terrifying. In tens of millions of years, there were 200 Dragon Palace powerhouses who were at the level seven realm.<br/><br/>However, all of them were charming dragon species.<br/><br/>There were also over 50,000 powerhouses at the level of the ruler. This was even before the heart of faith was exhausted.<br/><br/>The improvement of the Dragon Palace was absolutely terrifying.<br/><br/>In the past 10 million years, the war between the belief universe and the nine-origin universe was getting more and more intense.<br/><br/>Especially a few million years ago, the army of belief from the belief universe arrived. For a time, the nine-origin universe was in a great crisis.<br/><br/>At this time, the peak races also unleashed their powerful trump cards and strength.<br/><br/>Because of Wang Xian, only the 13 palaces of the 24 palaces had the power to clash with the peak races of the nine-origin universe.<br/><br/>This also prevented the experts of the nine-origin universe from being defeated.<br/><br/>However, the battle was not too intense.<br/><br/>All the plans of the 24 palaces were disrupted by Wang Xian.<br/><br/>If not for Wang Xian, the 24 palaces would have destroyed the nine-origin universe long ago!<br/><br/>This also gave the nine-origin universe a chance to catch its breath.<br/><br/>The Dragon Palace did not participate in this battle.<br/><br/>Wang Xian ordered all the disciples of the Dragon Palace to focus on improving their strength.<br/><br/>This was also because the Dragon Palace did not have top-notch combat strength at the moment.<br/><br/>Lan Qingyue and Xiao Lan were working hard to improve.<br/><br/>He was trapped here.<br/><br/>This also meant that the Dragon Palace did not have the combat strength of a ruler at level eight.<br/><br/>Neither did they have the combat strength of a ruler at level nine.<br/><br/>Secondly, the Dragon Palace did not lack the heart of faith at the moment.<br/><br/>If they had the time to fight, they might as well go to the depths of the starry universe and search for some treasures.<br/><br/>Furthermore, Wang Xian had destroyed the million-strong army of the Heaven Origin Palace in the universe of faith.<br/><br/>In terms of combat results, the Dragon Palace had killed the most gods of faith in the entire nine-origin universe.<br/><br/>Moreover, if he had not delayed the power of the belief universe, the nine-origin universe would have been defeated!<br/><br/>Time continued to pass.<br/><br/>In the blink of an eye, another ten million years had passed. Wang Xian tried again to leave this place, but he still did not succeed.<br/><br/>Thirty million years passed very quickly.<br/><br/>Wang Xian wandered around the area in boredom.<br/><br/>During these thirty million years, he accumulated the energy in his body and tempered the energy in his body.<br/><br/>In the middle, Guan Shuqing and the rest of the girls had accompanied him here for a million years. They weren’t too bored.<br/><br/>Compared to the past, his control over his own energy and combat experience had improved by a lot.<br/><br/>“Let’s go to the right. I’ve already checked the left side. The right side belongs to the depths of this crystal region. ”<br/><br/>In the past 30 million years, Wang Xian would occasionally explore the surroundings.<br/><br/>He had already explored the left side. That was the location of the exit. Compared to that, it was safer.<br/><br/>However, he was prepared to explore the depths to see if he could find any treasures..\t\t\t\t\t\t</div>", "images": {}, "success": true}