{"id": 851, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073602.html", "title": "Chapter 3853 - 3853 The Terrifying Speed Of 3852!", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3853 - 3853 The Terrifying Speed Of 3852!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3853 The terrifying speed of 3852!<br/><br/>Boom! Boom! Boom<br/><br/>The sudden battle was about to start!<br/><br/>Waves of water dragons formed from seawater rushed towards Wang Xian and the rest.<br/><br/>Xiao Lan and the rest instantly used their defensive powers.<br/><br/>The water energy landed on the Tai Chi Dragon Plate and the defense of Xiao Lan and the rest. They were completely blocked.<br/><br/>The attack released by the Tai Chi Dragon Plate was directed towards the crystal creature.<br/><br/>“Roar!”<br/><br/>The crystal creature let out a low roar. There was a huge crystal horn on its head.<br/><br/>The Crystal Horn went straight for the attack of the Five Elements Millstone.<br/><br/>“Boom!”<br/><br/>The Five Divine Dragons released by the Five Elements Millstone were blocked by the collision.<br/><br/>“Huh?”<br/><br/>Wang Xian raised his eyebrows slightly when he saw it.<br/><br/>“We can fight!”<br/><br/>Lan Qingyue said.<br/><br/>“Yes, this crystal creature is very special. It seems to be formed from the energy of the crystal. If Xiao Lan and the rest can devour it, they will definitely be able to gain a significant improvement.”<br/><br/>Wang Xian said as his eyes glowed.<br/><br/>“Roar!”<br/><br/>The crystal creature in front of them stared at Wang Xian and the rest. Its eyes were filled with coldness.<br/><br/>Buzz<br/><br/>Wang Xian moved his palm and a soul spear appeared in his hand.<br/><br/>The five elements millstone, Lan Qingyue, Xiao Lan, and the rest immediately launched their attacks and attacked the crystal creature.<br/><br/>Whoosh<br/><br/>The Soul Spear in Wang Xian’s hand shot out instantly.<br/><br/>“Woo Woo!”<br/><br/>Xiao Lan and the rest let out a low growl. With their extremely huge bodies, waves of grayish energy rolled towards the crystal creature.<br/><br/>“Roar!”<br/><br/>The crystal creature let out a low growl. The seawater behind it started to churn instantly. It was as if the entire ocean was under its control!<br/><br/>The endless seawater condensed into a crystal creature that was exactly the same as it. It attacked Wang Xian and the rest from all directions.<br/><br/>“What a powerful crystal creature. However, it shouldn’t have reached the level of a dominator at level seven. However, it has the ability to instantly kill a dominator at level six.”<br/><br/>When Wang Xian saw this attack, his eyes focused. Another soul spear appeared in his hand.<br/><br/>He threw it with all his strength and continued to throw it at it.<br/><br/>“Roar!”<br/><br/>The five elements were sharpened. The five elements revolved and the head of a water god Dragon extended out. A majestic wave of water energy surged forward.<br/><br/>The crystal creatures formed from seawater collapsed rapidly.<br/><br/>The grayish energy of LAN qingyue and the rest seemed to form a special starry universe wherever they passed!<br/><br/>Under the coverage of this energy, they attacked the crystal creatures rapidly.<br/><br/>Ignoring the soul spear, they instantly arrived in front of the crystal creatures.<br/><br/>“Roar! Roar!”<br/><br/>The crystal creature sensed the attacks of Wang Xian and the rest and roared furiously.<br/><br/>In the next moment, his figure turned illusory rapidly as if he had completely merged into the sea.<br/><br/>At this moment, Wang Xian felt his heart tighten as a surge of energy attacked him.<br/><br/>Wang Xian’s mind stirred as a soul warship appeared around him and formed a defense.<br/><br/>The tai chi dragon plate also quickly draped over his body and turned into a dragon robe.<br/><br/>“Bang!”<br/><br/>The defense formed by the soul battleship collapsed rapidly. His attack landed on the Tai Chi Dragon Plate.<br/><br/>The Tai Chi Dragon Plate spun and resisted with all its might.<br/><br/>“Bang! Bang! Bang!”<br/><br/>Waves of energy landed on the Tai Chi Dragon Plate. The impact force caused Wang Xian’s expression to change drastically!<br/><br/>Fortunately, the Tai Chi Dragon Plate was able to withstand its attack.<br/><br/>Furthermore, a backlash force was directed towards it.<br/><br/>Crack! Crack<br/><br/>Cracks appeared on the crystal creature’s body!<br/><br/>Wang Xian’s gaze focused. He waved his arm and a force of wind and thunder landed on its body.<br/><br/>“Roar! Roar! Roar!”<br/><br/>This was the crystal creature’s indignant roar. Its figure quickly turned illusory.<br/><br/>When it reappeared, it was already under Xiao Bai’s body.<br/><br/>His terrifying crystal horn directly attacked Xiao Bai.<br/><br/>“Bang!”<br/><br/>A huge wound instantly appeared on Xiao Bai’s body.<br/><br/>“What a fast speed, what a strange speed!”<br/><br/>Lan Qingyue’s expression changed slightly when she saw this scene. Her body moved and instantly landed on Xiao Bai’s body.<br/><br/>A wave of energy landed on Xiao Bai’s body and healed his injuries.<br/><br/>“45 degrees, 100,000 meters to the right!”<br/><br/>Wang Xian’s expression changed drastically when he saw Xiao Bai’s terrifying speed. He shouted loudly!<br/><br/>The five elements were sharpened and numerous chains attacked that direction directly!<br/><br/>Xiao Lan’s small house also let out a furious roar. His body moved and opened his huge mouth to swallow Xiao Bai.<br/><br/>“He’s dodging. The speed of this crystal creature is too terrifying. We must trap it in an area. Xiao Lan, Kun’s domain!”<br/><br/>However, the moment they attacked him, he could feel that the crystal creature had disappeared in an instant!<br/><br/>This terrifying speed was several times faster than Xiao Lan and the five elements grinding mill!<br/><br/>In terms of speed, they were not on the same level.<br/><br/>Wang Xian was able to lock onto its position now because he relied on the void pursuit power of the uninitiated holy wings!<br/><br/>However, Wang Xian could sense that the void search ability on his body was disappearing at a terrifying speed.<br/><br/>“Woo Woo Woo!”<br/><br/>“Woo Woo Woo Woo!”<br/><br/>At this moment, Xiao Lan heard Wang Xian’s order and let out a low growl.<br/><br/>The small house also let out a low growl. The surrounding scene changed instantly!<br/><br/>“Hualala!”<br/><br/>“Huh? Seawater appeared in the domain of Kun?”<br/><br/>The Kun’s domain appeared and formed a space.<br/><br/>However, what surprised Lan Qingyue was that the sea water also appeared in the Kun’s domain.<br/><br/>This was a situation that she had never encountered before.<br/><br/>It was the energy of the crystal creature that invaded the Kun’s domain!<br/><br/>“The Kun’s domain can only last for five minutes!”<br/><br/>Xiao Lan said!<br/><br/>“Finish it within five minutes. Otherwise, we won’t be able to kill him. His speed is too fast!”<br/><br/>Wang Xian focused his gaze and looked in a certain direction.<br/><br/>He could sense that the crystal creature was there!<br/><br/>With a thought, the five elements grindstone became bigger.<br/><br/>“Five elements annihilation plate!”<br/><br/>The best way to deal with a strong enemy who was fast was to launch an area-of-effect attack.<br/><br/>In the past, it was always others who dealt with Wang Xian in this manner.<br/><br/>This was the first time he dealt with a creature in this manner.<br/><br/>The speed of this crystal creature was beyond their imagination!<br/><br/>Its attack power and speed far surpassed Xiao Lan and the rest who were masters of level six.<br/><br/>If it wasn’t for the fact that Wang Xian and the rest were stronger, with its speed alone, it would be able to kill the space beasts who were masters of level six easily.<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>The Five Elements Annihilation Disk appeared and covered the entire Kun region.<br/><br/>The crystal creature could not dodge such an indiscriminate attack at all!<br/><br/>The annihilated energy was directed at it.<br/><br/>The crystal creature had no choice but to show itself to defend against it.<br/><br/>“Whoosh! Whoosh!”<br/><br/>Wang Xian saw the crystal creature appear and shot his soul spears at it.<br/><br/>At the same time, the attacks of Lan Qingyue and the Kun condensed at the same time.<br/><br/>It was also a spear.<br/><br/>Six Spears also attacked it.\t\t\t\t\t\t</div>", "images": {}, "success": true}