{"id": 856, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073612.html", "title": "Chapter 3858 - 3858 38,57,30 Million Years", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3858 - 3858 38,57,30 Million Years</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3858 38,57,30 million years<br/><br/>“Eh, what is This?”<br/><br/>Wang Xian had been flying aimlessly in the ocean.<br/><br/>He was filled with curiosity when he encountered two energy crystals consecutively.<br/><br/>After flying for more than ten days, he was shocked by the scene in front of him.<br/><br/>It was the domain space of a crystal.<br/><br/>It was a crystal formed from dense water energy.<br/><br/>This crystal was not the kind of crystal energy that contained boundless energy. Instead, it was an ordinary crystal condensed from ordinary seawater.<br/><br/>An incomparably huge crystal palace appeared in Wang Xian’s line of sight.<br/><br/>These crystals were located in this sea area without any rules. They were densely packed and one could not see the edge of it at a glance.<br/><br/>He sized them up with a face full of curiosity. After a moment of hesitation, he entered the palace.<br/><br/>“This place is a little strange. There are definitely treasures inside, but it’s also 100% dangerous.”<br/><br/>Wang Xian mumbled.<br/><br/>After hesitating for a moment, he flew into the space. Even after flying for more than ten days to ensure his safety, he still couldn’t fly out of this space.<br/><br/>His figure moved and hid in a crystal. He waited just like that.<br/><br/>Wang Xian hid here, thinking that if the eight gods chased after him, it might attract the attention of the crystal creatures or the space behemoths.<br/><br/>If the crystal creatures and space behemoths could destroy them, he could also leave this place.<br/><br/>With this thought in mind, he hid here and waited quietly.<br/><br/>He did not wander around this area wantonly.<br/><br/>Wandering around the infinite starry sky without any scruples was undoubtedly courting death.<br/><br/>Wang Xian was hiding here. If he was found by the eight gods, he was thinking of escaping.<br/><br/>What if they encountered the terrifying existence here?<br/><br/>Of course, Wang Xian knew that the probability was not very high.<br/><br/>However, this was his only option at the moment!<br/><br/>Time passed day by day.<br/><br/>Wang Xian remained hidden here without moving an inch.<br/><br/>At the same time, on the other side of this ocean, eight level seven gods were flying toward Wang Xian through the guidance of their faith tracking.<br/><br/>In fact, Wang Xian had already fled a very, very long distance in an instant through the teleportation via the spatial scroll.<br/><br/>He had pulled away a very long distance from them!<br/><br/>This was also the reason why the eight level seven gods could not find Wang Xian even after chasing him for a few years.<br/><br/>The only thing they could be sure of was that Wang Xian was within the range of the Starfield fragment!<br/><br/>As long as he was still within this range, they had a great chance of capturing him and killing him.<br/><br/>Time passed quickly. The eight level seven gods flew for a few hundred years but still could not reach Wang Xian’s position.<br/><br/>This caused them to frown slightly.<br/><br/>“We can only hold on for a few decades by using faith to track the energy above. If we can’t find the Dragon King of the Dragon Palace within these few decades, we might have to spend even more time!”<br/><br/>A level seven God said with a frown.<br/><br/>“There’s no other way. We have to destroy the Dragon King of the Dragon Palace. This place is already quite deep. If our Army of faith comes here, it’s very likely that we will attract the attention of the powerful cosmic beasts. We can’t take this risk and let them come here.”<br/><br/>A Level 7 pantheon said.<br/><br/>“As long as we seal the Dragon Palace Dragon King here, it will be fine. He can’t advance here, but the Pantheon outside can. Without the Dragon Palace Dragon King, it will be much easier for our faith universe to destroy the 9-origin universe. We just need to trap him here!”<br/><br/>“Moreover, after tens of millions of years, more powerful treasures will be born in our faith universe. At that time, we can send a large number of experts to search and easily destroy the Dragon Palace Dragon King.”<br/><br/>One of the tier 7 gods glanced at them.<br/><br/>“That’s true. In any case, we can’t let him escape from this region. One day, we will be able to destroy the Dragon Palace Dragon King!”<br/><br/>One of the Tier 7 gods in the center nodded.<br/><br/>“Let’s go. We Can’t give up now. If we can destroy the Dragon Palace Dragon King as soon as possible, it will be beneficial.”<br/><br/>The eight rank seven gods continued to fly forward.<br/><br/>After dozens of years, they arrived at the territory filled with crystals.<br/><br/>“Here?”<br/><br/>The eight rank seven gods looked ahead and frowned slightly.<br/><br/>They looked at the direction of the faith tracking in the sky and looked at each other.<br/><br/>“This area ahead is very likely to be dangerous.”<br/><br/>One of the gods said as he looked ahead.<br/><br/>“There must be treasures or space beasts in the more special places. The Dragon King of the Dragon Palace is probably hiding in there.”<br/><br/>One of the gods said, “Let’s go. We have to go in and check it out.”<br/><br/>“The faith tracking is only for a few days. We have to go in.”<br/><br/>The eight gods continued to fly in.<br/><br/>After entering, they were on high alert.<br/><br/>Balls that looked like stars floated in the sky above them.<br/><br/>This was the protection of the galactic fragment.<br/><br/>They could use this galactic fragment to fight against a level seven cosmic beast.<br/><br/>However, it would be difficult to kill a level seven cosmic beast!<br/><br/>The eight of them entered the space. The entrance they entered was not the route that Wang Xian took.<br/><br/>In fact, Wang Xian had already forgotten the entrance that he entered in this area that was filled with crystals.<br/><br/>He did not dare to leave behind any energy marks!<br/><br/>“Roar!”<br/><br/>After flying for a few days, the eight gods suddenly felt a cold aura locking onto them.<br/><br/>Following which, a roar sounded.<br/><br/>“Not good, there’s a space beast!”<br/><br/>When a Tier 7 pantheon heard this roar, his expression changed slightly, and his eyes revealed a look of fear.<br/><br/>“Crash!”<br/><br/>However, in the next second, the sound of a crystal shattering could be heard.<br/><br/>A crystal creature appeared behind one of the Pantheon Gods. His terrifying and strange speed instantly arrived, and the crystal horn on his head rammed into his back!<br/><br/>“Weng!”<br/><br/>The moment the crystal horn struck, the star above its head directly enveloped it.<br/><br/>The horn struck the star guardian.<br/><br/>Cracks instantly appeared on the entire star guardian.<br/><br/>However, this attack was blocked by the crystal creature.<br/><br/>Seeing that the attack didn’t succeed, the crystal creature instantly moved and entered a crystal.<br/><br/>When it entered a crystal, it seemed to have disappeared!<br/><br/>“Damn it, it’s not a space beast, it’s a strange creature. Its speed is very fast, comparable to the speed of a peak pantheon, but its attack power should only be at the level of a Tier 8 Pantheon!”<br/><br/>The tier 7 pantheon that was attacked immediately shouted!<br/><br/>“Be careful, gather together. If it attacks again, destroy it immediately!”<br/><br/>The eight gods gathered together with an ugly expression on their faces. Their eyes scanned the surroundings vigilantly.\t\t\t\t\t\t</div>", "images": {}, "success": true}