{"id": 850, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073600.html", "title": "Chapter 3852 - 3852 3851 Energy Crystal, Crystal Creature!", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3852 - 3852 3851 Energy Crystal, Crystal Creature!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3852 3851 energy crystal, Crystal Creature!<br/><br/>“Eh? They have arrived at the center of the starry universe, at the edge of the infinite starry sky. They have entered this ocean.”<br/><br/>At the edge of the infinite starry sky, a huge army was flying rapidly.<br/><br/>Eight figures were at the center. An arrow condensed from faith energy pointed to the front.<br/><br/>In front of them was an endless ocean.<br/><br/>These eight figures were the envoys sent by the Faith Universe.<br/><br/>They were the envoys who controlled the heaven origin creation level fragment.<br/><br/>“Envoys, are we still going in? There might be some risks.”<br/><br/>A Level 7 pantheon frowned and asked.<br/><br/>“The entire army can not enter. Once the entire army enters, it might attract the attention of the powerful Space Beasts.”<br/><br/>An envoy shook his head and frowned slightly.<br/><br/>This boundless starry sky was a completely forbidden area for them.<br/><br/>Although this was a peripheral location and the danger was not very high, they had too many gods of faith entering, and it would still immediately attract the attention of the powerful space behemoths.<br/><br/>With the Tianyuan creation grade treasure fragment in their hands, although they were comparable to peak pantheon existences, they were only able to contend against a ruler level seven space behemoth.<br/><br/>If a level 8 space behemoth came, they would be finished.<br/><br/>And in the infinite starry sky, Level 8 space behemoths were 100% possible.<br/><br/>“The eight of us should enter. This is the edge. The level of the space behemoths shouldn’t be very high. If we encounter some, we can resist or escape.”<br/><br/>An emissary said.<br/><br/>Their army absolutely couldn’t enter, as long as the eight of them stepped inside.<br/><br/>“Those eight emissaries, we’ll wait for you outside. We’ll perform the Faith Pursuit one last time for you. If we do it at full strength once, it’ll be enough to last for thousands of years.”<br/><br/>The seven gods of the ten palaces army said.<br/><br/>The eight emissaries nodded.<br/><br/>Soon, the arrows of the faith pursuit became more and more concentrated.<br/><br/>The eight seventh-level gods looked at each other and flew forward.<br/><br/>Continue the pursuit!<br/><br/>They had to kill the Dragon King of the Dragon Palace.<br/><br/>At the same time, Wang Xian, Xiao Lan, and the rest stepped into the ocean and felt like they had returned to their homeland.<br/><br/>Although the ocean here was slightly different, it still contained a huge amount of water energy.<br/><br/>Wang Xian and Lan Qingyue stood on the body of Xiao Lan’s house and looked around.<br/><br/>They kept flying deeper into the ocean and didn’t sense the aura of the space beasts.<br/><br/>This ocean was so huge that Wang Xian and the rest couldn’t sense the boundary at all.<br/><br/>They were flying in one direction.<br/><br/>Xiao Lan and the rest had their energy wrapped around Wang Xian, so the other space beasts couldn’t sense his aura.<br/><br/>After flying for a year, Xiao Lan and the rest suddenly sensed something.<br/><br/>“There are treasures over there.”<br/><br/>Xiao Lan and the rest stared in one direction and said.<br/><br/>“Are there any powerful space beasts guarding it?”<br/><br/>When Wang Xian heard that, his eyes narrowed and he asked.<br/><br/>“Dragon King, I didn’t sense it.”<br/><br/>Xiao Lan and the rest responded and flew forward immediately.<br/><br/>Soon, a very special item appeared in their line of sight.<br/><br/>It was a crystal, a crystal that was crystal clear and emitting a powerful energy.<br/><br/>The crystal contained water energy and a powerful life force.<br/><br/>Water nurtured all living things. The special water energy also contained the life force.<br/><br/>It was similar to the wood attribute.<br/><br/>This crystal floated quietly in the ocean, emitting a luster.<br/><br/>Wang Xian sensed this crystal and his eyes lit up. “The energy of this crystal should be comparable to the divine fruit that can dominate the fifth level.”<br/><br/>“Woo Woo!”<br/><br/>Xiao Lan and the rest let out a low growl and flew over.<br/><br/>“This treasure that contains life energy can enhance Xiao Lan and the rest. Just consume it.”<br/><br/>Lan Qingyue said.<br/><br/>Little Blue and the others needed a huge amount of life energy to upgrade.<br/><br/>They devoured the lives of peak races to upgrade their life energy.<br/><br/>However, they couldn’t give the resources of the Dragon Palace and the dragon blood in the Dragon Pond to Little Blue and the others.<br/><br/>The main reason was that the dragon blood of the Dragon Palace wasn’t enough for them to upgrade.<br/><br/>After all, Xiao Lan and the rest had reached a high realm.<br/><br/>“This kind of crystal is actually floating here without the protection of the space beasts. It’s just like picking up treasures.”<br/><br/>Lan qingyue sighed at the side.<br/><br/>“Indeed, it’s just like picking up treasures. Let’s keep looking. Even if we encounter one of these treasures in a year, the harvest is still huge. In tens of millions of years, Xiao Lan should be able to improve.”<br/><br/>Wang Xian nodded his head.<br/><br/>Picking up such a treasure directly.<br/><br/>This was impossible in the nine-origin universe.<br/><br/>Xiao Lan and the rest swayed their bodies and continued to fly forward.<br/><br/>After flying for more than half a year, Xiao Lan and the rest sensed something again.<br/><br/>“Let’s Go!”<br/><br/>Xiao Lan brought Wang Xian and the rest over. It was still a crystal that contained a huge amount of energy.<br/><br/>After Xiao Lan swallowed it, she continued to search for it.<br/><br/>Buzz Buzz Buzz<br/><br/>However, a year later, Wang Xian also sensed a huge amount of energy.<br/><br/>Under normal circumstances, Xiao Lan and the rest would be the first to discover the energy crystal. However, Wang Xian was able to sense it this time as well.<br/><br/>“There should be a large number of energy crystals over there. There must be a lot of them.”<br/><br/>Lan Qingyue’s eyes glowed as she pointed in a certain direction.<br/><br/>Wang Xian nodded. Without their instructions, Xiao Lan and the rest flew over immediately.<br/><br/>The closer they got, the denser the energy became.<br/><br/>However, when they were about to get closer, Wang Xian and the rest could feel the majestic energy charging towards them.<br/><br/>“What’s the situation?”<br/><br/>Wang Xian and the rest’s eyes narrowed as shock appeared on their faces.<br/><br/>“Roar! Roar!”<br/><br/>However, in the next second, a crystal-like interstellar beast charged towards Wang Xian and the rest.<br/><br/>This was the smallest interstellar beast that Wang Xian had ever seen in the universe.<br/><br/>It was only about 1,000 meters in size and could not even be called a behemoth.<br/><br/>Instead, it was a powerful creature.<br/><br/>“What is this?”<br/><br/>Wang Xian stared at it and felt the energy coming from the crystal creature. His expression changed slightly.<br/><br/>The Tai Chi Dragon Disc and the five elements millstone immediately floated around.<br/><br/>Boom<br/><br/>At this moment, the surrounding seawater energy condensed and formed terrifying water dragons. They attacked Wang Xian and the rest.<br/><br/>They attacked from all directions without any difference.<br/><br/>“Block it!”<br/><br/>Wang Xian saw that the tai chi dragon plate was blocking the position at the back.<br/><br/>The Five Elements Millstone immediately released a divine dragon with five attributes and attacked the crystal creature.<br/><br/>Xiao Lan and the rest also opened their huge mouths as waves of energy charged forward.<br/><br/>At the same time, their bodies trembled as the gray energy blocked the attack of the water energy!\t\t\t\t\t\t</div>", "images": {}, "success": true}