{"id": 852, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073604.html", "title": "Chapter 3854 - 3854 3853 Kill, The Power Of The Heaven’S Origin Fragment", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3854 - 3854 3853 Kill, The Power Of The Heaven’S Origin Fragment</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3854 3853 kill, the power of the Heaven’s origin fragment<br/><br/>“Roar! Roar! Roar!”<br/><br/>When the crystal creature saw the attacks from Wang Xian and the rest, it roared in shock and anger.<br/><br/>It did not dare to take the attacks from Wang Xian and the rest head-on.<br/><br/>Six Spears shot towards it. Once it was hit, it would definitely die!<br/><br/>The crystal creature hurriedly dodged to the side.<br/><br/>However, when it dodged to the side, the Five Elements Annihilation Disc’s attack landed on its body.<br/><br/>The powerful attack caused cracks to appear on his body.<br/><br/>This time, the cracks covered almost his entire body.<br/><br/>“Continue!”<br/><br/>Lan qingyue shouted softly. With a move of her palm, a grayish palm pressed down directly on the crystal creature.<br/><br/>Xiao Lan and the rest opened their mouths. Waves of energy were injected into the palm.<br/><br/>The gigantic and terrifying palm arrived above the head of the crystal creature!<br/><br/>Wang Xian waved his arm and the soul battleship under him crashed towards it!<br/><br/>The AOE attack covered it once again!<br/><br/>“Roar! Roar! Roar!”<br/><br/>The Crystal Creature let out a furious roar and instantly appeared at the edge of the Kun’s domain. Endless sea water attacked the Kun’s domain.<br/><br/>It wanted to break through the Kun’s domain.<br/><br/>As long as it left the Kun’s domain, it would be able to escape easily.<br/><br/>Otherwise, what awaited it would be death!<br/><br/>“It won’t be so easy to escape!”<br/><br/>Wang Xian moved his body and the Divine Dragon of light and darkness circled around his body.<br/><br/>He used the strength of his physical body to attack it directly.<br/><br/>The great grinding of the five elements also smashed towards it forcefully.<br/><br/>The crystal creature sensed the attack from Wang Xian and the rest again. Its face was filled with panic.<br/><br/>He quickly stopped attacking the Kun’s domain. All the seawater surged towards his body, forming a powerful defense.<br/><br/>Boom<br/><br/>Lan Qingyue and the rest landed their palms on it.<br/><br/>The Crystal Creature’s defense was actually forcefully blocked.<br/><br/>Bang<br/><br/>However, the five elements Millstone had already arrived in front of him. The entire five elements Millstone was emitting flames as it charged towards him forcefully.<br/><br/>Boom<br/><br/>The immense force caused cracks to appear on the body of the Crystal Creature!<br/><br/>Wang Xian followed closely behind as his arm turned into a dragon claw.<br/><br/>The Light and Darkness Dragon Claws overlapped with each other and smashed onto the surface of the crystal creature.<br/><br/>Crack! Crack! Crack<br/><br/>In the next moment, the body of the crystal creature was like glass.<br/><br/>Pieces of crystals fell from its body.<br/><br/>Each piece of crystal contained a majestic energy.<br/><br/>When Wang Xian saw this scene, his eyes lit up with joy!<br/><br/>“Big Whale Fist!”<br/><br/>Lan qingyue swayed her body and threw an ordinary punch at the crystal creature.<br/><br/>Her punch seemed to contain the strength of three kun.<br/><br/>“Bang!”<br/><br/>When her punch landed on the body of the crystal creature, its body completely collapsed!<br/><br/>Its entire body turned into pieces of crystal energy.<br/><br/>“It’s dead!”<br/><br/>When Wang Xian saw that the crystal creature had completely collapsed, a look of joy appeared on his face.<br/><br/>“This crystal creature is really powerful. If we didn’t trap it, we wouldn’t be able to kill it.”<br/><br/>Lan Qingyue said with a smile on her face.<br/><br/>“Indeed. This crystal creature’s speed is too fast and its attack power is also very strong. If it wanted to escape outside, it would be easy for it.”<br/><br/>Wang Xian nodded his head.<br/><br/>If it weren’t for him and Lan Qingyue working together, ordinary experts wouldn’t be able to do anything to him.<br/><br/>One had to know that when Wang Xian and Lan Qingyue worked together, they could rival more than ten cosmic beasts that were at the level of a ruler at level six.<br/><br/>If he couldn’t restrict his movements, Wang Xian felt that even if it was a cosmic beast that was at the level of a ruler at level seven, it would be very difficult to catch it.<br/><br/>Wang Xian moved his body and waved his arm to collect the crystals.<br/><br/>Each crystal contained a huge amount of energy.<br/><br/>Wang Xian could also absorb this energy.<br/><br/>However, he did not lack the resources to upgrade.<br/><br/>He waved his arm and threw them to Xiao Lan.<br/><br/>Currently, they were prepared to focus all their efforts on nurturing Xiao Lan. They would first upgrade Xiao Lan to the overlord of level seven.<br/><br/>“Woo Woo!”<br/><br/>Xiao Lan swallowed all the crystals and let out a joyful sound.<br/><br/>“How much more energy do I need to raise my strength?”<br/><br/>Wang Xian asked Xiao Lan with a smile.<br/><br/>“Dragon King, I need to kill at least three more of these crystal creatures before I can raise my strength.”<br/><br/>Xiao Lan reported.<br/><br/>“Three?”<br/><br/>Wang Xian raised his eyebrows. There were too many of them!<br/><br/>They were lucky to be able to kill this crystal creature this time.<br/><br/>This crystal creature was a little arrogant. It wanted to fight them if they didn’t run away.<br/><br/>If it ran away immediately, Wang Xian and the rest wouldn’t be able to kill it.<br/><br/>“Let’s take it slow!”<br/><br/>Wang Xian wasn’t in a hurry. He wanted to improve slowly.<br/><br/>As long as Xiao Lan improved, he would continue to worship the gods in the universe.<br/><br/>At that time, he would be able to obtain a terrifying amount of resources.<br/><br/>“Wu Wu!”<br/><br/>Thinking of this, little blue and the others let out a low roar, and the Kun domain instantly disappeared!<br/><br/>“Huh?”<br/><br/>However, when they had just appeared in the ocean, Lan Qing Yue slightly focused and immediately looked to the left.<br/><br/>“Little Xian, I can sense the energy of the universe masters of Faith. They are chasing us.”<br/><br/>Lan Qingyue immediately spoke up.<br/><br/>“Are they chasing us? How dare the tens of millions of troops from their ten palaces come here? Aren’t they afraid of the attacks of the Space Beasts?”<br/><br/>Wang Xian revealed a look of surprise as he spoke up!<br/><br/>“They shouldn’t be the troops who believe in the universe. They only have eight streams of energy. The strength of a level seven pantheon!”<br/><br/>Lan Qingyue sensed and spoke up!<br/><br/>“Eight level seven pantheon? Are they chasing after us? Do they have any trump cards?”<br/><br/>When Wang Xian heard that, he didn’t relax at all. On the contrary, a solemn expression appeared on his face!<br/><br/>“Let’s go. Let’s not touch them for the time being.”<br/><br/>Wang Xian hesitated for two seconds and spoke immediately!<br/><br/>Lan qingyue nodded her head.<br/><br/>Eight level seven pantheon dared to chase after them. It was impossible to say that the other party didn’t have any trump cards.<br/><br/>Wang Xian and the rest had completely exposed their strength.<br/><br/>If they were to chase after them under such circumstances, they must have a trump card.<br/><br/>A powerful trump card!<br/><br/>Wang Xian and the rest came to Xiao Lan’s body. Xiao Lan swayed her huge body and swam straight ahead.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Not long after, eight figures appeared at the position of Wang Xian and the rest. Each of them was stepping on a book condensed from their faith.<br/><br/>Their eyes scanned the surroundings, and there was a glint in their eyes.<br/><br/>“The Dragon King of the Dragon Palace and the rest have just left this place!”<br/><br/>“There must have been a huge battle here. Let’s go, let’s continue our pursuit!”<br/><br/>The eight gods of level seven spoke as they moved and continued their pursuit in the direction of Wang Xian and the rest.<br/><br/>Their speed was extremely fast, and they were no slower than Wang Xian and the rest.<br/><br/>Wang Xian directly dodged and fled. After flying for more than a month, Lan Qingyue did not sense the eight level-seven gods.<br/><br/>“This chasing technique of the belief universe is really amazing. To be able to lock onto us with such precision, it’s really not simple!”<br/><br/>Lan Qingyue could not help but exclaim.\t\t\t\t\t\t</div>", "images": {}, "success": true}