{"id": 859, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073618.html", "title": "Chapter 3861 - Chapter 3861: 3860 Design!", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3861 - Chapter 3861: 3860 Design!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3861: 3860 design!<br/><br/>Translator: 549690339<br/><br/>“Although the risk is high, there are still a lot of goods. If it weren’t for the star field fragment, we wouldn’t have gotten so many treasures! ”<br/><br/>“Indeed. This crystal energy is useful to us. Let’s continue exploring this place.<br/><br/>Maybe we can get a lot of goods! ”<br/><br/>“That’s right. Even if we can’t find the Dragon King of the Dragon Palace, if we can get the treasures in this area, it will be a great deal for us! ”<br/><br/>The eight rank seven gods spoke, and a smile appeared on their faces.<br/><br/>Even the rank seven God who had just mocked them nodded with a smile.<br/><br/>“Then let’s continue exploring. We can’t go to the rear. It’s a bit dangerous there, so let’s go to the front! ”<br/><br/>The rank seven God spoke.<br/><br/>The other seven nodded, “Let’s go, let’s continue! ”<br/><br/>With the starfield fragment, the 8 Type 7 gods were able to unleash the power to fight against a Type 7 space beast.<br/><br/>This power could be said to be the strongest strength they believed in in the universe.<br/><br/>They had relied on the starfield fragment to gain many benefits in this space.<br/><br/>As a result, they had even put aside the matter of hunting the Dragon King!<br/><br/>After all, with their strength, it was impossible for them to use such a treasure.<br/><br/>Only existences at the peak of the Pantheon level had the right to use such a treasure.<br/><br/>Moreover, such a treasure would only be able to unleash greater power in the hands of the peak of the Pantheon level.<br/><br/>The eight of them continued to fly forward.<br/><br/>However, what they didn’t know was that they were getting closer and closer<br/><br/>to Wang Xian!<br/><br/>At the same time, Wang Xian did not know that the direction he was exploring was getting closer to the gods who believed in the universe.<br/><br/>The Ghost Avatar was still scouting ahead.<br/><br/>A month later, Wang Xian suddenly felt a familiar energy coming from the front!<br/><br/>When he felt this energy, he was slightly stunned!<br/><br/>“This is? The power of faith? There are powerhouses from the universe of faith ahead. They are still here and are still looking for me. It seems that their treasure has some restrictions! ”<br/><br/>After sensing the gods from the universe of faith, Wang Xian had some understanding in his heart.<br/><br/>This kind of restrictive ability did indeed have restrictions.<br/><br/>It should be a restriction of distance.<br/><br/>Once they left this place, he might be able to get rid of the restrictions!<br/><br/>“I’ve been discovered! ”<br/><br/>At this moment, Wang Xian sensed through his netherspirit avatar that the waves of power of faith were rapidly approaching him.<br/><br/>Wang Xian’s eyes focused. Without any hesitation, he immediately recalled the Ghost Avatar.<br/><br/>(‘I can sense the aura of the Dragon King. Is He really here?”<br/><br/>“Yes, the Dragon King of the Dragon Palace is still hiding here. Humph, it has been more than 30 million years. He can still hide! ”<br/><br/>A few seconds after the ghost avatar disappeared, the eight level seven pantheon gods arrived at the spot where the Ghost Avatar had been.<br/><br/>Their eyes scanned the surroundings, and their eyes were shining brightly! “It should be in that direction. Let’s go and continue our pursuit! ” The eight level seven pantheon gods moved and flew towards Wang Xian.<br/><br/>“They should be able to sense me. Let’s leave! ”<br/><br/>Wang Xian did not hesitate at this moment. However, he was suddenly stunned.<br/><br/>Recently, he had gained some understanding of this area.<br/><br/>He had an idea.<br/><br/>It was not too far from here. It should be about a month away, and it should be the area where the Crystal Beast was.<br/><br/>He had some understanding of the surrounding area.<br/><br/>What if he attracted the eight Type 7 gods from the starry cosmos?<br/><br/>Wouldn’t that be the case?<br/><br/>His eyes flickered.<br/><br/>He did as he was told. Without any hesitation, he controlled the Hell Ghost Avatar to fly in that direction.<br/><br/>At the same time, he released some energy to guide it!<br/><br/>“This way! ”<br/><br/>At the back, the eight rank seven gods didn’t hesitate and immediately chased after him.<br/><br/>They didn’t have any doubts.<br/><br/>In their opinion, the Dragon King of the Dragon Palace was leading the way.<br/><br/>How could they be in danger if they were at the back?<br/><br/>Even if they were in danger, the Dragon King of the Dragon Palace would be the first to be in danger.<br/><br/>Moreover, the combat strength of their side far exceeded that of the Dragon King of the Dragon Palace.<br/><br/>Even if they were in danger, the Dragon King of the Dragon Palace would be the first to die. They could still escape!<br/><br/>Eight gods of level seven were chasing after them at a rapid speed!<br/><br/>As Wang Xian was escaping according to the route he had taken, coupled with the fact that he had the ghost avatar to scout the way, his speed was also extremely fast!<br/><br/>The eight gods were chasing after him while Wang Xian was fleeing in front!<br/><br/>Both parties were extremely fast!<br/><br/>Wang Xian, who possessed a soul battleship, was slightly faster than them!<br/><br/>After fleeing for about a month, Wang Xian arrived at the front where he encountered danger the last time!<br/><br/>He immediately controlled the two Hades’ avatars to continue flying to the left. Once he encountered danger, Wang Xian would also use the Netherworld Dragon Transformation!<br/><br/>Following that, the two ghost avatars moved carefully towards the area of the Giant Crystal Beast!<br/><br/>Buzz<br/><br/>Around his body, the Taiji Dragon Disk appeared. The power of yin and yang completely enveloped it.<br/><br/>His figure was hidden in a crystal, trying his best to conceal his aura. Meanwhile, the ghost avatars continued to fly with their own aura.<br/><br/>“This way! ”<br/><br/>Not long after, Wang Xian sensed a surge of power of faith flying to his right.<br/><br/>The corner of Wang Xian’s mouth curled up slightly.<br/><br/>That direction was the direction of the Crystal Behemoth where the two Hades’avatars were heading to.<br/><br/>The two Hades’ avatars were flying. The deeper they went, the more they concealed their energy.<br/><br/>They were trying to prevent them from encountering the crystal behemoth inside!<br/><br/>The last time, the Crystal Beast was quite far away and did not suffer any major attacks.<br/><br/>If they were close, the Crystal Beast would be killed instantly!<br/><br/>More than ten minutes later, the two Hades’ avatars arrived at the place where they explored the last time.<br/><br/>The more than 50 energy crystals were still there.<br/><br/>There were still no crystal beasts there.<br/><br/>Wang Xian also did not understand why the crystal beast insisted on placing the energy crystals here!<br/><br/>The Netherworld Phantom Avatar stayed where he was and waited for a while.<br/><br/>Not long after, he sensed the auras of the eight level seven pantheon gods.<br/><br/>The Eyes of the two netherworld phantom avatars were sparkling as they continued to fly forward!<br/><br/>“Do you see the Dragon King of the Dragon Palace?”<br/><br/>“HMM? No, this doesn’t seem to be the Dragon King of the Dragon Palace! ”<br/><br/>At this moment, the eight level seven pantheon gods at the back saw the two Netherworld Phantom avatars. Their eyes focused!<br/><br/>At this moment, they saw the two netherspirit avatars wave their arms.<br/><br/>More than 50 energy crystals containing massive amounts of energy flew towards them.<br/><br/>This caused the eight tier 7 gods to be slightly stunned, and they stared fixedly at the 50 over Energy Crystals!<br/><br/>“This is?”<br/><br/>They felt the energy within, and their breathing became slightly hurried!<br/><br/>These 50 over energy crystals, even when they saw them, were incomparably hot!\t\t\t\t\t\t</div>", "images": {}, "success": true}