{"id": 854, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073608.html", "title": "Chapter 3856 - 3856 The 3855 Strong And Strange Fragment Of The Starfield!", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3856 - 3856 The 3855 Strong And Strange Fragment Of The Starfield!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3856 The 3855 strong and strange fragment of the Starfield!<br/><br/>Boom! Boom! Boom<br/><br/>A terrifying collision sound was heard.<br/><br/>Wang Xian, Lan Qingyue, and the rest’s strongest attack landed on the seven meteorites and collided with them.<br/><br/>The terrifying energy caused the surrounding seawater to collapse and dissipate instantly.<br/><br/>Similarly, the five elements grinding tai chi dragon plate and Lan Qingyue’s attacks gradually dissipated.<br/><br/>After Wang Xian and the rest launched an attack, they did not hesitate and continued to flee into the distance.<br/><br/>However, what made Wang Xian and the rest relieved was that Wang Xian and the rest’s attacks had completely blocked the seven meteorites.<br/><br/>Their attacks disappeared, and so did the meteorites!<br/><br/>“What a powerful treasure. How can this treasure be so terrifying?”<br/><br/>Lan Qingyue couldn’t help but exclaim, her face full of shock.<br/><br/>Their combined attack was almost comparable to the attack of a pinnacle ruler.<br/><br/>But they didn’t expect that their full-strength attack could only block the opponent’s casual attack.<br/><br/>If the opponent attacked a few more times, they wouldn’t be able to block it at all.<br/><br/>They would be easily crushed and destroyed.<br/><br/>They were on completely different levels.<br/><br/>“We are not their match. As expected of the belief universe. To be able to take out such a terrifying supreme treasure. I wonder what level this supreme treasure is.”<br/><br/>Wang Xian’s face was also filled with shock.<br/><br/>A soul supreme treasure that was comparable to a dominator of the ninth level collapsed under that attack and dissipated completely.<br/><br/>This was not an ordinary attack.<br/><br/>An ordinary attack could shatter a soul spear so that the soul spear would not dissipate in the world.<br/><br/>However, their attack caused the soul spear to disappear completely.<br/><br/>Terrifying!<br/><br/>This involved a powerful and strange energy.<br/><br/>“Let’s go, increase our speed!”<br/><br/>Wang Xian shouted softly again. The Five Elements Millstone’s help landed on Xiao Lan’s body.<br/><br/>Lan qingyue nodded her head. Similarly, a stream of energy landed on Xiao Lan’s body to increase her speed.<br/><br/>Their speed had suddenly increased by a level!<br/><br/>“You want to escape? Once we have locked onto you, do you still want to escape? Starfield fragment, Starfield chain.”<br/><br/>At the back, the eyes of the eight gods were filled with coldness and awe.<br/><br/>They waved their arms and streams of energy were injected into the starfield fragment.<br/><br/>The Shadows of the stars appeared one after another. The Shadows of the stars instantly appeared around Wang Xian and the rest.<br/><br/>Their appearance out of thin air was extremely terrifying. It was as if they had teleported!<br/><br/>“What? What ability is this?”<br/><br/>Wang Xian’s expression changed drastically when he saw this scene.<br/><br/>They had already distanced themselves from the eight gods. However, they did not expect this strange energy to appear around them in an instant.<br/><br/>The eight planets surrounded them. Although the planets were just shadows, Wang Xian and the rest could sense a strange energy.<br/><br/>Wang Xian’s expression changed slightly. He looked at Lan Qingyue and immediately sent a voice transmission, “Let’s go. Let’s split up. I have a way to escape in an instant!”<br/><br/>“Alright, husband, be careful!”<br/><br/>Lan Qingyue looked at Wang Xian and nodded her head heavily<br/><br/>She knew that Wang Xian had the ultimate teleportation treasure in his hands, so she wasn’t too worried. Yes<br/><br/>Now that Lan Qingyue was here, she would be a burden instead!<br/><br/>Wang Xian’s gaze swept across the eight star apparitions that surrounded them. His body moved and he immediately flew to the left.<br/><br/>Meanwhile, Lan Qingyue flew to the right!<br/><br/>“Huh?”<br/><br/>At the back, the eyes of the gods froze slightly when they saw this scene.<br/><br/>“He actually escaped separately? Lock onto the Dragon King of the Dragon Palace and destroy him first!”<br/><br/>A level seven God spoke!<br/><br/>“Alright!”<br/><br/>The rest of the gods responded immediately. They waved their arms and waves of energy were injected into the starfield fragment.<br/><br/>Buzz! Buzz! Buzz<br/><br/>The eight astral shadows flickered slightly and flew toward Wang Xian’s body instantly.<br/><br/>Wang Xian’s expression changed drastically when he sensed this scene.<br/><br/>These eight stars were very strange. He couldn’t sense any offensive power, only a special energy.<br/><br/>Wang Xian could sense that if he was hit by this energy, something bad would definitely happen.<br/><br/>Lan qingyue glanced over, gritted her teeth and left quickly.<br/><br/>Wang Xian was very calm at this moment. He wasn’t worried at all.<br/><br/>Even if he really died this time, he still had enough resources to quickly recover to his current level.<br/><br/>After all, he had stored a large amount of resources.<br/><br/>Buzz! Buzz! Buzz<br/><br/>Wang Xian’s body trembled and a Shadow Dragon Avatar appeared at the side.<br/><br/>Buzz<br/><br/>The next second, the eight stars disappeared instantly when they were very far away from Wang Xian.<br/><br/>He could feel a wave of energy entering his body.<br/><br/>“What kind of strange attack is this? What kind of treasure is this? Could it be an ultimate treasure at the Heaven’s origin level? It’s really terrifying!”<br/><br/>Wang Xian sensed this strange energy and his body trembled.<br/><br/>Buzz<br/><br/>This body of his instantly collapsed and dissipated.<br/><br/>The clone at the side replaced the main body.<br/><br/>The Shadow Dragon clone.<br/><br/>It was able to withstand Wang Xian’s ability to die for sure.<br/><br/>When Wang Xian’s other body collapsed, he felt that the energy in his body had disappeared!<br/><br/>This made him slightly relieved.<br/><br/>That Strange Energy had been evaded!<br/><br/>In the next moment, he didn’t hesitate at all. He continued to flee forward at a terrifying speed.<br/><br/>After sensing the distance between Lan Qingyue and him, Wang Xian’s eyes sparkled.<br/><br/>“Eh? He actually dodged this move? I Can’t let him go!”<br/><br/>The eight level seven gods were slightly shocked when they saw this scene. Their faces were filled with astonishment.<br/><br/>Their bodies moved and they immediately gave chase!<br/><br/>“Trap him in this starry sky, Starfield Lock!”<br/><br/>One of the gods of level seven roared. He waved his arm and a surge of energy continued to be injected into the starfield fragment.<br/><br/>Buzz! Buzz! Buzz<br/><br/>The other seven gods also injected the power of faith.<br/><br/>Crash<br/><br/>In an instant, an invisible chain appeared. The chain instantly chased after Wang Xian.<br/><br/>“It’s Done!”<br/><br/>Wang Xian saw that Lan Qingyue had already escaped some distance away. With a move of his palm, the spatial scroll appeared in his hand.<br/><br/>It was his last chance to use it. Without any hesitation, he used it instantly.<br/><br/>Buzz<br/><br/>Buzz! Buzz<br/><br/>His figure started to turn illusory. However, what shocked Wang Xian was that he saw the illusory and mystical chain instantly enter his body.<br/><br/>Before he could sense anything, the scene around him had already undergone a huge change.<br/><br/>Teleportation was successful!<br/><br/>However, Wang Xian sensed that a surge of energy was located in his body. This made his heart sink.<br/><br/>His mind moved and he wanted to get rid of it. In the end, he realized that he couldn’t get rid of it no matter how hard he tried.<br/><br/>This made him frown.<br/><br/>What was going on?<br/><br/>“A chain appeared directly in my body. It’s illusory and weird. I have a bad feeling about it.”<br/><br/>Wang Xian’s expression was a little ugly.<br/><br/>This was the first time he had encountered such a strange and terrifying treasure.<br/><br/>It was similar to a curse, but it wasn’t a curse.<br/><br/>It seemed to be a binding force.\t\t\t\t\t\t</div>", "images": {}, "success": true}