{"id": 853, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073606.html", "title": "Chapter 3855 - 3855 3854 Kills, Under The Power Of The Heaven Origin Creation Fragment", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3855 - 3855 3854 Kills, Under The Power Of The Heaven Origin Creation Fragment</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\t3855 3854 kills, under the power of the heaven origin creation fragment<br/><br/>“The strength of every universe is not to be underestimated. I feel that the strength of the belief universe is much stronger than our nine origin universe.”<br/><br/>Upon hearing Lan Qingyue’s words, Wang Xian replied!<br/><br/>“Indeed. Based on the strength displayed by the belief universe, it is much stronger than our nine origin universe.”<br/><br/>Lan qingyue nodded. “I just don’t know which one is stronger in front of the Heaven’s origin creation.”<br/><br/>“It is very likely that they still believe in the universe. After all, they occupy two universes. According to the information I received, during the last calamity, there were five kings of the gods in the belief universe, the supreme gods!”<br/><br/>Wang Xian spoke.<br/><br/>Kings of the gods, the supreme gods. They were all addressed as powerhouses who believed in the universe.<br/><br/>“When the calamity arrives this time, I don’t know what the situation will be like. When a large number of universes collide, it will definitely be very terrifying.”<br/><br/>Lan Qingyue said.<br/><br/>Now, just their nine-origin universe and the belief universe coming to the starry universe were fighting like this.<br/><br/>When that time came, all the cosmic passages would be opened and there would be no suppression between the universes.<br/><br/>This would definitely be a bloody feast!<br/><br/>“When that time comes, with the strength of our Dragon Palace, we will be able to deal with the calamity!”<br/><br/>Wang Xian smiled and said with confidence!<br/><br/>The resources in his hands could help him to advance to the fourth level of the ruler realm, which meant he could be comparable to a powerhouse at the ninth level of the ruler realm.<br/><br/>Wang Xian had some guesses now. If he could advance to the seventh or eighth stage of the Dominator realm, would he be able to fight against the Heaven’s origin creation?<br/><br/>If he could advance to the ninth stage of the Dominator realm, would he be able to slaughter the Heaven’s origin creation?<br/><br/>This might be possible.<br/><br/>Wang Xian chatted with Lan Qingyue. After flying for more than a year, they sensed the existence of the crystal treasure again.<br/><br/>They moved and flew over immediately.<br/><br/>“HMM? The crystal energy in front of us seems to be of a higher level.”<br/><br/>Wang Xian and the rest flew over and spoke!<br/><br/>Lan qingyue nodded and waved her arm. A wave of energy grabbed the crystal energy.<br/><br/>“Roar!”<br/><br/>However, when Wang Xian and the rest made their move, an extremely terrifying roar was heard!<br/><br/>“Oh no, there’s a powerful space beast.”<br/><br/>When Wang Xian and the rest heard the roar, Lan Qingyue’s expression changed slightly.<br/><br/>“Woo Woo!”<br/><br/>Xiao Lan let out a low growl. Without any hesitation, they immediately fled to another location!<br/><br/>“Is it an undefeatable space beast?”<br/><br/>Wang Xian asked with a serious expression.<br/><br/>He could also feel a wave of pressure from the Space Beast’s growl.<br/><br/>“HMM, we shouldn’t be its match. I hope we don’t chase after it.”<br/><br/>Lan qingyue nodded her head with a solemn expression on her face.<br/><br/>“That space beast shouldn’t have chased after us. I feel that it is very far away from us.”<br/><br/>Wang Xian looked behind him and said with a frown.<br/><br/>After all, they were at the edge of the boundless starry sky. To them, it was also extremely dangerous.<br/><br/>They changed their direction and flew straight for about a month!<br/><br/>“The Dragon King of the Dragon Palace and the rest are right in front of us. They didn’t escape immediately. This time, we used all our strength to conceal the power of faith to some extent. We intercepted him and used the power of the galactic fragment directly!”<br/><br/>A level seven pantheon shouted loudly!<br/><br/>“Alright, get rid of them and leave this dangerous place!”<br/><br/>The other seven level seven gods responded immediately.<br/><br/>“I’ve sensed it!”<br/><br/>At this moment, they sensed the aura of Wang Xian and the rest.<br/><br/>At the same time, in order to avoid the space beast, Wang Xian and the rest swam in another direction for a month.<br/><br/>“Woo Woo Woo!”<br/><br/>Just when they felt that they could breathe a sigh of relief, Xiao Lan and the rest’s reminder suddenly came!<br/><br/>Lan qingyue immediately looked to the side and her gaze froze slightly.<br/><br/>“The experts from the belief universe are chasing us again. They have actually been behind us all this while.”<br/><br/>Lan Qingyue looked over and said!<br/><br/>Wang Xian also raised his eyebrows and his eyes revealed a cold expression.<br/><br/>The gods from the belief universe were really like dog skin that couldn’t be shaken off!<br/><br/>“Leave immediately!”<br/><br/>Wang Xian hesitated for a moment before speaking up!<br/><br/>Lan qingyue nodded her head.<br/><br/>To dare to chase after them like this, they must have a trump card!<br/><br/>“D * MN Dragon King of the Dragon Palace, you guys won’t be able to escape this time!”<br/><br/>At this moment, a voice filled with anger was heard.<br/><br/>Following that, Wang Xian and the rest saw eight figures stepping on faith books and flying towards them!<br/><br/>When Wang Xian heard that, he frowned slightly. With a move of his palm, a soul spear appeared in his hand instantly.<br/><br/>Whoosh<br/><br/>Wang Xian waved his arm and the soul spear in his hand shot towards them instantly.<br/><br/>“He’s courting death. We can’t let him escape this time!”<br/><br/>“Kill them!”<br/><br/>When the eight gods of level seven saw Wang Xian attacking, their eyes were filled with cold killing intent.<br/><br/>With a move of their palms, blue fragments appeared in their hands one by one!<br/><br/>The lock fragments were very small, only the size of a palm.<br/><br/>With a wave of their arms, the fragments rose into the sky above them.<br/><br/>The eight fragments merged together in an instant, forming an even larger fragment.<br/><br/>The eight gods of level seven waved their arms, and a surge of power of faith was injected directly into them.<br/><br/>One by one, the fragments appeared around Wang Xian’s star field.<br/><br/>Soon, eight belief meteorites that looked like stars attacked Wang Xian and the rest instantly.<br/><br/>The first thing that hit them was the impact of the eight belief meteorites on the soul spear.<br/><br/>“Bang!”<br/><br/>In just an instant, the soul spear collapsed instantly. The soul power that was gathered together instantly collapsed and dissipated!<br/><br/>Under this attack, the soul spear was completely destroyed and disappeared!<br/><br/>“PFFT!”<br/><br/>Wang Xian sensed that the soul spear was instantly destroyed and disappeared from the world. His expression changed drastically.<br/><br/>Due to the nourishment of his mind, the moment the soul spear was destroyed, a backlash was transmitted.<br/><br/>He couldn’t help but spit out a mouthful of blood!<br/><br/>After the collision with the soul spear, only one of the eight faith meteorites was used up. The remaining seven meteorites continued to attack Wang Xian and the rest.<br/><br/>Their speed was extremely terrifying!<br/><br/>“Not good, their attacks are extremely terrifying. This is definitely an attack comparable to the peak of the ruler realm. Run immediately!”<br/><br/>Wang Xian hurriedly said to Lan Qingyue!<br/><br/>Lan qingyue naturally knew how powerful the Soul Spears were.<br/><br/>When she saw this scene, her expression changed slightly. Without any hesitation, she immediately ordered Xiao Lan to bring them to escape!<br/><br/>At the same time, he waved his arm. Numerous spears condensed and attacked the seven belief meteorites.<br/><br/>Wang Xian also instantly condensed the energy of the Five Elements Millstone and the Tai Chi Dragon Disc and charged towards the remaining seven meteorites.<br/><br/>The attack speed of the belief universe was too fast. They couldn’t Dodge it at all. They had to face it head-on!<br/><br/>“Bang Bang Bang!”<br/><br/>A terrifying collision sound rang out.<br/><br/>The seven meteorites seemed to carry the power of the entire universe, extremely terrifying.\t\t\t\t\t\t</div>", "images": {}, "success": true}