{"id": 858, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073616.html", "title": "Chapter 3860 - Chapter 3860: 3859 Crystal Behemoth", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3860 - Chapter 3860: 3859 Crystal Behemoth</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3860: 3859 crystal behemoth<br/><br/>Translator: 549690339<br/><br/>“It has been 30 million years. I don’t know when I will be able to leave this space. In a few tens of millions of years, I might as well commit suicide and reincarnate before I have a breakthrough at the young Moon Realm! ”<br/><br/>Wang Xian mumbled as he flew towards the right side of the crystal region.<br/><br/>He had been trapped here for 30 million years. If he couldn’t get out, Wang Xian might as well consider committing suicide!<br/><br/>After committing suicide, he would still be able to resurrect with the ancestral tree around!<br/><br/>As for not being able to resurrect?<br/><br/>Wang Xian had never thought of this.<br/><br/>The fragment of the Starfield was most likely a fragment of a heaven-grade treasure. However, the ancestral tree was a true heaven-grade treasure.<br/><br/>Even if it had yet to reach its peak, it was still more powerful than a fragment of heaven-grade treasure.<br/><br/>As he thought about this, he scanned his surroundings.<br/><br/>In front of him, on his left, right, and back, there were four netherspirit avatars.<br/><br/>Wang Xian had to be extremely careful when exploring this space.<br/><br/>With the netherspirit avatars, he would be able to cover the front, back, left, and right. If there was any danger, he would immediately flee.<br/><br/>Furthermore, the Netherspirit avatars were sufficient to create a huge distance between him and them.<br/><br/>Even if he were to encounter a space behemoth that was at the seventh level of the ruler realm, he would still have sufficient time to escape!<br/><br/>The four Hades ‘avatars looked around vigilantly and kept exploring ahead.<br/><br/>This time, Wang Xian was prepared to go deeper!<br/><br/>Whoosh<br/><br/>Bang<br/><br/>When he was about to go deeper for half a month, the Hades’ avatars in front suddenly sensed a terrifying force attacking them.<br/><br/>By the time Wang Xian reacted, the Hades’ avatars had already suffered a fatal attack.<br/><br/>Buzz<br/><br/>Wang Xian immediately thought of something and the ghost avatar in front of him disappeared instantly.<br/><br/>“This is… that kind of crystal creature! ”<br/><br/>After the Ghost Avatar was recalled, Wang Xian summoned it again. He realized that the soul armor around the ghost avatar had already been damaged and needed time to repair it!<br/><br/>In just a split second, the battle armor that was comparable to a ruler of level eight was destroyed.<br/><br/>The strength of this crystal creature should not be weaker than the crystal creature that he encountered last time.<br/><br/>“Change Direction! ”<br/><br/>Wang Xian thought to himself. With a thought, he used the Netherspirit avatar behind him to deviate a little and continued to explore.<br/><br/>After changing direction, he did not encounter any more attacks from the crystal creature.<br/><br/>He flew in for another half a month.<br/><br/>“What is that?”<br/><br/>Suddenly, Wang Xian’s eyes widened. His face was filled with shock and disbelief.<br/><br/>In front of him was a dense cluster of energy crystals.<br/><br/>Different from ordinary crystals, these were energy crystals that contained vast amounts of energy!<br/><br/>The energy contained in each crystal was definitely of a higher level than the energy crystals that Wang Xian, Lan Qingyue, and the rest obtained!<br/><br/>The number of Energy Crystals was no less than 50!<br/><br/>“This… why are there so many energy crystals all of a sudden? This is insane. If we can obtain them, wouldn’t Xiao Lan and the rest be able to improve immediately?”<br/><br/>Wang Xian’s eyes glowed as he quickly scanned his surroundings.<br/><br/>The ghost avatar sized up the surroundings. With a move of his body, he instantly arrived in front of the more than 50 crystals<br/><br/>Buzz<br/><br/>The avatar of the Netherworld ghost stretched out his arm. Energy enveloped all the energy crystals and flew towards Wang Xian frantically.<br/><br/>The energy of the crystals was considered an external object. Unless the avatar of the Netherworld Ghost refined them, he could not bring them to Wang Xian in an instant!<br/><br/>However, Wang Xian did not have any considerations at the moment!<br/><br/>With so many energy crystals, he had to give it his all.<br/><br/>If he could get his hands on them, the rewards would be too great!<br/><br/>Then, he would be able to leave this place!<br/><br/>Even if it was dangerous!<br/><br/>At most, his netherspirit avatar would be scattered and reassembled. Once he could get his hands on them, it would be a huge profit!<br/><br/>“Roar! Roar! Roar!”<br/><br/>However, a roar came from behind.<br/><br/>When Wang Xian heard this voice, his heart tightened!<br/><br/>As expected, the crystal energy was guarded by a powerful space beast.<br/><br/>Wang Xian gritted his teeth and made his netherspirit avatar unleash its maximum speed.<br/><br/>Whoosh<br/><br/>However, in the next second, Wang Xian sensed an extremely huge crystal beast suddenly appearing from an ordinary crystal.<br/><br/>Although this crystal beast was much smaller than an ordinary space beast, it had already reached the size of hundreds of thousands of meters.<br/><br/>It looked the same as the crystal creature he had encountered previously. The only difference was that its energy was abnormally terrifying!<br/><br/>The moment it appeared, Wang Xian didn’t hesitate at all. He immediately controlled the Netherworld Phantom Avatar and threw the energy crystal in his hand in all directions.<br/><br/>“Roar! Roar!”<br/><br/>The Crystal Behemoth opened its mouth. There was fury in its eyes as it roared furiously.<br/><br/>Pieces of Energy Crystals flew into its mouth immediately.<br/><br/>At the same time, the doppelganger of the Netherworld Ghost sensed a surge of terrifying energy charging towards him!<br/><br/>This caused the doppelganger of the Netherworld Ghost to fly backward.<br/><br/>Buzz<br/><br/>Wang Xian’s mind stirred and the doppelganger of the Netherworld Ghost disappeared instantly!<br/><br/>Wang Xian didn ‘t hesitate at all as he transformed into the Netherworld Dragon!<br/><br/>He instantly arrived at the body of the Netherspirit avatar behind him and transformed!<br/><br/>After that, he recalled all the Netherspirit avatars and turned around to escape!<br/><br/>He didn’t have any lingering feelings!<br/><br/>Sensing that the crystal behemoth behind him didn’t chase after him, he heaved a heavy sigh of relief!<br/><br/>“The strength of this crystal behemoth is at least at the level of a dominator at level seven. It might be at the level of a dominator at level eight.”<br/><br/>Wang Xian mumbled.<br/><br/>However, even if it was at the level of a ruler of level seven, it was still an existence that could easily kill other rulers of level seven.<br/><br/>That terrifying power was too strong!<br/><br/>“As expected, this area isn’t that simple. It’s not easy to obtain more than 50 crystal behemoths! ”<br/><br/>Wang Xian’s eyes flickered, and he shook his head.<br/><br/>After recording the location, he hesitated for a moment before looking for a place to recover.<br/><br/>After recovering his strength to its peak, he was prepared to continue exploring.<br/><br/>Since the current situation wasn’t good, he might as well take a gamble.<br/><br/>At most, he would die!<br/><br/>If he didn’t die, he might turn from a bicycle into a motorcycle!<br/><br/>Earlier, he had already seen a motorcycle!<br/><br/>Unfortunately, he couldn’t bring it over.<br/><br/>After changing his position, Wang Xian continued to explore.<br/><br/>“Damn it, more than 30 million years have passed. Could it be that the Dragon King of the Dragon Palace has already left this area? Should we leave this place? It’s too dangerous here.”<br/><br/>At the same time, at a location not far away from Wang Xian, eight figures<br/><br/>were advancing bit by bit.<br/><br/>They had solemn expressions on their faces.<br/><br/>“Alright, don’t you think this is a good opportunity for us?”<br/><br/>A level seven pantheon looked at the complaining pantheon and said faintly!<br/><br/>“Hehe, that’s indeed the case. If it wasn’t for the Dragon King, we wouldn’t be qualified to use the galactic fragment. Now that we have the galactic fragment, although this area is dangerous, my gains aren’t small either! ” A rank seven pantheon narrowed his eyes and said with a smile..\t\t\t\t\t\t</div>", "images": {}, "success": true}