{"id": 862, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073624.html", "title": "Chapter 3864 - Chapter 3864: Once Again, 3863 Sent The Mighty Ones Of The Gods", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3864 - Chapter 3864: Once Again, 3863 Sent The Mighty Ones Of The Gods</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3864: Once again, 3863 sent the mighty ones of the gods<br/><br/>Translator: 549690339<br/><br/>“Roar Roar Roar! ”<br/><br/>The two netherspirit avatars stared at the crystal behemoth with vigilant expressions.<br/><br/>“Boom!”<br/><br/>But very soon, Wang Xian made the wrong bet!<br/><br/>The crystal behemoth was clearly able to sense the location of the CrystaPs energy. It moved its body and flew directly towards the corpse that was penetrated by the soul spear.<br/><br/>When the Netherworld Ghost clone saw this scene, his expression turned ugly. He immediately threw the soul spear away and returned in an instant!<br/><br/>Buzz<br/><br/>In the next instant, the Netherworld Ghost clone disappeared. The Soul Spear also flew rapidly towards Wang Xian’s direction.<br/><br/>“I failed. I didn’t manage to reap the benefits!”<br/><br/>When Wang Xian saw the two Netherworld ghost clones enter his body, he waved his arm and put away the soul spear as well.<br/><br/>Following that, the Netherspirit Dragon transformed and disappeared in an instant as it flew out.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The faint roar of the crystal behemoth could be heard from the back.<br/><br/>Although he didn’t manage to obtain more than 50 energy crystals this time, he managed to kill four level seven pantheon gods.<br/><br/>This had vented the anger in Wang Xian’s heart.<br/><br/>Furthermore, without the four level seven pantheon gods, their strength had been reduced by more than half.<br/><br/>Now, Wang Xian could leave safely when he faced them again.<br/><br/>If he were to call Lan qingyue over, the four level seven pantheon gods wouldn’t be their match even if they relied on the galactic fragment! Wang Xian thought to himself. Without any hesitation, he immediately contacted Lan Qingyue and the rest.<br/><br/>“Xiao Xian, what’s the situation?”<br/><br/>Soon, an lie brought Lan Qingyue to Wang Xian’s side.<br/><br/>“Currently, four out of the eight level seven pantheon gods have died. Even if the other four have powerful ultimate treasures, they are no match for us. Let’s go and look for them. Let’s see if we can find them and kill them! ”<br/><br/>Wang Xian said to Lan Qingyue.<br/><br/>Role reversal!<br/><br/>The reason why Wang Xian wanted to hunt down the other four level seven pantheon gods was firstly to seek revenge.<br/><br/>The most important reason was the starfield fragment in their hands!<br/><br/>The starfield fragment was very powerful and could release all kinds of energy attacks.<br/><br/>The power of flames, the special energy of destruction, and the power of black holes.<br/><br/>All of this was because of the powerful starfield fragment.<br/><br/>If Wang Xian could obtain it, it would be a huge profit.<br/><br/>After all, this was a heaven-grade fragment!<br/><br/>“Alright! ”<br/><br/>Lan qingyue nodded. “If we can destroy them, there might be some unexpected gains. Xiao Lan is not far from breaking through now. ”<br/><br/>“There was a certain chance of obtaining more than 50 starfield fragments just now. It’s a pity that we failed. ”<br/><br/>Wang Xian spoke.<br/><br/>Xiao Lan and the rest were at the level of a ruler at level six.<br/><br/>For a ruler at level six, it would not be so easy for them to improve.<br/><br/>Many powerhouses at the level of a ruler at level six could achieve a breakthrough in hundreds of millions of years. It was already very fast and extremely heaven – defying.<br/><br/>Xiao Lan and the rest had just broken through to the level of a ruler at level six.<br/><br/>Now, only about 30 million years had passed. If they wanted to improve quickly, they would need a large number of resources and treasures.<br/><br/>Based on the rate of improvement over the past 30 million years, Xiao Lan would probably need another 10 million years to improve. After all, Xiao Lan’s current realm was already very high.<br/><br/>Improving was not that simple anymore.<br/><br/>“Let’s go and look for those level seven pantheon now. As long as we destroy them, Xiao Xian, you will be able to leave this place. We will conceal ourselves for more than 10 million years. When Xiao Lan and the rest break through, we will take revenge! ”<br/><br/>Lan Qingyue said.<br/><br/>Wang Xian nodded. “Let’s go. They should be in this direction.” Lan qingyue nodded.<br/><br/>Xiao Lan and the rest were too huge, so they were left outside.<br/><br/>Once a battle broke out, Xiao Lan could come over instantly.<br/><br/>Wang Xian and Lan Qingyue moved and flew in one direction.<br/><br/>“Damn it, damn it. After the four of them died, our utilization of the power of the galactic fragment is only half of what it used to be. If we meet the Dragon King of the Dragon Palace again, we won’t be able to take him down!”<br/><br/>At the same time, the four rank 7 gods quickly fled outside.<br/><br/>At this time, their expressions were extremely ugly.<br/><br/>There were a total of eight star field fragments, and each star field fragment had been refined.<br/><br/>They were only borrowing the power of the star field fragment!<br/><br/>They had not refined it.<br/><br/>Now that half of them had died, it also meant that they had lost half of their power.<br/><br/>Now, with the help of the star field fragment, they could no longer match the strength of peak pantheon!<br/><br/>“I’ve already reported the situation on our side! ”<br/><br/>A Type 7 pantheon said solemnly!<br/><br/>“En, this time, it’s all because of that Dragon King setting us up. Otherwise, we wouldn’t be in such a miserable state! ”<br/><br/>A Type 7 pantheon nodded, his expression somewhat unsightly! “We must destroy the Dragon King as soon as possible! ”<br/><br/>A Tier 7 god beside him said with a face full of killing intent.<br/><br/>They weren’t in a hurry at first, but now, they had to destroy the Dragon King as soon as possible.<br/><br/>If they were to be set up the next time and die, then even if they could revive, it would be a huge loss for them!<br/><br/>It was better to destroy the Dragon King as soon as possible!<br/><br/>The four level 7 gods reported the news.<br/><br/>At the same time, in the space passage of faith.<br/><br/>The elders of the four palaces frowned slightly when they received the news.<br/><br/>They looked at the elders of the other four palaces and said, “The expert with the star field fragment has died. ”<br/><br/>“I’ve received the news that they were killed by the Dragon King of the Dragon Palace by luring a space beast. We’ll send more people over! ”<br/><br/>An elder of the palace nodded calmly. He had just received the news that the level seven gods with the star field fragment had a resurrection treasure.<br/><br/>The moment he died, he had already sent the news to him.<br/><br/>They had already understood the outcome of the matter.<br/><br/>“I think we should eliminate the Dragon King of the Dragon Palace as soon as<br/><br/>possible in order to avoid more trouble!”<br/><br/>The elder said.<br/><br/>“Indeed, eliminating the Dragon King of the Dragon Palace is ranked first, and eliminating the experts of the other peak races in the nine-origin universe is ranked second. ”<br/><br/>An elder from a palace beside him nodded. “Then let’s send all the level 7 gods of the ten palaces over this time. However, we must be careful not to provoke the powerful space behemoth over there. ”<br/><br/>“Alright, find the Dragon King of the Dragon Palace as soon as possible and destroy him. Don’t make any mistakes. ”<br/><br/>The other elders nodded in agreement.<br/><br/>Now that 30 million years had passed, although they had been fighting with the nine-origin universe, their strength was getting stronger and stronger.<br/><br/>The belief universe and the nine-origin universe didn’t erupt in such a world-shaking battle, and the top-tier experts rarely suffered casualties.<br/><br/>Both sides restrained themselves a little.<br/><br/>They fought while searching for resources and opportunities.<br/><br/>This also made both sides’strength not decrease, but increase instead.<br/><br/>Of course, if it weren’t for the Dragon King of the Dragon Palace, they would have sent all their armies to destroy the nine-origin universe long ago.<br/><br/>There was a reason why the 24 palaces hadn’t gathered all their forces to fight against the nine-origin universe in the past 30 million years.<br/><br/>The 24 palaces knew that the 9-source universe was the only foundation for their cooperation.<br/><br/>If they didn’t have the 9 -source universe, they would fight among themselves because of the resources in the universe.<br/><br/>Therefore, if they really wanted to fight among themselves, they had to remove all the hidden dangers.<br/><br/>Especially the Dragon King of the Dragon Palace who could destroy an army of one palace by himself. This hidden danger had to be eliminated first..\t\t\t\t\t\t</div>", "images": {}, "success": true}