{"id": 866, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073632.html", "title": "Chapter 3868 - Chapter 3868: 3867, The Total Attack Of The Nine-Origin Universe", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3868 - Chapter 3868: 3867, The Total Attack Of The Nine-Origin Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3868: 3867, the total attack of the nine-origin universe<br/><br/>Translator: 549690339<br/><br/>“But that’s also true. The full power of the belief universe has yet to be displayed. The last time, the 24 temples of the belief universe were prepared to destroy the nine-origin universe. Because of their appearance, their plans were completely disrupted! ”<br/><br/>Wang Xian mumbled as his eyes sparkled!<br/><br/>Wang Xian wasn’t clear about the true power of the nine-origin universe. However, the power of the 24 temples was truly terrifying.<br/><br/>If it was Wang Xian’s own guess, it was because the belief universe was stronger.<br/><br/>“However, I have killed seven level seven pantheon gods this time. The belief universe might still take action. Now, the nine-origin universe might really be able to achieve victory on the battlefield!”<br/><br/>Following that, Wang Xian thought about the situation on his side.<br/><br/>It could be said that he had single-handedly blocked almost half of the power of the belief universe.<br/><br/>If it weren’t for him, the nine-origin universe would have been destroyed tens of millions of years ago!<br/><br/>After all, the belief universe at that time had 24 legions from the 24 palaces. It was too terrifying!<br/><br/>“Dragon King, should we participate?”<br/><br/>At this moment, Prime Minister Gui sent another message.<br/><br/>Wang Xian saw this message and pondered for a moment.<br/><br/>“If we don’t participate, tell them that we won’t be able to make it in time.<br/><br/>Also, our Dragon Palace is too weak. We won’t be able to help in this war.” Wang Xian replied to Prime Minister Gui.<br/><br/>There was no need for the Dragon Palace to participate in a war of this level.<br/><br/>Although the voodoo race had an 80% chance of winning the war, there would definitely be casualties.<br/><br/>In a war of this level, there was a high chance that even a ruler of level seven would perish!<br/><br/>Not to mention that he was trapped here while Lan Qingyue brought Xiao Lan and the rest to level up!<br/><br/>There was another point.<br/><br/>The other peak races now had combat strength comparable to a ruler of level 9, and the experts of the belief universe also had such strength.<br/><br/>And if the Dragon Palace didn’t go, the strongest one would only be a ruler of level 6.<br/><br/>There was a difference of two levels, and if one wasn’t good, the Dragon Palace could be destroyed!<br/><br/>Furthermore, under such circumstances, if the Dragon Palace was in danger, there might not be anyone to support the Dragon Palace.<br/><br/>At that time, the losses would be huge!<br/><br/>Therefore, the Dragon Palace would definitely not be able to participate in this battle!<br/><br/>Prime Minister Gui received the message from Wang Xian and nodded slightly.<br/><br/>“Everyone, Pm afraid our Dragon Palace will not be able to participate in this battle. The Dragon King and the Dragon Queen of our Dragon Palace are currently in a deeper part of the starry universe and can not make it in time. Other than the Dragon King and the Dragon Queen, Our Dragon Palace does not have any powerful combat strength. Therefore, I’m Sorry Everyone! ”<br/><br/>At the nine-origin universe passage, Prime Minister Gui looked at the other twelve peak races and said.<br/><br/>The other twelve peak races slightly raised their eyebrows when they heard prime minister Gui’s words.<br/><br/>Especially the angel race and the Phoenix race, who were staring at Prime Minister Gui.<br/><br/>“This is a battle between our nine-origin universe and the belief universe. is it really okay if the Dragon Palace doesn ‘t participate?”<br/><br/>An angel of Light, who was in the ninth level, said faintly.<br/><br/>“We have no choice. If the Dragon King and the Dragon Queen of the Dragon Palace could come, we would definitely participate. But I’m afraid we can’t. Besides, the Dragon King has also sent us a message. Let me explain to you that without the Dragon King and the Dragon Queen of the Dragon Palace, our<br/><br/>Dragon Palace is still too weak. ”<br/><br/>Prime Minister Gui shook his head and said without changing his expression.<br/><br/>No matter what, the Dragon Palace could not participate in this great battle. “Our nine-origin universe is a whole. Since the Dragon King and the others can’t participate, let the other disciples participate. Your Dragon Palace has produced a large number of rulers over the past tens of millions of years! ” A water phoenix from the Phoenix Clan said indifferently.<br/><br/>(‘I won’t hide it from everyone. Our Dragon Palace’s Dragon King is currently in a place where the starry universe is biased towards the belief universe. Our Dragon Palace’s Dragon King and Dragon Empress have killed a large number of belief universe gods. Now, our Dragon King is trapped in a region and can ‘t return for the time being. ”<br/><br/>Prime Minister Gui looked at the Phoenix clan and continued to explain.<br/><br/>At the same time, he revealed some information.<br/><br/>“Hehe, is that so?”<br/><br/>The Phoenix clan chuckled, obviously not believing Prime Minister Gui’s words.<br/><br/>In their eyes, this was just an excuse of the Dragon Palace!<br/><br/>“Maybe the Dragon King of the Dragon Palace is currently in the depths of the starry universe, obtaining a large amount of resources! ” An angel of light from the Angel clan also said coldly!<br/><br/>Prime Minister Gui frowned slightly. It was not convenient!<br/><br/>This thing could not be explained clearly.<br/><br/>Could it be that we told them that the Dragon King of the Dragon Palace had destroyed the army of the 24 palaces of the belief universe. There were more than 100 level seven pantheon gods?<br/><br/>More than 80,000 pantheon gods?<br/><br/>This was obviously impossible. Prime Minister Gui could not reveal this information to them.<br/><br/>After all, the faith of the gods was a powerful resource.<br/><br/>The more powerful the dragon palace became, the more alert the angel and Phoenix clans would be.<br/><br/>Secondly, even if Prime Minister Gui told them, they might not believe him.<br/><br/>“It’s fine if the Dragon Palace doesn’t participate, but the Dragon King and the others probably won’t be able to come. After all, they didn’t hesitate to ask the Dragon Palace for help the last time! ”<br/><br/>At this moment, a great elf from the Elf clan said.<br/><br/>“Although we lack the strength of the Dragon King and the Dragon Queen of the Dragon Palace, we have enough strength! ”<br/><br/>A skeleton king from the skeleton clan also said.<br/><br/>The Elf clan and the skeleton clan were closer to the Dragon Palace, so they helped to say a word.<br/><br/>“Well, the peak strength of the Dragon Palace is indeed a bit less. It doesn’t matter. ”<br/><br/>The ancestor witch of the Witch clan didn’t say anything and nodded.<br/><br/>In this situation, they couldn’t force it.<br/><br/>Although the Dragon Palace had developed rapidly in the past tens of millions of years, in the eyes of the old top-notch races like them, the Dragon Palace was still far behind.<br/><br/>Especially in terms of peak combat strength.<br/><br/>In the starry universe, the Dragon King and the Dragon Queen of the Dragon Palace could bring out their strength.<br/><br/>However, if the other party was only at the level 8 ruler realm, they wouldn ‘t be able to affect the battle!<br/><br/>Prime Minister Gui cupped his fists at them and left apologetically!<br/><br/>He didn’t participate in the next attack of the nine-origin universe.<br/><br/>However, he could guess that the nine-origin universe would launch a swift and fierce counterattack.<br/><br/>“The hatred between the angel race and the Phoenix race can not be resolved! ”<br/><br/>Wang Xian’s eyes sparkled when he received all the news from Prime Minister Gui.<br/><br/>This was especially so for the angel of light and the Water Phoenix race. They might launch an attack on the dragon palace the moment they had the chance.<br/><br/>“However, the Dragon Palace is not afraid of You Now! ”<br/><br/>Wang Xian’s eyes sparkled.<br/><br/>Once Lan Qingyue and the rest were upgraded, the Dragon Palace would be safe in the starry universe.<br/><br/>They could even spend billions of years in safety!<br/><br/>At that time, it would be uncertain who was stronger and who was weaker!\t\t\t\t\t\t</div>", "images": {}, "success": true}