{"id": 864, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073628.html", "title": "Chapter 3866 - Chapter 3866: Three Thousand Eight Hundred And Sixtyfive Killed Three People And Disappeared Into The Starry Sky!", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3866 - Chapter 3866: Three Thousand Eight Hundred And Sixtyfive Killed Three People And Disappeared Into The Starry Sky!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3866: Three thousand eight hundred and sixtyfive killed three people and disappeared into the starry sky!<br/><br/>Translator: 549690339<br/><br/>“The Dragon King and the others are very fast. We have to think of a way to get rid of them, or else we’ll be finished! ”<br/><br/>The four rank seven pantheon gods were running in front of them. They felt the dragon king chasing after them, and their expressions were extremely ugly!<br/><br/>The Dragon King and the others’ strength had exceeded their expectations.<br/><br/>They could no longer match up to them!<br/><br/>“Damn it! ”<br/><br/>The four of them gritted their teeth and roared, “Explode! ”<br/><br/>As they spoke, they waved their arms and a majestic power of faith surged into the fragment of the Starfield.<br/><br/>The surging starfield fragment increased their speed by a lot!<br/><br/>In an instant, they pulled away from Wang Xian and the rest and fled forward.<br/><br/>“Huh?”<br/><br/>At the back, Lan Qingyue raised her eyebrows slightly when she saw this scene.<br/><br/>“They have the remaining energy from me. They can’t escape! ”<br/><br/>Wang Xian said faintly when he saw the four figures disappearing quickly!<br/><br/>Lan qingyue nodded her head.<br/><br/>“Huff! Huff! “<br/><br/>60% of the power of faith surged into the starfield fragment continuously.<br/><br/>They felt that they had escaped from the pursuit of Wang Xian and the rest and heaved a sigh of relief.<br/><br/>“Let’s Find a place to hide first and recover the power of faith in our bodies. When our reinforcements arrive, we will make the Dragon King of the Dragon<br/><br/>Palace pay the price! ”<br/><br/>A level seven pantheon said with a cold expression!<br/><br/>The other level seven pantheon nodded.<br/><br/>They continued to fly in one direction!<br/><br/>“Whoosh! Whoosh! Whoosh! ”<br/><br/>However, when they slowed down for half an hour, they suddenly felt a familiar energy coming from behind them.<br/><br/>This caused their expressions to change drastically!<br/><br/>“Damn it, how did they know we were here? How did they catch up?”<br/><br/>The four rank 7 Pantheon’s expressions changed drastically!<br/><br/>They did not hesitate once more. Their bodies moved, and the power of faith surged into the Starfield fragment!<br/><br/>A large amount of the power of faith activated the power of the Starfield fragment, causing their speed to increase drastically once again.<br/><br/>This time, they had used up 20% of the power of faith. There was 20% of the power of faith left in their bodies in case of danger!<br/><br/>“Quick, Hide First! ”<br/><br/>Their bodies moved and found the locations of some secret manuals and crystals to hide their bodies.<br/><br/>However, in less than 20 minutes, they sensed Wang Xian and the rest again.<br/><br/>“We’ve been locked on. We’ve been locked on by the Dragon King of the Dragon Palace and the rest with special energy! ”<br/><br/>One of the level seven Pantheon’s eyes revealed a hint of fear as he exclaimed in shock!<br/><br/>The other three level seven Pantheon’s expressions would also turn ugly.<br/><br/>“I have a treasure that can allow me to escape for a long distance in an instant. However, I’m the only one who can escape!”<br/><br/>A level seven pantheon suddenly spoke up!<br/><br/>The other three level seven pantheon were slightly silent.<br/><br/>“The power of faith in our bodies has been depleted too much. Let’s have a final showdown with the Dragon King of the Dragon Palace. Whoever can escape will be able to escape. If not, everyone should have a resurrection treasure! ”<br/><br/>A level seven pantheon spoke with a solemn face! The other three could only nod helplessly.<br/><br/>“You can’t escape!”<br/><br/>At this moment, Wang Xian’s voice was heard!<br/><br/>This made the four level seven pantheon gods ‘faces turn extremely cold!<br/><br/>“Kill!<br/><br/>They let out a low growl and waved their arms. A surge of power of faith was injected into the starfield fragment!<br/><br/>One by one, meteorites that were like shooting stars covered Wang Xian and the rest at a terrifying speed.<br/><br/>“Roar! Roar! Roar!”<br/><br/>Xiao Lan and the rest let out a low roar as waves of energy charged toward the meteors.<br/><br/>Wang Xian waved his arm and the Tai Chi Dragon Plate met the attack. Lan qingyue immediately unleashed a powerful attack to defend herself!<br/><br/>“Boom! Boom! Boom!”<br/><br/>The collision began once again!<br/><br/>The attack from the starfield fragments was once again blocked by Wang Xian and the rest!<br/><br/>Wang Xian and the rest moved and immediately charged toward them!<br/><br/>“It’s over! ”<br/><br/>(‘We must kill this Dragon King of the Dragon Palace. We must! ”<br/><br/>The three level seven pantheon gods trembled violently when they saw this scene. Their eyes were a little red!<br/><br/>“Escape from the sea of bitterness! ”<br/><br/>The other level seven pantheon gods trembled. The Shadows of his believers appeared above his head. The Shadows turned into an ocean and slowly drowned him!<br/><br/>He spat out a bead which was like a relic.<br/><br/>Buzz<br/><br/>In the next second, the bead flew in a direction at a terrifying speed.<br/><br/>In the blink of an eye, it disappeared!<br/><br/>However, there was a corpse left on the spot!<br/><br/>One of the tier 7 pantheon disappeared, and the other three looked even more embarrassed.<br/><br/>They moved and controlled the fragment of the Starfield to attack Wang Xian again.<br/><br/>“Huh?”<br/><br/>Wang Xian was slightly astonished when he saw four level seven pantheon gods suddenly leaving behind a corpse.<br/><br/>One of the level seven pantheon gods died mysteriously all of a sudden.<br/><br/>The other three level seven pantheon gods controlled the galactic fragment to attack them.<br/><br/>However, their attack power was greatly weakened once again! This power was no longer able to threaten Wang Xian and the rest!<br/><br/>“Let’s kill these three first! ”<br/><br/>Wang Xian growled and controlled the Five Elements Millstone, the Tai Chi Dragon Disc, and the soul spear to attack the three level seven gods.<br/><br/>Lan qingyue, Xiao Lan, and the rest also launched their terrifying attacks!<br/><br/>Boom! Boom<br/><br/>The terrifying collision sounded again. However, this time, the three level seven gods were hit by the aftershock of the collision and were instantly sent flying backward!<br/><br/>“Dragon King of the Dragon Palace, you will soon die at the hands of the experts of the universe of faith. Just you wait! ” One of the level seven gods roared crazily!<br/><br/>“You guys will die first! ”<br/><br/>Wang Xian snorted coldly. His body moved and appeared in front of them directly.<br/><br/>This time, the three level seven gods did not resist anymore.<br/><br/>The power of faith in their bodies was not enough for them to resist anymore!<br/><br/>They stared at Wang Xian coldly.<br/><br/>“PFFT! PFFT! PFFT!”<br/><br/>The soul spear penetrated their bodies.<br/><br/>“Whoosh! ”<br/><br/>Wang Xian ignored their corpses and flew toward the galactic fragment!<br/><br/>He moved his palm and a wave of energy wrapped around it!<br/><br/>“Buzz! Buzz! Buzz! ”<br/><br/>However, the galactic fragment emitted a ray of light and broke through Wang Xian’s restraints in an instant!<br/><br/>Stay here! ”<br/><br/>Wang Xian focused his gaze. The power of the Five Elements Millstone and the Tai Chi Dragon disc instantly surged towards it!<br/><br/>Whoosh<br/><br/>However, in the next instant, the fragment of the Starfield vanished into thin air!<br/><br/>“Huh?”<br/><br/>Wang Xian looked at the disappearing fragment of the Starfield and frowned slightly!<br/><br/>“It should be some strong people who believe in the universe who placed some restrictions on it. ”<br/><br/>Lan Qingyue flew over and said!<br/><br/>“What a pity! ”<br/><br/>Wang Xian said with a face full of regret.<br/><br/>It would be great if he could obtain this starfield fragment!<br/><br/>However, it was clear that the belief universe would not allow such a treasure to be lost.<br/><br/>It was even possible that there was an existence at the Heaven’s origin level who placed some restrictions on it.<br/><br/>It was to prevent others from taking it away!\t\t\t\t\t\t</div>", "images": {}, "success": true}