{"id": 867, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073634.html", "title": "Chapter 3869 - Chapter 3869: Victory And Defeat", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3869 - Chapter 3869: Victory And Defeat</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3869: Victory and defeat<br/><br/>Translator: 549690339<br/><br/>Time passed by slowly. Wang Xian was searching for the level seven pantheon in the ocean at the edge of the starry universe.<br/><br/>Unfortunately, this place was too big. The chances of encountering him were too small!<br/><br/>This did not make Wang Xian feel too helpless.<br/><br/>After all, the level seven pantheon who believed in the universe the last time spent more than 20 million years to find him.<br/><br/>However, I estimate that there might be experts from the belief universe coming over to provide support. There should be at least seven rank seven gods to regain control of the Starfield fragment<br/><br/>Wang Xian thought to himself.<br/><br/>As for saying that there would be experts from the belief universe coming over to provide support, Wang Xian was not worried.<br/><br/>At the worst, he could hide around the crystal behemoth’s domain.<br/><br/>The group of gods who believed in the universe did not dare to be too arrogant around the crystal behemoth’s domain.<br/><br/>Once there were more of them, it would be very easy to attract the crystal behemoth!<br/><br/>A year passed very quickly.<br/><br/>In the nine-origin universe, a huge battle between the nine-origin universe and the belief universe suddenly broke out.<br/><br/>Wang Xian didn’t know the exact details of the battle. When he received the news, the battle had already ended!<br/><br/>The news was sent by Prime Minister Gui. According to Prime Minister Gui, the nine-origin universe had won a great victory this time!<br/><br/>“Hahaha, this time, we have won a great victory in the war against the belief universe. More than 200 rank 7 gods of the belief universe were killed by the experts of our 9-origin universe. We also killed four or five of the level 6 Space Beasts! ”<br/><br/>“The strength of the voodoo race is very terrifying. The Space Beast puppet of the voodoo race is simply too powerful!”<br/><br/>“There’s an expert of the voodoo race who actually transformed the body of the space beast and eliminated a large portion of the suppression of the cosmos. He erupted with the terrifying combat strength of a ruler at the ninth stage realm. It’s too powerful!”<br/><br/>“The demon race is also very powerful. The skeleton race’s Sea of skeletons is very shocking. The ELF race, Phoenix race, and Angel race are all very powerful! ”<br/><br/>“This is so exciting. The gods of the nine-origin universe were killed by US until they fled in panic. Hahaha, this is so great! ”<br/><br/>“Is this the power of the peak race of the nine-origin universe? It’s very powerful! ”<br/><br/>“Although many masters of the ruler realm have died on our side, the number of gods who believe in the universe died five to six times more than us! ”<br/><br/>Wang Xian opened the communication stone plate and saw all kinds of information.<br/><br/>Looking at some of the information on it, his eyes sparkled.<br/><br/>“They actually killed nearly two hundred rank seven gods of the belief universe. As expected, the peak races have also experienced a huge improvement over the past tens of millions of years. ”<br/><br/>Wang Xian mumbled.<br/><br/>In the beginning, due to the suppression of the universe, the strongest ruler of the seventh level was the strongest.<br/><br/>However, as time passed, the foundations and trump cards of the various peak races were revealed one by one.<br/><br/>This battle could be said to be a great victory for the nine-origin universe.<br/><br/>Wang Xian smiled faintly and browsed through the information one by one.<br/><br/>In this battle, the veteran peak races displayed their terrifying strength.<br/><br/>Especially the strength of the shaman race.<br/><br/>The strength of the shaman race should be ranked at the top among the peak races.<br/><br/>“HMM?”<br/><br/>At the same time, all the elders of the 24 temples in the belief universe also received this sudden news.<br/><br/>When they received some information from their subordinates, their faces darkened and revealed a cold expression.<br/><br/>“The peak race of the 9-origin universe actually suddenly joined hands to attack our army. We were completely caught off guard and suffered heavy losses. ”<br/><br/>An elder of a palace said with a gloomy face.<br/><br/>“The strength displayed by the 9-origin universe this time isn’t weak. At least 12 or 13 of US combined aren’t a match for them. ”<br/><br/>An elder frowned slightly and added.<br/><br/>“This time, our palace has suffered heavy losses. We have to settle the matter of the Dragon Palace’s Dragon King and the nine-origin universe first. ” An elder of the palace said with some anger.<br/><br/>This time, 50 or 60 of their palace’s Level 7 gods had died, which was a huge loss for them.<br/><br/>“The Dragon King of the Dragon Palace, the level 7 gods of our ten palaces should have already arrived at that area. However, I’m afraid we’ll have to search for him before we can destroy him. ”<br/><br/>An elder said.<br/><br/>“How much time will that take?”<br/><br/>Another elder asked.<br/><br/>Now that the 9-origin universe had defeated their belief universe, the elders didn’t look too happy.<br/><br/>If all the powers of the 24 palaces were gathered together, how could the nine-origin universe be their match?<br/><br/>They were 100% confident that they could destroy them.<br/><br/>“The Dragon Palace Dragon King isn’t sure when he can be destroyed, but I think we can shift our focus. In the past, we thought of destroying the Dragon Palace Dragon King first, but now, we can destroy all the people in the nine-origin universe first. ”<br/><br/>“After we destroy them, we can deal with the Dragon King of the Dragon<br/><br/>Palace. After all, the Dragon King of the Dragon Palace has been trapped in an<br/><br/>area by us. ”<br/><br/>An elder glanced at everyone and said.<br/><br/>“I agree with that. Let’s trap the Dragon King in that area first. We’ll deal with the experts of the nine-origin universe first. ”<br/><br/>An elder echoed.<br/><br/>They had originally thought of killing the Dragon Palace Dragon King first.<br/><br/>But the sudden attack of the nine-origin universe made them change their minds again.<br/><br/>The Dragon Palace Dragon King was already trapped in an area, and there was no threat.<br/><br/>But the experts of the nine-origin universe were different.<br/><br/>There were still more than a dozen terrifying forces in the nine-origin universe.<br/><br/>Their strength and foundation were very strong.<br/><br/>The belief universe couldn’t be underestimated.<br/><br/>“Now, the tier 7 gods of the ten palaces have already headed to the ocean at the edge of the infinite star field. Should we transfer them over? Let them join the battlefield?”<br/><br/>An elder said with a frown.<br/><br/>“Call them back. Let’s also plan to make the 9-origin universe pay the price of blood! ”<br/><br/>An elder nodded, his eyes filled with a cold expression. “If it weren’t for this Dragon Palace Dragon King holding them back, we would have been able to exterminate them and expel them from the 9-origin universe tens of millions of years ago!”<br/><br/>“It’s the same if we exterminate them now. However, I suggest that we place the rank seven pantheon of the two palaces at the edge of the boundless starry sky to prevent any accidents from happening last time. ”<br/><br/>One of the elders glanced around and said.<br/><br/>“Alright, then we’ll deal with the peak races of the nine-origin universe first. After all, the Dragon King of the Dragon Palace is hiding now, and it might not be so easy to kill him.”<br/><br/>“Sure. With the power of two palaces, there are 200 to 300 rank seven gods, and the treasures from the starfield fragments are enough to kill the Dragon King of the Dragon Palace. ”<br/><br/>“If that’s the case, then get ready to counterattack! ”<br/><br/>The elders of the 24 palaces began to discuss..\t\t\t\t\t\t</div>", "images": {}, "success": true}