{"id": 861, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073622.html", "title": "Chapter 3863 - Chapter 3863: 3862 Starfield Fragments Versus The Crystal Beast", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3863 - Chapter 3863: 3862 Starfield Fragments Versus The Crystal Beast</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3863: 3862 starfield fragments versus the Crystal Beast<br/><br/>Translator: 549690339<br/><br/>“Weng Weng Weng Weng! ”<br/><br/>A terrifying crystal horn flew out from the Crystal Beast’s head.<br/><br/>In the surroundings, countless ordinary crystals surged towards the crystal horn.<br/><br/>In an instant, they entered the single horn of the Crystal Beast.<br/><br/>The single horn, along with countless ordinary crystals, emitted a terrifying strength.<br/><br/>The horn brought with it a terrifying might as it charged towards the eight rank 7 gods.<br/><br/>The horn’s speed was even more terrifying than the eight star chains of the eight rank 7 gods.<br/><br/>After all, this was the territory of the Crystal Behemoth!<br/><br/>“Not good!”<br/><br/>The eight rank 7 gods felt the horn of the crystal behemoth charging towards them. Their hearts pounded, and their faces were filled with fear.<br/><br/>Especially the last Type 7 god, when he saw the horn charging towards him, he was filled with fear.<br/><br/>“Defend! ”<br/><br/>He quickly shouted out!<br/><br/>The other 7 gods gritted their teeth, preparing to channel their energy into the starfield fragment to defend.<br/><br/>However, the horn suddenly sped up and disappeared.<br/><br/>It reappeared behind the Type 7 god and rammed into him.<br/><br/>A terrifying collision sound rang out.<br/><br/>The body of the Type 7 god crumbled under the impact.<br/><br/>“No, no, no, save me, save me!”<br/><br/>The Type 7 god felt death approaching, and his face was filled with despair as he roared out.<br/><br/>“Damn it! ”<br/><br/>Seeing this, the other seven pantheon gods had ugly expressions on their faces.<br/><br/>They had no time to save them.<br/><br/>One of them was killed by the horn.<br/><br/>The horn continued to attack the second one.<br/><br/>“Quick, quick, block this attack! ”<br/><br/>Seeing the attack coming towards him, the second pantheon God’s heart pounded and he shouted in fear.<br/><br/>“Star field, white dwarf star! ”<br/><br/>The few Type 7 gods in front roared out, and the star beneath their feet disappeared.<br/><br/>A white planet that was thick and heavy slammed towards the horn.<br/><br/>“Boom! Boom! Boom!”<br/><br/>The white dwarf star collided with the terrifying horn.<br/><br/>The Type 7 god, who was near the center, spat out a large amount of blood under the terrifying impact.<br/><br/>“Faith, sacrifice, heal!”<br/><br/>He hurriedly roared, and the phantoms of his followers appeared in the sky above him.<br/><br/>The Phantoms of his followers collapsed, turning into the power of faith to resist the impact.<br/><br/>The powerful book beneath him also resisted the terrifying attack!<br/><br/>However, the collision between the single-horned beast and the white dwarf star was too terrifying.<br/><br/>His body fell downwards, instantly losing all life!<br/><br/>“Not good, with the two of them dead, our control over the starfield fragment will be reduced by two, and its power will be reduced by a quarter. ”<br/><br/>A tier 7 pantheon saw that the single-horned beast had killed two of his members in an instant, and his face revealed an incomparably grave expression.<br/><br/>“Final counterattack, Starfield Black Hole Tide, Flee! ”<br/><br/>One of the Type 7 gods roared out, sending his power of faith into the starfield fragment.<br/><br/>The remaining five Type 7 gods also hurriedly sent their power of faith.<br/><br/>Black holes appeared one after another, attacking the Unicorn and the crystal beast.<br/><br/>The powerful unicorn was swallowed by one black hole, coming out from the other.<br/><br/>However, after the horn came out, its energy was greatly weakened.<br/><br/>Similarly, it was also very far away from them!<br/><br/>The Crystal Behemoth hurriedly dodged the attacks of the black holes.<br/><br/>The six Type 7 gods did not hesitate at all, frantically fleeing into the distance. “Hehe, after losing two Type 7 gods, their strength is much weaker. We can’t let them escape so easily, and create some trouble for them.”<br/><br/>At the back, the two netherspirit avatars stared at this scene once more.<br/><br/>The two netherspirit avatars moved their palms, and Soul Spears appeared in their hands.<br/><br/>The Netherspirit avatars hid at the side, quietly waiting for the right time.<br/><br/>“This is the time! ”<br/><br/>When they fled in this direction.<br/><br/>The crystal behemoths behind them continued to chase after them, and the surrounding seawater attacked them.<br/><br/>The remaining six rank 7 gods hurriedly used the power of the starfield fragment to resist.<br/><br/>The next second after they used the power of the starfield fragment…<br/><br/>The Dark Ghost clone’s spear directly attacked two of the rank 7 gods.<br/><br/>If these gods didn’t rely on the power of the starfield fragment, their strength wouldn’t be strong at all.<br/><br/>Relying on the book of faith in their hands, their strength would be able to resist a ruler at the rank 8 realm.<br/><br/>The Soul Spear was a great killing weapon for a ruler of the ninth rank.<br/><br/>The moment they used the star field fragment, the soul spear arrived in front of the bodies of the two rank seven gods.<br/><br/>The sudden attack shocked the two rank seven gods.<br/><br/>“There’s a sneak attack! It’s the Dragon King of the Dragon Palace!”<br/><br/>“That Damn Dragon King of the Dragon Palace is ambushing us! ”<br/><br/>The two tier 7 gods who had been attacked immediately roared!<br/><br/>They moved their palms, and the book of faith under them instantly blocked in front of them.<br/><br/>At this time, the star field fragment could no longer be used in an instant.<br/><br/>However, in the next second, the soul spear pierced through their book of faith and directly pierced through their heads.<br/><br/>The terrifying power caused them to die instantly without even letting out a scream.<br/><br/>Whoosh! Whoosh<br/><br/>The ghost clone controlled the soul spear and flew toward them with the two corpses.<br/><br/>“Damn Dragon King of the Dragon Palace! ”<br/><br/>The death of their two companions instantly caused the remaining four rank seven gods to feel like their eyes were about to pop out of their sockets!<br/><br/>Of the eight rank seven gods, only four were left.<br/><br/>This caused their control over the star field fragment to drop to the extreme.<br/><br/>The amount of power they could mobilize was also reduced by half.<br/><br/>They looked at this scene with bloodshot eyes.<br/><br/>“Grab the corpse. The energy crystal is over there.”<br/><br/>A rank 7 pantheon immediately roared.<br/><br/>“Roar Roar Roar! “<br/><br/>However, at this time, the sound of the Crystal Beast’s roar could be heard from the rear.<br/><br/>The remaining four rank 7 pantheon heard this roar and their bodies trembled violently.<br/><br/>There were only four of them left. With their strength, they were not a match for this Crystal Beast!<br/><br/>Sensing the fatal power coming from behind, they looked at each other and gritted their teeth.<br/><br/>They shouted indignantly and hurried to the sky above the star field fragment.<br/><br/>Waves of energy surged into it, and the star field fragment quickly brought them to escape!<br/><br/>The soul spear pierced through the two corpses and flew toward the Netherspirit’s body.<br/><br/>The two netherspirit’s bodies were only staring at the Crystal Beast!<br/><br/>They made another bet. If the Crystal Beast continued to chase after the four gods, the two corpses would be collected smoothly.<br/><br/>They would be able to obtain more than fifty energy crystals..\t\t\t\t\t\t</div>", "images": {}, "success": true}