{"id": 860, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073620.html", "title": "Chapter 3862 - Chapter 3862: 3861 Star Field Fragment Versus The Crystal Beast", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3862 - Chapter 3862: 3861 Star Field Fragment Versus The Crystal Beast</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3862: 3861 star field fragment versus the Crystal Beast<br/><br/>Translator: 549690339<br/><br/>More than 50 energy crystals suddenly flew into their hands!<br/><br/>The eight rank seven gods were stunned.<br/><br/>However, they didn’t hesitate and put them away!<br/><br/>However, in the next moment, an angry roar was heard.<br/><br/>Without hesitation, the two ghost avatars disappeared!<br/><br/>“Eh? This Is?”<br/><br/>“This is a trap set by the Dragon King of the Dragon Palace. There are Space<br/><br/>Beasts Here! ”<br/><br/>“Get out of here now! ”<br/><br/>The eight rank seven gods heard the roar and focused their eyes.<br/><br/>They knew that they had fallen into the Dragon King’s Trap!<br/><br/>However, they couldn’t throw out more than fifty energy crystals!<br/><br/>The 8 of them did not hesitate and immediately fled into the distance.<br/><br/>“Roar! Roar! Roar!”<br/><br/>However, at this time, the crystal beast saw them putting away the energy crystals, and its eyes were filled with fury.<br/><br/>With a flash, it entered one of the crystals.<br/><br/>With its tens of thousands of meters long body, it entered the crystal, looking extremely strange!<br/><br/>In the next second, it appeared in front of the 8 gods.<br/><br/>It came out from the crystal!<br/><br/>“What?”<br/><br/>The 8 gods were shocked when they saw this scene.<br/><br/>“Why is this Crystal Beast so fast?” “How did it come out from the crystal?”<br/><br/>“Not good, let’s Fight! ”<br/><br/>The eight tier 7 gods did not hesitate at all. They sensed the aura of this crystal behemoth, and with a wave of their arms, the Starfield fragment appeared in front of them.<br/><br/>“Weng Weng Weng! ”<br/><br/>They instantly channeled their energy into the starfield fragment!<br/><br/>“Roar Roar Roar! ”<br/><br/>The crystal behemoth stared at them with reddened eyes, and the crystal horn on its head charged toward them.<br/><br/>The terrifying energy contained within caused the expressions of the eight rank 7 gods to change!<br/><br/>“Weng Weng! ”<br/><br/>However, at this instant, a bright star appeared in front of them.<br/><br/>The star charged towards the Crystal Beast. The star collided with the Crystal Beast’s head.<br/><br/>“Boom!”<br/><br/>A huge explosion sounded out, and a terrifying energy caused the eight rank 7 gods to fly backwards.<br/><br/>“Roar Roar Roar! ”<br/><br/>The Crystal Beast shook its head, and its body also retreated hundreds of thousands of meters.<br/><br/>One crystal after another shattered.<br/><br/>The Crystal Beast went completely berserk, and the surrounding water flow seemed to boil.<br/><br/>Its body moved, and it instantly disappeared!<br/><br/>“Damn it, this Crystal Beast’s strength is at least at the rank 7 realm, be careful! ”<br/><br/>When the eight seventh rank gods saw the space beast charging at them again, their expressions were extremely ugly!<br/><br/>This Space Beast’s strength was very terrifying!<br/><br/>Star domain’s Flaming Star! ”<br/><br/>The eight seventh rank gods looked at each other. With a wave of their arms, a wave of energy directly poured into it.<br/><br/>“Boom! Boom! Boom!”<br/><br/>In the next instant, flaming meteorites appeared behind them.<br/><br/>The densely packed meteorites blotted out the sky and covered the earth. In this sea, they were like flaming lava, emitting a terrifying aura.<br/><br/>The endless flaming meteorites charged forward.<br/><br/>At the same time, they were located not far behind.<br/><br/>When Wang Xian saw them erupting into battle, he immediately commanded his netherspirit avatar to fly over to watch the battle!<br/><br/>When he saw this scene, a look of astonishment appeared in his eyes.<br/><br/>“The gods who believe in the universe use the power of faith. However, they are able to unleash the power of flames with the help of this galactic fragment. This is really strange. In that case, this galactic fragment should be a 100% ultimate treasure of the Tianyuan level! ”<br/><br/>Wang Xian mumbled.<br/><br/>Last time, he did not tremble with the eight level seven gods. Instead, he escaped in an instant.<br/><br/>Now, looking at the combat strength that they had unleashed with the help of the starfield fragment, Wang Xian was a little shocked.<br/><br/>Just the fragment alone was able to reach such a level.<br/><br/>He really did not dare to show his image. How terrifying was a treasure of the Heaven’s origin creation level.<br/><br/>The ancestral tree was a supporting type of Heaven’s origin creation, not an offensive type.<br/><br/>In this aspect, it could never be compared to an offensive heavenly fate treasure.<br/><br/>He hid at the back and watched the battle.<br/><br/>This starfield fragment was very powerful, but the Crystal Beast wasn ‘t jealous!<br/><br/>The Crystal Beast’s strength was also very terrifying!<br/><br/>Facing the flaming meteorite, the Crystal Beast crawled out of a crystal!<br/><br/>It opened its mouth, and the endless seawater around it condensed into water dragons to meet the flaming meteorite! “Boom! Boom! Boom!”<br/><br/>A terrifying collision sound was heard again.<br/><br/>The Crystal Beast disappeared again!<br/><br/>“Damn it, the flaming star of the Starfield fragment was blocked, and the Crystal Beast disappeared again! ”<br/><br/>A tier 7 pantheon saw this scene, and his face turned gloomy as he roared!<br/><br/>“Nirvana Starfield, get rid of this Crystal Beast!”<br/><br/>A rank 7 god hurriedly roared!<br/><br/>Waves of faith energy surged into the starfield fragment!<br/><br/>The other seven faith gods also surged into waves of energy!<br/><br/>On the starfield fragment, a wave of nirvana energy slowly erupted.<br/><br/>This was a wave of deathly silent energy.<br/><br/>This wave of energy enveloped the surroundings!<br/><br/>Wherever it passed, the seawater would retreat. It was as if all those with energy and vitality had to retreat!<br/><br/>The crystal behemoth collided with the energy enveloping it, and a fearful expression appeared in its eyes.<br/><br/>It took two steps back in shock and anger!<br/><br/>However, in the next moment, azure light also bloomed from his body.<br/><br/>The light surged forward.<br/><br/>However, the light still retreated rapidly under the power of Nirvana. However, the blue light quickly wrapped around the power of Nirvana!<br/><br/>“Boom! Boom! Boom!”<br/><br/>The surrounding seawater let out a rumbling sound.<br/><br/>The surrounding ocean seemed to be completely controlled by the Crystal Behemoth.<br/><br/>The ocean pressed towards the power of Nirvana.<br/><br/>Fight! Fight!<br/><br/>This energy of silence was forcibly withdrawn.<br/><br/>“What?”<br/><br/>“This crystal monster is very strong, we may not be its opponent, try to escape! ”<br/><br/>A seven-order gods see, the expression is gloomy roar way!<br/><br/>“OK, Starfield, let’s Go! ”<br/><br/>The eyes of the eight seventh-order gods froze, and the power of faith poured once more into the debris.<br/><br/>Eight stars appeared beneath their feet!<br/><br/>“Whoosh! ”<br/><br/>The eight stars revolved rapidly, and with an abnormally terrifying speed, they brought them to flee!<br/><br/>As they fled, the Starfield of extinction disappeared in an instant!<br/><br/>Seeing that they wanted to escape, the Crystal Beast’s crystal horn above its head suddenly flew out.<br/><br/>The surrounding ordinary crystals suddenly began to gather!\t\t\t\t\t\t</div>", "images": {}, "success": true}