{"id": 863, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073626.html", "title": "Chapter 3865 - Chapter 3865: 3864 To Pursue", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3865 - Chapter 3865: 3864 To Pursue</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3865: 3864 to pursue<br/><br/>Translator: 549690339<br/><br/>Wang Xian might not have thought that because of him, the nine-origin universe had resolved a huge crisis.<br/><br/>Of course, even if he knew, he wouldn’t care.<br/><br/>Maybe the nine-origin Universe had a trump card?<br/><br/>Maybe some peak race had fragments of the ultimate treasure of the Heaven ‘s origin creation.<br/><br/>These were all uncertain!<br/><br/>Especially those powerful existences that had existed for several eras.<br/><br/>If he believed in the universe and wanted to attack the nine-origin universe wantonly, Wang Xian did not believe that the Tianyuan existence in the nine-origin universe would not make a move.<br/><br/>They would definitely intervene.<br/><br/>For example, he knew about the Tianyuan existence of the ELF race.<br/><br/>After all, the resources in the starry universe were too huge!<br/><br/>At this moment, Wang Xian and Lan Qingyue were flying forward in search of the four level-seven pantheon gods.<br/><br/>Wang Xian relied on his soul battleship. Coupled with Lan Qingyue’s current realm, their speed was faster than the four level-seven pantheon gods.<br/><br/>It was impossible for the four level-seven pantheon gods to use the power of the starfield fragment all the time.<br/><br/>They were merely borrowing the power of the Starfield fragment!<br/><br/>In fact, they had not truly displayed the power of the star fragment.<br/><br/>If a peak pantheon could control the power of the star fragment, he could fight against dozens of them.<br/><br/>It was not an exaggeration.<br/><br/>This was the terror of the Tianyuan Destiny level.<br/><br/>The two of them flew in the direction where the four rank 7 gods were fleeing.<br/><br/>“Eh? I can sense the power of faith?”<br/><br/>They had only flown for a few hours when Lan Qingyue sensed the power of faith.<br/><br/>Lan Qingyue was stronger than Wang Xian.<br/><br/>Wang Xian was only borrowing the help of the Five Elements Millstone and the Tai Chi Dragon Plate!<br/><br/>“Have you found it? Let’s go and see if we can destroy them. If we can destroy them, we might be able to obtain the fragment of the Starfield! ”<br/><br/>Wang Xian said with a burning passion in his heart!<br/><br/>The fragment of the Heaven’s origin creation!<br/><br/>If he could obtain it, Wang Xian’s strength would receive another terrifying increase.<br/><br/>“Alright! ”<br/><br/>Lan qingyue nodded. Both of them moved and flew forward quickly.<br/><br/>“We’re very close! ”<br/><br/>After flying for another hour, Lan Qingyue spoke.<br/><br/>Wang Xian immediately concealed his figure.<br/><br/>Lan qingyue similarly concealed her figure.<br/><br/>The four level seven pantheon gods were in front of them. They were moving forward cautiously.<br/><br/>They heaved a sigh of relief when the crystal behemoth didn’t give chase.<br/><br/>However, after witnessing the terrifying crystal behemoth, they became even more vigilant.<br/><br/>If they were to encounter an existence like the crystal behemoth again, they would be completely finished.<br/><br/>After all, their strength was no longer as strong as before.<br/><br/>In fact, they were no longer strong enough to fight against a level seven space behemoth.<br/><br/>They were no longer a match for the Dragon King of the Dragon Palace!<br/><br/>Therefore, they were exceptionally careful!<br/><br/>It was also because of their speed that Wang Xian gradually chased after them!<br/><br/>“I’ve found them. They are right in front! ”<br/><br/>At this moment, Lan Qingyue, who was located not far behind them, was staring ahead with her sparkling eyes.<br/><br/>Wang Xian also noticed the four figures in front of him. His eyes were sparkling.<br/><br/>“It should be safe around here. Let’s do it!” Wang Xian made his decision immediately!<br/><br/>Lan qingyue nodded her head heavily. With a wave of his arm, a black hole slowly appeared behind her!<br/><br/>“Huh?”<br/><br/>At the same time, the four level seven pantheon gods suddenly felt something and looked towards the back.<br/><br/>“Whoosh! ”<br/><br/>At this time, they saw a soul warship charging toward them.<br/><br/>At the same time, there was a huge millstone.<br/><br/>Around the Millstone, there were two soul spears!<br/><br/>And from the black hole, three enormous space beasts emerged.<br/><br/>The space beasts emitted the aura of a ruler at the sixth level.<br/><br/>“Damn it, it’s the Dragon King of the Dragon Palace. How dare he chase after us.<br/><br/>A rank seven pantheon roared with an ugly expression when he saw this scene!<br/><br/>They had been chasing the Dragon King of the Dragon Palace for more than 30 million years.<br/><br/>Now, they were being chased by the Dragon King of the Dragon Palace!<br/><br/>Moreover, the Dragon King of the Dragon Palace and the others had come to kill them!<br/><br/>“Are you going to fight the Dragon King of the Dragon Palace?” A rank seven Pantheon’s expression changed as he asked!<br/><br/>“Let’s give it a try!”<br/><br/>A rank 7 pantheon gritted his teeth and said.<br/><br/>“Weng Weng Weng Weng! ”<br/><br/>They waved their arms, and waves of energy surged into the starfield fragment above their heads.<br/><br/>A star instantly condensed on the starfield fragment.<br/><br/>This was an icy star that gave off an extremely cold temperature.<br/><br/>The entire star went straight for the five elements soul spear and the soul battleship!<br/><br/>“woo woo woo! ”<br/><br/>“woo woo woo! “<br/><br/>At this moment, Xiao Lan and the rest flew over as well. With a roar, the Kun formed from gray energy charged towards the extremely cold planet.<br/><br/>Boom! Boom! Boom<br/><br/>A terrifying collision sound was heard.<br/><br/>Under the attack of Wang Xian and the rest, the extremely cold planet began to crack and collapse slowly!<br/><br/>“The attack of this starfield fragment is really miraculous. It can actually erupt with the energy of the ice attribute! ”<br/><br/>Atter Lan Qingyue said that, her body moved and flew toward the tour level seven gods.<br/><br/>She waved her hand and an incomparably huge gray palm pressed down from the sky.<br/><br/>It was as if it wanted to suppress the entire world.<br/><br/>“Oh no, we are no longer their match! ”<br/><br/>“The strength of the ancient God’s Kun master is really terrifying. She is working together with the Dragon King of the Dragon Palace. We are no match for her. Run! Run! ”<br/><br/>When the four gods of level seven saw the attack of the galactic fragment, they were quickly defeated by Wang Xian and the rest. Their expressions changed drastically!<br/><br/>They did not hesitate at all. A surge of power of faith immediately surged into the galactic fragment.<br/><br/>A long river wrapped around their bodies and led them to flee into the distance.<br/><br/>“HMM? The power of this starfield fragment is really powerful! ”<br/><br/>Wang Xian’s eyes focused when he saw this scene!<br/><br/>He waved his arm and the soul spear appeared in his hand. It was imbued with the power of wind and thunder as it chased after them!<br/><br/>“If this is a true treasure of the Heaven’s origin, how terrifying would its power be?”<br/><br/>Lan qingyue sighed slightly when she saw it.<br/><br/>These four level seven pantheon could only display a strength comparable to a ruler of level eight even with the help of the Book of faith.<br/><br/>If she were to join forces with Wang Xian, she would be comparable to 14 to 15 level nine pantheon.<br/><br/>However, the four of them could fight against them with the fragment of the treasure of the Heaven’s origin. One could imagine how terrifying the true Heaven’s origin was!<br/><br/>Wang Xian also nodded his head heavily. This made him even more envious of the fragments of the Starfield!<br/><br/>“Chase after them and see if we can destroy them all! ”<br/><br/>Wang Xian said.<br/><br/>In the sky, an incomparably huge palm landed on the bodies of the four level seven pantheon gods, slowing them down slightly.<br/><br/>The Soul Spear arrived in front of them. The force of wind and thunder on it exploded instantly and landed on their bodies.<br/><br/>Vying for enemies in the Void!\t\t\t\t\t\t</div>", "images": {}, "success": true}