{"id": 868, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073636.html", "title": "Chapter 3870 - Chapter 3870: 3869. Victory And Defeat", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3870 - Chapter 3870: 3869. Victory And Defeat</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3870: 3869. Victory and defeat<br/><br/>Translator: 549690339<br/><br/>“Whoosh! Whoosh! Whoosh! ”<br/><br/>In the ocean at the edge of the boundless starry skies, over 1,000 Type 7 gods were flying rapidly.<br/><br/>All of a sudden, they stopped and looked at the information on their communicators, their eyes gleaming. They looked at each other and nodded.<br/><br/>Over 1,000 Type 7 gods left.<br/><br/>Leaving nearly 300 tier 7 gods still floating in the air.<br/><br/>“Let’s Go! “<br/><br/>These 200-300 Tier 7 gods moved and continued flying forward.<br/><br/>“You guys are finally here! ”<br/><br/>A few hours later, a Tier 7 god saw them flying over and smiled. However, when he swept his gaze across everyone, he was slightly stunned!<br/><br/>“Eh? Why are there only you guys? Where are the other tier 7 pantheon experts?”<br/><br/>He asked with a face full of confusion.<br/><br/>“The last-minute plan has changed. The nine-origin universe has launched an attack on us. According to the decision of the elders, we will first get rid of that guy from the nine-origin universe, and then we will destroy the Dragon King of the Dragon Palace! ”<br/><br/>A tier 7 pantheon spoke. His body moved, and he flew in front of the tier 7 pantheon.<br/><br/>With a wave of his arm, the Starfield fragment appeared in the sky, and he injected a stream of energy into it.<br/><br/>“If it’s just the few of us, the chances of finding the Dragon King of the Dragon Palace and destroying him in this space are a little low! ”<br/><br/>The Type 7 pantheon frowned and spoke.<br/><br/>He had originally wanted to take revenge and completely destroy the Dragon King of the Dragon Palace, but in the end, an accident had occurred!<br/><br/>“If we can destroy him, then let’s do it as soon as possible. If we can’t, then we’ll wait for News!”<br/><br/>A Type 7 pantheon spoke up, “Destroying the Dragon Palace Dragon King isn ‘t the most important matter now. We need to get rid of those arrogant fellows from the 9-origin universe first. Furthermore, the Dragon Palace Dragon King is already trapped in this region and can’t get out. He’ll die sooner or later! ”<br/><br/>“Alright then! ”<br/><br/>The level seven pantheon could only nod helplessly. “Let’s try to find him and see if we can find him and destroy him. ”<br/><br/>The level seven pantheon nodded.<br/><br/>At the same time, Wang Xian had already stopped looking for the level seven pantheon.<br/><br/>According to Wang Xian’s calculations, the Pantheon should have arrived by now since they were sent from the belief universe to help.<br/><br/>Therefore, Wang Xian was not prepared to take any more risks!<br/><br/>He was waiting for Xiao Lan and the rest to break through!<br/><br/>As long as they broke through, everything would be easy to solve.<br/><br/>In the blink of an eye, a million years had passed.<br/><br/>On this day, Prime Minister Gui suddenly sent a message to Wang Xian.<br/><br/>When he saw this message, his gaze froze!<br/><br/>The belief army from the belief universe had suddenly attacked the long trading corridor!<br/><br/>At this moment, a great battle was taking place in the trading corridor!<br/><br/>When he saw this message, his gaze flickered slightly.<br/><br/>He immediately took out the communication stone plate and checked the message on it.<br/><br/>“The belief universe army actually dared to sneak attack our trading corridor. Brothers, kill them!”<br/><br/>“This group of reckless people actually dared to sneak attack us. Last time, we killed them and fled in a sorry state. Now, they actually dare to come and look for trouble? Leave them here!”<br/><br/>“The great beings of our saint lineage have already rushed over. We will definitely exterminate them all! ”<br/><br/>“This belief universe has over two million gods and believers. Their strength isn’t weak! ”<br/><br/>At this moment, the Al of the universe was also completely boiling with excitement.<br/><br/>The long trading corridor was a trading place built by the royal family. After tens of millions of years, it had become the largest trading place in the 9-origin universe!<br/><br/>There were countless strong disciples gathered there. It was the most lively place!<br/><br/>Now, the strong disciples of the belief universe had suddenly attacked. This sudden attack made all the strong disciples of the nine-origin universe extremely angry.<br/><br/>A war had broken out!<br/><br/>Wang Xian didn’t know the exact situation. However, he felt that the belief universe might not be simply taking revenge.<br/><br/>“In terms of true power, the nine-origin universe should be slightly weaker than the belief universe. I wonder what the belief universe is going to do!” Wang Xian mumbled as his eyes sparkled!<br/><br/>Because he was trapped here, he could only read all kinds of news through the communication stone plate.<br/><br/>A day later, he learned from the communication stone plate that the strongest race from the nine-origin universe had arrived and had a huge battle with the army of the gods from the belief universe.<br/><br/>However, during the Great War, another army of 10 million had appeared in the belief universe.<br/><br/>The army of 10 million gods and believers of the belief universe had caused great losses to the Great Beings of the 9-origin universe. A large number of great beings ‘disciples had been killed!<br/><br/>The entire exchange corridor had been destroyed!<br/><br/>The top-tier beings immediately began to gather their strength and prepare to counterattack!<br/><br/>The real war had begun!<br/><br/>The next few days were filled with news about the war!<br/><br/>There were all kinds of battlefields, the main battleground in the center!<br/><br/>The ruler of a level seven powerhouse against a level seven pantheon!<br/><br/>The trump card of the peak races against the trump card of the belief universe!<br/><br/>Wang Xian watched it in the communication stone every day.<br/><br/>The war continued. This war lasted for a few years.<br/><br/>However, as time passed and powerful belief armies appeared one after another, the 9-origin universe began to retreat in defeat!<br/><br/>“How can there be so many great beings in this belief universe? We’re being attacked by them in many places right now, so there’s no time for us to send reinforcements! ”<br/><br/>“It’s not that there’s no time to send reinforcements, it’s just that the other party is too powerful. Over at the main battlefield, our pinnacle races aren’t a match for their army of gods, and they’re already beginning to retreat continuously! ”<br/><br/>“Oh no, the shamans, the demons, and the other peak races all had a large number of level 7 rulers killed. Even the lord of the shamans who transferred the bloodline of the Space Beast was killed by the gods of the belief universe! ”<br/><br/>“Hiss, the belief universe is too powerful. We’re not their match at all. Many of our disciples in the nine-origin universe have become their believers. Now that their believers have infiltrated our place, they all know the news on our side.<br/><br/>On the other hand, we don’t know anything about the other party! ”<br/><br/>“All the strong disciples of the royal family guarding the long trading corridor have been killed! ”<br/><br/>“The belief universe is too strong. Now, our range of activity has been reduced to a terrifying extent! ”<br/><br/>On the universe’s Al, the strong disciples of the nine-origin universe were posting all kinds of information!<br/><br/>“As expected, the belief universe is stronger. At least, they have more strong and disciples. ”<br/><br/>Wang Xian mumbled as he looked at the daily movements in the communication stone plate.<br/><br/>Buzz! Buzz<br/><br/>“Dragon King, the peak races have invited us for a meeting again. It should be about the war with the belief universe! ”<br/><br/>Wang Xian received a message from Prime Minister Gui and raised his eyebrows slightly!<br/><br/>“Another meeting? Prime Minister Gui, go and take a look!”<br/><br/>Wang Xian replied..\t\t\t\t\t\t</div>", "images": {}, "success": true}