{"id": 870, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073640.html", "title": "Chapter 3872 - Chapter 3872: 3871 Rejected Once Again, The Giant City In The Starry Sky!", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3872 - Chapter 3872: 3871 Rejected Once Again, The Giant City In The Starry Sky!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3872: 3871 rejected once again, the giant city in the starry sky!<br/><br/>Translator: 549690339<br/><br/>Wang Xian made up his mind and sent the message to Prime Minister Gui.<br/><br/>At the location of the passageway in the nine-origin universe, each of the peak races shouted out the treasures they wanted to take out.<br/><br/>These treasures were not to be casually shouted out.<br/><br/>Since they were working together to build the giant city, it would be best if the treasures they took out were equal.<br/><br/>Even if they couldn’t be equal, they had to take out some resources to make up for it.<br/><br/>After all, this giant city was of great significance to all the peak races.<br/><br/>Defense, attack.<br/><br/>This was the foundation of the entire giant city.<br/><br/>What they needed to do was to create this foundation. As for the buildings inside, it wasn’t too easy for the experts.<br/><br/>As for the size of this huge city and how much each peak race could occupy, they had to be divided.<br/><br/>“Our Dragon Palace doesn’t have any treasures that we can take out. However, our Dragon Palace has a treasure that you don’t have that can be used for defense. There are 25,000 cursed dragons, and each of them has the peak of the venerable realm. Their combat strength is a little low, only at the seventh level of the venerable realm! ”<br/><br/>“200 cursed dragons can kill a seventh level ruler-level space beast. For the gods who believe in the universe, 400 to 500 cursed dragons can kill a seventh level God. ”<br/><br/>“These 25,000 cursed dragons can kill a peak ruler-level space beast at the same time. It shouldn’t be a problem. ”<br/><br/>Prime Minister Turtle looked at the peak races and said.<br/><br/>“HMM? Cursed Dragons?”<br/><br/>His words caused the peak races to raise their eyebrows.<br/><br/>“Cursed creatures? They are indeed terrifying when used for defense and surprise attacks! ”<br/><br/>The ancestral Magus nodded slightly.<br/><br/>The Magus race had studied cursed creatures before, and they knew how powerful they were.<br/><br/>They had even secretly nurtured such creatures.<br/><br/>25,000 cursed dragons could indeed curse and kill a space behemoth at the peak of the ruler realm.<br/><br/>This defensive effect was no weaker than the Wizard clan’s spell formation, and it was even stronger to a certain extent.<br/><br/>Of course, the effect of the spell formation and the cursed dragon were different.<br/><br/>“Cursed Dragon, aren’t you still a disciple of Your Dragon Palace? You can transfer out whenever you want?”<br/><br/>The King of angels of light slightly raised his eyebrows and said faintly.<br/><br/>“That’s simple. We can put a powerful mech on the cursed dragon. Then, we can control the mech. The control of the mech will be decided by then. ” Prime Minister Gui replied.<br/><br/>“Yes, 25 ,ooo of these cursed creatures are very terrifying. If they play well, they will be of great use.”<br/><br/>The dark race experts nodded.<br/><br/>The other peak races agreed with the treasures that the Dragon Palace took out.<br/><br/>This could be considered a powerful trump card of the giant city in the future.<br/><br/>If a level 8 or Level 9 space beast came, it would be enough to intimidate them. “The matter of the giant city is settled. I have another suggestion from the belief universe. We 13 peak races should form a battle team and gather the experts of our 13 peak forces. Each race has their own specialties. If we form a battle team, we can fight better against the army of the belief universe. ”<br/><br/>The Big Elf of the Elf race suddenly said.<br/><br/>“This is indeed a good choice, then we might as well form more battle squads.” The group of pinnacle races nodded slightly.<br/><br/>Now that the 9-origin universe had been forced to this point, they knew it was time to unite.<br/><br/>Because the 9-origin universe was already beginning to retreat!<br/><br/>“Alright, let’s pick out the peak combat strength of each race and form multiple combat teams. ”<br/><br/>The witch clan’s ancestral witch nodded.<br/><br/>Prime Minister Gui heard their conversation and passed the news to Wang Xian.<br/><br/>When Wang Xian received the news, he raised his eyebrows slightly.<br/><br/>He pondered for a moment and decided not to let the Dragon Palace participate.<br/><br/>The Dragon Palace still lacked the combat strength that could rival a ruler of level eight or level nine. Hence, it was still not able to participate.<br/><br/>“Our Dragon Palace is too weak, we won’t participate.”<br/><br/>Prime Minister Gui received the news and said!<br/><br/>(‘HM? The Dragon Palace won’t participate again? This isn’t the last time. This time, our 9-origin universe has been forced to such an extent by the belief universe. Your Dragon Palace still won’t participate? This doesn’t make sense!<br/><br/>At the Phoenix clan, a Water Phoenix heard Prime Minister Gui’s words and said directly.<br/><br/>“Our Dragon Palace’s strength is still too weak. It Won’t be of much use even if we join this battle team.” Prime Minister Gui said. “This is a critical moment. ”<br/><br/>The Water Phoenix sneered.<br/><br/>“When the Dragon King of our Dragon Palace returns, he will naturally participate. Right now, our Dragon Palace is still too weak! ” Prime Minister Gui shook his head and insisted. “We can’t force the Dragon Palace not to participate. ” The ancestral wizard of the Shaman Clan said.<br/><br/>The other peak races didn’t think much of it.<br/><br/>They knew what the Dragon Palace was thinking, and they also knew that there was still a gap between them and the Dragon Palace.<br/><br/>Some peak races didn’t pay too much attention to it.<br/><br/>However, the Phoenix clan and the Angel clan had some opinions after all.<br/><br/>However, even if they had their own opinions, they could not force the Dragon Palace to do anything.<br/><br/>Especially at this juncture.<br/><br/>Prime Minister GUI bade farewell again and transmitted the reactions of the peak races to Wang Xian.<br/><br/>When Wang Xian saw this, he was very satisfied.<br/><br/>He could imagine that the Phoenix race and the Angel race had their own opinions about the Dragon Palace.<br/><br/>As long as the other peak races had no opinions, it would be fine!<br/><br/>On this point, Wang Xian was very satisfied with the reactions of the other peak races!<br/><br/>In the nine-origin universe, the construction of the giant starry city began!<br/><br/>The construction location was at the world passageway.<br/><br/>When the thirteen peak races worked together to build the entire giant starry city, the speed was still very terrifying.<br/><br/>The entire city could move.<br/><br/>It had a feather at the Heaven’s fate level and the strongest spell formation that could be controlled by a wizard clan master at the level seven realm.<br/><br/>There was a turtle shell that was said to have the strongest defense, and a black tortoise of the peak realm!<br/><br/>There was an ancient war tree sapling of the Elf clan.<br/><br/>There was a treasure of the Divine Tiger clan, the Tiger Clan!<br/><br/>There was a saint lineage, a heavenly creation-level existence, and the words of the Hetian saint.<br/><br/>There was a skeleton clan that could not extinguish fire!<br/><br/>There was a divine shadow of the Celestial Nation!<br/><br/>There was a dragon palace that cursed the dragon.<br/><br/>Each peak race took out some powerful treasures and used them to build this huge starry city.<br/><br/>This huge starry city was also for the nine-origin universe to gain a foothold in the starry universe.<br/><br/>It was also for a supply station, a huge city that could resist the army of the belief universe.<br/><br/>Such a terrifying treasure had been built by 13 peak races. Even if a peak ruler realm starry beast attacked, it would be able to resist.<br/><br/>Even with the existence of the cursed dragon, it could be destroyed..\t\t\t\t\t\t</div>", "images": {}, "success": true}