{"id": 877, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073654.html", "title": "Chapter 3879 - Chapter 3879: The Great War Of 3878 Had Begun", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3879 - Chapter 3879: The Great War Of 3878 Had Begun</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3879: The Great War of 3878 had begun<br/><br/>Translator: 549690339<br/><br/>Suddenly, public opinion exploded on the communication stone plate!<br/><br/>The information that the experts of the Phoenix clan had published on the communication stone plate was suspected to be that of the Angel clan. It caused a great sensation!<br/><br/>“This? The Angel clan has also joined in. What’s going on? Are they going to start a war with the Dragon Palace again?”<br/><br/>“That’s very possible. After all, the Dragon Palace killed many powerful disciples of the Angel clan last time. It’s not so easy to understand this hatred! ”<br/><br/>“What the Angel clan said makes sense. The powerful disciples of the Dragon Palace didn’t participate in the wars between our nine-origin universe and the belief universe. I wonder what’s going on.”<br/><br/>“Is it really because the dragon palace is weaker? I think there are many<br/><br/>Dominators in the Dragon Palace. However, it seems that the experts of the Dragon Palace are all at the first or second level of the Dominator realm. There are very few at the third level and above. I haven’t even seen them before! ”<br/><br/>“In any case, it is indeed unfair that the Dragon Palace and the Dragon King didn’t participate in the war. Now, this is a war between the nine-origin universe and the belief universe. All the other top-tier races have participated in it. It doesn’t make sense that the Dragon Palace didn’t participate! ”<br/><br/>“In the war between our nine-origin universe and the belief universe, the Dragon Palace didn’t do the right thing. After all, when the Apocalypse comes, it will be a war between the universes. If our nine-origin universe doesn’t unite, we might be destroyed! ”<br/><br/>In the communication stone plate, the powerful disciples of each race were discussing.<br/><br/>When the disciples of the Angel Race and the Phoenix race saw the public opinion, they began to blame the Dragon Palace for not participating in the war against the belief universe army.<br/><br/>This point indeed resonated with all the peak races and all the powerful disciples of the 9-origin universe!<br/><br/>It was obviously wrong for the Dragon Palace not to participate in the war between the 9-origin universe and the belief universe!<br/><br/>This was clearly a cowardly and evasive action!<br/><br/>“So what if the Phoenix race kills the disciples of the Dragon Palace? Humph, among the 13 peak races, although the Dragon Palace is the weakest, they didn’t do anything in the war against the belief universe. What a coward, what a piece of trash!”<br/><br/>In a hall of a restaurant in the starry city, many powerful disciples were talking about the Dragon Palace.<br/><br/>At the side, an expert of the Phoenix clan suddenly opened his mouth and said with disdain!<br/><br/>His words shocked the people around him.<br/><br/>He said it in public, which was obviously a provocation to the dragon palace!<br/><br/>In the past, the Phoenix clan had been displeased by the incident with the Skyfire Patriarch and had even cursed them behind their backs!<br/><br/>However, they couldn’t say anything about this matter.<br/><br/>At least during the war between the nine-origin universe and the belief universe, the Phoenix clan didn’t stay out of the war and hide like the Dragon Palace did!<br/><br/>On this point, the Phoenix clan couldn’t be blamed, but the Dragon Palace couldn’t!<br/><br/>This public opinion quickly swept through the entire space city!<br/><br/>Now, tens of billions of disciples from the nine-origin universe gathered in the space city.<br/><br/>Every piece of news spread very quickly.<br/><br/>Gradually, more disciples from the nine-origin universe discussed the fact that the Dragon Palace didn’t participate in the war with the space city.<br/><br/>This also greatly affected the reputation of the Dragon Palace!<br/><br/>Those high-level subsidiary races that were close to the angel race and the Phoenix race even said that the Dragon Palace was a cowardly turtle in the nine-origin universe and was not worthy of being a peak race in the nine-origin universe!<br/><br/>Prime Minister Gui naturally received this news as well.<br/><br/>He passed everything here to Wang Xian!<br/><br/>“It seems like the Phoenix race is deliberately provoking us! ”<br/><br/>In the ocean at the edge of the boundless starry sky, Wang Xian narrowed his eyes slightly. His expression was filled with awe!<br/><br/>If the incident where the disciples of the Dragon Palace were killed two days ago was due to the disciples of the Dragon Palace, it was obvious that it was because of the Phoenix clan.<br/><br/>However, the public opinion that suddenly erupted was obviously directed at the Dragon Palace!<br/><br/>“Hehe, they are saying that our Dragon Palace did not participate in the war against the belief universe?”<br/><br/>A cold smile appeared in Wang Xian’s eyes. “It seems that we have to find those gods who believe in the belief universe as soon as possible. Then, we have to go back. Everyone who made a mistake will have to pay a terrible price!<br/><br/>He mumbled!<br/><br/>Lan qingyue, who was standing at the side, suddenly exclaimed in surprise.<br/><br/>Wang Xian heard her surprised voice and looked over.<br/><br/>“Xiao Xian, I can sense the aura of the gods of the universe. They should be rushing towards us! ”<br/><br/>Lan Qingyue looked at Wang Xian and said!<br/><br/>“Are we finally going to meet them?”<br/><br/>When Wang Xian heard Lan Qingyue’s words, a look of joy appeared on his face!<br/><br/>“They are here! ”<br/><br/>Lan qingyue nodded and looked in a direction.<br/><br/>“Qingyue, Hide First! ”<br/><br/>Wang Xian waved his arm and kept Lan qingyue into the mother nest!<br/><br/>He moved his body and sat cross-legged without moving. It was as though he did not sense the gods who believed in the universe!<br/><br/>“I can sense the aura of the Dragon King! ”<br/><br/>At this moment, more than 200 level seven gods were flying aimlessly to the left of Wang Xian.<br/><br/>Suddenly, the level seven gods who were floating in the middle of the sky with the fragments of the starry sky narrowed his eyes and spoke with a cold expression!<br/><br/>“Eh? Are you sure?”<br/><br/>The surrounding tier 7 gods were slightly stunned. They looked at him and confirmed.<br/><br/>(‘I’m 100% sure. I can tell if the Dragon King’s Aura has turned into dust. He’s right in front of us. This time, we must destroy him!”<br/><br/>The tier 7 god nodded heavily. His eyes were filled with the flames of hatred!<br/><br/>The last time he was chased by the Dragon King of the Dragon Palace, he was the only one who escaped through the treasure.<br/><br/>This humiliated him and at the same time, he lost a life-saving treasure!<br/><br/>This filled his heart with anger, he had always wanted to kill and take revenge!<br/><br/>Now, it was finally here!<br/><br/>“Go fly over immediately. This time, we can’t let the Dragon King of the Dragon Palace escape! ”<br/><br/>“This time, we must destroy the Dragon King of the Dragon Palace. ” Over 200 gods nodded their heads heavily.<br/><br/>Their bodies moved and flew in that direction at a rapid speed!<br/><br/>“It’s right in front of us. I see it! ”<br/><br/>“Lock it down First!”<br/><br/>“Star, Heaven Palm Forbids Flight! ”<br/><br/>The group of level seven gods flew over and immediately discovered Wang Xian who was sitting cross-legged in front of them. Their eyes shone brightly!<br/><br/>The seven gods who were in control of the galactic fragment did not hesitate at all. Immediately, waves of energy surged into the galactic fragment!<br/><br/>At the side, the three level seven gods moved their palms and numerous star-like runic balls flew into the sky.<br/><br/>These runic balls arrived in the sky above Wang Xian at a terrifying speed.<br/><br/>Following that, palms with their hands clasped together appeared in the sky!<br/><br/>These huge palms sealed off a domain.<br/><br/>This was a powerful sealing treasure in the belief universe that was enough to trap the level 9 gods..\t\t\t\t\t\t</div>", "images": {}, "success": true}