{"id": 881, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073662.html", "title": "Chapter 3883 - Chapter 3883: If It Wasn’T For The Dragon King, 3882 Would Have Destroyed The 9-Essences Level Long Ago! Go", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3883 - Chapter 3883: If It Wasn’T For The Dragon King, 3882 Would Have Destroyed The 9-Essences Level Long Ago! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3883: If it wasn’t for the Dragon King, 3882 would have destroyed the 9-essences level long ago! Go<br/><br/>Translator: 549690339<br/><br/>In front of the starry city, all the experts of the peak races stared coldly ahead.<br/><br/>Behind them, all the disciples gradually calmed down and quietly stared ahead!<br/><br/>Waiting for the arrival of the army of the belief universe.<br/><br/>“Roar Roar Roar! ”<br/><br/>“Roar Roar Roar! ”<br/><br/>Five minutes passed, along with a roar, an incomparably huge army appeared in their line of sight!<br/><br/>The huge army was divided into 20 small armies.<br/><br/>Although it was called a small army, each army had a million strong disciples!<br/><br/>The first to appear in their line of sight were 10 incomparably huge star cities.<br/><br/>The ruler level 6 star beasts were comparable to their 9 origin universe’s 10 ruler Level 9 experts.<br/><br/>Other than these eye-catching 10 star beasts, there was also an illusory image floating in the center!<br/><br/>Other than that, there were also some images condensed from the power of faith.<br/><br/>All of them contained immense power!<br/><br/>Above the Star City, the expressions of all the experts of the pinnacle races slightly changed when they saw this scene!<br/><br/>“The power of the universe of faith is much stronger than we imagined! ”<br/><br/>“I thought they had at most 16 or 17 legions, but I didn’t expect there to be 21, this… ”<br/><br/>The experts of the pinnacle races narrowed their eyes and muttered.<br/><br/>Their faces were full of shock!<br/><br/>On the other hand, Prime Minister Gui and the others didn’t change their expressions at all.<br/><br/>No force knew more about the power of the belief universe than the Dragon Palace.<br/><br/>In order to deal with the Dragon King, the belief universe had sent its strongest force.<br/><br/>A fragment of the Heavenly Yuan creation!<br/><br/>“This… the power of the belief universe is so terrifying. I heard that the power of the belief universe is divided into 24 palaces. Do these legions represent each palace? How can they be so powerful?”<br/><br/>“Look, in front of those legions, if they don’t have the strength of a Type 6 space beast, or they have the strength to fight against a Type 6 space beast, is this the strength of the belief universe?”<br/><br/>“My God, look at each of their legions, there are more than 100 of them, each of them is comparable to us, a Type 7 ruler. How is this possible?”<br/><br/>“Also, each of their legions has 70,000 to 80,000 great beings that make me feel suffocated. They should all be at the level of the gods! ”<br/><br/>“Aren’t they too powerful? It feels like they are much stronger than our 9-origin universe! ”<br/><br/>An extremely shocked voice came from behind!<br/><br/>Not many disciples below the level of a ruler of a 9 -origin universe<br/><br/>participated in this battle.<br/><br/>They had been listening to all kinds of orders, either retreating or leaving.<br/><br/>Most of them had never seen the powerful army of the belief universe!<br/><br/>Now that they saw the power of the belief universe, they were all extremely shocked.<br/><br/>“It seems that the power of our 9-origin universe in front of the city wall is at most half of the power of the Great Beings of the belief universe. This is close to two million beings at the level of a ruler!”<br/><br/>Some Peak Knight disciples compared their strength, their faces filled with shock!<br/><br/>The number of Faith Universe Army’s experts exceeded their expectations.<br/><br/>It also exceeded the number of peak race experts in the 9-origin universe!<br/><br/>“Yes, each small army has at least 70,000 to 80,000 experts, but what about ours? The Dragon Palace only has a few thousand ruler realm experts, and most of them are below the ruler realm level 3. ” “It seems like the gap between us and the belief universe is huge! ”<br/><br/>Everyone felt a pressure and muttered to themselves!<br/><br/>“The strength of the belief universe has indeed exceeded our expectations. ”<br/><br/>On the shaman side, a rank 7 ruler said with a frown!<br/><br/>Around them, the experts from the peak races nodded silently.<br/><br/>A powerful pressure surged over!<br/><br/>However, they didn’t show any fear on their faces!<br/><br/>They still had 100% confidence in the space city!<br/><br/>“Hahaha, the trash of the 9-origin universe, do you want to rely on this broken city to protect yourselves?”<br/><br/>At this moment, an extremely arrogant voice suddenly came from the opposite side.<br/><br/>Although they didn’t understand each other’s language, through the spiritual fluctuations, everyone could understand what he meant!<br/><br/>His words caused the expressions of all the powerful disciples in the 9-origin universe to sink!<br/><br/>“HMPH, trash who believes in the universe, do you think you can break through our space city with just your strength? Today, you won’t be able to return! ”<br/><br/>The great demon of the demon race stared at them with a sinister expression as he roared in a low voice!<br/><br/>“Hahaha, you want us to never return? With just a bunch of trash from your nine-origin universe? Come, come, come, stand out. Let us see how many experts your nine-origin universe has and what you can compare with our belief universe! ”<br/><br/>In front of them, the belief universe’s level 7 pantheon laughed maniacally as he spoke!<br/><br/>The 21 legions from the belief universe slowly arrived in front of the starry city.<br/><br/>They stopped in the void and swept their gaze across all the powerful disciples in the starry city. Their faces were filled with ridicule and disdain!<br/><br/>“You’ll know in a while. What can we compare with you?”<br/><br/>At the saint’s side, an old man with a scholarly aura held a fan and replied with a cold expression!<br/><br/>“Haha, with just a glance, there are only so many powerful beings in the 9-origin universe? What trash. I see that all of you are cowards, right? Do you have the guts to come out and fight with us?”<br/><br/>A Level 7 pantheon replied with ridicule!<br/><br/>“I heard that this space city was built by the 9-origin universe using a large number of treasures to protect their lives. Haha, they only dare to cower in here. How could they dare to come out and fight with our belief universe?”<br/><br/>“With this glance, the power of this nine-origin universe can’t even be compared to our belief universe. If this is a real catastrophe, all the living beings in the small nine-origin universe will become our believers and kneel at our feet to praise our greatness. hahaha!”<br/><br/>“That’s right. I thought that the nine-origin universe was very powerful. Now that 1 look at it, TSK, TSK, TSK, Trash!”<br/><br/>The level-seven gods of the 24 palace legions sized up the entire space city and said mockingly!<br/><br/>Their faces were filled with pride and disdain!<br/><br/>The arrogant words spread to the space city, and this made all the great beings and disciples of the 9-origin universe look extremely embarrassed!<br/><br/>However, they had nothing to refute!<br/><br/>Without the support of the space city, they were indeed no match for the belief universe army!<br/><br/>Their power made the great disciples of the 9-origin universe feel invincible!<br/><br/>Without the space city, they might have to flee!\t\t\t\t\t\t</div>", "images": {}, "success": true}