{"id": 888, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073676.html", "title": "Chapter 3890 - Chapter 3890: The Transaction Of 3889 Was Completed", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3890 - Chapter 3890: The Transaction Of 3889 Was Completed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3890: The transaction of 3889 was completed<br/><br/>Translator: 549690339<br/><br/>The eyes of the chaos space behemoth sparkled. Clearly, he was very satisfied with the transaction this time!<br/><br/>3000 revival fruits that could resurrect. This was definitely a rare treasure for their space behemoth race.<br/><br/>Moreover, such a number was something that the chaos space behemoth had never thought of before coming.<br/><br/>Although he had to pay the price of the fragment of the Tianyuan Destiny Galaxy!<br/><br/>However, he had just obtained this fragment of the galaxy!<br/><br/>In other words, he had only paid a small price to obtain so many resurrection fruits. It was totally worth it.<br/><br/>He had even made a huge profit!<br/><br/>Even the other peak races could not produce so many resurrection fruits! When Wang Xian saw that the chaotic space beast agreed, he suppressed the excitement and excitement in his heart!<br/><br/>3,000 revival fruits in exchange for so many treasures and star field fragments. This was a huge profit for Wang Xian and the Dragon Palace!<br/><br/>There were hundreds of thousands of such fruits in the Dragon Palace!<br/><br/>The reason why he said that the other 200 fruits would be given to the chaotic space beast within 100 million years was to give it an illusion.<br/><br/>That was, although the dragon palace had trees that could give birth to such revival fruits, it would take 100 million years to give birth to 200 fruits!<br/><br/>This also made it seem more precious!<br/><br/>It was to prevent the chaotic space beasts from thinking that the Dragon Palace had a large number of such fruits!<br/><br/>“Senior Hundun, I need to get the experts from the Dragon Palace to bring the soul-returning embryo fruits over. It will take about four to five years. I hope senior Hundun can wait for a while! ”<br/><br/>Wang Xian continued to speak to Hundun!<br/><br/>“Four to five years is very short. Then, I will help you remove the power of faith contained in the Starfield fragment now!”<br/><br/>Hundun said!<br/><br/>“Thank you, Senior Wonton. ”<br/><br/>Wang Xian said immediately!<br/><br/>“Hehe, this is our deal. Speaking of which, Dragon King, I have high hopes for you. In the future, even if you can’t reach the level of the Heaven’s origin creation, you will be able to approach the invincible level below the Heaven’s origin creation. ”<br/><br/>The Hundun space beast smiled and said, “Alright, I will first get rid of the power of faith in this starfield fragment. There is the power of the Heaven’s fate level in it. If this wasn’t in the starry universe, with the suppression of the universe, it would be difficult for me to take away the power of faith in it!”<br/><br/>“It’s senior Hundun. We Won’t Disturb You! ”<br/><br/>Wang Xian nodded his head and looked at Lan Qingyue beside him!<br/><br/>Following that, he sent a message to an lie and Lan Qingyue flew into the distance.<br/><br/>He wanted to let Lan Qingyue and an lie make contact in the distance!<br/><br/>“Alright, the energy inside is clear now. The power of this star field fragment is indeed powerful. It’s an ultimate treasure of the Tianyuan Universe and belongs to the universe. This kind of ultimate treasure can be used by any powerhouse of energy. In other words, the ultimate treasure of the Tianyuan universe can be used by any powerhouse of the universe. ”<br/><br/>“The space beasts in our universe can also use it. Moreover, this fragment of the Starfield is extremely useful to me. ”<br/><br/>Four years later, the Chaos Space Beast cleared the energy in the fragment of the Starfield and said to Wang Xian, “If we can find the other fragments, we might be able to restore them. Here, you can refine them first!”<br/><br/>“HMM? Thank you, Senior Chaos! ”<br/><br/>Wang Xian was slightly stunned when he saw him handing over the starfield fragment to him. Immediately, he cupped his hands and thanked him.<br/><br/>He took it and sensed it. Immediately, he realized that there was no energy in it.<br/><br/>He could completely nurture it!<br/><br/>Once he successfully nurtured it, he could control and use it!<br/><br/>In other words, it would belong to him in the future!<br/><br/>Wang Xian’s eyes sparkled. He could feel a huge amount of energy from it!<br/><br/>Once he refined it, he would be able to unleash a terrifying strength!<br/><br/>When the time came, he would be able to infuse the energy from the Five Elements Millstone and the Tai Chi Dragon Disc into it. It would be sufficient to kill an existence at the peak of the Pantheon of gods!<br/><br/>One had to know that the eight pantheon of gods back then were only at level seven.<br/><br/>They could match up to the peak pantheon gods by relying on this starfield fragment.<br/><br/>Now that Wang Xian was controlling it and injecting the energy from the Five Elements Millstone and the Tai Chi Dragon Disc, it was able to kill the peak pantheon gods.<br/><br/>As for how many peak races they could kill, it was hard to say.<br/><br/>However, according to Wang Xian, there were at least two of them.<br/><br/>After all, this was just a fragment of the Heaven’s origin creation. There was a limit to it!<br/><br/>At this moment, he took out his communication stone plate and sent a message to LAN qingyue.<br/><br/>“Senior, the soul-returning embryo fruit has been brought over. It will be delivered soon! ”<br/><br/>Wang Xian spoke to the chaotic space beast!<br/><br/>“Hehe, alright, there’s no Rush!”<br/><br/>The chaotic space beast replied and waved his hand again, he took out a storage space item and said, “There’s a beast king token and a letter from me. There are also 1,000 corpses of Space Beasts at the level six realm. As for the treasure land, which is only second to your peak race, Pll bring you there later. It’s at the edge of this boundless sea of stars. ”<br/><br/>“Thank you, Senior Hundun! ”<br/><br/>Wang Xian received it and inspected it. A smile appeared on his face!<br/><br/>“There’s no need. After the calamity, even if we can’t become friends, there’s no need for us to become enemies.”<br/><br/>The Hundun Space Beast spoke.<br/><br/>“By the way, senior, I have a question. Why did you allow the experts from the nine-origin universe and the belief universe to enter the Starry Universe?”<br/><br/>Wang Xian couldn’t help but ask.<br/><br/>Naturally, he didn’t want outsiders to invade his own territory.<br/><br/>However, the activity of the disciples of the experts from the nine-origin universe and the belief universe made him a little puzzled.<br/><br/>The nine-origin universe was fine, but what about the belief universe?<br/><br/>“There is a reason for the agreement between us in the nine-origin universe. As for the belief universe, we didn’t bother about it. As for the other top-tier space beasts in the starry universe, we didn’t put them in our eyes at all. This is because the suppression of the starry universe doesn’t pose a threat to top-tier space beasts like them. ”<br/><br/>“Most importantly, due to the uniqueness of the starry universe, other than hunting skills, there are no other civilizations that belong to the space beasts in the starry universe. Secondly, the strength of the starry universe can be ranked in the top three among all the other universes. ”<br/><br/>“Even when the Apocalypse is approaching, there are usually no experts from other universes who would dare to come to the infinite starry universe. Even if it’s the Tianyuan destiny level or the infinite starry universe, there are a lot of<br/><br/>Tianyuan destiny level Space Beasts. ”<br/><br/>As Hun Dun spoke, a hint of shock appeared on Wang Xian’s face.<br/><br/>“Is the strength of the starry universe so strong?”<br/><br/>He was a little surprised.<br/><br/>“Hehe, yes. Otherwise, why would we appear in the nine-origin universe? If we appear there, why haven’t we been killed?”<br/><br/>Hun Dun smiled and replied.<br/><br/>Wang Xian nodded slightly.<br/><br/>Although the starry universe didn’t have a civilization, their strength was extremely terrifying.<br/><br/>Terrifying to the time of the apocalypse, the Infinite Starry Sky is also a Pure Land, no other universe masters dare to step into here..\t\t\t\t\t\t</div>", "images": {}, "success": true}