{"id": 880, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073660.html", "title": "Chapter 3882 - Chapter 3882: 3881 Killed Another 200 Or So Tier 7 Gods", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3882 - Chapter 3882: 3881 Killed Another 200 Or So Tier 7 Gods</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3882: 3881 killed another 200 or so tier 7 gods<br/><br/>Translator: 549690339<br/><br/>It was over!<br/><br/>The remaining 30 to 40 tier 7 gods looked at the terrifying Dragon King and the others with despair on their faces!<br/><br/>The Dragon King and the others’ strength was simply too terrifying!<br/><br/>The eight tier 7 gods looked at this scene with shock and horror on their faces!<br/><br/>More than 200 tier 7 gods, the top-tier strength of two palaces, were actually defeated by the Dragon King and the others by 80% . The remaining 30-40 rank seven gods couldn’t escape at all!<br/><br/>They couldn’t resist at all!<br/><br/>The strength of two palaces wasn’t enough to fight the Dragon King of the Dragon Palace!<br/><br/>They knew this clearly!<br/><br/>The other 30-40 rank seven gods couldn’t escape either!<br/><br/>This wasn’t what scared them the most!<br/><br/>What scared them the most was that the terrifying space beast in front of them and the ancient god Kun sovereign had completely suppressed the star field fragment!<br/><br/>“This time, our belief universe is going to suffer heavy losses! ” A Level 7 pantheon couldn’t help but growl in a low voice!<br/><br/>“The next ones to die will be you! ”<br/><br/>At this time, Little Blue’s low growl and Lan Qing Yue’s voice sounded in their ears.<br/><br/>The gray ocean in the surroundings directly pressed down on them!<br/><br/>“Planet Explosion! ”<br/><br/>The 8 Type 7 gods had ugly expressions as they injected a large amount of faith energy into the star fragment. Their eyes were bloodshot as they roared!<br/><br/>From the star fragment, an unstable planet slowly condensed. The planet seemed like it could explode at any time.<br/><br/>It could erupt with terrifying power!<br/><br/>“Kun Tun! ”<br/><br/>When Xiao Lan saw this unstable planet, she immediately opened her mouth!<br/><br/>A Kun formed from condensed energy opened its terrifying mouth and swallowed the planet!<br/><br/>“Boom Boom Boom! ”<br/><br/>The planet had just swallowed when a terrifying explosion occurred inside!<br/><br/>However, this explosion only caused the condensed Kun to dissipate.<br/><br/>The gray ocean water around them continued to charge at them!<br/><br/>“We’re finished! ” “We can only fight one. We can’t Fight Two! ”<br/><br/>“I’m not satisfied!”<br/><br/>The eight rank 7 gods saw this scene and roared in despair and unwillingness!<br/><br/>Splash! ”<br/><br/>However, in the next second, the ocean water rushed past them, and their voices quickly disappeared!<br/><br/>They couldn’t withstand it!<br/><br/>The power of the galactic fragment could only withstand Xiao Lan at most.<br/><br/>Adding on Lan Qingyue, they wouldn’t be able to withstand it at all!<br/><br/>Under such circumstances, the weakness of borrowing external forces was revealed.<br/><br/>Eight level seven pantheon were instantly killed!<br/><br/>“Not good, eight emissaries have been killed! ”<br/><br/>At the side, the remaining 30 to 40 level seven pantheon saw the situation and fell into complete despair!<br/><br/>Whoosh! Whoosh! Whoosh! Whoosh<br/><br/>However, Wang Xian did not hesitate at all. He flew directly in front of them and streams of energy landed on their bodies.<br/><br/>Instant Kill!<br/><br/>Another instant kill!<br/><br/>It was not a battle of a calamity!<br/><br/>Wang Xian waved his arm and collected all the corpses. A smile appeared on his face!<br/><br/>“Xiao Xian, it’s Done! ”<br/><br/>At the side, Lan Qingyue also smiled and said to Wang Xian!<br/><br/>Okay!<br/><br/>Wang Xian nodded his head and looked at the fragment of the Starfield.<br/><br/>The fragment of the Starfield was floating there. It didn’t fly away like the last time!<br/><br/>His body moved and he flew over immediately. A palm condensed from energy grabbed towards it!<br/><br/>However, the fragment of the Starfield shook again and flew towards a direction!<br/><br/>Lan Qingyue saw it and waved her arm. A wave of energy blocked the fragment of the Starfield!<br/><br/>Buzz! Buzz! Buzz<br/><br/>The energy released by LAN Qingyue blocked the fragment of the Starfield! The fragment of the starfield trembled and did not break free immediately!<br/><br/>“Eh? It can be blocked?”<br/><br/>Wang Xian’s eyes lit up when he saw this scene.<br/><br/>Whoosh<br/><br/>However, in the next second, the galactic fragment broke free from Lan Qingyue’s defense and continued to fly in a direction!<br/><br/>“Let’s see if we can stabilize it! ”<br/><br/>Wang Xian shouted softly and immediately landed on Xiao Lan’s body!<br/><br/>“woo woo! ”<br/><br/>“woo woo! ”<br/><br/>Xiao Lan let out a low growl and immediately began to pursue.<br/><br/>Lan qingyue immediately followed by the side and chased after the galactic fragment!<br/><br/>Buzz! Buzz! Buzz<br/><br/>Buzz! Buzz! Buzz<br/><br/>However, just as Wang Xian and the rest were chasing after the space behemoth, they were at the starry city.<br/><br/>Just as the strong disciples of all races were still discussing about the dragon palace and the Phoenix clan, an urgent voice was suddenly heard!<br/><br/>The entire starry city trembled slightly!<br/><br/>Everyone instantly discovered that an enormous figure of an angel of light had appeared in the sky above the city!<br/><br/>Below them, they could see ten enormous black tortoise figures appear!<br/><br/>Terrifying defensive arrays were activated in the city!<br/><br/>The entire world seemed to have undergone a huge change!<br/><br/>“What happened?”<br/><br/>Everyone was slightly shocked when they saw this scene, and their faces were filled with shock!<br/><br/>“The army of the belief universe is attacking. All experts above the sovereign realm have climbed up the city walls and come to the fixed race positions! ” At rms moment, a voice resounaea m everyone’s minas!<br/><br/>“The army of the belief universe is here! ”<br/><br/>“They are really here, these damn guys! ”<br/><br/>Something good has happened to our entire starry city. What is the projection of the Radiant Angel in the Sky? What a terrifying appearance, and the projection of the black tortoise below. Is this the defense of our Starry City?”<br/><br/>When the powerful disciples of all races heard this voice, their faces were filled with shock!<br/><br/>The ruler-level existences immediately flew towards the city wall!<br/><br/>The rest of the disciples also immediately flew up and followed closely behind to look into the distance!<br/><br/>“Eh? Why Can’t we see Anything?”<br/><br/>“The army of the belief universe hasn’t arrived yet? Our starry city naturally discovered their arrival in advance. If we only react when we see the starry city, it’ll be too late! ”<br/><br/>The group of Great Beings’ disciples flew up into the sky. When they saw all the Great Beings of the pinnacle races looking in one direction, they all looked in the same direction!<br/><br/>However, they didn’t see anything.<br/><br/>“They’re here. The Army of the belief universe is here! ”<br/><br/>“I’d like to see just how strong the belief universe is!”<br/><br/>At the same time, at the most powerful position of the city wall, the Great Beings of the 13 pinnacle races stood in front of the city wall.<br/><br/>The Great Beings of the pinnacle races muttered to themselves.<br/><br/>In the recent tens of millions of years of war, the 9-origin universe did not have a complete understanding of the power of the belief universe.<br/><br/>Now that the belief universe army had arrived, even if they did not have 100% power, they had already arrived at 90% !<br/><br/>This was a good opportunity to get a feel for the situation!\t\t\t\t\t\t</div>", "images": {}, "success": true}