{"id": 885, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073670.html", "title": "Chapter 3887 - Chapter 3887: 3886 Intercepted The Fragment Of The Starfield And Dominated The Peak-Level Space Behemoth!", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3887 - Chapter 3887: 3886 Intercepted The Fragment Of The Starfield And Dominated The Peak-Level Space Behemoth!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3887: 3886 intercepted the fragment of the Starfield and dominated the peak-level space behemoth!<br/><br/>Translator: 549690339<br/><br/>“Hehe! ”<br/><br/>Prime Minister Gui saw this scene and heard the exclamations around him. His face revealed a look of excitement!<br/><br/>Over the past few days, all the powerful disciples of the Dragon Palace had seen all the information on the communication stone plate.<br/><br/>However, Prime Minister Gui did not make any statement without Wang Xian’s order.<br/><br/>What he said just now was to let all the peak races know how much the Dragon Palace had sacrificed in the war between the nine-origin universe and the belief universe!<br/><br/>Now, he saw the army of the belief universe escaping because of the Dragon King.<br/><br/>He was also full of smiles.<br/><br/>Prime Minister Gui had a very clear understanding of Wang Xian’s situation.<br/><br/>He also knew that their Dragon King had already broken through. Their Dragon Queen, the ancient god Feed Kun master, had already made a breakthrough!<br/><br/>With the Dragon Queen’s breakthrough, all the gods surrounding the Dragon King were killed.<br/><br/>The news of the Dragon Queen’s breakthrough also spread to the belief universe.<br/><br/>Therefore, the experts of the belief universe were somewhat afraid!<br/><br/>This caused the army of the belief universe to immediately retreat!<br/><br/>“Prime Minister Gui, do you know some information? What exactly happened?”<br/><br/>Over at the skeleton clan, a skeleton king couldn’t help but ask when he heard Prime Minister Gui’s laughter!<br/><br/>Now, he was too curious!<br/><br/>He was curious about what had happened to the Dragon King of the Dragon Palace.<br/><br/>What kind of situation could cause the army of the belief universe to retreat!<br/><br/>Hearing the skeleton clan’s words, the other experts from the peak races all turned their eyes to Prime Minister Gui.<br/><br/>“I know the specific situation, but I think our Dragon King has escaped the blockade of the belief universe.”<br/><br/>Prime Minister Gui replied with a smile.<br/><br/>All the powerful beings of the peak races twitched their lips when they heard his words.<br/><br/>Was it that simple for the Dragon King of the Dragon Palace to escape the blockade of the powerful beings of the belief universe?<br/><br/>To be able to make the army of the belief universe so frightened and escape directly after escaping the blockade?<br/><br/>Who would believe that?<br/><br/>“However, there is one thing that our Dragon Palace wants to make clear today. A few days ago, more than a dozen disciples of our Dragon Palace were killed. Our Dragon King also knew about this news, but our Dragon Palace didn’t make any noise! ”<br/><br/>Prime Minister Gui suddenly changed the topic. His eyes swept across the peak races and the powerful disciples of all the races.<br/><br/>Finally, it landed on the Phoenix clan!<br/><br/>“Firstly, according to the Phoenix clan, the disciples of the Dragon Palace were killed because they stole their treasures. Now, the Dragon Palace is prepared to pay a huge price to resurrect the dead disciples. After the resurrection, the Dragon Palace will find out the truth of the matter. If the disciples of the<br/><br/>Dragon Palace were in the wrong, the Dragon Palace will admit their mistake! ”<br/><br/>“If it’s not our Dragon Palace’s fault, then as an old minister, I don’t know how our Dragon King will deal with this matter, Hehe. ” Prime Minister Gui smiled faintly at the end of his speech.<br/><br/>As for how the Dragon King would deal with it?<br/><br/>The entire nine-origin universe knew the Dragon King’s style of doing things.<br/><br/>He had led the Dragon Palace all the way here.<br/><br/>Who cares what high-level race you are, kill!<br/><br/>Who cares if you have a peak race backing you, Kill!<br/><br/>Who cares if you are invincible in the invincible region, kill!<br/><br/>Who cares if you are a peak race expert, kill!<br/><br/>Over the past tens of millions of years, the disciples of the nine-origin universe all understood the Dragon Palace’s style of doing things.<br/><br/>Over the past tens of millions of years, the Dragon Palace had never provoked any power, and even suppressed the other high-level races.<br/><br/>The situation of the Dragon Palace was that if someone didn’t offend them, they wouldn’t offend them!<br/><br/>However, if someone offended the dragon palace, then with the style of the Dragon King of the Dragon Palace, the person who offended them would definitely have to pay a terrible price!<br/><br/>Prime Minister Gui didn’t finish speaking, but everyone knew what the consequences were!<br/><br/>When all the powerful disciples of the Phoenix clan heard Prime Minister Gui’s words, their faces instantly turned extremely ugly!<br/><br/>Their faces were all volatile!<br/><br/>Especially those experts of the Phoenix clan who knew the truth, their faces were even more unsightly!<br/><br/>“This… This declaration of the Dragon Palace is so domineering. I wonder what the truth is this time?”<br/><br/>“I don’t know. In any case, the current strength of the Dragon Palace is absolutely not afraid of any of the peak races. If there really is a force deliberately provoking us, then we will have to pay a terrible price this time! ”<br/><br/>“I have become a hardcore fan of the Dragon King. I support whatever the Dragon King does! ”<br/><br/>At the back, some powerful disciples of the high-level races couldn’t help but whisper.<br/><br/>They didn’t dare to say it out loud because the Phoenix clan was also there.<br/><br/>However, many powerful disciples focused their eyes on the Phoenix clan.<br/><br/>Their gazes were a little strange!<br/><br/>“In short, take care of yourself. No one can bully our Dragon Palace!”<br/><br/>Prime Minister Gui added indifferently, cupped his hands toward the other peak races, and left!<br/><br/>The experts of the other peak races looked at each other and glanced at the Phoenix clan.<br/><br/>They could guess the truth from the expressions of some of the experts of the Phoenix clan.<br/><br/>This time, it was most likely the Phoenix clan who deliberately provoked them first!<br/><br/>(‘We don’t need to worry. Even if that Dragon King of the Dragon Palace is very strong, he at most has the strength of a peak ruler. Our Phoenix Clan has already contacted a space beast race in the starry universe. With their help, we will be fine! ”<br/><br/>A Level 7 ruler of the Phoenix Clan had an ugly expression as he transmitted his voice to the clansmen beside him.<br/><br/>When the clansmen heard this, their expressions relaxed a little.<br/><br/>“That’s right, we don’t need to worry. As long as that expert from the Space Beast Race Comes, we won’t be afraid of the Dragon King! ”<br/><br/>A Level 7 sovereign water phoenix nodded heavily.<br/><br/>They firmly believed!<br/><br/>This was their only hope.<br/><br/>After all, the Dragon King’s power this time had completely scared them!<br/><br/>Even the entire belief universe was afraid of the Dragon King. So what if they were a phoenix clan?<br/><br/>Wang Xian didn ‘t know about the situation at the starry giant city.<br/><br/>He didn’t know either. Although he didn’t come, he pretended to be awesome!<br/><br/>He had become the great hero in the hearts of all the strong disciples in the nine-origin Universe!<br/><br/>At this moment, he was standing on Xiao Lan’s body, chasing after the starfield fragment crazily.<br/><br/>It was the lock fragment of an ultimate treasure of Tianyuan grade!<br/><br/>He wanted to obtain it!<br/><br/>Even if the chance was slim, he wanted to do his best to fight for it!<br/><br/>Buzz! Buzz! Buzz<br/><br/>Xiao Lan and Lan Qingyue’s powers were entangled on the starfield fragment.<br/><br/>However, although Xiao Lan and Lan Qingyue’s powers were strong, the power of the Starfield fragment to break free was also very terrifying!<br/><br/>“Are you confident?”<br/><br/>Wang Xian looked at the galactic fragment in front of him that was struggling to break free and asked Lan Qingyue.<br/><br/>“I’m not confident! ”<br/><br/>Lan Qingyue replied with a solemn expression!<br/><br/>“It’s very likely that a heaven’s fate level powerhouse has placed a restriction on it to prevent it from being lost. ” Wang Xian was indignant!\t\t\t\t\t\t</div>", "images": {}, "success": true}