{"id": 897, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073694.html", "title": "Chapter 3899 - Chapter 3899: 3898,400 Years Of Hunting!", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3899 - Chapter 3899: 3898,400 Years Of Hunting!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3899: 3898,400 years of hunting!<br/><br/>Translator: 549690339<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Wang Xian and Lan Qingyue split up!<br/><br/>Based on the information he received, Wang Xian flew in one direction.<br/><br/>His speed was very fast, and the distance between the other team was not too far away from him!<br/><br/>After searching around for two days, Wang Xian sensed the aura of the power of faith.<br/><br/>This made the corner of his mouth curl up slightly. A smile appeared on his face.<br/><br/>After flying forward for a few minutes, a team of more than 200 people appeared in his line of sight!<br/><br/>Whoosh! Whoosh<br/><br/>He moved his body and increased his speed. In an instant, he arrived in front of the team!<br/><br/>“Oh no, it’s the Dragon King of the Dragon Palace!”<br/><br/>“We’re doomed!”<br/><br/>When Wang Xian appeared in front of them, everyone’s faces immediately<br/><br/>showed fear and despair.<br/><br/>Wang Xian chuckled and flew straight over. A wave of energy enveloped them.<br/><br/>Apart from leaving a few gods behind, the rest were all killed.<br/><br/>“I’ve obtained some more information. Not Bad! ”<br/><br/>Wang Xian obtained two pieces of information from the memories of the gods.<br/><br/>These two pieces of information were the direction of the other two teams!<br/><br/>Although the army of this palace had separated, they were still in the same palace after all. They were very familiar with each other.<br/><br/>Furthermore, they had just separated not long ago. He still knew the general direction!<br/><br/>Wang Xian moved his body and gave chase based on the two directions in his mind!<br/><br/>Five days later, Wang Xian appeared next to another squad again. He went over and killed them!<br/><br/>Seven days later, he found the fourth squad.<br/><br/>Within a few months, Wang Xian had killed four squads and 50 to 60 pantheon gods.<br/><br/>Among them, there were three level seven pantheon gods!<br/><br/>This was already a pretty good harvest!<br/><br/>“Buzz Buzz!”<br/><br/>At this moment, Wang Xian received a message from LAN qingyue.<br/><br/>Lan Qingyue had discovered a squad with tens of thousands of believers in the universe army.<br/><br/>When Wang Xian received the news, his body moved and he immediately flew over.<br/><br/>For this team of ten thousand people who believed in the universe army, it was naturally very easy for LAN Qingyue to destroy it!<br/><br/>However, Lan Qingyue did not have the soul absorbing power. If she were to search for it, it was purely due to luck.<br/><br/>Clearly, her luck was very good.<br/><br/>She found a team of ten thousand people who believed in the universe army.<br/><br/>When Wang Xian rushed over, Lan Qingyue pointed to the location in front of him.<br/><br/>“It’s right there. A small team of 10,000 people from the Army of faith. I didn’t destroy them. ”<br/><br/>Lan Qingyue spoke.<br/><br/>The reason why she didn’t destroy them was to allow Wang Xian to use his soul-absorbing power to obtain more information.<br/><br/>Wang Xian smiled and nodded. He flew over immediately.<br/><br/>A suffocating energy covered the area. The terrifying energy caused all the members of the 10 ,ooo-man team to reveal expressions of despair and fear.<br/><br/>What happened next was exceptionally easy!<br/><br/>After obtaining a lot of information, Wang Xian passed the information to Lan Qingyue.<br/><br/>Then, they continued their hunt!<br/><br/>As time passed, the number of believers and believers who died by their hands increased continuously.<br/><br/>As Wang Xian and the rest continued to hunt and kill,.<br/><br/>When hundreds of thousands of believers and believers of the Universe Army died one after another.<br/><br/>One by one, the news also spread to the channel of the belief universe!<br/><br/>The elders and experts of the belief universe looked a little embarrassed, but they couldn’t do anything about it!<br/><br/>They could only pass this news to the believers and believers in the starry universe.<br/><br/>When the gods and believers in the starry universe received this news, their expressions were as ugly as they could be.<br/><br/>They never expected that they, the mighty experts of the belief universe, would be hunted down after coming to the starry universe.<br/><br/>They were killed one by one like prey!<br/><br/>This made them feel extremely aggrieved!<br/><br/>Powerless and terrified!<br/><br/>All the gods and believers who believed in the universe were worried that they would run into the Dragon King and the rest.<br/><br/>Because once they ran into them, the result would be death!<br/><br/>They did not dare to rest and flew desperately towards the channel of the belief universe.<br/><br/>Time passed day by day, and the hunt continued.<br/><br/>According to Wang Xian’s calculation of the speed of the gods who believed in the universe.<br/><br/>If they wanted to fly to the channel of the belief universe, they would need at least 400 years. In other words, he could hunt for more than 400 years! As time passed, one by one, the gods died at the hands of Wang Xian!<br/><br/>The harvest was also increasing day by day!<br/><br/>More than 200 years had passed. The number of gods and believers of the universe of belief who died at the hands of Wang Xian was equivalent to the total number of believers in an army of belief!<br/><br/>Faced with such losses, the universe of belief had no way out!<br/><br/>At this moment, at the location of the channel of the universe of belief, a large number of experts from the 24 palaces were gathered at the exit of the channel.<br/><br/>Their eyes were filled with anger and killing intent as they stared in the direction of the starry universe.<br/><br/>“Get Ready. If that Dragon Palace dares to approach our space passage and<br/><br/>start hunting, we will directly enter and destroy them! ”<br/><br/>As time passed, the gods and believers of the Universe Legion were getting closer and closer to the exit!<br/><br/>However, the closer they got to the passage, the more worried the gods became about the Dragon Palace Dragon King.<br/><br/>Once the Dragon Palace Dragon King guarded the exit, he could easily slaughter all the gods and believers of the universe.<br/><br/>Therefore, a large number of experts from the 24 palaces of the universe were gathered here.<br/><br/>There were more than 100 peak gods gathered here.<br/><br/>Once there were any problems, they would fly into the starry universe without hesitation.<br/><br/>This was because they were at the edge of the universe. If they entered the starry universe in a short period of time, they would have enough time to retreat even if they were sensed by the heaven origin cosmic behemoth in the Starry Universe!<br/><br/>Therefore, as long as the Dragon King of the Dragon Palace dared to appear near their passageway, they would dare to enter and destroy him!<br/><br/>Time was getting closer and closer. Wang Xian had been hunting the gods and believers of the universe for more than 300 years.<br/><br/>At this moment, he was getting closer and closer to the channel of the universe of belief!<br/><br/>“Let’s stop. This hunt ends here! ”<br/><br/>Wang Xian, Lan Qingyue, and the rest were floating in the void. He hesitated for a moment before speaking!<br/><br/>“Alright. Further ahead is the channel of belief in the universe. If they have the Heaven’s fate there, we will be in great danger as well. The harvest over the past few hundred years is already very bountiful! ”<br/><br/>Lan Qingyue said with a smile on her face!<br/><br/>In the past few hundred years of pursuit, apart from the two legions that they had destroyed in the beginning, they had also killed at least two powerhouses and believers from the army of belief in the universe one after another!<br/><br/>The harvest this time was not small!<br/><br/>Wang Xian and the rest were not greedy and stopped in time!<br/><br/>The resources in their hands were enough to elevate the Dragon Palace to a very powerful level!<br/><br/>“Let’s go back!”<br/><br/>Wang Xian said to Lan Qingyue with a satisfied smile..\t\t\t\t\t\t</div>", "images": {}, "success": true}