{"id": 894, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073688.html", "title": "Chapter 3896 - Chapter 3896: 3895, The Second Faith Army", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3896 - Chapter 3896: 3895, The Second Faith Army</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3896: 3895, the second Faith Army<br/><br/>Translator: 549690339<br/><br/>“Lin Wenluo, monitor the direction on the right. ”<br/><br/>Wang Xian received a piece of news from the dozens of level four pantheon of the Radiant Sun Palace.<br/><br/>On the right, there was an army of Faith Army.<br/><br/>This range was within the range of Lin Wenluo’s Scouting!<br/><br/>Wang Xian gave him an order and flew in that direction with Lan Qingyue! (‘We should be able to get a good harvest this time! ”<br/><br/>Lan qingyue followed beside Wang Xian and said with a smile on her face!<br/><br/>“HMM, the harvest should be good! ”<br/><br/>Wang Xian nodded. “Even if we can only destroy two to three legions of the universe of faith, it will still allow our dragon palace to obtain a large amount of resources. ”<br/><br/>One had to know that two to three legions of the universe of faith would mean that there were 200,000 experts of the Pantheon level.<br/><br/>Putting everything else aside, the heart of the pantheon of the 200,000 strong people of the Pantheon level could easily give birth to 200,000 existences of the Overlord level in the Dragon Palace.<br/><br/>Not to mention that there were believers below the Pantheon level!<br/><br/>Wang Xian was flying on the right according to the memories of the Pantheon of the gods. He wanted to see if he could bump into them!<br/><br/>Buzz<br/><br/>Not long after, Lin Wenluo sent a message!<br/><br/>Wang Xian smiled when he saw his message!<br/><br/>Lin Wenluo had detected the gods who believed in the universe at a location not far away from him.<br/><br/>However, it was different from the last time. This time, there were only over a hundred of them!<br/><br/>Furthermore, these over a hundred gods had discovered the scouting device that he had set up!<br/><br/>After Wang Xian received this message, he immediately flew towards the location that Lin Wenluo had sent!<br/><br/>He was only a few minutes away from that location!<br/><br/>“This should be the technology of the nine-origin universe. Although the technology of the nine-origin universe is not very powerful, it is extremely useful in terms of exploration and surveillance. Currently, only the Dragon King of the Dragon Palace and the rest of the powerhouses of the nine-origin universe are able to move around here. This should be arranged by the Dragon<br/><br/>King of the Dragon Palace. We have been discovered! ”<br/><br/>At the same time, more than a hundred gods were floating in the air not far away.<br/><br/>They looked at the detector in front of them with serious expressions.<br/><br/>“What’s going on?”One by one, they guessed!<br/><br/>Their expressions were not good as they looked at each other!<br/><br/>“Retreat immediately and tell the army behind us to stay away from here. Once we are locked on by the Dragon King of the Dragon Palace, we will definitely die. Quick!”<br/><br/>A rank seven pantheon said.<br/><br/>Then, without any hesitation, they fled to the rear!<br/><br/>At the same time, they sent out messages one after another!<br/><br/>Unlike the Glorious Sun Palace, the army of their palace did not gather together.<br/><br/>Instead, they divided into five teams.<br/><br/>Each team had more than a hundred pantheon, and they were spread out in front, behind, and to the left and right.<br/><br/>Once they encountered danger or encountered any abnormalities, they could be immediately sent to the army in the center.<br/><br/>This caused the army in the center to react quickly!<br/><br/>This time, they discovered the abnormalities ahead of time!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>However, not long after they left, Wang Xian, Lan Qingyue, and the rest appeared!<br/><br/>“It should be this way. There are faint fluctuations of the power of Faith Here! ”<br/><br/>Lan qingyue pointed in a direction and said!<br/><br/>“Alright, let’s chase after them. Their speed is not as fast as ours. ”<br/><br/>Wang Xian’s figure moved. With the help of the power of the galactic fragment, he flew rapidly in a direction!<br/><br/>“Found them! ”<br/><br/>When Wang Xian and the rest flew for about five minutes, figures appeared in their line of sight one by one!<br/><br/>When Wang Xian saw the hundreds of gods, a smile appeared on his face! “Oh? Not good, there’s a terrifying force coming from the back! ”<br/><br/>At the front, a level seven God who was holding a picture of faith in his hand noticed that the picture in his hand had suddenly changed. His expression<br/><br/>changed as he let out a low growl and immediately looked behind him!<br/><br/>When he looked over, his pupils contracted slightly. Immediately, he saw a terrifying figure standing on a star and flying towards them!<br/><br/>Beside him was an incomparably huge space beast!<br/><br/>“It’s the Dragon King of the Dragon Palace. This is bad. Immediately report to the army and tell them to flee!”<br/><br/>A shocked expression appeared on the face of the rank seven pantheon as he roared loudly!<br/><br/>Boom<br/><br/>At this moment, a wave of energy covered them. The powerful force caused their bodies to tremble violently.<br/><br/>They felt that the space around them had undergone a huge change.<br/><br/>They felt that they were in a sticky space, and their speed had been reduced by more than ten times!<br/><br/>“Hehe, I got another one.”<br/><br/>Wang Xian looked at them with a smile. With a wave of his arm, specks of energy covered them one by one!<br/><br/>As the specks of energy landed on their bodies, the gods were instantly killed.<br/><br/>They didn’t even have the chance to scream.<br/><br/>“This… This is the Dragon King of the Dragon Palace. We are doomed! ”<br/><br/>“Lord Qing and the rest have been killed. This Damn Dragon King of the Dragon Palace. We believe in the universe and will not let you off! ”<br/><br/>There were seven to eight gods who were not killed by Wang Xian. When they saw this scene, their bodies trembled violently. They looked at Wang Xian with bloodshot eyes and shouted loudly!<br/><br/>Soul Catcher! ”<br/><br/>Wang Xian heard their incompetence and fury. He waved his arm and a surge of energy surged into their minds!<br/><br/>Information was transmitted one by one. The exact location of the Army of the universe and all the information appeared in their minds!<br/><br/>“Hehe, let’s go. Their army is still in front! ”<br/><br/>Wang Xian waved his arm and collected all the corpses of the gods. Then, he flew forward!<br/><br/>At this moment, the army at the front had already received the news from the front.<br/><br/>The entire army did not hesitate at all. They immediately changed their direction and flew to the right!<br/><br/>However, their speed was too slow.<br/><br/>To Wang Xian and the rest, it was too slow!<br/><br/>They were not on the same level of speed. Wang Xian could easily chase after them.<br/><br/>Seeing the second million-strong army from afar, a smile appeared on Wang<br/><br/>Xian’s face!<br/><br/>Xiao Lan let out a low growl and flew straight over!<br/><br/>“Oh no, we’ve been discovered?”<br/><br/>“How is this possible? How can they be so fast?”<br/><br/>“That space behemoth should be the Kun that the ancient god of the dragon palace fed to the Kun master. We’re doomed, we’re doomed!”<br/><br/>“What terrifying power! ”<br/><br/>Xiao Lan growled. All the gods and believers in this palace’s army looked over.<br/><br/>When they saw the terrifying giant beast flying toward them and felt the invincible power coming from its body, despair appeared on their faces!<br/><br/>Wang Xian looked at this army and smiled!<br/><br/>It was the second million-strong army!<br/><br/>Next, it was no longer a battle.<br/><br/>It was an easy victory.<br/><br/>The second Faith Legion. This was also the third Faith Legion that Wang Xian had eliminated.<br/><br/>Continue!\t\t\t\t\t\t</div>", "images": {}, "success": true}