{"id": 899, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073698.html", "title": "Chapter 3901 - Chapter 3901: 3900 Had Completely Refined The Star Field Fragment", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3901 - Chapter 3901: 3900 Had Completely Refined The Star Field Fragment</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3901: 3900 had completely refined the star field fragment<br/><br/>Translator: 549690339<br/><br/>More than 10 ,ooo years had passed, but the Dragon Palace didn’t take revenge on the Phoenix clan. This surprised many people, but they also felt normal.<br/><br/>Many experts and disciples even agreed with the Dragon Palace’s actions!<br/><br/>After all, the Phoenix clan had found four allies and four universe Dominators, Level 7 space beasts.<br/><br/>After learning that the Dragon Palace’s Dragon King had suppressed the entire belief universe and even caused the entire army to flee, the Dragon King became the idol of many disciples in the nine-origin universe.<br/><br/>Even some experts of the peak races admired the Dragon Palace’s Dragon King!<br/><br/>The rise of the Dragon King and his invincible path were discussed by many people!<br/><br/>Therefore, it was normal that the Dragon Palace didn’t take revenge on the Phoenix clan in the past ten thousand years.<br/><br/>No other disciples said that the Dragon Palace was afraid of the Phoenix clan!<br/><br/>On the contrary, they supported the Dragon King to give up on revenge for now and take revenge when he was stronger!<br/><br/>The prestige of the Dragon Palace started to gather unknowingly.<br/><br/>“Haha, we did it. The Second Level Seven Sovereign Realm Space Beast, the second one, Hahaha! ”<br/><br/>At the same time, a group of Phoenixes and angels flapped their wings and floated in front of them.<br/><br/>The phoenixes were extremely excited.<br/><br/>There were six level 7 ruler Astral Beasts on the left, right, and center.<br/><br/>The Level 7 ruler Astral Beast in the center was covered in wounds and had a weak aura. It lowered its head.<br/><br/>“Brothers of the Phoenix clan, it’s time for our Angel Clan! ”<br/><br/>An Archangel at the seventh level ruler realm looked at the Phoenixes and said with a smile.<br/><br/>“Of course, as we agreed.”<br/><br/>A phoenix nodded.<br/><br/>“Hehe, as long as Our Angel clan subdues two space beasts at the seventh level ruler realm, we can directly destroy the Dragon Palace!”<br/><br/>An Archangel said with a smile.<br/><br/>“Of course. Even without the help of the qingying void Beast, we can destroy<br/><br/>An expert from the Phoenix race said with a smile.<br/><br/>“The Dragon Palace was killed on purpose by the Phoenix race. Ten thousand years have passed, but the Dragon King still doesn’t dare to do anything. He must be afraid of the four qingying void beasts. At most, he has two or three peak-stage void beasts. ”<br/><br/>“That’s absolutely right. Hehe, that Dragon Palace even said that they would make us pay a terrible price? After the Angel clan is successfully tamed, we will completely exterminate that Dragon Palace Dragon King! ”<br/><br/>The few Phoenixes spoke with cold faces and killing intent!<br/><br/>The experts from the Angel clan also smiled and nodded.<br/><br/>It had been more than 10,000 years since the qingying space behemoth clan arrived.<br/><br/>The Phoenix clan had paid a huge price in resources to invite them over.<br/><br/>It wasn’t just to intimidate them.<br/><br/>Instead, they had paid a price in order to have four level 7 space beasts help them tame level 7 space beasts.<br/><br/>It was much easier to tame space beasts without intelligence and civilization.<br/><br/>Of course, taming a Level 7 ruler realm space beast wasn’t that simple.<br/><br/>The main reason was that the Phoenix race had too deep of a foundation.<br/><br/>After all, they were a very powerful peak race.<br/><br/>They had accumulated a lot of treasures.<br/><br/>Taming a space beast was something that the peak races had done a long time ago. However, they didn’t have the strength to tame a Level 7 ruler Realm Space Beast.<br/><br/>The Phoenix clan used the help of four level 7 Space Beasts to tame them.<br/><br/>They also called the Angel clan over and exchanged some resources and benefits to help them tame two level 7 space beasts.<br/><br/>As long as they succeeded, they would have the strength of two level 7 space beasts. Then, why would they be afraid of the Dragon Palace?<br/><br/>They could even take the initiative to attack the Dragon Palace.<br/><br/>Time passed day by day, and in the blink of an eye, another ten thousand years had passed.<br/><br/>The ten thousand years had completely calmed down.<br/><br/>The powerful disciples of the peak-level races once again stepped on the path of searching for opportunities and resources.<br/><br/>From time to time, the news of a certain expert breaking through came from the communication stone plate.<br/><br/>However, during these tens of thousands of years, the powerful disciples of the Phoenix clan and the Angel clan became active.<br/><br/>In the communication stone plate, once the powerful disciples praised the Dragon King of the Dragon Palace, they would receive disdainful replies from the powerful disciples of the Phoenix clan and the Angel clan.<br/><br/>Gradually, in the end, some of the powerful disciples of the Phoenix clan and the Angel clan expressed in the communication stone plate that they were not afraid of the Dragon King of the Dragon Palace at all.<br/><br/>“The Dragon King of the Dragon Palace is very strong? That’s because they have the existence of the ancient god Kun-master. The Dragon Palace only has the ancient god Kun-master and the Dragon King of the Dragon Palace to support them. They don’t have any other powerful disciples. ”<br/><br/>“The Dragon Palace said that they would make the Phoenix race pay the price. Now that 20,000 years have passed, isn’t the Phoenix race still fine? Does the dragon palace dare to be impudent with the Phoenix Race?”<br/><br/>“Only the Dragon Palace is lucky. If it was in the nine-origin universe, would the dragon palace dare to shout at the Phoenix clan and the Angel Clan? They would have been destroyed long ago! ”<br/><br/>“They said that they would make the Phoenix clan pay the price. What’s Wrong Now? Why is the Dragon Palace Hiding?”<br/><br/>The powerful disciples of the Phoenix clan and the Angel clan mocked in the communication stone plate.<br/><br/>This caused many powerful disciples who admired the Dragon King of the Dragon Palace to fight back.<br/><br/>However, the powerful disciples of the Phoenix clan fought back directly.<br/><br/>The powerful disciples of the Dragon Palace were killed on purpose by the Phoenix clan. It had been more than 20,000 years. Would the Dragon Palace Dare to take revenge? Hehe.<br/><br/>One sentence made many people speechless.<br/><br/>In the universe, strength was king.<br/><br/>Even if there were many strong disciples who were unhappy, strength was everything.<br/><br/>Buzz! Buzz! Buzz<br/><br/>Wang Xian did not know what was happening in the outside world. At this moment, he was nurturing the galactic fragment with all his might!<br/><br/>Twenty thousand years had passed. On this day, the galactic fragment slowly entered Wang Xian’s body.<br/><br/>The virtual images of the planets slowly appeared around him.<br/><br/>The virtual images of each planet contained a terrifying power.<br/><br/>When Wang Xian saw this scene, a smile appeared on his face.<br/><br/>He had completely refined it and successfully nurtured it.<br/><br/>Now, this galactic fragment truly belonged to him.<br/><br/>When the galactic fragment entered his body, Wang Xian could feel the terrifying power in his body.<br/><br/>This power was vast and invincible!<br/><br/>He could feel that he could easily kill Xiao Lan even if he were to face her!<br/><br/>After completely refining the galactic fragment, the attacking methods of the galactic fragment had also increased by a lot.<br/><br/>This was completely incomparable to the simple usage of the eight level seven pantheon back then..\t\t\t\t\t\t</div>", "images": {}, "success": true}