{"id": 893, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073686.html", "title": "Chapter 3895 - Chapter 3895: 3894 Started The Hunt! Down", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3895 - Chapter 3895: 3894 Started The Hunt! Down</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3895: 3894 started the hunt! down<br/><br/>Translator: 549690339<br/><br/>“Alright! ”<br/><br/>Wang Xian looked at the direction that an lie was pointing at and narrowed his eyes slightly.<br/><br/>With a move of his palm, the fragment of the Starfield appeared in his hand!<br/><br/>A planet appeared under his feet. He chased after it at a terrifying speed.<br/><br/>This time, Lan Qingyue did not follow him.<br/><br/>He could easily kill a person who believed in the power of the universe army!<br/><br/>His flying speed was very fast, comparable to the speed of a level seven space beast.<br/><br/>As for a level six space beast, its speed was much slower!<br/><br/>They only flew for about ten seconds.<br/><br/>With Wang Xian’s speed, he would be able to catch up to it in less than ten With the help of the terrifying power of the galactic fragment, soon, the figure of a space beast appeared in Wang Xian’s line of sight.<br/><br/>On the body of that Galactic Beast was a million-strong army of the palace!<br/><br/>When Wang Xian saw them, he couldn’t help but smile.<br/><br/>It was time for revenge!<br/><br/>“Galactic fragment, Unsolvable Domain! ”<br/><br/>Wang Xian flew over instantly. The powerful speed brought about by the galactic fragment caused the army of belief in the universe to be unable to react in time!<br/><br/>He flew over and immediately unleashed the energy of the galactic fragment!<br/><br/>Unsolvable domain!<br/><br/>In an instant, the entire void underwent a terrifying transformation!<br/><br/>The starry sky just now seemed to have disappeared, causing them to enter another starry sky!<br/><br/>And in this starry sky, there was a mystical energy!<br/><br/>There were also stars and meteorites in the surroundings.<br/><br/>It didn’t seem special!<br/><br/>This was the power of Wang Xian’s manipulation of the galactic fragment.<br/><br/>Although he had nurtured it a little, his control over the fragment of the Starfield had already surpassed the eight gods.<br/><br/>The eight gods had borrowed a lot less power than him, and their attacking methods were also much less.<br/><br/>At the very least, the eight gods wouldn’t be able to use the unsolvable domain!<br/><br/>“Eh? What’s Going On?”<br/><br/>“What’s going on?”<br/><br/>At the front, all the gods and believers of the radiant Sun Palace who were standing on the space behemoth saw this scene. Their pupils constricted slightly and their faces revealed a look of astonishment.<br/><br/>They immediately sized up their surroundings and were filled with vigilance.<br/><br/>They did not immediately suspect that they had been attacked by the Dragon King of the Dragon Palace.<br/><br/>It was also possible for them to be attacked by the space behemoth in the starry universe!<br/><br/>They sized up their surroundings!<br/><br/>“Explode! ”<br/><br/>Wang Xian looked at them being pulled into the unsolvable zone and smiled!<br/><br/>He smiled and let out a low roar!<br/><br/>Boom! Boom! Boom<br/><br/>All of a sudden, the meteorite beneath the level six space beast exploded.<br/><br/>The terrifying aftershock of the explosion went straight for the Space Beast! “Roar! Roar! Roar!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>The destructive power caused the space beast to roar in fear and despair!<br/><br/>Below it, a large number of wounds instantly appeared!<br/><br/>The wounds tore through its body, causing its life force to quickly disappear!<br/><br/>“Not good, there’s an ambush! ”<br/><br/>“This… this is such a terrifying attack!”<br/><br/>All the gods and believers of the universe felt the attack coming from below, and their expressions changed drastically.<br/><br/>They saw the life force of the space beast that was at the level 6 ruler realm quickly disappear, and they hurriedly flew up into the sky!<br/><br/>“Unsolvable domain. Unless your strength is stronger than mine, a single word from me can decide the life and death of all the living beings in this domain! ”<br/><br/>Wang Xian mumbled as he looked at the over one hundred level seven pantheon.<br/><br/>Without any hesitation, he clenched his palm into the air!<br/><br/>Buzz<br/><br/>A wave of energy enveloped the over one hundred level seven pantheon.<br/><br/>The terrifying energy pressed down on them!<br/><br/>“Not good!”<br/><br/>“What kind of power is this? Where are the enemies? What kind of existence is attacking us?”<br/><br/>“Damn it, is it that Dragon King?”<br/><br/>The group of Type 7 gods felt the terrifying energy, and their faces were filled with shock.<br/><br/>Their bodies burst out with a vast power of faith, and the images of their believers appeared.<br/><br/>However, under this power, they couldn’t resist at all.<br/><br/>The unsolvable domain was, after all, a full-force attack from a peak race, so they naturally couldn’t resist it!<br/><br/>“Ahhhh!”<br/><br/>Screams sounded out as the tier 7 gods fell one after another!<br/><br/>“How is this possible?”<br/><br/>At this moment, the other tier 6 gods, the other gods, and all their believers looked at this scene in shock.<br/><br/>More than a hundred tier 7 gods were instantly killed. What kind of power was this! !<br/><br/>“Weng Weng Weng! ”<br/><br/>At this moment, waves of energy surged toward the other gods and believers!<br/><br/>The invincible and terrifying energy made them unable to resist at all!<br/><br/>In fact, many of the gods and believers didn’t even let out a scream!<br/><br/>More than a million believers and gods, in just a few seconds, only a dozen of them were still floating in the air, looking around in despair!<br/><br/>Buzz<br/><br/>However, at this moment, they felt a surge of energy surging into their minds.<br/><br/>Following that, their eyes turned dull!<br/><br/>The power of Soul Catcher!<br/><br/>All the believers and the gods had died. He had left a dozen of them behind to perform soul catcher. He was prepared to gather information about the other legions!<br/><br/>With a wave of his arm, he gathered all the corpses. There were also a lot of resources!<br/><br/>However, the only regret was that Wang Xian could not use the treasures and weapons of the belief universe.<br/><br/>To him, it was completely useless!<br/><br/>Waves of information were transmitted into Wang Xian’s mind, causing the corners of his mouth to curl up slightly!<br/><br/>Based on the information in the minds of these ten plus gods, he gained a little understanding of the rest of the Legion in the belief universe!<br/><br/>“All of them have been scattered. There is a legion of the belief universe that is closest to them. It should be within the range of Lin Wenluo’s surveillance. As for the rest of the Legion of the belief universe, I have no idea! ” Wang Xian mumbled.<br/><br/>However, he was somewhat satisfied to be able to obtain a piece of information!<br/><br/>“To be able to gain so much in just one trip. This is a huge profit!”<br/><br/>Wang Xian waved his arm and the unsolvable domain disappeared. A huge smile appeared on his face.<br/><br/>This army of faith was comparable to the strength of all the strong disciples of the strongest races in the nine-origin universe!<br/><br/>And their hearts of faith were a treasure for the strong disciples in the nine-origin universe to achieve a breakthrough.<br/><br/>This was too much for the improvement of the Dragon Palace!<br/><br/>“Let’s continue. Let’s strive to destroy seven to eight faith armies. ”<br/><br/>Wang Xian grinned and said.<br/><br/>He looked at an lie who was beside him!<br/><br/>An lie came to him and brought him to their temporary base!<br/><br/>“Xiao Xian, did you succeed?”<br/><br/>Lan qingyue immediately asked when she saw Wang Xian return!<br/><br/>(‘I succeeded. The harvest this time is not bad. Furthermore, I obtained some good news! ”<br/><br/>Wang Xian smiled and said.<br/><br/>The destruction of the Sun Glory Palace’s army was just the beginning!\t\t\t\t\t\t</div>", "images": {}, "success": true}