{"id": 891, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073682.html", "title": "Chapter 3893 - Chapter 3893: 3892, Start The Hunt! Let’S Go", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3893 - Chapter 3893: 3892, Start The Hunt! Let’S Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3893: 3892, start the hunt! Let’s Go<br/><br/>Translator: 549690339<br/><br/>“Their strength is comparable to Xiao Lan and Lan Qingyue!”<br/><br/>Wang Xian felt the power that he could control and a smile appeared on his face!<br/><br/>“The limit of this star field fragment should be to borrow the power of the star field fragment and be able to kill three to four existences at the peak of the ruler realm. ”<br/><br/>He mumbled.<br/><br/>After connecting with the Heaven’s origin creation, he knew that when the Heaven’s origin creation was in perfect condition, it was called a star field.<br/><br/>It could release the terrifying power of the entire galaxy.<br/><br/>As for how it was destroyed, Wang Xian had no idea. However, the eight fragments in his possession were equivalent to one-fifth of the entire Heaven’s origin creation fragment!<br/><br/>In other words, there were thirty-two fragments of the galaxy outside!<br/><br/>As for where the remaining fragments were, Wang Xian had no idea!<br/><br/>In short, it was definitely not in the belief universe.<br/><br/>In the entire belief universe, there were powerhouses in the Heaven’s origin realm who had searched through everything.<br/><br/>The rest of the fragments were in other universes!<br/><br/>After controlling a portion of the power, Wang Xian’s current strength had become even stronger!<br/><br/>Even if he didn’t rely on Lan Qingyue and Xiao Lan, he could still fight against the two peak gods!<br/><br/>“Qingyue!”<br/><br/>Wang Xian held the starfield fragment in his hand. He looked at Lan Qingyue who was not far away and shouted!<br/><br/>“Eh? Xiao Xian, are we going to make a move?”<br/><br/>Lan Qingyue immediately asked with a smile! “Yes, it’s time to meet the army that believes in the Universe!”<br/><br/>Wang Xian said with a smile on his face!<br/><br/>“Alright, let’s go. With our strength, as long as we lock onto them, we can easily destroy them! ”<br/><br/>Lan Qingyue said with a smile!<br/><br/>“Let’s go. Let’s use the power of the galactic fragment to fly. This way, our speed will be faster! ”<br/><br/>Wang Xian moved his palm and a wave of energy surged into the galactic fragment!<br/><br/>“Meteor!”<br/><br/>He shouted in a low voice and a meteor instantly appeared beneath them!<br/><br/>Lan qingyue, Xiao Lan, and the rest immediately landed on the meteor!<br/><br/>Buzz<br/><br/>The entire meteor trembled. Following that, it streaked across a ray of light and sped off into the distance!<br/><br/>This was the terrifying speed of a real meteor!<br/><br/>“As expected of a heaven’s origin creation level fragment. It’s really powerful! ”<br/><br/>Lan qingyue felt this speed and exclaimed in slight astonishment!<br/><br/>“It’s indeed very powerful. Back then, the eight level seven pantheon could rival the strength of peak pantheon with the help of this star field fragment. In my hands, they could erupt with even stronger strength. ”<br/><br/>Wang Xian said with a smile.<br/><br/>“By the way, Little Xian, Prime Minister Gui has reported to you about what happened in the past two hundred years, right?” Lan Qingyue looked at him and asked with a smile.<br/><br/>“I’ve already said it! ”<br/><br/>Wang Xian nodded. “The dozen or so disciples of our Dragon Palace have already been resurrected. It’s indeed the Phoenix clan who is looking for trouble. ”<br/><br/>“Now, the Phoenix Clan has found an ally of the space beasts. Moreover, they are four space beasts who are at the level seven realm. They should be the group of Space Beasts from the nine-origin universe back then. ”<br/><br/>Lan qingyue added, “I don’t know if they can be considered as the subordinates of the chaotic space beasts. If they are, we have the beast king token so they can’t attack us.”<br/><br/>“We are not afraid of the four space beasts at the level seven of the ruler realm even if they are not the subordinates of the chaotic space beasts. As long as they dare to help the Phoenix clan, we will kill them immediately! ” Wang Xian said!<br/><br/>Now, the Dragon Palace had the strength and confidence to do so!<br/><br/>Lan qingyue nodded with a smile!<br/><br/>The meteor was flying forward at a rapid speed!<br/><br/>This was still the edge of the infinite starry sky. Wang Xian and the rest were relatively safe at the edge of the infinite starry sky.<br/><br/>After flying at a rapid speed for a few months, they flew out of the ocean.<br/><br/>The speed of a meteor was comparable to the speed of a peak-stage pantheon expert!<br/><br/>This speed was much faster than the speed of the 21 armies of the belief universe!<br/><br/>“Over 200 years, they can at most fly half of the way. We can just wait at the half-way point! ”<br/><br/>The place where the starry city was located was closer to the passageway of the nine-origin Universe!<br/><br/>As for the passageway of the universe of belief, it was the opposite of the passageway of the nine-origin universe!<br/><br/>In other words, the army of the universe of belief had invaded the nine-origin universe and flew across the entire universe!<br/><br/>With their speed, they could only travel half the distance in two hundred years!<br/><br/>All Wang Xian needed to do was to wait here! “Let’s split up when the time comes. ” Lan Qingyue looked at Wang Xian and said!<br/><br/>Okay!<br/><br/>Wang Xian nodded. “Not only that, I will also get an lie to bring Lin Wenluo over. I will get him to bring a large number of flying machines over and set up a spy in the void. Once they are discovered, we will immediately hunt them down !<br/><br/>Lin Wenluo was a scientist in the world of Science and Technology!<br/><br/>He could be considered to have joined the Dragon Palace.<br/><br/>The Dragon Palace would provide him with a large number of powerful metals!<br/><br/>He would be helping the Dragon Palace to forge powerful weapons!<br/><br/>He did not know how far Lin Wenluo had reached. However, it was still very simple to set up a spy in the starry sky!<br/><br/>Flying Robots, surveillance, and the like were the specialties of the world of technology!<br/><br/>Okay!<br/><br/>Lan qingyue nodded her head.<br/><br/>Wang Xian took out his communication stone plate and sent a message to an lie and Lin Wenluo!<br/><br/>Lin Wenluo replied very quickly!<br/><br/>A few minutes later, Lin Wenluo appeared in front of Wang Xian.<br/><br/>“Greetings, Dragon King! ”<br/><br/>Lin Wenluo looked at Wang Xian with respect and awe!<br/><br/>Compared to the past, the respect and awe he had now was even stronger!<br/><br/>Now, in the nine-origin universe, who wouldn’t admire the Dragon King of the Dragon Palace?<br/><br/>He had single-handedly made the entire belief universe bow its head!<br/><br/>Such strength shocked everyone!<br/><br/>At this moment, Lin Wenluo couldn’t help but feel extremely happy that he had chosen to join the camp of the Dragon Palace!<br/><br/>“Hehe, stand up.”<br/><br/>Wang Xian looked at him and nodded with a smile. “How’s the research from a few years ago?”<br/><br/>“Thanks to you, Dragon King, the improved weapons of the Dragon Palace, the Fire Hammer clan of the Dragon Palace, Wu Sha, and the others. The results of the research over the past tens of millions of years are not bad. Now, they are able to produce weapons that can threaten existences at the third level of the<br/><br/>Overlord Realm! ”<br/><br/>Lin Wenluo replied with a smile on his face!<br/><br/>“HMM, not bad. The reason I called you here is to ask you to seal off a space domain. This space domain might be very large. You can just send a large number of reconnaissance robots to investigate it. ”<br/><br/>Wang Xian nodded and said to him!<br/><br/>“Oh? Dragon King, is it an army that is looking for the universe of Faith?” Lin Wenluo guessed!<br/><br/>“Yes, an army from the universe of faith. They should be on their way back now. I want to intercept them! ”<br/><br/>Wang Xian nodded. “I’m afraid the range of this blockade will be very large.<br/><br/>You can do as much as you can.”<br/><br/>“Alright, Dragon King. This area is too wide. I can only seal about one-tenth of it at most. This is under the condition that the center is not sealed.”<br/><br/>Lin Wenluo spoke!<br/><br/>sure!<br/><br/>Wang Xian nodded his head!\t\t\t\t\t\t</div>", "images": {}, "success": true}