{"id": 890, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073680.html", "title": "Chapter 3892 - Chapter 3892: 3891 Allies Of The Phoenix Clan!", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3892 - Chapter 3892: 3891 Allies Of The Phoenix Clan!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3892: 3891 allies of the Phoenix clan!<br/><br/>Translator: 549690339<br/><br/>Wang Xian had been dormant for more than 30 million years. He did not leave this place by committing suicide. He was waiting for the day when he would take revenge and counterattack.<br/><br/>However, this day came with great ferocity.<br/><br/>Not only did Xiao Lan Qingyue’s strength improve, but she also obtained an extremely powerful starfield fragment!<br/><br/>This was an ultimate treasure of the Tianyuan Destiny Level!<br/><br/>In the belief universe, the experts from the eight palaces had fought for these eight fragments back then!<br/><br/>As for Wang Xian, he obtained them relatively easily!<br/><br/>The matter of the Phoenix clan would be dealt with later. The Army of the belief universe would be dealt with first!<br/><br/>Wang Xian occupied the center of this land of thunder and lightning. The Five Elements Millstone and the Tai Chi Dragon disc flew out and circled around him. He began to nurture this starfield fragment.<br/><br/>Only by nurturing them could they be controlled and used!<br/><br/>With the help of the Tai Chi Dragon Disc and the five elements millstone, the speed of nurturing them would increase by a lot!<br/><br/>Time passed day by day. In this land of lightning, lightning dragons were transported over one by one.<br/><br/>This land of lightning was indeed a rare existence.<br/><br/>The energy contained in it was only slightly inferior to the fiery heart land of lightning!<br/><br/>The disciples of the Thunder Dragon and the thunder-elemental dragon palace could increase their cultivation speed by a lot.<br/><br/>With the help of the heart of faith, the experts of the Dragon Palace could improve very fast!<br/><br/>Time passed day by day.<br/><br/>“Roar! Roar! Roar!”<br/><br/>A hundred years later, roars suddenly came from the front of the Star City!<br/><br/>After the army of the belief universe retreated, the entire 9-origin universe had entered an era of peace!<br/><br/>However, all the powerful disciples knew that the peace in the 9 -origin universe wouldn’t last for long.<br/><br/>Because the Dragon Palace would probably take revenge on the Phoenix Clan!<br/><br/>Many powerful disciples from the peak and high-level races were also waiting.<br/><br/>But after more than 100 years, the Dragon Palace didn’t take any action!<br/><br/>However, this time, the disciples of the 9-origin universe weren’t so anxious that the Dragon Palace wouldn’t take revenge.<br/><br/>Because the Dragon King was in the belief universe, it would take hundreds of years for him to fly over!<br/><br/>Without War, the entire space city fell into peace!<br/><br/>On this day, a sudden roar shocked all the disciples in the space city.<br/><br/>“They’re here! ”<br/><br/>“They’re finally here! ”<br/><br/>At this moment, in a building with the symbol of the Phoenix clan located in the starry city.<br/><br/>More than a dozen level 7 sovereign realm phoenixes heard the roar and heaved a heavy sigh of relief.<br/><br/>“The Qingying Space Behemoth clan is here. Our Phoenix clan has renegotiated the terms with them. They’ve sent four level 7 sovereign realm existences. With them here, even if the Dragon King is very powerful, what can he do to us.<br/><br/>“Let’s go and welcome them! ”<br/><br/>The experts of the Phoenix tribe moved and flew toward the front of the Giant<br/><br/>Star City!<br/><br/>“Chirp! Chirp! Chirp! ”<br/><br/>At the same time, they responded with a chirp!<br/><br/>“HMM? is that the Cosmic Behemoth tribe that the Phoenix tribe contacted?<br/><br/>It’s here. The Aura is so terrifying. It must be a level 7 ruler! ”<br/><br/>“The Phoenix race should have reached an agreement with this space beast race. Now, it won’t be so easy for the Dragon King and the others to kill the experts of the Phoenix race!”<br/><br/>“What a terrifying aura. The Phoenix race has really contacted them. Moreover, there are a few powerful existences that are comparable to the peak ruler realm. They are invincible in our nine-origin universe and the belief universe. The Dragon King and the others are at most comparable to a Level 7 ruler Space Beast! ”<br/><br/>“It seems that the crisis of the Phoenix clan is about to be resolved. I wonder what price they have paid! ”<br/><br/>In the Giant Star City, the experts of the peak races had already looked in that direction when they heard the roar.<br/><br/>When they saw the Phoenix clan welcoming them, they all muttered to themselves!<br/><br/>“What’s Over There?”<br/><br/>“What happened? Why Is there a space beast flying over here, and the Phoenix race is welcoming it?”<br/><br/>“What level is this space beast? It’s so terrifying. Its power is even more terrifying than the 21 legions that believed in the universe back then! ! ”<br/><br/>Within the Space City, the other elite disciples of the high-level races also revealed shocked expressions when they saw this scene.<br/><br/>The experts of the high-level races were no longer weak!<br/><br/>They now had a better understanding of the experts at the ruler realm!<br/><br/>The power of the four space beasts flying over was even more terrifying than the power of the 21 legions, the 20 million gods, and the believers of the universe!<br/><br/>They weren’t even on the same level!<br/><br/>This shocked them!<br/><br/>Then, all the disciples saw the experts of the Phoenix race talking to the four space beasts and then taking them away!<br/><br/>“What? What’s going on? are the four space beasts working with the Phoenix<br/><br/>Race?”<br/><br/>“Hiss, no way! How could such a terrifying space beast know the Phoenix<br/><br/>Race? Doesn’t that mean the Phoenix race also has terrifying power?”<br/><br/>“These four space beasts are definitely at the seventh level of the ruler realm. They are comparable to our peak ruler realm experts. If the Phoenix clan has such experts, then the Dragon King of the Dragon Palace wouldn’t be able to do anything to them! ”<br/><br/>“Not only do they have any methods, even the Dragon King of the Dragon Palace might not be a match for the Phoenix clan. As expected of a peak race, they actually have such a terrifying trump card! ”<br/><br/>All the powerful disciples in the starry city discussed.<br/><br/>Everyone thought that the Phoenix race would suffer the Crazy Revenge of the Dragon Palace!<br/><br/>They would probably have to pay a terrible price!<br/><br/>However, they didn’t expect the Phoenix race to call four extremely terrifying space beasts!<br/><br/>With such power, even if the Dragon King of the Dragon Palace and the others had reached the peak of the ruler realm, the Phoenix race could still contend against them!<br/><br/>This made all the strong disciples sigh at the powerful trump cards and strength of the peak race once again!<br/><br/>This would also cause the future war between the Phoenix clan and the Dragon Palace to undergo a huge change once again!<br/><br/>This news spread rapidly within the communication stone plate.<br/><br/>One hundred years passed by quickly once again!<br/><br/>There was still no movement from the Dragon Palace.<br/><br/>At the same time, at the location of the Thunderbolt treasure, Wang Xian looked at the energy within the Starfield fragment and smiled.<br/><br/>After 200 years of nurturing, with the help of the Five Elements Millstone and the Tai Chi Dragon Disc, the speed of nurturing was much faster than he had expected!<br/><br/>Furthermore, the power that he could control the starfield fragment was much stronger than he had expected!\t\t\t\t\t\t</div>", "images": {}, "success": true}