{"id": 909, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073718.html", "title": "Chapter 3911 - Chapter 3911: The Fragment Of Starfield 3910 Came Out And Suppressed The City", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3911 - Chapter 3911: The Fragment Of Starfield 3910 Came Out And Suppressed The City</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3911: The fragment of Starfield 3910 came out and suppressed the city<br/><br/>Translator: 549690339<br/><br/>The two peak ruler-level experts of the angel race and the Phoenix race suddenly entered the teleportation array. This was something the peak races hadn’t expected.<br/><br/>The teleportation array of the city was connected to this place.<br/><br/>However, the peak races also had a rule that forbade any ruler-level experts above rank 7 from entering the starry universe.<br/><br/>Because they were afraid of angering the powerful existences of the starry universe!<br/><br/>Especially the rulers of the peak level existences.<br/><br/>If such existences entered the starry city, if the terrifying existences in the starry universe thought that they were invading the starry universe, then the result wouldn’t be so simple!<br/><br/>It was possible that the entire starry city would be destroyed.<br/><br/>Even the disciples of the experts of the entire 9 -origin universe would be in danger.<br/><br/>Even if the possibility was very small!<br/><br/>Now that the two peak rulers of the Phoenix clan and the Angel clan had stepped in, the terrifying auras of the experts of the peak races locked onto the other experts of the Angel clan and the Phoenix clan.<br/><br/>“Angel clan, Phoenix Clan, you’ve crossed the line. If the space behemoth is in danger, your two great clans won’t be able to withstand it! ”<br/><br/>A demon race warrior stared at the Phoenix race and the Angel Race Warriors.<br/><br/>Now, the peak races of the 9-origin universe had a large number of disciples in the starry universe, and each race had tens of thousands of rulers.<br/><br/>If the angel race and Phoenix race angered the terrifying beings in the starry universe, then they would suffer heavy losses!<br/><br/>This loss was even irreparable!<br/><br/>Therefore, the demon race’s experts did not conceal their imposing manner at all, coldly staring at the Phoenix race and the Angel Race’s experts.<br/><br/>The other peak race’s experts were the same!<br/><br/>“Hehe, everyone, don’t worry. The Starry Sky City is at the very periphery. In addition, we only sent two peak experts. Our race’s experts also know the severity of the matter, so don’t worry. If there’s a problem, our angel race and the Phoenix race will bear it! ”<br/><br/>Seeing the displeased expressions of the peak-level powerhouses, the King of Light’s aura locked onto them. He squeezed out a smile and said!<br/><br/>“We will bear the consequences. We can not let the powerhouses of our<br/><br/>Phoenix race be killed! ”<br/><br/>The King of Fire Phoenix also said!<br/><br/>“If the starry city, if the powerhouses and disciples of our race are attacked because of you, then your Phoenix race and the angel race should be prepared to pay the price! ”<br/><br/>One of the elf race’s experts warned coldly!<br/><br/>The other peak races also had the same attitude!<br/><br/>The angel race and the Phoenix race couldn’t just watch as their disciples were killed.<br/><br/>That was why they had sent two peak ruler-level experts over.<br/><br/>The peak ruler-level experts didn’t dare to rush over. Once they did, the Phoenix race and the angel race would pay the price.<br/><br/>The other peak races would definitely make the Phoenix and Angel clans pay the price!<br/><br/>The group of peak rulers also understood that the angel and Phoenix clans could not just watch as their disciples were killed.<br/><br/>It was understandable!<br/><br/>However, if something really happened in the vast starry city, if something happened to their disciples, the angel and Phoenix clans would have to pay a terrible price!<br/><br/>Both sides understood each other!<br/><br/>Now, those who went in would go in. The Phoenix race and the angel race would bear the consequences.<br/><br/>“Of course, we will bear the consequences!”<br/><br/>The experts of the Phoenix race and the angel race could only nod in agreement.<br/><br/>After all, the two peak races didn’t dare to be enemies with the other ten peak races.<br/><br/>The other ten would be able to easily destroy the two of them.<br/><br/>The experts of the supreme races looked forward once more, frowning slightly.<br/><br/>The Phoenix race and the Angel race had lost two supreme ruler existences.<br/><br/>They didn’t know if these two supreme rulers would participate in the battle!<br/><br/>However, the possibility of them participating wasn’t very high.<br/><br/>This was because the angel race and the Phoenix race were also worried about attracting the terrifying existence of the infinite starry sky.<br/><br/>They couldn’t bear the consequences!<br/><br/>There was a high possibility that they would go over to protect their own powerful disciples and prevent them from being killed.<br/><br/>The possibility of the two of them wanting to kill the Dragon King and destroy the Dragon King wasn ‘t very high!<br/><br/>“All the powerful disciples of the Angel Race and the Phoenix race, Retreat.<br/><br/>Immediately retreat into the vast starry sky city. Immediately retreat! ”<br/><br/>At the same time, the powerful disciples of the Angel clan and the Phoenix clan in front of the starry city saw the invincible power of the Dragon King and were shocked.<br/><br/>They roared and gave the order to escape without any hesitation.<br/><br/>They were not on the same level at all.<br/><br/>The Dragon King of the Dragon Palace was too powerful!<br/><br/>If they didn’t escape, all of their powerful disciples would be killed by the Dragon King of the Dragon Palace!<br/><br/>They were already undefeatable!<br/><br/>The powerful disciples of the two peak races didn’t hesitate at all. They quickly fled towards the giant starry city.<br/><br/>“Hehe! ”<br/><br/>Wang Xian looked at the two powerful disciples of the two peak races who were fleeing. A hint of coldness appeared on his face!<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>At this moment, a dragon’s roar was heard from the front of the Starry City!<br/><br/>It was a dragon of darkness and a divine dragon of light.<br/><br/>Two roars were heard. Following that, the two divine dragons coiled together and formed a Taiji diagram!<br/><br/>This diagram completely sealed off the escape routes of all the powerhouses from the Phoenix and Angel clans!<br/><br/>“Break! ”<br/><br/>The leader of the level 7 ruler realm experts saw the tai chi dragon disc blocking in front of them and shouted out in a stern voice!<br/><br/>“Boom Boom Boom! ”<br/><br/>“Boom Boom Boom Boom! ”<br/><br/>They didn’t hesitate at all as streams of energy attacked the Tai Chi Dragon Disc.<br/><br/>However, among them, the strongest attack was only at the level 8 ruler realm. This was an attack that was launched with the help of treasures.<br/><br/>How could it break through the Taiji Dragon Plate’s defense.<br/><br/>When their attacks landed on the Taiji Dragon Plate, only some ripples appeared!<br/><br/>Then, a wave of backlash energy surged toward their bodies!<br/><br/>“Ahhhhh!”<br/><br/>In the next second, screams of pain came from the mouths of all the experts of the angel and Phoenix clans who were attacking!<br/><br/>Many extremely serious wounds appeared on their bodies.<br/><br/>There were even a few experts who were attacking with all their strength who died under this terrifying and strange backlash!<br/><br/>“Not good, this strange thing can reflect our attacks! ”<br/><br/>A ruler of the seventh rank, a Dark Angel, roared with a savage expression.<br/><br/>Not only were they unable to break through this terrifying defense, they would even suffer a powerful backlash.<br/><br/>How are they going to break through this?<br/><br/>If they can’t break through the terrifying weapons blocking them in front of them, then they will be met with death!\t\t\t\t\t\t</div>", "images": {}, "success": true}