{"id": 906, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073712.html", "title": "Chapter 3908 - Chapter 3908: 3907 Dragon Palace Vs Phoenix Clan, Angel Clan", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3908 - Chapter 3908: 3907 Dragon Palace Vs Phoenix Clan, Angel Clan</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3908: 3907 Dragon Palace vs Phoenix clan, Angel clan<br/><br/>Translator: 549690339<br/><br/>Today, the Dragon Palace will be destroyed, and the Dragon King will die!<br/><br/>These words and a voice rang out on the city wall!<br/><br/>When everyone looked over, they saw a peak race.<br/><br/>At the same time, more than 20,000 figures flew forward!<br/><br/>They had 12 wings, and their bodies emitted light and dark energy!<br/><br/>The Angel clan!<br/><br/>“It’s the Angel clan. The Angel clan also wants to deal with the Dragon Palace!<br/><br/>“It’s the Angel clan. It seems that they have joined forces with the Phoenix clan. It seems that they want to completely destroy the Dragon Palace and the Dragon King this time!<br/><br/>All the powerful disciples were surprised and expected to see the Angel clan flying out!<br/><br/>“I’ve Made Your Dragon Palace jump for so long. It’s time to send you on your way!<br/><br/>More than 20,000 ruler-level angels flew out. The leading Angel of light said indifferently, “This time, you won’t be able to escape!<br/><br/>“With just you?”<br/><br/>Lan Qingyue looked at the Angel clan and said coldly!<br/><br/>“Haha, isn’t it enough for the ancient god to feed the Kun Lord? If it’s not enough, let’s have some more!<br/><br/>Hearing her words, the leading angel of light laughed loudly and waved her arm.<br/><br/>“Weng Weng Weng!<br/><br/>A large array of light rose behind them, and within the array, two enormous figures slowly materialized!<br/><br/>“Roar Roar Roar!<br/><br/>“Roar Roar Roar Roar!<br/><br/>Two figures appeared, and they roared toward the sky at the same time. A savage aura swept out in all directions.<br/><br/>It was another two level seven ruler-level space beasts!<br/><br/>“Oh my God, another two level seven ruler-level space beasts? Another two.<br/><br/>Are they so worthless now?”<br/><br/>“Level seven ruler-level space beasts. Such existences are top-notch experts in our nine-origin universe. Now, the Angel Race has two?”<br/><br/>“How can the Dragon Palace fight against eight level 7 Space Beasts?”<br/><br/>“Is this the trump card of the Phoenix clan and the Angel Clan? If they were to fight against the Army of the belief universe, they would all be killed!<br/><br/>“It’s so terrifying. It seems that the Dragon Palace is no match for them at all!<br/><br/>“Damn, the gap is almost double. The Dragon Palace is doomed. I wonder if they can escape!<br/><br/>“From the looks of it, their combat power is on a completely different level.<br/><br/>Does the Dragon Palace still have any trump cards?”<br/><br/>“I don’t think so. The Dragon Palace is already very powerful, but the Phoenix clan and the Angel clan are even more powerful!<br/><br/>On the Angel clan’s side, there were two more level seven cosmic beasts. This surprised all the strong disciples in the nine-origin universe.<br/><br/>They looked at the strength of both parties and shook their heads slightly.<br/><br/>The Dragon Palace was already very strong!<br/><br/>However, it was a pity!<br/><br/>“The strength of your Phoenix clan and Angel clan is really beyond my expectations!”<br/><br/>When Wang Xian saw the eight level seven cosmic beasts, a hint of surprise appeared on his face.<br/><br/>He didn’t expect the Phoenix and Angel Race to be so strong.<br/><br/>If they were to fight, Wang Xian wouldn’t be able to do anything to them in a short period of time!<br/><br/>“Hehe, Dragon King, let’s end this once and for all!<br/><br/>A water phoenix from the Phoenix race said with a face full of killing intent!<br/><br/>At the side, the Angel of Light, who was the leader of the Angel tribe, waved his arm. Two space beasts instantly arrived behind Wang Xian and the rest.<br/><br/>They blocked the path behind them!<br/><br/>Both parties were not too far away from each other. Therefore, the two space beasts, who were at level seven, easily blocked the path!<br/><br/>Meanwhile, the four experts from the Green Sakura Space Beast tribe immediately flew to the left side of the Dragon Palace and blocked the left side of the path as well.<br/><br/>Apart from the top and bottom, all the other directions were blocked!<br/><br/>“Hehe, let’s completely destroy this eyesore this time.”<br/><br/>“The Dragon Palace is improving at a very fast speed. They must have obtained powerful resources and treasured lands. Let’s see if we can find them after we destroy them.<br/><br/>“Indeed, the Dragon Palace is improving at a terrifying speed. However, it’s a pity that they have provoked the Phoenix tribe.<br/><br/>At the same time, at the location of the 9-origin universe passageway.., the experts of the Phoenix clan and the Angel clan gathered here!<br/><br/>An image appeared in front of them.<br/><br/>This was the scene in front of the Star City!<br/><br/>They could see it clearly from here.<br/><br/>At this moment, both the Radiant Angel King and the three Phoenix Kings were smiling.<br/><br/>In this battle, their experts ‘combat strength had already formed a crushing situation.<br/><br/>Next, it was the end of the Dragon Palace!<br/><br/>On the side, the great elves of the Elf clan slightly frowned.<br/><br/>In front of them, there were also images of the battlefield.<br/><br/>However, they couldn’t participate in such a big battle.<br/><br/>Although the Elf clan had a good relationship with the Dragon Palace, they wouldn’t participate in such a big battle, nor would they help the Dragon<br/><br/>Palace.<br/><br/>This was because once they joined the war, the situation would become serious.<br/><br/>It would not only be a war in the starry universe. The Flames of war would spread to the nine-origin universe.<br/><br/>“It might be difficult to end this!<br/><br/>Wang Xian looked at them and said faintly.<br/><br/>Although the strength of the Phoenix Tribe’s Angel tribe had exceeded his expectations, it was still within the scope of the battle!<br/><br/>He looked at the four cyan Sakura Galactic Beasts on the left.<br/><br/>“It’s best that you guys don’t get involved in the war between us and the Phoenix Tribe’s Angel Tribe!<br/><br/>Wang Xian stared at them and warned them!<br/><br/>“Your Dragon Palace shouldn’t have provoked the Phoenix tribe. You guys are courting death.<br/><br/>One of the Cyan Sakura Galactic Beasts opened its huge mouth and spoke!<br/><br/>“Is that so?”<br/><br/>Wang Xian stared at them. With a move of his palm, a token appeared in his hand. “I wonder if this will be of any use to you?”<br/><br/>Buzz<br/><br/>After he took it out, he injected a surge of energy into it. The entire token rose up and emitted a unique aura!<br/><br/>“Huh?”<br/><br/>The four Cyan Sakura Galactic Behemoths stared fixedly at the token when they saw it.<br/><br/>“It’s the Beast King Token!<br/><br/>The space beast growled in a low voice, he lowered his head slowly. “I’m sorry,<br/><br/>Dragon King. Our Space Beasts don’t know that you have the Beast King Token. We don’t know that you know our Lord Space Beast King. We won’t attack you or the Dragon Palace. The Phoenix Clan has given us a lot of resources and treasures, so we’re very sorry. We can’t help you either!<br/><br/>“It doesn’t matter. Just stay away from here!<br/><br/>Wang Xian smiled when he saw that they knew the beast king token.<br/><br/>It seemed that the beast king token given to him by this chaotic space beast was quite useful..\t\t\t\t\t\t</div>", "images": {}, "success": true}