{"id": 904, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073708.html", "title": "Chapter 3906 - Chapter 3906: 3905 Dragon Palace Vs Phoenix Clan And", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3906 - Chapter 3906: 3905 Dragon Palace Vs Phoenix Clan And</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3906: 3905 Dragon Palace vs Phoenix clan and<br/><br/>Angel Clan 1<br/><br/>Translator: 549690339<br/><br/>“Hehe, alright. We will have a good fight with them tomorrow.<br/><br/>Wang Xian said with a smile when he heard Prime Minister Gui’s report.<br/><br/>“Dragon King, according to our investigation, the Phoenix clan and the Angel clan have been getting closer recently. We have to be on guard against the Angel Clan!<br/><br/>Prime Minister Gui said!<br/><br/>“Yes, the Angel clan will participate this time.<br/><br/>Wang Xian nodded. As for the additional Angel clan, he didn’t care!<br/><br/>“The battle seems to be about to begin. I saw many experts from the Phoenix clan arriving. Where will they fight tomorrow?”<br/><br/>“The Dragon Palace and the Phoenix clan didn’t back down at all. I reckon there will be a big battle in front of the starry city.<br/><br/>“It should be. Neither side is backing down. The battle will be in front of the Star City. All the powerful disciples will be able to witness it.<br/><br/>“I’m really looking forward to the big battle tomorrow. This is the first time the dragon palace has challenged a top-tier race. I wonder how powerful the Dragon Palace is now!<br/><br/>“Tomorrow, the Phoenix clan will destroy the Dragon Palace!<br/><br/>At this moment, the number of powerful disciples in the starry city was much more than the last time the belief universe attacked.<br/><br/>The last time the belief universe army attacked, many powerful disciples were worried that the starry city wouldn’t be able to withstand it, so they didn ‘t come!<br/><br/>However, this time, the entire starry city was packed with creatures from all races.<br/><br/>All the powerful disciples were discussing this matter!<br/><br/>Even the powerful disciples from the peak races were discussing this battle.<br/><br/>A Day passed quickly.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The next day, a dragon’s roar resounded throughout the starry city. The dragon’s roar was filled with dignity and coldness!<br/><br/>“It’s Here!<br/><br/>All the powerful disciples in the Starry City felt their hearts tremble when they heard the dragon ‘s Roar!<br/><br/>They immediately looked toward the territory of the Dragon Palace! At this moment, they saw figures flying toward the outside of the starry city!<br/><br/>“It’s starting. The Dragon Palace has started. It seems that a big battle is going to break out in front of the starry city. I wonder if the Phoenix clan is also here to accept the battle!<br/><br/>“It’s definitely here. In the past two thousand years, the powerful disciples of the Phoenix Clan didn’t show any fear and responded in a domineering manner. They definitely have some trump cards. If they didn’t accept the battle in front of the starry city, it would be a bit embarrassing!<br/><br/>“Quick, quick, let’s go to the front of the starry city and take a look!<br/><br/>This dragon roar seemed to be a signal. The group of strong disciples who had been waiting here immediately looked towards the front of the city wall and outside.<br/><br/>With a glance, the number of strong disciples who came to watch the battle had reached tens of billions!<br/><br/>It was densely packed and endless!<br/><br/>At the same time, Wang Xian, Lan Qingyue, led a group of succubus dragon species and thousands of devouring dragons as they flew toward the outside.<br/><br/>He flew all the way to the front of the starry city.<br/><br/>Floating in the air, Wang Xian looked at the starry city calmly. His eyes were filled with coldness.<br/><br/>“CHIRP CHIRP CHIRP! ”<br/><br/>“CHIRP CHIRP CHIRP CHIRP! ”<br/><br/>At this moment, the chirping of the Phoenixes sounded.<br/><br/>The chirping was crisp and resonated throughout the sky!<br/><br/>Compared to Wang Xian, he had only sent out a few thousand disciples from the Dragon Palace.<br/><br/>The number of the Phoenixes was much, much higher!<br/><br/>More than 20,000 phoenixes flew out. Each of them had the aura of a ruler. They flapped their huge Phoenix Wings and exuded an invincible aura!<br/><br/>“Hehe, there aren’t many disciples from the Dragon Palace. We won’t be able to kill them all in a while. Looks like the rest of the disciples from the Dragon Palace have gone into hiding!<br/><br/>The group of experts from the Phoenix clan flew to the spot opposite Wang Xian and the rest. The leading group of Phoenixes, who were at the seventh level of the ruler realm, sized them up. Their eyes were filled with mockery and disdain!<br/><br/>They were 100% confident in today’s battle!<br/><br/>Buzz<br/><br/>Lan qingyue swept her gaze across them. With a wave of her arm, three extremely terrifying black holes appeared in the sky!<br/><br/>“Woo woo woo! ” “Woo woo woo woo! ”<br/><br/>“Woo woo woo woo woo! ”<br/><br/>From the black holes came a long and terrifying roar.<br/><br/>“I’ll give you 10 seconds to show your trump cards. Otherwise, all of you will die!<br/><br/>Lan qingyue stared at the experts of the Phoenix race and said with a cold expression!<br/><br/>“Ancient god Rearing Kun master, is this the legendary ancient god Rearing Kun master? It seems that ancient god Rearing Kun master is even more powerful than before!<br/><br/>Lan qingyue directly summoned little blue and the others. That terrifying black hole let out a terrifying roar.<br/><br/>It caused the experts of the Phoenix race in front of them to freeze!<br/><br/>Their pupils constricted slightly, and they were filled with fear.<br/><br/>The power within the black hole caused them to tremble!<br/><br/>“Hiss, the Dragon Palace has already revealed its trump card before the battle even started. The ancient god feeds Kun master, and the Dragon Queen of the Dragon Palace is about to summon kun. The energy within the black hole is terrifying, and it’s comparable to the power of peak ruler-level existences like us.”<br/><br/>“Three black holes. Could it be that the ancient god feeds Kun master and her Kun have both reached the seventh level ruler-level?”? “Without the suppression of the starry universe, they are comparable to peak ruler-level experts. Three existences comparable to peak ruler-level existences, this power is terrifying!<br/><br/>“The ancient god feeds Kun master has indeed broken through. No wonder the Dragon Palace’s Dragon King and the others are so afraid of the entire belief universe.<br/><br/>On the city walls of the starry city, all the peak experts of the peak races were shocked when they saw Lan qingyue summon kun. The Aura coming from the black hole made them tremble.<br/><br/>This power was comparable to a peak ruler.<br/><br/>“HMPH!”<br/><br/>The exDerts of the Phoenix race watched and snorted.<br/><br/>At this moment, the roars of the four cyan Sakura Galactic Beasts could be heard from the side.<br/><br/>The body of the gigantic beast appeared at the side.<br/><br/>The four Galactic Beasts who were at the seventh level of the Dominator realm flew over and looked in the direction of Wang Xian and the rest.<br/><br/>Their eyes landed on the black hole. Their eyes were filled with a cold expression!<br/><br/>At this moment, Xiao Lan, Xiao Bai, and the rest of them slowly emerged from the black hole!<br/><br/>Their enormous bodies looked to be about twice the size of the Cyan Sakura Galactic Behemoth.<br/><br/>They were emitting a grayish energy that was extremely heavy!<br/><br/>Xiao Lan came directly to the spot below Wang Xian and the rest, causing them to step on her body!<br/><br/>Both parties began to confront each other from afar!<br/><br/>“From the looks of it, the strength of both parties is on par. The ancient god of the Dragon Palace feeds the Kun master and the three Kun beasts.. They are enough to fight against the four level seven cosmic beasts of the Phoenix clan!\t\t\t\t\t\t</div>", "images": {}, "success": true}