{"id": 902, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073704.html", "title": "Chapter 3904 - Chapter 3904: 3903’S Revenge Began", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3904 - Chapter 3904: 3903’S Revenge Began</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3904: 3903’s revenge began<br/><br/>Translator: 549690339<br/><br/>“Dragon King, I think the Phoenix Clan may not only rely on the four level seven space beasts. During this period of time, I have sent people to investigate the situation of the Phoenix clan. Although I haven’t found any specific information, I found that they have carried out some operations with the four level seven space beasts.”<br/><br/>“We don’t know the specific actions. However, I have a guess. They might have used the powers of these four Space Beasts to accomplish certain things. Either they obtained some treasures or used these four space beasts to tame some powerful space beasts.<br/><br/>“Otherwise, the Phoenix clan wouldn ‘t dare to be so arrogant.<br/><br/>Prime Minister GUI reported to Wang Xian.<br/><br/>When Wang Xian heard Prime Minister Gui’s words, he raised his eyebrows slightly.<br/><br/>It was not impossible to tame other powerful space beasts with the help of four space beasts at the seventh level.<br/><br/>In fact, from the very beginning, the top races and powerhouses in the nine-origin universe had been taming all kinds of space beasts.<br/><br/>This was because the space beasts were not suppressed by the universe here. If they were nurtured with resources, they would be able to play a greater role.<br/><br/>Therefore, it was possible for the Phoenix clan to use the four space beasts to tame other space beasts that were at level seven.<br/><br/>“In this case, the strength of the Phoenix clan is not as simple as I thought!<br/><br/>Wang Xian squinted his eyes and said.<br/><br/>“I think that if they are really taming other space beasts, they can only tame two to three space beasts that are at the seventh level within 10,000 to 20,000 years. After all, taming a space beast of this level requires a huge amount of resources and a huge price!<br/><br/>Prime Minister Gui said!<br/><br/>Wang Xian nodded his head. He was a little surprised by this news.<br/><br/>A peak race was a peak race!<br/><br/>“Qingyue, how much longer will it take for the little house and Xiao Bai to improve?”<br/><br/>Wang Xian looked at Lan Qingyue and asked.<br/><br/>“Around two thousand years!<br/><br/>Lan Qingyue replied!<br/><br/>He wasn’t sure how strong Wang Xian was now. However, he said that it shouldn’t be a problem for him to fight against five to six level seven space beasts!<br/><br/>With his full strength, he should be able to kill three level seven sovereign realm space beasts!<br/><br/>If the Phoenix tribe had really tamed a level seven sovereign realm space beast.<br/><br/>Coupled with the four level seven sovereign realm space beasts, Wang Xian might not be able to kill them all by himself.<br/><br/>However, it would be different if Xiao Zhai and Xiao Bai had improved!<br/><br/>With Xiao Zhai and Xiao Bai’s strength, together with Lan Qingyue and Xiao Lan, they would be able to fight against ten level 7 cosmic beasts.<br/><br/>Even if there were eight or nine level 7 cosmic beasts, they would be able to grind them to death with a large amount of time!<br/><br/>Sure. In two thousand years, we will attack the Phoenix clan. Also, Prime Minister Gui, how many level 7 masters are there in the Dragon Palace Now?” Wang Xian continued to ask Prime Minister Gui!<br/><br/>“In the Dragon Palace, with those beliefs, the number of level seven masters among the succubus dragon species has reached 170!<br/><br/>Prime Minister Gui said with a smile, “For those masters who are at level seven, the strength of our Dragon Palace far exceeds that of the other peak races!<br/><br/>The succubus dragon seed had been greatly improved in a treasure land.<br/><br/>Together with the faith of the gods, the succubus dragon seed had been greatly improved.<br/><br/>The succubus dragon seed was now the strongest in the Dragon Palace.<br/><br/>One hundred and seventy masters of the Level 7 realm, which was more than the other peak races!<br/><br/>At least more than the level 7 masters of the peak races in the universe!<br/><br/>Sure. Get the disciples of the Dragon Palace to prepare. In two thousand years, we will launch a general attack on the Phoenix race. We will not let any of the powerful disciples of the Phoenix race off!<br/><br/>Wang Xian’s eyes flashed with a cold glint as he spoke.<br/><br/>“It’s the Dragon King!<br/><br/>Prime Minister Gui nodded his head. After a moment of hesitation, he continued, “Dragon King, currently in the starry city, we have already opened up the teleportation formation from the nine-origin universe passage to here. From there, we can immediately teleport to the starry city!<br/><br/>“Long-distance teleportation? It’s very fast. Don’t worry about it.<br/><br/>Wang Xian shook his head.<br/><br/>Wang Xian and the rest were very familiar with the strength and defense of the entire starry city!<br/><br/>However, with the current defense of the starry city, it could withstand the attacks of two level seven Cosmic Beasts!<br/><br/>This defense was nothing to Wang Xian.<br/><br/>He could destroy the entire giant starry city!<br/><br/>If the Dragon Palace really launched an attack, Wang Xian would seal off the entire giant starry city!<br/><br/>“Before any war, we have to inform them. If the Phoenix clan is willing to provide sufficient compensation, we will forget about this matter. If they don ‘t agree, we will fight!<br/><br/>Wang Xian squinted his eyes and said.<br/><br/>After he finished speaking, he took out the communication stone plate and posted a message in his own name!<br/><br/>Dragon King of the Dragon Palace: in two thousand years, if the Phoenix clan is unable to give us a satisfactory answer, I will make all the powerful disciples of the Phoenix clan in the starry universe bleed like a river. Not a single one will be spared!<br/><br/>An ordinary message was uploaded to the communication stone plate!<br/><br/>Then, Wang Xian turned off the communication stone plate and revealed a smile!<br/><br/>Next, it was time to play with the Phoenix clan!<br/><br/>Wang Xian didn’t care how many trump cards the Phoenix clan had or how strong they were. This time, as long as they didn’t give a satisfactory answer, Wang Xian would play with them to the end!<br/><br/>He wanted to see who couldn’t afford to play at the last moment!<br/><br/>If the Phoenix clan didn’t have any other powerful existences, they wouldn ‘t have any more powerful trump cards!<br/><br/>Then, Pm sorry, all the experts and disciples of the Phoenix clan would be killed!<br/><br/>Even in this vast starry city!<br/><br/>At the same time, when the news of Wang Xian was released, it quickly caused a huge wave in the entire communication stone plate and the entire vast starry city!<br/><br/>“It’s here, it’s here, it’s really here. The Dragon King of the Dragon Palace is about to take his revenge. This is the Dragon King of the Dragon Palace that<br/><br/>Pve met before. This is the Dragon King that I will repay tenfold for provoking<br/><br/>“I knew it. I knew that the Dragon Palace wouldn’t let this go. The Dragon King wouldn’t let this go either. Ever since the development of the Dragon Palace and the rise of the Dragon King, the Dragon King of the Dragon Palace has never bowed his head. Hahaha, the Dragon King is awesome and supports the Dragon King!<br/><br/>“The Dragon King is going to take revenge. Hiss, what a strong declaration and overbearing warning.. Without a satisfactory answer, he is going to slaughter all the experts and disciples of the Phoenix Clan? Is this the Dragon King of the Dragon Palace?”\t\t\t\t\t\t</div>", "images": {}, "success": true}