{"id": 901, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073702.html", "title": "Chapter 3903 - Chapter 3903: 3,902 Seconds To Kill The Crystal Beast", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3903 - Chapter 3903: 3,902 Seconds To Kill The Crystal Beast</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3903: 3,902 seconds to kill the Crystal Beast<br/><br/>Translator: 549690339<br/><br/>Buzz<br/><br/>The Dragon Claw grabbed the energy crystal and flew directly towards Wang Xian.<br/><br/>Looking at the energy crystal that was flying towards him, he scanned his surroundings with a vigilant look in his eyes.<br/><br/>Wang Xian had no idea how many energy crystals there were in this area.<br/><br/>Therefore, even though his strength had increased tremendously, he still had to be careful!<br/><br/>Just as the energy crystal was about to reach Wang Xian, a roar filled with killing intent was heard!<br/><br/>Not far from him, a crystal behemoth flew out from an ordinary crystal and attacked Wang Xian and the rest.<br/><br/>“It’s Out!<br/><br/>Wang Xian’s eyes sparkled when he saw the crystal behemoth.<br/><br/>“It doesn ‘t seem to be the one I encountered last time.<br/><br/>Lan Qingyue’s eyes sparkled when she saw it.<br/><br/>Wang Xian nodded his head slightly. This crystal behemoth was not as strong as the previous one.<br/><br/>This one’s strength was also comparable to an expert at the peak of the<br/><br/>Dominator realm. However, it was slightly weaker than the previous one.<br/><br/>Flaming Meteor!<br/><br/>Wang Xian moved his palm without any hesitation. With a wave of his arm, a flaming meteor flew out from his palm and attacked the crystal behemoth directly.<br/><br/>Boom<br/><br/>The Flaming Meteor appeared and landed on the body of the Crystal Beast in an instant. Its terrifying speed was as though it was teleporting!<br/><br/>Bang! Bang! Bang<br/><br/>Awooooo!<br/><br/>A miserable shriek rang out instantly. The body of the crystal beast slowly cracked and collapsed.<br/><br/>Wang Xian smiled when he saw this scene!<br/><br/>This was the terrifying attack power of the galactic fragment.<br/><br/>Instant Kill!<br/><br/>A complete instant kill.<br/><br/>With a wave of his arm, the Crystal Behemoth’s broken body flew towards him.<br/><br/>Wang Xian sensed for a moment. There was an incomparably majestic energy contained within.<br/><br/>“Let’s kill another one. It should be enough to break through the small house!<br/><br/>He passed the energy crystal to Lan Qingyue and said with a smile.<br/><br/>“There might be more than one or two crystal behemoths in this area!<br/><br/>Lan qingyue took it over and sized it up before saying.<br/><br/>“Yes. Since that’s the case, let’s Hunt here!<br/><br/>Wang Xian nodded and continued to fly deeper into the area.<br/><br/>He traveled through this special territory again.<br/><br/>However, this time, it took him half a month to find more than ten energy crystals.<br/><br/>“There should be one nearby.<br/><br/>Wang Xian looked at the more than ten energy crystals in front of him and smiled.<br/><br/>Following the same pattern, he condensed his dragon claw again and grabbed at the energy crystal.<br/><br/>When the energy crystal was grabbed by Wang Xian again, the roar was heard again.<br/><br/>Wang Xian looked at the giant crystal beast that suddenly emerged from a crystal and narrowed his eyes slightly.<br/><br/>“This one seems to be the one we encountered back then.”<br/><br/>He mumbled as he sensed the power of this crystal behemoth!<br/><br/>Wang Xian opened his five fingers. A star floated on one of his fingers. With a flick of his finger, the five stars enlarged and attacked the crystal behemoth directly!<br/><br/>The moment the crystal behemoth flew out, it sensed the attack of the five stars and sensed the terrifying power on it. Its pupils constricted slightly.<br/><br/>It quickly stopped its body and flew towards an ordinary crystal.<br/><br/>The Talent of the Crystal Beast was that it could enter an ordinary crystal instantaneously. Furthermore, it could teleport within the crystal instantaneously.<br/><br/>It was similar to the transformation of the Netherworld Dragon. Every ordinary crystal was the medium for their transformation.<br/><br/>“You want to escape?”<br/><br/>Wang Xian smiled. His body trembled slightly and a grey star appeared above his head.<br/><br/>“Heavy Sky!<br/><br/>He growled.<br/><br/>“Bang Bang Bang!<br/><br/>The gray star emitted a stream of energy and swept across the surroundings.<br/><br/>At the same time, the surrounding crystals began to collapse rapidly.<br/><br/>The coverage area was extremely terrifying! Everything happened in an instant.<br/><br/>“Roar Roar Roar!<br/><br/>The crystal collapsed and the Giant Crystal Beast appeared in Wang Xian’s sight.<br/><br/>It let out a furious roar and attacked Wang Xian directly.<br/><br/>“You ‘re courting death!<br/><br/>Wang Xian moved his palm. The five stars that had not disappeared turned around and attacked the Crystal Beast again.<br/><br/>Boom! Boom! Boom<br/><br/>The violent collision sounded again. The Crystal Beast’s body collapsed rapidly!<br/><br/>It turned into pieces of energy crystals!<br/><br/>“Xiao Xian, your strength is really strong!<br/><br/>Lan Qingyue couldn’t help but exclaim.<br/><br/>This crystal beast should be the one that was chasing after Wang Xian and the eight pantheon gods.<br/><br/>When the eight pantheon gods borrowed the power of the star field fragment, they weren’t his match. Several of them were killed.<br/><br/>However, now that Wang Xian had completely absorbed the power of the star field fragment, he could easily kill it.<br/><br/>“It’s a heaven-grade treasure that’s too powerful!<br/><br/>Wang Xian said with a smile. With a wave of his arm, he collected the corpse of the Crystal Behemoth. “The upgrade of the house should be enough now!<br/><br/>“It’s enough!”<br/><br/>Lan qingyue nodded with a smile. “There are still quite a number of energy crystals left, which will allow Xiao Bai to improve a lot.”<br/><br/>“Then, let’s search here again and gather all the energy that Xiao Bai has improved !<br/><br/>Wang Xian said.<br/><br/>Lan qingyue naturally had no objections!<br/><br/>Following that, Wang Xian and the rest continued to search here.<br/><br/>In this area, the strongest crystal behemoth was only at the level of a dominator at level seven.<br/><br/>After all, this was only the ocean at the edge of the boundless starry sky. There were no strong existences here.<br/><br/>In the next few months, Wang Xian and the rest hunted two more crystal behemoths. One was at level six while the other was at level seven.<br/><br/>The corpses of these two crystal behemoths were sufficient for Xiao Bai to complete its breakthrough.<br/><br/>They searched for a few more months. They had almost explored the entire area. After failing to find anything, Wang Xian was ready to leave.<br/><br/>“Let’s go back!<br/><br/>Wang Xian said to Lan Qingyue.<br/><br/>Okay.<br/><br/>Lan qingyue nodded.<br/><br/>Wang Xian took out his communication stone plate and contacted Minister Gui and an lie.<br/><br/>A few seconds later, Wang Xian and Lan Qingyue appeared in a mansion!<br/><br/>This was the territory of the Dragon Palace in the starry city.<br/><br/>In the starry city, all the peak races had their own territory.<br/><br/>Although the territory was not big, it was enough for the powerhouses of the peak races to stay and rest!<br/><br/>“Greetings, Dragon King!<br/><br/>Prime Minister Gui was already waiting by the side when he saw Wang Xian. He greeted him respectfully.<br/><br/>“HMM, is there any news recently?”<br/><br/>Wang Xian asked Prime Minister Gui with a smile on his face!<br/><br/>“Dragon King, there’s no news for now. However, the Phoenix clan and the Angel clan are very arrogant in the communication stone plate. There are even experts from the Phoenix clan who have admitted in the communication stone plate that they killed more than a dozen of our disciples on purpose!<br/><br/>Prime Minister Gui opened his mouth and said!<br/><br/>“Hehe, in that case, the Phoenix clan thinks that they have four cosmic behemoths who are at the seventh level of the ruler realm. is that why they are not afraid of Us?”<br/><br/>Wang Xian smiled faintly and said..\t\t\t\t\t\t</div>", "images": {}, "success": true}