{"id": 907, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073714.html", "title": "Chapter 3909 - Chapter 3909: 3908 Dragon Palace Vs Phoenix Clan, Angel Clan 4", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3909 - Chapter 3909: 3908 Dragon Palace Vs Phoenix Clan, Angel Clan 4</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3909: 3908 Dragon Palace vs Phoenix clan, Angel Clan 4<br/><br/>Translator: 549690339<br/><br/>What was going on?<br/><br/>What was going on?<br/><br/>The Phoenix clan, Angel clan, and all the powerful disciples in the starry city saw that the Dragon King of the Dragon Palace actually took out a token and actually talked to the Cyan Sakura Star Beast.<br/><br/>In the end, those cyan Sakura Star Beasts actually wanted to leave?<br/><br/>This? They were going to leave just like that?<br/><br/>“What’s going on? What’s a Space Beast King Token?”<br/><br/>“An ally of the Phoenix clan, that Cyan Sakura Space Beast is actually going to leave? It actually didn’t attack the Dragon Palace, this is a bit ridiculous!<br/><br/>“Hiss, four space beasts leaving directly, that Phoenix clan and Angel clan’s peak battle strength are on par!<br/><br/>All the powerful disciples on the Star City watched this scene with their mouths<br/><br/>Agape.<br/><br/>No one had expected such a situation.<br/><br/>“We have an agreement about the four space beasts of qingying.<br/><br/>An expert of the Phoenix clan, who was at the seventh stage of the ruler realm, looked at the four space beasts. His face darkened and he said, “What do you mean by leaving now?”<br/><br/>“There’s nothing we can do. The Dragon King and the others have the King of Chaos’s Space Beast King Token. We have to obey!<br/><br/>One of the Green Sakura Space Beasts looked at them and said in a deep voice!<br/><br/>After he finished speaking, he flew straight into the void ahead without any hesitation.<br/><br/>The Space Beast King Token was an order that they could not refuse. Otherwise, what greeted them would be death.<br/><br/>They couldn’t refuse it!<br/><br/>Moreover, they were able to return to the universe because the kings had brought them here!<br/><br/>They couldn’t refuse the order!<br/><br/>All the disciples of the Phoenix clan looked very embarrassed when they saw it.<br/><br/>The experts of the Angel clan also kept changing their expressions.<br/><br/>They planned to destroy the Dragon Palace this time, and a part of them relied on the Green Sakura Space Beast clan.<br/><br/>The four level seven ruler-level space beasts, together with the space beasts they had tamed, were enough to destroy the Dragon Palace!<br/><br/>But now, the four Green Cherry Sky Beasts had left. The four level seven ruler-level space beasts of the Phoenix clan and the Angel clan were only able to fight against the ancient god Kun sovereign of the Dragon Palace!<br/><br/>In that case, the Phoenix clan and the Angel clan would have to fight against the Dragon Palace and the Dragon King!<br/><br/>“Hehe, the magnificent Phoenix clan and the Angel clan have joined hands to fight against our Dragon Palace. Now that your allies have left, isn’t this just right? Bring out your true strength and let’s Fight!<br/><br/>Wang Xian stared at all the strong disciples of the Phoenix clan and the Angel clan with a smile on his face. The corners of his mouth curled up slightly.<br/><br/>“Now, it’s a true battle of Strength!<br/><br/>“This is a fair battle. However, it will take a long time for the victor to be decided in this battle!<br/><br/>“Although there are many experts at the level seven of the ruler of the Dragon Palace, the Phoenix clan and the Angel clan have their own trump cards. Their trump cards are sufficient to fight against existences at the level eight and nine of the ruler. Therefore, it’s hard to say who will win!<br/><br/>“Yes, the battle now is more fair. The Phoenix clan and the Angel clan will join hands to fight against the Dragon Palace, without the participation of other races!<br/><br/>Everyone in the starry city watched this scene and said, their eyes shining.<br/><br/>The battle just now was still overwhelming, but now it was not!<br/><br/>“Hehe, even if there is no Qingying Space Beast clan, We Will Destroy Your Dragon Palace!<br/><br/>The experts of the Phoenix tribe and the Angel tribe looked at each other, gritted their teeth, and said with grim expressions!<br/><br/>On the surface, their trump cards were still much stronger than the Dragon palace!<br/><br/>Moreover, there was no way to avoid this battle. They had no choice but to fight!<br/><br/>Their eyes revealed a grim expression!<br/><br/>Fight!<br/><br/>They were still confident that they could win!<br/><br/>“All Disciples of the Phoenix Clan, get ready, Fight!<br/><br/>“All Disciples of the Angel clan, Get Ready, Fight!<br/><br/>The leader of the Phoenix clan and the Angel clan, A Level 7 ruler, roared and raised the connate true treasure in his hand!<br/><br/>Fight!<br/><br/>“Destroy the Dragon Palace, leave no one alive!<br/><br/>“Hahaha, destroy the Dragon Palace, leave no one alive! 40,000 to 50,000 masters of the universe roared loudly.<br/><br/>Their power soared to the sky!<br/><br/>“I’ll leave the four Space Beasts to you, qingyue!<br/><br/>Wang Xian swept his gaze across the angel race and the Phoenix race. When he heard their roars, a hint of disdain flashed across his eyes as he spoke to Lan Qingyue!<br/><br/>Alright!<br/><br/>Lan qingyue nodded. Her gaze swept across the four space beasts who were at the seventh level of the ruler realm!<br/><br/>Little Blue and the others roared and flew to the sky, pulling a long distance away!<br/><br/>Kill!<br/><br/>The experts of the Phoenix clan and the Angel clan also immediately ordered the four level 7 universe Dominators to attack little blue and the others!<br/><br/>“Dragon Palace, you have many level 7 universe Dominators, but our Phoenix clan and the Angel clan’s foundation is incomparable to yours. Today is the Day You Die!<br/><br/>A Level 7 universe master fire Phoenix’s eyes were filled with coldness.<br/><br/>He held a fire Phoenix statue.<br/><br/>“Phoenix Nirvana!<br/><br/>He roared, and the six level 7 universe masters poured their life force into it!<br/><br/>The entire fire Phoenix statue slowly became real.<br/><br/>“CHIRP CHIRP CHIRP! ”<br/><br/>The sound of a Phoenix was heard from the Fire Phoenix statue.<br/><br/>It was locked tightly, and terrifying flames engulfed the starry sky!<br/><br/>“HMPH, today, I will kill Your Dragon King. No one can stop me!<br/><br/>At the Angel clan, the leading Archangel waved his arm, and a feather floated in the air.<br/><br/>Slowly, the feather was aimed at Wang Xian’s position.<br/><br/>“Hehe, Disciples of the Dragon Palace, kill him!<br/><br/>When Wang Xian saw the angels and the Phoenix taking out some of their trump cards again, a cold look appeared in his eyes!<br/><br/>He waved his arm!<br/><br/>At the same time, the five elements grinding mill and the tai chi dragon plate in his body attacked the Phoenix and the angels!<br/><br/>A soul battleship and two soul spears appeared and attacked the Fire Phoenix statue!<br/><br/>The battle erupted!<br/><br/>“Fight, Kill!<br/><br/>The experts of the Phoenix clan and the Angel clan roared and charged forward!<br/><br/>“CHIRP CHIRP CHIRP! ”<br/><br/>The Resurrected Fire Phoenix in the sky let out another Phoenix cry. It stared at the soul spears and the soul battleship that were attacking it and let out a low roar!<br/><br/>It charged forward!<br/><br/>Its speed was much faster than the experts of the angel race and the Phoenix race!<br/><br/>“Boom! Boom! Boom!”<br/><br/>Flames shot out from the fire Phoenix’s mouth. These terrifying flames were enough to threaten a ruler of the ninth rank..\t\t\t\t\t\t</div>", "images": {}, "success": true}