{"id": 908, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073716.html", "title": "Chapter 3910 - Chapter 3910: 3909 Dragon Palace Vs Phoenix Clan, Angel Clan 5", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3910 - Chapter 3910: 3909 Dragon Palace Vs Phoenix Clan, Angel Clan 5</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3910: 3909 Dragon Palace vs Phoenix clan, Angel Clan 5<br/><br/>Translator: 549690339<br/><br/>“Sou Sou Soul”<br/><br/>The fire Phoenix that was comparable to a ruler at the 9th rank released terrifying flames as it attacked the two soul spears and the soul battleship!<br/><br/>However, a shocking scene occurred!<br/><br/>The terrifying flames were blocked by the soul battleship, while the other two soul spears continued to attack the Fire Phoenix at a terrifying speed!<br/><br/>No one noticed how terrifying the soul spears and the soul battleship were!<br/><br/>When the two soul spears flew over, the Fire Phoenix let out a low growl, and a pair of phoenix wings wrapped around its body!<br/><br/>However, the two soul spears still pierced through the fire Phoenix’s wings!<br/><br/>“CHIRP CHIRP! ”<br/><br/>He let out a hurried scream!<br/><br/>In the next second, the five elements on the flying millstone revolved and condensed into an ice hammer!<br/><br/>The Ice Hammer smashed heavily towards the Phoenix.<br/><br/>The Phoenix didn’t have time to react. The giant frost hammer smashed onto its body, causing it to tremble violently.<br/><br/>Slowly, it became illusory. “What?”<br/><br/>“How is this possible?”<br/><br/>At this moment, the experts of the Phoenix clan who were flying forward sensed that the fire phoenix in the sky had instantly collapsed and dissipated.<br/><br/>Their faces revealed a look of shock. ” …”<br/><br/>This was the trump card of their Phoenix clan. It was a powerful trump card that their Phoenix clan could use to fight against a ruler of the ninth level!<br/><br/>The Dragon Palace had more rulers of the seventh level. They relied on this trump card of theirs!<br/><br/>No matter how many level seven masters you had.<br/><br/>On the Phoenix clan’s side, one trump card could wipe out all the level seven masters of Your Dragon Palace.<br/><br/>However, this trump card of theirs was instantly killed!<br/><br/>This made the hearts of all the phoenixes tremble violently!<br/><br/>“Oh no, that spear, battle technique, and the Supreme Treasure of the Dragon<br/><br/>King of the Dragon Palace are all very terrifying. Be careful! ”<br/><br/>The experts of the angel race also noticed this scene, and their pupils constricted!<br/><br/>They knew the Phoenix Race’s trump card very well.<br/><br/>Now, they were instantly killed, and this made them a little scared!<br/><br/>“Kill the Dragon King First! ”<br/><br/>A rank 7 light angel roared, and with a wave of his arm, a wave of energy poured into the bright feather!<br/><br/>In the surroundings, a few other angels of light who were in the seventh level also roared and injected a surge of energy into the feather.<br/><br/>As the energy was injected into the feather, the entire feather burst out with a strong glow.<br/><br/>In the next second, he aimed at Wang Xian’s position and shot directly!<br/><br/>With a flash of light, he arrived in front of Wang Xian in an instant!<br/><br/>When this feather appeared, Wang Xian was on guard!<br/><br/>This feather was not simple. If he was not surprised, it should be the feather of the Heaven’s origin creature from the angel race!<br/><br/>With their support, this feather had the strength to kill a level nine overlord.<br/><br/>Unfortunately, this feather was still far from being able to deal with the current Wang Xian!<br/><br/>The Shadows of the planets around him appeared. When the feather shot at his head, it was directly blocked outside.<br/><br/>There was no energy fluctuation nor was there a strong collision force!<br/><br/>That feather was blocked by Wang Xian!<br/><br/>Wang Xian stretched out his hand. Streams of earthy yellow energy wrapped around his arm.<br/><br/>A tattoo of a planet appeared on the back of his hand.<br/><br/>This feather was held in Wang Xian’s hand and couldn’t move at all! “How is this possible? The Dragon King of the Dragon Palace isn’t simple either! ”<br/><br/>(‘D * mn it, this Dragon King of the Dragon Palace can also match the combat strength of a peak-level ruler! ”<br/><br/>“How can this Dragon King of the Dragon Palace be so strong? This is the feather of our God of light. How can he withstand it?”<br/><br/>The experts of the Angel clan were shocked when they saw this scene!<br/><br/>Compared to the Phoenix statue of the Phoenix clan.<br/><br/>Although the Angel clan didn’t have many trump cards, their attack power was very terrifying!<br/><br/>An Ordinary Level 9 ruler could kill them.<br/><br/>But they didn’t expect that the Dragon King of the Dragon Palace could resist it so easily!<br/><br/>How could the Dragon King be so strong?<br/><br/>The Dragon King had combat strength comparable to the peak of the ruler realm?<br/><br/>“Hiss, is this the strength of the Dragon King of the Dragon Palace?”<br/><br/>“The Dragon King’s strength is not as simple as I thought. Even if he can’t be comparable to the peak of the ruler realm, he is invincible at the ninth level of the ruler realm! ”<br/><br/>“This… The Phoenix clan and the Angel clan have completely underestimated the Dragon King. It is not only the ancient god Feeding Kun master, but also the Dragon King of the Dragon Palace who makes the universe tremble with<br/><br/>“Those two spears and that battleship are soul energy. We of the Dark clan can easily sense it. Two soul spears and a soul battleship can match the battle strength of a ruler at the ninth level. These are the weapons of the Dragon King of the Dragon Palace. The Dragon King is very terrifying! ”<br/><br/>On the starry city, the experts and disciples watching the battle were also filled with shock when they saw this scene!<br/><br/>They also didn’t expect the Dragon King’s strength to be so strong.<br/><br/>The great battle had just erupted, and he had directly eliminated the trump cards of the Angel Race and Phoenix race!<br/><br/>The strength he displayed was too abnormal!<br/><br/>Especially the underworld race experts, they had already sensed the terror of that spear and battleship!<br/><br/>This wasn’t even counting the terror of the five elements great mill!<br/><br/>The surrounding experts heard the underworld race experts’words and were somewhat dazed!<br/><br/>Just a few weapons were comparable to a few level 9 rulers!<br/><br/>The Dragon King was too terrifying!<br/><br/>“How is this possible?”<br/><br/>At the same time, a group of experts from the peak races were also watching the battle!<br/><br/>The light king of the Angel Race and the Three Kings of the Phoenix race saw this scene and their expressions changed!<br/><br/>The Dragon King of the Dragon Palace was actually so terrifying!<br/><br/>This was not something that the disciples of the two great clans could contend against!<br/><br/>Therefore, they could already predict what would happen next!<br/><br/>With the strength of the Dragon King of the Dragon Palace, he could easily destroy all the disciples of the two great clans!<br/><br/>The two great clans could not afford such a loss!<br/><br/>The experts of the other peak races were also shocked.<br/><br/>The Dragon Palace and the Dragon King were much more powerful than they nad Imagined!<br/><br/>Swoosh! Swoosh<br/><br/>At this moment, the two experts of the angel race and the Phoenix race looked at each other.<br/><br/>Their bodies moved and they immediately flew into the teleportation formation!<br/><br/>They entered the teleportation formation and instantly disappeared! In addition, there were also experts from the angel and Phoenix clans who wanted to enter.<br/><br/>The expressions of the other peak clans around them changed! “Phoenix clan, Angel clan, what are you all doing?”<br/><br/>A great elf from the Elf clan shouted with an icy cold expression.<br/><br/>The auras of the experts from the other peak clans also changed and directly locked onto them!<br/><br/>The two who entered were at the peak of the ruler realm!<br/><br/>The true peak of the ruler realm!\t\t\t\t\t\t</div>", "images": {}, "success": true}