{"id": 903, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073706.html", "title": "Chapter 3905 - Chapter 3905: 3904 Phoenix Clan, Prepare For Battle!", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3905 - Chapter 3905: 3904 Phoenix Clan, Prepare For Battle!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3905: 3904 Phoenix clan, prepare for battle!<br/><br/>Translator: 549690339<br/><br/>This piece of news from Wang Xian caused a huge sensation all of a sudden!<br/><br/>When all the powerful disciples in the nine-origin universe saw this piece of news, their faces were filled with shock.<br/><br/>The Revenge of the Dragon Palace was about to begin!<br/><br/>The Revenge of the Dragon King was also about to begin!<br/><br/>This made many powerful disciples not too surprised.<br/><br/>This was the Dragon King’s personality.<br/><br/>Ever since the establishment of the Dragon Palace, as long as there were people who targeted the Dragon Palace, the Dragon King would accompany them to the end!<br/><br/>This time was no exception!<br/><br/>Because Wang Xian and the rest had single-handedly resisted the entire army of the universe of belief, he had gained many admirers in the nine-origin universe.<br/><br/>“HMPH, you want to make our Phoenix clan bleed like a River?”<br/><br/>At the same time, in a piece of void space.<br/><br/>Seven space behemoths at level seven were suspended in the surrounding area.<br/><br/>The powerhouses of the Phoenix race and the angel race were at the back.<br/><br/>When the powerhouses of the Phoenix race received the news, their faces were filled with coldness.<br/><br/>“Hehe, two thousand years later, at that time, our angel race will be able to tame the space behemoth in front of us.”<br/><br/>An archangel from the angel race said with a smile.<br/><br/>“In that case, 2,000 years later, our two races will have an understanding with<br/><br/>the Dragon Palace, right?”<br/><br/>A Fire Phoenix at the seventh level ruler realm looked at them and said indifferently.<br/><br/>“Yes, our Phoenix race also has the same idea. This time, we will completely destroy the Dragon Palace. As long as we destroy all their disciples in the universe, we can easily destroy their nest in the nine-origin Universe!<br/><br/>The experts of the Angel clan nodded.<br/><br/>The hatred between them and the Dragon King of the Dragon Palace could no longer be resolved!<br/><br/>This time, it was time to end it.<br/><br/>Two thousand years later, with their strength, it wouldn ‘t be a big problem to destroy the Dragon Palace!<br/><br/>“Alright, we’ll completely destroy this dragon palace that has offended their superiors!<br/><br/>The Phoenixes said with killing intent on their faces!<br/><br/>“Two thousand years later, let’s end this once and for all!<br/><br/>A water phoenix from the Phoenix clan took out a communication stone plate and said with a faint smile.<br/><br/>As he spoke, he sent a reply in the name of the Phoenix clan’s experts!<br/><br/>“Two thousand years later, we’ll wait and See!)’<br/><br/>We’ll wait and see!<br/><br/>Who would destroy who! !<br/><br/>This message was sent out and soon caused a huge uproar in the communication stone plate!<br/><br/>After all, this was a direct response from the Phoenix clan!<br/><br/>It was also the attitude of the Phoenix clan.<br/><br/>Wait and see!<br/><br/>“This… The Phoenix clan actually accepted the challenge. If they really accepted the challenge, two thousand years later, it will definitely be a great<br/><br/>“It’s hard to say who will win or lose now. The Phoenix Clan has four allies who are at the seventh level of the ruler realm. Although the Dragon Palace doesn’t know their strength, but the Dragon King and the others are able to make the entire belief universe fear them. They must have terrifying strength!<br/><br/>Support the Dragon Palace, support the Dragon King, and kill the Phoenix clan. In the past, the Phoenix clan killed the Skyfire Patriarch in order to get the treasure. They are a peak race. It’s a bit despicable!<br/><br/>“From the looks of it, the Phoenix clan is not afraid of the Dragon Palace at all. They must have something powerful to rely on. I guess it will be a world-shaking battle!<br/><br/>“We should be able to find out the trump card of the Dragon Palace in this battle. I wonder how strong the Dragon King and the others are?”<br/><br/>All the powerful disciples in the 9-origin universe were discussing this matter!<br/><br/>This battle was inevitable!<br/><br/>The old and new grudges had caused the Phoenix clan and the Dragon Palace to sink into an irreconcilable state!<br/><br/>“Little Dragon Palace, this time the Phoenix clan will show you our strength!<br/><br/>“In 2,000 years, Your Dragon Palace will be destroyed!<br/><br/>In the communication stone plate, a large number of powerful disciples of the Phoenix clan were clamoring!<br/><br/>On the other side of the Dragon Palace, some disciples of the Dragon Palace also responded.<br/><br/>Especially the poisonous horned dragon species led by the eight-limbed demon fiend. They were never afraid of anyone!<br/><br/>With the announcement from the Dragon Palace and the Phoenix clan, the war that would happen two thousand years later became the focus of attention in the nine-origin universe.<br/><br/>When Wang Xian saw the Phoenix clan’s response, the corner of his mouth twitched slightly. He didn’t seem to care about it at all.<br/><br/>Two thousand years, two thousand years!<br/><br/>Time passed quickly. Two thousand years was just a snap of the fingers for a group of experts!<br/><br/>At the same time, at the location of the nine-origin universe’s passageway.<br/><br/>A group of experts from the Phoenix clan stood in the Void.<br/><br/>Water Phoenix, Fire Phoenix, Golden Phoenix, three kinds of Phoenix, and three kinds of Phoenix kings had all come here!<br/><br/>Apart from the three Phoenix Kings, there were also three elders of the Phoenix clan.<br/><br/>All of them were at least a ruler of level 8 and above.<br/><br/>There were also five or six peak rulers!<br/><br/>This wasn’t all the strength of the Phoenix clan, but to be able to gather here was already terrifying enough!<br/><br/>They hovered in the air and waited quietly.<br/><br/>The Radiant Angel King and the Archangels above Tier 8 had also gathered.<br/><br/>They were also waiting for news!<br/><br/>There were more experts from the other ten peak races around them than before!<br/><br/>All the experts were paying attention to the upcoming battle!<br/><br/>The Dragon Palace’s declaration of war and the Phoenix clan’s response.<br/><br/>This was going to be an unprecedented battle.<br/><br/>The Water Phoenix King looked at the Angel of light.<br/><br/>The two looked at each other and nodded silently.<br/><br/>They had reached an agreement!<br/><br/>There was a teleportation array in the center of the peak races.<br/><br/>This was a teleportation formation created by a group of peak races.<br/><br/>From this teleportation formation, one could instantly reach the huge city in the starry sky.<br/><br/>“Are You Ready?”<br/><br/>At the same time, in the huge city in the starry sky, Wang Xian looked at Prime Minister Gui and said!<br/><br/>“Dragon King, all the combat disciples are ready!<br/><br/>Prime Minister Gui nodded his head.<br/><br/>Two thousand years had passed. Xiao Bai, Xiao Zhai, and the rest had already achieved a breakthrough!<br/><br/>Wang Xian was not going to hide anything from them in this big battle!<br/><br/>One thousand succubus dragon species and devouring dragon species were participating!<br/><br/>Among the succubus dragon species, there were one hundred and seventy-three in the level seven realm, and about five hundred in the level six realm.<br/><br/>The rest were all in the level five realm.<br/><br/>Over the past tens of millions of years, the Devouring Dragon Ao crab and the others had improved greatly in the last treasure land.<br/><br/>Ao crab had broken through to the level 5 realm, but his strength was only comparable to those in the level 4 realm.<br/><br/>Now, more than 30 million years had passed, and there were over 100 devouring dragons that had reached the level 6 realm.<br/><br/>It was comparable to other peak races in the level 5 realm.<br/><br/>There were over a hundred level six overlords, but there were over a thousand level four overlords.<br/><br/>As for the rest of the powers, Wang Xian did not move!<br/><br/>The rest of the Dragon Palace disciples did not have high realms!<br/><br/>However, this was enough!\t\t\t\t\t\t</div>", "images": {}, "success": true}