{"id": 900, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073700.html", "title": "Chapter 3902 - Chapter 3902: 3,901 Seconds To Kill The Crystal Behemoth", "volume": 9, "volume_title": "Volume 9", "body": "<h1>Chapter 3902 - Chapter 3902: 3,901 Seconds To Kill The Crystal Behemoth</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3902: 3,901 seconds to kill the Crystal Behemoth<br/><br/>Translator: 549690339<br/><br/>“How Strong is my current strength?”<br/><br/>After successfully nurturing and refining the galactic fragment, it was equivalent to becoming one with Wang Xian.<br/><br/>Once the galactic fragment was taken away, he would also suffer great damage.<br/><br/>Now that he had successfully nurtured it, he could freely borrow the power of the galactic fragment.<br/><br/>He didn’t know how strong Wang Xian was now.<br/><br/>“Qingyue, attack me with Xiao Lan. I want to test my strength.<br/><br/>Wang Xian said to Lan Qingyue with a smile.<br/><br/>“HMM? Alright! ”<br/><br/>Lan qingyue nodded with a smile.<br/><br/>Before he had completely refined the starfield fragment, Wang Xian’s ability to borrow the power of the starfield fragment was comparable to the combination of her and Xiao Lan.<br/><br/>Now that he had completely refined it, it would definitely be even more terrifying!<br/><br/>Therefore, he wasn’t worried that he would be able to harm Wang Xian.<br/><br/>“Woo woo!”<br/><br/>Lan qingyue, Xiao Lan, and Wang Xian flew to the position outside with Wang Xian.<br/><br/>Lan qingyue condensed into a grayish long spear while Xiao Lan condensed into a grayish image of a Kun and attacked Wang Xian directly.<br/><br/>This was already close to their all-out Attack!<br/><br/>Wang Xian felt the attack and waved his arm.<br/><br/>The star field barrier!<br/><br/>A dazzling barrier appeared directly in front of Wang Xian. The barrier was huge. Not only did it block Wang Xian’s body, but it also blocked the starry sky.<br/><br/>Boom! Boom! Boom<br/><br/>Lan Qingyue and Xiao Lan’s attack landed on the star field barrier and produced a loud rumbling sound.<br/><br/>However, the star field barrier did not have the slightest fluctuation!<br/><br/>There wasn’t the slightest fluctuation at all.<br/><br/>When Wang Xian saw this scene, his eyes sparkled.<br/><br/>This defense was almost invincible among those of the same level!<br/><br/>“I should be able to withstand two to three such levels of strength.<br/><br/>Wang Xian calculated in his heart, and a satisfied expression appeared on his face.<br/><br/>This star field fragment was simply too much of an enhancement to him!<br/><br/>Be it in the starry universe or the nine-origin universe.<br/><br/>If Wang Xian were to return to the nine-origin universe now, he would be able to easily kill an existence at the peak of the ruler realm with the help of this starfield fragment.<br/><br/>Even if his strength had yet to improve, he could still rely on this starfield fragment to do so!<br/><br/>This was extremely terrifying!<br/><br/>Of course, there was also a possibility that this existence at the peak of the ruler realm did not have a treasure at the level of a starfield fragment.<br/><br/>As for whether the peak race had such a treasure, Wang Xian was not sure.<br/><br/>However, there was an 80% chance that they had a treasure of this level.<br/><br/>After all, the peak race might not have a treasure of the Heaven’s origin creation level. However, it was still possible to obtain a treasure of this level.<br/><br/>“Xiao Xian, how is it?”<br/><br/>Lan Qingyue flew over and asked with a smile on her face.<br/><br/>“If it’s just a defense, it can at least withstand five to six full-force attacks of the same level!<br/><br/>Wang Xian said with a smile, “However, speaking of which, this starfield fragment is considered a heaven’s origin creation treasure that favors attack. The attack of the starfield fragment is even more terrifying.<br/><br/>“In that case, if we return to the nine-origin universe, as long as Xiao Xian absorbs all the resources, wouldn’t your strength be much stronger than the peak of the ruler realm?”<br/><br/>Lan Qingyue’s eyes sparkled as she spoke.<br/><br/>Wang Xian nodded his head.<br/><br/>Currently, he still had a lot of resources in his hands. These resources could increase his strength by two levels. In other words, he could rival an existence at the ninth level of the Dominator realm.<br/><br/>When the time came, he would be able to open up more energy from the starfield fragments. An existence at the peak of the Dominator realm could be easily destroyed as long as he didn’t have any powerful treasures.<br/><br/>As for how powerful they would be at that time, it was unknown!<br/><br/>Heavenly Yuan creation level treasures were too terrifying!<br/><br/>Just like the ancestral tree, it hadn ‘t fully matured yet, yet it was able to display such terrifying energy.<br/><br/>This was something that many peak races couldn ‘t imagine.<br/><br/>Heavenly Yuan creation level treasures, to a certain extent, were even rarer than heavenly yuan creation level experts!<br/><br/>Even the fragments were abnormally terrifying.<br/><br/>“Let’s go. Let’s Get Rid of the Crystal Beast First and destroy it. Then, we will return to the nine origin universe passage. Wang Xian continued to speak to Lan Qingyue.<br/><br/>Alright!<br/><br/>Lan qingyue nodded her head.<br/><br/>Wang Xian waved his arm and a meteor appeared under his feet. It led them to fly in a certain direction at a terrifying speed!<br/><br/>This speed was much faster than before.<br/><br/>A few days later, Wang Xian arrived at the sea area where he was trapped again!<br/><br/>He had been trapped here for more than 30 million years. He had a clear understanding of everything here!<br/><br/>He flew straight towards the crystal domain of the target.<br/><br/>“It’s just ahead!<br/><br/>After flying for another half an hour, Wang Xian looked at the crystals in front of him. His eyes were sparkling.<br/><br/>He had completely restrained the power of the Starfield fragment.<br/><br/>After he restrained it, his aura and aura had also decreased by a lot.<br/><br/>It was completely the aura of a master at level seven.<br/><br/>This aura was already very weak in this region!<br/><br/>Lan qingyue also restrained her aura while Xiao Lan waited outside for the time being.<br/><br/>They flew in.<br/><br/>“This way!<br/><br/>Wang Xian ‘s gaze swept across the ordinary crystals in the surroundings. He checked the direction and flew towards the place in his memory.<br/><br/>Last time, Wang Xian lured the eight gods over. The eight gods were easily defeated by the crystal behemoth.<br/><br/>However, although the crystal behemoth was very strong, it was only slightly stronger than a level seven cosmic beast.<br/><br/>It was difficult to deal with two level seven cosmic beasts.<br/><br/>When he arrived at a place with more than 50 energy crystals, he realized that the energy crystals had disappeared.<br/><br/>“The last time, the energy crystal was kept by one of the gods. After the crystal behemoth killed the level seven cosmic beast, it should have changed the location of the energy crystal or absorbed it!<br/><br/>Wang Xian said to Lan qingyue, “Let’s go and investigate somewhere else!” Lan qingyue nodded her head.<br/><br/>Now that there was a fragment of the Starfield, Wang Xian was no longer as cautious as last time. Instead, he flew deeper into the Starfield.<br/><br/>Back then, he didn ‘t dare to step into the Starfield!<br/><br/>As they flew deeper into the Starfield, they were vigilant of their surroundings.<br/><br/>“There’s the aura of the energy crystal over there!<br/><br/>After flying for two days, Lan Qingyue sensed something and pointed in a direction!<br/><br/>“Let’s go. This should be the domain of the Crystal Behemoth. If we touch the energy crystal here, we will definitely be attacked by the Crystal Behemoth!<br/><br/>Wang Xian spoke and immediately flew in the direction that Lan Qingyue pointed out.<br/><br/>Soon, three crystals containing a huge amount of energy appeared in his line of sight.<br/><br/>Wang Xian’s eyes sparkled when he saw the energy crystal.<br/><br/>He had only flown for two days before he came across the energy crystal. This was obviously a treasure land.<br/><br/>Clearly, there was a powerful presence guarding this place.<br/><br/>Wang Xian swept his gaze across the surroundings.. With a wave of his arm, he grabbed the energy crystal with his Dragon Claw!\t\t\t\t\t\t</div>", "images": {}, "success": true}