{"id": 917, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073734.html", "title": "Chapter 3919 - Chapter 3919: Under The Rage And Helplessness Of The Two Peak Races, 3918", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3919 - Chapter 3919: Under The Rage And Helplessness Of The Two Peak Races, 3918</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3919: Under the rage and helplessness of the two peak races, 3918<br/><br/>Translator: 549690339<br/><br/>“HMM? The scene at the starry city has appeared! ”<br/><br/>Everything returned to clarity.<br/><br/>After Wang Xian left, the sky of the starry city was restored once again!<br/><br/>The fragments of the Galaxy had left.<br/><br/>At the same time, the location of the nine-origin universe passage was in front of the peak races. The scene in front of them had returned.<br/><br/>“This… This Is?”<br/><br/>However, when they saw what was happening inside, they were all shocked.<br/><br/>Even though they were all peak experts of peak races, they were still shocked when they saw this scene!<br/><br/>In the scene, the disciples of the Dragon Palace were taking care of the disciples of the Angels and Phoenixes!<br/><br/>There weren’t any disciples of the Phoenix race or the angel race in the Starry City!<br/><br/>“Buzz Buzz Buzz! ”<br/><br/>“Buzz Buzz Buzz! ”<br/><br/>“Buzz Buzz Buzz! ”<br/><br/>At this moment, a group of disciples from the peak races came over with news one by one.<br/><br/>When the experts from the peak races saw this news, they were shocked!<br/><br/>Two Peak Lords from the Phoenix and Angel clans had been killed by the Dragon King!<br/><br/>All the powerful disciples of the starry giant City were slaughtered by the Dragon Palace!<br/><br/>What? ? ?<br/><br/>The Dragon King had killed two peak-stage sovereign realm experts by himself.<br/><br/>They were shocked by his strength.<br/><br/>“Damn Dragon Palace, Damn Dragon King, our Phoenix clan is going to destroy you! ”<br/><br/>At this moment, the three kings of the Phoenix clan also received the message. They roared with fury and killing intent!<br/><br/>“Our Angel clan has over 200,000 disciples in the vast starry city. Dragon Palace Dragon King, Dragon Palace Dragon King!”<br/><br/>Not far away, the radiant Angel King looked at the news from his subordinates with a ferocious expression.<br/><br/>Even though they had a premonition in their hearts, they still found it hard to accept this result when they saw it!<br/><br/>With such a huge loss, even when the apocalypse arrived, their strength would still be difficult to recover to their previous state.<br/><br/>In other words, they didn’t gain anything from this trip to the starry universe. Instead, they suffered a huge loss.<br/><br/>This loss was hard to make up for!<br/><br/>This loss was hard for them to accept!<br/><br/>“Go back and prepare to attack the Dragon Palace’s Divine Dragon Island. In the nine-origin universe, if you see a disciple of the Dragon Palace, kill him!”<br/><br/>The Water Phoenix King of the Phoenix clan roared ferociously!<br/><br/>“Go Back! ”<br/><br/>The Radiant Angel King of the Angel clan also roared fiercely.<br/><br/>They wanted revenge. They wanted revenge.<br/><br/>They wanted to destroy all the strong disciples in the nine-origin universe.<br/><br/>They wanted to make the Dragon Palace unable to stay in the nine-origin universe.<br/><br/>The strong disciples of the two peak races immediately left to prepare for the upcoming battle.<br/><br/>“Hehe, I really didn’t expect the result to be like this. The losses of the angel race and the Phoenix race can’t be made up for. They really underestimated the Dragon Palace and the Dragon King! ”<br/><br/>A great elf from the ELF race said with a smile.<br/><br/>“Since the Dragon Palace and the Dragon King Dare to do this, they must have made all the preparations. I reckon that the Dragon Palace might give up their base in the nine-origin universe. Since the ancient god Feeding Kun Lord can ignore the suppression of the starry universe, maybe the Dragon Palace will be able to ignore the suppression of the starry universe in the future. In that case, the Dragon Palace might be a race of the starry universe, and an intelligent race at that. ”<br/><br/>The leader of the shamans, the ancestral wizard, said with a twinkle in his eyes.<br/><br/>The Dragon King’s performance this time had exceeded the expectations of all the experts of the Dragon Clan!<br/><br/>“It’s possible, but let’s not talk about anything else. I’m afraid that the Phoenix clan and the Angel clan won’t be able to step into the starry universe in the future.”<br/><br/>A skeleton king of the skeleton clan said with a smile, “This is a terrible loss for the Phoenix clan and the Angel Clan! ”<br/><br/>Yes, all the peak races knew that it was impossible for the powerful disciples of the Phoenix and Angel Race to step into the starry universe after this!<br/><br/>Even if they stepped into the starry universe, they would be destroyed by the Dragon Palace once they were discovered!<br/><br/>This was a huge loss for the two peak races.<br/><br/>Now, the resources in the nine-origin universe and the peak races had been limited and almost all of them had been used up.<br/><br/>It was impossible for the disciples to improve greatly!<br/><br/>This meant that the angel race and the Phoenix race wouldn’t be able to recover to their peak until the catastrophe arrived!<br/><br/>Such a loss wasn’t small!<br/><br/>On the other hand, the Dragon Palace would only lose the Divine Dragon Island. They wouldn’t lose too many resources!<br/><br/>The Dragon Palace could afford it!<br/><br/>As for the others, at the moment, the disciples of the Dragon Palace might not be able to move around in the nine-origin universe.<br/><br/>But it was hard to say in the future!<br/><br/>What if, in the starry universe, the Elf clan, skeleton clan, and other peak races cooperated with the Dragon Palace for some reason?<br/><br/>It was hard to say.<br/><br/>After all, the Dragon Palace and the Dragon King were already very powerful in the universe!<br/><br/>If their peak races cooperated with the Dragon Palace, it wouldn’t mean that the Dragon Palace couldn’t enter the nine-origin universe.<br/><br/>If they really cooperated with several peak races, the Phoenix clan and the Angel clan wouldn’t be able to do anything.<br/><br/>Therefore, the Phoenix clan and the Angel clan suffered the most losses this time.<br/><br/>In fact, they had no way to deal with the Dragon Palace!<br/><br/>This was because the Dragon Palace and the Dragon King couldn ‘t possibly be unprepared.<br/><br/>Once they were prepared, the two peak races could only helplessly rage!<br/><br/>There was no way!<br/><br/>At the same time, in the communication stone plate, in the universe Al of the nine-origin universe, all the powerful disciples were discussing the matter of this great battle.<br/><br/>Meanwhile, the Dragon Palace and the Dragon King were completely famous in the entire nine-origin universe.<br/><br/>While all the strong disciples of the peak races were discussing about this battle.<br/><br/>At this moment, Wang Xian’s figure appeared on the Divine Dragon Island!<br/><br/>This was Wang Xian’s first time coming to the Divine Dragon Island.<br/><br/>Even though the Divine Dragon Island had been occupied by the Dragon Palace for tens of millions of years, it was still his first time coming here!<br/><br/>A sense of familiarity that originated from his bloodline was transmitted over.<br/><br/>The Divine Dragon statues around him had a familiar aura, causing his eyes to flicker slightly!<br/><br/>“Dragon King, in these tens of millions of years, we have explored everything in the Divine Dragon Island except for this place. ”<br/><br/>An lie brought Wang Xian to a huge Dragon Gate!<br/><br/>On both sides, there were divine dragons entrenched.<br/><br/>It was a huge dragon gate that seemed to possess an indestructible power!<br/><br/>“This should be the treasury of our Divine Dragon Clan! ”<br/><br/>Wang Xian looked at this place with a glint in his eyes.<br/><br/>Behind this Dragon Gate, there might be the treasury of the Divine Dragon Clan.<br/><br/>This place had never been opened before.. It was even possible that even the heaven’s fate could not open it!\t\t\t\t\t\t</div>", "images": {}, "success": true}