{"id": 919, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073738.html", "title": "Chapter 3921 - Chapter 3921: 3920 Dragon Palace’S Treasury, Under The Universe Behind", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3921 - Chapter 3921: 3920 Dragon Palace’S Treasury, Under The Universe Behind</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3921: 3920 Dragon Palace’s treasury, under the universe behind<br/><br/>Translator: 549690339<br/><br/>“Buzz Buzz Buzz! ”<br/><br/>As the Water God Dragon’s Phantom spoke, its body became more and more blurry.<br/><br/>When it finished its last sentence, it completely disappeared!<br/><br/>Wang Xian stood there and listened to the water god Dragon’s words. A shocked expression appeared on his face.<br/><br/>Some of the doubts he had in the past were now completely unlocked!<br/><br/>The origin of the system.<br/><br/>The origin of the ancestral tree.<br/><br/>Some of the opportunities on Earth.<br/><br/>These were all sent over by the Divine Dragon Clan. He was just a fated person.<br/><br/>And the Water God Dragon Phantom just now was almost 100% certain that it was Lord Tianyuan of the Divine Dragon Clan!<br/><br/>“The Phoenix clan is actually related to the destruction of the Divine Dragon Clan. According to the records, the relationship between the Phoenix clan and the Divine Dragon clan is very good. Did Lord Water God dragon leave this sentence because of the ancestral tree? Is it because of the war with the insect Clan?<br/><br/>Wang Xian’s eyes sparkled.<br/><br/>He had a guess. The Divine Dragon tribe and the Phoenix tribe were preparing to join forces to fight against the bug tribe and obtain the ancestral tree.<br/><br/>For some unknown reason, the Phoenix tribe did not make a move. This resulted in the Divine Dragon tribe not being able to fight the bug tribe to the end and suffered heavy losses.<br/><br/>Even the water divine dragon, who was at the destiny-level of the Heaven’s origin, suffered heavy injuries.<br/><br/>In order to prevent the Phoenix tribe from misbehaving, this divine dragon system was created!<br/><br/>“I didn’t expect such a thing to happen in the past.”<br/><br/>From the side, an lie sighed slightly.<br/><br/>“Let’s Go! ”<br/><br/>Wang Xian nodded silently.<br/><br/>The news he received from this place also made him more certain of his future enemies.<br/><br/>The Phoenix clan!<br/><br/>The Phoenix Clan Must Die!<br/><br/>He looked at the position in front of him and flew into it.<br/><br/>There were many dragon caves in the area. It was a magnificent Dragon Cave!<br/><br/>There were a few million of them!<br/><br/>There was a special palace at the back!<br/><br/>Wang Xian took a look at them one by one!<br/><br/>There were some items in the dragon caves.<br/><br/>However, these items were not treasures. They were simple items used by the divine dragon who lived here.<br/><br/>After a quick glance, Wang Xian flew to the back of the palace which was in the style of the Divine Dragon!<br/><br/>After entering the palace, there were items placed in the middle of the main hall!<br/><br/>Other than these items, there was something very strange.<br/><br/>It was a white vortex, a white vortex that was a hundred meters in size.<br/><br/>Waves of very strange energy flew out from the vortex.<br/><br/>This energy contained nine attributes, but it was not just nine attributes!<br/><br/>It was very strange!<br/><br/>Wang Xian’s gaze shifted to the location of the palace and landed on the few treasures!<br/><br/>There were a total of four treasures.<br/><br/>A book, two boxes, and a bag!<br/><br/>He walked to the front of the book. When his gaze landed on the book, an astonished expression immediately appeared on his face.<br/><br/>“Heaven’s origin sword technique! ”<br/><br/>Wang Xian mumbled as a look of astonishment appeared in his eyes.<br/><br/>Sword technique, a sword technique?<br/><br/>It was very strange for a sword technique to appear here.<br/><br/>After all, this was the treasure house of the Divine Dragon Clan. The Divine Dragon Clan was not suitable for sword techniques!<br/><br/>He took out this sword technique and opened the first page.<br/><br/>The first page was not the first page of this sword technique. Instead, it was a layer of paper.<br/><br/>On the paper was written the cultivation method of the supreme sword technique of the sword universe. It was obtained from the cosmic tribulations.<br/><br/>If one cultivated it to the peak, it could break the destiny of the heaven!<br/><br/>A short introduction made Wang Xian look surprised.<br/><br/>The Supreme Sword Technique of a universe?<br/><br/>The Sword Universe?<br/><br/>It was an ambitious sword technique of another universe, the heaven origin sword technique. Just from the name alone, one could tell that it was very powerful!<br/><br/>Wang Xian thought to himself.<br/><br/>This sword technique was of great use to the Dragon Palace.<br/><br/>It was extremely useful to Ao Jian and the rest.<br/><br/>Ao Jian’s fellow disciples cultivated the heartless sword principle. In the past, Wang Xian could not discover anything. However, when he cultivated it to the ruler realm, his flaws were revealed.<br/><br/>Under the ruler realm, the heartless sword principle could indeed fight against opponents of a higher level. When one cultivated it to perfection, one could fight against opponents of a higher level by three levels.<br/><br/>However, when one reached the ruler realm, there was an almost unbreakable shackle!<br/><br/>This shackle came from one’s physique.<br/><br/>Their physique restricted their improvement, causing Ao Jian and the rest to be stuck at the peak of the supremacy realm!<br/><br/>It was extremely difficult to break through to the ruler realm!<br/><br/>And now, with this Tianyuan sword technique, it was definitely a significant breakthrough for AO Jian and the rest!<br/><br/>After putting away this sword technique, Wang Xian walked to the front of the second item.<br/><br/>It was a treasure box. After Wang Xian opened the box, there were two jade horns inside.<br/><br/>These two jade horns looked extremely small, but they contained a very special energy.<br/><br/>This energy was very intimate when he sensed it.<br/><br/>He had an urge to fuse it into his body.<br/><br/>“Heaven Origin Jade Horn! ”<br/><br/>In the box, there was a piece of paper with a line of words written on it.<br/><br/>The name of this pair of jade horns was heaven origin jade horn.<br/><br/>There was another line of explanation below: Heaven Origin Jade Horn. After refining it, it could ignore the suppression of the universe.<br/><br/>When he saw this line of remarks, his face was filled with astonishment.<br/><br/>After refining it, it could ignore the suppression of the universe?<br/><br/>This was a treasure!<br/><br/>What kind of concept was this?<br/><br/>In other words, after Wang Xian refined it, he could ignore the suppression of the universe.<br/><br/>At that time, even if he were to encounter a universe behemoth that was at the peak of the ruler of the universe, Wang Xian would be able to destroy it.<br/><br/>It was hard to say who would be stronger if he were to encounter that senior chaos space behemoth again.<br/><br/>If that chaotic space beast senior didn’t have powerful trump cards and treasures, he might not be a match for Wang Xian.<br/><br/>Of course, the probability of this happening was a little low in Wang Xian’s eyes.<br/><br/>That chaotic space beast was willing to exchange the starfield fragment with Wang Xian back then. He must still have powerful ultimate treasures in his hands.<br/><br/>Or perhaps it was an extremely powerful trump card!<br/><br/>Putting aside that chaotic space beast senior, Wang Xian could really kill all the other peak-level space beasts at will!<br/><br/>There was another point. He still had a lot of resources in his hands.<br/><br/>He could increase his strength without any scruples.<br/><br/>In the nine-origin universe, the reason why the masters who were at level seven and above didn’t dare to step into the space universe was because they were stronger and were suppressed by the universe.<br/><br/>Under such circumstances, they were labeled as foreign creatures.<br/><br/>The Space Beasts of the starry universe could easily sense it.<br/><br/>Without the suppression of the universe, it meant that it was anything in this universe. It meant that it was a creature of this universe.<br/><br/>In that case, under normal circumstances, if you didn ‘t provoke the terrifying existence of the starry universe, he wouldn’t come and not kill you! After all, in their view, you were also a creature of the starry universe.<br/><br/>Not an intruder!<br/><br/>This was the function of the Heaven’s origin jade horn.<br/><br/>It was extremely huge!<br/><br/>“This is a good item! ”<br/><br/>Wang Xian was slightly excited and immediately kept the Heaven’s origin jade horn.<br/><br/>After that, he looked at the third treasure box with slight excitement!\t\t\t\t\t\t</div>", "images": {}, "success": true}