{"id": 910, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073720.html", "title": "Chapter 3912 - Chapter 3912: The Fragment Of Starfield 3911 Came Out And Suppressed The Giant Star City", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3912 - Chapter 3912: The Fragment Of Starfield 3911 Came Out And Suppressed The Giant Star City</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3912: The fragment of Starfield 3911 came out and suppressed the giant star city<br/><br/>Translator: 549690339<br/><br/>“HMM? All the experts of the Angel clan and the Phoenix clan are blocked by the Dragon King of the Dragon Palace! ”<br/><br/>“It’s over. The experts of the Angel clan and the Phoenix Clan are doomed. ”<br/><br/>“What kind of terrifying weapon is this? The Dragon King of the Dragon Palace has such a powerful trump card! ”<br/><br/>“This… doesn’t this mean that the experts of the angel race and the Phoenix race are completely defeated?”<br/><br/>“Not good, the Lords of the Phoenix race and the angel race are sealed.” Above the starry city, all the experts and disciples looked at this scene in shock.<br/><br/>The Dragon King of the Dragon Palace was still standing there!<br/><br/>However, that terrifying treasure had already blocked the escape route of the angel race and the Phoenix race.<br/><br/>It had completely sealed off their escape route!<br/><br/>The Dragon King of the Dragon Palace still had a powerful trump card in his hands.<br/><br/>This was especially true for the disciples of the Phoenix and Angel clans.<br/><br/>When they saw this scene, they felt their vision go black!<br/><br/>There were around 300,000 to 400,000 ordinary disciples of the Phoenix and Angel clans in the starry city.<br/><br/>Now that they saw this situation, they knew that it would be very difficult for their masters to escape!<br/><br/>Next, they would probably…<br/><br/>The disciples of the Phoenix clan and Angel clan looked extremely embarrassed!<br/><br/>“The rulers of the Phoenix clan and Angel clan are probably finished! ”<br/><br/>The experts of the peak races said. Their faces were also filled with shock.<br/><br/>“Buzz Buzz!”<br/><br/>“Buzz Buzz!”<br/><br/>At this moment, two figures flew out from the teleportation array.<br/><br/>One of them held a scepter of light while the other flapped his flaming wings.<br/><br/>They were the peak-stage ruler-level archangel and the peak-stage ruler-level fire Phoenix.<br/><br/>This archangel was called the Evans Archangel and was the guardian angel of the Angel Race of light!<br/><br/>And the peak-stage ruler-level fire Phoenix was the younger brother of the Phoenix King of the Phoenix race, Prince Yin Feng!<br/><br/>Two figures appeared from the teleportation array, but the surrounding disciples didn’t notice them!<br/><br/>When they flew into the sky, they saw the experts of their clan being stopped.<br/><br/>Seeing their terrified faces, their faces were full of killing intent.<br/><br/>Their eyes immediately turned to that figure!<br/><br/>Dragon King of the Dragon Palace!<br/><br/>“HMPH!”<br/><br/>The eyes of the Archangel Guardian Evans were filled with killing intent. He raised the scepter in his hand and attacked the Tai Chi Dragon Plate directly!<br/><br/>At this moment, Wang Xian sensed something and immediately looked in the direction of the huge city in the starry sky.<br/><br/>When he saw a stream of energy attacking the Tai Chi Dragon Plate, he quickly waved his arm! Boom<br/><br/>Crack Crack Crack<br/><br/>However, his reaction was a little slow. The Tai Chi Dragon Plate was struck by this wave of energy.<br/><br/>Cracks began to appear slowly!<br/><br/>Wang Xian waved his arm and retrieved the Tai Chi Dragon Plate!<br/><br/>“Huh?”<br/><br/>The sudden attack and the sudden collapse of the Tai Chi Dragon Plate gave everyone a slight shock!<br/><br/>CHIRP CHIRP CHIRP<br/><br/>At this moment, a majestic Phoenix cry rang out!<br/><br/>All the Great Beings and disciples in the Star City felt a wave of heat surging toward them!<br/><br/>They felt that the light in the sky was blocked, and a red shadow appeared!<br/><br/>“This is…<br/><br/>All the great beings and disciples in the 9 -origin universe looked up and felt this enormous pressure. Their faces were filled with awe.<br/><br/>“This is a peak ruler! ”<br/><br/>“It’s a peak ruler of the Phoenix clan. Why is this existence here?”<br/><br/>“And a peak ruler of the Angel clan. He was the one who launched the attack just now! ”<br/><br/>“Hahaha, it’s Our Radiant Angel clan’s guardian Evans. Our Guardian is actually here! ”<br/><br/>“Our Prince Feng Yin Tian is also here. He’s a peak ruler of our Phoenix clan. ” All the powerful disciples were shocked.<br/><br/>However, the disciples of the Phoenix clan and the angel clan were pleasantly surprised.<br/><br/>“Lord Prince, kill the Dragon King! Kill the Dragon King!”<br/><br/>“Lord Protector! ”<br/><br/>The excited voices of the disciples of the Phoenix clan and the Angel clan rang out!<br/><br/>The true experts of their two peak clans had arrived!<br/><br/>Experts of this level were almost at the peak of their race.<br/><br/>They were also at the peak of the ruler level!<br/><br/>Now that they had arrived, everything would be much simpler.<br/><br/>Then the Dragon King of the Dragon Palace wouldn’t be able to kill the experts of their two races!<br/><br/>Forget about killing them, they could even consider killing the Dragon King of the Dragon Palace Now!<br/><br/>“Disciples of the Phoenix clan, come here! ”<br/><br/>“Disciples of the Angel clan, come here! ”<br/><br/>Prince Feng Yuntian and Great Protector Evans were floating above the starry city. They did not attack again. Instead, they spoke to the powerhouses of the Angel clan and the Phoenix clan.<br/><br/>“Hehe, I really didn’t expect that the powerhouses of the Phoenix clan and the Angel clan, who are at the peak of the Overlord realm, would come here. Are you afraid that I will annihilate the disciples of the two peak races?”<br/><br/>Wang Xian slowly put away the tai chi dragon plate. He looked at Feng yintian and Evans and said with a cold smile!<br/><br/>“Humph! ”<br/><br/>Great Protector Evans and Feng Yintian stared at Wang Xian with a cold and sinister look in their eyes!<br/><br/>“Dragon King of the Dragon Palace, your strength has indeed exceeded our expectations. ”<br/><br/>Great Protector Evans said coldly, “However, you have offended our Angel clan. One day, you will be filled with regret! ”<br/><br/>“Hehe, your Angel clan bullied our Dragon Palace first. Do you think that our Dragon Palace is a place that you can bully? HMM? Phoenix clan? Angel clan?” Wang Xian looked at them and said indifferently.<br/><br/>“Impudent! If this were in the nine-origin universe, Dragon King, do you think<br/><br/>I would be here talking to you? I would have taken your dog life long ago!”<br/><br/>Prince Phoenix Yin Tianhuo stared at Wang Xian and shouted with a face full of killing intent!<br/><br/>“Dragon King of the Dragon Palace, don’t be so arrogant. If this were in the nine-origin universe, Your Dragon Palace would have been destroyed long ago!<br/><br/>“How dare you act so presumptuously with our prince. If it weren’t for the fact that our prince couldn’t make a move, all of you would have died long ago!”<br/><br/>The group of Phoenixes, who were flying towards the starry city, saw that they had arrived in the starry city.<br/><br/>They heaved a sigh of relief and turned around. Wang Xian spoke with a cold expression!<br/><br/>“You want to take my life?”<br/><br/>Wang Xian heard their words, he laughed. “You want to take my life? Phoenix clan, Angel clan, do you think I will let you go today? Do you think you are safe just because there are two powerhouses at the peak of the Dominator realm?”<br/><br/>“And you two powerhouses at the peak of the Dominator realm. Do you think that you are my opponents?”<br/><br/>(‘I the Dragon King of the Dragon Palace, can make the entire belief universe and the 24 palaces fear me. Do you think that’s all I have?”<br/><br/>“All the disciples of the Angel clan and the Phoenix clan will die today! ”<br/><br/>“I told you that I will make you bleed like a river. I will kill every single one of you!<br/><br/>“Starfield fragment, Starfield Lock Sky, Starfield descend!”\t\t\t\t\t\t</div>", "images": {}, "success": true}