{"id": 918, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073736.html", "title": "Chapter 3920 - Chapter 3920: 3919 Dragon Palace Treasury, In The Universe Behind", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3920 - Chapter 3920: 3919 Dragon Palace Treasury, In The Universe Behind</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3920: 3919 Dragon Palace Treasury, in the universe behind<br/><br/>Translator: 549690339<br/><br/>The Dragon Gate of the Dragon Palace treasury was not very big. It had a space of about 10,000 meters.<br/><br/>When the Dragon Palace reoccupied the Divine Dragon Island, Prime Minister Gui and the rest had tried their best to open this Dragon Gate.<br/><br/>The blood of the purebred divine dragon and a large number of purebred divine dragons came to open the Dragon Gate, but they could not open it!<br/><br/>Initially, Wang Xian did not come over because he was afraid that the experts from the angel and Phoenix clans would ambush him.<br/><br/>After that, he was trapped in the starry universe.<br/><br/>Now, his strength was in the nine-origin universe. With the help of the galactic fragment, the only thing that could kill him was the fate of the Heaven’s origin.<br/><br/>Therefore, he planned to come here to take a look the moment the battle ended.<br/><br/>He wanted to see if he could open this dragon gate.<br/><br/>If he couldn’t open it, it didn’t matter. He would return one day.<br/><br/>If he could open it, there might be an unexpected reward!<br/><br/>Wang Xian looked at the Dragon Gate and moved to the front.<br/><br/>Ding! “Divine Dragon Clan’s treasure vault detected. Open It! ”<br/><br/>However, just as Wang Xian got closer, the system’s voice sounded suddenly.<br/><br/>This stunned Wang Xian slightly. His face was filled with astonishment.<br/><br/>His face revealed a hint of excitement!<br/><br/>“upen IL’.<br/><br/>Wang Xian shouted in a low voice!<br/><br/>“Roar Roar Roar! “<br/><br/>At this moment, on the Dragon Gate in front, the divine dragon statues seemed to have come to life. They were emitting the radiance of nine attributes.<br/><br/>In the center was a water dragon.<br/><br/>The head of the water dragon slowly looked down, and the Dragon Gate slowly opened!<br/><br/>“HMM?”<br/><br/>“It seems that you, Dragon King, are… the son of Heaven of the True Dragon! ” An lie, who was standing on the side, was shocked when he saw this scene.<br/><br/>He opened his mouth in shock.<br/><br/>Prime Minister Gui had used all his methods but failed to open it!<br/><br/>In fact, in the past, the Angel of Light, the second prince, and the Green River Water Phoenix had also used all the methods but failed to open it.<br/><br/>They guessed that this required the blood of a divine dragon in the mastery of nine attributes to be able to open it.<br/><br/>Prime Minister Gui had also tried this method but failed to open it!<br/><br/>The key to the treasure vault of the Divine Dragon clan was with Wang Xian.<br/><br/>It was on the Divine Dragon System!<br/><br/>Wang Xian collected his thoughts and his eyes flickered slightly.<br/><br/>According to Wang Xian’s guess, 90% of the system that he owned was created by the Divine Dragon Clan.<br/><br/>Now that the system was able to open this door, he wasn’t too surprised!<br/><br/>After the dragon door was opened, Wang Xian walked straight in.<br/><br/>The moment he stepped in, a special energy aura was transmitted over.<br/><br/>The Aura inside was not only the aura of the dragon’s might and the Divine Dragon. There was also a unique aura!<br/><br/>When Wang Xian entered, the huge treasure house did not exist.<br/><br/>Instead, it was like a small world!<br/><br/>There were no treasures and there were many trees in the surroundings.<br/><br/>Each tree contained a powerful energy. These could be said to be treasures of the Overlord level!<br/><br/>In front of them was a blue sky. However, one could see the end of the sky!<br/><br/>However, the space in this small world was not small.<br/><br/>At least, it was much larger than the current Dragon Palace!<br/><br/>In the entire small world, other than flowers, plants, and trees, there were no other living beings!<br/><br/>Buzz<br/><br/>At this moment, the Dragon Gate behind them suddenly closed.<br/><br/>Wang Xian immediately looked over. After hesitating for a moment, he looked at an lie.<br/><br/>An lie nodded his head and his figure slowly disappeared.<br/><br/>A few seconds later, an Lie’s figure appeared again. However, his expression was a little strange.<br/><br/>“Dragon King, I can teleport out. However, when I went out, I had a strange feeling. This feeling is that I couldn’t get out initially because I was blocked by an energy. However, due to the Divine Dragon bloodline in my body, I can get out again! ”<br/><br/>An lie opened his mouth and looked at Wang Xian. “If I don’t have the bloodline of the Divine Dragon in my body, my teleportation will lose its effect.<br/><br/>It will be the same as before.”<br/><br/>In the past, Prime Minister Gui also wanted to let an lie teleport in, but he had never succeeded!<br/><br/>Now, he could teleport in and out.<br/><br/>This should be related to Wang Xian. Some special energy was activated.<br/><br/>“That’s Good! ”<br/><br/>Wang Xian nodded his head and looked ahead again. Looking at the Long Road, he pondered for a few seconds.<br/><br/>“Roar Roar Roar! “<br/><br/>He let out a low roar and transformed into the body of a divine dragon.<br/><br/>An incomparably huge body appeared and took up just a tenth of the area of the road ahead.<br/><br/>In this space, there were tens of thousands of divine dragons. There was no problem at all!<br/><br/>The entire space should be many times larger than the huge city in the starry sky!<br/><br/>Buzz<br/><br/>The moment Wang Xian transformed into a divine dragon, the position of Wang Xian’s head was shimmering.<br/><br/>Following that, the shadow of a divine dragon slowly condensed in front of him.<br/><br/>It was the shadow of a water divine dragon.<br/><br/>The shadow didn’t look majestic. Instead, it had a hint of age and benevolence!<br/><br/>This shadow didn’t have much emotion. It looked at Wang Xian in a daze.<br/><br/>“The successor of the Divine Dragon Clan, Congratulations! You have come to the birthplace of our Divine Dragon Clan!” The Shadow Water Divine Dragon spoke. “You Are… you are that Lord Water Divine Dragon?”<br/><br/>Wang Xian couldn’t help but ask in surprise.<br/><br/>“Don’t ask me any questions. I have used up all my energy in the battle back then. What I have left now is just a shadow without anv intelligence. In order to fight for the ancestral tree, our Divine Dragon Clan fought with the insect clan until the end. We have almost exhausted all the strong disciples. ”<br/><br/>“Of course, after we killed the queen of the insect clan and obtained the ancestral tree, not all the powerful disciples of the Divine Dragon Clan have died. However, my own strength and the strength of the Dragon Palace are less than one-twentieth of the peak<br/><br/>“If the Phoenix clan hadn’t broken their promise, we wouldn’t have been so miserable. In order to prevent the Phoenix clan from attacking us from behind, I’ve decided to sacrifice all the remaining divine dragons of the Dragon Palace and use the last of my strength to build a support system with the core technology of the insect clan<br/><br/>“When the system was built, a mutation occurred with the ancestral tree, which consumed most of the ancestral tree’s strength and turned the ancestral tree back into a seed. As for the specific situation of the system, I don’t know either. But I believe that you, the current inheritor, have already mastered it<br/><br/>“This system was built with the technology of the insect clan, the power of the ancestral tree, and all the energy of the Divine Dragon Clan. I hope that you, the inheritor, can restore the glory of the Divine Dragon Clan<br/><br/>“As for the body-type successor, be careful of the Phoenix race. If you have enough strength, you can destroy them. If you don’t, then please rebuild the Divine Dragon Race. ”<br/><br/>“You are in a special space. This place was created by me during the last calamity. The special properties of this space can withstand the attacks of the heaven’s fate. As for the specifics, you can find out by investigating. In the depths of this space, there are some treasures of the Divine Dragon Race. There are not many treasures because most of them are used to create auxiliary systems. “\t\t\t\t\t\t</div>", "images": {}, "success": true}