{"id": 915, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073730.html", "title": "Chapter 3917 - Chapter 3917: Three Thousand Nine Hundred And Sixteen, The Two Peak Rulers, Had Fallen, And Blood Flowed Like A River", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3917 - Chapter 3917: Three Thousand Nine Hundred And Sixteen, The Two Peak Rulers, Had Fallen, And Blood Flowed Like A River</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3917: Three thousand nine hundred and sixteen, the two peak rulers, had fallen, and blood flowed like a river<br/><br/>Translator: 549690339<br/><br/>Boom! Boom! Boom<br/><br/>Eight stars flew toward the Prince of the Fire Phoenix, Feng Yuntian.<br/><br/>These eight terrifying stars were enough to kill him!<br/><br/>Feng Yuntian also knew that he couldn’t escape today!<br/><br/>His face was full of anger and a trace of fear.<br/><br/>The strength of the Dragon King of the Dragon Palace had completely exceeded their expectations.<br/><br/>“Not good, our prince is going to be killed too!”<br/><br/>“How can the Dragon King be so strong? How can he be so strong?”<br/><br/>“Once our prince is killed, will it be our turn next? I don’t have any treasures that can revive me. I don’t want to die.”<br/><br/>“It’s over, everything is over! ”<br/><br/>At the same time, all the powerful disciples of the Phoenix and Angel clans in the starry city were shocked when they saw this scene.<br/><br/>Their prince was no match for the Dragon King of the Dragon Palace.<br/><br/>Even the great guardian of the Angel clan had been killed!<br/><br/>“A peak-level ruler has been killed by the Dragon King. The one from the Phoenix clan will be killed soon. The Dragon King of the Dragon Palace is really powerful. ”<br/><br/>The other powerful disciples of the nine-origin universe were also shocked when they saw this scene.<br/><br/>Who would have thought that today’s battle would end like this.<br/><br/>The two peak masters of the Phoenix clan and the Angel clan had come, but the Dragon King had left them here.<br/><br/>The Dragon King’s strength had exceeded everyone’s expectations.<br/><br/>“Chirp, chirp, Chirp! ”<br/><br/>In front of them, the Prince of the Fire Phoenix, Feng Yuntian, let out a ferocious roar.<br/><br/>Facing the eight stars, he resisted desperately.<br/><br/>However, the eight stars soon covered them.<br/><br/>They didn’t know the exact situation.<br/><br/>However, everyone could sense that the prince of the Fire Phoenix’s aura was getting weaker and weaker until it completely disappeared in the end.<br/><br/>“They’re dead, they’re all dead!”<br/><br/>Seeing this scene, the experts of the peak-level races murmured.<br/><br/>Two peak-level rulers had fallen!<br/><br/>This could be said to be the first and second peak ruler realm experts to die in the past 20 billion years after the last calamity.<br/><br/>This kind of expert could already be said to be one of the most supreme experts in the nine origin universe!<br/><br/>But today, they all died at the hands of the Dragon King.<br/><br/>The strength of the Dragon King and the strength of the Dragon Palace made all the peak races realize that they couldn’t afford to offend them!<br/><br/>The Dragon Palace was not weak.<br/><br/>If the other peak races wanted to provoke the Dragon Palace, they would have to consider it carefully.<br/><br/>Whoosh! Whoosh<br/><br/>Wang Xian killed the two masters at the peak of the ruler realm. A faint smile appeared on his face.<br/><br/>He waved his arm and kept the two corpses. Then, his gaze flew toward the starry city.<br/><br/>“Do you want to come here and die, or do you want us to come and kill you?”<br/><br/>Wang Xian spoke to all the strong disciples of the Phoenix and Angel races in the starry city.<br/><br/>In the starry city, the number of strong disciples of the two peak races had reached 500,000 to 600,000.<br/><br/>Among them, there were about 60,000 masters.<br/><br/>This was the core strength of the two peak races. It was the strong foundation of the two races.<br/><br/>Once they were eliminated, the two peak races would be severely injured in terms of their masters and disciples.<br/><br/>“Our Angel Race has the Heaven’s destiny. If you dare to kill us, the Emperor of Our Angel race will not let you off, Dragon King.”<br/><br/>An Archangel who was in the seventh level of the angel race roared with a ferocious face!<br/><br/>“Oh? Hehe!”<br/><br/>Wang Xian laughed coldly when he heard that. With a wave of his arm, the five elements Millstone flew out of his body.<br/><br/>“I have said that I will make your Phoenix race and Angel race bleed like a<br/><br/>river. I will not spare a single one. I will do as I said. Disciples of the Dragon Palace, attack and kill! Leave No one alive! ”<br/><br/>He stared at the strong disciples of the Phoenix race and Angel race with a cold and murderous look!<br/><br/>The five elements millstone flew directly into the giant starry city.<br/><br/>The array formation and other defensive systems weren’t activated in the Giant Starry City!<br/><br/>The powerful disciples around the Angel clan and the Phoenix clan immediately moved away from them!<br/><br/>“Kill! Kill all the powerful disciples of the Phoenix clan and the Angel Clan!”<br/><br/>The group of experts from the Dragon Palace let out a low roar and flew directly towards the starry city!<br/><br/>With more than 170 succubus dragon species who were at the level seven of the ruler realm as the leader.<br/><br/>This force was enough to completely destroy them.<br/><br/>Furthermore, Wang Xian had also used the five elements millstone to kill the existences who were at the level seven of the ruler realm.<br/><br/>The five elements millstone was very fast and flew into the starry city in an instant.<br/><br/>One by one, terrifying weapons were launched at the level seven masters of the Phoenix and the Angels.<br/><br/>“Dragon King of the Dragon Palace, our two races will definitely not let you off. Definitely! ”<br/><br/>At this moment, when the powerful disciples of the Phoenix clan and the Angel clan saw the attack of the Five Elements Millstone, they roared with despair on their faces!<br/><br/>They had completely given up the will to fight back.<br/><br/>In front of the terrifying Dragon King, even their two peak races ‘peak overlords couldn’t escape, let alone them!<br/><br/>How could they escape?<br/><br/>How could they escape?<br/><br/>They weren’t on the same level.<br/><br/>“Boom Boom Boom! ”<br/><br/>The Five Elements Millstone took the lead to destroy a group of seventh level overlords.<br/><br/>The screams of peak overlords kept ringing out.<br/><br/>There were 50-60 peak-stage sovereign realm experts of the two races!<br/><br/>One by one, the peak-stage sovereign realm experts died.<br/><br/>The experts of the Dragon Palace also flew over.<br/><br/>Their eyes locked onto the other angels and Phoenixes.<br/><br/>The slaughter began!<br/><br/>“Let’s fight them to the death!”<br/><br/>“Ahhhh, I don’t want to die. I don’t have any treasures to resurrect. I don’t want to Die! ”<br/><br/>Some people desperately wanted to fight for their lives.<br/><br/>Some people started to collapse in despair.<br/><br/>In the surrounding area, tens of billions of strong disciples of the 9-origin universe were watching.<br/><br/>The experts of the peak races and the disciples of the high-level races were watching in shock.<br/><br/>No one dared to help, even if some experts were on good terms with the strong disciples of the Phoenix Angel Race.<br/><br/>But at this time, no powerhouse disciple dared to stand out.<br/><br/>Because this was a race war.<br/><br/>Moreover, this war was initiated by the Phoenix clan, and the Angel clan took the initiative to participate in it!<br/><br/>But they underestimated the Dragon Palace.<br/><br/>Underestimated the Dragon King!<br/><br/>The powerhouses disciples of the Angel clan and the Phoenix clan fell quickly one by one.<br/><br/>Blood flowed on the ground.<br/><br/>The Phoenix’s corpse lay in the giant city.<br/><br/>The angels corpse lay on the cold ground.<br/><br/>The Phoenix fell, the angel fell!<br/><br/>The charming dragon seed of the Dragon Palace also made all the powerful disciples of the 9-origin universe witness their terrifying strength!<br/><br/>A massacre, a one-sided massacre!<br/><br/>The Dragon Palace didn’t let go of any of the disciples of the Phoenix race and the angel race.<br/><br/>No matter if they were at the ruler level or below.<br/><br/>Not a single one was spared!<br/><br/>Provoking the dragon palace and killing the disciples of the Dragon Palace would have a price to pay!\t\t\t\t\t\t</div>", "images": {}, "success": true}