{"id": 912, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073724.html", "title": "Chapter 3914 - Chapter 3914: 3913, The Pinnacle Of The Overlords Of Suppression, Invincible! Go", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3914 - Chapter 3914: 3913, The Pinnacle Of The Overlords Of Suppression, Invincible! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3914: 3913, the pinnacle of the overlords of suppression, invincible! Go<br/><br/>Translator: 549690339<br/><br/>Wang Xian could feel the power of the Starfield Space Lock deeply!<br/><br/>Back then, he had been trapped in this space for more than 30 million years!<br/><br/>That was more than 30 million years!<br/><br/>Other than the power of the Starfield Space Lock, the second power was the power of the descent of the Starfield.<br/><br/>The descent of the Starfield enveloped and even replaced this piece of void!<br/><br/>This was the most powerful power that Wang Xian could unleash from the starfield fragment.<br/><br/>The strength of the Starfield fragment was that he could unleash it to the maximum.<br/><br/>Wang Xian materialized all the energy of the Starfield fragment. Of course, there were tens of thousands of stars in this entire void.<br/><br/>Each star contained a terrifying power, but the power that he could mobilize was not many!<br/><br/>At most, there were only a few hundred stars!<br/><br/>Some stars were in a state of dead silence because he had yet to activate them!<br/><br/>Even if they were activated, he would need to expend a lot of energy to control them. He could only control a few hundred of them!<br/><br/>However, this was enough!<br/><br/>The starfield descended and the Starfield was locked up.<br/><br/>They wanted to leave through the teleportation formation?<br/><br/>It was impossible.<br/><br/>Even an lie, who could ignore any barriers, formations, or obstacles, could not bring Wang Xian out of this space. They wanted to leave?<br/><br/>It was impossible!<br/><br/>This was because this was a force at the Heaven’s origin level.<br/><br/>Unless there was a force that was stronger than this place, or an existence that was stronger than the fragments of the Starfield.<br/><br/>“This…<br/><br/>Upon hearing Wang Xian’s words, the expressions of great protector Ayres and Prince Feng Yintian changed slightly again!<br/><br/>“The Dragon King was trapped in a space like this for more than 30 million years<br/><br/>“What kind of treasure is this? It’s so terrifying. Furthermore, the Dragon King destroyed the power of five or six palaces in the 24 palaces. Isn’t this too terrifying? ”<br/><br/>“Over the past 20,000 years, the Dragon King hasn’t immediately retaliated against the Phoenix clan and the Angel clan. Could it be that he has gone to fight against the legions of the universe of belief?”<br/><br/>“It’s really possible. At that time, the ones who wanted to attack us were the 21 legions. Those three legions were destroyed by the Dragon King? So then, the Dragon King has destroyed another two or three legions of the universe of belief?”<br/><br/>“This is too awesome. The Dragon King’s strength is too strong!” Wang Xian’s words shocked everyone once again!<br/><br/>No one expected that the Dragon King would actually do such a thing. “HMPH, Dragon King, are you trying to keep us here?”<br/><br/>Feng Yuntian stared at Wang Xian with an embarrassed expression and growled in a low voice!<br/><br/>“Hehe, none of you can escape today. Didn’t you say that you wanted to kill me? If you don’t kill me today, you really can’t leave this place. Come, let’s see if you can get what you want! ”<br/><br/>Wang Xian smiled and said to Prince Feng yintian and guardian ayers, “All of you don’t have to hide in the vast starry city. If I want to destroy the vast starry city, I can do it with just a thought. Come out. ”<br/><br/>As soon as Wang Xian finished speaking, all the strong disciples in the vast Starry City looked at guardian Ayers from the Angel clan and Prince Feng Yintian from the Phoenix clan.<br/><br/>Especially prince Feng Yantian.<br/><br/>He had just said that he wanted to take the Dragon King’s dog life. Now was his chance!<br/><br/>Under the attention of all the strong disciples in the nine-origin universe, Feng Yantian, Eles, and the rest looked extremely embarrassed!<br/><br/>Since Wang Xian asked them to go out and fight, they couldn ‘t stay here!<br/><br/>Because this was the starry sky city!<br/><br/>It was a huge city built by all the peak races.<br/><br/>It was impossible for them to have a fight with the Dragon King here. They did not dare to stay here forever either.<br/><br/>If the strong disciples of other peak races were to be implicated because of them, then the blame would be placed on the two peak races!<br/><br/>Therefore, they had to leave the giant city of stars at this moment!<br/><br/>Regardless of whether they had to accept the challenge or avoid it, they had to leave this giant city!<br/><br/>“Then, let’s have a taste of your strength, Dragon King!”<br/><br/>Great Protector Ailes stared at Wang Xian with a grim expression. With a move of his body, he flapped his twelve wings and flew forward.<br/><br/>“Choo-choo-choo, I will take your dog life today! ”<br/><br/>Prince Feng Yin Tian also knew that he couldn’t pass this test in front of him. He roared with a grim expression!<br/><br/>They flew toward Wang Xian at the same time!<br/><br/>“Hehe! ”<br/><br/>Wang Xian’s eyes turned cold when he saw them flying over.<br/><br/>His body trembled. The terrifying stars around him started to move!<br/><br/>The moment they flew out of the starry city, eight stars attacked them directly!<br/><br/>Each star carried a terrifying amount of energy.<br/><br/>It contained a full-force attack that was comparable to a powerhouse at the peak of the ruler realm, or perhaps the strongest attack!<br/><br/>Eight stars was the limit that Wang Xian could mobilize at the moment!<br/><br/>To mobilize eight stars at once was already very powerful!<br/><br/>“The power of these stars! ”<br/><br/>Great Protector Ayres ‘expression changed slightly.<br/><br/>“Hualala!”<br/><br/>He raised the scepter in his hand. Special armor scales appeared on the 12 wings!<br/><br/>His body was also protected by a group of light armor!<br/><br/>Above his head, there was a great sun of light!<br/><br/>Below him, it was like a long river of light flowing below!<br/><br/>These strange phenomena were the innate supreme treasures and other types of treasures that great protector Ayres had!<br/><br/>As the great protector of the Angel of light clan, he had many, many treasures in his hands.<br/><br/>He also had many trump cards!<br/><br/>At his level, he was using the best and most suitable innate treasures!<br/><br/>The most powerful treasures!<br/><br/>There were six or seven strange phenomena in the surroundings!<br/><br/>“CHIRP CHIRP CHIRP! ”<br/><br/>Prince Feng Yin Tian let out a cry, and all kinds of strange phenomena appeared in the surroundings!<br/><br/>They used all their strength to block the eight stars that were attacking them!<br/><br/>Eight stars, and each star had a different energy.<br/><br/>Flames.<br/><br/>Ice.<br/><br/>Thick and heavy.<br/><br/>Dead Silence.<br/><br/>The eight stars smashed towards their bodies, not allowing them to dodge at all.<br/><br/>Because this was the domain of the star field!<br/><br/>“Boom Boom Boom! ”<br/><br/>In an instant, a loud sound of resistance was heard. The stars smashed directly onto their defenses.<br/><br/>Prince Feng Yin Tian and great protector Ayres used all their strength to defend!<br/><br/>“Ahhhh!”<br/><br/>“Block! ”<br/><br/>An angry roar came from them.<br/><br/>“What a terrifying attack! ”<br/><br/>“Eight terrifying stars directly attacking two peak-stage rulers. Is this the roar of Prince Fire Phoenix that they can’t defend against?”<br/><br/>On the starry city, all the powerful disciples stared at this battle.<br/><br/>Dragon King vs Prince Fire Phoenix, Guardian Angel of light!<br/><br/>One against two.<br/><br/>However, it was obvious that Dragon King of Dragon Palace had the upper hand!<br/><br/>Even Prince of Fire Phoenix was roaring angrily in the face of the attack of the eight stars!<br/><br/>At this moment, they saw the guardian angel of light and Prince of Fire Phoenix, who were being attacked, emitting bright rays of light!<br/><br/>This light was obviously a powerful trump card they had used!<br/><br/>They had used their trump cards to block eight full-force attacks that were comparable to a peak ruler!<br/><br/>This was equivalent to a four-on-one blow!\t\t\t\t\t\t</div>", "images": {}, "success": true}