{"id": 911, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073722.html", "title": "Chapter 3913 - Chapter 3913: The Fragment Of The 3912 Starfield Appeared And Suppressed The Entire City", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3913 - Chapter 3913: The Fragment Of The 3912 Starfield Appeared And Suppressed The Entire City</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3913: The fragment of the 3912 Starfield appeared and suppressed the entire city<br/><br/>Translator: 549690339<br/><br/>“Starfield fragment, Starfield Spatial Lock, Starfield descent! ”<br/><br/>Wang Xian stared at the two existences who were at the peak of the ruler realm, the angel race and the Phoenix race.<br/><br/>The Great Protector of the radiant angel race, Prince Feng Yin Tian of the Phoenix race.<br/><br/>His words reverberated throughout the entire sky and entered the ears of all the powerful disciples in the Starfield City.<br/><br/>When the last sentence was spoken!<br/><br/>When the starry fragment, the Starfield Space Lock, and the Starfield descended.<br/><br/>Above Wang Xian, a somewhat fragmented starfield appeared!<br/><br/>Yes, it was not a fragmented starfield fragment, but a somewhat fragmented starfield that appeared slowly!<br/><br/>Following that, the entire starfield and the entire world seemed to have undergone a huge change!<br/><br/>All sorts of stars appeared out of thin air in the surrounding starry skies!<br/><br/>There were tens of thousands of stars, and some of them contained incomparably terrifying energy!<br/><br/>This abrupt and bizarre starry world directly enveloped the entire star city within it.<br/><br/>Around the Star City, there were many stars floating in the air.<br/><br/>There were stars that were filled with death.<br/><br/>There were stars that were filled with terrifying flames.<br/><br/>There were also stars that were filled with frost.<br/><br/>Some of the stars seemed like they were about to explode.<br/><br/>Some of the stars looked extremely heavy and kept spinning!<br/><br/>Each of the stars seemed like they were about to destroy the entire Star City!<br/><br/>The sudden change made everyone’s expressions change drastically.<br/><br/>Even the Prince of the Phoenix Clan, Feng Yuntian, and even the great guardian of the Angel of Light, Ayres!<br/><br/>Following Wang Xian’s words, all of them looked at the world that had suddenly changed. Their pupils contracted slightly!<br/><br/>“Huff, Huff, Huff! ”<br/><br/>Rapid sounds came from the starry city.<br/><br/>The powerhouses from the peak races looked at this world and this space in astonishment!<br/><br/>They could sense that any one of the terrifying planets floating around them could turn them into ashes!<br/><br/>In this strange space, they could sense that their lives seemed to be in the hands of others!<br/><br/>“This energy… ”<br/><br/>The pupils of the Magi who were in the seventh stage of the ruler realm narrowed slightly. There was a formation set up by the Magi in the vast starry city.<br/><br/>However, they could sense that the formation they had set up was abnormally weak. It was as It would shatter upon contact!<br/><br/>It was as if they were not of the same level.<br/><br/>“What kind of power is this?”<br/><br/>Feng Yin Tian swept his gaze across his surroundings, and a grave expression instantly appeared in his eyes.<br/><br/>His eyes twitched violently, filled with uneasiness.<br/><br/>Not far from him, there was a blazing star that had an energy that could threaten his life.<br/><br/>Not only that flaming star, but many of the surrounding stars gave him the same feeling.<br/><br/>There were thousands of such stars!<br/><br/>He could block dozens of stars consecutively, but he couldn’t block thousands at all!<br/><br/>(‘I don’t know. This energy is so powerful that it’s terrifying!”<br/><br/>Beside him, the great guardian of the angel race, Archangel Ayres, had an extremely ugly expression on his face as he scanned his surroundings vigilantly!<br/><br/>“Is this the power that the Dragon King of the Dragon Palace makes the entire belief universe and the 24 palaces fear? Is this the true terror of the Dragon King of the Dragon Palace?”<br/><br/>On the city wall of the Star City, an expert of the Divine Tiger Clan, who was at the seventh level of the ruler realm, could not help but roar. His eyes were filled with disbelief, his body trembled slightly. “I feel that I am very small in this space! Very Small! ”<br/><br/>“I have the same feeling. I feel that the stars around me can destroy the entire space city in an instant! ”<br/><br/>A divine tiger beside him roared in agreement. His expression was filled with unease.<br/><br/>“That’s right. If you want to destroy the Space City, I’m afraid that it will only take a single thought from the Dragon King of the Dragon Palace. Is this the dragon king who can make the entire belief universe tremble?”<br/><br/>Not far away, an expert from the witch clan sighed.<br/><br/>“We’ve all seen the strength of the belief universe in the end. Their strength is indeed terrifying. They have 24 palaces and the entire belief universe behind them. However, they immediately fled when they heard the Dragon King’s name. Did they really think that the Dragon King only relied on the ancient god to feed the Kun Master? Just relying on the power of a few peak rulers? No, this should be the true power of the Dragon King of the Dragon Palace! ”<br/><br/>At the Elf tribe, a great elf exclaimed in slight surprise!<br/><br/>Thinking about it from afar, a belief universe that was even more powerful than their nine-origin universe. The entire universe could not do anything to the Dragon King of the Dragon Palace. Could the Dragon King be that simple?<br/><br/>Could it be that the Angel tribe and the Phoenix tribe could deal with him?<br/><br/>“Dragon King of the Dragon Palace, so strong! ”<br/><br/>“So domineering. Is this the power that makes the entire belief universe fear him? So strong indeed. Is this the Dragon King?”<br/><br/>All the powerful disciples of the nine-origin universe around them looked forward in shock.<br/><br/>They looked at that tall figure.<br/><br/>“All Disciples of the Angel Race and Phoenix race, enter the teleportation array!<br/><br/>Archangel Els, the great guardian of the Angel of light, ordered the disciples with a solemn expression.<br/><br/>He held the scepter of light in his hand and his face was full of vigilance!<br/><br/>“Yes, yes!”<br/><br/>The powerhouses of the Angel Race and Phoenix race also had a trace of fear and dread on their faces.<br/><br/>They immediately flew towards the teleportation array.<br/><br/>The teleportation array was located in the center of the Giant Star City.<br/><br/>However, they were already in the giant star city, so the distance wasn’t very far.<br/><br/>A group of level seven masters arrived at the teleportation formation in the blink of an eye.<br/><br/>They looked at the figure of the Dragon King deeply, revealing a trace of fear and dread, and directly stepped into the teleportation formation!<br/><br/>However, the teleportation formation didn’t teleport them to the location of the nine origin universe passage.<br/><br/>They still stood there.<br/><br/>“Lord Protector, the teleportation array is useless. It’s useless! ” The level 7 ruler-level Archangel couldn’t help but exclaim.<br/><br/>His terrified voice echoed in the eyes of everyone!<br/><br/>All the experts and disciples in the starry city looked over, and shock appeared on their faces once again.<br/><br/>“The teleportation array can’t even be used? What kind of seal is this? It can actually render the teleportation array ineffective?”<br/><br/>A powerful wizard from the Wizard clan could not help but exclaim in surprise.<br/><br/>The teleportation array was set up by their wizard clan, and they had a very deep understanding of teleportation arrays.<br/><br/>But now, the teleportation array was actually ineffective!<br/><br/>“Damn it! ”<br/><br/>Archangel els’expression changed slightly, and he had a bad premonition in his heart!<br/><br/>“I believe in the 24 palaces of the universe. I have destroyed the power of five to six palaces. Of course, I have been trapped in a space like this for more than 30 million years. In the space of the star field, no one can leave!”<br/><br/>Wang Xian looked in the direction of the giant city in the starry sky and said faintly.<br/><br/>This was the power of the space lock in the star field..\t\t\t\t\t\t</div>", "images": {}, "success": true}