{"id": 913, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073726.html", "title": "Chapter 3915 - Chapter 3915: No. 3914, The Pinnacle Of The Overlords, Invincible! Down", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3915 - Chapter 3915: No. 3914, The Pinnacle Of The Overlords, Invincible! Down</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3915: No. 3914, the pinnacle of the Overlords, Invincible! Down<br/><br/>Translator: 549690339<br/><br/>Boom! Boom! Boom<br/><br/>A terrifying energy rose in front of the huge city in the starry sky.<br/><br/>Blazing Flames and the power of light emitted a luster and shot out in all directions.<br/><br/>It was as if they wanted to break free from the darkness and welcome the future.<br/><br/>At the center, a furious roar sounded!<br/><br/>“It’s easy to fight against two experts at the pinnacle of the Overlords. It shouldn’t be a problem for three of them. As for four of them, Pm afraid it’s going to be a little difficult!”<br/><br/>Wang Xian hovered in the air quietly as he looked at the situation in front of him. He mumbled to himself!<br/><br/>As for fighting against two masters at the peak of the ruler realm, he was still very confident.<br/><br/>Currently, he could mobilize eight stars at one go.<br/><br/>Eight stars attacking two to three masters at the peak of the ruler realm could cause a fatal crisis to them.<br/><br/>The energy in his body could mobilize hundreds of stars in total, and he could mobilize dozens of such attacks!<br/><br/>Therefore, killing two or three peak ruler realm experts wasn ‘t a big problem!<br/><br/>If Peak ruler realm experts had fewer trump cards and weaker treasures, he could kill four or five of them.<br/><br/>Of course, experts at this level must have great opportunities, and they all had a lot of treasures in their hands!<br/><br/>“What’s going on? What happened in the Starry City?”<br/><br/>(‘I don’t know, I don’t know. Something seems to have happened. What the hell is going on?”<br/><br/>“Calm down. Prince Feng Yuntian of our Phoenix clan is very powerful. Even if the Dragon King still has a trump card, Prince Feng Yuntian and guardian Ayres of the Angel clan will be able to withstand it. ”<br/><br/>At the same time, at the location of the nine origin universe passage, when the star field descended and covered a space, the scene on their side became blurry and they couldn’t see anything clearly.<br/><br/>This made the expressions of the experts of the Angel clan and Phoenix clan turn ugly!<br/><br/>It was obvious that the Dragon King of the Dragon Palace still had a trump card.<br/><br/>This made them feel uneasy!<br/><br/>“The Dragon King of the Dragon Palace is really strong. After this battle, the strength of the Dragon Palace can not be underestimated by any race! ”<br/><br/>“That’s right. The Dragon King’s strength is 100% comparable to a peak ruler.<br/><br/>As for how strong He is, we don’t know. But this time, the angel race and the<br/><br/>Phoenix race made the wrong choice! ”<br/><br/>The experts of the other peak races said when they saw this scene.<br/><br/>Their faces were also filled with astonishment.<br/><br/>Although the Dragon Palace had the Dragon King and the ancient god Kun feeding master, their foundations were still too weak!<br/><br/>But now, there were more than 170 level seven sovereigns, and there was also a dragon king at the peak of the sovereign realm!<br/><br/>The Dragon Palace’s strength was close to the peak races that had developed for 10-20 billion years!<br/><br/>They could not help but sigh!<br/><br/>“Hehe, they actually blocked the attack. Not Bad! ”<br/><br/>At this moment, in front of the starry city, the attack of the eight stars was blocked by the Fire Phoenix, Prince Yin Tian, and the guardian of the Radiant Angel, Ayres.<br/><br/>The two of them leaned against each other. Their expressions were extremely ugly and they looked slightly disheveled.<br/><br/>They stared at Wang Xian and looked at the stars around them warily. They were panting heavily!<br/><br/>At this moment, they were feeling a little terrified!<br/><br/>The Dragon King of the Dragon Palace had made them use most of their trump cards with just a casual attack.<br/><br/>What about the next attack?<br/><br/>“Prepare to receive the second round of Attack! ”<br/><br/>At this moment, what they had expected was about to happen.<br/><br/>They saw the Dragon King of the Dragon Palace wave his arm once again, and the eight stars in the surroundings seemed to come alive. They brought with them a terrifying power as they attacked them again.<br/><br/>It was still eight stars, similar to the power of the Barker Star just now! When they saw these eight stars, their expressions became extremely ugly!<br/><br/>“Defend! ”<br/><br/>“At most, we can defend this time! ”<br/><br/>Feng Yin Tian and Ayres looked at each other and immediately roared in a low voice!<br/><br/>They once again set up their defenses.<br/><br/>Their wings and wings covered their bodies, and their bodies once again emitted light!<br/><br/>In the sky above Feng Yin Tian, the phantom image of a fire Phoenix appeared. Beside the Phantom image of the Fire Phoenix, there was also an enormous parasol tree!<br/><br/>Boom! Boom! Boom<br/><br/>However, at this moment, the attacks of the eight stars were extremely fast. They surrounded them and attacked.<br/><br/>The sound of fierce collisions rang out once more.<br/><br/>“This… is another round of terrifying attacks. Can the two peak ruler-level existences of the Phoenix clan and the Angel clan block them?”<br/><br/>“Look at how pathetic they are against the first round of attacks. I’m afraid that they won’t be able to block the second round! ”<br/><br/>“That’s the same principle of the Phoenix clan. The Phoenix clan is famous for their defensive abilities. ”<br/><br/>“The Dragon King’s strength is really terrifying. Look at him standing there. He can unleash such a terrifying attack with just a casual move. It’s obvious who’s superior. ”<br/><br/>“Will a peak ruler fall today?”<br/><br/>In the vast starry city, all the strong disciples looked at this scene with shock on their faces!<br/><br/>The appearance of the Prince of the Phoenix clan and the Guardian Angel of light had already shocked them.<br/><br/>However, the Dragon King of the Dragon Palace was even more terrifying.<br/><br/>It even seemed too easy for him to fight against two at the same time.<br/><br/>It felt like they were not on the same level.<br/><br/>“Once these two existences of the Phoenix clan and the Angel clan are no match for the Dragon King, I’m afraid that blood will flow like a river! ”<br/><br/>An expert at the seventh level, who was the ruler of a peak race, glanced at all the powerful disciples of the Phoenix clan and the Angel clan, whose faces were filled with fear, and muttered.<br/><br/>“CHIRP CHIRP CHIRP! ”<br/><br/>“Roar Roar!”<br/><br/>At this moment, in front of them, in the center of the battlefield, the angry roars of Prince Phoenix Yin Tian and great protector Ayres could be heard once again.<br/><br/>The eight stars slowly collapsed and their figures slowly appeared once again.<br/><br/>However, at this moment, what shocked everyone was that one of Prince Phoenix Yin Tianhuo’s phoenix wings had been broken. He looked extremely miserable!<br/><br/>Great Protector Ayres ‘situation was also not optimistic. His few angelic wings had actually dimmed, as if they had lost their vitality.<br/><br/>The corner of his mouth was also filled with blood!<br/><br/>“If you don’t have any trump cards, you can die! ”<br/><br/>Wang Xian looked at their situation and spoke indifferently!<br/><br/>“Huff! Huff! ”<br/><br/>Prince Phoenix Yin Tianhuo and Great Protector Ayres looked fearful. They looked at Wang Xian with a hint of fear.<br/><br/>They knew that they were no match for the Dragon King of the Dragon Palace.<br/><br/>In fact, they might even die at the hands of the Dragon King of the Dragon Palace today!<br/><br/>“Let’s Go! ”<br/><br/>However, what happened next stunned all the powerful disciples of the nine-origin universe.<br/><br/>Guardian eles fled into the distance.<br/><br/>Feng Yin Tian, Fire Phoenix, took out a treasure and threw it forward.<br/><br/>In front of him, appeared a door..\t\t\t\t\t\t</div>", "images": {}, "success": true}