{"id": 921, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073742.html", "title": "Chapter 3923 - Chapter 3923: 3,922 Swords And The Magical Universe", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3923 - Chapter 3923: 3,922 Swords And The Magical Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3923: 3,922 swords and the magical universe<br/><br/>Translator: 549690339<br/><br/>Other than the essence blood of the five divine dragons and a wisp of dragon soul, the rest of the treasures were relatively ordinary.<br/><br/>To Wang Xian’s current strength, there wasn’t much of a change.<br/><br/>However, the number of resources and treasures in the Dragon Palace’s treasure vault was still extremely terrifying!<br/><br/>A sword technique cultivated by a heaven’s origin creator.<br/><br/>A Heaven’s origin jade horn.<br/><br/>A Dragon Pearl with space attributes.<br/><br/>A Heaven’s origin creation fragment and the book of water curse.<br/><br/>Each of the four treasures was extremely powerful and could attract the attention of the top races.<br/><br/>Each of them was comparable to the starfield fragment in his hands.<br/><br/>These were all the treasures left behind by the Divine Dragon Clan.<br/><br/>There were not many treasures, but they were of high value.<br/><br/>In fact, the real treasure left behind by the Divine Dragon Clan was Wang Xian’s divine dragon system.<br/><br/>It was the extremely terrifying ancestral tree.<br/><br/>This was a world-shaking treasure that could cause the peak races to go all out, even to the point of extinction.<br/><br/>“According to Sir Water Divine Dragon, this dragon gate can withstand the attack of the Heaven’s origin creation. Doesn’t that mean that the disciples of the Dragon Palace can also cultivate here? The resources and energy here are only slightly inferior to the Dragon Palace. ”<br/><br/>Wang Xian put away the treasures and revealed a deep smile on his face.<br/><br/>The Divine Dragons had left him many treasures.<br/><br/>Shifting his gaze, Wang Xian landed in the center.<br/><br/>It was the entrance of an energy vortex that was a hundred meters wide.<br/><br/>The white energy vortex contained a very strange energy.<br/><br/>Wang Xian’s mind moved and landed on the white energy vortex. A stream of information left by Sir Water God Dragon entered Wang Xian’s mind.<br/><br/>“This… is actually a passageway of the universe. ”<br/><br/>Wang Xian’s pupils dilated slowly. His face was filled with shock.<br/><br/>Yes, behind this White Energy Whirlpool was a universe.<br/><br/>A universe called sword and magic.<br/><br/>Sword and magic sounded very low-level. It was like a low-level martial arts world that could be destroyed with a snap of a finger.<br/><br/>But in fact, this was not the case. This universe was not weak.<br/><br/>There were even heaven origin creation powerhouses in the universe.<br/><br/>This universe was slightly different from the nine origin universe, because this universe was round and square.<br/><br/>Yes, the sky was round and had an end.<br/><br/>The ground was square and divided into north, south, east, west, and north!<br/><br/>There was no starry sky.<br/><br/>But this sword and magic universe were also very vast.<br/><br/>There were many races living on the endless continent.<br/><br/>The main cultivation here was sword and magic.<br/><br/>Sword, one sword could break mountains and rivers, one sword could break the heavens.<br/><br/>Magic, no eggs under the forbidden spell.<br/><br/>One sword could destroy a country.<br/><br/>One forbidden spell could destroy a city.<br/><br/>In short, this sword and magic universe was very powerful and terrifying.<br/><br/>In addition, this universe contained the spatial attribute, and this spatial attribute was already under their control.<br/><br/>A powerful knight swordsman could take down a powerful enemy millions of miles away with a single strike.<br/><br/>It was extremely terrifying to be beheaded in an instant!<br/><br/>This was the space attribute.<br/><br/>In the legends on Earth, there was a saying that space was the king and time was the sovereign!<br/><br/>The space attribute was extremely terrifying.<br/><br/>As for the time attribute, according to Wang Xian’s understanding, it was irreversible.<br/><br/>While time could not be controlled, space could.<br/><br/>The Void Universe, the void race. Their strength lay in their control over space.<br/><br/>This was also the reason why the Void Race was able to fight against the nine-origin universe.<br/><br/>One must know that the nine-origin universe had nine attributes.<br/><br/>The main reason was that the advantage of the space attribute was too great.<br/><br/>If one could not beat them, they would flee. If they could beat them, they would<br/><br/>basically be killed in an instant.<br/><br/>If they teleported over, they would be killed before they could react.<br/><br/>From this whirlpool, he could enter the universe of swords and magic.<br/><br/>Wang Xian’s eyes flickered as he looked at this whirlpool.<br/><br/>This was a universe.<br/><br/>If he entered, he might be able to find a large number of treasures.<br/><br/>He might be able to obtain a large number of resources.<br/><br/>All of these were possible!<br/><br/>Wang Xian sized it up and didn’t enter.<br/><br/>Even if he entered, he had to wait for Wang Xian to successfully refine the Heaven’s origin jade horn. He had to wait for Wang Xian’s strength to break through!<br/><br/>He still had a lot of resources that could allow him to advance by two levels again.<br/><br/>With a move, Wang Xian took a look around the surrounding palaces. He did not find anything else.<br/><br/>“In the future, let’s treat this place as the base of our Dragon Palace in the nine-origin Universe! ”<br/><br/>Wang Xian scanned the surroundings and revealed a smile.<br/><br/>Now, he also understood why that Dragon Gate was so sturdy and could withstand an attack of the heaven’s origin level.<br/><br/>That was because the once divine dragon clan had used a special method to draw the energy of the sword and the magic universe into this space.<br/><br/>This space seemed to have a part of the nine-origin universe and another part of the sword and the magic universe.<br/><br/>The energy of the sword and the magic universe was filled with the energy of the Dragon Gate outside.<br/><br/>This was like a cosmic barrier.<br/><br/>To break through the Dragon Gate, it was equivalent to breaking through the passage of the universe.<br/><br/>This wasn’t that easy.<br/><br/>The reason why the nine-origin universe could be opened was because the space beasts in the land of mountains and seas were part of the starry universe, and they could sense the existence of the starry universe.<br/><br/>Otherwise, unless several heavenly creations simultaneously searched for precise coordinates and opened it at the same time, it would be possible.<br/><br/>It was just like the belief universe.<br/><br/>Therefore, this place was extremely safe. No matter how the Angel Race and Phoenix race tried to break through, they would not be able to do so!<br/><br/>“Now, it’s time to increase my strength. I will refine the Heaven’s origin jade horn and the book of Water Curse. ”<br/><br/>Wang Xian’s eyes sparkled.<br/><br/>Once the refinement was completed, Wang Xian would be an invincible existence to the strong disciples of the belief universe and the nine-origin universe.<br/><br/>Even if the Tianyuan destiny of the nine-origin universe enters the starry universe, Wang Xian should be able to touch it.<br/><br/>Provided, of course, they don’t have a treasure like the Jade Horn of Tianyuan.<br/><br/>“Choo Choo Choo! ”<br/><br/>“Boom, Boom, Boom! ”<br/><br/>Just when Wang Xian was reaping a bunch of treasures, at the same time, around the Divine Dragon Island, two extremely terrifying auras were flying towards him.<br/><br/>The phoenixes were emitting cold and terrifying Phoenix cries.<br/><br/>The Angels were flapping their twelve wings and emitting a murderous aura.<br/><br/>The powerhouses of the two peak races were led by the King of Light Angels, the King of Darkness Angels, and the three kings of the Phoenix clan.<br/><br/>The group of elders of the Phoenix Angel clan who were in the level nine realm.<br/><br/>The group of powerhouses who were in the level eight realm.<br/><br/>The weakest one was also in the level eight realm.<br/><br/>They flew to the sky above the Divine Dragon Island and looked down with cold eyes!<br/><br/>Even further away, there was a pair of eyes looking at them.<br/><br/>A pair of bright eyes seemed to be able to see through everything!<br/><br/>“Damn it, there is no more life on the Divine Dragon Island. The disciples of the Dragon Palace have escaped! ”<br/><br/>The king of Dark Angels stared down with his shining black pupils.<br/><br/>His expression was cold, and as he spoke, his pupils shone with a blood-red light.<br/><br/>This blood-red light directly attacked downwards..\t\t\t\t\t\t</div>", "images": {}, "success": true}