{"id": 926, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073752.html", "title": "Chapter 3928 - Chapter 3928: 3927 Entered The Sword And Magic Universe", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3928 - Chapter 3928: 3927 Entered The Sword And Magic Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3928: 3927 entered the sword and Magic Universe<br/><br/>Translator: 549690339<br/><br/>“I’ll cultivate here for a period of time First! ”<br/><br/>Wang Xian stood in the Void Pagoda and felt the energy in the body of the Void<br/><br/>Dragon. He made a slight decision in his heart!<br/><br/>This body of the Void Dragon was different from his original body.<br/><br/>Due to its uniqueness, the body was formed from the power of space. Therefore, the energy was somewhat incompatible with the nine attributes in his body.<br/><br/>Unlike the other nine attributes in his body, metal, wood, water, fire, Earth, wind, lightning, and darkness could be converted.<br/><br/>The inability to convert resulted in the improvement of the space attribute. He could only cultivate it through himself.<br/><br/>Even if Wang Xian’s level increased again, the space attribute would remain unchanged!<br/><br/>Wang Xian would need to spend a lot of time to improve the power of space.<br/><br/>Now, Wang Xian had reached a bottleneck in obtaining the resources to improve. Therefore, he did not need to waste his time on other aspects.<br/><br/>On the contrary, he could properly cultivate the space power.<br/><br/>Having made up his mind, Wang Xian began to cultivate in the void pagoda.<br/><br/>There was sufficient space power in the Void Pagoda to allow him to improve tremendously.<br/><br/>Time passed by quickly. Tens of millions of years passed by quickly.<br/><br/>Buzz<br/><br/>Wang Xian stood up and felt the power in his body. He frowned slightly.<br/><br/>Over ten million years of time had only allowed him to reach the level of the Eternal Divine Lord. This speed was too slow for Wang Xian!<br/><br/>He had never cultivated so slowly before.<br/><br/>One must know that in the past, Wang Xian had cultivated to the peak of the supremacy level in over ten million years.<br/><br/>“He couldn’t make a breakthrough directly by devouring treasures.<br/><br/>Furthermore, every breakthrough in the space attribute was a little difficult. That was why he took more than 10 million years to break through to the current stage. ”<br/><br/>Wang Xian spoke.<br/><br/>There was another reason, and that was that Wang Xian didn’t have a cultivation method for the space attribute.<br/><br/>He had to rely on himself to explore and comprehend.<br/><br/>This was similar to a mortal who possessed the ability to absorb the power of space. However, he didn ‘t know anything else and only knew to bite the bullet and absorb it.<br/><br/>When one encountered a bottleneck, one had to comprehend and figure out the direction on their own.<br/><br/>It was fortunate that Wang Xian’s current realm was relatively high. He was able to find the direction and achieve a rapid breakthrough.<br/><br/>If it was a mortal, he might still be trapped in the realm of a god for more than 10 million years.<br/><br/>This was the reason why there was no cultivation method.<br/><br/>In the universe, the experts on many planets had lived for more than 10 million years. They weren’t even able to cultivate to the level of an eternal God Lord.<br/><br/>This was the effect of the cultivation method.<br/><br/>As for an lie, due to his special characteristics, he didn’t have many uses for space.<br/><br/>What he was best at now was sneak attacks and instant kills!<br/><br/>He really didn’t have any powerful means.<br/><br/>Therefore, he couldn’t teach Wang Xian this.<br/><br/>“Looks like I have to think of another way! ”<br/><br/>Wang Xian thought to himself. If he could raise the power of space to the level of a ruler at level five or six, then Wang Xian’s strength would be even more terrifying!<br/><br/>Should I go to the Sword and Magic Universe<br/><br/>Wang Xian had a thought and an idea appeared in his mind.<br/><br/>The Sword and Magic Universe had a passageway in the treasure vault of the Divine Dragon Clan. One could enter it directly.<br/><br/>Entering an unfamiliar universe was both a crisis and an opportunity.<br/><br/>However, an opportunity was greater than a crisis!<br/><br/>Especially when Wang Xian had the heaven’s origin jade horn.<br/><br/>Without the existence of the Heaven’s origin destiny to personally spy on Wang Xian, there was no way to discover his secret.<br/><br/>One would think that he was an expert from the sword and Magic Universe.<br/><br/>With Wang Xian’s current combat strength, it was easy for him to enter and search for opportunities.<br/><br/>The only thing that could suppress him was the Heaven ‘s origin destiny.<br/><br/>As for the rest, it was nothing!<br/><br/>The Sword and Magic Universe possessed the spatial attribute. Therefore, one could enter and search for the cultivation method of the spatial attribute!<br/><br/>Even if one cultivated in seclusion here for 100 million years, they would not be able to reach the realm of a universe knight!<br/><br/>After making up his mind, Wang Xian immediately made preparations.<br/><br/>He stepped into a new universe!<br/><br/>At present, the starry universe had settled down. On the side of the nine-origin universe, the Phoenix clan and the Angel clan could only be helpless and furious!<br/><br/>The Dragon Palace was developing steadily at a terrifying speed!<br/><br/>In addition, Lan Qingyue and the rest had already broken through. The strength of a ruler in the eighth level was enough to solve most of the problems.<br/><br/>Wang Xian asked an lie to bring him to the Dragon Palace.<br/><br/>In the following period of time, he played and rested with the group of Dragon Queens for a hundred years. After that, they came to the treasure vault of the Divine Dragon Clan!<br/><br/>“The universe of Swords and Magic! ”<br/><br/>Wang Xian stood under the vortex and sized it up with a twinkle in his eyes.<br/><br/>This was an unfamiliar universe. Wang Xian had no idea what would happen if he entered it!<br/><br/>He looked at an lie who was at the side and nodded at him.<br/><br/>Following that, Wang Xian and an lie entered the vortex directly!<br/><br/>Buzz<br/><br/>When Wang Xian stepped into the Vortex, the jade horn on his head emitted a luster and enveloped his entire body!<br/><br/>Following that, an unfamiliar aura surged over.<br/><br/>It was unfamiliar because he was unfamiliar with this world.<br/><br/>Wang Xian was not unfamiliar with the energy here.<br/><br/>The energy was almost similar to the nine-origin universe. Metal, wood, water, fire, Earth, wind, lightning, light, darkness, and space attributes!<br/><br/>Other than this, there were some other energies.<br/><br/>Under the sensing of Wang Xian ‘s powerful energy, this energy was somewhat sharp and sharp. It was very peculiar.<br/><br/>Every universe had its own characteristics.<br/><br/>It was the same in the starry universe, as well as the sword and Magic Universe!<br/><br/>Buzz<br/><br/>The scene around him changed drastically. The scene in front of him changed drastically. A desolate desert that stretched as far as the eye could see appeared in his line of sight.<br/><br/>At the same time, his mind stirred. A special memory appeared in his mind. This memory was like a coordinate.<br/><br/>This coordinate was the position he occupied when he came out. He looked behind him, which was the position he came out from.<br/><br/>“This is the chaotic space of nothingness!”<br/><br/>Wang Xian looked behind him. The position behind him was the same as the edge of the nine-origin universe in the starry universe!<br/><br/>There was no energy, no life, and nothing in the chaotic space!<br/><br/>Once one entered, even a powerhouse at the peak of the ruler realm would not live for long!<br/><br/>This was the end of a universe!<br/><br/>According to the information left behind by the Divine Dragon Clan, there was no starry sky in this sword and magical universe.<br/><br/>The sky was round and the Earth was square.<br/><br/>It was a vast and incomparably vast continent, an immeasurable and endless land!<br/><br/>The end was the end of this chaotic universe!<br/><br/>“The universe is really magical. It’s hard to imagine how deep the land under my feet is. ”<br/><br/>Wang Xian mumbled as he looked forward again.<br/><br/>“Dragon King, the spatial energy in this universe is a thousand times more than that of our nine-origin universe. It’s too dense!”<br/><br/>From the side, an Lie’s eyes lit up as he surveyed his surroundings. “The density of the spatial energy here is only slightly less than that of the Void Universe! ”<br/><br/>An lie could teleport to the location of the demonic spirit altar. In an Lie’s mind, there were many coordinates of the demonic spirit altar.<br/><br/>He had once been to an unfamiliar place.. Now, he could confirm that it was the void universe!\t\t\t\t\t\t</div>", "images": {}, "success": true}