{"id": 922, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073744.html", "title": "Chapter 3924 - Chapter 3924: 3923 Had Leveled Up Two Levels In A Row!", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3924 - Chapter 3924: 3923 Had Leveled Up Two Levels In A Row!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3924: 3923 had leveled up two levels in a row!<br/><br/>Translator: 549690339<br/><br/>“BZZT BZZT BZZT BZZT!”<br/><br/>The blood-red light of the pupils landed on the Dragon God Island, and a large area of buildings collapsed under the attack of the King of Dark Angels.<br/><br/>It was the fury of a peak-level ruler.<br/><br/>The violent attacks and the terrifying red light of the pupils were like lasers, wreaking havoc on the entire dragon God Island!<br/><br/>“CHIRP CHIRP CHIRP! ”<br/><br/>“Kill the disciples of the Phoenix Clan, Dragon Palace, you just wait for the<br/><br/>Phoenix Clan! ”<br/><br/>At the side, a group of phoenixes dove down.<br/><br/>Flames, golden lights, and waves rushed towards the buildings on the Divine Dragon Island.<br/><br/>Terrifying energy raged, and the buildings on the Divine Dragon Island quickly collapsed.<br/><br/>Apart from the grotto-heaven paradise being blocked by the powerful energy, the rest of the place was destroyed!<br/><br/>In front of the Dragon Palace’s treasury, it was completely ruined.<br/><br/>However, looking down from the sky, one could see that the Dragon Gate was still standing on the Divine Dragon Island, unmoving!<br/><br/>“What is that place?”<br/><br/>An expert from the Angel clan stared at the Dragon Gate and frowned slightly.<br/><br/>“It’s said to be the Dragon Palace’s treasury, but this treasury can’t be opened at all!<br/><br/>An expert of the Phoenix clan replied.<br/><br/>“It can’t be opened?”<br/><br/>The King of angels of Light’s gaze also landed on the Dragon Gate.<br/><br/>To be able to make the experts of the Phoenix clan say that it could not be opened, then they must have used all their strength.<br/><br/>It really could not be opened!<br/><br/>“Has the Dragon Palace opened this place? Is it possible that they are hiding inside? y,<br/><br/>The King of Angels of Darkness moved and landed in front of the Dragon Gate as he asked.<br/><br/>“The Phoenix clan doesn’t know about this, but the possibility of the Dragon Palace opening it is very high! ”<br/><br/>An expert of the Phoenix clan said in a deep voice!<br/><br/>His words made the expressions of the surrounding experts turn ugly!<br/><br/>“I’m going to suppress this place. Pm going to turn this place into a death zone !<br/><br/>The King of Light Angels said with a grim expression.<br/><br/>The three kings of the Phoenix clan nodded coldly from the side.<br/><br/>They wanted to turn this place into a dead zone. Once they entered this place, they would be subjected to the most terrifying attack!<br/><br/>(‘Hehe. the Dragon Palace will remember today’s grudge!”<br/><br/>At the same time, what the experts of the Phoenix clan and the Angel clan didn’t know was that there was a pair of eyes staring at them from the back of the Dragon Gate.<br/><br/>At this moment, Wang Xian had completely mastered the Dragon Gate and this space.<br/><br/>He could easily open the Dragon Gate and also close it!<br/><br/>When the powerhouses from the Angel clan and the Phoenix clan arrived, Wang Xian had already sensed something!<br/><br/>He could even hear their conversation!<br/><br/>Was he going to turn this place into a dead zone?<br/><br/>“It’s a pity that I haven’t upgraded yet. If I do, I can launch a sneak attack and kill one or two experts at the peak of the ruler realm. ” Wang Xian’s eyes flickered.<br/><br/>He didn’t pay attention to the situation outside.<br/><br/>The experts from the angel race and the Phoenix race couldn’t break through the Dragon Gate. They were 100% safe here.<br/><br/>Although they wanted to turn this place into a dead zone, the area they covered wasn’t as wide as the dark intense teleportation!<br/><br/>Furthermore, they wanted to leave this place through the demonic spirit altar.<br/><br/>Secondly, they wanted to use their energy to turn this place into a dead zone. As long as Wang Xian made a breakthrough, Wang Xian would still be able to move around in this dead zone!<br/><br/>When the time came, he would be able to rely on the two heaven’s origin creation fragments and his own strength. He would not be afraid at all!<br/><br/>He might even be able to break this dead zone!<br/><br/>As he thought to himself, Wang Xian and the rest set up a devil spirit altar here. Then, an lie brought him back to the Dragon Palace.<br/><br/>The last time, the Phoenix clan and the Angel clan bowed to the Dragon Palace and gave them a lot of resources.<br/><br/>These resources were placed in the Dragon Palace!<br/><br/>Wang Xian was about to return to the Dragon Palace and begin his breakthrough!<br/><br/>Tens of millions of years had passed. Now that he had the heaven origin jade horn, he could finally advance without any scruples!<br/><br/>After Wang Xian arrived, he immediately came to the Dragon King’s Hall.<br/><br/>At this moment, the Dragon King’s Hall was filled with a large number of resources and treasures.<br/><br/>“Dragon King! ”<br/><br/>“Xiao Xian! ”<br/><br/>When Prime Minister Lan Qingyue saw Wang Xian, she smiled.<br/><br/>“Have you dealt with the situation at the Starry City?”<br/><br/>Wang Xian asked them.<br/><br/>“I’ve dealt with it. Xiao Xian, how is the Divine Dragon Island?”<br/><br/>Lan qingyue nodded and looked at him as she asked.<br/><br/>“The Treasury has been opened and we have gained a lot. In addition, the Divine Dragon Island has been attacked by the angel and Phoenix clans. However, there is another paradise in the treasury of the Dragon Palace. You guys can go there and take a look. ”<br/><br/>Wang Xian smiled and said, “This time, I have to increase my strength first. In addition, I have to refine two treasures. Prime Minister Gui, you will distribute the resources obtained this time. In addition, Xiao Lan and the rest have absorbed the two corpses at the peak of the ruler realm. It should be able to help Xiao Lan and the rest improve! ”<br/><br/>“It’s the Dragon King! ”<br/><br/>Prime Minister Gui nodded his head.<br/><br/>After chatting for a while, Wang Xian immediately transformed into the body of a divine dragon.<br/><br/>He stared at the resources in front of him and began to devour them immediately.<br/><br/>A large amount of resources were being absorbed rapidly by him.<br/><br/>At the same time, the Dragon Qi in his body was also increasing at a crazy rate.<br/><br/>Time passed by quickly.<br/><br/>When Wang Xian was making his breakthrough, the entire communication stone plate and the universe’s artificial intelligence brain in the nine-origin universe were boiling with excitement.<br/><br/>The battle between the Dragon Palace and the Phoenix Clan’s Angel clan was earth-shattering.<br/><br/>At the same time, the Dragon King’s strength shocked all the living beings!<br/><br/>All the living beings were discussing and exclaiming in amazement.<br/><br/>However, Wang Xian did not know about all of this.<br/><br/>“Ding, Congratulations to host for increasing your level. You have broken through to the third level of the Universe Overlord.”<br/><br/>“Ding, Congratulations to host for your breakthrough. The nine-origin dragon domain has become stronger.”<br/><br/>A few thousand years later, the system’s voice rang out. A terrifying dragon aura surged out in all directions.<br/><br/>Wang Xian’s strength had achieved a breakthrough!<br/><br/>His strength was comparable to an expert who was at the eighth level of the ruler of the universe.<br/><br/>How strong would he be if he were to borrow the fragment of the Starfield?<br/><br/>This required Wang Xian to verify it.<br/><br/>However, it was obvious that he did not have the time to verify it.<br/><br/>The breakthrough continued!<br/><br/>The remaining resources were sufficient to support him to achieve another breakthrough!<br/><br/>Thousands of years passed quickly.<br/><br/>“Ding, congratulations to host for increasing your level. You have broken through to the level four realm of a universe overlord. ”<br/><br/>“Ding, congratulations to host for achieving a breakthrough. The nine origins dragon field has become stronger. ”<br/><br/>The system’s voice appeared in his mind once again.<br/><br/>Boom Boom Boom<br/><br/>Wang Xian’s body erupted with an extremely vast energy once again.<br/><br/>This energy even caused the entire Dragon Palace to tremble!<br/><br/>The nine-colored energy circulated throughout his body.<br/><br/>The five elements fused together, light and darkness interweaved, wind and thunder revolved!<br/><br/>A vast and majestic aura shot out from his body!<br/><br/>Wang Xian slowly opened his eyes and clenched his Dragon Claw.<br/><br/>The nine attributes circulated and were filled with a terrifying aura!<br/><br/>Every action carried a huge amount of power.<br/><br/>“I’m a level four universe overlord, comparable to a level nine overlord. With the star field fragment, how strong Am I Now?”<br/><br/>He opened his mouth and asked in a low voice..\t\t\t\t\t\t</div>", "images": {}, "success": true}