{"id": 925, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073750.html", "title": "Chapter 3927 - Chapter 3927: 3926 Void Dragon", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3927 - Chapter 3927: 3926 Void Dragon</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3927: 3926 void Dragon<br/><br/>Translator: 549690339<br/><br/>The Void Dragon Pearl was created a few eons ago by the previous generation of Heavenly Yuan Destiny realm experts of the Divine Dragon Clan.<br/><br/>Furthermore, it was created together with other heavenly yuan destiny realm experts..<br/><br/>However, it didn’t succeed.<br/><br/>Even if it failed, this void Dragon Pearl had always been kept in the Divine Dragon Clan’s treasury.<br/><br/>It was kept as the most precious treasure.<br/><br/>The Divine Dragon Clan’s Last Heavenly Fate Water Divine Dragon believed that the reason why the Void Dragon Pearl couldn’t be cultivated was because it couldn’t give birth to life.<br/><br/>It couldn’t give birth to wisdom.<br/><br/>In fact, the heavenly fate experts had terrifying creative powers.<br/><br/>They could create a whole new race.<br/><br/>The reason why they didn’t succeed was because the creature they created was too powerful.<br/><br/>It was like how a powerhouse from the Heaven’s origin realm could easily create a high-level race.<br/><br/>However, it would be difficult for him to create a peak race.<br/><br/>He could at most create a few or even a dozen existences that were comparable to a divine dragon.<br/><br/>It would be difficult to create a large-scale one.<br/><br/>However, it would be even more difficult if they wanted to create a mutated divine dragon. It was impossible.<br/><br/>The Void Divine Dragon was an existence that the Heaven’s origin creator wanted to create.<br/><br/>However, it was a pity that it was not that easy to create a mutated divine dragon.<br/><br/>This was especially so for an existence where space was king.<br/><br/>Hence, it had never succeeded.<br/><br/>The previous generation of the Heaven’s origin creator Water Divine Dragon had guessed that the energy of the ancestral tree would allow the void dragon bead to be completely nurtured.<br/><br/>Of course, this was just a guess.<br/><br/>At this moment, Wang Xian looked at the scene in front of him with a hint of anticipation in his eyes.<br/><br/>A few heavenly water divine dragons had been created together. There were void divine dragons that had yet to be nurtured even after several eons.<br/><br/>Now, it seemed that they were about to be born!<br/><br/>In the dragon bead above, there was a tiny embryo of a divine dragon that was like a fossil. At this moment, it seemed to have a life of its own!<br/><br/>Crack! Crack<br/><br/>Slowly, cracks started to appear on the entire Dragon Pearl. The tiny divine dragon inside opened its mouth and ate all the energy in the Dragon Pearl!<br/><br/>Crack! Crack! Crack<br/><br/>Crack! Crack<br/><br/>As time passed, the tiny divine dragon crawled out of the Dragon Pearl. It opened its mouth and continued to devour the outer shell of the dragon pearl.<br/><br/>At this moment, Wang Xian suddenly had a vague feeling that surged into his heart.<br/><br/>“What is this feeling?”<br/><br/>Wang Xian’s mind stirred as he stared at the Divine Dragon.<br/><br/>The Divine Dragon stopped devouring and shook his head. Then, he looked at Wang Xian.<br/><br/>Then, he blinked his eyes and continued to devour.<br/><br/>Buzz Buzz<br/><br/>As the Divine Dragon devoured the entire dragon bead, his body size became about one meter.<br/><br/>He still looked extremely weak.<br/><br/>However, at this moment, some information appeared in Wang Xian’s mind. It was about the usage of some special energy.<br/><br/>With a thought, the tiny divine void dragon in front of him moved and instantly appeared in front of Wang Xian. It entered his body directly.<br/><br/>This divine void Dragon seemed to have no physical body.<br/><br/>“Indeed, it doesn’t have a physical body. It’s like a void dragon formed by the power of space. This void dragon is not an individual, but a part of my body. ”<br/><br/>Wang Xian mumbled.<br/><br/>Yes, this effective void Dragon had already become a part of his body.<br/><br/>In the void, everything was empty.<br/><br/>When the Divine Dragon entered Wang Xian’s body, Wang Xian felt that there was an additional amount of energy in his body.<br/><br/>He looked ahead and his body moved. In an instant, he appeared in front of him.<br/><br/>This distance was not very far. It was only about a kilometer away.<br/><br/>This was because the energy of the divine dragon in his body was too weak.<br/><br/>It was so weak that it couldn’t even reach the level of a god.<br/><br/>It was too weak!<br/><br/>Although it was weak, this void dragon possessed a terrifying ability to evolve.<br/><br/>This ability to evolve was even stronger than the mutated divine dragon.<br/><br/>The ability to control the power of space could be said to be the most unique mutated divine dragon in the Dragon Palace.<br/><br/>lie!<br/><br/>Wang Xian had a thought and called an lie over.<br/><br/>At the same time, he set up a demonic altar in one of his spots.<br/><br/>It was a pity that Wang Xian did not sense the existence of the demonic altar, even though it was very close to him.<br/><br/>“It seems that I only have the power of space, but I can’t teleport through this demonic altar. This should be an lie’s unique characteristic! ”<br/><br/>Wang Xian thought to himself.<br/><br/>An lie was a unique existence. He might be slightly different from the creatures of the void race!<br/><br/>In addition, he probably didn’t have the ability to ignore any defenses or barriers.<br/><br/>He only had the purest power of space.<br/><br/>Of course, when the Void Dragon reached a terrifying realm, he might be able to reach an lie’s level!<br/><br/>“Dragon King! ”<br/><br/>At this moment, an lie flew over and bowed to Wang Xian!<br/><br/>“Bring me to your void Pagoda! ” Wang Xian instructed him.<br/><br/>“It’s the Dragon King! ”<br/><br/>An lie nodded.<br/><br/>The Void Pagoda was a war treasure used by the royal family of the Void. It was also considered an extremely precious treasure to the royal family of the Void.<br/><br/>During the last war, it was left behind in the nine-origin universe.<br/><br/>The Void Pagoda contained an incomparably majestic spatial energy.<br/><br/>In this Void Pagoda, an Lie’s strength had risen to the level of a second-stage ruler after tens of millions of years!<br/><br/>This cultivation speed was not considered slow.<br/><br/>Of course, this was also because of the help of the heart of faith.<br/><br/>The heart of faith was also of great use to an lie in breaking through his shackles.<br/><br/>Wang Xian came to the Void Pagoda. With a thought, the body of the Void Dragon flew out from his body.<br/><br/>Wang Xian began to control his mind.<br/><br/>He shifted his mind to the body of the Void Dragon.<br/><br/>He sized up his body which was only about a meter long. He felt the surrounding space energy and tried to absorb it!<br/><br/>Buzz! Buzz! Buzz<br/><br/>A large amount of space energy surged into his body. Wang Xian could feel that his body was improving rapidly.<br/><br/>The speed of improvement was extremely fast!<br/><br/>In just a few hours, Wang Xian felt that he had achieved a breakthrough.<br/><br/>With a move of his palm, a space dagger appeared in his hand.<br/><br/>He threw it into the distance and the space dagger instantly appeared a kilometer away in front of him.<br/><br/>The dagger did not fly over. Instead, it teleported over.<br/><br/>There was no time lag.<br/><br/>In other words, the arm did not fly out. Instead, it was teleported over.<br/><br/>It looked extremely strange and terrifying.<br/><br/>This was the power of space.<br/><br/>“It’s really powerful! ”<br/><br/>Wang Xian’s eyes flickered. He was prepared to upgrade his void Dragon<br/><br/>Avatar.<br/><br/>This could not be said to be an avatar. This was because this void dragon was Wang Xian himself.<br/><br/>It was just that the Void Dragon did not have a physical body. Wang Xian’s actual body was a physical body.<br/><br/>In short, the Void Dragon was Wang Xian, and Wang Xian was also this void<br/><br/>Dragon..\t\t\t\t\t\t</div>", "images": {}, "success": true}