{"id": 927, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073754.html", "title": "Chapter 3929 - Chapter 3929: 3928", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3929 - Chapter 3929: 3928</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3929: 3928<br/><br/>Translator: 549690339<br/><br/>The sword and the magical universe were filled with the power of space.<br/><br/>The fluctuation of space that he cultivated here was a little more obvious than that in the Void Pagoda.<br/><br/>Of course, it didn’t mean that the space energy in the Void Pagoda was little.<br/><br/>Wang Xian landed on the ground. This was a desert with endless sand in front of him.<br/><br/>As far as his eyes could see, there weren’t any living beings.<br/><br/>At the end of the universe, there were very few living beings.<br/><br/>Due to the influence of the chaotic space, there were not many resources here.<br/><br/>Wang Xian took a look at his surroundings and flew into the air, heading towards the location in front of him.<br/><br/>Currently, Wang Xian’s strength was below the Heaven ‘s origin level. There were not many people who could be stronger than him.<br/><br/>Under full speed flight, his speed was extremely terrifying!<br/><br/>An lie did not follow him. Instead, he returned to the Dragon Palace!<br/><br/>His terrifying flying speed shuttled back and forth rapidly.<br/><br/>Wang Xian flew for a whole month before he met the living beings here.<br/><br/>A terrifying giant centipede that lived in the desert. It was at least a thousand meters in size and emitted a terrifying aura.<br/><br/>However, this terrifying aura was much weaker to Wang Xian.<br/><br/>It was merely an existence at the level of the Eternal Divine Lord.<br/><br/>Such strength was considered pretty good in the nine-origin universe.<br/><br/>After all, this place was extremely remote. It was rare for such a powerful creature to exist.<br/><br/>With a thought, Wang Xian’s space dragon body flew out and instantly arrived above the gigantic centipede.<br/><br/>Space, Slash!<br/><br/>Wang Xian appeared above the giant centipede. With a wave of his arm, a space slash landed on the body of the giant centipede.<br/><br/>The terrifying tearing force immediately left a long mark on the body of the giant centipede.<br/><br/>“Roar Roar Roar!<br/><br/>The giant centipede felt the pain and sensed Wang Xian. It immediately attacked him!<br/><br/>Buzz<br/><br/>When Wang Xian saw that, he moved and teleported away immediately!<br/><br/>The giant centipede’s sharp claws were ineffective. It opened its mouth in anger and a torrent of energy rushed toward the direction where Wang Xian teleported.<br/><br/>The terrifying coverage area almost blocked all of Wang Xian ‘s routes.<br/><br/>Buzz<br/><br/>Buzz<br/><br/>Wang Xian quickly continued to teleport away from the giant centipede’s attack range.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The giant centipede let out an indignant roar as it stared at Wang Xian with its blood-red eyes.<br/><br/>The strength of this giant centipede was around level seven of the Eternal Lord.<br/><br/>On the other hand, Wang Xian ‘s strength was only at level four of the Eternal Lord. Even so, as long as Wang Xian wanted to escape, he would be able to escape easily.<br/><br/>This was the strength of a spatial cultivator.<br/><br/>“However, there is a drawback of a space cultivator. That is, there is nothing that can be done when one encounters an expert with terrifying defensive strength.<br/><br/>Wang Xian spoke.<br/><br/>Defensive strength was the only counter to a space cultivator.<br/><br/>It couldn’t be said to be a counter. An opponent with strong defensive strength couldn’t do anything to an expert with space attributes.<br/><br/>Space was the king of all attributes. This wasn’t just a casual statement!<br/><br/>Of course, this statement required the combination of attributes such as light, darkness, and the five elements.<br/><br/>Whoosh<br/><br/>Wang Xian ‘s main body flew towards the giant centipede and instantly landed in the sky above him. He used the soul-absorbing power!<br/><br/>Facing Wang Xian, the giant centipede didn ‘t have the slightest ability to resist.<br/><br/>Waves of information appeared in Wang Xian ‘s mind, giving him a little understanding of this universe!<br/><br/>This gigantic centipede had no intelligence and was known as the Eternal Demonic Beast!<br/><br/>The so-called demonic beasts were creatures that were filled with demonic nature.<br/><br/>They were extremely brutal and irrational.<br/><br/>From the chaotic memories of the Eternal Demonic Beast, Wang Xian learned a piece of information, a piece of information about the magical kingdom! The so-called magical kingdom was a piece of information about a country.<br/><br/>It was a human country that was not too far away from here!<br/><br/>Based on the information that Wang Xian obtained, he immediately flew towards this magical kingdom.<br/><br/>After flying in the air for half a month, Wang Xian discovered a huge human gathering place appearing in his line of sight.<br/><br/>This was a magical kingdom that was built on a desert oasis.<br/><br/>It had a completely different style of architecture compared to the nine-origin universe.<br/><br/>Magical Towers that were hundreds of thousands of meters tall stood on the ground. The magical towers emitted light and illuminated the entire territory!<br/><br/>There were more than a dozen magical towers that formed a special formation.<br/><br/>Wang Xian scanned the area with his dragon eyes and realized that the strongest person in the magical kingdom was only at the level of the Eternal Lord!<br/><br/>This didn’t interest him much. He locked onto the strongest aura in the magical kingdom!<br/><br/>Whoosh<br/><br/>Wang Xian flew over at a terrifying speed. No one could sense him!<br/><br/>Buzz<br/><br/>In the next second, on top of a magical tower in the middle of this magical kingdom.<br/><br/>On top of the tower, an old man was sitting cross-legged and cultivating.<br/><br/>Even though Wang Xian was standing three meters away from him, he couldn’t sense him.<br/><br/>There was still a huge gap between him and Wang Xian!<br/><br/>Soul Catcher!<br/><br/>Wang Xian waved his arm and a surge of energy surged into the old man’s body.<br/><br/>It was very easy for Wang Xian to use the soul catcher’s power on an eternal lord-level powerhouse.<br/><br/>He could even do it. After the soul catcher, the old man didn’t feel anything abnormal and didn ‘t sense anything at all.<br/><br/>Furthermore, it wouldn’t hurt his soul!<br/><br/>Waves of information entered Wang Xian ‘s mind, giving him a hint of understanding of this universe!<br/><br/>The continent of Swords and magic. This was what the living beings in this universe called their own universe.<br/><br/>It wouldn’t be a problem to call it a continent!<br/><br/>On this continent, there were countless magical kingdoms. Some of them were established by the strong while others were established by powerful forces.<br/><br/>The Big Magical Kingdoms had trillions of people while the small ones had billions of people. Their territories were all different!<br/><br/>Other than the mage country’s forces, there were other forces that existed.<br/><br/>Among them, the top forces were also known as the Holy Land, Forbidden Land, and the Holy Academy!<br/><br/>The Holy Land and forbidden land were all overseen by experts who had lived for countless years. They were earth-shattering!<br/><br/>The sword and Mage Continent was extremely vast. Wang Xian only knew a small part of the information that he obtained from the old man ‘s mind.<br/><br/>This information didn’t even come into contact with the existence of the sacred ground, the Sacred Academy.<br/><br/>All he knew was that this was an existence that even the eternal lord yearned for.<br/><br/>In addition, he also obtained some useful little information from the old man’s memories.<br/><br/>That was that the spatial attribute had a huge advantage in this continent. Powerful and talented spatial attribute cultivators were the targets of all the major factions.<br/><br/>Space attribute cultivators usually walked the path of sword cultivation.<br/><br/>Because the space attribute combined with close combat would be even more powerful.<br/><br/>Here, the realm of the cultivator was similar to the 9-origin universe.<br/><br/>This old man was an eternal mage Level 9 existence.<br/><br/>He mainly cultivated the Earth attribute!<br/><br/>Sword cultivators at this realm were called eternal swordmasters!<br/><br/>The realm above is Undying Sword King, Undying Guardian King!<br/><br/>In terms of address, it is extremely similar to the 9-essences universe!<br/><br/>But the attacking methods are slightly different!\t\t\t\t\t\t</div>", "images": {}, "success": true}