{"id": 929, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073758.html", "title": "Chapter 3931 - Chapter 3931: 3930 To Learn", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3931 - Chapter 3931: 3930 To Learn</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3931: 3930 to learn<br/><br/>Translator: 549690339<br/><br/>Buzz<br/><br/>The space energy landed on the two words “Assessment”and soon filled up the grooves of the two words.<br/><br/>“You want to join our Ming Yi Saint Academy?”<br/><br/>Soon, a figure appeared in front of Wang Xian out of thin air.<br/><br/>It was a middle-aged man. He held a sharp sword in his hand and sized up Wang Xian.<br/><br/>“Yes, I’m here to learn from Ming Yi Saint Academy!”<br/><br/>Wang Xian cupped his hands at him.<br/><br/>Ming Yi Saint Academy was an academy that attracted elite disciples from all over the world.<br/><br/>However, if he wanted to join an advanced academy, he would need to join Ming Yi Saint Academy completely!<br/><br/>He would need to become a core member of Ming Yi Saint Academy.<br/><br/>This was not something that Wang Xian was considering. He wanted to increase his strength first before considering the next step.<br/><br/>At the very least, he wanted to determine the direction of his cultivation first.<br/><br/>“Use the power of space to form the strongest attack. Let me see your strength. ”<br/><br/>The middle-aged man sized up Wang Xian, he said, “Under normal circumstances, the requirements for spatial attribute cultivators in our songyi saint academy will be much lower. We also welcome spatial attribute cultivators to our songyi Saint Academy. As long as your strength is not too bad, it’s fine! ”<br/><br/>Wang Xian nodded his head. Without any concealment, he unleashed all the spatial energy and condensed it into a spatial sword!<br/><br/>“The fourth level of Eternity? Not Bad, not bad. How’s your swordsmanship?”<br/><br/>The middle-aged man’s eyes lit up as he asked.<br/><br/>Swordsmanship? My swordsmanship is average! ”<br/><br/>Wang Xian replied.<br/><br/>Spatial attribute cultivators, the path of a swordsman is much wider than the path of a mage. There are also many more techniques to cultivate. Your swordsmanship is average and you need to train more. Spatial swordsman is the king among swordsmen. Alright, if you want to join our Songyi Saint Academy, you need to walk step by step to the stairs. As long as you can walk step by step, it means that you have succeeded.”<br/><br/>The middle-aged man pointed at the stairs in front and spoke to Wang Xian!<br/><br/>Wang Xian nodded his head. He looked over and lifted his feet to walk up.<br/><br/>When he stepped on the stairs, he felt a strong pressure coming from above, causing his heart and body to sink.<br/><br/>However, this didn’t affect him much. He continued to walk up the stairs step by step.<br/><br/>“His temperament is extraordinary. Is he a disciple of a big family? He doesn’t look like one, or did he come from somewhere else?”<br/><br/>At the back, the middle-aged man looked at Wang Xian’s figure. His eyes were sparkling.<br/><br/>He had the strength of the Void Sword Emperor. However, he had to admit that this disciple who wanted to join the Songyi Saint Academy had an extraordinary temperament.<br/><br/>This was the youth with the best temperament that he had ever seen.<br/><br/>He shook his head and didn’t think too much about it. After all, the Songyi Saint Academy’s Elementary Academy didn’t have any requirements for its disciples. As long as they were qualified, they would be able to enter.<br/><br/>For the Advanced Academy, they would need some qualifications and status!<br/><br/>They would need to be loyal and loyal to the Songyi Saint Academy!<br/><br/>Wang Xian walked up the stairs step by step. When he was halfway up, he had some hallucinations.<br/><br/>This staircase tested one’s endurance.<br/><br/>A long period of training required one to withstand the baptism and tests of time!<br/><br/>These endurance and tests were nothing to Wang Xian.<br/><br/>He easily arrived at the top of the stairs and called the entrance of the Saint Academy!<br/><br/>“Very good, very good. It’s very rare to be able to pass the test so easily. What’s Your Name? In the future, you’ll be my student. You can call me teacher he.<br/><br/>Let’s go. I’ll bring you to the academy to meet the other students! ”<br/><br/>As teacher he spoke, he waved his arm. Wang Xian could feel the power of space enveloping him!<br/><br/>In the next second, he appeared on a small island in the sky.<br/><br/>This small island in the sky was not big, but it was not small either. There were some buildings within a radius of 100 kilometers.<br/><br/>“These are your students. Including you, I have taught a total of more than 50 students. Most of the time, you will cultivate by yourself. For one month each year, I will teach you some sword techniques and techniques. You can also voice out your doubts. ”<br/><br/>“These are free as long as you enter the Songyi Saint Academy. Your Residence is also free. In addition, I will also teach you the basic cultivation methods of the Eternal Swordsman’s realm in a while. Other than these, if you have any other needs, you will have to pay for them yourself! ”<br/><br/>Teacher he brought him to the center of the floating island and introduced them to him one bv one!<br/><br/>“Student Wang Xian, thank you for your guidance, teacher he! ”<br/><br/>Wang Xian cupped his hands and expressed his gratitude.<br/><br/>The one who achieved was the teacher. At least in terms of spatial attributes, this teacher he was qualified to teach him.<br/><br/>“Hehe, this is the spatial sword technique and the cultivation method given to the disciples by the Ming Yi Saint Academy. You will cultivate it for a year first. If you have any questions, you can come and ask next year. There is also a handbook for the students of the Ming Yi Saint Academy on it. There are some things to pay attention to and all the situations in the academy. Take a look at it in detail and it will be useful to you. ”<br/><br/>“In addition, this is a communication device used by the disciples of the Saint Academy to communicate with each other. If you have nothing to do, you can learn some information from it. The communication device in the place where you live will guide you. ”<br/><br/>Instructor he spoke to him, in the end, he added, “The best way to cultivate the spatial attribute is to combine it with sword techniques. Our Saint Academy will provide you with a very suitable sword technique for free. Of course, if you have learned more powerful sword techniques in the past, you don’t have to learn the sword techniques of the Saint Academy.”<br/><br/>“Thank you, teacher he! ”<br/><br/>Wang Xian thanked him once again.<br/><br/>Teacher he smiled and left immediately!<br/><br/>Wang Xian picked up the communicator and opened it. There was a guide on it. Then, he came to a house!<br/><br/>As a Saint Academy, even if he was a student who had just joined, he still had a place to stay!<br/><br/>Moreover, it was a very good place to stay. It was equivalent to a villa on Earth. It was very beautiful!<br/><br/>The energy in the room was obviously much stronger than the energy in the outside world!<br/><br/>Clearly, there was a formation similar to the spirit gathering formation!<br/><br/>“It’s not bad. As expected of a top-notch Force! ”<br/><br/>Wang Xian said.<br/><br/>Compared to the sacred grounds and forbidden grounds, the Saint Academy was a little more free!<br/><br/>The teachers wouldn’t teach them all the time!<br/><br/>Wang Xian read a few books and understood some information about the Ming Yi Saint Academy!<br/><br/>The Ming Yi Saint Academy was huge and had many students.<br/><br/>There were ten instructors who cultivated the space attribute alone.<br/><br/>There were more than fifty students under each instructor.<br/><br/>The other nine attributes were divided into magic and swordsmen, and the number was even more!<br/><br/>It was dozens of times more than the space attribute.<br/><br/>Those who could join the Saint Academy were either very powerful geniuses or had cultivation above eternity.<br/><br/>Wang Xian got to know more about cultivation, treasure grounds, Book Collection Pavilion, Treasure Collection Pavilion, Mission Pavilion, and so on in the Saint Academy. Then, he opened two cultivation manuals.<br/><br/>One book and one sword technique book!<br/><br/>One was a sword technique that was very suitable for spatial swordsmen. The name of the sword technique was ‘ghosts and spirits’!<br/><br/>The other was the book on absorbing the spatial attribute, comprehending the spatial attribute, and breaking through the shackles.<br/><br/>Are very basic existence..\t\t\t\t\t\t</div>", "images": {}, "success": true}