{"id": 938, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073776.html", "title": "Chapter 3940 - Chapter 3940: 3939 Spatial Saint Child", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3940 - Chapter 3940: 3939 Spatial Saint Child</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3940: 3939 spatial saint child<br/><br/>Translator: 549690339<br/><br/>“The once-in-20,ooo-year competition has finally begun. I wonder who will be the first place winner today?”<br/><br/>“Of course, 80% of it will be goddess Yaya. Senior Yaya is currently the number one existence on our Songyi Saint Academy’s student rankings. Her spatial attribute is at the peak of the Eternal Swordsman’s strength. No one will be a match for Goddess Yaya. ”<br/><br/>“That’s about it. Goddess Yiya is too strong. The people on the rankings are all very strong. I wonder how many dark horses will appear today. ”<br/><br/>“There are dark horses every year. I wonder who it will be this year. ”<br/><br/>On the rooftop of Songyi Saint Academy, the teachers and students of Songyi Saint Academy had all arrived around the central sparring ring ring.<br/><br/>As the student ranking competition that was held once every 20,000 years, this was an interesting thing for all the students during their boring cultivation. Moreover, they might have some inspiration and feelings while watching the battle.<br/><br/>Therefore, basically all the students would come to watch the battle in every student ranking competition.<br/><br/>And for those top students, this competition was undoubtedly a stage on which they could amaze the world with a single feat.<br/><br/>Obtaining a good ranking would not only allow them to obtain a great reward, but also a huge reputation.<br/><br/>This would be of great benefit to their future cultivation.<br/><br/>“This competition will be the same as the previous years. Only eternal swordsmen and above of level eight can participate in the space attribute. Swordsmen and mages of other attributes can only participate when they have reached the peak of Eternity. ”<br/><br/>“Based on the format of the arena matches, the top 30 students in the Saint Academy will be guarding the arena. Those who are confident can fight in the arena as they wish. There is no limit to the number of times.”<br/><br/>At a corner of the rooftop, instructor he spoke to Wang Xian and the rest.<br/><br/>This rule was mainly for Wang Xian.<br/><br/>It was the once-in-20,ooo-year student ranking competition of the Ming Yi<br/><br/>Saint Academy. There were no complicated rules and it was just a competition.<br/><br/>The top 30 students from the previous batch would be defending the arena while the rest of the students would be challenging.<br/><br/>Of course, the students in the arena could challenge those who were ranked higher than them.<br/><br/>The competition would end when there were no challengers.<br/><br/>Each student competition would last for a few years.<br/><br/>Such rules could also select the truly strong ones.<br/><br/>Wang Xian nodded slightly when he heard this more direct competition method.<br/><br/>It was straightforward. Strong was strong, weak was weak.<br/><br/>“Student nie youwei, good luck.”<br/><br/>“Good luck, Brother Run.”<br/><br/>“Good luck, Wang Xian. ”<br/><br/>At this moment, the sound of cheering could be heard from the back.<br/><br/>They were all professor he’s students.<br/><br/>There were more than 20,000 students in Ming Yi Saint Academy. There were only 70 to 80 students who were qualified to participate in the ranking competition.<br/><br/>Even though they were both students of the same professor, they still supported their own people.<br/><br/>Wang Xian looked at the back and nodded with a smile.<br/><br/>In the surrounding area, the teachers brought their outstanding students to the front.<br/><br/>They waited quietly.<br/><br/>Buzz<br/><br/>More than ten minutes later, a figure appeared in the air above the dueling ring and hovered there quietly.<br/><br/>He waved his arm and a wave of energy spread out in all directions.<br/><br/>When everyone saw this figure, they immediately quieted down.<br/><br/>Following that, the figure’s palm moved, and a magic staff appeared in his hand, pointing down gently.<br/><br/>At the bottom of the arena, a pyramid-like structure formed from spatial energy appeared beneath him.<br/><br/>The entire illusory pyramid was divided into thirty cubicles.<br/><br/>Each cubicle had a high platform with a young man standing on it.<br/><br/>The group of young men looked around indifferently, and they exuded a strong sense of confidence.<br/><br/>This was the top 30 students of the previous batch.<br/><br/>Especially in the top cubicle, a red tight-fitting training suit outlined a complete curve, and her exquisite face carried a faint smile.<br/><br/>She held a treasured sword in her hand, and her body was filled with a noble and arrogant aura.<br/><br/>She was the first place of the previous batch, the peak of the space-attributed eternal swordsman, Yi Ya.<br/><br/>She was the publicly recognized goddess of the Songyi Saint Academy.<br/><br/>Second and third place, and so on. She was also a proud disciple of the Songyi Saint Academy.<br/><br/>“It’s the goddess of Yi Ya. She’s really beautiful! ”<br/><br/>“Yeah, she’s simply too beautiful. Xiao Ye is also very handsome. He’s now ranked second. Maybe he wants to challenge Yi Ya’s position. ”<br/><br/>“Wow, when can I stand there?”<br/><br/>In the surrounding seats, all the students looked at the thirty students who were emitting light with envy in their eyes.<br/><br/>Only by standing in that position would they have a chance to step into the Advanced Academy of Songyi Saint Academy.<br/><br/>“The rules of the arena are the same as before. The rest of us have also come here.”<br/><br/>At this moment, the figure in the sky spoke. His voice entered the ears of every student.<br/><br/>“Let’s go. ”<br/><br/>Instructor he spoke to Wang Xian and the rest.<br/><br/>Wang Xian and the rest nodded their heads. With a move, they arrived at the front of the illusory pyramid in the arena.<br/><br/>Students flew over from other positions in the surroundings.<br/><br/>Wang Xian landed on the ground. His gaze swept across the crowd. There were about fifty students.<br/><br/>“After the competition begins, each of them will have a sparring match. If a student is challenged consecutively, they will have time to recover Midway. ”<br/><br/>The figure above continued, “Alright, let’s begin the challenge.”<br/><br/>“I’ll go first. I want to challenge Gu Cheng, who is ranked 30th.”<br/><br/>As soon as the figure above finished his sentence, someone immediately issued a challenge.<br/><br/>The first match began.<br/><br/>“Let’s go, Wang Xian. We can just watch the match from the side. ” Nie you gestured to Wang Xian before flying towards the center.<br/><br/>There were some seats in the center in front of them.<br/><br/>The seats were divided into more than ten rows. The top few rows were occupied by some instructors.<br/><br/>A match of this level was a grand occasion for the students. However, to the<br/><br/>instructors, it was like a child’s game.<br/><br/>Many of the instructors and leaders in the Saint Academy didn’t come over.<br/><br/>Only the instructors of the participating students were watching.<br/><br/>“There are both advantages and disadvantages to being the first to challenge. The advantage is that you can accumulate experience during this period. Of course, the disadvantage is that some of your trump cards and techniques might be exposed. ”<br/><br/>NIE youwei found a seat and sat down. Then, she said to Wang Xian.<br/><br/>Wang Xian nodded his head slightly. He stayed here to take a look and test his strength before leaving.<br/><br/>He found a place to start his seclusion.<br/><br/>“Holy son, why are you here?”<br/><br/>“Haha, teachers, Pm here to take a look.”<br/><br/>“Holy Son! ”<br/><br/>“Holy Son! ”<br/><br/>At this moment, a voice came from behind.<br/><br/>Beside him, nie you, Xu Xinrun, was slightly taken aback. He immediately looked behind him.<br/><br/>“Space Holy Son, Wu Qitian.”<br/><br/>Xu Xinrun’s gaze was focused. He spoke with a fiery expression.<br/><br/>“Space Holy Son?”<br/><br/>Upon hearing this name, Wang Xian raised his brows slightly.<br/><br/>He looked over and his gaze landed on a young man.<br/><br/>The young man was dressed in a yellow robe and held a yellow sword in his hand. There were many unique magic patterns on the sword.<br/><br/>He had a dignified bearing and a hint of arrogance..\t\t\t\t\t\t</div>", "images": {}, "success": true}