{"id": 935, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073770.html", "title": "Chapter 3937 - Chapter 3937: 3936 Heaven Origin Sword Technique", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3937 - Chapter 3937: 3936 Heaven Origin Sword Technique</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3937: 3936 heaven origin sword technique<br/><br/>Translator: 549690339<br/><br/>“Hiss, this…”<br/><br/>Xu Xinrun sensed the spatial confinement force around him. He swept his gaze across his surroundings and took a deep breath. His expression was extremely awkward.<br/><br/>It was not because of teacher he’s words that he felt extremely awkward.<br/><br/>It was because of the surrounding spatial swords that he felt extremely awkward.<br/><br/>Wang Xian’s attack was not just the previous attacks.<br/><br/>There were also attacks with the same destructive power around him.<br/><br/>He actually did not notice it.<br/><br/>If teacher he did not stop him, these space swords would have caused him serious injuries even if they did not kill him.<br/><br/>“That Wang Xian actually hid his attacks around Xu Xinrun. If it wasn ‘t for teacher he, he would have suffered a terrifying attack. ”<br/><br/>“Oh my God, Wang Xian’s strength is not as simple as I thought. He actually left an attack around brother run. ”<br/><br/>“Not simple, not simple at all. That Wang Xian has the strength to fight against an existence at level nine of Eternal Swordsman. ”<br/><br/>When the surrounding students saw this scene, they sucked in a breath of cold air. Their faces were filled with shock.<br/><br/>No one expected that Wang Xian actually left an attack around Xu Xinrun.<br/><br/>His strength was really terrifying!<br/><br/>Student Wang Xian is really powerful. Let me experience your strength. ”<br/><br/>NIE youwei had a solemn expression on her face as well. In an instant, she arrived in front of Wang Xian and spoke to him.<br/><br/>If it was just a moment ago, Xu Xinrun might have been careless. However, after witnessing the second attack, nie youwei completely restrained her contempt!<br/><br/>She cupped her hands at Wang Xian.<br/><br/>“Please Enlighten Me! ”<br/><br/>Wang Xian nodded his head.<br/><br/>At the side, Xu Xinrun’s expression kept changing as he walked to the side.<br/><br/>This time, he had lost a lot of face.<br/><br/>Buzz Buzz<br/><br/>Two spatial barriers landed on Wang Xian and the rest.<br/><br/>Without any hesitation, Wang Xian moved his body and disappeared instantly!<br/><br/>NIE youwei’s gaze was locked onto Wang Xian as she sensed the changes in the surrounding space.<br/><br/>“Whoosh! ”<br/><br/>In an instant, she attacked a place!<br/><br/>Wang Xian had just appeared in another place when he felt a sharp sword attacking him. The sharp sword in his hand was held horizontally in front of his body.<br/><br/>“Bang, Bang!”<br/><br/>The sharp sword blocked the attack and Wang Xian could not help but fly back a few thousand meters.<br/><br/>The gap between their realms was still there.<br/><br/>However, Wang Xian wasn’t injured. This time, he didn’t teleport but flew in the air.<br/><br/>The sharp sword in his hand kept swinging, leaving sword mounds in the air.<br/><br/>Sword mounds were the core of the Heaven origin sword technique.<br/><br/>By setting up sword mounds, he activated the surrounding energy and unleashed an even more powerful attack.<br/><br/>Nie you could feel Wang Xian’s strength and saw him brandishing his sword around her.<br/><br/>She didn’t hesitate at all. Her body trembled and a wave of spatial power enveloped Wang Xian.<br/><br/>Spatial suppression!<br/><br/>He was a level higher than Wang Xian. His greatest advantage was the spatial suppression.<br/><br/>The suppression of the entire space made Wang Xian unable to teleport and greatly reduced his speed!<br/><br/>He could even use the power of space to suppress the weak to death.<br/><br/>“Clang, Clang, Clang! ”<br/><br/>Wang Xian waved his arm and the sword tomb around him immediately erupted, allowing him to break through nie youwei’s spatial suppression.<br/><br/>In the next instant, Wang Xian teleported behind nie youwei and smiled. “Line sword draw! ”<br/><br/>Line sword draw.<br/><br/>This was one of the ways to use the heaven origin sword technique.<br/><br/>The Heaven origin sword technique was based on the sword tomb, not on the attack.<br/><br/>With the sword tomb as the core, the move was based on the user.<br/><br/>When Wang Xian arrived behind nie youwei, the sharp swords were like a line, attacking her directly.<br/><br/>The sharp swords formed from the space attribute possessed the characteristics of the space attribute.<br/><br/>Fast!<br/><br/>There was nothing faster than the spatial attribute!<br/><br/>NIE youwei’s gaze focused when she saw the attack of the line sword draw.<br/><br/>“Spatial vibration, Break!”<br/><br/>She shouted in a low voice, and a sword ray attack that seemed to be more powerful than the line sword draw broke through it!<br/><br/>The sword ray directly cut through the line sword draw.<br/><br/>However, what made nie youwei frown was that the line sword draw seemed to be endless.<br/><br/>After being broken by her, it reappeared again!<br/><br/>Whoosh<br/><br/>At this moment, another line of sword was attacking her from the other side of him.<br/><br/>This caused her expression to change completely.<br/><br/>“What a powerful sword technique! ”<br/><br/>Her expression was extremely grave. Her body trembled and she wasn’t prepared to continue defending. Instead, she teleported directly!<br/><br/>Buzz<br/><br/>Her figure started to turn illusory.<br/><br/>At the side, Wang Xian sensed the spatial fluctuations around him. With a wave of his arm, two one-line swords flew in one direction.<br/><br/>Bang! Bang<br/><br/>When nie youwei appeared at another location, two one-line swords had already arrived in front of her.<br/><br/>“What a strong sense. You can actually sense the location of my teleportation. ”<br/><br/>NIE youwei’s expression changed again. She immediately waved the longsword in her hand. “Endless Sword Slash! ”<br/><br/>With a wave of her arm, terrifying space-tearing swords shot towards the two one-line swords.<br/><br/>Buzz<br/><br/>While she was blocking the attack, Wang Xian teleported again.<br/><br/>Once again, he condensed the same attack.<br/><br/>“This… Nie youwei is actually in a completely passive state. This is simply under the control of that Wang Xian! ”<br/><br/>(‘D * mn, it can’t be. Nie youwei is completely suppressed. What kind of sword technique is this? Why does it look so strange?”<br/><br/>“His sword technique is powerful, and his senses are also extremely terrifying.<br/><br/>He can really fight above his level. ”<br/><br/>Below, all the students watched this sparring in shock.<br/><br/>Xu Xinrun was defeated partly due to carelessness.<br/><br/>However, nie youwei had put in 120% of her energy in her fight with NIE youwei.<br/><br/>Under such circumstances, she was actually completely suppressed.<br/><br/>“This is bad. This strange sword is constantly increasing. I can only attack continuously. If I defend with all my strength, although I can withstand it, it can only last for a few seconds at most. The attack of a sword isn’t strong, but under the continuous situation, I can’t Hold On. ”<br/><br/>Nie youwei’s expression was extremely grave.<br/><br/>She had fallen into a dead end.<br/><br/>Faced with this strange attack, she had no way to deal with it.<br/><br/>Her gaze swept past Wang Xian and saw his relaxed expression. NIE youwei’s expression changed again.<br/><br/>He shouldn’t have used his full strength yet.<br/><br/>“I’ve lost.”<br/><br/>NIE youwei gritted her teeth and admitted defeat.<br/><br/>When Wang Xian heard that, a smile appeared on his face. With a tap of the longsword in his hand, one line after another disappeared.<br/><br/>“Thank you for letting me win! ”<br/><br/>He smiled and cupped his hands.<br/><br/>“Student Wang Xian, what… What kind of sword technique is this?”<br/><br/>Nie you couldn ‘t help but ask Wang Xian.<br/><br/>She could feel that Wang Xian ‘s sword technique was extremely terrifying.<br/><br/>The level of his sword technique was also very high.<br/><br/>“Nine-origin sword technique! ”<br/><br/>Wang Xian said casually. He didn’t mention that this sword technique was called the heaven-origin sword technique.<br/><br/>The two words ‘heaven-origin’represented that the level was too high..\t\t\t\t\t\t</div>", "images": {}, "success": true}