{"id": 937, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073774.html", "title": "Chapter 3939 - Chapter 3939: 3938 Had Another Breakthrough", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3939 - Chapter 3939: 3938 Had Another Breakthrough</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3939: 3938 had another breakthrough<br/><br/>Translator: 549690339<br/><br/>Wang Xian looked at the huge space mirror in front of him. His body moved and he entered directly.<br/><br/>Buzz<br/><br/>When he entered silently, he immediately saw three old men sitting cross-legged in the space mirror and cultivating.<br/><br/>Each of the old men had the strength at the peak of the venerable realm.<br/><br/>Furthermore, they were all cultivators of the space attribute.<br/><br/>The three elders did not sense Wang Xian’s arrival.<br/><br/>Wang Xian stood there and looked at the slightly illusory space flower.<br/><br/>Wang Xian could sense a surge of space energy from it.<br/><br/>It was extremely beneficial to space-attributed cultivators.<br/><br/>Wang Xian hesitated for a moment. With a wave of his arm, a surge of energy enveloped the three elders.<br/><br/>Soul capture! ”<br/><br/>He shouted softly and various information entered his mind.<br/><br/>Following that, Wang Xian waved his arm and plucked all the spatial flowers away.<br/><br/>Buzz<br/><br/>At the original location of the spatial flowers, he threw down a soul-returning embryo fruit.<br/><br/>It was considered as a trade.<br/><br/>Although it felt like he was forcefully buying and selling it, the value of the soul-returning embryo fruit was much higher than these spatial flowers.<br/><br/>These spatial flowers were only at the first stage of the ruler realm.<br/><br/>Compared to the soul-returning embryo fruit, they were still far from it.<br/><br/>After obtaining some information and collecting all the spatial flowers, Wang Xian’s body moved and flew back to his original location.<br/><br/>When he returned, the entire mirror world didn’t feel any changes.<br/><br/>In fact, the three old men who were cultivating with their legs crossed didn’t feel anything at all.<br/><br/>“With this spatial flower, my cultivation speed will increase tremendously. ” Wang Xian looked at the spatial flower with a smile on his face.<br/><br/>Previously, he had destroyed the king of the magical kingdom and took all the treasures in the national treasury.<br/><br/>However, the magical kingdom didn’t have many spatial-attributed treasures.<br/><br/>Moreover, in the magical kingdom, the fire attribute was the main attribute.<br/><br/>This spatial flower was the first spatial attribute treasure that Wang Xian obtained.<br/><br/>To eternal swordsman level cultivators, a spatial flower that could dominate the first level was simply a great opportunity.<br/><br/>There were a total of 13 spatial flowers.<br/><br/>Wang Xian took out a spatial flower and began to absorb it immediately.<br/><br/>Buzz<br/><br/>With such a treasure to aid his cultivation, Wang Xian’s cultivation speed increased by more than ten times.<br/><br/>This caused a smile to appear on his face.<br/><br/>After cultivating here for fifty years, it was easy to advance one level.<br/><br/>“Huh?”<br/><br/>Time passed day by day. It was located in the deepest part of the mirror world.<br/><br/>Among the three old men who were cultivating, the old man in the middle had a thought and frowned slightly.<br/><br/>He immediately opened his eyes and looked to the side.<br/><br/>“Not good!”<br/><br/>When he saw that the mirror flowers had all disappeared not far away, his expression changed drastically. He couldn’t help but let out a low roar.<br/><br/>“What’s going on?”<br/><br/>The other two old men immediately opened their eyes and looked to the side as if they had sensed something.<br/><br/>In the next second, their pupils constricted slightly, and a look of shock appeared on their faces.<br/><br/>“Where’s the mirror flower? How is this possible? Where’s the mirror flower?” An old man shouted loudly with a face full of disbelief.<br/><br/>The mirror world was the only place with space attribute treasures in Songyi Sacred Academy.<br/><br/>Moreover, in the deepest part of the mirror world, there were more than ten ruler-level space attribute mirror flowers.<br/><br/>Treasures of this level were completely rare treasures for Songyi Sacred Academy.<br/><br/>To the space swordsmen at the pinnacle of the Knight realm, it was an even more precious treasure.<br/><br/>But now, it had all disappeared.<br/><br/>They didn’t even feel it before it disappeared.<br/><br/>This made them feel incredulous, but at the same time, they felt their scalps go numb.<br/><br/>The flower of the mirror image could disappear silently beside them. What level could it be.<br/><br/>To be able to make the flower of the mirror image disappear, they would naturally be able to die without a sound.<br/><br/>At the thought of this, cold sweat appeared on their foreheads.<br/><br/>“There seems to be a fruit tree left there. ”<br/><br/>At this moment, they saw that at the original location of the flower of the mirror image, there was a fruit that was emitting a special energy.<br/><br/>They focused their gaze and looked at each other.<br/><br/>“Report this matter to the headmaster. ”<br/><br/>They didn’t hesitate and immediately reported this matter.<br/><br/>This matter was too terrifying for them.<br/><br/>Wang Xian didn’t know how shocking it was for the powerhouses of the Songyi Saint Academy that he had taken away the mirror image flower. At this moment, he had absorbed the information of the three elders and learned more about the cultivation method of the space attribute.<br/><br/>This was of great use to him.<br/><br/>It allowed his understanding of the power of space to reach a powerful level.<br/><br/>Buzz<br/><br/>Thirty years passed. Wang Xian easily broke through the shackles of level eight eternal swordsman and reached level nine eternal swordsman.<br/><br/>At this level, if he were to spar with nie you, Wei, Xu Xinrun, and the rest, Wang Xian would be able to defeat them in an instant.<br/><br/>Buzz<br/><br/>He continued his cultivation. Twenty years later, Wang Xian suddenly felt a wave of energy spreading towards him.<br/><br/>With a thought, he immediately transformed into his human form.<br/><br/>Under the cover of this wave of energy, Wang Xian arrived at his position outside.<br/><br/>At the same time, nie youwei and Xu Xinrun were also at the side.<br/><br/>Right in front of him was instructor He.<br/><br/>Clearly, fifty years had passed. Instructor he had forcefully brought them out.<br/><br/>“Looks like I have to find a time to leave this place. ”<br/><br/>Wang Xian had a good harvest this time. He obtained some spatial treasures at the Overlord level.<br/><br/>His subsequent training would be much faster.<br/><br/>He did not plan to continue his training in the Songyi Saint Academy.<br/><br/>The Songyi Saint Academy was still too weak in the eyes of the Saint Academy, the Saint Lands, and the forbidden grounds.<br/><br/>There were less than five powerhouses at the Overlord level in the entire Saint Academy.<br/><br/>As for whether there were any masters at the second level, Wang Xian had no idea.<br/><br/>In short, Ming Yi Saint Academy was very weak.<br/><br/>Especially for the spatial attribute cultivators, the strongest ones were the three old men whom he met.<br/><br/>They were existences at the pinnacle of the Universe Knights.<br/><br/>Now that Wang Xian had absorbed their memories, he understood a lot about the cultivation of the spatial attribute.<br/><br/>If he wanted to continue his studies, he would go to a powerful force.<br/><br/>The prerequisite was that Wang Xian was prepared to enter seclusion for a period of time to raise his strength to the level of a universe knight.<br/><br/>“Let’s go. Let’s go meet the other outstanding disciples and strive for a good result. ”<br/><br/>Teacher he looked at them and said with a smile.<br/><br/>“Yes, teacher! ”<br/><br/>The three of them nodded.<br/><br/>A wave of spatial power enveloped them, and their figures instantly disappeared.<br/><br/>The rooftop!<br/><br/>A hundred thousand kilometers above Songyi Sacred Academy.<br/><br/>There was a huge floating arena.<br/><br/>This was the arena that Songyi Sacred Academy opened once every twenty thousand years.<br/><br/>It was also the arena where Songyi Sacred Academy’s Elementary Academy ranked its disciples.<br/><br/>Every competition was a grand occasion for all of Songyi Sacred Academy’s cultivating students.<br/><br/>A competition between geniuses.<br/><br/>If one could reach the top ten, he would receive the attention of the powerhouses of Songyi Saint Academy.<br/><br/>He would have great benefits..\t\t\t\t\t\t</div>", "images": {}, "success": true}