{"id": 936, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073772.html", "title": "Chapter 3938 - Chapter 3938: 3937 Mirror World, Spatial Flower!", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3938 - Chapter 3938: 3937 Mirror World, Spatial Flower!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3938: 3937 mirror world, spatial flower!<br/><br/>Translator: 549690339<br/><br/>“Nine-origin sword technique?”<br/><br/>Nie youwei muttered when she heard Wang Xian’s words.<br/><br/>She cupped her hands at Wang Xian and flew to her own position.<br/><br/>“This is simply unbelievable. ”<br/><br/>“He actually defeated NIE youwei. Furthermore, it seems that he defeated her so easily. His strength is even stronger than what he displayed earlier! ” “Too strong. The nine-origin sword technique he mastered is so powerful. ”<br/><br/>At this moment, all the students below watched this scene with astonished expressions. Their faces were filled with shock.<br/><br/>To fight above one’s level and defeat him so easily, his strength was terrifying.<br/><br/>This was the first time in the Songyi Sacred Academy that a spatial-attributed swordsman had fought above one’s level.<br/><br/>The cultivators of their spatial attribute had always been fighting someone of a higher level against someone of another attribute.<br/><br/>It was difficult to fight someone of the same attribute with a higher level. This time, Wang Xian had done it.<br/><br/>“With the strength that Wang Xian has displayed, he can definitely compete for the top 30 places in our Songyi Saint Academy. ”<br/><br/>A young man could not help but exclaim.<br/><br/>In the Songyi Saint Academy, there were less than 100 students at the pinnacle of eternity.<br/><br/>Due to their space attribute, they were usually able to fight beyond their level.<br/><br/>The students who were at the ninth level of the Eternal Swordsman’s space attribute had a great chance of winning against those who were at the peak of the eternal swordsman and the Eternal Mage.<br/><br/>This was the strength of the space attribute.<br/><br/>With the strength that Wang Xian displayed, he was able to compete for the top 30 spots.<br/><br/>“Very good. With your strength, Wang Xian, you can compete for the top 30 spots. It will be of great benefit to you.”<br/><br/>Instructor he looked at Wang Xian and said with a smile.<br/><br/>“Yes, teacher.”<br/><br/>Wang Xian nodded.<br/><br/>Wang Xian had a little understanding of his current strength.<br/><br/>Next, he could experience the offensive techniques of the sword and other attributes of the magic continent.<br/><br/>“Nie you, Xu Xinrun, you two have a spar.”<br/><br/>Teacher he turned his gaze to nie you, Xu Xinrun, and the other two and instructed them.<br/><br/>The two of them walked out again and had a spar.<br/><br/>However, this time, to the surprise of the students, Xu Xinrun was defeated by Nie you.<br/><br/>This made his expression even more awkward.<br/><br/>“Alright, Wang Xian, nie youwei, Xu Xinrun, follow me. ”<br/><br/>Teacher he looked at them and said, “The rest of the students, go back.”<br/><br/>Wang Xian and the rest responded.<br/><br/>Teacher he waved his arm and a wave of energy enveloped them, bringing them to the location below.<br/><br/>This place belonged to a floating island in the sky above the academy.<br/><br/>Teacher he brought them to a place in the middle of the academy.<br/><br/>“If you can be ranked in the top three in the class, I will give you some rewards. In the next fifty years, you will cultivate in the mirror world. In fifty years, you will see if you can improve.”<br/><br/>The four of them came to a special door.<br/><br/>The entire door contained a majestic spatial energy, as if it was a spatial door.<br/><br/>“Fifty years from now, the academy’s Disciple competition will be held. At that time, all of you should work hard and strive for a good result.”<br/><br/>Teacher he said to them.<br/><br/>“Thank you, teacher he. ”<br/><br/>Nie you and Xu Xinrun hurriedly thanked him, their gazes burning as they looked towards the front.<br/><br/>“Hehe, go.”<br/><br/>Teacher he gestured towards them. With a wave of his arm, a wave of energy landed on the spatial door.<br/><br/>An entrance slowly appeared on the space door.<br/><br/>Buzz! Buzz<br/><br/>Xu Xinrun did not hesitate and immediately flew towards the entrance.<br/><br/>“This must be the first time Wang Xian has entered. This is a space treasure land of our Ming Yi Saint Academy. ”<br/><br/>Nie you looked at Wang Xian and said, “This treasure land is expensive for the disciples of the Advanced Academy of Ming Yi Saint Academy to enter. We can only enter occasionally. ”<br/><br/>“Cultivating here for a day is about ten times faster than cultivating in other places. ”<br/><br/>Wang Xian nodded slightly when he heard her words. The two of them flew inside.<br/><br/>After entering, Wang Xian realized that there were many peculiar mirrors.<br/><br/>Each mirror seemed to contain a special space.<br/><br/>“The reason why this place is called the mirror world is because of these spatial mirrors. The spatial mirrors contain a majestic spatial force. It’s fine to cultivate inside. I’m going to cultivate now. ”<br/><br/>Nie you smiled at Wang Xian and said, “Let’s spar with each other again when we have time.”<br/><br/>“Alright! ”<br/><br/>Wang Xian nodded at her and entered a space mirror.<br/><br/>As soon as he stepped in, waves of space power surged over.<br/><br/>He could even feel the pressure of space here.<br/><br/>“Cultivating here is much more powerful than the formation cultivation room outside the Ming Yi Saint Academy. This is equivalent to the cultivation speed of the formation cultivation room by ten times.”<br/><br/>Wang Xian’s eyes flickered slightly as he began to absorb the energy.<br/><br/>Buzz<br/><br/>He mobilized the surrounding space energy and surged it into his body crazily.<br/><br/>“The speed is a little slow. I can still speed up.”<br/><br/>Wang Xian closed his eyes and cultivated for a while. He opened his eyes and mumbled.<br/><br/>He had just broken through to the eighth level of the eternal swordsman not long ago. There was still a huge gap between him and the ninth level of the eternal swordsman.<br/><br/>He would not be able to break through his cultivation even if he cultivated here for 50 years.<br/><br/>With a thought, his main body appeared at the side. A wave of energy enveloped him.<br/><br/>The Void Dragon’s body let out a low roar and immediately transformed into a void dragon.<br/><br/>The gigantic void dragon floated in the void. The dragon scales flickered slightly as it rapidly absorbed the surrounding spatial energy.<br/><br/>At the same time, Wang Xian’s real body mobilized the energy and compressed the surrounding spatial energy, placing him beside the void Dragon’s body.<br/><br/>“My speed has doubled. ”<br/><br/>Wang Xian sensed it and his eyes lit up. If this was the case, cultivating here for 50 years was equivalent to staying outside for 1,000 years.<br/><br/>Although it was not enough to increase his strength, it was still not bad.<br/><br/>He continued to cultivate. Wang Xian’s main body floated to the side to prevent other experts from noticing the abnormality.<br/><br/>Time passed quickly.<br/><br/>Buzz Buzz<br/><br/>However, ten years later, Wang Xian suddenly felt a weak spatial fluctuation.<br/><br/>His eyes were sparkling as he looked into the depths.<br/><br/>His body moved and he immediately flew into the depths.<br/><br/>The body of the Void Divine Dragon continued to cultivate here.<br/><br/>Although the speed of teleportation was terrifying, Wang Xian’s current strength was still not something that ordinary spatial cultivators could compare to.<br/><br/>His body moved and he immediately arrived at the deepest part of the mirror world.<br/><br/>At the spot where there were slight fluctuations.<br/><br/>Halfway through, Wang Xian could clearly sense the existence of a restriction.<br/><br/>However, this restriction had no effect on Wang Xian at all. He passed through it easily.<br/><br/>He went all the way to the deepest part of the space and a gigantic spatial mirror appeared in his line of sight.<br/><br/>In this spatial mirror, there were many unique flowers.<br/><br/>“This is? A spatial treasure?”<br/><br/>Wang Xian’s eyes sparkled..\t\t\t\t\t\t</div>", "images": {}, "success": true}