{"id": 933, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073766.html", "title": "Chapter 3935 - Chapter 3935: 3,934 People Of The Same Level Were Killed Instantly", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3935 - Chapter 3935: 3,934 People Of The Same Level Were Killed Instantly</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3935: 3,934 people of the same level were killed instantly<br/><br/>Translator: 549690339<br/><br/>“Yuan Hua, please enlighten us! ”<br/><br/>The young man flew to the sky and cupped his hands at Wang Xian.<br/><br/>“Wang Xian, please enlighten us. ”<br/><br/>Wang Xian cupped his hands at him as well and said.<br/><br/>Below them, all the students were looking at them with sparkling eyes.<br/><br/>On the side of the Ming Yi Saint Academy, a battle of this level was very exciting. With the strength of an eternal swordsman at level eight, he was already considered a top-notch student.<br/><br/>“Let’s begin then! ”<br/><br/>As Yuan Hua spoke, he moved his palm. A sharp sword appeared in his hand and shot directly at Wang Xian.<br/><br/>Wang Xian waved his arm and easily blocked the attack.<br/><br/>After the probing attack ended, Yuan Hua disappeared instantly!<br/><br/>Wang Xian saw that Yuan Hua drew a circle around him with the long sword in his hand!<br/><br/>Following that, he sensed something and attacked from behind!<br/><br/>The circular shape turned into an extremely sharp space disk and attacked<br/><br/>Yuan Hua directly.<br/><br/>“Huh?”<br/><br/>Yuan hua slightly adjusted his brows. With a wave of his arm, the sharp sword in his hand condensed into a powerful sword ray and slashed forward!<br/><br/>In the next instant, Wang Xian’s figure disappeared instantly and appeared at<br/><br/>Yuan Hua’s side.<br/><br/>Spatial teleportation. When one teleported to a certain place, they were both spatial swordsmen and could sense spatial fluctuations.<br/><br/>Therefore, the moment Wang Xian appeared, the sharp sword in Yuan Hua’s hand stabbed towards him.<br/><br/>“Disperse! ”<br/><br/>Wang Xian saw the sharp sword in his hand tremble.<br/><br/>At the position in front of him, the spatial disc that was slashed by Yuan Hua disintegrated into many sharp swords.<br/><br/>The sharp sword attacked Yuan Hua at a terrifying speed!<br/><br/>At the same time, he raised his long sword to meet Yuan Hua’s sword.<br/><br/>“This is bad!”<br/><br/>Yuan Hua sensed this scene and his expression changed slightly.<br/><br/>The sharp swords collided with each other. The spatial force of the two of them was about the same.<br/><br/>However, Yuan Hua’s back was attacked by more than ten sharp swords.<br/><br/>“Bang, Bang, Bang!”<br/><br/>A violent collision sound was heard. Cracks appeared on the spatial barrier on Yuan Hua’s body.<br/><br/>This caused Yuan Hua’s expression to change drastically. His body froze on the spot.<br/><br/>“Thank you for letting me win! ”<br/><br/>Wang Xian looked at him and cupped his hands indifferently.<br/><br/>(‘D * mn, it can’t be. Such a fast speed. The Victor has been decided just like<br/><br/>“This is an instant kill. Yuan Hua must have arrived at the Songyi Saint<br/><br/>Academy thousands of years ago. How could he be defeated so easily?” “That sword technique called Wang Xian is more ingenious. ”<br/><br/>The students below revealed a shocked expression when they saw this scene.<br/><br/>It was extremely rare for someone of the same level to defeat another opponent so quickly.<br/><br/>One had to know that they were all space practitioners. It was extremely difficult to determine the victor among those of the same level.<br/><br/>Although their sword techniques were inferior to the opponent, it was still very difficult to be defeated as long as one escaped.<br/><br/>In the previous battles, which one of them did not fight for an hour?<br/><br/>The outcome of the battle was determined just by a simple exchange of blows.<br/><br/>“Huh? What a powerful swordsmanship. ”<br/><br/>Yin Xueyue looked at Wang Xian and said with astonishment. “HMM, not bad. Your swordsmanship is very ingenious.”<br/><br/>Instructor he looked at Wang Xian and nodded his head in praise.<br/><br/>Wang Xian smiled and flew back to his previous position.<br/><br/>Yuan Hua’s expression changed slightly as he flew back. His expression was a little ugly.<br/><br/>It was hard for him to accept that he was defeated so easily by someone of the same level.<br/><br/>“Let’s go for the next one.”<br/><br/>At the side, the other two eternal swordsman level 8 students exchanged glances and began to spar.<br/><br/>This time, the strength of both parties was about the same. They fought for an hour but there was no result.<br/><br/>After that, the two of them did not continue fighting.<br/><br/>Student Wang Xian, it didn’t take much effort for you to spar with Yuan Hua just now. Let’s Spar.”<br/><br/>After the battle between the two of them ended, Yin Xueyue finally looked at Wang Xian and said.<br/><br/>Her strength had already reached the peak of level eight of the Eternal Swordsman. She could step into level nine of the eternal swordsman at any time.<br/><br/>She was publicly acknowledged as the strongest level eight eternal swordsman in the class.<br/><br/>She stared at Wang Xian, her eyes filled with fighting spirit.<br/><br/>sure!<br/><br/>Wang Xian nodded and teleported to the sky.<br/><br/>Yin Xueyue followed closely behind.<br/><br/>Instructor he used two barriers to protect them. “Student Wang Xian, your strength is very strong. Let’s Begin! ”<br/><br/>Yin xueyue stared at Wang Xian and said directly!<br/><br/>“Alright, I’m going to make my move!”<br/><br/>Wang Xian nodded his head. Waves of energy were injected into the longsword and started to swing it in front of him!<br/><br/>When Yin Xueyue saw the energy on Wang Xian’s sharp sword, her eyes revealed a look of vigilance!<br/><br/>Buzz<br/><br/>He didn’t give Wang Xian much of a chance. He immediately teleported in front of Wang Xian. It was filled with the tearing force of space and wrapped around him.<br/><br/>Sword Net! ”<br/><br/>Yin xueyue snorted coldly and displayed her powerful swordsmanship.<br/><br/>Under the cover of the sword net, Wang Xian felt that the space around him was a little unstable. He couldn’t teleport at all! Numerous sharp swords were flying towards him.<br/><br/>Sword Hum! ”<br/><br/>Wang Xian’s arm trembled. The sharp sword in his hand was suspended in front of him and started to rotate.<br/><br/>“Bang! Bang! Bang!”<br/><br/>The continuous sounds of collision rang out. All the attacks from the sword net were blocked.<br/><br/>“Sword chime as one! ”<br/><br/>The moment all the sword nets were blocked, a sharp sword formed from space attribute appeared above Wang Xian ‘s head. It instantly attacked Yin Xueyue!<br/><br/>This attack caused Yin Xueyue’s heart to tremble violently.<br/><br/>“How can it be so sharp?”<br/><br/>Yin Xueyue’s body moved and she hurriedly teleported away!<br/><br/>However, Wang Xian, who was staring at her, sensed the fluctuation of the space and attacked that direction directly.<br/><br/>The moment Yin Xueyue appeared, a sword ray slashed directly at the top of her head.<br/><br/>Crack! Crack<br/><br/>The space barrier on his body cracked slowly.<br/><br/>“How did you sense my teleportation location so quickly?”<br/><br/>Yin Xueyue’s expression changed slightly when she saw the sharp sword slashing at the top of her head. She asked Wang Xian in shock.<br/><br/>“Thank you! ”<br/><br/>Wang Xian smiled and cupped his hands without replying.<br/><br/>The improvement of one’s realm not only represented the improvement of one’s destructive power, but it also represented the improvement of one’s perception and reaction.<br/><br/>Wang Xian’s void dragon body was extremely terrifying in terms of the convenience of his senses.<br/><br/>Even if his senses required the support of his own energy.<br/><br/>However, his senses were still a few levels higher than those of the same level!<br/><br/>Therefore, Wang Xian was able to capture the location of his teleportation when Yin Xueyue teleported.<br/><br/>After all, teleportation required the use of the power of space.<br/><br/>All he needed to do was to capture the fluctuation of the power of space!<br/><br/>“Very strong sensing ability! ”<br/><br/>Instructor he looked at Wang Xian with a twinkle in his eves as he praised.<br/><br/>“This brother named Wang Xian is too strong, isn’t he?”<br/><br/>“He is simply insane. How can he be so terrifying when they are of the same level? Also, what sword technique did he use? It seems to be very strong. ”<br/><br/>“He can actually sense the location where Yin Xueyue teleported.. Amazing! He should be able to take on two or three people of the same level, right?”\t\t\t\t\t\t</div>", "images": {}, "success": true}