{"id": 931, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073762.html", "title": "Chapter 3933 - Chapter 3933: Under The Powerful Cultivation Speed Of", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3933 - Chapter 3933: Under The Powerful Cultivation Speed Of</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3933: Under the powerful cultivation speed of<br/><br/>3932..<br/><br/>Translator: 549690339<br/><br/>“Alright, class begins. Focus.”<br/><br/>On a small floating island in the Songyi Saint Academy, instructor he glanced at all the students who had arrived and said.<br/><br/>More than 20 students who had arrived immediately sat up straight and looked at instructor He.<br/><br/>“During class, I would like to introduce a new student to everyone. Student<br/><br/>Wang Xian, please take care of each other in the future. ”<br/><br/>Instructor he’s gaze landed on Wang Xian and introduced him to all the students around him.<br/><br/>Wang Xian stood up indifferently and swept his gaze across the students. “Thank you for your guidance! ”<br/><br/>Around him, seven to eight women were looking at Wang Xian. There was a glimmer in their eyes as they sized him up from top to bottom.<br/><br/>Some of the young men looked at Wang Xian and nodded their heads. Some of them did not have any change in their expressions. There were also a few of them who had a look of envy on their faces.<br/><br/>To be able to cultivate to the eternal realm, there was no one who was ugly. To be so strong, one’s appearance could be changed.<br/><br/>However, there was one thing that could not be changed, and that was the temperament.<br/><br/>That unique temperament.<br/><br/>Wang Xian had an inexplicable temperament. This temperament was something that even teacher he was a little surprised by back then.<br/><br/>At the very least, his temperament as the void sword emperor was not as good as Wang Xian’ s.<br/><br/>Wang Xian’s temperament was naturally the unique temperament of a king of a peak race, a top-notch expert in the nine-origin universe who had fought his way here undefeated.<br/><br/>This temperament was not something that could be easily cultivated.<br/><br/>“Next, let’s begin the explanation. If you have any doubts, tell us one by one.”<br/><br/>Teacher he said to them.<br/><br/>Next, it was time for the students to raise their cultivation doubts.<br/><br/>It was also the main content of the class.<br/><br/>They would raise all their questions and teacher he would answer them.<br/><br/>The students who came were all eternal swordsmen. There was the immortal sword king above them while teacher he was the Void Sword Emperor.<br/><br/>The difference was so huge that teacher he could easily answer any question.<br/><br/>Furthermore, he would give his own unique insights.<br/><br/>Wang Xian paused for a while and didn’t feel bored.<br/><br/>The space attribute was a brand new attribute for him and even the nine-origin universe.<br/><br/>Even though Wang Xian was very strong, he still needed a long time to understand it. If he had someone to help him analyze it, he would be able to learn it much faster.<br/><br/>One lesson for a month passed very quickly. Wang Xian felt that he had gained some benefits.<br/><br/>After returning to his house, Wang Xian continued to cultivate.<br/><br/>Now that he had no lack of cultivation resources, his cultivation speed was very fast.<br/><br/>The next year, he went to the classroom for another month. Following that, Wang Xian continued to cultivate.<br/><br/>Time flew by, and ten thousand years passed very quickly.<br/><br/>Wang Xian came out from a cultivation treasure land in the Ming Yi Saint Academy. A smile appeared on his face.<br/><br/>The treasure grounds of the Ming Yi Saint Academy required one to spend magic stones in order to be able to cultivate there.<br/><br/>Wang Xian had destroyed the king of a magical country and emptied a national treasury. Naturally, he did not lack these resources.<br/><br/>Cultivating here was much faster than just using the space stone.<br/><br/>After 10,000 years of cultivation, Wang Xian’s realm had already risen to the eighth level of the Eternal Divine Lord.<br/><br/>The speed of his cultivation was already extremely terrifying.<br/><br/>This was mainly due to Wang Xian using a large amount of resources. In addition to that, he could break the shackles of this realm with just a touch.<br/><br/>“It’s still a little slow. I’m only at the Eternal Swordsman Realm. I’ll probably need 10 ,ooo years to break through to the immortal sword King Realm. I don ‘t know how long it will take to reach the seventh or eighth level of the immortal sword King Realm. ”<br/><br/>This was the first time Wang Xian felt that cultivating was troublesome.<br/><br/>In the past, he could break through as long as he had sufficient resources. However, it was no longer possible now.<br/><br/>“Forget it. I’ll cultivate little by little. ”<br/><br/>Wang Xian shook his head. There was nothing he could do about it.<br/><br/>He disappeared in an instant and returned to his residence. He began to practice his sword techniques.<br/><br/>Heaven’s origin sword technique.<br/><br/>He had completely mastered the Heaven’s origin sword technique at his current realm.<br/><br/>However, mastering it was one thing. He had to integrate the Heaven’s origin sword technique into the space attribute.<br/><br/>Or, he had to integrate the space attribute into the Heaven’s origin sword technique.<br/><br/>This required some thought and understanding.<br/><br/>As an invincible sword technique, Wang Xian attached great importance to the Heaven’s origin sword technique.<br/><br/>For a sword technique of this level, it was important to accumulate energy and seal it.<br/><br/>Both of them were at level eight of the Eternal Swordsman. With the same amount of energy in their bodies, how could one make their attacks stronger than others?<br/><br/>As the saying goes, one power could break all techniques.<br/><br/>Both of them had the same strength and speed. How could one win against the other party?<br/><br/>Especially since both of them could unleash large-scale attacks. Under such circumstances, it would be very difficult to kill someone of the same level.<br/><br/>This was because no matter how powerful one’s techniques were, the other party would be able to unleash terrifying sword Qi from afar. If one could not get close, all of the techniques would be useless.<br/><br/>The terrifying aspect of the Heaven’s origin sword technique was similar to a formation.<br/><br/>While attacking, it would condense points in the air and detonate this point. It would affect the surrounding energy and could erupt with terrifying energy.<br/><br/>This was the terrifying aspect of the Heaven’s origin sword technique.<br/><br/>After Wang Xian obtained this haircut, he felt that this was probably much more terrifying than the formation wizards of the Voodoo Race.<br/><br/>After Wang Xian practiced the heaven’s origin sword technique for a while, he could feel how powerful it was.<br/><br/>This was also the reason why he was willing to practice it.<br/><br/>“Clang! Clang! Clang! ”<br/><br/>After Wang Xian had practiced the heaven’s origin sword technique for a thousand years, a series of bells rang in Wang Xian’s mind.<br/><br/>He sheathed his sword and looked towards the center.<br/><br/>“Today seems to be the day of the assessment. The assessment is held once every 20,000 years.”<br/><br/>Wang Xian thought of some rules of the Ming Yi Saint Academy and said.<br/><br/>His figure flashed and he arrived at the location of the school hall in an instant.<br/><br/>Buzz Buzz Buzz<br/><br/>When he arrived, the figures around him appeared one by one.<br/><br/>Compared to the students that Wang Xian had met in the past, there were many more people this time around.<br/><br/>He sensed that there were already 62 students around him.<br/><br/>Clearly, during these ten thousand years, there were more students who joined.<br/><br/>The once-in-20,000-year assessment, there was not a single student who did not return.<br/><br/>This was also the rule of Ming Yi Saint Academy. The assessment had to arrive.<br/><br/>All the students arrived. Some young men and women looked at the unfamiliar faces around them.<br/><br/>All of them had curious expressions on their faces.<br/><br/>“I wonder what realm Xu Xin, run, nie youwei and the rest have reached in these 20,000 years.”<br/><br/>“They should be reaching the ninth level or the peak of the eternal swordsman soon, right?”<br/><br/>“They have only entered the Songyi Saint Academy for 30 million years and have already advanced from the first level of the eternal swordsman to the present. They are really amazing! ”<br/><br/>Sounds of discussion could be vaguely heard from the surrounding areas.<br/><br/>Some gazes would look towards the center from time to time.<br/><br/>Wang Xian’s gaze looked over and landed on a few figures in the center.<br/><br/>There were five figures, three men and two women. There was a hint of arrogance on their bodies.<br/><br/>Eternal swordsman, level seven, level eight, level eight, level seven, level nine, level nine!<br/><br/>Wang Xian took a glance and saw their strength. There was no change in their expressions..\t\t\t\t\t\t</div>", "images": {}, "success": true}