{"id": 934, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073768.html", "title": "Chapter 3936 - Chapter 3936: 3,935 Had Defeated Someone Of A Higher Level Than Him", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3936 - Chapter 3936: 3,935 Had Defeated Someone Of A Higher Level Than Him</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3936: 3,935 had defeated someone of a higher level than him<br/><br/>Translator: 549690339<br/><br/>Gasps of surprise rang out continuously in the surroundings.<br/><br/>All the students looked at Wang Xian in astonishment. Their eyes were filled with envy.<br/><br/>Even Xu Xin and nie youwei, who were standing at the front, looked at Wang Xian in astonishment.<br/><br/>It was not easy to defeat a powerhouse of the same level with such ease.<br/><br/>Student Wang Xian, are you still going to challenge? Do you want to spar with a student of level nine eternal swordsman?”<br/><br/>Instructor he looked at Wang Xian and asked.<br/><br/>“Challenge A Level 9 eternal swordsman?”<br/><br/>Wang Xian thought for two seconds and nodded. “I want to give it a try! ”<br/><br/>“Alright! ”<br/><br/>Instructor he nodded his head.<br/><br/>“No Way. You want to challenge someone of a higher level?”<br/><br/>“It’s basically impossible to challenge someone of a higher level. As long as the level 9 eternal swordsman tries his best to defend, he can’t break through his attack!”<br/><br/>“That’s right. It’s only possible for a swordsman of the space attribute to challenge someone of a higher level with another attribute. For someone of the same space attribute to challenge someone of a higher level, the possibility is too small! ”<br/><br/>When the surrounding students heard that Wang Xian was going to challenge someone of a higher level, they were shocked.<br/><br/>The possibility of him challenging someone of a higher level with a similar space attribute was too small.<br/><br/>“He might just want to witness the strength of an eternal swordsman of level nine-<br/><br/>Some students whispered.<br/><br/>“Oh? I didn’t expect student Wang Xian to want to challenge someone of our level. Hehe, then let me give you some pointers! ”<br/><br/>Xu Xinrui looked at Wang Xian and raised his eyebrows slightly. With a flash, he arrived at the position above.<br/><br/>He looked at Wang Xian and the corners of his mouth curled up slightly.<br/><br/>There was a hint of arrogance on his face.<br/><br/>Although Wang Xian’s strength was beyond his expectations, he had more than ten ways to let him know how big the gap between them would be!<br/><br/>It was simply Wishful Thinking for an eternal swordsman of level eight to challenge a level nine!<br/><br/>Wang Xian looked at Xu Xinrui. His expression did not change at all as he teleported to the position above him.<br/><br/>Buzz! Buzz<br/><br/>Two streams of energy enveloped them. Teacher he looked at Wang Xian and said, “If you are hit twice in one attack, it will be considered a failure.”<br/><br/>Okay!<br/><br/>Wang Xian nodded at teacher he.<br/><br/>The offensive power of an eternal swordsman at level nine was not something he could withstand!<br/><br/>Being hit twice was enough to kill him.<br/><br/>“Come on, let me see your swordsmanship! ”<br/><br/>Xu Xinrui stood there with one hand behind his back and said to Wang Xian nonchalantly.<br/><br/>He didn’t put Wang Xian in his eyes at all.<br/><br/>What he wanted was to enter the top 30 of the academy in this assessment.<br/><br/>“Be careful, don’t be careless! ”<br/><br/>Wang Xian looked at the somewhat arrogant Xu Xinrun and said indifferently!<br/><br/>“Hehe, I can give you 10 seconds to attack.”<br/><br/>Xu Xinrun looked at Wang Xian and the corner of his mouth curled up slightly. “The gap is too big. Brother Run, you don’t have to worry at all! ”<br/><br/>“That’s right. Brother Run wants to enter the top 30 this year. Brother Run is already very strong among those of the same level. Even if you let him attack for ten seconds, it would be easy for him. ” “I reckon he can’t Even Break Brother Run’s defense! ”<br/><br/>The students below started to discuss.<br/><br/>Wang Xian saw it and shook his head slightly. He slowly gathered the power of space onto the sharp sword!<br/><br/>Buzz Buzz Buzz<br/><br/>Buzz Buzz Buzz<br/><br/>In the next instant, Wang Xian’s figure disappeared instantly and teleported to the left of Xu Xinran.<br/><br/>Xu Xinran sensed something and looked to the left with a smile on his face.<br/><br/>The moment Wang Xian arrived on the left, he immediately teleported to the right.<br/><br/>Xu Xinrun also turned his head to look at the right side. This time, he had a mocking expression on his face.<br/><br/>Wang Xian continued to teleport forward, backward, and in other directions.<br/><br/>Xu Xinrun also looked at them one by one in a mocking manner. In the end, he even shook his head.<br/><br/>Buzz<br/><br/>Wang Xian teleported to the position directly in front of him for the last time.<br/><br/>In one second, he completed more than ten teleportations.<br/><br/>“There are still nine seconds left. ”<br/><br/>Xu Xinrun saw Wang Xian returning to the spot in front of him once again. He thought that Wang Xian had no other way and continued to speak arrogantly.<br/><br/>Wang Xian looked at his arrogant expression and shook his head.<br/><br/>“Explode! ”<br/><br/>“Whoosh! Whoosh! Whoosh! ”<br/><br/>The moment he finished speaking, numerous space swords around Xu Xinrun released a terrifying aura and attacked him instantly.<br/><br/>The sudden attack brought with it the strange speed of space, causing Xu<br/><br/>Xinrun to not be able to react at all.<br/><br/>“Peng Peng Peng! ”<br/><br/>“Hualala!”<br/><br/>The sharp swords crashed into his body.<br/><br/>The space barrier on his body collapsed.<br/><br/>This space barrier was equivalent to his life.<br/><br/>“How is this possible?”<br/><br/>Xu Xinrun, who was floating in the air, had already reacted. However, it was too late. He watched as the spatial barrier on his body collapsed. His eyes were wide open and filled with disbelief.<br/><br/>“What kind of attack is this?”<br/><br/>His expression instantly turned ugly as he stared at Wang Xian.<br/><br/>“Teacher, let’s go next! ”<br/><br/>Wang Xian didn’t look at Xu Xinrun. He turned his head to look at teacher he below and said.<br/><br/>“Good, a very strong swordsmanship.”<br/><br/>Teacher he stared at him. His eyes were sparkling.<br/><br/>He was also slightly amazed by Wang Xian’s swordsmanship.<br/><br/>“NIE youwei, you do it! ”<br/><br/>Teacher he looked at nie youwei, who was the last eternal swordsman at level nine, and instructed.<br/><br/>“I was careless just now. I haven’t lost yet. I can defeat him in one move!”<br/><br/>Xu Xinrun’s expression changed drastically. He shouted loudly with a face full of unwillingness.<br/><br/>How could he admit defeat.<br/><br/>It was just his carelessness just now.<br/><br/>He hadn’t lost yet!<br/><br/>“What… What kind of sword technique is this? It’s so terrifying. It can actually break the defense of an eternal swordsman of level nine easily?”<br/><br/>“No Way. Even if Brother Run didn’t move, the spatial barrier around him could withstand the attacks of an ordinary eternal swordsman of level nine.<br/><br/>How could it be defeated in an instant?”<br/><br/>“So Strong. This Wang Xian is so strong. His attack method is very strong.<br/><br/>Brother Run was too careless this time! ”<br/><br/>When the students below saw this scene, they were shocked.<br/><br/>Just now, they said that Wang Xian couldn’t even break Xu Xinrun’s defense. In the end, he managed to break it in a second. Furthermore, without the spatial barrier, Xu Xinrun would have died!<br/><br/>This attack power was enough to kill a Level 9 eternal swordsman.<br/><br/>“Xu Xinrun is a little angry. Indeed, if he wasn’t careless just now, he wouldn’t have lost so miserably!”<br/><br/>They whispered when they saw Xu Xinrun ‘s angry expression.<br/><br/>Wang Xian shook his head slightly when he heard Xu Xinrun’s indignant roar. Such an arrogant person didn’t even know how he died!<br/><br/>“Someone like you, I can defeat you with a single strike! ”<br/><br/>When Xu Xinrun saw Wang Xian shaking his head with a hint of mockery, his expression instantly turned gloomy.<br/><br/>Buzz<br/><br/>His aura changed and he wanted to teleport to Wang Xian’s side.<br/><br/>However, just as he wanted to teleport, numerous spatial sharp swords appeared out of thin air around him.<br/><br/>One after another, the sharp swords pierced through the space.<br/><br/>However, at this instant, everyone felt as though space had frozen.<br/><br/>Xu Xinrun’s teleporting body was forced out of space, and the spatial swords stopped floating in front of him!<br/><br/>“Alright, if you’re Careless, you’ll lose your life. If you lose, you’ll lose! ”<br/><br/>Below, instructor he made his move and said..\t\t\t\t\t\t</div>", "images": {}, "success": true}