{"id": 939, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073778.html", "title": "Chapter 3941 - Chapter 3941: 3,940 To Challenge The Champion", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3941 - Chapter 3941: 3,940 To Challenge The Champion</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3941: 3,940 to challenge the champion<br/><br/>Translator: 549690339<br/><br/>“Tian (ge.”<br/><br/>In the middle of the rooftop of Songyi Saint Academy, Yi Ya greeted the yellow-robed young man with a smile.<br/><br/>Wu Qitian, Songyi Saint Academy’s Spatial Saint Son.<br/><br/>From this address, one could tell his status and status.<br/><br/>Around Wu Qitian, a group of students stood beside him with faces full of compliments.<br/><br/>“Sister Yi Ya, the competition has started, right? Is there anyone who wants to challenge you?”<br/><br/>Wu Qitian smiled and asked Yi Ya.<br/><br/>“Tian (ge, not yet. It has just started. However, there should be someone who wants to challenge you later. ”<br/><br/>Yi Ya also shook her head with a smile.<br/><br/>“Hehe, little sister Yi Ya, don’t worry. You have already mastered the sword technique that I taught you. Although that sword technique is not invincible, it is invincible in the Songyi Saint Academy. ”<br/><br/>Wu Qitian said confidently.<br/><br/>“Hehe, I naturally believe that. After all, brother Tian, you’ve walked the path of invincibility. ”<br/><br/>Yaya nodded with a smile.<br/><br/>“In this competition, Sister Yaya will definitely be first. After all, she has the guidance of our Lord Saint Son! ”<br/><br/>“This is inevitable. The Lord Saint Son has taught his own sword technique to sister Yaya, and Sister Yaya has also completely mastered it. ”<br/><br/>“Maybe we won’t be able to see Sister Yi Ya in the next competition. At that time, sister Yi Ya will also enter the Advanced Academy. ”<br/><br/>The students around said flatteringly!<br/><br/>“Holy Son. ”<br/><br/>Xu Xinrun, who was beside Wang Xian, looked over with a face full of longing. He could not help but exclaim.<br/><br/>“Very powerful?”<br/><br/>Wang Xian looked at the spatial holy son who was surrounded by everyone and asked doubtfully.<br/><br/>From what he could sense, this so-called spatial saint child was only at the peak of the void God Emperor Realm.<br/><br/>This strength was a little weak in his eyes.<br/><br/>“What do you think? Over 30 million years of cultivation to the peak of the Eternal Sword Emperor Realm, he has always been invincible among those of the same level. Not to mention the importance of the word ‘Saint Child’. This is one of the top ten saint children of our Ming Yi Saint Academy. ”<br/><br/>(‘I wonder how long it will take you to reach the level of the space saint child. You might never be able to achieve it. ”<br/><br/>Xu Xinrun said coldly to Wang Xian.<br/><br/>“Although the space attribute is very strong, it has always been known for being difficult to cultivate. ”<br/><br/>At this moment, Nie you glanced at Xu Xinrun, she whispered to Wang Xian,<br/><br/>“The space saint child has reached such a level at the age of 30 million years.<br/><br/>His talent in cultivating the space attribute is unique in the territory of the Songyi Saint Academy. It is said that the space saint child will be able to break through to the level of universe swordmaster soon.”<br/><br/>Songyi Saint Academy. It is said that the space saint child will be able to break through to the level of universe swordmaster soon. ”<br/><br/>“In our Ming Yi Saint Academy, the title of Saint represents the top of the top ten disciples of the Ming Yi Saint Academy. Each of them is a rare prodigy. ” Wang Xian nodded slightly when he heard nie youwei’s words.<br/><br/>He had also obtained some information about the saint from some of the memories he had absorbed.<br/><br/>The Top Ten Saints of the Ming Yi Saint Academy, six mages, and four swordsmen.<br/><br/>They had different attributes.<br/><br/>In addition, there were also saints and Saintesses in the other forbidden grounds of the sword and Magic Universe.<br/><br/>Usually, this represented the strength of the younger generation in the forbidden grounds of the Saint Academy.<br/><br/>Many saints and saintesses would go out to gain experience and make a name for themselves.<br/><br/>Although Ming Yi Saint Academy was a very weak Saint Academy, it also had saints and saintesses.<br/><br/>Wang Xian nodded his head slightly and didn’t pay too much attention to it.<br/><br/>He looked at the arena in front of him.<br/><br/>The battle had already begun.<br/><br/>The two students who were fighting were at the pinnacle of eternal mages.<br/><br/>In Wang Xian’s opinion, the battle between mages was somewhat similar to that of formation mages.<br/><br/>The difference was that the casting time of mages was much faster than that of formation mages.<br/><br/>Of course, the attack power was naturally reduced.<br/><br/>One was a fire element spellcaster while the other was a water element spellcaster.<br/><br/>The attacks from both sides were filled with powerful power.<br/><br/>The terrifying flames and water currents were like living creatures fighting in the air.<br/><br/>The Flames condensed into a fire dragon while the water currents condensed into a water current.<br/><br/>The battle was very exciting.<br/><br/>Wang Xian felt that this battle was much more exciting than the nine-origin universe.<br/><br/>The Sword and Magic Universe had an additional spatial attribute compared to the nine-origin universe. However, the cultivation systems of both parties were slightly different.<br/><br/>The powerhouses here did not have a divine kingdom.<br/><br/>In other words, they did not need to upgrade their divine kingdoms.<br/><br/>From this point of view, the nine-origin universe had a huge advantage.<br/><br/>In fact, the nine-origin universe was able to be relatively strong among the other universes because of the existence of the divine kingdom. The arrival of the god country could greatly increase one’s power.<br/><br/>The most important thing was life-saving methods.<br/><br/>In a battle between Great Beings, the most important thing was life-saving methods.<br/><br/>The disciples of the Great Beings in the sword and Magic Universe didn’t have this kind of ability. Once they were defeated, they might be killed by those of the same level.<br/><br/>This also made the attacking techniques and methods of the sword and magic universe more exquisite than those of the 9-origin universe.<br/><br/>If one didn’t work hard to improve, it would be easier for him to die.<br/><br/>The battle lasted for a day. In the end, the challenger didn’t succeed. The student who was ranked 30th succeeded in defending the arena.<br/><br/>The next challenge continued.<br/><br/>Each student challenger had a ranking student. The battles also broadened Wang Xian’s horizons!<br/><br/>Time passed day by day. Wang Xian watched for half a year.<br/><br/>Beside him, Xu Runxin and nie youwei had both challenged.<br/><br/>Currently, NIE youwei had successfully challenged the 27th ranked student. On the other hand, Xu Runxin had failed to challenge the 30th ranked student.<br/><br/>“Failed. Next! ”<br/><br/>As time passed, the challenge was not as intense as it was at the beginning.<br/><br/>Some of the students had a little understanding of each other’s strength.<br/><br/>Wang Xian looked around and slowly stood up.<br/><br/>“Oh? Student Wang Xian, are you going to challenge me? With your strength, you should be able to rank in the top 20, right?”<br/><br/>NIE youwei, who was at the side, smiled when she saw Wang Xian getting ready to challenge him.<br/><br/>“Yes, I’m going to challenge you! ”<br/><br/>Wang Xian nodded. Since he was here, he would have fun.<br/><br/>He moved his body and teleported, instantly landing at the top position.<br/><br/>After every battle, the illusory pyramid would appear.<br/><br/>The challenger only needed to fly to one of the name booths in the pyramid to challenge this student.<br/><br/>Wang Xian’s figure was illusory as he slowly materialized at the top of the pyramid.<br/><br/>Naturally, he had to challenge the strongest disciple of the Ming Yi Saint Academy.<br/><br/>Yi Ya, who was at the pinnacle of the eternal swordsman with spatial attributes.<br/><br/>From the start of the battle until the end, no one challenged Yi Ya, who was ranked first.<br/><br/>This also represented Yi Ya’s prestige and strength.<br/><br/>“Eh? What?”<br/><br/>Nie youwei was slightly shocked when she saw Wang Xian appearing at the top. A look of astonishment appeared on her face.<br/><br/>“Is… is he crazy? He actually wants to challenge Yi Ya, who is ranked first. Does he think that he can fight two levels above him?”<br/><br/>Xu Xinrun had been paying attention to Wang Xian when he was preparing to challenge him.<br/><br/>When he saw that Wang Xian was actually standing at the top, his expression froze slightly..\t\t\t\t\t\t</div>", "images": {}, "success": true}