{"id": 948, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073796.html", "title": "Chapter 3950 - Chapter 3950: No. 3949 Mingyi Saint Academy, Lower Your Head! Lower Your Head", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3950 - Chapter 3950: No. 3949 Mingyi Saint Academy, Lower Your Head! Lower Your Head</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3950: No. 3949 Mingyi Saint Academy, Lower Your Head! Lower Your Head<br/><br/>Translator: 549690339<br/><br/>The strong should not be humiliated.<br/><br/>Sometimes, this sentence was not unreasonable.<br/><br/>Now, the three principals of Mingyi Saint Academy, who were in the ruler realm, had no idea of Wang Xian’s actual strength.<br/><br/>However, they did not dare to offend him completely.<br/><br/>Even if Wang Xian had already killed some of the strong practitioners of Mingyi Saint Academy.<br/><br/>This was because if they could not kill Wang Xian, with the strength of the Songyi Saint Academy, provoking a powerhouse in the ruler realm would bring great trouble to the Songyi Saint Academy.<br/><br/>The simplest thing was that when a powerhouse in the ruler realm targeted the students and teachers of their academy, they could not do anything about it.<br/><br/>It was even possible that they would fall completely because of it.<br/><br/>Therefore, they had to lower their heads to Wang Xian.<br/><br/>They could only lower their heads.<br/><br/>This was something that they had no choice but to do.<br/><br/>Most importantly, it was the spatial saint son of the Songyi Saint Academy who had provoked this existence first.<br/><br/>“Wu Qitian and his father should have been resurrected. Leave their lives to me and Pll leave.”<br/><br/>Wang Xian spoke when he heard the three principals ‘words.<br/><br/>The three principals could only nod their heads helplessly and report to their subordinates, “Bring Wu Qitian and Wu Zhihong over! ”<br/><br/>The few powerhouses nodded their heads immediately and responded. Their bodies moved and they flew back immediately.<br/><br/>“May I know where this friend comes from?”<br/><br/>The few subordinates brought Wu Qitian and his father over. The principal in the middle looked at Wang Xian and couldn’t help but ask.<br/><br/>“They came from afar! ”<br/><br/>Wang Xian replied indifferently.<br/><br/>The principal nodded and didn’t ask further. He was afraid that the conflict would escalate!<br/><br/>“No, no, no. Elder, save me, save me!”<br/><br/>At this moment, screams of pain could be heard.<br/><br/>An extremely weak young man and middle-aged man were brought over.<br/><br/>They were Wu Qitian and Wu Zhihong who had been resurrected.<br/><br/>However, at this moment, they had offended someone whom they could not afford to offend. Hence, they were completely given up by the Ming Yi Saint Academy.<br/><br/>Whoosh<br/><br/>Wu Qitian and Wu Zhihong were brought over and thrown directly at Wang Xian.<br/><br/>The experts from the Ming Yi Saint Academy looked on silently. Their faces were filled with helplessness.<br/><br/>“No, no, no!”<br/><br/>After Wu Qitian saw Wang Xian’s figure, a look of horror and despair appeared on his face.<br/><br/>His body trembled violently. He looked at his father and the three principals with a pleading look.<br/><br/>When Wu Zhihong saw this scene, his body only trembled violently. His face was filled with unwillingness.<br/><br/>He didn’t expect that the enemy he provoked would be so terrifying.<br/><br/>He also understood that Ming Yi Saint Academy had already given up on him and his son.<br/><br/>He was filled with fear and dread towards Wang Xian.<br/><br/>The strength of this mysterious young man was too strong.<br/><br/>“Bastard, why did you provoke such an existence?”<br/><br/>He couldn’t help but berate his son.<br/><br/>“Just be more careful in your next life! ”<br/><br/>Wang Xian said to him faintly. With a wave of his arm, a wave of energy enveloped them.<br/><br/>Before he killed Wu Zhihong, he had conveniently absorbed his memories!<br/><br/>“At least you guys from the Ming Yi Saint Academy are sensible enough to avoid the danger of annihilation! ”<br/><br/>After Wang Xian killed the two of them, his gaze swept across the three principals of the Ming Yi Saint Academy as well as the group of experts.<br/><br/>His body moved and he flew into the distance.<br/><br/>Boom<br/><br/>At this moment, Wang Xian revealed a faint pressure.<br/><br/>Bang! Bang! Bang<br/><br/>Under this pressure, the three principals who were suspended in the air fell directly to the ground.<br/><br/>They crashed heavily onto the ground. Their faces were filled with paleness and shock.<br/><br/>Gulp<br/><br/>“How… How is this possible?”<br/><br/>“What kind of existence is he?”<br/><br/>The three principals shouted in shock.<br/><br/>However, the universe knight level beings around them were also lying on the ground, their bodies trembling violently.<br/><br/>This was the terrifying pressure from the outside world, and their souls were trembling.<br/><br/>It took them more than 10 seconds to react.<br/><br/>The three deans stood up with lingering fear, and they looked at each other. “What level is this great being?”<br/><br/>One of the deans couldn’t help but growl.<br/><br/>“I don’t know. Absolute universe masters above level five can make us unable to move, this…”<br/><br/>The other Dean was terrified!<br/><br/>“How did this damn Wu Qitian offend such an existence?”<br/><br/>The last Dean said with a gloomy expression and looked at his subordinates.<br/><br/>“Principal, according to the information we received, this mysterious expert is a student of our Songyi Saint Academy’s Elementary Academy. He is an eternal swordsman with the spatial attribute. No one knew that he would be so terrifying. ”<br/><br/>One of his subordinates spoke with a bitter expression.<br/><br/>From the pressure they had felt just now, if they hadn’t admitted defeat, the entire Songyi Saint Academy might have already suffered a calamity. “A student from the elementary academy? Spatial attribute?”<br/><br/>Hearing this, the three principals narrowed their eyes.<br/><br/>“In that case, the mirror flower in the mirror world was taken away by this person?”<br/><br/>“It should be him, or it could only be him. However, the things he left behind are much more precious than the mirror flower. ”<br/><br/>The three principals spoke and shook their heads slightly.<br/><br/>“The continent is huge. With a flash, there is still a mountain high up. Compared to the central continent, our place is already very remote. To think that there are still such terrifying powerhouses roaming around. ”<br/><br/>The central principal sighed slightly.<br/><br/>There was still lingering fear in his heart.<br/><br/>This time, it could be considered as the luck of the Ming Yi Saint Academy.<br/><br/>They had encountered a powerhouse who was not bloodthirsty.<br/><br/>If they were to encounter someone who would wipe out their entire clan with a single word of disagreement, the Ming Yi Saint Academy would be finished.<br/><br/>“Let’s Find a place to cultivate! ”<br/><br/>After flying out of the Ming Yi Saint Academy, Wang Xian revealed a smile on his face.<br/><br/>In the past 20,000 years, although Wang Xian’s strength didn’t increase by much, his understanding of this universe had increased by a lot.<br/><br/>Furthermore, he had the overlord-level mirrored flower in his hands.<br/><br/>These mirrored flowers were sufficient for him to advance to the level of a universe knight very quickly.<br/><br/>Wang Xian floated in the sky and flew forward according to the memories in his mind.<br/><br/>After flying for a few days, he arrived in front of an ocean.<br/><br/>This was a vast ocean. According to the memories he obtained, there were a large number of demonic beasts living in this ocean.<br/><br/>There were even terrifying demonic beasts on the level of the Masters of the universe.<br/><br/>As a divine dragon, Wang Xian preferred places in the ocean.<br/><br/>He was prepared to build a cave abode here to cultivate!<br/><br/>After entering the ocean, Wang Xian swam towards the center.<br/><br/>After flying for a week, he found a good spot.<br/><br/>Following that, he waved his arm and built a cave abode.<br/><br/>Following that, Wang Xian took out the mirror-image flower and began to cultivate.<br/><br/>He wanted to use up all of the mirror-image flowers and raise his space attribute to its limit.<br/><br/>Then he was going to the center of the universe!\t\t\t\t\t\t</div>", "images": {}, "success": true}