{"id": 949, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073798.html", "title": "Chapter 3951 - Chapter 3951: The 3,950 Heaven’S Favorites Were Like Stars, And The Saints Were Everywhere!", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3951 - Chapter 3951: The 3,950 Heaven’S Favorites Were Like Stars, And The Saints Were Everywhere!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3951: The 3,950 heaven’s favorites were like stars, and the Saints were everywhere!<br/><br/>Translator: 549690339<br/><br/>Time passed. Wang Xian was a cultivator in the ocean.<br/><br/>A million years passed by in a flash.<br/><br/>The flower of the mirror image slowly dissipated in front of Wang Xian.<br/><br/>As the last flower of the mirror image dissipated, Wang Xian opened his eyes and revealed a smile.<br/><br/>“It has improved a lot more than I expected. ”<br/><br/>Wang Xian opened his mouth and felt the space power in his body.<br/><br/>His current realm had already advanced to the level of a level five universe knight.<br/><br/>It was already considered very fast for him to advance to such a stage in a million years.<br/><br/>After all, every breakthrough required him to break through one shackle after another.<br/><br/>This was partly due to the realm of Wang Xian’s actual body as well as the fact that he had absorbed the memories of a few space attribute powerhouses and obtained some knowledge about the convenience of cultivation.<br/><br/>“The next improvement might be a little slower. However, if I can obtain a large amount of resources, the speed of Improvement shouldn’t be Slow either! ”<br/><br/>Wang Xian spoke.<br/><br/>Resources were the most important thing for cultivators in the universe.<br/><br/>Resources represented opportunities and the speed of improvement. Without resources, no matter how high one’s talent was, it would be useless.<br/><br/>Wang Xian’s body moved and immediately flew upwards.<br/><br/>After flying out of the sea, he flew towards the center of the sword and magic continent according to the memories in his mind.<br/><br/>Buzz! Buzz! Buzz<br/><br/>Activating the spatial power in his body, Wang Xian continued to teleport.<br/><br/>Spatial teleportation was the greatest advantage of spatial cultivators.<br/><br/>It was also the most powerful point of spatial cultivators.<br/><br/>Teleportation, appearing or disappearing.<br/><br/>It was extremely terrifying.<br/><br/>Wang Xian tried teleportation for a few hours consecutively. After familiarizing himself with it, he flew straight away.<br/><br/>Currently, the speed of teleportation was not as fast as his own speed.<br/><br/>Especially with the help of the Heaven’s origin treasure fragment.<br/><br/>After flying continuously for ten years, Wang Xian began to use the teleportation formation to teleport over a long distance midway.<br/><br/>It took Wang Xian over a thousand years before he arrived at the center of the Sword and Magic Continent.<br/><br/>The center also represented the core of the universe, the place with the densest energy.<br/><br/>In the center, it was easier for all kinds of treasures to be born.<br/><br/>Wang Xian sat quietly in a corner in an employment square, drinking tea.<br/><br/>The hiring Plaza was a unique feature of the sword and Magic Universe.<br/><br/>Here, you could find all kinds of information and earn some resources.<br/><br/>Of course, this required completing some missions or having enough magic stones.<br/><br/>Other than that, you could also post all kinds of missions here.<br/><br/>Every city had such a hiring plaza.<br/><br/>Wang Xian sat there and waved his arm. Using the soul capturing technique, he obtained all kinds of memories and information.<br/><br/>Nobody would know!<br/><br/>This was the fastest way for Wang Xian to gather information.<br/><br/>Wang Xian had basically gained a deep understanding of this universe since he came all the way here!<br/><br/>(‘I heard that many experts from the sacred grounds and forbidden grounds of the Saint Academy have gone to the Void Moon. TSK TSK, it’s really lively<br/><br/>LIICIC.<br/><br/>“Indeed, many Heaven’s pride and saint children have gone there. After all, the Void Moon used to be an ancient battlefield. There are many treasures inside. If one is lucky, he or she might be able to obtain some inheritance.”<br/><br/>“To Heaven’s pride and Saint Children, this is an absolute treasure ground. After all, the Void Moon is unique. Experts at the ruler level of the universe can not enter. ”<br/><br/>At this moment, sounds of discussion could be heard from the surrounding areas.<br/><br/>Wang Xian listened from the side. His expression did not change at all.<br/><br/>Forbidden Ground, Void Moon!<br/><br/>Wang Xian had already learned about this news and had already understood a lot.<br/><br/>Void Moon was the name of a forbidden ground.<br/><br/>This was a forbidden ground with a strong influence. At its peak, it once had thousands of powerhouses at the level of the universe’s ruler.<br/><br/>However, because of an internal conflict, the entire void Moon became a ruin, and all the Great Beings died.<br/><br/>Hence, to the great beings and disciples of the outside world, the Void Moon became a treasured land.<br/><br/>However, the Void Moon had a special characteristic.<br/><br/>The Forbidden Land, the Void Moon, was called the Void Moon because it was a special treasured land.<br/><br/>Within this treasured land, the creator of the Void Moon had used some unknown method to prevent the great beings of the ruler realm from entering. Of course, this ruler realm expert was only limited to the outside world.<br/><br/>To the rulers of the Void Moon, they were allowed to enter.<br/><br/>However, the experts of the Void Moon had all died. This resulted in only those below the ruler realm wanting to enter the Void Moon.<br/><br/>Originally, the Forbidden Land of the Void Moon used this method to protect the invasion of other powerful factions.<br/><br/>Now, it had become a treasured land for those below the ruler realm.<br/><br/>However, this treasured land was also filled with danger.<br/><br/>Within the nest of a forbidden land, there would naturally be some defensive and offensive magic arrays.<br/><br/>Magic arrays of this level were extremely deadly for those below the ruler realm!<br/><br/>Opportunities and dangers coexisted.<br/><br/>This void Moon had only been unintentionally opened in the past few hundred years, attracting a large number of sacred grounds and forbidden grounds.<br/><br/>A large number of Heaven’s favorites and holy sons came over.<br/><br/>“On the central continent, Heaven’s favorites are as bright as stars, and holy sons are unrestrained. Sigh, if only I could become a heaven’s favorite holy son!<br/><br/>At the side, a middle-aged man couldn’t help but exclaim.<br/><br/>Wang Xian took a glance, moved his body, and left immediately.<br/><br/>Just as the middle-aged man had said, at the center of the Sword and Magic Universe, Heaven’s favorites were as bright as stars, and holy sons were unrestrained.<br/><br/>On the sword and magic continent, 80% of them were humans.<br/><br/>This also caused the difference between this universe and the nine-origin universe.<br/><br/>The nine-origin universe had all sorts of bloodlines and constitutions.<br/><br/>Furthermore, the powerful experts of the powerful races had created powerful cultivation methods according to their bloodlines and constitutions.<br/><br/>Only the experts of their own races could cultivate.<br/><br/>Bloodlines and Constitutions were more important in the nine-origin universe.<br/><br/>Without bloodline and system, it was extremely difficult for the strong disciples of the high-level races of the middle-level races to reach the peak.<br/><br/>The sword and the magic universe were different. They had all kinds of cultivation methods and could cultivate as long as they had them.<br/><br/>In comparison, the threshold was very low.<br/><br/>Every living being, if they were lucky, would have the chance to step into the ruler realm.<br/><br/>This also resulted in a large number of strong ones in the ruler realm in this universe.<br/><br/>At the very least, according to the memories that Wang Xian obtained, there were not many masters in the ruler realm in this universe.<br/><br/>However, Wang Xian felt that there were fewer masters in the ruler realm who were at the top level compared to the nine-origin universe.<br/><br/>Having a bloodline physique had the benefits of having a bloodline physique. This kind of cultivation method also had the benefits of this kind of cultivation method.<br/><br/>Compared to ordinary living beings, the cultivation environment in the sword and Magic Universe was better.<br/><br/>There were indeed many heaven’s favorites and saint children here.<br/><br/>However, these heaven’s favorites and saint children were addressed to powerhouses below the level of a ruler.<br/><br/>“There’s a treasure land. Naturally, I have to go and take a look! ”<br/><br/>Wang Xian received the news about the forbidden land, the Void Moon. He was prepared to go and take a look..\t\t\t\t\t\t</div>", "images": {}, "success": true}