{"id": 947, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073794.html", "title": "Chapter 3949 - Chapter 3949: 3948 Mingyi Saint Academy Lowered Its Head! Go", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3949 - Chapter 3949: 3948 Mingyi Saint Academy Lowered Its Head! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3949: 3948 Mingyi Saint Academy lowered its head! Go<br/><br/>Translator: 549690339<br/><br/>“Aren’t you being a little too arrogant?”<br/><br/>Wang Xian’s statement that he wanted to take Wu Qitian’s life caused the faces of the experts from Mingyi Saint Academy to Darken.<br/><br/>The mage who was the leader of the group, who was at the peak of the Universe Knight Realm, stared at Wang Xian and said coldly!<br/><br/>“I’ll give you three seconds to consider. ”<br/><br/>Wang Xian’s gaze landed on the mage as he continued to speak calmly!<br/><br/>“Hmph, I want to see who is so arrogant to dare to cause trouble and kill people in our Ming Yi Saint Academy. I want to see who dares to come to our Ming Yi Saint Academy and kill my son, Wu Zhihong. ”<br/><br/>As soon as Wang Xian finished his sentence, an extremely cold voice came from the sky before the spellcaster could reply.<br/><br/>Buzz<br/><br/>Following that, a figure appeared and stared at Wang Xian with killing intent.<br/><br/>It was a middle-aged man. His body was filled with surging space energy.<br/><br/>Wang Xian looked at him with his eyes gleaming.<br/><br/>The middle-aged man stared at Wang Xian with a strong killing intent.<br/><br/>Wu Zhihong was the strongest spatial swordsman in the Ming Yi Saint Academy and an expert at the peak of the Universe Knight Realm.<br/><br/>As he was a spatial cultivator, he was almost invincible in terms of his combat strength and ability to escape.<br/><br/>Even an existence at the master level one or two would find it difficult to kill him.<br/><br/>“Then I’ll Kill You First! ”<br/><br/>Wang Xian’s face turned cold when he saw that Wu Qitian’s father had arrived.<br/><br/>He waved his arm and a nine-colored sharp sword condensed and locked onto Wu Zhihong.<br/><br/>After the nine-colored sharp sword was condensed, it arrived in front of Wu Zhihong in an instant.<br/><br/>From the moment Wang Xian made his move to the moment when the sharp sword arrived in front of him, it was only an instant.<br/><br/>Wu Zhihong didn’t even have the time to react.<br/><br/>In the surrounding area, the experts from the Ming Yi Saint Academy didn’t even have the time to react.<br/><br/>The sharp sword pierced through Wu Zhihong’s body in an instant. The terrifying destructive power caused him to widen his eyes and was filled with astonishment.<br/><br/>“What?”<br/><br/>When the sharp sword pierced through Wu Zhi Hong, the surrounding great beings from Ming Yi Sacred Academy finally reacted.<br/><br/>They looked over, their pupils slightly constricted, and their faces revealed a look of shock.<br/><br/>Wu Zhi Hong didn’t even have time to react before he was killed?<br/><br/>How was this possible?<br/><br/>One had to know that Wu Zhi Hong was an invincible existence below the ruler realm in their Ming Yi Sacred Academy.<br/><br/>A Pinnacle Universe Knight with space attributes was instantly killed, and he didn’t even have time to react.<br/><br/>Then, what realm was this mysterious young man at?<br/><br/>However, at this moment, Wu Zhi Hong’s body suddenly shattered like glass.<br/><br/>His figure appeared beside him.<br/><br/>At this moment, his face was extremely pale. His face was filled with horror.<br/><br/>He stared at Wang Xian in horror. His forehead was filled with cold sweat!<br/><br/>Wang Xian was still staring at him quietly. His face was filled with indifference.<br/><br/>Buzz<br/><br/>At this moment, the nine-colored sharp sword did not disappear. It was still floating there.<br/><br/>The moment Wu Zhihong’s body reappeared, the sharp sword continued to attack.<br/><br/>“Damn it, how is this possible?”<br/><br/>“What level are you at exactly?”<br/><br/>Wu Zhihong saw the sharp sword attacking him again and shouted in horror.<br/><br/>Buzz<br/><br/>This time, he reacted and disappeared in an instant!<br/><br/>However, the sharp sword was still chasing after him.<br/><br/>Whoosh<br/><br/>Two seconds later, the sharp sword flew over with a corpse.<br/><br/>The corpse was none other than Wu Zhihong.<br/><br/>Wang Xian’s sharp sword carried the power of wind and thunder to lock down enemies.<br/><br/>This came from the incipient saint wings.<br/><br/>When Wang Xian’s incipient saint wings were completely fused, an image of an inheritance appeared.<br/><br/>In the image, an extremely powerful bird-like creature expert was killing a spatial expert from the royal family of the Void Universe.<br/><br/>The powerful power of wind and thunder to lock down enemies was able to track down and kill many spatial-attributed experts.<br/><br/>Now, Wang Xian also possessed this ability.<br/><br/>He could also easily hunt down and kill space-attributed powerhouses.<br/><br/>“Hiss, this… this…”<br/><br/>However, when all the surrounding experts from the Songyi Sacred Academy saw this scene, they revealed shocked expressions.<br/><br/>Wu Zhihong was the strongest space-attributed cultivator in the songyi sacred academy.<br/><br/>He was an existence at the peak of the Universe Knight Realm.<br/><br/>His strength was not the strongest in their Songyi Sacred Academy, and he had yet to reach the ruler realm.<br/><br/>However, due to his spatial attribute, even the ruler of their Songyi Sacred Academy would find it difficult to kill him.<br/><br/>However, Wu Zhihong was actually killed so easily.<br/><br/>The other party had only used one move and used his energy to form a sharp sword to kill him.<br/><br/>How terrifying was his strength?<br/><br/>Everyone took a deep breath and looked at Wang Xian with respect.<br/><br/>“Senior, Wu Qitian has offended you. We will give you an explanation.”<br/><br/>The leader of the group, an expert at the peak of the Universe Knight Realm, quickly spoke to Wang Xian.<br/><br/>At the same time, they also urgently transmitted some information about Wang Xian to the dean.<br/><br/>Now, they were 100% sure that Wang Xian was an existence at the level of a universe overlord.<br/><br/>Furthermore, he wasn’t an ordinary universe overlord.<br/><br/>This strength was enough to clash with the Ming Yi Saint Academy. In fact, they might not even be a match for him.<br/><br/>Against such an expert, it wasn’t something that they could decide.<br/><br/>This still needed the dean and the rest to handle personally.<br/><br/>Buzz Buzz<br/><br/>As soon as the leader of the Top-notch Universe Knights finished his sentence, he sensed Wu Zhihong’s death. The three masters of the universe of the Ming Yi Sacred Academy who had received the message flew over.<br/><br/>Their figures appeared in the sky. They looked at Wang Xian from afar and frowned as they sensed him.<br/><br/>“The dean and the rest are here! ”<br/><br/>“Greetings, Dean!”<br/><br/>The surrounding experts sensed something and immediately bowed respectfully to the three elders.<br/><br/>“My Friend, can’t this matter be settled peacefully?”<br/><br/>One of the dean of the Ming Yi Saint Academy looked at Wang Xian and spoke with a frown.<br/><br/>Wu Hongtian’s death and Wang Xian’s aura made the three deans immediately conclude that Wang Xian was not simple.<br/><br/>Therefore, they didn’t dare to offend him rashly.<br/><br/>“You guys can try to stop him. However, this price will cost you your lives. ”<br/><br/>Wang Xian looked at them and spoke calmly.<br/><br/>His words made the three principals’faces turn ugly.<br/><br/>Wang Xian was too strong.<br/><br/>However, Wang Xian’s strength made them fearful.<br/><br/>To be able to kill Wu Zhihong in an instant, his strength was definitely not weaker than theirs.<br/><br/>Such an enemy would either be able to leave him here completely or not offend him.<br/><br/>Otherwise, the outcome of the Ming Yi Saint Academy would be very miserable.<br/><br/>“Phew, alright. Wu Qitian has been unfaithful to this friend. The strong should not be humiliated. He is up to you to deal with! ”<br/><br/>The three principals looked at each other with sullen faces and said helplessly..\t\t\t\t\t\t</div>", "images": {}, "success": true}