{"id": 946, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073792.html", "title": "Chapter 3948 - Chapter 3948: Under The Invincible Power Of 3947", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3948 - Chapter 3948: Under The Invincible Power Of 3947</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3948: Under the invincible power of 3947<br/><br/>Translator: 549690339<br/><br/>“Give me an explanation within three seconds! ”<br/><br/>Wang Xian easily killed the leader of the group of protectors. His gaze landed on the rest of the protectors as he spoke indifferently!<br/><br/>“Senior, let’s talk about it properly. ”<br/><br/>One of the protectors looked at Wang Xian and felt his scalp go numb.<br/><br/>At this moment, they were completely obedient.<br/><br/>The strength of this mysterious young man in front of them was so terrifying that it made one’s hair stand on end.<br/><br/>There was a 70% chance of him reaching the level of a universe overlord.<br/><br/>After all, they were in the Ming Yi Sacred Academy. The only one who dared to kill someone in their place was probably the universe overlord.<br/><br/>There was a second possibility, and that was that the background of this mysterious young man was not simple!<br/><br/>When Wang Xian heard the words of the protector, his expression did not change. He just looked at them quietly.<br/><br/>When the group of protectors saw this situation, they looked at each other. All of them looked extremely embarrassed.<br/><br/>Three seconds.<br/><br/>If they did not give this mysterious young man a reply within three seconds, they would probably be attacked!<br/><br/>“Phew, senior, you can settle it however you want. We will listen to you. ”<br/><br/>One of the protectors could only speak to Wang Xian helplessly.<br/><br/>With Wang Xian’s strength, he didn’t allow them to resist.<br/><br/>Furthermore, they didn’t have any masters who were at the level of masters of the universe here. They didn’t dare to say anything too extreme.<br/><br/>“Then I will settle it myself! ”<br/><br/>Wang Xian nodded his head faintly. He looked at the space saint, Wu Qitian, with a cold look in his eyes.<br/><br/>“If you dare to kill me, our Songyi Saint Academy will not let you off. My father will definitely not let you off either. ”<br/><br/>Wu Qitian stared at Wang Xian. His expression kept changing as he shouted loudly.<br/><br/>“Killing you is like slaughtering a dog! ”<br/><br/>Wang Xian looked at him. With a wave of his arm, an energy was injected into his body.<br/><br/>Following that, Wu Qitian’s divine melody slowly disappeared.<br/><br/>“Just you wait, just you wait. ”<br/><br/>Wu Qitian felt that his body was slowly dissipating. A ferocious expression appeared on his face.<br/><br/>“Hehe! ”<br/><br/>Wang Xian looked at him with a smile. “Don’t worry, I will find you soon. Very soon!<br/><br/>Wu Qitian’s expression changed slightly when he heard his words.<br/><br/>However, his body vanished completely.<br/><br/>“The space saint is dead. He killed him! ”<br/><br/>“Hiss, he killed the space saint in front of all the Guardians!”<br/><br/>“His strength is terrifying. He isn’t a simple student. He even killed a guardian, let alone our space saint! ”<br/><br/>All the teachers and students in the surroundings were shocked when they saw this scene.<br/><br/>He killed the saint directly.<br/><br/>Even their guardians couldn’t do anything about it!<br/><br/>“Wu Qitian has a resurrection treasure. He isn’t completely dead yet. Bring me to the sacred Daoist sect of the Ming Yi Saint Academy. ” Wang Xian looked at the guardians and said faintly!<br/><br/>“To the sacred place?”<br/><br/>When the protectors heard Wang Xian’s words, their pupils constricted again.<br/><br/>After killing the space saint son, he did not leave immediately.<br/><br/>Instead, he realized that the space saint son had a resurrection treasure. He wanted to go to the sacred place now.<br/><br/>The sacred place was the origin of the Songyi Saint Academy.<br/><br/>There, they had all the resources of the Songyi Saint Academy as well as the most precious treasure.<br/><br/>Now, he actually wanted to go there to continue killing the space saint son.<br/><br/>This? ?<br/><br/>What kind of strength and resources did he have that he dared to be so arrogant? He wanted to go to a Saint Academy to kill a Saint Son? If he was really killed, then this Saint Academy would lose a lot of face.<br/><br/>They couldn’t afford to lose face with this person!<br/><br/>Senior, we have already informed the powerhouses in the academy about this matter. The powerhouses in our academy will talk to You!”<br/><br/>One of the protectors said to Wang Xian with a solemn face.<br/><br/>Wang Xian’s strength was not something they could fight against. They didn’t dare to say anything harsh either!<br/><br/>“I will go there myself! ”<br/><br/>Wang Xian looked somewhere and flew over immediately.<br/><br/>In the Elementary Academy of the Saint Academy, there was a teleportation formation that could directly reach the advanced academy.<br/><br/>After absorbing the memories of the Space Saint Son, Wang Xian knew how to go there.<br/><br/>In fact, in the mirror world, Wang Xian had absorbed the memory of the few powerhouses. He knew Ming Yi Saint Academy very well.<br/><br/>“Let’s Go! ”<br/><br/>When the group of protectors saw Wang Xian flying directly toward the center of the academy, their faces darkened. They immediately followed closely behind!<br/><br/>At the same time, the news from this side had already been quickly transmitted to the powerhouses in the Saint Academy.<br/><br/>As a sacred academy, even if they weren’t strong, there were still many universe knights!<br/><br/>They reacted very quickly to such a crisis!<br/><br/>‘l’ne Advanced Academy quickly round out about tne situation.<br/><br/>“Oh my god, he actually wants to go directly to our sacred academy, this… ” “Maybe the space saint son really has some feelings for this person, which is why he was angered. ”<br/><br/>“What is his identity? How dare he be so unscrupulous! ”<br/><br/>In the surrounding area, all the teachers and students were shocked when they saw that Wang Xian actually wanted to go to their Songyi Saint Academy’s holy place.<br/><br/>Some of the students and teachers spoke softly.<br/><br/>Teacher he looked at the disappearing figure and his expression changed slightly. He shook his head helplessly.<br/><br/>Buzz<br/><br/>Wang Xian arrived at the teleportation formation of the Ming Yi Saint Academy and stepped into it directly!<br/><br/>This teleportation formation could directly reach the core of an advanced academy.<br/><br/>It was a teleportation formation used by the experts of the Ming Yi Saint<br/><br/>Academy alone.<br/><br/>Boom! Boom! Boom<br/><br/>The moment Wang Xian appeared, waves of energy raged around him.<br/><br/>The experts of the Ming Yi Saint Academy who were holding their staffs stared at Wang Xian coldly.<br/><br/>In the sky above him, magic formations had already surrounded this place.<br/><br/>The terrifying magic formations were brewing their power.<br/><br/>Wang Xian swept his gaze across them and revealed a calm expression on his face.<br/><br/>(‘I’m here to kill Wu Qitian. After killing him, Pll leave immediately. If you, Ming Yi Saint Academy, wish to stop me, you can give it a try.”<br/><br/>He spoke to the experts around him.<br/><br/>There were more than 10,000 experts. All of them were universe knights.<br/><br/>The few elders in the lead could sense that they had already reached the pinnacle of the supremacy realm.<br/><br/>This power was already very strong for Ming Yi Saint Academy.<br/><br/>Their reaction time was also very fast. The moment they received the information, one of the guards of the Songyi Saint Academy had already arranged everything.<br/><br/>However, in Wang Xian’s opinion, this force was too weak!<br/><br/>It was so weak that they could be turned into ashes with a wave of their hands.<br/><br/>They didn’t provoke Wang Xian, and Wang Xian didn’t have the intention of destroying the entire Songyi Saint Academy.<br/><br/>After destroying Wu Qitian, he left.<br/><br/>Furthermore, from Wu Qitian’s memories, he knew that Wu Qitian was prepared to forcefully interrogate him about his sword techniques. As for whether he would be killed or released, it was up to him to decide.<br/><br/>Therefore, he wouldn’t let Wu Qitian off!\t\t\t\t\t\t</div>", "images": {}, "success": true}