{"id": 943, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073786.html", "title": "Chapter 3945 - Chapter 3945: 3944. Someone Was Courting Death", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3945 - Chapter 3945: 3944. Someone Was Courting Death</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3945: 3944. Someone was courting death<br/><br/>Translator: 549690339<br/><br/>“Eh? Sir Saint Son actually invited that Wang Xian for a drink. This… Sir Saint Son really thinks highly of him! ”<br/><br/>“This is too enviable. However, this Wang Xian actually rejected every condition of Sir Saint Son. This is a little… ”<br/><br/>“He rejected Sir Saint Son twice, but Sir Saint Son didn’t mind at all. Yet, he still thinks so highly of him. TSK TSK, Pm so envious! ”<br/><br/>In the surrounding area, a group of students looked envious when they saw Wu Qitian patting Wang Xian on the shoulder.<br/><br/>This was the space Saint Son!<br/><br/>He rejected the saint son twice, yet he was still valued so highly.<br/><br/>It was truly a blessing.<br/><br/>However, at this moment, Wang Xian sensed a surge of space power surging into his body.<br/><br/>This power wanted to dominate his body and control it. In fact, under this power of space, he couldn’t even speak!<br/><br/>“Let’s Go! ”<br/><br/>Wu Qitian shouted softly again. A smile appeared on his face.<br/><br/>At this moment, Wang Xian sensed a power of space enveloping him. It wanted to take him away.<br/><br/>Wang Xian sensed what Wu Qitian had done to him.<br/><br/>He slowly raised his head and stared at Wu Qitian. A cold expression appeared in his eyes!<br/><br/>“Wu Qitian, what do you want to do to me? Use the power of space to bind my body?<br/><br/>Wang Xian said coldly to him.<br/><br/>“Huh?”<br/><br/>“Huh?”<br/><br/>Wang Xian’s sudden words stunned Wu Qitian who was beside him.<br/><br/>At the same time, all the students in the surroundings were paying attention to them.<br/><br/>When they heard Wang Xian’s words, their faces were also stunned and filled with astonishment.<br/><br/>What was going on?<br/><br/>What did he mean?<br/><br/>“What do you mean? What are you talking about?”<br/><br/>A hint of surprise flashed across Wu Qitian’s eyes. Following that, his face turned cold as he stared at Wang Xian with a cold gaze.<br/><br/>A terrifying aura slowly surged out from his body.<br/><br/>“Wu Qitian, you should know what I mean. What are you trying to do by invading my body with the power of Space?”<br/><br/>Wang Xian stared at Wu Qitian and said indifferently!<br/><br/>“Kid, what nonsense are you spouting? “I see that you are quite talented, so I wanted to give you some pointers. You actually said that I invaded your body with the power of space. Hahaha, what a joke. With your strength, if I really invaded your body with the power of space, would you still be able to speak? Would you still be able to move?”<br/><br/>Wu Qitian laughed out loud and stared coldly at Wang Xian. “Kid, do you know what will happen if you accuse me wrongly?”<br/><br/>“What’s going on? Why did Wang Xian suddenly wish for the Holy Son?”<br/><br/>“No Way, what’s going on? That Wang Xian actually said that the holy son used the power of space to invade him. Is this a joke? What is the strength of the Holy Son? If he really invaded him, would he still be able to move?”<br/><br/>“That’s right. Isn’t this Wang Xian a little too complacent? This is the biggest joke in the world. What is the strength of the Saint Son of space? What is his strength?”<br/><br/>“He wronged the Saint Son. This kid is simply courting death. ” At the surrounding seats, all the students were stunned.<br/><br/>What was going on?<br/><br/>He wronged the Saint Son of Space?<br/><br/>Was this really not courting death?<br/><br/>“Eh? Saint Son, What’s going on?”<br/><br/>Sitting at the back, the teachers looked over. Teacher he also looked at Wang Xian in astonishment and asked Wu Qitian.<br/><br/>“Teacher he, Wu Qitian has invaded my body with the power of space just now. He wants to control me. Teachers, please check if there is any other energy invading my body. ”<br/><br/>Wang Xian looked at teacher he and the rest of the teachers.<br/><br/>As he spoke, his eyes sparkled.<br/><br/>“Huh?”<br/><br/>Upon hearing Wang Xian’s words, teacher he’s expression changed slightly.<br/><br/>He looked at Wu Qitian.<br/><br/>“Impudent! If the holy son invades your body with energy, can you still move? You Brat, do you think that you can frame the holy son just because you won first place?”<br/><br/>A teacher’s gaze landed on Wang Xian as he berated him in a deep voice with a cold expression!<br/><br/>“Teacher, you will know whether I am lying or not. Why would I frame him for no reason?”<br/><br/>Wang Xian looked at the teacher calmly and said!<br/><br/>“You have ulterior motives. I think you are courting death. How dare you slander me in public! ”<br/><br/>Wu Qitian’s gaze turned cold at the side as he sent a terrifying aura towards Wang Xian.<br/><br/>“Old he, this is your student. His subordinate has offended his superior. He doesn’t know what’s good for him!”<br/><br/>“Slander the holy son. Let the Holy Son deal with this kid. I think we should just kill him.”<br/><br/>Among the teachers, two of them spoke coldly.<br/><br/>One of the teachers even wanted to kill Wang Xian.<br/><br/>It was as if killing such a student was akin to stepping on an ant.<br/><br/>In fact, eternal swordsman level existences were like ants to them.<br/><br/>They could be easily crushed to death.<br/><br/>They could even turn them into ashes with a wave of their hands!<br/><br/>For an eternal swordsman level kid to provoke the saint child, no matter who was right or wrong, this kid would have to pay the price.<br/><br/>Moreover, the weak were wrong!<br/><br/>“This guy actually dares to slander the Saint Child! ”<br/><br/>“He’s simply courting death. His bright future has been ruined by his own stupidity! ”<br/><br/>“He doesn’t know what’s good for him. He’s really courting death! ”<br/><br/>When the surrounding students saw this scene, their eyes revealed a cold and disdainful look.<br/><br/>As for what Wang Xian said and the language he used to verify it, they completely ignored it!<br/><br/>“You Want to kill me?”<br/><br/>Wang Xian listened to the voices around him and heard the words of the teacher. His eyes revealed a hint of coldness.<br/><br/>“I came to Ming Yi Saint Academy to study just to overdo it. I don’t want to participate in anything and I don’t want to offend anyone. However, this doesn’t mean that anyone can offend me.”<br/><br/>“Do you know?”<br/><br/>Wang Xian spoke calmly and his gaze landed on the teacher who wanted to kill him.<br/><br/>Buzz<br/><br/>His body trembled slightly as his main body merged with the body of the Void Dragon God. He slowly extended his hand towards the teacher!<br/><br/>Buzz<br/><br/>When he extended his hand, the middle-aged teacher’s body vanished instantly.<br/><br/>There was no sound and no energy attack.<br/><br/>It was as though there was no sound or movement. The middle-aged teacher was only left with a head!<br/><br/>However, there was no movement from Wang Xian’s hand.<br/><br/>However, the middle-aged mentor could feel a great terror descending upon him.<br/><br/>He could feel the intense pain entering his mind.<br/><br/>His face revealed a look of horror as he looked at his body.<br/><br/>However, at this moment, his body had already disappeared!<br/><br/>An extremely terrified scream came out from his mouth as he stared at Wang Xian in horror.<br/><br/>“You don’t know whether you are dead or Alive!”<br/><br/>Wang Xian spat out four words slowly and waved his hand gently.<br/><br/>In the next second, the head of the middle-aged mentor had completely disappeared.<br/><br/>It was as though there had never been such a person in this world.<br/><br/>He had disappeared without a sound!\t\t\t\t\t\t</div>", "images": {}, "success": true}