{"id": 940, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073780.html", "title": "Chapter 3942 - Chapter 3942: 3941, The Mighty Space Saint Son", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3942 - Chapter 3942: 3941, The Mighty Space Saint Son</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3942: 3941, the Mighty Space Saint Son<br/><br/>Translator: 549690339<br/><br/>“Hey, look, someone actually challenged the first place Yi Ya. Moreover, it’s an unfamiliar student. Who Is this person?”<br/><br/>“I’ve never seen him before. He doesn’t seem to be very famous in our Ming Yi Saint Academy. He challenged Yi ya directly. does he have such confidence and strength?”<br/><br/>“Who is this person? He isn’t even a student in the top 30. He actually challenged Yi ya directly. Is he trying to become famous?”<br/><br/>When Wang Xian stood at the top, everyone’s faces were filled with astonishment.<br/><br/>An unfamiliar face directly challenged Yi ya from the Ming Yi Saint Academy. This made everyone extremely surprised.<br/><br/>Was he really powerful or was he trying to become famous?<br/><br/>“Eh? Sister Yi Ya, someone actually challenged you?”<br/><br/>Wu Qitian, the space saint, who was located at the center, looked forward. He smiled and said to Yi Ya.<br/><br/>(‘I didn’t expect someone to challenge me so soon. Hehe, I can move around.” Yi Ya said with a smile.<br/><br/>“An eternal swordsman of the ninth rank dares to challenge you, Yi Ya. You really don’t know the immensity of Heaven and Earth. ” Wu Qitian looked forward, shook his head and said.<br/><br/>“Only an eternal swordsman of the ninth rank? You Dare to challenge me with such strength. How boring and disappointing. ”<br/><br/>When Yi Ya heard that, she raised her eyebrows and looked disappointed.<br/><br/>“Hehe, sister Yi Ya, you can easily kill such a character.”<br/><br/>Wu Qitian shook his head.<br/><br/>“I have to accept the challenge. Brother Tian, I will go over and kill him. ”<br/><br/>Yi Ya smiled and appeared in front of Wang Xian instantly.<br/><br/>“Wang Xian, Challenge! ”<br/><br/>Wang Xian stood on the stage and cupped his hands when he saw Yi Ya flying over.<br/><br/>“Isn’t it a little arrogant for an eternal swordsman to challenge me at level<br/><br/>Yi Ya sized up Wang Xian and spoke while standing there motionlessly.<br/><br/>“HMM? An eternal swordsman at level nine with spatial attributes? No Way.<br/><br/>He dares to challenge me when he is on the same level as Yi Ya?”<br/><br/>“Although spatial swordsmen can fight above their level, it depends on who the opponent is. Yi Ya is at the peak of the Eternal Swordsman Realm and is one of the best among the spatial attributes!”<br/><br/>“Is he looking for trouble? This is not a battle of the same level at all! ”<br/><br/>When all the students around heard this, they were stunned.<br/><br/>An eternal swordsman of level nine and a spatial cultivator challenging yi ya?<br/><br/>They were not on the same level.<br/><br/>“Please Enlighten Me! ”<br/><br/>When Wang Xian heard her words, his expression did not change at all. With a move of his palm, a sharp sword appeared in his hand!<br/><br/>“Interesting, but the gap is too big!”<br/><br/>The expert from the Ming Yi Saint Academy, who was floating in the sky, waved his arm. A wave of energy enveloped Yi Ya and Wang Xian.<br/><br/>The energy in Wang Xian’s body would be considered a failure if there were any cracks.<br/><br/>As for Yi Ya’s energy, she would only be considered to have lost if she completely collapsed.<br/><br/>This was because their defenses were not on the same level.<br/><br/>“This Wang Xian has actually broken through to the ninth level of the eternal swordsman. He actually broke through so quickly. ”<br/><br/>When nie youwei heard Yi Ya’s words, she revealed a surprised expression. When Wang Xian was at the eighth level of the Eternal Swordsman, he was already able to defeat her.<br/><br/>Perhaps, Wang Xian could really defeat Yi Ya.<br/><br/>“Although he has made a breakthrough, Yi Ya is not an ordinary eternal swordsman at the peak. She is cultivating the sword techniques of the Space Saint Son. ”<br/><br/>Xu Xinrun’s expression changed slightly when he saw Wang Xian ‘s breakthrough. However, he quickly said.<br/><br/>Nie You’s eyes flickered.<br/><br/>Yi Ya was not a simple expert at the peak of the Eternal Swordsman. However, she felt that Wang Xian was not simple either.<br/><br/>He was extremely mysterious.<br/><br/>When she was fighting with him, she could feel that he did not use his full strength.<br/><br/>At this moment, the expert from the Ming Yi Saint Academy waved his arm and the illusory pyramid-shaped phantom disappeared.<br/><br/>Someone with your strength is not qualified to compete with me. Get lost! ”<br/><br/>When Yi Ya saw the start of the battle, he moved his palm and a sharp sword appeared in his hand. He slashed at Wang Xian directly with a cold expression in his eyes.<br/><br/>She didn’t put Wang Xian in her eyes at all.<br/><br/>Furthermore, she attacked directly. Numerous terrifying spatial swords were sent out and covered Wang Xian directly.<br/><br/>He was prepared to kill Wang Xian instantly to intimidate some reckless challengers.<br/><br/>(‘I have already reached the peak of the eternal swordsman and also possess the spatial attribute. Yet, I don’t even dare to challenge Yi Ya. This fellow is really arrogant. He is asking for trouble! ”<br/><br/>“I reckon he can be killed in one move! ”<br/><br/>Among the top 30 students in the center, one of them shook his head and said with slight disdain.<br/><br/>In the arena in front, Wang Xian saw Yi ya attacking him instantly.<br/><br/>He moved his body and brandished the longsword in his hand.<br/><br/>Buzz<br/><br/>At the same time, he teleported to the back.<br/><br/>After teleporting five directions consecutively, he arrived at the back.<br/><br/>“HMPH, can I Dodge by teleporting?”<br/><br/>When Yi Ya saw Wang Xian teleporting to Dodge, a look of contempt appeared on her face.<br/><br/>As long as his swordsmanship was within the range of her spatial coverage, he could track her.<br/><br/>Buzz<br/><br/>However, after five teleportations, Wang Xian did not continue to dodge. Instead, he waved his arm.<br/><br/>At the five places where he had teleported earlier, sharp swords suddenly condensed and attacked Yi Ya’s spatial swords.<br/><br/>“Clang! Clang! Clang! ”<br/><br/>Intense clashing sounds rang out. Yi Ya’s attacks were completely blocked.<br/><br/>Wang Xian waved his arm continuously. Sword Mounds formed around him!<br/><br/>He stared at Yi Ya and waved the sword in his hand. He stepped in the air and walked forward little by little.<br/><br/>With every step he took, a sword tomb was left around him.<br/><br/>The sword tomb was buried in the void. It was impossible to sense it without careful observation.<br/><br/>“Huh? You actually blocked my attack! ”<br/><br/>Yi Ya was slightly stunned when she saw that her attack was blocked. She stared at Wang Xian and said, “It seems like you still have some strength. It seems like I have to be serious. That’s all! ”<br/><br/>As she spoke, she waved the sharp sword in her hand behind her. The space behind her began to tremble.<br/><br/>The space seemed to have shattered and condensed into sharp swords.<br/><br/>Soon, there were more than 10,000 sharp swords formed behind her. With a flash, she arrived at the spot a thousand meters away from Wang Xian in an instant.<br/><br/>The densely packed space swords behind her also teleported over and attacked Wang Xian from all directions!<br/><br/>The moment Yi ya teleported, Wang Xian had already sensed the location of her teleportation.<br/><br/>However, Wang Xian had yet to move!<br/><br/>The moment the tens of thousands of sharp swords attacked him, the sword in his hand trembled!<br/><br/>At the position behind him, the scabbard, body, and Blade of the sword began to condense slowly.<br/><br/>A sharp sword that was more than 10,000 meters in size condensed into one!<br/><br/>“Break! ”<br/><br/>Wang Xian swung the longsword in his hand. Pulling the huge sword that was more than 10,000 meters in length, he swung it directly at Yi Ya..\t\t\t\t\t\t</div>", "images": {}, "success": true}