{"id": 945, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073790.html", "title": "Chapter 3947 - Chapter 3947: 3946 ‘S Invincible Strength", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3947 - Chapter 3947: 3946 ‘S Invincible Strength</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3947: 3946 ‘s invincible strength<br/><br/>Translator: 549690339<br/><br/>“Buzz Buzz Buzz! ”<br/><br/>“Whoosh! Whoosh! Whoosh! ”<br/><br/>In the Sacred Academy, above the arena on the rooftop, a white cloud covered the entire sky.<br/><br/>Accompanied by a cold and majestic voice, figures slowly emerged from the White Cloud.<br/><br/>They looked down coldly and locked onto Wang Xian’s figure.<br/><br/>There were more than a hundred figures, and each figure contained a powerful force.<br/><br/>There wasn’t only one great being guarding the Sacred Academy.<br/><br/>There were more than 100 of them, and every one of them was at least a level 5 knight.<br/><br/>This was only the elementary school and the advanced school, which was the nest of Ming Yi Sacred Academy. The power of the guards there was even more terrifying.<br/><br/>There was even a dean guarding the academy.<br/><br/>The dean of the Sacred Academy was a truly powerful existence.<br/><br/>He was the pillar of the entire sacred academy.<br/><br/>However, under normal circumstances, the strength of the protectors around Ming Yi Sacred Academy was already at the Pinnacle.<br/><br/>Within the surrounding countries, many of the strongest warriors were only at the level of void blade emperor or void God Emperor.<br/><br/>There weren’t many countries that could have a universe knight.<br/><br/>One could imagine what the power and strength of the protectors represented.<br/><br/>Wang Xian looked at the hundreds of figures appearing in the sky and raised his eyebrows slightly.<br/><br/>More than a hundred universe knight level powerhouses were locked onto him with an aura. Their eyes were filled with coldness.<br/><br/>“Protectors, save me. I’m trapped by him.”<br/><br/>Wu Qitian saw the arrival of the protectors and his eyes lit up. He immediately cried out for help.<br/><br/>“To be able to imprison the holy son of Wu Qitian, it seems that your strength has reached the level of a universe knight. Let the holy son of Wu Qitian go and we can talk about other things. ”<br/><br/>The old man who was in the middle of the protectors stared at Wang Xian and said coldly.<br/><br/>“Hehe, when you say let him go, you mean let him go?” Wang Xian chuckled and waved his hand at Wu Qitian.<br/><br/>Buzz! Buzz! Buzz<br/><br/>A wave of energy landed on Wu Qitian’s limbs. The terrifying destructive power could not remove his limbs in an instant.<br/><br/>“Ahhh! ”<br/><br/>The destructive power caused Wu Qitian to feel intense pain. His face was filled with painful screams.<br/><br/>“You ‘re courting death. ”<br/><br/>A Protector’s expression changed slightly when he saw this scene. His figure moved and disappeared instantly.<br/><br/>He was a space swordsman at the level six of the Universe Knight Realm.<br/><br/>His figure disappeared and appeared beside Wu Qitian in the next second.<br/><br/>The moment he appeared, the power of space immediately enveloped Wu Qitian, wanting to save him.<br/><br/>“You are the one who is courting death! ”<br/><br/>When Wang Xian saw that this protector actually dared to teleport over, a trace of disdain appeared on his face.<br/><br/>He waved the long sword in his hand and directly attacked this protector.<br/><br/>As the sword slashed past, the protector’s body immediately froze.<br/><br/>Then, a terrifying scene appeared in Wu Qitian’s eyes.<br/><br/>The body of the protector who had teleported to his side slowly split open.<br/><br/>He widened his eyes and his life force disappeared at a terrifying speed.<br/><br/>When Wu Qitian saw this scene, his face was filled with fear.<br/><br/>“What!”<br/><br/>He let out a hoarse roar.<br/><br/>In the surrounding area, there were more than a hundred protectors, a group of instructors, and all the students.<br/><br/>When they saw one of the protectors being killed by Wang Xian in an instant, their faces were also filled with shock. One of the protectors was killed in an instant.<br/><br/>This was a protector!<br/><br/>They were the core experts of the Saint Academy.<br/><br/>However, an existence of such level was killed in an instant by that mysterious Wang Xian.<br/><br/>What was the strength of that Wang Xian?<br/><br/>“How is this possible? That is our protector, an expert from the Songyi Saint<br/><br/>Academy. He was actually killed! ”<br/><br/>“Hiss, who is that Wang Xian? What is his strength?”<br/><br/>“Is he an enemy of our Songyi Saint Academy? The space saint son had his limbs chopped off and one of the protectors was killed by him. This… ”<br/><br/>All the students and teachers around were in an uproar.<br/><br/>The pupils of the hundreds of protectors also contracted slightly.<br/><br/>“He killed the Eternal Swordsman’s sixth level protector in an instant. ”<br/><br/>At the center of the group of Protectors, the old man stared at Wang Xian with an extremely grave expression.<br/><br/>The rest of the protectors also took out their weapons immediately.<br/><br/>The mages among them had already started to condense their magic and were ready to attack at any time.<br/><br/>“Wu Qitian wants to harm me. Please give me an explanation from Songyi Saint Academy. ”<br/><br/>Wang Xian looked at the group of Protectors and said faintly.<br/><br/>He needed a satisfactory answer to this matter.<br/><br/>Everything started because of Wu Qitian. In order to solve this matter, he needed to give a statement from Songyi Saint Academy.<br/><br/>He needed to give a statement from Songyi Saint Academy.<br/><br/>“We don ‘t know what grudges you have with our Songyi Saint Academy.<br/><br/>However, you’d better release our Songyi Saint Academy’s Holy Son!”<br/><br/>The old man in the middle of the group of protectors stared at Wang Xian with a changing expression and replied coldly.<br/><br/>“I hate threats!”<br/><br/>Wang Xian heard the old man’s words and waved his arm. The sharp sword in his hand slashed at the old man.<br/><br/>Buzz<br/><br/>Cough Cough Cough<br/><br/>The moment the sharp sword was slashed, the protector of the Ming Yi Saint<br/><br/>Academy instantly felt the energy around him stagnating.<br/><br/>A great terror descended.<br/><br/>He sensed a wave of energy that directly cut him into two.<br/><br/>Moreover, this terrifying energy caused his life force to quickly disappear.<br/><br/>He had already seen death and knew his own outcome.<br/><br/>Terror!<br/><br/>Shock!<br/><br/>As well as shock and unwillingness!<br/><br/>Just what kind of existence had this spatial saint offended?<br/><br/>After reaching his level of cultivation, he could be revived by dripping blood.<br/><br/>However, this required the fresh blood in his body to be active.<br/><br/>It required his consciousness to be injected into it.<br/><br/>However, Wang Xian’s attack instantly wiped out all of his vitality.<br/><br/>Even if it was just a drop of fresh blood, there wasn’t any energy left.<br/><br/>He waved his hand casually again.<br/><br/>Another protector was killed.<br/><br/>And this old protector was obviously the leader of the group of protectors.<br/><br/>An existence of such level was killed by Wang Xian casually!<br/><br/>At this moment, the hundreds of protectors around were completely dumbfounded.<br/><br/>Yes, they were completely dumbfounded.<br/><br/>This old man was an expert at the level of a level eight universe knight.<br/><br/>He was the strongest expert in the elementary academy.<br/><br/>Yet, he was still killed silently by a single sword strike.<br/><br/>This scene was too terrifying in their eyes!<br/><br/>A Universe Knight Level 9 great being couldn’t do it.<br/><br/>Even a pinnacle universe knight might not be able to do it so easily.<br/><br/>Hiss<br/><br/>Over 100 protectors trembled, their eyes filled with fear.<br/><br/>They knew that if the young man wanted to kill them, he could easily kill 100 of them.<br/><br/>The strength he displayed was simply too strong.<br/><br/>At this moment, Wu Qitian’s forehead was filled with cold sweat after his limbs disappeared.<br/><br/>He swallowed a mouthful of saliva. His face was pale and his eyes were bloodshot.<br/><br/>Just what kind of expert did he offend?\t\t\t\t\t\t</div>", "images": {}, "success": true}