{"id": 944, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073788.html", "title": "Chapter 3946 - Chapter 3946: 3945. Someone Wanted To Die", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3946 - Chapter 3946: 3945. Someone Wanted To Die</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3946: 3945. Someone wanted to die<br/><br/>Translator: 549690339<br/><br/>The moment the middle-aged teacher’s body disappeared.<br/><br/>When the last of his screams resounded through the sky, everyone in the surroundings was stunned.<br/><br/>They looked at the ‘student’in front of them in a daze.<br/><br/>This student was just like an ant in their eyes.<br/><br/>They were in a daze.<br/><br/>However, all of this was real.<br/><br/>The teachers could not help but suck in a breath of cold air. Their faces were filled with shock.<br/><br/>“Old Qian, he…”<br/><br/>One of the teachers opened his mouth and his expression kept changing. He looked at Wang Xian with a look of horror in his eyes. “How is this possible? The strength of this student?”<br/><br/>“Be careful! ”<br/><br/>“What are you trying to do? Pm warning you. This is our Ming Yi Saint Academy. Why did you sneak into our Ming Yi Saint Academy? What are your intentions?”<br/><br/>At this moment, the instructors also came to their senses. They immediately retreated to the surroundings and surrounded Wang Xian. Their faces were filled with coldness.<br/><br/>“You… ”<br/><br/>At the side, the Space Saint Son was also staring at Wang Xian. His expression changed drastically.<br/><br/>Just now, none of them could sense any energy gushing out from Wang Xian ‘s body.<br/><br/>However, he easily made one of the teachers vanish into thin air.<br/><br/>This scene was too terrifying.<br/><br/>Wu Qitian’s expression changed drastically. Without any hesitation, he immediately wanted to teleport into the distance.<br/><br/>Buzz<br/><br/>However, when he wanted to teleport, he realized that he couldn’t move at all. He couldn’t teleport at all!<br/><br/>“What’s going on? What… What did you do to me?”<br/><br/>Wu Qitian stared at Wang Xian. His face was filled with horror as he growled at Wang Xian with an abnormally embarrassed expression.<br/><br/>“What did I do to you? What you wanted to do to me just now, Pm doing to you now. ”<br/><br/>Wang Xian stared at Wu Qitian with a cold look in his eyes.<br/><br/>Wu Qitian wanted to control him because he wanted to obtain the heaven origin sword technique from him.<br/><br/>Unfortunately, he bumped into Wang Xian.<br/><br/>Wu Qitian looked at Wang Xian and his body trembled. He growled in a low voice, “This is our Ming Yi Saint Academy. Do you know the consequences of offending our Ming Yi Saint Academy?”<br/><br/>“Do you know what the consequences are for offending me?”<br/><br/>When Wang Xian heard his words, a cold smile appeared on his face as he asked in return.<br/><br/>“What’s the situation? What’s the situation over there?”<br/><br/>“Gulp, I don’t know. What happened over there? Why did Wang Xian have a conflict with the space Saint Son and our teacher? What’s going on?” “Where did that scream come from? What’s the situation with that Wang<br/><br/>Xian?<br/><br/>“This Wang Xian, he… what is his strength?”<br/><br/>At the same time, all the students in the surroundings looked over in astonishment.<br/><br/>The students who were closer looked over in astonishment.<br/><br/>Those students who were further away stood up one by one with astonishment on their faces.<br/><br/>They still didn’t understand what was happening here.<br/><br/>However, the terrifying auras of the instructors soared into the sky, causing them to feel a hint of fear!<br/><br/>“Some of you ants deserve to die too! ”<br/><br/>Wang Xian swept his gaze around and waved his arm.<br/><br/>Buzz<br/><br/>A wave of energy swept across. The students who were shouting at him earlier vanished instantly when they saw the students who were filled with malice.<br/><br/>They had already vanished into the universe.<br/><br/>One of them was that Yi Ya!<br/><br/>“Stop, Wang Xian, Stop! ”<br/><br/>The moment the dozen students vanished, the teachers ‘expressions changed again!<br/><br/>When they saw this scene, their brows twitched violently.<br/><br/>The dozen students vanished instantly. They didn’t even sense anything.<br/><br/>It was as if they had vanished into thin air.<br/><br/>This made all of their teachers feel a little terrified! They didn’t even sense Wang Xian controlling the energy!<br/><br/>“So… so terrifying! ”<br/><br/>In the surrounding area, when the group of students saw the sudden disappearance of the dozen of students in a strange manner, a look of horror instantly appeared on their faces.<br/><br/>Some of the timid ones cried out in surprise and immediately fled into the distance!<br/><br/>“This… that Wang Xian is a powerhouse?”<br/><br/>“Hiss, what’s going on? That Wang Xian actually dared to kill the students of our Songyi Saint Academy! ”<br/><br/>This time, all the students around the arena saw this scene and shouted in a low voice with a face full of shock.<br/><br/>They looked at Wang Xian in disbelief.<br/><br/>This dark horse that had just been born seemed to be somewhat different!<br/><br/>The more than ten students that were eliminated earlier were all students ranked in the top 30 of Ming Yi Saint Academy!<br/><br/>“Wang Xian, why did you enter our Ming Yi Saint Academy? Do We have any enmity with you?”<br/><br/>The one who had shouted for Wang Xian to stop earlier was teacher he.<br/><br/>At this moment, his expression kept changing as he looked at him and asked in a deep voice again.<br/><br/>“Teacher he, I came here purely to learn. However, there are people who don’t know what’s good for them. They want to control me with the power of space. Pm just being fair. However, since you can’t give it to me, I can only do it myself! ”<br/><br/>Wang Xian looked at teacher he and said calmly.<br/><br/>Indeed, he didn’t want to be so high-profile.<br/><br/>After entering the universe of swords and magic, Wang Xian was prepared to cultivate to the level of the universe’s ruler in a low-key manner. However, there were people who wanted to provoke him.<br/><br/>There were people who wanted to target him.<br/><br/>Most importantly, Wang Xian had already given Ming Yi Saint Academy a chance to deal with him.<br/><br/>However, they didn’t believe in him and wanted to destroy him.<br/><br/>Then, don’t blame him.<br/><br/>Boom<br/><br/>“You killed a disciple of the Songyi Saint Academy in my Songyi Saint Academy. You Don’t know what’s good for you. No matter what the reason is, don ‘t even think about walking out of here today! ”<br/><br/>Just as Wang Xian finished his sentence, the entire sky changed!<br/><br/>A huge white cloud suddenly enveloped the entire sky.<br/><br/>Following that, waves of extremely powerful force descended!<br/><br/>The moment Wang Xian killed one of the teachers, the teachers knew that Wang Xian was extremely mysterious and powerful.<br/><br/>Therefore, they immediately sought help from the powerhouses in the Saint Academy.<br/><br/>As a Saint Academy that had a reputation that shook the surroundings and ruled over thousands of countries of magic, if anyone dared to kill and cause trouble here, they would have to pay the price in blood!<br/><br/>This was the prestige of a Saint Academy.<br/><br/>No one was allowed to trample on it.<br/><br/>“The Guardian of the academy is here. He is the guardian of our Songyi Sacred Academy! ”<br/><br/>“The Guardian is here. He is the powerhouse who is guarding our Songyi Sacred Academy. Regardless of the reason, Wang Xian dared to kill people in<br/><br/>Songyi Sacred Academy. He will have to pay the price!”<br/><br/>“Phew, the guardian is here. That Wang Xian shouldn’t be so impudent.”<br/><br/>In the surrounding area, the teachers and students heaved a sigh of relief when they saw the arrival of the guardian of the Sacred Academy.<br/><br/>Every guardian of the academy had the power of a universe knight. With this power, they could easily destroy a magic country..\t\t\t\t\t\t</div>", "images": {}, "success": true}