{"id": 942, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073784.html", "title": "Chapter 3944 - Chapter 3944: Under The Powerful Spatial Saint Son Of 3943", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3944 - Chapter 3944: Under The Powerful Spatial Saint Son Of 3943</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3944: Under the powerful spatial saint son of 3943<br/><br/>Translator: 549690339<br/><br/>“Alright, Yi Ya has lost! ”<br/><br/>Yi Ya’s indignant roar reached everyone’s ears, located in the sky.<br/><br/>When the expert from Ming Yi Sacred Academy saw this scene, his eyes flickered with a luster as he directly spoke.<br/><br/>With a wave of his arm, the eighteen sword edges instantly dissipated! “This… My God, this Yi Ya has actually lost, really lost?”<br/><br/>“She lost. Even our teacher Hong said that she lost. That Yi Ya was utterly defeated. ”<br/><br/>“What kind of sword technique is this? She actually condensed eighteen terrifying sword edges. Isn’t this too strong? If teacher Hong didn’t organize this, I reckon that this terrifying attack would have been able to kill Yi Ya! ”<br/><br/>“This is too strong. An eternal swordsman at level nine defeated someone at the Pinnacle Stage. What kind of sword technique is this? who exactly is that Wang Xian?”<br/><br/>“The biggest dark horse of this batch has appeared. The speed at which it ends is similar to what we expected. However, who would have thought that the one who lost was Yi Ya?”<br/><br/>Such a terrifying attack and such powerful strength. Is it something that our students at the eternal stage can withstand?”<br/><br/>Astonished voices rang out continuously. All the students looked at this scene in disbelief.<br/><br/>No one expected this outcome.<br/><br/>Even though Wang Xian had suppressed Yi Ya in the beginning!<br/><br/>Furthermore, the battle ended so quickly and Yi Ya was defeated so quickly. This shocked everyone.<br/><br/>The biggest dark horse of this batch had appeared!<br/><br/>Furthermore, he defeated Yi Ya in a way that surpassed his level!<br/><br/>It was unbelievable!<br/><br/>“His swordsmanship is absolutely terrifying!”<br/><br/>At the center of the arena, the space saint, Wu Qitian, stared at Wang Xian with a look of astonishment.<br/><br/>That’s right. Even he was amazed by such a swordsmanship.<br/><br/>The swordsmanship that he cultivated had always been invincible.<br/><br/>No one in the same level was his match.<br/><br/>Yi Ya had received his teachings because of him. Even when he was at the peak of the eternal swordsman realm, he thought that he was no better than Yi Ya.<br/><br/>However, a student at the ninth level of the eternal swordsman realm had defeated Yi Ya.<br/><br/>What did this mean?<br/><br/>It meant that the swordsmanship in his hands was much higher than his.<br/><br/>One had to know that his own swordsmanship was obtained by chance. It was considered a top-notch swordsmanship in the Songyi Saint Academy!<br/><br/>“Wang Xian wins. Not Bad, not bad. Your swordsmanship is very strong! ”<br/><br/>Teacher Hong continued to announce in the sky. He looked at Wang Xian with a hint of surprise.<br/><br/>Wang Xian smiled and cupped his hands. His body moved and teleported to the viewing platform in the center.<br/><br/>“Student Wang Xian, Congratulations. I didn’t expect you to be so powerful! ”<br/><br/>Nie youwei saw Wang Xian flying over. She looked at him in astonishment and congratulated him.<br/><br/>“Thank you! ”<br/><br/>Wang Xian nodded with a smile. He wasn’t surprised at all.<br/><br/>Yi Ya’s strength was weaker than he had expected.<br/><br/>She hadn’t pushed him to his limit yet.<br/><br/>At the side, Xu Xinrun looked at Wang Xian. His expression kept changing. He didn’t expect Wang Xian to win!<br/><br/>“Brother Tian, i… I lost! ”<br/><br/>At the side, Yi Ya flew from the arena to Wu Qitian’s side. She spoke with a face full of unwillingness!<br/><br/>“His swordsmanship is very strong. I’ve never heard of it before. ”<br/><br/>Wu Qitian spoke as his gaze landed on Wang Xian.<br/><br/>“Wang Xian, right? Come Over Here!” He spoke suddenly.<br/><br/>His voice entered Wang Xian’s ears as well.<br/><br/>“Oh? Could it be that the holy son thinks highly of Wang Xian?”<br/><br/>“That’s really possible. After all, he won the battle by surpassing his level. If he could be valued by the holy son, it would be a meteoric rise! ”<br/><br/>“I’m really envious! ”<br/><br/>In the surrounding area, when the students heard the words of the holy son Wu Qitian, their eyes landed on Wang Xian. Their faces were filled with envy.<br/><br/>The title of the Sage was very important in the Ming Yi Saint Academy.<br/><br/>When the teachers saw it, they had to address it as the sage.<br/><br/>Even in the entire Ming Yi Saint Academy, the position of the sage was comparable to the elders.<br/><br/>One had to know that the elders were all universe knights at level eight or nine, or even at the peak.<br/><br/>To be chosen by the sage was no different from soaring to the sky.<br/><br/>Wang Xian frowned slightly when he heard Wu Qitian ‘s words.<br/><br/>“Wang Xian, the holy son is calling for you. Hurry up and go over. This is the<br/><br/>Holy Son! ”<br/><br/>NIE youwei, who was at the side, heard it and quickly said to Wang Xian!<br/><br/>Wang Xian hesitated for a moment and immediately flew to Wu Qitian’s side.<br/><br/>He cupped his hands and said, “The Holy Son! ”<br/><br/>“Your swordsmanship is not bad, your combat experience is very strong, and your potential is not bad. Are you interested in following me? With my guidance in the future, your strength will improve much faster than now. ” Wu Qitian looked at Wang Xian and said with a twinkle in his eyes.<br/><br/>“Brother Tian! ”<br/><br/>Without waiting for Wang Xian’s reply, Yi Ya opened her mouth and looked at Wu Qitian, feeling a little wronged.<br/><br/>Wu Qitian looked at her and gestured to her.<br/><br/>“Hiss, the saint really thinks highly of Wang Xian. He allowed him to follow by his side and soar into the sky! ”<br/><br/>“Follow by the Holy Son’s side. In the future, with the holy son as a backer and with the guidance of the holy son, his future will be bright! ”<br/><br/>“How enviable. This is the luckiest dark horse of this batch! ”<br/><br/>When the disciples who were ranked in the top 30 heard this, they could not help but sigh and feel envious.<br/><br/>When Wu Qitian heard the envious voices around him, a faint smile appeared on his face.<br/><br/>To any student, it was a great opportunity for him to recruit an eternal-level student.<br/><br/>No one would refuse!<br/><br/>“I’m sorry, Saint Son. I’m used to cultivating alone!”<br/><br/>However, at this moment, Wang Xian’s words entered his ears, causing the smile on his face to stiffen.<br/><br/>“Oh? Why? Are you still unwilling? I Won’t mistreat you if you follow me. ”<br/><br/>The saint frowned slightly and stared at him.<br/><br/>“I’m sorry.”<br/><br/>Wang Xian shook his head.<br/><br/>“It’s fine if you don’t agree. Your swordsmanship is not bad. I wonder if I can discuss it with you. Of course, I won’t mistreat you either. I will provide you with all the resources you need to cultivate to the level of a sword emperor. I will also give you a portion of my swordsmanship for you to study! ”<br/><br/>Wu Qitian was silent for a few seconds when he saw Wang Xian rejecting him again. Then, he continued to speak while looking at him.<br/><br/>“It’s forbidden to impart the family’s swordsmanship to others. Saint Son, is there anything else?”<br/><br/>Wang Xian’s eyes sparkled when he heard his words. He stared at him calmly.<br/><br/>“Haha, it’s fine, it’s fine!”<br/><br/>A hint of coldness flashed across Wu Qitian’s eyes when he heard Wang Xian rejecting him again.<br/><br/>However, he laughed out loud and shook his head.<br/><br/>“I feel that you have unlimited potential in the future, little brother. Let’s go and have a drink. Is that Alright?”<br/><br/>Wu Qitian took two steps forward and patted his shoulder.<br/><br/>At the same time, a wave of space power surged into Wang Xian’s body instantly.<br/><br/>This wave of space power began to dominate Wang Xian’s body!\t\t\t\t\t\t</div>", "images": {}, "success": true}