{"id": 955, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073810.html", "title": "Chapter 3957 - Chapter 3957: Treasure 3956", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3957 - Chapter 3957: Treasure 3956</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3957: Treasure 3956<br/><br/>Translator: 549690339<br/><br/>Buzz Buzz<br/><br/>An Lie’s figure appeared and disappeared from time to time.<br/><br/>He was trying again and again.<br/><br/>Wang Xian stood at the side and waited quietly.<br/><br/>“Dragon King, this won’t do. I’ve tried a few thousand times. I feel like I’ve entered another space. I teleported in that space but I still entered another space. It’s very strange. I can’t find my way in that space at all. ”<br/><br/>An lie tried a thousand times consecutively. When he appeared in front of Wang Xian again, he frowned slightly and said helplessly.<br/><br/>“Can’t I? If you can’t, just forget it! ”<br/><br/>Wang Xian was also a little helpless. If an lie could enter the previous space, the benefits would be too great.<br/><br/>However, the space that Wang Xian brought with him seemed to be in a crack in space.<br/><br/>If an lie wanted to teleport into the space, he would probably need a coordinate.<br/><br/>Without this coordinate, it would be difficult to go to the next level.<br/><br/>“The sword and the magic universe possess the spatial attribute. Hence, their attainments in space are very high. This setting is also to prevent spatial attribute cultivators from using this method to enter the next level. ”<br/><br/>Wang Xian thought to himself. He looked at an lie and said, “An lie, follow me.<br/><br/>Although you can’t enter here, there are places that you can enter.”<br/><br/>As he spoke, he appeared outside the Tower of Moon with a thought.<br/><br/>This was one of the abilities of the Tower of Moon.<br/><br/>As long as one could enter more than one level of the Tower of Moon, one could exit instantly if they wanted to.<br/><br/>If one wanted to enter, one only needed to get close to the Tower of Moon to enter the seventh level directly.<br/><br/>After Wang Xian left, he immediately set up a demonic altar.<br/><br/>Buzz<br/><br/>In the next second, an Lie’s figure appeared beside Wang Xian.<br/><br/>“Let’s Go! ”<br/><br/>Wang Xian’s figure moved and flew towards the direction of the entrance.<br/><br/>Throughout the entire Holy Moon, Wang Xian had already finished inspecting the area outside the Tower of Moon.<br/><br/>Other than the area where the exit was sealed by the formation, there were another fifteen such areas.<br/><br/>Wang Xian was prepared to let an lie enter and obtain the treasures inside.<br/><br/>“An lie, enter this place. There should be treasures here. ” Wang Xian came to the entrance and instructed an lie. An lie nodded and disappeared in an instant.<br/><br/>In less than a second, he came to Wang Xian’s side.<br/><br/>“Dragon King, Pll bring you in. ”<br/><br/>As he spoke, Wang Xian sensed the changes in the surroundings. He appeared above a pond.<br/><br/>He was surrounded by a quaint courtyard.<br/><br/>A majestic wave of water energy was transmitted from the pond.<br/><br/>Wang Xian looked over and his gaze landed on the strange water-elemental flowers.<br/><br/>A water-elemental flower looked extremely beautiful. It was emitting a hazy mist, causing the entire courtyard to be filled with immortal aura. There were more than a hundred water-elemental flowers.<br/><br/>Each of them was at the level of a fifth-level ruler of the universe.<br/><br/>“Not bad, right?”<br/><br/>Wang Xian said faintly and kept them away.<br/><br/>He scanned his surroundings and didn’t find any more treasures.<br/><br/>“Let’s go to the next place.”<br/><br/>Wang Xian instructed an lie. The two of them immediately flew towards the other places that were completely covered by the magic array.<br/><br/>Of the other 14 areas that were covered by the Magic Array, the largest one was located at the back of the Tower of the Moon.<br/><br/>It was next to the Tower of the Moon.<br/><br/>However, it was completely covered by the magic array.<br/><br/>Furthermore, the energy contained in the magic array could not be broken without the eighth level of the Universe Dominator.<br/><br/>An lie easily entered and brought Wang Xian in.<br/><br/>When Wang Xian entered the building, a look of surprise appeared on his face.<br/><br/>“Ten Thousand Arts Pavilion! ”<br/><br/>This was the name of the building. Three eye-catching words were hanging in the middle.<br/><br/>This building was not big. It had twelve floors, which corresponded to the number of floors of the Tower of Moon.<br/><br/>However, this twelve-story building was much more than the Tower of Moon. It was less than one-tenth of the floor.<br/><br/>Wang Xian walked straight inside. There were a large number of books on the first floor.<br/><br/>There were all kinds of cultivation books.<br/><br/>The ten attributes were divided into sword techniques and magic.<br/><br/>Wang Xian took a look and walked upstairs.<br/><br/>He was not allowed to enter the second floor as he wished. Instead, he was prohibited from entering.<br/><br/>An lie brought him to the second floor.<br/><br/>There were also all kinds of cultivation books on the second floor. However, the level of the books was higher than the first floor.<br/><br/>The number of books was much less.<br/><br/>As he continued up the first floor, Wang Xian realized that this was a library.<br/><br/>All the cultivation books of the forbidden land, the Void Moon, were stored here.<br/><br/>At the top of the forbidden land, there were six books.<br/><br/>One book, Space Sword Technique.<br/><br/>One book, Fire Magic.<br/><br/>One book, fire sword technique.<br/><br/>One book, water magic.<br/><br/>One book on wind element magic.<br/><br/>One book on wind element sword technique.<br/><br/>Six secret manuals. All of them recorded the spells cultivated by the Masters of the universe.<br/><br/>In the sword and Magic Universe, it was definitely a rare cultivation treasure.<br/><br/>If it was casually released, it could cause a dispute in the forbidden lands.<br/><br/>These few books were of some use to Wang Xian.<br/><br/>The new way of releasing attacks was different from the nine-origin universe. When combined, it could increase one’s strength.<br/><br/>After Wang Xian put them away, he ordered an lie to bring him to other areas.<br/><br/>The following areas should be where the once dominant experts of the forbidden land, the Void Moon, lived.<br/><br/>There were traces of survival in more than a dozen places.<br/><br/>Wang Xian found some treasures there.<br/><br/>Among them, there was a treasure sword that he could use, a spatial sword that was comparable to an innate treasure.<br/><br/>Apart from this spatial sword, Wang Xian also found a lot of resources.<br/><br/>Among them, the most precious resources were ten elixirs.<br/><br/>Elixirs for the ruler of the universe at level eight.<br/><br/>In addition, Wang Xian found a magic note from the residence of these powerhouses.<br/><br/>It was a magic note used to record information.<br/><br/>In this magic note, Wang Xian had a complete understanding of the forbidden land, the Void Moon.<br/><br/>The Forbidden Land, the Void Moon, at its peak, had more than two thousand masters of the universe.<br/><br/>Among them, the strongest one was a master of the universe at level eight.<br/><br/>Two of them, one was the master of the Forbidden Land of the Void Moon, and the other was the grand elder of the Void Moon.<br/><br/>According to the records on the magic note, the Lord of the Forbidden Land of the Void Moon had always been at odds with the Great Elder.<br/><br/>There was also a high possibility that the destruction of the Forbidden Land of the Void Moon was due to their internal strife.<br/><br/>Furthermore, he got a piece of information from the magic note.<br/><br/>The entire Holy Moon was a natural treasure of heaven and earth. The Holy Moon was the core of the Void Moon.<br/><br/>On the top level of the Holy Moon, there was a method to control the entire holy moon of the Void Moon.<br/><br/>After Wang Xian received this news, his eyes flickered slightly.<br/><br/>Some of the holy sons and saintesses from the forbidden grounds of the Holy Land came here for this. The entire Holy Moon is a very powerful treasure ground. ”<br/><br/>Wang Xian mumbled and guessed..\t\t\t\t\t\t</div>", "images": {}, "success": true}