{"id": 954, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073808.html", "title": "Chapter 3956 - Chapter 3956: The Three Thousand Nine Hundred And Fiftyfive Holy Grounds Were Shocked", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3956 - Chapter 3956: The Three Thousand Nine Hundred And Fiftyfive Holy Grounds Were Shocked</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3956: The three thousand nine hundred and fiftyfive holy grounds were shocked<br/><br/>Translator: 549690339<br/><br/>“Which faction is he from? How did he manage to enter the seventh level?”<br/><br/>“Did the other holy grounds send their holy sons and Holy Virgins over? Furthermore, he managed to reach the seventh level in an instant. Will he be able to enter the eighth level? Or is he even higher?”<br/><br/>“Damn it, why did such a fellow suddenly appear? He is only at the fifth level of a universe knight, yet he managed to enter the seventh level. ”<br/><br/>Wang Xian’s entry made the faces of the ten holy sons and Saintesses extremely ugly.<br/><br/>Right now, all of the holy sons and Saintesses had only reached the sixth level. Currently, they were in a state of balance.<br/><br/>Now, a young man had appeared out of nowhere, and he had actually stepped into the seventh level.<br/><br/>This caused their faces to be filled with solemnity.<br/><br/>If they could obtain a forbidden land’s treasured land, it would be a huge improvement for any Holy Land’s forbidden land.<br/><br/>It would increase their strength by a lot.<br/><br/>But now, a young man suddenly broke the balance.<br/><br/>Most importantly, they didn ‘t know anything about this young man.<br/><br/>They didn’t even know which sacred land he came from.<br/><br/>This made them very worried.<br/><br/>“HMM? I got news that the young man just now went from the first floor to the seventh floor without any pause. He killed his way up! ”<br/><br/>At this moment, a Saint Son suddenly received a message and spoke.<br/><br/>The rest of the Saint Sons and Saintesses also focused their eyes and revealed shocked expressions.<br/><br/>“Did he come prepared?”<br/><br/>A Saintess asked with a twinkle in her eyes.<br/><br/>No one could answer her question.<br/><br/>However, at this moment, the experts from the forbidden grounds and the Saint Academy around the Holy Moon immediately started to move.<br/><br/>They started to search for information about Wang Xian based on the information of the disciples in the Holy Moon.<br/><br/>At the same time, more than a dozen forbidden grounds and the Saint Academy started to search together.<br/><br/>However, what shocked them was that no matter how hard they searched, they couldn’t find any information about Wang Xian.<br/><br/>This made the faces of the experts from the forbidden grounds and the Saint Academy extremely ugly.<br/><br/>“Could it be that some powerful forbidden grounds are also trying to get their hands on the forbidden grounds, the Void Moon?”<br/><br/>The experts from the forbidden grounds and the Saint Academy guessed with an ugly expression.<br/><br/>“All the holy sons and saintesses, ascend to the seventh level as soon as possible. ”<br/><br/>At this moment, the group of experts from the forbidden grounds and the Saint Academy also quickly gave an order.<br/><br/>Wang Xian didn’t know that he had caused a huge commotion when he stepped onto the seventh level.<br/><br/>At this moment, he did not continue to challenge anyone on the seventh level.<br/><br/>When he was fighting against two existences that were one level higher than him, Wang Xian felt that it was a little strenuous.<br/><br/>If there was one more, the probability of defeating three was not very high.<br/><br/>Therefore, Wang Xian was not prepared to continue the challenge.<br/><br/>However, when Wang Xian stepped into the seventh level, he saw an unexpected surprise.<br/><br/>In front of the seventh level, there was a platform with some items placed on it.<br/><br/>Wang Xian flew to the front and scanned through the items one by one. A smile appeared on his face.<br/><br/>There was a flaming sword and a water elemental sword.<br/><br/>There were metal elemental magic books that recorded metal elemental magic spells.<br/><br/>Apart from these, there were also some pills.<br/><br/>There were more than 100 elixirs at the second level of the Universe Overlord realm.<br/><br/>In addition, the only thing that was useful to Wang Xian was a pair of shoes.<br/><br/>The shoes that contained the power of space.<br/><br/>They were very useful in sensing and capturing space.<br/><br/>The shoes in this space were comparable to the innate supreme treasure of the nine-origin universe.<br/><br/>They possessed the ability to teleport.<br/><br/>As long as the power of space gushed into it, it would be able to teleport.<br/><br/>The distance of teleportation was about ten times that of Wang Xian ‘s teleportation.<br/><br/>To the current Wang Xian, it was indeed a good treasure.<br/><br/>Other than that, there was nothing else.<br/><br/>Wang Xian was not too interested in these treasures.<br/><br/>If it was to the holy sons and saintesses, they were definitely rare treasures.<br/><br/>However, Wang Xian was not one of them.<br/><br/>To him, these things were very ordinary.<br/><br/>Perhaps only the treasures at the top level of the Tower of Moon could catch his attention.<br/><br/>“It’s really not that easy to reach the top level of the Tower of Moon! ”<br/><br/>Wang Xian mumbled.<br/><br/>On the seventh level, he had to fight against two opponents who were one level higher than him.<br/><br/>What about the eighth level? There were still the ninth, tenth, eleventh, and twelfth levels above the eighth level.<br/><br/>How many stronger opponents did he need to face?<br/><br/>Even Wang Xian did not have much confidence at the moment.<br/><br/>However, Wang Xian was not in a hurry. He was prepared to cultivate on the seventh level. When it was time to contact an lie, he would ask an lie to teleport into the seventh level to take a look.<br/><br/>With this thought in mind, Wang Xian kept the treasures on the seventh level and started to cultivate with his legs crossed.<br/><br/>If he cultivated here, he would be able to reach the peak of the Universe Knight realm within a million years.<br/><br/>If he could reach the peak of the Tower of Moon and cultivate to the ruler realm, it wouldn’t be a big problem.<br/><br/>Perhaps after cultivating for a few hundred million years, his strength would be on par with his main body!<br/><br/>With this thought in mind, Wang Xian quickly absorbed the treasures.<br/><br/>A few thousand years passed in the blink of an eye. Wang Xian opened his eyes and looked at the time. He had set up a demonic spirit altar in front of him!<br/><br/>Buzz! Buzz<br/><br/>Ten minutes later, an Lie’s figure appeared.<br/><br/>“Greetings, Dragon King! ”<br/><br/>An lie bowed respectfully when he saw Wang Xian. “How’s the situation at the Dragon Palace?”<br/><br/>Wang Xian asked an lie with a smile on his face.<br/><br/>“Dragon King, everything is fine at the Dragon Palace. All the disciples are improving rapidly. ”<br/><br/>An lie replied immediately, “Prime Minister Gui asked me to pass on a message to you. Don’t worry about the matters at the Dragon Palace, Dragon King. ”<br/><br/>“Alright, that’s Good! ”<br/><br/>Wang Xian nodded his head in satisfaction. He looked at an lie and said, “An lie, this is a treasure land. See if you can teleport to the upper level.”<br/><br/>“HMM? It’s the Dragon King! ”<br/><br/>An lie nodded his head and looked up. His figure moved and disappeared instantly!<br/><br/>However, a few seconds later, an Lie’s figure appeared.<br/><br/>“Dragon King, I teleported upward and entered a space turbulence. I teleported many times but couldn’t find any direction. It’s very strange here. ”<br/><br/>An lie said.<br/><br/>“HMM? What’s wrong? You Can’t enter the next level?”<br/><br/>Wang Xian looked at an lie in surprise.<br/><br/>“I don’t know the exact location of the next level, so I can only teleport randomly. I’ve teleported dozens of times but haven’t encountered such a space. ”<br/><br/>An lie shook his head. “But Dragon King, I can continue to give it a try! ”<br/><br/>“Go and try. See if you can enter the upper level! ” Wang Xian frowned and instructed.<br/><br/>If an lie could teleport to the upper level, it would be a huge benefit to Wang Xian.<br/><br/>He could easily reach the top of the Moon Tower.<br/><br/>When he trained at the top, the effect would be terrifying..\t\t\t\t\t\t</div>", "images": {}, "success": true}