{"id": 952, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073804.html", "title": "Chapter 3954 - Chapter 3954: Assessment 3953, The Next Level", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3954 - Chapter 3954: Assessment 3953, The Next Level</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3954: Assessment 3953, the next level<br/><br/>Translator: 549690339<br/><br/>Sword Cross!<br/><br/>With the young man as the center, the two space swords on the left and right sides instantly sealed him off.<br/><br/>In another place, Wang Xian had already left behind a sword tomb.<br/><br/>It was very easy for Wang Xian to deal with a spatial swordsman who was at the same level as him.<br/><br/>He could easily defeat him by leaving behind a sword tomb and working together with the other one.<br/><br/>Buzz<br/><br/>The Cross of swords attacked the young man.<br/><br/>The young man’s eyes narrowed and his expression changed slightly. His body trembled and sharp swords emerged from his body. The sharp swords met the Cross of swords directly!<br/><br/>“Bang, Bang, Bang!”<br/><br/>The sounds of collision rang out continuously, but Wang Xian’s Cross of swords seemed to be endless.<br/><br/>This caused the young man’s expression to change drastically. There was a hint of fear in his eyes.<br/><br/>He let out a loud roar and dodged to the side at the risk of being attacked.<br/><br/>However, although he managed to escape from the sword cross, his body was penetrated directly, leaving behind a large amount of blood! Wang Xian stood there and stared at the young man quietly.<br/><br/>“Huff, Huff, Huff! ”<br/><br/>The young man’s face was filled with cold sweat. He looked at Wang Xian with an extremely embarrassed expression!<br/><br/>Wang Xian ignored him and flew straight into the Tower of Moon.<br/><br/>The young man could only clench his fists. He was unwilling but also helpless.<br/><br/>“Among the same level, he defeated me so easily. This guy’s strength is really not simple. ”<br/><br/>He took a deep breath and said, “Perhaps, he can enter the second or even the third level. ”<br/><br/>Wang Xian entered the tower of Moon once again.<br/><br/>When he landed on the space-attributed magic stone, some of the space-attributed powerhouses in the surroundings could not help but look in his direction.<br/><br/>There was a hint of shock on their faces.<br/><br/>The battle between Wang Xian and the young man did not even last for a minute. However, the outcome of the battle was decided so quickly. His strength shocked many people.<br/><br/>This was especially so for those space swordsmen who were at the fifth level of the Universe Knight Realm. There was a hint of solemnity on their faces.<br/><br/>Wang Xian ignored the surrounding gazes. Standing on the magic stone, he could feel an extremely powerful energy.<br/><br/>This energy was only slightly weaker than when he absorbed the mirror image flower.<br/><br/>This caused his eyes to shine.<br/><br/>Buzz<br/><br/>Sitting cross-legged on the magic stone, a wave of space energy surged into his body. At the same time, a piece of information appeared in Wang Xian’s mind.<br/><br/>“Level-up!”<br/><br/>He opened his eyes and revealed a look of surprise.<br/><br/>Yes, level-up.<br/><br/>The so-called level-up was to step into the second level from the first level!<br/><br/>In order to step into the second level, one had to undergo a test.<br/><br/>This test was to defeat two opponents of the same level as him.<br/><br/>As long as one succeeded, one would be able to step into the second level.<br/><br/>In addition, if he wanted to step into the third level from the second level, he would have to face four opponents of the same level as him.<br/><br/>If he wanted to step into the fourth level, he would have to face eight opponents of the same level as him.<br/><br/>It went on and on.<br/><br/>There were a total of 12 levels in the entire tower of the Moon.<br/><br/>The higher the level, the more abundant the energy!<br/><br/>“Doesn’t that mean that if I can reach the top level, the speed of my cultivation there would be comparable to cultivating in the most precious land in the nine-origin universe?”<br/><br/>Wang Xian’s eyes glowed.<br/><br/>To him, this was simply a holy land for cultivation.<br/><br/>Wang Xian’s mind stirred and a surge of energy was injected into the stone of magic.<br/><br/>Following that, a surge of energy wrapped around Wang Xian. In the next moment, he disappeared.<br/><br/>“Huh? He issued a challenge right after he arrived? He’s really confident! ”<br/><br/>In the surrounding area, some of the experts sensed the situation on Wang Xian’s side and exclaimed in astonishment.<br/><br/>At the same time, Wang Xian appeared in a special space.<br/><br/>The entire space could not be seen to the end. In front of him, there were two figures.<br/><br/>These two figures were exactly the same as him!<br/><br/>However, this was merely a mirror image. The only difference was that their faces were the same as Wang Xian’s. Everything else was different!<br/><br/>When the two of them saw Wang Xian, they paused for three seconds before disappearing instantly.<br/><br/>In the next second, Wang Xian sensed a spatial fluctuation on his left and right sides!<br/><br/>The two virtual selves launched their attacks at the same time.<br/><br/>One on the left and the other on the right.<br/><br/>If it was just an ordinary level five universe knight, he would not be a match for two existences of the same level!<br/><br/>“Whoosh! ”<br/><br/>However, before they appeared, Wang Xian’s attack had already covered the left side!<br/><br/>The ice-cold Sword of space spun continuously, releasing a terrifying destructive force.<br/><br/>“PFFT! PFFT! PFFT!”<br/><br/>The moment the stunned shadow appeared, the attack had already landed on the body of the shadow.<br/><br/>The powerful destructive force continued to destroy the body of the shadow.<br/><br/>This made the shadow somewhat illusory!<br/><br/>However, the shadow did not know pain. He shook his arm and the sharp sword in his hand shot toward Wang Xian.<br/><br/>At the same time, he hugged Wang Xian.<br/><br/>It was as though they were going to die together!<br/><br/>On the right side, the shadow also charged over instantly!<br/><br/>swing!<br/><br/>When Wang Xian saw this scene, his expression didn’t change at all. He waved his arm.<br/><br/>Numerous sharp swords formed around him.<br/><br/>However, the sharp swords collapsed rapidly like glass.<br/><br/>The surging force caused a shadow in front of him to disappear!<br/><br/>At the same time, this surging force also stopped the shadow behind him.<br/><br/>Wang Xian’s shadow flickered and stared at the other shadow with a smile on his face.<br/><br/>Although this shadow was exactly the same as Wang Xian, its strength was only at the level of an Ordinary Level five universe knight. It was very easy for Wang Xian to deal with someone at this level!<br/><br/>Whoosh! Whoosh<br/><br/>In less than ten seconds, the second phantom was easily killed by Wang Xian!<br/><br/>Buzz! Buzz<br/><br/>After the two Phantoms died, Wang Xian sensed that the scene around him began to change!<br/><br/>Following that, he appeared on the second level of the Tower of Moon.<br/><br/>“Oh? Another newcomer?”<br/><br/>After arriving, a voice was heard.<br/><br/>Wang Xian scanned his surroundings and realized that there were a total of five to six hundred people on the second level.<br/><br/>This group of people had varying strengths. They ranged from the fifth level of a universe knight to the peak of a universe knight.<br/><br/>The Magic Stone on the second level was not fully filled. There were still dozens of empty seats.<br/><br/>Wang Xian took a glance and looked at the magic stone beneath him. He sat down cross-legged.<br/><br/>An even more majestic energy surged into his body.<br/><br/>The intensity of the energy here was twice that of the first level.<br/><br/>This made Wang Xian look satisfied.<br/><br/>He moved his body and prepared to continue ascending the level!<br/><br/>Continue the challenge!<br/><br/>Buzz<br/><br/>His figure disappeared and reappeared in another space. However, this time, he had four opponents!<br/><br/>Four Phantoms of the same level as Wang Xian!<br/><br/>When Wang Xian saw them, the corners of his mouth curled up slightly.<br/><br/>With the Tianyuan sword technique that Wang Xian had mastered so far, there was no pressure at all for him to fight against opponents of the same level.<br/><br/>Whether it was two or four phantoms, it was just a matter of time!<br/><br/>“Continue. Let’s see if I can reach the top. If I can reach the top, I might be able to cultivate to the level of the ruler of the universe here! ”<br/><br/>He moved his body and charged forward..\t\t\t\t\t\t</div>", "images": {}, "success": true}