{"id": 956, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073812.html", "title": "Chapter 3958 - Chapter 3958: 3957 Forbidden Ground The Saintess Of The Dragon Cry", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3958 - Chapter 3958: 3957 Forbidden Ground The Saintess Of The Dragon Cry</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3958: 3957 Forbidden Ground the Saintess of the Dragon Cry<br/><br/>Translator: 549690339<br/><br/>All the treasures within the Holy Moon that were enveloped by the magic array were obtained by Wang Xian.<br/><br/>The harvest was not bad, but there weren’t too many surprises.<br/><br/>The main reason was that the strength of the forbidden land, the Void Moon, was still a little weak in Wang Xian’s eyes.<br/><br/>The strongest one only had the strength of a level eight universe dominator. This strength was the weakest in the nine-origin universe.<br/><br/>Even the royal family of the nine-origin Universe had an existence at the peak of the Universe Dominator.<br/><br/>As for the Dragon Palace, Wang Xian’s combat strength was basically at the peak of the Universe Dominator.<br/><br/>After all, not everyone had two fragments of the Tianyuan Destiny.<br/><br/>Even the ruler of the other peak races who was below the Tianyuan Destiny.<br/><br/>Wang Xian could easily kill an expert at level eight who was the ruler of the universe.<br/><br/>Therefore, Wang Xian really didn’t care about most of the treasures.<br/><br/>There was even one among them, the most precious item in the sword and Magic Universe, the Magic Alms Bowl.<br/><br/>The Alms Bowl also represented the inheritance.<br/><br/>This was the information that Wang Xian obtained after absorbing the experts from the sword and Magic Universe.<br/><br/>The Magic Alms Bowl and Sword Alms Bowl were the most precious in this universe.<br/><br/>Especially the Magic Alms Bowl and Sword Alms Bowl of the Masters. The more top-notch they were, the more precious they were.<br/><br/>This was similar to the powerful bloodline of the nine-origin universe.<br/><br/>The inheritance of the magic alms bowl and sword alms bowl could allow the inheritor to improve rapidly.<br/><br/>However, similarly, to make this magic alms bowl, one needed the life force of the Creator.<br/><br/>The creator would need to expend one-third of his strength to seal himself.<br/><br/>Furthermore, this magic alms bowl and sword alms bowl could only be passed down to one person.<br/><br/>This was the most precious item in the sword and Magic Universe.<br/><br/>It was also the most precious treasure of all the strong disciples.<br/><br/>This magic alms bowl and sword alms bowl were more precious than anything else.<br/><br/>Wang Xian had a magic alms bowl in his hands that could dominate the seventh level water elemental magic stone.<br/><br/>However, this item was not of much use to Wang Xian.<br/><br/>“An lie, bring my main body here to have a look. ”<br/><br/>Wang Xian returned to the seventh level of the Tower of Moon and continued to instruct an lie.<br/><br/>Since an lie could enter this place directly, Wang Xian’s main body should be able to enter as well. “It’s the Dragon King! ”<br/><br/>An lie nodded.<br/><br/>A few seconds later, Wang Xian’s main body appeared beside him.<br/><br/>This made Wang Xian smile. His body moved and his real body merged with the body of the Void Dragon.<br/><br/>Wang Xian stood there and sensed the seven layers of space.<br/><br/>He wanted to sense the above positions.<br/><br/>“With my current strength, I can break through the surrounding space. However, I can’t sense the eight or nine layers of space. I shouldn’t destroy it recklessly. ”<br/><br/>After thinking for a while, Wang Xian gave up on the idea of using his strength to destroy the space.<br/><br/>If he destroyed the space and still couldn’t find a way to get to the eighth level, he would be at a huge loss!<br/><br/>He wasn’t in a hurry. It was already pretty good for him to cultivate on the seventh level.<br/><br/>With a thought, Wang Xian sat cross-legged on the space magic stone and began to cultivate.<br/><br/>Meanwhile, Wang Xian’s main body was also absorbing the energy of the other attributes in the surroundings.<br/><br/>Time passed by quickly.<br/><br/>Wang Xian’s strength was also improving at a terrifying speed.<br/><br/>Two hundred thousand years passed very quickly.<br/><br/>Wang Xian’s strength had also improved to the level of a universe knight at level eight.<br/><br/>The speed of improvement was slower than Wang Xian had imagined.<br/><br/>The breakthrough of shackles and the accumulation of space energy required a considerable process.<br/><br/>Fortunately, this speed was not too slow.<br/><br/>Within a few million years, he should be able to break through to the realm of the universe’s ruler.<br/><br/>Buzz<br/><br/>PFFT<br/><br/>Time passed once again. However, more than ten years later, Wang Xian suddenly felt a fluctuation coming from the side.<br/><br/>He opened his eyes and looked over. He saw a figure appearing on top of a magic stone.<br/><br/>However, this figure was covered in blood at this moment. Her injuries were extremely serious!<br/><br/>Her blue magic robe was covered in blood, and a large patch of pure white skin was exposed!<br/><br/>This was a female spellcaster with the strength of a level seven universe knight.<br/><br/>Wang Xian couldn’t see her face clearly, but he could tell that her figure was extremely perfect.<br/><br/>Wang Xian looked over and raised his eyebrows slightly.<br/><br/>The woman’s aura was extremely weak. It was obvious that she was severely injured in the trial space.<br/><br/>However, Wang Xian was a little surprised that she was able to reach the seventh level.<br/><br/>The seventh level was to challenge two powerhouses of the same attribute who were one level higher than him.<br/><br/>“Her entire body is filled with treasures of the innate treasure level. With some trump cards, there is a possibility.”<br/><br/>Wang Xian’s gaze swept across the items on her body. Seeing that she was on the verge of death on the ground, he revealed a thoughtful expression.<br/><br/>The woman was already unconscious. If he didn’t treat her immediately, she might really die.<br/><br/>Wang Xian shook his head. With a wave of his arm, a wisp of energy entered the woman’s body!<br/><br/>Following that, he closed his eyes and continued his cultivation!<br/><br/>“MMM”‘<br/><br/>After more than ten minutes, the woman opened her eyes slowly. She sensed her body and heaved a sigh of relief.<br/><br/>However, when she sensed Wang Xian beside her, she quickly sat up.<br/><br/>When she saw her tattered clothes, her face turned red and she quickly wrapped it up.<br/><br/>The energy enveloped her entire body.<br/><br/>When she saw the figure sitting cross-legged without moving, she took a few deep breaths.<br/><br/>After tidying up the blood and hair on her body, she picked up the magic staff beside her and stood up slowly.<br/><br/>“I’m Long Yinyin. Thank you for saving me, my friend. ” Long yinyin cupped her hands at Wang Xian and thanked him.<br/><br/>“No Need! ”<br/><br/>Wang Xian opened his eyes and looked at her before speaking calmly.<br/><br/>“I still have to thank you very much. I know the injuries on my body. If it weren ‘t for you saving me, Pm afraid that my life force would be completely gone in no time.”<br/><br/>Long yinyin shook her head and continued to thank him. “You saved my life. Moreover, once I really die, I won’t be able to enter the seventh level. Thank you for saving my life.”<br/><br/>“It’s a small matter. ”<br/><br/>Wang Xian shook his head at her.<br/><br/>Just now, Wang Xian had treated her fatal injuries with a wave of his hand.<br/><br/>To him, this was really a small matter.<br/><br/>“Long Yin Yin from the Dragon Cry Forbidden Ground, thank you again! ”<br/><br/>Long Yin bowed and thanked him again. Then, he looked at Wang Xian and sized him up, a curious expression appeared on his face. “Which Holy Son are you from? “You’re amazing. You managed to fight your way from the first level to the seventh level. Furthermore, you only fought for a few hours on the seventh level. Do you know how long I fought there? “It was more than 500 years and I was almost killed. ”<br/><br/>Wang Xian heard her words and looked at her. She was 1.8 meters tall and had a perfect face. There was a trace of holiness and curiosity on her body. “Are you the Saintess of the Dragon Cry Forbidden Ground?” Wang Xian asked.<br/><br/>Long Yin nodded and asked in return, “What About You?”<br/><br/>“Me? Pve already said it when I was on the sixth level. I don’t have any influence and I cultivate alone. ” Wang Xian answered truthfully..\t\t\t\t\t\t</div>", "images": {}, "success": true}