{"id": 958, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073816.html", "title": "Chapter 3960 - Chapter 3960: 3959 Stepped Into The Eighth Level!", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3960 - Chapter 3960: 3959 Stepped Into The Eighth Level!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3960: 3959 stepped into the eighth level!<br/><br/>Translator: 549690339<br/><br/>In the land of swords and magic, the heaven’s favorites dominated the saint sons and Saintesses of the same generation.<br/><br/>Those who could become the saint sons and saintesses were all the most elite generation that was nurtured in a sacred forbidden land.<br/><br/>Their temperament, strength, and talent were all among the one in a hundred billion people.<br/><br/>None of them were people who thought highly of themselves.<br/><br/>None of them were arrogant and didn’t put anyone in their eyes.<br/><br/>When he saw Wang Xian sitting there with his legs crossed, the Qingye saint took out a magic array disk to investigate.<br/><br/>Wang Xian did not deliberately hide his strength. His level eight universe knight cultivation was quickly detected.<br/><br/>This made the Qingye saint’s expression change drastically. He looked at Wang Xian with a serious expression.<br/><br/>A space swordsman at level eight of the universe was not something they could fight against.<br/><br/>Their strength was still far, far away.<br/><br/>“I didn’t expect this brother to have the strength of a level eight universe Knight. ”<br/><br/>The qingye holy son cupped his hands at Wang Xian. (‘I wonder if this brother can tell me where he came from. I Am Qingye Holy Land of Qingmen. I didn ‘t mean to offend you. ”<br/><br/>At the side, the Zhengtian Holy Son heard the Qingye Holy Son’s words and his gaze froze.<br/><br/>“A universe knight at level eight. According to Our Holy Land’s investigation, he’s only at level six.”<br/><br/>His expression slightly changed, and he transmitted his voice to the Qingye Saint Son.<br/><br/>“He should have hidden his strength before. According to my investigation,<br/><br/>I’ve confirmed that he’s at level eight. Coupled with the space attribute, this mysterious young man is very strong. ”<br/><br/>The Qingye saint immediately replied with a voice transmission. His eyes revealed a trace of seriousness and vigilance.<br/><br/>If Wang Xian wanted to make a move against them, they would not make a move.<br/><br/>The other party could easily occupy the entire seventh level. Unless a level nine universe knight and a peak saint came in.<br/><br/>“I’ll say it one last time. No sects, no sects. ” Wang Xian said to them one last time.<br/><br/>“No sect, no sect?”<br/><br/>The Qingye saint and the Zhengtian saint frowned slightly. They were astonished.<br/><br/>“That’s really possible. If he’s in a forbidden land of a Holy Land, we can’t stay here anymore!”<br/><br/>The Zhengtian saint pondered for a moment and transmitted his voice to the Qingye saint.<br/><br/>The Qingye saint nodded.<br/><br/>They came here with a mission. They were here to control the Holy Moon.<br/><br/>If he was really a holy son of a holy ground, he could have chased them out or even destroyed them.<br/><br/>However, he didn’t do so.<br/><br/>They glanced at long yinyin and sat down slowly.<br/><br/>Although they couldn’t kill long yinyin or chase him out, they had received some information about Wang Xian.<br/><br/>They immediately sent the information to the powerhouses of the holy ground.<br/><br/>“Thank you, you helped me again! ” Long yinyin thanked Wang Xian.<br/><br/>Wang Xian sat there and didn’t reply.<br/><br/>Long yinyin saw it and continued to cultivate helplessly.<br/><br/>Time passed. Soon, 200,000 years passed once again.<br/><br/>Wang Xian felt that he could easily step into the ninth level of the Universe Knight Realm.<br/><br/>He opened his eyes and looked around.<br/><br/>There were many more people on the seventh level, from three to eight.<br/><br/>Beside Long yinyin, there was a young man who looked similar to her. The two of them were sitting cross-legged on the magic stone.<br/><br/>Wang Xian opened his eyes and looked around. The seven of them opened their eyes as they sensed something and looked at Wang Xian.<br/><br/>Among this group of people, there were also existences at the eighth level of the Universe Knight Realm. There were even two existences at the ninth level of the Universe Knight Realm.<br/><br/>Wang Xian was not interested. With a thought, he slowly disappeared.<br/><br/>“Eh? He has started to challenge again!”<br/><br/>When the eight holy sons and saintesses saw Wang Xian disappear and saw that the Magic Stone under him was glowing, they were all surprised. Such a situation meant that they were going to challenge again.<br/><br/>“Is he really without a sect?”<br/><br/>One of the SAINTESSES could not help but ask with a frown.<br/><br/>“If he really is without a sect, then he must have obtained a powerful inheritance of the Sword Bowl. Otherwise, he wouldn’t be able to reach this stage. ”<br/><br/>A holy son said.<br/><br/>“The possibility is very high. He must have obtained the inheritance of a certain powerhouse. ”<br/><br/>The few holy sons and saintesses beside him nodded.<br/><br/>Long yinyin watched as Wang Xian continued to challenge.<br/><br/>“Eh, there are only three phantoms of level nine universe knights. It’s not four.<br/><br/>There’s one less than I expected.”<br/><br/>At the same time, Wang Xian’s figure appeared in the challenge space.<br/><br/>When he saw the Phantoms of three level nine universe knights, a smile appeared on his face.<br/><br/>If he knew there were only three of them, he would have challenged them long ago!<br/><br/>With his current strength, it was not a problem for him to challenge three of them.<br/><br/>Now that he could step into the level nine universe Knight realm with just one step, it was not a big problem anymore!<br/><br/>The following battle was not too suspenseful.<br/><br/>However, facing these three level nine universe knights spatial swordsmen, Wang Xian still fought with them for three hours.<br/><br/>After three hours, Wang Xian easily stepped into the eighth level.<br/><br/>Buzz<br/><br/>At the same time, at the seventh level, the eight holy sons and Saintesses had been paying attention to Wang Xian’s situation ever since he began his challenge.<br/><br/>When they saw the glow on the magic stone fading away, the holy sons and saintesses were shocked.<br/><br/>“He… he actually passed the challenge. He actually succeeded! ”<br/><br/>“How long has it been? He succeeded in just three hours. How is this possible?<br/><br/>When I came to the seventh floor, I fought for a hundred years! ”<br/><br/>“He succeeded in three hours. What kind of trump card does that mysterious guy have? To enter the eighth floor, he needs to challenge three existences that are one level higher than him! ”<br/><br/>The eight holy sons and Saintesses discussed in astonishment.<br/><br/>“So powerful. ”<br/><br/>Long yinyin also said in slight astonishment.<br/><br/>“Before entering the new level, there will be some treasures on that level. Once he enters, the treasures will directly belong to him. In this way, his strength might become stronger and stronger. ”<br/><br/>The young man standing beside long yinyin said, his gaze looked at her. “Sister, you said that he saved you. If you meet him the next time you enter the eighth level, you can try to invite him to our dragon roar forbidden ground.<br/><br/>Who knows, he might agree.”<br/><br/>“Wanting to enter the eighth level is extremely difficult. This time, I might not be able to enter quickly. ”<br/><br/>Long Yin Yin shook her head and said.<br/><br/>Sister, in terms of combat experience, you are the strongest among us. I believe that you will definitely be the first to enter the eighth level. ”<br/><br/>The young man said with a smile.<br/><br/>Long Yin Yin nodded her head as her eyes sparkled.<br/><br/>“Eh? There are many more treasures this time.”<br/><br/>When Wang Xian arrived at the eighth level, his gaze landed on the spot in front of him.<br/><br/>He smiled when he saw some treasures on it..\t\t\t\t\t\t</div>", "images": {}, "success": true}