{"id": 957, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073814.html", "title": "Chapter 3959 - Chapter 3959: 3958 Below The Saintess Of The Dragon Cry Forbidden Ground", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3959 - Chapter 3959: 3958 Below The Saintess Of The Dragon Cry Forbidden Ground</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3959: 3958 below the Saintess of the Dragon Cry Forbidden Ground<br/><br/>Translator: 549690339<br/><br/>“No Power? Cultivating alone?”<br/><br/>Long Yin Yin looked at Wang Yun with a stunned expression. She didn’t believe it.<br/><br/>Cultivating alone, how could he reach the seventh level of the Moon Tower so easily?<br/><br/>One had to know that from the fifth level onwards, everyone who could enter was a heaven’s pride, Saint Sons, and saintesses from the sacred land.<br/><br/>In fact, the original ten people on the sixth level were all Saint Sons and saintesses from the forbidden grounds of the Holy Land.<br/><br/>How could a person without any background or power be able to reach the seventh level?<br/><br/>“That’s true. There’s no need for me to hide it.”<br/><br/>Wang Xian smiled and said.<br/><br/>“That’s true. If you were from the other forbidden grounds of the Holy Land, you wouldn’t have saved me. ”<br/><br/>Long yinyin nodded her head slightly and said.<br/><br/>The group of forbidden grounds were all competing to obtain the Holy Moon.<br/><br/>If Wang Xian was the holy son of the other forbidden grounds, they wouldn’t be able to save him as their competitors.<br/><br/>“Did you obtain a powerful sword alms bowl? To think that you’re so powerful. You’re even more powerful than the holy sons and Saintesses of our forbidden grounds. ”<br/><br/>Long Yin continued to ask curiously.<br/><br/>Wang Xian glanced at her and felt that this girl was a little talkative.<br/><br/>“I guess so! ”<br/><br/>He replied faintly and continued to cultivate while sitting cross-legged.<br/><br/>When Long Yin Yin saw that Wang Xian didn’t want to bother with her, she had no choice but to give up. She sat cross-legged at the side and continued to cultivate.<br/><br/>Time passed quickly once again.<br/><br/>Buzz<br/><br/>Twenty thousand years later, a third figure appeared on the seventh level.<br/><br/>“Huff! Huff! ”<br/><br/>It was a young holy son. He was in a sorry state and had injuries on his body.<br/><br/>After he entered the seventh level, his gaze swept past long yinyin and finally landed on Wang Xian.<br/><br/>“Zhengtian, I didn’t expect you to come in as well! ”<br/><br/>Long yinyin stared at the young holy son and frowned slightly.<br/><br/>Her eyes were sparkling.<br/><br/>“What? You want to attack me?”<br/><br/>The young man stared at Long Yin Yin with vigilance. He wiped the blood from the corner of his mouth and revealed an icy expression.<br/><br/>Long Yin Yin showed a hesitant expression.<br/><br/>Buzz<br/><br/>However, at this moment, a figure slowly appeared on a magic hair stone at the side.<br/><br/>Whoosh<br/><br/>The third figure was also a young man. After he appeared, he immediately scanned his surroundings with vigilance.<br/><br/>“Heh, holy son Zhengtian, I didn’t expect you to come here even more than me.”<br/><br/>The young man looked at Zhengtian and said indifferently.<br/><br/>“Qingye, we’re all injured now. Some of us aren’t. ”<br/><br/>The holy son Zhengtian stared at him and said with a twinkle in his eyes.<br/><br/>“Oh? Could it be that she wants to kill the two of us?”<br/><br/>The young man called Qingye smiled and locked his eyes on long yinyin.<br/><br/>Long yinyin frowned slightly when she saw another holy son arrive.<br/><br/>She sat there cross-legged and didn’t move at all.<br/><br/>The Zheng Tian holy son heaved a sigh of relief when he saw this scene.<br/><br/>He and the Qingye holy son exchanged a glance. The two of them immediately sat cross-legged on the magic stone and began to recover from their injuries.<br/><br/>They could fight in this space.<br/><br/>As rivals, the Zheng Tian holy son was really afraid that long yinyin would attack him just now.<br/><br/>If the Qingye Saint didn’t come, he would be attacked by long yinyin.<br/><br/>The four of them sat cross-legged on the magic stone on the seventh level and cultivated quietly.<br/><br/>Wang Xian didn’t pay any attention to the two who came.<br/><br/>Now, his main body had entered. In his opinion, an existence of such level could be easily crushed to death.<br/><br/>Boom<br/><br/>Time passed day by day again. A hundred years later, a wave of power suddenly came.<br/><br/>The sudden energy fluctuation caused Wang Xian to slowly open his eyes and look to the side.<br/><br/>At the side, the two young men stood up slowly and locked onto long yinyin.<br/><br/>Long yinyin sensed their power and locked onto him. He stood up with a solemn expression.<br/><br/>“What? You Want to deal with me? Did you two experts from the two holy lands come to an agreement?”<br/><br/>Long Yin Yin stared at them and asked in a deep voice.<br/><br/>“Hehe, you know the answer. Now, I’ll give you two choices. One is to leave this place immediately, and two is to die here. Long Yin Yin, don’t think that I don’t know that you wanted to make a move when I first came in. ”<br/><br/>The Zheng Tian saint son stared at Long Yin Yin and said with an icy expression.<br/><br/>“You want to Chase Me Out? With just you two?”<br/><br/>Long Yin moved her hand and gripped her azure staff tightly. Water began to gather around her as she stared at the two of them. “The space here is very small. It Won’t be difficult for us to fight two people at once. ”<br/><br/>“Is that so? We know each other’s strength very well. If you want to fight two people at once, Hehe!”<br/><br/>The Qingye Saint Son sneered. With a move of his hand, a sharp sword appeared in his hand.<br/><br/>Streams of flames swirled on the sharp sword and condensed into the shape of a demonic beast.<br/><br/>When Long Yinyin saw that they were really about to make a move, his expression turned ugly.<br/><br/>With a move of his palm, without any hesitation, the water elemental energy on the magic staff began to condense.<br/><br/>Boom! Boom<br/><br/>The entire seventh level emitted a rumbling sound.<br/><br/>“Don ‘t disturb my cultivation. ”<br/><br/>When Wang Xian saw that the three of them were about to fight, he opened his eyes and reminded them faintly.<br/><br/>“Which forbidden ground are you from? Tell us. Otherwise, don’t blame us for being rude. ”<br/><br/>The Zheng Tian holy son stared at Wang Xian and asked with narrowed eyes.<br/><br/>When Wang Xian had just stepped into the seventh level, the group of holy sons and saintesses were extremely shocked.<br/><br/>Following that, the group of experts from the forbidden grounds of the Holy Land immediately carried out an investigation on this matter.<br/><br/>Although they didn’t find out which faction Wang Xian came from, they were very clear about his strength.<br/><br/>The strength of a level six universe knight, the space attribute.<br/><br/>This strength could indeed cause fear, but they weren’t afraid at all.<br/><br/>They were the holy sons of the sacred land. Although the space attribute was powerful, it would not be easy for them to fight against the holy sons.<br/><br/>With the help of the treasures in their hands, these holy sons and holy daughters were able to fight against ordinary universe knights.<br/><br/>After receiving this accurate news, they had never placed Wang Xian in their eyes.<br/><br/>The only thing they had to worry about now was Wang Xian’s background.<br/><br/>Was there a super holy ground behind him. “You’re welcome. What will happen?”<br/><br/>Wang Xian looked at him and asked calmly.<br/><br/>Now, Wang Xian’s void dragon body had already broken through to the level eight universe Knight Realm. It would be very easy for him to kill these two holy sons.<br/><br/>“HMM? You want to interfere in the matters between our holy grounds?”<br/><br/>Seeing Wang Xian’s calm expression, the Qingye holy son focused his gaze and sized him up carefully. He was a little surprised and asked.<br/><br/>“Just don’t disturb my cultivation. ”<br/><br/>Wang Xian replied indifferently, “Don’t challenge my patience. ”<br/><br/>After that, he closed his eyes.<br/><br/>Don’t challenge my patience?<br/><br/>When the Zheng Tian holy son and the Qingye holy son heard Wang Xian’s words, their faces darkened.<br/><br/>They looked at Wang Xian who was cultivating with his eyes closed and felt that they couldn’t see through him.<br/><br/>The Qingye Saint moved his palm and a magic array disk appeared in his hand. He injected energy directly into it.<br/><br/>When he saw the information on the magic array disk, his expression changed..\t\t\t\t\t\t</div>", "images": {}, "success": true}