{"id": 959, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073818.html", "title": "Chapter 3961 - Chapter 3961: 3960, They Met Again", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3961 - Chapter 3961: 3960, They Met Again</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3961: 3960, they met again<br/><br/>Translator: 549690339<br/><br/>There were more treasures on the eighth level than on the seventh level.<br/><br/>Gold, wood, water, fire, Earth, wind, thunder, Light, darkness, and space attribute pills. Each pill was on the level of a universe overlord.<br/><br/>Other than that, there were three books that contained powerful energy.<br/><br/>This book was a treasure that was comparable to an innate supreme treasure.<br/><br/>It was water, wind and space respectively.<br/><br/>Wang Xian opened the space attribute book. On the book, there was a drawing of a sharp sword.<br/><br/>“Enchantment Space Book! ”<br/><br/>This was the name of this book. It was a supplementary innate treasure.<br/><br/>However, this support was very powerful.<br/><br/>It could be enchanted on the sharp sword to increase its destructive power.<br/><br/>This improvement was extremely huge!<br/><br/>It was just right for Wang Xian to use it!<br/><br/>Other than these treasures, there were also some other cultivation pills. There were also quite a number of them.<br/><br/>Wang Xian kept all of them and continued to sit cross-legged to cultivate.<br/><br/>With his current strength, defeating three people who were of a higher level than him was already his limit.<br/><br/>If it was four people, it would be more troublesome for Wang Xian. It was hard to say whether he could win or not.<br/><br/>Therefore, Wang Xian was not prepared to challenge him immediately. Instead, he was prepared to make a breakthrough.<br/><br/>He would train to the peak of the Universe Knight Realm on the eighth level before challenging him again.<br/><br/>From the peak of the Universe Knight Realm to the peak of the Universe Overlord realm, this was a huge shackle.<br/><br/>Once he reached the peak of the Universe Knight Realm, the one who would be challenged would be the universe overlord realm.<br/><br/>However, Wang Xian could always accumulate his strength in the Universe Knight Realm.<br/><br/>Just like Wu Sha and the rest who were once crazy demons.<br/><br/>By accumulating his strength and not breaking through, he would have the strength to kill A Level One universe master at the peak of the Universe Knight Realm.<br/><br/>As long as Wang Xian could accumulate his strength to this point, he would be able to easily kill five to six or even more level one universe masters.<br/><br/>This was Wang Xian ‘s plan.<br/><br/>At that time, he would be able to control this treasured land.<br/><br/>The Holy Moon, which was once a forbidden land, was also a very powerful treasured land for Wang Xian.<br/><br/>This was also the only treasure that Wang Xian was interested in.<br/><br/>Obtaining him could also be considered as having a base.<br/><br/>Wang Xian pondered in his heart as he sat cross-legged and began to cultivate.<br/><br/>Time passed quickly once again.<br/><br/>In the blink of an eye, another million years had passed. However, this time, Wang Xian returned to the Dragon Palace Midway and spent some time with Guan Shuqing and the rest of the girls.<br/><br/>Buzz<br/><br/>He continued to cultivate. On this day, a fluctuation came from the side.<br/><br/>Wang Xian opened his eyes and looked over.<br/><br/>“Huh?”<br/><br/>However, when he saw the figure who appeared there, he was slightly stunned.<br/><br/>A look of astonishment appeared on his face.<br/><br/>It was the Saintess from the dragon’s cry forbidden land called Long Yinyin again.<br/><br/>Just like the last time, Long Yinyin was lying on the magic stone in a miserable state.<br/><br/>Her clothes were torn and she was even more miserable than the last time.<br/><br/>Furthermore, the injuries on her body were even more miserable than the last time.<br/><br/>Now, she was completely gasping for air and gasping for air. She looked like she was on her last breath.<br/><br/>According to Wang Xian’s prediction, she would lose her life completely in a few hours.<br/><br/>Wang Xian looked at her and felt a little speechless.<br/><br/>Every time she came in, she almost lost her life.<br/><br/>Saving her once is still saving her life. Saving her twice is also saving her life!<br/><br/>Wang Xian shook his head and waved his arm. A surge of energy surged into long Yinyin’s body and quickly restored her life force.<br/><br/>“MMM”‘<br/><br/>Long Yin let out a low moan and slowly opened her eyes. Her gaze landed on Wang Xian.<br/><br/>Following that, she sensed something and hurriedly tugged at her clothes. When she saw the condition of her body, her face turned extremely red.<br/><br/>“Thank you. You saved me again. ”<br/><br/>Long Yin hurriedly thanked him in a low voice. She used her energy to transform into clothes and wrapped them around her body.<br/><br/>“There’s no need. You’re pretty strong. You only managed to climb up to the eighth level when you were on the verge of death. ”<br/><br/>Wang Xian looked at him and teased him.<br/><br/>“There’s no other way. I have an attack that requires me to give up all my defenses and consume some of my life force. That’s why Pm always in such a miserable state. ”<br/><br/>Long Yin looked at Wang Xian with a bitter expression.<br/><br/>It was extremely difficult to climb up to the eighth level.<br/><br/>The reason why she was able to climb up was basically at the cost of her life. If Wang Xian didn’t save her again, she would have died immediately.<br/><br/>“You won’t be able to reach the twelfth level in your current state.”<br/><br/>Wang Xian looked at her and shook his head.<br/><br/>“There’s no other way. The Holy Moon is an extremely powerful treasure to any forbidden land. As long as there’s a glimmer of hope, I can’t Give It Up. ”<br/><br/>Long Yin shook her head, then, she looked at Wang Xian and said, “However, I feel that if anyone can enter the twelfth level, it would be you. When you reached the eighth level, it was too easy. Do you really not have any influence?”<br/><br/>“Then, do you want to join a force? How about our Dragon Roar Forbidden<br/><br/>Ground? Don’t worry. As long as you are willing to join, the position of the Holy Son in our Dragon Roar Forbidden Ground would be you. Furthermore, we can give you the cultivation resources and treasures you need. We will definitely nurture you as our core disciple. ”<br/><br/>As she spoke, she looked at Wang Xian with anticipation.<br/><br/>When Wang Xian heard her words, he was speechless.<br/><br/>Wang Xian didn’t really care about joining a forbidden ground. However, if he wanted to join now, he would need sufficient cultivation resources.<br/><br/>Moreover, it was best if these cultivation resources were not ordinary cultivation resources.<br/><br/>Since he could obtain ordinary cultivation resources, there was no need for him to join a forbidden ground.<br/><br/>“I don’t lack cultivation resources. ”<br/><br/>Wang Xian shook his head and rejected with a smile.<br/><br/>“Don’t reject me yet. If our dragon roar forbidden land can produce treasures that satisfy you, how about you join us?”<br/><br/>Dragon Roar looked at him with anticipation.<br/><br/>He had a good impression of Wang Xian.<br/><br/>Not to mention his great talent, just the fact that he had saved his life twice was already enough to make her extremely grateful!<br/><br/>If Wang Xian could join their dragon Roar Holy Land, she would be able to repay him well.<br/><br/>Wang Xian smiled and raised his eyebrows. “It’s possible, but this treasure must be useful to me.”<br/><br/>“If you join our Dragon Roar Holy Land, I can promise you one thing. That is my forbidden spell. When I cast it, it will unleash a terrifying destructive power. If this forbidden spell doesn’t join our forbidden land, our dragon roar forbidden land is not going to spread it either. ”<br/><br/>Dragon roar yin continued, “However, regardless of whether you join us or not, I will repay you for saving me twice. I will ask my family for a treasure that is useful to you.”<br/><br/>“The forbidden spell that you cast? You can use the spatial attribute as well?” Wang Xian raised his eyebrows and asked.<br/><br/>“Yes, there is no restriction on the attributes. You must know that this move of our Dragon Roar Forbidden Land is ranked in the top ten among the forbidden spells in the sword and Magic Continent. ” Dragon’s Roar Yin said with slight pride..\t\t\t\t\t\t</div>", "images": {}, "success": true}