{"id": 953, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073806.html", "title": "Chapter 3955 - Chapter 3955: When 3954 Stepped Into The Seventh Level, The Holy Sons And Saintesses Were Shocked", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3955 - Chapter 3955: When 3954 Stepped Into The Seventh Level, The Holy Sons And Saintesses Were Shocked</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3955: When 3954 stepped into the seventh level, the holy sons and saintesses were shocked<br/><br/>Translator: 549690339<br/><br/>Buzz<br/><br/>Wang Xian took only a minute to kill four phantoms of the same level in the space of the second level.<br/><br/>When the four Phantoms were all killed, Wang Xian’s figure appeared in the third level.<br/><br/>The moment he appeared, some people in the surroundings looked over. Wang Xian swept his gaze over. There were 70 to 80 people on this level.<br/><br/>Most of them were sitting cross-legged and cultivating.<br/><br/>To be able to fight against four people and defeat them, these people were either very experienced or had powerful sword techniques and treasures in their hands.<br/><br/>Wang Xian sat cross-legged on the magic stone and sensed it with his mind.<br/><br/>On the third level, the energy in the magic stone was even more majestic. Cultivating here was no weaker than Wang Xian cultivating with the mirror flower.<br/><br/>“This is really a holy land for cultivation!”<br/><br/>Wang Xian sighed slightly. With a thought, he continued the challenge.<br/><br/>It was not Wang Xian’s limit to fight against four existences of the same level.<br/><br/>When he entered the space again, this time, there were eight existences of the same level.<br/><br/>Wang Xian moved his body and charged forward immediately.<br/><br/>The battle was still very easy for Wang Xian.<br/><br/>This time, he used two minutes.<br/><br/>Two minutes later, his figure disappeared!<br/><br/>“Eh? He actually entered the upper level so quickly. Is he a core disciple from some forbidden land of the Holy Land?”<br/><br/>At the third level, some of the strong ones saw Wang Xian entering the upper level. Their eyes focused and they asked in surprise.<br/><br/>Those who were able to enter the third level were all core disciples from the forbidden grounds and the Saint Academy.<br/><br/>However, they didn’t think that Wang Xian was here. This made them wonder if another faction from the forbidden grounds had arrived.<br/><br/>Wang Xian didn’t know about their guesses. At this moment, he was already at the fourth level.<br/><br/>There were fewer people on the fourth level.<br/><br/>There were only about twenty people.<br/><br/>Wang Xian’s arrival once again attracted the attention of everyone.<br/><br/>Those who were able to step into this level were basically all very famous heaven’s favorites!<br/><br/>“Brother, which faction are you from?”<br/><br/>A young man looked at Wang Xian and asked directly.<br/><br/>“No sects! ”<br/><br/>Wang Xian replied indifferently and sat cross-legged on the magic stone.<br/><br/>With a thought, he continued the challenge.<br/><br/>“Eh? He’s continuing the challenge?”<br/><br/>“No sect or sect?”<br/><br/>Everyone was slightly stunned. When they saw Wang Xian ‘s figure disappear, they were stunned.<br/><br/>In order to get to the fifth level, he needed to challenge sixteen people.<br/><br/>Sixteen people of the same level shouldn’t be a problem for Wang Xian.<br/><br/>In less than ten minutes, Wang Xian appeared on the fifth level.<br/><br/>At the fourth level, everyone was shocked when they saw that Wang Xian had successfully entered the fifth level.<br/><br/>“He actually entered the fifth level right after he arrived. How impressive. ” “Immediately check the identity of this young man. He is able to defeat sixteen people of the same level. He is already among the top heaven’s favorites.” Some of the Heaven’s favorites on the fourth level immediately spread the news to the sacred grounds and the Sacred Academy.<br/><br/>This sacred Moon was a huge treasure trove for any sacred grounds and forbidden grounds.<br/><br/>All the powers were coveting it, and were thinking of ways to get their hands on it.<br/><br/>According to the speculations of the experts in the sacred grounds and forbidden grounds, in order to control the entire sacred moon, one would first need to control the moon tower.<br/><br/>The control mechanism of the tower of the Moon might be located at the top level.<br/><br/>A young man who appeared out of nowhere had stepped into the fifth level. To the group of people from the forbidden grounds of the Holy Land, this required a lot of attention.<br/><br/>“Which faction are you from?”<br/><br/>Wang Xian’s figure appeared on the fifth level. A voice was heard immediately.<br/><br/>Around 20 pairs of eyes were staring at Wang Xian. They were looking at him in astonishment.<br/><br/>“There’s no sect or sect! ”<br/><br/>Wang Xian continued to reply indifferently. He sat cross-legged on the magic stone and challenged again.<br/><br/>His actions once again made the top heaven’s favorites around him look astonished.<br/><br/>Those who were able to reach the fifth level were all top heaven’s favorites disciples from various factions.<br/><br/>They were existences second only to the holy sons and Saintesses of the Holy<br/><br/>Land.<br/><br/>There were even holy sons among them who were also stuck at the fifth level.<br/><br/>Wang Xian was also puzzled by the continuous questioning.<br/><br/>However, he didn’t think too much about it.<br/><br/>He wanted to step into a higher level and cultivate there for a period of time.<br/><br/>He entered the challenge space again. This time, it wasn’t 32 phantoms of the same level.<br/><br/>Instead, it was the phantoms of a level six universe knight.<br/><br/>“Fighting above my level?”<br/><br/>Wang Xian smiled. With a move of his body, he charged forward.<br/><br/>He didn’t feel any pressure to fight above his level.<br/><br/>With the increase in his strength and his understanding of the Heaven’s origin sword technique, his sword technique became even more terrifying.<br/><br/>At the level of the eternal swordmaster, Wang Xian was able to fight above his level.<br/><br/>It would be easier to fight above his level now.<br/><br/>With the combination of Wang Xian’s sword catacombs, it wasn’t difficult to fight above his level.<br/><br/>“This shouldn’t be my limit!”<br/><br/>Wang Xian’s figure changed as he thought to himself.<br/><br/>Swoosh! Swoosh! Swoosh<br/><br/>When Wang Xian appeared on the sixth level, ten pairs of eyes landed on him.<br/><br/>All of them were staring at him.<br/><br/>Wang Xian looked over and saw that there were only ten people on the sixth level.<br/><br/>Each of them looked imposing and had a unique aura about them.<br/><br/>However, Wang Xian merely swept his gaze across them and continued to sit cross-legged on the magic stone.<br/><br/>“Brother, which sacred ground are you from?” One of the long-haired young men asked faintly.<br/><br/>“No sect, no sect! ”<br/><br/>Wang Xian repeated this sentence and disappeared without a trace!<br/><br/>“Huh? What? He’s continuing to challenge?”<br/><br/>“Challenging two existences that are one level higher than him?”<br/><br/>“He has no sect or sect. Who are you trying to fool? How can a kid with no background, a level five universe knight, be able to reach this stage?”<br/><br/>The ten young men and women saw Wang Xian continuing to challenge and spoke in disbelief.<br/><br/>They could easily sense Wang Xian’s strength.<br/><br/>He was only at the level five universe Knight Realm.<br/><br/>With such strength, how could he not have a background to reach this stage?<br/><br/>The eyes of the ten young men flickered slightly as they immediately passed on the news one by one.<br/><br/>At the same time, they stared at the location of the magic stone where Wang<br/><br/>Xian had disappeared.<br/><br/>They waited quietly.<br/><br/>These ten young men and women came from powerful forbidden lands and Saint Academies.<br/><br/>They relied on powerful treasures and powerful techniques to reach this stage.<br/><br/>At the moment, all the holy sons and Saintesses could reach their limits.<br/><br/>As for the seventh level, no one had entered yet.<br/><br/>The ten holy sons and saintesses stared at the position of Wang Xian’s magic stone. Time passed by minute by minute.<br/><br/>After an hour, the faces of the ten holy sons and Saintesses suddenly changed drastically.<br/><br/>“He actually made it to the seventh level! ”<br/><br/>The ten holy sons and saintesses shouted in a low voice with a face full of shock..\t\t\t\t\t\t</div>", "images": {}, "success": true}