{"id": 951, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073802.html", "title": "Chapter 3953 - Chapter 3953: 3952 Treasure Location", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3953 - Chapter 3953: 3952 Treasure Location</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3953: 3952 treasure location<br/><br/>Translator: 549690339<br/><br/>Wang Xian looked at the location that was covered by the array formation and frowned slightly.<br/><br/>After sizing it up carefully, he couldn’t do anything about it.<br/><br/>Although he could ignore this magic array due to the special characteristics of an lie, Wang Xian couldn’t contact him at the moment.<br/><br/>Since they were in different universes, Wang Xian’s senses towards the dragon palace were very weak.<br/><br/>Therefore, he could not summon an lie over.<br/><br/>When he stepped into this sword and magic universe, Wang Xian made an agreement with an lie that they would contact each other once every 10,000 years.<br/><br/>At that time, he would set up the Devil Spirit Altar. An lie would find this new devil spirit altar and teleport over directly.<br/><br/>There were still 5,000 to 6,000 years before Wang Xian could contact an lie.<br/><br/>However, Wang Xian was not in a hurry. He might be able to stay in this area for another five to six thousand years.<br/><br/>When an lie arrived, he could ask him to take the treasures away.<br/><br/>With this thought in mind, Wang Xian continued to fly in.<br/><br/>He kept flying in. There were collapsed buildings everywhere.<br/><br/>However, there was a building in front of him that was exceptionally eye-catching.<br/><br/>This was a pagoda.<br/><br/>The entire pagoda occupied about one-tenth of the space in this area.<br/><br/>The pagoda stood at the center and was more than 100,000 meters tall.<br/><br/>The entire pagoda was divided into more than ten floors.<br/><br/>Wang Xian looked at the pagoda and scanned his surroundings.<br/><br/>He took a look around. It was either a collapsed building or an area that was covered by a magic array.<br/><br/>Even an area that was covered by a magic array couldn’t be entered.<br/><br/>This pagoda was the most complete one.<br/><br/>He moved his body and flew into the pagoda.<br/><br/>There was only one entrance to the pagoda. Wang Xian stood in front of the entrance and looked up.<br/><br/>The words ‘Moon Pagoda ‘were carved on the entrance.<br/><br/>He moved his body and flew into the pagoda.<br/><br/>Buzz! Buzz! Buzz<br/><br/>The moment he entered, a surge of majestic energy rushed over.<br/><br/>This energy contained the ten attributes of the sword and the magical universe.<br/><br/>The extremely dense energy made even Wang Xian exclaim in admiration.<br/><br/>“The density of this level of energy is comparable to the powerful treasure land occupied by the peak races of the nine-origin universe. ”<br/><br/>Wang Xian mumbled.<br/><br/>This forbidden land, the Void Moon, could be considered a peak race in the nine-origin universe.<br/><br/>“The Moon Tower is already full. Get out immediately. ”<br/><br/>At this moment, if he didn’t have enough strength, he would get out.<br/><br/>However, when Wang Xian entered the tower, a cold voice was heard immediately.<br/><br/>This made him slightly stunned as he looked inside.<br/><br/>The entire first level of the moon tower was spacious enough.<br/><br/>However, at this moment, there were many young middle-aged men sitting cross-legged on the first level.<br/><br/>At the entrance, a young man was staring at him coldly. He was full of warning.<br/><br/>Wang Xian’s gaze flickered slightly as he landed on the floor.<br/><br/>The floor of the hall on the first floor of the Moon Tower was made of a square magic stone.<br/><br/>Each magic stone was the same size, but it was divided into ten different attributes.<br/><br/>On each magic stone, there was an expert sitting cross-legged.<br/><br/>That majestic energy was transmitted from beneath the magic stone.<br/><br/>When Wang Xian saw this scene, he had a slight understanding in his heart.<br/><br/>There were thousands of these magic stones on the first level of the Tower of the Moon.<br/><br/>Each person occupied a magic stone to cultivate.<br/><br/>The number of people here was already full. If he wanted to enter the tower to cultivate again, he would have to use some of his strength!<br/><br/>Furthermore, Wang Xian was a space-attributed cultivator. If he wanted to cultivate, he would have to occupy a space-attributed magic stone.<br/><br/>Sweeping his gaze across the surroundings, Wang Xian’s gaze landed on the space-attributed cultivators.<br/><br/>Sweeping his gaze across the entire hall, most of them were at least level six universe knights.<br/><br/>This was especially so for the nine-attributed powerhouses outside the space. Most of them were at level seven or eight universe knights.<br/><br/>There was a limit to entering this holy moon.<br/><br/>There was an age limit.<br/><br/>Those who could enter this place could become cultivators with good potential.<br/><br/>Those universe knights who were very old and had not broken through for a long time would not be able to enter this place.<br/><br/>Wang Xian’s gaze landed on a space attribute cultivator who was at the fifth level of the Universe Knight Realm. He instantly came to the magic stone where the young man was.<br/><br/>The young man was cultivating. When he saw Wang Xian, his eyes immediately revealed an extremely cold expression!<br/><br/>“You ‘re courting death. Are you challenging me?”<br/><br/>He stared at Wang Xian. With a wave of his arm, a sharp sword appeared in his hand.<br/><br/>“1 want this position! ”<br/><br/>Wang Xian looked at him and said calmly!<br/><br/>“Alright, Alright. ”<br/><br/>The young man stared at Wang Xian coldly. With a move of his body, he flew out.<br/><br/>“Let me see what qualifications you have to snatch my position!”<br/><br/>A voice entered Wang Xian’s ears.<br/><br/>Wang Xian scanned his surroundings and his body moved. He followed closely behind and flew out.<br/><br/>Obviously, there was an unspoken rule here. If one wanted to occupy a position, one had to go outside to spar.<br/><br/>Only the winner had the qualifications.<br/><br/>“Go to hell! ”<br/><br/>The moment Wang Xian appeared, countless sharp swords were flying towards him.<br/><br/>His methods were ruthless and didn’t give him any time to react!<br/><br/>Buzz<br/><br/>Wang Xian saw countless sharp swords flying towards him. He waved the sword in his hand in front of him!<br/><br/>Sword Shield! ”<br/><br/>He shouted in a low voice. A sword shield appeared around him and easily blocked the attacks of the sharp swords.<br/><br/>“HMPH, 10,000 swords in one! ”<br/><br/>In the sky, the young man snorted coldly. He waved his arm and a sharp sword slashed towards Wang Xian.<br/><br/>The densely packed sharp swords in the surroundings merged into the sharp sword and slashed towards Wang Xian directly!<br/><br/>Wang Xian looked over and his body flickered slightly. He disappeared directly and came to the right of the young man.<br/><br/>“Teleportation, I know it too. Man and Sword in one! ”<br/><br/>The young man’s eyes glowed. His figure appeared on the huge sharp sword in a strange manner.<br/><br/>At the same time, he teleported with the sharp sword.<br/><br/>Wang Xian sensed the energy fluctuation in the surroundings and raised his eyebrows slightly.<br/><br/>The sharp sword in his hand immediately slashed toward the position behind him.<br/><br/>The next moment, his sword radiance collided with the huge sword condensed by the young man.<br/><br/>“He actually sensed the location of my teleportation?”<br/><br/>When the young man saw that Wang Xian had already attacked the moment he appeared, his gaze froze slightly!<br/><br/>A hint of vigilance appeared on his face.<br/><br/>In a battle between spatial attribute cultivators, one’s perception was strong and would have a huge advantage.<br/><br/>This was because the other party could sense the location of your teleportation and attack that location at the instant you teleported.<br/><br/>“Alright, I won’t play with you anymore. ”<br/><br/>Wang Xian looked at the young man and said faintly.<br/><br/>He continued his teleportation and arrived at the left side of the young man.<br/><br/>Sword Cross!”<br/><br/>At the same time, he waved the sharp sword in his hand and shouted softly.<br/><br/>A gigantic cross-shaped sword was formed and attacked the young man..\t\t\t\t\t\t</div>", "images": {}, "success": true}