{"id": 961, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073822.html", "title": "Chapter 3963 - Chapter 3963: Under The 3962 Cosmic Soil", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3963 - Chapter 3963: Under The 3962 Cosmic Soil</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3963: Under the 3962 cosmic soil<br/><br/>Translator: 549690339<br/><br/>A piece of broken wood.<br/><br/>A corpse.<br/><br/>A space jar.<br/><br/>A treasure from another universe.<br/><br/>The soil of this universe.<br/><br/>“Cosmic soil? It can make wood element mages closer to the universe. What does it mean?”<br/><br/>Wang Xian listened to Long Yin Yin’s introduction of the treasures one by one and squinted his eyes slightly.<br/><br/>His mind landed on the last treasure and asked.<br/><br/>“It is to be able to sense the energy in our universe better. However, it is only more effective for wood element mages. ”<br/><br/>Long Yin Yin replied.<br/><br/>“You mean that as long as you fuse the universe breath soil into your body, you will be able to get closer to the sword and the Magic Universe?”<br/><br/>Wang Xian stared at him as his eyes sparkled.<br/><br/>“Is that what you mean?”<br/><br/>Long Yin nodded his head. “How much universe breath soil do you have?”<br/><br/>Wang Xian asked again.<br/><br/>“There should be quite a lot. The biggest characteristic of this universe breath soil is that it is special and has no other abilities.”<br/><br/>Long Yin said.<br/><br/>“What grade is the Soul Corpse?”<br/><br/>Wang Xian asked again.<br/><br/>(‘I don’t know the grade of the Soul Corpse, but I heard from my grandfather that even a corpse can give him a lot of pressure. My grandfather is an expert at level eight of the universe dominator. When he was alive, this corpse was definitely higher than the level eight of the Universe Dominator. ”<br/><br/>Long Yin Yin replied.<br/><br/>“Is there much universe breath soil on the continent?”<br/><br/>Wang Xian continued to ask.<br/><br/>“Not much. There is very little universe breath soil. As far as I know, only the strongest one or two forbidden lands on our continent have it. Only our dragon roar forbidden land has it.”<br/><br/>Long Yin answered truthfully.<br/><br/>Wang Xian narrowed his eyes slightly and looked at Long Yin Yin. “I can join the Dragon Roar Forbidden Land, but I want a lot of universe breath soil, as well as that soul corpse. Pll decide on the last treasure after I see it.” “Really? You’re willing to join our Dragon Roar Forbidden Ground?”<br/><br/>Long Yin was pleasantly surprised.<br/><br/>Wang Xian nodded. “I can join, but I have one condition. After the arrival of the calamity, I will leave the Dragon Roar Forbidden Ground. ”<br/><br/>“After the arrival of the calamity, you will leave our Dragon Roar Forbidden Ground?”<br/><br/>Long Yin was slightly stunned when he heard Wang Xian’s condition. His face was filled with astonishment.<br/><br/>He didn’t expect Wang Xian to make such a request.<br/><br/>“Yes. ”<br/><br/>Wang Xian nodded his head. “I will leave when the calamity arrives. However, I will not say that I will only occupy the resources of the dragon roar forbidden ground without contributing anything. I have all the top-notch spells and sword techniques of the Void Moon forbidden ground. I also have a magic mantle of the seventh level of the water elemental universe. I can give you the dragon roar forbidden ground as a contribution. ”<br/><br/>“Really?”<br/><br/>When Long Yin Yin heard this, her eyes lit up again.<br/><br/>She knew about the calamity.<br/><br/>It would be billions of years later for her to leave immediately after the calamity.<br/><br/>The calamity was a crisis for the Dragon Roar Forbidden Land and the entire universe.<br/><br/>The dragon roar forbidden land naturally didn’t want the experts it nurtured to leave immediately after the calamity arrived.<br/><br/>However, compared to this request, she could obtain all the spells and sword technique manuals of the forbidden land, Void Moon.<br/><br/>Compared to the magic mantle of a Level 7 universe overlord, it was nothing? In fact, a Level 7 universe Overlord’s magic mantle could even be traded for her three items!<br/><br/>The magic mantle was extremely precious and couldn’t be obtained unless it was a great opportunity.<br/><br/>Even she didn’t obtain the magic mantle.<br/><br/>In addition, the cultivation method of the Forbidden Void Moon.<br/><br/>This was even more precious!<br/><br/>The strength of the forbidden land, the Void Moon, was only slightly weaker than their dragon roar forbidden land!<br/><br/>Their secret manuals were also treasures that could hold the fort in the dragon roar forbidden land.<br/><br/>“Benefactor Wang Xian, you should know that this is a loss for you. The things that you took out are too precious! ”<br/><br/>The dragon roar was excited for a few seconds. After hesitating for a moment, it reminded Wang Xian.<br/><br/>“It’s alright. I understand the value of it.”<br/><br/>Wang Xian smiled.<br/><br/>When he joined the Dragon Roar Holy Land, it was mainly for the universe’s breathing soil.<br/><br/>The universe’s breathing soil was like what long Yin said. It could bring living beings closer to the universe.<br/><br/>It could even create humans.<br/><br/>Then, if the disciples of the Dragon Palace were to absorb enough universe’s breathing soil, what would happen?<br/><br/>Would it be able to make the strong disciples of the Dragon Palace ignore the rejection of the sword and the magical universe?<br/><br/>If it was really possible, it would definitely be a great benefit to the Dragon Palace.<br/><br/>Wang Xian could make the strong disciples of the Dragon Palace come here to cultivate and look for opportunities.<br/><br/>Not to mention other things, he could at least make some of the strong disciples of the Dragon Palace come to the Tower of moon to cultivate.<br/><br/>Wang Xian was confident that he could control the Tower of Moon.<br/><br/>By then, the Dragon Palace would have an additional precious place for training.<br/><br/>In addition, by joining the Dragon Roar Forbidden Land, Wang Xian could quickly integrate into the top level of the sword and magic universe and understand everything in this universe.<br/><br/>Although he had the ability to absorb souls, with his current strength, he could only be a level eight master of the soul-absorbing universe.<br/><br/>After all, most of his current strength depended on the fragments of the Heaven’s origin destiny.<br/><br/>Anyway, joining the dragon roar forbidden ground would not interfere with his cultivation.<br/><br/>“That’s great. I’ll tell Grandpa and the rest now that you ‘ve joined the Dragon Roar Forbidden Ground. In the future, I’ll let you be the Holy Son and let my brother play around. Also, we’ll provide you with any cultivation resources you want. ”<br/><br/>Long yinyin said happily.<br/><br/>Wang Xian smiled and looked at her. He waved his hand casually and said, “You should go back first. Bring those special treasures over first. Also, this is a water element magic mantle. I’ll give it to you first. ”<br/><br/>“Why don’t you go back with me? There are elders from our dragon roar forbidden ground outside the Moon Tower. Also, we can go back to our dragon roar forbidden ground and get those treasures directly. I’ll Ask My Grandpa to give you more treasures then!”<br/><br/>Long Yinyin’s eyes were sparkling as he said to Wang Xian.<br/><br/>“Shall we go over? Sure!”<br/><br/>Wang Xian nodded and didn’t refuse!<br/><br/>His current strength had already reached the peak of the Universe Knight<br/><br/>Realm.<br/><br/>What he needed to do now was to accumulate his strength.<br/><br/>Just like Wu Sha and the rest back then, he would only accumulate his strength and not improve.<br/><br/>By then, he should be able to step into the top level of the Moon Tower and take control of it!<br/><br/>However, if he wanted to continue to reach the level of Wu Sha and the rest, he would need a large amount of time to accumulate.<br/><br/>It would take about one to two million years.<br/><br/>Therefore, Wang Xian was not in a hurry to spend a day, two days, or even a year and ten years!<br/><br/>“Hehe, Alright, let’s Go! ”<br/><br/>Long Yin said happily and gestured to Wang Xian.<br/><br/>The two of them moved and disappeared from the eighth level in an instant.<br/><br/>The next moment, they appeared outside the Moon Tower.<br/><br/>“Follow me! ”<br/><br/>Long Yin Yin said happily and flew out with Wang Xian.<br/><br/>Wang Xian smiled and followed closely behind. The two of them flew out of the Holy Moon.<br/><br/>Buzz<br/><br/>“Lady Saintess! ”<br/><br/>The moment they flew out, the powerhouses from the dragon roar forbidden land were already waiting at the entrance!\t\t\t\t\t\t</div>", "images": {}, "success": true}