{"id": 966, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073832.html", "title": "Chapter 3968 - Chapter 3968: At The 3967 Holy Son Ceremony", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3968 - Chapter 3968: At The 3967 Holy Son Ceremony</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3968: At the 3967 holy son ceremony<br/><br/>Translator: 549690339<br/><br/>“Break through. ”<br/><br/>When Wang Xian heard her words, he naturally knew what she was thinking.<br/><br/>Here, everything was for the sake of reaching the top.<br/><br/>This didn’t mean that the stronger a person was, the higher they would be able to reach the top.<br/><br/>Instead, it meant that the stronger one’s ability to fight above their level was, the higher one would be able to reach the top.<br/><br/>As for Long Yin Yin suppressing her own strength, it was completely<br/><br/>unnecessary.<br/><br/>Because, to reach the top, one had to have the power of a Pinnacle Universe Knight and have a long-term accumulation at the Pinnacle Universe Knight level.<br/><br/>Only then would one have a chance to reach the top.<br/><br/>Secondly, this place belonged to him.<br/><br/>It belonged to the Dragon Palace.<br/><br/>He had already regarded this place as his own!<br/><br/>Long Yin Yin looked at him in surprise!<br/><br/>“If you want to reach the top level, you have to go through a huge amount of accumulation. It’s impossible for you to reach the top with the accumulation of a small realm. Only when you reach the peak of a universe knight can you achieve this. Therefore, it’s impossible for you to reach the top without breaking through! ” Wang Xian explained to her.<br/><br/>“IS that SO?”<br/><br/>Long Yin nodded her head thoughtfully.<br/><br/>“What do you think?”<br/><br/>Wang Xian looked at her and smiled. “You should be able to sense where your limit is. ”<br/><br/>“That’s true. It took me a lot of effort to reach the eighth level. If I want to reach the twelfth level, it will be even more difficult. It’s simply impossible.” Long Yin mumbled.<br/><br/>“In that case, do you mean that I have to advance to the peak of the Universe Knight Realm First?”<br/><br/>She looked at Wang Xian.<br/><br/>“Yes, there’s no need to suppress it now. ”<br/><br/>Wang Xian nodded. “There’s plenty of energy here. It will only take one to two million years for the energy to reach the peak of the eighth level of the Universe Knight Realm. When that time comes, I will raise my combat strength to another level. ”<br/><br/>“Yes, yes! ”<br/><br/>Long Yin nodded and listened to Wang Xian. He looked at him and asked,<br/><br/>“Wang Xian, have you reached the peak of the Universe Knight Realm Now?” “Yes, although I have reached it, I still need a long time to reach the next level and reach the top.”<br/><br/>Wang Xian nodded without hiding anything.<br/><br/>“Doesn’t that mean you have a chance to reach the twelfth level and control this place?”<br/><br/>Long yinyin looked at him with a hint of admiration. “It’s possible, but the possibility is not very high! ”<br/><br/>Wang Xian said with a smile, but he didn’t tell the truth!<br/><br/>“You will definitely succeed. You will definitely reach the top. Good luck! ”<br/><br/>Long yinyin smiled and clenched his fists at him. Wang Xian smiled. “Continue your cultivation! ”<br/><br/>“Yes, yes!”<br/><br/>Long yinyin nodded and immediately began his breakthrough!<br/><br/>Wang Xian sat cross-legged and began his cultivation.<br/><br/>“Wang Xian, it’s time for the appointed time. It’s time for the ceremony to confer the title of Saint to You! ”<br/><br/>Thousands of years passed in the blink of an eye. Long yinyin shouted at Wang Xian.<br/><br/>“HMM? Are we There Yet?”<br/><br/>Wang Xian opened his eyes and nodded. “Alright then, let’s Go! ”<br/><br/>“Hehe, the ceremony to confer the title of Saint to You is a very important matter in our dragon roar forbidden land. When the time comes, the lord of the forbidden land will confer the title of Saint to you personally. We will hold a banquet for ten days to celebrate the entire forbidden land! ”<br/><br/>The two of them moved and flew out. “Is it that Grand?”<br/><br/>Wang Xian looked at her in surprise.<br/><br/>Long Yin explained to her, “Therefore, every holy son and<br/><br/>Saintesses’conferment ceremony is very grand. Of course, our dragon roar forbidden land has a generation of one billion years. In other words, a new holy son and Saintesses’conferment ceremony is only held once every one billion years. ”<br/><br/>Wang Xian nodded slightly.<br/><br/>The two of them flew out of the Holy Moon. At the entrance, the powerhouses of the dragon roar forbidden land were already waiting.<br/><br/>The experts who were waiting this time were the two elders from the Dragon Roar Forbidden Ground!<br/><br/>One of them was the sixth elder whom Wang Xian had met before!<br/><br/>“Hehe, Xiao Xian, since the last time you came to our dragon roar forbidden ground, we have already gotten some information from the surrounding forbidden grounds. As the son of the spatial swordsman who could easily reach the eighth level of the Moon Tower, we are worried that other forbidden grounds would do something to you! ”<br/><br/>The sixth elder smiled at Wang Xian and said.<br/><br/>“Sixth Elder and tenth elder, please come over personally!”<br/><br/>Wang Xian heard it and smiled. He immediately sensed it!<br/><br/>“Haha, this is what I should do. You Don’t know how envious Pve been ever since the other forbidden grounds found out that you joined our dragon Roar Forbidden Ground! ”<br/><br/>The sixth elder laughed out loud. With a wave of his arm, he brought them away immediately!<br/><br/>The current Wang Xian had already made a name for himself in the surrounding area, the sacred grounds, and the Sacred Academy.<br/><br/>Everyone knew that there was a mysterious swordsman with the space attribute in the moon tower who had easily ascended to the eighth level of the Moon Tower.<br/><br/>He suppressed all the holy sons and saintesses.<br/><br/>His talent was extremely terrifying.<br/><br/>Most importantly, he had the space attribute.<br/><br/>In the sword and Magic Universe, there was also a saying, the top ten attributes, space was King!<br/><br/>Among the top existences of the space attribute, they were able to fight against experts of other attributes.<br/><br/>With such talent and strength, coupled with the space attribute, Wang Xian’s reputation was very well-known among the Holy Land’s forbidden grounds.<br/><br/>After he joined the dragon roar forbidden ground, it caused quite a stir!<br/><br/>Under the lead of the two elders, Wang Xian and the rest arrived at the Dragon Roar Forbidden Ground!<br/><br/>Splash! Splash<br/><br/>When they arrived at the island of the Dragon Roar Forbidden Ground, the sound of an incomparably huge waterfall could be heard.<br/><br/>However, at this moment, in the middle of the waterfall that descended from the sky, there were four big words, “Flowing water”. It was exceptionally eye-catching and could be clearly seen from afar.<br/><br/>The Holy Son’s ceremony!<br/><br/>In the main island of the Dragon Roar Forbidden Ground, it looked more festive compared to the last time they came!<br/><br/>There were hundreds of times more people below the sky peak compared to the last time!<br/><br/>With a glance, there were at least hundreds of millions of people gathered there.<br/><br/>There were also a large number of strong disciples floating in the air.<br/><br/>There were also sounds of battles.<br/><br/>“It’s really lively! ”<br/><br/>Wang Xian looked over and sighed slightly.<br/><br/>Compared to this place, the Dragon Palace was much quieter. There were only a few million disciples of the Dragon Palace!<br/><br/>“There are a few hundred magical kingdoms under the Dragon Roar Forbidden Ground. Some of these magical kingdoms were founded by strong disciples who came from the Dragon Roar Forbidden Ground. Some of them are under our protection. ”<br/><br/>“Wang Xian, since you have become the holy son, they must come to pay their respects. They must also send some gifts.”<br/><br/>Long Yin smiled and introduced to Wang Xian, “In the future, you will have supreme authority in any magical kingdom under the Dragon Roar Forbidden<br/><br/>Ground! ”<br/><br/>Wang Xian nodded his head slightly. A hint of envy flashed in his eyes.<br/><br/>The Dragon Palace was very strong. However, the Dragon Palace could not even return to the nine-origin universe.<br/><br/>However, one day, Wang Xian would make the Dragon Palace stand upright in the universe and be worshipped by all races!\t\t\t\t\t\t</div>", "images": {}, "success": true}