{"id": 967, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073834.html", "title": "Chapter 3969 - Chapter 3969: Under The Ceremony Of The 3968 Holy Son", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3969 - Chapter 3969: Under The Ceremony Of The 3968 Holy Son</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3969: Under the ceremony of the 3968 holy son<br/><br/>Translator: 549690339<br/><br/>“Whoosh! Whoosh! Whoosh! ”<br/><br/>Wang Xian and long yinyin flew towards the Sky Peak!<br/><br/>The two elders looked on with a smile.<br/><br/>In front of the Sky Peak, a large number of strong disciples were gathered.<br/><br/>At the edge of the sky peak, there was an empty space.<br/><br/>In front of them, there were luxurious chairs.<br/><br/>On the left and right sides, there were flags.<br/><br/>The words “Saint”were written on them!<br/><br/>Sister… brother Wang Xian! ”<br/><br/>When Wang Xian and long yinyin flew over, a voice was heard.<br/><br/>Long Yinhao quickly came over to welcome them.<br/><br/>Behind him, there were over a hundred disciples from the Dragon Roar Forbidden Ground.<br/><br/>Their gazes were all on Wang Xian.<br/><br/>This was the first time they saw Wang Xian.<br/><br/>However, they had heard of Wang Xian’s great name like thunder.<br/><br/>He was an existence that could suppress more than ten holy sons from the forbidden grounds of the Holy Land. He was even more powerful than their holy sons and holy daughters.<br/><br/>His strength and talent were beyond doubt!<br/><br/>Okay!<br/><br/>Wang Xian saw long Yinhao and nodded his head.<br/><br/>“Greetings, Lord Wang Xian!”<br/><br/>At the back, a group of disciples flew over. They immediately cupped their hands and bowed to Wang Xian!<br/><br/>“You ‘re welcome! ”<br/><br/>Wang Xian waved at them and nodded with a smile!<br/><br/>“Brother Wang Xian, come, let me introduce you! ”<br/><br/>Long Yin started to introduce the surrounding disciples to Wang Xian enthusiastically.<br/><br/>Those who were able to follow him were the elites among the current generation of disciples in the Dragon Roar Forbidden Ground. The future pillar of the dragon roar forbidden ground.<br/><br/>Wang Xian got to know them one by one.<br/><br/>Buzz Buzz Buzz<br/><br/>Not long after, rays of light lit up one after another. They were located in the Sky Peak. One by one, figures with powerful auras flew over.<br/><br/>One by one, the figures landed on the seats in front of them with a smile on their faces!<br/><br/>These figures were all at least at level five of the universe Dominators. “Haha, come here, Xiao Xian. Let me introduce you to the elders and deacons!”<br/><br/>The third elder flew over and said to Wang Xian with a loud laugh.<br/><br/>“Alright, Third Elder! ”<br/><br/>Wang Xian nodded. He looked at the elders and deacons and cupped his hands.<br/><br/>“Greetings, elders and deacons!”<br/><br/>Wang Xian cupped his hands.<br/><br/>(‘I dare not, I dare not. Wang Xian, your talent is outstanding. You will definitely become one of the strongest people in the continent in the future!” The deacons immediately returned the greeting and said with a smile.<br/><br/>The status of deacons in the forbidden land was inferior to that of holy sons and saintesses!<br/><br/>“Hehe, come here, Xiao Xian. Let me introduce our great elder to you.” The third elder started to introduce him to Wang Xian.<br/><br/>The Great Elder of the Dragon Roar Forbidden Land was an old woman with white hair and a walking stick.<br/><br/>“Hehe, the child is not bad. It is our honor to be able to join our dragon roar forbidden land and bring so many treasures. As the Great Elder, I can’t be stingy. Take it! ”<br/><br/>The great elder waved his arm and a human-shaped water droplet floated in front of Wang Xian.<br/><br/>“ThiS…<br/><br/>He was stunned. Such a treasure was more precious in the sword and Magic Universe. It was comparable to an innate treasure.<br/><br/>“Even if you have such a treasure, take it! ”<br/><br/>The first elder smiled and said to Wang Xian! “Thank you, First Elder! ”<br/><br/>Wang Xian did not bother to be polite and took it.<br/><br/>“Hehe, since the first elder has given it to me, I, the second elder, can not fall behind. Although it is not as precious as the first elder, it is not weak either.<br/><br/>The Void Sword is 90 and its power is almost comparable to an innate treasure. The space attribute is just right for you to use!”<br/><br/>The second elder waved his arm, and numerous sharp swords floated around Wang Xian.<br/><br/>Void Sword 90 was 90 spatial attribute sharp swords, and each of them was at the level of an innate supreme treasure.<br/><br/>However, this was a set, and its power was comparable to an ordinary innate supreme treasure.<br/><br/>“Thank you, Second Elder! ”<br/><br/>Wang Xian’s eyes shone when he saw the sharp swords.<br/><br/>Currently, Wang Xian’s strength had already reached the peak of a universe knight.<br/><br/>The Tianyuan sword technique that he was practicing had also reached the most crucial point!<br/><br/>That was sword control!<br/><br/>The most terrifying and core point of the Tianyuan sword technique was the sword tomb!<br/><br/>The sword tombs were built one after another, and they instantly erupted with terrifying power.<br/><br/>This sword tomb required Wang Xian to build with energy.<br/><br/>In the past, he needed to teleport or fly to another place before laying down the sword tomb!<br/><br/>But now, he only needed to control the sharp sword to set up a sword tomb in the surroundings with the help of the sharp sword, forming a terrifying attack power!<br/><br/>Compared to the past, it was even more terrifying!<br/><br/>Originally, he needed to reach the level of a universe master before he could cultivate.<br/><br/>But because of Wang Xian’s uniqueness, a peak universe knight could already do it!<br/><br/>These ninety spatial attribute sharp swords of the innate numinous treasure level were extremely useful to him!<br/><br/>“Haha, Xiao Xian, you guys are the future pillars of our Dragon Roar Forbidden Ground. Come and take over! ”<br/><br/>Following that, the third elder took out his treasures as well.<br/><br/>Every elder gave Wang Xian some treasures and cultivation resources!<br/><br/>Following that, the Deacons also started to give them to Wang Xian.<br/><br/>This was also the tradition of the Dragon Roar Forbidden Ground!<br/><br/>This was also the reason why the holy sons and saintesses were so powerful.<br/><br/>Of course, if one wanted to become a holy son and saintesses, it wasn’t because of their background. It wasn’t because my grandfather was an elder that I could become a holy son and saintesses.<br/><br/>It was because of my true talent and talent.<br/><br/>This was a test that every forbidden ground had their own set of methods to test!<br/><br/>Some universe knights who were at level six or seven could become holy sons.<br/><br/>Some universe knights at level nine couldn’t become holy sons!<br/><br/>Weng<br/><br/>Not long after the elders and deacons finished delivering all the treasures.<br/><br/>A blue light covered the entire sky!<br/><br/>An old figure suddenly appeared in the sky!<br/><br/>When everyone saw this figure, their faces were filled with respect and respect!<br/><br/>The elders and deacons immediately stood up and faced the figure.<br/><br/>“Greetings to the Lord of the Forbidden Land! ”<br/><br/>“Greetings to the Lord of the Forbidden Land! ”<br/><br/>In the surrounding area, more than a hundred million strong disciples of the forbidden land hurriedly bowed and shouted loudly.<br/><br/>Their voices reverberated throughout the entire island!<br/><br/>“There’s no need to be cautious during the holy son’s ceremony! ”<br/><br/>The Lord of the Dragon Roar Forbidden Land said faintly. His voice reached everyone’s ears.<br/><br/>Wang Xian looked at the Master of the Roaring Dragon Forbidden Land with a hint of curiosity in his eyes.<br/><br/>The Master of the Roaring Dragon Forbidden Land was an old woman.<br/><br/>Yes, it was a woman!<br/><br/>This was something that he had never expected!<br/><br/>“Wang Xian, right? Hehe, not bad! ”<br/><br/>At this moment, Wang Xian sensed that the master of the Roaring Dragon Forbidden Land was looking at him. He nodded with a smile and his eyes were filled with admiration!<br/><br/>“Thank you for your praise, master of the Forbidden Ground! ”<br/><br/>Wang Xian cupped his hands and thanked him!<br/><br/>Space attribute. It’s my honor to be able to fight against someone of a higher level. Please take a seat! ”<br/><br/>The Master of the Dragon Roar Forbidden Ground was still smiling as he spoke. He looked at the group of elders and deacons and said softly.<br/><br/>“It’s the Master of the Forbidden Ground!”<br/><br/>The group of elders and deacons immediately sat at the front!\t\t\t\t\t\t</div>", "images": {}, "success": true}