{"id": 963, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073826.html", "title": "Chapter 3965 - Chapter 3965: The Identity Of The 3964 Holy Son", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3965 - Chapter 3965: The Identity Of The 3964 Holy Son</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3965: The identity of the 3964 holy son<br/><br/>Translator: 549690339<br/><br/>“Xiao Xian, with your strength, you can have the status and strength of a holy son in our dragon roar forbidden land. After a period of time, we will prepare a holy son inauguration ceremony for you! ”<br/><br/>Wang Xian was checking the treasures in the interspatial ring. In front of him, Long Yinyin’s grandfather, who was also the third elder of the Dragon Roar Forbidden Land, continued with a smile on his face.<br/><br/>“There’s no need. Long Yinhao will be the saint. ”<br/><br/>Wang Xian was slightly stunned and shook his head with a smile.<br/><br/>“Hehe, in the dragon roar forbidden ground, whoever has the better talent and strength will be the saint. Your talent and strength far exceed Yinhao’s. You deserve the position of saint. As a saint, you will naturally have a lot of rights and enjoy a lot of things.”<br/><br/>The third elder said to him, “In the dragon roar forbidden ground, the position of the saint child is above the deacons and below the elders. ”<br/><br/>When Wang Xian heard the third elder’s words, a thoughtful look appeared on his face.<br/><br/>“Ahem, Grandpa, I think that our dragon roar forbidden ground can have two saint children, right? Hehe, Big Brother Wang Xian is the boss. I can also be second. ”<br/><br/>At the side, Long Yinhao coughed and said!<br/><br/>“That’s not impossible. It’s not like there’s only one holy son in the forbidden ground. ”<br/><br/>An elder smiled and said, “There are only two holy sons and holy daughters in the Twin Holy Grounds. Although it has something to do with the characteristics of their holy grounds, Yinhao’s strength is worthy of being a holy son! ”<br/><br/>“That’s fine too. However, we have to inform the lord of the forbidden land about this matter. ”<br/><br/>The third elder nodded and looked at Wang Xian. “Xiao Xian, you don’t have to refuse. ”<br/><br/>“Alright! ”<br/><br/>Wang Xian hesitated for a moment before nodding his head.<br/><br/>Since this was the body of the Void Dragon God, he could be the holy son of the Dragon Roar Holy Land!<br/><br/>“Hehe, alright. After a period of time, we will hold a holy son ceremony! ”<br/><br/>The third elder nodded with a smile. “Also, I’ll have to trouble you to bring Xiao Xian to our dragon roar forbidden ground to take a look first. It’s a treasure land and a good place for the holy son to stay. ”<br/><br/>“Alright, third brother.”<br/><br/>The sixth elder nodded. He stood up and gestured to Wang Xian. “Let’s go, Xiao Xian. I’ll bring you around our dragon roar forbidden ground first. When we come back, we’ll have something to eat and enjoy some delicacies. ” Wang Xian nodded with a smile. He followed sixth elder to familiarize himself with the situation in the Dragon Roar Forbidden Ground!<br/><br/>Sister, tell me the truth. Are you having an affair with brother Wang Xian? He’ll be my brother-in-law in the future?”<br/><br/>Wang Xian and the rest left.<br/><br/>At the side, Long Yinhao couldn’t help but look at long yinyin and asked.<br/><br/>“What nonsense are you talking about?”<br/><br/>His words made long Yinyin’s face turn red. She glared at him.<br/><br/>“If it wasn’t for the fact that you guys got together, how could there be such a good thing? To give you a water element magic mantle at the seventh level of the universe dominator, how could it be water element? “There are also the secret manuals in the Forbidden Land of the Void Moon. The value of these things is not comparable to the position of a holy son. Some special items can not be compared to them.”<br/><br/>“Furthermore, he has saved you twice. I feel that brother Wang Xian is definitely interested in you. I think he is not bad. Sister, you can consider it! ”<br/><br/>“No, maybe you have already been with that Wang Xian… cough cough. After all, you guys have been alone for a long time on the seventh level!”<br/><br/>Long Yinhao guessed as if he had already understood the truth.<br/><br/>This made long Yinyin’s face turn darker and darker. She stared at him while the magic staff in her hand shimmered.<br/><br/>“Hehe, Alright yinyin. We will not be involved in your matters. You can make your own choice. ”<br/><br/>Long Yin Yin’s mother said with a smile from the side.<br/><br/>“Mom, there’s really nothing going on between Wang Xian and me. When I first invited him, he rejected me.”<br/><br/>Long Yin Yin explained to her mother.<br/><br/>“Alright, no matter what the situation is, we won’t interfere with your matters. Have you given the secret manuals of the Forbidden Void Moon to you?”<br/><br/>Long Yin Yin’s mother smiled and asked.<br/><br/>(‘I have.”<br/><br/>Long Yin nodded and waved her arm, sending the secret manuals to her grandfather.<br/><br/>A few elders of the dragon roar forbidden land waved their arms and took a few of the secret manuals that were obviously more powerful.<br/><br/>They immediately opened the contents.<br/><br/>“It really is the secret manuals of the Void Moon. It’s a complete secret manual. These secret manuals are of great benefit to our dragon Roar Forbidden Land! ”<br/><br/>An elder looked at the contents and said excitedly!<br/><br/>“Indeed, they are all true. The top-tier cultivation secret manuals of the forbidden land, the Void Moon, should be these. These secret manuals of spells, sword techniques, and secret manuals are incomparably precious. If there was another treasure land, it would be able to create a powerful forbidden ground!”<br/><br/>The third elder looked at them and was also a little excited!<br/><br/>The value of these things was immeasurable to their forbidden land!<br/><br/>He even thought that the special treasures that he gave to Wang Xian would be considered pretty good if he could exchange for one of these top-notch manuals!<br/><br/>“According to the records of the moon of the void in the forbidden land, all their manuals are placed in the Ten Thousand Arts Pavilion behind the Moon Tower. It seems that he has entered the Ten Thousand Arts Pavilion. Didn’t they say that the Ten Thousand Arts Pavilion is enveloped by a powerful formation and there is no way for him to enter?”<br/><br/>An elder asked in surprise.<br/><br/>“That Wang Xian is not simple. He should have some secrets on him. He appeared out of nowhere and there is no information about him. ”<br/><br/>A deacon opened his mouth and pondered for a moment. “Elder, should we be on guard?”<br/><br/>“No need. No force is willing to take out such precious treasures just to infiltrate the Dragon Roar Forbidden Land. ”<br/><br/>The third elder shook his head immediately.<br/><br/>The treasures that Wang Xian took out were too precious. In order to infiltrate the Dragon Roar Forbidden Ground, he had to expend so much energy. No holy ground had such a huge expenditure.<br/><br/>If they had such a huge expenditure, it would be very easy for them to destroy the Dragon Roar Forbidden Ground!<br/><br/>“That’s true. They might really like it…”<br/><br/>An elder beside him nodded in agreement. He looked at long yinyin leisurely and revealed a smile that belonged to an old mischievous child.<br/><br/>This made long yinyin’s face turn even redder. Her face was filled with helplessness!<br/><br/>However, when she thought about how Wang Xian had saved her twice, her heart started to beat faster!<br/><br/>She was the Saintess of the Dragon Roar Forbidden Ground. Her younger brother was also the Saintess of the Dragon Roar Forbidden Ground.<br/><br/>In the entire Roaring Dragon Forbidden Ground, there was no one who was more outstanding than the siblings.<br/><br/>This made her feel nothing special about the other members of the opposite sex.<br/><br/>This was because she was outstanding, and her younger brother was also very outstanding.<br/><br/>Moreover, even if he was the Saintess of the other forbidden grounds, she wouldn’t be able to take a fancy to him easily.<br/><br/>And Wang Xian had saved her life twice.<br/><br/>His talent and strength that was even stronger than hers had indeed given her a peculiar feeling!<br/><br/>“Wang Xian… could it be that he really took a liking to himself just like what Grandpa and Little Brother Said? Otherwise…”<br/><br/>Her heart was in a mess as her thoughts ran wild!\t\t\t\t\t\t</div>", "images": {}, "success": true}