{"id": 960, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073820.html", "title": "Chapter 3962 - Chapter 3962: 3961 On The Cosmic Soil", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3962 - Chapter 3962: 3961 On The Cosmic Soil</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3962: 3961 on the cosmic soil<br/><br/>Translator: 549690339<br/><br/>“Oh? Is it that powerful?”<br/><br/>When Wang Xian heard that, his eyes lit up.<br/><br/>If such a forbidden spell really existed, it would be of great use to the Dragon Palace.<br/><br/>This was especially so for the charming dragon seed of the Dragon Palace.<br/><br/>Now, everyone of the charming dragon seed possessed a black resurrection lily.<br/><br/>The black resurrection Lily had an ability, which was the reincarnation of the other shore.<br/><br/>After casting the forbidden spell, one could cast the resurrection of the other shore, allowing one’s body to go back to the past.<br/><br/>In other words, the resurrection of the other shore could eliminate the injuries suffered during the period of the forbidden spell.<br/><br/>This could allow the charming dragon species to receive a huge upgrade.<br/><br/>“Of course. However, this forbidden spell can not be used wantonly. After one use, it can only be used again after hundreds of thousands of years.”<br/><br/>Long Yin Yin said.<br/><br/>Wang Xian nodded his head and didn’t mind it.<br/><br/>With the reincarnation of the other shore, this sequela could be eliminated instantly.<br/><br/>“I’ll ask the seniors of the Dragon Cry Forbidden Ground again to see what treasures they can give you. ”<br/><br/>Long Yin Yin saw that Wang Xian didn’t refuse and was even a little interested, so he immediately said.<br/><br/>Wang Xian smiled and nodded his head. He sat cross-legged beside the cultivator.<br/><br/>At the same time, Long Yinyin immediately contacted his parents and grandfather.<br/><br/>The reason why long Yinyin and her younger brother could become the holy sons and Saintesses of the dragon roar forbidden land was firstly because they were extremely talented.<br/><br/>Secondly, their great-grandfather was the founder of the Dragon Roar Forbidden Land.<br/><br/>Currently, his great-grandfather was no longer the leader of the forbidden land. However, the person who took over the position was also one of his great-grandfather’s disciples.<br/><br/>In the Dragon Roar Forbidden Land, his great-grandfather was still the<br/><br/>number one expert.<br/><br/>One could imagine the position of the Long family in the dragon roar forbidden land.<br/><br/>And her father was also her grandfather. He was also in the ruler realm now and was the top expert in the forbidden land.<br/><br/>After Long Yin Yin passed on the news, it immediately attracted the attention of the dragon roar forbidden land.<br/><br/>Now, the news of Wang Xian had already spread to all the forbidden lands around the Void Moon!<br/><br/>All the forbidden grounds were shocked by the sudden appearance of this devilish young man.<br/><br/>There were also some forbidden grounds that were prepared to recruit Wang Xian.<br/><br/>Especially since Wang Xian was the one they thought had the best chance of ascending to the top of the Tower of the Moon and taking control of the Holy Moon.<br/><br/>Now that they saw that their Saintess had been saved twice by that mysterious young man and that they had a good relationship with him, they invited him to join the forbidden grounds. Naturally, the dragon roar forbidden grounds couldn’t be stingy!<br/><br/>Soon, Long yinyin received a list of treasures. When she saw it, her eyes flickered slightly.<br/><br/>“Um, What’s your name? Our Dragon Roar Forbidden Ground has taken out some treasures. You can choose three of them. What do you think?”<br/><br/>Long Yinyin looked at Wang Xian and greeted him.<br/><br/>“Just Call Me Wang Xian. Let me take a look at the items. ”<br/><br/>Wang Xian nodded and said with interest.<br/><br/>If there were really items that could satisfy him, Wang Xian could really consider joining.<br/><br/>However, even if he joined, Wang Xian would still make his own request.<br/><br/>“Here, Pll use energy to condense it into words for you. Let me introduce it to you!<br/><br/>Long yinyin waved his arm and the names of the items appeared in front of Wang Xian.<br/><br/>There were a total of more than 20 items. Furthermore, all of them were space-type or useful treasures.<br/><br/>“The first item is the celestial fruit. This fruit is a life-saving fruit. It’s equivalent to a life. As long as you place the celestial fruit in a safe place, you can be revived immediately even if you die. How about it? Is this valuable enough?”<br/><br/>Long Yin Yin introduced the first item and looked at him with a smile.<br/><br/>“Continue! ”<br/><br/>Wang Xian nodded. He wasn’t interested in the Deva fruit.<br/><br/>“The second item is a spatial-attributed innate treasure-grade weapon. ”<br/><br/>Long Yin Yin continued to introduce.<br/><br/>“Remove the weapon. I don’t need any elixirs either. Do you have any special items? I need something special. ”<br/><br/>Wang Xian interrupted her and asked.<br/><br/>“This? Special? My grandfather prepared everything for you that you can use. If this is special, there’s nothing special about it. Does training in the core of the Dragon Roar Forbidden Ground Count?”<br/><br/>Long Yin opened her mouth and asked.<br/><br/>Wang Xian shook his head. “I don’t need any weapons or resources for training. I will only agree if there are special items that I need. ”<br/><br/>“Alright then, I’ll continue to ask. ”<br/><br/>Long yinyin nodded and continued to send messages to her grandfather. (‘ERM, do you have any items that you need? We will try our best to satisfy you. ”<br/><br/>Long Yinyin raised her head and asked Wang Xian.<br/><br/>“Items that I need? What is the realm of the strongest person in the Dragon Roar Forbidden Ground?”<br/><br/>Wang Xian asked.<br/><br/>“The strongest person is naturally my great-grandfather, the founder of the Dragon Roar Forbidden Ground. He reached the level nine of the universe’s ruler ten billion years ago. I don’t know if he has made a breakthrough yet. ” Long Yin replied with some pride.<br/><br/>“Forget it then. Just bring out the special treasures from your place and I will take a look. ”<br/><br/>Wang Xian shook his head.<br/><br/>The strength of a level nine universe dominator was not even comparable to his.<br/><br/>If the Dragon Roar Holy Land was really stronger and had many experts at the peak of the Dominator realm, Wang Xian could ask for a large amount of resources.<br/><br/>He could use these resources to increase the strength of his main body.<br/><br/>However, he was only at the level nine universe Dominator realm. This dragon Roar Holy Land could not afford to give him so many resources.<br/><br/>Long Yin pouted speechlessly and looked at him. “Alright, I’ll see if my grandfather has any special treasures. ”<br/><br/>After she finished speaking, she waited quietly for her grandfather’s reply. “Benefactor Wang Xian, my grandfather sent me five special items. Let me tell you about them. ”<br/><br/>A few hours later, long yin spoke to Wang Xian.<br/><br/>Speak! ”<br/><br/>Wang Xian opened his eyes and spoke to her.<br/><br/>“The first item is broken wood. Legend has it that broken wood is a small fragment on the space bridge. The Space Bridge is a very powerful space treasure that can not be compared to ordinary innate treasures. In short, it is very, very powerful. However, it is useless now! ”<br/><br/>Long Yin introduced the first item and looked at Wang Xian secretly. “The second item is a corpse. It is a strange soul corpse. My grandfather said that it is the body of an inhuman from another universe.”<br/><br/>“The third item is a jar. It has a huge space and is almost infinite. However, it can’t contain living things. ”<br/><br/>“The fourth item is a treasure from another universe. It’s a very special treasure. The specific abilities are unknown. ”<br/><br/>“The fifth item my grandfather said is the universe’s breathing soil. This breathing soil can be molded into a human and give life to it. In other words, it can create a human. I think this item is very practical and can nurture my subordinates. The person molded from the breathing soil can be molded just like a normal human being. Their talents are also different. There’s another characteristic. The breathing soil is very beneficial to wood element cultivators. It can be integrated into the body and bring one closer to our sword and Magic Continent. ”<br/><br/>Dragon Yin Yin Yin introduced one by one..\t\t\t\t\t\t</div>", "images": {}, "success": true}