{"id": 965, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073830.html", "title": "Chapter 3967 - Chapter 3967: 3966 Disciples Of The Dragon Palace Descended", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3967 - Chapter 3967: 3966 Disciples Of The Dragon Palace Descended</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3967: 3966 disciples of the Dragon Palace descended<br/><br/>Translator: 549690339<br/><br/>“Buzz Buzz!”<br/><br/>Inside the Ten Thousand Arts Pavilion in the Forbidden Land, the Void Moon Holy Moon.<br/><br/>Wang Xian, an lie, and Ao Jian appeared.<br/><br/>This was Wang Xian’s true form. His void dragon body was still cultivating in the eighth level of the Moon Tower.<br/><br/>Ao Jian’s arrival immediately caused a surge of energy to press down on his body, causing his expression to change slightly.<br/><br/>This was the Suppressive Force from the sword and the magical universe.<br/><br/>Ao Jian’s current strength had already reached the third level of the Universe Overlord.<br/><br/>His realm was not very high, mainly because the dragon guards had just obtained the Tianyuan sword technique not long ago.<br/><br/>To be able to reach the third level of the Universe Overlord in a few million years was already very terrifying!<br/><br/>Of course, this was also due to the heart of faith.<br/><br/>“Dragon King, my level has been suppressed by three levels! ”<br/><br/>Ao Jian reported to Wang Xian.<br/><br/>Okay!<br/><br/>Wang Xian nodded. With a move of his arm, a handful of breathing soil appeared in his hand.<br/><br/>“Ao Jian, absorb it and see if there are any changes.”<br/><br/>Wang Xian spoke to Ao jian.<br/><br/>Ao jian nodded and immediately took it. With a thought, he began to absorb it.<br/><br/>Little by little, the breath soil entered his body, causing him to be slightly stunned.<br/><br/>“Eh? Dragon King, I can sense that the rejection of me from this universe has decreased by a lot! ”<br/><br/>Soon, ao Jian’s eyes lit up as he reported to Wang Xian.<br/><br/>Wang Xian’s eyes were glowing as well. “This breath soil is in your body. Are there any side effects? Can you expel it in the future?”<br/><br/>“There are no side effects at the moment. The breath soil is in my body and has no effect on my body. I can expel it as well. However, the speed is very fast. Furthermore, the breath soil that is expelled will dissipate immediately. ”<br/><br/>Ao jian sensed it and said.<br/><br/>“Alright, that’s enough.”<br/><br/>Wang Xian smiled. He moved his arm and took out more breath soil. “Absorb it until the universe is suppressing and absorbing you. Then, stop. ”<br/><br/>“It’s the Dragon King! ”<br/><br/>Ao jian immediately responded and began to absorb a large amount of it!<br/><br/>Wang Xian waited quietly by the side. Then, he looked at the breathing soil in his interspatial ring.<br/><br/>There were many of them. There were dozens of tons of them.<br/><br/>Other than the breathing soil, there were a few other special treasures. Some of them were not of much use to Wang Xian.<br/><br/>It was the corpse of a powerhouse from another universe. It was a soul corpse.<br/><br/>This soul corpse, under Wang Xian’s senses, was the body of a powerhouse at level nine, the ruler of the universe.<br/><br/>It also contained a tremendous amount of energy.<br/><br/>To Wang Xian, this was not of much use. However, to Ming Shaisheng, it was definitely a great treasure.<br/><br/>Ming Shaisheng, one of the seven mad demons, was a powerhouse from the Netherworld race.<br/><br/>This soul corpse was of great use to him.<br/><br/>Other than this corpse, there was another special treasure from another universe. It indeed contained a tremendous amount of energy.<br/><br/>Wang Xian was more familiar with this energy.<br/><br/>The power of faith.<br/><br/>However, Wang Xian could not use the treasure of the universe of faith.<br/><br/>The space jar with an infinite space was useless to Wang Xian.<br/><br/>The last treasure was the broken wood.<br/><br/>It was a part of the space bridge. It looked like a wood element item.<br/><br/>Wang Xian was not sure if the broken wood was useful or not. He could ask an lie to bring it back to the Dragon Palace to take a look.<br/><br/>He wanted to see if the ancestral tree had any reaction to it!<br/><br/>Wang Xian stood at the side and watched ao Jian’s absorption speed quietly.<br/><br/>After more than ten minutes, Wang Xian sensed that the suppression from the sword and the magical universe on Ao Jian had completely disappeared. Ao Jian also opened his eyes, and a hint of surprise appeared in his eyes.<br/><br/>“Very good! ”<br/><br/>Wang Xian looked at the amount of breath soil ao Jian had absorbed, and a smile appeared on his face.<br/><br/>He had only absorbed more than ten kilograms of the universe breath soil, and the repulsive force from this universe had been eliminated.<br/><br/>In that case, with the universe breath soil in his hands, it was enough for more than ten thousand disciples of the Dragon Palace to come to this sword and magical universe.<br/><br/>Wang Xian was deep in thought.<br/><br/>Currently, the starry universe was the main activity area of the Dragon Palace.<br/><br/>However, the starry universe still had the suppression of the universe. Only Lan Qingyue, Xiao Lan, and the rest were not suppressed.<br/><br/>However, Lan Qingyue, Xiao Lan, and the rest did not dare to step into the Infinite Starry Universe.<br/><br/>This caused the Dragon Palace to have a huge restriction on the access to resources.<br/><br/>Not to mention the nine-origin universe!<br/><br/>Now, the development of the Dragon Palace had gradually reached a bottleneck!<br/><br/>The Sword and Magic Universe was a good place for the development of the Dragon Palace.<br/><br/>It could definitely attract tens of thousands of disciples from the Dragon Palace.<br/><br/>Wang Xian was even prepared to establish a forbidden land here.<br/><br/>The name could be called Void Dragon Forbidden Land.<br/><br/>It represented the Holy Land of the Void Dragon God.<br/><br/>He had already thought of the location of the forbidden ground. It was here.<br/><br/>The Forbidden Ground, Void Moon, would be changed to the Forbidden Ground, Void Dragon Forbidden Ground.<br/><br/>Not Bad, not bad!<br/><br/>At the thought of this, a smile appeared on his face.<br/><br/>“An lie, bring 10,000 dragon guards and 10 charming dragon species! ”<br/><br/>Wang Xian looked at an lie and immediately gave the order!<br/><br/>“It’s the Dragon King! ”<br/><br/>An lie nodded his head and his figure disappeared instantly!<br/><br/>The Dragon Guards were the best choice for the Sword and Magic Universe.<br/><br/>This was because they were practicing sword techniques.<br/><br/>It could be compared to the cultivation of the sword and Magic Universe.<br/><br/>The other ten charming dragon species were called over to oversee the Void Dragon Forbidden Ground in the future!<br/><br/>The Void Dragon forbidden ground needed at least some strong people who could handle the situation.<br/><br/>Of course, Wang Xian had his own ideas. In the future, he would be the Master of the Void Dragon Forbidden Ground.<br/><br/>His original body had always been here, while the body of the Void Dragon was at the Dragon Roar Forbidden Land!<br/><br/>Having made up his mind, Wang Xian began to plan!<br/><br/>An hour later, 10,000 dragon guards and 10 charming dragon species arrived.<br/><br/>Wang Xian immediately asked them to absorb the universe’s breath soil.<br/><br/>Buzz Buzz Buzz<br/><br/>Buzz Buzz Buzz<br/><br/>When all the disciples of the Dragon Palace had finished absorbing, they looked at Wang Xian in unison and waited for the Order!<br/><br/>“For now, let’s cultivate here. After we take control of this place, I will build a forbidden land in this universe. It will be called Void Dragon Forbidden Land.<br/><br/>This is also a restriction of our Dragon Palace in this universe! ”<br/><br/>“In the future, all of you can go to this universe to explore and cultivate and look for opportunities! ”<br/><br/>Wang Xian gave them an order.<br/><br/>“It’s the Dragon King! ”<br/><br/>The group of Dragon Palace Disciples replied immediately!<br/><br/>“Alright, continue to cultivate.”<br/><br/>Wang Xian nodded and instructed an lie to bring him to the eighth level of the Tower of Moon.<br/><br/>After returning to the body of the Void Dragon, Wang Xian continued to cultivate!<br/><br/>Buzz<br/><br/>A few hundred years later, an energy fluctuation came from the side.<br/><br/>Wang Xian opened his eyes and saw that the dragon’s roar was connecting spells!<br/><br/>“Why aren’t you practicing?”<br/><br/>Wang Xian hesitated for a moment before asking her.<br/><br/>“I’m about to make a breakthrough while I’m practicing. I Can’t make a breakthrough anymore. I need to start practicing spells to increase my combat experience! ”<br/><br/>Long Yin Yin said to Wang Xian.<br/><br/>Once she made a breakthrough, she would reach the level eight of a universe knight.<br/><br/>In that case, his combat ability in the level eight of a universe knight wasn’t too strong.<br/><br/>At that time, it was basically impossible for him to fight against two or three people stronger than him..\t\t\t\t\t\t</div>", "images": {}, "success": true}