{"id": 969, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073838.html", "title": "Chapter 3971 - Chapter 3971: 3970 Preaching And Teaching!", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3971 - Chapter 3971: 3970 Preaching And Teaching!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3971: 3970 preaching and teaching!<br/><br/>Translator: 549690339<br/><br/>Just now, because of the presence of the Master of the Dragon Roar Forbidden Ground, all the strong disciples were well-behaved and didn’t dare to make any noise!<br/><br/>However, when they saw how Wang Xian easily killed the spatial swordsman who was at the first level of the universe dominator, all the strong disciples couldn’t help but exclaim.<br/><br/>Even the elders and deacons were exclaiming in surprise!<br/><br/>This strength was too terrifying!<br/><br/>The spatial attribute was already known as the king of the ten attributes.<br/><br/>The powerful spatial attribute swordsman was able to fight above his level.<br/><br/>Now, this sage Wang Xian was able to easily kill a spatial dominator who was at the first level of the universe dominator<br/><br/>Was he able to fight against a powerhouse who was at the second level of the Universe Dominator and had other attributes.<br/><br/>This was not impossible.<br/><br/>Because the strength of the spatial attribute was here.<br/><br/>“Very good! ”<br/><br/>A hint of shock flashed across the eyes of the Master of the Dragon Roar forbidden ground as he spoke heavily.<br/><br/>The strength that Wang Xian had displayed had indeed shocked her.<br/><br/>The holy sons and Saintesses of the Dragon Roar Forbidden Ground, long yinyin and long yinhao.<br/><br/>They were now able to fight against opponents of a higher level.<br/><br/>However, they were fighting against opponents of a higher level. If they defeated someone stronger than them, they would be able to achieve victory even if they fought for a long time.<br/><br/>However, Wang Xian was different. He was able to kill instantly.<br/><br/>An instant kill without any resistance.<br/><br/>The most important point was the space attribute.<br/><br/>The space attribute was the king among the top ten attributes. It also had a huge weakness.<br/><br/>That was that it was difficult to cultivate. There were fewer spatial sword techniques and spells.<br/><br/>Otherwise, all the strong disciples would have cultivated the space attribute!<br/><br/>Among the 100 level one masters of the universe, there were only one or two strong masters of the space attribute.<br/><br/>In addition, on the sword and magic continent, the third-ranked force mainly cultivated the space attribute.<br/><br/>Wang Xian’s combat strength was really terrifying!<br/><br/>“Thank you for the praise from the Lord of the Forbidden Land! ” Wang Xian heard the praises around him and nodded with a smile!<br/><br/>“Hehe, not bad. From today onwards, Little Xian, you will be the holy son of the Dragon Roar Forbidden Land! ”<br/><br/>The Master of the Dragon Roar Forbidden Land smiled in satisfaction and said.<br/><br/>“Greetings, holy son Wang Xian. Holy son Wang Xian can suppress the same generation! ”<br/><br/>“Greetings, holy son Wang Xian. Holy son Wang Xian can suppress the same generation! ”<br/><br/>As the Master of the Dragon Roar Forbidden Land finished his words, all the strong disciples bowed respectfully once again!<br/><br/>Wang Xian stood in the middle and smiled.<br/><br/>“You guys continue with the rest of the matters of the holy son ceremony. ” After the leader of the Dragon Roar Forbidden Ground said that, he moved and left in an instant!<br/><br/>“All the leaders of the magical kingdom have come to pay their respects to the Holy Son! ”<br/><br/>After the leader of the Dragon Roar Forbidden Ground left, a deacon immediately spoke up!<br/><br/>“Brother Wang Xian, please take a seat! ”<br/><br/>At the back, Long Yinhao smiled at Wang Xian.<br/><br/>Wang Xian nodded and sat in the middle.<br/><br/>“Greetings, Saint Son Wang Xian from the dragon-descended magical kingdom. ”<br/><br/>At this moment, the kings of the magical kingdom flew over from the front and bowed respectfully to Wang Xian.<br/><br/>These kings were high and mighty in their magical kingdom.<br/><br/>However, there was still a huge gap between them and the holy son.<br/><br/>A single sentence from the holy son could even change the kings.<br/><br/>The kings of the magical kingdom were not weak. They were all at the level of the ruler of the universe.<br/><br/>Each king would offer up treasures.<br/><br/>Wang Xian sat there and accepted the gifts from the hundreds of kings of the magical kingdom!<br/><br/>After receiving the gifts, it took him a few hours.<br/><br/>“Hold a feast! ”<br/><br/>Following that, the next event continued!<br/><br/>Hold a feast to celebrate!<br/><br/>There were also disciples from the Dragon Roar Forbidden Land who were performing sparring!<br/><br/>Wang Xian waved his hand and took out the treasures that the kings of the magical kingdom had sent as a reward.<br/><br/>This made the entire holy son ceremony exceptionally lively!<br/><br/>The process of holding a banquet took a few days!<br/><br/>“Wang Xian, the next step is to ease up on the guidance. The holy son has outstanding talent. Naturally, his thinking and thinking skills are better than ordinary disciples. The holy son is giving guidance to the other disciples in order to increase the prestige of the Holy Son!”<br/><br/>The third procedure, guidance!<br/><br/>In order to establish the prestige of the Holy Son Faster, the holy son would give guidance.<br/><br/>He would give guidance to the ordinary disciples in their cultivation.<br/><br/>Sure. ”<br/><br/>Wang Xian nodded his head.<br/><br/>He was good at giving guidance to some disciples in their cultivation.<br/><br/>After all, Wang Xian’s actual strength was there.<br/><br/>Putting everything else aside, even the founder of the dragon roar forbidden ground might not be as good as Wang Xian in giving guidance to his disciples in their cultivation.<br/><br/>After all, Wang Xian was a nine-origin divine dragon and was proficient in nine attributes.<br/><br/>Adding on the body of the Void Divine Dragon, that would be ten attributes!<br/><br/>“Next, I will be preaching my teachings. Any disciple can come up and ask for guidance! ”<br/><br/>Wang Xian sat there and said indifferently.<br/><br/>His voice was transmitted to every disciple!<br/><br/>“Greetings, Saint Son, Saint Son. I am a space-attributed person, Long Yitian. I Am A level three universe knight. I would like to seek your guidance in sword techniques. ”<br/><br/>A space elemental disciple immediately flew up and greeted him respectfully!<br/><br/>“Alright, show me your swordsmanship! ” Wang Xian nodded and gestured at him!<br/><br/>“Yes, Sir Holy Son! ”<br/><br/>Long Yitian nodded and immediately began to perform his space swordsmanship!<br/><br/>Wang Xian watched quietly as his eyes sparkled.<br/><br/>There was no distinction between attributes in the heaven origin swordsmanship. This kind of swordsmanship that could reach the heaven origin realm could be cultivated with any attribute.<br/><br/>Wang Xian, who was cultivating the Tianyuan sword technique, watched long Yitian’s sword technique.<br/><br/>He was like an adult watching a child learn how to walk.<br/><br/>“The level of your sword technique is too low, and there are insufficient flaws and techniques. Let me modify it for you. Feel it with your heart! ”<br/><br/>Wang Xian flicked his finger and a wave of space power surged into long Yitian’s body.<br/><br/>This wave of space power immediately controlled him to execute a sword technique.<br/><br/>Long Yitian widened his eyes and sensed it with his heart. His eyes revealed a look of shock.<br/><br/>“Dragon Roar Yin, is there no high-level spatial attribute sword technique in the Dragon Roar Forbidden Ground?”<br/><br/>Long Yitian sensed it while Wang Xian looked at long Yitian and asked directly.<br/><br/>“We really don’t have this in the dragon roar forbidden ground. There aren’t many cultivators in the dragon roar forbidden ground. Our main focus is on the water attribute. ”<br/><br/>Dragon Roar shook his head and said truthfully.<br/><br/>“No wonder. With the sword technique that Long Yitian has mastered, he can’t even fight against those of a higher level. ”<br/><br/>Wang Xian shook his head. He looked around and said directly, “I have a spatial sword technique here. All spatial attribute disciples, come over! ”<br/><br/>“Is Saint Wang Xian going to teach us sword techniques?”<br/><br/>“This… This is great, this is great! ”<br/><br/>“Thank you, sage Wang Xian! ”<br/><br/>The space-attributed disciples looked excited and flew over immediately.<br/><br/>Even some masters who had reached the realm of universe Dominators hesitated for a moment before flying over.<br/><br/>“Sage, we don’t have many space-related sword techniques in the forbidden land, and our level is relatively low. Thank you, sage Wang Xian, for teaching us sword techniques today! ”<br/><br/>A space swordsman at the fourth level of the universe master realm, who was also a deacon, cupped his hands and thanked him directly..\t\t\t\t\t\t</div>", "images": {}, "success": true}