{"id": 964, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073828.html", "title": "Chapter 3966 - Chapter 3966: The 3965 Disciples Of The Dragon Palace Arrived", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3966 - Chapter 3966: The 3965 Disciples Of The Dragon Palace Arrived</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3966: The 3965 disciples of the Dragon Palace arrived<br/><br/>Translator: 549690339<br/><br/>Long Yin Yin’s heart was a little confused.<br/><br/>This was the first time in her hundreds of millions of years of cultivation.<br/><br/>Yes, Long Yin Yin had lived for hundreds of millions of years.<br/><br/>However, most of his time was spent in closed-door cultivation.<br/><br/>A random closed-door cultivation would last for millions of years. At most, it would last for tens of millions of years.<br/><br/>For powerhouses like them, hundreds of millions of years was equivalent to more than ten years for mortals.<br/><br/>Their only life calamity was the time of the calamity.<br/><br/>If they could survive the calamity, the lifespan of powerhouses like them would normally be more than 30 billion years.<br/><br/>Judging from such a lifespan, she was still young.<br/><br/>She was even very young.<br/><br/>Her mind was running wild.<br/><br/>She had to let her mind run wild.<br/><br/>Otherwise, how could these priceless treasures and cultivation methods make sense?<br/><br/>After Wang Xian followed the sixth elder and toured around the Dragon Roar Forbidden Ground.<br/><br/>The two of them returned once again.<br/><br/>The third elder and the rest of them also prepared extremely sumptuous delicacies.<br/><br/>Not only were these delicacies delicious, they also contained a powerful energy.<br/><br/>This was the first time Wang Xian tasted the delicacies of the sword and the magic universe.<br/><br/>It was indeed unique!<br/><br/>However, to his surprise, the dragon roar at the side looked at him from time to time.<br/><br/>There was a hint of shyness and curiosity in his eyes as he looked at him.<br/><br/>This made him feel that something was wrong!<br/><br/>“Set a time to hold Xiao Xian’s son of Saint Ceremony! ”<br/><br/>After everyone enjoyed the delicious food, the third elder looked at the surrounding elders and said,<br/><br/>“Let Xiao Xian set the time. ”<br/><br/>An elder pondered for a moment and said.<br/><br/>“That’s true!”<br/><br/>The third elder nodded, his gaze landed on Wang Xian. “Xiao Xian, look at the time. Set an auspicious day to hold your son of Saint ceremony. This is a very big matter for us in the Dragon Roar Forbidden Ground. ”<br/><br/>“This… third elder is not in a hurry. How about ten thousand years later?”<br/><br/>Wang Xian hesitated for a moment and said.<br/><br/>He wanted to wait for an lie to come again.<br/><br/>At that time, he could give it a try.<br/><br/>If the disciples of the Dragon Palace could descend into this universe, it would be of great benefit to the development of the Dragon Palace.<br/><br/>Currently, the disciples of the Dragon Palace no longer dared to move around in the nine-origin universe.<br/><br/>If there was a base in the sword and magic universe, it would be of great benefit to the Dragon Palace.<br/><br/>And the Forbidden Land, the Void Moon, was a good treasure land.<br/><br/>It could be used for the cultivation of the disciples of the Dragon Palace, and it could be used as a nest.<br/><br/>“Ten thousand years later? No Problem! ”<br/><br/>The third elder nodded. Ten thousand years was just a time for a simple retreat.<br/><br/>“Yin Yin, Yin Hao, and Xiao Xian, the three of you can continue to cultivate in the sacred moon. Before that, Yin Yin, take Xiao Xian to the Ten Thousand Arts Pavilion in the Dragon Roar Forbidden Land. You can choose the spatial attribute sword techniques and secret manuals in there.”<br/><br/>“If it’s a spatial innate treasure, we also have it in the Dragon Roar Forbidden Ground. You can choose two of them at will. The cultivation resources will be distributed according to the standards of the Holy Son!” Sixth Elder said to Wang Xian and the rest.<br/><br/>With a wave of his arm, a token flew into long Yin Yin’s hand.<br/><br/>“It’s sixth Grandpa! ”<br/><br/>Long Yin Yin took the token and nodded.<br/><br/>“Alright, the three of you can exchange ideas and get familiar with each<br/><br/>The third elder waved his hand with a smile.<br/><br/>Long Yinhao said to Wang Xian.<br/><br/>Wang Xian nodded his head and followed her out.<br/><br/>“Damn it, I forgot about my younger brother so quickly! ”<br/><br/>Long Yinhao saw that his sister was completely ignoring him. He muttered to himself speechlessly and immediately followed behind her.<br/><br/>The Ten Thousand Arts Pavilion in the Dragon Roar forbidden ground was open to Wang Xian.<br/><br/>There was only one top-notch spatial attribute sword technique book in there. Wang Xian opened it and took a look. It was still useful to him!<br/><br/>In fact, Wang Xian had already mastered the secret manual that he obtained in the forbidden land, the Void Moon.<br/><br/>Top-notch secret manuals could not be copied.<br/><br/>The concept contained in it could only be comprehended from the original secret manual.<br/><br/>However, Wang Xian’s strength was too strong. Many Wang Xian could easily understand and control the spells!<br/><br/>There were only a few top-notch spells that he needed to ponder over.<br/><br/>After completely comprehending them, Wang Xian could record these spells and sword techniques himself for the reference of the disciples of the Dragon Palace!<br/><br/>In fact, these spells and sword techniques only had some reference value to the dragon wizards and the charming dragon species.<br/><br/>It was only a reference.<br/><br/>After all, the nine-origin universe also had its own cultivation system and characteristics.<br/><br/>As for sword techniques, Ao Jian and the rest were cultivating the best Tianyuan sword technique in the universe. The sword techniques in the sword and magic universe could only be used as a small reference.<br/><br/>The gap between them and the Tianyuan sword technique was still too big!<br/><br/>Wang Xian checked the spatial sword technique in the Dragon Roar Forbidden Land and went to the Treasury to get two innate treasures.<br/><br/>Such treatment was indeed the best in the entire dragon roar forbidden ground.<br/><br/>Even the deacons who were at level five or six, the masters of the universe in the Dragon Roar Forbidden Ground, did not receive such treatment.<br/><br/>“Wang Xian, let’s go back to the Holy Moon to cultivate. Although our dragon roar forbidden ground has a treasure ground for cultivation, we don’t have a treasure ground with spatial attributes. Moreover, the absorption of energy from the treasure ground for cultivation will be reduced. It’s best to cultivate in the Holy Moon!”<br/><br/>After coming out from the treasure vault of the Dragon Roar Forbidden Ground, Dragon Roar spoke to Wang Xian.<br/><br/>“Yes, that’s fine!”<br/><br/>Wang Xian nodded.<br/><br/>Following that, the three of them rushed towards the Void Moon once again.<br/><br/>When they arrived at the eighth level of the Holy Moon, Dragon Roar taught him the forbidden spell that she was cultivating.<br/><br/>After he had completely mastered it, Wang Xian sat cross-legged on the magic stone and began to cultivate!<br/><br/>This stunned Long Yin who was at the side.<br/><br/>“What a fool. He only knows how to cultivate! ”<br/><br/>She couldn’t help but Grumble in her heart. She looked at Wang Xian helplessly.<br/><br/>However, very soon, she sat cross-legged at the side with a smile on her face and began to cultivate.<br/><br/>Time passed quickly while she was cultivating.<br/><br/>The time that she had agreed upon with an lie soon arrived.<br/><br/>Wang Xian opened his eyes and looked around.<br/><br/>He and Long Yin were still the only ones on the entire eighth floor.<br/><br/>Wang Xian waved his arm and a surge of energy enveloped him.<br/><br/>Long Yin was at the side. He could only see that Wang Xian was still cultivating with his legs crossed. He couldn’t see any other movements or changes!<br/><br/>Wang Xian immediately set up a demonic altar in front of him.<br/><br/>Buzz<br/><br/>“Greetings, Dragon King! ”<br/><br/>Not long after, an Lie’s figure appeared. Wang Xian nodded at him.<br/><br/>“Is there any situation in the Dragon Palace?”<br/><br/>Wang Xian asked as usual.<br/><br/>“Dragon King, everything is fine in the Dragon Palace! ”<br/><br/>An lie replied.<br/><br/>“Alright, I want to conduct an experiment. Bring Ao jian here now! ”<br/><br/>Wang Xian instructed an lie.<br/><br/>He wanted to see if the universe breath soil was effective..\t\t\t\t\t\t</div>", "images": {}, "success": true}