{"id": 978, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073856.html", "title": "Chapter 3980 - Chapter 3980: 3,979 Names Were Spread Across The Continent", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3980 - Chapter 3980: 3,979 Names Were Spread Across The Continent</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3980: 3,979 names were spread across the continent<br/><br/>Translator: 549690339<br/><br/>Teaching and cultivating.<br/><br/>Wang Xian still had the ability to do so!<br/><br/>Although the cultivation methods of the nine-origin universe and the sword and magic universe were somewhat different,.<br/><br/>The Divine Dragon transformation that Wang Xian was cultivating required the support of his bloodline.<br/><br/>The Dragon Roar Yin did not have a bloodline, so naturally, it could not be cultivated.<br/><br/>However, Wang Xian had a water attribute heaven origin creation fragment.<br/><br/>Book of Water Forbidden Spell!<br/><br/>This book of Water Forbidden Spell was a heaven origin creation treasure of the Sword and Magic Universe!<br/><br/>There was a powerful forbidden spell spell on it!<br/><br/>A Heaven origin creation level treasure did not have the limitations of the universe.<br/><br/>For example, the star field fragment clearly contained the energy attribute of the universe.<br/><br/>In the end, experts who believed in the universe could control it with the power of belief.<br/><br/>The energy of the nine-origin universe could be controlled as well.<br/><br/>This was the strength of the Heaven’s origin treasure!<br/><br/>There was no limit to the universe!<br/><br/>Wang Xian had the book of water forbidden spells. He could use many of the water forbidden spells on it. With a simple simplification, he could impart them to long yinyin.<br/><br/>Furthermore, he had a move that was not weaker than the top-notch cultivation method!<br/><br/>And this was under the condition of being simplified at will!<br/><br/>“Brother Wang Xian, I’ll attack you. Look at my flaws. ”<br/><br/>The two of them came to a private sparring room on the second floor. Long Yin spoke to Wang Xian!<br/><br/>“HMM, how about this? I’ll attack you. You block and counterattack. Pll see which aspect of you needs improvement. ” Wang Xian nodded and instructed her.<br/><br/>“Okay, that works too! ”<br/><br/>Long Yin nodded his head and smiled at him. “Thank you, Wang Xian. By the way, How Old Are you this year? Are you really older than me? Are you sure you’re not younger than me?”<br/><br/>“Of course Pm older than you! ”<br/><br/>Wang Xian smiled and said.<br/><br/>Of course, he was just casually saying that. Wang Xian was much younger than her.<br/><br/>After all, he had only cultivated for less than 100 million years!<br/><br/>But he couldn’t be her underling?<br/><br/>(‘I don’t believe you. Anyway, you are strong. Whatever you say, come on! ” Long Yin said with a smile and retreated some distance.<br/><br/>“Alright, pay attention. My attack will be at the ordinary level of a level nine universe knight. Use all your strength to defend and counterattack! ”<br/><br/>Wang Xian said as he waved his arm. A sharp sword condensed from space energy headed towards her attack.<br/><br/>Dragon Roar Yin immediately started to block and counterattack!<br/><br/>Wang Xian watched from the side. He looked at her deficiencies and memorized them one by one!<br/><br/>“You still lack a lot in terms of attack. Let me teach you some magic to fill in your current deficiencies! ”<br/><br/>After a round of probing, Wang Xian had a comprehensive understanding of her attack and defense. He spoke to her.<br/><br/>“Eh? Brother Wang Xian, you know water element spells?”<br/><br/>Long yinyin revealed a surprised expression. “I know a little. Let me tell you. try to condense it. ”<br/><br/>Wang Xian nodded at her and continued.<br/><br/>“No way, brother Wang Xian. If you want to teach a person the cultivation of magic, you have to comprehend a magic that is a level higher than this one. Only then can you do it orally. ”<br/><br/>Long Yin said in surprise.<br/><br/>“Although I don ‘t have the water attribute, I have a strong absorption ability towards magic and sword techniques. Just listen to me. ”<br/><br/>Wang Xian found an excuse and said.<br/><br/>“Yes, yes. Brother Wang Xian, you are really a genius. Compared to you, I feel that Pm not even comparable to an ordinary person!”<br/><br/>Long Yin said with admiration.<br/><br/>As for the level of the magic that he taught, Wang Xian didn’t know. However, it could perfectly match long yin.<br/><br/>It could fill in the gaps that she was lacking at the moment!<br/><br/>Long yinyin immediately followed suit and started cultivating!<br/><br/>While Wang Xian was teaching long yinyin, his name had already spread throughout the sword and magic universe.<br/><br/>The Donghua holy son of Donghua Holy Land.<br/><br/>His strength was definitely not weak among the holy sons and Saintesses of the Forbidden Holy Land and the Holy Academy.<br/><br/>Even if he could not be ranked at the top, he was still a top-notch existence!<br/><br/>After he was killed by Wang Xian in an instant, the news spread out and caused quite a stir.<br/><br/>Following that, the news that Wang Xian, the holy son of the Dragon Roar Forbidden Ground, possessed the strength of a level two universe dominator began to spread across the continent.<br/><br/>The strength and talent of a level two universe dominator, coupled with the space attribute, was definitely at the top among all the holy sons and Saintesses in the entire continent.<br/><br/>Those holy sons and Holy Virgins in the Top Ten Holy Lands and Holy Academies were only so-so!<br/><br/>In fact, they might even be a little inferior!<br/><br/>Not long after, in the ranking of Holy Sons and Holy Virgins, the Holy Son Wang Xian from the Dragon Roar Forbidden Land had reached the fourth place in the ranking of Holy Sons and Holy Virgins!<br/><br/>He was ranked tenth in the entire ranking of Holy Sons and Holy Virgins!<br/><br/>This shocked a large number of powerful disciples in the Sword and Magic Universe!<br/><br/>To be able to be ranked in the top ten, this was definitely an extremely terrifying existence in the entire continent!<br/><br/>One had to know that the holy sons and Holy Virgins of the Holy Lands and Holy Academies who were ranked in the top ten had a total of twenty.<br/><br/>These powerful Holy Sons and Holy Virgins of the Holy Lands and forbidden grounds.<br/><br/>Weren’t they even more powerful than a holy son of the Dragon Roar Forbidden Ground who was ranked close to a hundred?<br/><br/>When this list came out, it caused a great controversy.<br/><br/>Especially those disciples and great beings of the forbidden lands who were ranked near the top.<br/><br/>They thought that their own holy sons and saintesses were even more powerful.<br/><br/>Some of the holy sons and saintesses were even a little unconvinced!<br/><br/>The strength of the holy sons and Saintesses of the forbidden lands who were ranked in the top 10 were all at the universe ruler Level 1 or 2, and the powerful ones were even at level 3 or 4!<br/><br/>These holy sons and saintesses were not convinced when they were at the same level!<br/><br/>They cultivated powerful sword techniques and magic, yet they were still not a match for the holy sons of the forbidden grounds who were ranked close to a hundred?<br/><br/>This made them somewhat unconvinced!<br/><br/>Those holy sons and Saintesses who were ranked behind Wang Xian were even prepared to challenge him.<br/><br/>However, when Wang Xian was teaching long yinyin to rest for a few decades, long yinyin told him this news, causing him to be slightly stunned.<br/><br/>“Brother Wang Xian, you are ranked in the top ten in the unfettered forbidden land. Brother Wang Xian, you are too amazing. The unfettered forbidden land will not randomly rank you!”<br/><br/>Long yinyin had completely turned into a little fangirl as she said to Wang Xian!<br/><br/>“They are all just floating clouds. If I were to cultivate for a few million years, none of them would be a match for me! ”<br/><br/>Wang Xian smiled without a hint of modesty.<br/><br/>What a joke. Would he, Wang Xian, be weaker than others?<br/><br/>“Hehe, that’s for sure. ”<br/><br/>Long Yin nodded with a smile.<br/><br/>At this moment, an idea suddenly popped up in Wang Xian’s mind.<br/><br/>The Void Dragon Forbidden Ground had been established for a few million years. The energy in the forbidden ground had almost been absorbed.<br/><br/>Should they be allowed to go out for a walk.<br/><br/>Shun Bian made a name for himself.<br/><br/>The Void Dragon Forbidden Land, whether it was Ao Jian or the other dragon guards, was very young.<br/><br/>They could all be holy sons.<br/><br/>Ao Jian had already broken through to the level 4 universe overlord realm.. Should he go and challenge them?\t\t\t\t\t\t</div>", "images": {}, "success": true}