{"id": 977, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073854.html", "title": "Chapter 3979 - Chapter 3979: 3,978 Names Were Spread Across The Continent", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3979 - Chapter 3979: 3,978 Names Were Spread Across The Continent</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3979: 3,978 names were spread across the continent<br/><br/>Translator: 549690339<br/><br/>“Congratulations, Wang Xian. You are simply too awesome! ” Long Yin looked at Wang Xian with admiration in his eyes.<br/><br/>“Big Brother is awesome. Big Brother is invincible! ”<br/><br/>Long Yinhao also shouted along.<br/><br/>Wang Xian smiled faintly.<br/><br/>Speaking of which. Wang Xian also felt that he was not bad.<br/><br/>This body of his had started cultivating from scratch.<br/><br/>There were no external factors.<br/><br/>The biggest background was his own body.<br/><br/>However, the other holy sons and saintesses also had backgrounds, didn’t they?<br/><br/>Yes, he was still alright!<br/><br/>“I’m sorry, Holy Sons and saintesses. Our holy son, Wang Xian, has won!” Seventh Elder said with a smile on his face.<br/><br/>He glanced at Wang Xian from time to time with shock in the depths of his eyes!<br/><br/>“This kid is not from the pond. Our Small Dragon Roar forbidden ground can ‘t nurture such a monster! ”<br/><br/>However, at this moment, he was at the top of the Heaven Peak!<br/><br/>The leader of the Dragon Roar Forbidden Ground, a group of elders from the Dragon Roar Forbidden Ground, stood there and looked down.<br/><br/>In the middle of them, an old man who was leaning on a walking stick said with slight astonishment.<br/><br/>Upon hearing the words of this old man, the elders around were shocked.<br/><br/>“Master, this Wang Xian has a sense of nobility, whether it’s from his heart or from the inside out. It’s a kind of strength that comes from the heart. Pve only seen this kind of temperament from the masters of the powerful forbidden lands. Pm starting to doubt if he’s some top-notch powerhouse who has retrained! ”<br/><br/>The Master of the Dragon Roar Forbidden Land said with a slight sigh!<br/><br/>“Yes, I also have this kind of doubt, but I can be sure that he is not a great being who re-cultivates, but a great being who re-cultivates. The old fate wheel can not be changed. The Aura on his body is full of youth and vitality. Unfortunately, this kind of existence can only stay in our dragon roar forbidden land until the calamity arrives! ”<br/><br/>The old man sighed and said, “There must be a big secret on him. Or perhaps, he has inherited the entire inheritance of a powerful spatial expert. He carries the will of that expert on his back. However, the top spatial experts in our universe are all in the space forbidden ground. ”<br/><br/>As the old man spoke, he shook his head in Puzzlement!<br/><br/>“There is one more point. His sword techniques are very different from the sword techniques in the Space Forbidden Ground!”<br/><br/>The Master of the Dragon Roar Forbidden Land added.<br/><br/>“Is this… is this Wang Xian holy son so powerful?”<br/><br/>The elders at the side said with astonishment!<br/><br/>“Pay more attention to him. He wants to leave our dragon Roar Forbidden Land after the calamity. There must be some special circumstances. But no matter what, we should make friends during this period. If I’m not wrong, his current combat strength is enough to instantly kill A Level 4 universe Dominator in our dragon roar forbidden land. ”<br/><br/>“Besides, when he first came to the dragon roar forbidden land, he was only a pinnacle universe knight. His improvement speed was too fast, and his talent was too heaven-defying. Even the top three holy sons and Saintesses of our universe were only SO-SO. ”<br/><br/>“I even think more highly of him when it comes to fighting against those above his level. ”<br/><br/>The old man continued to speak.<br/><br/>“It’s Elder! ”<br/><br/>All the elders immediately replied!<br/><br/>This old man was the founder of the Dragon Roar Forbidden Ground!<br/><br/>The strongest person in the Dragon Roar Forbidden Ground!<br/><br/>After the old man finished speaking, he waved his hand and disappeared! “Lord Lord of the Forbidden Ground, let me go take care of that Wang Xian! ” The third elder said to the Lord of the Dragon Roar Forbidden Ground.<br/><br/>“HMM, isn’t the little girl on good terms with him? Don’t you admire him? Let’s see if he can improve further!”<br/><br/>The leader of the Dragon Roar Forbidden Ground suddenly spoke. Then, he waved his arm and passed him an interspatial ring.<br/><br/>“I want to too! ”<br/><br/>The third elder smiled and took it. Then, his body moved and he immediately flew down!<br/><br/>“Haha, Little Xian, you’re very strong. This time, you’ve brought honor to our dragon roar forbidden ground and brought honor to our dragon roar forbidden ground. These resources are for you! ”<br/><br/>The third elder came to Wang Xian’s side and said with a smile.<br/><br/>He handed an interspatial ring to Wang Xian.<br/><br/>“Thank you, Third Elder! ”<br/><br/>Wang Xian was slightly taken aback. He didn ‘t reject and accepted it directly.<br/><br/>“Haha, You Are the Holy Son of our dragon roar forbidden ground. You Deserve This!<br/><br/>The third elder laughed, then, he looked at long yinyin and said, “Yinyin, your combat strength has deteriorated. When you have nothing to do, you can spar with your brother Little Xian and let him impart some combat techniques and cultivation experience. After all, the interaction between you geniuses is more useful than our teachings!”<br/><br/>“Yes, I know, Grandpa.”<br/><br/>Long yinyin was slightly stunned and then nodded. She couldn’t help but say,<br/><br/>“But Grandpa, I haven’t deteriorated, have I?”<br/><br/>“In cultivation, if you haven’t improved, you have deteriorated. Don’t you understand this little logic?”<br/><br/>Third Elder said with a slightly serious tone!<br/><br/>Long yinyin lowered her head with a slight grievance.<br/><br/>Her combat strength had not deteriorated at all.<br/><br/>At the very least, she was much stronger than her younger brother.<br/><br/>Why was she talking about herself?<br/><br/>“Next, Pll give long yinyin some pointers. ”<br/><br/>Wang Xian looked at long yinyin and said.<br/><br/>He had just sensed the resources in his interspatial ring and was quite surprised. It was normal for him to give long yinyin some pointers.<br/><br/>After all, they were from the same faction!<br/><br/>“Hehe, alright. Why Don’t you thank your brother Xiao Xian? Although I don’t know her age, she is the strongest. You and Yinhao should address her as big brother. This will be the ranking of the strength of the holy sons and Saintesses in the Dragon Roar Forbidden Land! ”<br/><br/>Third Elder said!<br/><br/>“Yes, Grandpa!”<br/><br/>Long yinyin had a hint of doubt in her heart, but she didn’t ask too much. “Hehe, Big Brother, you have to teach me too! ”<br/><br/>At the side, Long Yinhao grabbed Wang Xian’s arm and said with anticipation.<br/><br/>“I’ll teach you after your strength has broken through to level eight universe knight. What’s the use now? Why Don’t you go back to your closed-door cultivation to improve your realm? When I was your age, I was already level eight universe Knight! ”<br/><br/>The third elder shouted at long yin hao, “Hmph, you’re covered in blood today.<br/><br/>Do you want to keep getting beaten up?”<br/><br/>As he spoke, he picked up long Yin Hao’s collar!<br/><br/>“AH, grandfather, you didn’t reach level 8 knight at my age, right?”<br/><br/>Long Yin Yin Yin shouted.<br/><br/>But in the next second, he was taken away by the third elder!<br/><br/>“This old man is really quick-witted! ”<br/><br/>At the top of the Sky Peak, the group of elders couldn’t help but smile when they saw the third elder’s actions.<br/><br/>“Yinhao is just too mischievous. We should lock him up! ”<br/><br/>Long yinyin said with a smile when he saw his grandfather leaving with his younger brother.<br/><br/>Wang Xian smiled and looked at long yinyin. “Let’s go. Let’s go to the second level. I’ll teach you.”<br/><br/>“Okay!”<br/><br/>Long yinyin nodded happily immediately.. The two of them moved and flew<br/><br/>towards the second level of Tian Feng!\t\t\t\t\t\t</div>", "images": {}, "success": true}