{"id": 973, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073846.html", "title": "Chapter 3975 - Chapter 3975: 3974 Below The Void Dragon Sacred Land", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3975 - Chapter 3975: 3974 Below The Void Dragon Sacred Land</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3975: 3974 below the Void Dragon Sacred Land<br/><br/>Translator: 549690339<br/><br/>“Boom! Boom! Boom!”<br/><br/>The entire sacred moon shone brightly.<br/><br/>Around them, more than a dozen experts from the sacred land and Sacred Academy looked on in shock.<br/><br/>Their expressions changed unpredictably!<br/><br/>They had been planning for the sacred moon of the Void Moon sacred land for tens of millions of years, but they had never expected that an accident would happen today!<br/><br/>At this moment, a wave of energy swept out from the Sacred Moon.<br/><br/>“Whoosh! Whoosh! Whoosh! Whoosh! ”<br/><br/>Figures slowly appeared at the entrance of the Sacred Moon.<br/><br/>Ten charming dragon species flew out, and their auras surged out in all directions.<br/><br/>“Oh? Who are they?”<br/><br/>The expressions of the experts of the Forbidden Land of the Void Moon changed slightly when they saw figures flying out from the sacred moon and sensed the positions on their bodies!<br/><br/>“From today onwards, the sacred moon of the forbidden grounds of the Void Moon will be ours. From today onwards, our void dragon sacred ground will be established. Everyone, please return! ”<br/><br/>A charming dragon announced calmly!<br/><br/>“What? The Sacred Moon has been occupied by them?”<br/><br/>“This? ? Who Is this sacred ground of the Void Moon? How did they occupy the Sacred Moon?”<br/><br/>“Damn it, how did they enter the Holy Moon? How did they suddenly occupy the Holy Moon?”<br/><br/>“Ten Universe Masters at the seventh level, and this is not even their leader. It seems that their leader is at least at the eighth level of universe masters. Their strength is not weak, but this is the first time I’ve heard of Void Dragon Holy<br/><br/>The expressions of the warriors of the sacred land changed when they heard these words.<br/><br/>Sacred Moon was actually occupied by another power!<br/><br/>They looked at the 10 charming dragon species, and their expressions didn’t look too good.<br/><br/>Weng Weng<br/><br/>However, the 10 charming dragon species didn’t say anything. They waved their arms, and a wave of energy swept out in all directions.<br/><br/>This wave of energy didn’t harm anyone, but it made everyone quickly retreat!<br/><br/>When all the experts saw this, their expressions turned ugly.<br/><br/>However, they did not resist.<br/><br/>A new forbidden land had suddenly taken over the Holy Moon. Furthermore, there were ten experts at the seventh level of the universe dominator flying out. In a situation where their strength was unknown, they did not dare to rashly offend them!<br/><br/>The group of experts from the forbidden land retreated with helpless expressions on their faces.<br/><br/>“Sigh, where did this void Dragon Forbidden Ground come from? If it wasn’t for them, Wang Xian, you would definitely be able to climb to the top of the Tower of the Moon and control the Holy Moon. It’s all their fault! ” Long Yin looked over and said to Wang Xian with a face full of regret!<br/><br/>“That’s right. Brother Wang Xian has just stepped onto the ninth level and is not far away from the 12th level. The great opportunity is gone just like that! ”<br/><br/>Long Yinhao also spoke with a helpless expression!<br/><br/>“What a loss!”<br/><br/>When Wang Xian heard the regretful words of the two of them, he said in a cooperative manner and frowned slightly.<br/><br/>“This is also a matter of luck. Many experts from the Holy Land are coveting this Holy Moon. They didn’t expect that a powerful force would suddenly appear and occupy it. This can’t be said to be the bad luck of the sage Wang Xian. It’s possible that this force has been scheming for a very, very long time!<br/><br/>A deacon from the Roaring Dragon Forbidden Land also spoke with a helpless expression!<br/><br/>“If we can cultivate for tens of millions of years in there, it would be an opportunity! ”<br/><br/>Wang Xian looked at it and shook his head. Then, he said a few words in cooperation.<br/><br/>“Hehe, Wang Xian, you don’t have to worry about your cultivation resources.<br/><br/>You won’t lack them. ”<br/><br/>Long Yin comforted him.<br/><br/>Okay.<br/><br/>Wang Xian nodded. He still had the resources that the elders and deacons of the dragon roar base had given him that he had yet to absorb!<br/><br/>After absorbing these resources and items, it was enough for him to improve a lot.<br/><br/>Furthermore, there was no need for him to continue staying at the peak of the Universe Knight Realm.<br/><br/>He could break through directly!<br/><br/>“Let’s go. We have already reported this matter to the elders. The elders told us to return immediately and not to offend Void Dragon Holy Land Rashly. ”<br/><br/>Everyone nodded and left.<br/><br/>Although the rest of the experts from the Holy Land were unwilling, they could only leave immediately!<br/><br/>At the top floor of the Moon Tower, Wang Xian looked at everything outside with a smile on his face.<br/><br/>The Void Dragon’s body was cultivating in the Roaring Dragon Base while he was overseeing this place.<br/><br/>Multitasking. It was not easy for experts like them!<br/><br/>However, Wang Xian was not prepared to go out.<br/><br/>“Ao Jian, tidy up this Holy Moon. After that, you guys will cultivate here. After you have absorbed all the energy in this place, go out and train! ” Wang Xian instructed ao Jian and the rest.<br/><br/>The energy in each treasure land was limited. For example, the energy contained in this place would be absorbed after a large amount of absorption.<br/><br/>After the absorption, the treasure land would automatically recover.<br/><br/>However, this recovery would require a period of time.<br/><br/>Only a fixed amount of energy could be recovered every day.<br/><br/>The fixed amount of energy recovered was simply not enough for a large number of great beings to cultivate.<br/><br/>At most, it could only allow a few universe ruler level one and level two great beings to wantonly absorb it.<br/><br/>However, this moon tower had accumulated quite a bit of energy.<br/><br/>The main thing was that even though there were many disciples who had been absorbing energy here over the past few million years.<br/><br/>However, these disciples were all below the level of universe knights. This was enough for the energy here to sustain their absorption!<br/><br/>“It’s the Dragon King! ”<br/><br/>Ao jian nodded.<br/><br/>After that, over 10,000 Dragon Guards came to the 11th level and began to cultivate!<br/><br/>“Charming Dragon, you guys go outside and search for all the information about the sword and the magic universe, as well as all the information about the sacred grounds and the Sacred Academy. Also, search for some information about the treasure grounds! ”<br/><br/>Wang Xian spoke to the 10 charming dragon species!<br/><br/>The 10 charming dragon species nodded and flew out immediately.<br/><br/>“It’s the Dragon King! ”<br/><br/>The 10 charming dragon species replied immediately.<br/><br/>Wang Xian came to the top of the twelfth floor and sat there. He didn’t absorb the energy here.<br/><br/>Once he absorbed all the energy, it wouldn’t take long for him to finish absorbing it.<br/><br/>However, even if he absorbed all the energy here, it would still be difficult for him to achieve a breakthrough!<br/><br/>“Let’s see if I can obtain secret information about this universe from the Dragon Roar Forbidden Ground! ”<br/><br/>Wang Xian thought to himself and calmed his mind.<br/><br/>With this notification, Wang Xian, who had the body of a void God Dragon, and the experts from the dragon roar forbidden ground came to the Dragon Roar Forbidden Ground!<br/><br/>“Wang Xian, our dragon roar forbidden ground doesn’t have any treasure grounds with spatial attributes. Do you have any plans for the future?”<br/><br/>When they arrived at the Dragon Roar Forbidden Ground, Dragon Roar looked at Wang Xian and asked.<br/><br/>“I plan to absorb all the resources first before we take a look.”<br/><br/>Wang Xian said and then looked at her. “Long Yin Yin, if you want to gain experience, is there any place? It would be best if it is suitable for a master of the universe. ”<br/><br/>“Experience? Yes, there is. The ruins of the universe and the abyss of Demonic Beasts are all training grounds for a Master of the universe. However, there are some dangers there. ”<br/><br/>Long Yin Yin Yin replied!\t\t\t\t\t\t</div>", "images": {}, "success": true}