{"id": 970, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073840.html", "title": "Chapter 3972 - Chapter 3972: 3971 Had Established Its Prestige For Two Million Years", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3972 - Chapter 3972: 3971 Had Established Its Prestige For Two Million Years</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3972: 3971 had established its prestige for two million years<br/><br/>Translator: 549690339<br/><br/>“It’s a small matter! ”<br/><br/>Wang Xian waved his hand at them. With a thought, each and every move was directly condensed in his heart!<br/><br/>Buzz<br/><br/>In front of him, a small person was condensed. It contained a strong power of space.<br/><br/>With a wave of his arm, the small person flew forward.<br/><br/>“Follow the practice and enlightenment. ”<br/><br/>Wang Xian said directly.<br/><br/>The IMP in front of him began to display his sword technique!<br/><br/>The eyes of the group of spatial attribute swordsmen focused. They immediately began to cultivate and comprehend it.<br/><br/>As the IMP danced, the luster in the eyes of all the spatial swordsmen became colder and colder.<br/><br/>They revealed excited expressions.<br/><br/>“This is a spatial sword technique that is only inferior to the top-tier! ”<br/><br/>At the back, the group of elders and powerhouses saw this scene and their eyes focused slightly.<br/><br/>“Condensing the technique into a skill. This… Wang Xian is actually able to condense a skill from a high-level sword technique. Hiss, how terrifying is our Wang Xian’s understanding of spatial sword techniques?”<br/><br/>“Wang Xian has at least mastered a powerful top-level spatial sword technique. Otherwise, he definitely wouldn’t be able to do this! ”<br/><br/>“Condensing the technique into a skill, and it’s a high-level spatial attribute sword technique. In our dragon roar forbidden land, only I, the founder, can do it. Even we, the masters of the forbidden land, can’t do it. This… ”<br/><br/>The elders were filled with shock.<br/><br/>Condensing the technique into a technique.<br/><br/>The technique represented the sword technique. As long as one completely comprehended a sword technique, they would be able to form their own powerful sword technique.<br/><br/>And if one wanted to display their own sword technique, it would be even more difficult!<br/><br/>Even if one completely transformed the sword technique into one’s own sword technique, it would still be very difficult to display one’s sword technique.<br/><br/>Unless there was a possibility that you had completely mastered the advanced sword technique and comprehended it as your own sword technique.<br/><br/>In that case, there was only one possibility for Wang Xian to be able to condense the intermediate sword technique into a technique!<br/><br/>There was only one possibility for Wang Xian to be able to condense an advanced sword technique into a technique!<br/><br/>He had mastered a top-notch sword technique.<br/><br/>Regardless of whether it was a sword technique manual or a magic book, they were all exceptionally precious in this continent!<br/><br/>For an expert to be able to completely master a top-tier magic book and turn it into his own magic skills, that was already very abnormal.<br/><br/>Most of them could only be done by those masters who were above level eight, the Masters of the universe!<br/><br/>However, they, the sage Wang Xian, could do it just by being at the peak of the Universe Knight Realm.<br/><br/>It was too terrifying!<br/><br/>When Wang Xian heard the exclamations of the elders behind him, he didn’t understand what they meant.<br/><br/>This was the first time he had heard about condensing techniques into techniques.<br/><br/>What he had mastered was the heaven origin sword technique. Creating a high-level sword technique was a piece of cake!<br/><br/>There was no pressure at all.<br/><br/>If he were to painstakingly study and spend millions of years, he would be able to create a top-level sword technique!<br/><br/>After all, he only needed to use the superficial parts of the heaven origin sword technique!<br/><br/>“No wonder brother Wang Xian is so abnormal. It turns out that he has mastered a top-notch sword technique. He’s a monster, a monster! ”<br/><br/>When Long Yinhao heard the exclamations of the elders, he looked at Wang Xian with his mouth agape.<br/><br/>Now, he finally understood why Wang Xian could easily kill an existence that was a level higher than him!<br/><br/>How much he knew about the spells and what kind of spells he mastered would directly affect the combat strength of the strong disciples of the sword and Magic Continent.<br/><br/>At the side, Long Yinyin was also looking at Wang Xian with sparkling eyes. Her eyes were filled with starlight and admiration! “Thank you for your teachings, Saint! ”<br/><br/>The entire process of teaching lasted for a whole month.<br/><br/>A month later, a group of strong disciples with space attributes thanked Wang Xian with respect.<br/><br/>They knew how terrifying the condensation technique was.<br/><br/>“Hehe, Hour!”<br/><br/>Wang Xian waved his hand indifferently and gave a few pointers.<br/><br/>A few days later, Wang Xian flew out from the venue of the holy son’s ceremony and heaved a sigh of relief!<br/><br/>“Wang Xian, you are so powerful. You have completely comprehended a top-notch sword technique. No wonder your combat strength is so strong! ”<br/><br/>Long Yin Yin was beside him and said with admiration, “I have only grasped 60% of a top-notch spell in our dragon Roar Forbidden Ground! ”<br/><br/>“Is that so?”<br/><br/>Wang Xian smiled and looked at him.<br/><br/>Over the past few months, he had gained some understanding of the condensation technique.<br/><br/>“Don’t you think so? You are very abnormal. If I could master a top-notch spell<br/><br/>manual at my current level, I should be able to fight against two or three<br/><br/>people of a higher level without using the forbidden spell!”<br/><br/>“You have no idea. The strength and abilities you have displayed over the past few months have shocked even us elders. You Are Too Amazing! ”<br/><br/>She continued.<br/><br/>Wang Xian smiled and didn’t care much about it.<br/><br/>The Dragon Roar forbidden land was just a transition. What he wanted to do now was to raise his strength to the limit of a peak universe knight as soon as possible so that he could control the tower of the Moon.<br/><br/>Build the Void Dragon Forbidden Land!<br/><br/>“This time around, when I return to the Holy Moon, I’m prepared to cultivate properly and strive to enter the ninth level! ”<br/><br/>With Wang Xian’s current strength, entering the ninth level was not a big problem.<br/><br/>However, he was not in a hurry.<br/><br/>The energy in the eighth level was sufficient. He was prepared to cultivate to the limit and ascend to the top level in one go so that he could control the Holy Moon!<br/><br/>“Yes, yes, I’ve just broken through too. Pm prepared to reach the limit as soon as possible! ”<br/><br/>Long yinyin nodded and said!<br/><br/>“Brother Wang Xian, with your insane strength, you might be able to reach the top in the future! ”<br/><br/>Long Yinhao interrupted from the side!<br/><br/>“It’s not that easy. I need to deal with four people whose realms are higher than mine on the ninth level. There might be five on the tenth level, six on the eleventh level, and seven on the twelfth level. It’s difficult!”<br/><br/>Wang Xian said faintly.<br/><br/>Naturally, he wouldn’t say that he was confident.<br/><br/>“Yinhao, you have to try your best to reach the eighth level as soon as possible.<br/><br/>Stop fooling around! ”<br/><br/>Long yinyin reminded long yinhao.<br/><br/>“I’m not fooling around, sister. I’m very serious in my cultivation! ”<br/><br/>Long Yinhao replied speechlessly!<br/><br/>As the three of them spoke, they entered the Holy Moon again through the teleportation formation.<br/><br/>Then, they stepped into the Tower of Moon!<br/><br/>When they arrived at the eighth level of the Tower of Moon again, Wang Xian and long yinyin immediately sat cross-legged and began to cultivate.<br/><br/>Time passed quickly.<br/><br/>Wang Xian was also accumulating energy rapidly.<br/><br/>After 500,000 years, with the help of this powerful treasure land, he had<br/><br/>accumulated energy to the peak of a universe knight.<br/><br/>With his understanding of the power of space, he could definitely make a breakthrough!<br/><br/>However, Wang Xian did not make a breakthrough. He continued to suppress his realm and continued to cultivate!<br/><br/>Time flew by. Two million years passed once again. The power of space in Wang Xian’s body was accumulating more and more!<br/><br/>He slowly opened his eyes and a smile appeared on his face!<br/><br/>“It’s about time. It’s time to reach the top level! ”<br/><br/>Wang Xian thought to himself.<br/><br/>He looked around and realized that there were already other holy sons and Saintesses who had reached the eighth level.<br/><br/>Long Yinhao had also arrived successfully!<br/><br/>“Long yinyin, Long yinhao, Pm going to the ninth level! ”<br/><br/>Wang Xian looked at them and said directly!\t\t\t\t\t\t</div>", "images": {}, "success": true}