{"id": 975, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073850.html", "title": "Chapter 3977 - Chapter 3977: The 3976 Holy Son Challenge", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3977 - Chapter 3977: The 3976 Holy Son Challenge</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3977: The 3976 Holy Son Challenge<br/><br/>Translator: 549690339<br/><br/>“Whoosh! Whoosh! Whoosh! ”<br/><br/>Wang Xian was on the second level of the heavenly peak for his trial.<br/><br/>Around him, there were four water mages who were at the fourth level of the Universe Dominator!<br/><br/>Under the siege of the four water mages, Wang Xian was still able to fight back with ease!<br/><br/>One had to know that the current Wang Xian was only at the second level of the universe dominator.<br/><br/>However, with the space as the King’s attribute and the heaven origin sword technique, his combat strength was extremely terrifying.<br/><br/>He could easily kill a space cultivator who was one level higher than him.<br/><br/>He could also easily kill other attribute cultivators who were two levels higher than him.<br/><br/>Four of them was the current limit of Wang Xian.<br/><br/>This was already extremely terrifying!<br/><br/>Wang Xian kept fighting with them, and his combat experience had also improved tremendously.<br/><br/>His training of the Tianyuan sword technique was also getting deeper and deeper!<br/><br/>In the past, Wang Xian relied on his strong physical strength, his strong comprehension ability, and his sense of perception to cultivate the Tianyuan sword technique with ease.<br/><br/>But now, regardless of whether it was the breakthrough in the spatial attribute or the cultivation of the Tianyuan sword technique, it was tens of times slower!<br/><br/>It was likely that Wang Xian would need hundreds of millions of years, or even billions of years, to raise his strength to the ninth level of the universe overlord or even the peak!<br/><br/>This was already considered his cheating-like cultivation.<br/><br/>“Cultivate slowly. There are still billions of years before the calamity arrives! ”<br/><br/>Wang Xian mumbled. He was not in a hurry.<br/><br/>He still had time, and so did the Dragon Palace!<br/><br/>After practicing his swordsmanship continuously, Wang Xian spent a few years on the second level of the Heaven Peak.<br/><br/>After that, he returned to the place where he lived and continued to improve.<br/><br/>Time passed day by day again.<br/><br/>“Brother Wang Xian, someone is here to kick up a fuss! ”<br/><br/>After more than a million years, Long Yinhao’s voice was suddenly heard.<br/><br/>He was slightly stunned. A look of astonishment appeared on his face.<br/><br/>His body moved and he teleported to the entrance.<br/><br/>At the entrance, Long yinyin stood there in a sorry state. There were still some blood stains on his body and his aura was slightly weak.<br/><br/>When Wang Xian saw him, a look of astonishment appeared on his face.<br/><br/>“Yinhao, what happened to you? Why are you injured?”<br/><br/>He asked in astonishment.<br/><br/>“Brother, let’s go, let’s go. Come and help me teach those arrogant fellows a lesson. D * mn it, they still dare to sav that there’s no one in the Dragon Roar Forbidden Land. F * Ck them, F * Ck them! ”<br/><br/>Long Yinhao quickly grabbed Wang Xian ‘s arm and said!<br/><br/>“What happened?”<br/><br/>Wang Xian asked him!<br/><br/>“Brother, let’s talk as we fly over.”<br/><br/>Long Yinhao said, he brought Wang Xian down and said, “There’s a group of arrogant fellows here to challenge us. There’s no choice. I Can’t defeat them. Now, my sister seems to have made her move. However, the opponents are all very strong unless we use forbidden spells. However, the consumption of forbidden spells is too high. It’s not worth US using them! ”<br/><br/>“Who are they?”<br/><br/>Wang Xian looked at long Yinhao and asked curiously!<br/><br/>“They are the holy sons and daughters of a few holy sons. They are ranked higher in the Holy Land. F * ck, they are imitating the undeserved holy sons of the undeserved forbidden land to walk the path of invincibility again! ”<br/><br/>Long Yinhao said with a dark face.<br/><br/>Wang Xian understood a little when he heard his words.<br/><br/>A spar between Holy Sons and holy daughters!<br/><br/>Under normal circumstances, the forbidden grounds of the various holy grounds would not interfere in the competition.<br/><br/>Such a competition would bring great benefits to both parties.<br/><br/>Therefore, it was tacitly agreed that unless one was defeated, one would not reject such a competition!<br/><br/>“Also, there’s an additional ranking of holy sons and holy virgins in the unfettered forbidden grounds. D * mn it, it’s going to be interesting! ”<br/><br/>“But Pm relatively young among the group of Holy Sons and Holy Virgins. Many of them are much older than me. D * mn it, I’m going to lose my dignity! ”<br/><br/>“Of course, this wager is limited to the top 200 Forbidden Holy Grounds and holy academies on the continent. Furthermore, after a forbidden holy ground loses 20 times, it can not be challenged anymore! ”<br/><br/>He continued to add.<br/><br/>“There’s such a Thing?”<br/><br/>Wang Xian revealed a look of surprise.<br/><br/>“Yes, our continent is already preparing for the upcoming Battle of calamity. I heard that in the future, those powerful forbidden holy grounds will issue a ban on wars. In other words, wars between forbidden holy grounds are prohibited. ”<br/><br/>“In addition, there will be some competitions. The ranking of the holy sons and Saintesses is one of them to test the waters! ”<br/><br/>“Of course, I also heard all of this from my father! ”<br/><br/>Long Yin spoke with confidence.<br/><br/>As the two of them were talking, they quickly flew to the empty space below!<br/><br/>At this moment, Long Yin Yin was fighting with a woman.<br/><br/>That woman also had the strength of A Level 9 universe mage.<br/><br/>However, she was a wind-elemental mage.<br/><br/>The two of them were fighting at a distance. Wind energy and water energy were wreaking havoc!<br/><br/>However, from the looks of it, long yinyin was clearly at a disadvantage.<br/><br/>“Oh no, Pm afraid my sister is no match for the Saintess of the Nine Winds Sacred Academy. ”<br/><br/>Long Yinhao looked over and said!<br/><br/>Wang Xian looked over and nodded his head slightly.<br/><br/>The lady with the wind attribute was obviously stronger than long yinyin.<br/><br/>Be it the mobilization of energy or the condensed attacks, she was much more proficient than long yinyin.<br/><br/>In the universe of Swords and magic, it was also calculated in years. However, a billion years was also known as a generation!<br/><br/>A generation of a billion years.<br/><br/>Every holy son of the sacred grounds of the forbidden land had to be born in this generation.<br/><br/>Otherwise, they would not be qualified to become holy sons and Saintesses!<br/><br/>He looked to the side.<br/><br/>Other than the woman who was fighting with Long Yin Yin, there were more than twenty holy sons and saintesses.<br/><br/>The strength of these twenty holy sons and saintesses varied. The strongest one had already reached the second level of the universe dominator.<br/><br/>Wang Xian had some understanding of the current forbidden land in the sword and magic continent.<br/><br/>The Dragon Roar Forbidden Land could be ranked in the top 100 on the continent.<br/><br/>Of course, it was only ranked in the 90th place.<br/><br/>This person from the nine winds sacred institute could be ranked in the top 50.<br/><br/>His overall strength was much stronger than the dragon roar forbidden land.<br/><br/>Wang Xian and long Yinhao landed at the side.<br/><br/>There were also many elders and deacons from the dragon roar forbidden land in the surroundings. A large number of disciples were watching.<br/><br/>All of them were cheering for Long Yin!<br/><br/>However, at this moment, the elders and deacons frowned slightly. They didn’t look too good!<br/><br/>“We’re going to lose! ”<br/><br/>Wang Xian spoke after watching for half an hour!<br/><br/>Boom<br/><br/>In the next second, gusts of wind energy surged towards Long Yin.<br/><br/>PFFT<br/><br/>Long Yin couldn’t resist in time and was hit directly. She spat out blood!<br/><br/>An elder immediately waved her arm and a healing spell entered her body..\t\t\t\t\t\t</div>", "images": {}, "success": true}