{"id": 976, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073852.html", "title": "Chapter 3978 - Chapter 3978: Under The Challenge Of The 3977 Holy Son", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3978 - Chapter 3978: Under The Challenge Of The 3977 Holy Son</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3978: Under the challenge of the 3977 holy son<br/><br/>Translator: 549690339<br/><br/>“Yin Yin has lost. The Saintess of the nine wind sacred academy is really extraordinary. ”<br/><br/>The seventh elder of the Dragon Roar Forbidden Land looked at the Saintess and said indifferently.<br/><br/>Sister Long Yin Yin is also extraordinary. I just took advantage of my age! ”<br/><br/>The Saintess of the nine wind sacred academy cupped her hands and said very politely.<br/><br/>“Haha, all of You Saint Sons and Saintesses are indeed powerful, indeed powerful. However, my elder sister and I are a little weaker than my big brother in the Dragon Roar Forbidden Land. ”<br/><br/>“You should also know that there are two Saint Sons in our Dragon Roar Forbidden Land. I Am Big Brother’s little brother, Ning Xingchen. I just lost to you, but that doesn’t mean that our dragon roar forbidden land will be given to King Ning’s sacred land for free. Next, My Big Brother will take action and easily suppress you. Haha! ”<br/><br/>Long Yinhao suddenly laughed out loud and pointed at them as he spoke!<br/><br/>“Hehe, we’ve heard about this. The Real Holy Son in the Dragon Roar forbidden ground is Wang Xian. Is this him?”<br/><br/>Ning Xingchen heard long Yinhao’s words and spoke indifferently. Then, his gaze landed on Wang Xian.<br/><br/>The rest of the holy sons and Saintesses’gazes landed on Wang Xian!<br/><br/>“To be able to enter the ninth level of the Tower of Moon, the holy son of Wang Xian is quite famous in the continent. Tell us your strength and let’s have a spar!<br/><br/>The holy son beside Ning Xingchen said calmly!<br/><br/>“Do you want to fight?”<br/><br/>Wang Xian looked at long yinhao.<br/><br/>“Of course, of course. Otherwise, we will have to give them resources. But if you win, they will have to give them to us! ”<br/><br/>Long Yinhao nodded his head immediately!<br/><br/>“Alright! ”<br/><br/>Wang Xian nodded his head and cupped his hands at them. “Wang Xian, the second stage of the Universe Dominator realm, spatial swordsman! ” As he spoke, the spatial energy on his body soared into the sky.<br/><br/>“What the F * ck, what the F * ck, brother… Brother, you have already broken through to the second stage of the Universe Dominator Realm?”<br/><br/>Upon hearing Wang Xian’s words and sensing the aura that he was emitting, long Yinhao’s expression changed drastically. “No Way, Big Brother. You are actually so freakish. It has only been a few million years, right?”<br/><br/>“Eh? Wang Xian. ”<br/><br/>Long yinyin sensed the aura from Wang Xian’s body and his expression changed slightly. He immediately flew to his side.<br/><br/>“Yes. When I was in the Tower of Moon, I could have broken through at any time. However, I have been suppressing my strength. ”<br/><br/>Wang Xian smiled and said!<br/><br/>“Pervert! hahaha! The second level of the Universe Dominator and the space attribute. Among all the saints and saintesses, this is also very top-notch. At least, it can be ranked in the top ten! ”<br/><br/>Long Yinhao laughed out loud. His face was filled with arrogance.<br/><br/>It was as if he had such a realm!<br/><br/>“Huh? What? What a fast cultivation speed! ”<br/><br/>“Wang Xian the sage, you’re Amazing! ”<br/><br/>When the seventh elder and the surrounding deacons saw this, they moved and instantly appeared behind Wang Xian. Their eyes shone with a fiery glow.<br/><br/>Seventh Elder! ”<br/><br/>Wang Xian smiled and cupped his hands at the seventh elder.<br/><br/>“Haha, Good, Good!”<br/><br/>The seventh elder patted Wang Xian’s shoulder happily with a look of satisfaction!<br/><br/>“Wang Xian is invincible! ”<br/><br/>“Wang Xian is able to suppress his peers. Congratulations, Wang Xian! ”<br/><br/>“Haha, we have Wang Xian in the dragon roar forbidden ground. He can definitely be ranked in the top ten among the saints. This time, our dragon roar forbidden ground can be considered to be famous! ”<br/><br/>In the surrounding area, the disciples of the dragon roar forbidden ground were filled with excitement and excitement as they shouted loudly!<br/><br/>“What? He has reached the level two realm of a universe overlord?”<br/><br/>In front of them, the faces of the holy sons and Saintesses changed slightly when they felt the might of Wang Xian.<br/><br/>According to the information they received, this new holy son of the Dragon Roar forbidden ground was only at the peak of the Universe Knight Realm.<br/><br/>However, in just a few million years, he had already broken through to the level two realm of a universe overlord.<br/><br/>The speed of his breakthrough was too terrifying!<br/><br/>The expressions of the twenty or so holy sons and Saintesses changed. Finally, they sat on the body of a young holy son in the middle.<br/><br/>The holy son of Donghua Holy Land had an earth attribute and was at the second level of the universe dominator. He was a magician!<br/><br/>Donghua Holy Land was ranked 51st in the Holy Land. However, Donghua Holy Land had produced a powerful holy son this time.<br/><br/>The holy son of Donghua Holy Land said to Wang Xian as his eyes flickered slightly!<br/><br/>“Earth Element Spellcaster, you are no match for me! ”<br/><br/>Wang Xian shook his head at the holy son of Donghua Holy Land and said directly!<br/><br/>“How would we know if we haven’t competed? Although space is king, it’s not that easy to defeat me! ”<br/><br/>The holy son of Donghua said with a cold expression when he heard Wang Xian ‘s words.<br/><br/>Wang Xian shook his head and moved his palm.<br/><br/>Buzz! Buzz! Buzz<br/><br/>In an instant, 90 sharp swords attacked the Donghua Saint!<br/><br/>“HMPH, don’t underestimate the people in the world! ”<br/><br/>When the Donghua saint saw Wang Xian standing there without moving, he attacked him.<br/><br/>His eyes turned cold as he moved his body and flew toward the center of the battlefield.<br/><br/>With a move of his palm, a magic staff appeared in his hand. At the same time, earthy yellow walls filled with runes were rotating around him!<br/><br/>Peng! Peng! Peng<br/><br/>However, when his high wall was erected, the ninety sharp swords instantly disappeared. In the next second, they directly smashed into it.<br/><br/>The entire earthen yellow runic high wall rapidly collapsed!<br/><br/>The ninety sharp swords directly came to his surroundings and aimed at him. They floated there without moving!<br/><br/>“This… how is this possible! ?”<br/><br/>The Donghua Saint Son saw his defense crumbling instantly. When he saw the 90 space swords floating around him, his expression was unusually ugly!<br/><br/>His body trembled and he felt a little powerless.<br/><br/>“Space is the king. Although you are a saint son, how can I be weak?”<br/><br/>Wang Xian smiled faintly.<br/><br/>They were both Saint Sons. Under the situation where space was the king, what could he use to fight?<br/><br/>When one’s trump cards were all unleashed, there was a chance to block Wang Xian ‘s attack.<br/><br/>However, the prerequisite was that Wang Xian did not use the heaven’s origin sword technique or any powerful treasures.<br/><br/>“I’ve lost. With your strength, holy son Wang Xian, you can obtain a very high ranking in the ranking of holy sons this time!”<br/><br/>Although the Donghua Holy Son was unwilling, he still cupped his hands and admitted defeat!<br/><br/>“You flatter me! ”<br/><br/>Wang Xian cupped his hands in response.<br/><br/>“Hiss, this Wang Xian from the dragon roar forbidden ground. His strength is really terrifying. The Donghua saint is actually not qualified to fight him! ”<br/><br/>“The gap is too big. The gap is really too big. The Wang Xian saint is probably going to shine in this round of the Saint Ranking!”<br/><br/>“Rumor has it that he obtained the inheritance of the sword bowl from the top spatial attribute powerhouse. Now it seems that this is the only possibility! ”<br/><br/>At the side, the group of holy sons and Saintesses looked at Wang Xian in shock.<br/><br/>His strength was enough to rank among the top holy sons.<br/><br/>Next, he would probably become famous throughout the entire continent!<br/><br/>“Wang Xian, Holy Son, you are mighty! ”<br/><br/>“Wang Xian, Holy Son, you are invincible! ”<br/><br/>In the surrounding area, a group of disciples from the Dragon Roar forbidden ground shouted at Wang Xian in admiration!\t\t\t\t\t\t</div>", "images": {}, "success": true}