{"id": 971, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073842.html", "title": "Chapter 3973 - Chapter 3973: On The 3972 Void Dragon Forbidden Ground", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3973 - Chapter 3973: On The 3972 Void Dragon Forbidden Ground</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3973: On the 3972 void Dragon Forbidden Ground<br/><br/>Translator: 549690339<br/><br/>“HMM?”<br/><br/>On the eighth level of the Tower of Moon, when long Yinhao heard Wang Xian’s words, he immediately opened his eyes and revealed a shocked expression.<br/><br/>“Brother Wang Xian, are you confident that you can enter the ninth level?” Long Yinhao widened his eyes and asked Wang Xian.<br/><br/>In the surrounding area, when the other holy sons and saintesses heard it, their pupils constricted slightly.<br/><br/>They already knew Wang Xian very well!<br/><br/>He had joined the Dragon Roar Forbidden Ground and became a holy son of the Dragon Roar Forbidden Ground.<br/><br/>They also knew his performance during the holy son ceremony.<br/><br/>All the holy sons and saintesses were shocked by his strength.<br/><br/>In particular, they didn’t hide the fact that he had already mastered a top-notch sword technique and found out about it!<br/><br/>When they heard that he was going up to the ninth level, the faces of the Holy Sons and Holy Virgins turned ugly.<br/><br/>They were in a competitive relationship, but now, there was an existence from the same generation that made them feel hopeless and powerless.<br/><br/>This made them feel a deep sense of defeat!<br/><br/>Wang Xian nodded. “I’ll go up first. I’ll wait for you guys at the ninth level! ”<br/><br/>“Yes, yes!”<br/><br/>Long Yin nodded his head at Wang Xian with some admiration.<br/><br/>Wang Xian’s figure slowly disappeared and entered the test space!<br/><br/>In the next second, the shadows of four spatial swordsmen who were at level one of the Masters of the universe appeared in front of Wang Xian.<br/><br/>Wang Xian smiled when he saw them.<br/><br/>After two million years of accumulation, his strength had reached an extremely terrifying level.<br/><br/>Even Wu Sha and the others at that time could not compare to Wang Xian.<br/><br/>After all, Wang Xian was cultivating the Heaven origin sword technique!<br/><br/>Wang Xian could end the battle within five minutes with four spatial swordsmen who were at the level one of the universe Dominators.<br/><br/>However, Wang Xian did not end the battle quickly.<br/><br/>Instead, he fought with the four Phantoms who were at the level one of the universe Dominators slowly.<br/><br/>After five hours, he finally managed to destroy the four phantoms.<br/><br/>Buzz<br/><br/>The scene changed and he arrived at the ninth level.<br/><br/>“Brother Wang Xian has succeeded. It only took him five hours. He’s too strong! ”<br/><br/>Long Yinhao exclaimed in awe when he saw that Wang Xian had succeeded!<br/><br/>Around him, the other holy sons and saintesses were also in awe when they saw this.<br/><br/>It took him only five hours to reach the ninth level.<br/><br/>It was truly terrifying!<br/><br/>“There aren’t many treasures on the ninth level, and the value isn’t very high either! ”<br/><br/>Wang Xian came to the ninth level and looked around with a smile on his face.<br/><br/>He kept the treasures and moved his body to continue the challenge.<br/><br/>In order to enter the tenth level, he needed to fight against five powerhouses at the first level of the universe dominator.<br/><br/>This time, he only used seven minutes.<br/><br/>When he arrived at the tenth level, he looked around and kept the treasures on the tenth level. “HMM?”<br/><br/>However, the moment Wang Xian stepped into the tenth level, he was at the top level of the Tower of Moon!<br/><br/>The twelfth level of the Tower of moon was completely different from the other eleven levels.<br/><br/>There was only one magic stone here.<br/><br/>Above this magic stone was an object that looked like a bathtub!<br/><br/>An illusory figure was suspended in the bathtub.<br/><br/>However, this illusory figure only had the appearance of an infant.<br/><br/>The moment Wang Xian entered the 10th floor, his eyes opened instantly.<br/><br/>On the infant’s face, his eyes were filled with endless coldness and wisdom.<br/><br/>This wasn’t the look a baby should have.<br/><br/>Someone actually entered the tenth level. How many years have passed? Hahaha, I’ve finally waited for this day. Those who can enter the tenth level are definitely extremely powerful heaven’s favored ones. If nothing goes wrong, they should be the holy sons and Saintesses of the other sacred lands.”<br/><br/>An old and excited voice came from the illusory baby’s mouth!<br/><br/>He looked down slowly as if he could see through space and see everything on the tenth floor!<br/><br/>“Not bad, not bad. He should be the holy son of a big force. What a perfect body! Hahaha, what a perfect body! ”<br/><br/>The baby shouted excitedly and slowly raised his palm!<br/><br/>However, at this moment, he was slightly stunned when he saw the figure below slowly becoming illusionary!<br/><br/>“He actually wants to continue the challenge. Is He that confident? Good, good!<br/><br/>The baby’s eyes were filled with excitement. He retracted his arm and watched quietly.<br/><br/>However, when Wang Xian was about to continue the challenge, he narrowed his eyes slightly.<br/><br/>He did not stop. His figure disappeared instantly!<br/><br/>In the instant just now, he sensed that someone was spying on him.<br/><br/>If Wang Xian’s real body was not in his body, he would not have been able to sense it!<br/><br/>“Interesting. There are still living beings in this tower of the Moon! ”<br/><br/>Wang Xian thought to himself. In front of him, there were six existences at level one of the universe Dominators.<br/><br/>Wang Xian moved his body and immediately began to attack.<br/><br/>Wang Xian could still easily deal with the six phantoms of level one of the universe Dominators.<br/><br/>Now, with his strength, he could totally deal with the spatial swordsmen who were at level two of the Masters of the universe!<br/><br/>The battle was already very fast. It ended in ten minutes!<br/><br/>“What… What kind of strength is this? What a terrifying ability to fight across levels? What kind of sword technique is this?”<br/><br/>At the twelfth level of the Moon Tower, the baby trembled in excitement when he saw Wang Xian’s battle.<br/><br/>His eyes were filled with madness.<br/><br/>He was filled with disbelief.<br/><br/>(‘I the path of nihility, have waited for an unknown amount of time. To think that I would be able to obtain such a valuable piece of jade. To think that I would be able to obtain such a talented body. Hahaha, hahaha, it’s worth it. It’s totally worth it! ”<br/><br/>An excited voice came out from his mouth. His eyes started to turn red!<br/><br/>“With his strength, he can definitely reach the top level directly. Then, I will wait for him here. I will wait for this little Cutie! ”<br/><br/>The baby continued to speak. His mouth cracked open and his face was filled with a strange smile. He mumbled crazily, “Come on, come on, come on, My Baby!<br/><br/>Wang Xian entered the eleventh level without any change in his expression. He scanned his surroundings and kept the treasures inside.<br/><br/>His eyes flickered as he sat cross-legged on the Magic Stone and continued his challenge!<br/><br/>Buzz<br/><br/>Very soon, he came to the illusory space again and faced the illusory figures of the seven masters of the universe who were at level one!<br/><br/>The battle instantly erupted!<br/><br/>This time, Wang Xian still used only a dozen minutes to finish him off easily.<br/><br/>In the next second, he arrived at the 12th level.<br/><br/>The moment he appeared, he sensed a weird baby staring at him from the side.<br/><br/>“Hahaha, this is great, this is great. With the strength of a universe knight, you have the strength of a level two universe overlord. Furthermore, it is of the space attribute. You must have mastered a top-notch space sword technique and must have obtained the Sword Bowl of a space swordsman. hahaha!”<br/><br/>“Welcome to my arms, Little One!”<br/><br/>The baby said with a wild laugh..\t\t\t\t\t\t</div>", "images": {}, "success": true}