{"id": 979, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073858.html", "title": "Chapter 3981 - Chapter 3981: 3,980 Names Were Spread Across The Entire Continent", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3981 - Chapter 3981: 3,980 Names Were Spread Across The Entire Continent</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3981: 3,980 names were spread across the entire continent<br/><br/>Translator: 549690339<br/><br/>Once he made up his mind, he would do it!<br/><br/>Since he had established a force, he had to at least make a name for himself.<br/><br/>He had to turn this place into the second base of the Dragon Palace!<br/><br/>In the Void Forbidden Ground, Wang Xian’s real body opened his eyes and looked down! “Ao Jian. ”<br/><br/>He shouted softly.<br/><br/>“Dragon King, what are your orders?”<br/><br/>Ao jian immediately flew over and bowed respectfully to Wang Xian!<br/><br/>“Our Void Dragon Forbidden Ground has been established here for millions of years. Now, something has happened on this sword and magic continent. HMM, I will pass on the information on this continent to you. All of you should go and gain some experience!”<br/><br/>“Also, let’s give our void dragon forbidden ground a good reputation! ”<br/><br/>Wang Xian said to Ao Jian. He waved his arm and a stream of information was transmitted into his mind.<br/><br/>“It’s the Dragon King! ”<br/><br/>Ao Jian received the message and nodded immediately. “It’s the Dragon King. The energy in our forbidden land has basically been used up. I also have the idea of going out to gain experience. ”<br/><br/>“Yes, Go!”<br/><br/>“Pay attention to your safety. This is a communication device forged in the forbidden land. If there’s anything, contact me in the communication device and search for this continent. Is there a paradise similar to this Holy Moon or a treasure land?” Wang Xian spoke.<br/><br/>“It’s the Dragon King! ”<br/><br/>Ao jian nodded his head and left immediately!<br/><br/>“My current strength is only at the fourth level of the universe dominator. Without relying on the heaven origin fate fragment, Pm only comparable to a powerhouse at the ninth level of the universe dominator. I still need to improve a little more. ”<br/><br/>“Let’s see if ao Jian and the rest have good news. Ao Jian’s strength is at the fourth level of the universe dominator. With the Heaven origin sword art, he’s already very powerful! ”<br/><br/>Wang Xian mumbled.<br/><br/>It would be best if his strength could be upgraded by one or two levels. If he could upgrade by two levels, he wondered if he could fight against existences at the heaven origin creation level.<br/><br/>Even if he couldn’t, he should be able to escape with the help of the lock plate of the Heaven Origin Creation Treasure, right?<br/><br/>He thought to himself. However, at the moment, the Dragon Palace was still lacking in resources.<br/><br/>They lacked the resources to upgrade themselves.<br/><br/>In the starry universe, there was an infinite starry sky with the most resources. They could not step into it.<br/><br/>The surrounding resources were not enough to upgrade him quickly.<br/><br/>He still had to rely on this sword and the magical universe.<br/><br/>Ao Jian led his subordinates and flew out of the Void Dragon Forbidden Ground.<br/><br/>According to the information he obtained from Wang Xian, he immediately flew towards the center of the sword and magical universe.<br/><br/>This was not the center of the universe.<br/><br/>Half of the center of the universe was occupied by the ten Holy Grounds and the Holy Academy.<br/><br/>That was the place with the densest heaven and earth spiritual energy and the strongest treasure ground in the entire universe.<br/><br/>As for the other half of the universe, it was occupied by the abyss of Demonic Beasts and the battlefield of cosmic ruins.<br/><br/>Ao Jian was prepared to challenge the Holy Sons of the ten holy grounds as the holy son of the Void Dragon Forbidden Ground!<br/><br/>Wang Xian didn’t pay too much attention to the good fortune of Ao Jian and the Dragon Guards.<br/><br/>What he paid the most attention to now was naturally his void dragon body.<br/><br/>Every time he cultivated, Wang Xian’s two bodies would comprehend and comprehend at the same time!<br/><br/>This was also one of the reasons why he improved so quickly.<br/><br/>“Come, I’ll attack. You Defend! ”<br/><br/>In the second level of the Heaven Peak of the Dragon Roar Forbidden Ground, Wang Xian continued to guide Dragon Roar.<br/><br/>Long Yin nodded her head.<br/><br/>Two sharp swords were hovering around long yin. They were attacking continuously while she was also defending and attacking continuously! Wang Xian moved his palm and the third sharp sword attacked.<br/><br/>Long Yin continued to fight!<br/><br/>“Not bad, not bad! ”<br/><br/>“Brother Wang Xian, I’m much more powerful than I was a few decades ago. If I meet the Saintess of the Nine Winds Holy Academy again, Pm confident that I can defeat her easily! ”<br/><br/>After fighting for a few days, Long Yin ran over and came to his side with a face full of joy!<br/><br/>“Hehe, yes, you can defeat her easily! ”<br/><br/>Wang Xian nodded his head.<br/><br/>“Brother Wang Xian, how are you so powerful? You have to know that it has only been a few decades. The improvement in my combat strength could not be achieved so much even if I used a few million years in the past! ” Long Yin looked at Wang Xian with a face full of admiration!<br/><br/>“It’s your talent! ”<br/><br/>Wang Xian smiled and shook his head.<br/><br/>“No, brother Wang Xian, you are too powerful. This magic seems to be tailored for me. It’s too powerful! ”<br/><br/>Long Yin shook his head and said!<br/><br/>Sage Wang Xian, there are people outside challenging us! ”<br/><br/>At this moment, a voice suddenly sounded.<br/><br/>Wang Xian was slightly stunned when he heard that. With a wave of his arm, he opened the door of the training room!<br/><br/>At the location outside, a deacon from the Dragon Roar Forbidden Ground came to report!<br/><br/>“Deacon Feng, someone is here to challenge brother Wang Xian? Is he a holy son from a forbidden ground?”<br/><br/>Long Yin was slightly stunned as he spoke!<br/><br/>“Yes, he is a holy son from the Fa Yi Saint Academy. He is here to challenge brother Wang Xian. ”<br/><br/>The deacon nodded his head.<br/><br/>“Fa Yi Saint Academy? The saint son of the Fa Yi Saint Academy actually came here to challenge brother Wang Xian?”<br/><br/>Long yinyin revealed a surprised expression.<br/><br/>“Fa Yi Saint Academy? The fourth-ranked existence among the top ten forbidden holy grounds and Saint Academies?”<br/><br/>Wang Xian raised his eyebrows and said.<br/><br/>“Yes, the saint son of the Fa Yi Saint Academy is ranked eleventh among the saint sons and saintesses. He probably wants to challenge and defeat the Saint Son Wang Xian. ”<br/><br/>Deacon Feng continued, “Saint Son Wang Xian, let’s go over now. The Fanyi Saint Academy is very strong! ”<br/><br/>“Alright, let’s go over! ”<br/><br/>Wang Xian nodded and followed him to fly out immediately!<br/><br/>At the same time, the open space in front of the sky peak was already filled with the strong disciples of the Dragon Roar Forbidden Ground!<br/><br/>Five to six elders of the Dragon Roar Forbidden Ground had also come!<br/><br/>In the center of the area in front stood more than twenty young men and women.<br/><br/>The two in the lead each held a great staff in their hands, and their clothes flickered with divine light!<br/><br/>Their entire bodies were enveloped by divine light.<br/><br/>That great staff was a full head taller than them, and at the top of the staff was a beautiful flower that contained a huge amount of energy!<br/><br/>They were the holy sons and Holy Virgins of the Fanyi Sacred Academy.<br/><br/>Their attire was also the attire of the holy sons and Holy Virgins of the Fanyi Saint Academy.<br/><br/>They possessed terrifying abilities!<br/><br/>There were also some young heaven’s favorites with strong auras in the surroundings, as well as the Holy Sons and Holy Virgins of the other Holy Sons and Holy Virgins of the Holy Son Forbidden Ground.<br/><br/>Wang Xian’s gaze landed on the holy son of the Fanyi Saint Academy. He could see through his strength at a glance.<br/><br/>He was at the third level of the Universe Overlord realm, which was slightly higher than his current realm!<br/><br/>However, he cultivated the power of light!<br/><br/>Obviously, this holy son was completely unconvinced of Wang Xian.<br/><br/>A level two realm of the universe dominator was pressing down on him. He was the holy son of the Saint Academy who was ranked fourth on the continent.<br/><br/>How could he agree?<br/><br/>Even if the other party was a swordsman with the space attribute!\t\t\t\t\t\t</div>", "images": {}, "success": true}