{"id": 972, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073844.html", "title": "Chapter 3974 - Chapter 3974: In The 3973 Void Dragon Forbidden Ground", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3974 - Chapter 3974: In The 3973 Void Dragon Forbidden Ground</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3974: In the 3973 void Dragon Forbidden Ground<br/><br/>Translator: 549690339<br/><br/>The strange voice that came out of nowhere did not cause Wang Xian to have the slightest fluctuation.<br/><br/>He sized up this illusory spiritual body with a curious look in his eyes.<br/><br/>This infant’s spiritual body was very excited, very excited!<br/><br/>His expression was extremely ferocious!<br/><br/>He slowly opened his arms and stared at Wang Xian greedily.<br/><br/>The energy contained in his body was not weak. It was enough to kill a level five master of the universe.<br/><br/>“HMM?”<br/><br/>The baby stared at Wang Xian. When he saw that Wang Xian did not react to him at all, he was slightly stunned.<br/><br/>The smile on his face slowly disappeared. “You were once a master of the Void Moon?”<br/><br/>Wang Xian stared at him and asked calmly!<br/><br/>“Kekeke, that’s right. I am the Master of the Forbidden Land of the Void Moon. I never thought that there would really be someone who could ascend to the twelfth level of the Moon Tower. I thought that if I could ascend to the tenth level, I would still be a powerful saint child. You have really exceeded my expectations!”<br/><br/>The baby sized up Wang Xian once again and sensed the energy in his body. After confirming it completely, he laughed again.<br/><br/>“As long as I can occupy your body, I will be able to obtain all of your memories and be able to completely absorb them with you. I will also be able to return to my peak. With your powerful talent, I might be able to reach a higher level. ”<br/><br/>His eyes were filled with greed once again as he spoke!<br/><br/>“You are so arrogant with just a soul?”<br/><br/>Wang Xian looked at him and raised his eyebrows. Then, he smiled and said, “That’s true. According to the rules you set, the strongest person who can enter the Holy Moon is not a ruler. ”<br/><br/>“HMM?”<br/><br/>The baby frowned slightly when he saw that Wang Xian was still calm and did not show any signs of worry.<br/><br/>What was going on?<br/><br/>Why was this young man in front of him so calm?<br/><br/>His gaze turned cold as a majestic force gushed out from his body and pressed down on Wang Xian.<br/><br/>Wang Xian felt this force and his body transformed.<br/><br/>“Heh, it seems like you have used some powerful treasure to resurrect yourself and maintain such a form. When you take on another form, you can even<br/><br/>perform a perfect possession. It’s a pity that you met me!”<br/><br/>Wang Xian smiled. With a wave of his arm, he transformed into a dragon claw and grabbed the baby in his hand!<br/><br/>“What?”<br/><br/>When he saw that Wang Xian was not affected in the slightest and that the terrifying Dragon Claw was clawing at him, a look of shock appeared on his face.<br/><br/>“How is this possible? With your strength, how can your strength be?”<br/><br/>The baby’s face was filled with shock. He stared at Wang Xian in disbelief and screamed shrilly!<br/><br/>“You deserve to die! ”<br/><br/>Wang Xian stared at him coldly. A surge of energy surged into his body.<br/><br/>Soul capture!<br/><br/>“No, what kind of existence are you exactly? Why are you able to enter the Holy<br/><br/>Moon? No, no! ”<br/><br/>The baby cried out in despair. However, very soon, there was no more sound.<br/><br/>At the same time, some information appeared in Wang Xian’s mind.<br/><br/>This was the memory belonging to the Dao of nihility.<br/><br/>The dao of nihility was the lord of the Forbidden Land of the forbidden land, the Void Moon.<br/><br/>Due to an internal conflict with a supreme elder, he finally cast a forbidden spell to destroy his enemy and himself.<br/><br/>However, he possessed a special resurrection treasure!<br/><br/>This special resurrection treasure could allow him to return to his soul state.<br/><br/>It would allow him to possess again.<br/><br/>The dao of nihility did not possess him immediately. Instead, it carried out a plan and fell into a deep sleep.<br/><br/>It was not until he reached the tenth level that he woke up.<br/><br/>His goal was to possess the body of the Saint Son and Saintess who possessed powerful talents.<br/><br/>However, he would never have expected that Wang Xian would actually enter the Holy Moon.<br/><br/>In the entire sword and magic universe, the only ones who were stronger than Wang Xian were probably those few terrifying existences.<br/><br/>After absorbing the memories of the Dao of nihility, Wang Xian had a complete understanding of the forbidden land, the Void Moon, and the entire Holy Moon!<br/><br/>With a wave of his arm, this special bathtub treasure moved to the side.<br/><br/>With a wave of his arm, a surge of energy was injected into it.<br/><br/>Buzz<br/><br/>In the next second, a diamond-shaped magic stone flew out slowly.<br/><br/>This magic stone had ten faces, and each face contained an attribute.<br/><br/>This was the Holy Moon Stone that controlled this Holy Moon.<br/><br/>The entire Holy Moon was a natural treasure ground.<br/><br/>This Holy Moon Stone was the key.<br/><br/>After the death of the Dao of nihility, the mark inside had disappeared.<br/><br/>Wang Xian placed his mark inside. In an instant, he had complete control over the Holy Moon.<br/><br/>He could clearly sense all the living beings in the Holy Moon.<br/><br/>He wrapped up all the powerhouses of the Dragon Palace who were still cultivating in the Ten Thousand Arts Pavilion.<br/><br/>His mind moved.<br/><br/>Buzz<br/><br/>In an instant, all the disciples of the Dragon Palace appeared in front of him.<br/><br/>“HMM?”<br/><br/>“Greetings, Dragon King! ”<br/><br/>Ao Jian and the rest came back to their senses. Sensing the energy around them, they looked at Wang Xian and bowed immediately.<br/><br/>“Hehe, this place has been completely under my control. In the future, this place will be the base of our Dragon Palace in this universe. In the future, all of you will call yourselves the disciples of the Void Dragon Forbidden Ground! ”<br/><br/>Wang Xian instructed them!<br/><br/>“It’s the Dragon King! ”<br/><br/>Ao Jian and the rest replied immediately.<br/><br/>“Alright. Next, my main body will be guarding this place. My Void Dragon body will leave this place to cultivate alone! ”<br/><br/>Wang Xian nodded.<br/><br/>With a thought, he separated from the Void Dragon Body!<br/><br/>Buzz<br/><br/>In the next second, the Holy Moon Stone in his hand floated around him and emitted a luster.<br/><br/>Following that, Wang Xian’s Void Dragon body was directly teleported out. At the same time, the entire holy moon emitted an endless radiance.<br/><br/>All the disciples in the Holy Moon and the Moon Tower were subjected to a strong repulsive force.<br/><br/>In an instant, they sensed the changes in their surroundings. They were instantly teleported out!<br/><br/>“Huh? What’s going on? What Happened?”<br/><br/>“What’s going on? What’s going on? Why are we suddenly being transported All the heaven’s favored sons and Saintesses said in shock, looking at the Holy Moon in front of them in astonishment.<br/><br/>“Whoosh! Whoosh! Whoosh! ”<br/><br/>At this moment, the experts from the sacred grounds and sacred academies quickly flew past Ali.<br/><br/>They were also looking at the Holy Moon that was blooming with radiance with a shocked expression.<br/><br/>They were extremely bewildered!<br/><br/>“There’s a change in the interior of the Holy Moon. All the disciples have been teleported out? What’s going on?”<br/><br/>An expert could not help but ask!<br/><br/>However, no one could answer his question!<br/><br/>Wang Xian’s Void Dragon Body also appeared outside. He looked at long yin and long Yinghao and flew over directly! “Wang Xian, you were teleported out as well?”<br/><br/>Long Yingyin looked at Wang Xian and asked.<br/><br/>Wang Xian nodded his head. Looking at the Holy Moon that was glowing in front of him, the corners of his mouth curled up slightly..\t\t\t\t\t\t</div>", "images": {}, "success": true}