{"id": 987, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073874.html", "title": "Chapter 3989 - Chapter 3989: 3988 Entered", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3989 - Chapter 3989: 3988 Entered</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3989: 3988 entered<br/><br/>Translator: 549690339<br/><br/>“Boom! Boom!”<br/><br/>“Boom! Boom!”<br/><br/>“Bang! Bang! Bang!”<br/><br/>A spatial sword attacked the challenging Saint Son.<br/><br/>The Saint Son’s expression changed drastically. He waved the Sword of darkness in his hand and resisted continuously.<br/><br/>However, as he resisted, his body was repelled and repelled continuously!<br/><br/>He had to retreat for a long distance before he could barely withstand Wang Xian’s casual attack!<br/><br/>“This… what a powerful attack! ”<br/><br/>When the holy son saw that the spatial sword in front of him had disappeared, he had a grave expression on his face.<br/><br/>“With your strength, you won’t only be ranked ninth. You can fight for the top five or six spots! ”<br/><br/>He couldn’t help but speak to Wang Xian again.<br/><br/>“Hehe, it’s good enough to be ranked in the top ten. I don’t expect too much! ”<br/><br/>Wang Xian smiled and replied!<br/><br/>His words caused the face of the saint son to turn dark.<br/><br/>The person ranked eighth was also an expert at level three of the universe<br/><br/>dominator. However, he was the saint son of the space forbidden ground.<br/><br/>The saint son of the space forbidden ground was at level three of the universe dominator. He could fight above his level.<br/><br/>He was definitely not a match for him.<br/><br/>In other words, unless he was at level four of the Universe Dominator, he wouldn’t be able to enter the top nine.<br/><br/>As for him, he needed to be invincible in the level three universe overlord realm in order to maintain his current ranking.<br/><br/>The pressure was great!<br/><br/>“This? ? Holy Sh * t, Holy Sh * t, no way. Brother Wang Xian has broken through again? Broken through again? Isn’t this too terrifying?”<br/><br/>“Our Wang Xian holy son’s breakthrough is as simple as drinking cold water. This talent is too terrifying! ”<br/><br/>“Is this the sage Wang Xian? With his combat strength, he might be able to rank in the top five!”<br/><br/>“The top five is about right. I feel that our sage Wang Xian’s strength is stronger than the sage of the Forbidden Space Zone! ”<br/><br/>“This is too heaven-defying. With our sage Wang Xian’s current combat strength, he is able to challenge a level four master of the universe. This is also very powerful in our dragon Roar Forbidden Land! ”<br/><br/>Everyone around Wang Xian was filled with shock when they saw this scene.<br/><br/>Especially the dragon roar, Yin Long Yin Hao, and the rest.<br/><br/>Back then, when they knew about Wang Xian, they had just entered the Moon Tower.<br/><br/>When they first entered, he might have concealed his strength and was not only at level six of the Universe Knight Realm.<br/><br/>But later on, they knew that his strength was at the peak of the Universe Knight Realm.<br/><br/>It had only been tens of millions of years, and he had already reached the third level of universe master?<br/><br/>And it was the most difficult to cultivate the space attribute?<br/><br/>It was universally acknowledged that the space attribute was difficult to cultivate.<br/><br/>The Space Forbidden Ground was ranked third among the Holy Land Forbidden Grounds. That was already very terrifying, right?<br/><br/>But the holy son of the Space Forbidden Ground was only ranked eighth on the prodigy roll!<br/><br/>The Holy Maiden was even ranked in the 20th place.<br/><br/>This was because the space element was too difficult to cultivate.<br/><br/>Although they could fight across levels, there weren’t many who wanted to cultivate to the peak.<br/><br/>In the entire forbidden space, there weren’t many peak universe masters. One could even count them with one hand.<br/><br/>Of course, the powerful destructive power and combat power were enough to make up for the lack of experts.<br/><br/>At the same time, in front of them were the undeserved forbidden ground, flowing water forbidden ground, and space forbidden ground.<br/><br/>When all the strong disciples saw this scene, their eyes focused slightly.<br/><br/>Their gazes were all fixed on Wang Xian.<br/><br/>Especially the holy sons, Holy Virgins, and Heaven’s favorites from the major forbidden grounds!<br/><br/>“This Wang Xian’s strength is really not simple. I heard that he was able to ascend to the ninth level of a test tower in the past. He was able to fight and kill four shadows of trials who were one level higher than him. Then, with this foundation, Xu NPs strength should be inferior to him!”<br/><br/>“Senior brother, I really didn’t expect that on this continent, other than us and Liu Shui, there would be such powerful peers. I have really underestimated them!”<br/><br/>At the unfettered forbidden land, a man and a woman were talking.<br/><br/>They were the holy sons and Saintesses of the unfettered forbidden land. They were very honorable existences in the entire continent.<br/><br/>When they traveled, no one dared to offend them.<br/><br/>This was the prestige and status of the unfettered forbidden ground!<br/><br/>“The real dark horses are this Wang Xian from the dragon roar forbidden ground and Ao Jian from the Void Dragon Forbidden Ground!”<br/><br/>Not far away from them, a lady holding a Dharma Ball spoke slowly!<br/><br/>“Yes, if we give them enough resources and opportunities, their strength will not be weaker than ours!”<br/><br/>Beside the woman holding the magic ball, a young man nodded in agreement!<br/><br/>They were the holy sons and Saintesses of the Flowing Water Forbidden Ground!<br/><br/>In the surrounding area, some of the strong disciples were also discussing Wang Xian in a low voice.<br/><br/>Currently, with Wang Xian’s strength and talent, he was enough to enter the sights of the powerhouses of the universe.<br/><br/>“Little Xian, I didn’t expect you to break through again. This is great. This time, you will definitely be ranked in the top ten!”<br/><br/>When the elders of the dragon roar forbidden ground saw this, they also spoke excitedly!<br/><br/>“Don’t worry, elders. There is still a place for me in the top ten!”<br/><br/>Wang Xian smiled. With his current strength, he was confident that he would be ranked third.<br/><br/>Ao Jian was no match for him.<br/><br/>Of course, there was no need to compete. With just a word from Wang Xian, ao Jian would admit defeat!<br/><br/>“Brother Wang Xian, you are too amazing. How can you cultivate so quickly?<br/><br/>My cultivation is so slow! ”<br/><br/>Long Yin looked at Wang Xian and said with admiration.<br/><br/>“Hehe, Pll see if I can help you with your cultivation later!”<br/><br/>Wang Xian said to her with a smile.<br/><br/>The competition continued.<br/><br/>However, there were fewer battles in the top ten.<br/><br/>With Wang Xian in ninth place, they still had to consider if they wanted to challenge him.<br/><br/>Some saint sons and saintesses would rather challenge the eighth-ranked Xu ni saint son than the ninth-ranked Wang Xian saint son.<br/><br/>A thousand years passed quickly.<br/><br/>Later on, there were fewer and fewer challenges. The top 20 spots had basically been locked in.<br/><br/>As for the rankings at the back, the Holy Lands and sacred academies did not care much about it.<br/><br/>Only the top 20 had the authority to bring their disciples in.<br/><br/>“Hehe, first of all, Congratulations to the Top 20 Heaven’s favorites.<br/><br/>Congratulations on achieving such outstanding results. ”<br/><br/>When the quota was completely determined.<br/><br/>At the undeserved forbidden ground, an old man rose into the air and stood directly in the sky above the center of Tianyuan Peak. His body was emitting a vast power.<br/><br/>Looking over, one could clearly see his entire face from any side.<br/><br/>It was as if one could not see his back at all!<br/><br/>“The calamity, I believe all the experts of the forbidden sacred grounds and sacred academy know that although there are still billions of years before the calamity, we still have to make preparations in advance! ”<br/><br/>“Next, the sacred lands and sacred institute will gradually make some rules. Of course, this is for the future. The disciples on the Prodigy roll will be our main force in the calamity.”<br/><br/>“The sacred lands and Sacred Institute have decided to send talented prodigies and saintesses to a treasure land to cultivate and look for opportunities. ”<br/><br/>The elder said..\t\t\t\t\t\t</div>", "images": {}, "success": true}