{"id": 986, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073872.html", "title": "Chapter 3988 - Chapter 3988: 3987, I Have Already Achieved A Breakthrough", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3988 - Chapter 3988: 3987, I Have Already Achieved A Breakthrough</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3988: 3987, I have already achieved a breakthrough<br/><br/>Translator: 549690339<br/><br/>“HMM?”<br/><br/>Wang Xian looked in the direction that long Yinhao was looking at.<br/><br/>In his line of sight, at the other half of the peak of Tianyuan Peak, there were two forbidden grounds that occupied a huge area.<br/><br/>Waves of vast energy were transmitted from there without any concealment.<br/><br/>Wang Xian swept his gaze over and his eyes flickered slightly.<br/><br/>There were four powerhouses at the peak of the universe’s ruler realm. Two existences at the peak of the ruler realm had come from each forbidden land.<br/><br/>The unfettered forbidden land mainly cultivated the wind attribute. The existence of the Heaven’s destiny was also of the wind attribute.<br/><br/>However, there were powerhouses of all attributes in the unfettered forbidden land, including swordsmen and magic.<br/><br/>The flowing water forbidden land was different. Most of them cultivated the water attribute, and most of them were mages.<br/><br/>“This strength is not bad. The undeserved forbidden ground and flowing water forbidden ground are considered very powerful existences in the nine-origin universe. ”<br/><br/>Wang Xian thought to himself.<br/><br/>Located not far from the two forbidden grounds, a forbidden ground caught his attention.<br/><br/>Space Forbidden Ground.<br/><br/>This was also a very pure forbidden ground. All the people in the forbidden ground were space attribute cultivators.<br/><br/>In this universe where space was the king and could fight across levels, one could imagine how terrifying a powerful space force was.<br/><br/>The leader of the forbidden land in this space was known as an existence that was second only to the Heaven’s origin destiny realm.<br/><br/>Wang Xian looked around. Only these three forces could attract his attention.<br/><br/>They could make Wang Xian feel some fear.<br/><br/>The other forbidden grounds and sacred grounds were still alright. Wang Xian’s main body could deal with them with the help of the ultimate treasure of the Heaven’s origin!<br/><br/>“I the Wolf Saint, AM challenging the tenth ranked Jing Jiu Saint! ” At this moment, a voice was suddenly heard.<br/><br/>Following that, a figure flew towards the arena in front of him.<br/><br/>“HMPH, with just you?”<br/><br/>The reply was heard. Wang Xian looked over.<br/><br/>The Challenge had begun!<br/><br/>In the next few hundred years, it would be the most intense time to break out of the rankings.<br/><br/>There were many benefits to being in the top 20.<br/><br/>In addition, the Heaven’s pride roll this time would be attended by all the strong disciples from the Forbidden Lands and the Saint Academy!<br/><br/>If he could make a name for himself here, even if it was just to increase his ranking, it would be a huge boost to his reputation.<br/><br/>In addition, it could also increase the reputation of the faction he belonged to.<br/><br/>Therefore, regardless of whether it was for the powerful holy sons and saintesses or those who wanted to challenge them, they all hoped that their ranking could be improved!<br/><br/>Wang Xian’s realm had already improved. His ranking could definitely be improved a little!<br/><br/>However, he had no interest in challenging them. All he wanted was to be ranked in the top ten!<br/><br/>At this moment, Wang Xian noticed a familiar voice in a corner.<br/><br/>Led by the five charming dragon species, ao Jian and the rest.<br/><br/>They were located slightly further away from the Roaring Dragon Forbidden Ground.<br/><br/>The group of charming dragon species and ao Jian had obviously sensed Wang Xian as well.<br/><br/>Wang Xian nodded at them and did not say anything.<br/><br/>At the front, the battle between the two holy sons had already begun. All Kinds of energy were attacking from the center!<br/><br/>Every elder of the Forbidden Land of the Holy Land was resisting the aftershocks of their battle!<br/><br/>The battle lasted for a few days. The Challenge had failed!<br/><br/>Wang Xian sat there and watched indifferently. He had some understanding of the strength of the Tenth Heaven’s favorite.<br/><br/>The third level of the universe dominator.<br/><br/>This was the threshold of the tenth level.<br/><br/>As for the fourth level of the universe dominator, there were only five of them.<br/><br/>Wang Xian’s ranking was almost invincible among the third-level masters of the universe.<br/><br/>After all, he had killed the holy son of Star City from the Fa Yi Saint Academy in three moves.<br/><br/>He had a real battle record!<br/><br/>The challenges ahead continued. Disciples and dark horses rushed out one by one.<br/><br/>If the heaven roll ranking at the beginning was still hidden.<br/><br/>However, in the face of the temptation of opportunities, all the heaven’s favorites of the Forbidden Land Saint Academy did not hide anything at all!<br/><br/>This also resulted in the ranking changing continuously. “HMM? A Dark Horse has appeared! ”<br/><br/>A few years later, a dark horse suddenly appeared.<br/><br/>When the elders of the dragon roar forbidden ground saw this scene, their expressions changed slightly.<br/><br/>It had only been two hundred years since the Dark Horse appeared.<br/><br/>It had successfully challenged the tenth place.<br/><br/>In less than a hundred years, a saintess in front of Wang Xian was defeated.<br/><br/>If the Saintess in front was defeated, the challenger would have her name.<br/><br/>The loser would take a step back.<br/><br/>Just the appearance of a dark horse had brought Wang Xian to the ninth place!<br/><br/>“Oh no, why are there so many dark horses? It hasn’t even been half the time yet. ”<br/><br/>The third elder frowned slightly when he saw this scene.<br/><br/>Now that Wang Xian was ranked ninth, if there were more dark horses appearing, wouldn’t Wang Xian be ranked below the tenth place.<br/><br/>After the tenth place, there would be ten fewer spots to enter the cosmic ruins!<br/><br/>Wang Xian saw that there were people ranked before him again, but there was no fluctuation at all.<br/><br/>With his strength, it was enough to stabilize the top ten!<br/><br/>“This time, due to the cosmic ruins, many dark horses have been attracted.<br/><br/>They are all trying their best to enter the top twenty, especially the top ten! ”<br/><br/>“As for the Top 10 Heaven’s favorites, they wanted to get a higher ranking. They also wanted to continue to challenge and fight for a higher ranking. After all, this time was too important. It was also the Showground for all the heaven’s favorites! ”<br/><br/>After 100 years, the 10th Heaven’s favorites were once again challenged.<br/><br/>“I want to challenge the 9th-ranked holy son Wang Xian. Come out! ”<br/><br/>However, to Wang Xian’s surprise, the holy daughter who had just defeated the tenth-ranked holy daughter had recovered her injuries and energy. She continued to challenge him.<br/><br/>“Eh? Brother Wang Xian, this is bad. This guy wants to challenge you! ”<br/><br/>“Brother, are you confident? He is very strong. I feel that he still has some reservations after defeating the tenth-ranked holy daughter. His dark swordsmanship is really amazing!”<br/><br/>When the group of elders and disciples from the Dragon Roar forbidden ground saw that Wang Xian was the first one to be challenged, their expressions changed slightly. They looked at Wang Xian and said.<br/><br/>“You want to challenge me?”<br/><br/>Wang Xian was slightly stunned. A look of astonishment appeared on his face.<br/><br/>However..,<br/><br/>when Wang Xian heard the unexpected challenge, he was slightly stunned. Then, he laughed.<br/><br/>He did not fly over directly. Instead, he waved his arm and a space appeared in front of the challenger in an instant.<br/><br/>The spatial sword emitted a terrifying force, causing the surrounding void to tremble slightly.<br/><br/>“Compared to the past, I have already broken through. You are not my match! ”<br/><br/>Wang Xian said calmly.<br/><br/>“HMM?”<br/><br/>As soon as he finished his sentence, the saint son who was challenging Wang Xian froze slightly and revealed a stunned expression. “You broke through? The third level of a universe overlord?”<br/><br/>He was slightly shocked and could not help but ask!<br/><br/>Buzz<br/><br/>At this moment, the spatial sword that was flying in front of him shook!<br/><br/>Boom<br/><br/>A terrifying energy slashed towards him.<br/><br/>When the Saint Son saw this, his expression changed drastically and he quickly tried to defend with all his strength!\t\t\t\t\t\t</div>", "images": {}, "success": true}