{"id": 983, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073866.html", "title": "Chapter 3985 - Chapter 3985: 3984 Breakthrough, Heading To The Cosmic Ruins", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3985 - Chapter 3985: 3984 Breakthrough, Heading To The Cosmic Ruins</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3985: 3984 breakthrough, heading to the cosmic ruins<br/><br/>Translator: 549690339<br/><br/>“How’s your current cultivation?”<br/><br/>Wang Xian and Long Yin Yin were discussing about the current ranking of holy sons and saintesses.<br/><br/>After chatting for a few hours, Wang Xian asked her.<br/><br/>“It will probably take a few million years to break through to the pinnacle of the Universe Knight Realm. I don’t know the details yet! ”<br/><br/>Long Yin Yin said.<br/><br/>It was difficult to break through. Usually, it would be considered pretty good if one could break through to the pinnacle of the Universe Knight realm within tens of millions of years!<br/><br/>Long Yin Yin relied on his great talent and unlimited resources to be able to improve so quickly.<br/><br/>As for the universe ruler realm, even those extremely monstrous existences could break through to the next realm within 100 million years. That was already very terrifying!<br/><br/>Currently, in the entire universe, after cultivating for close to one billion years, the strongest was only at the universe ruler level five.<br/><br/>These two existences were the holy sons and Saintesses of the first forbidden land and the second forbidden land.<br/><br/>They relied on the strongest magic techniques of the cultivators under the strongest background in the universe and controlled the strongest resources.<br/><br/>Under such circumstances, they also used close to one billion years!<br/><br/>As for whether they wanted to continue improving, the speed was even slower.<br/><br/>However, with the power of the unfettered forbidden land and flowing water forbidden land, this saint child and Saintess were enough to cultivate to the peak of the universe ruler realm.<br/><br/>After all, these two forbidden lands had heavenly fate.<br/><br/>As for the other Saint Child Forbidden Lands and sacred academies, they didn’t have such powerful Saint Children and Saintesses!<br/><br/>“HMM, let’s go out after six million years. I will be in closed-door cultivation for six million years to improve myself! ”<br/><br/>Wang Xian said to long yinyin.<br/><br/>“Alright. Six million years later, we will go out to train. By then, I will be able to cultivate to the peak of a universe Knight. ”<br/><br/>Long yinyin nodded.<br/><br/>Wang Xian nodded with a smile.<br/><br/>After chatting with long yinyin for a while, Wang Xian began to cultivate in closed-door cultivation.<br/><br/>Time passed quickly.<br/><br/>Wang Xian was prepared to achieve another breakthrough in his strength during these six million years. Six million years was not short.<br/><br/>It should be enough!<br/><br/>A few million years in the universe was not long nor short. However, to the experts in the universe, it was just the time for closed-door cultivation.<br/><br/>Buzz! Buzz! Buzz<br/><br/>In less than six million years, Wang Xian’s body trembled and a burst of space energy erupted from his body.<br/><br/>Feeling the strength in his body, a smile appeared on his face!<br/><br/>He had made a breakthrough!<br/><br/>It took him more than five million years to complete the breakthrough!<br/><br/>The third level of the universe dominator.<br/><br/>“The next breakthrough will probably take tens of millions of years! ”<br/><br/>After Wang Xian made the breakthrough, he opened his eyes to feel it.<br/><br/>It would probably take at least tens of millions of years to make another breakthrough.<br/><br/>This was under the condition of abundant resources.<br/><br/>It would be extremely difficult for him to advance step by step after reaching the realm of the ruler of the universe.<br/><br/>This was the first time that Wang Xian experienced the difficulty of increasing his strength.<br/><br/>It was unlike the past, where he could make a breakthrough directly as long as he had sufficient resources.<br/><br/>He shook his head and calculated that there were still about 500,000 years left until six million years.<br/><br/>His mind stirred.<br/><br/>In the Void Dragon Forbidden Ground, Wang Xian opened his eyes.<br/><br/>While he was in seclusion, Wang Xian’s real body had been helping him to comprehend the power of space and think of ways to break the shackles of space!<br/><br/>It could be said that he was fully devoted!<br/><br/>Buzz<br/><br/>He moved his hand and took out a communication device. He sent a message to Ao Jian!<br/><br/>At the same time, he checked some of the messages in the communication device.<br/><br/>The communication device created in the undeserved forbidden ground was the largest communication device in the entire sword and magic universe.<br/><br/>It was also a universal communication device.<br/><br/>The other Forbidden Holy Lands and sacred academies, even if they had their own communication devices, most of the information and things they shared were made in the undeserved forbidden land.<br/><br/>The current young generation of the sword and magic universe was still very lively.<br/><br/>One by one, young geniuses rose up against the Heavens!<br/><br/>He looked at the ranking of the holy sons and found that he was already in the eighth place!<br/><br/>A Heaven’s pride disciple from a Holy Land suddenly went against the heavens.<br/><br/>He defeated a group of Holy Sons and Holy Virgins.<br/><br/>It could be said that he was an extremely huge dark horse.<br/><br/>This dark horse was far darker than Wang Xian!<br/><br/>Of course, currently, the biggest dark horse was still ao Jian.<br/><br/>Ao Jian was ranked third.<br/><br/>This was because he defeated the Holy Virgins from the undeserved forbidden ground, a terrifying existence ranked third.<br/><br/>The unfettered forbidden ground was the most powerful force in the entire universe.<br/><br/>Currently, the person ranked first was also the holy son of the unfettered forbidden ground.<br/><br/>Apart from these, Wang Xian also discovered that the entire ranking had undergone a huge change.<br/><br/>Half of the top 50 were occupied by the holy sons and Saintesses of the top 10 holy grounds, as well as the heaven’s favored sons and Saintesses of the Holy Academy.<br/><br/>This was the difference in resources.<br/><br/>Even though the top 10 forces couldn’t become sacred sons and daughters, it didn’t mean that they weren’t a match for the sacred sons and daughters of other forbidden grounds.<br/><br/>A powerful force was ultimately a powerful force!<br/><br/>“Weng Weng! ”<br/><br/>At this moment, ao Jian replied.<br/><br/>Ao Jian had gone to the cosmic ruins. According to what he said, this cosmic ruins was an incomparably huge battlefield.<br/><br/>The energy there was chaotic. In some places, even the ruler of the universe could be destroyed.<br/><br/>The energy was chaotic. The entire sword and magic universe had explored for more than 20 billion years, but they still hadn’t finished exploring!<br/><br/>There were still many treasures there.<br/><br/>The most important reason was that there was the power of space.<br/><br/>With the power of space, many places in the ruins of the universe were constantly changing.<br/><br/>This was also the reason why they had not finished exploring.<br/><br/>Ao Jian was not the only one there. He had brought many subordinates with him.<br/><br/>Among the dragon guards, there were still a few who had reached level four of the universe overlord!<br/><br/>The rest had all reached level three of the universe overlord!<br/><br/>After Wang Xian replied to Ao Jian’s message, he was deep in thought!<br/><br/>“This time, I’ll head to the ruins of the universe to see if I can obtain any opportunities and treasures. If I can obtain treasures and improve my main body, that would be great!”<br/><br/>Wang Xian thought to himself.<br/><br/>In the next few hundred thousand years, Wang Xian started to practice his swordsmanship.<br/><br/>“Brother Wang Xian! ”<br/><br/>The agreed time arrived very quickly. The sound of a dragon’s roar could be heard from outside.<br/><br/>Wang Xian opened his eyes. His body moved and he teleported outside immediately!<br/><br/>“Did you make a breakthrough?”<br/><br/>Wang Xian looked at her and asked.<br/><br/>“Yes, yes, I made a breakthrough. It has been a long time since I made a breakthrough. I have already told father and grandfather about us going out for training. They have also given us permission to go out. ”<br/><br/>Long Yin said to Wang Xian with a smile on his face.<br/><br/>A look of anticipation appeared on his face. Speaking of which, other than going to the center of the forbidden land once during a grand ceremony, we’ve never been there again.. For this trip, are we going to the ruins of the universe or the abyss of Magical Beasts?”\t\t\t\t\t\t</div>", "images": {}, "success": true}