{"id": 989, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073878.html", "title": "Chapter 3991 - Chapter 3991: The Bones Of The 3990 Experts, War Machines", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3991 - Chapter 3991: The Bones Of The 3990 Experts, War Machines</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3991: The bones of the 3990 experts, war machines<br/><br/>Translator: 549690339<br/><br/>“What a terrifying corpse. Even a giant beast of this level can fall. This war is really unimaginable! ”<br/><br/>“Just the pressure of this corpse makes me tremble. Is this… The Battle of the Apocalypse really that terrifying?”<br/><br/>“Huff Huff, there are still a few billion years until the apocalypse. I wonder what will happen! ”<br/><br/>All the powerful disciples of the Dragon Roar forbidden ground saw this scene and their faces were filled with shock.<br/><br/>Just a single corpse was enough to make them shiver.<br/><br/>Then how terrifying would this war be!<br/><br/>“Everyone, this is the very center of the universe ruins. This space is very large, and the energy within is also very abundant, especially beside the corpses of some powerful warriors. ”<br/><br/>“Also, some places here are very dangerous. Be careful, life and death are determined by fate and wealth are determined by heaven! ”<br/><br/>The barbarian saint of the undeserved forbidden land said lightly, and his voice reached everyone’s ears.<br/><br/>“Disciples of the undeserved forbidden land, follow me! ”<br/><br/>The barbarian saint shouted and led the disciples of the undeserved forbidden land in a direction.<br/><br/>“Disciples of the Flowing Water Forbidden Land, follow me! ”<br/><br/>The flowing moon Saintess of the flowing water forbidden land also shouted softly and flew in a direction.<br/><br/>Clearly, they had their own goals!<br/><br/>The powerhouses of the two forbidden lands had been here before, so they were very familiar with this place!<br/><br/>“Let’s go and take a look at the front! ”<br/><br/>Wang Xian opened his mouth and said. A force of space enveloped all the disciples of the Dragon Roar Forbidden Land.<br/><br/>Buzz<br/><br/>He led the group of disciples and flew rapidly in a certain direction.<br/><br/>The deeper they entered, the more abundant the energy became.<br/><br/>Wang Xian watched as his eyes sparkled!<br/><br/>As they continued flying forward, a glowing corpse floated in the air.<br/><br/>This corpse looked like a human. It was very small, but it contained an oppressive aura. It was still terrifying.<br/><br/>This was also the skeleton of a master at the peak of the universe.<br/><br/>They continued to fly deeper and deeper. All kinds of corpses were floating in the air!<br/><br/>When Wang Xian flew for more than ten minutes, a huge building appeared in his line of sight.<br/><br/>“Brother Wang Xian, what is that thing? It’s so huge. It looks like a war machine! ”<br/><br/>Long Yinhao looked at the strange building in front of him.<br/><br/>The building was filled with holes. It was obvious that they had gone through a terrifying war.<br/><br/>However, there were powerful formations on the building.<br/><br/>This formation was similar to a wizard’s formation, but it was also similar to a magic formation!<br/><br/>The entire building was covered by a messy formation. No one knew if they could enter it!<br/><br/>(‘I don’t know. It might be a war treasure from some universe. This space is huge. It seems like we need to explore it ourselves! ”<br/><br/>Wang Xian hesitated for a moment and looked at the group of disciples from the Dragon Roar Forbidden Ground behind him!<br/><br/>“Yes, brother Wang Xian is right. Everyone has their own opportunities. Look at the surrounding areas. Even the disciples from the undeserved forbidden ground and flowing water forbidden ground have scattered. ”<br/><br/>“In this space, we rely on strength but also on luck. If we are careful, our lives will not be in danger. I think we can split up to search for information and cultivate. ”<br/><br/>“We can use the communicator to communicate in Here! ” Long Yin hesitated for a moment before speaking up!<br/><br/>(‘I need to separate from you guys and investigate this place! ”<br/><br/>Wang Xian didn’t hide anything and said, “You guys can form a team. Since the unfettered forbidden land and flowing water forbidden land have announced that you are not allowed to fight, as long as you don’t enter a dangerous place, your lives won’t be in danger. ”<br/><br/>“The energy density here is comparable to that of a treasured land. You can also cultivate here and improve before exploring. It’s up to all of you. ” He continued.<br/><br/>“Alright, sage Wang Xian. Our strength is very weak and we can’t hold you back. You can go and look for opportunities. Perhaps, our dragon roar forbidden land will give birth to a great powerhouse in the future! ”<br/><br/>A disciple of the dragon roar forbidden ground said with a smile.<br/><br/>The group of disciples didn ‘t have any objections to Wang Xian’s request to explore the place himself.<br/><br/>It was already Wang Xian’s credit that they could enter this place.<br/><br/>The sage Wang Xian had already given them a huge opportunity.<br/><br/>They couldn’t be more grateful!<br/><br/>“Hehe, alright. Cultivate well. Your strength is still too weak. It’s difficult to compete with the disciples of the other forbidden grounds for treasures. Let’s take a stroll and try our luck. If there’s any danger, it’s best if we don’t enter recklessly. The energy here is extremely terrifying. With just a casual shockwave, all of you will be reduced to Ashes!”<br/><br/>Wang Xian reminded them again. His gaze landed on long yinyin and long yinhao. “Contact me directly when you need me. Currently, I’m not a match for the holy son of the undeserved forbidden ground and the holy maiden of the flowing water forbidden ground. ”<br/><br/>“Alright, brother Wang Xian. You have to be careful too!” “I’ll be walking around with my sister later. Brother, be careful! ”<br/><br/>Long yinyin and long Yinhao said!<br/><br/>Wang Xian nodded and left immediately!<br/><br/>“Wow, our sage Wang Xian was so confident just now. Among all the Saints, saintesses, and Heaven’s favorites, only the unfettered forbidden ground’s sage and the flowing water forbidden ground’s Saintess are not his match. Doesn’t this mean that our sage Wang Xian can be ranked third?”<br/><br/>“That’s definitely true. Our sage Wang Xian is very low-key, but he is also very confident in his own strength. He is too cool!”<br/><br/>The group of disciples from the Dragon Roar forbidden ground exclaimed in awe.<br/><br/>“Alright, let’s take a look around. This place is probably not too big. After taking a look around, those who want to cultivate and those who want to look for opportunities will look for opportunities! ”<br/><br/>Long Yin watched Wang Xian’s figure disappear and said with a smile!<br/><br/>At the same time, Wang Xian had already arrived beside Ao Jian and the rest!<br/><br/>Ao Jian and his men were floating in the void and standing respectfully beside Wang Xian!<br/><br/>“Ao Jian, bring them around here and see if they can obtain any opportunities. Contact me if anything happens! ” Wang Xian spoke to Ao jian.<br/><br/>“It’s the Dragon King! ” Ao jian nodded. “Alright, let’s split up! ”<br/><br/>Wang Xian said.<br/><br/>He was prepared to act alone to see if he could find any treasures.<br/><br/>There were the corpses of experts and terrifying and powerful war machines here.<br/><br/>The space here was not very stable either.<br/><br/>Wang Xian sensed for a moment. He felt that the space here could only support the level six realm of the universe’s ruler at most.<br/><br/>In other words, once an expert at the level seven realm of the ruler entered this place, this space might collapse.<br/><br/>No one knew what would happen if it collapsed.<br/><br/>However, it was clear that it was extremely dangerous.<br/><br/>“No wonder this treasured land was taken out for all the heaven’s chosen disciples to enter. There must be a reason.”<br/><br/>Wang Xian mumbled.<br/><br/>Fortunately, Wang Xian’s original body didn’t enter this time.<br/><br/>Wang Xian was worried that his original body would be discovered, so he didn’t merge with his body!<br/><br/>This decision was very correct.<br/><br/>In this space, even if his main body came, he could not appear. Furthermore, he had to suppress the energy of his main body..\t\t\t\t\t\t</div>", "images": {}, "success": true}