{"id": 984, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073868.html", "title": "Chapter 3986 - Chapter 3986: 3985 Was A Sudden Opportunity", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3986 - Chapter 3986: 3985 Was A Sudden Opportunity</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3986: 3985 was a sudden opportunity<br/><br/>Translator: 549690339<br/><br/>“Let’s go to the ruins of the Universe! ”<br/><br/>Wang Xian spoke to long yinyin!<br/><br/>This was something that he had already decided on!<br/><br/>“Alright, I have no objections! ”<br/><br/>Long yinyin nodded. “When the time comes, my younger brother will be coming with us. There will only be the three of us for this experiential learning. ”<br/><br/>“No problem. ”<br/><br/>Wang Xian nodded his head.<br/><br/>“Yes, yes. Before we leave, my grandfather told us to look for him!”<br/><br/>Long yinyin nodded her head. “Let’s go. We’ll go over first. ”<br/><br/>Wang Xian nodded his head. The two of them moved and immediately flew outside.<br/><br/>“Long Yinhao, come out! ”<br/><br/>When they arrived outside, long yinyin called out.<br/><br/>“Sister, I’m Coming, I’m Coming, brother Wang Xian!”<br/><br/>Long Yinhao immediately flew over from a corner. His face was filled with excitement!<br/><br/>“Let’s go to Grandpa’s Place! ”<br/><br/>Long yinyin said to him.<br/><br/>“Hehe, there’s no problem. We can finally get out. Hahaha, we can finally get<br/><br/>Out!<br/><br/>Long Yinhao’s face was filled with excitement as he shouted excitedly.<br/><br/>Wang Xian looked at him and smiled.<br/><br/>At the side, Long yinyin revealed a speechless expression.<br/><br/>Grandpa! ”<br/><br/>The three of them flew towards the sky peak. Before they arrived at long<br/><br/>Yinhao, they shouted loudly.<br/><br/>“Hehe, Little Xian, yinyin, Yinhao, you’re here. There’s a change of plans. This time, your plans need to be changed!”<br/><br/>The voice of the third elder could be heard from the palace above.<br/><br/>“Huh?”<br/><br/>Wang Xian and the rest were slightly stunned when they heard that. They immediately flew into the palace.<br/><br/>When they flew over, they realized that there were quite a number of elders inside.<br/><br/>“Greetings, Elders! ”<br/><br/>Wang Xian and the rest bowed to the elders!<br/><br/>“Hehe, just take a seat. It’s fortunate that you guys didn’t leave. There’s something that happened. This time, you guys will be delayed for your training. No, it should be that you guys have a better training ground! ”<br/><br/>The third elder looked at them and said.<br/><br/>“HM? What’s wrong, Grandpa? What’s the situation?”<br/><br/>Long Yinhao asked with surprise, “Grandpa, I’ve already reached the Pinnacle<br/><br/>Universe Knight realm. Why Can’t I go out again?”<br/><br/>“Hehe, it’s not that I can’t go out, but there’s a good thing. It’s a huge opportunity for you! ”<br/><br/>The third elder smiled, he said, “This time, the top ten forbidden lands, led by the undeserved forbidden land and flowing water forbidden land, are preparing to open a treasure land and send the current generation of holy sons and<br/><br/>Saintesses of a forbidden land, as well as those heaven’s favorites, to a place! ”<br/><br/>“Oh? Grandpa, there’s such a good thing?”<br/><br/>Long Yin was slightly stunned and could not help but ask.<br/><br/>“In order to deal with the calamity, a group of powerful forbidden lands are willing to take out some things. Of course, in fact, all of the Holy Lands, Forbidden Lands, and sacred academies know that the reason why they are willing to open up that treasured land is because they have explored the forbidden lands in the past 20 billion years and did not obtain any great opportunities. That’s why they are willing to open it up to all the heaven’s favorites this time!”<br/><br/>The third elder asked.<br/><br/>“Third elder, what is that place?”<br/><br/>Wang Xian raised his eyebrows slightly when he heard that. He could not help but ask.<br/><br/>“According to rumors, that place is the center of the universe ruins. It is the battlefield of the heaven-origin creation-level existences. We have also heard some rumors that it is the battlefield where our universe’s heaven-origin creation-level existences are fighting against the heaven-origin creation-level powerhouses from other universes. ”<br/><br/>“Although there are no heaven origin creation level experts that have fallen there, many, many peak universe masters have fallen.”<br/><br/>The third elder replied.<br/><br/>However, he wasn’t sure what he said, and he had only heard rumors.<br/><br/>Perhaps only those powerful forbidden grounds and sacred academies would know the real reason.<br/><br/>“Now, with the undeserved forbidden ground flowing water forbidden ground as the leader, they have given all the sacred grounds and sacred academies a benefit. That is, all the sacred grounds’sacred sons and Saintesses can enter.” “In addition, if any sacred lands ‘sacred sons and daughters are ranked in the top ten on the universe’s prodigy roll, they can bring an additional twenty disciples. If they can be ranked in the top twenty, they can bring ten disciples! ”<br/><br/>“This time, because of you, Little Xian, our dragon roar forbidden land might benefit from it. We can send twenty disciples to enter! ”<br/><br/>The first elder of the Dragon Roar Forbidden Land said from the side! His face showed a hint of excitement.<br/><br/>Once they were able to enter and cultivate, it would be comparable to cultivating in the core of the Dragon Roar Forbidden Land!<br/><br/>And the core of the dragon roar forbidden land couldn’t possibly be given to a universe knight disciple to cultivate.<br/><br/>If they were able to enter and cultivate, doing nothing, just cultivating would be a vast opportunity!<br/><br/>In particular, the time they could enter this place to cultivate could be very, very long!<br/><br/>“There’s such a good thing?”<br/><br/>Long Yinhao’s eyes shone with excitement.<br/><br/>“Yes, it’s also your good luck. It’s also our dragon Roar Forbidden Land’s good luck. Hehe, if nothing goes wrong, with little immortal’s strength, it won’t be too much of a problem to stand firmly in the top ten of the Prodigy roll. When the time comes, our dragon roar forbidden land will be able to send twenty people with the addition of the three of you. ”<br/><br/>The elder next to him said with a smile.<br/><br/>“In addition, in a while, I’ll lead you to the center of the continent, Tian Yuan city. Right now, the exact number of spots hasn’t been determined, and the ranking of the Prodigy roll hasn’t been confirmed yet. ”<br/><br/>“Next, there should be another round of competition for the Prodigy roll. This spot is very important to many forbidden holy lands! ”<br/><br/>The third elder continued to speak to them.<br/><br/>“Grandfather, then this time, many holy sons, saintesses, and prodigies will be able to enter that place! ”<br/><br/>Long Yinhao said, “Moreover, those powerful forbidden places and sacred academies should have many more spots than us! ”<br/><br/>“Of course. For example, the undeserved forbidden land and flowing water forbidden land, they should send hundreds of disciples to enter. It’s already good enough for two of us to go to these forbidden places. ”<br/><br/>“Only our dragon roar forbidden land and void Dragon Forbidden Land are lucky enough to have a dark horse!”<br/><br/>Third Elder replied with a smile.<br/><br/>“That means that there might be thousands of heaven’s favorites who can enter. Hehe, I wonder how many places I can rank among those heaven’s favorites. ”<br/><br/>Long Yinhao said with a smile, his eyes full of fighting spirit.<br/><br/>“Don’t talk so much nonsense. Get Ready. We’re going to Tian Yuan City.”<br/><br/>The third elder said, “I’m afraid that you will have to stay outside for a long time when we go out this time. All the necessary preparations have been made. I will also prepare some things for you here. ”<br/><br/>“It’s Grandpa! ”<br/><br/>“It’s the third elder! ”<br/><br/>Wang Xian and the rest nodded their heads. After saying a few words, they left.<br/><br/>He came to the place where he lived and his eyes flickered slightly.<br/><br/>Wang Xian did not expect that there would be such benefits. He could enter the core of the universe ruins directly..\t\t\t\t\t\t</div>", "images": {}, "success": true}