{"id": 980, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073860.html", "title": "Chapter 3982 - Chapter 3982: 3,981 Insta-Kills, Ranking Up! Go", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3982 - Chapter 3982: 3,981 Insta-Kills, Ranking Up! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3982: 3,981 insta-kills, ranking up! Go<br/><br/>Translator: 549690339<br/><br/>“You are Wang Xian?”<br/><br/>When Wang Xian and the rest arrived here.<br/><br/>In the middle of the front, the holy son of the Fa Yi Saint Academy landed on his body.<br/><br/>At the side of him, a young man opened his mouth and asked directly!<br/><br/>“Do you want to challenge me?”<br/><br/>Wang Xian ignored the young man who spoke and landed on the holy son of the Fa Yi Saint Academy.<br/><br/>What a joke.<br/><br/>He was here to challenge him and still wanted to show off?<br/><br/>“I’m not here to challenge you. Pm here to tell the people on the continent that you don’t have the right to stand on top of me! ”<br/><br/>The saint son of the Fa Yi Saint Academy stared at Wang Xian and spoke indifferently!<br/><br/>He was very slow in acting cool!<br/><br/>“Space is the king and you can fight against those who are above your level. However, this also depends on who is above your level. This also depends on who is the one who is fighting against those who are above your level! ”<br/><br/>Beside the Holy Son’s voice from the Fa Yi Saint Academy, the Saintess also spoke indifferently!<br/><br/>“Hehe, if you want to tell the people on the continent that you are stronger than me, you don’t have to rely on your words. You have to rely on your strength! ”<br/><br/>When Wang Xian heard their words, he couldn’t help but laugh. “Hehe, Big Brother is right. Strength is achieved through fists, not words! ”<br/><br/>Long Yinhao, who had heard the news, flew over and said loudly!<br/><br/>“Since that’s the case, don’t waste my time! ”<br/><br/>The holy son of the Fa Yi Saint Academy’s gaze turned cold. He picked up the staff in his hand and slammed it heavily on the ground.<br/><br/>A terrifying power of light landed on the ground. Cracks started to spread under Wang Xian’s feet!<br/><br/>“Yes, we really shouldn’t waste any more time! ”<br/><br/>Wang Xian squinted his eyes slightly when he saw this guy’s pretentious look!<br/><br/>In the next second, more than 90 space swords instantly rose up around him.<br/><br/>Two of them were at the innate treasure level.<br/><br/>The rest were sword 90 sets!<br/><br/>Buzz<br/><br/>The 92 space swords disappeared in an instant and attacked the holy son of the Fa Yi Saint Academy.<br/><br/>The people around him moved and retreated immediately!<br/><br/>At the same time, the dragon roars and dragon roars around Wang Xian also retreated immediately!<br/><br/>The battle started instantly!<br/><br/>“This… The saint son of the Fa Yi Saint Academy actually came to challenge our saint son Wang Xian. Will Saint Son Wang Xian be his opponent?”<br/><br/>“Definitely. In the ranking of Saint Sons and saintesses, our Saint Son Wang<br/><br/>Xian is the tenth existence. The ranking of the saint son of the Fa Yi Saint Academy is behind our Saint Son Wang Xian. The ranking of the undeserved forbidden ground is very accurate!”<br/><br/>“Although the undeserved forbidden ground is prepared, there are also those who are ranked low and those who are ranked high. The saint son of the Fanyi Saint Academy is not simple. I hope that we, Saint Son Wang Xian, will not be careless! ”<br/><br/>“After all, he is ranked fourth in our group of Saint Lands. The strength of the Fanyi Saint Academy is very terrifying. The clothing and weapons of their saint sons and Saintesses are specially made. It is extremely terrifying! ”<br/><br/>In the surrounding area, the strong disciples of the Dragon Roar Sacred Land were discussing in a low voice.<br/><br/>They didn’t have much confidence in this sparring match.<br/><br/>Although Wang Xian was very strong and his ranking was one rank higher than his opponent’s!<br/><br/>However, his opponent was the saint son of the Fanyi Saint Academy after all.<br/><br/>His realm was one level higher than their saint son Wang Xian’s!<br/><br/>It wasn’t certain who would win or lose!<br/><br/>“Hmph, this saint from the Dragon Roar Forbidden Ground is really arrogant.<br/><br/>How dare he be so rude to our saint.”<br/><br/>“This Saint Wang Xian is a little arrogant. However, I don’t think that the saint from Star City will lose. He can fight against someone of a higher realm with his spatial attribute. However, the possibility of him defeating our saint from Star City is very, very small!”<br/><br/>The group of Saint Sons and Saintesses who had retreated to the back, as well as the heaven’s pride disciples from the Fa Yi Saint Academy, spoke up.<br/><br/>They were very confident about this battle.<br/><br/>Moreover, the most controversial person on the entire list of Saint Sons and Saintesses was the saint son of the Dragon Roar Forbidden Land.<br/><br/>This was because the undeserved forbidden land had ranked the saint son of the Dragon Roar forbidden land in tenth place, above the saint son of the Fanyi Sacred Academy, Star City.<br/><br/>This was the most controversial.<br/><br/>Therefore, many people thought that the holy son of Star City should be ranked tenth!<br/><br/>However, no matter how controversial it was, the undeserved forbidden ground did not casually change the ranking of the holy sons and Saintesses!<br/><br/>“HMPH, Holy Light Dharma Body! ”<br/><br/>The holy son of Star City snorted coldly when he saw Wang Xian’s attack.<br/><br/>He waved the huge staff in his hand, and an incomparably huge holy light dharma body enveloped him!<br/><br/>The appearance of the Holy Light Dharma body was the same as his, and he was also holding a huge staff in his hand!<br/><br/>The terrifying power of light shot out in all directions!<br/><br/>In front of him, 92 sharp swords flashed and completely surrounded the star city saint.<br/><br/>However, the Star City Saint remained expressionless!<br/><br/>He pointed the huge staff in his hand at Wang Xian!<br/><br/>A terrifying beam of light shot directly at Wang Xian!<br/><br/>When Wang Xian saw this attack, his figure disappeared immediately!<br/><br/>Buzz! Buzz! Buzz<br/><br/>At the same time, the sharp swords surrounding the holy son of Star City began to fluctuate!<br/><br/>Waves of extremely terrifying spatial swords slashed at him!<br/><br/>“Holy Palm! ”<br/><br/>When the holy son of Star City saw this, his expression didn’t change at all!<br/><br/>He slowly raised his great staff.<br/><br/>The huge holy light dharma body slowly raised his palm.<br/><br/>The palm expanded rapidly and formed a holy palm defense around the Holy Light Dharma body once again!<br/><br/>Boom! Boom! Boom<br/><br/>Boom<br/><br/>Wang Xian’s spatial sword landed on the holy palm and produced an intense rumbling sound.<br/><br/>At the same time, that beam of light power also landed heavily on the spot where Wang Xian was just now!<br/><br/>His attack was blocked by the holy palm.<br/><br/>At the same time, the attack of the Star City’s Saint Son was also dodged by him!<br/><br/>“HMPH, unleash! ”<br/><br/>The Star City’s Saint Son snorted coldly when he saw Wang Xian escaping by teleportation and blocking Wang Xian’s attack!<br/><br/>The Holy Light Dharma body retracted its palm and a terrifying light burst out from the head of the Dharma body.<br/><br/>Countless rays of light shot out in all directions like hair!<br/><br/>This move completely enveloped Wang Xian!<br/><br/>Sky Collapse! ”<br/><br/>Wang Xian’s expression didn’t change at all when he saw his attack.<br/><br/>He teleported above the holy son of Star City and condensed a spatial sword in his hand. He thrust it toward the center!<br/><br/>The 92 sharp swords in the surroundings started to tremble and aimed at the ground.<br/><br/>Boom! Boom! Boom<br/><br/>Following that, the 92 sharp swords grew bigger and stabbed directly into the ground!<br/><br/>They formed a sword shield to defend and absorb the attacks of the Star City’s Saint Son.<br/><br/>Bang! Bang! Bang<br/><br/>Countless beams of holy light landed on the sword shield and were completely blocked!<br/><br/>“Huh?”<br/><br/>The Star City’s saint son frowned slightly when he saw that his attacks were easily blocked.<br/><br/>“Looks like you really have some strength! ”<br/><br/>He snorted coldly.<br/><br/>Wang Xian smiled faintly and said indifferently, “Let’s end this!”<br/><br/>As soon as he finished his sentence, the 92 sharp swords that enveloped the saint of Star City instantly slashed towards this space!<br/><br/>“Sword, world-destroying!”<br/><br/>Numerous sharp swords appeared out of thin air and slashed towards the saint of Star City in the middle.<br/><br/>The terrifying giant sword seemed to cover the entire world from top to bottom!\t\t\t\t\t\t</div>", "images": {}, "success": true}