{"id": 982, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073864.html", "title": "Chapter 3984 - Chapter 3984: 3983 Ao Jian Was Famous, Void Dragon Forbidden Ground!", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3984 - Chapter 3984: 3983 Ao Jian Was Famous, Void Dragon Forbidden Ground!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3984: 3983 ao Jian was famous, Void Dragon Forbidden Ground!<br/><br/>Translator: 549690339<br/><br/>“I really didn ‘t expect that a small dragon roar forbidden ground could produce such a terrifying holy son. It’s really surprising! ”<br/><br/>“I heard that Holy Son joined later. The Dragon Roar Forbidden Ground is only a water-elemental existence with a strength ranking over 90. Their strength isn’t very strong! ”<br/><br/>“This dragon roar forbidden land is so lucky? That Wang Xian must have obtained an extremely powerful opportunity. He might have obtained the sword alms bowl of the powerful spatial swordsman!”<br/><br/>“On our continent, the strongest people who cultivate the space element are all in the space forbidden land. How did that Wang Xian obtain such a powerful sword alms bowl inheritance?”<br/><br/>(‘I don’t know. Everyone knows about it after a battle. If that Wang Xian doesn’t perish in the future, he might become one of the top experts on the continent. After all, the space element is the King! ”<br/><br/>Wang Xian’s fame caused a lot of discussion on the continent.<br/><br/>This also increased the reputation of the dragon roar forbidden ground greatly!<br/><br/>Wang Xian didn’t know about the matters on the continent, and he didn’t care about such matters.<br/><br/>After all, in other universes, Wang Xian was almost standing at the top! At least in the nine-origin universe, the Dragon Palace was one of the top thirteen.<br/><br/>Even if he was forced to leave the nine-origin universe now!<br/><br/>Wang Xian devoted himself to his cultivation.<br/><br/>In the middle, Wang Xian had an lie take out some heart of faith and absorb it!<br/><br/>The heart of faith was extremely beneficial to the breakthrough of one’s realm.<br/><br/>After Wang Xian absorbed some, he could clearly feel that it was indeed of great use!<br/><br/>It could greatly shorten the time for him to break through!<br/><br/>However, it would still take millions of years for him to advance to the third level of the Universe Overlord.<br/><br/>After all, it would also take a long time for him to accumulate the power of space!<br/><br/>Time passed quickly.<br/><br/>Due to the ranking of the holy sons and saintesses, the entire sword and magic continent became lively.<br/><br/>Long Yin would come over from time to time and tell him about the ranking of the holy sons and saintesses, as well as about him.<br/><br/>This allowed Wang Xian to have some understanding of the changes in the entire continent!<br/><br/>“Brother Wang Xian, brother Wang Xian! ”<br/><br/>Four million years later, Wang Xian was cultivating. Long Yinyin ‘s voice rang out. He opened his eyes and revealed a smile.<br/><br/>“What’s wrong? Did something interesting happen again?”<br/><br/>Wang Xian stood up and walked up to her with a smile on his face.<br/><br/>“It’s a big deal. Something big happened not long ago. Do you still know about the forbidden land, the Void Moon? Isn’t it occupied by a force called the Void Dragon Forbidden Land Now?” Long Yin asked.<br/><br/>“Of course I know. Why?”<br/><br/>Wang Xian raised his eyebrows and asked!<br/><br/>“A terrifying saint appeared in the Void Forbidden Land. Not long ago, he went to challenge the third-ranked Saintess of the undeserved forbidden land. Do you know the result? “The Saintess of the undeserved forbidden ground was defeated by him! ”<br/><br/>Long Yin’s face was filled with shock as he spoke.<br/><br/>“Oh, is that so?”<br/><br/>Wang Xian raised his eyebrows and revealed a faint smile. “The Void Dragon<br/><br/>Forbidden Ground is very powerful. It actually has such a powerful Holy Son! ”<br/><br/>“That’s right. All the strong disciples in the entire continent didn’t expect that.<br/><br/>You must know that they have never heard of this void Dragon Forbidden Ground before. Even when they occupied the Void Moon previously, they were still unknown in the continent. They didn’t even have a ranking!”<br/><br/>“However, the battle this time has shocked everyone. To be able to nurture such a terrifying force, it’s definitely not simple. Of course, there’s another possibility. This holy son was nurtured by the Void Dragon Forbidden Ground with all its might! ”<br/><br/>Long Yin Yin still spoke with surprise. “If the challenge is successful, so be it.”<br/><br/>Wang Xian nodded and didn’t make a fuss.<br/><br/>The Dragon Guards of the Dragon Palace might have been very weak in the past. In fact, they were considered the weakest dragon species in the Dragon Palace.<br/><br/>However, it was different now. With the Heaven’s origin sword technique, their strength was already extremely terrifying!<br/><br/>The dragon guards who had the Heaven’s origin sword technique at the same level were basically invincible.<br/><br/>Of course, if the other party also had a cultivation manual of the same level, they would be able to contend against them.<br/><br/>However, it was hard to say if such sword techniques and magic existed in the sword and Magic Universe.<br/><br/>After all, a sword technique of this level was comparable to a heavenly yuan creation realm treasure.<br/><br/>A heavenly Yuan creation realm treasure had a terrifying effect.<br/><br/>As for the power of the Heavenly Yuan sword technique, it could allow one to cultivate to the heavenly yuan creation realm.<br/><br/>Of course, there was a limit. If an expert used this sword technique to cultivate to the heavenly yuan creation realm, the others who cultivated this sword technique would not be able to cultivate to the heavenly yuan creation realm for their entire lives!<br/><br/>This was an extremely terrifying shackle!<br/><br/>The Tianyuan sword technique could not mass produce the Tianyuan blessed realm existences.<br/><br/>“Brother Wang Xian, aren’t you surprised? His sudden rise caused your ranking to drop by one place. Now, you are ranked seventh. ”<br/><br/>“Now, the Saint Sons and saintesses ranking is very exciting. Those heaven’s favored sons from the powerful forbidden grounds have also made their moves. Many saint sons and saintesses have been kicked off the ranking! ” Long yinyin continued.<br/><br/>“It doesn’t matter how high my ranking is. These are all just empty names. Oh right, what’s the situation with this heaven’s favored son making his move?” Wang Xian asked.<br/><br/>“It’s like this. The strength of some holy sons and Saintesses of some holy grounds might not be as strong as the disciples of some holy grounds that are not holy sons and saintesses. For example, the holy sons and Saintesses of the forbidden grounds that are ranked twenty might not be as strong as some heaven’s favored sons and Saintesses of the undeserved forbidden grounds that are only second to holy sons and Saintesses! ”<br/><br/>“Now, some of the heaven’s favored sons and saintesses who are second only to holy sons and Saintesses in the powerful forbidden land of the Holy Land and the Holy Academy have already made their moves. Many holy sons and saintesses have been defeated by them! ”<br/><br/>Long Yin opened his mouth, he continued, “Like my brother and I, we might be very strong and talented in the forbidden land of the Void Dragon Forbidden<br/><br/>Land, but we are not as strong as some of their heaven’s favored sons and Saintesses in the Forbidden Land of the Holy Land and the Holy Academy which are ranked higher.”<br/><br/>“Now that I look at it, Ao Jian, the holy son of the Void Dragon Forbidden Land, is indeed terrifying. Even the Saintess of the undeserved forbidden land is no match for him. After all, she’s the Saintess of the undeserved forbidden land. This SAINTESS can even defeat a holy son of the same level of the spatial forbidden land. ”<br/><br/>As she spoke, she sighed slightly. Obviously, she was very shocked by Ao Jian, the holy son of the undeserved forbidden land, who had appeared out of nowhere.<br/><br/>“Hehe, it seems that the Saint Son and Saintess list has changed! ”<br/><br/>Wang Xian smiled and said.<br/><br/>“Yes, it has changed. In the past, only the saint sons and Saintesses could participate. Now, those heaven’s favorites can also participate. Moreover, some experts from the undeserved forbidden ground said that the saint sons and saintesses list might be renamed as the Sword and Magic Universe’s Heaven’s favorites list. ”<br/><br/>Long Yin Yin said, “In addition, this kind of ranking will continue in the future.. It seems that there will be some benefits later on! “\t\t\t\t\t\t</div>", "images": {}, "success": true}