{"id": 988, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073876.html", "title": "Chapter 3990 - Chapter 3990: 3989 Entered", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3990 - Chapter 3990: 3989 Entered</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3990: 3989 entered<br/><br/>Translator: 549690339<br/><br/>“The second treasure land is the center of the universe ruins, the center of a battlefield. During the last great war, many top-tier great beings were killed there, and there were dozens of Pinnacle Universe Masters! ”<br/><br/>“The bodies of great beings are floating there, and the valuables of great beings might be there, as well as the special items of Great Beings. ”<br/><br/>“Of course, none of this is easy to obtain. It all depends on one’s luck, one’s ability, and one’s Luck! ”<br/><br/>“However, even if you don’t obtain any treasures, cultivating there will bring you great benefits. Cultivating there won’t be any weaker than cultivating in the sacred land and the Sacred Academy! ”<br/><br/>The experts from the unexpected forbidden land continued their introductions.<br/><br/>In the surrounding areas, all the experts from the sacred land revealed excited expressions.<br/><br/>“Also, I’ll remind all of you to not think about treasures and resources after entering. Ordinary places aren’t dangerous there, but the things left behind by the experts’corpses contain terrifying power. ”<br/><br/>“For you, one wrong move and you ‘Il lose your lives!”<br/><br/>At the flowing water forbidden ground, an old woman added after the experts from the undeserved forbidden ground finished speaking.<br/><br/>“That’s right. Treasures aren’t that easy to obtain. If they were, we would have already taken them all. All disciples from the sacred land, Forbidden Ground, and sacred academy, come to Tianyuan Peak. Don’t follow the other experts.” “Let me and the great elder from the flowing water forbidden land bring them to a place and send them there! ”<br/><br/>The powerhouse from the undeserved forbidden land nodded.<br/><br/>“Xiao Xian, you will lead the team from the Dragon Roar Forbidden Land. Let’s go. ”<br/><br/>When the Great Elder from the Dragon Roar forbidden land heard the voice of the powerhouse from the undeserved forbidden land, he immediately instructed Wang Xian and the rest, “All of your disciples, remember this. Listen to the orders of your saint son Wang Xian. Do you understand?”<br/><br/>“Yes, Great Elder! ”<br/><br/>The group of twenty disciples replied excitedly.<br/><br/>This time, they were lucky enough to be able to enter the ruins of the universe. This was already a great opportunity for them!<br/><br/>Among the disciples present, they were definitely the weakest and the weakest in terms of talent!<br/><br/>Once they entered, they would naturally hug the thighs of the sage Wang Xian.<br/><br/>“Alright, let’s Go! ”<br/><br/>Wang Xian nodded his head and flew forward.<br/><br/>Wang Xian brought along the group of disciples from the Dragon Roar Forbidden Ground.<br/><br/>The rest of the holy sons and saintesses from the sacred grounds and the Sacred Academy also flew over!<br/><br/>However, the ones with the most numbers were the undeserved forbidden ground and flowing water forbidden ground.<br/><br/>The total number of disciples who flew over from the two forbidden grounds was around 1,000.<br/><br/>That was about 500 disciples per family.<br/><br/>There were only around 100 disciples in the space forbidden area, which was a lot less.<br/><br/>The other top 10 sacred lands and sacred academies only had around 100 spots.<br/><br/>From this, one could see the strength and status of the undeserved forbidden area and flowing water forbidden area!<br/><br/>All the forces, holy sons, saintesses, and prodigies only had around 2,000 spots combined.<br/><br/>“Alright, let’s Go! ”<br/><br/>The expert from the undeserved forbidden ground waved his arm and a wave of energy enveloped them.<br/><br/>In the next second, everyone felt the scene before their eyes changing!<br/><br/>Wang Xian scanned his surroundings.<br/><br/>The space around them was very strange. It was as if they were in a broken glass.<br/><br/>The space around them was broken. If they entered a random space, they might not know where they went.<br/><br/>It was also very difficult to return here.<br/><br/>“I will open the passage into the universe ruins. After you enter, remember not to kill each other. No Barbarians, Liu Yue, you will maintain order. Those who kill each other, you can deal with them yourselves! ”<br/><br/>The experts from the unexpected forbidden land spoke, and their gazes fell on the saint son and the saintess from the flowing water forbidden land.<br/><br/>The two of them were the only ones who had reached the universe ruler level five.<br/><br/>“It’s the first elder! ”<br/><br/>“It’s the first elder! ”<br/><br/>The barbarian sacred son and the flowing moon sacred lady immediately cupped their hands.<br/><br/>The great being from the unexpected forbidden land nodded and looked at the old woman from the flowing water forbidden land.<br/><br/>The old woman waved her arm, and a glass-like object appeared.<br/><br/>The old man also threw out the same object.<br/><br/>The two objects merged together.<br/><br/>A passage slowly appeared in front of all the Saint Sons and Saintesses!<br/><br/>“Enter the passage. This passage can be opened once every 100 million years. The last time it was opened was a billion years ago. This passage is enough for you to cultivate for a long time. As for when you will come out, you will know!” The old woman from the flowing water forbidden ground said slowly, “Enter! ”<br/><br/>The group of holy sons and Saintesses immediately responded. Under the lead of the disciples from the undeserved forbidden ground and flowing water forbidden ground, the rest of the holy sons and Saintesses and Heaven’s favorites also entered directly.<br/><br/>Wang Xian led the group of disciples from the Dragon Roar Forbidden Ground and entered as well.<br/><br/>On the side, Ao Jian led 20 subordinates and followed by the side.<br/><br/>Wang Xian swept his gaze over and revealed a faint smile.<br/><br/>After entering this place, he might be able to let an lie in in the future. By then, there might be unexpected gains!<br/><br/>Furthermore, according to what they said, dozens of experts at the peak of the Universe Dominator realm had fallen at the center of this place.<br/><br/>In that case, there must be treasures here!<br/><br/>When Wang Xian and the rest stepped into the passageway, they immediately felt the world spinning!<br/><br/>“Oh my God! ”<br/><br/>“Hiss, what’s that in front of us? Is it a corpse? What a terrifying and huge corpse! ”<br/><br/>“What kind of creature is this? It’s so huge. Even if it’s just a skeleton, its power is extremely terrifying! ”<br/><br/>When Wang Xian entered the tunnel, he heard a cry of surprise. Wang Xian’s eyes flickered slightly as he immediately looked ahead. “Wow, my God, what kind of Behemoth is this?”<br/><br/>Long Yin, who was at the side, was also looking ahead in shock.<br/><br/>It was the skeleton of an incomparably huge behemoth.<br/><br/>When Wang Xian saw this skeleton, he immediately recognized it.<br/><br/>It was the skeleton of a space behemoth from the starry universe. This was the corpse of a space behemoth that was at the peak of the Universe Overlord Realm!<br/><br/>The corpse contained a special elemental energy that filled the entire space!<br/><br/>“This is the corpse of a space beast from the starry universe. According to our records, the starry universe is a very powerful universe. Terrifying Space Beasts were born there, but these space beasts don’t have intelligence. Some of them will be tamed and join the Calamity Battlefield! ”<br/><br/>The voice of a disciple from the unfettered forbidden land came from the front.<br/><br/>It was obvious that the undeserved forbidden ground had a lot of records about this place.<br/><br/>In fact, the Heavenly Yuan destiny realm experts from their forbidden ground had even participated in this battle.<br/><br/>“A cosmic beast? This body is too big! ”<br/><br/>The disciples from the other forbidden grounds and sacred academies heard this and sized it up with slight astonishment..\t\t\t\t\t\t</div>", "images": {}, "success": true}