{"id": 981, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073862.html", "title": "Chapter 3983 - Chapter 3983: 3,982 Insta-Kills, Ranking Up! Down", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3983 - Chapter 3983: 3,982 Insta-Kills, Ranking Up! Down</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3983: 3,982 insta-kills, ranking up! Down<br/><br/>Translator: 549690339<br/><br/>Sword!<br/><br/>World-destroying sword!<br/><br/>The terrifying spatial sword directly sliced through the entire holy light avatar!<br/><br/>The entire space enveloped him.<br/><br/>The terrifying power caused the face of the holy son of the Fanyi Sacred Academy, who was in the center, to change drastically!<br/><br/>He looked at the world-destroying giant swords with a face full of shock!<br/><br/>He raised the great staff in his hand.<br/><br/>The Holy Light Avatar raised his gigantic palm once again.<br/><br/>That gigantic palm almost covered the entire body of the Holy Light Avatar.<br/><br/>Crack! Crack! Crack<br/><br/>Bang! Bang! Bang<br/><br/>However, the Holy Light Avatar only lasted for a few seconds before it began to collapse rapidly!<br/><br/>The terrifying spatial sword was still slashing at it!<br/><br/>Sensing this terrifying attack, the holy son of the Fa Yi Saint Academy had a drastic change in expression. He could not help but let out a terrified cry!<br/><br/>Buzz<br/><br/>While he was filled with fear, Wang Xian waved his arm.<br/><br/>The gigantic destructive swords began to disappear rapidly one by one!<br/><br/>Wang Xian waved his arm and numerous sharp swords flew towards him rapidly.<br/><br/>In the middle, the saint son of the Fa Yi Saint Academy stood there with a pale face.<br/><br/>His face was filled with fear and lingering fear!<br/><br/>The sudden scene and Wang Xian’s sudden killing move caused everyone to be unable to react in time!<br/><br/>By the time they reacted…<br/><br/>The battle had ended.<br/><br/>“How… How is this possible? How could he unleash such a terrifying attack in an instant?”<br/><br/>“What a terrifying attack! Our Star City’s holy son couldn’t even defend against it! ”<br/><br/>“It’s too fast! Too Fast! This battle is too fast! In just three moves, that saint son of sage Wang Xian defeated the saint son of Star City in just three moves! How is this possible?”<br/><br/>“So Strong! So strong! Our saint son of sage Wang Xian is really strong! He defeated his opponent in just three moves! It feels like they are not on the same level at all! ”<br/><br/>“Hiss! Saint son of sage Wang Xian is so powerful! Just now, I was worried that saint son of sage Wang Xian would not be a match for the Saint Son of Star City. Now, it seems that he defeated him easily. Our saint son of sage Wang Xian’s strength is even more terrifying than I imagined. His ranking can be even higher! ”<br/><br/>“What a powerful attack. He defeated the holy son of the Fa Yi Saint Academy in three moves. He was able to use his last move freely. What a freak!”<br/><br/>In the surrounding area, be it the Saintesses of the Fa Yi Saint Academy, the favored sons of Heaven, or the other holy sons and saintesses.<br/><br/>Even the elders and deacons of the Dragon Roar Forbidden Ground, as well as the other strong disciples, looked at this scene in shock.<br/><br/>They had also thought that Wang Xian would be able to win!<br/><br/>However, they had never thought that he would be able to defeat the holy son of Star City from the Fa Yi Saint Academy so quickly.<br/><br/>One had to know that the other party was the holy son of the fourth largest faction!<br/><br/>This victory was too fast!<br/><br/>It felt like they were not on the same level.<br/><br/>“Huff! Huff! ”<br/><br/>The holy son of Star City took a few quick breaths. He looked at Wang Xian with an abnormally embarrassed expression.<br/><br/>He came forward confidently to challenge Wang Xian, but he was defeated in three moves.<br/><br/>The strength displayed by the other party was too terrifying.<br/><br/>It made him lose the ability to fight!<br/><br/>He was no match for Wang Xian.<br/><br/>In fact, there was a huge gap between them!<br/><br/>“I’ll teach you a lesson!”<br/><br/>The holy son of Star City cupped his hands with an awkward expression. Then, he left immediately.<br/><br/>And today’s battle would definitely reverberate throughout the entire continent!<br/><br/>He, the holy son of the Fa Yi Saint Academy, would become Wang Xian’s stepping stone.<br/><br/>This would cause his reputation to be greatly shaken.<br/><br/>It would make him live up to his name!<br/><br/>“Everyone from the Fa Yi Saint Academy, please take care! ”<br/><br/>The Elders of the dragon roar forbidden ground said politely with a smile on their faces.<br/><br/>After that, they still looked at Wang Xian with a hint of shock.<br/><br/>“Xiao Xian, your combat strength is really terrifying to the extreme! ”<br/><br/>“That’s right, that’s right. The other party is an outstanding saint son of the Fa Yi Saint Academy. His strength is extremely strong. I didn’t expect him to be defeated by you in three moves!”<br/><br/>“Hahaha, Xiao Xian, you defeated the saint son of the Fa Yi Saint Academy today. Furthermore, you defeated him in three moves. This matter will spread across the entire continent very quickly. By then, the reputation of our dragon roar forbidden ground will also be greatly enhanced. ”<br/><br/>A group of elders flew over and surrounded Wang Xian. They smiled and exclaimed in amazement!<br/><br/>(‘My realm is still too low. There’s still room for improvement! ”<br/><br/>Wang Xian smiled modestly.<br/><br/>“Xiao Xian, you’re too modest.”<br/><br/>“That’s right, that’s right. To have such strength at such a young age is already very heaven- defying! ”<br/><br/>The group of elders praised him generously.<br/><br/>“Big Brother, you’re simply too strong. You’re so strong that it doesn’t make sense. You’re so strong that it makes one’s hair stand on end! ”<br/><br/>Long Yinhao came to the side and looked at Wang Xian with admiration. “Big Brother, you’ll be my idol for the rest of my life. In the future, if anyone bullies me, I’ll report your name! ”<br/><br/>“Go play somewhere else. You Don’t cultivate properly all day! ”<br/><br/>Long yinyin patted long Yinhao’s head proudly and said with a smile!<br/><br/>“Haha! ”<br/><br/>The surrounding elders laughed and said, “After today’s battle, I think I can still improve a little on the ranking of the holy sons and saintesses. Those who can achieve such accomplishments will basically be able to become the top existences in our continent in the future! ”<br/><br/>“All the elders are praising me. I’ve only cultivated to where I am now! ”<br/><br/>Wang Xian spoke humbly to them for a while. Then, under the respectful and admiring gazes of the surrounding disciples of the Dragon Roar Forbidden Ground, he returned to his residence!<br/><br/>“Next, Pll increase my strength first. I’ll strive to break through to the third level of the Universe Dominator! ”<br/><br/>Wang Xian did not continue to teach dragon roar. Instead, he began to cultivate.<br/><br/>The resources in his hands were sufficient to allow him to advance to the fourth level of the universe dominator.<br/><br/>However, the process of breaking through still required time to comprehend. It was no longer as simple as it was at the beginning!<br/><br/>Wang Xian had estimated that it would take between five million to ten million years to advance to the third level of the Universe Overlord!<br/><br/>However, time was the most worthless in the universe!<br/><br/>Time passed quickly. On the road to the sword and Magic Universe, the battle between Wang Xian and the saint son of Fanyi Saint Academy, Star City, caused quite a stir!<br/><br/>In the past, Wang Xian and the saint son of the Dragon Roar Forbidden Ground were ranked tenth among the saint sons and saintesses, which attracted a lot of attention.<br/><br/>Many saint sons and saintesses, as well as some powerful disciples, did not agree with this.<br/><br/>However, this battle shocked everyone!<br/><br/>The Saint Son of Star City from the Fanyi Saint Academy was undoubtedly powerful.<br/><br/>However, in this battle, he was instantly killed by his opponent in three moves.<br/><br/>What kind of concept was this?<br/><br/>This meant that the saint son of Star City from the Fanyi Saint Academy had a huge gap with him!<br/><br/>It was not even on the same level of combat strength!<br/><br/>This shocked countless strong disciples!<br/><br/>Very quickly, the ranking of Holy Sons and Holy Virgins in the Lawless Forbidden Ground raised Wang Xian’s ranking to the sixth place!<br/><br/>Yes, it went straight from the tenth place to the sixth place.<br/><br/>As for the top five, the weakest realm had already reached the level four of the universe dominator.<br/><br/>In fact, in the current ranking of Saint Children and saintesses, other than the top two who had reached the level of a universe overlord, the rest were all at the level of a universe overlord.<br/><br/>The reason why the two saint children were able to reach such a high level was because they had cultivated for over 900 million years..\t\t\t\t\t\t</div>", "images": {}, "success": true}