{"id": 992, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073884.html", "title": "Chapter 3994 - Chapter 3994: Under The 3993 Memory Inheritance", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3994 - Chapter 3994: Under The 3993 Memory Inheritance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3994: Under the 3993 memory inheritance<br/><br/>Translator: 549690339<br/><br/>What a pleasant surprise!<br/><br/>Wang Xian channeled his energy into this magic pillar and obtained the impact of the will of the expert’s corpse inside the magic pillar.<br/><br/>He was able to enter his battle vision and endure the entire process.<br/><br/>This gave him a huge benefit.<br/><br/>That was to gain the recognition of this expert’s corpse. The defensive power around the magic pillar dissipated!<br/><br/>Since he could enter the interior of the demon pillar, he would naturally be able to obtain everything about this expert.<br/><br/>Such a sudden opportunity was a huge surprise to Wang Xian!<br/><br/>“Eh? You… You’re actually fine?”<br/><br/>At a corner, the four disciples of the void forbidden ground were shocked when they saw Wang Xian opening his eyes.<br/><br/>“Why is there a problem? Not only is there a problem, but there are also huge benefits to be gained!”<br/><br/>Wang Xian smiled and flew straight towards the corpse of the powerhouse in the demon pillar!<br/><br/>Swoosh<br/><br/>He easily came to the side of the powerhouse’s corpse and bowed to him!<br/><br/>“Senior brother, the defensive energy outside the demon pillar has disappeared. It can enter the interior of the demon pillar! ”<br/><br/>When the Saintess of the forbidden space saw that Wang Xian had arrived in front of the expert’s corpse, her expression changed drastically!<br/><br/>She hurriedly shouted!<br/><br/>“Whoosh! ”<br/><br/>The face of the saint son of Xu Ni also changed drastically. His body moved and instantly flew upwards!<br/><br/>Wang Xian heard the exclamations from below and sensed the saint son of Xu Ni flying over. He frowned slightly.<br/><br/>With a wave of his arm, he put away the expert’s corpse and everything else.<br/><br/>“How impudent! Put down the corpse of our senior from the Forbidden space!<br/><br/>When the saint son of Xu Ni saw this scene, he was dumbfounded!<br/><br/>He immediately shouted loudly.<br/><br/>At the beginning, when they saw Wang Xian placing his arm on the demon pillar, they thought that the will inside the destroyed demon pillar had collapsed and died.<br/><br/>However, they didn’t expect that not only did he not die, the will protecting the demon pillar had disappeared.<br/><br/>He could enter the demon pillar directly!<br/><br/>Seeing that the expert’s corpse had been taken away and all the treasures of that expert had been taken by Wang Xian, his expression changed drastically as he shouted loudly!<br/><br/>“What’s the situation?”<br/><br/>The commotion caused the rest of the holy sons and saintesses around to look over in astonishment.<br/><br/>When they saw that Wang Xian wasn’t dead but had come to the interior of the demon pillar instead, they were also slightly shocked!<br/><br/>“Holy son of the forbidden space, this deceased senior has already acknowledged me. Naturally, I will inherit everything that belongs to him! ” Wang Xian saw this holy son of Xu Ni flying over and said indifferently.<br/><br/>“How impudent! This is the corpse of our senior from the forbidden space.<br/><br/>Return it to us immediately!”<br/><br/>The holy son of Xu Ni’s expression changed drastically. His gaze focused as he shouted loudly at Wang Xian.<br/><br/>“Hehe, saint son of Xu Ni, according to the information I obtained, your space forbidden ground was only established in this calamity. There was no space forbidden ground during the previous calamity. It’s a little too much for you to say that it’s the corpse of an expert from your space forbidden ground! ” Wang Xian replied indifferently when he heard his words!<br/><br/>From the one-sided memories of this expert, he knew that he was not an expert from any space forbidden ground.<br/><br/>In the previous calamity, there was no such force!<br/><br/>“Our forbidden space was created by a spatial powerhouse in the previous calamity. This powerhouse is the partner of the powerhouses in our forbidden space. Naturally, he is also a powerhouse in our forbidden space. ”<br/><br/>“I would like to trouble you, Saint Wang Xian, to give us some face and return this corpse to us!”<br/><br/>At the back, the SAINTESS from the forbidden space flew over and said to Wang Xian calmly.<br/><br/>“I can return the corpse to you. However, there are incomplete memories and soul fragments around the corpse. After I absorb them, I will naturally return them to you! ”<br/><br/>Wang Xian said.<br/><br/>The corpse of this expert might be due to the magic array. After his death, there were still some soul memories and broken memory fragments. These were the most profound things in the memories of this expert.<br/><br/>And the most profound thing was naturally cultivation.<br/><br/>After absorbing it, it would indeed bring great benefits to Wang Xian.<br/><br/>As for that corpse, the energy it contained wasn’t much. It didn’t matter even if it was returned to the forbidden space.<br/><br/>“Impudent! The corpse of our senior from the forbidden space must not be desecrated. Return the corpse to US immediately!”<br/><br/>Upon hearing that, the expression of saint son Xu ni changed again as he shouted loudly!<br/><br/>He, Saint Son Xu Ni, knew what this corpse meant and what it meant!<br/><br/>When Wang Xian heard his words again, he frowned slightly and his gaze turned cold.<br/><br/>“Who are you calling impudent? You better watch your words and don’t bring yourself to be humiliated. A corpse from the previous calamity, yet your forbidden space shamelessly said that it was your senior from the Forbidden Space and asked me to return it to you! ”<br/><br/>“Hehe, aren’t you guys a little ridiculous? You want me to give you the complete corpse and give you all the treasures and weapons he has?” Wang Xian stared at them and said directly with a face full of mockery.<br/><br/>He didn’t bother to hide his disdain and coldness.<br/><br/>Just now, he had already given enough face to the forbidden space. Now, he wanted to take an inch and take a mile?<br/><br/>“Huh? Let’s Go! ”<br/><br/>“That Saint Wang Xian actually obtained a corpse and a treasure from the demon pillar. This… this speed is too fast. Didn’t he just arrive?”<br/><br/>“The Forbidden Space Zone actually clashed with him. TSK TSK, looks like the forbidden space zone wants to snatch that corpse away, but that Saint Wang Xian didn’t give him any face at all! ”<br/><br/>“That Saint Wang Xian is really not simple. In the past, the forbidden space zone sent countless strong disciples to this place, but they weren’t able to obtain the corpse from the demon pillar. Yet, he actually obtained it directly. Looks like he has some ideas. Let’s Go! ”<br/><br/>In the entire space, all the Holy Sons, Holy Virgins, and Heaven’s pride disciples immediately flew over when they saw the situation here.<br/><br/>Their eyes flickered as they sized up Wang Xian!<br/><br/>The faces of the Holy Sons, Holy Virgins, and the other two disciples in the forbidden space changed drastically when they heard Wang Xian ‘s words!<br/><br/>They stared coldly at Wang Xian, their eyes filled with a sinister look!<br/><br/>“Everyone, don’t forget the rules. Anyone who dares to break the rules will be killed immediately! ”<br/><br/>The saint son of Wuman from the undeserved forbidden ground flew over. He swept his gaze across Wang Xian and the saint sons and saintesses from the forbidden space and warned them indifferently!<br/><br/>Wang Xian swept his gaze over and smiled faintly. He shrugged his shoulders and didn’t say a word!<br/><br/>The saint son of Xu ni stared at Wang Xian, his face filled with unwillingness!<br/><br/>In the core of the universe ruins, the greatest opportunity for all the disciples was these twelve demon pillars.<br/><br/>As these experts were sealed and died in the demon pillars, their souls and Wills wouldn’t dissipate.<br/><br/>If he could absorb them bit by bit, he would be able to obtain a terrifying inheritance.<br/><br/>If he could obtain this corpse, he would be able to obtain all the inheritances of a Master of the universe at the peak, a spatial expert.<br/><br/>It was much more powerful than the top-tier magic mantle and Sword Bowl..\t\t\t\t\t\t</div>", "images": {}, "success": true}