{"id": 999, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073898.html", "title": "Chapter 4001 - Chapter 4001: 4,000 To Break Through The 12 Demon Pillars! Go", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 4001 - Chapter 4001: 4,000 To Break Through The 12 Demon Pillars! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4001: 4,000 to break through the 12 demon pillars! Go<br/><br/>Translator: 549690339<br/><br/>The condition that Wang Xian mentioned wasn’t very high.<br/><br/>There were a total of 12 demon pillars.<br/><br/>He had absorbed one of them and there were still 11 left!<br/><br/>As for these 11 demon pillars, he wanted three of them and there were still eight left.<br/><br/>In addition, he wanted the two treasures on the corpses of the powerhouses in each of the demon pillars!<br/><br/>As for the flowing water forbidden land, they would obtain eight corpses of the powerhouses and eight powerful inheritances.<br/><br/>Compared to treasures, these inheritances were much more powerful.<br/><br/>It was not an exaggeration to say that unless these eight experts had extremely powerful treasures, they were not as valuable as these inheritances!<br/><br/>Furthermore, if the treasures were only at the level of a connate cardinal treasure.<br/><br/>Then the value of these treasures could be worth at most three corpses!<br/><br/>No matter what, it was still better than the flowing water forbidden ground.<br/><br/>When the flowing moon Saintess heard Wang Xian’s words, she frowned slightly and revealed a contemplative look!<br/><br/>“You can have the other attributes, but we want two water attributes!”<br/><br/>The holy son of the flowing water forbidden ground looked at Wang Xian with a changing expression and said, “Or we can use the other treasures as compensation! ”<br/><br/>The holy son of the flowing water forbidden ground did not want to give up on a top-notch inheritance at the pinnacle of the universe dominator.<br/><br/>Such an inheritance existed in the flowing water forbidden ground, but it wasn’t something he could obtain!<br/><br/>He was only the holy son of this generation. There were many generations of Holy Sons and Holy Virgins before him!<br/><br/>Some of the Holy Sons and Holy Virgins were even more talented than him.<br/><br/>Therefore, the inheritance of this magic pillar was extremely important to him.<br/><br/>“What’s the use of giving me the magic pillar of other attributes? The disciples of the Dragon Roar forbidden ground are all of the water attribute. ”<br/><br/>Wang Xian shook his head lightly. “There’s no room for negotiation. If you agree, we’ll work together. If you don’t agree, then forget it! ” As he spoke, his gaze swept across the surrounding magic pillars.<br/><br/>Wang Xian wasn ‘t very interested in these magic pillars.<br/><br/>The cultivation methods of the nine-origin universe and the sword and magic continent were somewhat different.<br/><br/>As the Divine Dragon Clan, they had their own cultivation methods. They were no weaker than the attack methods of the sword and magic continent.<br/><br/>Therefore, Wang Xian really didn’t care about the corpses of these experts.<br/><br/>Ao Jian and the rest didn’t have too much of a demand for the corpse of the metal-attributed expert.<br/><br/>Their cultivation methods were different. Even if they obtained the corpse of an expert, they could only undergo a supplementary cultivation.<br/><br/>As for the treasures, they were still acceptable.<br/><br/>If he could obtain them, Wang Xian was prepared to sell all of them in exchange for resources to increase the strength of his main body and the strength of the Tai Chi Dragon Disc.<br/><br/>“You… ”<br/><br/>When the saint son of the flowing water forbidden ground heard Wang Xian ‘s decisive words, his expression turned ugly!<br/><br/>The flowing moon Saintess frowned slightly and glanced at the saint son beside her.<br/><br/>“Let me contact our seniors in the flowing water forbidden ground. ” She hesitated for a moment before speaking!<br/><br/>The inheritance within these magic pillars was too powerful. Even as the Saintess of the flowing water forbidden ground, she couldn’t make the decision on certain matters!<br/><br/>“Can you contact the outside world?”? “That’s even better. If you agree, I need your flowing water forbidden ground to protect the dragon roar forbidden ground. This is to prevent the powerhouses from other forbidden grounds from threatening us to give the two water elemental magic pillars to the others! ”<br/><br/>Wang Xian added on!<br/><br/>“Alright! ”<br/><br/>Saintess flowing moon nodded and contacted him immediately.<br/><br/>Buzz! Buzz<br/><br/>“Alright. Our seniors from the flowing water forbidden ground have agreed. ”<br/><br/>Soon, Saintess flowing moon spoke to Wang Xian! “Alright, let’s Start Now!”<br/><br/>Wang Xian looked at Saintess flowing moon and said.<br/><br/>The flowing moon Saintess nodded her head and looked at the water elemental magic pillars in front of her. “Let’s divide the three water elemental magic pillars freely. There aren’t many records of the strong ones from the previous calamity. ”<br/><br/>“Yes, that’s fine!”<br/><br/>Wang Xian nodded his head and didn’t reject her!<br/><br/>Since that’s the case, we will activate the spell and connect all of us together. Brother Wang Xian, although you aren ‘t of the water element, as long as you don’t resist, there won’t be any problems! ”<br/><br/>As the flowing moon Saintess spoke, she swept her gaze across the disciples around her. “Begin, set up the formation and cast the spell! ”<br/><br/>“It’s the flowing moon Saintess!”<br/><br/>The disciples immediately replied.<br/><br/>At the side, the saint son of the flowing water forbidden ground had an indignant look on his face.<br/><br/>However, the flowing moon Saintess was the most respected person in the flowing water forbidden ground. His strength was a level lower than the flowing moon Saintess!<br/><br/>There was no room for him to choose or resist!<br/><br/>“Thousand flowing saint son, this time, the seniors in the forbidden ground will give you some compensation. The benefits will not be small either!” The flowing moon Saintess said to the thousand flowing saint son.<br/><br/>Okay!<br/><br/>The thousand flowing Saint Son took a deep breath and nodded.<br/><br/>“Let’s begin. ”<br/><br/>The flowing moon Saintess said and looked at Wang Xian. “Brother Wang Xian, stand over here. ”<br/><br/>“No Problem! ”<br/><br/>Wang Xian nodded and stood in front of them.<br/><br/>The disciples of the Liushui Forbidden Ground also stood around Wang Xian immediately.<br/><br/>Brother Wang Xian! ”<br/><br/>Long yinyin and the rest couldn’t help but call out to Wang Xian from the side!<br/><br/>“A few days at most, a few hours at most. Let’s Begin! ”<br/><br/>Wang Xian smiled at them before looking at Saintess Liuyue.<br/><br/>Saintess Liuyue nodded her head. With a wave of her hand, a huge staff appeared in her hand.<br/><br/>She waved her hand forward, and streams of water currents connected everyone!<br/><br/>Wang Xian looked at the water currents flowing into his body and sensed that there was no danger.<br/><br/>“It’s about to start. Saintess Wang Xian, don’t resist! ”<br/><br/>As Saintess Liuyue spoke, her palm moved and landed directly on the demon pillar. Following that, a wave of willpower impact force surged towards her.<br/><br/>However, this surge of willpower force entered her body and spread to the surroundings along with the flow of water.<br/><br/>Wang Xian’s eyes flickered when he saw it.<br/><br/>Following that, he felt a strong surge of willpower force surging towards him.<br/><br/>Wang Xian’s eyes focused as he tried his best to resist it.<br/><br/>Images appeared in his mind.<br/><br/>The images of the battle were somewhat similar to what he had seen previously.<br/><br/>There were also some differences!<br/><br/>Furthermore, Wang Xian felt that the impact of the will this time was much weaker than the last time.<br/><br/>This was due to the fact that the impact of the will was slightly scattered.<br/><br/>After all, there were more than a dozen people around to help him split the burden.<br/><br/>Furthermore, space was the king. Naturally, the impact of the will of space-attributed experts was also the strongest.<br/><br/>Wang Xian resisted the impact of the will. The images in his mind kept flashing.<br/><br/>This time, it was much faster than the last time!<br/><br/>“Eh? What are the flowing water forbidden ground and the saint son Wang Xian doing?”<br/><br/>“Could it be that they have found a way to break the magic pillar?”<br/><br/>In the surrounding area, the undeserved forbidden ground, the rest of the saint sons and saintesses from the top forbidden ground and the Saint Academy looked over. Their eyes were sparkling.<br/><br/>The holy sons and saintesses from the forbidden area looked at each other, then they flew over..\t\t\t\t\t\t</div>", "images": {}, "success": true}