{"id": 995, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073890.html", "title": "Chapter 3997 - Chapter 3997: 3996 Entered The Void Pagoda. Under The Huge Amount Of Resources", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3997 - Chapter 3997: 3996 Entered The Void Pagoda. Under The Huge Amount Of Resources</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3997: 3996 entered the Void Pagoda. Under the huge amount of resources<br/><br/>Translator: 549690339<br/><br/>“Whoosh! ”<br/><br/>Wang Xian’s body moved and immediately flew towards the space in the Void<br/><br/>Pagoda.<br/><br/>As the place where a tribe lived, there was a living space here.<br/><br/>It contained a space and this space was very large.<br/><br/>Wang Xian flew over and scanned his surroundings.<br/><br/>Finally, his gaze landed on the space in front of him. It should be the place where the divine herbs and divine trees were planted.<br/><br/>However, it seemed to be a little deserted at this moment.<br/><br/>The divine herbs and divine trees did not reach the level of the Heaven’s origin creation. They also had a lifespan!<br/><br/>Time had already consumed everything here!<br/><br/>However, when Wang Xian arrived at the center of this space, his eyes slowly glowed.<br/><br/>There was a piece of divine wood in the middle of the space.<br/><br/>This kind of divine wood was very strange. It looked a little illusory, just like a mirror!<br/><br/>“It hasn’t been worn out by Time!”<br/><br/>Wang Xian looked over and his eyes were sparkling.<br/><br/>He then looked at the bottom of these divine trees. There were many fruits on the ground.<br/><br/>Some of the fruits contained less energy.<br/><br/>“This is the growth of the divine trees. No one took away the fruits on them.<br/><br/>Therefore, the fruits fell and the fruits sprouted again, growing into divine Wang Xian looked at this scene and understood why these divine trees did not disappear under the passage of time!<br/><br/>This was a cycle of reincarnation.<br/><br/>In the past, when the divine trees grew and the fruits fell, the fruits grew into divine trees.<br/><br/>This was also the reason why these divine trees still existed.<br/><br/>He scanned his surroundings. There were not many of these divine trees, but there were a few hundred of them.<br/><br/>Each of them contained a huge amount of energy.<br/><br/>This divine tree was a divine tree that belonged to the eighth level of the universe dominator.<br/><br/>Wang Xian looked at the fruit on it and picked one to sense it.<br/><br/>The space-attributed fruit was of great use to Wang Xian!<br/><br/>He scanned his surroundings and realized that there was a treasure vault located in the deepest part of the area!<br/><br/>“This should be the treasure vault of this void race! ”<br/><br/>Wang Xian had a look of anticipation in his eyes as he walked to the front of the treasure vault.<br/><br/>Buzz<br/><br/>The Treasure Vault was opened under the control of an lie.<br/><br/>He entered the treasure vault and all kinds of energy charged at him.<br/><br/>The treasure vault not only contained the energy of the space attribute but also the energy of other attributes.<br/><br/>Located at the central entrance was the head of a powerful godly beast!<br/><br/>The entire head was sealed in a transparent solid body.<br/><br/>This should be a decoration.<br/><br/>However, the head of this divine beast gave off an extremely majestic feeling!<br/><br/>Wang Xian sized it up.<br/><br/>This was the head of a divine beast at the peak of the Universe Overlord realm. It was hunted down by this void race, leaving behind its head!<br/><br/>Looking inside, there were some weapons.<br/><br/>In addition, there were many treasures that had lost their energy.<br/><br/>Especially those treasure bottles. It was obvious that they were used to contain some medicinal pills and other treasures.<br/><br/>Scanning through them one by one, other than the weapons, many other treasures had lost their energy.<br/><br/>There were more than a dozen space-attributed weapons that were comparable to innate supreme treasures!<br/><br/>“This void race is not weak! ”<br/><br/>Wang Xian thought to himself. However, based on the images in his mind, the twelve demon pillars were even more terrifying and powerful.<br/><br/>Even Wang Xian could not last more than a few minutes inside with the help of the two heaven’s origin treasures.<br/><br/>Of course, if Wang Xian could improve a little more, it would be hard to say!<br/><br/>Wang Xian opened some porcelain bottles one by one and looked inside.<br/><br/>He opened more than ten of them consecutively but didn’t find anything!<br/><br/>Buzz<br/><br/>With a wave of his arm, all the porcelain bottles in the entire treasury were opened.<br/><br/>There were more than 200 of them!<br/><br/>Buzz<br/><br/>At this moment, Wang Xian felt a surge of energy coming from a few porcelain bottles in the middle!<br/><br/>He looked over immediately.<br/><br/>“What a strong vitality! ”<br/><br/>He waved his arm and three porcelain bottles flew into his hands. He opened them and realized that there was some liquid stored inside!<br/><br/>For some unknown reason, the liquid did not disappear despite the passage of time.<br/><br/>Perhaps it was not due to the medicine!<br/><br/>Wang Xian sensed for a moment and his eyes glowed.<br/><br/>The liquid that was filled with life force belonged to the wood attribute.<br/><br/>The energy was extremely terrifying.<br/><br/>Although this porcelain bottle was only the size of a palm, the space inside was more than ten square meters!<br/><br/>The energy contained in the liquid in these three porcelain bottles was extremely terrifying!<br/><br/>“This should be able to raise my actual strength! ” Wang Xian’s eyes revealed a hint of excitement!<br/><br/>The harvest this time was simply too great!<br/><br/>Excitement appeared in his eyes.<br/><br/>After putting away these resources, Wang Xian looked around and didn ‘t find any more resources.<br/><br/>(‘I can absorb these wood-type liquids with my own body. I can absorb those space-type divine trees with the body of the Void Divine Dragon! ”<br/><br/>Wang Xian mumbled.<br/><br/>lie!<br/><br/>His mind moved and he shouted at an lie!<br/><br/>An lie flew over immediately. “Dragon King! ”<br/><br/>He bowed respectfully!<br/><br/>“Let’s go out first and head to a few other places.”<br/><br/>He moved and left his original body here. Then, he instructed an lie!<br/><br/>An lie nodded his head and brought him out immediately!<br/><br/>“Hide yourself! ”<br/><br/>Wang Xian said to him before flying to the entrance of this space.<br/><br/>He looked at the space above and flew directly.<br/><br/>After passing through this space whirlpool, he returned to the unstable space above again!<br/><br/>“Eh? It’s saint son Wang Xian from the Dragon Roar Forbidden Ground! ”<br/><br/>“He came from below. It seems that he can enter the space below. However, with our strength, Pm afraid it’s a little dangerous! ”<br/><br/>“What’s the space below?”<br/><br/>When he came out, he realized that there were many saint sons, saintesses, and heaven’s favorites from the other Saint Children’s forbidden grounds.<br/><br/>When they saw Wang Xian flying out from here, their faces were filled with astonishment.<br/><br/>“Saint Son Wang Xian, what’s that space? Can you tell us?”<br/><br/>A Saintess couldn’t help but ask Wang Xian!<br/><br/>(‘A space that contains more energy. There are some great opportunities in it.<br/><br/>However, without the strength of a level three universe dominator, don’t even think about entering it. ”<br/><br/>Wang Xian glanced at them and did not hide anything. He spoke directly!<br/><br/>“Thank you, holy son Wang Xian. ”<br/><br/>The SAINTESS thanked him immediately!<br/><br/>She looked at the entrance of the space with a burning gaze.<br/><br/>Wang Xian did not reply and continued flying forward.<br/><br/>(‘A space that contains more energy contains a great opportunity?”<br/><br/>The rest of the Saint Sons, saintesses, and heaven’s favorites also looked into the space with a burning gaze!<br/><br/>“The saint son Wang Xian should not be lying to us. Those powerful Saint Sons, saintesses, and heaven’s favorites don’t seem to be in our space anymore. However, they require the strength of a level three universe dominator to enter. This…”<br/><br/>They looked at this entrance with a hint of helplessness on their faces..\t\t\t\t\t\t</div>", "images": {}, "success": true}