{"id": 996, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073892.html", "title": "Chapter 3998 - Chapter 3998: 3997 Breakthrough!", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3998 - Chapter 3998: 3997 Breakthrough!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3998: 3997 breakthrough!<br/><br/>Translator: 549690339<br/><br/>After Wang Xian spoke to the group of holy sons, saintesses, and heaven’s favorites, he left immediately!<br/><br/>His first target was a divine kingdom.<br/><br/>A divine kingdom in the realm of the universe’s ruler.<br/><br/>This should be a powerhouse from the nine-origin universe. For some unknown reason, he had joined this war.<br/><br/>The Divine Kingdom was now sealed, but it still contained energy.<br/><br/>Wang Xian flew over with an lie and entered easily!<br/><br/>“The Divine Kingdom of the universe from the previous calamity is really rare!<br/><br/>Wang Xian entered and scanned his surroundings.<br/><br/>His body moved and he immediately started to search around.<br/><br/>He found a pond that was filled with energy.<br/><br/>This pond contained majestic water elemental energy.<br/><br/>This water elemental energy was sufficient to increase Wang Xian’s Dragon Qi by a lot!<br/><br/>Other than this item, he did not discover any other resources!<br/><br/>“This universe God country can call ao he and the rest over and let them slowly devour it. After all, this is the god country of an expert at the peak of the Universe Overlord Realm! ”<br/><br/>Wang Xian mumbled.<br/><br/>However, with Ao he and the Rest’s strength, it would take too long for them to completely devour this god country!<br/><br/>Furthermore, their levels were too high and they might not be able to devour<br/><br/>“An lie, bring ao he and the rest over and give it a try. If they can devour it, it would be a huge opportunity for them! ”<br/><br/>Wang Xian said.<br/><br/>“It’s the Dragon King! ”<br/><br/>An lie nodded and immediately disappeared!<br/><br/>Soon, an lie brought ao he here.<br/><br/>“Greetings, Dragon King! ”<br/><br/>Ao he immediately bowed respectfully when he saw Wang Xian!<br/><br/>“Let’s see if this divine kingdom can be devoured!”<br/><br/>Wang Xian spoke to him!<br/><br/>“It’s the Dragon King. Dragon King, the level of this divine kingdom is so high !<br/><br/>Ao he looked around and his eyes were burning with passion.<br/><br/>“Yes, the peak of the Overlord realm. You stay here first. We will go to other places! ”<br/><br/>Wang Xian said.<br/><br/>He and an lie came to the other war machines!<br/><br/>There were more than ten other places that they could not enter.<br/><br/>However, with an lie, they could enter easily.<br/><br/>They came to the war machines one by one. Unfortunately, Wang Xian did not find any resources inside.<br/><br/>There were quite a number of divine stones with various attributes. However, Wang Xian could not devour these divine stones to increase his strength.<br/><br/>Other than divine stones, there were all kinds of metals. These metals were of great use for the Five Elements Millstone and the Tai Chi Dragon Plate.<br/><br/>War machines were used for war. It was normal that there were no medicinal pills, herbs, or other resources inside.<br/><br/>However, the harvest was still huge.<br/><br/>“This tower of the firmament is indeed powerful. It is a very powerful war machine. Give the blueprints to the fire hammer dragon seed and the Dragon Witch. Let them study it with Lin Wenluo and see if they can build the tower of the firmament! ”<br/><br/>Wang Xian said to an lie.<br/><br/>The tower of the firmament was a war machine. Wang Xian happened to find a blueprint of the Tower of the firmament here!<br/><br/>A war machine of this level could kill existences at the peak of the universe’s ruler!<br/><br/>It was also a great killing machine that could dominate the universe!<br/><br/>The Divine Dragon Clan was not good at using weapons in the past. However, due to the combination of the Divine Dragon clan and the insect clan’s technology.<br/><br/>The new dragon species that were born had different directions.<br/><br/>If they could create a powerful tower of the firmament, it would be a huge boost to the strength of the Dragon Palace!<br/><br/>“It’s the Dragon King! ”<br/><br/>An lie nodded.<br/><br/>After plundering all the war machines that could not be entered, Wang Xian returned to the divine kingdom once again!<br/><br/>He nodded slightly when he saw ao crab and the group of devouring dragons devouring them.<br/><br/>As long as he could devour them, ao crab and the rest would be able to improve rapidly.<br/><br/>“It’s time for me to improve as well. It’s been a long time since my original body’s strength has improved! ”<br/><br/>Wang Xian mumbled.<br/><br/>He got an lie to bring him to the Void Pagoda where Wang Xian’s original body was sitting cross-legged!<br/><br/>“Upgrade!”<br/><br/>A faint smile appeared on his face. With a move of his body, he immediately transformed into the nine-origin universe!<br/><br/>Wang Xian let out a low roar. A large amount of resources appeared in front of him from the surrounding areas!<br/><br/>“The body of the void God dragon is also undergoing cultivation! ”<br/><br/>The body of the void God Dragon sat cross-legged at the side. He took out the corpse of the expert and began to cultivate quietly.<br/><br/>In the following period of time, Wang Xian began to improve his strength!<br/><br/>The resources he obtained this time were enough for him to improve by a level!<br/><br/>As time passed, the energy in Wang Xian’s body was also increasing rapidly.<br/><br/>Boom! Boom! Boom<br/><br/>Crack Crack Crack<br/><br/>After more than 10,000 years, waves of vast energy gushed out from Wang Xian’s dragon body.<br/><br/>The nine attributes were emitting dazzling rays of light around him.<br/><br/>It was holy and Majestic!<br/><br/>Waves of vast energy gushed out from Wang Xian’s body!<br/><br/>This energy was definitely the best in any universe.<br/><br/>It was the power of a master at the peak of the universe!<br/><br/>“Ding, congratulations to host for increasing your level and breaking through to the level five of the Master of the universe.”<br/><br/>“Ding, congratulations to host for increasing your level and strengthening the nine origins Dragon Field. ”<br/><br/>The system’s voice sounded at this moment. Wang Xian opened his eyes and revealed an excited expression!<br/><br/>His mind moved!<br/><br/>Name: Wang Xian<br/><br/>Race: Nine Origins Divine Dragon (man-dragon unity)<br/><br/>Level: level five of the Master of the universe (nine transformations unity) Origin: 1% (99% needed for the next breakthrough)<br/><br/>Ability: governs the water race (governs the water race below its own level)<br/><br/>Devours living beings (devours living beings to extract origin)<br/><br/>Control of the five elements<br/><br/>Technique: Divine Dragon Transformation<br/><br/>Ability: soul-absorbing, spirit-attaching<br/><br/>Law Ability: Dragon Eye Lock, Five Elements Dragon Claw, Yin-yang breakthrough, eight luminaries Dragon Scale, Sacred Dragon Shadow,<br/><br/>Heavenly Dragon Eight Tribes, Dragon Tomb, Cloud Dragon Soaring, True Dragon body<br/><br/>Laws and Abhijnas: eight Dragon Pillars, eight dragon clones, towering dragon horns, Mighty Heavenly Dragon, Divine Tail Pearl, Life Dragon Breath, Shadow Dragon Clone, Abyss Dragon Chase, Abyss Dragon Transformation, wind and Thunder Dragon Birth, Mad Dragon Star Explosion!<br/><br/>Domain: nine origin Dragon Domain<br/><br/>Control laws: metal, wood, water, fire, Earth, light, darkness, wind and thunder<br/><br/>God Country: Dragon Palace<br/><br/>Dragon Palace: Innate.<br/><br/>Dragon Palace members: 8060450<br/><br/>“I’ve broken through. It’s been tens of millions of years. It’s been hundreds of millions of years. I’ve finally broken through! ”<br/><br/>Wang Xian looked at his attributes and revealed a smile.<br/><br/>His realm had been raised to level five of the universe overlord.<br/><br/>With his nine attributes, he was able to fight against experts at the peak of the Universe Overlord realm without the aid of any treasures.<br/><br/>It would be even more terrifying if he were to use the heaven origin creation fragment!<br/><br/>Wang Xian felt the strength of his body and a smile appeared on his face!<br/><br/>The strength of his original body was the root of everything!<br/><br/>At present, with his strength and trump cards, in the entire sword and magic universe, other than the two heaven’s origin creation existences, no one was his match.<br/><br/>Of course, he still had to keep a low profile!<br/><br/>Once he was targeted by the Heaven’s origin creation, Wang Xian would still be killed instantly!<br/><br/>Next, I should upgrade the Five Elements Millstone and the Tai Chi Dragon Plate. The metal and weapons I obtained this time will be able to upgrade them a little<br/><br/>Wang Xian thought to himself.<br/><br/>Although it wasn’t enough to upgrade the Five Elements Millstone and the Tai Chi Dragon Plate directly, it would still be able to upgrade their accumulation!\t\t\t\t\t\t</div>", "images": {}, "success": true}