{"id": 993, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073886.html", "title": "Chapter 3995 - Chapter 3995: 3994 Entered The Void Pagoda, On Top Of A Huge Amount Of Resources", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3995 - Chapter 3995: 3994 Entered The Void Pagoda, On Top Of A Huge Amount Of Resources</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3995: 3994 entered the Void Pagoda, on top of a huge amount of resources<br/><br/>Translator: 549690339<br/><br/>The holy sons and Saintesses of the forbidden space, as well as the other experts, stared at Wang Xian with unsightly expressions.<br/><br/>Wang Xian had obtained the treasures in the twelve magic pillars belonging to the spatial attribute experts.<br/><br/>This also meant that their forbidden space was no longer fated to be with this magic pillar!<br/><br/>Even the opportunity to absorb some scattered soul fragments was gone!<br/><br/>This made them look indignant!<br/><br/>“Holy son Wang Xian, can you tell us how you obtained the approval of the corpse of the powerhouse in the demon pillar?”<br/><br/>Holy Son Wu Man looked at Wang Xian and asked with a twinkle in his eyes.<br/><br/>Everyone was shocked that Wang Xian obtained the approval of the corpse in the demon pillar!<br/><br/>Similarly, their hearts were burning with passion!<br/><br/>If they could obtain the recognition from the corpse of the expert in the pillar, with their talents, they would definitely be able to reach the pinnacle of the Universe Overlord realm.<br/><br/>“I don’t know how it happened exactly. When I injected my energy into the pillar, I was attacked by the will of the pillar. Scenes of the expert’s death surfaced in my mind. ”<br/><br/>(‘I managed to resist the invasion and destruction of the terrifying will and gained the recognition of the corpse in the Pillar. ”<br/><br/>When Wang Xian heard their words, he hesitated for a moment. He did not hide anything and spoke directly!<br/><br/>There was no need for them to hide this.<br/><br/>It was extremely difficult to resist the impact of the will in the pillar!<br/><br/>If Wang Xian did not possess the will and mental strength of his original body, he would have lost his vitality under the impact of the mental strength!<br/><br/>This mental attack was not something they could withstand!<br/><br/>“Can you withstand the mental attack?”<br/><br/>When the saint son of no man heard Wang Xian’s words, his expression changed slightly and was filled with a solemn expression.<br/><br/>They had been reminded by their seniors that they had to be careful of the mental attack of this demon pillar.<br/><br/>This was not something they could withstand.<br/><br/>In the past, some of the disciples that they had just explored in the no man forbidden ground had died under the mental attack.<br/><br/>In the past, those who could enter this place were not much weaker than the saint child!<br/><br/>The Saintess of flowing water forbidden land frowned slightly when she heard this.<br/><br/>“He should be able to withstand the impact of the will from the powerful warrior’s corpse in the demon pillar and watch the scene in his memories before he died. However, it’s extremely difficult to withstand the impact of the will!<br/><br/>The saintess from the undeserved sanctum frowned and said!<br/><br/>“Furthermore, I’m afraid that it would be useless if a strong man of the same attribute withstands the impact of the will! ”<br/><br/>The saint from the undeserved sanctum added. His expression was a little ugly.<br/><br/>It was too difficult to obtain the corpse in the demon pillar!<br/><br/>Saint Son Wang Xian, do you have a way to withstand the impact of the will?”<br/><br/>The Saintess of the flowing water forbidden ground couldn’t help but ask Wang Xian.<br/><br/>“No, I don’t have any treasure that can resist this will. It’s All My Luck! ”<br/><br/>Wang Xian replied indifferently!<br/><br/>“Thank you! ”<br/><br/>The barbarian saint and the rest nodded their heads and cupped their hands at Wang Xian.<br/><br/>They knew about Wang Xian’s situation.<br/><br/>They didn’t see him using any treasure to resist it.<br/><br/>This was purely due to his strong willpower to withstand the impact of the terrifying willpower!<br/><br/>The group of people from the unfettered forbidden grounds of the flowing water forbidden ground moved and came before the magic pillars again. They were thinking about how to withstand the impact of the willpower.<br/><br/>How to obtain the recognition of the strong expert’s corpse inside!<br/><br/>The rest of the holy sons and saintesses from the forbidden grounds also left.<br/><br/>“This Wang Xian holy son has such a powerful opportunity. He has obtained<br/><br/>the corpse of that spatial attribute expert. In the future, he will definitely be able to step into the peak of the Universe Overlord realm. In the future, he will definitely be a top-notch expert in our continent! ”<br/><br/>“Yeah, who would have thought that he would obtain such a terrifying and lucky opportunity just now. This… This is simply too heaven-defying! ”<br/><br/>“The holy son and Saintess from the forbidden space seem to be very unwilling. They seem to have had a conflict, but that Wang Xian didn’t give a damn about them! ”<br/><br/>“In the future, as long as Wang Xian doesn’t die, he will definitely be one of the top-notch powerhouses in our sword and Magic Universe! ”<br/><br/>“This luck is too strong. However, the forbidden space is a little unlucky this time. Without the spatial magic pillar, they will definitely lose their greatest opportunity. ”<br/><br/>The group of holy sons and saintesses from the sacred grounds of the forbidden space were discussing in low voices.<br/><br/>Regarding the small conflict between Wang Xian and the holy sons and Saintesses of the forbidden space, they were only discussing it.<br/><br/>In the ruins of this universe.<br/><br/>With the rules of the unfettered forbidden land and flowing water forbidden land, no one dared to kill each other here!<br/><br/>Furthermore, with the strength of the holy sons and Saintesses of the forbidden space, they might not be a match for Wang Xian!<br/><br/>Although Wang Xian’s ranking was one rank lower than that of the holy sons and Saintesses of the forbidden space, everyone knew that he was concealing his strength.<br/><br/>Wang Xian had become the biggest winner among all the holy sons and Saintesses and Heaven’s pride disciples.<br/><br/>This made many Saint Sons, saintesses, and heaven’s pride disciples extremely envious!<br/><br/>When Wang Xian saw the group of Saint Sons and Saintesses leaving, his gaze swept across the four people in the forbidden space. His body moved and he flew towards the center of this group of demonic pillars!<br/><br/>There was another treasure there, and that was the Void Pagoda!<br/><br/>A void pagoda that was on the same level as an Lie’s!<br/><br/>This kind of Void Pagoda should only be owned by void race experts who were at the peak of the Universe Dominator realm.<br/><br/>Moreover, it seemed that only a few void race experts who were at the peak of the Universe Dominator realm could own one!<br/><br/>It was extremely powerful and also extremely precious.<br/><br/>According to the scene that he had just obtained in his mind, another extremely powerful war machine had been destroyed by the twelve demon pillars. Only this void pagoda was not destroyed!<br/><br/>Wang Xian flew over and sized up the entire Void Pagoda with a twinkle in his eyes.<br/><br/>However, the Void Pagoda had been sealed off and there was no way for him to enter!<br/><br/>Let’s wait for an lie to arrive. The reward this time is already very big<br/><br/>Wang Xian narrowed his eyes slightly. He had unexpectedly obtained the corpse of a powerhouse.<br/><br/>Furthermore, there was his will inheritance on it. This could deepen his understanding of the power of space.<br/><br/>It would also allow him to improve much faster in the future!<br/><br/>He swept his gaze across his surroundings and sat cross-legged on the ground.<br/><br/>A wave of energy wrapped around him.<br/><br/>At the same time, the corpse appeared in front of him.<br/><br/>Due to the special seal, the corpse still contained a terrifying amount of energy!<br/><br/>Wang Xian began to cultivate quietly.<br/><br/>The energy in the ruins of the universe, coupled with the power of space emitted by the corpse, allowed his improvement speed to increase by a lot.<br/><br/>It was much faster than when he was in the Tower of the Moon.<br/><br/>Buzz Buzz<br/><br/>Thousands of years passed by quickly. Wang Xian opened his eyes.<br/><br/>Today was the day he made an agreement with an lie.<br/><br/>“Summon an lie over and enter this void pagoda. In addition, you can enter other war machines and even that divine kingdom! ”<br/><br/>Wang Xian’s eyes were sparkling..\t\t\t\t\t\t</div>", "images": {}, "success": true}