{"id": 994, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073888.html", "title": "Chapter 3996 - Chapter 3996: 3995 Entered The Void Pagoda. It Was A Huge Resource", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3996 - Chapter 3996: 3995 Entered The Void Pagoda. It Was A Huge Resource</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3996: 3995 entered the Void Pagoda. It was a huge resource<br/><br/>Translator: 549690339<br/><br/>Buzz<br/><br/>A demonic altar appeared in front of him. Wang Xian waited quietly.<br/><br/>“Dragon King! ”<br/><br/>Soon, an Lie’s figure appeared. He bowed respectfully to Wang Xian!<br/><br/>“HMM, is everything normal in the Dragon Palace?” Wang Xian asked!<br/><br/>“Dragon King, everything is normal in the Dragon Palace! ”<br/><br/>An lie nodded. Then, he focused his gaze and looked to the side. “Dragon King, is this the Void Pagoda?”<br/><br/>As he spoke, he was slightly shocked. His eyes were glowing.<br/><br/>“Yes, the Void Pagoda. The powerful Void Pagoda. An lie, bring my main body here first. Then, we will enter the Void Pagoda! ” Wang Xian nodded and continued to instruct him!<br/><br/>“It’s the Dragon King! ”<br/><br/>An lie nodded. Very soon, his figure disappeared.<br/><br/>When an lie reappeared, Wang Xian’s main body followed him.<br/><br/>Buzz<br/><br/>Wang Xian merged with him and the powerful force merged again.<br/><br/>He scanned his surroundings and revealed a faint smile.<br/><br/>This space was much more stable compared to the previous space.<br/><br/>However, if he were to launch an attack, he could still destroy this space!<br/><br/>However, this was sufficient.<br/><br/>As long as Wang Xian appeared in the previous space, the space should not be able to withstand it.<br/><br/>At least this space could withstand it!<br/><br/>“An lie, bring me in! ”<br/><br/>Wang Xian looked at the Void Pagoda at the side and said!<br/><br/>Even though his original body was looking at the Void Pagoda, he could sense the powerful energy and power from it!<br/><br/>This void pagoda was not simple. It was much more powerful than the innate supreme treasure.<br/><br/>It was only slightly weaker than the fragment of the Heaven’s origin creation.<br/><br/>This was already very terrifying!<br/><br/>Buzz<br/><br/>Soon, Wang Xian’s body moved and entered the interior of the Void Pagoda.<br/><br/>It was exactly the same as the interior of the dark intense void pagoda!<br/><br/>Similarly, there was a throne at the highest position!<br/><br/>It was the mechanism that controlled the energy here!<br/><br/>Wang Xian scanned his surroundings.<br/><br/>Compared to the Void Pagoda that dark intense obtained, there were a large number of corpses in this void pagoda.<br/><br/>There were at least hundreds of thousands of corpses!<br/><br/>These corpses had two horns and carried a trace of spatial energy!<br/><br/>Their appearances were similar to humans, but their facial features were completely different.<br/><br/>There were many types of skin, and some of them were dark.<br/><br/>Their thick skin was like a layer of armor!<br/><br/>Wang Xian sized them up in astonishment. He came to the front of a corpse and tried to sense it.<br/><br/>“This should be the void race of the Void Universe, an extremely terrifying race!<br/><br/>Wang Xian mumbled. These corpses should have died from the impact of external energy.<br/><br/>Of course, it was also possible that they were trapped here and died!<br/><br/>They had stayed here for more than 20 billion years.<br/><br/>Those who were below the Heaven’s origin and had a lifespan of at most one calamity.<br/><br/>That was more than 30 billion years of life!<br/><br/>Since the birth of these void creatures, they had definitely exceeded the limits of life!<br/><br/>Wang Xian looked at these corpses.<br/><br/>There were many treasures on the bodies of these corpses.<br/><br/>The weapons looked like swords, but they were slightly different from swords.<br/><br/>There were sawteeth on them!<br/><br/>Of course, these things could also be used as swords!<br/><br/>“There are quite a number of treasures. ”<br/><br/>Wang Xian revealed an excited expression and kept these sharp swords.<br/><br/>Some of the sharp swords were comparable to innate treasures.<br/><br/>There were dozens of such sharp swords!<br/><br/>This was definitely a huge income.<br/><br/>“Other than the weapons, there aren’t any resources.”<br/><br/>Wang Xian checked around and didn’t find any elixirs.<br/><br/>Perhaps it was due to the passage of time that the elixirs had evaporated!<br/><br/>He moved his body and arrived at the seat of the throne.<br/><br/>He sat on it and channeled the power of space into it!<br/><br/>However, what surprised Wang Xian was that he couldn’t open the Void Pagoda.<br/><br/>“What’s going on? This void pagoda is already ownerless. I Can’t activate it?”<br/><br/>(‘I can’t refine it into my own treasure?”<br/><br/>Wang Xian was astonished. Waves of energy were injected into it but there was still no reaction!<br/><br/>“What’s the reason? Special bloodline and Physique?”<br/><br/>Wang Xian frowned slightly and looked at an lie who was beside him. “An lie, give it a try!”<br/><br/>Wang Xian sat on the throne and injected energy into the tower.<br/><br/>Immediately, waves of energy were injected into the tower. The entire void Pagoda reacted as well!<br/><br/>“An lie can do it, but it’s impossible for him. Is it because an Lie’s physique is similar to that of the Void Race?”<br/><br/>Wang Xian guessed in his heart when he saw this scene.<br/><br/>Some clans had their own unique weapons. Other than the experts from their own clans, the other experts could not control them.<br/><br/>This was not impossible!<br/><br/>This was the case with the Void Pagoda. Even if Wang Xian obtained an ownerless Void Pagoda, he could not control it!<br/><br/>This made him look disappointed.<br/><br/>The power of the Void Pagoda was beyond doubt.<br/><br/>But unfortunately, he could not control it!<br/><br/>“Dragon King, to control this void Pagoda, you may need a special physique.<br/><br/>My physique is similar to that of the Void clan, so I can refine it. ”<br/><br/>An lie replied, “In addition, Dragon King, this void pagoda is already ownerless. I found a living space in this void pagoda. I’ll open it for you! ”<br/><br/>Buzz! Buzz<br/><br/>As he spoke, a space appeared behind him!<br/><br/>It was an incomparably huge space. There was a place to rest and a place to live.<br/><br/>There was also a place to plant spiritual herbs and treasures! “Oh? There are treasures inside this void Pagoda?”<br/><br/>Wang Xian was slightly taken aback. He immediately flew over.<br/><br/>“Yes, Dragon King. The void pagoda is like the nest of a race. This is like the insect race having their own mother nest! ”<br/><br/>“According to my understanding, the void race is divided into many races. They are not completely unified. Many small races of the void race fight for themselves. The Void Pagoda is divided into two types. This is the first type, which belongs to the nest of those small races.”<br/><br/>“It is their survival base. The disciples of the Void race born in this survival base constantly build and strengthen this void pagoda. ”<br/><br/>“The second type of Void Pagoda is a weapon that belongs to the top-notch experts. It’s just like the Void Pagoda that I have now. It’s a true void royal clan. It’s a weapon that is used for expeditions and battles. It’s not used for survival! ”<br/><br/>An lie introduced it to Wang Xian.<br/><br/>This made him nod his head.<br/><br/>Void clan, void royal clan.<br/><br/>The royal clan didn ‘t say that they had complete control over all the disciples of the Void clan.<br/><br/>There were still some tribes that fought on their own. When the War of calamity began, they would plunder resources and snatch treasures.<br/><br/>This void pagoda should belong to a tribe in the Void universe.<br/><br/>They aimed at the sword and the magic universe, hoping to obtain the spatial treasures here.<br/><br/>However, they were left here.<br/><br/>“No wonder this void pagoda is slightly different from you, an lie. However, their levels shouldn’t be too different! ”<br/><br/>Wang Xian mumbled as he stared at the space in front of him..\t\t\t\t\t\t</div>", "images": {}, "success": true}