{"id": 991, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073882.html", "title": "Chapter 3993 - Chapter 3993: On The 3992 Memory Inheritance", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 3993 - Chapter 3993: On The 3992 Memory Inheritance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 3993: On the 3992 memory inheritance<br/><br/>Translator: 549690339<br/><br/>Wang Xian’s arrival attracted the attention of some holy sons and Saintesses in this space.<br/><br/>They looked over and their eyes were sparkling. “It’s that Wang Xian, the holy son.”<br/><br/>One of the Holy Sons spoke when he saw Wang Xian.<br/><br/>The saintesses beside him took a glance at Wang Xian and nodded.<br/><br/>They didn ‘t say anything.<br/><br/>There were twelve demon pillars here. Within each of the demon pillars was an expert who was once at the peak of the universe as a ruler of the sword and Magic Universe.<br/><br/>During the last calamity, they used the demon pillars to kill a bunch of external enemies.<br/><br/>One of the enemies even possessed extremely terrifying battle equipment!<br/><br/>These demon pillars contained vast amounts of energy and their understanding of Magic!<br/><br/>If one was lucky, they could even absorb the spiritual energy of the remaining experts.<br/><br/>If this spiritual energy was absorbed in the future, it would be equivalent to obtaining a terrifying inheritance.<br/><br/>It depended on how much spiritual energy was absorbed.<br/><br/>If it was too much, it would be even more terrifying than a magic mantle inheritance!<br/><br/>In addition, if one was able to enter the interior of this magic pillar, they would also be able to obtain the treasures of this expert.<br/><br/>The magic staff in one’s hand, the magic clothes on one’s body, and the treasures within the spatial items.<br/><br/>However, it wasn’t so easy to enter the inner part of the demon pillar.<br/><br/>One had to obtain the approval of some energy and spirit within.<br/><br/>In addition, if one wanted to enter this space, one had to first pass through the spatial passageway. Only those who had reached the level of a universe ruler at level three could enter.<br/><br/>Of course, one could also enter with powerful defensive treasures.<br/><br/>For example, the unfettered forbidden land and flowing water forbidden land. They had 20 to 30 disciples who entered this place.<br/><br/>Wang Xian scanned his surroundings and sensed this place.<br/><br/>“The spatial energy here is very stable. Even if my main body enters this place, this place will not collapse! ”<br/><br/>As he sensed it, his eyes sparkled.<br/><br/>His body moved and arrived in front of a demon pillar.<br/><br/>There were twelve demon pillars with various attributes. There was also one with the space attribute!<br/><br/>When Wang Xian arrived, four figures were kneeling in front of the demon pillar.<br/><br/>His gaze swept across the four figures and knew that they were the holy sons and Saintesses of the forbidden space.<br/><br/>The holy sons and Saintesses of the forbidden space also sensed Wang Xian’s arrival and looked at him.<br/><br/>“This is a senior of our forbidden space, holy son Wang Xian. I hope you won’t be unreasonable. ”<br/><br/>The saint son Xu Ni looked at Wang Xian and said faintly.<br/><br/>“Of course! ”<br/><br/>Wang Xian nodded his head. He came to the front of the demon pillar and used his hand to sense it!<br/><br/>The entire demon pillar should be a part of a huge magic formation.<br/><br/>The demon pillar still contained a vast amount of energy.<br/><br/>These demon pillars seemed to be able to absorb the energy of Heaven and Earth on their own initiative.<br/><br/>The energy in this space was much denser than the previous space because of these demon pillars!<br/><br/>Buzz<br/><br/>Wang Xian infused some space energy into it. In an instant, waves of killing intent rushed into his mind!<br/><br/>His expression changed slightly. Following that, he felt a change in his vision. Waves of vast killing intent, a vast battlefield, and a terrifying battle surged into his mind!<br/><br/>This vast killing intent could even destroy his brain and soul!<br/><br/>“Eh? You’re courting death. You actually dared to infuse energy into the demon pillar. Once the energy enters the demon pillar, the energy and some of the will on the demon pillar will surge into your mind and destroy all of Your Life Force !<br/><br/>The saintess from the forbidden space was slightly stunned when she saw Wang Xian injecting energy into the demon pillar. Following that, a mocking expression appeared on her face.<br/><br/>“Saintess, he seems to have suffered the impact of the energy will. He is going to be done for.”<br/><br/>“It would be interesting if this Wang Xian saintess dies here. After all, he came from a small place. He doesn’t know anything about the things in the universe ruins. Under such circumstances, acting rashly would take his life! ”<br/><br/>The other Heaven’s pride sons from the forbidden space were also slightly stunned when they saw this scene!<br/><br/>They shook their heads and spoke with slight mockery and sympathy!<br/><br/>“Although this place is relatively safe, there are also many hidden killing intent. This saint Wang Xian is about to be destroyed by the energy will of this demonic pillar! ”<br/><br/>The Saint Xu Ni from the forbidden space also shook his head and spoke!<br/><br/>“Huh?”<br/><br/>The commotion over here also attracted the attention of the saint sons and saintesses beside the demon pillars.<br/><br/>They looked over and revealed a stunned expression.<br/><br/>“It can’t be. That saint son Wang Xian used his energy to touch the demon pillars? Is He going to die?”<br/><br/>“This? ? If he were to die directly, he would be the most miserable saint son.<br/><br/>He just arrived here and died here at the demon pillars?”<br/><br/>Some of the saint children, saintesses, and heaven’s favorites said with a confused expression.<br/><br/>At this moment, Wang Xian could indeed sense waves of vast killing intent surging over. At the same time, a scene of a battlefield appeared in his mind.<br/><br/>In the scene, he seemed to have turned into a spatial cultivator with powerful abilities.<br/><br/>There were eleven other existences of the same level as him in the surroundings.<br/><br/>Their bodies trembled, and a magic pillar shot into the sky.<br/><br/>The 12 of them moved their bodies and instantly flew toward the enemies in front of them.<br/><br/>In the center of this group of enemies, there was an enormous space war machine, and there was a strange mountain filled with deathly stillness.<br/><br/>There were also more than 10 Pinnacle Universe Masters.<br/><br/>They rushed over, and a terrifying battle erupted.<br/><br/>Using the power of the Magic Array, they destroyed the silent and Strange Mountain Peak.<br/><br/>They destroyed many experts at the peak of the Universe Dominator realm.<br/><br/>Only the space war machine was not destroyed.<br/><br/>However, this war machine was completely suppressed by them.<br/><br/>Two experts who contained the terrifying power of space charged out from the war machine, trying to open a path.<br/><br/>At this moment, Wang Xian saw ‘himself’waving the magic scepter in his hand. The entire space was enveloped.<br/><br/>The surrounding space collapsed and ruptured. They entered a new space directly!<br/><br/>Roars.<br/><br/>Sounds of battle.<br/><br/>A terrifying killing intent filled the entire space.<br/><br/>In the end, the two space-attributed experts were annihilated by them.<br/><br/>However, the twelve of them had exhausted all their vitality.<br/><br/>They exchanged a glance and a throne appeared behind them. They sat on it.<br/><br/>Death!<br/><br/>Death!<br/><br/>However, that invincible aura and the terrifying killing intent were still surging in this space.<br/><br/>It was an extremely heroic battle!<br/><br/>Buzz Buzz Buzz<br/><br/>Under this will, Wang Xian was like a small boat.<br/><br/>However, his body trembled as his powerful will and mental strength resisted<br/><br/>His mind remained clear. All the killing intent did not affect him at all.<br/><br/>Wang Xian stood there quietly for a long time, more than ten days.<br/><br/>He slowly opened his eyes and a smile appeared on his face.<br/><br/>He did not expect that a casual touch would yield such a harvest!\t\t\t\t\t\t</div>", "images": {}, "success": true}