{"id": 1005, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073910.html", "title": "Chapter 4007 - Chapter 4007: 4006, On Top Of The Devil Beast Abyss", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4007 - Chapter 4007: 4006, On Top Of The Devil Beast Abyss</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4007: 4006, on top of the Devil Beast Abyss<br/><br/>Translator: 549690339<br/><br/>Saint Wang Xian. ”<br/><br/>Saint Wang Xian. ”<br/><br/>Wang Xian brought along the dragon’s Roar and flew towards the first level of the universe ruins.<br/><br/>In the surrounding area, some of the sons and daughters of heaven greeted him with sparkling eyes.<br/><br/>Although Wang Xian kept a low profile in the universe ruins, the 12 devil pillars were destroyed by him.<br/><br/>He had also traded a large number of treasures.<br/><br/>His strength was comparable to the undeserved saint son, the flowing water saintess, tens of millions of years ago.<br/><br/>The rest of the saint sons and Saintesses greeted him warmly when they saw him.<br/><br/>After all, Wang Xian had obtained the corpse of a spatial attribute powerhouse.<br/><br/>With his terrifying talent and the resources in his hands, he was almost 100% certain that he would step into the peak of the Universe Overlord Realm!<br/><br/>Even the saint sons and Saintesses of the top ten forbidden holy grounds and Saint Academies had a trace of respect for Wang Xian!<br/><br/>The strong were respected. In their eyes, Wang Xian was the future top-notch expert in the entire universe.<br/><br/>Okay!<br/><br/>Wang Xian nodded his head faintly at them and continued to fly forward!<br/><br/>They arrived at the first level, where they had entered.<br/><br/>At the front, all the Saint Sons, saintesses, and heaven’s favorites had arrived.<br/><br/>He swept his gaze across the area. There weren’t many heaven’s favorites disciples who had died here.<br/><br/>It was still very safe in the ruins of the universe.<br/><br/>At the front of the center, a group of disciples from the unadulterated forbidden ground and flowing water forbidden ground were standing there.<br/><br/>At the front were the saint sons and Saintesses of flowing water!<br/><br/>When Wang Xian arrived, the two of them seemed to have sensed something as they looked at him.<br/><br/>Their gazes landed on Wang Xian as their eyes sparkled.<br/><br/>“Holy son Wang Xian, Congratulations on your breakthrough again. You’re really amazing! ”<br/><br/>When the unadulterated holy son sensed Wang Xian’s current strength, a hint of surprise flashed across his eyes as he exclaimed slightly!<br/><br/>“Holy son of unadulterated barbarians, haven’t you also broken through?<br/><br/>Wang Xian’s gaze landed on the Holy Son Wu Man. He had already broken through to the sixth level of the universe dominator.<br/><br/>(‘I only broke through one level when I came to the universe ruins. I’m not like Holy Son Wang Xian who broke through two levels!”<br/><br/>The Holy Son Wu Man smiled.<br/><br/>“Now, holy son Wang Xian’s strength is no longer weaker than ours!”<br/><br/>Saintess Liu Yue, who was at the side, also smiled faintly.<br/><br/>Wang Xian smiled and brought the group of disciples from the Dragon Roar Forbidden Ground to the front!<br/><br/>“Saint Wang Xian, there will be actions and matters in the future. If there’s a chance, let’s work together! ”<br/><br/>Saint Wu Man looked at Wang Xian and continued!<br/><br/>Wang Xian raised his eyebrows and revealed a curious expression. “What’s<br/><br/>“Regarding the matter of the abyss of Magical Beasts, Hehe, we only heard from some seniors in the forbidden land. We don’t know the details yet! ” The undeserved holy son said with a smile.<br/><br/>“I’ve also heard some of it. Before the arrival of the calamity, we have to get rid of the abyss of Magical Beasts. We have to completely get rid of the internal troubles and welcome the arrival of the calamity! ”<br/><br/>The flowing moon Saintess said from the side.<br/><br/>“Get rid of the abyss of Demonic Beasts? Speaking of which, Pve never been to the abyss of Demonic Beasts before! ”<br/><br/>Wang Xian’s eyes flickered slightly as he spoke.<br/><br/>“Hehe, the sage Wang Xian will be there soon. All of us have to participate in the battle and enter the Abyss! ”<br/><br/>The undeserved sage said to him.<br/><br/>This involved the decision-making of the experts from the sacred grounds of the forbidden grounds.<br/><br/>The two of them didn’t say much, and Wang Xian didn’t ask any further. They should be able to find out once they left this place!<br/><br/>“This Wang Xian holy son is actually on equal footing with the flowing moon Saintess and unexpected holy son. He’s really amazing! ”<br/><br/>“This Wang Xian holy son’s current realm has already reached the level five of the universe dominator. His cultivation speed is really terrifying!”<br/><br/>“The space attribute is at the level five of the universe dominator. In addition, he has a large number of treasures and resources in his hands, as well as the spiritual will of a top-notch expert of the space attribute who absorbed the previous calamity. He has inherited the inheritance. In the future, as long as this Wang Xian doesn’t suffer any losses, he will definitely be the strongest expert in our universe! ”<br/><br/>“That’s right. Due to the space attribute, the strength of the flowing moon<br/><br/>Saintess and the unexpected holy son might not be as strong as that Wang Immortal in the future. It’s only right for the two holy sons and Saintesses to befriend Wang Immortal! ”<br/><br/>The surrounding holy sons and saintesses, as well as the heaven’s pride disciples, were all amazed when they saw this scene.<br/><br/>One had to know that the flowing moon Saintess and the unexpected holy son were the most elite existences in the two forbidden areas.<br/><br/>Even if it was the space forbidden ground, the false saint, these two saintesses wouldn’t show off their colors!<br/><br/>They wouldn’t even greet them.<br/><br/>This saint from the dragon roar forbidden ground was able to make them treat him in such a manner. This shocked everyone.<br/><br/>Even the Saintess from the unexpected forbidden ground and the flowing water forbidden ground’s saint didn’t interrupt!<br/><br/>It could be said that in this generation, the flowing moon Saintess, the uncivilized saint, and the Wang Xian saint were on the same level!<br/><br/>“The passageway is about to open! ”<br/><br/>Wang Xian chatted with them. Not long after, a passageway appeared in front of them!<br/><br/>“Everyone, exit in ten seconds! ”<br/><br/>The honesty saint son spoke and gestured to Wang Xian, the flowing moon Saintess, and the rest before flying straight ahead. Wang Xian and the rest also flew out immediately!<br/><br/>Buzz<br/><br/>Soon, the scene in front of them started to rotate.<br/><br/>They returned to the place where they came in.<br/><br/>“Everyone, come out. Let’s Go! ”<br/><br/>At the side, two powerhouses at the peak of the ruler realm were waiting in the unfettered forbidden land and flowing water forbidden land.<br/><br/>Their eyes swept across them. With a wave of their arms, they left quickly with them!<br/><br/>Soon, they arrived at the Tianyuan Peak again.<br/><br/>What surprised Wang Xian and the rest was that in the Tianyuan Peak, there were a large number of powerhouses from the sacred grounds of the forbidden land.<br/><br/>In fact, there were even more strong practitioners in the dragon roar forbidden grounds than when they were sent here.<br/><br/>At the front of the group, an old man was sitting there with a strong aura.<br/><br/>“A master of the universe at level nine. Is this the founder of the Dragon Roar Forbidden Grounds?”<br/><br/>Wang Xian swept his gaze across the old man and guessed in his heart!<br/><br/>The group of experts from the forbidden ground and the Saint Academy had gathered here again. It should be related to the abyss of Demonic Beasts.<br/><br/>According to the news from the barbarian saint son and Saintess Liu Yue.<br/><br/>Next, they had to deal with the threat of the abyss of Demonic Beasts. “Not bad, not bad. The improvement this time is not bad. The opportunities are not bad either! ”<br/><br/>All of Wang Xian’s disciples were brought to the Tianyuan Peak. An old woman who was sitting in the middle said faintly!<br/><br/>“It’s not bad indeed. The demon pillar that hasn’t been broken in more than 20 billion years has been broken by all of you. This will bring many experts to our sword and Magic Universe before the Apocalypse. ”<br/><br/>At the undeserved forbidden ground, an old woman nodded her head.<br/><br/>Their gazes landed on the figures of Wang Xian and the rest.<br/><br/>They were aware of what happened in the ruins of the universe.<br/><br/>They also knew which disciples had absorbed the corpses of the powerhouses in the magic pillar!<br/><br/>“Cultivate well. Don’t waste the treasures of one of our universe’s great calamity seniors. Inherit their will and protect our sword and the magical universe! ”<br/><br/>Another powerhouse from the Holy Land spoke from the side..\t\t\t\t\t\t</div>", "images": {}, "success": true}