{"id": 1007, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073914.html", "title": "Chapter 4009 - Chapter 4009: The Origin Of The 4008 Demonic Beast Abyss, The Plan!", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4009 - Chapter 4009: The Origin Of The 4008 Demonic Beast Abyss, The Plan!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4009: The origin of the 4008 Demonic Beast Abyss, the plan!<br/><br/>Translator: 549690339<br/><br/>Around the Tianyuan Peak, a group of strong disciples from the forbidden grounds looked in the direction of the Dragon Roar Forbidden Ground with jealousy!<br/><br/>Their eyes were burning with passion and were slightly red!<br/><br/>This was too enviable!<br/><br/>If long yinyin and long Yinhao didn’t die and continued to grow, then the dragon roar forbidden ground would completely rise up.<br/><br/>In addition, there was also that Wang Xian in the dragon roar forbidden ground.<br/><br/>He was an existence with heaven-defying talent.<br/><br/>How could they not be envious?<br/><br/>However, some people were jealous while others were filled with unwillingness.<br/><br/>At the Space Forbidden Ground, the holy sons and Saintesses of the space forbidden ground stood in front of a group of experts. Their gazes swept past Wang Xian and revealed a hint of coldness!<br/><br/>This time, their space forbidden ground didn’t obtain any fortuitous opportunities.<br/><br/>The space-type demon pillar was obtained by Wang Xian, but they didn ‘t get anything!<br/><br/>Furthermore, Wang Xian didn’t put them in his eyes at all. This also caused them to hold grudges and anger in their hearts!<br/><br/>Their space-type forbidden ground was the third-ranked forbidden ground, yet someone dared to look down on them?<br/><br/>Other than the holy sons and Saintesses of the space-type forbidden ground and the Heaven’s favorites, the holy son of the flowing water forbidden ground also glanced at long yinyin and long Yinhao with a sinister gaze from time to time!<br/><br/>His heart was filled with unwillingness!<br/><br/>As the holy son of flowing water forbidden ground, he actually couldn’t obtain a water element magic pillar.<br/><br/>Instead, it was obtained by two people who were countless times weaker than him and whose status was completely inferior to his!<br/><br/>He was unwilling!<br/><br/>However, even if he was unwilling, he wasn’t willing to show it.<br/><br/>This time, flowing water forbidden ground obtained a large amount of benefits. The seniors in the forbidden ground wouldn’t burn the bridge after crossing the river!<br/><br/>“Alright, I’ve called you all here today because I have something to announce.<br/><br/>This matter also concerns the plans and development of our entire universe! ”<br/><br/>At this moment, a powerhouse from the undeserved forbidden land at the front opened his mouth and spoke slowly.<br/><br/>His voice entered everyone’s ears.<br/><br/>When all the powerhouses from the sacred lands and Saint Academy heard this, their hearts went blank. They immediately stopped talking and listened attentively.<br/><br/>This time, the unfettered forbidden grounds and flowing water forbidden grounds had attracted all the experts from the forbidden grounds. They definitely had something big to announce.<br/><br/>Wang Xian sat beside the forefather of the dragon roar forbidden ground and looked over as well!<br/><br/>“There are still three billion years before the arrival of the calamity. Before that, we have to make sufficient preparations to deal with the arrival of the calamity! ”<br/><br/>“When the calamity arrives, all the forbidden grounds and the Saint Academy will form a united front to deal with the outside world. However, before that, we have to settle down first. Currently, there is still a huge hidden danger in our sword and Magic Universe! ”<br/><br/>“Yes, it is a huge hidden danger for us. That is the abyss of Demonic Beasts. Everyone only knows about the abyss of Demonic Beasts. You should not know how the abyss of Demonic Beasts was formed, right?”<br/><br/>The elder from the undeserved forbidden land said as his gaze swept across everyone.<br/><br/>When all of the experts from the forbidden lands and sacred academies heard this, their hearts trembled slightly. Next, they might be able to touch upon the secrets of the entire universe!<br/><br/>“The abyss of Magical Beasts is a terrifying domain formed by the blood of experts dripping down. This involves the great battle of the last calamity, and it involves the enemy of our sword and Magic Universe, the Mad Demon Universe. ”<br/><br/>“Over at the abyss of Magical Beasts is the blood of a heaven-born mad demon. In addition to the loss of his arms and four limbs, as well as the blood of countless other mad demons, the Demon Beast Race was born. ”<br/><br/>“These demon beasts don ‘t have any rationality and are extremely violent. Once the calamity arrives, they will very likely become the eagle and dog of the<br/><br/>Mad Demon Universe. Therefore, we have to destroy them. ”<br/><br/>“The main reason for choosing this time is to temper the disciples and the Great Beings of the Forbidden Land Sacred Land Sacred Academy. It will be bloody! ”<br/><br/>The great being from the undeserved forbidden land continued to speak!<br/><br/>“Medicine ancestor, are we going to completely eradicate the Demon Beast<br/><br/>Abyss?” ? “I heard that there are quite a few pinnacle universe rulers in the<br/><br/>Demon Beast Abyss. There are dozens of them. Some of them are even at the<br/><br/>Pinnacle Universe ruler realm. They aren’t easy to deal with!”<br/><br/>A great being of the sacred land couldn’t help but speak.<br/><br/>“We have to eliminate them all. Also, unless the time comes, the pinnacle universe rulers of the undeserved forbidden land and flowing water forbidden land won’t make a move. ”<br/><br/>The old man known as medicine ancestor replied.<br/><br/>“Our Lord has said that if we can not even finish off a small Demon Beast Abyss, then we will not survive the calamity. This time, after understanding the Demon Beast Abyss, there is one more thing that will allow a group of strong disciples to rise quickly. War and slaughter will always be the fastest way to give birth to strong disciples. Although it is a little cruel, our sword and magic universe can not wait that long! ”<br/><br/>“The disciples who have been to the ruins of the universe should have seen a corner of the war. Most of the experts here were born in this calamity. Your Parents ‘Generation may have survived the last calamity, but they probably didn’t tell you how cruel the calamity was!”<br/><br/>“Other than the two lords, the seniors of the previous calamity have already reached the end of their lives. They won’t tell you that in the last calamity, there were less than 1,000 ruler-level experts in our sword and magic universe who survived.”<br/><br/>“They won’t tell you that less than 1% of our entire universe’s population survived! ”<br/><br/>At the Flowing Water Forbidden Ground, an old woman spoke indifferently.<br/><br/>Although his tone was calm, his words made people shudder!<br/><br/>There were countless people in the sword and magic universe, billions of them, and less than 1% of them survived.<br/><br/>Only a few of the 100 million people could survive.<br/><br/>And the Lords mentioned by the old woman in the flowing water forbidden land were naturally two heavenly fate existences.<br/><br/>“Therefore, only the strong can survive. However, compared to the last calamity, we have one more heavenly fate. Our lords in the flowing water forbidden land only broke through at the later stage of the Calamity! ”<br/><br/>“This time, clearing the Devil Beast Abyss can be considered a training for all the strong disciples. The corpses of the Devil Beasts are also a huge resource for our universe! ”<br/><br/>The old woman of the flowing water forbidden land continued! “Granny Sha, how do we clear the Devil Beast Abyss?”<br/><br/>“Do you have any plans?”<br/><br/>An old man of the Sacred Institute asked.<br/><br/>Send all the experts from the Sacred Institute. We’ll form an army and let all the elite core disciples participate. All the disciples heading to the ruins of the universe will participate! ”<br/><br/>“Only those who have experienced blood can survive the calamity and protect our universe. Of course, we can’t lose too much either. Experience is the main thing. ”<br/><br/>“Although the peak-level masters of the two forbidden lands won’t make a move, at least one-third of the masters of the ninth level and below will participate. ”<br/><br/>“If You Holy Lands and sacred academies want to become stronger in the future, send more disciples. Those Demon Beast corpses are the largest resources in our universe. ”<br/><br/>The old witch of the flowing water forbidden land said..\t\t\t\t\t\t</div>", "images": {}, "success": true}