{"id": 1009, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073918.html", "title": "Chapter 4011 - Chapter 4011: The 9Th Level Of The 4010 Demonic Beast Abyss!", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4011 - Chapter 4011: The 9Th Level Of The 4010 Demonic Beast Abyss!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4011: The 9th level of the 4010 Demonic Beast Abyss!<br/><br/>Translator: 549690339<br/><br/>“Whoosh! Whoosh! Whoosh! ”<br/><br/>When Wang Xian and the rest arrived at the area of Tianyuan City.<br/><br/>From the surrounding areas, the strong disciples from the sacred grounds and the Sacred Academy also rushed over quickly!<br/><br/>One by one, the strong ones flew in the air.<br/><br/>There were also the strong ones from the sacred grounds who were riding on huge magic weapons!<br/><br/>Or perhaps they were flying on their flying swords!<br/><br/>“Dong Dong Dong! ”<br/><br/>“Dong Dong Dong! ”<br/><br/>At this moment, the sound of drums was heard from the front!<br/><br/>The sound of drums shook the sky and was filled with a murderous atmosphere!<br/><br/>“Let’s Go! ”<br/><br/>A shout came from the front and everyone flew towards the sound of drums!<br/><br/>Wang Xian and the rest also flew towards the sound of drums. When they arrived, there was a general stage in front of them!<br/><br/>It was an extremely huge arena!<br/><br/>In the middle of the arena, there was a drum beating with a robust middle-aged man beating on it!<br/><br/>The strong disciples from the unfettered forbidden land, flowing water forbidden land, had arrived!<br/><br/>They were standing in front of the drum beating!<br/><br/>The lineup was not arranged according to the various forbidden lands, but according to their strength!<br/><br/>A group of powerhouses at the peak of the Universe Overlord realm stood at the front.<br/><br/>They were facing everyone!<br/><br/>As for the rest, be it the universe overlord realm level nine or level eight, they were all standing at the place where the top powerhouses were facing.<br/><br/>The front row was dominated by level nine while the second row was dominated by level eight.<br/><br/>Then, they were lined up in order!<br/><br/>However, as the space attribute, the ones who dominated the level five realm were lined up together with the others who dominated the level six realm!<br/><br/>Wang Xian looked over and his eyes sparkled!<br/><br/>He separated from the dragon roar, Yin Longyin Hao, and the others and stood where they belonged!<br/><br/>“All the strong disciples from the sword and Magic Universe have arrived,<br/><br/>The medicine ancestor from the unexpected forbidden ground glanced at them and said faintly.<br/><br/>“Since we are all here, let me explain. Our Formation is to deal with the calamity. Regardless of which forbidden ground or Holy Land we belong to, before the calamity arrives, we only have one camp. That is, the sword and<br/><br/>Magic Universe will fight against the enemy together!”<br/><br/>Magic Universe will fight against the enemy together! ”<br/><br/>Medicine ancestor said in a deep voice, and his majestic voice entered everyone’s ears.<br/><br/>His face was also filled with a solemn expression!<br/><br/>“Next, we will first clear out the outer area of the Demon Beast Abyss in small teams. After clearing out the outer area, the Demon Beasts in the Demon Beast Abyss will be threatened. The Great Beings among them will lead their race to fight back, and when the time comes, we will fight in the form of an army<br/><br/>“In addition, in Demon Beast Abyss, the Demon Beasts at the pinnacle level of universe ruler will be watched by a group of great beings from the Forbidden Holy Land and the Sacred Academy. You Don’t have to worry about them. However, you need to be careful and deal with the demon beasts at level eight or nine of universe ruler<br/><br/>“Now, you can form small teams to fight against each other. The difference in levels should not exceed three!”<br/><br/>Medicine ancestor continued to give orders!<br/><br/>“After forming teams, those below the universe knight level will be sent over first. After that, those at the universe ruler realm will be sent over. As for those above the universe ruler Level 7, head directly to the fourth level of the Demon Beast Abyss! ”<br/><br/>Medicine ancestor started to give orders!<br/><br/>The Great Beings from the forbidden lands and the Sacred Academy immediately responded!<br/><br/>This was a battle that would determine the future of the calamity. Without the forbidden lands and the sacred academy, they would cower.<br/><br/>Furthermore, they couldn’t cower either.<br/><br/>With the arrival of the universe, they would be a whole without any power!<br/><br/>This situation wasn’t just limited to the sword and Magic Universe. It was the same for the 9-origin universe and the belief universe!<br/><br/>In the 24 temples of the belief universe, there were still conflicts between some temples.<br/><br/>However, when it came to defeating the other universes, they would work together!<br/><br/>The peak races of the 9 -origin universe rarely communicated with each other, but when they faced other universes, they would work together as well!<br/><br/>Even the battle between the Dragon Palace and the Phoenix Clan’s Angel clan would be put aside for the time being when they were facing enemies outside.<br/><br/>However, in the future, the Dragon Palace, the Phoenix clan, and the Angel clan would be in a state where they would fight to the death!<br/><br/>“Alright, all the strong disciples, prepare to form a team and enter! ” The medicine ancestor waved his hand!<br/><br/>Saint Son Wang Xian, are you interested in forming a team?”<br/><br/>At the side, the saintess from the flowing water forbidden ground looked at Wang Xian and asked with a smile.<br/><br/>“I think our generation can join forces! ”<br/><br/>The Saint Son Wu Man also smiled and said to Wang Xian!<br/><br/>The flowing moon Saintess and the barbarian saint were the top existences of their generation. The ones they wanted to team up with were either the strong disciples from the same forbidden area or the strong disciples from the same generation.<br/><br/>However, it was obvious that they wanted to team up with the strong ones from the same generation.<br/><br/>There was a huge benefit to this. They had different attributes and possessed different powerful spells and sword techniques.<br/><br/>In this way, they could complement each other in battle. It was much better than forming a team with the experts from the same forbidden area!<br/><br/>Furthermore, they could be considered to be befriending the experts from the same generation.<br/><br/>Clearly, Wang Xian, who possessed the spatial attribute, would be able to reach the peak of the Overlord realm as long as he didn’t die in the future. They still wanted to befriend him.<br/><br/>Even their seniors in the forbidden area had said that they could befriend Wang Xian. As long as he didn’t die in the future, he would definitely be one of the top existences in their universe.<br/><br/>To be able to get such an evaluation from the experts in their race who were at the peak of the Overlord realm, it was only natural for them to befriend him!<br/><br/>“Yes, that’s fine!”<br/><br/>Wang Xian hesitated for a moment and nodded. Then, he said, “I need to bring two junior brothers and sisters! ”<br/><br/>“Of course, that’s not a problem. Long yinyin and long yinhao, the two junior brothers and sisters. Their talents are enough to join us. In addition, we will also have some junior brothers and sisters joining us! ”<br/><br/>Saintess Liuyue nodded her head.<br/><br/>“In addition, we are also prepared to invite the powerful heaven’s favorites from the other forbidden grounds of the Holy Land to fight together! ”<br/><br/>The Barbarian Saint continued.<br/><br/>“Alright! ”<br/><br/>Wang Xian nodded his head and didn’t refuse!<br/><br/>After entering the abyss of Demonic Beasts, Wang Xian, the body of the Void Dragon, was prepared to train with a group of strong disciples.<br/><br/>Wang Xian’s original body would enter the abyss of Demonic Beasts alone.<br/><br/>If he wanted to obtain more resources, he would have to rely on his original body!<br/><br/>“Since that’s the case, let’s form a temporary team! ”<br/><br/>The Barbarian saint smiled and scanned his surroundings. “Those of the same<br/><br/>generation as us, masters of the universe with cultivation levels above level<br/><br/>three, can join our team!”<br/><br/>“Barbarian saint, Let’s join! ”<br/><br/>“The Barbarian Saint Son, we can, right?”<br/><br/>Hearing this, the eyes of the holy sons and saintesses from the other forbidden lands twinkled. Those who were qualified immediately walked over!<br/><br/>They didn’t join because they wanted to gain experience alone.<br/><br/>If they wanted to gain experience, it would be safer for them to follow the great beings from their forbidden lands.<br/><br/>However, if they joined this team, they would be able to befriend the barbarian Saint Son, the flowing moon Saint Son, and the others.<br/><br/>If they fought together, their friendship would be different!<br/><br/>In the future, the wildless Saint Son and the flowing moon Saintess would also be publicly acknowledged as the future rulers of the peak as long as they didn’t die midway.<br/><br/>Furthermore, it would be very difficult for them to die with their background.<br/><br/>Even if they died, they would still have treasures to revive them..\t\t\t\t\t\t</div>", "images": {}, "success": true}