{"id": 1004, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073908.html", "title": "Chapter 4006 - Chapter 4006: 4005 Another Breakthrough, 80 Million Years", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4006 - Chapter 4006: 4005 Another Breakthrough, 80 Million Years</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4006: 4005 another breakthrough, 80 million years<br/><br/>Translator: 549690339<br/><br/>Now, he had no idea how strong Wang Xian was.<br/><br/>Even without the help of the heaven origin fragment, he could easily kill a powerhouse at the peak of the universe dominator. With a thought, Wang Xian looked at his attributes.<br/><br/>Name: Wang Xian<br/><br/>Race: Nine-origin Divine Dragon (man-dragon unity)<br/><br/>Level: Universe Overlord Level 6(nine transformations return to one)<br/><br/>Origin: 1% (99% needed for the next breakthrough)<br/><br/>Supernatural ability: rule the water race (rule the water race below one’s level)<br/><br/>Devour living beings (devour living beings to extract origin)<br/><br/>Control of the five elements<br/><br/>Cultivation Method: Divine Dragon Transformation<br/><br/>Supernatural ability: soul capture, spirit attachment<br/><br/>Law supernatural ability: Dragon Eye Lock, five-element Dragon Claw,<br/><br/>Yin-yang realm-breaking, eight luminaries dragon scale, Holy Dragon Shadow, Heavenly Dragon Eight Tribes, Dragon Tomb, Cloud Dragon Soaring, True Dragon body<br/><br/>Laws and Abhijnas: eight Dragon Pillars, eight dragon clones, towering dragon horns, Mighty Heavenly Dragon, Divine Tail Pearl, Life Dragon Breath, Shadow Dragon Clone, Netherworld Dragon Pursuit, Netherworld Dragon<br/><br/>Transformation, wind and Thunder Dragon Birth, Mad Dragon Star Explosion!<br/><br/>Domain: Nine Origins Dragon Domain<br/><br/>Control laws: metal, wood, water, fire, Earth, light, dark wind and thunder<br/><br/>Kingdom of God: Dragon Palace Dragon Palace: Innate.<br/><br/>Dragon Palace member: 8060450<br/><br/>Looking at his information, he revealed a smile.<br/><br/>Other than these attributes, Wang Xian currently had the starfield lock fragment and the book of water forbidden spell, two pieces of Tianyuan fragments.<br/><br/>Other than these two treasures, he also possessed the black resurrection Lily.<br/><br/>This was also a very powerful and terrifying treasure.<br/><br/>It could replay the state from a few seconds ago.<br/><br/>It was very terrifying.<br/><br/>As for the Five Elements Millstone and the Tai Chi Dragon disk. thev were still<br/><br/>at the ninth level of the universe overlord.<br/><br/>They had not been able to improve.<br/><br/>The improvement in his strength allowed Wang Xian to be more neutral in this universe.<br/><br/>He smiled.<br/><br/>With a thought, Wang Xian and the dragon roar were cultivating in a sword shield over at the Void Dragon Body.<br/><br/>With that corpse and the density of the energy here, Wang Xian was able to achieve a significant improvement this time around.<br/><br/>He began to use all his strength to upgrade his void dragon body.<br/><br/>The Void Dragon Body would be an extremely powerful trump card for Wang<br/><br/>Xian when it matured in the future.<br/><br/>The power of space was indeed terrifying.<br/><br/>In the aspect of teleportation, it was extremely terrifying even when it was used to chase after enemies!<br/><br/>In the following period of time, Wang Xian began to cultivate in the ruins of the universe.<br/><br/>Time passed day by day.<br/><br/>Five thousand years later, an lie flew over and reported a piece of news.<br/><br/>This news did not originate from the Dragon Palace, but from the Void Dragon Forbidden Ground.<br/><br/>The Void Dragon Forbidden Ground was attacked by an unknown powerhouse!<br/><br/>Furthermore, they were teleported into the Holy Moon.<br/><br/>The moment the powerhouse attacked, the charming dragon seed was teleported out of the Holy Moon!<br/><br/>“As expected, the huge amount of resources attracted the covetous eyes of some powerhouses from the forbidden ground. I wonder which powerhouse from the forbidden ground made the move. It shouldn’t be the flowing water forbidden ground or the unexpected forbidden ground! ”<br/><br/>Wang Xian mumbled after receiving the news.<br/><br/>The unexpected forbidden ground and flowing water forbidden ground. With their strength, there was no need for them to do such a thing.<br/><br/>It was possible that there were other forbidden lands and holy lands that possessed experts at the peak of the Universe Overlord Realm!<br/><br/>Although Wang Xian had already expected this, a faint killing intent still surged in his heart when someone attacked him.<br/><br/>However, Wang Xian did not know who the person who attacked him was. He had no way to take revenge!<br/><br/>He continued to keep a low profile.<br/><br/>Unless Wang Xian felt that he had the strength to fight against the Heaven’s origin creation, he would not slaughter his entire sect!<br/><br/>If he were to be too high-profile, he might be targeted by the Tianyuan Kismet powerhouses.<br/><br/>He would put this matter aside for the time being.<br/><br/>For the next tens of millions of years, Wang Xian had been cultivating.<br/><br/>Forty million years later, Wang Xian’s Void Dragon body had another breakthrough and reached the level five of the Universe Dominator! The level five of the universe dominator was already very terrifying!<br/><br/>“All disciples, get ready to come out! ”<br/><br/>Eighty million years passed in the blink of an eye.<br/><br/>On this day, a vast voice suddenly sounded in the center of the entire universe ruins.<br/><br/>When all the disciples heard this voice, they hurriedly opened their eyes!<br/><br/>The time of 100 million was up.<br/><br/>They were about to leave!<br/><br/>Wang Xian also opened his eyes. He exhaled and scanned his surroundings.<br/><br/>Through his senses, the energy in the cosmic ruins had decreased by a lot compared to the beginning!<br/><br/>His gaze landed on the spot beside him. Long yinyin and long Yinhao had also opened their eyes.<br/><br/>Both of their abilities had already broken through to the third level of the Universe Overlord realm.<br/><br/>The increase in their abilities over the past 100 million years was extremely terrifying!<br/><br/>Most importantly, it was because of the corpse.<br/><br/>Now, the corpse of the expert had turned into ashes.<br/><br/>All the energy and spiritual fragments supporting it had been absorbed!<br/><br/>“Brother Wang Xian, we are going out! ”<br/><br/>Long Yin looked at Wang Xian and said with a smile.<br/><br/>“Brother Wang Xian, I have advanced to the third level of the universe dominator. Hahaha, the third level of the universe dominator. I am the most powerful Saint Son in the Dragon Roar Forbidden Land. Haha, if our parents and grandparents knew about this, they would definitely be shocked! ” Long Yinhao stood up and said excitedly.<br/><br/>To have advanced to this level in 100 million years, this was something they did not dare to imagine.<br/><br/>According to their thinking, to be able to break through to the second level of the Universe Dominator was already heaven-defying luck.<br/><br/>Now that the Universe Dominator was at the third level, their future path was clear in their minds.<br/><br/>There was a high possibility of stepping into the peak of the universe dominator.<br/><br/>This was a realm that none of the powerhouses in the dragon roar forbidden ground had stepped into!<br/><br/>“Hehe, not bad.”<br/><br/>Wang Xian smiled and nodded at them.<br/><br/>“Brother Wang Xian, what is your current strength?”<br/><br/>The Dragon Roar looked at Wang Xian and asked.<br/><br/>“The fifth stage of the Universe Dominator realm. The time required for me to improve is much longer! ”<br/><br/>Wang Xian replied with a smile.<br/><br/>“The level five realm of the ruler of the universe is still of the spatial attribute. This is considered quite strong in our dragon roar forbidden ground. Brother, you are the best. It will probably take us hundreds of millions of years to step into the level five realm of the ruler of the Universe! ”<br/><br/>“Especially after we leave this place! ”<br/><br/>Dragon Roar spoke in admiration!<br/><br/>“There’s no rush. There are still billions of years before the arrival of the calamity. All of you have enough time. Alright, let’s go out! ”<br/><br/>As Wang Xian spoke, he waved his arm and the sword shield disappeared.<br/><br/>In the surrounding area, some of the disciples of the Dragon’s Roar Forbidden Ground had already stood up.<br/><br/>Wang Xian glanced at them. Most of them had already reached the peak of the Universe Knight Realm.<br/><br/>Only two of them had not reached it because their realms were relatively low when they came!<br/><br/>However, this was unimaginable in the past.<br/><br/>Cultivating here was even better than the treasure land of the Dragon Roar Forbidden Ground!<br/><br/>“Lord Saint Son, Lord Saintess! ”<br/><br/>A group of disciples saw them and shouted happily.<br/><br/>“Okay, let’s Go!”<br/><br/>Wang Xian nodded at them..\t\t\t\t\t\t</div>", "images": {}, "success": true}