{"id": 1003, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073906.html", "title": "Chapter 4005 - Chapter 4005: 4004 Had Another Breakthrough, 80 Million Years! Go", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4005 - Chapter 4005: 4004 Had Another Breakthrough, 80 Million Years! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4005: 4004 had another breakthrough, 80 million years! Go<br/><br/>Translator: 549690339<br/><br/>“Holy son Wang Xian, we want five treasures from the unfettered forbidden ground. ”<br/><br/>“Holy son Wang Xian, we want four treasures from the Flowing Water Forbidden Ground! ”<br/><br/>More than 4,000 years passed quickly.<br/><br/>In the ruins of the universe, one by one, the disciples of the sacred land and the Sacred Academy were trading with Wang Xian.<br/><br/>Wang Xian gave them the treasures.<br/><br/>At the same time, in Tianyuan City, the two charming dragon species were collecting all the resources that the sacred land and the Sacred Academy had traded.<br/><br/>There were a total of twenty treasures.<br/><br/>Each of them was the strongest weapon used by the strongest masters of the universe.<br/><br/>These were definitely top-notch treasures!<br/><br/>The value of such treasures was extremely terrifying!<br/><br/>The resources exchanged would be enough to raise the strength of Wang Xian’s actual body!<br/><br/>“Let’s Go! ”<br/><br/>After the transaction was completed, the two charming dragon seeds moved and immediately flew towards a certain direction!<br/><br/>“Let’s Go! ”<br/><br/>When they flew to a certain location, Wang Xian’s main body sensed his surroundings.<br/><br/>He had a thought and instructed an lie!<br/><br/>Buzz<br/><br/>In the next second, their figures disappeared!<br/><br/>After sending the two charming dragon seeds back to the Void Dragon Forbidden Ground, Wang Xian ordered an lie to bring him back to the Void Pagoda in the middle of the universe ruins!<br/><br/>“Where did this void Dragon Forbidden Ground come from? We have been searching for a period of time in the Void Dragon Forbidden Ground, but we haven’t found any information or any clues. We haven’t even found the leader of the Void Dragon Holy Ground! ”<br/><br/>At the same time, in a large hall in Tianyuan city.<br/><br/>A group of experts from the forbidden ground were sitting inside.<br/><br/>Among them, there were more than twenty peak-level universe masters!<br/><br/>A peak-level universe master from the space forbidden land couldn’t help but speak out!<br/><br/>(‘I don’t know. It’s as if they appeared out of thin air. However, the experts from the Void Dragon forbidden land don’t have peak-level experts, but their disciples ‘combat strength is extremely powerful. It’s as if they have grasped a powerful sword technique!”<br/><br/>An old man from Holy Land, who carried a huge sword on his back, shook his head and looked confused.<br/><br/>He couldn’t help looking at the great beings from flowing water forbidden land and undeserved forbidden land in the center!<br/><br/>Void Dragon Forbidden Land wasn’t supposed to be in their sight!<br/><br/>However, the deal this time involved a total of 20 top-tier universe master true treasures, which allowed Void Dragon forbidden land to obtain a large amount of resources.<br/><br/>This amount of resources was extremely huge for any forbidden holy land present!<br/><br/>Obtaining such powerful resources naturally attracted their attention! Some Forbidden Holy Lands and sacred academies even had other thoughts.<br/><br/>“This void dragon forbidden land is indeed extremely mysterious. I don ‘t know where it came from, but it should have come from some sealed treasure land.” An old woman from flowing water forbidden land said indifferently!<br/><br/>They didn’t suspect that the Void Dragon Forbidden Land came from another universe.<br/><br/>This idea hadn’t even been born.<br/><br/>Because they knew that before the calamity started, the universe would have a huge repulsive force.<br/><br/>When the powerhouses from other universes entered here, they would be subjected to a terrifying suppression.<br/><br/>Moreover, they could also sense that the other party was not an expert from their sword and Magic Universe.<br/><br/>“No matter what, it’s a good thing that our sword and Magic Universe has a<br/><br/>powerful force born! ”<br/><br/>The elder from the unexpected forbidden land also said indifferently, then stood up. “I still have something to do, so I’ll take my leave for now.”<br/><br/>After saying that, the elder from the unexpected forbidden land directly disappeared.<br/><br/>The old woman from the flowing water forbidden land cupped her hands together and disappeared.<br/><br/>The unfettered forbidden land and the flowing water forbidden land were the only forbidden lands in the universe that possessed the existence of the Heavenly Yuan creation realm. They possessed the will of a heavenly Yuan creation realm expert.<br/><br/>And at the Heavenly Yuan creation realm, what they were looking at was no longer the difference between the powers of the forbidden lands and the Holy Lands.<br/><br/>Instead, it was their entire sword and magic universe.<br/><br/>It was the multiverse!<br/><br/>Otherwise, with their strength, the entire sword and magic universe would have no other Holy Lands and Holy Academies.<br/><br/>They would all belong to the two forbidden lands!<br/><br/>The undeserved forbidden land and flowing water forbidden land had also inherited the will of the heavenly fate.<br/><br/>Under normal circumstances, they would not bully the other forbidden lands and holy lands.<br/><br/>This had also created the transcendent status of the two forbidden lands!<br/><br/>The experts from the two forbidden lands left. The rest of the experts from the other forbidden lands took a glance and left immediately with their own thoughts!<br/><br/>As for what they were going to do, perhaps only they themselves knew!<br/><br/>Those resources were enough to make some of the experts from the Forbidden Lands Take Action!<br/><br/>Wang Xian did not know about this matter.<br/><br/>However, when he arrived at the Void Pagoda, he also reminded the charm dragon seed and the rest to be careful.<br/><br/>Wang Xian knew that it was a sin to be rich!<br/><br/>At this moment, Wang Xian wasn’t too worried about the matter regarding the void dragon forbidden ground.<br/><br/>Now, after obtaining the extremely powerful resources, his strength was enough to allow him to improve once again.<br/><br/>Wang Xian transformed into the body of the Divine Dragon and entrenched himself in the Void Pagoda. He looked at the resources in front of him and revealed a faint smile!<br/><br/>Absorption!<br/><br/>Rapid absorption!<br/><br/>A large amount of resources entered his body, causing his dragon energy to increase rapidly.<br/><br/>As time passed, the energy in his body became denser and denser!<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>Dragon roars sounded around him out of thin air.<br/><br/>This dragon roar seemed to come from the void and from the unknown.<br/><br/>Just as Wang Xian was about to break through, the shadows of the Divine Dragons appeared around him.<br/><br/>There were a total of nine shadows of the Divine Dragons. They kept circling above Wang Xian.<br/><br/>Slowly, the nine divine dragons gradually merged together!<br/><br/>Wang Xian sensed the changes in his surroundings. His eyes flickered slightly.<br/><br/>The last time he made a breakthrough, there wasn’t such a huge commotion!<br/><br/>This time, the breakthrough was terrifying!<br/><br/>If it wasn’t in the Void Pagoda, it would definitely cause a huge earthquake!<br/><br/>Even so, the entire interior of the Void Pagoda was enveloped by the nine-colored energy.<br/><br/>It filled every space.<br/><br/>Even the powerful void pagoda was slightly weak in front of the nine-colored attribute light!<br/><br/>“Ding! Congratulations to host for increasing your level and breaking through to the level six realm of a universe overlord.”<br/><br/>“Ding! Congratulations to host for breaking through and strengthening the nine-origin Dragon Field. ”<br/><br/>At this moment, the system’s voice rang out. The Divine Dragon in the sky above Wang Xian’s body slowly entered his body!<br/><br/>The nine-colored radiance merged into one, causing the color of Wang Xian ‘s body to be very strange!<br/><br/>It was a little dark gold in color.<br/><br/>However, his dragon horns were like diamonds, looking extremely transparent!<br/><br/>An extremely terrifying power surged out from his body!<br/><br/>His entire body looked extremely majestic!<br/><br/>Wang Xian sensed the energy contained in his body and revealed an excited expression.<br/><br/>He had broken through!<br/><br/>The sixth level of the Universe Dominator!<br/><br/>His current strength was already above the universe dominator.<br/><br/>Yes, above the universe dominator!<br/><br/>Above the pinnacle of the universe dominator..\t\t\t\t\t\t</div>", "images": {}, "success": true}