{"id": 1006, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073912.html", "title": "Chapter 4008 - Chapter 4008: 4007, Under The Demon Beast Abyss", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4008 - Chapter 4008: 4007, Under The Demon Beast Abyss</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4008: 4007, under the Demon Beast Abyss<br/><br/>Translator: 549690339<br/><br/>“Yes, senior. We will definitely inherit your will and guard our sword and the Magic Universe! ”<br/><br/>The Barbarian Saint Son and the flowing moon Saintess, as well as a few other disciples who had absorbed the corpses in the demon pillar, immediately bowed and replied.<br/><br/>“Yes, senior. We will definitely inherit your will and guard our sword and the Magic Universe! ”<br/><br/>Long Yin Yin and long Yin Hao saw this and quickly bowed as well!<br/><br/>“What is a magic pillar?”? “It actually says that it can bring many great beings from our universe?”? “To be able to make great beings from the undeserved forbidden ground and flowing water forbidden ground say such words, it must be an extremely powerful inheritance that can allow a disciple to rise to the pinnacle level of a universe ruler! ”<br/><br/>“There really is a great opportunity within the universe ruins. The two forbidden lands weren’t able to obtain treasures before, but they did?”<br/><br/>“Just what level of treasure is this, to be able to make the two forbidden lands pay so much attention to it?”<br/><br/>In the surrounding areas, the warriors of the sacred lands and sacred academies who weren’t near the front heard the voice from the front, and their faces revealed looks of astonishment.<br/><br/>They didn’t know what was going on in the universe ruins.<br/><br/>They didn’t have any special methods to contact the disciples inside!<br/><br/>However, from what the two experts of the forbidden lands said, they must have some extremely precious treasures.<br/><br/>The founders of the Dragon Roar Forbidden Land, Roaring Dragon Yin, and Roaring Dragon Hao’s grandparents had also arrived.<br/><br/>They were also extremely curious about the words of the peak-stage rulers of the unfettered forbidden ground and flowing water forbidden ground.<br/><br/>However, when they saw that Yin long and Yin Long had actually followed the barbarian saint son and Saintess flowing moon to bow and speak, they were slightly stunned. Their faces were filled with astonishment and shock.<br/><br/>Just now, only a dozen Saint Sons and Saintesses had bowed in response to the words of the two great forbidden ground experts.<br/><br/>The rest of the Saint Sons and saintesses, as well as the heaven’s pride disciples, were all standing there.<br/><br/>Now, the two disciples who saw them from the dragon roar forbidden ground also bowed. They were filled with shock.<br/><br/>What was the meaning of this?<br/><br/>The disciples from the Dragon Roar Forbidden Ground had also obtained a huge opportunity?<br/><br/>Whoosh! Whoosh<br/><br/>At this moment, the group of Saint Sons, saintesses, and heaven’s pride disciples flew towards their respective forbidden grounds!<br/><br/>Wang Xian followed Long Yin, Yin Long, and long Yinhao as they flew over as well!<br/><br/>“Yin Yin, Yin Hao, what happened? What opportunities did you guys obtain in the ruins of the Universe?”<br/><br/>Long Yin, Yin Long’s grandfather, the second elder could not help but ask them. His eyes were filled with anticipation.<br/><br/>“Grandfather, we obtained a great opportunity this time. Big Brother Wang Xian gave us a great opportunity! ”<br/><br/>Long Yinhao immediately ran over and said excitedly with an extremely excited expression.<br/><br/>“What great opportunity? Tell me quickly. Also, how did your strength increase so quickly? How did you reach the third level of the Universe Overlord<br/><br/>Realm?”<br/><br/>The second elder asked impatiently!<br/><br/>Following that, Long Yinhao told them everything that had happened in the universe ruins.<br/><br/>When all the powerhouses in the Dragon Roar Forbidden Land heard that the magic pillar was the inheritance of all the powerhouses at the peak of the Universe Dominator, they were stunned.<br/><br/>All of them were stunned!<br/><br/>What a great opportunity!<br/><br/>This was a great opportunity for them in the Dragon Roar Forbidden Land!<br/><br/>And this opportunity was obtained by two of their disciples in the Dragon Roar Forbidden Land!<br/><br/>Furthermore, it was given to them by Wang Xian!<br/><br/>This? ?<br/><br/>If this level of opportunity was placed outside, the dragon roar forbidden ground wouldn’t even dare to fight for it!<br/><br/>Now, they had obtained two of them!<br/><br/>This was simply unbelievable. It was simply unimaginable!<br/><br/>At the side, when the old man heard this, he was also stunned.<br/><br/>“You guys really obtained such an opportunity? Good, good, good! ”<br/><br/>The old man who was the founder of the Dragon Roar Forbidden Ground couldn’t help but Roar in excitement!<br/><br/>“Forefather, it’s all big brother Wang Xian. He collaborated with Saintess Liu Yue and the rest. After breaking the demon pillar, he gave us two corpses! ”<br/><br/>Dragon Roar replied happily!<br/><br/>“Xiao Xian! ”<br/><br/>The forefather of the dragon roar forbidden ground and all the experts from the dragon roar forbidden ground looked at Wang Xian with shock and gratitude in their eyes.<br/><br/>Such a level of opportunity was too great!<br/><br/>Although Wang Xian was the holy son of their dragon roar forbidden ground, he had only joined their dragon roar forbidden ground for more than 100 million years.<br/><br/>To be able to give them such an opportunity, it was simply unimaginable.<br/><br/>If such a treasure was given to the flowing water forbidden ground, he could totally join the flowing water forbidden ground. His status would probably be higher than the current holy sons and Saintesses!<br/><br/>“Xiao Xian, thank you very much. I didn’t think of you…”<br/><br/>Yin Yin and Yin Hao’s parents walked over hurriedly. They didn’t know how to express their gratitude.<br/><br/>It was such a precious opportunity. Even if they sold the Dragon Roar Forbidden Ground, they wouldn’t be able to get it!<br/><br/>“Seniors, you don’t have to be so polite. Yin Yin and Yin Hao have already thanked me. It’s useless even if you give me the corpse inside the demon pillar!<br/><br/>Wang Xian looked at them and said with a smile!<br/><br/>“We still have to thank you properly. On behalf of the Dragon Roar forbidden ground and our long family, I thank you, Little Xian! ”<br/><br/>The forefather of the dragon roar forbidden ground couldn’t help but bow to Wang Xian and express his gratitude!<br/><br/>The opportunity was too great!<br/><br/>He had no choice but to express his gratitude!<br/><br/>Wang Xian smiled and waved his hand!<br/><br/>“Eh? Old Man Long, your luck in the Dragon Roar Forbidden Ground is really good. It’s really heaven-defying! ”<br/><br/>At this moment, an old man from not far away looked in the direction of the Dragon Roar Forbidden Ground. The jealousy on his face was not concealed at all.<br/><br/>He swept his gaze across the dragon roar, Yin Longyin Hao, and Wang Xian. He was deeply envious!<br/><br/>“Hehe, Hehe! ”<br/><br/>When the forefather of the dragon roar forbidden ground heard the words of the old man, he merely smiled foolishly!<br/><br/>He did not have the demeanor of a powerhouse at all!<br/><br/>“The Luck of this dragon roar forbidden ground is simply heaven-defying! ”<br/><br/>“It’s not that he’s heaven-defying. It’s just that the Dragon Roar Forbidden Ground accidentally received a disciple. It’s that sage Wang Xian. His strength is extremely heaven-defying. He has already reached the level five of a universe overlord. Furthermore, he has the space attribute. In the future, he will definitely be a top-notch existence in our universe! ”<br/><br/>(‘D * mn, the luck of this dragon roar forbidden ground is too heaven-defying.<br/><br/>They managed to pick up such a disciple. D * mn, it’s too enviable! ”<br/><br/>In the surrounding area, a group of experts from the sacred land and the Sacred Academy had received all the news from the cosmic ruins. Their faces were filled with jealousy as they spoke.<br/><br/>They looked over with a fiery gaze!<br/><br/>In the cosmic ruins, there were a total of ten such top-notch inheritance opportunities. The Dragon Roar Forbidden Ground had obtained three of them.<br/><br/>Even without the sage Wang Xian, the long family’s disciple from the dragon roar forbidden ground had obtained two of them.<br/><br/>There was an 80% chance that a peak-stage ruler would be born in the future.<br/><br/>There was a 50% chance that two peak-stage rulers would be born!<br/><br/>How could they not be envious?<br/><br/>Furthermore, the flowing water forbidden land had only obtained one of the inheritance opportunities in the magic pillar, even though they had obtained other powerful resources.<br/><br/>However, they had only obtained one of the opportunities.<br/><br/>Only the unfettered forbidden land, the three that they traded with the flowing water forbidden land.<br/><br/>Just like that, it was only on par with the Dragon Roar Forbidden Land!\t\t\t\t\t\t</div>", "images": {}, "success": true}