{"id": 1002, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073904.html", "title": "Chapter 4004 - Chapter 4004: 4003 Sold A Large Number Of Treasures", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4004 - Chapter 4004: 4003 Sold A Large Number Of Treasures</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4004: 4003 sold a large number of treasures<br/><br/>Translator: 549690339<br/><br/>“Dragon King, what orders do you have?”<br/><br/>Ao Jian looked at Wang Xian from the side and transmitted his voice respectfully.<br/><br/>“Next, I will trade the treasures I obtained with the sacred grounds of the forbidden grounds. The resources after the trade will be taken over by the charming dragon species. ”<br/><br/>“For now, we should not expose our identities! ”<br/><br/>Wang Xian said to Ao Jian.<br/><br/>After all, they did not belong to this universe. In order to prevent others from targeting them, Wang Xian decided to be more careful!<br/><br/>All the treasures were traded in the ruins of this universe and handed over to the holy sons and Saintesses of the forbidden grounds of the Holy Land. After that, he would let the charming dragon seed take the resources first.<br/><br/>Wang Xian’s main body would go out and bring it over.<br/><br/>In this way, he could ensure that the transaction would proceed smoothly.<br/><br/>If he were to conduct the transaction outside, Wang Xian was afraid that some powerful forbidden lands would covet it!<br/><br/>In order to be on the safe side, this was also the best way!<br/><br/>“It’s the Dragon King. Dragon King, what identity shall we use to get along with each other?”<br/><br/>Ao jian nodded and asked!<br/><br/>“Just pretend that we’ve met before in the Holy Moon. Pve also met the Lord of the Void Dragon Forbidden Ground. ”<br/><br/>Wang Xian said!<br/><br/>Ao jian nodded.<br/><br/>His body moved and flew to the side!<br/><br/>“Brother Wang Xian, do you know the holy son Ao Jian from the Void Dragon Forbidden Ground?”<br/><br/>Long Yinhao couldn’t help but ask curiously when he saw Wang Xian flying over.<br/><br/>“Yes, I’ve met him in the Holy Moon. I’ve also met the Master of the Void Dragon Forbidden Ground. Of course, I only found out about this later. ” Wang Xian didn’t hide anything and said with a smile!<br/><br/>Saintess Liu Yue, we have already discussed with your flowing water forbidden ground about the fire, wind, and thunder attribute magic pillars. We want them! ”<br/><br/>At this moment, Saint Son Wu Man received a message and spoke to saintess flowing moon.<br/><br/>“Yes, I have received the message as well! ”<br/><br/>Saintess flowing moon nodded. He looked at Wang Xian and said, “Thank you,<br/><br/>Saint Son Wang Xian! ”<br/><br/>“We are just cooperating with each other! ”<br/><br/>Wang Xian shook his head. Everyone moved and arrived in front of the wind attribute magic pillars.<br/><br/>Following that, they continued to crack the magic pillars!<br/><br/>One by one, the magic pillars were broken. Wang Xian was the first to come to the front of the corpse and took away two of the treasures on the corpse!<br/><br/>The weapons that could be used by a master at the peak of the universe were not simple.<br/><br/>Especially the two items that Wang Xian chose first. Each of them was a rare existence.<br/><br/>This made Wang Xian’s gains extremely terrifying.<br/><br/>When he broke through the three magic pillars, the ownership of the other magic pillars had already been negotiated!<br/><br/>The other forbidden grounds, the sacred grounds of the Saint Academy, and the flowing water forbidden ground were also negotiated. The 12 magic pillars were broken through one by one.<br/><br/>It was the last one.<br/><br/>This made the holy sons and saintesses who had obtained the corpses in the magic pillars look extremely excited.<br/><br/>This was a huge opportunity for them.<br/><br/>It could make them become top-notch experts.<br/><br/>“Saintess liuyue, I have a request. Can you ask the seniors in your tribe to contact the experts in our void Dragon Forbidden Land? We want to make a deal with the holy son Wang Xian! ”<br/><br/>When all the magic pillars were broken, Ao jian cupped his hands toward Saintess Liuyue and said!<br/><br/>“HMM? No problem. I wonder what kind of deal the void Dragon Holy Land wants to make with the holy son Wang Xian?”<br/><br/>Saintess Liuyue said very politely.<br/><br/>“We would like to exchange all the treasures in holy son Wang Xian’s hands for resources. We would like to make a deal with your powerful Holy Land. ” Ao Jian replied!<br/><br/>“We would like to make a deal with all the treasures in holy son Wang Xian’s hands?”<br/><br/>Saintess Liuyue’s gaze froze as she looked at Wang Xian.<br/><br/>“Yes, I have so many resources in my hands. Naturally, I have to trade for something useful to me. Otherwise, if I keep it in my hands, it will be coveted by other powerhouses! ”<br/><br/>Wang Xian nodded with a smile.<br/><br/>“Alright, I will contact the two of you immediately!”<br/><br/>Saintess Liu Yue’s gaze flickered slightly.<br/><br/>All of them had witnessed the treasures obtained by Wang Xian.<br/><br/>Some of the treasures were indeed extremely powerful.<br/><br/>There were the staffs, sharp swords, and protective clothing worn by these powerhouses.<br/><br/>These were considered top-notch treasures in any forbidden land. Naturally, they wanted to obtain them and conduct the trade.<br/><br/>In the surrounding area, the disciples of the sacred grounds and sacred academy in the forbidden land immediately spread the news to the seniors of the sacred grounds and Sacred Academy.<br/><br/>Things handed over good, Wang Xian then came to the side of the position!<br/><br/>“Yin Yin, Yin Hao, I’ll set up a barrier for you, and you can start cultivating inside. Try to increase your power to the third and fourth level universe masters in the next 80 million years or so! ”<br/><br/>Wang Xian said to long yinyin and long yinhao.<br/><br/>With the bodies of the strong, and with the power of this place,.<br/><br/>Next, their strength can gain a surge period.<br/><br/>80 million years to upgrade a few levels, should not be a problem!<br/><br/>“Thank you brother Wang Xian! ”<br/><br/>Long Yin’s eyes twinkled as he spoke to Wang Xian.<br/><br/>Wang Xian smiled and shook his head. With a move of his hand, Swords of space appeared in one place.<br/><br/>The space sword rises, forms a terrible sword cover space!<br/><br/>“All of you are cultivating inside now. I will be cultivating inside after settling some matters! ”<br/><br/>Wang Xian said to them. His gaze swept across the surrounding disciples of the<br/><br/>Dragon Roar Forbidden Ground. “All of you can cultivate in the surroundings! ”<br/><br/>“Yes, it’s saint son Wang Xian! ”<br/><br/>All the disciples replied respectfully!<br/><br/>Now, they were exceptionally respectful towards Wang Xian.<br/><br/>Not to mention, even Saintess Liu Yue and Saint Son Wu Man were courteous towards Saint Son Wang Xian.<br/><br/>The two corpses that the Wang Xian saint took out were given to each of the holy sons and Saintesses of the Dragon Roar Forbidden Ground. Such behavior was worthy of their respect!<br/><br/>After Wang Xian had dealt with the situation of the dragon roar, he began to wait.<br/><br/>He was waiting for the time to come!<br/><br/>“Ao Jian Saint Son, we have already helped you contact the experts of your void Dragon Forbidden Ground. Wang Xian Saint Son, are you selling all the treasures in your hands?”<br/><br/>A few days later, Saintess Liu Yue said to Wang Xian and Ao Jian.<br/><br/>“Yes, we are going to sell them all. We will give the treasures to the holy sons and Saintesses of the holy sons and Saintesses of whichever forbidden ground after they are purchased by the Holy Academy! ”<br/><br/>Wang Xian nodded and said.<br/><br/>“The transaction will take place in more than four thousand years. We need to make some preparations for the Void Dragon Forbidden Ground! ”<br/><br/>Ao Jian also said from the side.<br/><br/>“Alright, I will pass on your message! ”<br/><br/>Saintess Liu Yue nodded.<br/><br/>The transaction was scheduled to take place in 4,000 years because an lie would come over in 4,000 years. At that time, he would bring Wang Xian’s original body out of the Cosmic Ruins!<br/><br/>The original body would leave this space to prevent any accidents from happening during the transaction.<br/><br/>In addition, once the transaction was successful, Wang Xian’s original body would immediately absorb it!\t\t\t\t\t\t</div>", "images": {}, "success": true}