{"id": 1000, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073900.html", "title": "Chapter 4002 - Chapter 4002: 4001 Harvest", "volume": 10, "volume_title": "Volume 10", "body": "<h1>Chapter 4002 - Chapter 4002: 4001 Harvest</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4002: 4001 harvest<br/><br/>Translator: 549690339<br/><br/>“Eh? What are they doing?”<br/><br/>The Barbarian Saint Son flew over and swept his gaze across the flowing moon Saintess and Wang Xian. His eyes were sparkling.<br/><br/>“Eh? Senior brother, this Wang Xian saint son seems to have made a breakthrough in his strength! ”<br/><br/>At this moment, the saintess from the unfettered forbidden land looked at Wang Xian. A treasure on her wrist was glowing as she spoke in astonishment!<br/><br/>“It should be. This saint Wang Xian is very monstrous. He must have obtained many great opportunities and his combat strength is also very strong. ”<br/><br/>The Saint Wu Man nodded his head. His gaze landed on Long Yin, long yinhao, and the rest. His eyes carried a questioning look.<br/><br/>“Saint Wu Man, Saintess Harmony, Saintess flowing moon, and big brother Wang Xian are preparing to break open this demon pillar and obtain the treasures and corpses inside! ”<br/><br/>Long Yinhao immediately spoke when he saw the gaze of Saint Son Wu Man.<br/><br/>Long Yinhao did not dare to act rashly towards the most powerful Saint Son in the sword and Magic Universe!<br/><br/>“Do they have a way to break the demon pillar?”<br/><br/>Saint Son Wu Man’s gaze focused. His eyes revealed a burning look as he asked.<br/><br/>Saintess flowing moon said that she has a way to break it with the help of our big brother Wang Xian. ”<br/><br/>Long Yin replied.<br/><br/>They had just arrived and did not know what the corpse in the magic pillar represented.<br/><br/>They did not know how precious it was!<br/><br/>“We can break through it! ”<br/><br/>The eyes of the barbarian saint son flickered slightly. They stood at the side and stared at it intently.<br/><br/>No one dared to destroy the magic pillar while the people from the flowing water forbidden ground were destroying it.<br/><br/>The undeserved forbidden ground would not disturb them either.<br/><br/>Time passed quickly!<br/><br/>Buzz<br/><br/>However, after five hours, a special energy emerged from the entire magic pillar.<br/><br/>The energy barrier on the magic pillar began to dissipate slowly. Wang Xian opened his eyes and looked at the position above.<br/><br/>“It’s a success! ”<br/><br/>At the side, Saintess flowing moon revealed an excited expression. Her eyes were burning as she stared at the magic pillar that had been opened.<br/><br/>Her body was trembling slightly.<br/><br/>“We did it! We really did it! ”<br/><br/>“What a fast speed! This holy son Wang Xian’s willpower is so terrifying!” “He succeeded in just a few hours. I thought it would take a few days! ”<br/><br/>A disciple from the flowing water forbidden ground said with burning eyes.<br/><br/>Although they could not obtain these demon pillars, they could definitely obtain a lot of rewards!<br/><br/>“Let’s continue. I’ll take the corpses and treasures in this magic pillar first. The next one belongs to your flowing water forbidden ground. Saintess flowing moon, you can choose between the two magic pillars! ”<br/><br/>Wang Xian moved and came to the top of the magic pillar. With a wave of his arm, he kept the corpse.<br/><br/>When saintess flowing moon saw this scene and heard his words, she nodded her head.<br/><br/>A faint smile appeared on her face. “Alright, Saintess Wang Xian. It’s a pleasure to work with you. Let’s have this water elemental magic pillar then!”<br/><br/>“It’s a pleasure to work with you!”<br/><br/>Wang Xian smiled and looked at the magic pillar that Saintess Liuyue was pointing at. He nodded his head.<br/><br/>“Saintess liuyue, what method are you guys using?”<br/><br/>When the barbarian saint saw this scene, he moved his body and flew to the front of Saintess Liuyue with burning eyes. He stared at her and then glanced at Wang Xian who was beside him.<br/><br/>“This is the unique method of drifting in our flowing water forbidden land. Of course, the main reason is that the holy son Wang Xian is able to resist the impact of the will. ”<br/><br/>Saintess Liuyue smiled at him. “For the next demon pillar, if you want to open the unfettered forbidden land, the holy son Wang Xian will have to take two of the treasures from the corpses in the demon pillar. As for us, we will also need some resources to exchange for them! ”<br/><br/>“Saint Wang Xian, you can send the news to your seniors in the undeserved forbidden ground. Let your seniors in the undeserved forbidden ground talk to our seniors in the Flowing Water Forbidden Ground! ”<br/><br/>The flowing moon Saintess said to him with a smile on her face!<br/><br/>The eyes of Saint Wang Xian flickered slightly. He nodded without any hesitation and said, “Alright, no problem!”<br/><br/>Okay!<br/><br/>The flowing moon Saintess nodded and looked at Wang Xian. “Continue, Saint<br/><br/>Wang Xian! ” sure!<br/><br/>They moved and arrived in front of another demon pillar!<br/><br/>“The flowing water forbidden land and that Wang Xian joined forces and managed to break the demon pillar. This… This is amazing! ”<br/><br/>“Hiss, what method did they use to break this demon pillar?”<br/><br/>“Doesn’t that mean that all the remaining demon pillars can be broken?”<br/><br/>All the Saint Sons and saintesses from the forbidden land flew over from their surrounding positions and looked at this scene in shock.<br/><br/>Wang Xian and the rest ignored the shock in the surroundings and continued to crack the second water elemental demon pillar!<br/><br/>A few hours later, this demon pillar was easily cracked!<br/><br/>Saintess Liu Yue flew over excitedly and took away all the corpses and treasures inside.<br/><br/>Following that, the third water elemental demon pillar was easily cracked by Wang Xian and the rest.<br/><br/>The corpses and treasures inside were taken away by Wang Xian! “Yin Yin, Yin Hao, these two corpses are for you. ”<br/><br/>After Wang Xian obtained the corpses in the two demon pillars, he immediately threw them to long yin yin and long Yin Hao!<br/><br/>“Brother Wang Xian, no… No Way. Are these for us?”<br/><br/>Long Yin Hao looked at the corpses that flew to his side. His eyes were wide open and filled with shock.<br/><br/>Long Yinyin was also shocked.<br/><br/>At first, they didn’t know much about this corpse.<br/><br/>But in these few hours, they heard the exclamations and discussions of the other holy sons and saintesses from the other holy lands. They had a complete understanding of the effects and abilities of this corpse.<br/><br/>Because of the special nature of the death of the powerhouses in the magic pillar, and because they were sealed.<br/><br/>All of their essence, energy, and spirit were locked within this demon pillar.<br/><br/>Within the corpse, there were fragments of their spirit, as well as the comprehension of the great beings within.<br/><br/>As long as the corpse was placed beside one’s body to cultivate, there was a very high chance that one would be able to absorb everything that this great being had learned before he died!<br/><br/>What was this?<br/><br/>This was an existence that was even more powerful and precious than the sword alms bowl and magic mantle.<br/><br/>Furthermore, the Sword Alms Bowl and Magic Alms Bowl were also divided into different levels.<br/><br/>There were not many sword alms bowls and magic alms bowls at the peak of the Universe Overlord realm in the entire universe.<br/><br/>However, the corpses in this magic pillar were several times more precious than the sword Alms Bowl and magic alms bowl at the peak of the Universe Overlord Realm!<br/><br/>Now, Wang Xian had given them such a terrifying inheritance directly.<br/><br/>This was no different from allowing them to ascend to the heavens in one step. It allowed them to have the capital to step into the peak of the universe’s ruler in the future!<br/><br/>It allowed them to become the top experts in the sword and Magic Universe in the future.<br/><br/>“If I don’t give it to you, what’s the point of me keeping it?”<br/><br/>Wang Xian heard long Yinhao’s exclamation, he smiled and said, “Absorb the energy and essence in this corpse as soon as possible. It Won’t be safe outside of this cosmic ruin. It’s a sin to have treasures. However, as long as you absorb all of it, there won’t be any problems.. By absorbing this corpse, you have the hope of stepping into the peak of the universe’s ruler! “\t\t\t\t\t\t</div>", "images": {}, "success": true}