{"id": 1001, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073902.html", "title": "Chapter 4003 - Chapter 4003: The Chance For The 4002 Main Body To Be Upgraded Again!", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4003 - Chapter 4003: The Chance For The 4002 Main Body To Be Upgraded Again!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4003: The chance for the 4002 main body to be upgraded again!<br/><br/>Translator: 549690339<br/><br/>“This Wang Xian sage actually gave the two corpses to his junior brothers and sisters in the Dragon Roar Forbidden Ground? This? ? ?”<br/><br/>“This is simply a great opportunity. To the dragon roar forbidden ground, they are not qualified to obtain treasures of this level! ”<br/><br/>“What kind of opportunity is this?”? “If I remember correctly, Wang Xian joined the Dragon Roar Forbidden Ground Halfway. Now, he has given them two terrifying opportunities. If Wang Xian is willing to give these two corpses to the flowing water forbidden ground, he would be able to exchange for an identity that is not inferior to the status of the holy sons and Saintesses of the Flowing Water Forbidden Ground! ”<br/><br/>In the surrounding area, the holy sons and Saintesses of the other forbidden ground saw this scene and their eyes revealed an extremely heated expression.<br/><br/>The jealousy and envy in their eyes were not concealed at all!<br/><br/>This kind of opportunity was extremely huge even for the holy sons and Saintesses of the flowing water forbidden land.<br/><br/>They did not dare to dream of it!<br/><br/>Now, the two of them, who were only disciples at the peak of the Universe Knight Realm, were able to obtain it.<br/><br/>This was simply…<br/><br/>Simply unfair to the heavens!<br/><br/>Especially the holy son of the flowing water forbidden land. When he heard Wang Xian’s words, the jealousy and greed in his eyes were not concealed at all.<br/><br/>His breathing was a little hurried!<br/><br/>Even he did not get such a treasure.<br/><br/>It was actually obtained by two people whose status was much lower than his and whose strength was much weaker than his? He was somewhat unwilling to accept this!<br/><br/>“Brother Wang Xian, we… ”<br/><br/>Long yinyin and long yinhao were stunned. They opened their mouths with a look of shock on their faces.<br/><br/>The words of these two corpses were not pleasant to hear.<br/><br/>If they had been obtained by the dragon roar forbidden ground, if they weren ‘t in the universe ruins right now…<br/><br/>Then these two corpses could give them the dragon roar forbidden ground and bring them a disaster.<br/><br/>Yes, it was that terrifying.<br/><br/>Currently, the Dragon Roar Forbidden Ground didn ‘t have any universe ruler pinnacle level great beings.<br/><br/>And these two corpses could give an extremely talented disciple a 50% chance of reaching the universe ruler pinnacle level.<br/><br/>Although it wasn’t a 100% chance, it was already very terrifying.<br/><br/>The peak of the Universe Overlord realm was the strongest in the entire universe!<br/><br/>Other than the Heaven’s origin, they were the strongest existences.<br/><br/>Now, a huge opportunity had fallen on them!<br/><br/>“Hehe, we’ll find a place to absorb it later!”<br/><br/>Wang Xian smiled and continued. He looked at saintess liuyue and said,<br/><br/>Saintess liuyue, quickly discuss the conditions with the other forbidden lands.<br/><br/>Once the conditions are settled, we will break all the remaining magic pillars! ”<br/><br/>“Alright! ”<br/><br/>Saintess Liuyue’s eyes flickered as she looked at Wang Xian. She then glanced at long yinyin and her brother and revealed a hint of envy.<br/><br/>Saint Sons and saintesses, Next, we will break the remaining magic pillars. Other than the metal-attributed magic pillars, you can trade with us for the rest of the magic pillars. ”<br/><br/>“Get your seniors to contact our seniors in the flowing water forbidden ground. The one with the highest price will get it. Also, let me remind you that the two treasures on the corpses of every powerhouse belong to Saint Son Wang Xian. He can choose First! ”<br/><br/>Saintess flowing moon spoke to all the saint sons and Saintesses around her!<br/><br/>His words made all the saint sons and saintesses look excited.<br/><br/>“If we can absorb the wind element magic pillar… ”<br/><br/>“Contact our seniors in the forbidden ground immediately and ask them to talk to the Flowing Water Forbidden Ground! ”<br/><br/>“To dominate all the inheritances of the peak powerhouses. I hope our Saint Academy can negotiate with the Flowing Water Forbidden Ground! ”<br/><br/>Excited voices were heard. When Wang Xian saw this scene, his eyes flickered.<br/><br/>Saintess flowing moon, we are in the ruins of the universe. Can we send resources here from the outside?”<br/><br/>He couldn’t help but ask Saintess flowing moon.<br/><br/>(‘I can’t do that.”<br/><br/>Saintess flowing moon shook her head.<br/><br/>Wang Xian’s eyes flickered as he had an idea.<br/><br/>He didn’t want all the treasures in the magic pillars for his own use!<br/><br/>He didn’t lack treasures now.<br/><br/>His main goal was to exchange these treasures into resources to upgrade his main body.<br/><br/>Apart from one magic pillar that belonged to the water attribute of the flowing water forbidden ground and the space attribute magic pillar that he obtained himself.<br/><br/>He could also choose two of the treasures that belonged to the corpses of the powerhouses in the ten magic pillars!<br/><br/>That was 20 treasures!<br/><br/>These 20 treasures were the strongest treasures of an expert at the peak of the Universe Dominator realm.<br/><br/>Treasures of this level were extremely precious to a group of experts at the peak of the Universe Dominator realm!<br/><br/>In that case, there was an 80% chance for Wang Xian’s original body to make another breakthrough after exchanging these treasures for resources.<br/><br/>That’s right. As long as Wang Xian achieved another breakthrough, his strength would be terrifying.<br/><br/>Against the destiny of the Heaven’s origin?<br/><br/>It might be a little difficult.<br/><br/>However, he was already at the level of a ruler!<br/><br/>As he was making a plan in his heart, his gaze swept across the surroundings.<br/><br/>Ao Jian was also at the surrounding area. It was just that the two of them had concealed their relationship for the time being!<br/><br/>“Sword Sage AO, please come over. I have something to discuss! ”<br/><br/>Wang Xian hesitated for a moment before speaking directly to Ao Jian!<br/><br/>When Ao Jian heard Wang Xian ‘s words, he cupped his hands and flew towards him immediately.<br/><br/>Both of them flew to the side.<br/><br/>“HMM? What’s the relationship between the holy son of Void Dragon<br/><br/>Forbidden Ground and holy son Wang Xian?”<br/><br/>“It seems that the holy son of Void Dragon Forbidden Ground has some respect for this holy son Wang Xian. What’s going on?”<br/><br/>(‘I don’t know. Do they know each other? What’s their relationship?”<br/><br/>The surrounding holy sons and saintesses were stunned when they saw Wang Xian and Ao jian walking to the side.<br/><br/>The two strongest dark horses on the prodigy roll this time.<br/><br/>One was Ao Jian holy son of Void Dragon Sacred Ground.<br/><br/>The other was Wang Xian holy son of Dragon Roar Forbidden Ground.<br/><br/>These two were definitely dark horses.<br/><br/>Extremely terrifying dark horses!<br/><br/>From the looks of it now, they seemed to know each other.<br/><br/>This made them extremely curious.<br/><br/>“Our Wang Xian and the holy son of the Void Dragon Forbidden Ground know each other? How do they know each other?”<br/><br/>“Yeah, what’s going on?”<br/><br/>When the disciples of the Void Dragon Forbidden Ground saw this scene, they were also slightly surprised!<br/><br/>Long Yin and long Yinhao were also slightly surprised. Their faces revealed a curious and pondering look.<br/><br/>“Brother Wang Xian must have met the experts and disciples of Void Dragon Forbidden Land when he was in the Holy Moon. ”<br/><br/>Long Yinhao guessed. “Yes, it’s very possible! ”<br/><br/>Long Yin also nodded.<br/><br/>However, they didn’t suspect Wang Xian.<br/><br/>What a joke. The two corpses that Wang Xian gave them were more valuable than the entire dragon roar forbidden land.<br/><br/>What did Wang Xian plan to do with the Dragon Roar Forbidden Ground?<br/><br/>It was impossible!<br/><br/>The eyes of the holy sons and Saintesses of flowing water forbidden ground and undeserved forbidden ground flickered when they saw Wang Xian and Ao jian walking to the side.<br/><br/>They were guessing the relationship between them!<br/><br/>After all, Wang Xian and Ao Jian were existences who had obtained or were about to obtain the inheritance of the corpses in the demon pillar.<br/><br/>They might be top-notch experts in the future, so they had to pay attention to them!\t\t\t\t\t\t</div>", "images": {}, "success": true}