{"id": 1011, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073922.html", "title": "Chapter 4013 - Chapter 4013: 4012 Hunt", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4013 - Chapter 4013: 4012 Hunt</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4013: 4012 hunt<br/><br/>Translator: 549690339<br/><br/>“The third level is here! ”<br/><br/>After passing through the second level, they arrived at the third level. The scenery was still the same as the first and second level!<br/><br/>Trees of all colors were growing. They were emitting a seductive glow!<br/><br/>“Roar! Roar! Roar!”<br/><br/>When Wang Xian and the rest had just arrived at the third level, the roar was heard!<br/><br/>Everyone immediately looked towards the direction of the Roar and saw a demonic beast that looked like a giant butterfly.<br/><br/>This demonic beast had a colorful body that covered its flesh.<br/><br/>It was about 1,000 meters in size and emitted a terrifying aura!<br/><br/>“It’s the meat-obsessed demonic beast, a level one overlord of the Universe! ” A holy son looked over and immediately recognized this demonic beast!<br/><br/>“Let’s begin. You said that most of the demonic beasts on the third level are below the level five overlord. Let’s just sweep them away!”<br/><br/>Wang Xian looked at the demonic beast and said!<br/><br/>“Yes. With the strength of our team, it’s still very safe on the third level.<br/><br/>However, it’s impossible for us to sweep them away! ”<br/><br/>The Saint Son Wu Man shook his head, he looked at Wang Xian and said, Saint Son Wang Xian, you might not know this, but the demonic beasts will place their offspring in the abyss corresponding to their strength so that they can grow here. However, if their offspring are killed by the demonic beasts, they might not care about it. However, if they are killed by us, they will retaliate and attack us!”<br/><br/>“In other words, if we continue to hunt without restraint, we might be attacked by the demonic beasts in the deeper layers of the Abyss! ”<br/><br/>The abyss of Demonic Beasts was not as simple as Wang Xian had imagined.<br/><br/>This was the race of the demonic beasts, and they had their own rules.<br/><br/>It did not mean that the demonic beasts in the lower layers would ignore the demonic beasts in the upper layers!<br/><br/>After the offspring of the demonic beasts were born, they would grow up layer by layer and hunt them down!<br/><br/>At this time, if they were hunted by a different species, the demonic beasts might retaliate!<br/><br/>“Oh? Then we really have to be careful! ”<br/><br/>Wang Xian nodded his head slightly when he heard that.<br/><br/>If a level seven demonic beast, the Master of the universe, were to charge at them, they wouldn’t be a match for them!<br/><br/>“Of course, we don’t have to worry too much. Powerful demonic beasts need time to rush over when they sense the death of their offspring. If we manage to deal with it well, we can leave quickly. Every layer of the Demonic<br/><br/>Beasts’Abyss is huge. They can’t lock onto us at all! ”<br/><br/>“In the abyss of Magical Beasts, we have to be careful not to be surrounded by the magical beasts for a long time. Once we are surrounded, we might be attacked by the deeper level of the magical beasts!”<br/><br/>Saintess Liuyue added on from the side!<br/><br/>Wang Xian nodded slightly.<br/><br/>“Let’s go. Let’s start the cleanup! ”<br/><br/>The Barbarian Saint said with a smile. Everyone moved and flew toward the magical beast with the level one realm of the universe dominator.<br/><br/>They moved and flew over quickly.<br/><br/>“Roar! Roar! ”<br/><br/>The Mystery Meat Disc demonic beast sensed that Wang Xian and the rest were flying over and unfurled its colorful wings!<br/><br/>It stared with its eyes and felt a threatening force. It turned around and fled into the distance<br/><br/>As it flapped its wings, waves of chaotic energy burst out from its body!<br/><br/>The Demonic Beast from the abyss of Demonic Beasts had chaotic energy all over its body. There was not only one attribute in its body, but many other attributes.<br/><br/>It was like a fusion of all kinds of energy, extremely chaotic!<br/><br/>However, it possessed terrifying energy!<br/><br/>“Increase Your Speed, kill him! ”<br/><br/>As the barbarian saint spoke, a wave of energy enveloped everyone.<br/><br/>Their speed suddenly increased by several times!<br/><br/>“Hehe, Pll go first! ”<br/><br/>The flowing moon Saintess smiled lightly. With a move of her palm, an incomparably huge staff appeared in her hand!<br/><br/>She raised the staff, and a water web instantly condensed in front of the bewitching meat plate magical beast. The entire water web covered it!<br/><br/>“Roar Roar!”<br/><br/>When the ruler realm first level magical beast saw the water web covering it, it let out a despairing roar.<br/><br/>The water web covered its body, and drops of water flowed into its body.<br/><br/>The entire magical beast instantly fell down, and lost its life force!<br/><br/>“Let’s look for a group of Demonic Beasts to fight. A single demonic beast like this is boring!”<br/><br/>Seeing that the demonic beast was killed so easily, the barbarian saint said with a smile!<br/><br/>“I’ll go and look for it. You guys watch the surroundings first! ”<br/><br/>Wang Xian said to them!<br/><br/>“We’ll go and look around too.”<br/><br/>The holy sons and Saintesses of the forbidden space also said!<br/><br/>Among all the attributes of the space attribute, they were the best at Scouting!<br/><br/>Naturally, they were responsible for scouting!<br/><br/>“Alright! ”<br/><br/>Saintess Liuyue nodded. “Everyone, be careful! ”<br/><br/>Wang Xian nodded and looked ahead. With a flash, he disappeared instantly! The holy sons and Saintesses of the forbidden space also disappeared instantly.<br/><br/>“It’s much more convenient for us to form a team than to act alone! ” A Saintess couldn’t help but laugh when she saw them leaving!<br/><br/>Everyone nodded in agreement.<br/><br/>With the space attribute to conduct reconnaissance, it would be very easy for them to cooperate and fight together.<br/><br/>Wang Xian teleported to a very far location.<br/><br/>With a thought, he sensed his surroundings with his mind.<br/><br/>Currently, with his strength, there was basically no need for him to have any scruples here.<br/><br/>In just a few flashes, he was already very far away from the team!<br/><br/>He quickly sensed his surroundings and encountered a few hundred demonic beasts along the way.<br/><br/>All of them were at the level one, level two, and level three of the Dominator realm.<br/><br/>“The density of the Demonic Beasts in the Demonic Beast Abyss is really high!<br/><br/>Wang Xian couldn’t help but exclaim in surprise.<br/><br/>In the nine-origin universe, the number of masters at the level of the Dominator realm in the universe didn’t seem to be as many as this demonic beast abyss.<br/><br/>Of course, this might have something to do with the blood of the Masters of the Heaven’s origin creation realm.<br/><br/>It might have something to do with the deaths of countless living beings!<br/><br/>It was because the blood of the Heaven’s origin creation realm had caused a change in this place.<br/><br/>Furthermore, the masters of the Heaven’s origin creation realm in the sword and Magic Universe did not manage to get rid of this place.<br/><br/>As for why they did not manage to get rid of this place, it might be because they were used to train the disciples of the Masters in the Universe!<br/><br/>It could also be for other reasons!<br/><br/>The specific situation wasn’t something that Wang Xian could know!<br/><br/>After flying for a day, Wang Xian sensed the presence of a group of demonic beasts.<br/><br/>With a flash, he immediately arrived above this group of Demonic Beasts!<br/><br/>“woo woo, woo woo! ”<br/><br/>“woo woo, woo woo woo!”<br/><br/>The moment Wang Xian appeared, some demonic beasts immediately sensed him.<br/><br/>Those pairs of golden eyes stared at him fiercely.<br/><br/>Wang Xian swept his gaze across the crowd. There were 25 level five masters of the universe.<br/><br/>There were more than 50 level four masters of the universe!<br/><br/>There were also more than 300 other level demonic beasts!<br/><br/>(‘I can easily exterminate a group of demonic beasts of this level by myself! ” Wang Xian took a look and mumbled.<br/><br/>He looked hesitant and decided to inform the barbarian saint son and the rest.<br/><br/>I should fight with them for some time first.<br/><br/>If I can’t, I will leave alone!\t\t\t\t\t\t</div>", "images": {}, "success": true}