{"id": 1010, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073920.html", "title": "Chapter 4012 - Chapter 4012: 4011 Demonic Beast", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4012 - Chapter 4012: 4011 Demonic Beast</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4012: 4011 demonic beast<br/><br/>Translator: 549690339<br/><br/>Very soon, more than 20 Heaven’s favorites of the same generation who were at least level three of the universe masters gathered around the undeserved saint, Saintess flowing moon!<br/><br/>Basically, all the heaven’s favorites of the same generation came over.<br/><br/>During the 100 million years in the cosmic ruins, many saint sons and Saintesses had improved significantly.<br/><br/>Compared to 100 million years ago, everyone’s strength had improved significantly.<br/><br/>Ao Jian and the rest did not join.<br/><br/>Wang Xian did not let them join mainly because he wanted to see which faction wanted to target the Void Dragon Forbidden Land!<br/><br/>Wang Xian placed the five elements grinding mill and the Tai Chi Dragon Plate on them, which was enough to deal with some dangers.<br/><br/>“Before entering the abyss of Demonic Beasts, we need to set up some formations. This way, it will be easier to deal with demonic beasts. Mages only need to be responsible for long-range attacks, buffing swordsmen, and close combat swordsmen. ”<br/><br/>“Sage Wang Xian, you are very strong, and you have the space attribute. So, you and the false saint will launch a sneak attack and interfere!”<br/><br/>The unexpected saint spoke to them and formed a simple battle formation.<br/><br/>Everyone nodded and did not have any objections.<br/><br/>The abyss of Magic Beasts were all terrifying magic beasts, and there were many of them.<br/><br/>They were able to occupy the center of the sword and magic universe, so their strength wasn’t simple. If the Heaven’s fate didn’t appear, even if all the experts of flowing water forbidden land and unfettered forbidden land joined forces, they might not be able to wipe out the Demonic Beast Abyss!<br/><br/>There were some demonic beasts that were born from the falling limbs of the<br/><br/>Heaven’s fate.<br/><br/>They had terrifying strength.<br/><br/>However, the peak-level masters of the two forbidden lands wouldn’t make a move for the time being.<br/><br/>They would leave it to the other peak-level masters.<br/><br/>There were also quite a lot of masters from the sacred lands and sacred academies!<br/><br/>It was enough to deal with them!<br/><br/>“With our strength, we can go to the third level of the Demonic Beast Abyss! ”<br/><br/>A Sacred Land’s sacred son said!<br/><br/>“Yes, we can go to the third level of the abyss of beasts. On the third level, there are all universe Dominators and below level five. ”<br/><br/>The unexpected holy son nodded.<br/><br/>There were nine levels in the abyss of beasts.<br/><br/>Yes, they lived underground and opened up nine huge underground spaces.<br/><br/>Therefore, it was very difficult to kill them.<br/><br/>There were countless magical beasts living in every level of the space.<br/><br/>“Let’s Go! ”<br/><br/>Wang Xian didn’t have any objections and followed them to the teleportation formation.<br/><br/>Long yinyin and long yinhao were considered to be the weaker ones among the group.<br/><br/>However, they were mages and could mainly cast spells and attack from the back!<br/><br/>The group came to the Teleportation Formation and teleported immediately!<br/><br/>Buzz<br/><br/>In an instant, Wang Xian felt the scene in front of him change.<br/><br/>In front of him, a huge primitive forest appeared.<br/><br/>The trees in the entire forest were black and some were blood-red.<br/><br/>Those blood-red trees were emitting a lustrous glow. It looked very strange!<br/><br/>Wang Xian looked around and his eyes were glowing.<br/><br/>“Is this the abyss of Magical Beasts? This is my first time here!”<br/><br/>Long Yin looked ahead and said.<br/><br/>“This is the highest level of the abyss of Magical Beasts. Most of the magical beasts here are at the celestial emperor level. They pose no threat to us! ” A Saintess from the Saint Academy replied to Long Yin with a smile!<br/><br/>“Oh, thank you! ”<br/><br/>Long Yin Yin Yin smiled and nodded at the SAINTESS.<br/><br/>“No Need! ”<br/><br/>The SAINTESS also smiled.<br/><br/>Although Long Yin Yin and long Yin Hao came from the weak forbidden land, they had obtained the inheritance of the corpses in the magic pillar. No saint child or Saintess dared to underestimate them!<br/><br/>“Let’s go. The Magic Beasts on the top floor will be cleaned by ordinary disciples. Let’s go to the underground passage and go to the first floor!”<br/><br/>“There are many entrances to the first level of the abyss of Demonic Beasts.<br/><br/>Let’s look for them! ”<br/><br/>It was obviously not the first time for Saintess Liuyue and the rest to be here. They moved and led the way as they spoke to everyone.<br/><br/>Wang Xian was on one side while the unexpected holy son was on the other side.<br/><br/>He and the unexpected holy son were both swordsmen, so they had to protect the mages in the middle!<br/><br/>The group flew forward and soon found a hole beside a red tree.<br/><br/>The hole was pitch-black and extremely deep. It led to the first level of the abyss of Magical Beasts!<br/><br/>“There’s a hole here. Let’s Go!”<br/><br/>The unexpected holy son saw it, he immediately said, “Under normal circumstances, it’s not very dangerous for us to enter the first level. It’s not too risky to venture through such a hole. However, we have to be careful in the deeper level. Although magical beasts are irrational, they can hunt! ”<br/><br/>As he spoke, he looked at Wang Xian.<br/><br/>The main purpose was to explain to him.<br/><br/>They also knew that this was Wang Xian’s first time here.<br/><br/>Wang Xian nodded his head and the group entered the cave entrance.<br/><br/>The cave entrance had a diameter of 1,000 meters. They flew downwards. With their abilities, they actually flew for about five minutes.<br/><br/>This depth was abnormally terrifying!<br/><br/>When he arrived at the first level, he realized that this place was like an underground world!<br/><br/>There were trees and rivers in the entire underground world.<br/><br/>There were also all kinds of colorful flowers.<br/><br/>The entire first level of the abyss of magical beasts emitted a kind of bewitching beauty.<br/><br/>It was like a colorful mushroom, possessing a terrifying toxicity!<br/><br/>Wang Xian took a look and his eyes revealed a curious look.<br/><br/>This abyss of demonic beasts was not simple!<br/><br/>This was only the first level. There were a total of nine levels.<br/><br/>“Let’s go. Let’s look for the entrance to the second level! ”<br/><br/>As the unexpected holy son and the rest spoke, the group continued to look for the entrance.<br/><br/>Soon, they found an entrance.<br/><br/>They stepped into the second level again. The scenery on the second level was similar to the first level.<br/><br/>They continued to go deeper and found the entrance to the third level.<br/><br/>“We have to be careful. Inside the third level, there are all demon beasts at the ruler realm. I heard from our seniors in the unfettered forbidden land that the entire Demon Beast Abyss was a terrifying battlefield. ”<br/><br/>“The Heaven origin destiny realm experts were stained with blood. The disciples of the other experts from the mad demon universe were also stained with blood. The number of disciples who died here was no less than 100 billion! ”<br/><br/>“At that time, the Army of the Mad Demon Universe invaded the center of our sword and Magic Universe. We almost lost that battle. Fortunately, the lord of the flowing water forbidden land broke through, and we won. Otherwise, our sword and magic universe would have been conquered! ”<br/><br/>“But that time, there were too many casualties. The blood turned into a vast ocean, and the corpses stood between heaven and earth, towering into the clouds! ”<br/><br/>“This also gave birth to the abyss of Demonic Beasts. Countless amounts of fresh blood condensed and were tainted by the blood of those damned fellows in the Mad Demon Universe. Demonic Beasts were born. The number of demonic beasts here is very terrifying! ”<br/><br/>The undeserved saint introduced.<br/><br/>Wang Xian was slightly speechless as he listened.<br/><br/>It seemed that the sword and magic universe was far more tragic than the nine-origin universe!<br/><br/>Although there were enemies in the nine-origin universe, they weren’t invaded by the army!\t\t\t\t\t\t</div>", "images": {}, "success": true}