{"id": 1017, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073934.html", "title": "Chapter 4019 - Chapter 4019: 4018 Moved Alone", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4019 - Chapter 4019: 4018 Moved Alone</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4019: 4018 moved alone<br/><br/>Translator: 549690339<br/><br/>“Clang! Clang! Clang! ”<br/><br/>The space sword emitted a terrifying metallic sound.<br/><br/>Forty sharp swords shot forward continuously.<br/><br/>When the three demon hunters saw that Wang Xian was attacking them again, they realized that he was no longer dodging.<br/><br/>All of them roared and attacked Wang Xian directly!<br/><br/>The sharp swords were sent flying by them one after another.<br/><br/>At the same time, their bodies were sent flying backward.<br/><br/>Wang Xian stared at them with a cold glint in his eyes.<br/><br/>With a move of his palm, forty sharp swords flew over rapidly and hovered around him.<br/><br/>Wang Xian’s body trembled as sword mounds formed around him.<br/><br/>With a clench of his palm, all the sword mounds flew into his hand. A spatial sword that contained a terrifying power appeared in his hand once again.<br/><br/>Wang Xian looked at the sharp sword in his hand and a sinister expression appeared on his face.<br/><br/>The sharp sword was about 100 meters in size. He held it in his hand and attacked the demon hunters one by one.<br/><br/>Roar!<br/><br/>When the three berserk demon hunters saw this, they rushed over and clawed at Wang Xian with their sharp claws.<br/><br/>“Bang Bang Bang! ”<br/><br/>“Bang Bang Bang! ”<br/><br/>Both parties engaged in close combat. Streams of energy gathered on their sharp claws.<br/><br/>Wang Xian’s energy was gathered on this terrifying sharp sword.<br/><br/>He waved his long sword and collided with the three demon hunters!<br/><br/>The terrifying attack force caused the three demon hunters to fly backward continuously!<br/><br/>“Hehe, if all four of them are berserk, I might have to be wary. If there are three of them, go to hell! ”<br/><br/>Wang Xian waved his space sword with both hands. His gaze locked onto one of the demon hunters as he continued to slash at it!<br/><br/>In the past, Wang Xian was able to fight seven to eight demon hunters who were of a higher level than him.<br/><br/>However, as his level increased, the strength of his opponents also became stronger.<br/><br/>However, as a space attribute, he possessed a large number of sharp swords that were innate treasures.<br/><br/>He possessed sword techniques at the heaven’s creation level.<br/><br/>His perception was terrifying!<br/><br/>Under various circumstances, his combat strength was extremely terrifying.<br/><br/>He was still able to fight against four to five existences that were higher in level than him.<br/><br/>One had to know that Wang Xian’s original body had already been upgraded. His current strength had already reached the level of a ruler.<br/><br/>This also allowed this clone of his to gain a lot of benefits.<br/><br/>It wasn’t a big problem to fight three of them head-on!<br/><br/>It was just that it would take some time for the berserk demon hunters to destroy them!<br/><br/>“Bang! Bang! Bang!”<br/><br/>Wang Xian quickly arrived in front of one of the demon hunters. The sharp sword in his hand kept slashing at it.<br/><br/>The Demon Hunter, who was in the level six realm, kept resisting with a face full of fear.<br/><br/>“Roar! Roar! ”<br/><br/>At the side, the other two demon hunters immediately came over to provide support.<br/><br/>They were engaged in a chaotic battle once again!<br/><br/>“Bang Bang Bang! ”<br/><br/>Wang Xian relied on his powerful perception and battle experience to engage in a fierce battle with them.<br/><br/>With the innate supreme treasure sharp sword and the heaven origin sword technique, he had always been in an advantageous position.<br/><br/>A large amount of fresh blood slowly appeared on the bodies of the three demon hunters!<br/><br/>The battle continued to erupt.<br/><br/>“Roar Roar Roar! ”<br/><br/>The three demon hunters continued to roar.<br/><br/>They were in a frenzy.<br/><br/>The terrifying energy charged into the surroundings, causing the entire world to change color.<br/><br/>Wang Xian’s expression did not change.<br/><br/>In the other position, the barbarian saint was fighting against two demon hunters by himself. Similarly, he had the upper hand!<br/><br/>The flowing moon Saintess was not inferior either.<br/><br/>The group of demon hunters who were at level six were all suppressed.<br/><br/>Below them, the group of holy sons and Saintesses had the upper hand.<br/><br/>The powerful hunter demons had already been eliminated by Wang Xian and the rest. Therefore, when they fought, the pressure was not too great.<br/><br/>One by one, the hunter demons were killed by them!<br/><br/>The battle continued for more than ten hours.<br/><br/>The group of holy sons and Saintesses killed all the hunter demons!<br/><br/>This made all of them take a deep breath.<br/><br/>They looked to the left and the sky, their eyes shining.<br/><br/>“Wang Xian, Holy Son Wu Man, and Saintess Liu Yue are at the upper hand, especially Wang Xian. After the demon hunters ‘frenzy ends, it will be the end of the demon hunters! ”<br/><br/>“Wang Xian is too brave. He chased after three demon hunters by himself. He is too strong. Those three demon hunters are already injured. If this continues, Wang Xian will definitely win! ”<br/><br/>“Saint Wu Man and Saint Liu Yue should be able to win as well. However, this might take some time! ”<br/><br/>(‘We are too weak. We can’t help much! ”<br/><br/>Below them, the group of Saint Sons and Saintesses looked at the three battlefields and started discussing.<br/><br/>“Saint an Sansi, should we contact some seniors and ask them to help us?”<br/><br/>A saint child asked the Saintess of the unfettered forbidden land.<br/><br/>“We’ve already contacted the nearest level 6 ruler realm expert! ”<br/><br/>Saintess an Sansi nodded. (‘We didn’t send any experts to the unfettered forbidden land. Experience is experience. We can’t just send experts over when we’re in danger. ”<br/><br/>“There are level 6 ruler realm experts in the surroundings of our forbidden land, and they’ve already arrived! ”<br/><br/>At this moment, the false saint of the forbidden space also said!<br/><br/>Saintess an Sansi nodded and looked at the battlefield. “Let’s Watch and<br/><br/>The holy sons and Saintesses nodded.<br/><br/>Now that the crisis was over, they felt much more relaxed.<br/><br/>As time passed, the demon hunters ‘injuries became more and more serious.<br/><br/>However, the demon hunters didn’t give up. Instead, they became even more bloodthirsty and Berserk!<br/><br/>“Bzzz bzzz!”<br/><br/>“Bzzz bzzz! ”<br/><br/>After a few hours, figures suddenly appeared around them.<br/><br/>Senior brother! ”<br/><br/>When saint son Xu Ni saw more than a dozen figures suddenly appear, he immediately shouted.<br/><br/>“Junior brother, are you alright? Do you want us to take action?”<br/><br/>Among the more than ten figures, the leader of a middle-aged man’s gaze landed on them. He teleported over, glanced at the three battlefields, and asked with a smile.<br/><br/>“There shouldn’t be a need. The three Saint Sons can handle it!”<br/><br/>Saint son Xu ni shook his head. “Thank you for coming to help us, senior brother. ”<br/><br/>“Hehe, we’re all from the same sect. Moreover, you’ve encountered some danger. It’s normal for us to come over and take a look! ”<br/><br/>More than a dozen experts from the void forbidden ground nodded.<br/><br/>Among the dozen of them, three of them were at level six in the universe.<br/><br/>The rest were at level three to level five.<br/><br/>It was also a powerful team.<br/><br/>Unlike them, this team was made up of the Saint Sons and saintesses from the previous generation of the Void Forbidden Ground.<br/><br/>Senior brother, look over there. Isn’t that the Saint Son from the Dragon Roar Forbidden Ground? His strength is so strong and the treasures in his hands are so powerful! ”<br/><br/>At this moment, an expert from the forbidden ground of space looked towards Wang Xian with a hint of shock in his eyes.<br/><br/>He was especially shocked when he saw the 40 space swords surrounding Wang Xian.<br/><br/>So many space swords of the innate supreme treasure level were simply too terrifying!\t\t\t\t\t\t</div>", "images": {}, "success": true}