{"id": 1012, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073924.html", "title": "Chapter 4014 - Chapter 4014: 4013 Battle", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4014 - Chapter 4014: 4013 Battle</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4014: 4013 battle<br/><br/>Translator: 549690339<br/><br/>“Whoosh! Whoosh! Whoosh! ”<br/><br/>Wang Xian sent a message to the saint son and Saintess flowing moon.<br/><br/>A few hours later, figures flew over one by one!<br/><br/>At this moment, Wang Xian had already left the place where the demonic beasts gathered earlier.<br/><br/>Saint Son Wang Xian, have you discovered the Demonic Beast Horde?”<br/><br/>The Saint Son and the rest looked at Wang Xian and asked with smiles on their faces.<br/><br/>“I’ve found them. There are 25 demonic beasts at level five of the universe Dominators, more than 40 at level four of the universe Dominators, and more than 300 of the other demonic beasts. ”<br/><br/>Wang Xian nodded and spoke to them!<br/><br/>“HMM? The strength of this demonic beast race is not weak at all! ” Upon hearing that, the flowing moon Saintess focused her gaze and said!<br/><br/>“It’s not a big problem. We can easily destroy them! ”<br/><br/>Wang Xian spoke.<br/><br/>“With our strength, it’s indeed not a big problem. We just need to be careful not to be attacked by the demonic beasts on the next level! ”<br/><br/>The barbarian saint son nodded and swept his gaze across the crowd behind him. “Everyone, get ready for battle. Leave the level five and level four masters of the universe to us. The rest will be left to you.”<br/><br/>The group of Saint Sons, saintesses, and heaven’s favorites responded immediately with sparkling eyes.<br/><br/>This demonic beast army was still a huge pressure for them.<br/><br/>However, they had the saint son Wang Xian, the barbarian saint son, and the flowing moon Saintess on their side, so it was not a big problem!<br/><br/>“Let’s Go! ”<br/><br/>Wang Xian gestured to them and led the way!<br/><br/>Soon, they arrived at the location of the demonic beasts ahead.<br/><br/>“It’s the hunter Demonic Beasts.”<br/><br/>When the barbarian saint and the rest got closer and saw the humanoid demonic beasts in front of them, the barbarian saint immediately spoke up!<br/><br/>A grave expression appeared on his face.<br/><br/>“What do you have to say?”<br/><br/>Wang Xian saw his expression and asked him.<br/><br/>The demonic beasts in front of them looked similar to humans, but they were a few thousand meters in size.<br/><br/>Their entire bodies were filled with terrifying sharp weapons, as though they were killing machines!<br/><br/>“The hunter demonic beasts belong to a large race in the Demonic Beast Abyss. They can be found on every level. This is also the reason why there is a high possibility of powerful hunter demonic beasts charging up from the lower level. ”<br/><br/>“They are the most dangerous demonic beasts to hunt! ”<br/><br/>Saintess Liuyue introduced!<br/><br/>“There’s such a Thing?”<br/><br/>Wang Xian’s eyes flickered slightly.<br/><br/>Saintess flowing moon, I suggest that we don’t provoke them. The strength of this race is considered to be at the top of the third level. There’s a 60-70% chance of hunting them down. There will be demonic beasts charging over from the fourth level. The risk is very high! ”<br/><br/>The saintess from the forbidden space pondered for a moment before she suggested!<br/><br/>“A high risk also means a high reward. Could it be that we are only going to hunt some demonic beasts that dominate the third or fourth level?”<br/><br/>Wang Xian looked at the demon hunter in front of him and frowned slightly.<br/><br/>It would be meaningless if they didn’t hunt these demonic beasts!<br/><br/>“Yes, the risk is high, but the reward is also high. We are here to gain experience and clear out the abyss of Demonic Beasts. If we are only targeting some weak demonic beasts, there is no need to form a team! ”<br/><br/>The wildless holy son nodded in agreement and swept his gaze around. “Everyone, do you want to make a move?”<br/><br/>“With the wildless holy son here, our strength is much stronger than this demonic beast race. If we don’t make a move, then it doesn’t make sense! ”<br/><br/>“Entering the Demonic Beast Abyss isn’t 100% safe! ”<br/><br/>The holy daughter Holy Son hesitated for a moment before speaking up!<br/><br/>“Alright everyone, prepare to attack! ”<br/><br/>Saintess Liu Yue’s gaze focused as she ordered everyone!<br/><br/>“Fight!”<br/><br/>“Swordsman, let’s Charge! ”<br/><br/>The barbarian saint waved his arm and a huge sword that was three meters in size appeared in his hand. Lightning surrounded it!<br/><br/>Wang Xian moved and appeared above the demonic beasts in a flash!<br/><br/>When their energy erupted, hundreds of demonic beasts also saw Wang Xian and the rest. Their eyes were filled with coldness.<br/><br/>In their cold eyes, an energy burst out instantly and attacked them.<br/><br/>They launched an attack directly!<br/><br/>When Wang Xian saw it, his expression didn’t change! “Whoosh! Whoosh! Whoosh! Whoosh! ”<br/><br/>In an instant, space swords appeared around him.<br/><br/>There were more than a dozen space swords, and half of them were terrifying existences at the level of innate supreme treasures.<br/><br/>Although Wang Xian’s void dragon body could not control so many innate supreme treasures at once, the sharpness of an innate supreme treasure was also very terrifying. It was not something that an innate spiritual treasure could compare to!<br/><br/>More than a dozen space swords instantly attacked the level five hunters who were masters of the universe! Whoosh! Whoosh! Whoosh! Whoosh<br/><br/>Roar! Roar<br/><br/>When Wang Xian flew into the sky, streams of golden energy shot toward him.<br/><br/>Instantly, more than a dozen hunters charged toward him.<br/><br/>That terrifying aura and violent aura made one’s heart palpitate.<br/><br/>The hunters possessed the wind, darkness, and metal attributes. When these attributes were combined, it was extremely explosive!<br/><br/>Strangle! ”<br/><br/>Wang Xian looked at them and snorted coldly. Above them, more than a dozen space swords were connected to each other.<br/><br/>The sword tomb was set up instantly.<br/><br/>The Sword Formation was formed instantly!<br/><br/>A sound that sounded like glass shattering was heard. More than a dozen space swords were sent to strangle the demon hunters below in an instant!<br/><br/>In the void, there seemed to be countless space swords condensed into one. With a flash, it instantly pierced through more than ten demon hunters!<br/><br/>“Ao ao ao ao!”<br/><br/>In the next instant, a miserable cry sounded. More than ten demon hunters were instantly killed and fell down!<br/><br/>“What a powerful attack. ”<br/><br/>Seeing this scene, the barbarian saint child’s eyes were filled with fighting spirit!<br/><br/>Lightning coiled around his body, and the huge sword was also covered by lightning!<br/><br/>“Crackle!”<br/><br/>He flashed like a bolt of lightning, instantly shuttling in front of them!<br/><br/>One by one, the demon hunters saw him wave his sharp arms and sweep towards the Lightning.<br/><br/>But the Lightning was too fast, instantly piercing through their bodies.<br/><br/>The giant sword directly pierced through their chests!<br/><br/>The lightning flashed and pierced through the bodies of the nine demon hunters in an instant.<br/><br/>The nine demon hunters were also easily killed by him!<br/><br/>“One water, one world! ”<br/><br/>When Saintess Liu Yue saw this scene, a hint of fighting spirit flashed in her eyes. The huge staff in her hand glowed.<br/><br/>Each of them seemed to contain the water droplets of the entire world as they attacked the level five demon hunters who were the masters of the Universe!<br/><br/>When the rest of the hunters saw Wang Xian and his team, they let out a furious roar and charged towards them!<br/><br/>“Prepare to attack! ”<br/><br/>One of the holy sons shouted as he held a sharp sword in his hand.<br/><br/>“Magic, Attack!”<br/><br/>At the back, a group of holy sons, Holy Daughters and Heaven’s favorites who were good at magic immediately released their magic and began to attack!\t\t\t\t\t\t</div>", "images": {}, "success": true}