{"id": 1016, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073932.html", "title": "Chapter 4018 - Chapter 4018: 4017 Versus Four", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4018 - Chapter 4018: 4017 Versus Four</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4018: 4017 versus four<br/><br/>Translator: 549690339<br/><br/>“Bang, Bang, Bang!”<br/><br/>A terrifying collision sound was heard.<br/><br/>The four demon hunters’ eyes emitted a golden glow. When they collided with Wang Xian’s 10,000-meter-long giant sword, a terrifying sound was produced.<br/><br/>The spatial sword collapsed and the golden glow dissipated!<br/><br/>Roar!<br/><br/>The four demon hunters saw that the sharp sword was broken and instantly pounced towards Wang Xian.<br/><br/>Demon Beasts were best at close combat.<br/><br/>This was especially so for demon hunters. Their entire bodies were filled with weapons!<br/><br/>The speed of the four demon hunters was extremely ferocious and fast!<br/><br/>When Wang Xian saw them, he focused his gaze slightly and disappeared in an instant!<br/><br/>The other 18 sharp swords were suspended in the surroundings. Similarly, they started to set up sword catacombs!<br/><br/>One of the demon hunters in the middle roared furiously. Three of them charged at Wang Xian once again.<br/><br/>The other one attacked the spatial swords one after another.<br/><br/>They felt a sense of threat from the spatial swords!<br/><br/>“Split up? You’re courting death! ”<br/><br/>Wang Xian smiled sinisterly when he saw this scene.<br/><br/>He moved his body and flew towards a distant location.<br/><br/>The three demon hunters immediately gave chase from behind!<br/><br/>Buzz! Buzz<br/><br/>When he was flying for a distance, his figure was slightly illusory.<br/><br/>Teleportation!<br/><br/>At the instant he teleported, the three demon hunters had already sensed Wang Xian’s teleportation location.<br/><br/>They waved their arms and a terrifying bone spike shot out from their arms!<br/><br/>When Wang Xian saw this scene, his gaze did not waver at all!<br/><br/>He looked at the demon hunter who was attacking the space sword!<br/><br/>“Sword 22, sword formation, open! ”<br/><br/>Wang Xian growled. The 22 sharp swords that were in the air just now trembled violently!<br/><br/>The sharp swords on them spun and the densely packed sharp swords were like a storm as they attacked the demon hunter directly.<br/><br/>The hunter demon felt threatened and looked over. His arms and limbs were crossed together.<br/><br/>They formed a spherical shape!<br/><br/>“Roar! Roar! Roar!”<br/><br/>It roared crazily, and waves of energy continuously surged out of its body.<br/><br/>The energy was blood-red, golden-yellow, and dark. It was abnormally mixed!<br/><br/>Abnormally violent!<br/><br/>This was a violent power.<br/><br/>The moment he sensed that his life was in danger, he went berserk!<br/><br/>Buzz<br/><br/>After Wang Xian launched an attack, he quickly dodged to the side.<br/><br/>Three bone spikes had already arrived in front of him!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Wang Xian continued to perform short-distance teleportation. With a thought, he arrived at another place directly!<br/><br/>However, that bone spike seemed to have a life of its own. It locked onto Wang Xian.<br/><br/>No matter how he teleported, he would be pursued!<br/><br/>Wang Xian teleported rapidly. His main focus was on the hunter demon that was being attacked.<br/><br/>With a wave of his arm, the other 18 spatial swords were formed into 10 sword catacombs!<br/><br/>He did not continue to condense them. The 10 sword catacombs fused together instantly and headed straight for the Hunter Demon!<br/><br/>Bang! Bang! Bang<br/><br/>The Sword twenty-two sword formations landed on the Demon Hunter’s body, causing it to be covered in blood!<br/><br/>At this instant, the sharp swords formed from the ten sword mounds once again pierced towards it.<br/><br/>Seeing the terrifying sword that came slashing towards it in an instant, the demon hunter that was already heavily injured let out a frantic and terrified roar!<br/><br/>“Roar Roar Roar! ”<br/><br/>When the other three demon hunters saw it, their expressions changed drastically. They immediately flew towards it.<br/><br/>However, they were still a step too slow. The sharp sword pierced through the demon Hunter’s body.<br/><br/>It destroyed the demon Hunter’s body directly!<br/><br/>When Wang Xian saw this scene, a smile appeared on his face.<br/><br/>He moved his body and continued to dodge the attack of the bone spikes.<br/><br/>One sharp sword after another flew towards Wang Xian.<br/><br/>A total of 40 space swords arrived in front of him and attacked the bone spikes.<br/><br/>“Bang! Bang! Bang!”<br/><br/>The space swords, which were innate treasures, collided with these bone spikes.<br/><br/>They blocked the bone spikes easily!<br/><br/>The three demon hunters let out an angry roar when they saw one of their comrades die!<br/><br/>Fresh blood oozed out from their bodies as they went berserk!<br/><br/>Their blood-dripping golden eyes stared at Wang Xian as they attacked him!<br/><br/>“Eh? The sage Wang Xian has already killed one demon hunter. Hiss, the sage<br/><br/>Wang Xian’s strength is so terrifying! ”<br/><br/>“Impressive, impressive. The sage Wang Xian has already killed one of them. However, the other three demon hunters went berserk immediately. After they went berserk, their strength is no weaker than the previous four times! ”<br/><br/>“The Saint Wang Xian was able to kill one just now. He can do the same now. Kill! The demon hunters who are at the level six of the Dominator realm have already been blocked. The ones who are at the level five of the Dominator realm have already been killed by the Saint Wang Xian and the rest. Let’s kill the rest of the demon hunters! ”<br/><br/>“His strength is so terrifying. In such a short period of time, he was able to kill a demon hunter while fighting against four of them. How terrifying! ”<br/><br/>At the bottom, the holy sons and Saintesses could sense the battle on Wang Xian’s side. Their faces were filled with shock.<br/><br/>He was able to kill a demon hunter in such a short period of time while fighting against four of them.<br/><br/>The strength of the Holy Sons of Wang Xian was truly invincible!<br/><br/>At another location, the holy sons of Wuman and Saintess Liuyue could sense the battle. Their faces were also filled with shock.<br/><br/>They knew that there was a considerable gap between their strength and Wang Xian’s!<br/><br/>“Kill!<br/><br/>They roared and erupted instantly.<br/><br/>They had the best cultivation methods and treasures in the entire universe. Naturally, they didn’t want to be weaker than others!<br/><br/>“Hehe, with just the three of you, I can exhaust all of you to death! ”<br/><br/>When Wang Xian saw the three demon hunters go berserk, his face revealed a cold expression.<br/><br/>The strength of the demon hunters had increased drastically after going berserk. However, it was impossible for them to maintain their berserk state.<br/><br/>If it continued for dozens of hours, they might not be able to hold on any longer!<br/><br/>When Wang Xian saw that they were attacking him, he moved his body and immediately tried to dodge.<br/><br/>The greatest means of a practitioner of space power was to escape!<br/><br/>Escape!<br/><br/>The three berserk demon hunters wanted to surround Wang Xian and attack him.<br/><br/>They knew that the longer they stayed in their berserk state, the greater the damage they would suffer.<br/><br/>Therefore, they wanted to kill Wang Xian quickly!<br/><br/>However, with Wang Xian’s speed, they couldn’t catch up to him at all!<br/><br/>This made them extremely furious. Suddenly, one of the demon hunters let out a furious roar and stared at the area below.<br/><br/>His gaze was locked onto the group of holy sons and Saintesses below!<br/><br/>He charged forward abruptly!<br/><br/>“Huh?”<br/><br/>“You still have some intelligence!”<br/><br/>Wang Xian frowned slightly when he saw this scene.<br/><br/>He waved his arm and numerous sharp swords attacked. Instead of fleeing, he took the initiative to attack!<br/><br/>At the area below, the group of holy sons and Saintesses was locked onto by a hunter demon who was in the level six realm. Their hearts turned cold!<br/><br/>When they saw Wang Xian intercept them, they heaved a heavy sigh of relief! They knew that they had dragged Wang Xian and the Holy Sons back!\t\t\t\t\t\t</div>", "images": {}, "success": true}