{"id": 1013, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073926.html", "title": "Chapter 4015 - Chapter 4015: 4014 Came From The Lower Level Hunter Demon Beasts", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4015 - Chapter 4015: 4014 Came From The Lower Level Hunter Demon Beasts</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4015: 4014 came from the lower level hunter Demon Beasts<br/><br/>Translator: 549690339<br/><br/>Boom! Boom! Boom<br/><br/>The battle began!<br/><br/>The entire team immediately engaged with hundreds of Hunter Demon Beasts!<br/><br/>Those who were above level four as the masters of the universe were all blocked by Wang Xian, Saint Barbarian Wu, and Saintess flowing moon.<br/><br/>The rest of the demon beasts and the rest of the team fought!<br/><br/>The swordsmen were engaged in close combat at the front.<br/><br/>At the back, a group of mages were providing support and long-range attacks!<br/><br/>With their cooperation, they were able to suppress the group of Demonic Beasts!<br/><br/>Wang Xian instantly killed more than a dozen level five hunters who were masters of the universe. He waved his arm.<br/><br/>Space swords were suspended in the surroundings. Sword mounds were arranged in the surroundings!<br/><br/>“Roar! Roar! Roar!”<br/><br/>A group of demonic beasts who were at the fourth or fifth level could feel the terrifying pressure coming from Wang Xian’s side.<br/><br/>They became agitated and roared furiously.<br/><br/>“Boom! Boom!”<br/><br/>They stomped heavily on the ground and charged straight into the sky.<br/><br/>In an instant, more than 30 hunter demonic beasts attacked Wang Xian.<br/><br/>They waved their sharp claws and clawed at the sky directly!<br/><br/>Streams of violent energy shot towards Wang Xian directly!<br/><br/>Buzz<br/><br/>Wang Xian waved his arm. The surrounding sword catacombs trembled and immediately connected together.<br/><br/>A sword formation was formed and covered the area below!<br/><br/>“PFFT! PFFT! PFFT!”<br/><br/>Any hunter demonic beasts that rushed over were killed by Wang Xian directly!<br/><br/>One move, one full second!<br/><br/>“Brother Wang Xian, isn’t your attack power too terrifying?”<br/><br/>From the side, Saint Wu Man was shocked when he saw Wang Xian killing so many hunters and demonic beasts with two moves.<br/><br/>This was a real battle.<br/><br/>He could clearly sense the powerful attack power contained in Wang Xian’s two moves!<br/><br/>This made him look shocked!<br/><br/>“Leave some for us! ”<br/><br/>Saintess Liu Yue looked over and opened her mouth!<br/><br/>She couldn’t help but speak out!<br/><br/>After witnessing such terrifying swordsmanship, Saintess Liuyue was basically certain that it would be difficult for her to defeat Wang Xian. There was even a possibility that she would be defeated.<br/><br/>That was because she was a mage.<br/><br/>A strong person with spatial attributes had a huge advantage over a mage!<br/><br/>“Hehe, good!”<br/><br/>Wang Xian smiled and nodded his head lightly!<br/><br/>He floated in the air and didn’t continue his attacks.<br/><br/>Below him, the group of demon beasts sensed Wang Xian’s might and didn’t attack him!<br/><br/>“This Wang Xian is so terrifying. He killed almost half of the top-tier demon beasts in two moves!”<br/><br/>“Hiss, with his strength, he could easily destroy this group of demon beasts by himself. He’s too strong. This lethality is even stronger than the barbarian saint and the rest! ”<br/><br/>“What kind of spatial sword technique is that? How can it be so terrifying?”<br/><br/>The surrounding holy sons, Holy Virgins, and Heaven’s favorites were also filled with shock when they saw this scene!<br/><br/>The truth was that Wang Xian’s combat strength was too strong!<br/><br/>Although he was of the spatial attribute, he was still a master of the fifth level.<br/><br/>Now, he was slaughtering demonic beasts of the same level as if he was slaughtering a dog!<br/><br/>It was too shocking!<br/><br/>“His swordsmanship! ”<br/><br/>In the forbidden space, saint son Xu Ni’s eyes flickered as he looked at Wang Xian. His expression changed drastically.<br/><br/>The space attribute had always been the strongest in their forbidden space.<br/><br/>Now, there was a young man of the same generation whose strength far surpassed his. This made him jealous!<br/><br/>His expression changed drastically as he continued to hunt down the magical beasts in front of him.<br/><br/>When Wang Xian heard Saintess Liuyue’s words, he stopped attacking!<br/><br/>He hovered in the air and watched everything with a smile on his face!<br/><br/>His gaze landed on long yinyin and long yinhao, and he nodded his head slightly.<br/><br/>Without Wang Xian continuing to attack, their battle speed was also much slower!<br/><br/>However, this was also the intention of the Barbarian Saint Son and Saintess<br/><br/>Liuyue.<br/><br/>With their full strength, they could quickly finish the battle.<br/><br/>However, if that was the case, the other members would not be able to train themselves!<br/><br/>Therefore, they slowed down the pace of the battle!<br/><br/>“To ensure safety, the battle will end in half an hour!”<br/><br/>The Barbarian saint killed a demon hunter in front of him with a swing of his sword and spoke to everyone!<br/><br/>The battle ended within half an hour. Even if the lower level demon hunters sensed that their children had been killed, they would have already left by the time they rushed over!<br/><br/>Half an hour was a safe time!<br/><br/>“Yes!”<br/><br/>The disciples also answered loudly!<br/><br/>The demon beasts had very strong vitality. They had a very powerful ability.<br/><br/>That was berserk!<br/><br/>This magical beast was very special. Their bodies had fused with several types of elemental energy.<br/><br/>There was even a hint of conflict between the different elemental energies.<br/><br/>But just like that, the power of the magical beasts when they went berserk was very terrifying.<br/><br/>Under the state of Berserk, their combat strength could be increased by 50% !<br/><br/>Wang Xian hovered above and observed.<br/><br/>Every universe had a unique characteristic of the universe.<br/><br/>The unique characteristic of the nine-origin universe was the universe God country.<br/><br/>The unique characteristic of the sword and magic universe was the magic and swordsmanship!<br/><br/>The unique characteristic of the belief universe was the power of belief!<br/><br/>The unique characteristic of the Void universe was the power of space.<br/><br/>And the formation of these demonic beasts was mainly due to the mad demon universe.<br/><br/>The Mad Demon Universe must also have some unique characteristics.<br/><br/>Berserk might be one of them!<br/><br/>The more severely they were injured, the more terrifying their berserk power would be!<br/><br/>Just now, Wang Xian had killed the hunter demon beasts instantly, so he wasn’t able to go berserk in front of him!<br/><br/>He watched calmly as the hunter demon beasts were killed one by one.<br/><br/>At most, it would take about twenty minutes for all the Demon Beasts to be killed!<br/><br/>“Roar Roar Roar! ”<br/><br/>“Roar Roar Roar! ”<br/><br/>However, ten minutes later.<br/><br/>Suddenly, a terrifying roar was heard.<br/><br/>Not far away, eight figures were sprinting towards them.<br/><br/>They were jumping on the ground, and with each jump, they were able to cross a terrifying area!<br/><br/>Eight Hunter Demons!<br/><br/>Their bodies were more than two thousand meters in size, and their bodies were filled with violent energy!<br/><br/>“Damn, how is this possible? These are the lower level hunter demons. How did they rush over so quickly! ”<br/><br/>“Not good, they are level six hunter demons, Universe Masters. How can they be so fast! ”<br/><br/>Suddenly, a roar sounded.<br/><br/>Following that, everyone felt their bodies turn cold, and a death threat enveloped them.<br/><br/>Everyone looked over, and when they saw the eight figures leaping over at high speed, their pupils constricted slightly!<br/><br/>Their faces were filled with shock and terror.<br/><br/>Eight level 6 sovereign realm hunter demons had directly charged over!<br/><br/>This wasn’t something they could contend against!<br/><br/>“What?”<br/><br/>When the wildless Saint Child, the flowing moon Saintess, and the others saw these eight figures, their expressions changed drastically!<br/><br/>“Run! Run Now! ”<br/><br/>Their expressions changed drastically, and they immediately shouted!<br/><br/>The eight level 6 sovereign realm hunter demons were no longer something they could deal with!<br/><br/>This was especially true for the other team members.. Once they started fighting, they would die!\t\t\t\t\t\t</div>", "images": {}, "success": true}