{"id": 1014, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073928.html", "title": "Chapter 4016 - Chapter 4016: 4015 Versus Four", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4016 - Chapter 4016: 4015 Versus Four</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4016: 4015 versus four<br/><br/>Translator: 549690339<br/><br/>“Roar Roar Roar! ”<br/><br/>“Roar Roar Roar! ”<br/><br/>The sudden arrival of eight level six hunters who were masters of the universe caused the entire team to show fear on their faces!<br/><br/>Without any hesitation, they immediately issued the order to escape!<br/><br/>When Wang Xian saw this scene, he raised his eyebrows slightly.<br/><br/>It was not impossible to deal with the eight hunters who were masters of level six.<br/><br/>However, he did not want to fight them!<br/><br/>There were only eight of them now. What if there were more coming.<br/><br/>Then, they would not be able to fight them!<br/><br/>Wang Xian could escape easily, but they might not be able to!<br/><br/>With this thought in mind, Wang Xian moved his body and followed the group to fly into the distance!<br/><br/>Buzz<br/><br/>Wang Xian did not have the barbarian saint son, the flowing moon Saintess.<br/><br/>Their energy enveloped everyone and brought them to speed up their flight!<br/><br/>The eight demon hunters let out a furious roar when they saw them fleeing!<br/><br/>Their speed suddenly increased by a lot!<br/><br/>Furthermore, they split up and wanted to surround them from both sides!<br/><br/>“They are very fast! ”<br/><br/>The Barbarian Saint Son’s expression changed slightly when he saw this scene and heard the roar coming from behind!<br/><br/>“Increase our speed and shake them off. If we can’t shake them off, we’ll be in trouble! ”<br/><br/>The flowing moon Saintess said with a grave expression!<br/><br/>Their expressions weren’t very good!<br/><br/>Roar!<br/><br/>But at this moment, a demon hunter behind them let out a sky-shaking roar!<br/><br/>This roar spread out in all directions!<br/><br/>It was as if it was summoning!<br/><br/>“Oh no, this demon hunter is summoning! The demon beasts on the next level can order the demon beasts on the next level to stop us! ”<br/><br/>Seeing this scene, saint son Xu Ni’s expression changed slightly as he shouted!<br/><br/>He was currently at the ruler Realm Level 4. If he was targeted by a demon beast at the ruler Realm Level 6, even if he was of the space attribute, he would still be in danger!<br/><br/>The eyes of the Barbarian Saint Son and the rest focused as they roared in a low voice!<br/><br/>His two-meter-long giant sword had now become 1,000 meters in size!<br/><br/>Everyone was standing on his giant sword!<br/><br/>The flowing water power of the flowing moon Saintess was constantly increasing the speed of the giant sword!<br/><br/>Similarly, Wang Xian’s space power was also added to it.<br/><br/>Based on their speed, it shouldn’t be too much of a problem for them to escape!<br/><br/>At the back, the gap between the demon hunters and them was getting bigger and bigger!<br/><br/>“They should be fine! ”<br/><br/>After fleeing for about ten minutes, Saintess Liuyue turned around and glanced around. She could no longer see the demon hunters behind them!<br/><br/>She heaved a sigh of relief!<br/><br/>If they were to be entangled by these eight demon beasts, they would be in great trouble.<br/><br/>Even if they could escape, the entire team would suffer a great loss!<br/><br/>“We should be fine now. It was really dangerous just now. It’s best that we don’t provoke these demon beasts! ”<br/><br/>“Didn’t our seniors go to the fourth level to clean up? It should be better if some seniors go to the fourth level! ”<br/><br/>The group of holy sons and Saintesses said with lingering fear!<br/><br/>However, just as they finished their sentence, roars came from the front!<br/><br/>The sudden roar stunned everyone!<br/><br/>Wang Xian, who was standing on the Sword of the barbarian saint, was also stunned. He looked ahead!<br/><br/>At the front, hundreds of demon hunters were staring at them. Their eyes were filled with murderous intent!<br/><br/>Among these hundreds of demon hunters, twenty of them were at the level five realm!<br/><br/>The rest were at the level of Tier 2 overlords and above! “Eh? How did we encounter such a powerful Demon Hunter clan again?”<br/><br/>Everyone raised their eyebrows when they saw this scene!<br/><br/>“Holy Son Wu, they are charging over! ”<br/><br/>Hundreds of demon hunters were emitting a violent aura as they attacked them!<br/><br/>“This is? This group of demon hunters has entered a berserk state. This is bad.<br/><br/>Finish them off immediately and leave this place!”<br/><br/>When Saintess Liuyue saw that the group of demon hunters had gone berserk even before the battle started, her gaze froze slightly!<br/><br/>Wang Xian looked at this group of demon hunters with a glint in his eyes!<br/><br/>These demon hunters were slightly different from the group they encountered earlier!<br/><br/>Earlier, they were the ones who took the initiative to search for them and then began to hunt!<br/><br/>And this group of demon hunters seemed to be here specifically to attack them!<br/><br/>Moreover, before they could rush over, their entire bodies went berserk!<br/><br/>When the demon hunters went berserk, their combat power instantly increased by 50% !<br/><br/>In their eyes, this was a little shocking!<br/><br/>Demon Beasts weren’t said to go berserk at will.<br/><br/>They went berserk at the cost of their vitality and potential!<br/><br/>Under normal circumstances, they would only go berserk when they were in danger and injured!<br/><br/>The fact that they went berserk before they could charge at them made them a little uneasy!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Wang Xian didn’t hesitate at all. Numerous space swords instantly floated in the air.<br/><br/>One by one, the space swords flashed and started to condense into a sword tomb!<br/><br/>“Attack!”<br/><br/>The Barbarian Saint Son’s eyes focused. The huge sword returned to his hand. Instantly, it was covered by lightning and charged forward!<br/><br/>The group of Saint Sons and saintesses who practiced swordsmanship followed closely behind!<br/><br/>Saintess flowing moon also immediately cast a powerful spell!<br/><br/>“Roar! Roar! ”<br/><br/>At the front, the group of demon hunters seemed to be fearless as they stared at Wang Xian and the rest.<br/><br/>The violent energy in the surroundings formed a terrifying storm!<br/><br/>Even though Wang Xian and the saint son of Barbarian Wu were stronger, they still charged forward fearlessly!<br/><br/>“Moon Sword Formation! ”<br/><br/>Wang Xian looked at the demon hunter without the slightest fluctuation in his gaze!<br/><br/>Above them, sword mounds were formed one after another, connecting to form a sword formation!<br/><br/>A moon sword disk appeared above them, shining with a luster.<br/><br/>“Whoosh! Whoosh! Whoosh! ”<br/><br/>Following that, countless sharp swords charged towards the demon hunters!<br/><br/>“Roar! Roar! ”<br/><br/>At the front, more than 20 demon hunters who were at level five were feeling threatened. They waved their arms.<br/><br/>Terrifying Sharp swords charged towards Wang Xian and the rest.<br/><br/>They completely covered half of the sky!<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Boom! Boom!”<br/><br/>A terrifying collision sound was heard. Apart from Wang Xian, the saint son of Barbarian Wu and Saintess Liu Yue, their attacks had penetrated through their attacks.<br/><br/>The rest of the attacks were all blocked by them!<br/><br/>However, this was already the best!<br/><br/>Wang Xian and the rest’s attacks landed on the hunters who were at the level five realm instantly!<br/><br/>The terrifying destructive power caused their vitality to disappear rapidly!<br/><br/>In an instant, more than 20 demonic beasts who were at the level five realm were killed by them.<br/><br/>Roar!<br/><br/>However, when they killed more than twenty tier 5 sovereign realm demonic beasts, they were flanked on the left and right.<br/><br/>The eight demon hunters charged over at a terrifying speed!<br/><br/>“What?”<br/><br/>Seeing the rapidly charging tier 6 sovereign realm demon hunters, everyone’s faces changed!\t\t\t\t\t\t</div>", "images": {}, "success": true}