{"id": 1029, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073958.html", "title": "Chapter 4031 - Chapter 4031: 4030 Breakthrough!", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4031 - Chapter 4031: 4030 Breakthrough!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4031: 4030 breakthrough!<br/><br/>Translator: 549690339<br/><br/>Wang Xian didn’t want to make any mistakes at the critical moment!<br/><br/>Any accidents would happen!<br/><br/>Even if the body of the Void Dragon was attacked, he could bear with it!<br/><br/>Grovel!<br/><br/>Grovel until his main body broke through!<br/><br/>At that time, no one in the entire sword and magic universe would be able to do anything to him!<br/><br/>The attack this time didn’t make Wang Xian too angry!<br/><br/>The provocation of a few ants was not enough to make him angry!<br/><br/>When both of Wang Xian’s bodies started to enter closed-door cultivation, time passed the fastest!<br/><br/>In the sword and Magic Universe, a group of forbidden holy grounds and holy academies were still cleaning up the abyss of Demonic Beasts in an orderly manner!<br/><br/>Long yinyin and long Yinhao sent some messages to Wang Xian from time to time, telling him about the situation of his training!<br/><br/>While Wang Xian was cultivating in seclusion, he also sent some replies.<br/><br/>Tens of millions of years passed in the blink of an eye!<br/><br/>On this day, Wang Xian received a message from long yinyin and long Yinhao at the same time!<br/><br/>“Huh?”<br/><br/>When he saw this message, his eyes narrowed slightly!<br/><br/>At the abyss of Magical Beasts, a group of powerhouses from the forbidden grounds and the Saint Academy were suddenly attacked by a large number of magical beasts!<br/><br/>During these tens of millions of years, a group of warriors from the sacred lands and sacred academies had already cleared the Demon Beast Abyss to the 6th level!<br/><br/>A large number of demon beasts were killed by them!<br/><br/>But when they entered the 7th level, they were attacked!<br/><br/>The casualties were extremely heavy!<br/><br/>Over 1,000 universe ruler level 5 and above warriors were killed!<br/><br/>According to long yinyin and long Yinhao’s information, a demonic beast had launched a sneak attack on them. Furthermore, it was an organized sneak attack!<br/><br/>The sudden attack left all the masters unable to react in time!<br/><br/>The casualties were extremely heavy!<br/><br/>Furthermore, an organized Demonic Beast Army had appeared on the seventh level of the Demonic Beast Abyss!<br/><br/>Now, the group of holy grounds, forbidden grounds, and sacred academy had canceled the actions of the various teams. Instead, they had formed an entire army!<br/><br/>They even asked Wang Xian where he was now and if he had the time to meet them!<br/><br/>Wang Xian ignored the questions that came after and revealed a thoughtful expression!<br/><br/>The change in the abyss of demonic beasts might be related to the Agar Heavenly Demon God.<br/><br/>The Agar Heavenly Demon God, as an existence who was once blessed by the Heaven’s origin, possessed powerful intelligence.<br/><br/>He had even invaded the interior of the sword and Magic Universe.<br/><br/>Now that he was here again, he could naturally organize the demonic beasts to launch a sneak attack!<br/><br/>The only question was how strong this Aga Heavenly Demon God was!<br/><br/>How far away was he from the destiny realm of the Heaven’s origin!<br/><br/>“I hope this fellow can break through slowly. When I break through, I should be able to kill him and let the Unicorn ox devour him!”<br/><br/>Wang Xian mumbled to himself!<br/><br/>After regaining his dragon’s Roar and Dragon’s roar, Wang Xian continued his cultivation!<br/><br/>100 million years passed very quickly!<br/><br/>Wang Xian’s Void Dragon Body’s realm had also improved. He was now at level six, the ruler of the universe!<br/><br/>During these 100 million years, there were all sorts of news coming from the abyss of Demonic Beasts.<br/><br/>Now, after forming an army, the group of Holy Grounds and sacred academies had achieved consecutive victories!<br/><br/>They had killed a large number of demonic beasts!<br/><br/>Furthermore, during this battle, the group of Holy Grounds, forbidden grounds, and Saint Academy had undergone tremendous tempering!<br/><br/>This also made the group of holy grounds, forbidden grounds, and Saint Academy not anxious.<br/><br/>Using demonic beasts as grindstones.<br/><br/>They were not in a hurry to eliminate all of them!<br/><br/>After Wang Xian received this news, his eyes flickered slightly.<br/><br/>He didn’t know if it was done on purpose by the Asgardian demon god or something else!<br/><br/>In short, he did not care about it!<br/><br/>Time passed, and 100 million years passed once again!<br/><br/>Wang Xian’s void Dragon Body’s strength had reached the seventh level of the universe overlord.<br/><br/>When he reached this level, his improvement speed became extremely slow.<br/><br/>His main body was devouring energy in preparation for a breakthrough!<br/><br/>Without the support of his main body, the speed of his breakthrough had decreased by a lot!<br/><br/>According to Wang Xian’s estimation, it would take him at least 300 to 400 million years to advance to the level eight realm of the universe overlord!<br/><br/>He would have to calculate the time according to the speed!<br/><br/>After all, the place where Wang Xian went into seclusion for cultivation was not a treasured place!<br/><br/>Moreover, sometimes, it might not be as fast as going into seclusion for cultivation!<br/><br/>Long yinyin and long Yinhao had been fighting and training all this while. The speed of their improvement was extremely fast!<br/><br/>Time passed quickly!<br/><br/>Another 200 million years passed, and in these 200 million years, the sacred lands and sacred academies had completely used the Devil Beast Abyss as a training ground!<br/><br/>200 million years ago, not many experts died, but a large number of experts were born.<br/><br/>Later on, the unfettered forbidden land and flowing water forbidden land even issued an order to not exterminate all the Devil Beasts!<br/><br/>It was used as a training ground for the disciples and experts!<br/><br/>This had indeed allowed countless of strong disciples to gain experience and improve!<br/><br/>When Wang Xian looked at this information, he felt that it was very strange!<br/><br/>This Asgard Heavenly Demon God must be planning something!<br/><br/>It was just that he didn’t know what he was planning!<br/><br/>“I’m going to break through!”<br/><br/>During these hundreds of millions of years, he was located at the edge of the Sword and Magic Universe!<br/><br/>Wang Xian had been cultivating at the edge of the universe for hundreds of millions of years!<br/><br/>On this day, when Wang Xian converted the energy in his body into dragon energy.<br/><br/>Wang Xian instantly opened his eyes. His eyes were filled with excitement and excitement!<br/><br/>Crack Crack Crack<br/><br/>Following that, an extremely vast and mighty force was emitted from his body!<br/><br/>“Roar Roar Roar! ”<br/><br/>In the sky, an incomparably huge body of a divine dragon appeared out of thin air!<br/><br/>Wang Xian’s body had already reached the size of hundreds of thousands of kilometers.<br/><br/>He was comparable to a space beast!<br/><br/>In a breath’s time, the color of Heaven and earth changed!<br/><br/>The wind and clouds stirred!<br/><br/>In the chaos at the side, under the might of Wang Xian, the chaos was actually shaking continuously as if there was a huge earthquake!<br/><br/>“Ding, congratulations to host for increasing your level and breaking through to the seventh level of a universe overlord.”<br/><br/>“Ding, congratulations to host for breaking through. The nine origin dragon field has become stronger.”<br/><br/>At this moment, the system’s voice rang out!<br/><br/>He had broken through!<br/><br/>He had finally broken through!<br/><br/>He had used up all the resources of the Lin Niu!<br/><br/>After another 400 million years, Wang Xian had finally filled up the last 5% of his energy!<br/><br/>Finally, he had broken through!<br/><br/>Feeling the explosive energy coming from his body, Wang Xian’s body moved slowly! Boom<br/><br/>Crack! Crack! Crack<br/><br/>His body moved slightly, and cracks appeared in the surrounding void!<br/><br/>Even the universe could not withstand his might!<br/><br/>Terrifying!<br/><br/>Terrifying!<br/><br/>Wang Xian’s eyes shone with excitement!<br/><br/>(‘I don’t know if the current me can match up to the Heaven’s origin creation.<br/><br/>However, I can kill that Agar heavenly demon god, the Agar Heavenly Demon God I met back then, even if he used the shadow of the Demon God!”<br/><br/>At this moment, Wang Xian spoke confidently!<br/><br/>As for the Real Heaven’s origin creation, he needed to touch it personally to know if he could fight against it!<br/><br/>The augmentation of nine types of energy, the fusion of nine types of energy, and the circulation of nine types of energy!<br/><br/>This was the terror of the nine-origin Divine Dragon!<br/><br/>He was only at the seventh level of the Universe Overlord Realm!\t\t\t\t\t\t</div>", "images": {}, "success": true}