{"id": 1024, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073948.html", "title": "Chapter 4026 - Chapter 4026: 4025, The Possibility Of Subduing Him And Advancing To The Heaven’S Origin!", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4026 - Chapter 4026: 4025, The Possibility Of Subduing Him And Advancing To The Heaven’S Origin!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4026: 4025, the possibility of subduing him and advancing to the Heaven’s origin!<br/><br/>Translator: 549690339<br/><br/>When Wang Xian heard Lin Niu’s words, his face was filled with astonishment!<br/><br/>He could sense it in his heart. As long as he could devour the other party, he would be able to break through?<br/><br/>“Why is there such a Feeling?”<br/><br/>Wang Xian asked Lin Niu with slight astonishment!<br/><br/>“In the past, I didn’t understand it. Now, I understand it a little!”<br/><br/>Lin Niu’s eyes sparkled. “Demon Hunter King is no longer him. He has already been invaded. What invaded him is the will of the Agar Heavenly Demon God. ” “The reason why we were born and able to cultivate to such an extent is largely because we were born from the flesh and blood of the Agar Heavenly Demon God. In other words, we were born from his flesh and blood. Now, we have this feeling in our minds. There is only one possibility for demon hunter king to be invaded by the Agar Heavenly Demon God. That is, the Agar Heavenly Demon God has already fallen. He has completely fallen! ”<br/><br/>“His death gave us the feeling that we can break through as long as we devour the other party. Since the barrier in front of us has disappeared, we can also advance to the Heaven’s origin creation realm! ”<br/><br/>Lin Niu told Wang Xian his guess!<br/><br/>When Wang Xian heard it, his face was filled with shock!<br/><br/>The birth of Heaven’s origin creation was not something that could be born just because one wanted to!<br/><br/>Within a universe, there was a limit to the amount of heaven origin creation that could be created!<br/><br/>Just like the 9-origin universe.<br/><br/>Once a water attribute expert broke through to the Heaven origin creation realm, then other water attribute experts would never be able to step into the Heaven origin creation realm!<br/><br/>Unless this water attribute expert died.<br/><br/>Otherwise, they would never be able to create another heaven origin creation of the same attribute!<br/><br/>In the 9-origin universe, there were nine attributes!<br/><br/>In other words, only nine heaven origin creation could be born!<br/><br/>Of course, there was another group, which was the combination of attributes. For example, the yin-yang attribute, cultivating the light and dark attributes at the same time, under the situation where there was a light and dark attribute heaven origin creation expert, could also cultivate both attributes at the same time.., and step into the Heaven origin creation realm!<br/><br/>But the difficulty of stepping into the Heavenly Yuan creation realm through two attributes was twice as difficult as one attribute!<br/><br/>Don’t underestimate this!<br/><br/>Currently, there weren’t Nine Heavenly Yuan creation existences in the nine origin universe.<br/><br/>From this, one could see how difficult it was!<br/><br/>There was also a second chance to advance to the Heavenly Yuan creation realm.<br/><br/>For example, the nine origin universe had the fire attribute Heavenly Yuan creation existence.<br/><br/>But in the sword and magic universe, there was no fire element of the heavenly creation realm.<br/><br/>Then the fire element great beings of the 9 -origin universe could come to the sword and magic universe to complete the breakthrough.<br/><br/>This was possible!<br/><br/>The Great War of the Apocalypse was so tragic.<br/><br/>Every time the Great War of the Apocalypse started, countless universe creatures were killed.<br/><br/>And there was a very important reason!<br/><br/>It was the quota for the breakthrough!<br/><br/>The quota for the breakthrough that countless universe masters fought for.<br/><br/>The reason why countless Pinnacle Universe Masters fought crazily!<br/><br/>They wanted to breakthrough!<br/><br/>They wanted the quota!<br/><br/>For this reason, blood flowed like a river, and the universe dimmed!<br/><br/>Those powerful universes wanted to make their own universes more powerful. They wanted to exterminate this universe being and subdue it.<br/><br/>They wanted their subordinates, their descendants, and their disciples to use this quota to complete their advancement!<br/><br/>Lin Niu and the others had many attributes!<br/><br/>The energy in their bodies was extremely violent!<br/><br/>With two or three types of energy in their bodies, it was basically impossible for them to break through!<br/><br/>Another point was that they were born from the flesh and blood of the<br/><br/>Heavenly Yuan Destiny Realm.<br/><br/>How could a creature born from the flesh and blood of the Heavenly Yuan<br/><br/>Destiny realm advance to the Heavenly Yuan Destiny Realm?<br/><br/>This was simply impossible!<br/><br/>Even if there was a great opportunity, it was impossible to break through!<br/><br/>The only point was that the Heavenly Yuan creator had fallen.<br/><br/>The barrier in front of them had disappeared, and they could take a step forward!<br/><br/>Furthermore, this step would be easier for them to take than other experts.<br/><br/>It would be easier to advance to the Heavenly Yuan creator realm!<br/><br/>This was also the reason why Lin Niu and the others had a feeling that as long as they devoured the other party, they would be able to break through.<br/><br/>“If, in the end, one of you were to completely devour the other party, would you really be able to step into the Heaven’s origin blessed realm?”<br/><br/>Wang Xian asked Lin Niu!<br/><br/>“The possibility is very high. ”<br/><br/>Lin Niu nodded his head, he guessed, “That Agar heavenly demon god seemed to have sensed that he might die during the last calamity. Hence, he left behind a seed. This seed was left on the demon hunter King’s body.”<br/><br/>“After he died, he completely took over the demon hunter King’s body and wanted to devour us. He wanted to revive his second life and step into the Heavenly Yuan Blessed Realm Again! ”<br/><br/>When Wang Xian heard that, he was slightly shocked!<br/><br/>Was this heavenly Yuan blessed realm really that terrifying?<br/><br/>He had predicted that he might die in advance, so he set up a trap!<br/><br/>He wanted to revive his second life!<br/><br/>He wanted to step into the Heavenly Yuan blessed realm again!<br/><br/>Moreover, as long as he devoured the decaying bird and the LINNIU, he might be able to achieve a complete breakthrough in no time?<br/><br/>It was truly terrifying!<br/><br/>“In that case, if you were to devour the decaying bird and the demon hunter King, you might be able to break through to the Heavenly Yuan blessed realm as well?”<br/><br/>Wang Xian was silent for a few minutes. His eyes flickered as he looked at the Linniu and asked!<br/><br/>“The possibility is very high. The barrier in front of us has disappeared. Among the three of us, the one who cultivates faster will be able to step into the<br/><br/>Heaven’s origin destiny realm. However, the balance has been broken. Demon Hunter King has already become the Aga Heavenly Demon God. Furthermore, he has already killed the rotten bird. His strength will increase tremendously. It will be very difficult for me to catch up with him! ” Lin Niu replied!<br/><br/>When Wang Xian heard that, he was slightly silent! This Asgardian demon god was very strong.<br/><br/>Even before he devoured the decaying bird, when Wang Xian fought with him, he couldn’t even save his life by relying on the Heaven’s origin fate fragment!<br/><br/>Unless he made another breakthrough!<br/><br/>As long as he made another breakthrough, he would be able to kill him!<br/><br/>However, if he wanted to make another breakthrough, he would have to expend a huge amount of resources!<br/><br/>“By the way, you said that you still have treasures in your lair. Are there many treasures?”<br/><br/>Wang Xian asked Lin Niu!<br/><br/>“There are many. My territory is very big and I have many treasures!”<br/><br/>Lin Niu nodded and looked ahead. “It’s just ahead. That’s my lair. I hope you won’t kill me and spare my life!”<br/><br/>As he spoke, he looked at Wang Xian with a pleading expression.<br/><br/>“If you are willing to submit to me, I can let you go. However, if you don’t submit, I Won’t Let You Go!”<br/><br/>Wang Xian stared at him and spoke directly!<br/><br/>Lin Niu’s expression didn’t change much when he heard Wang Xian’s words!<br/><br/>This was within his expectations.<br/><br/>The other party was a human and he was a demonic beast. They were sworn enemies!<br/><br/>It was impossible for them to let him off so easily.<br/><br/>Especially after witnessing his strength, it was even more impossible for them to let him off and leave behind any future trouble!<br/><br/>“Alright, Pm willing to submit.”<br/><br/>In the end, Lin Niu could only helplessly lower his head!\t\t\t\t\t\t</div>", "images": {}, "success": true}