{"id": 1020, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073940.html", "title": "Chapter 4022 - Chapter 4022: 4021 Demonic Beasts Born From The Bloodstained Heavenly Fate", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4022 - Chapter 4022: 4021 Demonic Beasts Born From The Bloodstained Heavenly Fate</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4022: 4021 demonic beasts born from the bloodstained heavenly fate<br/><br/>Translator: 549690339<br/><br/>A group of demonic beasts at the peak of the Universe Dominator realm.<br/><br/>Other than one demonic beast at the peak of the Universe Dominator realm, there were also more than ten demonic beasts at the eighth or ninth level of the universe Dominator realm.<br/><br/>Beside this group of demonic beasts, there were some metals.<br/><br/>Metals that contained the fire and darkness attributes.<br/><br/>Furthermore, the amount of these metals was huge!<br/><br/>It was enough to allow the tai chi dragon plate and the five elements grinding to achieve a breakthrough!<br/><br/>This made Wang Xian reveal a hint of excitement in his eyes. He moved his body and approached the demonic beasts!<br/><br/>“Boom!”<br/><br/>The moment he got closer, waves of extremely violent energy charged towards him!<br/><br/>More than ten demonic beasts stared at him coldly!<br/><br/>In the next second, a demonic beast at the level of level nine of the universe Dominator attacked Wang Xian.<br/><br/>The demonic beast at the peak of the universe dominator lay there motionlessly.<br/><br/>It only glanced at Wang Xian!<br/><br/>Wang Xian’s eyes sparkled when he saw this scene.<br/><br/>He stretched out his palm and his arm turned into a dragon claw. He clawed at the demonic beast at the level nine of the Universe Dominator!<br/><br/>The demonic beast was stunned when it felt the terrifying power coming from Wang Xian!<br/><br/>He quickly stopped and roared toward the back!<br/><br/>“PFFT! PFFT! ”<br/><br/>However, it was too late.<br/><br/>Wang Xian’s dragon claw turned into 10,000 meters in size. The terrifying energy instantly crushed the level 9 universe Dominator demonic beast!<br/><br/>“Roar Roar Roar! ”<br/><br/>“Roar Roar Roar! ”<br/><br/>At the front, the group of demonic beasts saw their own kind being killed and instantly went berserk.<br/><br/>They floated up one by one and stared at Wang Xian with a cold gaze!<br/><br/>The demonic beast that was at the peak of the Universe Dominator also stared at Wang Xian with a cold gaze!<br/><br/>It let out a wild roar and felt the energy from Wang Xian’s body.<br/><br/>In the next second, it attacked Wang Xian directly.<br/><br/>More than ten demonic beasts followed closely from both sides!<br/><br/>“Mighty Heavenly Dragon! ”<br/><br/>Wang Xian saw them attacking. He waved his arm and positioned himself in the sky.<br/><br/>An extremely terrifying heavenly dragon was formed directly and attacked more than ten demonic beasts!<br/><br/>“Roar! Roar! ”<br/><br/>The leader of the Demonic Beasts, who was at the peak of the Universe Dominator realm, saw the heavenly dragon that suddenly appeared in the sky. Feeling the threat of death coming from above, his heart beat violently.<br/><br/>“Hou Hou! ”<br/><br/>He let out a wild roar and directly went berserk.<br/><br/>The fiery red energy on his body intertwined with the dark energy, forming a shocking storm!<br/><br/>The surrounding magma water rushed towards the surrounding mines!<br/><br/>Forming an incomparably huge space!<br/><br/>“Hou Hou Hou! ”<br/><br/>The rest of the demonic beasts also went berserk! They attacked the Mighty Heavenly Dragon directly!<br/><br/>“Bang! Bang! Bang!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>A terrifying collision sound was heard.<br/><br/>The Heavenly Dragon in the sky suppressed them with his invincible talent.<br/><br/>A torrent of energy engulfed them.<br/><br/>The attacks of the dozen demonic beasts couldn’t withstand Wang Xian’s attack at all.<br/><br/>They could not be broken at all!<br/><br/>“Roar Roar Roar! ”<br/><br/>In an instant, other than the demonic beast at the peak of the Universe Overlord realm, the rest of the demonic beasts were all dead.<br/><br/>Even though they had gone berserk.<br/><br/>Even the demonic beast at the peak of the Universe Overlord realm was severely injured in an instant!<br/><br/>“Not bad! ”<br/><br/>Wang Xian looked satisfied when he saw the attack of his law form.<br/><br/>This was not an extremely powerful attack of his.<br/><br/>He had yet to unleash his nine origins Dragon Field!<br/><br/>He still had an even more powerful attack.<br/><br/>In addition, he did not use his innate supreme treasure, the heaven origin creation fragment!<br/><br/>Currently, the strength of Wang Xian’s body, even if he did not rely on treasures, was still a little higher than the peak level of the Universe Dominator!<br/><br/>This made Wang Xian look satisfied!<br/><br/>At this moment, the demonic beast at the peak of the universe dominator stared at Wang Xian in astonishment.<br/><br/>It didn’t hesitate at all and quickly fled into the distance!<br/><br/>“You want to escape?”<br/><br/>Wang Xian smiled coldly and flapped his incipient saint wings slightly!<br/><br/>Whoosh!<br/><br/>Wang Xian arrived behind him in an instant at an extremely terrifying speed! He stretched out his dragon claws and clawed at the Demonic Beast’s body!<br/><br/>“Roar! Roar! ”<br/><br/>The Demonic Beast, who was at the peak of the Dominator realm, felt the impending death.<br/><br/>It turned around and spewed out an endless amount of violent energy.<br/><br/>The energy contained the explosive power of flames and darkness!<br/><br/>However, Wang Xian did not show any signs of fluctuation. His dragon claws crushed the energy that it spewed out and landed on its body.<br/><br/>“Roar! Roar! ”<br/><br/>The demonic beast that was at the peak of the Dominator realm let out a miserable and desperate cry.<br/><br/>Wang Xian’s dragon claws penetrated its body and instantly consumed all of its vitality!<br/><br/>Wang Xian waved his arm and stored all the corpses into the mother nest!<br/><br/>His body moved and arrived at the nest of the demonic beasts.<br/><br/>He scanned the metal materials around him and revealed a satisfied expression.<br/><br/>After the five elements grinding mill and the Tai Chi Dragon Plate made another breakthrough, they were comparable to three existences at the pinnacle of the Universe Masters.<br/><br/>Together, they were able to fight against six of them!<br/><br/>This was definitely an extremely terrifying combat strength!<br/><br/>“This lava domain is really a treasure trove. Let’s continue to see if there are any other magical beast races! ”<br/><br/>Wang Xian thought to himself. His body moved and he continued to fly forward.<br/><br/>Now that he was in the abyss of Demonic Beasts, he really didn’t have any scruples!<br/><br/>He continued to fly forward. After flying for a few hours, he didn’t see any traces of demonic beasts.<br/><br/>When he flew for another half an hour, he looked ahead with a stunned expression.<br/><br/>There were a large number of metal treasures in front of him!<br/><br/>These metal treasures were the same as the ones he had just obtained!<br/><br/>The difference was that the number of metal treasures here was much more than before.<br/><br/>He scanned his surroundings in astonishment.<br/><br/>He didn’t find any demonic beasts.<br/><br/>No, Wang Xian could sense the remnant aura of the demonic beasts around him.<br/><br/>The aura of the demonic beasts flew towards a certain direction.<br/><br/>“What’s going on? This place is definitely the lair of a powerful demonic beast race. It’s even much stronger than the lair of the demonic beasts that I hunted just now. What about the demonic beasts here?”<br/><br/>“They actually gave up the treasures in their lair and left directly? were they attacked by the swordsmen and the Masters of the Magical Universe?”<br/><br/>“That’s not right. There are no traces of battle here. They left on their own! ”<br/><br/>Wang Xian stood there and sensed everything around him while mumbling to himself!<br/><br/>It was abnormal for a magical beast race to give up the treasures in their lair and leave directly.<br/><br/>He kept the metal materials and quietly sensed the aura of the demonic beasts.<br/><br/>After hesitating for a moment, Wang Xian followed the aura and flew forward.<br/><br/>He wanted to see where the group of Demonic Beasts went.<br/><br/>What kind of situation did they encounter to make them abandon the treasures in their lair!\t\t\t\t\t\t</div>", "images": {}, "success": true}