{"id": 1028, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073956.html", "title": "Chapter 4030 - Chapter 4030: 4029 Was In Closed-Door Cultivation. Everything Was Waiting For A Breakthrough!", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4030 - Chapter 4030: 4029 Was In Closed-Door Cultivation. Everything Was Waiting For A Breakthrough!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4030: 4029 was in closed-door cultivation. Everything was waiting for a breakthrough!<br/><br/>Translator: 549690339<br/><br/>The fifth level of the abyss of Magical Beasts.<br/><br/>Wu Hongshan, who was in the forbidden space, locked his cold gaze on Wang Xian’s figure.<br/><br/>He was the saint child of the previous generation in the space base!<br/><br/>Now, he had the strength of a level seven universe overlord!<br/><br/>With his strength, in his opinion, it would be very easy for him to kill this little saint child in front of him.<br/><br/>It was very easy!<br/><br/>After all, he was two levels lower than him!<br/><br/>He didn’t think that he would fail!<br/><br/>In the next second, he could even see the head of the Wang Xian holy son flying up.<br/><br/>He could see that his life force was instantly extinguished!<br/><br/>However, when he was only about a hundred meters away from Wang Xian, he suddenly felt a terrifying pressure!<br/><br/>He felt a threat of death!<br/><br/>He saw a phantom image that he had never seen before appearing behind Wang Xian!<br/><br/>This phantom image contained an unparalleled power!<br/><br/>At this moment, he was extremely horrified!<br/><br/>What was going on? What was going on?<br/><br/>Buzz<br/><br/>At this moment, in front of him.<br/><br/>Wang Xian stared at him calmly.<br/><br/>He slowly extended his arm!<br/><br/>The divine dragon figure above him slowly extended his dragon claws!<br/><br/>Wang Xian’s virtual dragon divine dragon body was equivalent to the clone of a super powerhouse no matter what.<br/><br/>After Wang Xian left some backup plans, it would be impossible to completely destroy this clone of his.<br/><br/>Only a powerhouse at the peak of the Universe Dominator could do it!<br/><br/>It was impossible for this space expert who was at the seventh level of the Universe Dominator to kill him!<br/><br/>Wang Xian stretched out his arm and clawed at Wu Hongshan with his Dragon Claws!<br/><br/>In an instant, Wu Hongshan’s body tensed up. He felt that the surrounding void was completely confined!<br/><br/>He was completely confined there and couldn’t move!<br/><br/>There was only a pair of eyes filled with astonishment!<br/><br/>Wang Xian swept his gaze over and looked behind him.<br/><br/>Similarly, he extended his dragon claw and clawed at the other seven people!<br/><br/>Buzz<br/><br/>The Dragon Claw seemed to pierce through the void and appeared in front of the other seven experts of the Void Zone. He grabbed them directly!<br/><br/>“What?”<br/><br/>Everything happened in an instant.<br/><br/>The seven experts of the Void Zone behind him didn’t even have the time to react!<br/><br/>From their point of view, the previous generation of saints from the forbidden space had personally made a move.<br/><br/>It wasn’t easy for a level seven universe dominator to kill a level five universe dominator in an instant!<br/><br/>All they had to do was wait for the treasures to be distributed!<br/><br/>However, before they could react, they were already imprisoned and captured!<br/><br/>Their eyes were wide open, filled with disbelief and shock!<br/><br/>“You guys are the experts from the Void Zone?”<br/><br/>Wang Xian sized them up and asked indifferently!<br/><br/>“How is this possible? How is this possible? How can you possess such terrifying strength?”<br/><br/>“No, no, no, that’s not right. This is not your strength. This is the strength you borrowed. There are experts who have left behind terrifying means to save your life! ”<br/><br/>Wu Hongshan from the forbidden space stared at Wang Xian and shouted with a face full of fear!<br/><br/>“Are you the experts from the forbidden space?”<br/><br/>Wang Xian ignored his words and clenched his fist in the air!<br/><br/>A terrifying flame started to burn their bodies!<br/><br/>He asked calmly once again!<br/><br/>“Ahhhh!”<br/><br/>In an instant, an extremely miserable scream came out from their mouths!<br/><br/>“Yes, yes, we are!”<br/><br/>The pain that came from their souls was unbearable to an expert from the Void Zone. He shouted loudly!<br/><br/>They were the experts from the Void Zone. With their strong background, they had never experienced life-and-death battles before.<br/><br/>They had never suffered such a terrifying attack before! “Tell me, why are you here to kill me?”<br/><br/>Wang Xian stared at them and continued to ask coldly!<br/><br/>The terrifying flames on their bodies did not stop!<br/><br/>“We know that you have treasures on you. We want to obtain those treasures.<br/><br/>Quick, let us go. Let us go. Otherwise, our space base will not let you go!”<br/><br/>The powerhouse from the forbidden space shouted loudly with a ferocious and pained expression!<br/><br/>Wang Xian heard their words and smiled coldly. “Is it possible to let you go?”<br/><br/>“If you have the guts, just kill us. Let me tell you, if you offend us, we will not let you off. We will not let you off! ”<br/><br/>Wuhongshan’s entire body was in extreme pain. His face was distorted as he roared at Wang Xian!<br/><br/>“Do you want to die? It’s not that easy!”<br/><br/>Wang Xian mumbled to himself. The Phantom of the Divine Dragon on his body opened its mouth and devoured them!<br/><br/>Following that, the Godly Dragon Phantom turned into a ball and landed in his hand.<br/><br/>“No, no, no, no. Kill Us, Kill Us!”<br/><br/>Wuhongshan’s shrill roar came from within the ball!<br/><br/>Now, he wanted Wang Xian to kill him directly!<br/><br/>Wang Xian smiled and revealed a mocking expression.<br/><br/>There were resurrection treasures in the sword and Magic Universe. It was highly possible that they had such resurrection treasures on them. If they were killed directly, they would be resurrected directly!<br/><br/>Would Wang Xian be so stupid?<br/><br/>In order to specifically deal with this situation, the trump card that Wang Xian left behind could directly trap them within a domain.<br/><br/>It would make them unable to live or Die!<br/><br/>Under such circumstances, they could not be resurrected. They could only maintain this situation!<br/><br/>“The powerhouses from the void forbidden ground are coveting the treasures on me. It should be related to the saint son and the SAINTESS. In their eyes, I can feel their jealousy and greed!”<br/><br/>Wang Xian mumbled as his eyes revealed a hint of coldness!<br/><br/>They dared to come and kill him?<br/><br/>They were really courting death!<br/><br/>“You guys are lucky. I Won’t kill you guys for the time being!”<br/><br/>As Wang Xian spoke, his body moved and he immediately flew toward the upper level of the Demonic Beast Abyss!<br/><br/>He didn’t plan to seek revenge from the Saint Son and the rest, nor did he seek revenge from the Void Forbidden Ground!<br/><br/>Wang Xian’s original body hadn’t been upgraded.<br/><br/>Everything would have to wait until he was upgraded.<br/><br/>At that time, he would have to die!<br/><br/>If the forbidden ground of void could not give Wang Xian a perfect solution, he would have to pay a terrible price.<br/><br/>The forbidden ground of void would also have to pay a terrible price!<br/><br/>Of course, Wang Xian did not dare to boast that he could easily destroy the forbidden ground of void!<br/><br/>After all, there were still two heaven’s origin destinies in the universe of Swords and Magic!<br/><br/>“I’m not going to continue my training. I’ll find a place to cultivate in seclusion first!”<br/><br/>Wang Xian prepared to cultivate in seclusion.<br/><br/>He had already used up the trump cards left behind by his original body. If he continued to stay here, he would be in danger of dying again.<br/><br/>Moreover, if there were more experts from the void forbidden ground coming to hunt him down, he would be doomed.<br/><br/>If he didn’t have any trump cards, he would be doomed!<br/><br/>Although he could resurrect, it wasn’t easy for him to cultivate to this stage. Wang Xian didn’t want his void Dragon Body to die!<br/><br/>He quickly headed to the highest level of the abyss of Demonic Beasts and arrived at the teleportation formation!<br/><br/>He was teleported directly to Tianyuan City!<br/><br/>He still had quite a lot of resources in his hands. Wang Xian rented a place and began his seclusion in a room.<br/><br/>It was still very safe in Tianyuan City..\t\t\t\t\t\t</div>", "images": {}, "success": true}