{"id": 1026, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073952.html", "title": "Chapter 4028 - Chapter 4028: 4027 Was Only 5% Away From A Breakthrough!", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4028 - Chapter 4028: 4027 Was Only 5% Away From A Breakthrough!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4028: 4027 was only 5% away from a breakthrough!<br/><br/>Translator: 549690339<br/><br/>“These resources are enough to upgrade me by one level. It would be a waste to give them to you. Take the resources away immediately and we will leave this place!<br/><br/>Wang Xian ignored Lin Niu’s words and spoke with a burning gaze!<br/><br/>Even if the resources here were not enough for him to upgrade, he was afraid that he would not be able to find out much!<br/><br/>Once Wang Xian was able to achieve a breakthrough, the improvement would be a huge matter to him.<br/><br/>To the Dragon Palace, it was also a huge matter!<br/><br/>At that time, he might be able to have a real fight with the Heaven’s origin creation!<br/><br/>At that time, would he still be afraid of the Phoenix Clan?<br/><br/>Would he still be afraid of the Angel Clan?<br/><br/>At that time, he would just do it!<br/><br/>Furthermore, once Wang Xian’s strength had improved, he might be able to kill the Aga Heavenly Demon God.<br/><br/>At that time, Lin Niu might have a chance to step into the Heaven’s origin creation realm!<br/><br/>At that time, the Dragon Palace would have two existences at the Heaven’s origin creation realm.<br/><br/>It was absolutely terrifying!<br/><br/>“As long as my strength breaks through, I have the confidence to kill the Asgardian demon god. At that time, you can devour the Asgardian Demon God!<br/><br/>Wang Xian regained his excitement. With a move of his body, he flew towards the resources below and quickly kept them into the mother nest!<br/><br/>“What? Boss, can these resources help you to achieve a breakthrough? To the<br/><br/>Heaven’s origin creation stage?”<br/><br/>When Lin Niu heard Wang Xian’s words, he was also stunned. He asked with a face full of shock!<br/><br/>(‘I haven’t reached the Heaven’s origin creation stage yet. However, my strength shouldn’t be much weaker than the Heaven’s origin Creation Stage!”<br/><br/>Wang Xian said with slight confidence!<br/><br/>“Boss, let me help you collect the resources! ”<br/><br/>When Lin Niu heard that, he was instantly excited.<br/><br/>His combat strength was comparable to the Heaven’s origin creation stage.<br/><br/>This? ?<br/><br/>If this boss killed the Asgardian demon god in the future, wouldn’t he have a chance of breaking through to the Heaven’s origin creation stage?<br/><br/>Wouldn’t he be able to reach the heaven in a single step!<br/><br/>The Heaven’s origin creation stage!<br/><br/>This was an eternal existence in the universe, the most terrifying powerhouse!<br/><br/>If he could break through to this realm, he, Lin Niu, would be willing to work hard for his boss!<br/><br/>In the future, he could be said to be an existence above all others!<br/><br/>What did his injuries count for?<br/><br/>At most, he could use a few hundred million years to slowly recover!<br/><br/>What did it count for?<br/><br/>When he thought of this, he became even more excited. He worked hard to help Wang Xian collect all the resources!<br/><br/>Wang Xian didn’t notice the excited expression on Lin Niu’s face.<br/><br/>At this moment, he was also very excited!<br/><br/>This time, it was really a great opportunity!<br/><br/>“Eh? You still have a lot of metal materials here?”<br/><br/>When Wang Xian and the rest arrived at the place where Lin Niu was sleeping, he looked ahead and his eyes were glowing!<br/><br/>“Yes, boss. I know that these metal materials are very precious, but they are useless to demonic beasts like me. Therefore, I used them to decorate my sleeping place! ”<br/><br/>Lin Niu replied immediately!<br/><br/>“Alright, Alright! ”<br/><br/>When Wang Xian saw it, he broke into a smile again!<br/><br/>There were simply too many metal materials in Lin Niu’s place!<br/><br/>Each and every one of them was of a very high level!<br/><br/>It was dozens of times more than the amount of metal materials that he obtained in the eighth level of the abyss of Demonic Beasts!<br/><br/>“This can almost make the Five Elements Millstone and the Tai Chi Dragon<br/><br/>Plate break through once again! ”<br/><br/>“To be able to make it to where I am now!”<br/><br/>His eyes were burning with passion. With a wave of his arm, he kept it away!<br/><br/>“Let’s Go! ”<br/><br/>After collecting all the resources, Wang Xian flew up with Lin Niu. “Do you know the passage to the eighth floor?”<br/><br/>“Boss, I have created a secret passage to the eighth floor. Only I know about this passage! ”<br/><br/>Lin Niu replied immediately, “It’s not far from here! ”<br/><br/>“Alright, I need to go to a safe and secret place to absorb all the resources and see if I can make a breakthrough! ”<br/><br/>Wang Xian spoke to him.<br/><br/>“Boss, it’s best for us to stay far away. I was born from the flesh and blood of the Asgardian demon god. If we don’t stay far away, he might find us and sense<br/><br/>Lin Niu said immediately!<br/><br/>“Alright, in that case, let’s go to a remote place and go to the edge of this universe! ”<br/><br/>Wang Xian nodded his head and had an idea!<br/><br/>He wanted to go to the place where he came to this universe!<br/><br/>He had improved his strength there first.<br/><br/>After the improvement, even if the passageway was exposed, with Wang Xian ‘s strength, he had nothing to worry about!<br/><br/>Lin Niu had no objections. He followed Wang Xian and left quickly!<br/><br/>Lin Niu was very familiar with the abyss of Demonic Beasts. Under his guidance, Wang Xian quickly arrived at the highest level.<br/><br/>Following closely, Wang Xian identified a direction and flew quickly!<br/><br/>He flew very fast. After a year, he arrived at a city and began to teleport!<br/><br/>In the next ten years, Wang Xian continued to teleport.<br/><br/>After arriving at a remote location and borrowing the power of the heaven origin fate fragment, Wang Xian flew for more than ten years before he arrived at the passageway that led to the treasure vault of the Divine Dragon Race in the nine-origin Universe!<br/><br/>“Let’s do it here. You should also heal your injuries at the side! ” Wang Xian released the Linniu from the mother nest and instructed him!<br/><br/>“Yes, Boss!”<br/><br/>The Linniu immediately responded and laid down on the side to heal his injuries!<br/><br/>At this moment, Wang Xian did not hesitate at all. After setting up an energy shield, he immediately transformed into the body of a divine dragon.<br/><br/>A large amount of resources were placed in front of him and he began to devour them.<br/><br/>At the same time, the Tai Chi Dragon Plate and the five elements millstone were also absorbing the metal materials to Improve themselves!<br/><br/>“This? ? Nine attributes? Nine attributes perfectly fused together?”<br/><br/>Lin Niu, who was at the side, suddenly stared at Wang Xian with his eyes wide open. His face was filled with shock.<br/><br/>“Boss is also a magical beast? No, Boss is not a magical beast. He should be a creature from a powerful race! ” Lin Niu mumbled.<br/><br/>He was extremely puzzled!<br/><br/>Wasn’t the sword and magical universe the universe dominated by humans?<br/><br/>However, he didn’t think much about it as he started to recover from his injuries!<br/><br/>Time passed day by day. In the blink of an eye, more than 10,000 years had passed!<br/><br/>“HMM? I’m still a little bit away! ”<br/><br/>On this day, Wang Xian opened his eyes. His mind moved as he looked at his attributes!<br/><br/>Name: Wang Xian<br/><br/>Race: Nine-origin Divine Dragon (man-dragon unity)<br/><br/>Level: level six of the universe’s ruler (nine transformations unity)<br/><br/>Origin: 95% (5% needed to reach the next breakthrough)<br/><br/>Ability: governs the water race (governs the water race below its own level)<br/><br/>Devours living beings (devours living beings to extract origin)<br/><br/>Control of the five elements<br/><br/>Technique: Divine Dragon Transformation<br/><br/>Ability: soul capture, spirit attachment<br/><br/>Law Ability: Dragon Eye Lock, Five Elements Dragon Claw, Yin-yang breakthrough, eight luminaries Dragon Scale, Sacred Dragon Shadow,<br/><br/>Heavenly Dragon Eight Tribes, Dragon Tomb, Cloud Dragon Soaring, True Dragon body<br/><br/>Laws and Abhijnas: eight Dragon Pillars, eight dragon clones, towering dragon horns, Mighty Heavenly Dragon, God’s tail playing with beads, Life Dragon Breath, Shadow Dragon Clone, Netherdragon pursuit, Netherdragon transformation, wind and Thunder Dragon Birth, Mad Dragon Star Explosion!<br/><br/>Domain: nine origin Dragon Domain<br/><br/>Control laws: metal, wood, water, fire, Earth, light, dark wind and thunder<br/><br/>God Country: Dragon Palace<br/><br/>Dragon Palace: Innate. Dragon Palace members: 8060450 (‘I’m only missing 5% ! ”<br/><br/>All the resources had been consumed.<br/><br/>Wang Xian looked at the remaining 5% and was slightly disappointed!\t\t\t\t\t\t</div>", "images": {}, "success": true}