{"id": 1025, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073950.html", "title": "Chapter 4027 - Chapter 4027: 4026 Vast Resources, The Hope Of A Breakthrough!", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4027 - Chapter 4027: 4026 Vast Resources, The Hope Of A Breakthrough!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4027: 4026 vast resources, the hope of a breakthrough!<br/><br/>Translator: 549690339<br/><br/>“Alright, Alright. Since you are willing to submit, you should consume this blood essence without any resistance! ”<br/><br/>“Besides, if you submit to me, I will definitely not mistreat you in the future. In the future, there might be a chance for him to step into the Heaven’s origin Creation Stage!”<br/><br/>When Wang Xian saw Lin Niu submit to him directly, a hint of excitement appeared on his face!<br/><br/>He had witnessed Lin Niu’s strength with his own eyes!<br/><br/>This was a super powerhouse who could be on par with him!<br/><br/>His strength was definitely close to the Heaven’s origin creation stage!<br/><br/>He could even see the path of his own breakthrough!<br/><br/>For the Dragon Palace, it was a huge battle strength to have such a demonic beast as their subordinate.<br/><br/>After all, it was a demonic beast that was born from the blood-stained limbs of the Heaven’s origin creation after a long period of time!<br/><br/>“Let’s go to your territory first! ”<br/><br/>Wang Xian’s eyes sparkled as he looked ahead. That was the territory of the Linniu!<br/><br/>“It’s the Boss! ”<br/><br/>The Linniu swallowed the blood essence given to him by Wang Xian and a surge of will surged into his mind.<br/><br/>He knew that he was completely under control!<br/><br/>Hence, he greeted him respectfully!<br/><br/>As for calling him master, he was somewhat unable to do so.<br/><br/>After all, his own strength was extremely terrifying.<br/><br/>One of the reasons why he was willing to submit to Wang Xian was also because of Wang Xian’s strength, which shocked him!<br/><br/>He knew that his boss’s strength was not weaker than his own at his peak!<br/><br/>“Boss, we have to take all the resources and treasures away and leave this place immediately. Once the Asgardian demon god recovers, he might chase after US immediately. ”<br/><br/>“His strength is extremely terrifying, especially the shadow of the Asgardian demon god. I had to use all my strength to escape! ”<br/><br/>Linniu reminded Wang Xian!<br/><br/>“I know!”<br/><br/>Wang Xian nodded.<br/><br/>Naturally, he knew how terrifying the Asgardian demon god was!<br/><br/>“Eh? What a terrifying energy! ”<br/><br/>At this moment, Wang Xian suddenly sensed the majestic energy in front of him. A look of shock appeared on his face!<br/><br/>“Boss, that is my lair. ”<br/><br/>Lin Niu said.<br/><br/>“Your lair actually contains such a majestic energy. Do you have many treasures here?”<br/><br/>Wang Xian widened his eyes and could not help but ask.<br/><br/>think so.<br/><br/>Lin Niu nodded his head. “The birth of the abyss of demonic beasts has not<br/><br/>only stained the blood of the Agar Heavenly Demon God, but it has also stained the limbs of the Agar Heavenly Demon God as well as the blood of the other Heaven’s origin powerhouses. It’s just that the limbs of the other Heaven’s origin powerhouses did not fall here! ”<br/><br/>“Other than the blood of the Heaven’s fate powerhouses, there are also the blood of countless other powerhouses. I don’t know exactly how intense the battle here is during the calamity. However, there are many powerful existences and mad demons that have died! ”<br/><br/>“This has also resulted in a lot of energy and treasures here. Among the four limbs of the Asgard Celestial Demon God, three of them gave birth to me, the rotten bird, and the Demon Hunter King. The last limb gave birth to a large number of demonic beasts as well as some resources and treasures! ”<br/><br/>Wang Xian nodded his head slightly when he heard that. He looked at the<br/><br/>Unicorn Ox in surprise and said, “You know a lot! ”<br/><br/>“1 learned it from some blurry image fragments!”<br/><br/>The Unicorn ox answered truthfully!<br/><br/>“There are so many resources here. Why didn’t the sword and Magic Universe’s Heaven’s origin creation destroy this place and take away the treasures here?”<br/><br/>Wang Xian continued to ask him.<br/><br/>“There is only one possibility. The two Heaven’s origin creation powerhouses from the sword and magic universe were injured and were seriously injured.<br/><br/>They are in a deep sleep and may not have woken up yet. Once their injuries have fully recovered, they will probably clean this place up.”<br/><br/>“However, if they were a little later, the Aga Heavenly Demon God will be reborn into his second life. When that time comes, it will be a terrifying disaster for the sword and Magic Universe!”<br/><br/>“A battle at the level of the Heaven’s origin creation would be earth-shattering. To completely kill a heaven’s origin creation, Pm afraid we would need more Heaven’s origin creation to work together. ” Lin Niu replied!<br/><br/>“Is he heavily injured and in a deep sleep? That’s possible! ”<br/><br/>Wang Xian nodded his head.<br/><br/>The death of the Asgard Heavenly Demon God was definitely related to the battle between the sword and the Magic Universe!<br/><br/>To be able to cause a heavenly yuan creator to completely leave his limbs here, his injuries back then were definitely extremely terrifying.<br/><br/>If not, with such an expert…<br/><br/>Not to mention losing his limbs, even if his head was missing, he would be able to recover immediately!<br/><br/>One could imagine how that battle had injured Asgard’s origin.<br/><br/>The limbs that had fallen here were also origin limbs!<br/><br/>“The energy here is too terrifying. Let me see how many resources you have! ”<br/><br/>At this moment, Wang Xian had completely arrived above the territory of the<br/><br/>Lin Niu.<br/><br/>He was attracted by the vast energy around him and interrupted his thoughts! He stared at the ground with a burning gaze and immediately flew over! (‘I have set up a restriction here. Boss, I will open it now! ”<br/><br/>A Ray of light shot out from the Unicorn’s horn. When the light landed on the ground, the defense of the restriction disappeared!<br/><br/>To be able to cultivate to such a level, and to be born from the flesh and blood of the Heaven’s origin.<br/><br/>One’s strength and understanding of combat techniques and abilities were extremely numerous and terrifying!<br/><br/>When this layer of restriction disappeared, an even more terrifying energy gushed over!<br/><br/>Wang Xian looked down and revealed a shocked expression!<br/><br/>A huge sea of flesh and blood!<br/><br/>A bunch of special flowers were blood-red like flesh and blood!<br/><br/>However, there was no bloody smell of flesh and blood. Instead, it was filled with a sense of beauty!<br/><br/>There was a majestic energy contained in it.<br/><br/>“This is the blood flower that accompanied me. I have absorbed a portion of it and nurtured another portion of it myself. This is the biggest resource in my domain. ”<br/><br/>Lin Niu looked over and revealed a proud expression. “As long as I devour a large amount of blood flowers, my injuries will be able to recover quickly! ” “You want to use it to recover from your injuries? It’s too wasteful. ”<br/><br/>Wang Xian immediately said when he heard that!<br/><br/>Yes, it was too wasteful!<br/><br/>The resources and treasures here were too huge!<br/><br/>Wang Xian had a feeling that as long as he absorbed all the resources here, even if he couldn’t make a breakthrough, he would only need a little bit more, a little bit more resources!<br/><br/>As long as he made a breakthrough, his strength would be even more terrifying!<br/><br/>He might even be able to clash with the Real Heaven’s origin!<br/><br/>At the thought of this, Wang Xian was extremely excited!<br/><br/>He initially thought that he would need too many resources if he wanted to make a breakthrough!<br/><br/>He didn’t expect that this Lin Niu was a treasure trove.<br/><br/>Not only was his strength terrifying, but he was also given so many resources?<br/><br/>This fellow was simply his Lucky Star!<br/><br/>“Boss, if I don’t use these blood flowers to heal my injuries, I will need at least a few hundred million years to slowly heal myself! ”<br/><br/>When Lin Niu heard Wang Xian’s words, his single eye was wide open!<br/><br/>The reason why he asked Wang Xian to come here was for these resources to quickly heal his injuries.<br/><br/>In the end, he said that it was a waste to heal his injuries!<br/><br/>This boss of his, wasn’t he a little too dark?\t\t\t\t\t\t</div>", "images": {}, "success": true}