{"id": 1022, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073944.html", "title": "Chapter 4024 - Chapter 4024: 4023 Heavenly Yuan Creation, Asgard Heavenly Demon God!", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4024 - Chapter 4024: 4023 Heavenly Yuan Creation, Asgard Heavenly Demon God!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4024: 4023 heavenly Yuan creation, Asgard Heavenly Demon God!<br/><br/>Translator: 549690339<br/><br/>“Roar Roar Roar! ”<br/><br/>“Boom Boom Boom! ”<br/><br/>The sounds of battle rang out continuously.<br/><br/>The attack power of the three demonic beasts was abnormally terrifying!<br/><br/>The three of them were fighting on their own. When they attacked one demonic beast, the next second, the other two might explode!<br/><br/>In fact, their attacks were indiscriminately all-rounded attacks, and their opponents were all enveloped within!<br/><br/>“Lin Niu, Rotten Bird, I advise you to return to my body. I will lead you to the Great Dao of Heavenly Yuan creation! ”<br/><br/>In front of them, the Demon Hunter King roared with a face full of killing intent. His body trembled.<br/><br/>Behind him, terrifying sharp thorns attacked the two demonic beasts, Lin Niu and rotten bird!<br/><br/>His Bone Thorn’s attack was extremely terrifying. Wherever it passed, cracks would appear in the void!<br/><br/>The terrifying energy carried the surrounding energy and formed a terrifying dark spear.<br/><br/>This dark spear seemed to fly out of the terrifying Abyss and attacked the other two magical beasts!<br/><br/>As for the other two magical beasts.<br/><br/>The Unicorn and one-eyed unicorn ox was covered in blood-red scales. These scales were shining with a luster.<br/><br/>There were symbols on them. These symbols were like musical symbols.<br/><br/>They kept flying out of his scales.<br/><br/>The moment they flew out, these symbols turned into mountains, swords, giant beasts, and all sorts of other things.<br/><br/>They contained terrifying offensive power!<br/><br/>The bird-like rotten bird flapped its wings slightly, and the entire starry sky fell with a terrifying rain of corrosion.<br/><br/>The instant this rain of corrosion fell, it formed a special space between heaven and earth!<br/><br/>The entire sky seemed to have become his domain.<br/><br/>A terrifying domain!<br/><br/>“The strength of these demonic beasts is definitely not inferior to mine!” Wang Xian looked at their battle with a look of shock in his eyes!<br/><br/>These three demonic beasts were obviously formed from the four limbs of an elite in the Heaven’s origin realm.<br/><br/>Having cultivated to this stage, they had even gained intelligence!<br/><br/>However, Wang Xian did not understand why they would fight.<br/><br/>By devouring the other party, they could become an existence at the Heaven’s origin realm?<br/><br/>He was astonished.<br/><br/>From a distance, he stared at them quietly!<br/><br/>In the surrounding area, all the demonic beasts that were above level eight were also looking at them in awe.<br/><br/>The suppression from the bloodlines of the three demonic beasts made them afraid to move!<br/><br/>The battle continued!<br/><br/>Time passed day by day!<br/><br/>When Wang Xian saw this scene, his eyes sparkled.<br/><br/>“Hahaha, you’ve been fighting with us for half a year. It’s about time. It’s almost time for you to die! ”<br/><br/>Five months later, the demon hunter King suddenly became violent in front of them.<br/><br/>Terrifying bone spikes suddenly appeared on his back!<br/><br/>Each of the blood-red bone spikes was thousands of meters long.<br/><br/>Most importantly, his bone spikes were thick and sharp, glowing with light!<br/><br/>This demon hunter King went berserk!<br/><br/>His strength was clearly the strongest among the three demonic beasts.<br/><br/>And now, he was the first to go berserk!<br/><br/>“Roar Roar, Demon Hunter King, do you think we’re afraid of You? Lin Niu, let’s cripple his claws first! ”<br/><br/>The rotten bird saw the demon hunter king go berserk and his cold eyes were filled with blood as he roared loudly!<br/><br/>He roared and went berserk as well.<br/><br/>Waves of dark power surged out from his body.<br/><br/>This dark power condensed into a liquid and the black liquid revolved around him!<br/><br/>“Both of you will die if you devour my children! ”<br/><br/>The horns on the head of the unicorn ox shone with a luster, and it also went berserk!<br/><br/>Its body began to grow larger, and the light on its scales became even more blood -red.<br/><br/>A single scale was like a terrifying weapon!<br/><br/>It was like a terrifying weapon of war!<br/><br/>There was clearly a deep blood feud between the three of them.<br/><br/>They didn’t join forces to fight the other one at all!<br/><br/>The three demonic beasts went berserk at the same time.<br/><br/>An even more terrifying battle erupted!<br/><br/>Wang Xian was not far away. He watched the battle escalate and watched quietly.<br/><br/>This was the real battle.<br/><br/>A battle that was close to the Heaven’s origin level.<br/><br/>Even if an expert who was at the peak of the universe’s ruler stepped into it, he would be crushed and exploded by their violent energy!<br/><br/>Too strong!<br/><br/>Simply too strong!<br/><br/>Wang Xian was also slightly surprised.<br/><br/>If these three demonic beasts were to surround and attack him, they would probably be able to kill him completely!<br/><br/>The battle continued.<br/><br/>More than ten days passed.<br/><br/>The three demonic beasts were completely bloodthirsty and their aura didn ‘t decrease!<br/><br/>Their violent state was enough for them to last for a long time!<br/><br/>“Roar, you two stupid things. You are just a piece of flesh that fell from my body. Today, I will take it back completely. Die! ”<br/><br/>“Today, I will show you the majesty of the Mad Demon, the shadow of the sky demon agar. ”<br/><br/>Half a month later, the demon hunter King suddenly let out a wild roar.<br/><br/>The voice in his mouth changed!<br/><br/>The next moment, he suddenly spread out his arms!<br/><br/>An extremely terrifying shadow of the Demon God appeared behind him.<br/><br/>This shadow of the Demon God was similar to the Demon Hunter Beast, but it looked dozens of times more ferocious!<br/><br/>The terrifying shadow was exuding an incomparably terrifying aura.<br/><br/>When Wang Xian felt this aura, his expression changed drastically!<br/><br/>“This aura is many times stronger than the one unleashed by the Demon Hunter King Just Now! ”<br/><br/>Wang Xian’s eyes narrowed and a shocked expression appeared on his face. “Has he touched upon the realm of the Heaven’s origin creation?”<br/><br/>He was extremely shocked. After hesitating for a moment, he took a few steps back!<br/><br/>The sudden eruption of the demon hunter King’s terrifying strength could crush him directly!<br/><br/>“Damn it, Demon Hunter King, no, you’re Not Demon Hunter King, you’ve been invaded, you’ve been invaded! ”<br/><br/>When the rotten bird saw the demon hunter King’s sudden burst of power and the terrifying shadow of the demon god, its expression changed drastically as it roared in fear!<br/><br/>“How is this possible? Agar Heavenly Demon God? Agar Heavenly Demon God is in the Mad Demon Universe, how can he be here? Demon Hunter King, stop playing tricks! ”<br/><br/>Lin Niu’s gaze also focused as he roared with a face full of shock and anger!<br/><br/>“You two fellows, I gave birth to you with my flesh and blood. You Don’t know how to repay me with gratitude, so I can only crush you and completely devour you!<br/><br/>At this moment, Demon Hunter King was abnormally terrifying.<br/><br/>His aura was completely different from before!<br/><br/>Just now, his body contained the metal and darkness attributes, but now, there was an additional Earth attribute!<br/><br/>The energy that was mixed together was abnormally violent.<br/><br/>In addition to its special body, the demonic God shadow behind it was much stronger and more powerful than before!<br/><br/>“Shadow enveloping, demonic god Embrace!”<br/><br/>The Demon Hunter King Roared, and the demonic god shadow behind it spread its arms and directly enveloped the two demonic beasts, the rotten bird and the Qilin ox!<br/><br/>When the demon god Shadow spread its arms, it seemed to embrace the entire world!\t\t\t\t\t\t</div>", "images": {}, "success": true}