{"id": 1021, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073942.html", "title": "Chapter 4023 - Chapter 4023: Under The Blood-Stained Magical Beasts Of 4022 Heavenly Elements", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4023 - Chapter 4023: Under The Blood-Stained Magical Beasts Of 4022 Heavenly Elements</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4023: Under the blood-stained magical beasts of 4022 heavenly elements<br/><br/>Translator: 549690339<br/><br/>Wang Xian followed the aura of some magical beasts and flew forward.<br/><br/>He was curious about the reason why these magical beasts gave up the treasures in their lair and left.<br/><br/>Was it because they had more powerful treasures?<br/><br/>Or was it because of the swordsmen and the Masters of the universe of magic.<br/><br/>However, according to his understanding, the swordsmen and masters of the universe of magic should not have come to the deep level of the abyss of Magical Beasts!<br/><br/>Then the first possibility was very high!<br/><br/>After all, to be able to attract a race of Demon Beasts at the pinnacle of the ruler realm was definitely not simple!<br/><br/>He flew straight ahead.<br/><br/>After flying for a few hours, he had already flown out of this area of lava.<br/><br/>After flying for a few more minutes, he stopped and looked ahead in astonishment.<br/><br/>Standing here, he could sense the auras left behind by many powerful demonic beasts.<br/><br/>With this number, there were definitely more than ten demonic beasts who were at the peak of the Dominator realm!<br/><br/>Wang Xian’s gaze landed on the entrance of the cave in front.<br/><br/>That was the passageway leading to the ninth level of the abyss of Demonic Beasts.<br/><br/>It was also the only passageway leading to the ninth level that Wang Xian encountered when he arrived at the eighth level!<br/><br/>The eighth level of the abyss of Magical Beasts was different from the upper levels.<br/><br/>The upper levels and the lower levels had many entrances which were easy to find.<br/><br/>This eighth level was the only one that Wang Xian encountered!<br/><br/>There were many auras left behind by powerful magical beasts around the entrance of the cave!<br/><br/>Wang Xian flew over and approached the entrance. He scanned the area and finally landed at the entrance of the cave.<br/><br/>The cave was 10,000 meters wide and he couldn’t see what was happening inside!<br/><br/>Wang Xian got closer and stared into the cave. After a moment of hesitation, he<br/><br/>flew straight into the cave.<br/><br/>Below him was the ninth level of the abyss of Magical Beasts.<br/><br/>It was also the last level of the abyss of Magical Beasts.<br/><br/>At the eighth level, there were magical beasts that were at the peak of the ruler realm.<br/><br/>Then, what kind of existence was at the deepest level?<br/><br/>The news and rumors from the Holy Grounds and the Sacred Academy were that there were magical beasts that were born from the core energy of the four limbs of the Heaven’s origin.<br/><br/>It was a demonic beast that was comparable to the peak of the ruler of the universe in terms of spatial attributes.<br/><br/>Although this was just a guess, the possibility was very high.<br/><br/>However, no one knew the exact truth!<br/><br/>Wang Xian flew straight to the last level.<br/><br/>He was very fast. After more than ten minutes, he arrived at the lowest level!<br/><br/>Boom! Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>“Roar! I want to eat all of you. Give up on resisting! ”<br/><br/>When Wang Xian had just arrived at the ninth level of the abyss of Demonic Beasts, a terrifying and vast energy was transmitted over! Following that, an incomparably brutal roar was heard!<br/><br/>“Eh? What is this?”<br/><br/>When Wang Xian sensed the terrifying battle coming from afar as well as the violent roar, a look of shock appeared on his face. He looked over and his eyes were filled with shock!<br/><br/>The power in front of him shook the sky.<br/><br/>The terrifying collision of energy caused even Wang Xian to feel a little shaken!<br/><br/>His eyes focused and his expression changed slightly!<br/><br/>“What’s going on? Why is the aftermath of the battle ahead so terrifying? Even if I used the fragment of the Heaven’s origin creation, it shouldn’t be much,<br/><br/>Wang Xian mumbled. He stared ahead and moved his arm!<br/><br/>The Book of water curse appeared in his hand.<br/><br/>A wave of water energy wrapped around him. Wang Xian moved and flew forward!<br/><br/>“A top-notch expert in the sword and Magic Universe?”<br/><br/>He thought to himself with a vigilant expression.<br/><br/>The fragment of the Heaven’s origin creation treasure concealed itself to ensure that he wouldn’t be discovered!<br/><br/>As he slowly approached, Wang Xian could vaguely see the scene in front of him.<br/><br/>When he saw this huge battle, his face was filled with shock!<br/><br/>The people fighting in front of him were not experts from the sword and Magic Universe, but three demonic beasts!<br/><br/>That’s right, there were three demonic beasts!<br/><br/>Each demonic beast was about 10 ,ooo meters in size.<br/><br/>Their bodies were filled with violent and terrifying energy!<br/><br/>The energy contained in each of them was much stronger than those demonic beasts at the peak of the Dominator realm!<br/><br/>One of them was in the form of a bird, and it had a pair of blood-red wings. On its wings grew black wriggling flesh and blood!<br/><br/>This flesh and blood looked extremely vicious and terrifying!<br/><br/>The second demonic beast looked like a one-horned, one-eyed bull.<br/><br/>Blood-red scales grew on its body, and every single one of its scales shone with a luster!<br/><br/>Every scale seemed to be able to unleash a terrifying attack.<br/><br/>The Third Magical Beast was a Hunter Magical Beast!<br/><br/>The three magical beasts were currently engaged in a chaotic battle, engaging in battle and Slaughter!<br/><br/>However, that Hunter magical beast seemed to be the strongest among them.<br/><br/>It was slightly stronger than the other two!<br/><br/>The words just now clearly came from this hunter magical beast.<br/><br/>There were over a thousand demon beasts gathered around the battle between the three demon beasts.<br/><br/>These demon beasts were all existences above level eight of the Masters of the universe.<br/><br/>They prostrated themselves around and watched the battle fearfully!<br/><br/>“What’s going on? A battle between Demon Beasts? Also, the three demon beasts that were fighting in the middle seem to possess intelligence! ”<br/><br/>Wang Xian looked at them in shock.<br/><br/>Demonic Beasts did not possess intelligence. They only had powerful instincts. This was universally acknowledged in the sword and Magic Universe.<br/><br/>Even if they could tame them, they were still demonic beasts.<br/><br/>They did not possess powerful intelligence!<br/><br/>The three demonic beasts in front of them clearly possessed extremely high intelligence!<br/><br/>They could even speak human language!<br/><br/>With such intelligence, why were they still fighting?<br/><br/>And from the looks of it, they had been fighting for a long time!<br/><br/>“Demon Hunter King, you want to devour me? Dream On! Today, I will devour all of you and form the Grand Dao of Tian Yuan!”<br/><br/>The demonic beast with the huge blood-red wings roared furiously!<br/><br/>“Impudent! All of you are my flesh and blood. I will let you return to my body, yet you still dare to resist. Die!”<br/><br/>The Terrifying Demon Hunter King roared with a face full of killing intent.<br/><br/>His entire body was like a terrifying world-destroying monster, and his entire body was filled with sharp spikes.<br/><br/>He waved his arm and slashed out!<br/><br/>The bird beast hurriedly dodged!<br/><br/>“Roar Roar, we all have our own consciousness. You Want to eat me? Dream<br/><br/>The one-horned, one-eyed Demon Beast roared furiously, its two horns stepping on the void.<br/><br/>Boom! Boom! Boom<br/><br/>The entire void started to tremble and explode!<br/><br/>Streams of energy shot towards the other two demonic beasts!<br/><br/>Boom! Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>Explosions and confrontations were happening all the time!<br/><br/>Wang Xian was filled with surprise when he heard their words.<br/><br/>“Why did the Hunter Demonic Beast King say that they were his flesh and blood?”<br/><br/>“Devouring the other party can achieve the Great Dao of Heaven’s fate?”<br/><br/>“What is this situation? What is the situation with these three demon beasts?”<br/><br/>As he spoke, he was guessing in his heart. He was extremely shocked!<br/><br/>He seemed to have discovered something terrifying..\t\t\t\t\t\t</div>", "images": {}, "success": true}