{"id": 1039, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073978.html", "title": "Chapter 4041 - Chapter 4041: 4040 To Exterminate All Of You!", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4041 - Chapter 4041: 4040 To Exterminate All Of You!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4041: 4040 to exterminate all of you!<br/><br/>Translator: 549690339<br/><br/>More than 10,000 figures flew towards Wang Xian.<br/><br/>The power of the sword aura!<br/><br/>The sharp sword rays!<br/><br/>All the strong disciples from the forbidden grounds and the Saint Academy had a different look on their faces!<br/><br/>“This? ? This Is? There are so many strong masters in the ruler realm. The weakest one is at the level five ruler realm. Look at the energy in their bodies. I can feel that their combat strength is extremely terrifying! ”<br/><br/>“What a terrifying sword ray. What kind of sword technique is this? Each of them feels like an incomparably sharp sword! ”<br/><br/>“Hiss? What’s going on? What’s going on? Dragon King? Why did the tens of thousands of masters who suddenly flew out call the Saint Wang Xian the Dragon King? King?”<br/><br/>“This group of Masters are the Masters of the Void Dragon Holy Land. The one at the front is the saint son of the Void Dragon Forbidden Land. Their auras are so strong and their auras are so fierce. Why did he call Wang Xian the Dragon King?”? “What is their relationship with the Holy Son?”<br/><br/>“This holy son Wang Xian is extremely mysterious. This void Dragon Forbidden Land is also very mysterious. All this while, no force has been able to find out their background. They really have a great relationship. Void<br/><br/>Dragon Forbidden Land. Is this a confrontation with the Space Forbidden<br/><br/>“The holy son Wang Xian said that his background is himself?”<br/><br/>In the surrounding area, everyone saw ao Jian and the rest of the powerhouses who flew over suddenly.<br/><br/>They were shocked!<br/><br/>The Void Dragon Forbidden Ground was a mysterious forbidden ground that appeared suddenly hundreds of millions of years ago!<br/><br/>It directly occupied the Void Moon Forbidden Ground’s territory!<br/><br/>At that time, the Void Dragon Forbidden Ground did not attract the attention of the powerful forbidden grounds and Saint Academy!<br/><br/>However, the ranking of the Heaven’s favorites at that time, the sage of the Void Dragon Forbidden Ground, came out like a dark horse. The Void Dragon Forbidden Ground entered everyone’s sight!<br/><br/>This void Dragon Forbidden Ground made all the forces and powerhouses feel that it was somewhat mysterious.<br/><br/>That was because no one had found out their confidence.<br/><br/>Where did they come from!<br/><br/>And how strong were they!<br/><br/>The holy son Wang Xian was also extremely mysterious.<br/><br/>He had even checked Wang Xian’s information in the unfettered forbidden ground and flowing water forbidden ground, but he didn ‘t find anything.<br/><br/>This Wang Xian seemed to have appeared out of thin air!<br/><br/>He was as mysterious as the Void Dragon Forbidden Ground!<br/><br/>Now, this group of experts of the Void Dragon Holy Son, a group of experts with sword qi soaring into the sky, actually addressed Wang Xian as the Dragon King!<br/><br/>Everyone could recognize this title!<br/><br/>It was not simple!<br/><br/>“Hehe, Void Dragon Forbidden Ground, are you trying to provoke the forbidden space on your own initiative? If you guys want to seek your own destruction, don’t blame us for not intervening! ”<br/><br/>The first elder of flowing water forbidden ground swept his gaze across Ao Jian and the others, but his expression did not change at all!<br/><br/>Although the strength displayed by Void Dragon forbidden ground was very strong, and there were many experts above level five universe Dominators, the strongest one was only at level eight universe Dominators.<br/><br/>He did not take this strength to heart at all.<br/><br/>Even if void Dragon Forbidden Ground had experts at the peak of universe Dominators, so what?<br/><br/>This Wang Xian dared to say that there was a problem just now?<br/><br/>They had already decided on the flowing water forbidden land, yet he dared to say that there was a problem.<br/><br/>He was simply courting death!<br/><br/>Therefore, he did not intend to interfere in the void Dragon Forbidden Land and the space forbidden land.<br/><br/>The strength of the space forbidden land was extremely terrifying!<br/><br/>An expert at the peak of the Universe Dominator realm.<br/><br/>The strength of the Master of the space forbidden ground was also the strongest person below the Heaven’s origin realm!<br/><br/>With such strength, this saint son Wang Xian from Void Dragon Forbidden Ground actually dared to provoke him?<br/><br/>He was simply courting death!<br/><br/>(‘I will let you guys give me an explanation for what happened here later! ”<br/><br/>When Wang Xian heard the words of the first elder of flowing water forbidden ground, he spoke coldly!<br/><br/>“Hiss, this sage Wang Xian?”<br/><br/>(‘D * mn, is he talking to the first elder of the Flowing Water Forbidden Ground?”<br/><br/>“This sage Wang Xian, isn’t he too arrogant? How dare he say such words to the first elder of the flowing water forbidden ground? Is He… is he courting death?’,<br/><br/>When everyone in the surroundings heard Wang Xian’s words, their faces were filled with astonishment.<br/><br/>“Hahaha, you don’t know what’s good for you! ”<br/><br/>“Is this your background? It’s just a small void dragon forbidden ground. How dare these powerhouses provoke our space forbidden ground? Very well, I’ll kill all of you today. I’ll let you know the consequences of offending our Space Forbidden Ground! ”<br/><br/>The leader of the Space Forbidden Ground, a level nine master of the universe, laughed maniacally.<br/><br/>As he spoke, a terrifying spatial domain expanded into the surroundings.<br/><br/>In an instant, Wang Xian and the rest were surrounded!<br/><br/>Terrifying cracks were formed in the surroundings of this space.<br/><br/>Once he launched an attack, everyone in this space would be subjected to a terrifying attack!<br/><br/>They would be subjected to an attack that was comparable to a master at the peak level!<br/><br/>Brother Wang Xian! ”<br/><br/>At the side of Wang Xian, Long Yin Long Yinhao’s expression changed drastically when he saw this scene. His face was filled with worry.<br/><br/>In the surrounding area, the eyes of all the powerful disciples from the forbidden grounds and the Saint Academy flickered slightly when they saw this scene.<br/><br/>The background of this sage Wang Xian was from this void Dragon Forbidden Ground?<br/><br/>It was him?<br/><br/>If that was the case, wouldn’t he be courting death?<br/><br/>When Wang Xian heard the cries of the Dragons, he turned his head with a smile on his face and smiled at them.<br/><br/>He indicated that they didn’t need to worry!<br/><br/>“Hehe, that’s right. This is my background. My background is myself!”<br/><br/>At this moment, a figure riding a one-horned, one-eyed, ox-like demonic beast appeared out of thin air at the side!<br/><br/>The figure sat on the demonic beast with a faint smile on his face!<br/><br/>Wang Xian’s real body had arrived!<br/><br/>“Eh? How did he appear?”<br/><br/>“This? Who is he? Why does he look exactly like the sage Wang Xian?”<br/><br/>“This person?”<br/><br/>Wang Xian appeared out of thin air without the slightest fluctuation.<br/><br/>His sudden words caused all the powerful disciples around to look over. Their pupils constricted slightly and their faces were filled with shock. His appearance was exactly the same as that of the holy son Wang Xian!<br/><br/>Who was he?<br/><br/>What was going on?<br/><br/>In the flowing water forbidden ground, Granny Yuan’s expression changed slightly when she saw Wang Xian appearing out of thin air.<br/><br/>At this moment, Wang Xian was only a few thousand meters away from them.<br/><br/>This distance was too close for them.<br/><br/>However, at such a close distance, they didn’t even see how Wang Xian appeared.<br/><br/>This made him extremely shocked!<br/><br/>He could not sense Wang Xian’s strength under his energy sensing ability.<br/><br/>Even his demonic beast mount could not sense Wang Xian’s strength!<br/><br/>Long yinyin looked at Wang Xian beside her and then looked at the other Wang Xian. Her mouth was slightly agape and her face was filled with astonishment!<br/><br/>She could not differentiate between the two!<br/><br/>“Since the forbidden space won’t give me a satisfactory answer, I can only make a result that I’m satisfied with! ”<br/><br/>Wang Xian looked at the group of experts in the forbidden space.<br/><br/>“I’ll destroy all of You! ”<br/><br/>At the end, he spat out five words slowly!\t\t\t\t\t\t</div>", "images": {}, "success": true}