{"id": 1033, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073966.html", "title": "Chapter 4035 - Chapter 4035: 4034 Flowing Moon Saintess", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4035 - Chapter 4035: 4034 Flowing Moon Saintess</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4035: 4034 flowing moon Saintess<br/><br/>Translator: 549690339<br/><br/>“Hehe, I believe in brother Wang Xian. In the future, brother Wang Xian will definitely be the top existence in our sword and Magic Universe! ”<br/><br/>Long Yinhao said with a smile on his face!<br/><br/>“Oh right, yinhao, does Saintess flowing moon know that you have fallen? Yinhao, do you know the specific reason for your death?”<br/><br/>Long Yinyin asked him!<br/><br/>“Liuyue already knows. She said that she would rush over. As for the specific reason for my death, I only have a rough guess. ”<br/><br/>When Long Yinhao heard this, the smile on his face disappeared as he spoke!<br/><br/>“What reason? Is it because of Saintess Liuyue?”<br/><br/>Wang Xian asked directly!<br/><br/>Long Yinhao was silent for a moment before he nodded slightly. “It should be.<br/><br/>It should be the flowing water hailian of the Flowing Water Forbidden Ground! ”<br/><br/>“Flowing water connection? The grandson of the current owner of the flowing water forbidden ground, flowing water connection?”<br/><br/>Long Yinhao’s expression changed slightly when he heard that and asked.<br/><br/>Long Yinhao nodded his head slightly!<br/><br/>Wang Xian raised his eyebrows slightly when he heard that!<br/><br/>It was related to the grandson of the flowing water forbidden ground?<br/><br/>As for the reason behind it, they could guess it without long Yinhao’s explanation.<br/><br/>It was nothing more than jealousy.<br/><br/>It was nothing more than the fact that he was together with Saintess Liuyue, which made some people jealous!<br/><br/>It even involved the grandson of the Master of the Liushui Forbidden Land!<br/><br/>No wonder the experts of the dragon roar forbidden land couldn’t do anything about it!<br/><br/>“I didn’t tell Liuyue, sister, and you shouldn’t tell her when the time comes!”<br/><br/>Long Yinhao reminded long yinyin!<br/><br/>km-IOW!<br/><br/>Long yinyin frowned and nodded her head!<br/><br/>Her face was also filled with helplessness!<br/><br/>Wang Xian didn’t say too much. After chatting with long Yinhao for a while, they left!<br/><br/>Long yinyin’s family members were also feeling a little heavy-hearted.<br/><br/>They greeted Wang Xian briefly.<br/><br/>“We’ll wait for more than a month. I’ll take care of Yinhao’s matter.<br/><br/>Coincidentally, Pll take care of the previous matters as well. ”<br/><br/>Wang Xian and long yinyin came to the waterfall of the Heaven Peak and spoke to him!<br/><br/>“Eh? Brother Wang Xian, how… how are you going to take care of it? What were your previous matters?”<br/><br/>Long Yinyin looked at Wang Xian in astonishment and asked.<br/><br/>“The reason why I chose to seclude myself in seclusion for the past few hundred million years is because I was attacked in the abyss of Demonic<br/><br/>Beasts. I have already caught the attacker who was not enough. However, the subsequent matters have yet to be resolved!”<br/><br/>Wang Xian did not hide anything and spoke directly!<br/><br/>Long Yin heard him and looked at him nervously.<br/><br/>“Just wait. Wait for more than a month. After more than a month, you will understand!”<br/><br/>Wang Xian stroked her head and did not tell her anything else.<br/><br/>More than a month later.<br/><br/>Wang Xian would do whoever he disliked?<br/><br/>And he even dared to bully his brother-in-law?<br/><br/>Wasn ‘t he courting death?<br/><br/>So what if there was a heaven’s origin creation in the flowing water forbidden land?<br/><br/>At that time, he really didn’t believe that the Heaven’s origin creation in the sword and magic universe would really dare to engage in a great battle with him.<br/><br/>If a great battle really broke out, the aftermath would cause the entire sword and magic universe to suffer heavy losses!<br/><br/>It could cause the death of billions of lives in the sword and Magic Universe!<br/><br/>At this time, they absolutely did not dare to erupt into a battle that was too strong.<br/><br/>Otherwise, when the calamity arrived, it would be the end of the Sword and Magic Universe!<br/><br/>Therefore, he was no longer afraid of the sword and Magic Universe’s Heavenly<br/><br/>Fate!<br/><br/>Together with the matter from more than 400 million years ago, it was resolved!<br/><br/>“What lawsuit are you trying to sell? You are so mysterious that even our dragon roar forbidden land doesn’t know your background! ”<br/><br/>Long Yin looked at him and couldn’t help but speak up!<br/><br/>“Hehe, you don’t have to worry about it anyway.”<br/><br/>Wang Xian smiled and said!<br/><br/>“Hehe, alright. Since you’ve Said So, I won’t worry about it anymore! ” Long Yin nodded with a smile.<br/><br/>However, just as Wang Xian was about to make his move after more than a month!<br/><br/>Half a month later, Saintess Liuyue suddenly arrived!<br/><br/>After she arrived, she immediately went to look for long yinhao!<br/><br/>At first, the two of them were having a good chat. However, seven days later, the situation suddenly became chaotic.<br/><br/>Saintess Liuyue suddenly called long yinyin over. Wang Xian was also confident that he would follow her!<br/><br/>“Liuyue, yinhao, what happened to you guys?”<br/><br/>Long yinyin noticed that both Saintess Liuyue and long yinyin looked extremely embarrassed.<br/><br/>She asked with slight surprise!<br/><br/>Sister yinyin, Pm going to take Yinhao to find those guys and make them pay for what they did! ”<br/><br/>Saintess Liuyue said with a frosty face!<br/><br/>Hearing her words, long yinyin looked at her younger brother!<br/><br/>“1 didn’t say anything! ”<br/><br/>Long Yinhao shook his head bitterly!<br/><br/>“If you didn’t say anything, wouldn’t I be able to find out by myself? You said that you encountered a magical beast and was killed by it. How is this possible? We have already entered and exited the seventh level of the Magical Beast<br/><br/>Abyss many times. ”<br/><br/>“I’m not a fool. How can I not know anything? What are you hiding? What are you worried about? I have some power in the flowing water forbidden land. Pm also the Holy Maiden of the Flowing Water Forbidden Land! ”<br/><br/>“If someone kills you, we are in the right. Even if there is no evidence, I want them to pay the price. I may not be able to do anything to some of them, but I can still make them pay the price!”<br/><br/>The flowing Moon Holy Maiden said with a cold expression, her face full of strength!<br/><br/>On the other hand, Long Yinhao, who was at the side, kept smiling bitterly!<br/><br/>There was no other way. Even when long Yinhao was at his peak, he was still not a match for his girlfriend.<br/><br/>Not to mention his background!<br/><br/>Having a powerful girlfriend, he was also in pain and happy!<br/><br/>“Sister yinyin, Pll take Yinhao to the garrison. Those guys are all there. Pll ask them to give an explanation!”<br/><br/>The flowing moon Saintess continued to speak to long yinyin!<br/><br/>“You and Yinhao can decide this flowing moon. ”<br/><br/>Long Yinyin opened her mouth and said.<br/><br/>In fact, Saintess Liuyue was much older than long yinyin.<br/><br/>However, because of her younger brother, she called him elder sister!<br/><br/>Their ages added together, they were not as old as Saintess Liuyue!<br/><br/>Of course, even if it was hundreds of millions of years of age difference, it was nothing in the eyes of experts at their realm.<br/><br/>“Alright, yinhao, come with me.”<br/><br/>Saintess Liuyue pulled long Yinhao and said forcefully!<br/><br/>She wanted to stand up for her man!<br/><br/>“Hehe, Yinhao has found the right girlfriend.”<br/><br/>Wang Xian watched from the side and said with a smile!<br/><br/>He didn’t expect Saintess Liuyue to be so domineering.<br/><br/>She treated long Yinhao very well!<br/><br/>Saintess flowing moon wanted to bring long Yinhao to seek an explanation! It would take half a month to get to the abyss of Demonic Beasts from here!<br/><br/>Coincidentally, her original body would be there by then!<br/><br/>When saintess flowing moon heard Wang Xian ‘s compliment, her face turned red!<br/><br/>Long Yinhao smiled foolishly.<br/><br/>Facing his domineering girlfriend, he had no way to resist and could only obey!<br/><br/>Can only be obedient!\t\t\t\t\t\t</div>", "images": {}, "success": true}