{"id": 1034, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073968.html", "title": "Chapter 4036 - Chapter 4036: 4035 Made His Move", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4036 - Chapter 4036: 4035 Made His Move</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4036: 4035 made his move<br/><br/>Translator: 549690339<br/><br/>“Let’s Go! ”<br/><br/>After Saintess Liuyue learned that long Yinhao was ambushed, she didn’t stay for long. She immediately wanted to bring him to seek an explanation!<br/><br/>Wang Xian and long yinyin followed by the side!<br/><br/>When the experts from the dragon roar forbidden ground knew about this news, they didn’t stop her nor follow her.<br/><br/>Saintess Liuyue’s status wasn’t something that the dragon roar forbidden ground could compare to!<br/><br/>And the flowing moon Saintess was able to become a saintess in the flowing water forbidden ground because she had a master and her own elders behind her!<br/><br/>Her elders were also experts in the flowing water forbidden ground!<br/><br/>They were even experts at the peak of the ruler realm.<br/><br/>The flowing moon Saintess could still do it if she wanted to get an explanation for long yinhao!<br/><br/>They couldn’t interfere in such matters!<br/><br/>The four of them headed towards the Devil Beast Abyss through the teleportation array!<br/><br/>The first six floors of the abyss of magical beasts had been completely cleared.<br/><br/>There was not a single magical beast left!<br/><br/>And on the seventh floor, a group of sacred lands and Sacred Academies had established a garrison here!<br/><br/>They used the entire seventh floor of the abyss of Magical Beasts as a training ground for the strong disciples.<br/><br/>The effects of these hundreds of millions of years were obvious!<br/><br/>And now, the magical beasts on the seventh floor had basically been cleared!<br/><br/>A group of powerhouses from the Holy Land and the Saint Academy were preparing to set up a garrison on the eighth level!<br/><br/>After half a month of traveling, Wang Xian and the rest arrived at Tianyuan city. They entered the teleportation formation and arrived directly above the Demonic Beast Abyss!<br/><br/>The moment the four of them were teleported over, a figure appeared!<br/><br/>A young man riding a unique one-eyed, one-horned old bull also stepped into the teleportation formation!<br/><br/>Other than being extraordinarily handsome, there was nothing special about this young man.<br/><br/>On the other hand, this one-horned, one-eyed old bull was about three to four meters in size. On the contrary, it looked rather silly and adorable!<br/><br/>The young man smiled and disappeared!<br/><br/>This was naturally the real Wang Xian who had rushed over!<br/><br/>After his breakthrough, Wang Xian kept a low profile. Unless he was in the Tianyuan blessed realm, one would not be able to tell Wang Xian’s actual strength!<br/><br/>Those who did not know could look at Wang Xian, even those who recognized him as a universe knight!<br/><br/>As for the Unicorn Ox, there were very few experts who could see through this terrifying demonic beast.<br/><br/>After all, the strength of the Unicorn Ox was also very terrifying!<br/><br/>Even an expert at the peak of the space-elemental Universe Dominator was no match for the Unicorn Ox!<br/><br/>Lin Niu could even be easily killed.<br/><br/>After a year’s journey, he finally arrived.<br/><br/>Wang Xian did not fuse with his void dragon body. Instead, he was observing the situation.<br/><br/>If the flowing moon Saintess gang stood out, then Wang Xian would have to wait for a while!<br/><br/>One’s true feelings could be seen in adversity.<br/><br/>Moreover, the flowing moon Saintess gang stood out for long Yinhao. He could also see some things.<br/><br/>Let’s see who they are. They don’t want to live anymore!<br/><br/>After entering the teleportation formation, Saintess Liuyue brought them straight to the seventh level of the abyss of beasts.<br/><br/>The first six levels were very safe. A fast passageway was opened up.<br/><br/>“Let’s go to the eighth level. Currently, a large number of strong disciples from the Forbidden Holy Land and the Saint Academy have established a base on the eighth level. Let’s go there directly! ”<br/><br/>When they arrived at the seventh level of the abyss of Demonic Beasts, Saintess Liuyue scanned the surroundings and realized that there were not many people on the seventh level. She brought Wang Xian and the rest and continued flying towards the eighth level!<br/><br/>When they arrived at the eighth level from a passageway, they immediately saw a large number of people around them.<br/><br/>There were at least a few million strong disciples!<br/><br/>None of them were lower than the ruler realm!<br/><br/>The reason why there were so many ruler realm experts was related to the environment in which the sword and magic were cultivated!<br/><br/>Furthermore, according to Wang Xian’s guess, it was also related to the number of heaven origin creation realm experts in a universe!<br/><br/>In a universe, if there were more heaven origin creation realm experts, more resources would be consumed by those at this level.<br/><br/>Naturally, there were fewer ruler realm experts!<br/><br/>In the sword and magic universe, there were only two heavenly fate realm experts, which meant that the resources here gave birth to more ruler realm experts.<br/><br/>A large number of experts were building a floating city in the sky below!<br/><br/>It could also be said to be a military land!<br/><br/>A large-scale military land!<br/><br/>Among them, a portion of the military land had already been built!<br/><br/>It took less than a month to build the military base!<br/><br/>The main reason was that there were too many strong people!<br/><br/>“Sister Yin Yin, holy son Wang Xian, let’s go. They are over there! ”<br/><br/>Saintess Liuyue looked at the communication device in her hand and led them in a direction!<br/><br/>Soon, they arrived at a courtyard house that had been built in the military base!<br/><br/>It was a very spacious courtyard house. Standing on it, they could see the eighth floor of the Demonic Beast Abyss from afar!<br/><br/>At this moment, there were a large number of powerful disciples on top of the courtyard house!<br/><br/>The majority were young and middle-aged!<br/><br/>There weren’t many of those from the ancient generation.<br/><br/>The group of powerful disciples were talking and talking loudly!<br/><br/>These were all elite disciples of the Sacred Land and Sacred Academy!<br/><br/>Saintess Liuyue’s eyes locked onto a certain area and a figure. A trace of killing intent flashed in her eyes!<br/><br/>She moved her palm and a magic staff appeared in her hand!<br/><br/>“Liuyue!”<br/><br/>Long Yinhao, who was beside him, sensed the killing intent from Saintess Liuyue and shouted!<br/><br/>“Yinhao, just watch from the side! ”<br/><br/>Saintess Liuyue said to him gently!<br/><br/>Then the staff in her hand released a terrifying light!<br/><br/>Hong<br/><br/>In the next moment, she moved, and a terrifying water lotus bloomed.<br/><br/>“Lotus of Death! ”<br/><br/>Flowing Moon Saintess’eyes focused, and she instantly attacked the space forbidden ground holy son and false Saint Son!<br/><br/>She attacked with a killing move and her strongest attack.<br/><br/>Saintess flowing moon was currently at level seven in the universe.<br/><br/>She wasn’t far away from the level eight realm of a universe ruler!<br/><br/>And the Saint Son Below was only at level five ot a universe ruler.<br/><br/>In these hundreds of millions of years, he had only advanced one level!<br/><br/>The reason was that it was too difficult to cultivate the space attribute.<br/><br/>Secondly, in the universe ruins, he didn’t get the inheritance of the great being in the demon pillar.<br/><br/>If he had gotten the inheritance, he would have at least reached level six of the universe ruler realm!<br/><br/>The flowing moon Saintess, who was at level seven of the universe ruler realm, suddenly attacked and used her killing move.<br/><br/>This was something none of the surrounding Great Beings’disciples had expected!<br/><br/>Even the false saint son and the surrounding Great Beings’disciples didn’t expect that a fatal attack would directly attack!<br/><br/>Moreover, it was at such a close distance!<br/><br/>Who would have thought that the Saintess of the flowing water forbidden land would suddenly kill the holy son of the Space Forbidden Land!<br/><br/>After all, the undeserved forbidden land and the flowing water forbidden land had already announced that no forces or experts were allowed to fight among themselves!<br/><br/>When this terrifying energy fell toward the false saint, everyone was shocked. ..<br/><br/>They quickly looked over!\t\t\t\t\t\t</div>", "images": {}, "success": true}