{"id": 1030, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073960.html", "title": "Chapter 4032 - Chapter 4032: 4031 Double Breakthroughs, Returning Once Again!", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4032 - Chapter 4032: 4031 Double Breakthroughs, Returning Once Again!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4032: 4031 double breakthroughs, returning once again!<br/><br/>Translator: 549690339<br/><br/>Name: Wang Xian<br/><br/>Race: Nine-origin Divine Dragon (man-dragon unity)<br/><br/>Level: Universe Overlord Level 7(nine transformations unity)<br/><br/>Origin: 1% (99% needed for the next breakthrough)<br/><br/>Supernatural ability: ruling the water tribe (ruling the water tribe below one’s level)<br/><br/>Devouring creatures (devouring creatures to extract origin)<br/><br/>Control of the five elements<br/><br/>Cultivation Method: Divine Dragon Transformation<br/><br/>Abhijna: soul-absorbing, spirit-attaching<br/><br/>Law Abhijna: Dragon Eye Lock, Five Elements Dragon Claw, Yin-yang realm-breaking, eight luminaries dragon scale, Sacred Dragon Shadow, eight Heavenly Dragon tribes, Dragon Tomb, Cloud Dragon Soaring, True Dragon body<br/><br/>Law Abhijna: eight Dragon Pillars, eight dragon clones, towering dragon horns, Mighty Heavenly Dragon, God’s tail playing Pearl, Life Dragon Breath, Shadow Dragon clone, Dark Dragon chasing, Dark Dragon Transformation, wind and Thunder Dragon Birth, Mad Dragon Star Explosion!<br/><br/>Domain: Nine-origin Dragon Domain<br/><br/>Control Law: metal, wood, water, fire, Earth, light, dark wind and thunder<br/><br/>Kingdom of God: Dragon Palace Dragon Palace: Innate.<br/><br/>Members of Dragon Palace: 8060450<br/><br/>Wang Xian’s mind moved. Looking at his attributes after his breakthrough, a smile appeared on his face!<br/><br/>The seventh level of the Universe Dominator!<br/><br/>After feeling his strength for a while, Wang Xian’s body moved and transformed into a human form!<br/><br/>With a wave of his arm, the Five Elements Millstone and the Tai Chi Dragon Plate appeared in front of Wang Xian!<br/><br/>The Tai Chi Dragon Plate and the five elements millstone had already broken through to the peak of the universe’s ruler!<br/><br/>All the metal materials from the LINNIU had been absorbed by them. However, they still needed some resources before they could break through again!<br/><br/>Furthermore, Wang Xian did not know if the next breakthrough of the Five Elements Millstone and the Tai Chi Dragon Plate would be a breakthrough to the level of the Heaven’s origin creation.<br/><br/>Or it would be comparable to his previous combat strength!<br/><br/>However, Wang Xian knew one thing. It was extremely difficult for the five elements Millstone and the Tai Chi Dragon Plate to break through to the level of the Heaven’s origin creation!<br/><br/>In fact, the possibility was only one in a billion!<br/><br/>It was too difficult!<br/><br/>However, Wang Xian did not force the five elements Millstone and the Tai Chi Dragon Plate to break through to the level of the Heaven’s origin creation.<br/><br/>The current him was still far from the level of the Heaven’s origin creation!<br/><br/>After all, there were three levels above him level eight, level nine, and the peak of the universe’s ruler!<br/><br/>Wang Xian relied on the integration of the nine attributes to possess such terrifying strength!<br/><br/>He moved his palm again, and two Heaven’s origin creation fragments, the starfield fragment and the book of Water Forbidden Spell, appeared in his hand!<br/><br/>He could now fully utilize the strength of these two fragments!<br/><br/>This was a huge boost to Wang Xian’s strength!<br/><br/>“Boss, you… how can your strength be so terrifying? The feeling you give me is that even the demon hunter king who was possessed by the Agar Heavenly Demon God back then is not as strong as you! ”<br/><br/>“I feel that you can easily destroy him, boss. Your terrifying power…” At this moment, Lin Niu’s shocked voice came from the side!<br/><br/>After 400 million years, Lin Niu’s injuries had basically recovered!<br/><br/>He felt the power from Wang Xian’s body and his eyes were filled with shock!<br/><br/>He was certain that the current Wang Xian would not be able to kill him easily.<br/><br/>He didn’t even need to use the two terrifying treasures in his hands!<br/><br/>Even the Aga Heavenly Demon God appeared extremely weak in front of his boss.<br/><br/>“I’m not sure if I can fight against the Heaven’s origin creation. Do you know the true power of the Heaven’s origin creation?”<br/><br/>Wang Xian looked at Lin Niu and asked!<br/><br/>“Boss, I don’t know either. But I feel that you shouldn’t be weaker than the Heaven’s origin creation. With my strength, if I take another step forward, it will be the Heaven’s origin creation.” Lin Niu widened his single eye and said!<br/><br/>“Hehe, that’s Good!”<br/><br/>Wang Xian smiled and looked to the side. “Wait for me here. I will go and verify something. ”<br/><br/>As he spoke, his body moved and instantly flew into the chaotic space at the side!<br/><br/>At the end of every universe, there was chaos.<br/><br/>In this chaotic space, heaven and earth had yet to open and there was no energy.<br/><br/>Once one entered it, even a powerhouse at the peak of the Universe Dominator could die out.<br/><br/>That was not a place where living beings could live.<br/><br/>However, after Wang Xian made a breakthrough, he had a feeling in his heart.<br/><br/>He instantly entered the chaos. The powerful energy squeezed out a space in the Chaos!<br/><br/>Wang Xian sensed it quietly and continued to go deeper!<br/><br/>He could sense that he could resist the erosion of the destructive energy in the chaotic space.<br/><br/>Furthermore, he could create a space in the chaotic space.<br/><br/>Of course, there was another point. Wang Xian could not absorb the energy here.<br/><br/>He could not sense the energy either.<br/><br/>However, the energy contained in his body was sufficient to sustain him for hundreds of millions of years in the chaotic space.<br/><br/>It was enough to sustain him for four to five life-and-death battles in the chaotic space!<br/><br/>Since the destiny of the Heaven’s origin can enter the chaotic space, is there any treasure in the chaotic space? The Divine Dragon Clan doesn’t have any records on this.”<br/><br/>“If I continue flying in the chaotic space, will I be able to enter other universes directly?<br/><br/>Wang Xian mumbled. With a wave of his arm, a dragon claw appeared and attacked in front of him.<br/><br/>The immense energy tore through the CHAOS!<br/><br/>Wang Xian shook his head. He didn’t go any deeper and flew out.<br/><br/>He had just broken through. Even if he could match up to the Heaven’s origin creation, he wouldn’t be able to gain much advantage in a fight with the real Heaven’s origin creation!<br/><br/>It was better to keep a low profile for now.<br/><br/>When his realm broke through to level eight or level nine, he could consider such matters.<br/><br/>Also, was there a division of realms in the Heaven’s origin destiny realm!<br/><br/>“Lin Niu, let’s go. I’ll bring you to kill the Asgardian Devil God and let you devour him. I’ll help you step into the Heaven’s origin Destiny Realm! ” Wang Xian flew out from the chaos and spoke to Lin Niu!<br/><br/>“Yes, boss. Thank you, Boss. Thank you, Boss. In the future, I, Lin Niu, will definitely be a very loyal bull and a very loyal Mount!”<br/><br/>When Lin Niu saw Wang Xian flying out and heard these words, his body trembled and he roared out in excitement!<br/><br/>Even though his current cultivation level was extremely terrifying, he could not control his excitement when he heard these words!<br/><br/>He immediately transformed into a dog licking dog and bowed to Wang Xian excitedly!<br/><br/>It was the Heaven’s origin creation realm!<br/><br/>This was a realm that Lin Niu did not imagine!<br/><br/>But now, he felt that he had a great chance!<br/><br/>This was because he had an extremely powerful boss, a boss that was comparable to the Heaven’s origin creation realm!<br/><br/>“Hehe, let’s Go! ”<br/><br/>Wang Xian waved his arm and a black hole appeared in front of them!<br/><br/>This was a black hole that was instantly opened with the help of the energy from the galactic fragment!<br/><br/>It was somewhat similar to the teleportation of Xiao Lan and the rest! A surge of energy wrapped around the Linniu and they teleported in an instant.<br/><br/>They were flying at a rapid speed!<br/><br/>First, they had to get rid of the Aga Heavenly Demon God and help the Linniu achieve a breakthrough!<br/><br/>Then, they had to settle the matter of the forbidden space!<br/><br/>The breakthrough in his strength allowed Wang Xian ‘s speed to reach a terrifying level.<br/><br/>According to Wang Xian’s estimation, he would be able to reach Tianyuan City in a year at most..\t\t\t\t\t\t</div>", "images": {}, "success": true}