{"id": 1038, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073976.html", "title": "Chapter 4040 - Chapter 4040: 4039 My Background Is My Own", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4040 - Chapter 4040: 4039 My Background Is My Own</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4040: 4039 my background is my own<br/><br/>Translator: 549690339<br/><br/>“How impudent! How dare you let an expert who dares to imprison our forbidden space be courting death! ”<br/><br/>The voice of the experts from the forbidden space was filled with killing intent!<br/><br/>They stared at Wang Xian with a sinister gaze!<br/><br/>Their eyes were bloodshot!<br/><br/>This Wang Xian actually dared to openly provoke their forbidden space!<br/><br/>Did he really think that he was the flowing moon Saintess?<br/><br/>Did he really think that anyone could question their forbidden space?<br/><br/>“Hehe! ”<br/><br/>Wang Xian looked at them and felt the power coming from their bodies. His face was filled with disdain and an ice-cold expression.<br/><br/>He licked his lips and stared at them. “Looks like you guys aren’t going to give an explanation?”<br/><br/>At the side, Saintess Liuyue looked at Wang Xian. Her expression changed slightly.<br/><br/>He glanced at long Yinhao and saw his worried expression. Then, he stared at the group of experts from the forbidden space!<br/><br/>“Hehe, so you guys from the forbidden space are repeat offenders. Not only did your disciples attack long yinhao, but they also attacked Saint Wang Xian. Do you really want to kill whoever you want?”<br/><br/>Saintess flowing moon said with a cold face. She then looked at the seniors of the flowing water forbidden ground and said, “First Elder, second elder, please investigate this matter. Killing the future powerhouses of our sword and Magic Universe is an unforgivable crime!”<br/><br/>“It’s hard to judge what happened more than 400 million years ago. At that time, our sword and Magic Universe didn’t mention the rule that forbids killing. This rule was only issued more than 200 million years ago!”<br/><br/>“Saint Liuyue, you really like to meddle in other people’s business! ”<br/><br/>Before the two elders could say anything, Liushui Hao stood there and said with a cold face!<br/><br/>“No matter when it happened, the actions of the experts in the space forbidden land… ”<br/><br/>“Alright Liuyue… ”<br/><br/>Saint Liuyue wanted to say something but was stopped by Granny Yuan. She shook her head at her!<br/><br/>“Don’t offend the Space Forbidden Land. They are not weak. Although they are not as strong as our flowing water forbidden land, there are still many experts!”<br/><br/>“Don’t get involved in this matter!”<br/><br/>Granny Yuan transmitted her voice to the flowing moon Saintess!<br/><br/>Today, the flowing moon Saintess had already offended the flowing water forbidden land, but she had offended them because the flowing moon Saintess had her own reasons.<br/><br/>The space forbidden ground wouldn’t take it to heart.<br/><br/>However, it was different now.<br/><br/>If Saintess Liu Yue continued to interfere, the experts of the space forbidden ground might hold a grudge against her.<br/><br/>It was hard to defend against a well-known spear!<br/><br/>If she was set up in the future, there was nothing she could do!<br/><br/>Therefore, she couldn’t get involved in this matter!<br/><br/>Sage Wang Xian, right? Let’s forget about this matter. Everyone in the Space<br/><br/>Forbidden Ground, let’s forget about it.”<br/><br/>Granny Yuan spoke to Wang Xian and the experts from the forbidden space!<br/><br/>She wanted to resolve this matter!<br/><br/>“It’s not that easy to settle this matter. You have to give me an explanation for the forbidden space. Also, you have to give me an explanation for long Yinhao’s matter. Today, I want a perfect solution to everything! ”<br/><br/>When Wang Xian heard Granny Yuan’s words, he shook his head indifferently. There was no change in his expression!<br/><br/>He opened his mouth and spoke.<br/><br/>“Haha, what a joke. You want an explanation? You want us to give you an explanation? Who Do you think you are? Kid, there are rules now. You are not allowed to make a move! ”<br/><br/>“However, you dare to provoke our forbidden space. Even if there are rules, you must die. You Dare to question our forbidden space. Who gave you the courage and background?”<br/><br/>An expert at level eight, the ruler of the universe in the forbidden space laughed maniacally as he stared coldly at Wang Xian!<br/><br/>The Aura on his body rose slowly as he looked at Wang Xian!<br/><br/>When everyone in the surroundings saw this scene, their eyes froze slightly! “What is this Wang Xian trying to do? He doesn’t know what he is doing now! ”<br/><br/>“More than 400 million years ago, the experts from the forbidden space attacked him. This is indeed hard to say. After all, more than 400 million years ago, the unfettered forbidden land and the flowing water forbidden land didn’t issue any orders to stop killing each other. Now, if Wang Xian really provoked the forbidden space, the experts from the forbidden space might really make a<br/><br/>“The forbidden space is, after all, the third-ranked existence in the sword and Magic Universe. A holy son was killed by Saintess flowing moon. Saintess flowing moon has a background and a reason. The forbidden space won’t say anything. However, it’s different if Wang Xian wants an explanation from the forbidden space!”<br/><br/>“The experts from the forbidden space are infuriated. If the undeserved forbidden ground and the flowing water forbidden ground didn’t intervene in this matter, I’m afraid it wouldn’t be good! ”<br/><br/>In the surrounding area, all the experts ‘disciples saw this scene and discussed in low voices!<br/><br/>They were amazed by Wang Xian’s boldness!<br/><br/>However, what he was facing was the forbidden space after all!<br/><br/>Saint Child Wang Xian, this matter is indeed difficult to resolve. You should leave quickly! ”<br/><br/>Seeing this scene, holy son Wu Man from the undeserved forbidden ground frowned slightly and sent a voice transmission to Wang Xian to remind him!<br/><br/>“Since that’s the case, since your space forbidden ground won’t give me a solution, I can only resolve it myself!”<br/><br/>Wang Xian stood there, unmoved by the surrounding voices!<br/><br/>A cold expression appeared on his face as he spoke indifferently!<br/><br/>“Holy son Wang Xian, you are courting death. Everyone else has said that you have a mysterious background. Today, let us see what kind of background you have. To think that you are so arrogant and arrogant! ”<br/><br/>“You dare to provoke our forbidden space. If you can’t give us an explanation today, I will personally kill you! ”<br/><br/>At the side, Xu Jingshen, an expert from the forbidden space, stared at Wang Xian with a cold expression. His body was also emitting a powerful aura! With the strength of a level seven universe overlord, he had completely sealed off Wang Xian.<br/><br/>He was ready to make his move at any time!<br/><br/>At the surrounding area, the eyes of the disciples of the experts flickered when they saw this scene!<br/><br/>“You guys settle this matter yourselves. Our flowing water forbidden space will not participate! ”<br/><br/>The great elder of the flowing water forbidden ground said coldly when he saw this scene!<br/><br/>His gaze swept across the group of experts in the space forbidden ground. His intention was clear.<br/><br/>You guys can settle it yourselves.<br/><br/>It doesn’t matter even if it’s murder!<br/><br/>(‘My Background? I don’t have any background? My background is myself! ” Wang Xian smiled when he heard Xu Jingshen’s words and said faintly!<br/><br/>“Whoosh! Whoosh! Whoosh! Whoosh! ” “Whoosh! Whoosh! Whoosh! ” “Boom! Boom! Boom!”<br/><br/>“Dragon King! ”<br/><br/>At this moment, a terrifying sword ray suddenly appeared from the side!<br/><br/>The Sword Ray soared into the sky, exuding a terrifying sword aura!<br/><br/>Every Aura had a power that was not weaker than a level five universe overlord!<br/><br/>Ao Jian, who was in the lead, had already reached the level seven universe overlord realm!<br/><br/>There were more than 10,000 of them!<br/><br/>Their bodies were emitting golden rays of light as they flew towards Wang Xian!<br/><br/>Other than them, there were 10 other charming dragon seeds at the front!<br/><br/>The charming dragon seeds of a level eight universe overlord!\t\t\t\t\t\t</div>", "images": {}, "success": true}