{"id": 1036, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073972.html", "title": "Chapter 4038 - Chapter 4038: 4037 Made His Move", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4038 - Chapter 4038: 4037 Made His Move</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4038: 4037 made his move<br/><br/>Translator: 549690339<br/><br/>The six experts of the forbidden space locked onto Saintess flowing moon, their eyes filled with coldness!<br/><br/>The Saintess of the forbidden space of flowing water killed their holy son.<br/><br/>Although they didn ‘t dare to directly kill Saintess flowing moon.<br/><br/>But they still needed an explanation!<br/><br/>If saintess flowing moon couldn’t give an explanation, she would also be punished!<br/><br/>She would be punished by the rules!<br/><br/>After all, the forbidden space was also the third most powerful force on the continent.<br/><br/>Apart from the Heavenly Yuan blessed realm experts, the forbidden space was extremely terrifying in terms of top-tier combat strength!<br/><br/>“Since I dared to make a move, I naturally have a reason. Yinhao’s death is related to your forbidden space, saint son Xu Ni, Xu Jingshen, Xu fangxue, Qi Jiangping, and Qi Xiaohe. Hundreds of millions of years ago, our flowing water forbidden space and the undeserved forbidden space have already given orders to forbid any of the powerful disciples on the continent from fighting. ”<br/><br/>“The Disciples of your forbidden space will have to pay the price for breaking the rules. It’s not just saint son Xu Ni! ”<br/><br/>Saintess flowing moon said coldly when she saw the experts of the forbidden space!<br/><br/>Her strong words made the six experts of the forbidden space frown slightly!<br/><br/>They looked to the side and asked Xu Jingshen, Xu Fang Xue, and the others!<br/><br/>Xu Jingshen and the others also frowned slightly as they looked at Liu Shuihao.<br/><br/>They didn’t expect that Saintess Liu Yue would be so powerful!<br/><br/>She would directly come and kill Saint Son Xu Ni!<br/><br/>This made them extremely shocked!<br/><br/>This situation wasn’t something they could solve!<br/><br/>However, they weren ‘t worried.<br/><br/>“Liu Yue, you said that we killed long Yinhao, so show us the evidence. Without evidence, don’t casually frame us! ”<br/><br/>Liu Shuihaolian stared at Saintess Liu Yue with an embarrassed expression and said again!<br/><br/>He glanced at long Yinhao with a sinister gaze!<br/><br/>“Liu Shuihaolian, our flowing water forbidden land has the one question heart technique. As long as our seniors use it, whether you acted or not, and whether or not you were framed, we will naturally know in an instant!”<br/><br/>Saintess Liu Yue looked at him and said with a cold smile!<br/><br/>Her gaze swept through the surroundings, and the aura from her body soared into the sky!<br/><br/>Seniors from the flowing water forbidden ground, please come out and uphold justice. The order given by our Heavenly Yuan Lord Creation, if someone wants to destroy it, shouldn’t they pay the proper price! ”<br/><br/>Flowing Moon Holy Maiden said loudly, and her voice spread throughout the entire garrison area!<br/><br/>“Flowing moon, are you sure you want to shed all pretense of cordiality with<br/><br/>When flowing water Haolian heard her words, his expression changed drastically, his gaze fixed on her!<br/><br/>Flowing Moon Holy Maiden did not speak, quietly floating in the air!<br/><br/>“Hiss, damn, this flowing Moon Holy Maiden is so powerful. She’s so powerful, she directly asked the experts of flowing water forbidden land to come over and uphold justice, to come over and punish her! ”<br/><br/>“What a powerful woman. For the sake of her beloved, she actually wants to punish flowing water haolian and the other experts of flowing water forbidden land. She’s really awesome! ”<br/><br/>“She is so domineering! She is indeed the Saintess of flowing water forbidden land! She is known as the woman who will definitely step into the peak of the ruler realm in the future. She is the pillar of the flowing water forbidden land in the future!”<br/><br/>All the powerful disciples in the surrounding area were amazed when they saw this scene!<br/><br/>She was truly a magnificent Saintess of flowing moon!<br/><br/>“Hahaha, good, good. I really admire Saintess of flowing moon. She is a straightforward person. We will find out if she is right or wrong! ”<br/><br/>Not far away, the barbarian saint from the unfettered forbidden land flew over and said with a loud laugh!<br/><br/>All the powerful disciples in the surrounding area were attracted over.<br/><br/>It could be said that all the powerful disciples from the Sacred Academy of the forbidden land in the entire sword and magic universe were gathered here!<br/><br/>“Buzz Buzz Buzz! ”<br/><br/>“Buzz Buzz Buzz! ”<br/><br/>At this moment, streams of water appeared out of thin air.<br/><br/>Experts from the flowing water forbidden ground slowly appeared!<br/><br/>Three Peak ruler realm experts.<br/><br/>More than ten peak ruler realm experts of the ninth rank!<br/><br/>“Sou Sou Soul”<br/><br/>Not only the flowing water forbidden ground, there were also peak ruler realm experts from the undeserved forbidden ground flying over.<br/><br/>“Granny Yuan, First Elder, second elder!”<br/><br/>When flowing moon Saintess saw the figures appearing, she immediately bowed and said!<br/><br/>“Yes, we already know about your matter!”<br/><br/>An old woman with a walking stick in the middle looked at Saintess Liuyue and nodded. “Xiaoyue, let me handle this matter! ”<br/><br/>“It’s Granny Yuan! ”<br/><br/>Saintess Liuyue nodded when she heard that.<br/><br/>The matter was so big that she couldn’t make the decision!<br/><br/>Moreover, she had told some seniors in the Liushui forbidden land before she made her move!<br/><br/>This time, she could kill the false saint child.<br/><br/>But she couldn’t kill everyone.<br/><br/>The main reason was flowing water hailian.<br/><br/>First, it was because he was the grandson of the Master of the Forbidden Ground, and the master of flowing water forbidden ground wanted to protect his grandson.<br/><br/>Second, it was over at the spatial forbidden ground.<br/><br/>The strength of the spatial forbidden ground wasn’t weak. Directly killing a few core elite disciples still needed some consideration!<br/><br/>Of course, the main reason was still because of flowing water Hao Lian.<br/><br/>Flowing water forbidden space dared to kill those who broke the rules.<br/><br/>But if they wanted to kill, they had to kill everyone. Flowing Water Hao Lian had to die too.<br/><br/>Otherwise, the forbidden space would not accept it!<br/><br/>If they did not kill all of them, then they could not kill all of them!<br/><br/>“We will decide this matter fairly. Long Yinhao originally had a high chance of reaching the peak of the ruler realm. Now that he has fallen, it is a loss to our sword and magic universe. Due to your talent and temperament, our flowing water forbidden space is prepared to accept you as a disciple. We will do our best to restore your strength and stabilize you at the peak of the ruler realm! ”<br/><br/>Granny Yuan looked at long Yinhao and said!<br/><br/>Long Yinhao was slightly stunned. He was a little confused.<br/><br/>“Hehe, don’t worry. You are still a disciple of the dragon roar forbidden land,<br/><br/>but you are also a disciple of the flowing water forbidden land. We you’re your relationship with Liu Yue, and we won’t oppose it. In the future, I will prepare all the resources you need for your recovery. You will enjoy the cultivation resources that are higher than all the powerful disciples. ”<br/><br/>When Granny Yuan saw long Yinhao’s stunned expression, she continued to say with a smile!<br/><br/>“Thank you, Granny Yuan!”<br/><br/>Long Yinhao opened his mouth and looked at Saintess Liuyue beside him. He immediately thanked Granny Yuan!<br/><br/>“We will continue to investigate the other matters. If we violate the rules, we will naturally have to pay the price! ”<br/><br/>At this moment, the great elder of the flowing water forbidden ground spoke from the side. He swept his gaze around and said, “Let’s just let this matter go. ”<br/><br/>As he spoke, he looked at the group of experts from the Space Forbidden Ground!<br/><br/>“Alright, we’ll listen to the first elder then. Let’s just forget about it! ” When the group of experts from the space forbidden ground saw this, they looked at each other and nodded their heads.<br/><br/>Although saintess flowing moon had killed the holy son of their space forbidden ground, they understood the current situation!<br/><br/>It was the best choice for them to end it like this!<br/><br/>When Wang Xian saw this scene, he raised his eyebrows slightly.<br/><br/>Forget it?\t\t\t\t\t\t</div>", "images": {}, "success": true}