{"id": 1035, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073970.html", "title": "Chapter 4037 - Chapter 4037: 4036 Was Powerful", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4037 - Chapter 4037: 4036 Was Powerful</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4037: 4036 was powerful<br/><br/>Translator: 549690339<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>On the eighth floor of the Demonic Beast Abyss, the flowing moon Saintess suddenly attacked.<br/><br/>As the death lotus bloomed, it instantly drowned the False Saint Son!<br/><br/>The false Saint Son didn’t react in time.<br/><br/>The surrounding experts also didn’t react in time.<br/><br/>The terrifying energy directly covered him, and he let out a scream!<br/><br/>Then, his life was instantly gone!<br/><br/>“What?”<br/><br/>“Hiss, this? ? ? That’s saintess flowing moon. What is she doing? She actually directly killed saint son Xu Ni of the Forbidden Space Zone! ”<br/><br/>“This? ? She’s crazy. Why did she suddenly kill Saint Son Xu Ni?”<br/><br/>When the energy suddenly rose here, all the surrounding experts and disciples looked over with shocked expressions!<br/><br/>Saintess flowing moon killed the holy son of the forbidden space on the spot.<br/><br/>This?<br/><br/>This was too crazy!<br/><br/>Moreover, the holy son was killed before he could react!<br/><br/>It shocked everyone!<br/><br/>The body of the holy son was lying there quietly!<br/><br/>Around the body, the experts of the forbidden space, the forbidden space, and the other sacred grounds were also stunned.<br/><br/>“Flowing moon Saintess, what are you doing?”<br/><br/>A Level 7 universe ruler expert from the space forbidden grounds immediately raised his head and locked his gaze on flowing moon Saintess. His face was gloomy as he roared!<br/><br/>“Flowing moon, are you crazy? What are you doing?”<br/><br/>A Level 8 universe ruler from the flowing water forbidden grounds looked at flowing moon Saintess and roared!<br/><br/>“Flowing Water Bright Link, Flowing Qingming, void shocking god, Xu fangxue, Qi Jiangping, Qi Xiaohe, get out! ”<br/><br/>Flowing moon Saintess floated in the sky and looked down at the people below, her eyes full of killing intent.<br/><br/>As soon as she finished speaking, the staff in her hand condensed a terrifying attack again!<br/><br/>This time, her target was flowing water Holy Land’s current Holy Son, Flowing Qingming.<br/><br/>Once she attacked, it was still a killing move.<br/><br/>The saint of flowing water forbidden land, who was also the saint in the universe ruins, didn’t receive the inheritance of the great being in the Magic Pillar!<br/><br/>Facing the saint of the same sect, and it was an existence on the same level as her.<br/><br/>She still didn’t hold back!<br/><br/>Liu Qingming saw the attack of the flowing moon Saintess, and his face changed dramatically. He hurriedly dodged to the side with a face full of fear!<br/><br/>“Liu Yue, do you know what you’re doing?”<br/><br/>Liu Shui Hao Lian’s expression was extremely unsightly as he watched this scene from the side.<br/><br/>He waved his arm and formed a powerful defense.<br/><br/>His power was at the eighth level of a universe ruler.<br/><br/>He was one level higher than Saintess Liu Yue!<br/><br/>“This? What is this Saintess Liu Yue doing? She killed the holy son of the Forbidden Space Zone in one move, and now she wants to kill the holy son of their Forbidden Space Zone?”<br/><br/>“This is too crazy. What is going on with her? How dare she act so recklessly here!<br/><br/>“This is too terrifying, too intrepid. If she attacks directly, she will die! ”<br/><br/>In the surrounding area, all the powerful disciples of the forbidden space and the Sacred Academy were shocked!<br/><br/>This was too crazy!<br/><br/>The holy son of the same sect wanted to kill her directly!<br/><br/>“That’s right. He’s very protective of his husband. I Can’t let him down in the future! ”<br/><br/>Wang Xian looked at this scene and smiled. He smiled at long Yinhao who was beside him!<br/><br/>This made long Yinhao look embarrassed.<br/><br/>“Will something happen to Liu Yue if he does this?”<br/><br/>He asked worriedly!<br/><br/>“Don’t worry. The reason why Saintess Liu Yue could become the Saintess of the flowing water forbidden ground is not only because of her great talent and terrifying strength, but also because she has her own character. ”<br/><br/>Wang Xian said to him.<br/><br/>A saintess from such a forbidden ground had lived for a billion years. Under the intensive cultivation of the flowing water forbidden ground, she was no ordinary weak girl!<br/><br/>Since she had made her move, she must have some trump cards!<br/><br/>From her actions, one could see some of it.<br/><br/>She didn’t kill the holy son of the flowing water forbidden ground first. She had some scruples too!<br/><br/>Killing the holy son of the space forbidden ground was something she could bear!<br/><br/>Saintess flowing moon, why did you kill Saint Son Xu Ni of our space forbidden ground? Don’t think that just because you’re the Saintess of the flowing water forbidden ground, you can do whatever you want and kill people! ”<br/><br/>“You have to give the space forbidden ground an explanation! ”<br/><br/>The questions of the experts of the space forbidden ground came from below!<br/><br/>“I killed Xu Ni. You should understand that I’m not strong enough now. If I am, I’ll kill you. HMPH, Flowing Water Haolian, you guys, you know what you did!<br/><br/>Flowing Moon Holy Maiden stared at them and said coldly!<br/><br/>“What did we do? Flowing Moon, tell us clearly! ”<br/><br/>Liu Shuihaolian looked at Saintess Liu Yue with an embarrassed expression. He then glanced at long Yinhao who was beside him. An unfathomable killing intent flashed in his eyes!<br/><br/>The people around them didn’t sense this killing intent, but Wang Xian did! “Do you think I don ‘t know that you guys killed long Yinhao?”<br/><br/>Saintess Liu Yue stared at Liu Shuihaolian and questioned him with a sinister expression!<br/><br/>“We killed Long Yinhao? Flowing Moon, you have to pay attention to the evidence when you speak. If you don’t have any evidence, why did you attack?” Liu Qingming roared with a pale face!<br/><br/>Just now, if it wasn ‘t for flowing water haolian who helped him block the attack, he would have been killed!<br/><br/>“Eh? What? Long Yinhao was killed?”<br/><br/>“Look, that’s long yinhao. Recently, Long Yinhao and the flowing moon Saintess have been very close. After long yinhao obtained the inheritance of an expert from the ruins of the universe, he rose up and was called one of the experts who had the most hope of reaching the peak of the ruler realm in the future. He actually died! ”<br/><br/>“His aura is so weak, he should have died once!”<br/><br/>In the surrounding area, everyone was slightly shocked when they heard the flowing moon Saintess’words!<br/><br/>The current long Yinhao could be considered a top-tier powerhouse of the same generation in the sword and Magic Universe.<br/><br/>After receiving the inheritance from the universe ruins, he rose to power!<br/><br/>His terrifying breakthrough speed and his relationship with the flowing moon Saintess made him stand in the spotlight of the same generation! Judging from his extremely weak body, he should have died once!<br/><br/>“Weng Weng Weng Weng! ”<br/><br/>“Weng Weng Weng Weng! ”<br/><br/>Right at this moment, the surrounding space rippled slightly!<br/><br/>Powerful figures appeared in the surrounding areas!<br/><br/>Five or six great beings with space attributes appeared in the surrounding areas.<br/><br/>Six old men, each with an aura that was not weaker than a universe ruler at level nine!<br/><br/>Five universe rulers at level eight were space masters.<br/><br/>One universe ruler at level nine was a space master!<br/><br/>This universe ruler at level nine was equivalent to a pinnacle universe ruler of other attributes!<br/><br/>After they arrived, their expressions didn’t look too good.<br/><br/>Their gazes were locked onto flowing moon Saintess!<br/><br/>“Flowing moon Saintess, you killed the holy son of our space forbidden land. You have to give us an explanation. Otherwise, even if you are the Saintess of flowing water forbidden land, we will still offend you! ”<br/><br/>In the center, the space great being at level nine of a universe master said!\t\t\t\t\t\t</div>", "images": {}, "success": true}