{"id": 1037, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073974.html", "title": "Chapter 4039 - Chapter 4039: 4038 Took Action", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4039 - Chapter 4039: 4038 Took Action</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4039: 4038 took action<br/><br/>Translator: 549690339<br/><br/>Just let it go like that?<br/><br/>Wang Xian glanced at saintess flowing moon and understood something!<br/><br/>This should be the limit of what Saintess flowing moon could do!<br/><br/>Kill a false saint.<br/><br/>Get some benefits for long yinhao.<br/><br/>This was indeed a good choice!<br/><br/>It was already very good that she could do this!<br/><br/>After all, she had offended flowing water haolian to death!<br/><br/>She had even offended some of the masters of the forbidden grounds of flowing water forbidden ground.<br/><br/>Of course, it was unknown if the masters of the forbidden grounds of flowing water forbidden ground had taken this matter to heart!<br/><br/>If they had taken it to heart, it would be very terrifying for Saintess flowing moon in the future!<br/><br/>“There’s no problem, right? If there’s no problem, then let’s disperse! ”<br/><br/>The first elder of flowing water forbidden ground looked around and landed on long Yinhao as he spoke!<br/><br/>“No Problem! ”<br/><br/>Long Yinhao felt the gaze of the first elder of the flowing water forbidden ground and replied immediately!<br/><br/>“The first elder of the flowing water forbidden ground should be close to the master of the flowing water forbidden ground and be more protective of flowing water haolian. That Granny Yuan should be closer to Saintess flowing moon! ”<br/><br/>Wang Xian thought to himself when he saw this scene!<br/><br/>He narrowed his eyes slightly.<br/><br/>If Long Yinhao was merely the holy son of the Dragon Roar forbidden ground, this would indeed be a very good result.<br/><br/>However, Long Yinhao was not only the holy son of the Dragon Roar Forbidden Ground.<br/><br/>He was also Wang Xian’s brother-in-law!<br/><br/>“There’s a problem!”<br/><br/>The moment long Yinhao finished his sentence, Wang Xian’s body moved and flew forward.<br/><br/>His gaze swept across flowing water haolian.<br/><br/>At this moment, flowing water haolian was staring at long Yinhao with a hint of hatred and coldness in his eyes!<br/><br/>Perhaps, if there was a chance, he would still make a move against long<br/><br/>Yinhao.<br/><br/>If he made a move the next time, he might not deliberately appear and taunt long Yinhao like the last time!<br/><br/>Wang Xian suddenly walked out and spoke, causing everyone to be slightly stunned!<br/><br/>Even the great elder, the flowing moon Saintess, and long yinyin looked at Wang Xian in astonishment.<br/><br/>“Brother Wang Xian! ”<br/><br/>Long yinyin’s expression changed drastically. She quickly flew to his side and transmitted her voice to her, “Let’s forget about this matter. It has been resolved very well! ”<br/><br/>“It’s fine. Don’t speak at the side. I will settle the rest of the matters. I still have some matters to settle here!<br/><br/>Wang Xian shook his head at him and swept his gaze across everyone!<br/><br/>“The order given by the powerhouses of heaven origin creation in the unfettered forbidden land and flowing water forbidden land. Anyone who breaks the rules will have to pay the price of blood. The matter with long Yinhao can not be settled so easily!”<br/><br/>“Also, I have some matters that need to be resolved in the Space Forbidden<br/><br/>As he continued speaking, his gaze finally landed on the experts from the forbidden space!<br/><br/>“Hiss? What? What? What’s going on?”<br/><br/>(‘I don’t know. Why did the sage Wang Xian suddenly open his mouth? What does he want to do? Does he know what he’s doing?”<br/><br/>“This sage Wang Xian hasn’t appeared for hundreds of millions of years. Now, he actually dares to openly refute the experts from the flowing water forbidden ground. Also, he has some matters that he needs the experts from the forbidden space to settle?”<br/><br/>When all the strong disciples around saw Wang Xian suddenly flying out, their faces were filled with shock and astonishment!<br/><br/>Saint Wu Man and the rest of them also looked at Wang Xian.<br/><br/>The Wang Xian from hundreds of millions of years ago could be said to have appeared out of nowhere like a dark horse, suppressing all the saint sons and Saintesses!<br/><br/>The strongest person in the same generation was recognized by everyone in this generation!<br/><br/>However, after that, he suddenly disappeared for hundreds of millions of years and never appeared again!<br/><br/>Today was the first time he appeared out of nowhere!<br/><br/>“HMM? Let’s settle this in the forbidden space?”<br/><br/>When the experts from the forbidden space heard Wang Xian’s words, their eyes narrowed slightly and their faces revealed a cold expression!<br/><br/>They might have some misgivings about Saintess liuyue, but they wouldn’t have any misgivings about Wang Xian!<br/><br/>They were the third most forbidden space in the universe of Swords and Magic!<br/><br/>Buzz<br/><br/>Wang Xian looked at them and smiled. With a wave of his arm, a round ball appeared in his hand!<br/><br/>There were eight figures in the round ball!<br/><br/>These eight figures were Wu Hongshan and the rest who had attacked Wang Xian previously.<br/><br/>The previous generation of saints from the forbidden space, as well as the rest of the powerhouses!<br/><br/>They had been imprisoned by Wang Xian for more than 400 million years!<br/><br/>They had suffered agonizing torment in the space of this small ball!<br/><br/>“Elder, Save Us, save us!”<br/><br/>“Elder, Save Us, save us!”<br/><br/>When they appeared, they immediately sensed the situation outside.<br/><br/>When they saw the powerhouses of the forbidden space, a glimmer of hope appeared on their faces. They shouted with all their might!<br/><br/>They had been imprisoned here for more than 400 million years. Time and pain had caused them to be on the verge of collapse!<br/><br/>They cried out for help loudly. They looked extremely miserable!<br/><br/>“Huh? Hong Shan! ”<br/><br/>The six experts from the forbidden space, as well as the experts from the surrounding areas, saw the eight of them and their expressions changed drastically!<br/><br/>The leader of the experts from the forbidden space had a cold look in his eyes. He waved his arm and a terrifying force of space enveloped them!<br/><br/>Wang Xian looked on without any fluctuation!<br/><br/>“More than 400 million years ago, they attacked me. Hehe, they wanted to kill me, but I didn’t kill them because I knew they could be resurrected. Since they wanted to kill me, they would naturally have to pay with their lives instead of simply dying and resurrecting once! ”<br/><br/>Right! ”<br/><br/>As Wang Xian spoke, he waved his arm. More than 400 million years ago, the scene of them attacking appeared!<br/><br/>“They broke the rules. Don’t they have to pay a price? Are you the experts from the forbidden space going to give an explanation?”<br/><br/>Wang Xian looked at them and continued to speak indifferently!<br/><br/>“Oh? Damn, is there such a thing? More than 400 million years ago, the experts from the forbidden space actually attacked Saint Wang Xian?”<br/><br/>“This? The previous saint of the forbidden space, Wu Hongshan, was the Master of the seventh level. He was actually imprisoned by Saint Wang Xian for more than 400 million years. This saint Wang Xian must have a powerful defensive treasure! ”<br/><br/>“This holy son Wang Xian was able to trap Wuhongshan and the rest more than 400 million years ago. What kind of trump card does he have? This holy son Wang Xian is the most mysterious. No one has ever known about his background! ”<br/><br/>In the surrounding area, when the group of strong disciples heard Wang Xian’s words and saw the scene in the picture, they were shocked!<br/><br/>They were discussing in low voices!<br/><br/>“Elder, Elder, we didn’t attack him or kill him. He trapped us for more than 400 million years. He wants to kill us! ”<br/><br/>At this moment, Wu Hongshan’s furious voice rang out in front of them.<br/><br/>He looked extremely miserable as he shouted at the strong practitioners in the forbidden space!<br/><br/>“How dare you! You dare to imprison the experts in our forbidden space? You are simply courting death! ”<br/><br/>The expert who was at the ninth stage of the ruler realm in the middle of the forbidden space shouted at Wang Xian with a cold expression.<br/><br/>He was filled with killing intent!\t\t\t\t\t\t</div>", "images": {}, "success": true}