{"id": 1040, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073980.html", "title": "Chapter 4042 - Chapter 4042: 4041 On The Forbidden Ground Of The Extermination Dimension", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4042 - Chapter 4042: 4041 On The Forbidden Ground Of The Extermination Dimension</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4042: 4041 on the forbidden ground of the extermination dimension<br/><br/>Translator: 549690339<br/><br/>“Exterminate all of you, your entire family! ” When Wang Xian finished his sentence!<br/><br/>When everyone heard this sentence.<br/><br/>On the scene, all the experts from the forbidden ground and the Saint Academy were slightly stunned when they heard this. Their faces were filled with astonishment and shock!<br/><br/>“This? ? Did I hear it wrong?”<br/><br/>“What did he say? Exterminate the entire family of the forbidden ground of the extermination dimension? Hiss? This? This? This Wang Xian, where did his courage and confidence come from? Isn’t this sentence too arrogant?”<br/><br/>(‘I don’t know. Is he crazy?”? He wants to wipe out the entire family of the forbidden space? Without an existence at the level of the Heaven’s origin manifestation, which faction would dare to say that they could wipe out the entire family of the forbidden space? Without an expert at the Heaven’s origin manifestation level, even if it was the undeserved forbidden ground and flowing water forbidden ground, it would be impossible to wipe out the entire family of the forbidden space!”<br/><br/>When all the powerful disciples in the surroundings heard this sentence, their mouths gaped slightly. Their faces were filled with shock!<br/><br/>When the powerful disciples in the forbidden space heard this, they were also slightly stunned!<br/><br/>“Hahaha, you want to destroy my entire sect in the forbidden space? Hahaha, this is the funniest joke I’ve heard since I was born. Hahaha, are you trying to kill me with laughter?”<br/><br/>On the side, the first generation holy son of the forbidden space laughed maniacally.<br/><br/>He seemed to have heard the biggest joke!<br/><br/>He was a master of the forbidden space, and his seniors were all top-tier masters.<br/><br/>In fact, his great-grandfather was a master at the peak of the universe ruler realm.<br/><br/>One of the peak of the universe ruler realm in the forbidden space!<br/><br/>In the entire sword and magic universe, there were only two people who dared to say that they could destroy their forbidden space!<br/><br/>Only those two existed!<br/><br/>The others didn’t have the qualifications to compete with the forbidden space!<br/><br/>Now, there was one person who said that he wanted to destroy their entire forbidden space?<br/><br/>To him, this was simply a huge joke!<br/><br/>“Hehe! ”<br/><br/>In the surroundings, the other group of powerful disciples from the forbidden space also laughed coldly!<br/><br/>“Hehe, is what my boss said very funny?”<br/><br/>At this moment, when Lin Niu heard Xu Jingshen’s words, the one-eyed man looked at him and asked with a sneer!<br/><br/>“If you want to laugh to death, then laugh to death.”<br/><br/>As Lin Niu said that, the one-eyed man’s eyes flickered!<br/><br/>“Hahaha!”<br/><br/>“Hahaha!”<br/><br/>In the next moment, Xu Jingshen opened his mouth and laughed wildly!<br/><br/>However, what made everyone terrified was that as he laughed, his body gradually collapsed!<br/><br/>Although he laughed loudly, his eyes and face were filled with terror and despair!<br/><br/>His body was trembling violently!<br/><br/>“That magical beast is actually speaking?”<br/><br/>“Look, virtual shock god, his… His body is collapsing, what’s wrong with him<br/><br/>Lin Niu suddenly spoke, virtual shock God suddenly laughed maniacally and his body began to collapse!<br/><br/>This terrifying scene caused everyone to reveal shocked expressions!<br/><br/>The magical beast was actually able to speak?<br/><br/>Without anyone being able to sense it, Void Fright God’s body suddenly started to crumble!<br/><br/>This? ?<br/><br/>“Courting death, kill them! ”<br/><br/>When the experts of the forbidden space saw this scene, their expressions changed drastically!<br/><br/>The leader of the group, A Level 9 universe ruler expert, waved his arm. The space domain he had just condensed directly attacked Lin Niu!<br/><br/>“You Reckless Thing! ”<br/><br/>Lin Niu looked over. The scales on his body were flashing with special symbols!<br/><br/>Those symbols disappeared in an instant!<br/><br/>At the scene, all the powerful disciples did not see how the symbols disappeared!<br/><br/>Even the surrounding experts at the peak of the Universe Dominator realm.<br/><br/>Lin Niu’s strength was equivalent to Wang Xian who had not broken through before.<br/><br/>At that time, Wang Xian was an expert at the Universe Dominator realm. He could easily kill him.<br/><br/>Naturally, Lin Niu could kill an expert at the ninth level of the Universe Dominator realm!<br/><br/>In an instant, the bodies of the six experts at the eighth and ninth level of the Universe Dominator realm, who had attacked Lin Niu, began to collapse!<br/><br/>Their faces were filled with horror. The intense pain caused them to scream in pain!<br/><br/>“No, no, no!”<br/><br/>“How is this possible?”<br/><br/>The leader of the group, A Level 9 ruler of the forbidden land, stared at the Linniu in shock and disbelief!<br/><br/>The demonic beast only had a flash of light on its body, but they could already feel an extremely violent force entering their bodies that they could not resist!<br/><br/>It was tearing their bodies apart!<br/><br/>This? ?<br/><br/>How was this possible?<br/><br/>What level was this demonic beast at?<br/><br/>“How dare you shout at my boss? Today, my boss said that he wants to destroy your forbidden space. In the entire sword and magic universe, no one can protect you! ”<br/><br/>Lin Niu stared at them and said with disdain!<br/><br/>Buzz<br/><br/>The energy in his body trembled slightly. The vitality of the six powerhouses in the forbidden space slowly dissipated!<br/><br/>Their bodies collapsed and their flesh and blood disintegrated!<br/><br/>Wang Xian flew down from the body of the unicorn ox and waved his arm in front of him!<br/><br/>He wanted to test his current strength.<br/><br/>His current means!<br/><br/>“Netherdragon’s pursuit!<br/><br/>Wang Xian had a thought and cast a skill!<br/><br/>Netherdragon’s pursuit was a kind of pursuit skill!<br/><br/>This skill could be said to be an upgraded version of the void pursuit technique of the uninitiated holy wings!<br/><br/>After killing an expert, as long as the opponent could be resurrected, he would be able to unleash the power of wind and thunder.<br/><br/>Then, he would be able to unleash the Netherdragon’s pursuit!<br/><br/>Immediately, he opened a void passageway and arrived at the place where the opponent was resurrected!<br/><br/>This skill was rather useless. Wang Xian had never used it before!<br/><br/>This was because if he wanted to pursue the opponent, he would definitely have to enter the opponent’s lair!<br/><br/>This was extremely dangerous for him!<br/><br/>However, now that his strength had increased, he had no qualms about pursuing the enemy’s lair in the forbidden space!<br/><br/>The experts in the forbidden space wanted to kill him.<br/><br/>Furthermore, they wanted to kill Long Yinhao. Since they didn’t give him a satisfactory answer! Then, he would die!<br/><br/>“Ahhhh!”<br/><br/>The six experts in the forbidden space and the vitality of the false alarm god disappeared quickly.<br/><br/>Among the three of them, Wang Xian could clearly sense that they had the means to revive!<br/><br/>Boom<br/><br/>He grabbed forward with his arm and a black hole slowly formed in front of him!<br/><br/>The black hole was a few thousand meters in size. Through this black hole, one could vaguely see the situation inside.<br/><br/>That was the place where the powerhouses in the forbidden space were revived.<br/><br/>That was the lair of the forbidden space!<br/><br/>From there, Wang Xian could instantly reach the forbidden space!<br/><br/>“Boss, is that the lair of the Forbidden Space?”<br/><br/>From the side, Lin Niu looked at the black hole. He was also shocked by Wang Xian’s methods as he asked!<br/><br/>“Yes, the place where the few experts from the forbidden space were resurrected ! ”<br/><br/>Wang Xian replied calmly!<br/><br/>“Boss, leave it to me. It’s just a small forbidden space. I, Lin Niu, will be able to exterminate them without your help!<br/><br/>Lin Niu looked at the black hole and said loudly.<br/><br/>“Roar Roar Roar! ”<br/><br/>“Roar Roar Roar! ”<br/><br/>With a wild roar, his body instantly turned into thousands of meters in size and drilled into the black hole!\t\t\t\t\t\t</div>", "images": {}, "success": true}