{"id": 1045, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073990.html", "title": "Chapter 4047 - Chapter 4047: 4046 Heaven’S Origin Creation In Flowing Water Forbidden Ground", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4047 - Chapter 4047: 4046 Heaven’S Origin Creation In Flowing Water Forbidden Ground</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4047: 4046 Heaven’s origin creation in flowing water forbidden ground<br/><br/>Translator: 549690339<br/><br/>Wang Xian said coldly.<br/><br/>He looked at the top.<br/><br/>At the top, his dragon eyes penetrated through the layers of Demonic Beasts’Abyss!<br/><br/>He looked straight to the top!<br/><br/>He saw a woman with terrifying energy flying towards him!<br/><br/>The woman also lowered her head and looked at the bottom.<br/><br/>She seemed to have sensed Wang Xian’s gaze!<br/><br/>She sensed the energy in Wang Xian’s body!<br/><br/>Suddenly, the roar of a divine dragon could be heard around Wang Xian!<br/><br/>Following that, an unparalleled aura burst out from his body!<br/><br/>A divine dragon gathered in the sky above Wang Xian!<br/><br/>The Divine Dragon was about a million kilometers in size. It carried an invincible aura and energy as it charged straight up!<br/><br/>The moment this divine dragon appeared.<br/><br/>All the strong disciples in the surroundings felt a pressure that came from their souls!<br/><br/>They trembled a little. They were extremely shocked!<br/><br/>Boom<br/><br/>The Divine Dragon flew straight up into the sky!<br/><br/>Boom<br/><br/>Boom<br/><br/>In the next second, the terrifying abyss of demonic beasts and the thick layers of ground were penetrated by the divine dragon! The Divine Dragon continued to attack upwards!<br/><br/>Wang Xian stood there and looked up!<br/><br/>The scene of the Divine Dragon destroying the entire abyss of demonic beasts shocked everyone!<br/><br/>Everyone was terrified!<br/><br/>This kind of power was not something that a master at the peak of the universe could achieve!<br/><br/>They could only see that the divine dragon opened up a passage to the seventh level and continued to fly upwards!<br/><br/>“Weng Weng Weng Weng! ”<br/><br/>At this moment, they could feel that the entire Devil Beast Abyss seemed to be trembling!<br/><br/>They could feel that the entire Devil Beast Abyss seemed to be about to collapse at any moment!<br/><br/>Above them, there was also an extremely terrifying energy heading towards the Divine Dragon!<br/><br/>That was water attribute energy!<br/><br/>All the water attribute experts could sense it.<br/><br/>“What… What kind of attack is this? How could there be such a terrifying attack?”<br/><br/>“What Kind of demonic beast is that? Oh My God, that Wang Xian is definitely not much weaker than the Heaven’s origin creation!”<br/><br/>“There’s a water-type energy attack above us. It’s a terrifying water-type energy. It’s definitely the Heaven’s origin creation from the flowing water forbidden ground. She’s the one who launched the Attack!”<br/><br/>“This is bad. Once they really start fighting, we will definitely be annihilated! ”<br/><br/>In the surrounding area, everyone looked terrified when they saw Wang Xian’s sudden attack!<br/><br/>They felt their scalps turn numb!<br/><br/>They felt as if their souls were trembling!<br/><br/>In the face of such terrifying energy and power, even if they were the masters of the universe, they felt extremely tiny! Once a battle of this level really broke out!<br/><br/>All of them would die!<br/><br/>Boom<br/><br/>At this moment, they could feel a terrifying collision sound coming from the sky!<br/><br/>They seemed to have seen a certain layer of the abyss of Demonic Beasts. Under this terrifying energy, it disappeared without a trace!<br/><br/>They saw a blurry figure covered in water energy flying towards them!<br/><br/>Wang Xian looked at the figure and smiled!<br/><br/>This attack!<br/><br/>Wang Xian was here to test the strength of a heaven origin creator!<br/><br/>Wang Xian could feel that the opponent’s strength was not much stronger than his.<br/><br/>The attack that he launched and the aftershocks of the attack were not something that the heaven origin creator of the flowing water forbidden ground could completely deflect!<br/><br/>This also meant that the other party’s strength could not crush him!<br/><br/>“Our flowing water forbidden ground’s Heavenly Yuan Destiny Realm Lord is here!<br/><br/>“Our Lord is here! ”<br/><br/>Around them, a group of flowing water forbidden ground’s experts and disciples saw the majestic figure shrouded in water energy and immediately shouted!<br/><br/>“Greetings, Heavenly Yuan Destiny Realm Lord! ” “Greetings, Heavenly Yuan Destiny Realm Lord!”<br/><br/>They hurriedly knelt on the ground and greeted him!<br/><br/>In the surrounding area, the other experts from the holy grounds and the Saint Academy were also kneeling on the ground respectfully!<br/><br/>In the sky, a figure flew over from the gigantic passageway that Wang Xian had broken through!<br/><br/>It was as though she was the only one in the entire abyss of Demonic Beasts.<br/><br/>It was as though the entire world was under his control!<br/><br/>He was the master of the entire world!<br/><br/>The destiny of the heaven!<br/><br/>The real destiny of the heaven!<br/><br/>However, this destiny of the heaven was staring at Wang Xian with a slightly changed expression. She didn’t even spare a glance at the people around her!<br/><br/>She stared at Wang Xian’s face and sensed his aura!<br/><br/>“You are not a living being in our sword and Magic Universe! ”<br/><br/>She spoke to Wang Xian!<br/><br/>“Oh? You Can Tell?”<br/><br/>Wang Xian raised his eyebrows slightly when he heard her words. Then, he smiled and said, “That’s true. You Are the Heaven’s origin creation of the sword and Magic Universe. You should be able to sense it! ”<br/><br/>“What?”<br/><br/>However, the words of the Heaven’s origin creation of the flowing water forbidden ground shocked everyone around.<br/><br/>What?<br/><br/>This Wang Xian wasn’t a creature from their sword and Magic Universe?<br/><br/>He wasn ‘t from their universe?<br/><br/>This? ?<br/><br/>How was this possible?<br/><br/>“You have an aura that I recognize. What is the relationship between you and Lord Water God Dragon?”<br/><br/>The Heaven’s origin creator in the flowing water forbidden land opened his mouth and continued speaking! Her words stunned Wang Xian slightly.<br/><br/>The Water God Dragon!<br/><br/>This heaven origin creator from the flowing water forbidden ground actually knew their Lord Water God Dragon?<br/><br/>Wang Xian’s heart skipped a beat. He thought of the book of Forbidden Water Curses and the passage leading to this universe!<br/><br/>He understood a little!<br/><br/>“A long time ago, a great war broke out between our divine dragon clan and the insect clan. Both the Divine Dragon clan and the insect clan were annihilated. Even Our Lord Water God Dragon perished in that great war. I am merely a junior who has obtained an inheritance! ”<br/><br/>“The glory of the newly established Divine Dragon Clan. You came to your sword and Magic Universe through the passage hundreds of millions of years ago. What is your relationship with Senior Water Divine Dragon?”<br/><br/>Wang Xian did not hide anything and asked her directly!<br/><br/>“Lord Water Divine Dragon actually died?”<br/><br/>The mood of the Heaven’s origin creation in the flowing water forbidden land fluctuated. The surrounding water energy fluctuated.<br/><br/>“During the last Cataclysm War, our sword and Magic Universe met with danger. I happened to meet Lord Water God Dragon and received some pointers from her. I had some dealings with her, so I was able to break through to the Heaven’s origin creation realm!”<br/><br/>The Heaven’s origin creation in the flowing water forbidden ground spoke. He looked at Wang Xian and said, “I really didn’t expect that Lord Water God Dragon would fall. However, you inherited the Divine Dragon Clan. Your potential is very strong and terrifying! ”<br/><br/>“You are too modest. I still have a long way to go before I reach the realm of Heaven’s origin creation. ”<br/><br/>Wang Xian replied indifferently!<br/><br/>This Heaven’s origin creation in the flowing water forbidden ground actually had a relationship with senior water god Dragon. This was something that Wang Xian didn’t expect!<br/><br/>This scene was completely different from what he had expected when the sword and the Heaven’s origin creation in the Magic Universe met!\t\t\t\t\t\t</div>", "images": {}, "success": true}