{"id": 1044, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073988.html", "title": "Chapter 4046 - Chapter 4046: 4045 Spatial Bottle, Heavenly Fate Realm Expert Out! Down", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4046 - Chapter 4046: 4045 Spatial Bottle, Heavenly Fate Realm Expert Out! Down</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4046: 4045 spatial bottle, heavenly fate realm expert out! Down<br/><br/>Translator: 549690339<br/><br/>Shocked!<br/><br/>Shocked!<br/><br/>When all the disciples saw the situation in the forbidden space, their faces were filled with shock.<br/><br/>A powerful force ranked third in their universe.<br/><br/>It was actually forced by a demonic beast to flee in all directions!<br/><br/>In fact, the group of Peak Universe Masters didn’t even have the desire to resist or fight!<br/><br/>What did this mean?<br/><br/>It meant that the Forbidden Space Masters knew that they weren’t a match for this Demon Beast.<br/><br/>Not to mention, they heard that Demon Beast say that their boss wanted to kill them.<br/><br/>How powerful would their boss be?<br/><br/>Therefore, the Forbidden Space Masters didn’t even run away. Instead, they let all the disciples enter the space bottle!<br/><br/>Because they knew that even if another demon beast of this level came, they wouldn’t be able to escape.<br/><br/>They wouldn’t even be able to escape!<br/><br/>Once their aura was locked, they wouldn’t be able to escape from their pursuit in this universe!<br/><br/>That was why they hid in the space bottle!<br/><br/>As for the entire nest, all the resources and precious lands in their forbidden land could only be given up!<br/><br/>In the universe, there was no treasure ground that could defend against such a powerful attack!<br/><br/>On the eighth floor of the Demon Beast Abyss, everyone was looking at this scene in shock!<br/><br/>Such a powerful forbidden space was actually destroyed in such a short period of time!<br/><br/>All the experts were fleeing!<br/><br/>It made them feel shocked and furious!<br/><br/>They looked at that figure, their faces filled with shock.<br/><br/>Especially the surrounding group of experts and disciples from the forbidden space!<br/><br/>At this moment, their hearts were filled with panic and despair!<br/><br/>They had witnessed with their own eyes the destruction of their forbidden space!<br/><br/>They had seen with their own eyes that the experts from their forbidden space were running for their lives.<br/><br/>“Roar Roar Roar! ”<br/><br/>At this moment, Lin Niu saw that the experts from the forbidden space had actually entered a treasure bottle.<br/><br/>When he saw that the treasure bottle had disappeared, he couldn’t help but let out a furious roar!<br/><br/>“Boss, the experts from the forbidden space have entered the treasure bottle. I can sense the aura of the treasure bottle now. I will chase after them! ”<br/><br/>When Lin Niu sensed that the treasure bottle was still within his senses, he immediately looked towards the black hole and reported to Wang Xian loudly!<br/><br/>“There’s no need. Come Back! ”<br/><br/>When Wang Xian heard that, he shook his head at him!<br/><br/>With a wave of his arm, the space within the starfield fragment began to<br/><br/>shrink!<br/><br/>Following that, the starfield fragment imprisoned the spatial bottle and flew towards the location of the black hole!<br/><br/>Lin Niu sensed that the spatial bottle was flying towards him once again. He was slightly surprised! “Boss is mighty! ”<br/><br/>“Boss is invincible! ”<br/><br/>Lin Niu let out a loud roar as though he was licking a dog. He quickly flew towards the black hole!<br/><br/>When Wang Xian heard that, he smiled and thought of something.<br/><br/>Not far away from Lin Niu, the five elements grinding mill and the Tai Chi Dragon Plate started to search for treasures in the lair of the forbidden space!<br/><br/>Buzz<br/><br/>At this moment.<br/><br/>The spatial bottle passed through the black hole and flew towards Wang Xian! “Oh no, he has obtained the spatial bottle of our forbidden space!”<br/><br/>“It’s over, it’s over. How did he obtain it just now? Didn’t he teleport away?”<br/><br/>“Oh no, it’s over, our forbidden space is over! ”<br/><br/>At this moment, a group of strong disciples from the forbidden space around Wang Xian saw the spatial bottle flying towards him.<br/><br/>Despair appeared on their faces.<br/><br/>They knew that all the strong disciples from their forbidden space were hiding inside the spatial bottle.<br/><br/>Now that Wang Xian had obtained it, they were completely doomed!<br/><br/>“Grand elder of the flowing water forbidden ground, save our forbidden space! Save Our Forbidden Space! Our forbidden space is also one of the strongest people in our universe. It is also the main fighting force for the upcoming battle against the calamity. Save Our Forbidden Space! ”<br/><br/>A powerhouse of the space forbidden ground hurriedly looked at the first elder of the flowing water forbidden ground and pleaded for help with a terrified face!<br/><br/>Now, only the two lords of the flowing water forbidden ground and the undeserved forbidden ground could save their space forbidden ground!<br/><br/>That sage Wang Xian was too terrifying!<br/><br/>Too Powerful!<br/><br/>At this moment, the first elder, second elder, and the rest of the people of the flowing water forbidden ground, as well as the powerhouses of the undeserved forbidden ground and other holy grounds and the Saint Academy who were at the peak of the ruler realm!<br/><br/>They were also looking at this scene with a face full of shock and disbelief!<br/><br/>The strength of that magical beast was too terrifying!<br/><br/>There was also the saint son Wang Xian. Although he didn’t display his strength, he directly opened a black hole and connected to the space forbidden ground!<br/><br/>With a wave of his arm, the life-saving trump card of the space forbidden ground flew over.<br/><br/>Just these two moves were enough to shock them!<br/><br/>The great elder of the flowing water forbidden zone had even sent an urgent message to the master of the Forbidden Zone!<br/><br/>He also asked the Master of the Forbidden Zone to immediately contact Lord Tianyuan creation!<br/><br/>In fact, although this matter had nothing to do with them at the undeserved forbidden zone.<br/><br/>However, when an existence that seemed to be comparable to Tianyuan creation appeared, they immediately contacted the Master of the undeserved forbidden zone and asked him to contact the Tianyuan creation of the undeserved forbidden zone!<br/><br/>“Hehe, it seems that destroying a forbidden land in space is a very simple task!<br/><br/>At this moment, Wang Xian’s voice rang out!<br/><br/>At this moment, he was holding a palm-sized spatial bottle in his hand. He was sensing the entire bottle with a smile on his face!<br/><br/>He could detect that there was another dimension in the bottle!<br/><br/>He could even contact the experts in the forbidden land in the bottle.<br/><br/>However, he realized that he could not break the spatial bottle.<br/><br/>The entire spatial bottle was a very powerful treasure.<br/><br/>It was not a treasure of the Heaven’s origin but it was very unique!<br/><br/>It was indeed good for survival.<br/><br/>However, it was also very useless!<br/><br/>If it was obtained by the opponent, it would basically be a dead end!<br/><br/>This time, they were obtained by Wang Xian!<br/><br/>This also meant that the life and death of the forbidden space was already in his hands!<br/><br/>“Huff! Huff! ”<br/><br/>When the chief elder of the flowing water forbidden ground saw this scene, his breathing became a little hurried. He suppressed the shock in his heart and looked at Wang Xian.<br/><br/>Sir, the Heaven’s origin creator of our flowing water forbidden ground and the Heaven’s origin creator of the undeserved forbidden ground should be rushing over to us soon. Sir, please punish us for offending you in the forbidden space later! ”<br/><br/>He opened his mouth and lowered his head. He couldn’t help but speak up!<br/><br/>“Hehe, aren’t you guys going to tell us that the flowing water forbidden ground doesn’t want to get involved in the matters of the Void Dragon Forbidden Ground and the Space Forbidden Ground? Why? Does Your Heaven’s origin creation want to get involved now?”<br/><br/>Wang Xian looked at the great elder of the flowing water forbidden ground, the corner of his mouth curled up slightly. “Alright, let’s do it. Next, I want the Heaven’s origin creation from the flowing water forbidden ground to give me an explanation. If Pm not satisfied, Hehe, unless his strength can suppress<br/><br/>He smiled as he spoke. His gaze suddenly turned to the area above him as his dragon eyes narrowed slightly!<br/><br/>“If she can easily suppress me, then everything will be over. If not, someone in your flowing water forbidden ground will die! ” He coldly shouted as he stared at the area above him!\t\t\t\t\t\t</div>", "images": {}, "success": true}