{"id": 1042, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073984.html", "title": "Chapter 4044 - Chapter 4044: 4043 Space Destruction Forbidden Ground", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4044 - Chapter 4044: 4043 Space Destruction Forbidden Ground</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4044: 4043 space destruction forbidden ground<br/><br/>Translator: 549690339<br/><br/>“This…<br/><br/>In the surrounding area, all the experts from the sacred land and Sacred Academy were listening to their conversation!<br/><br/>Looking at this scene, their faces were filled with shock!<br/><br/>In fact, many experts couldn’t help but swallow a mouthful of saliva as they stared in shock.<br/><br/>Just who was this person! !<br/><br/>Sir, please tell me that you will know when you meet a heaven-origin creation-level expert. What does he mean by that?”<br/><br/>“I don’t know. What exactly is he? Why was there no such person in the sword and Magic Universe?”<br/><br/>“That sage Wang Xian seems to be just one of his clones. No wonder that sage Wang Xian is so terrifying. However, why did he allow his clone to cultivate the power of space? How did he do it?”<br/><br/>“Look at the black hole. There’s a huge battle happening there! ”<br/><br/>In the surrounding area, all the strong disciples were discussing telepathically. Their faces were filled with astonishment.<br/><br/>At this moment, they looked at the black hole!<br/><br/>From the black hole, they could vaguely see the situation in the forbidden space!<br/><br/>There, the huge battle had already erupted!<br/><br/>They could see that an extremely terrifying demonic beast was wreaking havoc in the forbidden space!<br/><br/>The Demonic Beast’s entire body was emitting a monstrous aura.<br/><br/>The scales on its body flickered with special symbols!<br/><br/>Around the demonic beast, a large number of experts within the forbidden space surrounded it and stared at it with wary expressions!<br/><br/>“Roar Roar Roar! “<br/><br/>The scales on the body of the Lin Niu let out a low roar as they exploded with terrifying power and directly attacked the surroundings!<br/><br/>“Defend! ”<br/><br/>The expressions of the forbidden area masters and the forefathers of the forbidden area changed drastically when they saw this scene.<br/><br/>They immediately roared loudly!<br/><br/>“How did our forbidden area provoke you? Why did you come to exterminate our forbidden area! ”<br/><br/>A forefather at the pinnacle universe ruler realm of the forbidden area felt the terrifying aura coming from Lin Niu’s body, and his expression changed drastically. He couldn’t help but roar loudly!<br/><br/>“The experts and disciples of your forbidden space are courting death. My boss wants to exterminate you, and no one can save you! ”<br/><br/>Lin Niu stared at them, and his entire body was filled with a berserk aura!<br/><br/>As he spoke, symbols condensed into various berserk demon beasts, and they attacked the surroundings in all directions! Space Magic Array, activate! ” “Mountain Protection Array, activate! ”<br/><br/>Voices sounded one after another!<br/><br/>At the base of the forbidden space, all the powerful disciples in the forbidden space had ugly expressions as they floated in the air.<br/><br/>They looked at the raging Lin Niu with some fear!<br/><br/>Their forbidden space had four peak universe masters.<br/><br/>In the past, they thought that they were the strongest existences below the Heavenly Yuan creation realm.<br/><br/>However, the magical beast that suddenly charged over today spoke human language.<br/><br/>It made them feel terrified.<br/><br/>They could clearly sense that the terrifying energy contained within this magical beast could destroy them all!<br/><br/>How was this possible?<br/><br/>Furthermore, the words of this magical beast also made them feel terrified!<br/><br/>His boss wanted to destroy their forbidden space?<br/><br/>This made all the experts of the forbidden space look towards the black hole!<br/><br/>There might be an even more powerful existence there!<br/><br/>Could this existence be a heavenly yuan creation?<br/><br/>How did their forbidden space provoke such a terrifying existence?<br/><br/>All the experts and disciples of the Forbidden Space felt fear in their hearts!<br/><br/>The mountain protection array and all the array formations in their lairs were activated!<br/><br/>Hong! Hong! Hong! Hong<br/><br/>Hong! Hong! Hong<br/><br/>A terrifying explosion sounded.<br/><br/>Lin Niu’s attack landed on their array, causing their mountain protection array to tremble violently!<br/><br/>The energy dissipated rapidly.<br/><br/>Their mountain protection array would not be able to hold on for long!<br/><br/>“Attack!”<br/><br/>Space Forbidden Land Master roared furiously. He wielded a huge sword and slashed at Lin Niu!<br/><br/>The other three Pinnacle Universe Masters also started to counterattack!<br/><br/>Lin Niu roared, and his horn shone with light!<br/><br/>The horn shot up into the sky as if it had broken through the sky!<br/><br/>He lowered his head slightly, and the terrifying energy from the horn went toward the space sword! “Hong! Hong! Hong! Hong!”<br/><br/>“Hong Hong Hong! ”<br/><br/>The horn swept out, and the terrifying darkness, earth, and metal elements gathered together.<br/><br/>The three elements gathered together in a mess!<br/><br/>The horn swept out in all directions!<br/><br/>The terrifying sound of collision rang out once again!<br/><br/>The attacks of the four Pinnacle Universe Masters of the space forbidden land slowly crumbled under the collision.<br/><br/>But the attack of the Lin Niu didn’t dissipate!<br/><br/>“How is this possible? What level of Demon Beast Is This?”<br/><br/>An ancestor of the forbidden space roared in a low voice, his face filled with shock!<br/><br/>Roar!<br/><br/>Lin Niu stared at them, and his entire body went berserk once again!<br/><br/>The scales on his body began to emit a blood-red aura.<br/><br/>It began to change!<br/><br/>His entire body was covered in blood-red scales, and his entire body was like a terrifying war machine!<br/><br/>Lin Niu charged directly toward a peak universe ruler realm space forbidden ancestor!<br/><br/>That Horn was flowing with light!<br/><br/>“Defend! ”<br/><br/>When the experts of the space forbidden ground saw this, they immediately roared and began to defend!<br/><br/>“Hong Hong! ”<br/><br/>However, facing Lin Niii’s attack, all the energy that landed on it couldn’t stop his body at all!<br/><br/>Lin Niu’s enormous body charged toward the mountain protection array of the forbidden space!<br/><br/>His horn directly broke the array.<br/><br/>His body pressed toward the inside!<br/><br/>“Forbidden Area Master, the array is about to break! ”<br/><br/>A terrified voice sounded.<br/><br/>Especially the powerful beings below level eight of Space Forbidden Area Universe Masters.<br/><br/>Without the protection of the array, just the aftershock of Lin Niu’s attack could kill them!<br/><br/>This battle was not something they could participate in!<br/><br/>“This demonic beast is too terrifying. Our forbidden space is no match for it. ”<br/><br/>The master of the forbidden space trembled. His expression was extremely grave and his breathing was somewhat hurried. His eyes were blood red. “All the powerful disciples of the forbidden space, enter the spatial bottle. Quick, Quick! ”<br/><br/>Roar!<br/><br/>In that instant, Lin Niu had broken through their mountain protection array!<br/><br/>The symbols on the scales turned into all kinds of demonic beasts, mountains, blades, and Swords. They wreaked havoc in the surroundings!<br/><br/>“Ahhhh!”<br/><br/>“Ahhhh!”<br/><br/>Some of the disciples who were close to the Master of the forbidden space did not even have time to react before they were crushed and killed by the terrifying attack!<br/><br/>Lin Niu’s gaze locked onto the master of the forbidden space and he instantly charged towards him!<br/><br/>“Master of the forbidden space, quickly escape. Let’s all enter the spatial bottle and ask for help from the Heavenly Yuan Creator! ”<br/><br/>An ancestor of the forbidden space shouted loudly when he saw Lin Niu locking onto their master!\t\t\t\t\t\t</div>", "images": {}, "success": true}