{"id": 1043, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15073986.html", "title": "Chapter 4045 - Chapter 4045: 4044 Spatial Bottle, Heavenly Yuan Creation Realm Expert! Go", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4045 - Chapter 4045: 4044 Spatial Bottle, Heavenly Yuan Creation Realm Expert! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4045: 4044 spatial bottle, Heavenly Yuan creation realm expert! Go<br/><br/>The Forbidden Land’s master saw Lin Niu attacking him!<br/><br/>His heart shook violently, and he roared loudly as well!<br/><br/>Run!<br/><br/>He had to run!<br/><br/>Otherwise, he would die here!<br/><br/>Their forbidden land had a spatial bottle that could protect their lives!<br/><br/>However, entering the treasure bottle was something they would only use when they were in a desperate situation.<br/><br/>They would only use it when they were facing a terrifying enemy like the Heaven’s origin creation!<br/><br/>Furthermore, this treasure bottle had a huge drawback!<br/><br/>Once they entered, they wouldn’t be able to sense the situation outside.<br/><br/>Furthermore, once the treasure bottle was obtained by the enemy, they would only be waiting for death!<br/><br/>However, this treasure bottle had a powerful point. As long as they entered it, even if it was the heavenly yuan fortune, it would be very difficult to break it!<br/><br/>Unless they were in a desperate situation, they would definitely not enter the forbidden space to hide.<br/><br/>However, they had also made some arrangements for this treasure bottle!<br/><br/>As long as they entered the treasure bottle, the treasure bottle would be instantly transported to an extremely remote and hidden place! At that time, they could quickly exit the bottle and escape!<br/><br/>Of course, there was a certain amount of risk.<br/><br/>“All the powerful disciples of the Forbidden Space Zone, quickly enter. We’ll hold them off here! ”<br/><br/>The ancestors of the Forbidden Space Zone roared fiercely!<br/><br/>The three ancestors waved the spatial swords in their hands, and terrifying spatial power tore through the long void.<br/><br/>It slashed towards Lin Niu!<br/><br/>Lin Niu’s entire body was glowing. He didn’t Dodge at all and continued to attack the spatial forbidden land’s master.<br/><br/>His speed was extremely terrifying!<br/><br/>Under the powerful energy disturbance and undulations, the spatial forbidden land’s master couldn’t teleport away!<br/><br/>He couldn’t teleport. Facing Lin Niu, his speed was much slower!<br/><br/>“Heavenly Reflection Sword! ”<br/><br/>The Spatial Forbidden Land Master roared. The huge sword in his hand floated in front of him, forming a terrifying defense!<br/><br/>But at this moment, Lin Niu charged over!<br/><br/>The huge sword was sent flying and landed on the spatial forbidden land master’s body!<br/><br/>The spatial forbidden land master spat out a large amount of blood, and his face instantly turned extremely pale!<br/><br/>Half of his body dissipated under this collision.<br/><br/>Under the circulation of energy, it condensed once again!<br/><br/>Lin Niu’s strength wasn’t something they could contend against.<br/><br/>Although they were very strong, spatial attribute experts, Lin Niu was after all an existence born from the blood-stained limbs of the Heavenly Yuan creation.<br/><br/>Once it came into contact with the Heavenly Yuan creation, it wasn’t something they could compare to!<br/><br/>“Peng, Peng, Peng! ”<br/><br/>The spatial forbidden land master was heavily injured by Lin Niu, but at this moment.<br/><br/>The other three patriarchs ‘attacks also landed on Lin Niu’s body.<br/><br/>It made his body freeze!<br/><br/>“Boom Boom Boom!”<br/><br/>Using this short period of time, the Spatial Forbidden Land Master hurriedly teleported and escaped!<br/><br/>“Roar, Roar!”<br/><br/>Lin Niu let out a low roar, and the violent energy on his body swept out in the surroundings!<br/><br/>“No, no, no!”<br/><br/>Some of the experts from the forbidden space who didn’t have the time to escape let out desperate roars!<br/><br/>The three patriarchs from the forbidden space managed to resist Lin Niu’s attack with great difficulty. Their figures moved, and they instantly teleported toward the spatial bottle!<br/><br/>They didn’t hesitate at all, and directly entered the interior of the bottle!<br/><br/>In the short ten minutes since Lin Niu arrived, a large number of buildings in the forbidden space had been turned into ruins.<br/><br/>All the powerful disciples had escaped into the treasure bottle!<br/><br/>However, there were still hundreds of thousands of corpses of the powerful disciples in the forbidden space.<br/><br/>The number of powerful disciples in the forbidden space was very small, and added together, there were less than a million of them! In a short period of time, at least one-third of them had died!<br/><br/>It was a battle of a completely different level.<br/><br/>They were completely unable to contend against the Lin Niu!<br/><br/>“Roar Roar!”<br/><br/>When the Lin Niu saw them fleeing in an instant, his mind sensed something.<br/><br/>He opened his mouth and directly spat out a violent energy flame!<br/><br/>“Boom Boom Boom! ”<br/><br/>The energy swept out and all the buildings instantly turned into nothingness!<br/><br/>Even a large area of the ground had disappeared!<br/><br/>At the position below, a treasure bottle was perfectly undamaged in the middle!<br/><br/>Above the treasure bottle, the power of space was flickering!<br/><br/>“Eh? Are you trying to escape?”<br/><br/>At the same time, they were on the eighth floor of the abyss of Demonic Beasts.<br/><br/>In the courtyard, Wang Xian looked at the battle that was happening in the black hole. He raised his eyebrows slightly!<br/><br/>The group of experts from the forbidden space actually wanted to escape without putting up much resistance?<br/><br/>Even the tai chi dragon plate and the five elements grinding mill had yet to launch their attacks.<br/><br/>They were going to escape immediately!<br/><br/>Wang Xian thought that this forbidden space would have a very strong trump card!<br/><br/>From the looks of it, it was only so-so!<br/><br/>It was a wise choice for them to escape, but Wang Xian could not let them leave!<br/><br/>Wang Xian mumbled. With a wave of his arm, the fragment of the Starfield entered the black hole instantly and came to the sky above the forbidden space!<br/><br/>Starfield blockade! ”<br/><br/>With a wave of Wang Xian’s arm, a surge of energy entered the starfield fragment.<br/><br/>Starfield seal was activated!<br/><br/>At that time, when the starfield fragment was in the hands of the experts from the belief universe, Wang Xian was sealed by them with the Starfield for a very, very long time!<br/><br/>The fragment of Heaven’s fate, the Starfield Seal, instantly enveloped a domain!<br/><br/>At the center of the forbidden space, the space bottle trembled for a moment and slowly began to disappear!<br/><br/>Buzz<br/><br/>In the next instant, the space bottle disappeared and performed a long-term teleportation!<br/><br/>However, in the second that the space bottle was teleported, an invisible and powerful energy enveloped it.<br/><br/>It caused the teleportation to fail.<br/><br/>It didn’t teleport to a fixed location. Instead, it was teleported to the edge of the starfield fragment.<br/><br/>This place was within the Starfield Fragment’s coverage!<br/><br/>It was also within Wang Xian’s senses!<br/><br/>Now, he could completely control the power of the entire starfield fragment! With a thought, he could sense the location of the treasure bottle and control<br/><br/>“This… this… the entire forbidden space is not a match for that demonic beast at all. It’s actually trying to escape! ”<br/><br/>“Hiss… the three ancestors of the forbidden space, the Master of the forbidden space, and the other four Pinnacle Universe Masters are not a match for that Demon Beast at all. Just how strong is this Demon Beast?”? “Now, the entire forbidden space is actually fleeing! ”<br/><br/>“Just now, under the protection of the great array, hundreds of thousands of great disciples of the forbidden space were instantly killed. If the battle continues, the entire forbidden space will be annihilated! ”<br/><br/>“This Demon Beast’s power is too terrifying. The battle only lasted for a dozen minutes, but the entire forbidden space zone is already on the verge of collapsing. It’s too powerful! ”<br/><br/>“This is simply inconceivable. A peak-stage space-elemental universe ruler….<br/><br/>why does it feel like there’s such a huge gap between him and that Demon Beast?”\t\t\t\t\t\t</div>", "images": {}, "success": true}