{"id": 1059, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074018.html", "title": "Chapter 4061 - Chapter 4061: 4060 Change In The Nine-Origin Universe", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4061 - Chapter 4061: 4060 Change In The Nine-Origin Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4061: 4060 change in the nine-origin universe<br/><br/>Translator: 549690339<br/><br/>“HMM? The Unicorn Ox has broken through. ”<br/><br/>At the same time, in a certain area of the flowing water forbidden ground.<br/><br/>Wang Xian, Long Yin, yin long, Hao, and the flowing moon Saintess were located in a certain area of the flowing water forbidden ground.<br/><br/>Wang Xian saw the terrifying aura coming from the right.<br/><br/>When he heard the Unicorn Ox’s voice, he smiled.<br/><br/>When the Unicorn Ox was about to break through, he had already informed Wang Xian in advance.<br/><br/>Wang Xian had not left this place recently. He had been waiting here all this while.<br/><br/>“Brother Lin Niu has broken through?”<br/><br/>Long Yinhao’s eyes shone when he saw this vast power. He asked with slight excitement.<br/><br/>Lin Niu was his brother-in-law’s mount.<br/><br/>Lin Niu’s breakthrough could greatly increase Wang Xian’s strength.<br/><br/>The stronger Wang Xian was, the more powerful his backer would be.<br/><br/>Now in the Sword and Magic Universe, which Saint Son or Saintess wouldn’t be polite to him.<br/><br/>Not to mention saint son or saintess, even an expert at the peak of the Dominator realm would be polite to him.<br/><br/>After all, he was now the strongest second generation of the rich in the sword and Magic Universe.<br/><br/>“Let’s Go! ”<br/><br/>Wang Xian nodded with a smile. With a wave of his arm, he led them to the Linniu’s location.<br/><br/>“The Dragon King’s mount has broken through to the Heaven’s origin blessed realm! ”<br/><br/>“Hiss, this is really shocking. Even the Dragon King’s mount has reached such a terrifying level. ”<br/><br/>“I didn’t expect that I would be able to witness the breakthrough of the Heaven’s origin blessed realm in my lifetime. This is really shocking. This power is too terrifying. ”<br/><br/>“Let’s go, Lord Dragon King and our flowing water forbidden land’s long yinyin are lovers. They are very close to our flowing water forbidden land. Let’s go over and congratulate them! ”<br/><br/>At the flowing water forbidden land, all the strong disciples immediately rushed over, their faces filled with reverence and respect!<br/><br/>It was the heavenly fate.<br/><br/>There were only two existences of this level in their entire universe.<br/><br/>Furthermore, they were all born during the last calamity.<br/><br/>After the end of the calamity, there was no Third Heaven’s origin creation powerhouse in their entire universe.<br/><br/>One could imagine how difficult it was to give birth to an existence at the Heaven’s origin creation level.<br/><br/>When Wang Xian flew over, Liu Lan had already arrived.<br/><br/>Hopeless Heaven was also rushing over quickly.<br/><br/>In the middle.<br/><br/>The Unicorn Ox was floating there.<br/><br/>In the middle of all the energy.<br/><br/>At this moment, the scales all over his body were displaying divine ash!<br/><br/>There were symbols on them.<br/><br/>A pair of wings had appeared on his original body.<br/><br/>This pair of wings was somewhat similar to the wings of the Asgardian demon god. It looked very domineering.<br/><br/>A pair of heavy pupils had appeared in the Unicorn Ox’s pupils.<br/><br/>There seemed to be countless pupils in his pupils. They were deep and terrifying.<br/><br/>“Congratulations, you have achieved a breakthrough! ” Shui Lan looked at Lin Niu and congratulated him with a smile.<br/><br/>“Thank you! ”<br/><br/>Lin Niu nodded his head happily. He looked at Wang Xian and flew over excitedly. “Boss, I have achieved a breakthrough. I will be your mount in the future. Haha, a mount of the Tianyuan destiny level. It will definitely be awe-inspiring! ”<br/><br/>As he spoke, he had a proud expression on his face.<br/><br/>“Hehe, good, good! ”<br/><br/>Wang Xian smiled.<br/><br/>Lin Niu was someone who knew how to be grateful.<br/><br/>If it weren’t for him this time, it would be impossible for Lin Niu to achieve a breakthrough.<br/><br/>“Congratulations, brother Wang Xian, Congratulations, brother Lin Niu! ”<br/><br/>“You’ve achieved a breakthrough to the Heaven’s fate level. From now on, you’ll have an endless lifespan.”<br/><br/>At this moment, Hopeless Heaven flew over and congratulated him with a smile.<br/><br/>“Congratulations, Lord Linniu!”<br/><br/>“Congratulations, Lord Linniu! ”<br/><br/>Around them, a large number of strong disciples from the flowing water forbidden ground flew over and knelt down respectfully.<br/><br/>A strong cultivator at the Heaven’s origin destiny realm was worthy of their respect!<br/><br/>“Hahaha, there’s no need to stand on ceremony, there’s no need to stand on ceremony! ”<br/><br/>Lin Niu laughed out loud. He waved his arm and made everyone stand up.<br/><br/>“Lin Niu, since you have made a breakthrough in the sword and magic universe, all disciples of the sword and Magic Universe can come and listen to the sermon today for 100,000 years.”<br/><br/>Wang Xian instructed Lin Niu with a smile.<br/><br/>“No problem, boss.”<br/><br/>Lin Niu immediately smiled and nodded his head.<br/><br/>“Then, we represent the disciples of the sword and Magic Universe to thank brother Lin Niu and brother Wang Xian! ”<br/><br/>Hopeless Heaven immediately cupped his hands and thanked Wang Xian and Linniu.<br/><br/>It was a great fortune for the strong disciples of the sword and Magic Universe to preach the Dao.<br/><br/>It was extremely difficult to break through to the Heaven’s destiny.<br/><br/>Hopeless Heaven was the Heaven’s destiny, but his understanding of cultivation was completely different from Liu Lan’s understanding of cultivation.<br/><br/>In particular, there was only one path to Heavenly Yuan creation, and it could not be replicated.<br/><br/>If the water element had heavenly yuan creation, then the other elements would not have it.<br/><br/>Every Heavenly Yuan creation had a different understanding of breakthrough and cultivation.<br/><br/>The power of creation they grasped was different.<br/><br/>Lin Niu’s sermon was useful to Liu Lan and hopeless sky to a certain extent.<br/><br/>After all, they were all experts of the same realm.<br/><br/>They still needed to verify each other in their cultivation.<br/><br/>“You’re welcome. Lin Niu can be considered a living being in the sword and Magic Universe! ”<br/><br/>Wang Xian shook his head.<br/><br/>He was lucky to be able to subdue Lin Niu!<br/><br/>“A thousand years later, I, Lin Niu, will be giving a sermon for 100,000 years to repay the Sword and Magic Universe. Any living being can come and listen to my sermon. ”<br/><br/>Lin Niu said loudly. “Thank you, Lord Lin Niu! ”<br/><br/>“Thank you, Lord Lin Niu!”<br/><br/>In the surrounding area, all the powerful disciples were filled with excitement as they hurriedly replied loudly.<br/><br/>The heavenly fate preaching the Dao for a hundred thousand years was a good opportunity.<br/><br/>Liu Lan and the Hopeless Heaven, the two heavenly fate, had only preached the dao four times in the past twenty billion years. Every time, it was a feast for all living beings.<br/><br/>It was an opportunity.<br/><br/>Many powerhouses had a breakthrough because of this.<br/><br/>A brand new attribute of the Heaven’s origin was lecturing them. This was an opportunity for many powerful disciples.<br/><br/>Wang Xian smiled at the side.<br/><br/>“Hehe, Dragon King, senior Wang Xian, come and sit with me. Let’s drink some fine wine. I have brewed quite a lot recently. ”<br/><br/>Liu Lan invited with a smile.<br/><br/>Wang Xian and the rest nodded with a smile.<br/><br/>In the following period of time, the news of Lin Niu’s breakthrough spread throughout the entire sword and magic universe.<br/><br/>The news of the sermon also spread throughout the universe.<br/><br/>Countless powerful disciples rushed over.<br/><br/>Due to the orders given by the undeserved forbidden ground and flowing water forbidden ground, the two great fortunes of the Heaven Origin emphasized once again.<br/><br/>Now, no faction dared to make a sound about the massacre.<br/><br/>Hence, this also resulted in a grand event in the sword and Magic Universe.<br/><br/>It was a prosperous one.<br/><br/>Countless creatures came to Lin Niii’s sermon.<br/><br/>Wang Xian was also watching from the side.<br/><br/>He was prepared to return to the nine-origin universe after Lin Niu’s sermon. He would bring Lin Niu along with him to the starry universe.<br/><br/>Regardless of whether it was searching for resources or other things, it was time for Wang Xian to return and take a look.<br/><br/>When the time came, he would let the body of the Void Dragon continue to cultivate here..\t\t\t\t\t\t</div>", "images": {}, "success": true}