{"id": 1050, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074000.html", "title": "Chapter 4052 - Chapter 4052: 4051 Joined Forces", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4052 - Chapter 4052: 4051 Joined Forces</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4052: 4051 joined forces<br/><br/>Translator: 549690339<br/><br/>“Liu Lan, we can not let him escape! ”<br/><br/>Hopeless sky stared at agar, his expression extremely ugly!<br/><br/>He transmitted his voice to Liu Lan!<br/><br/>We can not let Agar leave this demonic beast abyss!<br/><br/>Otherwise, once he leaves this place, the entire sword and magic universe will not be able to withstand his torment!<br/><br/>He could fly to any city in the sky above a magic kingdom. With a wave of his arm, he could destroy a magic kingdom!<br/><br/>It was easier to deal with the abyss of Magic Beasts!<br/><br/>There were no human beings to survive!<br/><br/>He had to trap them here!<br/><br/>“Alright, all disciples, leave the abyss of Magic Beasts immediately! ”<br/><br/>Liu Lan roared and moved. She raised the magic staff in her hand and directly attacked the Asgardian demon god!<br/><br/>“Hehehe, you want to trap me here? Then Pll play with you here.”<br/><br/>Agar saw Liu Lan attacking him and laughed maniacally. “Let me see if your strength has improved over the years! ”<br/><br/>Roar!<br/><br/>He roared.<br/><br/>“Roar!”<br/><br/>“Roar! Roar! ”<br/><br/>From the ninth floor of the Demonic Beast Abyss, the roars of demonic beasts could be heard!<br/><br/>The Demon Beasts were staring at the experts of the sacred lands and sacred academies.<br/><br/>Their blood-red eyes were attacking them!<br/><br/>The demon beasts were giving off terrifying auras.<br/><br/>There were only a thousand of them, and they were few in number. However, none of them were weaker than Level 8 universe masters. Among them, there were 20 to 30 peak universe masters!<br/><br/>“Hehehe, come on, come on! ”<br/><br/>The Asgardian demon God laughed maniacally and roared loudly!<br/><br/>He glanced at the Lin Niu and said with a cold expression, “Lin Niu, you better listen to my orders now and kill all these humans. Otherwise, I will devour you completely! ”<br/><br/>After the Asgardian demon god finished speaking, he went up to meet the two Heaven Origin Destinies, Hopeless Sky and Liu Lan.<br/><br/>Earlier, when he was making his breakthrough, he didn’t sense Wang Xian’s strength!<br/><br/>He didn’t sense what was happening here.<br/><br/>Now that his strength had made a breakthrough, he no longer placed Lin Niu in his eyes!<br/><br/>If he wanted to kill Lin Niu, it would be an easy task!<br/><br/>Therefore, with a warning, he attacked the two Heaven’s origin destinies in the Sword and Magic Universe!<br/><br/>Only hopeless sky and Liu Lan were worthy of his attention!<br/><br/>“Leave this place!”<br/><br/>Hopeless Sky roared and charged towards agar!<br/><br/>As for the group of Demonic Beasts, they had no time to attack!<br/><br/>Once they attacked the group of demonic beasts, they were worried that agar would leave this place.<br/><br/>Once he left this place, there would be big trouble!<br/><br/>Hopeless Sky and Liu Lan charged towards agar. They flew into the sky and engaged in a battle.<br/><br/>Every move they made was exuding a destructive might!<br/><br/>“Roar Roar Roar! ”<br/><br/>A group of demonic beasts charged towards them from below.<br/><br/>“Run, quickly run! ”<br/><br/>The expressions of the disciples from the unfettered forbidden ground and flowing water forbidden ground changed drastically when they saw the thousands of demonic beasts. They also roared loudly.<br/><br/>The strength of these demon beasts was not something they could withstand!<br/><br/>There were only a dozen pinnacle universe rulers here!<br/><br/>And among the demon beasts, there were a total of 20 to 30 pinnacle universe rulers.<br/><br/>The difference was too great!<br/><br/>“Stop them! ”<br/><br/>“Eat them. We can’t let them escape! ”<br/><br/>However, a shocking scene appeared!<br/><br/>The thousands of demonic beasts suddenly let out violent sounds.<br/><br/>They simultaneously released terrifying long-range attacks.<br/><br/>They wanted to stop them from escaping.<br/><br/>On the eighth floor of the Demonic Beast Abyss, the teleportation arrays hadn’t been completely established.<br/><br/>There were only five teleportation arrays.<br/><br/>However, there were millions of strong disciples around.<br/><br/>These five teleportation arrays weren’t enough!<br/><br/>They could only fly to the seventh floor, where there were many teleportation arrays!<br/><br/>However, these demonic beasts obviously didn’t want them to leave!<br/><br/>They wanted to destroy them!<br/><br/>“How can these demonic beasts… how can they speak human language? They have powerful intelligence! ”<br/><br/>“They actually have intelligence. Oh No, they want to leave us here! ” “They have many more experts than us, quickly escape!”<br/><br/>“First block their attacks, or else a large number of experts will be killed.<br/><br/>Quick, quickly block them! ”<br/><br/>Shocked and angry voices came from the peak ruler realm experts.<br/><br/>These thousands of magical beasts suddenly possessed intelligence.<br/><br/>This caused them to feel extremely shocked!<br/><br/>Having intelligence and not having it were two completely different levels!<br/><br/>When they saw the attacks of the demonic beasts, they could only defend themselves!<br/><br/>Boom! Boom! Boom<br/><br/>Over a million masters at the level of the Masters of the universe launched their attacks and met the attacks of over a thousand demonic beasts!<br/><br/>“If Liu Lan and hopeless sky are unable to finish off this agar heavenly demon god, the disaster of the sword and Magic Universe will descend! ”<br/><br/>At this moment, Wang Xian was floating there and watching the battle in the sky!<br/><br/>His gaze swept to the position below!<br/><br/>He opened his mouth and spoke.<br/><br/>Just like in the beginning, the reason why Wang Xian dared not to give face to the two heaven origin creation level powerhouses was because he knew that the two heaven origin creation level powerhouses did not dare to shed all pretense of cordiality with him here!<br/><br/>This was because once they really fought together, they could not leave Wang Xian here completely.<br/><br/>This would be a disaster for the sword and Magic Universe!<br/><br/>The destructive power of a heaven’s origin creator was extremely terrifying!<br/><br/>Now, this Asgardian devil God clearly believed that he wouldn’t be suppressed by Liu Lan and Wang Xian.<br/><br/>He was confident that he could escape, which was why he dared to be so unbridled!<br/><br/>If Wang Xian and Liu Lan didn’t have any trump cards to hold him back, it would be a disaster for the sword and Magic Universe!<br/><br/>It would be extremely tragic!<br/><br/>“Brother Wang Xian, can you… Can You… ”<br/><br/>From the side, Long Yinyin saw the sudden outbreak of the battle and the appearance of an enemy from the Heaven’s origin realm. His face was extremely pale!<br/><br/>He looked at Wang Xian and opened his mouth, wanting to seek his help!<br/><br/>“Wang Xian… can you help us? ! ”<br/><br/>Not far away, Saint Wuman stared at the group of demonic beasts with reddened eyes. He clenched his fists tightly and looked at Wang Xian as well. He couldn’t help but shout out loud!<br/><br/>Long Yinhao and the flowing moon Saintess were also looking at him!<br/><br/>Among them, there were some masters of the universe in the dragon roar forbidden ground who were also looking at Wang Xian.<br/><br/>They knew that the current situation would be greatly alleviated if Wang Xian was willing to make a move!<br/><br/>Otherwise, just the millions of masters of the universe might die at the hands of these demonic beasts!<br/><br/>As for the Asgard Celestial Demon, they had no way of estimating it!<br/><br/>Wang Xian saw their gazes and took a look at the battle above him. His eyes flickered slightly!<br/><br/>“Liu Lan, Hopeless Heaven, I will help you guys destroy this Asgard Celestial Demon. I want his corpse. ”<br/><br/>Wang Xian felt their combat strength and destructive power and made a decision in his heart!\t\t\t\t\t\t</div>", "images": {}, "success": true}