{"id": 1051, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074002.html", "title": "Chapter 4053 - Chapter 4053: 4052 Swords And The Divine Dragon Roar Of The Magical Universe! Go", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4053 - Chapter 4053: 4052 Swords And The Divine Dragon Roar Of The Magical Universe! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4053: 4052 swords and the Divine Dragon Roar of the magical universe! Go<br/><br/>Translator: 549690339<br/><br/>“Liu Lan, hopeless sky, I will help you to destroy this agar heavenly demon god. I want his corpse.”<br/><br/>Wang Xian’s voice rang out from the sky above the Demonic Beast Abyss!<br/><br/>“Alright, we will guarantee it with our lives. We will guarantee it with all the lives in the entire sword and magical universe. If the Dragon King helps us to destroy this agar heavenly demon god, the Dragon King will be the benefactor of our sword and Magical Universe!”<br/><br/>“The corpse of Asgardian and everything else belongs to the Dragon King! ”<br/><br/>The moment Wang Xian finished his sentence, Wang Xian did not hesitate at all. He praised the passage directly!<br/><br/>He did not hesitate at all!<br/><br/>He did not hesitate at all!<br/><br/>In the current situation, if Wang Xian was willing to help them, the crisis in the sword and magic universe would be easily solved!<br/><br/>It was very difficult to kill a heaven-blessed realm powerhouse!<br/><br/>They knew this!<br/><br/>However, during the last calamity, they were in a life-and-death battle!<br/><br/>He and Liu Lan had severed the limbs of the Aga Heavenly Demon God!<br/><br/>Although they didn’t manage to leave him behind in the end!<br/><br/>They had already severely injured him!<br/><br/>At that time, if their sword and magic universe had one more heaven-blessed realm existence,.<br/><br/>Then they would have a 100% chance of destroying this agar heavenly demon god!<br/><br/>That was because the current agar heavenly demon god was a little weaker during the Battle of the Apocalypse!<br/><br/>“What Hopeless Heaven said was also what I, Liu Lan, said. Dragon King, I have a relationship with Lord Water God Dragon. Thank you for helping me! ”<br/><br/>As Hopeless Heaven’s words fell, Liu Lan also thanked him loudly!<br/><br/>Their eyes were glowing with a fiery glow!<br/><br/>If they could get rid of the Aga Heavenly Demon God, it would be a great blessing for their sword and Magic Universe!<br/><br/>This was equivalent to them having one less terrifying enemy when the next calamity arrived!<br/><br/>An enemy at the Heaven’s origin creation level!<br/><br/>As for the request that Wang Xian had made, it was nothing at all.<br/><br/>They would even agree if Wang Xian asked them to give him enough treasures in exchange for his help!<br/><br/>Not to mention, they were willing to help them completely destroy the Aga Heavenly Demon God!<br/><br/>“Alright! ”<br/><br/>When Wang Xian heard their words, a smile appeared on his face. He looked at Lin Niu who was at the side!<br/><br/>“Old Niu, thank you, Boss!”<br/><br/>Lin Niu knelt in the air and bowed to Wang Xian with an excited expression!<br/><br/>He knew that Wang Xian wanted to destroy the Asgard Celestial Demon God for<br/><br/>Lin Niu’s own advancement!<br/><br/>If he could really destroy the Asgard Celestial Demon God,.<br/><br/>The possibility of Lin Niu devouring it and breaking through would be more than 95% !<br/><br/>It was such a terrifying probability!<br/><br/>That was because the Asgard Celestial Demon God was already a heaven ‘s origin creation!<br/><br/>“There’s no need! ”<br/><br/>Wang Xian shook his head and stared at the spot in front of him!<br/><br/>At this moment, on the Asgard Heavenly Demon God’s side, his face was filled with astonishment when he heard the words of hopeless sky, Liu Lan, and the rest!<br/><br/>What was going on?<br/><br/>Liu Lan, hopeless sky, and the rest had a manifestation of the Heaven’s origin helper?<br/><br/>The Dragon King?<br/><br/>He couldn’t sense any manifestation of the heaven’s origin under his telepathic perception!<br/><br/>The only suspicious thing was the young man who made Lin Niu kneel down!<br/><br/>He was clearly not at the level of the Heaven’s origin creation!<br/><br/>The Heaven’s origin creation was extremely accurate when it came to sensing the heaven’s origin creation!<br/><br/>Wang Xian was not at the level of the Heaven’s origin creation!<br/><br/>“Roar Roar Roar! ”<br/><br/>However, at this moment, Wang Xian’s body changed!<br/><br/>His void dragon body remained where it was!<br/><br/>His original body transformed into an incomparably terrifying divine dragon!<br/><br/>Nine-colored light enveloped him as the terrifying dragon aura swept across the<br/><br/>His entire body was at least a million kilometers in size. It was comparable to the size of a space beast!<br/><br/>Every single dragon scale was shimmering with light.<br/><br/>On a pair of dragon horns, light and darkness flickered!<br/><br/>In the middle, there was an illusory dragon wing!<br/><br/>The dragon wing revolved with nine-colored rays of light. It mainly had two attributes, wind and thunder!<br/><br/>The moment Wang Xian transformed into a divine dragon!<br/><br/>The moment he let out a roar!<br/><br/>In the front, there was a group of demonic beasts charging over!<br/><br/>There were more than a thousand demonic beasts and 20 to 30 demonic beasts at the peak of the Overlord realm.<br/><br/>They were trembling as they fell from the sky and laid on the ground!<br/><br/>“Nine-origin Dragon Field!”<br/><br/>Wang Xian growled. Without any hesitation, he activated the Dragon Field!<br/><br/>Nine Divine Dragons flew out from his body!<br/><br/>In an instant, they enveloped the entire world!<br/><br/>They turned into nine-colored rays of light!<br/><br/>Other than that, the starry lock shined brightly. Stars appeared out of thin air in the surroundings!<br/><br/>Stars that contained terrifying energy!<br/><br/>He swayed his enormous body and flew straight ahead.<br/><br/>“Eh? What? You clearly don’t have the realm of the Heaven’s origin creation.<br/><br/>How can you have such terrifying power?”<br/><br/>“Damn it, you are not a living creature from the sword and Magic Universe. You are from the Divine Dragon Clan of the nine-origin universe. You are from the Divine Dragon Clan!”<br/><br/>As a veteran of the Heaven’s origin creation, the Asgardian demon god was very knowledgeable.<br/><br/>He recognized that Wang Xian originated from the nine-origin universe and the Divine Dragon Race!<br/><br/>He widened his eyes and roared in disbelief!<br/><br/>He could clearly sense that Wang Xian was not from the Heaven’s origin creation!<br/><br/>To existences at the Heaven’s origin creation level, those below the Heaven’s origin creation level were all chess pieces.<br/><br/>They were all ants!<br/><br/>They had an endless lifespan and possessed the ability to destroy the world.<br/><br/>For those below the Heaven’s origin level, they did not need to care about any cultivation level.<br/><br/>However, how did this divine dragon possess such terrifying strength.<br/><br/>“Nine attributes? A complete fusion of nine attributes! ”<br/><br/>Agar’s exclamation sounded once again!<br/><br/>Nine attributes!<br/><br/>He sensed that Wang Xian actually possessed nine attributes!<br/><br/>Nine attributes and the top physique in the universe, this… ?<br/><br/>He found it unbelievable!<br/><br/>The more attributes one had, the more difficult it was to cultivate.<br/><br/>The more difficult it was to break through!<br/><br/>In the later stages, the masters of the universe who cultivated nine attributes at level six and level seven were comparable to other powerhouses who had broken through to the Heaven’s origin realm!<br/><br/>Secondly, it did not mean that everyone could cultivate nine attributes.<br/><br/>The more attributes one had, the easier it was for one to lose control and explode!<br/><br/>One’s body would explode.<br/><br/>Therefore, even though sky demon god Agar was experienced and experienced, this was the first time he had seen an expert with nine attributes at such a realm.<br/><br/>Not to mention nine attributes, he had only seen very few experts with five attributes!<br/><br/>Furthermore, an expert at the peak of the ruler realm with five attributes was only able to exchange blows with the Heaven’s origin creation and was able to fight against it!<br/><br/>The nine attributes were even crazier!<br/><br/>This was the first time he had seen it!<br/><br/>“Leave him here and destroy him! ”<br/><br/>Wang Xian stared at the Asgardian demon god. The planets in the surrounding star field fragments revolved and surrounded the surroundings as he shouted loudly!<br/><br/>“As long as you help me, Dragon King, I, Wang Xian, have no hope. Today, I will definitely behead Asgardian! ”<br/><br/>Wang Xian roared furiously with a face full of fury..\t\t\t\t\t\t</div>", "images": {}, "success": true}