{"id": 1057, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074014.html", "title": "Chapter 4059 - Chapter 4059: The Advancement Of 4058 Status!", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4059 - Chapter 4059: The Advancement Of 4058 Status!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4059: The advancement of 4058 status!<br/><br/>Translator: 549690339<br/><br/>Lin Niu kneeled in front of Wang Xian and spoke with gratitude and excitement!<br/><br/>However, Liu Lan and Wang Wangtian were stunned when they heard Lin Niu’s words!<br/><br/>Their minds moved and their eyes landed on Lin Niu. After sensing it slightly, their eyes focused!<br/><br/>They could sense the aura of the Asgard Heavenly Demon God from Lin Niu’s body.<br/><br/>However, the Linniu in front of them was clearly not the Asgard Heavenly Demon God!<br/><br/>“He should be a demonic beast born from the falling limbs of the Asgard Heavenly Demon God in the ninth level of the Demonic Beast Abyss. His strength is not weak and far exceeds that of a peak ruler realm existence. Now, the Asgard Heavenly Demon God has completely disappeared, and the obstacles in front of him have disappeared! ”<br/><br/>“Now that he can devour the corpse of the Asgard Heavenly Demon God, the possibility of him breaking through is almost 100% . In 100 million years, he should be able to completely break through! ”<br/><br/>Hopeless heaven sized up Lin Niu and transmitted his voice to Liu Lan!<br/><br/>When Liu Lan heard this, his face revealed a shocked expression!<br/><br/>“Doesn’t that mean that he will have a heavenly yuan creation level subordinate?”<br/><br/>Liu Lan replied with some amazement!<br/><br/>Their entire sword and Magic Universe had only produced two heavenly yuan creation level subordinates.<br/><br/>And this Dragon King before them already had a heavenly yuan creation level subordinate.<br/><br/>In addition to his own strength, he was already comparable to their sword and Magic Universe!<br/><br/>“The nine-origin universe is a relatively strong universe. It’s much stronger than our sword and Magic Universe.”<br/><br/>Hopeless Sky continued to send a voice transmission to Liu Lan.<br/><br/>Liu Lan nodded. At this time, his heart suddenly moved. His gaze swept past long yinyin and long yinhao, and his gaze flickered slightly! “Dragon King, I hope you can forgive me for my previous offense! ”<br/><br/>Liu Lan looked at Wang Xian and spoke directly! “Senior Liu Lan, I can understand your actions as well! ”<br/><br/>Wang Xian smiled when he heard Liu Lan’s words!<br/><br/>Since the Heaven’s origin creation of the sword and Magic Universe had taken the initiative to apologize, Wang Xian would not continue to offend them!<br/><br/>Moreover, Liu Lan’s actions just now were also normal.<br/><br/>Was he protecting his own shortcomings!<br/><br/>Wang Xian was also protecting his own shortcomings!<br/><br/>Long Yinhao and the current Saintess of the flowing water forbidden ground were now together!<br/><br/>Long Yinyin and the dragon roar forbidden ground were also disciples of the Sword and Magic Universe. He did not want to shed all pretenses with Liu Lan and hopeless heaven!<br/><br/>Now that the other party had taken the initiative to apologize, this was already the best situation!<br/><br/>“The Dragon King’s action this time helped us to kill Agatha. This is a great favor to us. In the future, if the Dragon King has any needs, just tell us directly! ”<br/><br/>“If we can do it, we will definitely not decline! ”<br/><br/>Hopeless Heaven also spoke very politely to Wang Xian!<br/><br/>Putting aside Wang Xian’s strength, he would have a heaven’s origin level subordinate in the future. Just by helping them to kill Agatha just now, Hopeless Heaven would also thank him properly!<br/><br/>“Hehe, Alright, you ‘re too polite. I came to your sword and magic universe by accident to gain experience. Now that I’ve gained something, I think it’s fated to be in your sword and magic universe as well. ”<br/><br/>Wang Xian replied politely!<br/><br/>“Hehe, then let’s have a taste of the delicacies unique to our sword and magic universe together, Dragon King! Haha! ”<br/><br/>Wang Xian smiled and invited Wang Xian!<br/><br/>Wang Xian didn’t reject him. He nodded his head with a smile!<br/><br/>Liu Lan nodded her head with a smile as well.<br/><br/>She moved her body and arrived in front of the group of powerful disciples from the forbidden grounds and the Saint Academy in an instant!<br/><br/>“My Lord! ”<br/><br/>The group of powerful disciples quickly bowed respectfully!<br/><br/>Okay!<br/><br/>Liu Lan nodded her head and her gaze landed on long yinyin and long yinhao!<br/><br/>With a wave of her hand, the staff appeared in her hand, and a seed appeared above the lotus flower.<br/><br/>The seed entered long Yinhao’s body along with the current!<br/><br/>“Coming back from the dead will cause some damage to your foundation. This water moon seed can restore your foundation and improve it once again. In addition, I’ll use the water energy to cleanse your body, allowing you to recover to your previous realm in a short period of time! ”<br/><br/>“It will not be a problem for you to break through to the peak of the ruler realm in the future. This time, it is the flowing water forbidden ground that is wrong. ”<br/><br/>Liu Lan said to long Yinhao as a wave of energy surged into his body!<br/><br/>At the same time, his realm continued to increase.<br/><br/>In a short period of time, he had directly recovered to the level of a fifth stage venerable!<br/><br/>A heavenly yuan creator personally making a move was still very terrifying! Not to mention, he had even given him a powerful treasure to repair his body!<br/><br/>“Thank you sir, Thank You Sir! ”<br/><br/>Long Yinhao’s face was filled with gratitude as he hurriedly bowed!<br/><br/>“Hehe, there’s no need. You’re a disciple of the Dragon Roar Forbidden Land, right? Your Dragon Roar Forbidden Land is also a water elemental faction. Ask your seniors if they’re willing to join the flowing water forbidden land. The flowing water forbidden land will not mistreat you!”<br/><br/>“With your strength, you can also become the pillar of the flowing water forbidden land in the future! ”<br/><br/>Liu Lan smiled as she spoke. She waved her arm once again, and a water elemental staff appeared in front of her.<br/><br/>She waved her arm, and the staff landed in front of Long Yin.<br/><br/>(‘I have an extra staff in my hand. Its power is not bad, so I’ll give it to Little<br/><br/>Yin. ”<br/><br/>She said to Long Yin!<br/><br/>Long Yin stared blankly at the magic staff in front of him, and his body suddenly became alert!<br/><br/>“Thank you, sir, thank you, Sir!” Long Yin Yin hurriedly thanked him!<br/><br/>“Hehe, there’s no need.”<br/><br/>Liu Lan smiled with satisfaction, and her gaze swept the surroundings. “There are no more magic beasts in the Magic Beast Abyss. All of you should go back. ”<br/><br/>“Yes, Sir! ”<br/><br/>All the experts from the sacred land, Forbidden Land, and Sacred Academy immediately responded loudly!<br/><br/>They glanced at long yinyin and long yinhao, their faces filled with envy!<br/><br/>Needless to say, Long Yinyin and long Yinhao would definitely become existences at the peak of the ruler realm in the future.<br/><br/>Not to mention the Dragon King from the other universes.<br/><br/>Just based on their Lord Tianyuan Creation’s intentions, it was obvious that they wanted to raise long yinyin and long Yinhao to the peak of the ruler realm.<br/><br/>Although they had no hope of Lord Tianyuan making a move, he would obviously do something later on.<br/><br/>The main reason was that the Dragon King’s strength was too terrifying!<br/><br/>Furthermore, they had also heard the conversation of that Lin Niu!<br/><br/>After this Lin Niu devoured the corpse of the Asgard Heavenly Demon God.<br/><br/>After more than 100 million years, he would advance to the Tianyuan creation<br/><br/>realm!<br/><br/>This Dragon King would have a subordinate of the Tianyuan creation realm.<br/><br/>With such a terrifying existence, the two lords of their universe naturally had to be on good terms with him.<br/><br/>This would be extremely beneficial to the future calamity!<br/><br/>And the relationship between long yinyin and long Yinhao and this Dragon King would be able to walk unhindered in the entire sword and Magic Universe in the future!<br/><br/>On the side, when the flowing moon Saintess saw this scene, her eyes widened and her face was filled with excitement!<br/><br/>Long Yinhao’s background was now even scarier than hers!<br/><br/>She was naturally very happy to see her man getting such good fortune!<br/><br/>At the back, Wang Xian smiled when he saw this scene..\t\t\t\t\t\t</div>", "images": {}, "success": true}