{"id": 1055, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074010.html", "title": "Chapter 4057 - Chapter 4057: 4056 Kills", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4057 - Chapter 4057: 4056 Kills</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4057: 4056 kills<br/><br/>Translator: 549690339<br/><br/>“Boom! Boom! Boom!”<br/><br/>The battle continued as the terrifying energy reverberated throughout the world!<br/><br/>Liu Lan and Wang Xian’s eyes were bloodshot from the battle!<br/><br/>They only had their eyes on the Asgardian demon god.<br/><br/>All their energy was completely locked onto him.<br/><br/>This also made Wang Xian feel much more relaxed by the side. All he needed to do was to attack normally!<br/><br/>The animosity between the Asgardian demon god, the sword, and the magic universe had exceeded Wang Xian’s imagination!<br/><br/>“Liu Lan, Hopeless Sky, you want me to die. Even if I die, I will make you pay a terrible price. I will also make you, the sword, and the magic universe, pay the price!”<br/><br/>The wounds on the Asgardian demon god’s body were increasing!<br/><br/>The despair in his eyes was also increasing!<br/><br/>There was an additional existence in the Heaven’s origin realm!<br/><br/>This was only his body. He had just broken through to the Heaven’s origin realm and didn’t even have any resurrection treasures in his hands!<br/><br/>Once he died, he would truly die.<br/><br/>He would be completely annihilated!<br/><br/>Now, because of Wang Xian, he was completely locked on to both his escapes!<br/><br/>He knew that Wang Xian had a terrifying locking ability.<br/><br/>Today, with Liu Lan and the hatred of Wang Xian, there was a high possibility that he would die here!<br/><br/>He could die, but he also wanted to make the sword and the Magic Universe pay the price.<br/><br/>“Today, I, Wang Xian, will behead you to pay tribute to the lives of those who died in the sword and the Magic Universe! ”<br/><br/>Wang Xian raised his battle axe and roared.<br/><br/>His entire body was rapidly expanding until it was 1,000 meters in size!<br/><br/>Boom<br/><br/>Wang Xian dashed out and engaged in close combat with the Asgardian Demon God!<br/><br/>Liu Lan waved the staff in his hand. Streams of energy covered the surroundings to prevent the Asgardian demon god from escaping!<br/><br/>At the same time, streams of water were injected into Wang Xian’s body to strengthen his defense and recovery ability!<br/><br/>Wang Xian raised his head. The fragments of the Starfield were suspended in the air above him.<br/><br/>The stars were spinning above him!<br/><br/>The stars were attacking Aggar!<br/><br/>The terrifying energy covered the sky and the Sun!<br/><br/>Aggar was in an extremely miserable state.<br/><br/>He flapped his wings and tried his best to Dodge!<br/><br/>Now, he could no longer block any attacks!<br/><br/>He could not withstand the combined attacks of Wang Xian and the other two!<br/><br/>“Ahhhh!”<br/><br/>However, even if he tried to block the attacks again,.<br/><br/>He could not dodge the attacks of Wang Xian and the others!<br/><br/>He dodged the attacks of Hopeless Sky and was struck by a Star!<br/><br/>He let out a furious roar and let out a miserable shriek!<br/><br/>“Disintegration of the OMEN!”<br/><br/>He let out another furious roar and his eyes were filled with madness!<br/><br/>“Disintegration of the omen. Last Time, Agatha used this move to escape. His limbs were also left here because of this move!”<br/><br/>Liu Lan saw Agatha’s move and immediately reminded Wang Xian loudly!<br/><br/>At this moment, Wang Xian saw the body of Agatha transformed into 20 to 30 body parts!<br/><br/>Heads!<br/><br/>Limbs!<br/><br/>Eyes!<br/><br/>And two wings!<br/><br/>There was also a chest and some bones!<br/><br/>He quickly fled to the surroundings and far away!<br/><br/>When Wang Xian saw this scene, his eyes focused!<br/><br/>He waved his arm and the five elements Millstone and the Tai Chi Dragon Plate flew out, attacking the pupils one by one!<br/><br/>At the same time, Wang Xian’s body trembled and split into nine parts, attacking the limbs one by one!<br/><br/>The Starfield fragment and the book of water forbidden spell were also sweeping towards the bodies of the Agar Heavenly Demon God! Each of the 28 body parts contained a terrifying energy.<br/><br/>They were fleeing in all directions!<br/><br/>Liu Lan and Hopeless Heaven also tried to intercept them!<br/><br/>They also had powerful means to intercept them!<br/><br/>Stay here! ”<br/><br/>One by one, their limbs were enveloped by Wang Xian and the rest’s energy!<br/><br/>At this moment, the head of the Asgard Celestial Demon flew toward the group of experts from the forbidden grounds and the Sacred Academy!<br/><br/>“If you want to kill me, I will make your sword and Magic Universe pay a terrible price. I will make all the experts from your sword and Magic Universe die with me!”<br/><br/>The head of the Asgardian Demon God roared crazily.<br/><br/>The eyes on his head disappeared, and he looked abnormally terrifying!<br/><br/>But the energy contained in them was very terrifying!<br/><br/>“You want to kill the disciples of our sword and Magic Universe? Don’t even think about it! ”<br/><br/>Liu Lan’s eyes were extremely cold!<br/><br/>He waved the staff in his hand, and the water condensed into a giant hand that grabbed at his head!<br/><br/>In the next moment, the huge hand grabbed Agartian’s head, and his head let out a blood-curdling scream!<br/><br/>But the moment he was grabbed, he suddenly opened his mouth and spat something out!<br/><br/>It was an eye.<br/><br/>Inside the eye was a face that looked crazy!<br/><br/>This face broke through the bindings of the eye and turned into a terrifying face of a demon god!<br/><br/>The face of the demonic god grew larger and larger and continued to attack the group of disciples!<br/><br/>“Not good!”<br/><br/>Liu Lan’s expression changed slightly when she saw this!<br/><br/>“Not good! The Demonic God’s target is us! Run! Run! ” “Oh no! The demonic God wants to kill us! We’re not his match! Run! Run!” “Run! Run! This face is not something we can block!”<br/><br/>At this moment, all the peak-stage rulers of the sacred grounds, forbidden grounds, and sacred academy in the surrounding area looked at this face in shock!<br/><br/>They immediately attacked the face of the demon god and ordered all the disciples and experts to immediately flee!<br/><br/>“Die, die, die, die, Liu Lan, hopeless sky, I said, even if I die, I will make your sword and Magic Universe pay a terrible price. Hahaha, die, die, die, die! ”<br/><br/>Agartian Demon God roared crazily!<br/><br/>At this moment, he didn’t want to escape anymore!<br/><br/>But before he died, he wanted to kill these million experts from the sword and Magic Universe.<br/><br/>Once these experts died, when the calamity arrived, the sword and magic universe might still suffer a terrible disaster!<br/><br/>“Agartian, you are courting death! ”<br/><br/>At the front, when Hopeless Heaven saw this scene, his expression changed drastically as he roared crazily!<br/><br/>“Brother Wang Xian, run! ”<br/><br/>The Dragon’s Roar and Yin Longyin Hao’s face turned extremely pale when they saw the attack of the Agatian Demon God!<br/><br/>Only when they faced the demon God who was in the Heaven’s origin realm did they realize how terrifying this level was!<br/><br/>Even just a face made them feel fear and despair! They shouted at Wang Xian’s void Dragon Body in Panic!<br/><br/>“Hehe, don’t worry! ”<br/><br/>Wang Xian looked at them and smiled faintly.<br/><br/>“Transformation of the Netherworld Dragon! ”<br/><br/>With a thought, Wang Xian’s real body instantly merged with the Void Dragon Body!<br/><br/>“The three of us are attacking you together. If we can still cause you any trouble, then we are too trash! ”<br/><br/>Wang Xian raised his head and looked at the face of the demon god.. He shook his head and sneered!\t\t\t\t\t\t</div>", "images": {}, "success": true}