{"id": 1054, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074008.html", "title": "Chapter 4056 - Chapter 4056: 4055 Destruction Of Heaven’S Origin", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4056 - Chapter 4056: 4055 Destruction Of Heaven’S Origin</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4056: 4055 destruction of Heaven’s origin<br/><br/>Translator: 549690339<br/><br/>“Roar! Roar! Roar!”<br/><br/>When the Asgardian demon god saw that Wang Xian was attacking him with all his might, his face revealed a hint of anger and fear.<br/><br/>There was a hint of panic on his face!<br/><br/>Now that Wang Xian had seen through his escape plan, Wang Xian had no fear. Even if he had to risk getting injured, Wang Xian would still inflict heavy injuries on him!<br/><br/>With Liu Lan and Wang Xian by his side, he had no way of resisting!<br/><br/>“I have to escape, I have to escape! ”<br/><br/>Aggar roared in horror!<br/><br/>I have to escape!<br/><br/>I have to do everything I can to escape!<br/><br/>If not, I might really be done for!<br/><br/>I might really die here.<br/><br/>It was very difficult for a powerhouse in the Heaven’s origin Destiny Realm to die!<br/><br/>However, if he did not escape today, he would definitely die!<br/><br/>This was because flowing blue and the hopeless sky would not give up even if they were heavily injured as long as they had the chance to kill him.<br/><br/>“Peng Peng Peng! ”<br/><br/>Asgard gritted his teeth and looked at the huge axe that was charging at him. Once again, it surrounded his wings and forcefully blocked it!<br/><br/>The terrifying huge axe struck his wings. This time, a large portion of his right wing’s bones were punctured!<br/><br/>His entire right wing was completely cut off! His body was instantly sent flying backward!<br/><br/>“Yu Hua, Tian Qian! ”<br/><br/>Asgard felt the intense pain coming from his wing. When they saw this scene, their eyes turned blood-red!<br/><br/>Blood began to drip down!<br/><br/>In the next instant, his body began to collapse and turn into countless bone fragments!<br/><br/>Countless blood-red bone shards flew in all directions!<br/><br/>Some of the bone shards even tore through the void, revealing a black hole in front of them!<br/><br/>Ascendance, Heavenly Sky!<br/><br/>This was another means of escape for Asgard!<br/><br/>As an old-fashioned heavenly yuan creation, he had many means of escape!<br/><br/>And this method did not hesitate to use up his blood and energy.<br/><br/>If he wanted to recover from this kind of depletion, he would need at least a few billion years!<br/><br/>“He still wants to escape! ”<br/><br/>When Liu Lan saw this scene, his gaze focused. In the black clouds in the sky, droplets of water fell toward the blood-red bone pieces one by one. It was as if they were going to drip into them and lock onto them!<br/><br/>“He can’t escape! ”<br/><br/>Wang Xian’s face revealed a cold expression. Under the void search of the uninitiated holy wings, he could sense the exact location of the Asgardian demon god!<br/><br/>This time, his spiritual ability was not limited to just one bone fragment!<br/><br/>It was on more than ten bone fragments!<br/><br/>If any of the bone fragments managed to escape, he would be able to escape completely!<br/><br/>“Nine shadows of the Heavenly Dragon!”<br/><br/>Wang Xian let out a low growl. His body trembled slightly as the shadows of the Divine Dragons appeared around him.<br/><br/>The Nine Dragon Shadows attacked the nine bone fragments!<br/><br/>At the same time, he waved his arm and the book of forbidden water spells landed in his hand.<br/><br/>Wang Xian flipped open the eighth page of the book of Water Forbidden Spell and a surge of energy surged into it.<br/><br/>Buzz<br/><br/>The image of a goddess appeared on the eighth page of the book of Water Forbidden Spell.<br/><br/>The goddess had 18 arms and 18 arms. She immediately attacked the other seven bone fragments!<br/><br/>Her speed was extremely terrifying!<br/><br/>“Damn it, damn it. How could he still lock onto me? How is this possible? How is this possible?”<br/><br/>At this moment, the Asgardian demon god was shocked when he saw Wang Xian’s attack locked onto him accurately!<br/><br/>It was one thing for him to be locked onto the first time!<br/><br/>Now, he was locked onto the second time as well!<br/><br/>How is this possible?<br/><br/>“Attack the bone fragments that Pm attacking! ”<br/><br/>Wang Xian shouted loudly when he launched his attack!<br/><br/>“Alright! ”<br/><br/>Wang Xian and Liu Lan’s eyes shone brightly.<br/><br/>“I have locked onto five of them. They are all locked onto by you, Dragon King.<br/><br/>It seems that you have a special way to lock onto the enemy! ”<br/><br/>Liu Lan shouted loudly at Wang Xian with an excited look on her face!<br/><br/>“Sure, it will be difficult for him to escape from my lock! ”<br/><br/>Wang Xian replied.<br/><br/>“Alright, Alright. Godly Axe, Kai Yuan! ”<br/><br/>Wang Xian roared and raised the huge axe in his hand. Streams of terrifying energy enveloped the area in front of him!<br/><br/>He slashed forward and golden axes appeared one after another. They were aimed at the 17 bone fragments!<br/><br/>“Divine Dragon Clan, you deserve to die! You deserve to die!”<br/><br/>Seeing that he was completely locked on, Agatian revealed an extremely furious expression!<br/><br/>All of his bone fragments gathered together again. He ignored Wang Xian and Wang Xian’s attacks and fled into the distance!<br/><br/>“Mountains are water, the sky is water, the Earth is water, and everything is<br/><br/>Liu Lan stood at the back and raised the staff in his hand as he muttered!<br/><br/>Following his words, Water Mountains appeared!<br/><br/>The Sky turned into water!<br/><br/>The ground also turned into water!<br/><br/>The entire world seemed to have undergone a huge change!<br/><br/>This move of his took a full second to chant and cast!<br/><br/>To the Heaven’s origin creation, this could withstand thousands of attacks in a second!<br/><br/>And this attack that required a second to chant was naturally extremely terrifying!<br/><br/>“No, no, no! I can’t accept this! ”<br/><br/>The Asgardian demon god felt the attack from behind Wang Xian and roared with a face full of grievance! He couldn’t accept this!<br/><br/>He died just like that!<br/><br/>He couldn’t accept this!<br/><br/>He had just come out of his second life!<br/><br/>“We… We, the great beings at the Heavenly Yuan creation level, have completely suppressed that demonic god. We have completely suppressed him.<br/><br/>We might even be able to kill him! ”<br/><br/>“With the Dragon King’s addition, that demonic god no longer dares to be arrogant. He might even be killed by the three Great Beings! ”<br/><br/>“That’s great, that’s great. I saw from the history of our undeserved forbidden ground that during the last calamity, our sword and magic universe had killed no less than a hundred billion of our compatriots, or even more! ”<br/><br/>“During the last calamity, this Asgardian demon god led his subordinates and attacked the center of our universe. The entire Demon Beast Abyss was formed during that battle. Countless creatures in our universe were killed by him, and now, we can finally take revenge! ”<br/><br/>“A battle at the heavenly fate level is so terrifying. The three lords are already far away from us, yet they’re still so terrifying!”<br/><br/>“That Dragon King from the nine-origin universe is so strong. He is already so strong even though he isn’t at the Heavenly Yuan creation level yet. He has nine attributes, and together with his spatial attribute body, he has a total of ten attributes. It’s too terrifying. What level of talent is this! ”<br/><br/>“Yeah, cultivating all ten attributes. It’s really incomparably terrifying and heaven-defying. I’m afraid that this is an extremely rare existence in all the universes!”<br/><br/>At the same time, at the back, all the strong disciples were filled with shock and excitement when they saw this scene!<br/><br/>Now, that demonic god was completely suppressed!<br/><br/>He might even be destroyed!<br/><br/>Many strong ones knew that this agar heavenly demonic god was the greatest hatred in their universe!<br/><br/>If they could destroy him, it would be a blessing for their universe!<br/><br/>At this moment, everyone looked at Wang Xian with more respect and respect!<br/><br/>This Dragon King was too heaven-defying!\t\t\t\t\t\t</div>", "images": {}, "success": true}