{"id": 1052, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074004.html", "title": "Chapter 4054 - Chapter 4054: 4053 Swords And The Divine Dragon Roar Of The Magic Universe! Down", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4054 - Chapter 4054: 4053 Swords And The Divine Dragon Roar Of The Magic Universe! Down</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4054: 4053 swords and the Divine Dragon Roar of the Magic Universe! Down<br/><br/>Translator: 549690339<br/><br/>The Sword and the magic universe and the Agar Heavenly Demon God were blood feuds!<br/><br/>If there was a chance, even if both sides were injured, hopeless sky and Liu Lan wanted to completely destroy the Agar Heavenly Demon God!<br/><br/>In the last calamity, the Agar Heavenly Demon God led his army and massacred too many lives in the sword and Magic Universe!<br/><br/>This included their loved ones!<br/><br/>Now, when Hopeless Heaven saw that he had a chance to destroy the Asgardian demon god, he instantly went berserk!<br/><br/>“Alright! ”<br/><br/>Wang Xian nodded and replied loudly, “Surround him. With our strength, we can completely destroy him! ”<br/><br/>“Damn it, damn it!”<br/><br/>When the Asgardian demon god sensed Wang Xian’s might and Wang Xian ‘s terrifying strength, his expression changed drastically!<br/><br/>The Agar Heavenly Demon God was very clear about Liu Lan’s and Wang Xian’s strength.<br/><br/>In the past, even if the other party fought with his life on the line, he would only be severely injured!<br/><br/>It was impossible to destroy him!<br/><br/>This was also the reason why he dared to act so recklessly.<br/><br/>But now, an existence with the Heaven’s origin creation level combat strength suddenly appeared. He was shocked!<br/><br/>One more heaven creation level existence was enough to completely kill him!<br/><br/>He flapped his huge wings and without any hesitation, he immediately fled!<br/><br/>The Violent Energy left terrifying marks!<br/><br/>“Agartian, don’t even think about escaping today! ”<br/><br/>Liu Lan’s eyes were cold and bloodshot with hatred as she roared angrily.<br/><br/>She waved the staff in her hand and the book of water curse floated above her head. Immediately, she released a terrifying water dragon!<br/><br/>The water dragon coiled towards the Asgardian God!<br/><br/>When Wang Xian saw Liu Lan’s attack, a look of astonishment appeared on his face!<br/><br/>He turned towards the Asgardian god and locked onto him!<br/><br/>“You want to escape? Dream On! ”<br/><br/>With a move of his dragon claw, the galactic fragment turned into a star and floated in front of his Dragon Claw!<br/><br/>Waves of majestic energy surged into the star field fragment!<br/><br/>“Buzz Buzz Buzz! ”<br/><br/>“Buzz Buzz Buzz! ”<br/><br/>At this instant, tens of thousands of stars in the surrounding area emitted a terrifying luster at the same time!<br/><br/>These stars carried all kinds of energy and attacked the Aga Heavenly Demon God!<br/><br/>Countless stars charged forward. It was extremely terrifying and spectacular!<br/><br/>“Is… is this brother Wang Xian’s true strength?”<br/><br/>When Wang Xian attacked from below, the demonic beasts no longer dared to move!<br/><br/>Long Yinhao watched as Wang Xian transformed into a terrifying divine dragon that was a million kilometers in size!<br/><br/>When he saw the terrifying stars charging towards him in the surrounding starry sky, his face was filled with shock!<br/><br/>This scene was simply too shocking!<br/><br/>At least visually, Wang Xian’s attack was much more shocking than the attacks from hopeless sky and Liu Lan!<br/><br/>“No wonder brother Wang Xian would give me an explanation when he talked about me. Brother Wang Xian ‘s strength is too heaven-defying! ”<br/><br/>Long Yinhao continued to speak in shock. He looked at Wang Xian’s void dragon body and said, “Brother, you really hid it well! ”<br/><br/>(‘I just broke through not long ago! ”<br/><br/>Wang Xian said with a faint smile!<br/><br/>“It’s really unbelievable. Saint Wang Xian, you… you actually came from another universe. You’re actually the king of a race in another universe. ”<br/><br/>“No wonder your cultivation speed is so terrifying with this body of yours.<br/><br/>You’ve reached such a level in just a few hundred million years! ”<br/><br/>The flowing moon Saintess looked at Wang Xian and said with a face full of shock!<br/><br/>At this moment, she was also very excited!<br/><br/>The relationship between long Yinhao and Wang Xian was needless to say!<br/><br/>Now, the matter between Wang Xian and their lord of Heaven’s origin creation in the sword and Magic Universe had been resolved!<br/><br/>In the future, Wang Xian would also be an existence that everyone in the sword and magic universe would revere.<br/><br/>Long Yinhao had such a backing. It could be said that he had reached the sky in one step!<br/><br/>This kind of reliable relationship was even stronger than the relationship between the leader of the flowing water forbidden land and flowing blue!<br/><br/>In the entire sword and Magic Universe in the future, Long Yinhao would be the existence with the strongest background.<br/><br/>Naturally, she could also bask in the glory and was very happy!<br/><br/>Around them, the barbarian saint who knew Wang Xian had his mouth slightly agape. He was also looking at this scene in disbelief!<br/><br/>“I didn’t expect the Wang Xian holy son to be the king of a race from the nine-origin universe. Is this the Divine Dragon? It’s really terrifying! ” “That’s right. Sir Liu Lan said that her breakthrough was under the guidance of Sir Tian Yuan creation of the Divine Dragon Race. This divine dragon race is really terrifying! ”<br/><br/>“Just this terrifying physique and this terrifying pressure is enough to make one’s soul tremble. It’s really powerful!”<br/><br/>“Isn’t the dragon roar forbidden ground about to ascend to the heavens with a single step?”<br/><br/>“The ones who have ascended to the heavens with a single step are the siblings, Long Yinyin and long yinhao. In the past, this sage Wang Xian has taken great care of them. This time, he even dared to fight against us two masters of Heaven’s origin creation for long Yinhao’s sake. Now that everything has been resolved, who would dare to provoke them?”<br/><br/>In the surrounding area, all the strong disciples of the Sacred Land’s forbidden ground and the Sacred Academy were discussing.<br/><br/>They looked at Wang Xian’s void dragon body and then looked at the terrifying divine dragon in the sky. They were filled with deep respect!<br/><br/>With such a body, he was truly invincible!<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>At this moment, at the position in front of him.<br/><br/>The stars were heading towards the Agar Heavenly Demon God!<br/><br/>Now, Wang Xian was able to fight against the Heaven’s origin creation without using treasures of the same level with the help of the Heaven’s origin creation fragment!<br/><br/>With the help of the Heaven’s origin creation fragment, his attack power was even more terrifying!<br/><br/>Although Agatian had lived his second life, all the weapons and treasures he had in the past were gone!<br/><br/>Under such circumstances, he had to deal with the attacks of the stars with all his might!<br/><br/>Coupled with the attacks from Hopeless Sky and Liu Lan, he was completely suppressed!<br/><br/>In fact, even the chance of breaking through and escaping was extremely small!<br/><br/>“Roar Roar Roar! ”<br/><br/>“Damn it, damn you guys, damn the Divine Dragon Clan! ”<br/><br/>“Divine Dragon Clan, you’ve ruined my plans twice. In the future, I, Asgard, will definitely make you pay the price of blood, I will definitely make you pay a terrible price! ”<br/><br/>Asgard saw the tens of thousands of terrifying planets charging towards him.<br/><br/>His expression changed drastically as he roared with killing intent!<br/><br/>“Boom!”<br/><br/>He flapped his wings violently and instantly went berserk!<br/><br/>Berserk!<br/><br/>His strength instantly increased by a lot!<br/><br/>Countless bone spikes on his body attacked the planets one by one!<br/><br/>“Boom Boom Boom! ”<br/><br/>“Boom Boom Boom! ”<br/><br/>The bone spikes exploded one planet after another!<br/><br/>But at this moment, the Water Dragon released by Liu Lan was also attacking him from behind!<br/><br/>“Devil’s Breath! ”<br/><br/>The Asgardian devil God looked at the water dragon, and his blood-red pupils released a violent torrent!<br/><br/>The torrent gathered together and charged at the Water Dragon!<br/><br/>“Boom! Boom!”<br/><br/>The Violent Devil’s breath collided with the Water Dragon!<br/><br/>It completely blocked it!\t\t\t\t\t\t</div>", "images": {}, "success": true}