{"id": 1067, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074034.html", "title": "Chapter 4069 - Chapter 4069: The 4068 Dragon King Of The Dragon Palace Was Going To Die!", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4069 - Chapter 4069: The 4068 Dragon King Of The Dragon Palace Was Going To Die!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4069: The 4068 Dragon King of the Dragon Palace was going to die!<br/><br/>Translator: 549690339<br/><br/>“The Dragon Palace is here! ”<br/><br/>“The Dragon King Is Here! ”<br/><br/>When the strong disciples of the nine-origin universe saw Wang Xian and the strong disciples of the Dragon Palace, they were shocked.<br/><br/>“There are so many purebred divine dragons. They are much more than the ones we saw in the starry universe!”<br/><br/>“There are so many experts in the Dragon Palace. There are about eight million of them. Even the weakest one is a venerable. Is this the strength of the Dragon Palace?”<br/><br/>“How is this possible? Don’t you see that there are only about 100,000<br/><br/>Dominators in the Dragon Palace? Now there are more than 300,000 of them.<br/><br/>How can they develop so fast?”<br/><br/>“Hiss, is this the full strength of the Dragon Palace? So powerful and terrifying. Although there aren’t any peak Dominators, there seem to be quite a few level eight Dominators. They haven’t developed for more than a billion years, right?”<br/><br/>All the disciples of the top-tier races looked over.<br/><br/>When they saw the disciples of the Dragon Palace, they were shocked!<br/><br/>The number of powerful warriors far exceeded everyone’s imagination!<br/><br/>Even the peak races were filled with astonishment!<br/><br/>The powerful disciples from the Divine Tiger Race, the Shaman Race, the Abyss race, the Immortal Nation, and the royal family were even more shocked. This was because the number of powerful warriors from the Dragon Palace was even greater than theirs!<br/><br/>How long had the Dragon Palace been developing for?<br/><br/>“It’s a pity that they provoked the Phoenix and Angel clans. The two peak races‘Heavenly Yuan creation realm experts have spoken!” A skeleton king from the skeleton clan sighed softly!<br/><br/>However, they only felt a little pity!<br/><br/>After all, this time, the two heavenly Yuan creation realm experts from the angel and Phoenix clans were punishing the Dragon Palace.<br/><br/>First, they would kill all the experts from the Phoenix and Angel clans.<br/><br/>Second, they would let the Dragon Palace be the vanguard when the catastrophe arrived.<br/><br/>The first point aside, the second point was a good thing for the disciples of the peak races.<br/><br/>After all, the Dragon Palace was on the first line, which could reduce their losses!<br/><br/>“Seventh Elder, the Dragon King of the Dragon Palace is here! ”<br/><br/>The moment the Dragon Palace appeared, it was in front of them.<br/><br/>At the Phoenix Clan, an expert at the peak of the sovereign realm glanced over with killing intent in his eyes.<br/><br/>He said to the seventh elder!<br/><br/>“HMM? That’s the Dragon Palace?”<br/><br/>The seventh elder looked over with killing intent in his eyes.<br/><br/>As he spoke, he flapped his wings and immediately flew towards the Dragon Palace!<br/><br/>“That courting Death Dragon Palace is here! ”<br/><br/>“If it wasn’t for the orders of our Phoenix Emperor, I would have killed all the disciples of the Dragon Palace Right Now and hung their dragon heads on our Phoenix clan. ”<br/><br/>“This damn Dragon Palace has finally appeared. HMPH, he must be hiding somewhere in our nine-origin universe. This time, they are really lucky to not be able to kill all of them!”<br/><br/>Killing intent instantly surged out from the bodies of the Phoenix clan’s expert disciples!<br/><br/>They flapped their wings and quickly flew towards the front of the Dragon Palace!<br/><br/>“Come, Let’s Go! ”<br/><br/>“Humph, this small dragon palace doesn’t even have the strongest ruler at the peak of the ruler realm. How dare they oppose our Angel clan? They are courting death! ”<br/><br/>“Kill that Dragon King!”<br/><br/>The group of experts from the Angel clan flew over quickly. Their eyes were filled with killing intent!<br/><br/>The King of Light and the King of darkness both locked their cold gazes on all the expert disciples from the Dragon Palace!<br/><br/>The king of water, Golden and Fire Phoenixes also flew over from the Phoenix clan!<br/><br/>The expert disciples from the two peak races came to the front of the teleportation formation and immediately surrounded Wang Xian and the rest!<br/><br/>Pairs of eyes were staring at them!<br/><br/>“Although the Dragon Palace is very strong and there are many strong warriors, the gap between them in terms of top-notch combat strength is still too big! ”<br/><br/>Not far away from them, all the strong disciples above the level of a 9-origin universe knight looked over.<br/><br/>When they saw the strong warriors of the angel race and the Phoenix race surrounding the Dragon Palace, their faces were filled with shock.<br/><br/>These were the three peak races of their nine-origin universe!<br/><br/>“After all, they have only developed for less than a billion years. They are already very strong with this strength. ”<br/><br/>Some experts sighed slightly, “But unfortunately, now that the experts of the Heavenly Yuan creation realm have spoken, the Dragon Palace doesn’t dare not to come because if they don’t, once the Heavenly Yuan creation realm makes a move, the Dragon Palace will be completely finished. ”<br/><br/>“At the moment, other than the Phoenix clan and the Angel clan, the other lords of the Heavenly Yuan creation realm don’t want the Dragon Palace to be destroyed. After all, the Dragon Palace is a powerful race in our nine-origin universe. It was passed down from the Divine Dragon Clan. The Divine Dragon Clan also had the Heavenly Yuan creation realm back then. The lords all know each other and have some old friendships! ”<br/><br/>All the disciples looked over.<br/><br/>In the distance, eight figures stood on the branches of the tree of chaos.<br/><br/>They had also sensed the arrival of the Dragon Palace!<br/><br/>“They’re here! ”<br/><br/>The Elven empress looked over and said!<br/><br/>“Hehe, it seems that Shuiyun has made a lot of arrangements for the Divine Dragon Clan. ”<br/><br/>The Emperor of angels glanced over and smiled faintly.<br/><br/>“The Divine Dragon Clan’s foundation is very strong. Shuiyun was once our comrade. We should act according to what you said. Don’t go too far! ”<br/><br/>The Black Tortoise clan’s heavenly yuan manifestation expert asked the emperor of angels and the Emperor of Phoenixes!<br/><br/>“Don’t worry, leave this matter to the people below to handle. This Dragon Palace killed our Phoenix clan’s disciples. With their strength, even if I don’t make a move, our Phoenix clan will be able to easily exterminate them. By doing so, I am already thinking of our old friendship! ”<br/><br/>The sovereign of the Phoenix replied indifferently. He looked in the direction of the teleportation formation and shouted softly, “According to what we said, cultivate well after you ‘re done! ”<br/><br/>His voice spread throughout the entire space!<br/><br/>“It’s the sovereign of the Phoenix! ”<br/><br/>The Fire Phoenix, Water Phoenix, and the Golden Phoenix king immediately replied to the sovereign of the Phoenix clan!<br/><br/>Following that, they looked at Wang Xian and the rest with eyes filled with killing intent!<br/><br/>“Dragon King of the Dragon Palace, it’s your good luck this time. It’s also the mercy of the few good fortune masters of the Heaven’s origin that spared your Dragon Palace’s dog life. ”<br/><br/>The Fire Phoenix king stared at Wang Xian, with a cold expression, he said, “However, the strong disciples of our Phoenix clan can not die in vain. All the strong practitioners of your Dragon Palace who killed our Phoenix clan have to pay with their lives!”<br/><br/>“Dragon King of the Dragon Palace, do you want us to do it personally, or do you want to commit suicide?”<br/><br/>As the king of the Fire Phoenix spoke, everyone’s gaze landed on Wang Xian!<br/><br/>This was the order of the strong practitioners of the heaven origin creation realm!<br/><br/>The Dragon Palace could be spared from destruction, but some of the strong practitioners of the Dragon Palace had to die!<br/><br/>The Dragon King of the Dragon Palace was the first to bear the Brunt!\t\t\t\t\t\t</div>", "images": {}, "success": true}