{"id": 1065, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074030.html", "title": "Chapter 4067 - Chapter 4067: The Strength Of The 4066 Dragon Palace", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4067 - Chapter 4067: The Strength Of The 4066 Dragon Palace</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4067: The strength of the 4066 Dragon Palace<br/><br/>Translator: 549690339<br/><br/>“It’s the Dragon King! ”<br/><br/>When Prime Minister Gui heard Wang Xian’s order, he nodded his head in excitement and replied loudly!<br/><br/>In the past few hundred million years, the Dragon Palace had a huge advantage in the starry universe.<br/><br/>They had even expelled the Phoenix clan and the Angel clan.<br/><br/>However, they did not dare to appear in the nine-origin universe and had been avoiding it.<br/><br/>However, the return of the Dragon King would change everything!<br/><br/>This return would shock the entire 9-origin universe.<br/><br/>This also meant that the Divine Dragon Clan had returned to its peak!<br/><br/>“Dragon King, I’ll immediately have all the disciples of the Dragon Palace<br/><br/>Return! ”<br/><br/>Prime Minister Gui said once more and immediately gave orders.<br/><br/>At the same time, he flew out and gave some orders!<br/><br/>Not long after, the roars of dragons and roars rang out in the Dragon Palace!<br/><br/>The disciples of the Dragon Palace flew into the dragon field one by one!<br/><br/>The Divine Dragons danced in the air.<br/><br/>Each and every one of the dragon seeds unleashed a powerful aura.<br/><br/>Wang Xian looked into the dragon field and flew over with a smile on his face.<br/><br/>At the side, Lin Niu transformed into his human form and followed in front of Wang Xian!<br/><br/>“Greetings, Dragon King! ”<br/><br/>“Greetings, Dragon King! ”<br/><br/>When Wang Xian arrived at the front of the Dragon Field.<br/><br/>In the Dragon Field, more than eight million disciples of the Dragon Palace had arrived and greeted him respectfully!<br/><br/>Currently, there were only more than eight million disciples of the Dragon Palace.<br/><br/>And among these eight million disciples, the lowest realm was that of a universe knight!<br/><br/>This time, Wang Xian was prepared to bring all his disciples to the holy literature field.<br/><br/>Now, the Dragon Palace also had the ability to conduct activities in the nine-origin universe without any scruples!<br/><br/>“Get Up!<br/><br/>Wang Xian’s gaze swept across the disciples of the Dragon Palace and said with a smile.<br/><br/>Wild Dragon Seed.<br/><br/>Imperial Dragon Seed.<br/><br/>Arrow Dragon Seed.<br/><br/>Spiky dragon seed.<br/><br/>Starwood Dragon Seed.<br/><br/>Heaven Lightning Earth Fire Dragon Phoenix seed.<br/><br/>Poisonous horned dragon seed.<br/><br/>Golden Dragon Guard.<br/><br/>Dragon Wizard Dragon Seed.<br/><br/>Curse Dragon Seed.<br/><br/>Charm Dragon Seed.<br/><br/>Devouring Dragon Seed.<br/><br/>Fire Hammer Dragon Seed.<br/><br/>Wait, the top dragon seed of the Dragon Palace.<br/><br/>There was also scientist Lin Wenluo who joined the Dragon Palace!<br/><br/>Apart from the dragon seed, there were nine legions of Divine Dragons!<br/><br/>Divine Dragon Legions, metal, wood, water, fire, Earth, wind, lightning, and darkness.<br/><br/>The number of divine dragons with nine attributes was in the tens of thousands.<br/><br/>These purebred divine dragons were the fruits of blood refinement that Wang Xian instructed Prime Minister Gui and the others to bring along the branches of the ancestral tree to the blood plasma domain.<br/><br/>This allowed the number of purebred divine dragons in the Dragon Palace to reach 90,000.<br/><br/>This was already a huge number.<br/><br/>And now, the leader of the Divine Dragon Army was Wang Xian’s disciple.<br/><br/>The Frost Divine Dragon of the Dragon Palace, Northern Frost!<br/><br/>In addition, the Dragon Palace had given birth to a mutated divine dragon.<br/><br/>Currently, the mutated Divine Dragon of the Dragon Palace was the Northern Frost Divine Dragon, and the bone dragon of Xiao Yu and Fan Qinglan.<br/><br/>Later on, another bone dragon and a wind and thunder divine dragon were born.<br/><br/>“You should be aware of the current situation in the nine-origin universe, right? Let’s go. We will also go to the holy literature field. After this, our Dragon Palace will be openly active in the nine-origin Universe!”<br/><br/>“No race or faction would dare to offend us!”<br/><br/>Wang Xian’s eyes sparkled as he spoke to the group of disciples.<br/><br/>“It’s the Dragon King! ”<br/><br/>The group of disciples from the Dragon Palace responded loudly!<br/><br/>“Let’s Go! ”<br/><br/>Wang Xian instructed them indifferently!<br/><br/>The group of disciples from the Dragon Palace responded loudly!<br/><br/>“Roar! Roar! Roar!”<br/><br/>The nine wind god Dragons immediately flew to the front while a dragon throne was condensed at the back.<br/><br/>These were the nine wind god dragons that followed Wang Xian first.<br/><br/>Currently, they had the strength of a level five universe overlord.<br/><br/>Their strength was not strong.<br/><br/>However, they were considered pretty good in the Dragon Palace!<br/><br/>Wang Xian moved his body and came to the dragon throne.<br/><br/>Prime Minister Gui and Lin Niu were standing on the left and right.<br/><br/>Lin Niu had transformed into a middle-aged man.<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>Accompanied by the roars of the nine divine dragons, the Wind Divine Dragon pulled the dragon throne and carried Wang Xian quickly toward the teleportation formation in the Dragon Palace.<br/><br/>All the other disciples of the Dragon Palace immediately followed behind!<br/><br/>This time, except for Lan Qingyue and the Dragon Queen, Xiao Lan and the rest who didn’t come.<br/><br/>The other disciples of the Dragon Palace followed behind.<br/><br/>Now, Lan Qingyue, Little Blue, and the others had completely merged with the universe.<br/><br/>When they returned to the nine-origin universe, they would be suppressed by the nine-origin universe.<br/><br/>Guan Shuqing and the others were with Lan Qingyue.<br/><br/>They were in the land of thunder and lightning. They were at the edge of the infinite universe.<br/><br/>They had the token of chaos, so they were safe.<br/><br/>Buzz<br/><br/>The main dragon palace was in a very remote place.<br/><br/>However, there were still many dragon palaces in other places in the nine-origin universe.<br/><br/>They could teleport between dragon palaces!<br/><br/>They came to a dragon palace which was close to the saint’s Branch and teleported there.<br/><br/>“Roar! Roar! Roar!”<br/><br/>They arrived at the center of the heaven-splitting chaotic land.<br/><br/>After flying out of the Dragon Palace, the Nine Wind Divine Dragons roared once again. They flew toward the saint’s lineage’s sacred literature field in a mighty manner!<br/><br/>“Linniu, hide your strength for a while. I want to see what tricks the Phoenix clan and the Angel clan are trying to pull. ”<br/><br/>Wang Xian waved his arm and sped up the flying speed of the disciples of the Dragon Palace.<br/><br/>He instructed Linniu who was beside him.<br/><br/>“Alright, Dragon King. I will do my best to hide my aura. If I don’t use my energy, it will be hard to detect it.”<br/><br/>Linniu nodded immediately.<br/><br/>After a period of time, Linniu’s strength had increased by a lot.<br/><br/>Lin Niu was different from an ordinary heavenly yuan creation realm expert who had just broken through.<br/><br/>His breakthrough relied on devouring the Heavenly Yuan creation above him to evolve.<br/><br/>He was born with the flesh and blood of the Heavenly Yuan creation realm, and then he devoured the corpse of this heavenly Yuan creation realm expert.<br/><br/>His breakthrough in strength also inherited all the secret skills and combat abilities of the Aga Heavenly Demon God.<br/><br/>His strength was much stronger than the Heavenly Yuan creation realm that he had just broken through.<br/><br/>After all, experience was also very important.<br/><br/>Under the situation where the unicorn ox was motionless and fully concealed, unless it was a heaven’s origin creation that used energy to probe over, he wouldn’t be able to detect it at all.<br/><br/>Otherwise, he wouldn’t be able to detect it at all!<br/><br/>As for Wang Xian’s own strength, he was at the seventh level of the universe dominator.<br/><br/>This was his realm.<br/><br/>Under the situation where Wang Xian wasn’t hiding, he was able to detect the Heaven’s origin creation!<br/><br/>Okay!<br/><br/>Wang Xian nodded his head and looked at the location in front of him.<br/><br/>This location was not too far away from the domain of the Saints.<br/><br/>With Wang Xian’s acceleration, their speed was extremely terrifying.<br/><br/>In fact, they only needed a dozen hours to reach the holy literature field!<br/><br/>When Wang Xian led the disciples of the Dragon Palace over there.<br/><br/>At the Holy Literature Field, a group of strong disciples were already preparing to enter the tree of chaos through the teleportation formation!\t\t\t\t\t\t</div>", "images": {}, "success": true}