{"id": 1069, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074038.html", "title": "Chapter 4071 - Chapter 4071: The 4,070 Beings From The Nine-Origin Universe Were Shocked", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4071 - Chapter 4071: The 4,070 Beings From The Nine-Origin Universe Were Shocked</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4071: The 4,070 beings from the nine-origin universe were shocked<br/><br/>Translator: 549690339<br/><br/>“The emperor of the Phoenix, Feng Qing Lou, HMPH! ”<br/><br/>Wang Xian looked at the attack of the Emperor of the Phoenix and a cold expression appeared on his face!<br/><br/>He stretched out his palm and formed a dragon claw that went straight for the Phoenix Claw!<br/><br/>Bang<br/><br/>A terrifying collision sound was heard. The dissipating energy was blocked by Wang Xian and the Emperor of the Phoenix!<br/><br/>“This? ? The Dragon King of the Dragon Palace has broken through to the<br/><br/>Heaven’s origin destiny realm. How is this possible? How long has it been? How can he break through so quickly?”<br/><br/>“The Heaven’s origin destiny realm is able to receive the attack of the Emperor of Phoenix. The Dragon King of the Dragon Palace is a heaven’s origin destiny realm. Why is his speed of improvement so terrifying?”<br/><br/>“Hiss, how is this possible? How is this possible? The Dragon King of the Dragon Palace has only cultivated for a short period of time! ”<br/><br/>They were stunned!<br/><br/>At this moment, all the living beings in the nine-origin universe were completely shocked when they saw Wang Xian receiving the attack of the Emperor of the Phoenix!<br/><br/>The Heaven’s origin creation!<br/><br/>The Dragon King of the Dragon Palace possessed the strength of the Heaven’s origin creation!<br/><br/>This? ?<br/><br/>This made them feel extremely incredulous!<br/><br/>Was it so easy to break through the Heaven’s origin creation?<br/><br/>How long had the Dragon King of the Dragon Palace cultivated for, and he had already reached this realm?<br/><br/>It was unbelievable!<br/><br/>“It’s not the Heaven’s origin ability. Does he have seven attributes? No, it should be the powers of the nine attributes. He has completely fused the powers of these nine attributes together. ”<br/><br/>The Xuanwu clan’s Heaven’s origin ability stared at Wang Xian and suddenly spoke. There was a hint of shock in his voice.<br/><br/>He could sense the nine attributes contained in Wang Xian’s body!<br/><br/>These nine attributes were perfectly fused together.<br/><br/>This made him feel a little incredulous!<br/><br/>The fusion of the two attributes was already considered a mutation!<br/><br/>The fusion of the three attributes was rare in the entire nine-origin universe.<br/><br/>In the past, only the five-elemental divine dragons of the Divine Dragon Clan were considered to have the highest number of attributes.<br/><br/>However, the Dragon King of the Dragon Palace had actually fused the nine attributes together!<br/><br/>The strength of the nine attributes combined allowed the Dragon King of the Dragon Palace to fight against the Heavenly Yuan creation without reaching the Heavenly Yuan creation realm!<br/><br/>This went against their knowledge!<br/><br/>How did the nine attributes merge?<br/><br/>“This? “When I met him in the past, there were only seven attributes. At that time, it was impossible for the light and darkness attributes to merge with the five attributes. He had the wind and thunder attributes at that time, but the wind and thunder attributes were external objects. How did he merge all nine attributes together?”<br/><br/>“Was it the arrangement of Shuiyun? Shuiyun has paved an unprecedented path to heaven for him?”<br/><br/>The Elven empress was also looking at Wang Xian in shock.<br/><br/>The fusion of the nine attributes was too unbelievable!<br/><br/>“What? The Dragon King of the Dragon Palace has nine attributes?”<br/><br/>“The Dragon King has not reached the Heavenly Yuan blessed realm, but he can fight against the Heavenly Yuan blessed realm? Is it because he has fused nine attributes?”<br/><br/>“Attributes can be cultivated in the later stages, but with each additional attribute, the speed of cultivation will be twice as difficult. The increase in combat strength will be limited. The Dragon King actually has nine attributes. How did he cultivate?”<br/><br/>When the surrounding nine-origin universe’s strong disciples heard the words of the few Heaven’s origin creation stage powerhouses, their faces were filled with shock!<br/><br/>The expressions of the other few Heaven’s origin creation stage powerhouses changed slightly as they stared at Wang Xian!<br/><br/>When the Emperor of Phoenix saw Wang Xian easily blocking his attack, he knew that Wang Xian was not on the same level as him.<br/><br/>However, their combat strength was not much different.<br/><br/>The Heaven’s origin creation realm had the same level of combat strength.<br/><br/>Even if he was stronger than him and could suppress him, it would be extremely difficult to destroy him!<br/><br/>His expression did not look good!<br/><br/>He did not expect that the remnants of the Divine Dragon Clan would give birth to an existence on the level of the Heaven’s origin creation realm so quickly.<br/><br/>“A combat strength at the level of the Heaven’s origin creation. Dragon King of the Dragon Palace, do you think that you don’t have to pay a price just because your strength has reached this level?”<br/><br/>The emperor of Phoenix’s eyes gradually turned cold. He swept his gaze across the Emperor of angels and continued speaking coldly!<br/><br/>“Your Phoenix clan deserves to die. ”<br/><br/>Wang Xian looked at the emperor of Phoenix and replied with a cold expression.<br/><br/>He looked around and swept his cold gaze across the powerful disciples of the Phoenix Clan!<br/><br/>“Dragon King, do you think that you can do whatever you want just because you have the combat strength of the Heaven’s origin blessed realm? You Dare to provoke the Phoenix clan and Our Angel Clan?”<br/><br/>“Do you know that powerful people in the Heaven’s origin blessed realm can also die?”<br/><br/>The Emperor of angels stared at Wang Xian and narrowed his eyes. He asked coldly!<br/><br/>“Hehe, Emperor of angels, do you think that I don’t dare to kill the disciples of your Angel clan just because they provoked my Dragon Palace?”<br/><br/>Wang Xian stared at the Emperor of angels and replied coldly, “You also know that the Heaven’s origin Destiny Realm will die? Hehe! ”<br/><br/>“Hahaha, crazy, really crazy. A Kid who has just attained the strength of the Heaven’s origin destiny realm is actually so arrogant. It’s the first time I’ve seen such an arrogant fellow after experiencing two aeons! ”<br/><br/>The emperor of Phoenix laughed maniacally when he heard Wang Xian’s words.<br/><br/>A red cloud suddenly appeared in the sky above him!<br/><br/>The Red Cloud contained a terrifying power. He stared at Wang Xian with a hint of killing intent in his eyes!<br/><br/>“He is indeed a little arrogant. He is still a little arrogant. ”<br/><br/>The Emperor of angels said coldly. With a wave of his arm, a gray sword appeared in his hand!<br/><br/>There were twelve wings on his back.<br/><br/>The luster on them began to shine!<br/><br/>He stared at Wang Xian calmly, but he could unleash a fatal destructive attack at any time!<br/><br/>At the side, the other seven heaven origin creation realm powerhouses from the nine-origin universe frowned slightly when they saw this scene!<br/><br/>“Please calm down, the three of you are also powerhouses from the nine-origin universe. The calamity is about to arrive. We are on the same side!<br/><br/>Hetian saint extended his hand and said to them, wanting to reconcile!<br/><br/>“It’s a good thing for us to have one more heavenly yuan creation realm expert in our nine-origin universe. Don’t fight with each other and fight against the outside! ”<br/><br/>The middle-aged Heavenly Yuan creation realm expert from the royal family also said!<br/><br/>“Yes, there’s no need to fight. Emperor of Phoenix, Emperor of angels, it will be very difficult for you to get rid of the Dragon King. To put it bluntly, even if you can get rid of him, your Phoenix family and the Angel family will suffer heavy losses. It’s not an irreconcilable grudge. Let’s shake hands and make peace !<br/><br/>The Netherworld Race’s heavenly fate was also in agreement!<br/><br/>The Emperor of the Phoenix and the emperor of the angels frowned slightly when they heard the heavenly fate powerhouses speak.<br/><br/>The other heavenly fate powerhouses were also telling the truth.<br/><br/>The Emperor of the Phoenix and the emperor of the angels were confident that they could kill the Dragon King now.<br/><br/>However, the Dragon King definitely had a resurrection treasure.<br/><br/>What if he resurrected and killed the disciples of their Angel and Phoenix Race?<br/><br/>They don’t have much confidence in destroying them 100% !<br/><br/>But they aren’t willing to let it go!\t\t\t\t\t\t</div>", "images": {}, "success": true}