{"id": 1068, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074036.html", "title": "Chapter 4070 - Chapter 4070: When 4069 Made His Move, He Was Instantly Killed", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4070 - Chapter 4070: When 4069 Made His Move, He Was Instantly Killed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4070: When 4069 made his move, he was instantly killed<br/><br/>Translator: 549690339<br/><br/>“Dragon King of the Dragon Palace, do you want us to do it personally, or do you want to commit suicide?”<br/><br/>When the king of the Fire Phoenix said this, all the strong disciples in the surroundings looked at Wang Xian.<br/><br/>“The Masters of the Heaven’s origin destiny realm have already given the order. The Dragon King of the Dragon Palace is going to be finished!”<br/><br/>“This might be a good choice for the Dragon Palace. Although the Dragon Palace is very strong, there is still a huge gap between them and the two peak races. Once the Dragon Palace’s lair is exposed or when the calamity arrives, the Phoenix and Angel clans will definitely destroy the Dragon Palace. Since they haven’t destroyed it yet, this can be considered as giving them a chance! ”<br/><br/>Some of the experts from the peak races around looked at Wang Xian and the rest and whispered to each other!<br/><br/>“Hehe! ”<br/><br/>Wang Xian laughed when he heard the words of the king of the Fire Phoenix.<br/><br/>“If you want revenge, then do it yourself. There are tens of thousands of phoenixes that have died in my hands. Hehe! ”<br/><br/>He looked at the king of the Fire Phoenix and continued to mock with a smile!<br/><br/>Wang Xian didn’t have a good impression of the Phoenix clan.<br/><br/>It wasn’t just because of the hatred between them. There was also the matter between the Divine Dragon Clan and the Phoenix clan.<br/><br/>If he had the chance, he wouldn’t mind exterminating the fire Phoenix clan!<br/><br/>However, he didn’t have the ability to do so yet.<br/><br/>However, his dragon palace wasn’t someone that the Fire Phoenix clan could bully!<br/><br/>“You’re courting death, Little Dragon King of the Dragon Palace. Today, we will behead you to honor the disciples of my Phoenix Clan!”<br/><br/>As soon as Wang Xian finished his sentence, all the strong disciples in the surroundings were slightly shocked. Their faces were filled with shock!<br/><br/>The seventh elder of the Phoenix clan instantly burst into flames of fury.<br/><br/>He stared at Wang Xian and instantly flapped his phoenix wings to attack Wang Xian!<br/><br/>“This dragon king still dares to be so arrogant at a time like this. Kill him!”<br/><br/>“If it wasn’t for Lord Tianyuan, all the disciples of Your Dragon Palace would have died. All of them would have been annihilated! ”<br/><br/>“He doesn’t know what’s good for him. How can a small dragon palace be so arrogant! ”<br/><br/>The group of strong disciples from the Phoenix clan looked at Wang Xian and roared furiously as well!<br/><br/>The eyes of the Angel Race’s Radiant Angel King and the rest turned cold as well!<br/><br/>They also flapped their twelve wings and held the archangel sword in their hands!<br/><br/>“The Phoenix clan’s strong ones are making their move! ”<br/><br/>“This is a flamewing Phoenix, a flamewing Phoenix at the peak of the Universe Overlord realm. His strength is very terrifying. He should be a strong one specially nurtured by the Phoenix Emperor! ”<br/><br/>The sudden attack of the seventh elder of the Phoenix clan shocked all the powerful disciples around him!<br/><br/>They could feel the terrifying power of the flamewing Phoenix and their faces were filled with respect.<br/><br/>An existence at this level was the most powerful existence under the Heaven’s origin in the entire nine-origin universe!<br/><br/>It was above the peak of the Universe Dominator realm.<br/><br/>“Humph! ”<br/><br/>When Wang Xian saw the flamewing Phoenix attacking him, a cold and disdainful look appeared in his eyes!<br/><br/>The Flaming Phoenix arrived 10,000 meters in front of Wang Xian in the blink of an eye.<br/><br/>Its body was exuding an extremely terrifying power of flames.<br/><br/>The power of flames covered a large area!<br/><br/>It was a completely aoe attack.<br/><br/>This move didn’t just want to destroy Wang Xian.<br/><br/>It also wanted to destroy all the strong disciples around Wang Xian!<br/><br/>Wang Xian stared at him with a cold look in his eyes!<br/><br/>He waved his arm and a sword of wind and thunder was formed instantly.<br/><br/>The Sword of wind and thunder was exuding a terrifying speed and disappeared in front of him in an instant!<br/><br/>In the next moment, the seventh elder of the Phoenix clan who was flying towards Wang Xian froze.<br/><br/>His charging momentum weakened instantly!<br/><br/>His pupils dilated slowly. They were filled with disbelief and shock!<br/><br/>However, it was not just the seventh elder of the Phoenix clan!<br/><br/>At the back, the Phoenix Clan’s fire Phoenix King, Water Phoenix King, and Golden Phoenix King.<br/><br/>At this moment, all of their bodies trembled violently!<br/><br/>There was a bloody scar on their necks!<br/><br/>The terrifying power of wind and thunder had already entered their bodies and wiped out their vitality in an instant!<br/><br/>In an instant, Wang Xian killed four of the top existences of the Phoenix race!<br/><br/>However, at this moment, a Phoenix Egg was burning above the heads of the three fire Phoenix Kings!<br/><br/>The Phoenix Egg landed in the bodies of the Fire Phoenix King, the Water Phoenix King, and the Golden Phoenix King!<br/><br/>It brought them back to life!<br/><br/>“Lord Emperor of the Phoenix, save me! ”<br/><br/>At this moment, the three Phoenix Kings widened their eyes and let out a furious roar filled with fear and shock!<br/><br/>They quickly retreated!<br/><br/>“Retreat, all Phoenix Disciples, Retreat! ”<br/><br/>As they retreated, they roared crazily!<br/><br/>They looked at Wang Xian with disbelief and shock!<br/><br/>The sudden turn of events left everyone dumbfounded!<br/><br/>What was going on?<br/><br/>What was going on?<br/><br/>At the side, all the strong disciples of the Angel clan were also dumbfounded!<br/><br/>This? ?<br/><br/>“What’s going on?”<br/><br/>An expert of the Phoenix clan could not help but growl in a low voice!<br/><br/>At this moment, the body of the seventh elder of the Phoenix clan was falling from the front!<br/><br/>It answered everyone!<br/><br/>“Hiss, how is this possible? The seventh elder of the Phoenix clan was killed in an instant! ”<br/><br/>“It was the Dragon King. It was the Dragon King who made the move! ”<br/><br/>A shocked voice rang out. The rest of the strong disciples in the surroundings were also looking at this scene in shock!<br/><br/>Buzz! Buzz<br/><br/>“You ‘re courting death! ”<br/><br/>The Emperor of the Phoenix, who was standing on the branch of the Tree of Chaos, saw this scene from afar. His expression changed drastically!<br/><br/>In fact, the moment Wang Xian made his move.<br/><br/>They could sense this terrifying power.<br/><br/>This power was definitely not something that a ruler could unleash!<br/><br/>The Heaven’s origin creation!<br/><br/>“The Heaven’s origin creation, the Dragon Palace has the Heaven’s origin creation?”<br/><br/>The unity saint was slightly shocked. He looked in the direction of the Dragon Palace and revealed a shocked expression.<br/><br/>He also moved his body and flew over instantly!<br/><br/>The Elven empress was also slightly shocked. She immediately flew over!<br/><br/>In front of the Dragon Palace, the Eight Heaven’s origin destinies were staring at Wang Xian!<br/><br/>“A piece of trash dares to attack me?”<br/><br/>When Wang Xian saw the emperor of Phoenix and the rest flying over, he waved his arm and directly grabbed the corpse of the seventh elder of the<br/><br/>Phoenix clan!<br/><br/>His head and body had already been separated!<br/><br/>“Just nice, this Phoenix head can be used as a decoration for the Dragon palace !<br/><br/>He looked at the head and said indifferently!<br/><br/>Buzz<br/><br/>When the Emperor of Phoenix heard Wang Xian’s words, an extremely ugly expression appeared on his face!<br/><br/>He stretched out a phoenix claw!<br/><br/>The Phantom of the Phoenix Claw instantly clawed at Wang Xian!<br/><br/>When the other seven heaven origin creation realm powerhouses saw this scene, they frowned slightly and didn’t move!<br/><br/>They also wanted to see if Wang Xian had the strength of Tianyuan..\t\t\t\t\t\t</div>", "images": {}, "success": true}