{"id": 1061, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074022.html", "title": "Chapter 4063 - Chapter 4063: 4062 Token Of The Nine-Origin Universe’S Heavenly Yuan Creation", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4063 - Chapter 4063: 4062 Token Of The Nine-Origin Universe’S Heavenly Yuan Creation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4063: 4062 token of the nine-origin universe’s Heavenly Yuan creation<br/><br/>Translator: 549690339<br/><br/>The appearance of the Tree of chaos was a huge opportunity for the nine-origin universe.<br/><br/>It was also an opportunity for the heavenly yuan creation-level experts.<br/><br/>If they were lucky, they might be able to obtain powerful treasures.<br/><br/>The eyes of the eight heavenly yuan creation-level experts flashed.<br/><br/>“If that’s the case, then let some of our nine origin universe’s disciples come<br/><br/>An old man with a turtle shell on his back said with a smile.<br/><br/>(‘En, that’s fine. Currently, our nine origin universe still has a heaven origin creation realm seat. Let’s see if there’s any expert who can fill it!”<br/><br/>A middle-aged man dressed in black clothes with a huge writing brush and a scroll on his back nodded and said.<br/><br/>“We’ll see when the time comes. It’s been a long time since we’ve returned to the nine origin universe. I wonder if there are any good seedlings. Everyone, call out those disciples that you’ve nurtured in the secret land.”<br/><br/>“The calamity is about to arrive in two billion years. This time, we’ll see if we can attack the Void Universe. Humph, in the first two calamities, they provoked US time and time again and killed countless of our disciples. This time, we’ll teach them a lesson.”<br/><br/>A middle-aged man covered in flames said with a sinister expression.<br/><br/>The others nodded, their eyes filled with coldness.<br/><br/>“Call the 12 ancestral warlocks over and have them set up a long-distance teleportation array. Let’s return to the 9-essences universe to take a look! ” An illusory figure said as he flew straight towards the 9-essences universe!<br/><br/>“Eh? Our clan leader has ordered us all to return?”<br/><br/>The Starry Universe.<br/><br/>In a piece of void space, a huge starry city was floating in the air. On top of the city, there were the powerful disciples of various races.<br/><br/>Among the peak and high-level races in the nine-origin universe, other than the Phoenix race and the angel race, there were no other races.<br/><br/>There were powerful disciples from other races.<br/><br/>Since the battle in front of the starry giant city, after Wang Xianli killed the Phoenix race and the angel race, the two dominant races,.<br/><br/>There were no strong disciples of the two races in the entire starry universe.<br/><br/>When the strong disciples of the Dragon Palace met the strong disciples of the two races, they would also hunt them down.<br/><br/>Now, the Phoenix race and the angel race had completely given up on the starry universe.<br/><br/>On this day, the powerful disciples in the Starry Cosmos received an order.<br/><br/>The order to return!<br/><br/>“The other peak races have also given this order. It seems that all of us peak races are going back. Did Something Happen?”<br/><br/>(‘I don’t know. Something big must have happened. We can go back too. Now, the entire starry cosmos has been searched by us, and there aren’t many treasures left. ”<br/><br/>(‘We can’t enter the infinite universe. The treasures and resources in other places have basically been used up. In these hundreds of millions of years, we’ve improved a lot. ”<br/><br/>The disciples of the peak races discussed.<br/><br/>There wasn’t much loss if they went back now.<br/><br/>Now, they only had the infinite universe that they hadn’t explored.<br/><br/>But that place wasn’t something they could touch.<br/><br/>Soon, all the powerful disciples of the peak races returned to the nine-origin universe!<br/><br/>“What happened?”<br/><br/>At the same time, Prime Minister Gui and the others in the Dragon Palace received this message and looked puzzled.<br/><br/>He took out the universal Al and sent a message to some powerful experts of the peak races.<br/><br/>A few hundred million years ago, although the Dragon Palace was at loggerheads with the Angel Race and the Phoenix race, they would not rest until one of them died.<br/><br/>However, their relationship with the other peak races was not bad.<br/><br/>The Dragon Palace was the strongest in the universe, and many of the peak races had cooperated with the Dragon Palace.<br/><br/>Especially the skeleton race and the ELF race, they had cooperated with the Dragon Palace many times.<br/><br/>Soon, an expert from the skeleton clan sent a message.<br/><br/>It was the Heavenly Yuan creation realm expert who asked them to come back.<br/><br/>When this message reached the Dragon Palace, Prime Minister Gui was slightly stunned and showed a stunned expression.<br/><br/>“Heavenly Yuan creation realm expert? Why did they ask all the strong disciples of the nine-origin universe to come back? Coincidentally, the Dragon King has also come back. The Dragon King’s strength is not weaker than the<br/><br/>Heavenly Yuan creation realm now. ”<br/><br/>Prime Minister Gui muttered, his eyes shining.<br/><br/>“All the disciples of the nine-origin universe above the level of a universe knight have come to the holy literature field. ”<br/><br/>“All the living beings around the heaven-opening primal continent have entered the inner part of the heaven-opening primal continent. After that, no fighting among the powerful beings of any race is allowed. Anyone who disobeys will be beheaded! ”<br/><br/>A month later, a news spread throughout the entire nine-origin universe.<br/><br/>The news came from the saint lineage. It wasn’t a message from the saint lineage, but a message from the Hetian saint himself.<br/><br/>This news was released on the universe’s Al and spread to every corner and every place in the nine-origin universe.<br/><br/>Once this news was released, it caused a huge sensation.<br/><br/>The Hetian saint was the founder of the saint lineage and one of the top existences in the nine-origin universe.<br/><br/>He was a legendary existence.<br/><br/>He was a supreme existence at the heaven origin creation level.<br/><br/>No race or powerhouse dared to ignore this news.<br/><br/>All the powerhouses of the peak races rushed toward the sacred literature field.<br/><br/>As for the races outside the heaven opening desolate continent, they rushed toward the continent excitedly.<br/><br/>No one dared to disobey the orders of the Hetian saint.<br/><br/>And no one dared to disobey the orders of the unity saint.<br/><br/>Even the races that were mortal enemies immediately stopped fighting and did not dare to offend him.<br/><br/>Anyone who dared to disobey the orders of such a great being was courting death!<br/><br/>And now that they were able to enter the land, it was a huge opportunity for them.<br/><br/>Countless disciples of the races rushed towards the land.<br/><br/>At the location of the Holy Literature Field, a large number of universe knight level Great Beings were rushing there!<br/><br/>Including the other peak races.<br/><br/>This time, what was to be announced was very important to the entire 9-origin universe.<br/><br/>It was related to the future calamity.<br/><br/>The future strength of the 9-origin universe.<br/><br/>And during this period, a large number of unfamiliar great beings suddenly appeared among the peak races.<br/><br/>These experts were all at least at the level 6 universe Overlord Realm!<br/><br/>The strength of each peak race seemed to have inexplicably increased by a lot.<br/><br/>“HM? That Divine Dragon clan actually killed so many experts of our Phoenix clan. The former Divine Dragon Clan has already been destroyed, and now, we actually suffered such a huge loss from the newly risen Divine Dragon Clan?”<br/><br/>Over a million purebred phoenixes flew towards the sacred literature field in the void.<br/><br/>In the center, a flamewing Phoenix spoke with a cold gaze.<br/><br/>Flamewing phoenixes were mutated existences within the Phoenix clan..\t\t\t\t\t\t</div>", "images": {}, "success": true}