{"id": 1076, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074052.html", "title": "Chapter 4078 - Chapter 4078: 4077 Fire Element!", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4078 - Chapter 4078: 4077 Fire Element!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4078: 4077 fire element!<br/><br/>Translator: 549690339<br/><br/>The terrifying lightning struck towards Wang Xian!<br/><br/>The dazzling purple lightning struck Wang Xian’s dragon claw as though it was about to break through Wang Xian’s grasp!<br/><br/>“HMPH!”<br/><br/>Wang Xian snorted softly when he saw this scene.<br/><br/>His body moved and instantly transformed into the body of a divine dragon!<br/><br/>His gigantic body moved towards the purple lightning!<br/><br/>Wang Xian let out a low roar. From the dragon horn, chains were moving towards the purple lightning bolt!<br/><br/>“Hualala!”<br/><br/>Countless chains wrapped around the entire lightning bolt!<br/><br/>“Crackle, Crackle! ”<br/><br/>“Crackle, crackle, crackle! ”<br/><br/>The terrifying lightning bolt tried to break free, but it was completely blocked by Wang Xian!<br/><br/>“Crack, crack, crack!”<br/><br/>Wang Xian stretched out his dragon claws again and clawed at the Purple Lightning!<br/><br/>The exploding lightning was clawed over by him. Wang Xian could sense the power of the lightning!<br/><br/>“Substantial energy, born in the chaos, has a terrifying destructive power. It can be refined and used as a treasure. It can also be absorbed.”<br/><br/>“However, to absorb it, one may need to be extremely strong. At the very least, one must be at the peak of the Universe Overlord realm. If one can absorb it at this realm, one’s combat strength will be greatly enhanced! ” Wang Xian spoke as he felt the energy on the lightning bolt!<br/><br/>Unfortunately, this lightning bolt wasn’t of much use to him!<br/><br/>“Boss, the items that can be born in the chaos are all treasures.”<br/><br/>Lin Niu, who was at the side, spoke up! “They should all be treasures! ”<br/><br/>Wang Xian nodded his head slightly.<br/><br/>In the chaos, there was a dead silence!<br/><br/>The items that could be born here were all treasures.<br/><br/>Moreover, they were all powerful treasures.<br/><br/>Just like the Purple Thunderbolt in Wang Xian’s hand. Its rarity was far from what an innate treasure could compare to!<br/><br/>“This thunderbolt shouldn’t be considered as a very precious treasure in the chaos. ”<br/><br/>Wang Xian spoke again.<br/><br/>Although this purple Thunderbolt was born, there was no energy in the chaos. It was dead silent.<br/><br/>In the chaos, it would suffer from the wear and tear of energy.<br/><br/>From the situation just now, it could not withstand the wear and tear of the chaos.<br/><br/>Before long, it would be completely destroyed!<br/><br/>According to Wang Xian’s guess, an item that could truly stand in the chaos was definitely a very powerful existence.<br/><br/>Just like the tree of chaos.<br/><br/>If the tree of chaos possessed offensive energy, it would definitely be an existence that could destroy the world.<br/><br/>It could easily destroy a universe.<br/><br/>“Let’s continue our search. According to the elven empress, there will be treasures around the tree of chaos. Let’s see if we can encounter some powerful treasures. ”<br/><br/>Wang Xian spoke to Lin Niu and flew straight ahead!<br/><br/>“It’s the Dragon King! ”<br/><br/>Lin Niu nodded and followed at the side!<br/><br/>Wang Xian and the rest were flying very fast in the chaos. However, it was unknown how big the chaos was.<br/><br/>In short, the chaos encompassed a large amount of the universe.<br/><br/>The size of the chaos was not something the universe could compare to!<br/><br/>Wang Xian and the rest continued flying. However, their luck was not as good!<br/><br/>After flying for more than ten years, Wang Xian and the rest did not sense the existence of any treasures. There was nothing unusual either.<br/><br/>It was all gray.<br/><br/>Loneliness, loneliness!<br/><br/>They continued to fly. In the blink of an eye, they flew for another ten thousand years.<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>There was some time lost in the chaos. On this day, the rumbling sound was heard once again!<br/><br/>Wang Xian, Lin Niu, and the rest, who had been flying for more than ten thousand years, had a gleam in their eyes!<br/><br/>“Boss, there’s movement on the right front. It’s been more than 10,000 years. Finally, there’s movement again! ” Lin Niu’s excited voice was heard!<br/><br/>Flying in the chaos was very boring.<br/><br/>This was the first time they had flown for more than 10,000 years.<br/><br/>One must know that with their strength, they could fly more than 100 times in the same universe!<br/><br/>And in the chaos, they didn’t notice anything strange for more than 10,000 years!<br/><br/>Wang Xian smiled too!<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>However, at this moment, he focused his gaze and looked at the position in front of him on the right!<br/><br/>There, he could sense an extremely terrifying energy attacking him!<br/><br/>“Boss, something doesn’t seem right! ”<br/><br/>Lin Niu stared ahead and his heart tightened. He growled in a low voice!<br/><br/>Something doesn’t seem right! ”<br/><br/>Wang Xian nodded his head.<br/><br/>At this moment, their eyes suddenly focused!<br/><br/>The area in front of them suddenly turned fiery red!<br/><br/>A Sea of fire and a wave of fire suddenly surged towards Wang Xian and the rest!<br/><br/>It wasn’t heading towards Wang Xian and the rest. Instead, the area of this sea of fire and wave of fire was too huge.<br/><br/>It was so huge that one couldn’t see the end of it. It covered Wang Xian and the rest completely!<br/><br/>“What’s the situation?”<br/><br/>Wang Xian’s eyes flickered slightly when he saw the terrifying sea of fire!<br/><br/>The power of the Sea of fire wasn’t very strong, but it was enough to rival the attack of a fire-attributed heaven origin creator!<br/><br/>The Sea of fire was surging towards Wang Xian and the rest at a terrifying speed!<br/><br/>“Boss, the power of the Sea of Fire isn’t That Great.”<br/><br/>Lin Niu said!<br/><br/>“That’s not right. If it’s just this kind of power, it will be extinguished very quickly in the chaos. It’s impossible for it to cover such a terrifying area. We should be at the edge of the Sea of fire, so the power isn’t that great! ” Wang Xian’s eyes sparkled as he said!<br/><br/>A powerhouse at the peak of the Universe Dominator wouldn’t be able to survive for long in the chaos.<br/><br/>And this sea of fire was like a flaming storm that was wreaking havoc in the chaos. It was definitely not that simple!<br/><br/>“Boss, doesn’t that mean that there might be a powerful treasure in the middle of this sea of Fire?”<br/><br/>Lin Niu’s eyes lit up.<br/><br/>“It’s possible. The power and range of this sea of fire is millions of times greater than the lightning we encountered. ”<br/><br/>Wang Xian spoke.<br/><br/>Boom<br/><br/>They stood there without moving!<br/><br/>At this moment, the edge of the Sea of fire covered them!<br/><br/>A wave of heat surged over.<br/><br/>Following that, they fell into the Sea of fire.<br/><br/>The Flames in the Sea of fire were not all fiery red. There were also blue and white flames!<br/><br/>Especially those white flames. They were abnormally terrifying.<br/><br/>Wang Xian was covered by the Sea of fire and was fine.<br/><br/>“Let’s go to the center.”<br/><br/>Wang Xian hesitated for a moment and said.<br/><br/>He moved and approached the center of the Sea of fire.<br/><br/>He could sense that the power of the Flames in the center was much stronger!<br/><br/>“There should be a physical energy body in this sea of Fire! ” Lin Niu guessed as he sensed the surrounding flames.<br/><br/>The surrounding flames were not physical.<br/><br/>This also meant that this sea of fire was emitted by a flame that had a physical form of energy!<br/><br/>Wang Xian nodded his head in agreement.<br/><br/>How powerful was an existence that could emit such flames?\t\t\t\t\t\t</div>", "images": {}, "success": true}