{"id": 1078, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074056.html", "title": "Chapter 4080 - Chapter 4080: The Battle Between The 4079 Elemental Gods", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4080 - Chapter 4080: The Battle Between The 4079 Elemental Gods</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4080: The battle between the 4079 elemental gods<br/><br/>Translator: 549690339<br/><br/>Buzz Buzz<br/><br/>Wang Xian followed the white flame flower as they flew.<br/><br/>The world around them was filled with flames. It was extremely terrifying!<br/><br/>Amidst the chaos, a special scenery was formed!<br/><br/>At this moment, his communication device rang. Wang Xian opened it with a thought!<br/><br/>After reading the contents, he narrowed his eyes slightly.<br/><br/>Wang Xian told the elven empress about his situation.<br/><br/>He received a piece of information from the Elven empress!<br/><br/>The flame flower beside him that he was following was the god of elements in the chaos.<br/><br/>The so-called elements were the water element and fire element!<br/><br/>The elements were also known as the origin.<br/><br/>This flame flower was the origin of fire, the fire element!<br/><br/>This type of elemental god was one of the more common ones in the chaos.<br/><br/>The weaker elemental gods could be controlled and made into weapons, which were helpful for cultivation.<br/><br/>But the powerful elemental gods were very terrifying!<br/><br/>They couldn’t be controlled or captured.<br/><br/>They flew in the universe and would approach the universe that had its own elements.<br/><br/>When they found the universe, they would enter the universe and stop.<br/><br/>Finally, they would become a blessed land in the universe.<br/><br/>They would become a treasured land!<br/><br/>The stronger the Elemental God, the more powerful the treasured land would be.<br/><br/>When the tree of chaos arrived not far from the nine-origin universe, more elemental gods would be born around it.<br/><br/>80% of these elemental gods would enter the nine-origin universe and form a blessed land in the nine-origin universe.<br/><br/>Therefore, the appearance of the tree of chaos around the nine-origin universe was also an opportunity for the nine-origin universe.<br/><br/>Naturally, there would be more experts in the grotto-heaven blessed land.<br/><br/>Wang Xian was slightly disappointed when he saw the message sent by the Elven empress!<br/><br/>He thought that he had encountered a treasure.<br/><br/>He thought that he could control this flame flower.<br/><br/>If he could control it, it would be a terrifying combat strength!<br/><br/>However, when Wang Xian saw the information below, his eyes sparkled.<br/><br/>The Elven empress had sent him many messages.<br/><br/>The Elemental God had many benefits.<br/><br/>Firstly, cultivators of the same attribute would not be attacked by the Elemental God. There were huge benefits to cultivating inside.<br/><br/>Secondly, if the Elemental God came into contact with the Elemental God, there was a possibility of collision and attack. There would be a fight. The winner would usually devour the opponent and form a special material.<br/><br/>This material could be used as an extremely powerful weapon.<br/><br/>The prerequisite was to subdue this weapon.<br/><br/>Thirdly, the Elemental God could temper powerful treasures of the same attribute. A treasure that absorbed the energy of the Elemental God could be upgraded.<br/><br/>When Wang Xian saw this information, he moved his palm and the five elements millstone appeared in his hand.<br/><br/>After the five elements millstone appeared, thick flames immediately bloomed on it.<br/><br/>The five divine dragons were spinning on it, absorbing the surrounding power of the Flames!<br/><br/>Waves of incomparably majestic power of the flames surged onto the five elements millstone.<br/><br/>When Wang Xian saw this scene, his eyes lit up!<br/><br/>It was indeed possible.<br/><br/>Under the rapid devouring of the Five Elements Millstone, it could improve his body a little.<br/><br/>“If this can devour the entire white flame flower, wouldn’t the five elements millstone be able to reach the level of the Heaven’s fate?”<br/><br/>Wang Xian mumbled.<br/><br/>However, he knew that it was simply impossible for the five elements millstone to devour the white flame flower.<br/><br/>The flame flower was material and would not allow itself to be devoured by the Five Elements Millstone.<br/><br/>If Wang Xian were to control the five elements millstone to devour it, he would probably suffer a counterattack from it.<br/><br/>Even so, this could greatly increase the power of the Five Elements Millstone.<br/><br/>Wang Xian followed the flame flower and drifted in the universe.<br/><br/>Time passed, and a million years passed in a blink of an eye.<br/><br/>The five elements millstone continued to absorb the energy of the flame flower, and it also received a huge improvement.<br/><br/>It was almost comparable to the mutated divine dragon.<br/><br/>However, it was simply too difficult to evolve to the Heaven’s origin!<br/><br/>“It would be great if this flame flower could be controlled. ”<br/><br/>Wang Xian said regretfully again.<br/><br/>He had done an in-depth study on this flower of flames over the past million years.<br/><br/>However, he realized that this flower of flames could not be controlled.<br/><br/>Unless it was suppressed by a powerful force, it would remain active.<br/><br/>“Let’s go. We can’t waste time here. Let’s go somewhere else to take a look.”<br/><br/>Wang Xian gave up on the flame flower. He moved his body and dived into the vast chaos once again.<br/><br/>Following that, it was another long journey. This time, Wang Xian did not encounter any treasures around him for more than ten million years.<br/><br/>There were so few treasures!<br/><br/>However, he saw another god of elements. He was extremely powerful and could not be controlled at all.<br/><br/>After that, he separated from the Linniu and prepared to act alone to increase the chances of finding treasures!<br/><br/>30 million years later, a piece of news from the Linniu suddenly reached Wang Xian.<br/><br/>“Eh? Did the Linniu discover anything?”<br/><br/>Wang Xian took out his communication device and looked at the information on it.<br/><br/>The message sent by the LINNIU indicated that they had encountered a huge battle.<br/><br/>A huge battle between the Elemental God.<br/><br/>Furthermore, one of the two parties in this huge battle was the white flame flower!<br/><br/>‘ ‘ HIV’IM?”<br/><br/>Lin Niu actually encountered the white flame flower again.<br/><br/>A huge battle between the elemental gods.<br/><br/>The Elven empress had said that a huge battle between the elemental gods was not very common.<br/><br/>She had been in the chaos for so long and had only seen it three to four times!<br/><br/>The rarity was comparable to some of the beasts of chaos in the Chaos!<br/><br/>After Wang Xian received the news, he immediately flew towards the Unicorn Ox!<br/><br/>The battle between the Elemental God was going to last for a long time!<br/><br/>It might last for hundreds of millions of years!<br/><br/>When Wang Xian arrived a few years later, an extremely terrifying rumbling sound was heard.<br/><br/>A golden ray of light collided with the Fiery Red Ray of light.<br/><br/>There was no technique to describe an attack that could destroy the world.<br/><br/>It was all about the confrontation and impact between attributes!<br/><br/>A terrifying domain field was formed in the grayish chaos around them!<br/><br/>Lin Niu sensed Wang Xian’s arrival very quickly.<br/><br/>He flew over immediately and shouted!<br/><br/>Wang Xian nodded his head and looked at the area in front of him. “What’s the situation now? How long have they been fighting together?”<br/><br/>“Dragon King, I don’t know the exact time.”<br/><br/>Lin Niu shook his head.<br/><br/>“I discovered this metal elemental God by accident. I followed him for a while to see if there were any metal treasures inside. In the end, I discovered that the flame flower had also arrived. ”<br/><br/>“When the two elemental gods collided, a terrifying attack immediately occurred. ”<br/><br/>Lin Niu replied!<br/><br/>Wang Xian nodded his head and looked at the battle ahead.<br/><br/>The battle was extremely intense. The energy began to collide with each other.<br/><br/>Flames and metal rays shot out in all directions!<br/><br/>It looked spectacular..\t\t\t\t\t\t</div>", "images": {}, "success": true}