{"id": 1072, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074044.html", "title": "Chapter 4074 - Chapter 4074: 4073 Water-Type Heavenly Yuan Creation Experts!", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4074 - Chapter 4074: 4073 Water-Type Heavenly Yuan Creation Experts!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4074: 4073 Water-type Heavenly Yuan creation experts!<br/><br/>Translator: 549690339<br/><br/>The words of the Hetian Saint gave everyone a way out!<br/><br/>Including the Emperor of Phoenix and the Emperor of angels.<br/><br/>The Emperor of Phoenix and the Emperor of angels hovered in the air, their expressions constantly changing!<br/><br/>The situation in front of them was something they had never expected!<br/><br/>They had never expected that a small dragon palace would have two heavenly yuan creation experts!<br/><br/>“Huff! Huff! ”<br/><br/>The Emperor of Angels took a deep breath as his eyes flickered slightly.<br/><br/>“If the dispute between Your Dragon Palace and My Angel clan is because of my angel clan, then this matter shall be dropped!”<br/><br/>He took the lead and spoke to Wang Xian!<br/><br/>During this period of time, he also understood the enmity between the Angel clan and the Dragon Palace.<br/><br/>However, as the emperor of the Angel clan, even if there was something wrong with the Angel clan, it was because of the death of a disciple who was at the peak of the clan’s dominance.<br/><br/>In this matter, there was no one who was right or wrong.<br/><br/>It was only who was strong and who was weak!<br/><br/>Right now, the Dragon Palace’s strength was stronger than the Angel clan.<br/><br/>Then, he could just let it go!<br/><br/>Anyway, he already had a way out!<br/><br/>“Hehe! ”<br/><br/>When Wang Xian heard the words of the Emperor of angels, he smiled faintly and didn’t say anything.<br/><br/>His gaze was fixed on the Emperor of Phoenix, and his eyes were flashing with a cold luster!<br/><br/>It was a pity that he could not kill the Emperor of the Phoenix this time!<br/><br/>After settling the grudge with the Angel clan, he wanted to kill the Emperor of the Phoenix clan with 100% certainty. To be on the safe side, the Dragon Palace would need four powerhouses of the Heaven’s origin realm.<br/><br/>Of course, if Wang Xian could improve himself again, there might be a possibility!<br/><br/>“Do you want to try fighting?”<br/><br/>Wang Xian stared at the Emperor of Phoenix and said coldly!<br/><br/>“This… The Emperor of angels has given up on the fight with the Dragon Palace. In other words, they will bear the losses suffered by the Angel clan in the past! ”<br/><br/>“The Dragon Palace is too strong. At this moment, which peak race is willing to make an enemy of the Dragon Palace?”? “Now that the Divine Dragon Clan has returned to its peak due to the Dragon Palace and has two existences of the Heaven’s origin creation, some of the peak races who are on good terms with the Dragon Palace will probably favor the Dragon Palace even more!”<br/><br/>“It’s obvious that we can’t afford to fight this battle. The strength of both parties are about the same, but the Dragon Palace is still the best. One versus two, the Dragon King is simply invincible. The Heaven Origin Destiny Realm has become his mount! ”<br/><br/>“Hiss, the Dragon King is now taking the initiative to provoke the Emperor of<br/><br/>Phoenix! ”<br/><br/>All the powerful disciples of the nine-origin universe around them were discussing in shock when they saw this scene!<br/><br/>Their eyes were flickering!<br/><br/>When the Emperor of Phoenix heard Wang Xian’s provocative words, his face immediately turned gloomy.<br/><br/>His gaze swept past Lin Niu and Wang Xian, and his expression changed drastically.<br/><br/>He was hesitating whether he should make a move.<br/><br/>However, once he made a move, unless he could fight two people at the same time, it would not be beneficial to the Phoenix tribe if he was suppressed!<br/><br/>(‘I really didn’t expect the Divine Dragon Clan to rise up so quickly. Good, good, good. ”<br/><br/>The Emperor of Phoenix stared at Wang Xian coldly and gritted his teeth. “The calamity is coming soon. After this calamity, we will deal with the matters between us!”<br/><br/>He did not give in. He knew that the grudge between the Phoenix clan and the Divine Dragon Clan could no longer be resolved!<br/><br/>He also knew from Wang Xian’s words just now.<br/><br/>The Dragon Palace might seek revenge against the Phoenix race in the future!<br/><br/>The possibility was very high!<br/><br/>However, the other party was too strong. He could only give in temporarily.<br/><br/>“Hehe, they will!”<br/><br/>Wang Xian sneered when he heard his words!<br/><br/>“Hehe, for the sake of the cataclysm and for the sake of the nine-origin universe, I have the cheek to thank you on behalf of the living beings in the nine-origin universe!”<br/><br/>At this moment, the Hetian Saint spoke again. He was a good person and said with a smile!<br/><br/>“1 have long heard of the name of the Hetian Saint! ”<br/><br/>Wang Xian looked at the Hetian saint. He was the first heaven origin creator whom he had heard of when he came to the heaven-opening desolate land. He cupped his hands with a smile on his face!<br/><br/>“Hehe, Dragon King, you are full of praise. It is truly amazing that the dragon palace has developed so quickly. ”<br/><br/>He Tian saint smiled and swept his gaze across all the disciples around him!<br/><br/>“Alright, now that all the disciples of the nine-origin universe above the venerable level have arrived, there’s one more thing that needs to be announced today! ”<br/><br/>He Tian Saint spoke again, his gaze landed on some water-elemental experts again. “The calamity is about to arrive in 2.5 billion years. After the calamity arrives, our nine-origin universe will become a whole. We must take revenge and our nine-origin universe will not be invaded! ”<br/><br/>“Once there is an intruder, all disciples and all living beings must participate in the battle and fight against the external enemies together. We, the heaven origin creation realm experts, are no exception. This is the rule of our nine-origin universe. ”<br/><br/>“Once any disciple of any expert dares to violate this rule, regardless of any peak race or expert, they will all be killed together! ”<br/><br/>“Under the circumstances of ensuring the safety of our nine-origin universe, then everything else will not be restricted! ”<br/><br/>Hetian Sage said.<br/><br/>The Battle of the Apocalypse was a war between the universe and the universe.<br/><br/>It was a very cruel war between homes!<br/><br/>Therefore, even if the nine-origin universe wasn’t very harmonious, many disciples of experts were still arch-enemies.<br/><br/>But during this period of time, all living beings had to form a united front!<br/><br/>Even if it was a Deak race.<br/><br/>Even if it was the Heavenly Yuan creation realm!<br/><br/>The Heavenly Yuan creation realm had already made an agreement that even if a heavenly yuan creation realm expert went against it, they would be surrounded and killed by the other heavenly Yuan creation realm experts.<br/><br/>Until he was completely destroyed.<br/><br/>“There’s one more thing. ”<br/><br/>The he tian saint continued, “The second thing is about the Heaven’s fate.”<br/><br/>As he spoke, he glanced at Wang Xian, he continued, “Lord Shui Yun of the Divine Dragon Clan has already fallen. Our Nine-origin universe now has an additional slot for the Heaven’s fate master and a water-elemental Heaven’s fate master. All the water-elemental disciples will have the chance to fight for this slot. ”<br/><br/>“Furthermore, we also hope that before the calamity arrives, our nine-origin universe will have an additional water-elemental heaven-element creation. We will nurture the disciples with potential! ”<br/><br/>“In other words, we will guide the disciples with potential and help them break through to the heaven-element creation realm! ”<br/><br/>“Dragon King, you guys don’t have any objections on this, right?” At the end of his sentence, he Tian Sheng asked Wang Xian for his opinion!<br/><br/>“I don’t have any objections.”<br/><br/>Wang Xian nodded his head.<br/><br/>This spot was once vacated by the Divine Dragon Clan!<br/><br/>Naturally, Wang Xian wanted this spot!<br/><br/>However, it was too difficult for the water-elemental disciples of the Dragon Palace to break through to the Heaven’s origin realm!<br/><br/>Currently, the strongest water god Dragon in the Dragon Palace, Shui Linglong’s father, was only at level six, the ruler of the universe!<br/><br/>It would be very difficult to break through to the Heavenly Yuan blessed realm in two billion years!<br/><br/>In addition, before senior Shui Yun died, he poured all his efforts into the invincible divine dragon system. He didn’t leave any special inheritance!\t\t\t\t\t\t</div>", "images": {}, "success": true}