{"id": 1079, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074058.html", "title": "Chapter 4081 - Chapter 4081: 4080 Elemental Fragments", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4081 - Chapter 4081: 4080 Elemental Fragments</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4081: 4080 elemental fragments<br/><br/>Translator: 549690339<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>The dazzling battle continued.<br/><br/>The rumbling sound covered the sky and the Sun!<br/><br/>When Wang Xian saw this scene, a look of astonishment appeared on his face!<br/><br/>“In a battle of this level, even if I were to enter, I would probably be killed. Fortunately, these elemental gods do not have intelligence. ” Lin Niu exclaimed with some emotion!<br/><br/>The battle between the elements was indeed terrifying!<br/><br/>They didn’t have intelligence, but it was abnormally explosive.<br/><br/>They had no life and no intelligence. It was purely an instinctive confrontation.<br/><br/>The outcome of the battle between the two elements might be complete annihilation. One side might even be devoured.<br/><br/>They wouldn’t retreat nor did they know fear.<br/><br/>If there weren’t any special circumstances, it wouldn’t end.<br/><br/>Wang Xian nodded and watched carefully.<br/><br/>The battle continued. At the beginning, it was the battle between the flames and the golden glow.<br/><br/>As they fought, the golden glow and the flames were dissipating continuously.<br/><br/>The area covered by the flames and the golden glow was also shrinking rapidly.<br/><br/>As time passed, their respective territories became smaller and smaller.<br/><br/>Following that, at the center of the Flames, the white flame flower charged forward.<br/><br/>A resplendent golden pillar at the center of the Golden Glow also began to collide with the white flame flower.<br/><br/>The physical collision between the elements.<br/><br/>Boom Boom Boom<br/><br/>Boom Boom<br/><br/>The collision began. The battle began!<br/><br/>At this moment, Wang Xian had been watching the battle here for more than 10 ,ooo years!<br/><br/>They didn’t leave. Instead, they were watching this huge battle to see if they could gain anything from it!<br/><br/>The battle between the elemental bodies was still as brutal as ever.<br/><br/>The collision was a direct collision!<br/><br/>Sparks and metal fragments flew in all directions as they collided.<br/><br/>“Huh?”<br/><br/>At this moment, Wang Xian stared at the Sparks and metal fragments.<br/><br/>His eyes lit up!<br/><br/>After the Sparks and metal fragments flew out, they slowly returned to their bodies.<br/><br/>There were also a few fragments that turned into energy and filled the surrounding area.<br/><br/>“Fragments of the elements?”<br/><br/>Wang Xian’s mind stirred as he revealed a hesitant expression!<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>The collisions continued. With each collision, there were some fragments scattered out!<br/><br/>The strength of these two elemental gods was extremely terrifying.<br/><br/>At the very least, if Wang Xian were to fight them, he would be the one to die!<br/><br/>It could be said that he was comparable to an existence at the control level.<br/><br/>“These fragments are an incomparably huge treasure. ”<br/><br/>Wang Xian’s heart was burning with passion.<br/><br/>The fragments of the two elemental gods were equivalent to the flesh and blood of the Heaven’s origin avatar!<br/><br/>It was definitely a supreme treasure!<br/><br/>One had to know that the qilin cow was once just one of the four limbs of the Asgardian demon god.<br/><br/>“Let’s go over and see if we can obtain those fragments!”<br/><br/>Wang Xian’s heart was burning with passion.<br/><br/>His entire body burst into flames and he couldn’t help but fly in!<br/><br/>He flew to the back of the flower of flames and was prepared to fly over from the back of the flower of flames!<br/><br/>Boom! Boom<br/><br/>However, this time, when Wang Xian entered the back of the flower of flames, something unexpected happened!<br/><br/>At the front, the Golden Pillar that was originally fighting with the flower of flames was attacking Wang Xian directly!<br/><br/>Rays of golden light were attacking him from the surrounding areas!<br/><br/>Although the flower of flames was colliding with him, the golden pillar seemed to have its eyes on Wang Xian. It completely ignored the attack of the flower of flames!<br/><br/>There was no such thing as defense in an elemental battle.<br/><br/>Therefore, even if the golden pillar did not resist, the flower of flames would still be able to injure the enemy by itself!<br/><br/>“What’s going on?”<br/><br/>Wang Xian’s expression changed.<br/><br/>His body shook and immediately transformed into the body of a metal elemental divine dragon!<br/><br/>The entire body of the dragon also emitted a golden glow!<br/><br/>However, when he transformed into the body of a metal elemental divine dragon, the surrounding flames immediately attacked him!<br/><br/>When Wang Xian saw this scene, his expression changed slightly.<br/><br/>His body moved and he flew into the distance, leaving their battle range!<br/><br/>When Wang Xian flew out quickly, the two elemental gods continued to fight!<br/><br/>Whoosh<br/><br/>“This won’t do. I Can’t enter at all. Once I enter, I will be attacked! ” Wang Xian said with a frown.<br/><br/>If he didn’t enter, he wouldn’t be able to obtain the elemental fragments inside.<br/><br/>“Entering the fire attribute will result in me being attacked by the elemental gods of the metal attribute. If I transform into the metal attribute, I will be attacked by the flame flower. If I transform into other attributes, I will probably be attacked by them together! ”<br/><br/>Wang Xian thought to himself as he continued to ponder.<br/><br/>He watched as the battle continued to erupt. His mind was spinning non-stop.<br/><br/>No wonder the elven empress was not too surprised when she learned that Wang Xian had encountered the Elemental God!<br/><br/>Although this elemental god was an incomparably huge treasure, it was impossible for him to control it!<br/><br/>What was the use of a treasure that could not be controlled?<br/><br/>Even if they were engaged in a great battle, there would be fragments that would escape, but they would not be able to enter.<br/><br/>In fact, even if one was strong, they could suppress two elemental gods.<br/><br/>But when one entered, they would also be attacked by two elemental gods.<br/><br/>And this pure Elemental God’s origin energy, once it was attacked, its body would not drop any fragments, but would instead melt.<br/><br/>This also meant that it was impossible to obtain the fragments of the Elemental God artificially.<br/><br/>Only the collision between the Elemental God and the Elemental God, the collision of pure energy, did not contain any other energy, bloodline, or constitution.<br/><br/>Only then could it cause their bodies to fall into pieces and not be melted by the energy.<br/><br/>Wang Xian thought to himself. After hesitating for a while, he thought of something.<br/><br/>Buzz<br/><br/>He flew towards the battlefield of the two elemental gods once again.<br/><br/>However, this time, he flew from the center of the two battlefields!<br/><br/>His dragon body began to change as well.<br/><br/>Half of it was a fire dragon and the other half was a metal dragon!<br/><br/>Furthermore, the flames and the metal radiance were constantly interweaving and fusing!<br/><br/>There was a special taiji pattern on his body and underneath him.<br/><br/>It was a tai chi pattern formed by the metal and fire attributes!<br/><br/>When these two tai chi patterns were fused together, the metal and fire attributes were intertwined and transformed continuously!<br/><br/>This time, when he entered the battlefield of the two elemental gods again.<br/><br/>The two elemental gods paused for a moment before they continued to fight.<br/><br/>It was as if they didn’t sense Wang Xian’s arrival.<br/><br/>It wasn’t that they didn’t sense him.<br/><br/>It was just that for the elemental gods who had no intelligence, no consciousness, and only instincts, Wang Xian was like a Bug!<br/><br/>In the past, he was of the fire attribute, but in the next moment, he was of the metal attribute!<br/><br/>Under all sorts of circumstances, the elemental gods who had instincts would go down!<br/><br/>After appearing many times, the two elemental gods ignored Wang Xian and continued to fight!<br/><br/>“It’s a success! ”<br/><br/>Wang Xian’s eyes were filled with excitement!\t\t\t\t\t\t</div>", "images": {}, "success": true}