{"id": 1073, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074046.html", "title": "Chapter 4075 - Chapter 4075: 4074 Levels Of The Heaven Origin Creation", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4075 - Chapter 4075: 4074 Levels Of The Heaven Origin Creation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4075: 4074 levels of the heaven origin creation<br/><br/>Translator: 549690339<br/><br/>It was very difficult for the Dragon Palace to obtain the Water Element Heaven origin creation.<br/><br/>It should be obtained by the water element experts of the other peak races!<br/><br/>Wang Xian’s gaze swept across the surroundings and landed on a few figures!<br/><br/>He lingered on the Water Phoenix King of the Phoenix race for an additional moment.<br/><br/>If he had known earlier, he would have exterminated this water Phoenix King once again!<br/><br/>He thought to himself!<br/><br/>The words of the Hetian saint made the experts at the peak of the water attribute ruler realm look excited!<br/><br/>Their eyes were burning!<br/><br/>This was an opportunity!<br/><br/>This was their chance to break through to the Heavenly Yuan creation realm!<br/><br/>In the nine-origin universe, the quota for the Heavenly Yuan creation realm was limited.<br/><br/>Other than the Dragon King, there were only nine slots!<br/><br/>These nine quotas corresponded to nine attributes, and now, only the water attribute had one quota!<br/><br/>Moreover, the Hetian saint also said that their group of Heavenly Yuan creation would try their best to add one more heavenly yuan creation to the nine-origin universe before the calamity arrived.<br/><br/>They would do their best to nurture it!<br/><br/>This was an incomparably huge opportunity for them!<br/><br/>A chance to ascend to the heavens in one step and live forever!<br/><br/>“All the water-elemental disciples have this chance. For fairness, we’ll give all of you 500 million years. After 500 million years, we’ll choose the three strongest disciples who are closest to the Heavenly Yuan destiny realm and cultivate them at the same time! ”<br/><br/>“At that time, it’ll depend on your destiny and opportunities! ”<br/><br/>Hetian Sage continued.<br/><br/>“Thank You, Sirs! ”<br/><br/>The group of water-elemental disciples immediately thanked him loudly!<br/><br/>“Alright, let’s continue with our cultivation! ”<br/><br/>The Hetian saint waved his hand and the group of disciples quickly retreated to the surroundings!<br/><br/>“Everyone, let’s take action as well to help with our good luck. If you discover any treasures that are difficult to deal with, you can come and join hands with me.”<br/><br/>The fate of the Netherworld race saw that everything was over. He glanced at Wang Xian and the rest and said with a smile!<br/><br/>After he finished speaking, his figure moved and disappeared immediately!<br/><br/>“Hehe, I wish everyone good luck. Dragon King, I’m going to look for treasures now. Let’s discuss the dao together when we are free!”<br/><br/>The elder from the Xuanwu race said to Wang Xian and flew away directly!<br/><br/>In the surrounding area, the powerhouses from the fate of the Netherworld race also left immediately!<br/><br/>“Looking for treasures?”<br/><br/>When Wang Xian saw them leaving one by one, he raised his eyebrows slightly!<br/><br/>In front of them, the elven queen did not leave immediately!<br/><br/>“There are all kinds of treasures in the chaos, especially around the tree of chaos. Almost 100% of them are there. ”<br/><br/>The Elven queen saw Wang Xian’s doubts and explained with a smile!<br/><br/>“Senior elven queen, there are many things that I don’t understand. Can you tell me a thing or two?”<br/><br/>Wang Xian looked at the elven queen, cupped his hands, and asked humbly!<br/><br/>At this moment, Wang Xian did not have any understanding of the realm of the Heaven’s origin creation!<br/><br/>Lin Niu had a breakthrough, but he did not obtain the memories of the Aga Heavenly Demon God. He also did not know the subdivision of the realm of the Heaven’s origin creation!<br/><br/>As for the nine-origin universe, they only had two heaven’s origin creation powerhouses.<br/><br/>After the eruption of the apocalypse, they had been defending against external enemies, so they did not know much about it!<br/><br/>However, the heaven origin creation realm powerhouses in the nine-origin universe should have a very good understanding of it.<br/><br/>After all, the strength of the nine-origin universe was much stronger than the sword and Magic Universe!<br/><br/>“No problem. ”<br/><br/>The Elven empress nodded and gestured to him!<br/><br/>Their bodies moved and immediately flew toward a branch in the distance!<br/><br/>Lin Niu followed behind Wang Xian quietly!<br/><br/>“All the disciples of the Dragon Palace, find a place to cultivate! ”<br/><br/>Prime Minister Gui saw the Dragon King leaving and instructed all the disciples!<br/><br/>The disciples of the Dragon Palace were also filled with excitement!<br/><br/>The scene just now made their Dragon Palace completely proud!<br/><br/>In the future, in the nine-origin universe, the strong disciples of any peak race would not dare to look down on their Dragon Palace!<br/><br/>They didn’t need to hide in a remote place anymore!<br/><br/>Their Dragon Palace had two heaven origin creation realm experts, so they weren’t afraid of any peak race.<br/><br/>They weren’t afraid of any living beings!<br/><br/>“The Dragon Palace has completely risen this time. No one will dare to provoke them in the future! ”<br/><br/>“Two heaven origin creation realm experts, especially the Dragon King. His improvement speed is too terrifying. This time is too short. Now that he has a heaven origin creation realm mount, his overall strength is at the top of the group, right?”<br/><br/>“It’s mainly two Tianyuan fortunes. Their mobility is too strong. One is involved, and the other is secretly attacking. Who can withstand this? The Emperor of angels is a veteran Tianyuan fortune, and his strength is definitely higher than the Dragon King. But he doesn’t dare to provoke the Dragon Palace because the Dragon King and his mount can fight on their own. One is involved with the Emperor of angels, and the other is attacking the disciples of the Angel clan. Even the Emperor of Angels is afraid! ”<br/><br/>“Yes, the Dragon Palace has made history. Two heavenly fate experts are too strong. We should be more polite to the disciples of the Dragon Palace in the future! ”<br/><br/>“The Lords Want to nurture a water-element heavenly fate expert. I wonder which expert has such luck! ”<br/><br/>In the tree of chaos, the beings of the 9-origin universe didn’t cultivate immediately. Instead, they were discussing in shock!<br/><br/>They were discussing the Dragon Palace and the Dragon King!<br/><br/>They were discussing the Lin Niu!<br/><br/>They were also discussing who could become the new water-type heaven origin creation stage powerhouse!<br/><br/>“Senior elven empress, I have a few questions. At the Heaven origin creation stage, has there been a breakdown of strength at this stage?”<br/><br/>Wang Xian did not care about the discussions of the disciples from the nine-origin universe.<br/><br/>He and the Elven empress came to a distant branch of the tree of Chaos and asked the elven empress!<br/><br/>“The Heavenly Yuan realm of Destiny, of course there are! ”<br/><br/>The Elven empress smiled and nodded. “Let me tell you what I know. ”<br/><br/>“The Heavenly Yuan realm of Destiny is very rare, there are only a few in every universe. However, in the case of many universes, the Heavenly Yuan realm of Destiny is not considered few, but the division of realms is not very clear!”<br/><br/>“The Heaven’s origin realm is divided into beginner, mastery, Great Dao, and chaos!<br/><br/>“Currently, there are only these four divisions. This division is based on one’s strength. one-on-one, one can easily kill a powerhouse who has just entered the Heaven’s origin realm. It can be called the mastery level. one-on-one, one can easily kill a powerhouse who has reached the mastery level. It can be called the Great Dao. one-on-one, one can easily kill a powerhouse who has reached the Great Dao realm. It can be called Chaos! ”<br/><br/>The Elven Queen explained in detail!<br/><br/>When Wang Xian heard his introduction, he raised his eyebrows slightly.<br/><br/>In other words, three powerhouses who had just entered the Heaven’s origin creation realm could fight against an existence at the control level if they joined forces?<br/><br/>The gap in strength of this realm was not very big!<br/><br/>Nine people who had just entered the Heaven’s origin creation realm could fight against an existence at the Great Dao level!<br/><br/>Twenty-seven people who had just entered the Heaven’s origin creation realm could fight against an existence at the chaos level!<br/><br/>“Senior, what are the levels of the Heaven’s origin realm cultivators in our nine-origin universe?”<br/><br/>Wang Xian couldn’t help but ask curiously!\t\t\t\t\t\t</div>", "images": {}, "success": true}