{"id": 1075, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074050.html", "title": "Chapter 4077 - Chapter 4077: The Thunder In The Chaos Of 4076!", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4077 - Chapter 4077: The Thunder In The Chaos Of 4076!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4077: The Thunder in the chaos of 4076!<br/><br/>Translator: 549690339<br/><br/>“Next, let’s see if I can still improve my strength! ”<br/><br/>After the elven empress left, Wang Xian stood on the branch of the Tree of chaos, deep in thought.<br/><br/>It was extremely difficult for a group of powerhouses in the Heaven’s origin realm to improve their strength.<br/><br/>Even if it was tens of billions of years, there was a possibility that their strength would not improve at all.<br/><br/>However, Wang Xian was different. His current realm was only at the seventh level of the universe dominator.<br/><br/>His current breakthrough did not have any restrictions at all. As long as he had sufficient resources, it would be fine!<br/><br/>As long as he had the resources, he would be able to achieve a breakthrough very quickly.<br/><br/>It would be comparable to the control level of the Heaven’s origin creation, or even the Great Dao level!<br/><br/>However, the amount of resources required for Wang Xian to achieve a breakthrough was too much!<br/><br/>It was so much that it was a little terrifying!<br/><br/>The resources in the Dragon Palace could not satisfy his consumption at all. He needed to search for them himself.<br/><br/>“There will be treasures appearing around the tree of chaos. You can go and search for them yourself! ”<br/><br/>Wang Xian spoke as he scanned his surroundings.<br/><br/>This was an incomparably vast tree with no end in sight.<br/><br/>A single leaf was as big as a continent.<br/><br/>Standing here, Wang Xian’s human-shaped body felt extremely tiny!<br/><br/>“Tree of Chaos! ”<br/><br/>He looked at the branch under his feet and his mind stirred slightly. The branch of the ancestral tree appeared in his palm.<br/><br/>The branches of the ancestral tree landed on the tree of chaos.<br/><br/>However, the tree of chaos did not react at all. Wang Xian did not feel any changes to the ancestral tree either!<br/><br/>“I wonder what level of existence this tree of Chaos is. ”<br/><br/>Wang Xian mumbled.<br/><br/>After a while, he did not bother about the tree of chaos anymore.<br/><br/>His body moved and he immediately flew out of the tree of Chaos!<br/><br/>Outside the tree of chaos, there was a dead silence of chaos.<br/><br/>Within the chaos, there was some Great Terror!<br/><br/>Wang Xian had entered the chaos before. It was dead silent inside and there was no energy at all.<br/><br/>Only existences at the Heaven’s origin level could travel in the Chaos!<br/><br/>“Linniu, let’s go. Let’s enter the chaos and see if we can find any treasures!”<br/><br/>Wang Xian said to Linniu.<br/><br/>“It’s the Dragon King! ”<br/><br/>Linniu nodded his head. He flew to Wang Xian and brought him directly into the Chaos!<br/><br/>Buzz<br/><br/>After entering the chaos, they released a stream of energy.<br/><br/>Everything around them was gray as if the world had yet to open!<br/><br/>Wang Xian’s mind stirred and the energy started to explore the surroundings!<br/><br/>The Linniu also scanned his surroundings and flew straight in one direction!<br/><br/>They scanned their surroundings, but they did not sense anything.<br/><br/>The entire space seemed to be dead silent. There was no sound at all!<br/><br/>It gave off a very oppressive feeling!<br/><br/>There was no sound, no vitality, and no light!<br/><br/>There was even no direction!<br/><br/>They could only remember the route they took or the sensing they left behind at the tree of Chaos!<br/><br/>“Dragon King, this chaotic world feels so terrifying. There isn’t even any energy being absorbed in the surroundings. ”<br/><br/>Even after flying for more than ten days, they still couldn’t sense anything!<br/><br/>There was nothing but a grayish color.<br/><br/>A grayish aura!<br/><br/>“Yes, there are no living things in plants or animals! ”<br/><br/>Wang Xian nodded his head and continued to observe his surroundings!<br/><br/>In such an environment, even if the Heaven’s origin destiny was roaming in the chaos, it could go crazy after a long period of time!<br/><br/>It was too depressing!<br/><br/>There was no sign of life.<br/><br/>It was as though he was the only one in the world!<br/><br/>Wang Xian continued to fly forward while conversing with the Unicorn Ox!<br/><br/>Buzz Buzz<br/><br/>After flying for another month, some sounds were suddenly heard! When Wang Xian heard this sound, his eyes narrowed slightly!<br/><br/>“Dragon King, there’s movement! ”<br/><br/>Lin Niu also sensed something and spoke to Wang Xian!<br/><br/>“Let’s Go! ”<br/><br/>Wang Xian nodded and instructed him.<br/><br/>Lin Niu’s body moved and immediately flew towards the source of the sound!<br/><br/>Boom! Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>When they got closer, the sound became louder and louder! At the same time, all kinds of energy charged towards them!<br/><br/>“This is? The power of lightning! ”<br/><br/>Lin Niu sensed something and said as he rushed over!<br/><br/>When they got closer, a shocking scene appeared in their sight.<br/><br/>In the chaotic space in front of them, there were terrifying bolts of lightning flashing continuously.<br/><br/>Around this bolt of lightning, it actually formed a space of lightning.<br/><br/>The Lightning tore open a brand new space. This scene was as though it was creating a world!<br/><br/>“What’s going on?”<br/><br/>Wang Xian looked at the shocking scene in front of him and was filled with<br/><br/>shock!<br/><br/>“Dragon King, this scene should have a great effect on the cultivation of the Lightning attribute. These bolts of lightning contain a special charm and possess a powerful attack method! ” Lin Niu stared ahead and spoke!<br/><br/>Wang Xian felt something as he watched!<br/><br/>His gaze was fixed on the Thunderbolts in front of him.<br/><br/>However, he did not see anything!<br/><br/>The improvement of a heaven origin creator was entirely due to his understanding of the universe!<br/><br/>Wang Xian himself was not at this realm. In fact, his true realm was merely the seventh level of the universe overlord.<br/><br/>Therefore, he could not see anything from the Thunderbolts in front of him!<br/><br/>Wang Xian stared at the Lightning carefully.<br/><br/>However, what surprised him was that as time passed, the Lightning was getting weaker and weaker!<br/><br/>The space around the lightning seemed to be being squeezed bit by bit!<br/><br/>“What’s going on?”<br/><br/>Wang Xian looked at this scene.<br/><br/>The lightning could not break through the shackles of the chaotic space?<br/><br/>It could not be born successfully!<br/><br/>What would happen if the Thunderbolt was born successfully?<br/><br/>Would it be born into a powerful treasure?<br/><br/>Would this thunderbolt even give birth to its own intelligence?<br/><br/>This was the first time Wang Xian had ventured deep into the chaotic space. He was completely clueless about the scene in front of him!<br/><br/>“Dragon King, the Thunderbolt is about to disappear. It will be destroyed by the chaotic space. However, Dragon King, this thunderbolt is material. Can We put it away?”<br/><br/>Lin Niu suddenly spoke to Wang Xian!<br/><br/>This made Wang Xian’s heart skip a beat!<br/><br/>The energy contained in this lightning was far beyond the peak of the Overlord realm!<br/><br/>Material Lightning was not a virtual object!<br/><br/>If there was no interference from the energy, he would gradually disappear into the chaos!<br/><br/>A complete fusion with the chaos!<br/><br/>However, what would happen if he was put away?<br/><br/>Could it be used as a powerful treasure?<br/><br/>Could it be absorbed?<br/><br/>Wang Xian’s eyes focused. His body moved and he immediately flew towards the lightning bolt!<br/><br/>Lin Niu did not hesitate and flew towards the lightning bolt!<br/><br/>The lightning bolt was too big and it covered an area that was comparable to some small planets!<br/><br/>However, the energy from Wang Xian and the rest could completely envelop it with a wave of their hands!<br/><br/>Wang Xian stretched out his palm and transformed it into a gigantic dragon claw. He wanted to hold the Thunderbolt in his hand!<br/><br/>Crack! Crack<br/><br/>Sensing Wang Xian’s attack, the Thunderbolt seemed to possess intelligence as it attacked the Dragon Claw directly!\t\t\t\t\t\t</div>", "images": {}, "success": true}