{"id": 1071, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074042.html", "title": "Chapter 4073 - Chapter 4073: 4072 Dragon Palace? Two Heavenly Yuan Fortunes!", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4073 - Chapter 4073: 4072 Dragon Palace? Two Heavenly Yuan Fortunes!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4073: 4072 Dragon Palace? Two Heavenly Yuan fortunes!<br/><br/>Translator: 549690339<br/><br/>When Lin Niu turned into his true form, he let out a low roar!<br/><br/>“Hua Hua Hua! ”<br/><br/>The leaves of the tree of chaos in the surrounding area were shaken until they rustled!<br/><br/>“Heavenly Yuan fortunes! In the sword and Magic Universe, Our Dragon King teamed up with others to kill one. Now, we’re afraid of the two heavenly yuan fortunes and the two peak races! ”<br/><br/>Lin Niu stared at them and said with a grim expression!<br/><br/>Now that he had come to the nine-origin universe, he had a detailed understanding of the forces in the nine-origin universe!<br/><br/>Now, the Dragon Palace had the Dragon King and his two peak races.<br/><br/>They were afraid of the other peak races?<br/><br/>Ridiculous!<br/><br/>None of the other peak races had two of them.<br/><br/>Why would the Dragon Palace be afraid of them if they had two?<br/><br/>Even if they were all veteran heavenly yuan fortunes, they could still escape in a two-on-one situation even if they couldn’t beat them!<br/><br/>And once they took revenge in the future, they had 100% confidence that they could destroy their race!<br/><br/>However, at this moment, Lin Niu’s words rang out.<br/><br/>When he flew over to show his power!<br/><br/>In front, the Emperor of angels and the Emperor of Phoenixes narrowed their eyes and revealed a shocked expression!<br/><br/>The other six heavenly Yuan creation realm experts were also shocked as they stared at Lin Niu!<br/><br/>“Heavenly Yuan creation realm, another heavenly Yuan creation realm! ”<br/><br/>Hetian saint stared at Lin Niu and roared!<br/><br/>He was in disbelief!<br/><br/>The Dragon Palace actually had two heavenly Yuan creation realm experts!<br/><br/>Two, this was two!<br/><br/>“That’s not right, the attribute on your body is not water attribute, you are not a creature of our nine origin universe! ”<br/><br/>The Black Tortoise clan’s heaven origin creation level expert’s gaze focused as he stared at Lin Niu and shouted loudly!<br/><br/>“I, Lin Niu, am a creature of the sword and Magic Universe, Boss Dragon King is my benefactor, I am Boss’s mount, I am a disciple of the Dragon Palace!”<br/><br/>“Anyone who goes against the Dragon Palace will be my enemy! ”<br/><br/>Lin Niu did not hide anything and replied coldly!<br/><br/>“Sword and the Magic Universe? Mount?”<br/><br/>The eight Heavenly Yuan creation realm experts were stunned when they heard this!<br/><br/>A Heavenly Yuan creation realm mount?<br/><br/>A heavenly Yuan creation realm expert publicly said that he was the Dragon King’s Mount?<br/><br/>This? ?<br/><br/>This made them feel shocked and incredulous!<br/><br/>Such a level of existence was actually willing to be the Dragon King’s Mount!<br/><br/>How did the Dragon King do it?<br/><br/>“Hiss, the Dragon Palace actually has another heavenly yuan creation-level existence. The Dragon Palace actually has another one, and it’s even the Dragon King’s Mount!”<br/><br/>“This is the Dragon Palace’s Trump Card, right? Two Heavenly Yuan creation-level combat strength. In just a few hundred million years, the Dragon Palace actually has two more such terrifying existences. ”<br/><br/>“This is too heaven-defying. When the Divine Dragon Clan was at its peak, there weren’t even two heaven’s origin creation-level existences. ”<br/><br/>“No wonder the Dragon King isn’t afraid of the Phoenix clan and the Angel clan at all. Even if they really fight, so what? Two Heaven’s origin creation-level existences, one race, two supreme existences! ” In the surrounding area, all the powerful disciples were shocked.<br/><br/>This matter was simply too sensational!<br/><br/>They were all dumbfounded.<br/><br/>The powerful disciples of the Angel clan and the Phoenix clan were also dumbfounded at this moment!<br/><br/>In their eyes, a dragon palace that was hiding in a corner like a rat crossing the street didn’t dare to face them directly.<br/><br/>The Dragon Palace that they could easily destroy actually had two heavenly yuan fortunes!<br/><br/>This meant that if their peak race fought the Dragon Palace alone, even if their emperor was the old heaven’s origin creature.<br/><br/>However, they might still not be the Dragon Palace’s match.<br/><br/>If they really fought, they might suffer heavy casualties!<br/><br/>The birth of Heaven’s origin creatures was too difficult.<br/><br/>Although there were strong and weak heaven’s origin creatures, the advantage in numbers was also very terrifying!<br/><br/>In the past, there had never been a peak race that had two heavenly yuan fortunes!<br/><br/>How could this not be shocking!<br/><br/>When the Emperor of angels saw the appearance of the Lin Niu and felt its power, his expression sank and his face revealed an extremely solemn expression!<br/><br/>At this moment, when he saw the two heavenly yuan fortunes of the Dragon Palace.<br/><br/>He wanted to curse!<br/><br/>Two?<br/><br/>There were only nine heavenly yuan creation realm experts in the entire nine-origin universe!<br/><br/>One attribute and one heavenly yuan creation realm!<br/><br/>In the end, the Dragon King of the Dragon Palace had the strength of a Heavenly Yuan creation realm expert.<br/><br/>The Dragon Palace also had another heavenly Yuan creation realm expert.<br/><br/>And it was the Dragon King’s mount.<br/><br/>A Heavenly Yuan creation realm mount?<br/><br/>Wasn’t this a joke?<br/><br/>This was simply too surprising and terrifying for them!<br/><br/>There was no record of ten Heavenly Yuan creation realm experts in the 9-origin universe!<br/><br/>How could he not be shocked when this suddenly appeared!<br/><br/>Now he understood why the dragon palace had such confidence!<br/><br/>Why the Dragon Palace dared to directly harden their two peak races.<br/><br/>This was the Dragon Palace’s Trump card!<br/><br/>Their biggest trump card!<br/><br/>Furthermore, according to what Lin Niu said, the Dragon King had once teamed up with other Heavenly Yuan creation realm experts in another universe and killed a heavenly Yuan creation realm expert!<br/><br/>In that case, his true combat strength would definitely not be weak!<br/><br/>His experience would not be too bad either!<br/><br/>He took a deep breath as his mind spun!<br/><br/>“Forget it, Dragon King. If you fight with the Phoenix Tribe’s Angel tribe, both sides will suffer heavy losses and there won’t be any results. ”<br/><br/>The Elven Empress ‘eyes flashed as she swept her gaze over the emperor of angels and the Emperor of Phoenixes and spoke once again!<br/><br/>Now, the steps had appeared once again!<br/><br/>If the Dragon King was the only one in the Dragon Palace, the emperor of Phoenixes and the Emperor of angels, they might still be able to destroy the Dragon King.<br/><br/>But now, don’t even think about it!<br/><br/>The Dragon Palace had two heavenly fate realm cultivators. In terms of overall strength, they had already surpassed their single peak race!<br/><br/>Under such circumstances, it wasn’t a wise choice to go against the Dragon Palace.<br/><br/>After all, the Phoenix and Angel races were two peak races!<br/><br/>The Dragon Palace was one!<br/><br/>The Dragon King was the king.<br/><br/>The Phoenix and Angel races couldn’t do this!<br/><br/>“Yeah, forget it. First of all, Congratulations to the Dragon King. Your Dragon Palace has two heavenly Yuan creation realm experts. This is a good thing for the nine-origin universe! ”<br/><br/>“Emperor of angels, let me understand the enmity between the Dragon Palace and you. It was indeed your Angel clan that made the first move. The Dragon Palace was forced by you to hide outside for hundreds of millions of years without appearing. Now that the Dragon King has said that it’s over, then it’s “Emperor of Phoenix, forget it here. Neither of you can think of destroying the other. There’s no need to hurt yourself and the enemy! ”<br/><br/>The Hetian Sage acted like a good person once again and started to persuade him!<br/><br/>Wang Xian didn’t refute his words!<br/><br/>He also knew that it was impossible to wipe out the Phoenix clan and the Angel clan today.<br/><br/>It was too difficult to wipe them out.<br/><br/>Unless the Dragon Palace had six powerhouses who were in the destiny realm.<br/><br/>However, there was only a slight chance of having six of them!<br/><br/>After all, the Emperor of the Angels and the Emperor of the Phoenix were veteran in the Destiny Realm!\t\t\t\t\t\t</div>", "images": {}, "success": true}