{"id": 1081, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074064.html", "title": "Chapter 4083 - Chapter 4083: 4082 News, Friendly!", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4083 - Chapter 4083: 4082 News, Friendly!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4083: 4082 news, friendly!<br/><br/>Translator: 549690339<br/><br/>“HMM? There really is a figure. How is this possible? In a war between the elemental gods, once a powerhouse with other attributes enters, he will be attacked horribly. ”<br/><br/>“Furthermore, this is a battle between the elemental gods with two attributes.<br/><br/>Even if the fire and metal elements enter, they will still be attacked. ”<br/><br/>Among the 12 ancestral wizards, one of the human-headed snake God’s ancestral wizards looked at Wang Xian’s figure in front of him and exclaimed in astonishment!<br/><br/>“That’s true! ”<br/><br/>The other 11 ancestral wizards nodded with astonishment on their faces.<br/><br/>They had experienced the battle of the transcendence tribulation. They had been exploring in the chaos for at least 20 billion years!<br/><br/>Therefore, they were very familiar with the battle between the Elemental Gods.<br/><br/>They were also very familiar with the elemental gods.<br/><br/>Those with the same attributes could come around the elemental gods and even cultivate around them.<br/><br/>But those with different attributes would be attacked once they got close!<br/><br/>If the elemental gods were to fight, they would definitely be attacked by an elemental god once they got close.<br/><br/>This attack was very fierce!<br/><br/>When the elemental gods fought together, no one was allowed to get close.<br/><br/>This was the consensus.<br/><br/>However, they actually saw a figure on the battlefield between the two elemental gods.<br/><br/>“Is that figure outside the battlefield the newly-risen Dragon King of the Dragon Palace? Is He a heaven’s origin creation stage powerhouse from another universe?”<br/><br/>An ancestral wizard looked at the Unicorn Ox and suddenly said!<br/><br/>“One-horned and one-eyed, he should be.”<br/><br/>The ancestral wizard beside him nodded slightly. He then looked at Wang Xian with his eyes shining. “According to the reports from my subordinates, the Dragon Palace’s Dragon King has not reached the Heaven’s origin creator’s realm. Instead, he has perfectly fused nine attributes. ”<br/><br/>“Perfectly fused nine attributes. In other words, he has the metal and fire attributes in his body. Is this the reason why he is able to stand in the battlefield between the two elemental gods? What is he doing there?”<br/><br/>The snake-headed ancestral Magus raised his eyebrows, his face filled with doubt!<br/><br/>“Could it be for the elemental shards? One must know that in a battle between elemental gods, elemental shards would splash out from their bodies. ” An ancestral Magus opened his eyes wide and said!<br/><br/>“That’s absolutely right. Elemental shards are good stuff. In the chaos, other than those elemental gods below the heavenly fate realm who can be perfectly controlled by us, once they reach the heavenly fate realm, it is impossible for them to be controlled. ”<br/><br/>“However, the shards that fall from their bodies due to battle are huge treasures.”<br/><br/>The ancestral wizard with Pale Eyes said loudly!<br/><br/>Elemental shards. This was definitely a good thing.<br/><br/>Treasures of this level were very difficult to produce in the universe.<br/><br/>After all, this was equivalent to the flesh and blood of the heavenly fate realm. How could it not be precious?<br/><br/>“This dragon king is really not simple. I wonder how many elemental shards he has obtained. These elemental shards are undoubtedly a great opportunity for ordinary disciples. A few elemental shards can nurture a batch of peak ruler realm experts. ”<br/><br/>“It should be said that the previous Shuiyun’s Divine Dragon clan was too strong. Shuiyun and the others have paved a great path for the future inheritor of the Divine Dragon Clan. If nothing goes wrong, this Dragon King being able to fuse nine attributes should be related to Shuiyun and the others’ arrangements!”<br/><br/>“It should be. Now that the Divine Dragon Clan has risen in power once again, he actually obtained a heavenly fate-level mount. It’s really hard to imagine.”<br/><br/>The twelve ancestral witches were discussing among themselves.<br/><br/>They exchanged a glance and headed straight for the battlefield!<br/><br/>When they started to approach, Lin Niu sensed something and immediately looked over warily!<br/><br/>When he saw the twelve ancestral witches, he was slightly stunned. His face was filled with a different expression as he immediately sent a voice transmission to Wang Xian.<br/><br/>Wang Xian was located in the battlefield of the two elemental gods, so he did not sense the situation around him.<br/><br/>When he heard the voice transmission from Lin Niu, Wang Xian immediately looked over.<br/><br/>When he saw the twelve figures flying over, his gaze froze slightly.<br/><br/>“Twelve ancestral witches?”<br/><br/>He sized them up and was somewhat certain in his heart.<br/><br/>These twelve figures did not have the aura of a heaven origin creator.<br/><br/>Adding on their appearances, they could only be the twelve ancestral warlocks!<br/><br/>Wang Xian hesitated for a moment before he flew out!<br/><br/>“Is it senior twelve ancestral warlocks?”<br/><br/>Wang Xian flew out and greeted the twelve ancestral warlocks politely!<br/><br/>Although these twelve ancestral warlocks weren ‘t heaven origin creator powerhouses, their combined strength was comparable to a heaven origin creator.<br/><br/>They were much stronger than Wang Xian.<br/><br/>Even if he and Lin Niu joined forces, they would not be a match for them. “The Dragon King of the Dragon Palace is really better than us. Impressive!”<br/><br/>Among the twelve ancestral sorcerers, the ancestral sorcerer who was at the center said with a smile!<br/><br/>“Senior, you are too humble. I have only just acquired this strength! ”<br/><br/>Wang Xian smiled and asked, “Are the twelve seniors attracted by the Battle of the Elemental God?”<br/><br/>“Yes, I sensed the Battle of the elemental God here, so I came to take a look. I didn’t expect you to be able to enter the battle range of the Elemental God.<br/><br/>Your methods are really brilliant! ”<br/><br/>The ancestral wizard continued to be polite!<br/><br/>Wang Xian shook his head with a smile when he heard his words.<br/><br/>“The Dragon King is the first one that we have seen, or even heard of, being able to get close to the battlefield of the Elemental God! ”<br/><br/>The human-headed and snake-bodied ancestral witch continued to speak to Wang Xian!<br/><br/>“I was just lucky!”<br/><br/>Wang Xian was slightly curious when he saw their praises!<br/><br/>“Luck is also a part of strength. The Dragon King should have obtained some elemental fragments in the battlefield of the god of elements! ”<br/><br/>The human-headed and snake-bodied ancestral witch continued to speak!<br/><br/>When Wang Xian heard her words, a hint of wariness appeared on his face.<br/><br/>“Hehe, Dragon King, don’t worry. Although we are envious, you are a powerhouse of the nine-origin universe. You are a powerhouse of the Heaven’s origin creation in the nine-origin universe. You can not kill people and steal treasures. Once it appears, you will be wiped out!”<br/><br/>“This is also an agreement among the powerhouses of the nine-origin universe. ”<br/><br/>The ancestral wizard in the center noticed Wang Xian’s vigilance and spoke directly!<br/><br/>“I have just reached this realm. I don’t know anything! ”<br/><br/>Wang Xian smiled.<br/><br/>“Hehe, it’s alright. The tree of Chaos has appeared around our universe. There will be many treasures from the chaos approaching. This is the second battlefield of the elemental gods. It is located in another place. There are also two elemental gods fighting!”<br/><br/>The ancestral wizard in the middle transmitted a message to Wang Xian.<br/><br/>When Wang Xian heard it, his eyes sparkled!<br/><br/>There was another battlefield of the Elemental God?<br/><br/>That meant that there would be elemental fragments there as well!<br/><br/>Why did the twelve ancestral wizards tell him this news?\t\t\t\t\t\t</div>", "images": {}, "success": true}