{"id": 1088, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074085.html", "title": "Chapter 4090 - Chapter 4090: 4089 Extermination, Amongst The Dragon King’S Strength", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4090 - Chapter 4090: 4089 Extermination, Amongst The Dragon King’S Strength</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4090: 4089 extermination, amongst the Dragon King’s strength<br/><br/>“Bang Bang Bang! ”<br/><br/>“Boom Boom! ”<br/><br/>Terrifying sounds of collision rang out continuously.<br/><br/>In the entire chaos, all sorts of energy raged!<br/><br/>Terrifying attacks covered the sky and covered the Sun!<br/><br/>No, this could no longer be called covering the sky and covering the sun.<br/><br/>Instead, it was a terrifying attack that opened up a world.<br/><br/>This world contained Great Terror.<br/><br/>“This… This is the strength of a Heavenly Yuan creation realm expert? If we enter the center of the battlefield, we might be instantly killed. We don’t have the strength to resist! ”<br/><br/>A peak universe master stood on a tree branch and looked at the battlefield in front of them.<br/><br/>Looking at the energy ripples and collisions in front of them, he opened his mouth slightly, his face full of shock!<br/><br/>“Too strong, simply too strong. With a wave of his hand, the heaven and earth changed drastically, as if he had created a world. It’s the Heavenly Yuan Destiny Realm, this is the terror of the Heavenly Yuan Destiny Realm. ”<br/><br/>“Only when one has reached the heavenly yuan destiny realm can one be considered to have truly transcended, only then can one achieve immortality. In this kind of battle, even if we get close, we might lose our lives. The gap is too big! ”<br/><br/>“What a pity, what a pity. Our nine origin universe only has one slot for a water element heavenly yuan destiny realm expert. If we want to break through to the Heavenly Yuan Destiny Realm, we have to enter other universes. This path is too difficult! ”<br/><br/>“When the calamity arrives, even if I have to risk my life, I have to try to break through and enter other universes. ”<br/><br/>The group of peak-level rulers were slightly shocked.<br/><br/>In front of them was a true heaven origin creation realm battle.<br/><br/>The impact this brought was too great!<br/><br/>If they didn’t enter the heaven origin creation realm, they would eventually face death.<br/><br/>After all, during the calamity, even their own lives would be hard to protect.<br/><br/>And after reaching the heaven origin creation realm, everything would be different.<br/><br/>This also made many powerhouses make a decision in their hearts.<br/><br/>This was especially so for powerhouses at the peak of the Water Attribute Universe Dominator realm.<br/><br/>They made up their minds to seize this opportunity.<br/><br/>This was their greatest opportunity as a water attribute powerhouse.<br/><br/>It was just ahead and there weren’t many competitors. They had to seize this opportunity.<br/><br/>“Let me tie down two of them! ”<br/><br/>The Elven Empress saw the three chaos helminth beasts wanting to attack Wang Xian.<br/><br/>He retracted the bow and arrow in his hand and held his staff!<br/><br/>“Whoosh! Whoosh! Whoosh! Whoosh!”<br/><br/>“Whoosh! Whoosh! Whoosh! ”<br/><br/>He pointed his staff forward and tree branches appeared in the chaos. The tree branches quickly wrapped around the two chaos helminth beasts!<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Boom! Boom!”<br/><br/>At this moment, Wang Xian and the Linniu had already arrived in front of the Chaos Helminth Beasts!<br/><br/>The three chaos helminth beasts spat out streams of yellow soil.<br/><br/>The yellow soil completely covered the attacks of Wang Xian and the Linniu!<br/><br/>“Roar! Roar!”<br/><br/>At this moment, they sensed the attacks of the elven empress.<br/><br/>Seeing the branches wrapping around them, the three chaos helminth beasts opened their huge mouths and bit at the branches.<br/><br/>They bit onto the branches and started to devour them.<br/><br/>“Huala! ”<br/><br/>At this moment, Wang Xian stared at the three chaos worms coldly.<br/><br/>The primaless Holy Wings appeared on his back. He flapped his huge holy wings and disappeared in an instant!<br/><br/>In the next moment, he appeared behind one of the Chaos Worms!<br/><br/>Wang Xian had almost tested out these three chaos helminth!<br/><br/>Their offensive and defensive powers were very strong.<br/><br/>However, there was a flaw. In terms of speed, he wasn’t good enough!<br/><br/>On the other hand, Wang Xian was best at speed.<br/><br/>Even though the origineless holy wings had reached its current state, it was no longer as fast as before.<br/><br/>However, his speed was still not slow.<br/><br/>In fact, it was a little fast.<br/><br/>“The divine tail plays with the Pearl! ”<br/><br/>Wang Xian came to the back of the Chaos Helminth and shook his gigantic dragon tail.<br/><br/>The Dragon Tail was directed at one of the Chaos Helminth Beasts.<br/><br/>In front of Wang Xian’s Dragon Tail, this chaos helminth beast was the size of<br/><br/>an ant!<br/><br/>However, when the dragon tail landed on the chaos helminth, it was slightly stunned!<br/><br/>An extremely powerful energy blocked the attack.<br/><br/>Endless Earth attributes spread behind the Chaos Helminth, instantly forming an earth wall that extended to the sky.<br/><br/>Crack! Crack! Crack<br/><br/>However, under Wang Xian’s attack, the earth wall started to crack. The Chaos Helminth’s body still flew forward!<br/><br/>Just when Wang Xian thought that he could pull this chaos helminth to another battlefield, the Chaos Helminth’s body suddenly vanished.<br/><br/>It turned into a dense layer of yellow soil!<br/><br/>It looked like yellow clouds!<br/><br/>The yellow soil flew toward the other two chaos helminth.<br/><br/>Obviously, the three chaos helminths knew that they could not separate from each other!<br/><br/>Once they separated, they would be in danger!<br/><br/>Wang Xian and the elven queen frowned slightly when they saw this scene.<br/><br/>The Elven Queen’s strength was at the control level.<br/><br/>And the control level could kill beginner-level Heaven’s origin creation one-on-one.<br/><br/>However, this was in a one-on-one situation!<br/><br/>Wang Xian had yet to use the five elements grindstone!<br/><br/>However, when the three beasts of chaos gathered together, even if Wang Xian used the five elements grindstone, it would still be difficult to kill them.<br/><br/>That was because they could only kill one of them.<br/><br/>The last one was impossible!<br/><br/>Now that the three of them were gathered together, Wang Xian and the elven empress could at most severely injure them. However, it was impossible for them to kill them.<br/><br/>It was very difficult to kill an existence at the Heaven’s origin level!<br/><br/>“Water forbidden spell, sea-separated water dragon!”<br/><br/>Wang Xian’s gaze was cold as waves of energy were injected into the book of Water Forbidden Spell.<br/><br/>Two water dragons began to condense!<br/><br/>Behind each water dragon, there was a vast ocean!<br/><br/>The two water dragons carried the power of the ocean and the might of the heavens. They attacked the three chaos helminth beasts directly!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>At this moment, the staff in the Queen of Elves pointed forward.<br/><br/>The branches in front of them were entangled together and were heading towards the three chaos helminth beasts separately.<br/><br/>They wanted to separate them!<br/><br/>They could only do so if they were separated.<br/><br/>She would fight two of them while Wang Xian would fight one of them and then destroy them.<br/><br/>Under such circumstances, they would be able to destroy the three chaos helminth beasts.<br/><br/>Otherwise, they wouldn’t be able to kill them!<br/><br/>“Roar Roar Roar! ”<br/><br/>“Roar Roar Roar! ”<br/><br/>The three chaos helminth beasts saw the attacks one after another.<br/><br/>They suddenly leaned against each other and their bodies began to intertwine!<br/><br/>Their bodies actually slowly merged together. Only their heads were separated!<br/><br/>In an instant, they seemed to have turned into a three-headed snake with three heads!<br/><br/>What a strange three-headed snake!<br/><br/>When Wang Xian and the rest saw this scene, their brows furrowed again!<br/><br/>They knew that with their strength, they wouldn’t be able to kill the three Chaos Helminth Beasts!<br/><br/>Need more strong person!\t\t\t\t\t\t</div>", "images": {}, "success": true}