{"id": 1080, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074061.html", "title": "Chapter 4082 - Chapter 4082: 4081 Succeeded, 12 Ancestral Wizards!", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4082 - Chapter 4082: 4081 Succeeded, 12 Ancestral Wizards!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4082: 4081 succeeded, 12 ancestral wizards!<br/><br/>Translator: 549690339<br/><br/>Fire-metal conversion!<br/><br/>Wang Xian did not expect that he would use such a method to enter the battlefield of the two elemental gods.<br/><br/>After entering the battlefield, he revealed a burning expression on his face.<br/><br/>Wang Xian returned to his human form and looked towards the center of the battlefield.<br/><br/>His gaze landed on the two elemental fragments and approached them little by little.<br/><br/>In the surrounding area, the aftermath of the extremely powerful tire and metal elemental attacks were everywhere.<br/><br/>Fortunately, with Wang Xian’s current strength, as long as he wasn’t in the center of their battle, nothing would happen to him.<br/><br/>When he got closer, his gaze locked onto the two elemental fragments.<br/><br/>He moved his palm!<br/><br/>Buzz! Buzz! Buzz<br/><br/>A dragon claw that was constantly interweaving fire and metal elemental attacks clawed at the two elemental fragments!<br/><br/>When the Dragon Claw with fire and metal attributes caught them, Wang Xian kept an eye on the reactions of the two elemental gods.<br/><br/>When he saw that they weren’t paying attention to him, Wang Xian heaved a sigh of relief!<br/><br/>He moved his palm and the two elemental fragments flew towards him!<br/><br/>He kept them in his bag.<br/><br/>“What a huge amount of energy!”<br/><br/>Wang Xian felt the energy of the elemental fragments and his face revealed a look of pleasant surprise!<br/><br/>The value of this elemental fragment was too high!<br/><br/>If a metal and fire elemental expert were to use it for cultivation, their cultivation would be greatly enhanced.<br/><br/>This was the power of the origin of the universe.<br/><br/>It was the purest fire and metal elemental energy.<br/><br/>The energy contained in two palm-sized elemental fragments could easily crush a group of experts at the pinnacle of the Universe Masters.<br/><br/>Although the fire elemental god and the metal elemental God had just entered the Heaven’s origin creation realm, their powers were still at the initial stage of the Heaven’s origin creation realm.<br/><br/>However, they were still items dropped from the Heaven’s origin creation body.<br/><br/>A huge treasure trove!<br/><br/>“These two elemental fragments can increase the number of masters at the peak of the metal and fire elemental dominators in the Dragon Palace. ” Wang Xian mumbled.<br/><br/>This was because the elemental fragments came from the bodies of the two elemental gods and contained the Great Dao.<br/><br/>When a master absorbed the elemental fragments, he would be able to sense the immense power within.<br/><br/>This would make their shackles much smaller and easier to break through!<br/><br/>Furthermore, the elemental fragments had more than one use.<br/><br/>There was another huge use.<br/><br/>That was to allow the five elements millstone to absorb the elemental fragments!<br/><br/>If the five elements millstone could absorb enough elemental fragments, it might be able to break through to the Heaven’s origin blessed realm!<br/><br/>In that case, the Dragon Palace would have an additional Heaven’s origin blessed realm combat strength!<br/><br/>Let’s see how many elemental fragments I can obtain. If I have more, I can definitely improve the five elements millstone<br/><br/>Wang Xian thought to himself as he stared at the battlefield in front of him.<br/><br/>Time passed by slowly.<br/><br/>The battle continued. Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>The rumbling sounds continued to ring out as the two elemental gods continued to collide.<br/><br/>However, not every time, elemental fragments would fall from their bodies!<br/><br/>Crash<br/><br/>A few days later, the collision between the two elemental gods produced a sound.<br/><br/>Following that, Wang Xian saw two elemental fragments the size of a football falling from their bodies and shooting towards the side!<br/><br/>This elemental fragment was many times bigger than the one he had just obtained!<br/><br/>This made Wang Xian reveal an excited expression on his face. He immediately flew over!<br/><br/>This time, he kept it back with ease.<br/><br/>Feeling the terrifying energy of the two elemental fragments, Wang Xian’s face was filled with excitement.<br/><br/>“If I can obtain more than a dozen of these elemental fragments, the five elements millstone should be able to unleash the power of the Heaven’s origin creation level. ”<br/><br/>Wang Xian muttered to himself. His face was filled with anticipation.<br/><br/>These two elemental gods, be it the flame flower or the golden pillar, were extremely powerful existences.<br/><br/>At the very least, they were stronger than Wang Xian!<br/><br/>Even if they were not at the level of control, they were comparable to the early stage of the Heaven’s origin creation.<br/><br/>They should be equivalent to the two of Wang Xian.<br/><br/>Under such circumstances, as long as he obtained more than a dozen elemental fragments of this size, he should be able to achieve some breakthroughs in the five elements grinding!<br/><br/>He kept the elemental fragments and stared at them.<br/><br/>The battle continued!<br/><br/>Time passed by quickly year by year!<br/><br/>In the next ten thousand years, Wang Xian obtained thirteen elemental fragments of varying sizes.<br/><br/>However, it was still a little lacking to achieve a breakthrough in the five elemental grinding mill!<br/><br/>“The number of elemental fragments that fell from the bodies of these two elemental gods is getting lesser and lesser. ”<br/><br/>As the battle continued, the probability of the elemental fragments falling was getting lesser and lesser!<br/><br/>Regardless of whether it was the god of fire element or the god of metal element, they were getting more and more solid.<br/><br/>However, the breakthrough of the five elements grinding was still a little lacking!<br/><br/>Boom! Boom! Boom<br/><br/>The two elemental gods were still clashing.<br/><br/>Wang Xian watched the battle between the two elemental gods. It was a little boring.<br/><br/>There weren’t many techniques. It was just an instinctive collision.<br/><br/>However, the power didn’t diminish in the slightest. In the entire chaos, there was a lot more ferocity.<br/><br/>“Whoosh! Whoosh! Whoosh! ”<br/><br/>“There are elemental gods fighting in front of us. It seems that the appearance of the tree of chaos has indeed added some luster to the surroundings of our nine-origin Universe! ”<br/><br/>“Indeed. In the past, it was rare to see a war between elemental gods in the chaotic space for billions of years. Two of them have already appeared around us. If we guide these two elemental gods into our nine-origin universe, we will be able to add two more powerful grotto-heavens and blessed lands to our voodoo race! ”<br/><br/>While Wang Xian was watching the battle inside.<br/><br/>At a certain location, twelve figures were flying over at a rapid speed!<br/><br/>These twelve figures had different forms.<br/><br/>Their bodies did not look like humans. Streams of energy were connecting the twelve figures.<br/><br/>Furthermore, they were standing in a fixed position.<br/><br/>Each of them looked extremely weak and had not reached the Heaven ‘s origin realm. However, they were able to roam freely in the chaotic space.<br/><br/>And their speed was very terrifying.<br/><br/>These twelve figures were the twelve ancestor Wizards of the Wizard Race!<br/><br/>They were the most special existences in the nine-origin universe.<br/><br/>Although they had not reached the heavenly fate realm, their strength was comparable to the control level of the Heavenly Fate Realm.<br/><br/>“Over there!”<br/><br/>Soon, the twelve figures arrived in front of the battlefield of the two elemental gods.<br/><br/>Their eyes were shining as they stared at the battlefield.<br/><br/>“Hey, Big Brother, look over there. There are creatures there! ”<br/><br/>At this moment, an ancestral magus with white pupils noticed the figure of Lin Niu beside the battlefield. His gaze focused as he spoke!<br/><br/>” HNIM?”<br/><br/>The other eleven ancestral magi looked over and narrowed their eyes slightly.<br/><br/>“Big Brother, look at the aftermath of the battle between the two elemental gods. There’s another figure there! ”<br/><br/>The ancestral wizard with white pupils suddenly spoke in surprise again!<br/><br/>His eyesight was the strongest among the twelve ancestral wizards. Lin Niu and Wang Xian had discovered them before they did!\t\t\t\t\t\t</div>", "images": {}, "success": true}