{"id": 1087, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074082.html", "title": "Chapter 4089 - Chapter 4089: 4088 Killed. Dragon King’S Strength", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4089 - Chapter 4089: 4088 Killed. Dragon King’S Strength</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4089: 4088 killed. Dragon King’s strength<br/><br/>Translator: 549690339<br/><br/>“HMM? Is there a Heavenly Kismet powerhouse invading us in the battle between the Heavenly Kismet Powerhouses?”<br/><br/>“It seems to be a giant beast. Look outside, there are three giant beasts. These three giant beasts are the beasts of chaos that live in the chaos. Their strength is not weaker than the Heavenly Kismet powerhouses!”<br/><br/>“Our Elven empress has made her move. The Dragon King and the others of the Dragon Palace are also here. The battle is about to start. Let’s go and take a 100k!<br/><br/>“The battle between the Heaven Origin Destiny realm experts. What a terrifying battlefield this is! Let’s Go! ”<br/><br/>Inside the tree of chaos, when the powerful disciples heard the Elven<br/><br/>Empress’words, their faces were filled with excitement and excitement.<br/><br/>Their bodies moved and quickly flew to the position in front of them, looking at the Chaos!<br/><br/>“Is that the true form of the Dragon King of the Dragon Palace? It’s so huge, so vast, and the nine-colored energy is covering his entire body. It’s too terrifying! ”<br/><br/>“It really is the sacred body of the Divine Dragon. It’s really powerful, it’s simply too terrifying! ”<br/><br/>“It’s indeed powerful, but the elven empress is also very powerful. Look at her fighting two chaos beasts directly! ”<br/><br/>“The elven empress is very powerful. Among the heavenly yuan fortunes, she’s also a top-tier existence. The accompanying elves of the Elven race are very powerful! ”<br/><br/>When the strong disciples of the nine-origin universe saw the outbreak of the battle, they were all shocked!<br/><br/>“Roar! Roar!”<br/><br/>At this moment, the three beasts of Chaos also let out furious roars when they saw Wang Xian and the rest attacking them.<br/><br/>They had rows of incomparably sharp teeth.<br/><br/>There was liquid flowing out from them. They stared at Wang Xian and the rest with some excitement.<br/><br/>They lived in the chaos. They didn’t know fear, nor did they know fear.<br/><br/>All they knew was that Wang Xian and the rest in front of them were delicious and could fill their stomachs!<br/><br/>They welcomed Wang Xian and the rest directly.<br/><br/>Their entire bodies were covered in gray and earth-like energy.<br/><br/>“Water curse, water burial! ”<br/><br/>Wang Xian locked onto one of the chaos helminth beasts and let out a low growl. The Book of water curse was suspended in the air!<br/><br/>Compared to the past, the power of Wang Xian’s book of water forbidden spell was much stronger now.<br/><br/>Liu Lan’s half of the book of water forbidden spell was given to Wang Xian because Wang Xian had helped them to destroy the Aga Heavenly Demon God.<br/><br/>This book of water forbidden spell in Wang Xian’s hands was only one last part away from becoming a complete Heaven’s origin creation treasure!<br/><br/>Even so, the book of water forbidden spell could still unleash an exceptionally terrifying attack!<br/><br/>The Book of Water Forbidden Spell appeared and the forbidden spell immediately created a chaotic space, completely enveloping the chaos helminth beast!<br/><br/>Boom Boom Boom<br/><br/>The entire forbidden spell attacked the Chaos Helminth Beast!<br/><br/>“woo woo woo! ”<br/><br/>The chaos helminth beast seemed to sense danger.<br/><br/>It raised its head and looked at the water-type forbidden spell above its head!<br/><br/>It opened its mouth and spat out a mouthful of sand!<br/><br/>Above it, the water flow condensed into a special pattern and pressed towards the Chaos Helminth Beast.<br/><br/>Below it, the sand filled the sky and directly rushed towards the sky!<br/><br/>The terrifying energy and boundless might caused everyone’s hearts to tremble!<br/><br/>“Boom! Boom! Boom!”<br/><br/>A terrifying collision sound was heard. The water forbidden spell and the sand let out a huge explosion!<br/><br/>A powerful shockwave rushed towards the surroundings!<br/><br/>“Hua la la la!”<br/><br/>The impact force caused the leaves of the primal chaos tree to let out an intense sound!<br/><br/>“Hide behind the tree branch! ”<br/><br/>A group of 9-origin universe disciples saw this scene and hurriedly shouted!<br/><br/>They immediately hid behind the tree branches.<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Demon God, Roar! ”<br/><br/>When Lin Niu saw Wang Xian making his move, his own attack followed closely behind.<br/><br/>He opened his huge mouth and a terrifying dark face condensed in front of him.<br/><br/>The entire face opened its huge mouth and attacked the Chaos Helminth Beast!<br/><br/>When the Chaos Helminth Beast saw Lin Niu’s attack, it came again and let out a low roar!<br/><br/>His body shook, and waves of grey energy enveloped him!<br/><br/>“Nine-origin Dragon Domain! ”<br/><br/>Wang Xian’s eyes focused, and his body shook. The nine-colored light enveloped the chaos worm beast, wanting to pull it into his domain!<br/><br/>“Forest of elves! ”<br/><br/>At the side, the Elven empress also let out a soft shout.<br/><br/>One by one, the branches spread toward the two chaos beasts, wanting to completely envelop them together!<br/><br/>Domain!<br/><br/>A domain was the strongest technique of a 9-origin universe master.<br/><br/>By pulling the other party into his domain, he would be able to suppress them, and his own combat strength would be even stronger!<br/><br/>“Buzz Buzz Buzz Buzz! ”<br/><br/>“Roar Roar!”<br/><br/>“Roar Roar! ”<br/><br/>In front of them, the three chaos helminth beasts sensed the powerful combat strength of Wang Xian, Elven empress, and the rest. They let out a low roar!<br/><br/>They did not retaliate. Instead, they got closer to each other!<br/><br/>When they got closer, the earth elemental energy from their bodies completely enveloped them.<br/><br/>An incomparably huge Earth Mountain was formed quickly.<br/><br/>This Earth Mountain was the size of dozens of stars. They were located in the middle and could not be seen at all!<br/><br/>“Separate them. Don’t let them gather together!”<br/><br/>The Elven empress frowned when she saw this scene and shouted loudly!<br/><br/>It was also her first time encountering three beasts of chaos that were moving together. Therefore, she did not expect them to have such a move!<br/><br/>“Explode! ”<br/><br/>Wang Xian’s eyes focused. Two dragon horns were emitting light above his head!<br/><br/>“Towering dragon horns! ”<br/><br/>He let out a low growl. The two dragon horns condensed into one and attacked the huge mound!<br/><br/>The single horn of the Unicorn Bull was also emitting a terrifying energy.<br/><br/>The energy condensed into a huge single horn and attacked!<br/><br/>The Elven empress drew her bow and an arrow was condensed on it. On the bow and arrow, it was as though countless trees were born and were growing rapidly!<br/><br/>She shot out an arrow. The arrow that was originally just one arrow turned into countless densely packed arrows that completely enveloped the huge mound!<br/><br/>Boom! Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>The next moment, the sounds of explosions rang out continuously.<br/><br/>The entire mound began to crumble under the attacks of Wang Xian and the rest.<br/><br/>It was as though a huge meteorite had been crushed!<br/><br/>“Roar! Roar!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>At this moment, the three beasts of chaos seemed to have sensed the threat and were also extremely furious.<br/><br/>At the moment when the mound exploded, they attacked Wang Xian at the same time!<br/><br/>They seemed to have sensed that Wang Xian was weaker and wanted to destroy him first!<br/><br/>“Book of Water Forbidden Spell, cosmic torrent! ”<br/><br/>When Wang Xian saw the three beasts of chaos attacking him at the same time, his eyes revealed a cold expression!<br/><br/>He let out a low growl. Above his head, waves of water energy were injected into the book of forbidden water spells.<br/><br/>Following that, it was as though an opening had opened up in the entire chaos.<br/><br/>From the inside, a vast and terrifying water current was flooding towards the three Chaos Beasts!<br/><br/>“Demon God, Demon Beast Charge! ”<br/><br/>Lin Niu lowered his head slightly and let out a low growl.<br/><br/>Behind him, countless demon beast phantoms gathered and charged towards the three Chaos Beasts!\t\t\t\t\t\t</div>", "images": {}, "success": true}