{"id": 1084, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074073.html", "title": "Chapter 4086 - Chapter 4086: With The Breakthrough Of The 4085 Five Elements Grinding Machine", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4086 - Chapter 4086: With The Breakthrough Of The 4085 Five Elements Grinding Machine</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4086: With the breakthrough of the 4085 five elements grinding machine<br/><br/>Translator: 549690339<br/><br/>“Dragon King, it’s a pleasure to work with you! ”<br/><br/>Wang Xian followed the 12 ancestral wizards and guided the Elemental God of water and darkness to the nine-origin universe.<br/><br/>He had finally witnessed some of the power of the 12 ancestral wizards! That powerful array formation was indeed extremely terrifying!<br/><br/>“It’s a pleasure to work with you. ”<br/><br/>Wang Xian smiled and waved his arm. Seven pieces of elemental fragments of darkness attribute flew into their hands!<br/><br/>“We will lead the Elemental God to this area. In the future, the two of US will guard this area. With the four elements, we can cooperate with each other if we can. Leave these matters to our subordinates! ”<br/><br/>The human-headed and snake-bodied ancestral wizard said to Wang Xian with a smile.<br/><br/>“No problem. If the 12 ancestral wizards are able to encounter another war between the Elemental God in the future, you can tell me. Let’s continue to cooperate. When the time comes, we will split all the treasures equally!”<br/><br/>Wang Xian spoke to them.<br/><br/>“Alright, no problem.”<br/><br/>The ancestral witches nodded with a smile.<br/><br/>This time, they had obtained seven elemental fragments. These darkness elemental fragments were of great use to them.<br/><br/>In the chaos, it was not easy for them to obtain treasures of this level.<br/><br/>This was equivalent to cutting off a limb that had just entered the Heaven’s origin creation level and obtaining it!<br/><br/>Wang Xian chatted with the twelve ancestral warlocks for a while more before sending a message to Prime Minister Gui.<br/><br/>He brought the Unicorn Ox and stepped into the chaos once again!<br/><br/>He continued to explore while searching for treasures.<br/><br/>However, it was too difficult to find treasures in the Chaos!<br/><br/>After tens of millions of years, they had only encountered one gigantic chaos meteorite.<br/><br/>This meteorite was traveling at an extremely fast speed in the midst of chaos!<br/><br/>The entire chaos meteorite had a terrifying attractive force.<br/><br/>When Wang Xian encountered this chaos meteorite, he hurriedly tried to avoid it.<br/><br/>This meteorite had a huge area.<br/><br/>Its destructive power was also extremely terrifying.<br/><br/>If he could not avoid it in time, he would definitely die from the impact of this terrifying chaotic meteorite.<br/><br/>He would not be able to resist at all.<br/><br/>Wang Xian felt that even a heaven origin creation stage powerhouse at the mastery level would find it difficult to resist this meteorite!<br/><br/>It was difficult to find treasures. However, as long as one could find them, the level of the treasures would be an existence that even a powerhouse at the peak of the mastery level could only dream of.<br/><br/>It was definitely a powerful treasure.<br/><br/>After nearly 100 million years, Wang Xian stopped!<br/><br/>He looked at the five elements millstone in the mother nest. With a wave of his arm, he released it!<br/><br/>At the same time, there were two fist-sized elemental fragments on the five elements Millstone!<br/><br/>These two elemental fragments were being absorbed bit by bit.<br/><br/>At the same time, the power of the five elements millstone was getting more and more terrifying and stronger!<br/><br/>Wang Xian could feel the might of the five elements millstone and smiled.<br/><br/>“We’re about to break through, we’re about to break through. Once the five elements millstone breaks through, with the help of the Unicorn Ox, we can fight against the control level of the Heaven’s origin creation. We can be considered to have three Heaven’s origin creation level combat strength. ” Wang Xian mumbled.<br/><br/>He waved his arm and waves of energy surged into the five elements millstone to help it absorb more quickly!<br/><br/>As Wang Xian made his move, the absorption and transformation speed of the five elements millstone became faster and faster!<br/><br/>“Roar Roar Roar! ”<br/><br/>“Roar Roar Roar! ”<br/><br/>Amidst the endless chaos, the roars of the five divine dragons could be heard.<br/><br/>The surrounding chaos began to tremble and the surrounding space began to change!<br/><br/>A five-colored space directly opened up the chaos, as though the world was being split apart!<br/><br/>Within the chaos, five divine dragons appeared, swaying their enormous bodies as they intertwined together!<br/><br/>And beneath the five divine dragons was a circular plate.<br/><br/>The entire circular plate emitted a power that caused people to feel awe and fear!<br/><br/>The Five Divine Dragons entered the five elements millstone, and the entire millstone spun and began to grow!<br/><br/>In the end, the entire five elements Millstone’s size was comparable to the size of more than ten stars.<br/><br/>The five divine dragons on it were abnormally clear.<br/><br/>Other than the five divine dragons, there were also densely packed pictures of all kinds of weapons on it.<br/><br/>There were countless pictures!<br/><br/>These were the acquired Supreme Treasures, innate numinous treasures, and the like that the five elements Millstone had absorbed back then!<br/><br/>And these absorbed weapons had fused with the five elements millstone as one, and they were greatly strengthened.<br/><br/>Now, the Five Elements Millstone could release these weapons to attack!<br/><br/>Wang Xian looked at the powerful aura coming from the five elements millstone. With a thought, he waved his arm and a fire-type innate treasure landed on the five elements millstone.<br/><br/>An innate treasure could not be destroyed by a master level powerhouse!<br/><br/>Even a master level powerhouse at the peak of the master level could not destroy it.<br/><br/>However, the destruction power of the Heavenly Yuan creation realm could destroy innate supreme treasures!<br/><br/>Now that the five elements millstone had broken through, it should be able to devour innate supreme treasures!<br/><br/>When the fire attribute sharp sword landed on the five elements Millstone!<br/><br/>The Sharp Sword of the innate supreme treasure realm was being absorbed bit by bit.<br/><br/>At this speed, it would be absorbed within a hundred years!<br/><br/>At that time, the five elements millstone would be able to obtain a slight enhancement!<br/><br/>Of course, this enhancement was limited!<br/><br/>Wang Xian’s eyes lit up when he saw this scene.<br/><br/>Being able to enhance meant that the five elements millstone could be enhanced by devouring innate treasures in the future.<br/><br/>This made him smile.<br/><br/>With a wave of his arm, countless weapons flew out from the five elements millstone. They contained a terrifying aura!<br/><br/>With a thought, the five elemental grindstone shrunk rapidly and floated below him!<br/><br/>“Very good! ”<br/><br/>Wang Xian revealed a satisfied expression.<br/><br/>“Now that the five elemental grindstone has achieved a breakthrough, the elevation of the tai chi dragon disc will depend on luck!”<br/><br/>Wang Xian mumbled.<br/><br/>The Tai Chi Dragon disc required light and darkness elemental fragments to be upgraded.<br/><br/>The darkness elemental fragment that he obtained not long ago had already been traded with the Wizards!<br/><br/>I’ll have to depend on my luck<br/><br/>He thought to himself as he looked at the elemental fragments in his mother nest.<br/><br/>There was also a fire elemental fragment and seven water elemental fragments.<br/><br/>These were all extremely precious treasures!<br/><br/>“Water elemental elemental fragments can help the disciples of the Dragon Palace to improve rapidly. Currently, the nine-origin universe is still lacking a water elemental heaven origin creator. ”<br/><br/>A bright light flashed in Wang Xian’s mind.<br/><br/>However, soon after, he frowned and shook his head.<br/><br/>It was a little difficult!<br/><br/>Currently, there was a slot for a water elemental heaven origin creator in the nine-origin universe. However, the current strength of the water elemental masters of the Dragon Palace was too low!<br/><br/>The strongest, Shui Linglong and her father, the leader of the Water Dragon King, were only at level six of the universe dominator.<br/><br/>Even if they had improved, they were only at the seventh level of the universe dominator.<br/><br/>This was too far away from the Heavenly Yuan blessed realm!\t\t\t\t\t\t</div>", "images": {}, "success": true}