{"id": 1085, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074076.html", "title": "Chapter 4087 - Chapter 4087: 4086 Water Element Tian Yuan Creation Slot!", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4087 - Chapter 4087: 4086 Water Element Tian Yuan Creation Slot!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4087: 4086 water element Tian Yuan creation slot!<br/><br/>Translator: 549690339<br/><br/>u<br/><br/>The 9-origin universe had a water element Tian Yuan creation slot.<br/><br/>However, this slot wasn’t so easy to obtain!<br/><br/>The peak races would definitely fight for this slot.<br/><br/>After all, this was an extra Tian Yuan creation slot for their peak races.<br/><br/>Especially for those who didn’t have a peak race, this was a crucial opportunity.<br/><br/>Because once they missed this opportunity, the slot for the Heaven Origin creator of the 9-origin universe would be full!<br/><br/>If they wanted to break through again, they would have to wait for the arrival of the Apocalypse and head to other universes to break through.<br/><br/>But if they wanted to break through to other universes, first, that universe would have to possess the water attribute.<br/><br/>In addition, one had to face the attack of that universe’s powerhouse.<br/><br/>The other universes did not want to let other universes’powerhouses occupy the spots of the Heaven’s origin manifestation powerhouses.<br/><br/>“Although I have seven elemental fragments now and they are very precious, the other peak races and powerhouses of the Heaven’s origin manifestation should also have some treasures in their hands. ”<br/><br/>“If the Dragon Palace had a water attribute powerhouse at the peak of the Dominator realm, it would be fine. However, if they don’t have one now, it would be a problem! ”<br/><br/>Wang Xian mumbled.<br/><br/>It would take at least 500 to 600 million years for Shui Linglong and her father to advance from their current realm to the peak of the Dominator realm.<br/><br/>This was under the premise of absorbing the elemental fragments.<br/><br/>However, in 500 to 600 million years, those water elemental masters who had reached the peak of the Dominator realm might have already broken through!<br/><br/>“The king of the Water Phoenix of the Phoenix clan, the Queen of the floating water of the celestial nation, and the scholar of the saint’s lineage. The three of them have the best chance of stepping into the Heaven’s fate realm. ”<br/><br/>“The Phoenix race has the emperor of the Phoenix, and the saint’s lineage has the Unity Heaven Saint. They should be nurturing their subordinates and giving them great opportunities. ”<br/><br/>Wang Xian thought about the information about the water-elemental experts in the nine-origin universe.<br/><br/>These three were merely the ones with the highest chance of stepping into the Heaven’s destiny realm.<br/><br/>Furthermore, the Water Phoenix King and the floating water queen both possessed strength that far surpassed ordinary experts at the peak of the ruler realm.<br/><br/>They were closer to the Heaven’s destiny realm.<br/><br/>Other than them, there were more than a dozen experts at the peak of the ruler realm of the water attribute.<br/><br/>They also had a slight chance.<br/><br/>It was impossible for the Dragon Palace to obtain this spot!<br/><br/>“However, no matter what, we can’t let the King of the Water Phoenix of the Phoenix clan break through to the Heaven’s destiny realm! ”<br/><br/>Wang Xian’s eyes sparkled.<br/><br/>Even if the Dragon Palace was unable to produce an expert in the Heavenly Yuan blessed realm, he would still have to intervene.<br/><br/>The best way was to invest in an expert of the water attribute and nurture him.<br/><br/>With the resources in his hands, no expert would reject him.<br/><br/>After all, Wang Xian had seven pieces of water elemental fragments in his hands.<br/><br/>These were the fragments of the elemental god of the powerful Heavenly Yuan blessed realm. They were extremely beneficial for breaking through.<br/><br/>In addition, Liu Lan from the sword and Magic Universe was the Heaven’s origin creation.<br/><br/>With their relationship, he could definitely bring it over and let Liu Lan give him some pointers!<br/><br/>Having made up his mind, Wang Xian moved his body and flew towards the direction of the Tree of Chaos!<br/><br/>After flying for hundreds of years, Wang Xian arrived in front of the tree of chaos.<br/><br/>In the chaos, one could not immediately return to one’s divine kingdom!<br/><br/>That was because one could not sense one’s divine kingdom in the chaos.<br/><br/>The chaos was so vast that flying for a period of time would take hundreds to thousands of years.<br/><br/>Time was the most worthless thing in the chaotic space!<br/><br/>“Dragon King! ”<br/><br/>Wang Xian returned to the place where the disciples of the Dragon Palace were cultivating in the tree of chaos.<br/><br/>Prime Minister Gui immediately came forward and greeted him respectfully!<br/><br/>“Prime Minister Gui, check the situation of all the water-elemental powerhouses in our nine-origin universe and all the information. ”<br/><br/>Wang Xian instructed Prime Minister Gui!<br/><br/>“It’s the Dragon King! ”<br/><br/>Prime Minister Gui nodded his head and replied immediately!<br/><br/>Wang Xian found a random spot on a tree branch and began to cultivate quietly.<br/><br/>He sensed the surrounding locations.<br/><br/>There was only one heaven origin creator here.<br/><br/>The Elven empress did not leave.<br/><br/>The other heaven origin creator powerhouses seemed to have left and were exploring the surrounding areas.<br/><br/>There must be treasures around the tree of chaos. This was the consensus in the chaos.<br/><br/>The heaven creation realm powerhouses would naturally not let this opportunity go!<br/><br/>And the situation around them was indeed like this.<br/><br/>Under normal circumstances, a heaven creation realm powerhouse would need billions of years or even billions of years to encounter a situation like the battle between the elemental gods.<br/><br/>However, there were two occurrences in the surroundings.<br/><br/>This was related to the tree of chaos.<br/><br/>This was because the tree of chaos could protect a space. The power of chaos would wear down everything that was not chaotic.<br/><br/>These items that were born in the chaos instinctively wanted to find a place where they could live.<br/><br/>The tree of chaos was one of them!<br/><br/>“Dragon King, this is the information of all the water-type powerhouses in our nine-origin universe. ”<br/><br/>Soon, Prime Minister Gui sent over a set of information and reported to Wang Xian.<br/><br/>“What is the highest level of strength of the water-elemental masters in our Dragon Palace?”<br/><br/>Wang Xian asked.<br/><br/>“Leader of the Water God Dragon, he just broke through to the seventh level of the universe dominator not long ago! ”<br/><br/>Prime Minister Gui said!<br/><br/>Wang Xian shook his head and looked at the information in his hand.<br/><br/>These were all water-elemental masters who were at the peak of the Dominator realm.<br/><br/>Among them, there were a total of five from the Phoenix clan!<br/><br/>Among the group of water-elemental masters, the number of water-elemental masters was the highest.<br/><br/>“Was the emperor of the Phoenix prepared for this?” Wang Xian looked at the information and frowned!<br/><br/>This was not good news.<br/><br/>If the Phoenix clan had one more heaven origin creator, it would be even more difficult to annihilate them!<br/><br/>Other than the Phoenix clan, the celestial nation, the saint lineage, the royal family, and the Xuanwu clan, all of them had water elemental powerhouses. They all had the chance to step into the Heaven Origin Creation Stage!<br/><br/>Looking at this information, Wang Xian pondered in his heart!<br/><br/>Gradually, he had an idea in his heart. As for whether this idea would succeed, it was hard to say!<br/><br/>“There are still more than 300 million years. According to the agreement, I will select three water-elemental powerhouses who have the greatest potential to reach the Tianyuan Destiny Realm. Then, I will nurture them. From them, I will create a water-elemental Tianyuan Destiny Realm Powerhouse. ”<br/><br/>Wang Xian mumbled.<br/><br/>There were still more than 300 million years!<br/><br/>During this period of time, he did not plan to go out.<br/><br/>He called two fire divine dragons over. Wang Xian gave them the elemental fragment so that they could absorb it and increase their strength quickly!<br/><br/>Following that, Wang Xian also called the leader of the water dragons, Shui Linglong’s father, over.<br/><br/>Shui Linglong’s father had the strength of a level seven universe overlord.<br/><br/>Wang Xian gave him an elemental fragment so that he could cultivate and see if he could reach the peak of the universe overlord realm in more than 300 million years.<br/><br/>If it was possible, there was still a chance.<br/><br/>If it was not possible, forget it!<br/><br/>Wang Xian did not expect too much either!\t\t\t\t\t\t</div>", "images": {}, "success": true}