{"id": 1090, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074091.html", "title": "Chapter 4092 - Chapter 4092: 4091 Attacked With All Its Might", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4092 - Chapter 4092: 4091 Attacked With All Its Might</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4092: 4091 attacked with all its might<br/><br/>Translator: 549690339<br/><br/>The three chaos helminth beasts saw Wang Xian and the rest attacking them.<br/><br/>Sensing the terrifying might, they didn’t dare to gather together.<br/><br/>When they gathered together, they would suffer even more attacks!<br/><br/>They let out a wild roar and flew straight to the back.<br/><br/>The Chaos Helminth beast that was targeted by Wang Xian and the rest also flew back in an attempt to escape.<br/><br/>Although they didn’t have much intelligence, they knew how to avoid danger.<br/><br/>Faced with the attacks of Wang Xian and the rest, the three chaos helminth knew that they were no longer their match.<br/><br/>If they were not careful, they might even die!<br/><br/>This caused the three chaos helminth to flee into the distance with all their might!<br/><br/>Buzz<br/><br/>Wang Xian’s body trembled. The nine-origin dragon realm completely enveloped him!<br/><br/>The Unicorn Ox charged towards the chaotic worm beast. Wang Xian also enveloped it within. A powerful energy landed on the Unicorn Ox’s body, causing his speed to increase by a lot.<br/><br/>Wang Xian flapped his primaless saint wings and flew over quickly as well!<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Roar! Roar! Roar! ”<br/><br/>Within his nine-origin domain, the shadows of Divine Dragons appeared one after another.<br/><br/>The entire space was completely sealed by Wang Xian!<br/><br/>The Linniu flew to the front of the Chaos Helminth Beast and lifted its claws.<br/><br/>Its entire claw grew longer, resembling a blood-red bone blade!<br/><br/>On its body, the unique symbols seemed to have come alive.<br/><br/>The symbols flew out and transformed into a terrifying demonic beast, biting at the Chaos Helminth Beast!<br/><br/>When the Chaos Helminth saw the unicorn ox fighting it at close range, it let out a wild roar and charged forward.<br/><br/>It opened its mouth and rows of sharp teeth could be seen on it.<br/><br/>These sharp teeth contained a terrifying aura.<br/><br/>The Unicorn Ox was not afraid at all. Its strength was not weaker than the chaos helminth!<br/><br/>At this moment, Wang Xian waved his arm and the five elements Millstone flew out.<br/><br/>There was no need for him to hide the five elements millstone in the 9-ORIGIN domain!<br/><br/>After the five elements Millstone flew out, it spun and headed straight for the Chaos Helminth!<br/><br/>On top of the five elements millstone, all kinds of weapons shot out.<br/><br/>Each weapon contained a powerful destructive force!<br/><br/>Wang Xian extended his dragon claws and attacked as well!<br/><br/>All of them were close combat attacks!<br/><br/>When the chaos helminth saw the continuous attacks, its eyes revealed a look of fear!<br/><br/>Its body shook violently as streams of earth elemental energy wrapped around its entire body!<br/><br/>When Wang Xian and the five elements millstone saw it defending itself, they went to three different positions and surrounded it!<br/><br/>Boom! Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>All kinds of attacks attacked the chaos helminth!<br/><br/>Bang! Bang! Bang<br/><br/>The defense around the chaos helminth was crumbling rapidly.<br/><br/>It could not withstand the combined attacks of Wang Xian and the rest!<br/><br/>The Unicorn Ox charged forward directly. The horn on its head began to grow bigger and longer. It grew to the size of 10,000 meters and pierced towards its body!<br/><br/>The chaos helminth quickly defended itself!<br/><br/>However, Wang Xian and the five elements Millstone were attacking the chaos helminth directly from the side!<br/><br/>On the Five Elements Millstone, the five divine dragons merged together and condensed into a dragon claw that attacked the Chaos Helminth!<br/><br/>The top of Wang Xian’s Head was towering. The dragon horn emitted a radiance and landed on the book of forbidden water spells.<br/><br/>A terrifying stream of water fell from the book of forbidden water spells.<br/><br/>The stream of water pierced through the chaos helminth!<br/><br/>The chaos helminth couldn’t Dodge the attack that was launched at the same time!<br/><br/>“Roar Roar Roar! ”<br/><br/>Following that, it let out a blood-curdling scream.<br/><br/>Fresh blood oozed out from the Chaos Helminth’s body.<br/><br/>Its fresh blood was an earthy yellow liquid that contained pure earth elemental energy!<br/><br/>“Roar Roar Roar! ”<br/><br/>“Dong Dong Dong! ”<br/><br/>It let out a roar from its mouth and a rumbling sound came from its body. It was as though an earthquake had erupted!<br/><br/>In the surrounding area, Wang Xian’s 9-origin domain started to tremble violently.<br/><br/>The surrounding space also started to tremble violently!<br/><br/>“Five-element Annihilation Disc! ”<br/><br/>Wang Xian saw this attack from the chaos helminth and channeled his energy into the five-element millstone!<br/><br/>The five-element millstone started to spin and rose directly above the Chaos Helminth!<br/><br/>Waves of crushing energy started to revolve continuously.<br/><br/>Five-element revolve, five-element annihilation disc!<br/><br/>The five elements annihilated disc resisted the attack of the Chaos Helminth.<br/><br/>Wang Xian, who was at the side, slowly opened his dragon mouth. A wave of energy was brewing in his mouth!<br/><br/>“Boom!”<br/><br/>A nine-colored torrent attacked the chaos helminth!<br/><br/>At the side, the special symbols on the body of the unicorn ox emitted a glow. His incomparably thick scales began to change.<br/><br/>Bone spikes extended out from his body.<br/><br/>Each of the blood-red bone spikes was a thousand meters in size.<br/><br/>This made the Linniu look like a devil!<br/><br/>The bone spikes on the Linniu’s body shot out from his body and headed straight for the Chaos Helminth!<br/><br/>“PFFT! PFFT! PFFT!”<br/><br/>The sound of penetration was heard once again!<br/><br/>“Roar! Roar! Roar!”<br/><br/>The chaos Helminth’s screams continued.<br/><br/>Faced with the siege of Wang Xian and the others, this chaos helminth did not have the strength to resist!<br/><br/>With what?<br/><br/>Wang Xian one-on-one with this chaos helminth beast to fight a draw, coupled with the case of Lin Niu and five elements grinding, is completely crushed.<br/><br/>One-sided battle!<br/><br/>Just like Agatha Devil at that time, can resist the attack of two of the same level, but against three simply can not resist.<br/><br/>Even if they were able to withstand the attacks for a short period of time, it would be at the expense of their lives!<br/><br/>This chaos helminth didn’t have as many tricks as the Asgardians.<br/><br/>It would be even more difficult to escape and resist!<br/><br/>A special blood gushed out from the body of the chaos helminth. It was filled with fear as it roared crazily!<br/><br/>Streams of blood transformed into attacks. They condensed into earth spikes and attacked Wang Xian and the rest!<br/><br/>“Be careful! ”<br/><br/>Wang Xian reminded them. His body trembled and he moved to his side. The accompanying elf spirit appeared beside him.<br/><br/>At the moment, the accompanying Elf Spirit and the Ghost Avatar did not improve with him. Hence, they possessed the combat strength of the Heaven’s origin blessed realm.<br/><br/>The reason was that they did not have enough energy and Wang Xian’s realm was not high enough!<br/><br/>The reason why Wang Xian was able to possess the ghost avatar was largely due to the ancestral tree.<br/><br/>The ancestral tree supported a portion of the Ghost Avatar’s energy.<br/><br/>Now that the ancestral tree had not reached the Tianyuan blessed realm, how could the ghost avatar possess the strength of the Tianyuan blessed realm?<br/><br/>Similarly, the accompanying elf spirit was the same.<br/><br/>They relied on Wang Xian, but they also relied on the ancestral tree!<br/><br/>However, the current spirit spirit was still of great use to Wang Xian.<br/><br/>The Netherspirit clone would not be able to do it!<br/><br/>When the Spirit Spirit appeared, the book of water curse immediately landed in her hands..\t\t\t\t\t\t</div>", "images": {}, "success": true}