{"id": 1094, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074104.html", "title": "Chapter 4096 - Chapter 4096: 4095 To Invest In The Floating Queen", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4096 - Chapter 4096: 4095 To Invest In The Floating Queen</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4096: 4095 to invest in the floating queen<br/><br/>Translator: 549690339<br/><br/>When the floating queen and the other two middle-aged men heard Wang Xian’s request, their expressions changed slightly!<br/><br/>Before they came here, they already had some guesses in their hearts!<br/><br/>However, they were still shocked when the dragon king directly said that he would exterminate the Phoenix clan in the future.<br/><br/>He was going to fight to the death with the Phoenix clan!<br/><br/>“Alright, we agree! ”<br/><br/>The bearded middle-aged man’s expression changed. He took a glance at the queen of the floating water and his gaze landed on Wang Xian as he replied.<br/><br/>They didn’t hesitate too much.<br/><br/>The thing that Wang Xian offered was too tempting!<br/><br/>The conditions that he offered were too tempting.<br/><br/>He had to bear this responsibility only when he broke through to the Heaven’s origin blessed realm.<br/><br/>If the queen of the floating water broke through to the Heaven’s origin blessed realm, their celestial nation would have a heaven’s origin blessed realm powerhouse.<br/><br/>The last spot in the nine-origin universe.<br/><br/>This spot was too precious. If he missed it, he would not be able to obtain it in the future!<br/><br/>The price of this spot was not too high.<br/><br/>When Wang Xian saw that the queen of the floating water’s elder brother had agreed, he landed on the queen of the floating water with a smile.<br/><br/>Sure.”<br/><br/>The queen of the floating water nodded.<br/><br/>“Alright. If you break through to the Heaven’s origin blessed realm, we are on the same level. Without absolute confidence, I will not exterminate the Phoenix clan. I will give you these elemental fragments! ”<br/><br/>Wang Xian waved his arm and passed the seven elemental fragments to queen floating water!<br/><br/>“Thank you for your nurturing, Dragon King. If I manage to break through in the future, I will definitely fulfill my promise. I will not disappoint you, Dragon King!<br/><br/>Queen floating water immediately thanked Wang Xian when she saw him giving all seven elemental fragments to her.<br/><br/>“No need to thank me. We are also working together. Of course, the main purpose is to prevent the Phoenix clan from having another powerhouse in the Heaven’s origin blessed realm. ”<br/><br/>Wang Xian answered truthfully. There was nothing to hide.<br/><br/>Queen of the floating waters was slightly stunned when she heard Wang Xian’s words. She could not help but ask, “What if I reject you, Dragon King?”<br/><br/>“Hehe, then I will look for the Hetian saint and do my best to raise the water-elemental powerhouse from the saint’s lineage to the Heavenly Yuan blessed realm. ”<br/><br/>Wang Xian chuckled and replied.<br/><br/>“Then I am really glad that I made this choice. Dragon King, I will go back to cultivate immediately and strive to complete my breakthrough! ”<br/><br/>The Queen’s heart skipped a beat as she bowed to Wang Xian.<br/><br/>“Sure. After the agreed time of 500 million years, I will bring you to another universe and let a water-elemental Tianyuan Destiny Realm Powerhouse Guide You!<br/><br/>Wang Xian spoke to her and waved his hand. “Thank you, Dragon King.”<br/><br/>The queen thanked him again and flew out!<br/><br/>“This Dragon King actually gave all the precious elemental fragments to little sister. Furthermore, he didn’t restrict our cooperation or guarantee anything! ”<br/><br/>The three of them flew towards the celestial nation.<br/><br/>On the right, the second brother of the Queen couldn’t help but speak up.<br/><br/>“Because the Dragon King isn’t worried about us returning. Even if little sister’s strength has broken through, as long as we don’t fulfill our promise, with his strength, he can destroy little sister and our Celestial Nation!”<br/><br/>“Looking at the history of the development of the Dragon Palace and the history of its rise, the Dragon King also knows that we don’t dare to not fulfill our promise. ”<br/><br/>The bearded middle-aged man on the left replied!<br/><br/>The history of the Dragon Palace’s development and its rise was all the way here.<br/><br/>No matter what race you were, even if you were a phoenix or an angel race.<br/><br/>As long as you dared to provoke the Dragon Palace, the Dragon Palace would dare to fight to the death with you.<br/><br/>At that time, the Dragon King’s strength was not so strong yet he dared to face the two peak races.<br/><br/>If their immortal nation dared to go back on their words, then with the Dragon<br/><br/>King’s character, the immortal nation would not give up until it was destroyed.<br/><br/>Besides, with their current strength, it was not difficult for them to kill a cultivator who had just broken through to the Heavenly Yuan creation realm.<br/><br/>“That’s true, little sister. This is an opportunity for our celestial nation, and it’s also an opportunity for you. The Dragon King of the Dragon Palace wants to nurture you with all his strength. The resources in this Dragon King’s hands are definitely not weaker than the emperor of Phoenix and the Hetian saint. He even knows the water-type heavenly yuan creation of other universes and is<br/><br/>slightly stronger. Your Chance is great. You Must Seize It!”<br/><br/>The middle-aged man on the right nodded and said to queen floating water.<br/><br/>“Big Brother, second brother, I Will!” Queen floating water nodded heavily.<br/><br/>This was a huge opportunity for her.<br/><br/>She also had the support of the powerful Heaven’s origin creation. She was no longer weaker than the other two competitors.<br/><br/>She even felt that the dragon king might not have what he offered.<br/><br/>She had to make a breakthrough.<br/><br/>The Queen of the floating waters made up her mind. She would return to the territory of the celestial nation and start cultivating immediately!<br/><br/>“1 hope I can make a breakthrough!”<br/><br/>Wang Xian muttered as he watched the Queen of the floating waters leave.<br/><br/>This time, his investment was huge.<br/><br/>If there was no return, he would suffer a huge loss!<br/><br/>Buzz! Buzz! Buzz<br/><br/>Time passed day by day. On this day, one by one, figures with vast and mighty power flew over.<br/><br/>Wang Xian sensed it and looked over.<br/><br/>500 million years have passed. The group of powerhouses in the Heaven’s origin realm also attach great importance to this matter. ”<br/><br/>He mumbled.<br/><br/>“Everyone, let’s gather! ”<br/><br/>“Disciples at the peak of the water-elemental universe dominator, come over too!<br/><br/>Not long after, the voice of the unity saint was heard.<br/><br/>Wang Xian moved his body and flew over immediately. He hovered not far away from the unity saint.<br/><br/>“Greetings, Sirs!”<br/><br/>A group of disciples at the peak of the Water Elemental Universe Overlord realm also flew over immediately and greeted them!<br/><br/>In the surroundings, other than Wang Xian and the eight heaven origin creation stage powerhouses, there were also twelve ancestral wizards!<br/><br/>Wang Xian’s gaze landed on the Queen of the floating waters and sensed her strength and realm.<br/><br/>Compared to 100 million years ago, he could sense that the queen of the floating waters ‘strength had increased significantly.<br/><br/>The elemental fragments were still very effective!<br/><br/>The strength of the Queen of the floating waters was still at the forefront!<br/><br/>“The celestial nation’s queen of the floating waters, the king of the Water<br/><br/>Phoenix, and the scholar. The three of them are still the ones with the highest realm. Everyone, it shouldn’t be wrong, right? If it’s not wrong, let’s nurture<br/><br/>the three of them!”<br/><br/>The unity saint swept his gaze across the disciples who were at the peak of the water attribute universe Dominators and spoke to Wang Xian and the rest!<br/><br/>“No objections. ”<br/><br/>Wang Xian and the rest nodded.<br/><br/>“Alright. In the next period of time, we will use tens of millions of years to solve all the cultivation problems for the three of them. The rest of your disciples will also have the opportunity to listen by the side. ”<br/><br/>The Hetian Saint spoke to them.<br/><br/>“Thank you, My Lords! ”<br/><br/>The Queen of the floating waters and the rest spoke with gratitude.<br/><br/>The twelve ancestral wizards, the Dragon King, Lin Niu from the Dragon Palace, the twelve ancestral wizards, and the Eight Heaven origin creation realm powerhouses had specially taught them for tens of millions of years.<br/><br/>It could be said that more than ten heaven origin creation realm powerhouses had taught them. This was definitely a great opportunity.<br/><br/>This was no longer a one-on-one, but three-on-one, four-on-one!\t\t\t\t\t\t</div>", "images": {}, "success": true}