{"id": 1093, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074100.html", "title": "Chapter 4095 - Chapter 4095: 4094 To Invest In The Floating Water Queen", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4095 - Chapter 4095: 4094 To Invest In The Floating Water Queen</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4095: 4094 to invest in the floating water queen<br/><br/>Translator: 549690339<br/><br/>Time passed.<br/><br/>In the current nine-origin universe, the status of the Dragon Palace had improved tremendously.<br/><br/>The arrival of Wang Xian, the Dragon Palace of two heaven origin creation realm powerhouses.<br/><br/>The powerful killing of a Chaos Helminth Beast in the Heaven origin creation realm made all the disciples of the peak races in the nine-origin universe realize the power of the Dragon Palace.<br/><br/>No one dared to underestimate the power of the Dragon Palace.<br/><br/>Even the old peak races and the Old Heaven’s origin realm.<br/><br/>The current Dragon Palace was only slightly weaker than when the Divine Dragon clan was at their peak.<br/><br/>This point would be slowly erased over time!<br/><br/>Wang Xian was guiding the disciples of the Dragon Palace to cultivate at the tree of chaos. In the blink of an eye, another 100 million years had passed!<br/><br/>He stood on a branch of the tree of chaos and closed his eyes slightly to sense everything around him.<br/><br/>Wang Xian had the water attribute in his body. With his full strength sensing, he could sense the strength of the water attribute experts around him and the amount of energy in his body.<br/><br/>“The three of them have the best chance of breaking through to the Heaven’s origin blessed realm. ”<br/><br/>Wang Xian mumbled.<br/><br/>The Water Phoenix King of the Phoenix tribe, the floating queen of the Celestial Nation, and the scholar of the Saint tribe.<br/><br/>There were still about 100 million years before the agreed time of 500 million years.<br/><br/>The three of them had the most potential.<br/><br/>This was especially so for the Water Phoenix King and the Saint tribe. Behind them were powerhouses in the Heavenly Yuan blessed realm.<br/><br/>The Floating Queen of the Celestial Nation was one of the rulers of the Celestial Nation!<br/><br/>There were three kings in the entire celestial nation.<br/><br/>At the same time, they were brother and sister.<br/><br/>The three of them founded the celestial nation.<br/><br/>The Celestial Nation was a force that was born after the last calamity. There were no powerhouses in the Heavenly Yuan blessed realm to oversee it.<br/><br/>The possibility of controlling it is too small. However, I can let him stand on the front line of the Dragon Palace Wang Xian thought to himself.<br/><br/>He would definitely take a gamble and bet on a treasure!<br/><br/>Now that there was a slot for the Heaven’s origin creation in the nine-origin universe, there was no need for him to fight for it under the original circumstances. There was no need for him to participate in it.<br/><br/>However, there was an opportunity for the Phoenix clan to have an extra heaven’s origin creation powerhouse.<br/><br/>This was something that Wang Xian would never allow. “Prime Minister Gui, go and call queen floating water over. ” Wang Xian transmitted his voice to Prime Minister Gui!<br/><br/>“It’s the Dragon King! ”<br/><br/>Prime Minister Gui replied immediately and flew towards the celestial nation.<br/><br/>Soon, three figures followed Prime Minister Gui and flew over!<br/><br/>Among the three figures, there was a woman wearing a blue windbreaker!<br/><br/>The other two were middle-aged men in armor.<br/><br/>Their looks were somewhat similar.<br/><br/>“Dragon King, Queen of the floating waters is here. There are also the other two kings of the Celestial Nation! ”<br/><br/>Prime Minister Gui flew over and bowed to Wang Xian!<br/><br/>“Greetings, Dragon King! ”<br/><br/>Queen of the floating waters and the other two bowed respectfully when they saw Wang Xian.<br/><br/>There were strong and weak factions.<br/><br/>Even though the Celestial Nation was a peak race, they did not have any powerhouses in the Heaven’s origin manifestation stage.<br/><br/>However, even if they had powerhouses in the Heaven’s origin Kismet realm, they would still have to bow to other powerhouses in the Heaven’s origin Kismet Realm!<br/><br/>“Queen of the floating waters, right? Her strength is not bad. Her attainments in the water element are already very high! ”<br/><br/>Wang Xian sized up the queen of the floating waters and said with a smile.<br/><br/>“I still can’t compare to you, Dragon King. ”<br/><br/>The Queen of the floating waters immediately bowed and replied.<br/><br/>“Before I called you over, did any other powerhouses in the Heaven’s origin Kismet Realm Call For You?” Wang Xian asked directly.<br/><br/>“Two of them told me something. ”<br/><br/>The queen of floating water hesitated for a moment and did not hide anything!<br/><br/>Previously, someone from the Heaven’s origin realm had contacted her.<br/><br/>The intention was also very obvious. They wanted to invest in her.<br/><br/>When the queen of floating water received this message, she was still very excited. However, she quickly calmed down.<br/><br/>Her competitors also had powerhouses of the Heaven’s origin creation behind them.<br/><br/>There was still a gap between her and her competitors!<br/><br/>“Your other two competitors have the Heaven’s origin creation behind them. They are not people like you who can compare to them. Of course, breaking through the Heaven’s origin creation depends more on one’s comprehension ability. You still have a great chance. This chance is at least 20% ! ”<br/><br/>“Now, I want to invest in you.”<br/><br/>As Wang Xian spoke, he moved his palm and pieces of water elemental elemental fragments appeared in his hand.<br/><br/>When the elemental fragments appeared, queen of floating water trembled slightly. She stared at the water elemental fragments in disbelief.<br/><br/>“These are the elemental fragments, the fragments of the Elemental God. As for the Elemental God, well, it is stronger than the chaos helminth we hunted not long ago. You should be able to feel the energy of the origin! ”<br/><br/>“I have a total of seven elemental fragments in my hands now. These seven elemental fragments will allow my dragon palace to add ten experts at the peak of the water-elemental universe overlord realm. There won’t be any problems at all!<br/><br/>Wang Xian spoke to her.<br/><br/>“Dragon King… i… I can feel the energy coming from within! ”<br/><br/>“I know how precious they are! ”<br/><br/>The floating queen said with a burning gaze.<br/><br/>“Dragon King, you took out such a precious treasure and you want to invest in my sister? What do we need to do?”<br/><br/>The bearded middle-aged man beside the queen of the floating waters asked Wang Xian with a twinkle in his eyes!<br/><br/>“Yes, I want to invest. The elemental fragment is one of them. There’s another one. Wait for me to finish! ”<br/><br/>Wang Xian smiled and continued, “I know a water-type heaven origin creator in another universe. I can bring you there and let her guide you. ”<br/><br/>The moment he said that, the queen gaped.<br/><br/>The two middle-aged men beside him also widened their eyes in shock.<br/><br/>He could let a water-elemental Tianyuan creator guide him?<br/><br/>This? ?<br/><br/>This was a great opportunity for a powerhouse who wanted to break through to the Tianyuan creator realm!<br/><br/>“Dragon King, I can’t reject what you have offered. However, I want to know what price I have to pay!”<br/><br/>Queen of floating water grabbed the corner of her windbreaker and asked Wang Xian!<br/><br/>“The Dragon Palace will have to wage a war with the Phoenix clan eventually. If you break through to the Tianyuan blessed realm, you have to stand on the same side as the Dragon Palace until the Phoenix clan is annihilated. ”<br/><br/>“If you can’t break through to the Tianyuan blessed realm, consider it as a failure of my investment. All you have to do is return the remaining elemental fragments. You Don’t have to pay any price! ”<br/><br/>“For the rest, I will not ask your celestial nation to do anything. This is the price you will have to pay. Make a decision. ”<br/><br/>Wang Xian spoke to them!<br/><br/>This was the request that Wang Xian had made. This request was neither high nor high.<br/><br/>However, if one wanted to obtain a huge opportunity, one would have to bear the consequences of welcoming them.<br/><br/>For Wang Xian to be able to offer such a condition, it was already considered pretty good.<br/><br/>After all, it was impossible for other strong practitioners of the Heaven’s origin realm to nurture the floating queen like Wang Xian did.<br/><br/>It was even difficult for other strong practitioners of the Heaven’s origin realm to achieve even one-fifth of what Wang Xian offered.<br/><br/>After all, behind the competitors of the floating queen was their race, the race that possessed the Heaven’s origin realm..\t\t\t\t\t\t</div>", "images": {}, "success": true}