{"id": 1098, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074120.html", "title": "Chapter 4100 - Chapter 4100: 4099 Special Life Form", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4100 - Chapter 4100: 4099 Special Life Form</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4100: 4099 special life form<br/><br/>Translator: 549690339<br/><br/>“Dragon King, the energy in this universe is indeed very special. Among the five elements energy, there is also another special energy. This energy has a kind of deathly stillness and a kind of vitality. How Strange! ” Lin Niu scanned his surroundings and spoke to Wang Xian as well!<br/><br/>a Indeed!<br/><br/>Wang Xian nodded his head.<br/><br/>Their strength had already reached the Heaven’s origin blessed realm. Although they were suppressed now, their senses and reactions were not suppressed.<br/><br/>What was suppressed was just pure strength.<br/><br/>An Ordinary Heaven’s origin blessed realm powerhouse was still no match for Wang Xian and the rest!<br/><br/>“Let’s go. Let’s go and understand the situation in this universe! ”<br/><br/>Wang Xian spoke. He looked at the depth of the universe and flew over immediately!<br/><br/>Lin Niu followed him immediately.<br/><br/>The two of them flew in the same direction.<br/><br/>Due to the suppression of their strength, their speed was much slower.<br/><br/>Based on the huge area of a universe, it would take at least tens of millions of years to explore the entire universe.<br/><br/>However, usually, the birth of a heaven’s origin treasure should be at the center of the universe.<br/><br/>Therefore, they were prepared to explore the center of the universe.<br/><br/>Buzz! Buzz<br/><br/>Wang Xian and the rest flew. Two hundred years passed very quickly.<br/><br/>A place close to the chaos belonged to the edge of the universe. Usually, there were no living beings living there.<br/><br/>That place was also the place with the thinnest energy.<br/><br/>When Wang Xian and the rest flew for two hundred years, Wang Xian suddenly sensed something.<br/><br/>“There seems to be something down there!”<br/><br/>Wang Xian spoke to the unicorn ox with a hint of vigilance on his face.<br/><br/>Now that the ultimate treasure of the Heaven’s origin creation had appeared in this universe, the powerhouses of the Heaven’s origin creation in this universe already knew about the arrival of the powerhouses of the Heaven’s origin creation in other universes.<br/><br/>They would definitely be on guard against their group of intruders.<br/><br/>They might even want to kill them. Wang Xian and the rest had to be careful!<br/><br/>“Boss, are there any living beings around?”<br/><br/>Lin Niu’s gaze focused. One of his single eyes emitted a glow as he looked down.<br/><br/>His pupils were emitting a white glow.<br/><br/>Wang Xian stared down and observed carefully.<br/><br/>When he landed at a certain spot, he immediately flew over.<br/><br/>Lin Niu had also noticed something. He moved his body and flew over at the same speed!<br/><br/>“Ji Ji Ji Ji!”<br/><br/>From the ground below, a series of ear-piercing screeches could be heard.<br/><br/>Following that, Wang Xian and the rest saw the entire ground shaking.<br/><br/>When Wang Xian saw this scene, he waved his arm and an energy palm instantly gathered and grabbed towards the ground below!<br/><br/>The ear-piercing screeches could be heard once again.<br/><br/>However, at this moment, Wang Xian’s gigantic palm grabbed a piece of land in his hand.<br/><br/>With a move of his palm, the soil in his palm disappeared, revealing the living beings inside.<br/><br/>When he saw the living beings inside, a stunned expression appeared on his face.<br/><br/>“This is?”<br/><br/>The Unicorn Ox was also looking at these living beings in astonishment.<br/><br/>This could already be considered as living beings. Instead, they were eyeballs.<br/><br/>Yes, it was an eyeball!<br/><br/>It was an eyeball with a row of sharp teeth.<br/><br/>It was similar to a human’s eyes. It was black and white.<br/><br/>The difference was that there were some blood-red stripes on it.<br/><br/>There was a special energy on this eyeball.<br/><br/>This should be the unique energy of this universe.<br/><br/>“What is this?”<br/><br/>Lin Niu could not help but ask.<br/><br/>“Let me check it out! ”<br/><br/>Wang Xian shook his head. With a move of his palm, the soul-absorbing power was immediately activated.<br/><br/>A surge of energy entered the body of a special creature with an eyeball!<br/><br/>However, the result that surprised Wang Xian happened.<br/><br/>Wang Xian’s soul-absorbing power entered the body of the eyeball creature, but he did not find any information.<br/><br/>He continued to use his soul-absorbing power on the other eyeball, but it was still useless.<br/><br/>“What’s going on? Why is the soul-absorbing power useless? Living beings must have a soul. Without a soul, how can they have intelligence? These living eyeball creatures don’t have a soul? Could it be related to the special energy in this world?”<br/><br/>Wang Xian mumbled.<br/><br/>He frowned slightly and examined the creature carefully.<br/><br/>The eyes of this special creature that he had captured were clearly filled with fear.<br/><br/>It was obvious that they possessed intelligence.<br/><br/>Wang Xian’s eyes flickered as he crushed one of these creatures.<br/><br/>After killing it, Wang Xian examined the interior of this creature that had eyeballs the size of a human head.<br/><br/>When he saw the situation inside, he revealed a hint of doubt.<br/><br/>The interior of this creature was decaying flesh. In Wang Xian’s eyes, it was the decaying flesh of a creature that had been dead for a long time.<br/><br/>“This kind of creature is really strange. It’s similar to the zombies in Earth’s sci-fi movies. ”<br/><br/>Wang Xian mumbled.<br/><br/>“Boss, this creature is very special. I can sense that there is an energy connection between them. Besides, if they were to pretend to be dead, they would be completely dead. They are not living creatures at all. They are very special. No wonder I didn’t sense them at the beginning. ”<br/><br/>At this moment, Lin Niu, who was at the side, spoke.<br/><br/>“HMM? Lin Niu, can you sense that there is an energy connection between these creatures?”<br/><br/>Wang Xian looked at Lin Niu and asked doubtfully.<br/><br/>“Boss, my eyes can see that my pupils can activate a state. In this state, any energy would appear white. There is an energy connection between them. I can’t sense this connection. I can see that this should be the use of the special energy in this universe. ”<br/><br/>The Unicorn ox replied.<br/><br/>Wang Xian nodded slightly when he heard that.<br/><br/>He suddenly had a thought and frowned again.<br/><br/>“We should have been exposed. We have to leave this place as soon as possible.”<br/><br/>Wang Xian said hurriedly.<br/><br/>This special energy and special connection made him think of the power of faith in the universe.<br/><br/>These special creatures had an energy connection.<br/><br/>Then, the situation here might have been known by the powerhouses in this universe.<br/><br/>In addition, these special creatures should have been deliberately placed here by some powerhouses to monitor them.<br/><br/>Wang Xian even had a guess. Maybe these special eyes were not a complete creature.<br/><br/>Instead, they were some means of the powerhouses in this universe.<br/><br/>When Lin Niu heard that, his gaze froze.<br/><br/>When he looked around vigilantly, his expression changed.<br/><br/>“Boss, there’s such energy rushing towards us! ”<br/><br/>He said hurriedly!<br/><br/>“Let’s go, use all our strength to conceal ourselves and leave this place! ”<br/><br/>Wang Xian said hurriedly without any hesitation.<br/><br/>His body moved and he flew into the distance quickly.<br/><br/>The Unicorn Ox followed closely behind.<br/><br/>When they were not far away, tens of thousands of crow-like creatures flew over from the distant sky.<br/><br/>In the middle of the group of crows, there was a human-like figure..\t\t\t\t\t\t</div>", "images": {}, "success": true}