{"id": 1096, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074112.html", "title": "Chapter 4098 - Chapter 4098: News Of The 4097 Heavenly Fate Supreme Treasure", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4098 - Chapter 4098: News Of The 4097 Heavenly Fate Supreme Treasure</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4098: News of the 4097 Heavenly Fate Supreme Treasure<br/><br/>Translator: 549690339<br/><br/>In addition, in a universe, if only one beginner-level heavenly fate expert was born.<br/><br/>If a control-level heavenly fate expert entered.<br/><br/>Hidden Treasures wouldn’t be attacked.<br/><br/>But there was one point, and that was to not be able to erupt with his powerful strength.<br/><br/>Once he erupted, he would be attacked by the universe’s laws and heavenly punishment.<br/><br/>This kind of attack was not something that a heaven’s origin creator could withstand.<br/><br/>“HMM? That’s indeed the case!”<br/><br/>When Wang Xian heard the fallen Shadow Demon Emperor’s words, he nodded his head slightly as well!<br/><br/>The increase in his strength was indeed carried out in the sword and Magic Universe!<br/><br/>“If you want to enter another universe to carry out activities, you have to follow the rules of that universe. Even if you used a treasure to avoid the first rule, you have to be careful too. Otherwise, if you are discovered, you will die! ” The Fallen Shadow Demon Emperor added one last sentence!<br/><br/>“Senior fallen shadow, what type of heavenly fate treasure is born in that universe?”<br/><br/>The royal family’s Heavenly Fate Realm Powerhouse asked again.<br/><br/>Heavenly Fate Realm Treasure, this was an absolute treasure.<br/><br/>A treasure that made them yearn for it!<br/><br/>(‘I don’t know. This news was divined by a heavenly fate realm diviner who divined the universe. After verification, there is indeed a heavenly fate realm treasure born there. ”<br/><br/>“In that universe, there are three fortune-tellers in the universe. Their strength is only at the beginner level. They also know that their universe has a treasure in the universe. ”<br/><br/>“However, the birth of a treasure in the universe is not a big deal. Treasures of this level have a trace of intelligence. They will protect themselves and need to be searched carefully!”<br/><br/>“However, when it is truly born, there will be a leak of energy!”<br/><br/>Fallen Shadow Demon Emperor replied and glanced at them. “This treasure has no fate with me. If you are interested, you can give it a try! ”<br/><br/>“The Heaven Origin Creation Realm Warrior in that universe already knows about it. It will be difficult to enter and obtain a heaven origin creation treasure! ”<br/><br/>The Heaven origin creation realm warrior from the Black Tortoise tribe said with a frown!<br/><br/>“It depends on luck. If we’re lucky, we can still obtain it!”<br/><br/>The fallen shadow demon emperor said, “Hide from the heaven origin creation realm warrior’s detection and lock onto the heaven origin creation treasure before leaving! ”<br/><br/>“This requires a lot of luck. However, for the heaven origin creation treasure, even if there’s only a 1% chance, it’s worth it! ”<br/><br/>The Dark Clan’s Heavenly Yuan creation realm expert said!<br/><br/>The other heavenly yuan creation realm experts nodded in agreement.<br/><br/>Even if there was only a 1% chance of obtaining such a treasure, even if they had to waste hundreds of millions of years there, they still had to try.<br/><br/>If they obtained this treasure, it would be a huge gain for them!<br/><br/>“When you enter that universe, those who can avoid the suppression of the universe should not display the strength of the heavenly yuan manifestation realm. As for those who are suppressed, your strength is also at the peak of the universe ruler realm. Therefore, I suggest that you do not use treasures that can avoid the laws of the universe and directly endure the suppression of the universe! ”<br/><br/>“If that’s the case, this universe will not attack you. Of course, if that’s the case, you will face the attack of that universe heavenly yuan manifestation expert! ”<br/><br/>The Fallen Shadow Demon Emperor suggested.<br/><br/>It was better to suffer the attack of that universe’s heavenly origin manifestation expert than to be attacked by the universe’s laws.<br/><br/>Under the attack of the universe’s laws, even the fallen Shadow Demon Emperor was instantly killed!<br/><br/>When everyone heard this, they nodded slightly!<br/><br/>“Many thanks to senior fallen shadow for telling us this news! ”<br/><br/>Unity Saint and the others spoke to the Fallen Shadow Demon Emperor!<br/><br/>“There’s no need. The rules of the universe have already memorized my aura. I Can’t enter anymore. If you guys can improve, it will be a blessing for our nine-origin universe!”<br/><br/>The Shadow Devil Emperor said indifferently.<br/><br/>Wang Xian heard his words and felt slightly relieved.<br/><br/>Some of the powerhouses in the nine-origin universe placed the nine-origin universe as their priority!<br/><br/>Wang Xian’s heart was burning with excitement towards this ultimate treasure of Tianyuan.<br/><br/>He was prepared to go over and check it out.<br/><br/>Wang Xian thought that his luck was very good. If he could obtain the ultimate treasure of Tianyuan, it would increase his strength tremendously!<br/><br/>The ancestral tree in his body had yet to fully mature, but it had already displayed its terrifying effect.<br/><br/>The value of a heavenly fate treasure far exceeded one’s imagination!<br/><br/>“Then let’s go and try our luck! ”<br/><br/>The eyes of the twelve ancestral magi sparkled as they spoke!<br/><br/>“Be careful. This matter has already been exposed. There are already many heavenly fate experts surrounding that universe. Even if they have obtained a heavenly fate treasure, once they are discovered, a huge battle will break out! ” The Fallen Shadow Demon Emperor reminded once again!<br/><br/>When the elven empress and the rest heard this news, their hearts trembled slightly. Their faces were filled with a solemn expression. Wang Xian did not know much about the situation in the chaos.<br/><br/>He was a little curious.<br/><br/>Could it be that there was still a connection between the powerhouses of the Heaven’s origin manifestation in different universes?<br/><br/>How did this news spread?<br/><br/>It seemed that there were many things in this chaos that he did not understand!<br/><br/>“These are the coordinates. It will take you tens of millions of years to fly there.”<br/><br/>The Fallen Shadow Demon Emperor waved his arm and a coordinate entered their minds.<br/><br/>The Fallen Shadow Demon Emperor waved his hand and left!<br/><br/>“Let’s forget about the matter of teaching. Let’s go to this universe first and try our luck! ”<br/><br/>After the fallen Shadow Demon Emperor left, the Netherworld Race’s heaven origin creation realm powerhouse spoke up immediately!<br/><br/>“Alright! ”<br/><br/>The rest of the powerhouses were all focused on this shocking news. They were all focused on the information regarding the heaven origin creation treasure.<br/><br/>They did not have the mood to teach the floating queen and the rest.<br/><br/>Their bodies moved and flew towards their surroundings. The twelve ancestral wizards flew straight into the vast chaos! “Floating water, let’s go. I’ll bring you to a place!”<br/><br/>Wang Xian’s eyes flickered as he spoke to the floating queen!<br/><br/>“It’s the Dragon King! ”<br/><br/>The floating queen nodded.<br/><br/>Wang Xian waved his arm and a wave of energy enveloped him, bringing him to the location of the teleportation formation.<br/><br/>At the back, the king of the Water Phoenix of the Phoenix clan, the scholar of the saint’s lineage, and the surrounding experts were looking at this scene in astonishment. Their eyes were sparkling.<br/><br/>The king of the water phoenix frowned and immediately chased after the king of the Phoenix who was not far away!<br/><br/>Wang Xian took the queen of the floating water away because he wanted to bring her to the universe of swords and Magic!<br/><br/>During this period of time, he had already gotten the body of the Void Divine Dragon to make arrangements for Liu Lan to help guide the Queen of the floating water!<br/><br/>After sending the queen of the floating water to the universe of swords and magic, Wang Xian was ready to head to the universe mentioned by the Fallen<br/><br/>Shadow Devil Emperor.<br/><br/>To look for opportunities!\t\t\t\t\t\t</div>", "images": {}, "success": true}