{"id": 1097, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074116.html", "title": "Chapter 4099 - Chapter 4099: 4,098 Six Paths Of The Universe", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4099 - Chapter 4099: 4,098 Six Paths Of The Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4099: 4,098 six paths of the universe<br/><br/>Translator: 549690339<br/><br/>“Liu Lan, thank you for your help. ”<br/><br/>In the sword and magic universe, in the Flowing Water Holy Land, Wang Xian rushed over with Queen floating water. He said to her with a smile on his face.<br/><br/>“You are too kind, Dragon King. This is just a small matter.”<br/><br/>Liu Lan shook her head.<br/><br/>Not only did she not reject Wang Xian’s request to bring a disciple who was at the peak of the water element universe dominator, she was even willing to do so.<br/><br/>They had already experienced Wang Xian ‘s current strength. Coupled with the fact that he had a heaven-blessed level subordinate, their strength was comparable to the entire sword and magic universe.<br/><br/>Befriending Wang Xian now would bring great benefits to the upcoming calamity.<br/><br/>Furthermore, Liu Lan and Wang Wangtian had some discussions. They were prepared to make some deals with Wang Xian in the future when the calamity arrived in order to exchange for peace between the Sword and Magic Universe.<br/><br/>“Alright, I will leave this disciple here. I have something to do and need to<br/><br/>Wang Xian cupped his hands at Liu Lan.<br/><br/>Liu Lan smiled and nodded.<br/><br/>After Wang Xian left the sword and the magic universe, he entered the chaos after arriving at the nine-origin universe.<br/><br/>Following that, he and the Linniu flew in a direction.<br/><br/>The Fallen Shadow Devil Emperor gave Wang Xian and the rest a set of coordinates.<br/><br/>This set of coordinates could give Wang Xian a clear direction.<br/><br/>Years were not counted in the chaos. Millions and millions of years passed very quickly.<br/><br/>Wang Xian and the rest did not carry out any exploration midway, so they did not waste any time.<br/><br/>Twenty million years later, Wang Xian and the rest were getting closer and closer to the coordinates.<br/><br/>“We’re almost there! ”<br/><br/>Wang Xian sensed it and reminded linniu, “We have to be careful. According to the Fallen Shadow Demon Emperor, this matter has been exposed. There will be other heaven origin destiny realm powerhouses around. ”<br/><br/>“It’s the Dragon King! ”<br/><br/>Lin Niu nodded.<br/><br/>The Universe was located in the chaos. If the heaven origin destiny realm powerhouses were to roam around in the chaos, they would be able to encounter other universes.<br/><br/>However, under normal circumstances, the heaven origin destiny realm powerhouses would not barge into an unfamiliar universe.<br/><br/>Every universe was protected by rules.<br/><br/>Entering was simply courting death.<br/><br/>However, if this universe had the birth of the ultimate treasure of the Heaven’s origin, it would be different!<br/><br/>Wang Xian did not know much about the rules in the chaos. Therefore, it was better to be careful!<br/><br/>Wang Xian and Lin Niu slowed down and were alert of the situation around them.<br/><br/>When they flew for a few more hours, they suddenly felt a terrifying energy coming from the area in front of them. Boom! Boom! Boom! Boom<br/><br/>Boom! Boom! Boom! Boom! Boom<br/><br/>Following that, the sounds of explosions rang out incessantly.<br/><br/>Wang Xian and Lin Niu were astonished.<br/><br/>“Boss, there seems to be a powerhouse at the Heaven’s origin level fighting! ”<br/><br/>Lin Niu said.<br/><br/>“It seems so. Let’s go. Let’s go around the side.”<br/><br/>Wang Xian said and deviated from the battlefield.<br/><br/>They continued flying forward. Soon, two figures who were in the middle of a huge battle appeared clearly in Wang Xian’s line of sight.<br/><br/>‘l’ney were two aDnorma11Y nuge ngures. one or tnem was like an octopus witn countless tentacles.<br/><br/>There were sharp thorns on the tentacles which made him look like a war monster.<br/><br/>At this moment, he was a metal-attributed Heaven’s origin creator.<br/><br/>The other one was a dinosaur-like Heaven’s origin creator. Both of them were metal-attributed.<br/><br/>Their bodies were emitting golden rays of light, and their battles were unusually fierce.<br/><br/>“Both of them have just entered the heaven’s origin creation level. I wonder what kind of hatred they have! ”<br/><br/>Lin Niu looked over and said.<br/><br/>The two Heaven’s origin creation level powerhouses were fighting each other and were talking loudly.<br/><br/>Wang Xian and the rest only heard a few sentences, but they were not sure.<br/><br/>“There are many powerhouses of the Heaven’s origin realm in the surroundings. ”<br/><br/>Wang Xian scanned the surroundings. From his senses, there were at least three to four other powerhouses of the Heaven’s origin realm in the surroundings.<br/><br/>They were surrounding the surroundings. No one knew what they were thinking.<br/><br/>“Don’t bother about them. Let’s enter directly. ”<br/><br/>Wang Xian took a glance and said!<br/><br/>At the moment, everything revolved around the ultimate treasure of the Heaven’s origin realm, the ultimate treasure of the Heaven’s origin realm. Wang Xian was not interested in other things.<br/><br/>The two powerhouses in front of him clearly had some grudges.<br/><br/>“It’s the Dragon King! ”<br/><br/>Lin Niu nodded and the two of them flew straight into the universe ahead.<br/><br/>“Two more have entered. This should be the 28th one, right? This is something we know. There should be a few more who don’t know!”<br/><br/>“TSK tsk, this is really crazy. I wonder how many will die this time!”<br/><br/>“At most, some clones will die and some will be exhausted. Those who don’t have any trump cards will not dare to enter. ”<br/><br/>“It seems like there are Great Dao level people who entered and were attacked by the laws of the universe. They were killed immediately. However, such old monsters at the Great Dao level won’t die so easily!”<br/><br/>When Wang Xian and the rest flew in.<br/><br/>At the surrounding area, the two heaven’s origin destinies were conversing.<br/><br/>Their eyes were sparkling as they looked at their figures!<br/><br/>“The six paths of the universe will become more and more interesting. ”<br/><br/>The two of them sighed slightly!<br/><br/>Buzz Buzz<br/><br/>At the same time, Wang Xian and the unicorn ox entered the six paths of the universe.<br/><br/>A powerful suppressive force surged into their bodies.<br/><br/>Wang Xian did not use the heaven’s origin jade horn when he entered.<br/><br/>According to the reminder of the Fallen Shadow Devil Emperor, it was best not to use such a treasure when entering.<br/><br/>The rules of the universe were much more terrifying than the heaven origin manifestation powerhouses in this universe.<br/><br/>Once they entered the universe, they only needed to pay attention to the heaven origin manifestation powerhouses inside.<br/><br/>Once they encountered them, they could escape quickly!<br/><br/>When the heaven origin manifestation powerhouses entered another universe, their strength would be suppressed to the peak of the universe’s ruler.<br/><br/>As for how much strength they could unleash, it would depend on their own strength.<br/><br/>After Wang Xian and the rest entered, the Suppressive Force of the universe was immediately transmitted over!<br/><br/>They immediately concealed their own aura.<br/><br/>If they did not conceal their aura, they would be sensed by the powerhouses of the Heaven origin manifestation in this universe.<br/><br/>With his aura concealed, Wang Xian could sense his own strength.<br/><br/>The peak of the universe’s ruler.<br/><br/>When one reached the level of the heaven origin manifestation, they could unleash the strength of the peak of the universe’s ruler even if they were to enter another universe.<br/><br/>“Next, we have to be careful. Don’t Let the Heaven’s origin creation masters in this universe discover us. Once they discover us, we can escape immediately! ” Wang Xian reminded Lin Niu!<br/><br/>As they had accepted the suppression of this universe, Wang Xian and the rest could unleash their full strength.<br/><br/>Of course, with the suppression, the strength that they could unleash would be very weak.<br/><br/>However, it shouldn’t be a problem for him to escape for a short period of time.<br/><br/>Lin Niu nodded his head.<br/><br/>Wang Xian looked at this brand new universe and the six paths of the universe.<br/><br/>“This universe only has five elements and another type of energy aura. This type of energy is very special. ”<br/><br/>Wang Xian mumbled as he felt the energy in this universe.<br/><br/>There was a brand new attribute here, a brand new type of energy.<br/><br/>This was the first time he felt this energy.. He didn’t know what effect it had!\t\t\t\t\t\t</div>", "images": {}, "success": true}