{"id": 1095, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074108.html", "title": "Chapter 4097 - Chapter 4097: 4096 Fallen Shadow Demon Emperor", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4097 - Chapter 4097: 4096 Fallen Shadow Demon Emperor</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4097: 4096 fallen Shadow Demon Emperor<br/><br/>Translator: 549690339<br/><br/>For the next ten million years, Wang Xian and the rest of the strong practitioners at the Heaven’s origin level would guide the cultivation of the water element disciples.<br/><br/>However, more than nine million years later.<br/><br/>A figure was floating in the air. His eyes flickered slightly.<br/><br/>Following that, Wang Xian and the rest could feel an extremely powerful force gushing out from his body.<br/><br/>Wang Xian looked over and his gaze landed on the body of the Fallen Shadow Demon Emperor. A look of astonishment appeared on his face.<br/><br/>At this moment, the energy in the body of the Fallen Shadow Demon Emperor was abnormally terrifying.<br/><br/>Even Wang Xian felt goosebumps all over his body!<br/><br/>“Senior Fallen Shadow, you’re back?”<br/><br/>The Unity Saint looked at the Fallen Shadow Demon Emperor and asked with a look of astonishment!<br/><br/>Although the fallen Shadow Demon Emperor had always been here, it was just an avatar of his.<br/><br/>This avatar had always been silent. Even in the past nine million years, he had only spoken a dozen words.<br/><br/>He did not give much guidance to the floating queen and the rest!<br/><br/>Wang Xian and the rest also knew that the main body of the fallen Shadow Demon Emperor was not here.<br/><br/>It was just an avatar.<br/><br/>Although it was an avatar, it had the strength of someone who had just entered the Heaven’s origin creation level.<br/><br/>The Fallen Shadow Demon Emperor was the strongest existence in the nine-origin universe.<br/><br/>He was an expert at the Great Dao level.<br/><br/>“Yes, I’m back. I’ve received some news from the outside.”<br/><br/>The Fallen Shadow Demon Emperor nodded and swept his gaze across the group. “It’s a rather big news. In a universe in the chaos, a treasure of the Heaven’s origin creation level is about to be born! ”<br/><br/>“What?”<br/><br/>Just as he finished his sentence, the emperor of angels, the Emperor of Phoenix, the Hetian saint, and even Wang Xian, who were seated at the side, revealed shocked expressions.<br/><br/>A supreme treasure of the Heaven’s origin creation?<br/><br/>A universe was about to give birth to a supreme treasure of this level?<br/><br/>This supreme treasure of the Heaven’s origin creation level was an existence that was much rarer than the powerhouses of the Heaven’s origin creation level.<br/><br/>In the nine-origin universe, Wang Xian also learned about it from the elven empress.<br/><br/>On the surface, the universe’s artificial intelligence was an ultimate treasure of the Heaven’s origin creation level. However, this ultimate treasure was too supportive and could not be tamed.<br/><br/>Currently, only the Hetian Sage had obtained its approval.<br/><br/>Even so, with the help of the power of the universe’s artificial intelligence, the Hetian Sage was able to erupt with power comparable to a powerhouse of the Heaven’s origin creation level in the nine-origin universe.<br/><br/>In addition, the elven empress also told him that the twelve ancestors of the Wizard clan should have a heavenly creation-level treasure in their hands.<br/><br/>Other than that, there was nothing else.<br/><br/>Even the fallen Shadow Demon Emperor did not have a heavenly creation-level treasure.<br/><br/>One could imagine how precious a heavenly creation-level treasure was!<br/><br/>It was a treasure that could make a heavenly creation-level powerhouse go all out.<br/><br/>The Divine Dragon clan and the insect clan had died together for a seedling of a<br/><br/>Heavenly Yuan creation treasure!<br/><br/>“Senior Shadow, have you entered that universe to explore?”<br/><br/>The Heavenly Yuan creation realm powerhouse from the royal clan asked Shadow Devil Emperor.<br/><br/>“I went in, but I was expelled from that universe and almost killed by that universe! ”<br/><br/>The Shadow Devil Emperor shook his head and said!<br/><br/>“What’s the situation?”<br/><br/>The Black Tortoise clan’s heavenly fate realm expert was slightly shocked. “Every universe has a protective mechanism, and there is a rule. ”<br/><br/>The shadow devil emperor replied, “If we want to enter another universe, our strength will be suppressed, and we will be suppressed by three levels. This is a rule. If we have special treasures, we can also avoid this rule. However, once we use a power that doesn’t belong to this universe in this universe, we will be sensed by this universe! ”<br/><br/>“Once I sense it, I will not only be suppressed by three levels, but I will also be attacked by this universe’s Heavenly Punishment!”<br/><br/>“A universe’s attack, a great dao level heavenly yuan creation, will not be able to withstand it. After I was attacked, my body was instantly destroyed. Fortunately, I have a treasure, so I was directly resurrected! ” The Fallen Shadow Demon Emperor said.<br/><br/>He was attacked not long ago and his body was directly destroyed!<br/><br/>This caused him to have some lingering fear.<br/><br/>Even if he had a trump card, he was still a little afraid of being directly destroyed by the Heaven ‘s punishment from the universe!<br/><br/>When Wang Xian heard the fallen Shadow Demon Emperor’s words, his eyes flickered slightly and a hint of astonishment appeared on his face!<br/><br/>“This must be the Dragon King of the Dragon Palace. His strength is not bad.<br/><br/>To be able to possess such strength at this level.”<br/><br/>When the Fallen Shadow Demon Emperor heard Wang Xian’s astonishment, he looked at him and sized him up with his three eyes.<br/><br/>The Fallen Shadow Demon Emperor was in the form of a human. However, his entire body was pitch-black and covered in scales.<br/><br/>A pair of demon horns and three blood-red eyes.<br/><br/>At this moment, it was sizing up Wang Xian with its eyes. Clearly, it could sense Wang Xian’s true realm!<br/><br/>The seventh level of the Universe Dominator!<br/><br/>With this realm, it would be able to possess the strength of someone who had just entered the destiny realm of the Heaven’s origin.<br/><br/>In that case, the eighth level of the universe dominator might be able to possess the power to control it.<br/><br/>The ninth level possessed the power of the Great Dao.<br/><br/>As for the peak… The Fallen Shadow Demon Emperor felt that it was considered an expert in the Great Dao.<br/><br/>However, he had yet to reach the level of chaos.<br/><br/>The Fallen Shadow Demon Emperor was somewhat certain of this.<br/><br/>The Heavenly Yuan creation realm powerhouses did not have a detailed division of their realms.<br/><br/>Everything was still being groped!<br/><br/>“Senior, you are too humble. I have a question. In another universe, there are treasures that can avoid the suppression of the universe. Why would they erupt into battle and be attacked by the Heavenly Punishment of the Universe?”<br/><br/>“I also unleashed my full strength in the other universe. I didn’t suffer any<br/><br/>attacks!”<br/><br/>Wang Xian asked with some doubt.<br/><br/>What the Fallen Shadow Demon Emperor said was completely different from what Wang Xian had encountered!<br/><br/>“Dragon King, did you achieve a breakthrough in your strength in that universe? Only in this situation would you not be punished by the Heavenly<br/><br/>Punishment of the other universe! ”<br/><br/>The Fallen Shadow Demon Emperor said.<br/><br/>“In fact, if there are treasures that can avoid the suppression of the universe, it is not a big problem to use the power of the Heaven’s origin creation. However, there is a prerequisite. You can not use it all the time. If you use it for a long time, it will be sensed. Also, the power you use can not exceed the power of the strongest person in this universe. ”<br/><br/>“Otherwise, you will be sensed by this universe. You are not a creature of this universe. ”<br/><br/>The Fallen Shadow Demon Emperor explained to him!<br/><br/>The Universe had rules. There was a limit to how many heaven origin manifestation powerhouses could be born in a universe.<br/><br/>Moreover, the birth of a heaven origin manifestation powerhouse would be recorded in this universe.<br/><br/>Originally, there were two heaven origin manifestation powerhouses in this universe and they were recorded by the universe’s rules. Later, when one suddenly appeared, it would naturally be discovered and detected.<br/><br/>There were treasures that could temporarily hide, but if you directly attacked the other two heaven origin destiny realm powerhouses, then the laws of the universe would be triggered and a heavenly punishment would descend!\t\t\t\t\t\t</div>", "images": {}, "success": true}