{"id": 1092, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074097.html", "title": "Chapter 4094 - Chapter 4094: 4093 Harvest!", "volume": 11, "volume_title": "Volume 11", "body": "<h1>Chapter 4094 - Chapter 4094: 4093 Harvest!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4094: 4093 harvest!<br/><br/>Translator: 549690339<br/><br/>The Dragon King of the Dragon Palace and the others were able to kill a beast of chaos alone.<br/><br/>This meant that the Dragon King of the Dragon Palace and the others were stronger than the Emperor of the Phoenix! This wasn’t good news for the Phoenix clan.<br/><br/>It was even a potential crisis.<br/><br/>This was because the grudge between the Phoenix clan and the Dragon Palace hadn’t been completely resolved.<br/><br/>They weren’t like the Angel clan. As long as the Angel clan didn ‘t pursue the feud between the Angel clan and the Dragon Palace and lowered their heads, the Dragon Palace wouldn’t pursue it.<br/><br/>However, the Phoenix clan had something to do with the Divine Dragon Clan.<br/><br/>Therefore, the feud between the Phoenix clan and the Dragon Palace would probably be resolved in the end.<br/><br/>And this resolution would lead to a great war.<br/><br/>The stronger the Dragon Palace Dragon King and the others were, the more dangerous the Phoenix clan would be!<br/><br/>“Luckily, we didn’t completely lose all decorum with the Dragon Palace Dragon King and it was completely irreconcilable! ”<br/><br/>Not far away, the Angel King of Light from the Angel clan saw this scene and was a little scared.<br/><br/>He was a little glad that he didn’t end up fighting with the Dragon Palace to the death!<br/><br/>In the past, if he suffered a little, he would suffer a little!<br/><br/>Although a master at the peak of the universe ruler realm was killed by the Dragon King, he was later resurrected!<br/><br/>Compared to offending such a powerful force.<br/><br/>That little loss was nothing!<br/><br/>The Dark Angel king beside them also nodded in agreement.<br/><br/>Now, even their emperor of angels was glad to see this scene.<br/><br/>They knew that the heavenly creation realm was divided into different levels.<br/><br/>It was also because they knew that they would be amazed and shocked! The Great Beings of the other pinnacle races also had their eyes twinkling!<br/><br/>“Howl! Howl! Howl!”<br/><br/>While the great disciples of the 9-origin universe were discussing, the elven empress began to show her power and directly made the accompanying elves support her attacks.<br/><br/>Under the continuous firing of arrows, the last chaos worm beast was completely destroyed!<br/><br/>The Elven empress waved her arm and kept the corpse of the chaos worm beast!<br/><br/>“It’s just a small reward, no need to pay my respects! ”<br/><br/>When the twelve ancestral witches saw the elven empress destroy the last chaos worm beast, they waved their arms and two pieces of the flesh and blood of the worms flew to Wang Xian and the elven empress respectively.<br/><br/>This could be considered as a reward for Wang Xian and the elven empress to encircle the Chaos Helminth Beast and inform them of the news!<br/><br/>The reward was a piece of flesh and blood. It was neither too much nor too little.<br/><br/>To Wang Xian and the elven empress, it didn’t feel like it was too little.<br/><br/>Without the twelve ancestral witches rushing over, they wouldn’t have been able to kill the three Chaos Helminth Beasts!<br/><br/>“It’s no big deal. Our Luck is pretty good this time. Three Chaos Helminth Beasts actually flew to our doorstep. ”<br/><br/>The Elven empress was in a good mood as she spoke!<br/><br/>“Hehe, it’s true. We searched through the primordial chaos and didn’t find any precious treasures. This is also luck, especially the Dragon King. Your Luck is really good! ”<br/><br/>The human-headed and snake-bodied ancestral witch said with a smile!<br/><br/>“Hehe, my luck is indeed good. ”<br/><br/>Wang Xian nodded with a smile.<br/><br/>“Let’s work together again. It’s a pleasure to work together. Next time, if there’s anyone who can work together, you can inform us, Dragon King. Our speed is very fast.”<br/><br/>The ancestral wizard in the middle continued to speak politely to Wang Xian!<br/><br/>“Alright, no problem! ”<br/><br/>Wang Xian nodded his head.<br/><br/>“Oh? It seems like the Dragon King has worked together with Your Wizard clan once? Did you obtain any good treasures?”<br/><br/>The Elven empress raised her eyebrows. “The corpse of this chaos worm beast is not very useful to our elf clan. If you have any wood-elemental treasures, you can make a trade! ”<br/><br/>“We only got some fragments of the Elemental God. There is no wood – elemental. ”<br/><br/>The twelve ancestral wizards shook their heads and replied!<br/><br/>“That’s Good! ”<br/><br/>The Elven empress smiled and flew to the side. “If you have found a wood element treasure and wish to exchange it for the Chaos Helminth Beast’s corpse, I would be more than happy to do so. ”<br/><br/>Seeing the elven empress leave, Wang Xian nodded to the twelve ancestral witches and flew towards the Dragon Palace!<br/><br/>This time, he had obtained the corpse of a Chaos Helminth Beast. He was prepared to use it to nurture the disciples of the Dragon Palace!<br/><br/>To nurture a batch of disciples who were at the peak of the Universe Overlord Realm!<br/><br/>In the surrounding area, a group of experts and disciples from the nine-origin universe looked at Wang Xian and the rest with slight envy when they saw them flying to their respective races.<br/><br/>This time, the rewards from the Wizard clan, Elf clan, and Dragon Palace were simply too huge!<br/><br/>“Prime Minister Gui, select twenty earth-elemental disciples and have them come over. ”<br/><br/>Wang Xian ordered Prime Minister Gui.<br/><br/>With the resources in his hands, he would nurture the top-notch combat-strength disciples of the Dragon Palace.<br/><br/>“It’s the Dragon King! ”<br/><br/>Prime Minister Gui replied immediately.<br/><br/>In the following period of time, Wang Xian did not leave the tree of chaos. Instead, he guided the disciples of the Dragon Palace in their cultivation.<br/><br/>A few hundred years later, one by one, the heaven-origin creation powerhouses from the nine-origin universe came over.<br/><br/>The Heaven origin creation stage powerhouses from the Xuanwu clan came over and asked Wang Xian if he wanted to trade the Chaos Helminth’s corpse. However, Wang Xian rejected them!<br/><br/>The Chaos Helminth’s corpse was a rare treasure when used for the cultivation of their disciples.<br/><br/>The Dragon Palace had Earth element disciples. Naturally, they wouldn’t trade<br/><br/>After the heaven origin creation stage powerhouses arrived one after another, Wang Xian’s strength also shocked the heaven origin creation stage<br/><br/>powerhouses!<br/><br/>To be able to destroy a chaos helminth meant that the strength of Dragon King Lin Niu and the rest was comparable to a heaven origin creation realm powerhouse at the control level.<br/><br/>In the entire nine-origin universe, only the Dark clan, the Elf clan, the Black Tortoise clan, and the twelve ancestral warlocks of the Wizard clan possessed the combat strength at the control level.<br/><br/>The rest were all at the beginner level.<br/><br/>This also meant that the dragon palace was stronger than them.<br/><br/>In addition, the Dragon Palace had two heavenly Yuan creation realm experts.<br/><br/>This kind of mobility wasn’t something that other peak races could compare<br/><br/>When the Phoenix Emperor of the Phoenix clan received this news, his expression was extremely ugly!<br/><br/>“It seems that our Phoenix clan has to nurture a heavenly yuan creation realm expert. Otherwise, the Dragon King of the Dragon Palace… ”<br/><br/>The Emperor of the Phoenix clan sat there, his expression constantly changing.<br/><br/>His eyes flashed with a hint of coldness as he looked at the water element disciple of the Phoenix clan.<br/><br/>“Among the fifteen water element disciples with the potential to break through, our Phoenix clan has six. The probability of this is very high. We have to raise one of them to the Heavenly Yuan blessed realm. ”<br/><br/>“Of course! ”<br/><br/>The Emperor of the Phoenix continued to speak.<br/><br/>A look of confidence appeared on his face!<br/><br/>When the Heavenly Yuan blessed realm of the Divine Dragon Clan fell, he had made some preparations!<br/><br/>Otherwise, the Phoenix clan wouldn’t have so many experts at the peak of the water element ruler realm.<br/><br/>Especially the king of the Water Phoenix.<br/><br/>He felt that the chance of the king of the Water Phoenix breaking through was very, very high!<br/><br/>As long as the king of water phoenixes broke through, his phoenixes would have two heavenly yuan existences.<br/><br/>At that time, they wouldn’t be afraid of the Dragon Palace either..\t\t\t\t\t\t</div>", "images": {}, "success": true}