{"id": 1101, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074132.html", "title": "Chapter 4103 - Chapter 4103: 4102 Fought For A Short Time", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4103 - Chapter 4103: 4102 Fought For A Short Time</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4103: 4102 fought for a short time<br/><br/>Translator: 549690339<br/><br/>In a building of the Ao Huo tribe, two figures were looking outside.<br/><br/>These two figures seemed to be the same as the beings of the six paths universe.<br/><br/>However, if one looked closely at their pupils, one would realize that they were different.<br/><br/>In the deepest part of their pupils, there seemed to be a planet.<br/><br/>This was their characteristic, the characteristic of the void space royal family of the Void Space universe.<br/><br/>The Void Universe and the nine-origin universe had already gone against each other for three to four aeons.<br/><br/>During the last few aeons, a series of fierce and terrifying battles broke out.<br/><br/>Overall, there were wins and losses.<br/><br/>The Void Pagoda of the void royal family had also flown over the sky above the heaven-splitting primordial land.<br/><br/>The powerhouses of the nine-origin universe had also stepped into the inner part of the Void Universe.<br/><br/>The strength of both parties were close.<br/><br/>As for why the nine-origin universe was hostile to the Void universe, Wang Xian did not know the reason.<br/><br/>At present, whenever the powerhouses from the Void Universe met the powerhouses from the nine-origin universe, it was usually a life and death battle.<br/><br/>Not long ago, twelve ancestral sorcerers had schemed against a powerhouse from the Void universe.<br/><br/>After the Heaven’s origin destinies of the Void Universe received this news, they were extremely furious!<br/><br/>The two figures upstairs looked down the window.<br/><br/>One of the figures had a glint in his eyes.<br/><br/>“Is it the aura of the nine origin universe?”<br/><br/>The other heaven origin creator frowned slightly and asked the figure opposite him.<br/><br/>The figure opposite him nodded and narrowed his eyes slightly. “If it wasn’t for the distance of 10,000 meters, I really wouldn’t be able to sense it.”<br/><br/>“A heaven origin creation expert from the nine-origin Universe, eh?”? This heaven origin creation expert’s face was somewhat unfamiliar, and his aura was also different from what we had encountered before. weren’t the nine heaven origin creation expert slots in the nine-origin universe full? “Why is there still a heaven origin creation expert?”<br/><br/>“In addition, the figure beside him is also a heaven origin creation expert. He doesn’t have the aura of the nine-origin universe on him. He should be from another universe. ”<br/><br/>He continued to speak with a puzzled expression on his face.<br/><br/>“Those who mix with the 9-origin universe are enemies!”<br/><br/>The Heavenly Yuan creator on the other side said with a cold expression, “This unfamiliar figure might have been made a breakthrough in another universe by some powerhouses in the 9-origin universe through some methods. ”<br/><br/>“Attack?”<br/><br/>The other Tianyuan creator from the Void Universe also said with a sinister tone.<br/><br/>The figure nodded his head heavily.<br/><br/>However, at the same time, Wang Xian, Lin Niu, and the others who were about to enter a building paused slightly.<br/><br/>They could clearly sense that someone was staring at them.<br/><br/>Furthermore, they could vaguely sense that these gazes were not friendly. Furthermore, the energy contained in the other party’s body was somewhat unique.<br/><br/>They immediately looked over!<br/><br/>When they looked over, the two figures at that spot had already disappeared.<br/><br/>They could clearly sense that there was an energy at their side.<br/><br/>Space power, be careful! ”<br/><br/>Wang Xian instantly sensed this energy. His gaze focused. Without any hesitation, he directly launched an attack at the location he sensed.<br/><br/>The power of space!<br/><br/>This was the power of space. Wang Xian was very familiar with the power of space.<br/><br/>Currently, his void Dragon Body had already reached the level of a ruler of the universe at level nine.<br/><br/>Other than the nine attributes, he was most familiar with the space attribute!<br/><br/>“Boom!”<br/><br/>Wang Xian’s arm turned into a claw and clawed forward.<br/><br/>At the same time, his mind was full of thoughts.<br/><br/>The moment he touched his opponent, his opponent would attack him directly.<br/><br/>Wang Xian knew that he did not offend any other powerhouses of the Heaven ‘s origin.<br/><br/>Especially those with the space attribute.<br/><br/>There was only one possibility.<br/><br/>The other party had a grudge with the nine-origin universe!<br/><br/>There was no doubt about the Void universe!<br/><br/>“If there are intruders from other universes, report to your leader immediately. If there are intruders from other universes, kill them! ” Wang Xian did not hesitate at all. With a loud roar, his voice reverberated throughout the entire ao Huo tribe.<br/><br/>When all the strong disciples of the tribe heard this sudden voice, they were slightly stunned.<br/><br/>Some of the strong ones could feel the energy coming from this side. Their faces revealed a look of fear.<br/><br/>Boom<br/><br/>At this moment, Wang Xian’s attack had already landed at the spot where the strong ones of the Void universe were about to appear.<br/><br/>However, when his attack landed, it did not hit the two of them.<br/><br/>The two powerhouses of the Void universe actually forcefully changed their positions when they were teleporting.<br/><br/>When the two heaven origin creator powerhouses of the Void Universe heard Wang Xian’s words and saw that Wang Xian was actually able to predict their positions, a hint of astonishment appeared on their faces.<br/><br/>“All the disciples of the powerhouses retreat. If you dare to invade Our Void Universe, die! ”<br/><br/>Wang Xian saw them appearing at another location and frowned slightly.<br/><br/>He shouted again. His body shook and the Flames under his body instantly soared into the sky.<br/><br/>At the same time, his waves of energy shifted all the living beings in the surroundings to a location outside to prevent them from being affected.<br/><br/>The reason why Wang Xian shouted so loudly was to prevent himself from being targeted and pursued by the Heaven’s origin creation powerhouses in this universe.<br/><br/>Although people like him would be exposed, he could at least interfere with them.<br/><br/>He could create more trouble for the people in the Void Universe!<br/><br/>Wang Xian didn’t understand why the other party would suddenly attack them. However, he would definitely not let them off easily.<br/><br/>“Crafty Fellow. ”<br/><br/>The two Heaven’s origin creator powerhouses in the Void Universe looked a little embarrassed when they saw Wang Xian erupting with a terrifying power of flames.<br/><br/>They were the first ones to be discovered, yet the other party was able to unleash such a powerful fire power.<br/><br/>The space attribute was also known as the king of all the major universes.<br/><br/>Even if it was a space attribute powerhouse who had just stepped into the heaven origin realm, they could still fight against two people of the same level. However, in this six paths universe, their strength could not be displayed at all.<br/><br/>This was because there was no space energy in this universe.<br/><br/>They could only use the energy stored in their bodies.<br/><br/>This would greatly reduce their combat strength.<br/><br/>In addition, Wang Xian had the fire attribute in his body, so he could borrow the fire attribute energy around him.<br/><br/>With this, they were no match for Wang Xian in a one-on-one fight.<br/><br/>“Let’s go, you guys from the nine-origin universe. Just you wait. We will not let you off! ”<br/><br/>The two heaven-origin creation realm powerhouses from the Void universe did not hesitate at all. With a loud roar, they teleported into the distance.<br/><br/>Buzz! Buzz! Buzz<br/><br/>Their bodies flickered and they disappeared quickly!<br/><br/>“Give chase! ”<br/><br/>Wang Xian looked over and immediately shouted at Lin Niu.<br/><br/>Then, they quickly flew toward the place where the two heaven-origin creation realm powerhouses disappeared.<br/><br/>At this moment, Wang Xian’s expression didn’t look too good either.<br/><br/>Now that such a situation had occurred, Wang Xian and Lin Niu were completely exposed.<br/><br/>Although the two heaven origin creation stage powerhouses from the Void universe were also exposed, their spatial attributes made it very easy for them to escape!\t\t\t\t\t\t</div>", "images": {}, "success": true}