{"id": 1108, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074160.html", "title": "Chapter 4110 - Chapter 4110: 4109 Killed Two People Again!", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4110 - Chapter 4110: 4109 Killed Two People Again!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4110: 4109 killed two people again!<br/><br/>Translator: 549690339<br/><br/>“In this tribe, there are experts from the Void Universe.”<br/><br/>Wang Xian narrowed his eyes slightly.<br/><br/>He moved his palm and took out the spatial compass to check the distance.<br/><br/>When he checked the distance, he narrowed his eyes slightly.<br/><br/>“Continue! ”<br/><br/>Wang Xian revealed a smile on his face.<br/><br/>However, this time, he didn’t rush over immediately.<br/><br/>Instead, he walked around the surroundings and controlled an expert at the third level of the universe master.<br/><br/>After Wang Xian controlled him, he brought him to the position of the Heaven Origin creator in the Void Universe.<br/><br/>“It’s right in front. ”<br/><br/>Wang Xian looked at the empty compass and did not hesitate at all. He waved his arm and a surge of energy attacked that area directly. It contained the power of searching for enemies in the void.<br/><br/>In an instant, he entered that area!<br/><br/>At the same time, in a building in front of them.<br/><br/>Two figures were sitting inside and discussing something.<br/><br/>These two figures were the two who ambushed Wang Xian previously.<br/><br/>At this moment, the two of them sensed a surge of energy enveloping them. Their expressions changed and their eyes focused!<br/><br/>“What’s going on?”<br/><br/>The two of them stood up immediately. Space Energy burst out from their bodies and they sensed their surroundings.<br/><br/>Pilipala! ”<br/><br/>However, at this moment, the energy from the void landed on their bodies.<br/><br/>Spread the news! ”<br/><br/>Wang Xian ordered the tribal expert who was being controlled by him.<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Who dares to cause trouble in our floating tribe?”<br/><br/>At this moment, Wang Xian’s attack and Wang Xian ‘s attack had already attracted the attention of this tribe’s powerhouse.<br/><br/>The Fuhe tribe was very powerful. There were a few powerhouses at the peak of the Universe Dominator realm in the tribe.<br/><br/>The energy that Wang Xian had released earlier was at the peak of the Universe Dominator realm.<br/><br/>This energy was already very powerful and terrifying in their tribe!<br/><br/>The experts from the Fuhe tribe flew out one by one and looked in their direction warily.<br/><br/>Whoosh<br/><br/>The level three Master of the universe, who was controlled by Wang Xian, held a sharp sword formed from the power of wind and thunder and immediately flew towards the group of experts.<br/><br/>What happened next was the same as the last time!<br/><br/>Wang Xian didn’t hesitate at all and immediately left to escape!<br/><br/>It was silent.<br/><br/>No one knew that he was the one who did it!<br/><br/>“This energy? It’s the energy that General Jingkong mentioned. It was this energy that landed on General Jingkong’s body. After that, General Jingkong was locked onto by the heaven origin creation stage powerhouses from the six paths universe. D * mn it, let’s escape immediately! ”<br/><br/>At this moment, the two heaven origin creation stage powerhouses from the Void Universe sensed the changes in their surroundings.<br/><br/>They sensed the energy that was attached to their bodies, and their expressions changed slightly.<br/><br/>General Jing Kong was killed by the Heaven origin creation realm powerhouses in the six paths universe because he was locked onto by this energy.<br/><br/>He couldn’t even escape.<br/><br/>Now, they also had this energy in their bodies, which made their expressions become abnormally ugly and angry.<br/><br/>Someone had tricked them.<br/><br/>And if they didn’t escape and couldn’t get rid of the energy in their bodies, then they might also be finished!<br/><br/>The two of them didn’t hesitate at all and tried their best to teleport away.<br/><br/>While they were escaping.<br/><br/>In the sky above the center of the six treasured lands, in a high palace.<br/><br/>“Another piece of information. Not Bad, not bad. I really hope that the more powerful the internal strife among those guys is, the better! ”<br/><br/>The figure shrouded in golden light received the news and revealed a faint smile.<br/><br/>He did not hesitate at all and instantly disappeared!<br/><br/>This time, his speed was much faster than the previous time.<br/><br/>In less than ten minutes, he arrived at the Fu he tribe through the teleportation array!<br/><br/>After obtaining the familiar sharp sword from the Fu he tribe’s powerhouse, he revealed a faint smile on his face.<br/><br/>Following the direction of the sharp sword, he quickly chased after the two heaven origin creation realm experts!<br/><br/>An hour later, he felt the aura of the two figures in front of him.<br/><br/>Space attribute, and also space attribute. With so many space attribute heaven origin creation realm experts, they should be the experts of the Void Universe. who could be the one who tricked them? The experts of the 9 -origin universe? It’s very possible! ”<br/><br/>It had been a long time since Jin Bao had broken through to the Heavenly Yuan creation realm.<br/><br/>He also understood some things.<br/><br/>For example, the war between the 9 -origin universe and the Void Universe.<br/><br/>This was something that many powerhouses in the universe knew.<br/><br/>However, Jin Bao didn’t think too much about it. Although the other party was a void universe powerhouse and they didn’t have the space attribute here, the energy contained in their bodies was still a huge treasure.<br/><br/>They did not need it, but they could still make a trade.<br/><br/>“Sou Sou Sou!”<br/><br/>The next moment, his entire body erupted with a golden light and enveloped the two heaven origin creation realm powerhouses in the Void Universe.<br/><br/>“Not good, the heaven origin creation realm powerhouses from the six paths universe are chasing us. Let’s escape separately. ”<br/><br/>The two heaven origin creation realm powerhouses in the Void Universe felt the energy behind them and their expressions changed drastically.<br/><br/>They did not hesitate and immediately took out their trump cards to escape.<br/><br/>They took out two scrolls and crushed them with some heartache before disappearing in an instant.<br/><br/>The golden light attacked the spot where they disappeared and followed closely behind the Golden Leopard’s figure.<br/><br/>“If you didn’t have this sharp sword that can point to the location, you guys would have really escaped. ”<br/><br/>The golden leopard flew over and saw the sword of wind and thunder split into two sharp swords, pointing in two different directions. A smile appeared on his face.<br/><br/>He quickly flew in one direction.<br/><br/>At the same time, he took out his communication device and sent a message.<br/><br/>He chased in one direction.<br/><br/>In less than an hour, an incomparably huge palm appeared on the ground below.<br/><br/>It grabbed the sword that was floating in the air and pointed in a certain direction.<br/><br/>The palm grabbed the sword of wind and thunder and disappeared into the ground!<br/><br/>“Damn it, it’s hard to get rid of the energy in my body. I’m done for. If the six paths universe’s heavenly fate realm expert comes after me, I’m done for!”<br/><br/>One of the heavenly fate realm expert used a treasure to teleport over a long distance.<br/><br/>However, when he wanted to get rid of the energy in his body, he realized that it would take some time.<br/><br/>However, this short amount of time would take his life!<br/><br/>He quickly took out his communication device and transmitted his situation to all the powerhouses in the void space.<br/><br/>When the powerhouses in the void space received this news, their faces were filled with shock.<br/><br/>Not long ago, General Jing Kong had been killed.<br/><br/>Now, two of his companions were about to be killed?<br/><br/>They wanted to kill all the experts of their void universe!<br/><br/>This made the experts of the Void universe reveal cold killing intent!<br/><br/>“I’ve been killed. I can’t enter the six paths universe now. I need some time to recover. Guardian duke, someone wants to kill all the heaven origin creation realm experts of our void universe. You have to be careful! ”<br/><br/>An hour later, the Void universe experts received another piece of news!\t\t\t\t\t\t</div>", "images": {}, "success": true}