{"id": 1107, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074156.html", "title": "Chapter 4109 - Chapter 4109: 4108 Made Use Of Each Other", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4109 - Chapter 4109: 4108 Made Use Of Each Other</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4109: 4108 made use of each other<br/><br/>Translator: 549690339<br/><br/>“Damn it, how did you lock onto me? Did you rely on the wind and Thunder’s<br/><br/>The Heaven origin creation realm expert from the Void universe saw that he could no longer escape, and he stared at the golden leopard with an ugly expression.<br/><br/>He was also a heaven origin creation realm expert, so he didn’t fear the golden leopard at all.<br/><br/>“Hehe, I have to ask who you offended. How interesting. Among you guys, you actually want to use us to get rid of you, but we are willing to be used!”<br/><br/>The golden leopard flew over and did not kill him immediately. Instead, he said coldly.<br/><br/>After saying this, he raised his claws and a golden energy completely sealed him.<br/><br/>Following that, he was instantly killed!<br/><br/>After killing a heavenly yuan creation realm powerhouse, the Golden Leopard opened his mouth and revealed a smile.<br/><br/>The reason why he said this was also a conspiracy.<br/><br/>To tell the powerhouses of the Void universe that someone was trying to harm you!<br/><br/>The golden leopard knew that someone was using them to kill his opponents.<br/><br/>But he also hoped that this kind of thing would happen more often.<br/><br/>Their six paths universe was willing to be used, willing to take action.<br/><br/>After all, if they took action, they would also be able to obtain huge benefits.<br/><br/>Moreover, this benefit was something they couldn’t obtain before.<br/><br/>They even hoped that more and more invading heaven origin creation realm powerhouses would tell them about the other heaven origin creation realm powerhouses, and then they would kill them one by one.<br/><br/>The golden leopard put away his corpse, sneered, and left!<br/><br/>“Damn it, was I tricked by the other heaven origin creation realm powerhouses?”<br/><br/>After this powerhouse from the Void Universe was killed, he was located in another universe.<br/><br/>Inside a huge void Pagoda, a sculpture slowly opened his eyes. His face revealed a cold and angry expression.<br/><br/>It wasn’t the technique of the six paths universe’s Heaven Origin creation realm expert?<br/><br/>Was there another heaven origin creation realm expert who tricked him?<br/><br/>“The possibility is very high. The 12 ancestral warlocks from the nine origin universe tricked and killed General Jing Kong. ”<br/><br/>His face was gloomy, and a helpless expression appeared on his face.<br/><br/>He hesitated for a moment, gritted his teeth, and decided to continue stepping into the Void Space universe.<br/><br/>He was unwilling.<br/><br/>He wanted to know who had tricked him.<br/><br/>In addition, he wanted revenge.<br/><br/>This time, although he had suffered heavy losses, fortunately, he still had some true treasures that could be resurrected.<br/><br/>However, this time, he had to be even more careful when he entered the six paths universe.<br/><br/>It ne were to tall agam and resurrect, ne would need a long per10d ot time to recover.<br/><br/>He took out a communication device and immediately passed his message to the other heaven origin creation realm powerhouses in the void space.<br/><br/>Because of its special reason, the void space could only give birth to one heaven origin creation realm powerhouse.<br/><br/>After the first heaven origin creation realm powerhouse in the void space was born, it established a royal family.<br/><br/>The royal family of the Void!<br/><br/>After the birth of the royal family of the Void, the first heaven origin creator led his subordinates into other weak universes, allowing his children to break through to the heaven origin creator realm.<br/><br/>This formed the current royal family of the Void, a huge dynasty!<br/><br/>Overall, the heaven origin creator Masters of the Void were more united than the other universes.<br/><br/>They were more united.<br/><br/>When his message was sent out, the heaven origin creation realm powerhouses in the other void universes immediately received the message.<br/><br/>When they saw it, their eyes were slightly watery.<br/><br/>Two heaven origin creation realm powerhouses were killed in the six paths universe. was someone targeting their void universe?<br/><br/>They had to be careful!<br/><br/>“HMM? The energy from the Void is gone. Did the heaven origin creator powerhouse from the six paths universe kill it, or did he get rid of this<br/><br/>At the same time, at the grassland of the six paths universe, Wang Xian’s mind suddenly stirred. He sensed something and whispered to himself.<br/><br/>“It shouldn’t be so easy to get rid of my own power of the Void. Moreover, that powerhouse from the Void Universe is only at the beginner level! ”<br/><br/>Wang Xian mumbled.<br/><br/>He didn’t think too much about it. Regardless of whether he was killed or not, he continued to search.<br/><br/>This was only the beginning. At the very least, he was tricking a wave of experts from the Void Universe.<br/><br/>As for whether he could succeed or not, it would depend on his luck!<br/><br/>“Let’s continue to search! ”<br/><br/>Wang Xian said to Lin Niu as the two of them continued to search in the grassland.<br/><br/>They came to the tribes in the grassland and sensed the auras in the tribes.<br/><br/>When he arrived at the fourth tribe, he did not discover any powerhouses from the void universe in this tribe.<br/><br/>However, he sensed the aura of another powerhouse who was in the Heaven’s origin realm.<br/><br/>At the same time, that powerhouse also sensed Wang Xian’s existence!<br/><br/>Wang Xian stared at the elder who was holding a wooden staff.<br/><br/>The elder also looked at Wang Xian.<br/><br/>In the end, both of them left in opposite directions!<br/><br/>There was no animosity between the two parties.<br/><br/>They were not familiar with each other either.<br/><br/>They were now competitors and did not know each other’s background.<br/><br/>Therefore, they did not have any contact with each other.<br/><br/>After Wang Xian walked around the tribe, he left immediately!<br/><br/>“Let’s Go! ”<br/><br/>They continued to search. Following that, Wang Xian and the unicorn ox searched the entire grassland.<br/><br/>They spent more than a hundred years to explore the entire grassland.<br/><br/>After finding no more powerhouses from the Void universe, he rushed to the water source closest to the grassland.<br/><br/>The grassland and the water source had two different sources!<br/><br/>The water source could be said to be the ocean!<br/><br/>The difference was that the water source was covered by heavy rain all year round.<br/><br/>In the sky, there was a continuous downpour.<br/><br/>From time to time, one could even see a special rainbow.<br/><br/>It was like a mirage.<br/><br/>It had a unique scenery!<br/><br/>In the sky above the water source, where the heavy rain covered, there were also tribes.<br/><br/>These tribes lived in the sky above the water source, under the heavy rain. They used water energy to build majestic and magnificent buildings.<br/><br/>“Boss, the scenery here is really not bad! ”<br/><br/>However, when they came to the front of a tribe, the unicorn ox looked around with a smile and said.<br/><br/>Okay!<br/><br/>Wang Xian nodded his head.<br/><br/>Every universe had some very magnificent and shocking places.<br/><br/>They were indeed shocked by the water source here.<br/><br/>The water source was very large and its area was much larger than the grassland.<br/><br/>Most importantly, the water source was covered by rainwater above while the ocean was below.<br/><br/>“Let’s go in and take a look. ”<br/><br/>As Wang Xian spoke, the two of them entered the tribe.<br/><br/>At this moment, Wang Xian was holding a water attribute sharp sword in his hand. His attire was exactly the same as the cultivators from the water source.<br/><br/>It was the same for the Unicorn ox under the cover of his energy!<br/><br/>They entered the tribe ahead and walked on the path where the water flow condensed!<br/><br/>The Raindrops were falling from the sky. The surrounding areas were buildings formed from the condensation of water energy. There were many special items in the building.<br/><br/>Wang Xian and the rest were sizing it up.<br/><br/>Buzz Buzz<br/><br/>At this moment, he could feel the empty compass on his body trembling.<br/><br/>This caused Wang Xian to squint his eyes slightly..\t\t\t\t\t\t</div>", "images": {}, "success": true}