{"id": 1105, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074148.html", "title": "Chapter 4107 - Chapter 4107: 4,106 Plans Of The Six Paths Of The Universe!", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4107 - Chapter 4107: 4,106 Plans Of The Six Paths Of The Universe!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4107: 4,106 plans of the six paths of the universe!<br/><br/>Translator: 549690339<br/><br/>“He escaped? He is really vigilant! ”<br/><br/>Wang Xian’s eyes flickered when he saw that the heaven origin creator from the Void Universe had left in an instant.<br/><br/>No one dared to engage in a prolonged battle in these six paths of the universe. Otherwise, it would be courting death.<br/><br/>Although the powerhouses who entered this universe had their trump cards and could be resurrected.<br/><br/>However, they would definitely have to pay a price.<br/><br/>Take Wang Xian and Lin Niu for example. The trump card of their resurrection was the soul-returning embryo fruit.<br/><br/>Wang Xian was even better. After his death, the ancestral tree could already pull his soul into the Dragon Palace.<br/><br/>It was guaranteed that he would not die.<br/><br/>However, if Wang Xian really died and lost his physical body, he would need a huge amount of resources to recover his strength.<br/><br/>The amount of resources was extremely terrifying.<br/><br/>Furthermore, the Dragon Palace did not have any resources that could help him return to his peak after his death.<br/><br/>Of course, there was another point. If Wang Xian’s corpse could be brought back after his death, his losses would be minimal.<br/><br/>He would be able to recover without consuming too many resources.<br/><br/>The other powerhouses in the Heaven’s origin realm would also have to pay a<br/><br/>price.<br/><br/>Unless they really had a heaven-defying resurrection treasure.<br/><br/>However, such treasures were too rare!<br/><br/>The Heaven’s origin powerhouses in the void space sensed that something was amiss. When they did not discover their opponent, they chose to leave immediately without any hesitation.<br/><br/>When Wang Xian saw him escape, he had a thought. He immediately controlled the middle-aged man beside him and flew towards the center of the tribe. His gaze was a little dull. Wang Xian had temporarily controlled his mind!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Boom! Boom! Boom<br/><br/>At this moment, the commotion here immediately attracted the attention of the entire tribe.<br/><br/>The might just now was extremely terrifying. It caused the hearts of the entire tribe to palpitate.<br/><br/>One by one, the experts flew over.<br/><br/>The leader of the tribe also flew over and felt the waves of energy.<br/><br/>“It doesn’t seem to be energy from our universe.”<br/><br/>He muttered, his expression changing.<br/><br/>As the leader of a tribe on the grassland, he knew a lot about the current situation in their six paths universe!<br/><br/>Furthermore, an overlord tribe on the grassland had sent them some news!<br/><br/>“You are the leader of this tribe?”<br/><br/>At this moment, he saw a tribesman flying over.<br/><br/>However, this tribesman’s words caused him to be slightly stunned. His face was filled with astonishment.<br/><br/>When he saw that the tribesman’s eyes were unfocused, his gaze slightly focused!<br/><br/>He immediately replied with a trace of nervousness on his face, “What did you do to my tribesman?”<br/><br/>“The ones who left just now were powerhouses from other universes. There’s an energy here that can guide the direction of that powerhouse and give this energy to the heavenly fate powerhouses from your six universes! ”<br/><br/>“Remember, you must pass this news to the heavenly fate powerhouses from your universe. Otherwise, you won’t be able to bear the consequences! ”<br/><br/>As the middle-aged man’s voice fell, he held a sharp sword that contained the power of wind and thunder in his hand.<br/><br/>The tip of this sharp sword was pointing in a certain direction!<br/><br/>When he finished speaking, the middle-aged man’s expression slowly began to recover.<br/><br/>However, the expression of the leader on the opposite side changed slightly!<br/><br/>“Leader! ”<br/><br/>“Leader! ”<br/><br/>At this moment, experts from various tribes flew over from the rear.<br/><br/>“Immediately contact the leader of the nine plains tribe and tell him that there’s information about the intruders!”<br/><br/>The leader didn’t dare to hesitate and immediately ordered.<br/><br/>Even though he knew that the person controlling his tribesmen just now might also be an intruder.<br/><br/>However, the intruder was of great importance and this matter wasn’t something he dared to hide. He had to report it in time.<br/><br/>Otherwise, once they were punished by Lord Tianyuan creator, they wouldn’t be able to bear it!<br/><br/>They immediately passed this information to the nine plains tribe.<br/><br/>The nine plains tribe also immediately reported the news to the Tianyuan creator.<br/><br/>“A subordinate sent a message saying that they encountered an intruder and that the intruder left behind a beam of energy that can point to the location of an intruder. ”<br/><br/>At the same time, in the void at the center of the six treasured lands.<br/><br/>In the sky, there was an incomparably huge palace.<br/><br/>In the center of the palace, there were three huge divine thrones.<br/><br/>On the thrones, there were three figures.<br/><br/>One of them, who was emitting golden light, looked at the information in his hand and said calmly!<br/><br/>“Is the information true or false?”<br/><br/>The figure that looked like an earth giant covered in earthy yellow energy asked calmly.<br/><br/>“The news from our subordinates is naturally true. As for the specific situation, we don’t know yet. However, we can go and take a look. ”<br/><br/>The metal-type figure replied.<br/><br/>“Go and take a look. Although a large number of heavenly yuan creation realm powerhouses have already entered our universe, they won’t be able to play any tricks. There’s also no need to worry about traps. ”<br/><br/>“Also, not long ago, the Heavenly Yuan creation realm powerhouse that I killed was obviously tricked by the other heavenly Yuan creation realm powerhouses. Among the invaders, there are also many who have grudges and want to borrow our hands to kill their opponents. ”<br/><br/>“Although they want to use us to kill people, for us, there are huge benefits. This group of intruders all have treasures to resurrect, but their corpses are still huge treasures. ”<br/><br/>“Even if their attributes are different from our six paths universe, the energy of their bodies is also extremely noble. ”<br/><br/>The figure that was full of black and green energy said with a smile!<br/><br/>“Hehe, that’s true. In our universe, we are invincible. Although they came to snatch the heavenly creation true treasure that belongs to our universe, if we can leave behind the corpses of more than ten heavenly creation great beings, even if the true treasure is snatched away, we won’t suffer too much! ”<br/><br/>The earth attribute giant nodded.<br/><br/>Although the current situation showed that it was disadvantageous to their six paths universe.<br/><br/>But in their territory, were they that easy to bully?<br/><br/>In fact, they had been scheming all along.<br/><br/>Scheming, searching for the Unknown Heaven origin creation treasure.<br/><br/>And scheming, if they were to kill the intruders.<br/><br/>If they were able to kill control level heaven origin creation experts and leave their corpses behind, they might even be able to give birth to a new heaven origin creation in their universe!<br/><br/>As for saying that someone wanted to use their hands to get rid of the enemy, they didn’t care.<br/><br/>What they wanted was the corpse of a heaven origin creation realm expert.<br/><br/>That was enough.<br/><br/>Even if it wasn’t the origin body of a heaven origin creation realm expert, its preciousness wasn’t something they could obtain.<br/><br/>Especially the corpse of a controlling level heaven origin creation realm expert!<br/><br/>“I’ll go take a look!”<br/><br/>The metal-type figure stood up and instantly disappeared!<br/><br/>In less than an hour, his figure appeared on the grassland.<br/><br/>Just as they said, this was their territory.. They could use the teleportation formation to quickly reach various regions!\t\t\t\t\t\t</div>", "images": {}, "success": true}