{"id": 1106, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074152.html", "title": "Chapter 4108 - Chapter 4108: 4107 Made Use Of Each Other", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4108 - Chapter 4108: 4107 Made Use Of Each Other</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4108: 4107 made use of each other<br/><br/>Translator: 549690339<br/><br/>“Sir, this energy seems to have been left behind by the intruders. They said it can lead us to the other intruders. ”<br/><br/>In the tribe on the grassland.<br/><br/>When the six universe metal elemental heavenly creation realm powerhouses arrived.<br/><br/>The tribal leaders quickly knelt on the ground and reported the situation respectfully.<br/><br/>“Well, let me see what tricks they are going to play! ”<br/><br/>The metal attribute heavenly fate realm expert moved his palm and held the energy in his hand to sense it.<br/><br/>When he saw the sharp sword formed by the wind and thunder energy, his eyes flashed.<br/><br/>The sharp sword pointed in a certain direction.<br/><br/>He hesitated for two seconds before his body moved and he instantly disappeared!<br/><br/>As a heavenly fate realm expert, his speed was not something that a peak universe ruler could compare to.<br/><br/>Even a peak universe overlord realm expert with space attributes was still far from a heavenly fate realm expert.<br/><br/>With the guidance of the wind and thunder sword, the six paths universe’s metal elemental heavenly fate realm expert flew quickly.<br/><br/>At the same time, on a grassland.<br/><br/>In a dense forest, the void universe’s heavenly fate realm expert stood there.<br/><br/>At this moment, he was frowning as he sensed the wind and thunder energy in his body.<br/><br/>This energy gave him a feeling of unease.<br/><br/>Strange Energy was attached to his body. This was definitely not a good thing for him.<br/><br/>However, this energy was unusually special. If he wanted to remove it, he would need to spend some time.<br/><br/>At least three to four hours.<br/><br/>“I’ve been teleporting nonstop for two hours. This place is already very far away from that tribe. I need to get rid of this special energy first. Otherwise, Pm afraid there might be some changes. ”<br/><br/>He murmured.<br/><br/>He already knew that a great being from their universe had been killed by the 12 ancestral warlocks of the 9-origin universe.<br/><br/>Fortunately, this energy was not the power of a curse.<br/><br/>Fortunately, the other party didn’t have the strength of the 12 ancestral warlocks.<br/><br/>If the 12 ancestral warlocks set him up, he might not be able to get rid of the energy in his body.<br/><br/>The strength of the 12 ancestral warlocks was at the control level.<br/><br/>He immediately sat there cross-legged and began to get rid of the energy in his body.<br/><br/>“Oh? There really are heavenly yuan creation powerhouses from other universes, and they are of the space attribute.”<br/><br/>However, half an hour later, a golden figure flew over from not far away.<br/><br/>He looked forward with a smile on his face.<br/><br/>No matter what attribute it was, the corpse of a Heavenly Yuan creator powerhouse was an incomparably huge treasure.<br/><br/>He narrowed his eyes slightly, and an illusory figure that looked like a golden leopard appeared behind him.<br/><br/>This phantom instantly disappeared, and it attacked the heaven origin creator in the Void Universe.<br/><br/>The Golden Leopard’s speed was very fast, and it was very terrifying.<br/><br/>The moment the Golden Leopard Phantom appeared.<br/><br/>The Heaven Origin creator in the Void Universe, who was sitting cross-legged and clearing the energy in his body, saw this scene, and his gaze focused.<br/><br/>He did not hesitate at all, and directly teleported far away.<br/><br/>At the same time, his face was filled with embarrassment.<br/><br/>“The Heavenly Yuan creator of the six paths universe is a powerhouse of the six paths universe. ”<br/><br/>His face was solemn. After teleporting once, his palm moved, and a scroll appeared in his hand.<br/><br/>He immediately opened the scroll!<br/><br/>In an instant, his figure disappeared once again.<br/><br/>The distance of this teleportation was very, very far!<br/><br/>He even arrived at the edge of the grassland.<br/><br/>“As expected of a great being of the heaven origin of other universes. As expected of a great being of the space attribute of the heaven origin. ”<br/><br/>As the metal attribute great being teleported, he immediately chased after him.<br/><br/>The moment he saw the figure of the great being of the Void Space universe, his figure had already started to become illusory.<br/><br/>Following that, he lost the ability to sense the great beings of the Void Space universe.<br/><br/>This was the trump card of the group of heaven origin creation great beings.<br/><br/>When they encountered a heaven origin creation great being from the six paths universe, they would have a way to escape.<br/><br/>They would also be able to quickly escape from his lock.<br/><br/>However, the six paths universe metal heaven origin creation great being looked at the wind and thunder sharp sword in his hand.<br/><br/>Seeing the direction he was pointing at, he burst out with his strongest speed and headed to the left.<br/><br/>“How did I get discovered?”<br/><br/>The Heaven Origin Destiny Realm Expert from the Void Universe, who had instantly left through the treasure, arrived at the edge of the grassland with an uncertain expression on his face.<br/><br/>For him, treasures that could be used for long-distance teleportation were extremely rare.<br/><br/>It was very difficult to obtain them.<br/><br/>He did not have many of them in his hands.<br/><br/>Now that he had used one of them, he felt a little heartache.<br/><br/>“Is it because of the power of wind and thunder in my body? But even if my body is covered by this energy, the Heavenly Yuan creator of the six paths universe should not have come so quickly.”<br/><br/>“Could it be that this energy is a treasure that the heavenly yuan creator of the six paths universe obtained from the Chaos?”? “Or perhaps it was obtained from trading with other Heavenly Yuan creator powerhouses. After I was discovered and covered by this energy, the Heavenly Yuan creator of the six paths universe rushed over?”<br/><br/>He guessed, and his expression was very ugly.<br/><br/>He was somewhat bewildered and uncertain.<br/><br/>Feeling the energy in his body, he gritted his teeth and continued to flee into the distance.<br/><br/>Teleportation, teleportation, continuous teleportation!<br/><br/>Very soon, he was out of the grassland!<br/><br/>“If you want to escape, can you escape?”<br/><br/>Behind him, the Great Beings in the Heavenly Yuan creation realm of the six paths universe were also flying continuously.<br/><br/>Soon, he felt the aura of the void space expert, and his eyes were filled with coldness and awe.<br/><br/>“To covet the Treasures of my six paths universe, you will have to pay a terrible price! ”<br/><br/>As he spoke, his entire body underwent a huge change.<br/><br/>He completely transformed from a human into a golden panther.<br/><br/>The Golden Panther released a sacred majesty and turned into a golden light, flying in the sky.<br/><br/>His main body was a golden leopard.<br/><br/>The metal elemental beast broke through to the Heavenly Yuan creation realm<br/><br/>and gained intelligence, possessing its current powerful strength.<br/><br/>The Golden Leopard’s speed was extremely terrifying.<br/><br/>Very soon, it closed the distance between it and the Heavenly Yuan creation realm expert.<br/><br/>When he saw the figure of the Heavenly Yuan creation realm expert in front of him again, his eyes were filled with killing intent.<br/><br/>He let out a low roar and directly pounced toward the void space great being.<br/><br/>“Damn it, I’ve been locked on. It’s definitely because of the energy in my body.<br/><br/>If it wasn’t for this energy, I definitely wouldn’t have been locked on!”<br/><br/>“Who is it?”<br/><br/>He saw the six paths universe great being chasing after him again, and a hint of despair appeared on his face.<br/><br/>He had the confidence to escape, but he could not be locked onto by the Heavenly Kismet expert from the six paths universe in advance.<br/><br/>Once he was locked onto, unless he could escape to the edge of the six paths universe and escape into the chaos.<br/><br/>Otherwise, once he was locked onto, he would die.<br/><br/>Now, he could no longer escape!<br/><br/>He had something important to do!<br/><br/>“HMPH, if you want to covet the Treasures of my six paths universe, die.”<br/><br/>The surroundings of that powerful warrior in the Void universe were enveloped by golden light, completely sealed off.<br/><br/>The golden leopard appeared directly above him!\t\t\t\t\t\t</div>", "images": {}, "success": true}