{"id": 1109, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074164.html", "title": "Chapter 4111 - Chapter 4111: The Counterattack Of The 4110 Void Universe Master!", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4111 - Chapter 4111: The Counterattack Of The 4110 Void Universe Master!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4111: The counterattack of the 4110 Void Universe Master!<br/><br/>Translator: 549690339<br/><br/>After a heaven origin creation realm powerhouse was killed, a message was sent.<br/><br/>The second heaven origin creation realm powerhouse also sent a message!<br/><br/>“In a short time, four heaven origin creation realm powerhouses in our void universe were killed. Someone is deliberately targeting us, trying to weaken our combat power! ”<br/><br/>“Damn it, who did this? We have to find out. Otherwise, we will all be in danger. ”<br/><br/>“That guy in the dark seems to be able to determine our position. Moreover, why are the Heavenly Kismet realm powerhouses from the six paths universe able to arrive so quickly every time? Will they join forces with the Heavenly Kismet realm powerhouses from the six paths universe?”<br/><br/>“The possibility of them joining forces isn’t very high. If they did, we wouldn’t have been able to escape so far!”<br/><br/>“Could it be the 12 ancestral witches from the nine-origin universe? Those 12 ancestral witches have very strange methods, and they are very powerful in Scouting! ”<br/><br/>“General Jingkong was killed by the 12 ancestral witches, but the methods of General Jingkong and the others are obviously different from the methods of the 12 ancestral witches. They shouldn’t be the 12 ancestral witches from the nine-origin Universe! ”<br/><br/>“No matter what, we have to capture them. Otherwise, we will all be in danger. Now, let’s leave the six-path universe and come to the chaos to discuss countermeasures. ”<br/><br/>“Find this fellow and kill him!”<br/><br/>The Heaven origin creation realm powerhouses of the Void universe were talking.<br/><br/>Their expressions were all extremely ugly.<br/><br/>Although they could be resurrected after being tricked and killed.<br/><br/>However, resurrecting was not that easy. Resurrected Treasures were very precious in the universe.<br/><br/>It was especially true treasures that could be resurrected without injury.<br/><br/>Only one or two great beings in the entire void space universe had such true treasures.<br/><br/>As for the others, they would have to pay a price after being resurrected!<br/><br/>Moreover, after being resurrected, this resurrected true treasure would also disappear.<br/><br/>In other words, it was a huge reduction in strength!<br/><br/>Therefore, four heaven origin creation great beings being killed was a huge loss to their void space.<br/><br/>The remaining heaven origin creation great beings in the six paths universe immediately flew towards the chaos.<br/><br/>They wanted to discuss countermeasures!<br/><br/>This time, eight heaven origin creation great beings from the void space entered the six paths universe.<br/><br/>General Kong Yi was unwilling to be killed again, so he rushed over again.<br/><br/>However, General Kong Yi and the other two heaven origin creation realm powerhouses were still recovering from their powerful resurrection treasures. The five heaven origin creation realm powerhouses quickly flew into the chaos.<br/><br/>“They’re all here! ”<br/><br/>One figure after another came into the chaos, and the suppression from the universe completely disappeared.<br/><br/>The two old men in the lead glanced at them and said indifferently.<br/><br/>“Country duke, they’re all here! ”<br/><br/>A general from the Void universe nodded.<br/><br/>The void royal family, who could be called a general, were all heaven origin creation level existences.<br/><br/>And those who could be called country Duke had control level strength.<br/><br/>Among the five of them, there were two guardian dukes, which meant that there were two control level heaven origin creation realm experts.<br/><br/>(‘I already have an idea. ”<br/><br/>The Guardian Duke on the right swept his gaze over them and spoke directly.<br/><br/>“Lord Guardian Duke, Please Speak! ”<br/><br/>A void royal general said respectfully.<br/><br/>“According to the information that the void space has sent over, the person who killed our void universe experts, even if it wasn’t the 12 ancestral witches of the 9-origin universe, is definitely related to the 9-origin universe.”<br/><br/>“He must have a treasure that can detect the energy of space, and he has a special secret technique that can lock onto us, a secret technique of the wind and thunder element. It reminds me of a race that our king killed with his own hands, a special race of the nine-origin universe, two eons ago.”<br/><br/>“That race has the wind and thunder element. Through the treasure in his hands, as well as the special bloodline and energy, it can restrain the ability to teleport in space. It is very effective against the Army of our Void Space Universe. ”<br/><br/>“Our king will personally find an opportunity to completely exterminate this race and sever their bloodline. The power of wind and thunder is somewhat similar to the abilities of the two races before the Apocalypse. ”<br/><br/>The defender-general on the right said!<br/><br/>His words caused the other three heaven origin creation realm powerhouses in the Void universe to be slightly shocked.<br/><br/>“Then, in that case, it can almost be true that those guys from the 9-origin universe are secretly trying to kill us?”<br/><br/>General Kong ya said with a murderous look.<br/><br/>“The 9-origin universe is the most likely.”<br/><br/>The Guardian Duke on the right nodded. “We don’t know if it’s the great beings from the entire 9-origin universe, or one or two great beings from the 9-origin universe. ”<br/><br/>“According to my guess, it shouldn’t be all the great beings from the entire 9-origin universe. If they are working together, it might be their 12 ancestral witches. ”<br/><br/>“Now, we have to fight back. We have to kill that Guy First! ”<br/><br/>The Guardian Duke on the left also said!<br/><br/>“Kill that guy who used the secret technique first. This time, I will be the bait. I have a treasure in my hand. I am confident that I can get rid of that energy and use it to find the guy behind the scenes. Then I will kill him! ”<br/><br/>The Guardian Duke on the right said with a face full of killing intent!<br/><br/>“Guardian Duke, are you going to put yourself in danger? Isn’t this a little dangerous? We have to be fully prepared!”<br/><br/>When a general heard this, his gaze focused as he said!<br/><br/>“We have to make some preparations. We have to set up some teleportation arrays. We have to be able to teleport to the edge of the six paths universe to prevent the six paths universe’s heaven origin manifestation powerhouse from joining hands with the person behind the scenes. ”<br/><br/>“As for the rest, I’ll do it myself. There won’t be too much of a problem! ” The Guardian Duke on the right said with a face full of confidence.<br/><br/>“Alright, leave the construction of the teleportation arrays to us. Lord Guardian Duke, you guys choose the location first! ”<br/><br/>A great general said!<br/><br/>The Guardian Duke nodded. Then, the group discussed for a while before entering the six paths universe once again.<br/><br/>At the edge of the six paths universe, they started to create teleportation arrays.<br/><br/>They could ensure that they could quickly teleport here.<br/><br/>Once they were teleported here, they could enter the chaos. At that time, they wouldn’t have to fear the six paths universe’s Heavenly Yuan creation. They needed to be wary of the six paths universe’s Heavenly Yuan creation.<br/><br/>Only they could destroy them!<br/><br/>The Void Universe’s guardian Duke had placed the location at the water domain.<br/><br/>According to their guesses, the mastermind behind this should still be at the water domain.<br/><br/>After the Void Universe’s guardian Duke had arranged everything, he went directly to a tribe at the water domain and waited quietly.<br/><br/>Wait for the Rabbit!<br/><br/>There was only one way.<br/><br/>But they believed that this mastermind would definitely continue to attack..\t\t\t\t\t\t</div>", "images": {}, "success": true}