{"id": 1111, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074172.html", "title": "Chapter 4113 - Chapter 4113: Under The Counterattack Of The 4112 Void Space", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4113 - Chapter 4113: Under The Counterattack Of The 4112 Void Space</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4113: Under the counterattack of the 4112 void space<br/><br/>Translator: 549690339<br/><br/>“Oh? Guardian duke, the person behind the scenes has made a move again?” When the Guardian Duke of the void space appeared in another area.<br/><br/>When a heavenly yuan destiny realm powerhouse who was waiting there heard it, he revealed an excited expression and immediately asked.<br/><br/>“Yes, the energy has been sealed by me. No powerhouse can sense this energy. ”<br/><br/>The Guardian Duke nodded. “Send the news to Duke of Heaven’s Gate and the others. Tell them to come over! ”<br/><br/>“Yes. ”<br/><br/>The Heavenly Yuan creation powerhouse from the Void universe immediately replied.<br/><br/>He immediately sent out his disappearance.<br/><br/>Very quickly, many figures appeared from the teleportation arrays in the surroundings.<br/><br/>In order to prevent the powerhouses from the six paths universe from sensing them, they were all in different positions!<br/><br/>“Duke Xining, did you succeed?”<br/><br/>An old man walked over and asked the Guardian Duke of the Void Universe.<br/><br/>“Yes, the energy has already been sealed by me. Now, it’s up to you, Duke<br/><br/>Tianmen. ”<br/><br/>Duke Xining nodded. With a move of his palm, the treasure that sealed the power of wind and thunder appeared in his hand.<br/><br/>Duke Tianmen nodded and also took out a treasure.<br/><br/>“My spatial needle can point a target. As long as he is within the range of a universe, he won’t be able to escape! ”<br/><br/>Duke Tianmen said confidently!<br/><br/>A needle fell into the power of wind and thunder and slowly absorbed the power.<br/><br/>Slowly, the spatial needle was entangled with the power of wind and thunder and pointed in a direction. “Locked on?”<br/><br/>Duke Xining asked from the side.<br/><br/>“I’ve locked onto it! ”<br/><br/>Duke of Heaven’s gate nodded with a smile.<br/><br/>Since that’s the case, let’s make a move. We must destroy him completely! ” Duke Xining said with a face full of killing intent!<br/><br/>The two of them nodded their heads. The Three Heaven’s origin creation powerhouses nodded their heads with faces full of killing intent as well.<br/><br/>“Let’s Go! ”<br/><br/>Their bodies moved and immediately flew towards the direction pointed by the spatial needle!<br/><br/>At the same time, Wang Xian was in another tribe’s position.<br/><br/>At this moment, his gaze suddenly focused and he sensed something.<br/><br/>The force of wind and thunder that he had attacked had already disappeared!<br/><br/>He mumbled and frowned slightly.<br/><br/>“Is the target too strong this time, or does he have some treasures in his hands? The probability of having treasures in his hands is also very high for treasures of this level! ”<br/><br/>Wang Xian’s mind was full of thoughts.<br/><br/>However, when he thought about how he met the Fourth Heaven’s origin creator in the Void universe so quickly, Wang Xian had a bad feeling in his heart!<br/><br/>It was his luck that he managed to find the first three Heaven’s origin creator powerhouses.<br/><br/>However, Wang Xian felt that there was something fishy about the fourth place!<br/><br/>This was especially so after the void enemies that he released were eliminated! ‘I’ms was a problem, and It was a very big one.<br/><br/>Logically speaking, the other powerhouses in the Void Universe should have been on guard and should have known that three powerhouses in the Heaven’s origin manifestation had been attacked consecutively.<br/><br/>However, he had encountered one so easily at the water source.<br/><br/>Combined with the current situation, this was a problem!<br/><br/>“The powerhouses in the Void universe must have some kind of plan.”<br/><br/>“Did they successfully trap and kill the Three Heaven Origin creator powerhouses?”<br/><br/>“It’s possible. If that’s the case, they must be thinking of a way to deal with themselves. ”<br/><br/>“If they want to deal with themselves, how can they be sure of themselves?”<br/><br/>“Only by releasing the power of wind and thunder. The rest of them didn’t leave any flaws. ”<br/><br/>“The power of wind and thunder?”<br/><br/>Wang Xian’s eyes flickered slightly. He felt that he might be in some danger at the moment!<br/><br/>If the powerhouses in the Void Universe really wanted to deal with him, it might not be just one or two. It might be three or four, or even four or five.<br/><br/>Among them, there might be powerhouses in the control level of the Heaven’s origin.<br/><br/>“First of all, these are all my guesses. I have to confirm it myself. ”<br/><br/>Wang Xian thought to himself. He looked at Lin Niu and said, “Lin Niu, you should enter the space of the mother nest first. We might be locked onto by the powerhouses of the Void Universe! ”<br/><br/>Lin Niu was slightly stunned when he heard that. A look of astonishment appeared on his face.<br/><br/>“It’s the Dragon King! ”<br/><br/>Lin Niu didn’t ask further and entered the space of the mother nest directly.<br/><br/>With Lin Niu’s strength, he could come out of the space of the mother nest anytime he wanted.<br/><br/>He could also sense the situation outside.<br/><br/>After the Linniu entered the mother nest space, Wang Xian did not escape immediately.<br/><br/>His body trembled and once again, he had an avatar of the Netherworld ghost hide beside this teleportation formation.<br/><br/>Following that, his real body flew out.<br/><br/>He flew all the way to the limit of the Netherworld Ghost Avatar and his real body.<br/><br/>At this location, Wang Xian would need to fly for five minutes.<br/><br/>Even for a space-attributed heaven origin creator, it would take three to four minutes to reach the location of Wang Xian’s Netherworld Phantom avatar from here!<br/><br/>After arriving here, Wang Xian waited quietly.<br/><br/>Time passed day by day.<br/><br/>In the Void Universe, Duke Xining, Duke Tianmen, and the rest followed the Space Needle and flew quickly.<br/><br/>Their speed was much faster than the other masters at the peak of the universe’s ruler.<br/><br/>After all, the space element had a huge advantage when it came to traveling!<br/><br/>“Weng Weng! ”<br/><br/>Ten days later, the Space Needle in Duke Tian men’s hand suddenly trembled, which made his eyes freeze!<br/><br/>“Stop, he’s not far ahead.”<br/><br/>He immediately transmitted his voice and looked ahead!<br/><br/>“How far is it?”<br/><br/>Duke Xi Ning looked at him and asked.<br/><br/>“Two teleportation distances! ”<br/><br/>Duke Tianmen replied!<br/><br/>“He has a treasure that can detect us. We can’t get any closer! ”<br/><br/>Duke Xining said, “We have to surround him. Don’t let him escape! ”<br/><br/>“Then we’ll surround the surroundings and seal off the surrounding void! ” Duke Tianmen looked at them and said!<br/><br/>“Alright, use spatial energy to disturb the surrounding void space. However, we have to act quickly. The energy we’re releasing is too strong and we might attract the heavenly yuan creation realm experts from the six paths universe! ” Duke Xining reminded!<br/><br/>“No matter how strong the person behind the scenes is, he’s still at the peak of the ruler realm. If we join forces, we’ll definitely be able to kill him quickly! ” The three heavenly Yuan creation realm experts beside him said confidently!<br/><br/>Lord Tianmen also nodded, “He’s currently two teleportations in front of us. Head to the other three directions. Listen to my signal and surround him. Once you meet him, unleash your strongest attack and tie him down. As long as you can tie him down for an instant, it’s fine!”<br/><br/>“Alright! ”<br/><br/>Duke Xining and the rest nodded their heads and assigned their directions.<br/><br/>After that, they immediately began to teleport to their surroundings and set up their formations!<br/><br/>Very soon, information was transmitted over one by one. Duke of Heaven’s Gate pursed his lips!<br/><br/>He shouted in a low voice and disappeared instantly!<br/><br/>Buzz Buzz<br/><br/>At the same time, in the sky above the water source, Wang Xian was standing quietly on the surface of the water!<br/><br/>When the five masters of the Void universe surrounded him, the empty text compass had already sent out a reminder.<br/><br/>Looking at the five white dots above, Wang Xian’s expression changed slightly!\t\t\t\t\t\t</div>", "images": {}, "success": true}