{"id": 1115, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074188.html", "title": "Chapter 4117 - Chapter 4117: 4116 Killed The Dark Heavenly Yuan Creator", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4117 - Chapter 4117: 4116 Killed The Dark Heavenly Yuan Creator</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4117: 4116 killed the Dark Heavenly Yuan creator<br/><br/>Translator: 549690339<br/><br/>“I have to escape, I have to escape, or I’ll die! ”<br/><br/>“Otherwise, my losses this time will be too great! ”<br/><br/>The light figure was trying his best to escape, he was extremely anxious!<br/><br/>He did not expect the situation to be like this.<br/><br/>That Void universe master made him hold onto a powerful being, but now, it was actually like this.<br/><br/>He was in a situation where he was about to die.<br/><br/>Even now, he could only continue to flee!<br/><br/>“Today, I will kill you!”<br/><br/>Wang Xian looked at the fleeing figure with a cold expression on his face!<br/><br/>The Unicorn Ox and the five elements millstone were on the left and right respectively. They had already started to surround and attack!<br/><br/>With the activation of the incipient saint wings, Wang Xian’s speed was slightly faster than the figure!<br/><br/>Earlier on, the light shadow had already been attacked by the five elements grinding mill. It was already severely injured and its speed was somewhat reduced.<br/><br/>Now, it wouldn’t be long before it was surrounded by their pursuit.<br/><br/>Furthermore, the Light Shadow’s escape and his pursuit had also allowed him to escape from the powerhouses of the Void Universe.<br/><br/>The empty text compass could no longer show them.<br/><br/>This meant that there was a considerable distance between them!<br/><br/>“Run, run, run!”<br/><br/>The light shadow saw Wang Xian and the rest chasing after him at a rapid speed. His forehead was filled with cold sweat as he kept shouting.<br/><br/>If he didn’t run, he would really die!<br/><br/>He was running for his life.<br/><br/>Wang Xian and the rest were chasing after him at a rapid speed from the back. Numerous attacks were attacking him continuously!<br/><br/>Buzz Buzz<br/><br/>“Huh? What? The Light Shadow is being chased by the person behind the scenes. The person behind the scenes has two existences who have just entered the heavenly yuan destiny level. He has a powerful treasure that can unleash the strength of someone who has just entered the heavenly yuan destiny level. ”<br/><br/>At this moment, at the location of the five void universe powerhouses.<br/><br/>At this moment, Duke of Heaven’s Gate received the message from the light shadow. When he saw this message, his expression changed slightly!<br/><br/>“That light shadow was attacked by the person behind the scenes just now. It escaped through a treasure and was chased by the person behind the scenes through a treasure? Two people who have just entered the Heavenly Yuan Destiny Realm, and a weapon that is comparable to a person who has just entered the Heavenly Yuan Destiny Realm. Is this a heavenly Yuan Destiny Realm Treasure?”<br/><br/>When Duke Xining heard this, his gaze froze!<br/><br/>“That’s about it. We have to rush over immediately. Otherwise, the light shadow might be killed. In addition, they are chasing after the light shadow.<br/><br/>Let’s go and kill them! ”<br/><br/>The Duke of Heaven’s Gate said with a cold expression!<br/><br/>“Let’s go, we have to rush over immediately!”<br/><br/>The rest of the Heaven’s origin manifestation powerhouses in the Void Universe responded immediately. They flew quickly in the direction of Wang Xian and the rest!<br/><br/>“Mad Demon Trace! ”<br/><br/>It was located at another location!<br/><br/>Lin Niu stared at the light shadow that was fleeing in front of him. He lowered his speed and the symbols around his body began to change and condense together!<br/><br/>The illusory figures of the Demon God appeared one after another and attacked the figure at a terrifying speed!<br/><br/>When the figure sensed the attack from behind, he gritted his teeth and his body trembled. He could only retaliate a little!<br/><br/>Lin Niu’s attack reduced his speed a little!<br/><br/>The defense of the figure also reduced his speed a little!<br/><br/>However, the speed of Wang Xian and the grinding of the five elements did not decrease at all!<br/><br/>They continued to get closer to the light figure!<br/><br/>“Five elements transformation, Sea of Death! ”<br/><br/>The moment the light figure blocked the attack of the Linniu, Wang Xian let out a low growl!<br/><br/>At the side, the five elements millstone activated its energy and turned into the water element.<br/><br/>The water energy began to turn into a vast sea and swept towards the light figure!<br/><br/>Just as he blocked the attack of the LINNIU, he had to face the attack of the Five Elements Millstone!<br/><br/>“I can’t block it anymore, or else I’ll be caught and completely entangled. I don ‘t know when the experts of the Void Universe will be able to rush over.<br/><br/>Damn it!”<br/><br/>The light figure saw the five elements Millstone’s attack and his expression was extremely ugly!<br/><br/>The black patterns on his face slowly began to bleed.<br/><br/>Large amounts of blood flowed out and covered his body!<br/><br/>He had completely turned into a bloody man.<br/><br/>He was using up his life force to escape!<br/><br/>At this time, this was the only way!<br/><br/>Three experts of the same level were chasing after him. One of them was attacking him, so he could only slow down and block!<br/><br/>Then the other two could quickly chase after him!<br/><br/>Now, the second one was attacking again. If he tried to block it again, he would be completely entangled!<br/><br/>Therefore, he could only take it head-on!<br/><br/>Take it head-on!<br/><br/>Splash<br/><br/>An Endless Sea of death swept towards him and landed on his body!<br/><br/>It washed away his life force.<br/><br/>However, he did not have any scruples and did not put up any resistance!<br/><br/>The fresh blood on his body was washed away.<br/><br/>His face began to turn pale!<br/><br/>“Dragon ‘s chains! ”<br/><br/>When Wang Xian saw this scene, his eyes focused. He entered the sea of death and borrowed the strength of the five elements grinding to increase his speed!<br/><br/>A chain appeared in his hand and attacked him!<br/><br/>This time, the light shadow could only defend against Wang Xian’s chain.<br/><br/>If he didn’t defend, he would be entangled!<br/><br/>He would be done for!<br/><br/>“Bang! Bang! Bang!”<br/><br/>The light shadow emitted streams of energy and collided with the chain. The dragon’s chain crumbled bit by bit!<br/><br/>“Whoosh! Whoosh! Whoosh! ”<br/><br/>At this moment, Lin Niu, who had stopped his attack earlier, caught up to Wang Xian again when his speed was reduced while he was clashing with the light shadow!<br/><br/>He attacked the light shadow again!<br/><br/>“It’s over, it’s over. I’m afraid I Won’t be able to wait for the experts from the Void Universe to arrive! ”<br/><br/>When the light shadow sensed the scene behind him, a look of despair appeared on his face!<br/><br/>He couldn’t escape!<br/><br/>Three against one. Since he was already injured, there was no way for him to escape!<br/><br/>He felt a little regretful!<br/><br/>He felt a little regretful that he accepted the mission from a void universe master.<br/><br/>This time, he had suffered a huge loss!<br/><br/>This time, he would need billions of years to fully recover!<br/><br/>Wang Xian saw the unicorn ox flying over and continuing its attack. He saw that the light figure was completely entangled!<br/><br/>He let out a low roar of a divine dragon!<br/><br/>His body shook and transformed into the body of a divine dragon. His dragon tail swept towards the light shadow!<br/><br/>Buzz! Buzz<br/><br/>At this moment, a message was transmitted from the skywriting compass in the mother nest.<br/><br/>The powerhouses of the Void Universe had arrived!<br/><br/>In just a minute, they had arrived!<br/><br/>Their speed was extremely fast!<br/><br/>“There are three seconds left. Three seconds are enough to kill you!”<br/><br/>Wang Xian stared at the light shadow. His eyes were filled with intense killing intent.<br/><br/>He wanted to kill him.<br/><br/>He wanted to help a void universe master to kill him.<br/><br/>He would have to pay a terrible price!<br/><br/>Boom<br/><br/>The dragon tail swept out and landed on the body of the light shadow.<br/><br/>The light shadow was instantly severely injured!<br/><br/>The attacks of the unicorn ox and the five elements grinding came one after<br/><br/>another!<br/><br/>“Ahhhh, I can’t accept this! ”<br/><br/>The Light Shadow roared with a face full of despair.<br/><br/>Wang Xian, Linniu, and the five elements millstone flew in front of him at the same time.<br/><br/>Five Elements Annihilation Disc!<br/><br/>The demonic god energy of the LINNIU.<br/><br/>Wang Xian’s dragon claws descended at the same time!<br/><br/>An invincible power landed on the body of the light shadow.<br/><br/>It broke through his defense and killed him!\t\t\t\t\t\t</div>", "images": {}, "success": true}