{"id": 1119, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074202.html", "title": "Chapter 4122 - Chapter 4122: The 4121 Universe Rumbled As The Heavenly Yuan Destiny Supreme Treasure Appeared", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4122 - Chapter 4122: The 4121 Universe Rumbled As The Heavenly Yuan Destiny Supreme Treasure Appeared</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4122: The 4121 universe rumbled as the Heavenly Yuan Destiny Supreme Treasure appeared<br/><br/>Translator: 549690339<br/><br/>Three extremely terrifying coffins slowly stood between the heaven and earth.<br/><br/>Each coffin was tens of millions of kilometers in size. They stood between the Heaven and earth as if they wanted to bury the entire world!<br/><br/>The three coffins blocked all the paths of the Void Pagoda!<br/><br/>At the back, a figure stared at the Void Pagoda with blood-red eyes.<br/><br/>“HMM? What kind of powerful move is this? This move makes my heart palpitate. Duke Xining, don’t tangle with it. Just use up your treasures and leave this place! ”<br/><br/>Duke Tianmen looked at the three coffins that appeared in an instant and said uneasily!<br/><br/>“Alright! ”<br/><br/>Duke Xining also nodded his head heavily. With a move of his hand, a spatial scroll appeared in his hand.<br/><br/>With a move of his palm, he stuck the spatial scroll onto the Void Pagoda!<br/><br/>The entire void pagoda began to turn illusory!<br/><br/>“Boom Boom! ”<br/><br/>However, at this moment, a coffin located in the middle suddenly trembled.<br/><br/>The entire space also suddenly trembled.<br/><br/>A wave of energy that was extremely familiar to Duke Tianmen and Duke Xining surged out from the coffin.<br/><br/>Following that, the entire space was completely sealed.<br/><br/>“Space, deathly stillness!”<br/><br/>“Ahhhh!”<br/><br/>A terrifying voice suddenly sounded from within the coffin.<br/><br/>The Void Pagoda that was originally teleporting trembled violently.<br/><br/>Teleportation failed!<br/><br/>“What’s going on? How is this possible?”<br/><br/>“What is this? Deathly stillness of space, a powerful forbidden technique of our void Royal Family! ”<br/><br/>Inside the Void Pagoda, Duke of Heaven’s Gate and Duke of Xining’s expressions suddenly changed drastically as they stared in disbelief at the gradually opening coffin!<br/><br/>A powerful spatial energy surged out from the coffin!<br/><br/>The surrounding space was completely frozen.<br/><br/>The entire void pagoda was also completely sealed!<br/><br/>Dead Silence in space!<br/><br/>This was a powerful forbidden technique created by the Sacred King of the Void Royal Family.<br/><br/>He fused his body and consciousness into the surrounding void space to seal everything!<br/><br/>This technique consumed a lot of energy. It could even be said to be a bad move. If the other party were to break through, he would be severely injured!<br/><br/>Now, why did this forbidden technique and this spatial energy suddenly appear?<br/><br/>This made them feel a little incredulous!<br/><br/>They felt a little shocked!<br/><br/>At this moment. the coffin in the middle was completely opened.<br/><br/>In the coffin, a figure appeared in their sight!<br/><br/>“General of the expedition army! ”<br/><br/>When they saw the figure in the coffin, Duke Tianmen and Duke Xining exclaimed at the same time.<br/><br/>The great general of the Void Royal Family of the Void Universe!<br/><br/>During the last calamity, the only one who had completely fallen was the heavenly yuan creation stage powerhouse of the Void Universe.<br/><br/>Why would a completely dead powerhouse suddenly appear here?<br/><br/>The figure in the coffin slowly opened his eyes, revealing a blood-red light.<br/><br/>His body was emitting a power that combined space and deathly stillness.<br/><br/>His aura was completely different from what they remembered!<br/><br/>At this moment, the other two huge coffins on the left and right slowly opened!<br/><br/>Two burly figures also appeared in their line of sight!<br/><br/>“The Dead Heavenly Yuan creation. ”<br/><br/>Duke Tian men’s expression changed drastically when he saw this scene!<br/><br/>A Dead Heavenly Yuan creation.<br/><br/>That’s right, the heavenly yuan creation experts in the coffin were all completely dead heavenly yuan creation experts.<br/><br/>And now, they were actually summoned.<br/><br/>Most importantly, these three dead heavenly yuan creation experts still possessed the strength of a heavenly Yuan creation.<br/><br/>They also possessed secret techniques from when they were alive!<br/><br/>Duke Xi Ning also took a deep breath.<br/><br/>“The power of the Sixth Dao of the six paths universe, the attribute of the dead, the power of the dead… all the special energies in the universe have always been stronger, but this power…”<br/><br/>Duke Xining’s expression was a little awkward!<br/><br/>They had never interacted with a heavenly yuan creation realm expert from the six paths universe before.<br/><br/>They did not know that this heavenly yuan creation realm expert from the six paths universe was actually so terrifying! He could actually summon a dead powerhouse.<br/><br/>This was somewhat terrifying!<br/><br/>It was somewhat powerful.<br/><br/>If they were in the chaos, they might be able to escape easily or even suppress him<br/><br/>But here, they were in big trouble!<br/><br/>If these three special corpses could keep fighting, it was equivalent to them facing the attacks of four heaven origin creation powerhouses!<br/><br/>With their suppressed strength, they could dodge one, two, but they were not confident of dodging three or four!<br/><br/>“This six paths universe is not as simple as we thought!”<br/><br/>Duke Tian men’s expression was ugly. Their bodies moved as they felt the surrounding energy freeze.<br/><br/>The spatial energy in their bodies was being compressed by the surrounding spatial energy!<br/><br/>“Duke of Heaven’s Gate, we can only hope for the best now. ”<br/><br/>Staring at him, Duke Xining spoke!<br/><br/>With a move of his palm, the Void Pagoda disappeared and entered his body!<br/><br/>Duke of Heaven’s Gate nodded his head with an embarrassed expression.<br/><br/>Next, they had to run for their lives. As for whether they could escape or not, that would depend on their luck!<br/><br/>The two of them took a deep breath!<br/><br/>They began to use the trump cards and treasures in their hands!<br/><br/>Wang Xian did not know that the arrival of the six paths of the universe had allowed him to avoid a calamity.<br/><br/>However, at this moment, although he had avoided this calamity,.<br/><br/>His entire body was already on the verge of death!<br/><br/>The vitality in his body was extremely weak. It could be said that any living creature could kill him.<br/><br/>He was floating on the surface of the water and was being washed by the waves.<br/><br/>He was completely in a coma. According to this state, Wang Xian would die soon!<br/><br/>It wouldn’t be long before he was resurrected at the Dragon Palace!<br/><br/>“Miss, pay attention. There seems to be someone over there! ”<br/><br/>Time passed slowly. A few hours later, a group of two people were floating on the surface of the water and were flying forward rapidly.<br/><br/>At this moment, the woman on the right suddenly spoke and stood in front of the woman next to her!<br/><br/>The woman next to her had a bulging stomach. It was obvious that she was pregnant!<br/><br/>“Yes, I saw it. It seems to be injured.”<br/><br/>The pregnant woman looked over and said.<br/><br/>“Miss, the identity of this kind of person is unclear. We shouldn’t bother about<br/><br/>The Maid on the right said!<br/><br/>“It’s alright. We’ve already touched her. Let’s go over and take a look. If we can help, let’s help. We’ll treat it as helping Bao’er.”<br/><br/>The woman hesitated for a moment, then touched her stomach and said!<br/><br/>“This… ”<br/><br/>The maid frowned slightly.<br/><br/>At this moment, the body in front of them slowly approached under the wind and waves!<br/><br/>“Alright.”<br/><br/>The maid nodded, “Miss, I’ll go and take a look!”<br/><br/>The maid flew over and checked her body. Her brows were tightly knitted as waves of wood attribute energy surged into her body.<br/><br/>“Miss, this person’s injuries are very serious and he’s on the verge of death. He’s currently in a coma and won’t recover so easily!” The maid spoke to the Woman!<br/><br/>“Bring him back. We are already very close to the tribe.”<br/><br/>The woman spoke.<br/><br/>“Miss, you are too kind..”\t\t\t\t\t\t</div>", "images": {}, "success": true}