{"id": 1114, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074184.html", "title": "Chapter 4116 - Chapter 4116: 4115, Kill The Powerhouses In The Destiny Realm Of The Dark Element", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4116 - Chapter 4116: 4115, Kill The Powerhouses In The Destiny Realm Of The Dark Element</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4116: 4115, kill the powerhouses in the destiny realm of the dark element<br/><br/>Translator: 549690339<br/><br/>The light figure wanted to restrain her.<br/><br/>But Wang Xian wanted to kill him.<br/><br/>It was intentional!<br/><br/>In addition to the strength that Wang Xian revealed, he was only at the initial stage of the destiny realm of the Heaven Element.<br/><br/>This made the light figure much less wary of Wang Xian.<br/><br/>Moreover, the powerhouses in the Void universe did not know Wang Xian ‘s strength. They did not even know who the mastermind was.<br/><br/>Under such circumstances, Wang Xian’s sudden attack caused Guang Ying’s expression to change slightly.<br/><br/>However, he did not let his guard down too much when facing Wang Xian.<br/><br/>If Wang Xian discovered something and wanted to escape, he was prepared to take action immediately.<br/><br/>However, he did not expect Wang Xian to attack him directly!<br/><br/>“How dare you! ”<br/><br/>Guang Ying revealed an angry expression when he saw Wang Xian’s attack.<br/><br/>He had yet to make a move, yet the other party dared to attack him.<br/><br/>He was courting death!<br/><br/>However, in the next moment, he was stunned!<br/><br/>At the front, an expert who had just entered the Heaven’s origin realm suddenly appeared and attacked him!<br/><br/>In addition, a terrifying killing weapon suddenly appeared in the sky above the person who attacked him!<br/><br/>This caused his expression to change drastically!<br/><br/>An aura of death enveloped him!<br/><br/>Three against one!<br/><br/>No matter which universe it was, it would be difficult to kill an opponent of the same level in a two against one fight.<br/><br/>However, in a three against one fight, this was basically a crushing defeat!<br/><br/>There wasn’t the slightest bit of resistance.<br/><br/>Even in the 9-origin universe, Great Beings could teleport back to their God countries, and in a three against one fight, they could still kill an opponent of the same level.<br/><br/>It was even more so in other universes!<br/><br/>“Unleash your strongest attack. Kill! ”<br/><br/>Wang Xian locked onto the light figure completely. His eyes were filled with violent killing intent.<br/><br/>When the skywriting compass detected that the powerhouses of the Void universe were flying towards him, Wang Xian knew that the guy in front of him who suddenly wanted to trade with him was a powerhouse of the Void Universe.<br/><br/>Therefore, he had to either run away immediately.<br/><br/>Or he could kill him instantly!<br/><br/>If he ran away immediately, he might pursue and interfere.<br/><br/>Therefore, Wang Xian chose to attack.<br/><br/>Sneak Attack!<br/><br/>The opponent didn’t know about the existence of the unicorn ox and the five elements grinding mill.<br/><br/>Under the situation of absolute suppression, Wang Xian wanted to kill him instantly.<br/><br/>Let Him Die!<br/><br/>“Roar Roar!”<br/><br/>The Unicorn Ox let out a low roar. Its single horn emitted a terrifying power.<br/><br/>Wang Xian stretched out his arm and transformed it into a dragon claw. An extremely terrifying energy began to brew within it!<br/><br/>Mad Dragon Star Explosion!<br/><br/>Above him, the five elements millstone was spinning and emitting the aura of death.<br/><br/>The Five Elements Millstone was spinning and destroying everything!<br/><br/>“Damn it! ”<br/><br/>When the light projection saw this scene, his expression changed drastically.<br/><br/>His body trembled as the surrounding dark energy was absorbed into his body.<br/><br/>His true appearance was revealed!<br/><br/>His body was somewhat similar to a human’s, but his face was filled with black patterns, making him look extremely strange!<br/><br/>His pair of dark black pupils seemed to contain the existence of an abyss.<br/><br/>He held a ball in his hand, and blood seeped out from his palm, flowing into the black ball.<br/><br/>The ball raised a black defense, completely enveloping him.<br/><br/>Boom! Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>In an instant, streams of terrifying energy landed on the black defense.<br/><br/>The two consecutive attacks caused the defense to collapse.<br/><br/>The last attack landed on his body.<br/><br/>Crack! Crack! Crack<br/><br/>His body cracked like glass. The dense black lines on his face began to dim!<br/><br/>Wang Xian stared at him and charged right in front of him!<br/><br/>His dragon claws clawed at his head!<br/><br/>“Just you wait! ”<br/><br/>When the light figure saw Wang Xian ‘s attack, a ferocious expression appeared on his face.<br/><br/>He crushed the dark sphere in his hand.<br/><br/>The dark sphere was crushed immediately!<br/><br/>His body slowly dissipated. Wang Xian’s dragon claws also struck the air!<br/><br/>“HMM? There’s a treasure for escaping, right?” Wang Xian stared at him, his eyes shining. He clawed at the gradually disappearing darkness.<br/><br/>“Netherworld Dragon ‘s pursuit! ”<br/><br/>Netherworld Dragon’s pursuit. As long as he was locked onto by Wang Xian, once he escaped, he would be able to teleport over instantly! This was the first time Wang Xian had used this move!<br/><br/>Of course, this move had its limitations.<br/><br/>If his opponent could return to his own universe, then the energy of Wang Xian’s move would be insufficient!<br/><br/>However, the escape of the light shadow did not mean that he could return to his own universe.<br/><br/>Instead, he had performed a long-distance teleportation!<br/><br/>When his figure disappeared, Wang Xian waved his arm and kept the Unicorn Ox and the five elements millstone into the mother nest. His figure also slowly disappeared.<br/><br/>Whoosh! Whoosh! Whoosh! Whoosh<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>The moment he disappeared, the five heaven origin creation stage powerhouses from the Void Universe had already rushed over.<br/><br/>When they saw Wang Xian’s disappearing figure, their expressions changed slightly!<br/><br/>“He escaped. He used a powerful treasure to escape! ”<br/><br/>Staring at the spatial needle in his hand, Duke of Heaven’s Gate said with an ugly expression.<br/><br/>“The light figure seems to have suffered from his powerful attack and escaped too!<br/><br/>Duke Xining sensed the energy around him and said, “Besides, the person behind this might not be the same person. There are two auras of Heavenly Yuan Destiny Realm powerhouses here! ”<br/><br/>“Let’s Go and chase after them first! ”<br/><br/>Duke Tianmen’s expression changed as he said!<br/><br/>At the same time, in a void far away!<br/><br/>The light figure’s body slowly appeared. At this moment, his expression was extremely ugly.<br/><br/>He had promised the experts of the Void Universe to help pin down a heaven origin creation realm expert.<br/><br/>In the end, the treasure he obtained was completely inferior to the life-saving treasure he had just used up.<br/><br/>The life-saving treasure in his hand was extremely precious.<br/><br/>Even he only had this one!<br/><br/>“Damn it, damn it, what a huge loss. This time, it’s a huge loss! ”<br/><br/>“That cunning fellow, he actually has such powerful strength, and that terrifying treasure, it’s not weaker than the battle strength of a Heavenly Yuan Creator! ”<br/><br/>As he spoke, his face was filled with extreme anger.<br/><br/>Right at this moment, he suddenly felt the space behind him tremble.<br/><br/>He felt as if something was staring at him, locking onto him!<br/><br/>At this moment, his expression changed drastically. He quickly flew to the side and swept his gaze behind him!<br/><br/>“Can you escape?”<br/><br/>Wang Xian’s figure appeared. His gaze was fixed on the figure and his face was filled with a cold killing intent!<br/><br/>“You actually have a powerful tracking secret technique! ”<br/><br/>When the figure saw Wang Xian appearing, his expression changed drastically.<br/><br/>Without any hesitation, he immediately fled into the distance!<br/><br/>“I will definitely kill you!”<br/><br/>The primaless Saint Wings appeared on Wang Xian ‘s back and instantly chased after him!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>At the same time, the unicorn ox and the five elements grinding mill also flew out instantly and surrounded the figure!<br/><br/>“This is bad.”<br/><br/>When the figure saw this scene, his expression changed drastically again!<br/><br/>His heart was beating violently.. He quickly took out his communication device and sent a message to the experts in the Void Universe!\t\t\t\t\t\t</div>", "images": {}, "success": true}