{"id": 1112, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074176.html", "title": "Chapter 4114 - Chapter 4114: External Aid 4113", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4114 - Chapter 4114: External Aid 4113</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4114: External Aid 4113<br/><br/>Translator: 549690339<br/><br/>“Five powerhouses in the Heaven’s origin realm, and there might be an existence at the control level among them. They really want to get rid of me. Hehe. Moreover, they have a treasure in their hands that is locked onto me! ” Wang Xian mumbled as his eyes sparkled.<br/><br/>Sensing the five figures attacking him at a rapid speed, Wang Xian’s figure trembled slightly and disappeared instantly!<br/><br/>Netherdragon transformation!<br/><br/>In the next instant, Wang Xian’s figure appeared beside the teleportation formation of the tribe not far away.<br/><br/>He stepped into the teleportation formation and teleported away immediately!<br/><br/>“He disappeared. He actually disappeared so quickly. Did he discover our Siege?”<br/><br/>At the same time, the expression of the Duke of Heaven’s Gate changed slightly when he sensed the change in the spatial pointer in his hand.<br/><br/>His expression didn ‘t look too good. He immediately teleported to where Wang Xian was earlier.<br/><br/>“Eh? Duke of Heaven’s Gate, where is he?”<br/><br/>Duke Xining and the rest teleported over but didn’t discover Wang Xian. Their faces were filled with astonishment.<br/><br/>“Where is he? “They asked in astonishment.<br/><br/>“He escaped. He discovered our arrival in advance. The treasure in his hand can detect us in advance.”<br/><br/>The expression of the Duke of Heaven’s Gate was a little ugly.<br/><br/>“He discovered us ahead of time? Doesn’t that mean that he had already escaped when we were able to get close to him?”<br/><br/>Hearing this, the brows of the Duke of Xining also tightened as he spoke.<br/><br/>The Duke of Heaven’s gate nodded, and his expression was also a little ugly!<br/><br/>In such a situation, it wasn’t a good thing for them.<br/><br/>As long as they got closer, the other party would be able to discover them.<br/><br/>Under such circumstances, the other party would immediately escape.<br/><br/>They would never be able to lock onto the other party.<br/><br/>“He has a treasure that can detect our spatial attributes. Once we get close, he will also discover us. ”<br/><br/>As Heaven’s Gate Duke spoke, his gaze swept towards the other people!<br/><br/>“The treasure he has is very powerful. If we want to surround him, it will be extremely difficult. ”<br/><br/>Duke Xining shook his head.<br/><br/>“He should only be able to detect us with space attributes. He shouldn’t be able to detect us with other attributes. ”<br/><br/>A heavenly Yuan creation realm expert from the Void universe guessed.<br/><br/>“HMM?”<br/><br/>His words caused the other people to raise their eyebrows.<br/><br/>“If we can find a heavenly Yuan creation realm expert with other attributes and help us stall the mastermind, we have a chance to destroy him! ”<br/><br/>Duke Xining was deep in thought.<br/><br/>“This is a solution. The more experts we can find, the better. As long as they can help us stall the mastermind, we can quickly rush over and kill him!” The eyes of the other heavenly yuan creator experts flashed.<br/><br/>“Two guardian dukes, do you know any experts? This is a very good solution.<br/><br/>We can give him some rewards. ”<br/><br/>A heavenly Yuan creator powerhouse asked.<br/><br/>“I have a candidate here. If we give him some rewards, he should not refuse! ”<br/><br/>Duke of Heaven’s Gate Thought for a while and said!<br/><br/>“I’m not sure.”<br/><br/>Duke of Xining pondered for a while and said!<br/><br/>“Ask around. If you can’t do it, I don’t have any problems. According to my senses, the person behind this is a person.”<br/><br/>Lord Tianmen said to him.<br/><br/>“Alright. ”<br/><br/>Lord Xining nodded.<br/><br/>Even if they could only find one powerhouse, as long as they could hold him off for a minute, they would be able to rush over from afar.<br/><br/>And completely surround him!<br/><br/>Lord Tianmen immediately took out his communication stone plate and made some contact.<br/><br/>Many heavenly yuan destiny realm powerhouses had some contact with each other.<br/><br/>Most of them were used to trade for some items.<br/><br/>Under normal circumstances, very few powerhouses were willing to do such a thing.<br/><br/>However, the Duke of Heaven’s gate was confident that he could call over a heavenly yuan destiny realm powerhouse.<br/><br/>“He has agreed. We need to give them some rewards for a powerhouse from the yin-yang universe. ”<br/><br/>Soon, the Duke of Heaven’s Gate received the prepared news, he looked at everyone. “A darkness-type heavenly yuan destiny realm powerhouse from the Yin-yang universe. He has just entered the level of a beginner. In the six paths universe, we are all suppressed at the peak of the universe’s ruler realm. It shouldn’t be too much of a problem for the darkness-type to tie down the mastermind for a few minutes! ”<br/><br/>“Alright! ”<br/><br/>Duke Xining and the rest nodded. “We will split his reward equally. We must get rid of that guy. ”<br/><br/>“In that case, let’s prepare for the next attack! ”<br/><br/>The few of them nodded and continued to plan for the second attack!<br/><br/>“It seems that the initial trap and kill should have succeeded. Otherwise, the Void universe wouldn’t have sent five strong practitioners to surround and kill him. Hehe!”<br/><br/>Wang Xian arrived at another tribe in the water source through the teleportation formation. A smile appeared on his face!<br/><br/>He wasn’t angry about being encircled.<br/><br/>Instead, this was good news to him.<br/><br/>Furthermore, he could be said to have escaped perfectly from the encirclement of the Void universe this time around.<br/><br/>The empty text compass of the 12 ancestral witches could detect the experts of the Void universe before they arrived.<br/><br/>Although they had treasures that could lock onto him, Wang Xian also had treasures that could detect them in advance.<br/><br/>Therefore, from the looks of it, he was safe.<br/><br/>He didn’t have to worry about the attacks and encirclement of the Void Universe.<br/><br/>“However, I still have to be careful! ”<br/><br/>Wang Xian mumbled, “Now that the Void Universe is on alert and retaliating, I can’t continue to trap and kill the experts of the Void Universe. This is good too. I should continue to search for traces of the ultimate treasure of<br/><br/>Tianyuan. ”<br/><br/>As he spoke, he flew in a direction.<br/><br/>Wang Xian did not release the unicorn ox nor did he use the five elements grindstone.<br/><br/>All of these were used as trump cards.<br/><br/>Faced with the powerful void universe, Wang Xian still had to be careful even if he managed to dodge one of their attacks.<br/><br/>After all, this was a powerful void universe.<br/><br/>As he flew forward rapidly, Wang Xian started to wander around the water source.<br/><br/>Time passed by quickly again.<br/><br/>Decades had passed. During these decades, everything was peaceful. However, what made Wang Xian feel helpless was that there was no news about the ultimate treasure of the Heaven’s origin. “Everyone from the Void Universe, Hehe! ” In the chaotic space next to the six universes.<br/><br/>Five figures were floating there.<br/><br/>At this moment, a figure shrouded in darkness suddenly appeared and greeted them with a smile!<br/><br/>“Light Shadow, you ‘re very fast! ”<br/><br/>The Duke of Heaven Gate looked at this figure and said with a smile.<br/><br/>“Hehe, it’s near here. There’s a Heavenly Yuan destiny true treasure born here in the six paths universe. I want to come and take a look. ” The dark figure called Light Shadow said with a smile!<br/><br/>“Help us take care of that Guy First! ”<br/><br/>The Duke of Heaven Gate said to him.<br/><br/>“Of course, there’s no problem. Even if he’s a control-level existence, his strength will be greatly reduced when he enters the six paths universe. If we delay him for a minute, there won’t be any problem! ” “If it’s a beginner-level existence, then it’ll be even easier! ”<br/><br/>The light shadow said confidently!\t\t\t\t\t\t</div>", "images": {}, "success": true}