{"id": 1118, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074198.html", "title": "Chapter 4121 - Chapter 4121: The 4120 Universe Rumbled As The Ultimate Treasure Of Tianyuan Appeared", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4121 - Chapter 4121: The 4120 Universe Rumbled As The Ultimate Treasure Of Tianyuan Appeared</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4121: The 4120 universe rumbled as the ultimate treasure of Tianyuan appeared<br/><br/>Translator: 549690339<br/><br/>“Roar!”<br/><br/>Wang Xian’s body recovered to its peak in an instant!<br/><br/>He let out a wild roar as cracks started to appear on his body.<br/><br/>“Transformation of the Netherworld Dragon! ”<br/><br/>Wang Xian forced himself to perform the transformation of the Netherworld Dragon and blood flowed out of his mouth!<br/><br/>Such a forceful action using an ability that could not be used was extremely terrifying.<br/><br/>It even caused Wang Xian’s body, which had just recovered to its peak, to be injured directly.<br/><br/>Moreover, this injury was not light!<br/><br/>However, Wang Xian’s figure disappeared in an instant.<br/><br/>In an instant, he broke away from the attack of the Void Universe’s powerhouses!<br/><br/>“Eh? He actually recovered all his injuries in an instant and escaped forcefully! ”<br/><br/>When the Heaven’s Gate Duke and the rest saw that Wang Xian had actually recovered from his injuries rapidly and left directly, their faces were also filled with astonishment.<br/><br/>“He was forced to leave this time. He is already injured. Continue to chase! ”<br/><br/>Duke of Xining’s gaze focused as he controlled the Void Pagoda to continue his rapid pursuit!<br/><br/>“Whoosh! ”<br/><br/>Wang Xian’s body shifted to the Netherspirit avatar not far away.<br/><br/>He immediately transformed into his human form and took a few deep breaths. His expression was extremely ugly.<br/><br/>He had used all of his trump cards!<br/><br/>Wang Xian had almost used all of his trump cards!<br/><br/>The strongest ability of the dark resurrection Lily.<br/><br/>With this use, the resurrection Lily in his hand was almost useless.<br/><br/>It would take at least tens of millions of years for him to recover.<br/><br/>Similarly, the Shadow Dragon Avatar could no longer be used.<br/><br/>The Abyss Dragon Avatar could be used regardless of the damage to his body.<br/><br/>However, the Shadow Dragon Avatar could no longer be used!<br/><br/>Now that he was injured, it would take him at least a few million years to recover from this injury!<br/><br/>If he continued to use the transformation of the Netherworld Dragon, the injury would be unimaginable!<br/><br/>Wang Xian even had a feeling that if he were to use it two or three more times, his body would probably collapse and die!<br/><br/>“If I have no other choice, I can only use it twice. If I use it three times, it would be no different from death! ”<br/><br/>Wang Xian mumbled as he flew forward rapidly.<br/><br/>The Ghost Avatar continued to fly in the surroundings!<br/><br/>With his body injured, Wang Xian’s speed did not decrease by much.<br/><br/>However, he had yet to shake off the powerhouses from the Void Universe.<br/><br/>According to the memories in his mind, he would still need more than ten days to get to the nearest one.<br/><br/>“It seems like Pm doomed this time.”<br/><br/>Wang Xian mumbled and continued to fly at a fast speed!<br/><br/>Three minutes later, the skywriting compass showed again that the powerhouses from the Void universe were chasing him again.<br/><br/>The terrifying void pagoda and the terrifying energy made Wang Xian’s face bitter.<br/><br/>This time, he was at a disadvantage!<br/><br/>The energy that erupted from the Void Pagoda was not something that Wang Xian could withstand.<br/><br/>After all, there were two heaven origin creation powerhouses at the control level in the Void Pagoda.<br/><br/>Wang Xian shook his head helplessly.<br/><br/>“Transformation of the Netherworld Dragon! ”<br/><br/>Buzz<br/><br/>Wang Xian’s body began to collapse and the vitality in his body disappeared rapidly.<br/><br/>While he was undergoing the transformation, the surrounding energy was pressing toward him and depleting his vitality.<br/><br/>After he dodged, he spat out fresh blood.<br/><br/>He was severely injured. He was severely injured!<br/><br/>This kind of injury, without any treasures, it would take him hundreds of millions of years to cultivate and recover!<br/><br/>However, he could only continue to use it, forcefully using it.<br/><br/>Otherwise, he would be completely finished!<br/><br/>Even though he could revive, the price to revive was a bit high!<br/><br/>Furthermore, even if he died from heavy injuries, he didn’t want to be killed by the great beings of the void space.<br/><br/>“If I knew this earlier, I would have brought an lie here. If an lie were to come here, he can collect his corpse! ”<br/><br/>Wang Xian found joy in suffering!<br/><br/>If an lie was in this universe, he could bring his corpse back when he used the transformation of the Netherworld Dragon to die.<br/><br/>In this way, Wang Xian would recover much faster!<br/><br/>“He can’t take it anymore. He is forcefully using this teleportation ability. Chase Him! ”<br/><br/>In the Void Pagoda, Duke of Heaven’s Gate saw Wang Xian’s body starting to collapse and bleed.<br/><br/>Sensing that his aura was weakening rapidly, his eyes glowed as he shouted loudly!<br/><br/>Boom! Boom<br/><br/>The Void Pagoda continued to rumble as it continued to chase after Wang Xian!<br/><br/>However, two minutes later, the information of the Void Universe’s powerhouses was transmitted from the empty text compass again.<br/><br/>This made him shake his head helplessly.<br/><br/>The severe injuries on his body had already slowed down his speed by a lot.<br/><br/>He had just escaped for two minutes when he was caught up!<br/><br/>“Continue to perform the transformation of the Netherworld Dragon. If I die, so be it. At most, I can recover! ”<br/><br/>Wang Xian mumbled and gritted his teeth.<br/><br/>Buzz<br/><br/>Before the Void Pagoda arrived, Wang Xian performed another transformation of the Netherworld Dragon!<br/><br/>Wang Xian only felt his vision darken and his life force disappeared rapidly. Following that, he felt his consciousness slowly dissipating!<br/><br/>The transformation of the Netherworld Dragon was successful.<br/><br/>However, after he transformed, his body fell straight to the ground.<br/><br/>He was on the verge of collapsing as he fell down!<br/><br/>“He can’t take it anymore!”<br/><br/>At the back, Duke of Heaven’s Gate and the others who were chasing after him happened to see Wang Xian’s aura disappearing violently.<br/><br/>When they saw him escaping forcefully, their eyes lit up! “Chase him! He can’t escape anymore. Destroy him completely! ”<br/><br/>The eyes of the Duke of Heaven’s gate blazed as he shouted!<br/><br/>“He’s still so unbridled in our six paths universe. He really doesn’t put us in his eyes. ”<br/><br/>However, at this moment, a voice suddenly entered his mind!<br/><br/>Following that, a figure quickly flew over from a very far distance.<br/><br/>The energy on his body was very strange, giving off a terrifying feeling!<br/><br/>His entire body looked extremely stiff!<br/><br/>A pair of blood-red eyes stared at Tian Men Gong and Xi Ning Gong in the Void Pagoda!<br/><br/>“Not good!”<br/><br/>Tian men gong and Xi Ning Gong’s expressions changed slightly when they saw the figure that suddenly flew over.<br/><br/>If this was in the primal chaos, they would not have any changes in their universe.<br/><br/>However, this was the six paths universe.<br/><br/>They were being suppressed here!<br/><br/>“Damn it, let’s escape first. That guy is already heavily injured. We will look for him after we escape! ”<br/><br/>Duke Tianmen’s expression darkened as he spoke to Duke Xining!<br/><br/>“Alright. ”<br/><br/>Duke Xining’s expression changed slightly as he nodded.<br/><br/>They did not expect that the Heavenly Yuan creation realm expert from the six paths universe would arrive so quickly!<br/><br/>However, since a heavenly yuan creation realm expert had arrived, they could only flee.<br/><br/>Even if they were all at the control level and had the Void Pagoda, they were still not his match.<br/><br/>However, they were still not his match!<br/><br/>Duke Xining immediately controlled the Void Pagoda and instantly fled into the distance!<br/><br/>“You want to escape so easily? Let Me Show you guys the power of the sixth path of my six paths universe.”<br/><br/>“Undying and indestructible, resurrected from the dead, six paths of the Dead!<br/><br/>The figure floating in void space narrowed his eyes and shouted coldly.<br/><br/>Every time he spoke, the sky around him darkened.<br/><br/>In front of Void Space Tower, an incomparably huge coffin appeared.<br/><br/>The entire coffin seemed to want to seal off the entire world..\t\t\t\t\t\t</div>", "images": {}, "success": true}