{"id": 1110, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074168.html", "title": "Chapter 4112 - Chapter 4112: On The Counterattack Of The 4111 Void Universe", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4112 - Chapter 4112: On The Counterattack Of The 4111 Void Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4112: On the counterattack of the 4111 Void Universe<br/><br/>Translator: 549690339<br/><br/>Wang Xian did not know that he had been targeted by the powerhouses of the Void Universe!<br/><br/>He also did not know that the powerhouses of the Void Universe had joined forces.<br/><br/>In fact, Wang Xian did not even know if the people of the Void universe that he had tricked had been killed.<br/><br/>“It has only been less than a thousand years. Let’s play with them! ”<br/><br/>Wang Xian smiled.<br/><br/>In a thousand years, he had encountered two groups of powerhouses from the Void Universe.<br/><br/>The probability of this was still very high.<br/><br/>The six paths universe was very big, but the six treasured lands of the water source grassland were not very big.<br/><br/>With Wang Xian and the others ‘abilities, they could search the entire area within a few hundred years.<br/><br/>The group of powerhouses from the Heaven’s origin realm thought that the probability of the birth of the Heaven’s origin treasure was higher in these six treasured lands.<br/><br/>Therefore, most of them were gathered in these six treasured lands.<br/><br/>This was also the reason why Wang Xian was able to find the powerhouses in the Heaven’s origin destiny realm in the Void universe so quickly.<br/><br/>“While searching, I’ll stroll around these six treasured lands. It Won’t delay the search for the Heaven’s origin destiny treasure too much.”<br/><br/>Wang Xian and the Linniu left the tribe and shuttled under the water source. They were surrounded by seawater. Occasionally, they would encounter some elemental beasts.<br/><br/>Wang Xian and the rest did not kill the elemental beasts here. To them, the resources of these elemental beasts were too little.<br/><br/>Furthermore, they were outsiders. It was best not to kill the elemental beasts here.<br/><br/>Wang Xian and the rest were wandering around the water source.<br/><br/>As the water source was divided into the upper and lower regions, the overall area was much larger than the grassland.<br/><br/>There were also some tribes that were located below.<br/><br/>The water below was very deep. Even with Wang Xian’s strength, it would take him a few days to fly up from the bottom of the water!<br/><br/>“Will the person behind the scenes appear?”<br/><br/>“As long as he is still targeting us, he will definitely appear. General Kong ye was attacked at the grassland. The two princes were attacked not far from the edge of the water source. The person behind the scenes should not have come to our location. If he continues to attack us, he will come here. ”<br/><br/>“Lord Guardian Duke, if we can locate the person behind this, then we must kill him completely! ”<br/><br/>“Even if we can’t kill him this time, once the calamity arrives, we must kill him completely! ”<br/><br/>In a mansion located in the territory of a tribe located in the source of water.<br/><br/>An old man sat there, looking at the contents of the communication device. He closed his eyes and waited quietly.<br/><br/>They were very patient. Now that someone was staring at them, they wanted to mess with them.<br/><br/>In that case, they had to kill the person behind the scenes who was staring at them first. Otherwise, they would be in great danger.<br/><br/>Therefore, they could not continue to search for the ultimate treasure of the Heaven’s origin unless they found the person behind the scenes.<br/><br/>Time passed day by day.<br/><br/>Meanwhile, Wang Xian and Lin Niu were also strolling around the water source.<br/><br/>When Wang Xian and the rest came to a tribe again, another message was displayed on the empty text compass.<br/><br/>When he saw the Heaven’s origin powerhouses who had detected the spatial attribute again, Wang Xian revealed a look of surprise.<br/><br/>“This time, it’s faster. Are there no connections between the powerhouses in the Void Universe? It shouldn’t be. They belong to the same dynasty. ”<br/><br/>Wang Xian mumbled to himself. He was a little surprised.<br/><br/>If they were attacked by the powerhouses of the six paths universe, logically speaking, the powerhouses of the Void Universe should be on guard since they had been tricked one after another.<br/><br/>But now, he had found another one so quickly.<br/><br/>This made them a little surprised.<br/><br/>Were the powerhouses of the six paths universe not attacking them?<br/><br/>Or was it because they were able to get rid of the powers that they used to search for enemies in the void so that they were not targeted by the powerhouses from the six paths universe?<br/><br/>That was possible!<br/><br/>“Boss, What’s Wrong?”<br/><br/>Lin Niu asked curiously when he saw that Wang Xian was deep in thought.<br/><br/>(‘We have detected the powerhouses from the Void universe again.”<br/><br/>Wang Xian said to him.<br/><br/>“HMM? We found them again? So soon? Boss, could it be that there was an accident or something special?”<br/><br/>Lin Niu asked in surprise.<br/><br/>Wang Xian shook his head. “It’s a little strange. I don’t know where the problem is. In short, it’s not a good thing.”<br/><br/>As he spoke, there was something wrong with the current situation.<br/><br/>There must be a problem somewhere!<br/><br/>He was considering whether he should continue to make a move!<br/><br/>“I can make a move, but I have to be prepared! ”<br/><br/>Wang Xian thought to himself. He had to make preparations to deal with the danger!<br/><br/>He pondered for a moment and came to the location of the teleportation formation of this tribe.<br/><br/>Wang Xian checked his surroundings. After obtaining some information, he was ready to make a move.<br/><br/>After he made his move, he was prepared to head to another tribe through the teleportation formation immediately.<br/><br/>Then, he would leave the water source quickly.<br/><br/>As for whether he should find trouble with the Masters of the Void Universe, he would have to wait and see.<br/><br/>Buzz<br/><br/>Wang Xian’s body trembled. An avatar of the Netherworld Ghost appeared at a corner and quickly hid himself.<br/><br/>Following that, he found a master of the universe and took control of him. Then, he flew toward the location that the skywriting compass had locked onto.<br/><br/>When he was a few hundred kilometers away from that location, Wang Xian ‘s eyes narrowed. Without any hesitation, he launched an attack.<br/><br/>When the attack landed on that location, Wang Xian sensed something.<br/><br/>He condensed a sword of wind and thunder and passed it to the master who was being controlled by him.<br/><br/>“Netherdragon Transformation! ”<br/><br/>In the next instant, his figure disappeared and he arrived at the teleportation formation.<br/><br/>“Let’s Go! ”<br/><br/>Wang Xian said to Lin Niu who was not far away. He stepped into the teleportation formation and disappeared!<br/><br/>“He really made his move! ”<br/><br/>At the same time, he was at the spot where Wang Xian was attacking. In that room, the Duke of the Void Universe was enveloped by the power of wind and thunder.<br/><br/>He felt the energy that landed on his body. He opened his eyes and let out a glow!<br/><br/>“Humph, this time, I’m going to destroy you completely! ”<br/><br/>His eyes revealed a cold expression. With a wave of his arm, a teleportation array appeared in front of him.<br/><br/>He directly entered the teleportation array and disappeared!<br/><br/>Very quickly, he appeared at the edge of the water source.<br/><br/>“This energy is from the exterminated race in the 9 origin universe. It’s very troublesome. Even if I want to completely destroy it, I’ll need a few hours to disappear!”<br/><br/>The Guardian Duke of the Void Universe appeared and destroyed the teleportation formation.<br/><br/>Feeling the energy in his body, his eyes gleamed.<br/><br/>He moved his palm and a treasure that looked like a spaceship appeared in his hand.<br/><br/>The middle of this treasure was empty, and it slowly covered his body!<br/><br/>Following that, the power of wind and thunder was separated from his body.<br/><br/>He looked at the power of wind and thunder with a smile on his face.<br/><br/>He stepped into a teleportation array not far away!<br/><br/>“The target has attacked again. The energy has been obtained. Prepare to chase and kill him! ”<br/><br/>A voice full of killing intent sounded at the end of the teleportation array!\t\t\t\t\t\t</div>", "images": {}, "success": true}