{"id": 1117, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074194.html", "title": "Chapter 4120 - Chapter 4120: 4119 Was Injured", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4120 - Chapter 4120: 4119 Was Injured</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4120: 4119 was injured<br/><br/>Translator: 549690339<br/><br/>Wang Xian quickly fled in front.<br/><br/>At the same time, he held a communication device in his hand and transmitted the image of the Void Space Tower to the communication device of the six paths universe.<br/><br/>Outsiders from other universes.<br/><br/>Powerful invaders.<br/><br/>Enemies of the six paths universe.<br/><br/>Currently, Wang Xian and the rest were addressed as such by the powerful disciples of the six paths universe.<br/><br/>Now that there was an intruder controlling a powerful war weapon so brazenly in their six paths universe, it naturally caused a huge commotion.<br/><br/>Countless powerful disciples of the six paths universe were cursing furiously on their communicators.<br/><br/>This news was also transmitted to the powerful disciples of the six paths universe, the Heaven’s origin creation, at a terrifying speed.<br/><br/>When the six paths universe’s Heaven’s origin creation saw this news, their eyes focused, and their expressions were filled with coldness.<br/><br/>“Courting Death! ”<br/><br/>In the palace above the six treasure lands, two figures flew out and rushed towards the water source at a terrifying speed.<br/><br/>They flew above their six paths universe without any scruples.<br/><br/>This was something that the six paths universe’s Heaven’s origin creation masters could not tolerate!<br/><br/>They had to pay the price!<br/><br/>“Speed up and continue the chase! ”<br/><br/>Inside the Void Pagoda, Duke of Heaven’s Gate saw Wang Xian disappear once again, a gloomy expression appeared on his face. “We have to kill him within one to two hours. Otherwise, the powerhouses of the six paths universes might rush over. ”<br/><br/>“Alright! ”<br/><br/>Duke Xining also nodded heavily.<br/><br/>They were not afraid of the Heavenly Yuan creation realm experts from the six paths universe rushing over.<br/><br/>Even if they rushed over, they were confident that they could escape.<br/><br/>However, if they did that, the treasures in their hands would be used up.<br/><br/>Treasures like these that could escape were extremely precious to the Heavenly Yuan creation realm experts.<br/><br/>For each heavenly Yuan creation realm expert to have three to four of them, it was already a huge amount of accumulation.<br/><br/>Buzz! Buzz! Buzz<br/><br/>Boom! Boom! Boom<br/><br/>The Void Pagoda began to vibrate. Cracks began to appear in the surrounding space.<br/><br/>The Void Pagoda disappeared again. This time, the energy emitted by the Void Pagoda was even more terrifying.<br/><br/>The distance of teleportation was even further!<br/><br/>Three minutes later, Wang Xian was flying in front of him. When he sensed something again, his expression changed slightly. “Why did my speed increase so fast again? This is bad!” Wang Xian frowned.<br/><br/>Before the Void Pagoda arrived, he could only teleport again!<br/><br/>Buzz<br/><br/>After he disappeared, the Void Pagoda appeared.<br/><br/>“HMPH, can you escape?”<br/><br/>Inside the Void Pagoda, the two country overlords of the Void Universe had cold expressions on their faces.<br/><br/>Their gazes were fixed in one direction. The Void Pagoda continued to chase after them!<br/><br/>“This won’t do. I Can’t perform the transformation of the Netherworld Dragon<br/><br/>Anymore!”<br/><br/>When Wang Xian escaped again, he took a deep breath.<br/><br/>Next, he would have to rely on other methods!<br/><br/>He would have to rely on his own strength!<br/><br/>Buzz Buzz Buzz<br/><br/>Not long after, the warning sound on the empty text compass sounded again!<br/><br/>Wang Xian’s eyes focused as he continued to fly!<br/><br/>A few seconds later, the Void Pagoda appeared behind him!<br/><br/>“I’ve found that guy. This time, he didn’t manage to teleport away. It seems that this secret technique can not be used indefinitely!”<br/><br/>At the back, when Duke of Heaven’s Gate saw Wang Xian’s figure appearing in his line of sight, his eyes lit up as he shouted in a stern voice!<br/><br/>“Attack directly! ”<br/><br/>Duke Xining also let out a low growl as his palm landed on the Void Pagoda!<br/><br/>Buzz<br/><br/>On the Void Pagoda, a terrifying spatial force was condensing!<br/><br/>Boom<br/><br/>Following that, a stream of spatial force blasted towards Wang Xian!<br/><br/>This terrifying speed and terrifying energy caused Wang Xian’s expression to change drastically!<br/><br/>(‘I can’t withstand it. I can’t withstand it at all!”<br/><br/>He growled in a low voice. His expression was extremely awkward!<br/><br/>Shadow Dragon Avatar! ”<br/><br/>When the power of space was about to land on Wang Xian, his body trembled slightly.<br/><br/>It was the Shadow Dragon clone of his law form!<br/><br/>The Shadow Dragon clone could allow him to dodge any attack.<br/><br/>Even if it was a fatal attack!<br/><br/>Boom<br/><br/>A terrifying sound was heard. The energy penetrated his body while Wang Xian appeared at the side.<br/><br/>His body moved and he flew forward with all his strength.<br/><br/>The power of space landed in the void in front of him, causing a huge crack in the void.<br/><br/>Looking from afar, it was abnormally terrifying!<br/><br/>“Damn it, I have mastered the level of Heaven’s origin creation. With this great killing weapon, I am no match for him at all.”<br/><br/>Wang Xian’s expression changed slightly when he saw this energy!<br/><br/>He let out a low roar and immediately transformed into the body of a divine dragon. He flew directly into the ocean below!<br/><br/>After entering the ocean of water, Wang Xian swayed his gigantic divine dragon form and flew rapidly.<br/><br/>“The Divine Dragon race from the nine-origin universe, damn it! ”<br/><br/>When Duke Xining saw Wang Xian dodging their first attack, his expression did not change at all. With a cold expression, he continued to pour energy into the Void Pagoda!<br/><br/>Buzz<br/><br/>Duke Tianmen, who was standing at the side, also moved his palm and sent waves of energy into the Void Pagoda!<br/><br/>Following that, terrifying spatial chains appeared around the Void Pagoda.<br/><br/>The spatial chains attacked Wang Xian’s body!<br/><br/>In addition, the same terrifying spatial force penetrated Wang Xian’s gigantic body!<br/><br/>“Boom!”<br/><br/>The spatial energy locked onto Wang Xian completely and penetrated him.<br/><br/>Wang Xian swayed his gigantic body to prevent his vital parts from being agitated!<br/><br/>In the next instant, the position of his tail was covered by the power of space.<br/><br/>A space storm instantly destroyed his tail completely!<br/><br/>Wang Xian’s body was instantly reduced by a quarter!<br/><br/>However, this was not the end. The chains instantly arrived around Wang Xian.<br/><br/>The chains formed by the power of space seemed to have sealed off the surrounding void.<br/><br/>All of a sudden, Wang Xian sensed that the space around him seemed to have frozen.<br/><br/>It was extremely difficult to move!<br/><br/>“Hualalala!”<br/><br/>The sound of the space chains rang out. One after another, the chains entered his body and wound around his body!<br/><br/>“How dare you harm the powerhouses of My Void Universe? Go To Hell! ”<br/><br/>When Duke of Heaven’s Gate saw this scene, he roared furiously with a murderous look on his face!<br/><br/>The space chain entered Wang Xian’s body and the dragon tail was instantly destroyed. Wang Xian took in a deep breath of cold air! The intense pain caused his face and body to tremble slightly!<br/><br/>“Boom!”<br/><br/>Wang Xian’s body trembled and broke his own body directly to prevent himself from being completely controlled by the space chain!<br/><br/>Wang Xian let out a low roar. A demonic flower that emitted a special dark light appeared at the location of his dragon horn.<br/><br/>The Dark Resurrection Lily!<br/><br/>The Resurrection Lily!<br/><br/>In an instant, his body was enveloped by a special energy.<br/><br/>The Dark Resurrection Lily above his head dimmed instantly.<br/><br/>The Resurrection Lily, the body retraced!<br/><br/>The part of the dragon tail that had disappeared.<br/><br/>The injuries that he had suffered in his body were instantly healed.<br/><br/>The Resurrection Lily. With Wang Xian’s current strength, he could retrace nine seconds back..\t\t\t\t\t\t</div>", "images": {}, "success": true}