{"id": 1116, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074192.html", "title": "Chapter 4118 - Chapter 4118: 4117 Pursued And Fled", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4118 - Chapter 4118: 4117 Pursued And Fled</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4118: 4117 pursued and fled<br/><br/>Translator: 549690339<br/><br/>“Damn it, Stop! ”<br/><br/>“Kill him! ”<br/><br/>The five heaven origin creator powerhouses from the Void Universe had just flown over when they saw Wang Xian and the rest killing the light figures.<br/><br/>The expressions of the Heaven’s Gate Duke and the rest changed drastically as they roared loudly!<br/><br/>Spatial attribute powerhouses, their speed is really terrifying! ”<br/><br/>When Wang Xian sensed the five spatial attribute powerhouses charging over, his expression changed drastically as well!<br/><br/>The five space-type powerhouses were practically invincible to Wang Xian and the rest.<br/><br/>In particular, Wang Xian sensed that among the five space-type powerhouses, two of them were much stronger than them.<br/><br/>Undoubtedly, they were at the control level!<br/><br/>Wang Xian waved his arm and kept the body of the light shadow.<br/><br/>It was a body at the heaven-origin creation level. Although it was not his core strength, most of the energy was instantly absorbed by the treasure that he had resurrected!<br/><br/>However, the energy contained in this body was comparable to the limbs of the origin that were chopped off by the Asgardian devil God!<br/><br/>This was an absolute treasure!<br/><br/>Wang Xian shouted in a low voice and shouted at the Linniu!<br/><br/>The LINNIU didn’t hesitate and entered the mother nest directly!<br/><br/>Wang Xian kept the five elements millstone and took out a space scroll!<br/><br/>This escape scroll was obtained from the Void Pagoda!<br/><br/>The space scroll could allow him to teleport for a very long distance!<br/><br/>Originally, he could use this space scroll three times. However, he had used it twice in the starry universe. There was only one last time!<br/><br/>Buzz<br/><br/>When Wang Xian took out the space scroll, he instantly escaped!<br/><br/>“This is a treasure of our void universe, a treasure that can allow one to escape in an instant! ”<br/><br/>“Why does he have a treasure of Our Void Universe? Chase him, we can’t let him escape! ”<br/><br/>Wang Xian’s figure instantly disappeared.<br/><br/>When the Duke of Heaven’s Gate and the rest flew over and saw this scene, their faces sank!<br/><br/>They scanned their surroundings and realized that the aura of the light shadow had completely disappeared.<br/><br/>He had been completely killed!<br/><br/>“That figure’s appearance just now should be that of a divine dragon from the nine-origin universe. He really is a fellow from the nine-origin Universe! ” Duke Xining said with a gloomy face.<br/><br/>“Give chase. Just now, he used a treasure to escape, but that teleportation treasure is our void Space’s spatial scroll. The teleportation distance of the spatial scroll is limited, so we can chase after him! ”<br/><br/>(‘We must kill him!”<br/><br/>The Duke of Heaven’s Gate looked at them and said!<br/><br/>The others nodded their heads. Their bodies moved and instantly chased in the direction where Wang Xian was escaping!<br/><br/>Buzz<br/><br/>Wang Xian’s figure appeared not far from the battle just now. He checked the spatial compass and found that it could not detect any powerhouses from the void universe.<br/><br/>He looked ahead and moved his body. Numerous ghost avatars appeared one after another.<br/><br/>They flew towards the surroundings in an instant.<br/><br/>At the same time, Wang Xian also flew forward!<br/><br/>During the flight, once the ghost avatars reached the limit of their distance and returned automatically, Wang Xian would release them again.<br/><br/>This was to prevent him from being completely surrounded and unable to escape!<br/><br/>Buzz Buzz<br/><br/>When Wang Xian was flying for ten minutes, the sound of a notification came from the skywriting compass again.<br/><br/>When he saw the message on it, his expression changed slightly again!<br/><br/>“The other party has a treasure that can detect and lock onto him from a long distance. It will be difficult for him to escape. ”<br/><br/>Wang Xian’s heart sank as he thought to himself!<br/><br/>The distance shown on the skywriting compass was approaching at a terrifying speed!<br/><br/>When the distance reached a certain point, Wang Xian’s body trembled!<br/><br/>“Netherdragon Transformation! ”<br/><br/>His body trembled slightly before he disappeared. He appeared on the right side of a netherspirit clone and replaced it!<br/><br/>Following that, the Skypeace Compass’s prompt disappeared!<br/><br/>“HMM? His position suddenly shifted from the front to the front right. He must have sensed our arrival. The investigative treasure in his hand can detect our approach! ”<br/><br/>The Heaven Peace Palace looked at the spatial pointer in his hand and realized that Wang Xian’s position was changing rapidly. They immediately spoke up!<br/><br/>“To teleport a considerable distance in an instant, it must either be a special secret technique or a treasure. It is impossible for secret techniques and treasures to be used without restrictions. Continue the pursuit! ”<br/><br/>Duke Xining said loudly!<br/><br/>Duke of Heaven’s Gate nodded. They changed their direction and chased after them at a rapid speed!<br/><br/>At the position behind him, the other three powerhouses in the Heaven’s origin realm could not keep up with their speed!<br/><br/>After all, Duke of Heaven’s Gate and Duke of Xining were powerhouses in the Heaven’s origin realm who were at the control level.<br/><br/>They were much stronger than them when it came to the use of spatial energy and their strength.<br/><br/>Even under the suppression of the six universes.<br/><br/>The two of them were giving chase at a rapid speed ahead!<br/><br/>Wang Xian was fleeing even faster ahead.<br/><br/>However, after flying for an hour, a notification came from the skywriting compass again.<br/><br/>“What a fast speed, catching up in an hour! ”<br/><br/>When Wang Xian saw that he was caught up again, his expression changed slightly. He took a deep breath and sensed the information on the skywriting compass.<br/><br/>Buzz<br/><br/>When he sensed that the experts from the Void universe were about to arrive, Wang Xian used the ability of the Netherworld Dragon transformation again and instantly pulled away from them.<br/><br/>Duke of Heaven’s Gate, who was chasing from behind, was slightly stunned when he saw the change in the direction of the spatial needle.<br/><br/>“On the left, he discovered us again and escaped! ”<br/><br/>Duke of Heaven’s Gate said loudly as he changed his direction and continued his pursuit!<br/><br/>(‘I want to see how long he can escape! ”<br/><br/>When Duke Xining saw this scene, his eyes focused as he shouted loudly!<br/><br/>Another pursuit!<br/><br/>Wang Xian escaped once again!<br/><br/>An hour later, the skywriting compass sensed the experts from the void universe again.<br/><br/>“This won’t do. I have to go to a tribe and escape quickly through the teleportation formation of the tribe! ”<br/><br/>When Wang Xian saw that he was about to be caught up again, he thought to himself!<br/><br/>He transformed again and increased the distance between them. Then, he flew towards the location of a water tribe!<br/><br/>As long as he entered a tribe and used the teleportation formation to teleport over a long distance, he would be able to completely increase the distance between him and the experts in the Void universe.<br/><br/>“He escaped again. This shouldn’t be a treasure for escaping. It should be an ability that he has mastered. He has easily teleported several times. This teleportation of his might not require him to bear any price. ”<br/><br/>When Duke of Heaven’s Gate saw Wang Xian pulling away again, his expression changed slightly as he spoke in a deep voice!<br/><br/>Duke Xining’s expression changed as well. He gritted his teeth and said, “Why don’t we use the Void Pagoda to chase after him?”<br/><br/>“The energy fluctuation of the Void Pagoda is too great and its size is too big. It might attract the strong cultivators of the Heaven’s origin creation realm from the six paths universe! ”<br/><br/>Upon hearing this, Duke of Heaven’s Gate took a deep breath and hesitated for a moment, he gritted his teeth and said, “Alright, there are many heavenly yuan destiny realm powerhouses that have entered the six paths universe. There are only three heavenly yuan destiny realm powerhouses in the six paths universe, and there are no tribes nearby. We can use the Void Pagoda!”<br/><br/>“Alright, let’s chase after him and destroy him! ”<br/><br/>Duke Xining’s gaze froze and revealed a cold expression\t\t\t\t\t\t</div>", "images": {}, "success": true}