{"id": 1125, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074226.html", "title": "Chapter 4128 - Chapter 4128: 4127 You Were Born To Stand At The Top Of All Living Things", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4128 - Chapter 4128: 4127 You Were Born To Stand At The Top Of All Living Things</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4128: 4127 you were born to stand at the top of all living things<br/><br/>Translator: 549690339<br/><br/>The resources in this corpse of the dark-attributed Tianyuan creation had exceeded Wang Xian’s expectations.<br/><br/>Now, the Tai Chi Dragon Plate had already reached the pinnacle of the universe.<br/><br/>There was still a long way to go before he could make a breakthrough!<br/><br/>It was even very difficult to make a breakthrough.<br/><br/>The reason why the five elements grinding could make a breakthrough was because he had absorbed the god of elements.<br/><br/>The god of elements fragment was an existence comparable to the Heaven’s origin creation in the chaos.<br/><br/>Under such circumstances, the Five Elements Millstone was able to complete the breakthrough.<br/><br/>As for the Tai Chi Dragon Disc, it was also able to break through through by absorbing treasures of this level.<br/><br/>The Tai Chi Dragon Disc and the five elements millstone were able to break through without shackles.<br/><br/>It was because of these two treasures. One of the treasures was forged with the five elements origin as the foundation, with the Five Elements Dragon Soul as the core.<br/><br/>The breakthrough was achieved through continuous devouring and strengthening!<br/><br/>The Tai Chi Dragon Disc was achieved through the heart of Light and darkness and the yin-yang Dragon Soul as the core!<br/><br/>This was especially so for the five elements millstone. When it was being nurtured in Wang Xian’s body, it had also absorbed the energy of the ancestral tree.<br/><br/>This was the reason why the five elements Millstone was able to achieve a breakthrough easily.<br/><br/>It was extremely difficult for any object to reach the level of Heaven’s fate.<br/><br/>However, the Five Elements Millstone and the Tai Chi Dragon Disc were somewhat special.<br/><br/>They were originally the core of the two top-tier Dragon Kings, the Five Elements Dragon King and the light and Dark Dragon King.<br/><br/>There was an extremely pure dark energy source in this corpse. The tai chi dragon disc could absorb it quickly.<br/><br/>“These resources might have improved the Tai Chi Dragon Disc. ”<br/><br/>Wang Xian looked at all the resources and his eyes glowed. He immediately placed the Tai Chi Dragon disc in the mother nest and allowed it to absorb these resources.<br/><br/>In addition, this corpse could be said to be an extremely pure energy.<br/><br/>This energy could even be absorbed by Wang Xian and allow him to quickly recover from the injuries in his body.<br/><br/>However, it was too extravagant to use the corpse of a heaven’s origin creator to recover from his injuries.<br/><br/>Wang Xian was not extravagant to such an extent.<br/><br/>“After absorbing all these treasures, if the Taiji dragon plate can not make a breakthrough, I should be able to absorb the energy from this corpse! ” Wang Xian calculated in his heart and looked forward to it.<br/><br/>If he could really achieve a breakthrough, it would be a huge improvement to his strength.<br/><br/>However, he was not 100% confident!<br/><br/>The resources in the corpse were a huge surprise to Wang Xian.<br/><br/>He sat cross-legged on the bed and continued to recover from his injuries.<br/><br/>With some of the resources from the Unicorn Ox, Wang Xian’s recovery time could be shortened significantly.<br/><br/>Time passed day by day.<br/><br/>Tianci came to his place to sleep every night.<br/><br/>The ancestral tree was constantly diverting some energy to nourish the ultimate treasure of Tianyuan in his body and establish a connection with it.<br/><br/>Occasionally, Wang Xian would play with Tianci for a while!<br/><br/>In the blink of an eye, another half a year had passed!<br/><br/>“SOB, SOB, SOB, sob!”<br/><br/>“SOB, SOB, SOB, sob!”<br/><br/>On this day, Wang Xian was still recovering from his injuries.<br/><br/>Suddenly, the sound of crying came from the side, causing him to open his eyes slightly!<br/><br/>Wang Xian opened his eyes and looked at tianci who was at the side. When he saw him sobbing continuously, a smile appeared on his face.<br/><br/>“Tianci, what’s Wrong?”<br/><br/>Wang Xian asked him curiously.<br/><br/>“Uncle, I’m too stupid!”<br/><br/>When Tianci saw Wang Xian, he couldn’t help but hug him and continue crying.<br/><br/>“Stupid? How can that be? Tianci, you are very smart and very powerful. How Can You Be Stupid?”<br/><br/>Wang Xian patted his head and comforted him with a smile.<br/><br/>(‘I am very stupid. Grandpa also said that I’m stupid. He said that other people’s children only need a few days to enter the beginner’s level of cultivation while I need a few months to enter the beginner’s level. ”<br/><br/>“He said that Pm destined to be a weakling in the future and that I’m destined to be a grain of sand in the upcoming crisis. ”<br/><br/>Tianci raised his head and said to Wang Xian with an aggrieved expression!<br/><br/>“Beginner level of cultivation?”<br/><br/>Wang Xian was slightly stunned when he heard his words.<br/><br/>He sensed Tianci’s body.<br/><br/>He could feel that there was a water-elemental energy in TIANCPs body.<br/><br/>This water-elemental energy was extremely weak. It had not even reached the level of a god.<br/><br/>For children born to top-notch experts, the beginner level was the level of a God who had ignited the divine fire.<br/><br/>In the Mu Li tribe, some children with good talent could enter the entry level in a few days.<br/><br/>On the other hand, tianci needed a few months to enter the entry level from the beginning of his cultivation.<br/><br/>In the eyes of some powerhouses, this talent was too trashy!<br/><br/>“It’s a little funny! ”<br/><br/>Wang Xian looked at tianci and listened to the aggrieved words that he kept saying. He felt that it was a little funny!<br/><br/>Mu Li’s body had the wood-attributed Heaven’s origin creation treasure.<br/><br/>Naturally, it was much slower to absorb the energy of the water attribute.<br/><br/>This was especially so for this wood-type heavenly Yuan creation treasure, which had just begun to be born.<br/><br/>If a person who shared the same fate as a heavenly yuan creation treasure cultivated slowly, then no one in the world would be faster than him!<br/><br/>It could be said that the beginning of Heaven’s gift was the end point that billions of living beings could not reach.<br/><br/>Even the heavenly yuan creation experts were envious of Heaven’s Gift’s beginning.<br/><br/>Even if he didn’t cultivate, the wood element Heaven’s origin treasure in his body could absorb energy and grow to a terrifying level.<br/><br/>At this level, even a beginner-level Heaven’s origin powerhouse wouldn’t be a match for him!<br/><br/>“It’s a pity that Heaven’s gift is on the wrong path now.” Wang Xian thought to himself.<br/><br/>However, he couldn’t blame Heaven’s Gift’s grandfather.<br/><br/>The six paths universe was different from the nine-origin universe.<br/><br/>In the six paths universe, after a baby was born, he could cultivate any attribute.<br/><br/>Of course, under normal circumstances, it was best to cultivate the attribute that his parents cultivated. This way, his talent would be better.<br/><br/>As for other things, for example, some people couldn’t cultivate the fire attribute or the water attribute. This wasn’t the case.<br/><br/>Tianci’s grandfather was a ruler of the universe. However, the ultimate treasure of Tianyuan was not something that he could understand.<br/><br/>Furthermore, this ultimate treasure of Tianyuan had just been born, so it instinctively hid itself.<br/><br/>If it was not the Tianyuan attribute, it would be difficult to discover the situation inside his body.<br/><br/>That was why it was said that Tianci’s talent was very, very poor and it was hard for him to achieve anything in his life!<br/><br/>(‘I can’t let him take the wrong path. ”<br/><br/>Wang Xian looked at tianci and patted his head. “Tianci, you are not stupid at all. You were born to stand at the top of all living things! ”<br/><br/>“Your future will be something that no one dares to imagine. It is also something that your grandfather will never be able to achieve. ”<br/><br/>As he spoke, he looked at Tianci who was beside him. “Do you understand?”<br/><br/>“Uncle, I understand a little. Am I really not stupid?”<br/><br/>Tianci looked at Wang Xian and asked expectantly.<br/><br/>“Of course. The water attribute that your grandfather taught you is not suitable for you. I will teach you the method to cultivate the wood attribute.”<br/><br/>Wang Xian said to tianci.<br/><br/>“The method to cultivate the wood attribute?”<br/><br/>Tianci looked at Wang Xian with doubt.<br/><br/>“Yes, it is similar to the cultivation of the water attribute. I will teach you the basics. Try Again!”<br/><br/>Wang Xian said to Tianci as a stream of information entered his mind..\t\t\t\t\t\t</div>", "images": {}, "success": true}