{"id": 1129, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074242.html", "title": "Chapter 4132 - Chapter 4132: 4131 Six Paths Of The Universe", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4132 - Chapter 4132: 4131 Six Paths Of The Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4132: 4131 six paths of the universe<br/><br/>Translator: 549690339<br/><br/>“Thank you, foster father. ”<br/><br/>Tianci’s eyes lit up when he saw the Unicorn Ox.<br/><br/>The shape of the unicorn ox had changed slightly. Its body looked a little domineering and also a little dashing.<br/><br/>It was only half a meter in size and looked more like a pet.<br/><br/>However, Tianci also knew that the strength of the Unicorn ox was definitely not weak.<br/><br/>These hundred years, Tianci and Wang Xian live together, although do not know the specific strength of Wang Xian.<br/><br/>But I can also guess that Wang Xian’s strength is definitely not simple!<br/><br/>For example, Wang Xian blocked his own body of wood attribute energy, even his grandfather, also can not find!<br/><br/>“Father, what is the identity of this Wang Xian? Is there any problem with him being the Godfather?”<br/><br/>Tianci’s birthday party was going on at a location not too far away.<br/><br/>One of Mu Liyin’s older brothers saw that Tianci had such a good relationship with Wang Xian and asked his father in a low voice.<br/><br/>(‘We don’t know his exact identity yet. However, tianci is indeed very close to him. He is even closer to him than your sister.”<br/><br/>The middle-aged man swept a glance at Wang Xian and shook his head. “Over the past hundred years, he has treated Tianci quite well. He has also taught Tianci some things. Currently, it isn’t a bad thing.”<br/><br/>“However, he seems to be a little withdrawn. He has been staying in his room to treat his injuries. His internal injuries are very serious. ”<br/><br/>A few young men at the side nodded their heads. They walked over and exchanged a few words with Wang Xian.<br/><br/>Wang Xian responded politely as well.<br/><br/>Tianci’s birthday passed very quickly. A few days later, TIANCI entered the academy to study!<br/><br/>Mu Liyin ‘er lived in the center of the Mu Li tribe.<br/><br/>The location of the Academy was also in the center.<br/><br/>Although Tianci went to school outside every day, he would come back every day!<br/><br/>After tianci came back, he often talked to Wang Xian and his mother about the matters in the academy.<br/><br/>As time passed, Wang Xian and Mu Liyin ‘er became familiar with each other.<br/><br/>Wang Xian, who had been staying in the courtyard, was also ordered by Tianci to go out and have a meal with his mother.<br/><br/>Time passed quickly. A hundred thousand years had passed in a flash!<br/><br/>“I’ve been in seclusion for more than ten thousand years. The Tai Chi Dragon Plate has devoured all the resources and the corpse of that corpse, but it still hasn’t made a breakthrough! ”<br/><br/>Wang Xian looked at the tai chi dragon plate in front of him and a helpless expression appeared on his face.<br/><br/>The difficulty of making a breakthrough in the Tai Chi Dragon Plate was somewhat beyond Wang Xian’s imagination.<br/><br/>According to his estimation, he should be able to break through after absorbing the corpse of a heaven’s origin creator and absorbing so much darkness attribute energy and treasures.<br/><br/>However, he was still unable to break through!<br/><br/>“The reason why the Five Elements Millstone was able to break through so easily last time is probably related to the ancestral tree. The five elements millstone contains wood attribute energy and can absorb the energy of the ancestral tree. ”<br/><br/>“Basically, it can be said that the five elements millstone and the ancestral tree grew together. ”<br/><br/>Wang Xian thought to himself.<br/><br/>The five elements millstone and the ancestral tree grew together. The ancestral tree, as an ultimate treasure of the Heaven’s origin creation, must have a special energy.<br/><br/>Under the nourishment of this energy over a long period of time, the shackles of the five elements millstone breaking through were reduced by a lot.<br/><br/>The Tai Chi Dragon Disc couldn’t do it.<br/><br/>Even though he had absorbed so many treasures, Wang Xian could still feel that there was a threshold that blocked him.<br/><br/>This threshold was not easy to break through.<br/><br/>He might need more resources and treasures.<br/><br/>Shaking his head, Wang Xian sensed his body.<br/><br/>After 100,000 years, his injuries had recovered a little.<br/><br/>Now, he could also erupt with the strength of a first level universe dominator.<br/><br/>It would take him hundreds of millions of years to fully recover.<br/><br/>This was even after Wang Xian had absorbed a large number of treasures.<br/><br/>“Send a message to tianci! ”<br/><br/>Ten thousand years ago, Wang Xian had started his seclusion and informed<br/><br/>Tianci at that time.<br/><br/>On the communicator, Tianci had sent him a lot of messages.<br/><br/>He replied.<br/><br/>Speaking of which, tianci could be considered half of his biological son!<br/><br/>Buzz Buzz<br/><br/>Soon, a message came from Tianci.<br/><br/>When Wang Xian saw it, he immediately replied!<br/><br/>“Young master Wang Xian, I heard from Tianci that your seclusion has ended! ”<br/><br/>Not long after, Mu Liyin’s voice came from outside.<br/><br/>Wang Xian got up and opened the door.<br/><br/>“Yes, it just ended.”<br/><br/>Wang Xian smiled and nodded at Mu Liyin. Then, he looked at the message on his communication device.<br/><br/>“Tianci said that he wants us to go to the snow flower house for a meal. Let’s<br/><br/>GO!<br/><br/>He continued to speak!<br/><br/>“HMM, how long will it take for Wang Xian to fully recover from his injuries?” Mu Liyin ‘er nodded and asked with concern.<br/><br/>“It will take at least a hundred million years for him to fully recover. The injuries he sustained last time were very serious.”<br/><br/>Wang Xian answered truthfully.<br/><br/>“100 million years for you to fully recover your injuries. It seems that you are very strong, young master Wang Xian. You should have reached the realm of the universe’s ruler.”<br/><br/>Mu Liyin ‘er said with slight astonishment!<br/><br/>“Yes, I have reached it.”<br/><br/>Wang Xian nodded with a smile.<br/><br/>“You are really amazing. Young master Wang Xian, you don’t seem to be very old either. ”<br/><br/>Mu Liyin ‘er said in surprise.<br/><br/>To be able to reach the level of a universe dominator, he was already considered an expert in the six paths of the universe.<br/><br/>His father had the strength of a level five universe dominator. In the Mu Li tribe, he was also someone at the level of a deacon!<br/><br/>The strongest person in the Mu Li tribe was only at the level eight of a universe dominator.<br/><br/>“He’s not young anymore. I haven’t seen Tianci for 10,000 years. I wonder how he has changed. ”<br/><br/>Wang Xian chatted with Mu Li Yin ‘er as they flew towards the outside.<br/><br/>Soon, they arrived at the bustling area of the Mu Li tribe.<br/><br/>There were people coming and going on the streets. There were shops on both sides.<br/><br/>“Mother, Foster Father! ”<br/><br/>When they arrived at the snow flower house, the handsome and extraordinary Tianci immediately shouted when he saw them!<br/><br/>Wang Xian looked over. Compared to 10 ,ooo years ago, Tianci’s appearance had not changed much.<br/><br/>However, his strength had already reached the level of the void God Emperor.<br/><br/>Of course, this was the strength of the wood attribute.<br/><br/>As for his water attribute strength, it was only at the first level of the Immortal King Realm.<br/><br/>Even if this realm was placed in the Mu Li tribe, it would still be top-notch!<br/><br/>Beside him, Lin Niu was sprawled on the ground. When he saw Wang Xian, he immediately called out to him through voice transmission. “You’ve improved very quickly. Let’s spar after dinner.”<br/><br/>Wang Xian looked at tianci and said with a smile.<br/><br/>“Good, foster father. I’m very strong now. No one is my match in our Beginner<br/><br/>Academy. ”<br/><br/>Tianci raised his head slightly and said proudly.<br/><br/>“Tianci, don’t be arrogant.”<br/><br/>Mu Liyin ‘er walked over and said to him. Then, she looked at Wang Xian and said, “Teach this kid a lesson later. Don’t let him get too arrogant.”<br/><br/>“No, Mom. Godfather will really make me suffer.” Tianci heard her and shouted loudly.<br/><br/>This made Wang Xian and Mu Liyin ‘er smile.<br/><br/>“Godfather, you have been in seclusion for too long. You Won’t be in seclusion anymore, right?”<br/><br/>Tianci moved out a chair for Wang Xian and Mu Liyin ‘er to sit down. Then, he asked him.<br/><br/>“Well, I don’t think that’s going to happen. ”<br/><br/>Wang Xian shook his head..\t\t\t\t\t\t</div>", "images": {}, "success": true}