{"id": 1123, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074218.html", "title": "Chapter 4126 - Chapter 4126: 4125. A Tender Bud", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4126 - Chapter 4126: 4125. A Tender Bud</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4126: 4125. A tender bud<br/><br/>Translator: 549690339<br/><br/>Tianci peeked through the crack of the door and looked at Wang Xian. He called out with a smile on his face.<br/><br/>“Come in! ”<br/><br/>Wang Xian looked at this little guy and smiled.<br/><br/>He looked at the time.<br/><br/>This was the tenth day since Tianci was born.<br/><br/>In the past ten days, his body had not changed at all. He was still 70 to 80 centimeters tall and chubby.<br/><br/>When he heard Wang Xian’s words, he immediately ran over with a smile on his face!<br/><br/>“Uncle, I feel the most comfortable when Pm with you. Mom keeps making me learn to read!”<br/><br/>Tianci walked over and sat beside him. He hugged Wang Xian’s arm and spoke! “Hehe, your mother is doing this for your own good. ”<br/><br/>Wang Xian smiled and stroked his head. A surge of energy entered his body.<br/><br/>Instantly, the ancestral tree in his body started to stir.<br/><br/>In his palm, a branch entered TIANCPs body!<br/><br/>In TIANCPs body, the wood-attributed ultimate treasure of Tianyuan was still in the form of a tender bud.<br/><br/>This tender bud seemed to be very excited when it sensed the aura of the ancestral tree. It let the branch coil around it.<br/><br/>The wood-attributed energy, which was of the same wood attribute but with different attributes, slowly fused together!<br/><br/>“Uncle, the aura on your body is so comfortable. It’s even more comfortable than my mother’s. Can you take me out to play?”<br/><br/>Tianci held Wang Xian and continued to speak to him!<br/><br/>“HMM? You can go out, but we have to play at the entrance. ”<br/><br/>Wang Xian looked at him and said with a smile<br/><br/>At the same time, he was also sensing the Heaven’s origin creation treasure in Tianci’s body!<br/><br/>Because he was in a tender state, the characteristics of this Heaven’s origin creation treasure had yet to be revealed!<br/><br/>He could sense that the ancestral tree was injecting pure wood attribute energy into the tender bud.<br/><br/>The ancestral tree did not directly circulate the energy like the first time. Instead, it was absorbing it back.<br/><br/>This was pure feedback!<br/><br/>It was simply injecting energy into the tender bud.<br/><br/>The tender bud was obviously very excited as it was absorbing the ancestral tree’s energy.<br/><br/>The amount of energy it could absorb was only a drop in the bucket compared to the energy contained in the ancestral tree!<br/><br/>It was as if the ancestral tree was improving the tender bud!<br/><br/>Wang Xian didn’t stop it. The ancestral tree must have its own plans for doing so.<br/><br/>“The position at the entrance isn’t fun at all. Mom doesn’t allow me to go too far!<br/><br/>Tianci, who was born ten days ago, not only spoke clearly, but his IQwas also comparable to a five or six-year-old child.<br/><br/>Although he was a little displeased, he still dragged Wang Xian to the position outside.<br/><br/>“It’s all raining. There’s nothing fun about it! ”<br/><br/>Wang Xian brought him to the entrance of the courtyard. Tianci looked around and shook his head.<br/><br/>Wang Xian swept his gaze across the place. This place belonged to a tribe and the surroundings were all small courtyards like this one.<br/><br/>Occasionally, he could see some people looking in his direction. When they saw Wang Xian, they revealed curious expressions on their faces.<br/><br/>“It’s not fun! ”<br/><br/>Tianci raised his head and looked at Wang Xian. He continued, “Uncle, can you bring me somewhere far away to play?”<br/><br/>“I can’t do it without your mother’s permission! ”<br/><br/>Wang Xian shook his head. Following that, he waved his arm and branches appeared out of thin air around them.<br/><br/>These tree branches quickly turned into a playground!<br/><br/>There were all kinds of toys and facilities for children to play in.<br/><br/>“Wow, uncle, what is this?”<br/><br/>Tianci exclaimed when he saw the changes in front of him.<br/><br/>“This is just a small ability. You will be able to do it in the future. Go ahead and play!<br/><br/>Wang Xian smiled at him and said!<br/><br/>“MMM, there are swaying trees over there. It looks so fun!”<br/><br/>After all, Tianci was a child who had not seen much of the world and did not have much intelligence.<br/><br/>He ran over excitedly and started playing.<br/><br/>Putting everything else aside, the toys that Wang Xian made were something that the six paths universe did not have!<br/><br/>These playgrounds were similar to the children’s amusement parks on Earth.<br/><br/>Even an adult would feel a little curious when they saw them!<br/><br/>As a child, he naturally couldn’t resist it! “Uncle, come over, let’s play together! ”<br/><br/>Tianci shouted and waved at Wang Xian!<br/><br/>“You Child, you love to play. Don’t disturb your uncle! ”<br/><br/>At this moment, Tianci’s mother, Mu Liyin, walked out and said to tianci! She had a kind look on her face as she sized up this special away game before looking at Wang Xian. “Tianci didn’t disturb you, did he?”<br/><br/>Mu Liyin’er asked!<br/><br/>“No, tianci is very cute. Moreover, both of you are my saviors. This is nothing. ” Wang Xian shook his head at Mu Liyin’er and said with a smile!<br/><br/>“Hehe, it’s fate between you and Tianci. Speaking of which, he is unusually close to you. When we first spoke, he said that he wanted to look for his uncle when he just learned a few things. ”<br/><br/>Mu Liyin c er spoke with a slightly helpless expression.<br/><br/>She felt that her son seemed to like Wang Xian very much and kept saying that he wanted to look for his uncle.<br/><br/>Wang Xian smiled when he heard that.<br/><br/>The reason why Tianci was close to him was due to the mutual attraction between the ultimate treasures of the Heaven’s origin.<br/><br/>Both of them were of the wood attribute and could be considered as the origin!<br/><br/>“Oh right, What’s Your Name? are your injuries better?”<br/><br/>Mu Liyin ‘er looked at Wang Xian and asked!<br/><br/>“You can just call me Wang Xian. My injuries are still alright. Sorry for disturbing you during this period of time. I will be leaving after a period of time. ”<br/><br/>Wang Xian nodded and said with a smile.<br/><br/>“That’s not what I meant. Since Tianci likes you so much, it would be better for you to stay here for a little longer. You can talk about it after your injuries are completely healed. ”<br/><br/>Mu Liyin ‘er shook her head and explained!<br/><br/>Okay!<br/><br/>Wang Xian nodded his head.<br/><br/>He was just saying. He wouldn’t leave even if he was told to.<br/><br/>From TIANCI, Wang Xian had a premonition that he would be able to obtain some benefits.<br/><br/>“Mom, come over. Come and play with us! ”<br/><br/>At this moment, Tianci’s shouts continued to ring out.<br/><br/>Mu Liyin ‘er felt a little helpless. However, she still walked over with a smile.<br/><br/>Wang Xian looked at tianci, and his eyes flickered slightly.<br/><br/>Among these wood-elemental branches, there were branches of the ancestral tree.<br/><br/>With tianci here, it was equivalent to being close to the ancestral tree at all times!<br/><br/>The Ultimate Treasure of Tianyuan in his body was also equivalent to absorbing the energy of the ancestral tree at all times to grow.<br/><br/>“Hey, by the way, which tribe are you from? Why are you so heavily injured<br/><br/>this time?”<br/><br/>Mu Liyin ‘er’s maid walked over from the side and asked Wang Xian.<br/><br/>“No tribe. I met a powerful elemental beast last time.”<br/><br/>Wang Xian looked at the maid and replied with a smile.<br/><br/>“No tribe? Then you can stay with us for a little longer. Our young master seems to like you very much! ”<br/><br/>The maid sized up Wang Xian and continued, “You look pretty good too.” Wang Xian smiled and asked, “Oh Yeah, why didn’t I see Tianci’s father?”<br/><br/>“HMM? Hey, don’t ask me that again, especially in front of our young master and Miss! ”<br/><br/>The maid suddenly warned Wang Xian in a low voice.<br/><br/>Wang Xian looked at her curiously!\t\t\t\t\t\t</div>", "images": {}, "success": true}