{"id": 1128, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074238.html", "title": "Chapter 4131 - Chapter 4131: Godfather 4130", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4131 - Chapter 4131: Godfather 4130</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4131: Godfather 4130<br/><br/>Translator: 549690339<br/><br/>Okay.<br/><br/>Tianci looked at Wang Xian, his eyes gleaming. “Uncle, Pll be leaving First! ”<br/><br/>“Let’s Go! ”<br/><br/>Wang Xian nodded at him and watched him leave.<br/><br/>Following that, Wang Xian’s mind stirred as he checked the condition of the ancestral tree.<br/><br/>Currently, there was a palm-sized branch on one of the branches of the main trunk of the ancestral tree.<br/><br/>This branch was filled with a sharp aura.<br/><br/>This branch came from the Divine Tree of Heaven’s origin creation in Tianci’s body.<br/><br/>The ancestral tree nurtured the divine tree of Heaven’s origin creation in Tianci’s body.<br/><br/>A few years ago, a branch was cut from it.<br/><br/>This branch had now grown to the point that it was no weaker than the Divine Tree of Heaven’s origin creation in Tianci’s body!<br/><br/>However, it was a cut from the divine tree of Heaven’s origin creation in Tianci’s body. It couldn’t be stronger than Tianci’s parent body.<br/><br/>However, as long as Tianci’s Heavenly Yuan creation true treasure didn’t resist the ancestral tree’s energy.<br/><br/>Then, the small branch on the ancestral tree had endless possibilities.<br/><br/>Of course, the ancestral tree didn’t forcefully take a screenshot of Tianci’s<br/><br/>Heavenly Yuan creation true treasure branch.<br/><br/>While it took it, it would give Tianci’s heavenly yuan creation true treasure energy.<br/><br/>It would also inject its own energy into his body.<br/><br/>This way, it would be of great benefit to the Heaven’s origin creation treasure in his body.<br/><br/>After all, both of them belonged to the Heaven’s origin creation level.<br/><br/>Both of them were of the wood attribute!<br/><br/>One of them belonged to the auxiliary attribute while the other belonged to the offensive attribute.<br/><br/>“Although this is not as good as directly obtaining this Heaven’s origin creation treasure, I can still obtain a lot of benefits.” Wang Xian smiled.<br/><br/>Wang Xian could still accept the current situation!<br/><br/>“Uncle, you’re here! ”<br/><br/>In the evening, Tianci’s voice sounded.<br/><br/>When Wang Xian heard it, he opened his eyes and walked out with a smile on his face.<br/><br/>In the courtyard, Mu Liyin c er had decorated it. It looked very beautiful.<br/><br/>Tianci’s grandparents and some people whom Wang Xian didn’t know.<br/><br/>There were more than ten of them in total, and there were a few young men and women among them!<br/><br/>“Young master Wang Xian, please sit here! ”<br/><br/>Mu Liyin ‘ER’s maid came up to him and said to Wang Xian.<br/><br/>Okay!<br/><br/>Wang Xian nodded his head.<br/><br/>In the courtyard, when the rest of the people saw Wang Xian, some of them had curious expressions on their faces.<br/><br/>Tianci walked over and held Wang Xian’s arm happily. He said in a low voice,<br/><br/>“Uncle, I beat that kid up this afternoon. He won’t dare to Scold Me Anymore! ” Alright.<br/><br/>Wang Xian smiled and patted his head. “In the future, if someone scolds you, you can challenge him. If you defeat him, he won’t dare to Scold You<br/><br/>Anymore!”<br/><br/>Tianci nodded his head and transmitted his voice to Wang Xian. “Hehe, uncle.<br/><br/>If I can use the wood attribute, I can defeat them with one finger. ”<br/><br/>“Keep a low profile. When the time comes, we will amaze everyone! ”<br/><br/>Wang Xian said with a smile!<br/><br/>Tianci nodded his head with a smile.<br/><br/>“Tianci is still on good terms with little brother as always!”<br/><br/>Mu Liyin’s father walked over from the side and said to Wang Xian with a smile!<br/><br/>“Maybe Little Tianci and I are fated.”<br/><br/>Wang Xian looked at the middle-aged man who was walking over and replied with a smile!<br/><br/>“Haha, it is indeed fated.”<br/><br/>The middle-aged man nodded with a smile.<br/><br/>“Tianci is too close to young master Wang Xian. As his mother, I’m a little jealous. However, I have to thank young master Wang Xian for teaching Tianci over the past hundred years. He has taught Tianci many things! ”<br/><br/>Mu Liyin’er also walked over and said with a smile!<br/><br/>She was indeed a little grateful to Wang Xian.<br/><br/>After all, Tianci didn’t have a father. Wang Xian was here to make up for the love of Tianci’s father.<br/><br/>Even though Wang Xian wasn’t Tianci’s father.<br/><br/>“Today is TIANCI’s birthday. You will be going to the Academy tomorrow. Do you have anything you want?”<br/><br/>The middle-aged man looked at tianci and asked with a smile.<br/><br/>Although he didn’t like the fact that Tianci was born, he was still his grandson.<br/><br/>Furthermore, the talent that he had displayed so far was very good. This made him accept this grandson who came out of nowhere.<br/><br/>“I don’t have a grandfather. I don’t have anything I need.”<br/><br/>Tianci thought for a moment and shook his head. He suddenly looked at his mother. “Mother, I do have a wish.” As he spoke, his eyes shone.<br/><br/>“Oh? Tianci, what is your wish?”<br/><br/>Mu Liyin’er smiled at Tianci and asked. “Then, mother, Will You Promise Me First?” Tianci continued to speak to Mu Liyin C er. “Okay, okay. You’re the oldest today. Pll Promise You Anything!”<br/><br/>Mu Liyin ‘er smiled and patted his head.<br/><br/>“Then let uncle be my father, okay?”<br/><br/>Tianci looked at Mu Liyin ‘er and said with anticipation!<br/><br/>His words made Mu Liyin ‘er slightly stunned, and then her face turned slightly red!<br/><br/>However, she quickly ran her fingers through her hair.<br/><br/>“Silly child, this doesn’t mean that I agree to it. If you want to take me as your uncle, you also need my permission. If I agree to it, I will naturally agree! ” Mu Liyin ‘er pointed at Tianci’s head!<br/><br/>“Uncle, can you do it? Can you do it? This way, you will be my father in the future and no one will criticize me! ”<br/><br/>Tianci looked at Wang Xian and asked happily!<br/><br/>Wang Xian looked at Tianci and then looked at Mu Liyin’er.<br/><br/>When he saw her nodding at him with a smile, Wang Xian nodded his head.<br/><br/>“Alright, Alright. In that case, you can call me foster father from now on. I have watched you grow up! ”<br/><br/>Wang Xian didn’t reject and nodded his head as well.<br/><br/>Tianci had watched him grow up.<br/><br/>It didn ‘t matter if Tianci was his foster father!<br/><br/>“That’s great! That’s Great! ”<br/><br/>Tianci shouted happily!<br/><br/>“Tianci, when you go to school in the future and we are not around, I will get an uncle to follow you. He is my younger brother! ”<br/><br/>Wang Xian looked at tianci and transmitted his voice to him.<br/><br/>He didn’t say it out loud!<br/><br/>Following that, Wang Xian waved his arm and the unicorn ox appeared at the side!<br/><br/>In the past, tianci would be able to sense Wang Xian and the rest and wouldn’t encounter any danger.<br/><br/>Now that he was about to go to school, Wang Xian got the unicorn ox to follow Tianci just in case.<br/><br/>In addition, Tianci had the strength of a peak immortal godly king.<br/><br/>The Ultimate Treasure of Tianyuan in his body had been greatly improved.<br/><br/>Two more branches with concealed energy had grown.<br/><br/>One could be used to hide the Lin Niu.<br/><br/>Wang Xian had one too!<br/><br/>The last one was naturally to hide his own condition.<br/><br/>“woo woo! ”<br/><br/>After the Lin Niu appeared, he let out a low growl. His gaze was slightly heated as he stared at tianci.<br/><br/>He knew Tianci very well.<br/><br/>This was a heavenly yuan destiny treasure that had just been born.<br/><br/>Lin Niu followed by his side. With the growth of the Heavenly Yuan Destiny Treasure, Lin Niu was also able to absorb some of the Heavenly Yuan Destiny<br/><br/>Treasure’s energy and aura.<br/><br/>From there, he could obtain many benefits.<br/><br/>Even if he had to be Tianci’s mount for a period of time, he would be happy!\t\t\t\t\t\t</div>", "images": {}, "success": true}