{"id": 1126, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074230.html", "title": "Chapter 4129 - Chapter 4129: 4128 Demonic Cultivation Speed", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4129 - Chapter 4129: 4128 Demonic Cultivation Speed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4129: 4128 demonic cultivation speed<br/><br/>Translator: 549690339<br/><br/>The wood attribute cultivation method entered TIANCI’s mind.<br/><br/>Tianci looked at Wang Xian, his little face filled with doubt!<br/><br/>Wang Xian smiled at him and gestured for Tianci to sit cross-legged.<br/><br/>Then, he began to cultivate.<br/><br/>Tianci was already seven to eight months old.<br/><br/>If it was on Earth, his IQwas already comparable to that of an eight or nine-year-old child.<br/><br/>In fact, his knowledge was much more than that of an eight or nine-year-old child on Earth.<br/><br/>Tianci sat down cross-legged. When he circulated the wood attribute cultivation technique, waves of energy immediately surged into his body. Even though this was a water source, the wood attribute was relatively thin.<br/><br/>However, the speed at which he absorbed it was still very fast.<br/><br/>Very soon, the energy in his body trembled slightly and easily entered the level of a god.<br/><br/>Tianci instantly opened his eyes and looked at Wang Xian in disbelief.<br/><br/>Buzz<br/><br/>At this moment, Wang Xian sensed that the ultimate treasure of Tianyuan in Tianci’s body trembled slightly.<br/><br/>Wang Xian narrowed his eyes slightly. When tianci had just stepped into cultivation, he realized that the tender bud of Tianyuan had started to grow.<br/><br/>From the bud to the size of a finger.<br/><br/>Wang Xian was deep in thought when he saw this change.<br/><br/>“Uncle, how did I cultivate so quickly? I feel that the wood attribute energy in my body has already surpassed the water attribute. Furthermore, I feel that there is a small tree in my body! ”<br/><br/>Tianci widened his eyes and asked Wang Xian.<br/><br/>(‘I told you, you are born extraordinary. You are born to cultivate the wood attribute. Furthermore, there is a treasure in your body. If this treasure is exposed, it will bring you, your mother, grandfather, and even the entire Mu Li tribe a huge disaster.”<br/><br/>“Before you have sufficient strength, you must not expose it and do not use the wood attribute. I will seal your wood attribute in a way to hide it. In the future, you will come here every day to cultivate the wood attribute. ” Wang Xian instructed tianci.<br/><br/>“I. . . I will listen to uncle. I feel that uncle is the best after mother.”<br/><br/>Tianci opened his mouth and nodded at him.<br/><br/>“Hehe, good. Tianci, don’t be anxious. In a year or two, you will be invincible in this universe! ”<br/><br/>Wang Xian smiled at him. “Invincible?”<br/><br/>Tianci couldn’t believe it.<br/><br/>Wang Xian didn’t explain too much to him and patted his head.<br/><br/>“There are some things that I can’t tell you now. However, you have to know that you were born extraordinary and no one can match up to you. You need to hide for the time being. You need to hide for 100 to 200 million years. During these 100 to 200 million years, you need to keep a low profile and endure it!”<br/><br/>“During this period, you are not allowed to use the wood attribute energy. Don’t tell others either. If you have any grudges, just remember it in your heart. After one to two hundred million years, they will all be crawling under your feet!”<br/><br/>Wang Xian instructed him.<br/><br/>Tian ci nodded his head continuously at the side.<br/><br/>Ever since he was born, Wang Xian had given him a kind feeling. This feeling was sometimes even stronger than his mother!<br/><br/>He trusted Wang Xian.<br/><br/>“Alright. From now on, you will cultivate normally. It’s alright if you don’t cultivate the water attribute well. It’s alright if people say that your talent is poor. Don’t take it to heart. If you feel wronged, you can come to my side at night and tell Uncle!”<br/><br/>Wang Xian continued to speak to Tianci.<br/><br/>“Yes, Uncle! ”<br/><br/>Tianci nodded.<br/><br/>“Alright, continue to cultivate the wood attribute. When you leave, I will seal your wood attribute! ”<br/><br/>Wang Xian said to tianci.<br/><br/>In the following days, every time Tianci returned, he would cultivate the wood attribute by his side.<br/><br/>How fast was the cultivation speed of a child who had the ultimate treasure of Tianyuan in his body?<br/><br/>His strength increased rapidly every day.<br/><br/>Along with his cultivation, the ultimate treasure of Tianyuan in his body grew at a much faster speed.<br/><br/>However, tianci would talk to his grandfather from time to time, telling him that his talent was poor.<br/><br/>The teacher who taught him also said that his talent was poor.<br/><br/>Only his mother would not talk about him.<br/><br/>Wang Xian smiled and comforted him. He wanted him to display his wood attribute strength to regain his confidence.<br/><br/>Under his guidance, Tian Ci was able to let go of his unhappiness even though he was a little unhappy outside.<br/><br/>Buzz<br/><br/>Two years later, in the room where Wang Xian was.<br/><br/>A slight wave of wood attribute energy was surging and was stopped by Wang Xian!<br/><br/>“Uncle, I’ve broken through! I’ve broken through! This is great! This is great! ” Very soon, Tian Ci’s excited voice came from the room.<br/><br/>In seven years, Tianci had broken through to the immortal godly king level from the moment he started cultivating.<br/><br/>In seven years, he had broken through to the level of the eternal godly master.<br/><br/>If this cultivation speed were to be released, it would cause an uproar in the entire six paths universe.<br/><br/>However, no one knew about it now.<br/><br/>Wang Xian would not let anyone else know about it either.<br/><br/>This was also the terrifying speed of a cultivator who possessed the ultimate treasure of the Heaven’s origin!<br/><br/>Even Wang Xian couldn’t help but feel amazed and envious.<br/><br/>He was born extraordinary!<br/><br/>“HMM, it’s faster than I expected. ”<br/><br/>Wang Xian smiled.<br/><br/>“If mother knew about it, she would be even happier.”<br/><br/>Tianci said, “But uncle, I know I can’t tell mother. Hehe, now that my strength has improved and my physical fitness has improved, my water attribute cultivation is comparable to the other talented youths in our Mu Li tribe.<br/><br/>Mother and grandfather are already very happy! ”<br/><br/>Tianci’s strength, physical fitness, and his ability to sense energy had naturally increased as well.<br/><br/>Although his talent in water element cultivation was still trash, he could not help but have a high physical fitness!<br/><br/>For a child his age, he was still in the God realm, but he had already stepped into the god King Realm. What kind of concept was this?<br/><br/>They were on completely different levels.<br/><br/>Even if his water attribute talent was trash, with the enhancement of his strong physique, he was comparable to the top-notch genius youths in the Mu Li tribe!<br/><br/>This also made Tianci’s mother and grandfather happy for a long time for Tianci’s enlightenment.<br/><br/>“You can’t be arrogant. No matter how talented you are, you have to have a humble heart. Before you grow up, you will always be a weakling. Especially tianci, you are special and can’t be exposed.”<br/><br/>Wang Xian reminded him and taught him again. “Uncle, is it because of the small tree in my body?”<br/><br/>After seven years, god-given understood more.<br/><br/>He also understood some of the principles behind his attitude toward Wang Xian.<br/><br/>“Yes. If this gets out, the leaders of your mu Li tribe might attack each other. This is also the reason why I don’t want you to tell your mother. ” Wang Xian’s body size was many times.<br/><br/>“I know uncle. You told me many times. I have always remembered it. ”<br/><br/>Tianci nodded and looked at Wang Xian. “Uncle, I heard from my mother that my mother met an injured uncle when she was about to give birth to me. Was it because my mother saved you that uncle didn’t take the treasures in my<br/><br/>“Yes. If not for this reason, I would have already taken the treasures in your body. If I took the treasures, Tianci’s life would be gone! ”<br/><br/>Wang Xian smiled and nodded at him.<br/><br/>“Uncle Treats Tianci the best. Tianci doesn’t believe that you would hurt me. ”<br/><br/>Tianci hugged Wang Xian’s arm and said with a smile. After seven years, he was already one meter tall.<br/><br/>However, in Wang Xian’s eyes, he was still a child!\t\t\t\t\t\t</div>", "images": {}, "success": true}