{"id": 1127, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074234.html", "title": "Chapter 4130 - Chapter 4130: 4129 Heaven’S Gift", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4130 - Chapter 4130: 4129 Heaven’S Gift</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4130: 4129 Heaven’s gift<br/><br/>Translator: 549690339<br/><br/>Other than some special problems, Wang Xian did not hide much from heaven’s gift.<br/><br/>Although Heaven’s gift was small, he understood many of the principles behind it.<br/><br/>Wang Xian looked at Heaven’s gift beside him and smiled.<br/><br/>He moved his palm and sensed the ultimate treasure of Heaven’s origin creation in his body.<br/><br/>At this moment, Wang Xian realized that the ultimate treasure of Heaven ‘s origin creation in his body had improved quite a lot again.<br/><br/>The Bud that was the size of a finger back then was now the size of a palm. There were a few branches growing on it.<br/><br/>The trunk of a small number of trees.<br/><br/>A few branches.<br/><br/>The few branches contained a huge amount of extremely pure wood elemental energy<br/><br/>Wang Xian sensed and realized that these three branches all contained a special energy fluctuation.<br/><br/>This was derived from the wood elemental energy.<br/><br/>“Tianci, the small tree in your body has three branches. These three branches all have a special ability. Feel for this special ability.”<br/><br/>Wang Xian said to tianci.<br/><br/>“Yes, Uncle! ”<br/><br/>Tianci nodded his head and felt for it. His body emitted a strong wood attribute aura.<br/><br/>Buzz<br/><br/>In the next moment, the illusory shadow of the branches appeared on his arm.<br/><br/>After three consecutive attempts, Wang Xian sensed it from the side.<br/><br/>“Uncle, there are two attackers. One is the one who hides his aura. The one who hides his aura can not only hide himself, but also hide the aura of others. ”<br/><br/>Tianci answered quickly.<br/><br/>Okay.<br/><br/>Wang Xian nodded his head. His eyes were sparkling.<br/><br/>The ability to hide his aura was a manifestation of the ability to hide the aura<br/><br/>of this ultimate treasure of Tianyuan.<br/><br/>In the past, he was passive. Now, he could take the initiative to conceal his aura.<br/><br/>Furthermore, the ability to conceal one’s aura was even more powerful than the one that Wang Xian covered him with.<br/><br/>Under the concealment of Heaven’s gift, unless a heaven’s origin creator was observing him from a few tens of meters away, he would not be able to discover his condition.<br/><br/>He would not be able to discover the wood attribute in his body either.<br/><br/>This concealment method was extremely powerful.<br/><br/>As for the other two branches, they were also extremely powerful.<br/><br/>It could be said that tianci, who had just stepped into the immortal king level, could use these two branches to fight against a peak immortal king level existence.<br/><br/>This was the terrifying power of the Heaven’s origin creation treasure.<br/><br/>“In the future, after I seal the wood attribute energy in your body, you can conceal yourself again. ”<br/><br/>Wang Xian spoke to tianci. “Yes, Uncle.”<br/><br/>Tianci nodded obediently.<br/><br/>“Alright, I just made a breakthrough today. Have a good rest. ”<br/><br/>Wang Xian patted tianci’s head and said.<br/><br/>Tianci smiled and nodded his head.<br/><br/>In the following period of time, Wang Xian continued to recover from his injuries.<br/><br/>The Tai Chi Dragon Plate was also continuously absorbing the dark energy in an attempt to complete the breakthrough.<br/><br/>Time passed day by day.<br/><br/>More than 90 years passed by in a flash. It had been a hundred years since Tianci was born.<br/><br/>“Uncle, uncle, it’s my birthday tonight. I’ll be at home. Come over and have dinner with us. ”<br/><br/>One afternoon, Tianci ran in and shouted at Wang Xian.<br/><br/>Wang Xian opened his eyes and looked at the figure in front of him.<br/><br/>A hundred years had passed, and Tianci was now about 1.6 meters tall. If he were to be placed in the Mu Li tribe, he would still be a young man.<br/><br/>Although Tianci was not tall, he was well-groomed by his wood and water attributes.<br/><br/>He exuded a noble aura.<br/><br/>This aura was nurtured by Wang Xian.<br/><br/>As the owner of the ultimate treasure of the Heaven’s origin, Wang Xian had always reminded him of one thing.<br/><br/>One should be humble, but the pride and pride in one’s heart should be superior to anyone.<br/><br/>Born extraordinary, I, Tianci, am not inferior to anyone.<br/><br/>Not inferior to anyone. This was the concept that Wang Xian had instilled in him.<br/><br/>This also made Tianci exude confidence.<br/><br/>Similarly, being low-key and reserved to others was also a must.<br/><br/>“Oh? Is it your birthday?”<br/><br/>Wang Xian looked at tianci and smiled.<br/><br/>“Yes, uncle. After my first birthday, I have to go to the Mu Li tribe’s academy to study. I have to leave my parents and my family!”<br/><br/>Tianci nodded and said to Wang Xian.<br/><br/>The children of the Mu Li tribe had to leave their family and enter the Mu Li tribe’s academy to study.<br/><br/>“Uncle, I don’t want to leave you and mom. Furthermore, with my current strength, I don’t need to go to the academy to learn. If there’s anything I don’t understand, you can teach me, Uncle.”<br/><br/>Tianci walked to Wang Xian’s side and said.<br/><br/>“You have to have a complete life. I can’t interfere too much with you. You have to learn on your own. Get to know other people and have your own friends. ”<br/><br/>Wang Xian said to tianci.<br/><br/>Tianci opened his mouth and lowered his head slightly. “I don’t want friends.<br/><br/>Everyone else said that I don’t have a father and that I’m a bastard.”<br/><br/>When Wang Xian heard that, he raised his eyebrows slightly. “This kind of person, you can just beat him up. Challenge him directly and defeat him. He wouldn’t dare to say anything. Furthermore, this kind of person isn’t a friend. ”<br/><br/>“Tianci, you have to know that no one is qualified to be your father. Don’t be sad because of this matter. ”<br/><br/>Wang Xian knew that Tianci didn’t have a father from the start.<br/><br/>At the start, he thought that it was because Mu Liyin ‘Er’s man had abandoned him.<br/><br/>Later, he received a piece of news from the maids.<br/><br/>Tianci didn’t know his father. Even Mu Liyin ‘er didn’t know who his man was.<br/><br/>Mu Liyin ‘er was not very old. She was originally the most beautiful and most outstanding woman in the Mu Li tribe.<br/><br/>But one day, Mu Liyin ‘er got pregnant!<br/><br/>Mu Liyin ‘er did not know who her father was.<br/><br/>She got pregnant so suddenly.<br/><br/>At first, Mu Liyin ‘er’s parents thought that Mu Liyin ‘er was hiding from this man.<br/><br/>Later, after asking a lot of questions, they found out that their daughter didn’t know how she got pregnant.<br/><br/>But when a woman gets pregnant, she can’t get pregnant out of thin air?<br/><br/>Therefore, Mu Liyin ‘er’s father suspected that there might be a strong person who used powerful means to have sex with Mu Liyin ‘er.<br/><br/>Mu Liyin ‘er didn’t notice it.<br/><br/>Or maybe she erased this part of her memory.<br/><br/>Her own daughter had been humiliated and even had a child, which made Mu Li Yin ‘er’s father and the elders extremely angry.<br/><br/>They wanted Mu Li Yin ‘er to abort her child.<br/><br/>But Mu Li Yin ‘er was reluctant and forcefully gave birth.<br/><br/>And Mu Li Yin ‘er’s action and the matter of being pregnant and giving birth caused a huge sensation in the entire Mu Li tribe.<br/><br/>They thought that he was an unclean woman and Tianci was also a bastard.<br/><br/>Up until now, Tianci was not qualified to have the surname Mu Li.<br/><br/>Mu Liyin ‘er’s relatives were suspicious and the people of the Mu Li tribe thought so.<br/><br/>However, Wang Xian sensed mu Liyin ‘er and made a judgment in his heart. Mu Liyin ‘er was not insulted. She was pregnant because of the birth of tianci.<br/><br/>In other words, the gift of God was born to her.<br/><br/>The gift of God, just like the name, was given by God.<br/><br/>Without a father, the essence of heaven and earth was conceived in Mu Liyin’s fetus!\t\t\t\t\t\t</div>", "images": {}, "success": true}