{"id": 1121, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074210.html", "title": "Chapter 4124 - Chapter 4124: 4123 Ultimate Treasure Of The Heaven’S Origin", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4124 - Chapter 4124: 4123 Ultimate Treasure Of The Heaven’S Origin</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4124: 4123 ultimate treasure of the Heaven’s origin<br/><br/>Translator: 549690339<br/><br/>Wood attribute!<br/><br/>Ultimate Treasure of the Heaven’s origin!<br/><br/>Wang Xian never expected that he would discover the ultimate treasure of the Heaven’s origin under such circumstances!<br/><br/>His gaze was fixed in the direction of the wall, and his eyes were glowing with a fiery glow.<br/><br/>He took a deep breath.<br/><br/>“Cough Cough! ”<br/><br/>Intense pain was suddenly felt, causing a helpless expression to appear on his face!<br/><br/>“The injuries on my body are too severe. Fortunately, I didn’t die. How long has it been?”<br/><br/>Wang Xian came back to his senses and calculated the time.<br/><br/>“It has been two months? My current position seems to be in a tribe in the water source. Was I saved by someone?”<br/><br/>“The experts from the Void Universe didn’t chase after me. What’s the situation? It seems like I survived a great disaster! ”<br/><br/>Wang Xian mumbled.<br/><br/>Although he could be resurrected after he died, it was definitely a lucky thing for Wang Xian to be able to survive.<br/><br/>Moreover, from the looks of it, surviving the calamity would definitely bring him good fortune!<br/><br/>“A wood-attributed ultimate treasure of the Heaven’s origin creation. That’s definitely it. It should have just been born and isn’t too strong yet. This concealment ability is very strong. If I didn’t have the ancestral tree in my body and wasn’t so close to it, I really wouldn’t have been able to discover it! ” Wang Xian thought to himself.<br/><br/>There were two types of ultimate treasures of the Heaven’s origin creation.<br/><br/>One was the ultimate treasure of the Heaven’s origin creation that had just been born and was at its peak.<br/><br/>These ultimate treasures of the Heaven’s origin creation were usually very dazzling existences before they were born.<br/><br/>Before they were born, they would absorb the tremendous energy in the world.<br/><br/>It was difficult for such ultimate treasures of the Heaven’s origin creation to not be discovered.<br/><br/>The second type of treasure of Tianyuan was very weak after it was born. It would absorb energy bit by bit until it reached maturity.<br/><br/>This kind of treasure of Tianyuan often had extremely strong concealment abilities and was very difficult to be discovered.<br/><br/>The treasure was reserved and would only emit radiance when it was fully matured!<br/><br/>The treasure of Tianyuan in the six paths universe clearly belonged to the second type!<br/><br/>Only under such circumstances could Wang Xian sense the existence of the ultimate treasure of Tianyuan.<br/><br/>It was difficult for other powerhouses, even those in the six paths universe, to discover it unless they were tens of meters away from the treasure.<br/><br/>(‘My Luck is really good! ”<br/><br/>Wang Xian moved his palm and some divine fruits appeared in his hand.<br/><br/>He still had some divine fruits and elixirs in his hand.<br/><br/>Furthermore, these divine fruits and elixirs were all above level nine of the universe dominator.<br/><br/>Wang Xian immediately consumed them.<br/><br/>Waves of energy entered his body and healed his injuries.<br/><br/>However, according to Wang Xian’s calculations, if he wanted to recover to the peak, he would need to use up the resources in his hands and cultivate for another 500 to 600 million years before he could fully recover.<br/><br/>Since the powerhouses from the Void universe are not here, I can call the unicorn ox over. Since the Unicorn Ox is here, I can ask him to get some items for his recovery. His injuries should be able to recover within 100 million years<br/><br/>Wang Xian thought to himself.<br/><br/>He got down from the bed and took a deep breath.<br/><br/>His current combat strength was only at the divine emperor level.<br/><br/>There was no other way. His injuries were too severe. Coupled with the suppression of the six paths universe, he was very weak now.<br/><br/>However, Wang Xian still walked out.<br/><br/>He wanted to take a look and see what the ultimate treasure of Tianyuan was.<br/><br/>It was hidden there!<br/><br/>He wanted to get his hands on it.<br/><br/>Wang Xian had a deep understanding of the power of the ultimate treasure of Tianyuan.<br/><br/>Without the ancestral tree, Wang Xian would not be able to reach this stage.<br/><br/>In fact, without the ancestral tree, the Dragon Palace would not be so strong now.<br/><br/>A few peak dragon species were born because of the ancestral tree.<br/><br/>“Come, let me be your mother’s baby. Hehe, I have some babies from the Mu Li tribe who are born to build their bodies and build their foundations. Come,<br/><br/>Wang Xian walked out of the room and looked in the direction of the ultimate treasure of Tianyuan.<br/><br/>He heard the sounds of conversation coming from there.<br/><br/>“It’s in that room. ”<br/><br/>Wang Xian thought to himself. He was certain that it was in that room.<br/><br/>However, there were four people in that room. The strength of these four people was much stronger than his current strength.<br/><br/>Buzz Buzz<br/><br/>At this moment, Wang Xian sensed a message from the unicorn ox.<br/><br/>“One month! ”<br/><br/>The Unicorn ox replied. He could make it here in a month.<br/><br/>As long as the unicorn ox could make it here, everything would be simple!<br/><br/>“I hope nothing unexpected happens. I’m determined to obtain the Heavenly<br/><br/>Yuan Destiny Treasure! ”<br/><br/>A determined look appeared in his eyes!<br/><br/>“Come, Call Me Mom, Grandma, and Grandpa! ”<br/><br/>“Yin c er, have you thought of a name for Little Treasure?”<br/><br/>“Mom, I’ve already thought of a name. From now on, she’ll be called Tianci. ” “Tianci, Mu Li Tianci, good, good.”<br/><br/>“Before he achieves anything, he can’t be called Mu Li. Half a month later, I’ll send someone to teach him cultivation. Before he achieves anything, he shouldn’t go out. ”<br/><br/>“Father, Tianci has just been born, and he is cultivating half a month later. This… ”<br/><br/>“Stop talking. The child has been given to you. In the future, you have to listen to me… Don’t worry, the current teaching is here.”<br/><br/>At this moment, a voice came from the room in front.<br/><br/>One of the male voices had a hint of authority and was unquestionable.<br/><br/>“Alright, Alright. I’ll listen to you. Come, Yin c er, bring Tianci to see the outside world. ”<br/><br/>The woman’s voice was heard.<br/><br/>At this moment, the sound of footsteps could be heard.<br/><br/>Wang Xian stood there and saw a couple as well as a female attendant walking out.<br/><br/>In the woman’s arms, there was a child.<br/><br/>However, this child was already 70 to 80 centimeters in size.<br/><br/>This was very normal.<br/><br/>As the center of the universe, the child had just been born and weighed around 7 to 8 kilograms.<br/><br/>However, both the woman and her parents possessed considerable strength.<br/><br/>They could take out some treasures and allow the child to grow rapidly.<br/><br/>If they were willing, they could even allow the child to reach a height of two meters in a day.<br/><br/>Of course, under normal circumstances, they wouldn’t do this.<br/><br/>They would let their children grow up from a young age. It might be a hundred years later before they could reach a height of more than one meter.<br/><br/>A baby was just born. Being molded to 70 to 80 centimeters was also to strengthen the baby’s vitality!<br/><br/>To prevent premature death!<br/><br/>Therefore, a baby could run at birth.<br/><br/>The woman walked out with the baby in her arms. The baby in her arms looked at the world around her curiously with a pair of big eyes!<br/><br/>“Ya Yaya!”<br/><br/>“Ya Yaya Ya!”<br/><br/>All of a sudden, when he saw Wang Xian, he let out a sound and his body started to struggle!<br/><br/>“Eh? What’s wrong, Tianci?”<br/><br/>The woman was slightly stunned when she saw the child in her arms suddenly trying to break free. She squatted down slowly and placed the child on the ground.<br/><br/>After Tianci was placed down, he ran straight towards Wang Xian. As he ran, he stretched out his arms.<br/><br/>This made the women and the rest look surprised.<br/><br/>At this moment, Wang Xian stared at this child. His face was filled with disbelief and shock.<br/><br/>“ThiS…<br/><br/>He opened his mouth.<br/><br/>From his senses, this child…<br/><br/>Was the ultimate treasure of the Heaven’s origin!\t\t\t\t\t\t</div>", "images": {}, "success": true}