{"id": 1124, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074222.html", "title": "Chapter 4127 - Chapter 4127: The Resources And Treasures Left Behind By The 4126 Light Shadow!", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4127 - Chapter 4127: The Resources And Treasures Left Behind By The 4126 Light Shadow!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4127: The resources and treasures left behind by the 4126 Light Shadow!<br/><br/>Translator: 549690339<br/><br/>(‘I’m telling you, don’t tell anyone else! ”<br/><br/>“Forget it, everyone else knows anyway. ”<br/><br/>The maid saw Wang Xian looking at her curiously and transmitted her voice to him.<br/><br/>“Our young master doesn’t have a father! ”<br/><br/>The maid added.<br/><br/>“Doesn’t have a father?”<br/><br/>Her words still caused Wang Xian to have some doubts.<br/><br/>Was Mu Liyin c er abandoned?<br/><br/>Mu Liyin c er looked very beautiful?<br/><br/>To be able to be described as very beautiful by Wang Xian, she was usually the most top-notch and almost impeccable!<br/><br/>And that was indeed the case. Mu Liyin ‘ER’s looks were very exquisite.<br/><br/>Perhaps it was because she had given birth before, but she had a unique charm that other girls did not have.<br/><br/>“It’s fine as long as you know this. Don’t ask too much.”<br/><br/>The maid continued to speak to Wang Xian!<br/><br/>Wang Xian nodded. There was no such gossip.<br/><br/>Tianci did not have a father. Without a doubt, he had abandoned his wife, abandoned his children, and got pregnant before marriage.<br/><br/>“Uncle, come and play. Come and Play! ”<br/><br/>Tianci’s voice could be heard from the front again.<br/><br/>Wang Xian shook his head at him.<br/><br/>Mu Liyin ‘er whispered something to Tianci as well. She didn’t call for him anymore.<br/><br/>An hour later, Tianci was tired from playing. He prepared Mu Liyin ‘er to bring him back to his room.<br/><br/>Wang Xian returned to his room again and continued to sit cross-legged to recover.<br/><br/>However, a few hours later, Tianci ran into his room again!<br/><br/>“I want to sleep with uncle, not mom!”<br/><br/>Tianci hugged the blanket and climbed onto Wang Xian ‘s bed happily.<br/><br/>“Alright, go to sleep! ”<br/><br/>Wang Xian saw it and nodded with a smile.<br/><br/>Tianci was right in front of him. As long as his mother had no objections, Wang Xian naturally had no objections!<br/><br/>The ancestral tree entered his body. In less than ten seconds, Tianci had already fallen asleep.<br/><br/>“Wang Xian, sorry to trouble you. This child insisted on sleeping with you.<br/><br/>Sorry to disturb you! ”<br/><br/>Very soon, Mu Liyin’er’s voice was transmitted.<br/><br/>“Hehe, it’s alright. Pll be recuperating at the side. It Won’t affect me in any way. Let Tianci Sleep Here! ”<br/><br/>Wang Xian immediately transmitted his voice!<br/><br/>Mu Liyin ‘er replied. Standing at the door, her face revealed helplessness and bitterness!<br/><br/>The son that she gave birth to did not follow her biological mother. Instead, he followed an outsider!<br/><br/>This made him very sad!<br/><br/>If he did not give birth to this son, he would even doubt if this was his own son!<br/><br/>Next, Wang Xian sat cross-legged and continued to cultivate!<br/><br/>There was no sun or moon to recover from his injuries!<br/><br/>However, after Tianci woke up, he took a glance at Wang Xian and left!<br/><br/>After more than ten hours, he returned to sleep!<br/><br/>Wang Xian did not know how long he had been cultivating.<br/><br/>On this day, Lin Niu sent him a message telling him that he had arrived!<br/><br/>Wang Xian opened his eyes and immediately took out a communication device to reply!<br/><br/>Not long after, Lin Niii’s figure appeared in front of Wang Xian.<br/><br/>With Lin Niu’s current strength, Mu Liyin ‘er and the rest wouldn’t be able to sense him even if he came in!<br/><br/>“Boss, your injuries are so serious. Take these herbs and divine fruits to heal your injuries first!”<br/><br/>Lin Niu said to Wang Xian!<br/><br/>Give him some resources to recover his injuries.<br/><br/>Wang Xian nodded his head and swallowed it directly.<br/><br/>“Although I’m injured this time, Pll be lucky if I don’t Die! ”<br/><br/>Wang Xian smiled and told Lin Niu about his encounter with the ultimate treasure of the Heaven’s origin!<br/><br/>“What? Boss, you actually encountered the ultimate treasure of the Heaven’s origin? That ultimate treasure is actually a little boy who has fused with the life of a little boy. This… ?”<br/><br/>Lin Niu widened his eyes and revealed a shocked expression on his face!<br/><br/>“Yes, but Tianci’s mother saved my life. Therefore, Pm not planning to take away the ultimate treasure of Tianyuan. Let’s see if I can get some other good fortune by following him around! ”<br/><br/>“In addition, it will also help him grow up. In the future, it can be considered a good karma! ”<br/><br/>Wang Xian nodded and said to Lin Niu!<br/><br/>Heaven’s Gift’s mother saving him was also a good deed for Heaven’s Gift!<br/><br/>Naturally, Wang Xian also wanted to form a good relationship with him!<br/><br/>“Boss is indeed a boss. There are very few people in the entire universe who can achieve your level. You are indeed the boss of me, Lin Niu! ”<br/><br/>When Lin Niu heard that, he flattered him!<br/><br/>However, his face was filled with admiration!<br/><br/>To be able to stand in front of an ultimate treasure of the Heaven’s origin without any emotion or greed, there were too few people who could do it!<br/><br/>A treasure of this level could cause brothers to turn against each other and father and son to become enemies!<br/><br/>Wang Xian shook his head. “Alright, wait for my information in the Mother<br/><br/>“Yes, Boss!”<br/><br/>Lin Niu nodded and entered the mother nest!<br/><br/>At the same time, Lin Niu took out all the resources.<br/><br/>This included the corpse of a Tianyuan powerhouse with the darkness attribute that Wang Xian asked him to take away!<br/><br/>“Let’s see if there are any treasures in the corpse of this heaven origin creator. ”<br/><br/>Wang Xian sensed this corpse and looked over!<br/><br/>Wang Xian didn’t have the time to look at this corpse when he was killing it!<br/><br/>His mind stirred and he began to search!<br/><br/>He obtained an interspatial ring from the corpse!<br/><br/>The interspatial ring was very easy to open. When Wang Xian opened it and saw what was inside, he was astonished.<br/><br/>“There are so many treasures. Why does this guy have so many treasures on him<br/><br/>Wang Xian was delighted!<br/><br/>In his interspatial ring, there were many resources. Some of them contained a huge amount of energy.<br/><br/>There was even one treasure that contained energy that had reached the level of Heaven’s origin creation!<br/><br/>What Wang Xian didn’t know was that the figure had so many resources on him.<br/><br/>It was because the figure didn’t think that it would be dangerous for him to enter the six paths universe!<br/><br/>Furthermore, most of the resources were the rewards given to him by the Void Universe’s powerhouses!<br/><br/>The Void Universe’s powerhouses had invited a heaven’s origin creation to help attack the unknown mastermind!<br/><br/>Ordinary Heavenly Yuan creator realm experts weren’t willing to accept such a mission!<br/><br/>Only the two control-level existences, Tian Men Gong and Xi Ning Gong, managed to find one light shadow!<br/><br/>This was because they didn’t know how many Heavenly Yuan creator realm experts were behind this mission!<br/><br/>Once they joined in, it could be said that they wanted to become enemies with the mastermind.<br/><br/>Become his mortal enemy!<br/><br/>In fact, the mastermind might even be a heaven origin creation from the 9-origin universe.<br/><br/>In other words, he was going to become the enemy of the 9 -origin universe!<br/><br/>Which Heaven origin creation dared to offend the 9 -origin universe?<br/><br/>Since the light figure agreed to accept this mission, the reward was naturally not cheap!<br/><br/>In fact, this revenge was taken out by five to six heaven origin creation realm powerhouses from the Void Universe.<br/><br/>These resources were extremely valuable to a heaven origin powerhouse with the darkness attribute.<br/><br/>Otherwise, the light shadow wouldn’t have taken such a risk.<br/><br/>However, all these resources belonged to Wang Xian now!<br/><br/>There was even a corpse left behind!<br/><br/>“Are these resources enough to upgrade the Taiji Dragon Plate?”<br/><br/>Wang Xian’s heart was suddenly burning with passion!\t\t\t\t\t\t</div>", "images": {}, "success": true}