{"id": 1136, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074270.html", "title": "Chapter 4139 - Chapter 4139: 4138 Once Again Killed The Heavenly Yuan Creation! Hit", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4139 - Chapter 4139: 4138 Once Again Killed The Heavenly Yuan Creation! Hit</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4139: 4138 once again killed the Heavenly Yuan creation! hit<br/><br/>Translator: 549690339<br/><br/>“Boom! Boom! Boom!”<br/><br/>The impact of the energy and the mighty power continued to roar within the Divine Light Bell.<br/><br/>The Light Attribute Heavenly Yuan creation Holy Father’s eyes were burning as he continuously bombarded Lin Niu.<br/><br/>After fighting for more than 20 hours, he could already sense that Lin Niu was not his match.<br/><br/>Especially in the beginning of the life-and-death battle. Although he was injured, he still held the upper hand.<br/><br/>This made his heart filled with excitement.<br/><br/>Even if he was heavily injured, he had to take this heavenly yuan destiny treasure away today.<br/><br/>He had to bring it back to his own universe.<br/><br/>In that case, his strength would be greatly increased.<br/><br/>He would have nothing to fear in the face of the arrival of the calamity.<br/><br/>The battle continued to erupt.<br/><br/>Tianci, who was on top of Lin Niu, lay on top of him, his face still full of shock.<br/><br/>He could only see the vast energy around him.<br/><br/>He felt like a leaf in the sea.<br/><br/>He could die at any time.<br/><br/>Now, he also understood his current situation.<br/><br/>Tianci was a smart person.<br/><br/>According to what he knew, he had a clear understanding of himself.<br/><br/>There had been invaders from other universes in the six paths universe 100 million years ago.<br/><br/>His grandfather had even been recruited to join a team that hunted invaders.<br/><br/>Even the three lords of the six paths universe couldn’t do anything to these invaders. One could imagine their strength.<br/><br/>He also knew the purpose of these intruders entering the six paths universe.<br/><br/>It was to seize a treasure of the six paths universe.<br/><br/>As for what treasure it was, the disciples of the Great Beings of the six paths universe didn’t know.<br/><br/>Now, he understood that he was that treasure.<br/><br/>Once he was discovered, he would be killed, and the treasure in his body would also be taken away.<br/><br/>This caused his body to tremble.<br/><br/>“No Wonder Godfather didn’t allow me to reveal my wood attribute. No wonder godfather placed a seal on my body.”<br/><br/>Tianci understood.<br/><br/>He looked at the bleeding Lin Niu and his expression changed.<br/><br/>“Uncle Xiao Niu, should we escape? You’re injured! ”<br/><br/>Tianci said to Lin Niu!<br/><br/>“Don’t Worry! ”<br/><br/>Lin Niu transmitted his voice to him and continued to face the attacks in front of him.<br/><br/>“Roar! Roar! ”<br/><br/>After dozens of minutes, Lin Niu suddenly roared!<br/><br/>“If you want to fight with me, then let’s see who will live and who will die today!<br/><br/>Lin Niu instantly went berserk and no longer passively continued to defend.<br/><br/>All kinds of symbols shot out from the scales all over his body. These symbols turned into strange and terrifying phantoms.<br/><br/>Each of these phantoms was like a demonic god.<br/><br/>“Hahaha, good, good, good. Then let’s fight to the death, Haha! ”<br/><br/>Seeing that Lin Niu wanted to fight to the death with him, the holy father laughed maniacally.<br/><br/>His eyes emitted a luster as he directly faced Lin Niu, completely engaging in close combat.<br/><br/>“Boom, Boom, Boom! ”<br/><br/>Lin Niu and Lin Niu exchanged blows. The terrifying energy impacted the flesh and blood of both sides.<br/><br/>In less than five minutes, wounds appeared on their bodies!<br/><br/>Based on this intense battle, it wouldn’t be long before the victor would be decided!<br/><br/>Buzz<br/><br/>However, at this moment, a figure flew over quickly from the outside!<br/><br/>Wang Xian stood at the front and looked ahead. His eyes were sparkling.<br/><br/>“An old-fashioned powerhouse of the Heaven’s origin creation. He is slightly stronger than the Unicorn Ox. If I add myself and the five elements grinding, I should be able to kill him! ”<br/><br/>Wang Xian mumbled.<br/><br/>His gaze focused and his pupils were flickering with grey energy.<br/><br/>“This divine bell with light attributes is actually a broken fragment of the ultimate treasure of the Heaven’s origin creation.”<br/><br/>Wang Xian looked at the divine bell.<br/><br/>The Ultimate Treasure of Tianyuan was not something that could not be destroyed.<br/><br/>It was at the control level and the Great Dao level. If one continuously attacked a ultimate treasure of Tianyuan, it could also be destroyed.<br/><br/>This was especially so for the ultimate treasure of Tianyuan that had yet to reach its peak.<br/><br/>The Ultimate Treasure of Tianyuan could be said to be the same as the powerhouses of Tianyuan. It could also be defeated.<br/><br/>However, the difference was that the ultimate treasure of Tianyuan could only be destroyed and not completely destroyed.<br/><br/>The Shattered Ultimate Treasure of the Heaven’s origin still contained some power.<br/><br/>If he could find all the fragments and nurture them with a large amount of time and energy, he could still recover!<br/><br/>Whoosh<br/><br/>In the next instant, Wang Xian arrived above the divine bell of light.<br/><br/>With a wave of his hand, the five elements millstone appeared at the side.<br/><br/>The star field fragment and the book of Water Forbidden Spell, two ultimate treasure fragments of the Heaven’s origin origin origin, also appeared in his hand.<br/><br/>Boom<br/><br/>In the next instant, Wang Xian controlled the star field fragment and the Book of water curse to attack the Divine Bell.<br/><br/>At the same time, the five elements grinding mill also unleashed a powerful attack and attacked the Divine Bell!<br/><br/>Boom<br/><br/>The sudden attack caused a huge crack to appear on the defensive barrier set up by the Divine Bell.<br/><br/>Furthermore, the energy barriers in other places started to collapse!<br/><br/>“Pu, not good, there are other heaven origin creation realm experts coming!”<br/><br/>At this moment, the Holy Father who was fighting with Lin Niu suddenly felt<br/><br/>that the Divine Bell’s defense had been broken.<br/><br/>The Divine Bell suffered a huge attack and its expression changed drastically. It couldn’t help but spit out blood.<br/><br/>The Divine Bell had been nurtured by him and was one with him. If it was heavily injured, its main body would also be injured.<br/><br/>Just like how heaven bestowed took away the Heavenly Yuan creation treasure in his body, it also represented the end of his life!<br/><br/>“Roar Roar, die! ”<br/><br/>Lin Niu’s eyes shone with light, and the horn on his head emitted blood-red energy as it directly charged towards him!<br/><br/>“Stop, there’s an external heavenly yuan creation expert. If You Fight Me, you won’t have a good ending either!”<br/><br/>The Holy Father saw the unicorn ox charging towards him. Due to the impact of the Divine Bell, his original body was also affected.<br/><br/>This made him look extremely embarrassed.<br/><br/>In such a short period of time, there was actually a powerhouse of the Heaven’s origin destiny realm who discovered this place.<br/><br/>His luck was simply terrible to the extreme!<br/><br/>“Kill!<br/><br/>However, at this moment, an ice-cold voice entered his ears.<br/><br/>In the air, after Wang Xian broke through the defense of the god Bell, his arm immediately turned into a dragon claw.<br/><br/>The terrifying Dragon Claw carried destructive energy as it clawed at his body!<br/><br/>Close combat!<br/><br/>Wang Xian also engaged in close combat. He was fighting with his life on the line!<br/><br/>“Oh no, are you guys together?”<br/><br/>When he saw Wang Xian attacking him directly, a look of shock and anger appeared on his face.<br/><br/>He didn’t expect the unicorn ox to have a helper.<br/><br/>Scram! ”<br/><br/>He growled and waved the staff in his hand.<br/><br/>The sharp thorns on the staff were like laser beams as they charged towards Wang Xian.<br/><br/>Wang Xian didn’t Dodge at all. His dragon claws continued to attack!<br/><br/>At the back, the five elements grinding ground. The heads of the five divine dragons were intertwined together and formed a five-colored divine dragon head.<br/><br/>The Divine Dragon Head attacked this light attribute heavenly fate powerhouse!\t\t\t\t\t\t</div>", "images": {}, "success": true}