{"id": 1131, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074250.html", "title": "Chapter 4134 - Chapter 4134: 4133 Heaven’S Gift Was Discovered", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4134 - Chapter 4134: 4133 Heaven’S Gift Was Discovered</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4134: 4133 heaven’s gift was discovered<br/><br/>Translator: 549690339<br/><br/>The improvement of the ancestral tree was a pleasant surprise to Wang Xian.<br/><br/>Perhaps it was due to the catalysis of the Heaven’s origin creation in Heaven’s gift’s body, or perhaps the energy absorbed by the ancestral tree was sufficient. The improvement of the ancestral tree meant the recovery of his injuries.<br/><br/>The improvement of his strength.<br/><br/>The current Wang Xian ‘s strength was already extremely terrifying.<br/><br/>With the addition of the five elements grindstone, Wang Xian was able to contend against existences at the control level.<br/><br/>If he were to add in the Lin Bull, his strength would be even stronger.<br/><br/>“It will be easier from now on. ”<br/><br/>Wang Xian stretched his back and revealed a smile.<br/><br/>There was no need for him to constantly recover from his injuries.<br/><br/>Wang Xian came out of the room and looked around.<br/><br/>“Young master Wang Xian, why did you come out suddenly today?”<br/><br/>At this moment, Mu Liyin er saw Wang Xian and asked him with a smile.<br/><br/>Although Wang Xian had been staying here, he had not left his room for a long time.<br/><br/>Mu Liyin er saw that Wang Xian had suddenly come out today and asked curiously.<br/><br/>“Your body is fine now. Thank you for taking care of me during this period of time, Miss Mu Liyin Er.”<br/><br/>Wang Xian thanked her.<br/><br/>“Young master Wang Xian, you are too polite. You Are Tianci’s foster father. Naturally, we are also relatives. Moreover, I have not taken care of you during this period of time. ”<br/><br/>Mu Liyin ‘er shook her head.<br/><br/>“Miss Mu Liyin’er, I Won’t disturb you anymore. Pm going to live outside.” Wang Xian spoke to Mu Liyin ‘er.<br/><br/>Mu Liyin ‘er was slightly stunned when she heard his words. “Young master<br/><br/>Wang Xian is going to live outside? It’s fine. It’s fine even if you stay here.<br/><br/>Moreover, Tianci is here. We can even have a meal together.”<br/><br/>“Hehe, thank you very much, Miss Mu Liyin’er. However, it’s still a little inconvenient to live here. ”<br/><br/>Wang Xian shook his head.<br/><br/>It was indeed inconvenient to live here. “This… does young master Wang Xian have a place to live?”<br/><br/>Mu Liyin ‘er looked at him and asked.<br/><br/>(‘I’m planning to buy a house near the TIANCI Academy and live there. When tianci has fully grown up, Pm planning to go to other places.”<br/><br/>Wang Xian replied.<br/><br/>“Live near the Academy? You are not familiar with the place here. How about I help you find a house?”<br/><br/>Mu Liyin’er said to him. “Sure. I’ll have to trouble Miss Mu Liyin’er.”<br/><br/>Wang Xian nodded.<br/><br/>“It’s no trouble. You Don’t have to stand on ceremony, young master Wang<br/><br/>Xian. ”<br/><br/>Mu Liyin’er shook her head. “Let’s go. I’m more familiar with the place. I’ll get someone to help you ask around. ”<br/><br/>Wang Xian nodded and followed Mu Liyin’er out.<br/><br/>The location of Tianci Academy was not too far away from here. If they were to fly, it would only take about half an hour.<br/><br/>(‘My friend said that there are houses here for rent. ”<br/><br/>Mu Liyin ‘er took a look at her communicator and said to Wang Xian.<br/><br/>“Alright.”<br/><br/>Wang Xian nodded and followed her forward!<br/><br/>It was a bustling area around the Mu Li tribal college.<br/><br/>There were all kinds of shops here.<br/><br/>However, the upper floors of the shops were habitable.<br/><br/>In general, this place was not as good as the rooms of Mu Li Yin c er and the rest. It was more suitable for living<br/><br/>There were many pedestrians around. The two of them came to the front of a shop.<br/><br/>“What do you think of this house? There are all shops here. The upper floors of the shops are for living. The environment is not as good as mine, but it is more prosperous. It is also very close to the college. ”<br/><br/>“This shop is for rent. It’s 500 square meters and is a thousand meters tall. You can decorate it yourself. ”<br/><br/>Mu Liyin ‘er introduced a house to Wang Xian.<br/><br/>sure!<br/><br/>Wang Xian looked around and nodded his head.<br/><br/>When the time came, he could just decorate the house and set up some formations.<br/><br/>As for the location, he didn’t really care.<br/><br/>“HMM, alright. The merchant will be here soon. Let’s wait for a while!” Mu Liyin er said.<br/><br/>“Eh, isn’t this Mu Liyin er? oh? This One? Hehe, could it be the father of your child<br/><br/>At this moment, a teasing voice suddenly sounded.<br/><br/>The sudden words stunned Wang Xian and Mu Liyin er.<br/><br/>“As expected of the favored daughter of the Mu Li tribe. She has a son at such a young age. Haha, she’s ahead of all of us! ” Another mocking voice was heard.<br/><br/>On the right, five to six women walked over.<br/><br/>They held weapons in their hands and raised their heads slightly. They sized up Mu Li Yin c er and Wang Xian.<br/><br/>There was a mocking expression on their faces.<br/><br/>“Ignore him. ”<br/><br/>Mu Li Yin ‘er saw them and frowned slightly. Then, she whispered to Wang Xian.<br/><br/>She completely ignored the five to six women.<br/><br/>“TSK, TSK, tsk. Mu Liyin er, did you find the child’s father or find a stepfather for the child? Are you trying to make others happy?”<br/><br/>When the few women saw that Mu Liyin er ignored them, they did not mind. They continued to laugh at her and let out a sharp voice.<br/><br/>“You ‘re talking too much nonsense! ”<br/><br/>Wang Xian swept his gaze across them.<br/><br/>Everyone’s strength was at the level one of a universe knight.<br/><br/>As his gaze swept across them, an invisible pressure enveloped them.<br/><br/>Instantly, the few ladies’faces turned pale and their faces were filled with cold sweat!<br/><br/>Wang Xian glanced at them again and retracted his gaze. The pressure on their bodies also disappeared instantly.<br/><br/>“Alright, Alright, Alright. Mu Liyin er, you can do it! ”<br/><br/>A few of the women felt the pressure disappear and their expressions changed drastically. They stared at Mu Liyin c er and spoke through gritted teeth. Then, they left in a hurry with a dark expression on their faces!<br/><br/>Obviously, the pressure that Wang Xian gave them with a glance made them feel a little terrified.<br/><br/>They knew that Wang Xian’s strength was very, very strong.<br/><br/>This made them a little jealous!<br/><br/>“Thank you. ”<br/><br/>At the side, Mu Li Yin ‘er was slightly stunned when she saw this scene. She looked at Wang Xian in astonishment and hesitated for a moment. “What level is your strength? So strong. I feel that you are not an ordinary universe master.”<br/><br/>Mu Li Yin ‘er’s strength was at the level two of a universe knight.<br/><br/>In fact, Mu Li Yin ‘er’s age was considered very young in the Mu Li tribe.<br/><br/>Those of the same generation as her did not get married and have children at all.<br/><br/>In fact, it would only be normal for those of her generation to get married and have children after a few hundred million years.<br/><br/>She was completely in an unexpected situation.<br/><br/>Wang Xian had mentioned that his strength had reached the level of a universe dominator. However, he felt that Wang Xian’s strength did not seem to be an ordinary universe dominator.<br/><br/>“A level seven universe dominator is not bad. He is more than enough to teach Tianci! ”<br/><br/>Wang Xian smiled and replied!<br/><br/>Upon hearing Wang Xian’s strength, Mu Liyin ‘er opened her mouth and revealed a shocked expression.<br/><br/>In the entire Mu Li tribe, a master of the universe was considered a core expert.<br/><br/>He had a lot of privileges in the tribe.<br/><br/>However, the strongest expert in the tribe was only at level eight while his father was only at level five!<br/><br/>This young man whom he saved was actually at the Level 7 universe overlord realm?<br/><br/>This? ?<br/><br/>He couldn’t believe it!<br/><br/>It was a great fortune for such a strong warrior to carefully teach Tianci!\t\t\t\t\t\t</div>", "images": {}, "success": true}