{"id": 1135, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074266.html", "title": "Chapter 4138 - Chapter 4138: 4137 Killed The Heavenly Yuan Creation Once Again! Go", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4138 - Chapter 4138: 4137 Killed The Heavenly Yuan Creation Once Again! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4138: 4137 killed the Heavenly Yuan creation once again! Go<br/><br/>Translator: 549690339<br/><br/>A bright bell sounded and a huge divine bell enveloped the entire space.<br/><br/>It completely enveloped Lin Niu and the others.<br/><br/>The Holy Father’s gaze was blazing and icy cold as he stared at Lin Niu. A terrifying aura erupted from his body.<br/><br/>A strong fighting spirit filled the surroundings.<br/><br/>His gaze was fixed on Lin Niu.<br/><br/>He was prepared to fight to the death, a life and Death Battle of the same level.<br/><br/>Under normal circumstances, a life and Death Battle of the same level was rarely a life and death battle.<br/><br/>But now, for the sake of a heavenly yuan destiny treasure, he had to fight to the death. Otherwise, he wouldn’t be satisfied.<br/><br/>Even if this body fell, he still wanted to give it a try.<br/><br/>“If you want to fight to the death with me, then I want to see who will live and who will die today. He isn’t someone you can touch.”<br/><br/>Lin Niu stared at the Holy Father with a cold expression in his eyes!<br/><br/>The other party wanted to kill him and obtain the Heavenly Yuan Destiny Supreme Treasure.<br/><br/>However, Lin Niu did not run away immediately.<br/><br/>Running away was the next best choice.<br/><br/>He had already received the news about tianci, so he could no longer run away.<br/><br/>Instead, he wanted to kill him.<br/><br/>Although he could revive after killing him, he still had to be exposed.<br/><br/>However, killing him would give them a buffer and allow them to make some preparations in advance.<br/><br/>Most importantly, Lin Niu knew that Wang Xian was already rushing over.<br/><br/>The other party’s strength was about the same as his. However, once Wang Xian arrived, they would be able to eliminate this light-attributed heaven origin creator!<br/><br/>“Then let’s end this battle quickly. Let’s see who will die today! ”<br/><br/>(‘I must obtain the Heaven Origin Creation Treasure! ”<br/><br/>The Holy Father Stared at the Linniu with a grim expression. He was completely enraged!<br/><br/>He had to kill the other party as soon as possible.<br/><br/>Otherwise, he might be discovered by other powerhouses or the powerhouses in this universe.<br/><br/>“I say, light erupts, White Night is stirred up, light dies, and light is sacrificed! ”<br/><br/>The Holy Father moved his hand, and sharp spikes appeared on the staff in his hand.<br/><br/>His entire body erupted with terrifying power.<br/><br/>In an instant, he unleashed four extremely powerful attacks.<br/><br/>Even the last attack completely consumed his own foundation.<br/><br/>He raised the staff that was filled with sharp spikes and attacked Lin Niu!<br/><br/>“Tianci, lie down.”<br/><br/>Lin Niu saw that his opponent had unleashed all of his strength, and his face was filled with a solemn expression.<br/><br/>A wave of energy enveloped TIANCPs body, and Lin Niu’s body began to increase explosively again.<br/><br/>Very quickly, he reached the size of a few thousand meters.<br/><br/>A demonic God’s aura surged, and a powerful death energy bloomed from Lin Niu’s horn, directly heading toward the Holy Father!<br/><br/>Boom<br/><br/>A terrifying collision sound was heard as the terrifying energy rushed into the surroundings.<br/><br/>Tianci was lying on the body of the Unicorn Bull and was protected by the energy. His face was filled with shock.<br/><br/>He did not expect the strength of the Unicorn Bull to be so terrifying. He also did not expect the strength of the other party to be so terrifying!<br/><br/>A huge battle broke out!<br/><br/>However, when the battle here broke out completely.<br/><br/>When Wang Xian received this message from Mu Li tribe, his gaze froze slightly.<br/><br/>His figure moved and he rushed towards Lin Niu and the rest at a terrifying speed.<br/><br/>He did not expect that tianci would be discovered by a heaven’s origin creator.<br/><br/>Furthermore, he was discovered in such a manner.<br/><br/>In Wang Xian’s opinion, the Heaven’s origin creation treasure in Tianci’s body had a very strong concealment ability.<br/><br/>A Tianyuan creator would only be able to sense it when he was a few dozen meters away from Tianci.<br/><br/>A distance of a few dozen meters could be said to be very close!<br/><br/>Normally, such a powerhouse would not be so close to tianci!<br/><br/>But now, a Tianyuan creator wanted to kill Tianci and the rest casually.<br/><br/>Lin Niu had no choice but to make a move!<br/><br/>“It’s a little too early to be discovered! ”<br/><br/>Wang Xian thought to himself and frowned slightly.<br/><br/>Currently, Tianci’s strength was only at the third level of the universe dominator. Although the Heaven’s origin creation treasure was still growing, it had yet to reach the maturity stage.<br/><br/>It wasn’t even close to the maturity stage.<br/><br/>According to Wang Xian’s estimation, it would take another 100 to 200 million time for Tianci to reach the Heaven’s origin creation stage.<br/><br/>When Tianci reached the Heaven’s origin blessed realm, the ultimate treasure of the Heaven’s origin blessed realm in his body should have also reached its maturity stage.<br/><br/>The reason why he could grow so quickly was also related to the ancestral tree in Wang Xian’s bodv.<br/><br/>When Tianci was young, the ancestral tree had been infusing energy into him.<br/><br/>Although a branch was removed, it had at least shortened the growth period of the ultimate treasure of the Heaven’s origin blessed realm in his body by 100 million years.<br/><br/>Forget it. If I really can’t do it, Pll bring Tianci to the tree of chaos<br/><br/>Wang Xian thought to himself. A cold expression slowly appeared in his eyes.<br/><br/>That light-attributed Tianyuan destiny powerhouse actually wanted to snatch tianci away.<br/><br/>“HMPH!”<br/><br/>He snorted coldly and quickly shuttled under the surface of the water.<br/><br/>The Whirlpool Sea region was a region where the concentration of elemental beasts was relatively high.<br/><br/>It was the domain of the elemental beasts and a paradise.<br/><br/>It was also the place where they were given training by the heavens!<br/><br/>It was not close to the Mu Li tribe!<br/><br/>Even if Wang Xian arrived at the nearest tribe through the teleportation formation within the Mu Li tribe, he would still need a day to fly at full speed!<br/><br/>However, Lin Niu was able to hold on for a day when he was fighting against the Heaven’s origin creator!<br/><br/>For a Heavenly Yuan creation realm expert of the same level, even if they were to fight with their lives on the line, it would still take five to six days, or even more than ten days to determine the victor.<br/><br/>Unless both sides were willing to risk their lives, only then would it be possible for one of them to die within a day!<br/><br/>However, it was clear that Lin Niu would not fight with his life on the line!<br/><br/>Time passed by minute by minute.<br/><br/>At a place in the Whirlpool Sea, Lin Niu and the light attribute Heavenly Yuan creation realm expert were constantly fighting.<br/><br/>“Defend? How long can you defend? Hahaha, let’s see how long you can hold<br/><br/>In the center of the battlefield, Lin Niu and the Holy Father were fighting.<br/><br/>In the beginning, the light-attributed heavenly fate expert didn’t care about his life at all. He wanted to end the battle as soon as possible.<br/><br/>After exchanging a few injuries with him, Lin Niu calmed down and started to defend!<br/><br/>This made the Heavenly Yuan creation realm expert reveal an excited expression. He thought that Lin Niu was not his match and did not dare to engage in a life and death battle with him.<br/><br/>His eyes shone with a fiery glow as terrifying attacks came one after another!<br/><br/>“HMPH!”<br/><br/>There were some injuries on his body. These injuries were not light.<br/><br/>Similarly, the light-attributed heavenly Yuan creator also had wounds on his body.<br/><br/>The wounds were only slightly lighter than his.<br/><br/>If it was a real life-and-death battle, the chances of Lin Niu dying were very high!<br/><br/>The other party’s strength, treasures, and methods were slightly stronger than his.<br/><br/>However, there was no need for him to fight to the death..\t\t\t\t\t\t</div>", "images": {}, "success": true}