{"id": 1138, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074278.html", "title": "Chapter 4141 - Chapter 4141: 4140", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4141 - Chapter 4141: 4140</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4141: 4140<br/><br/>Translator: 549690339<br/><br/>“Break! ”<br/><br/>The Holy Father Stared at the invisible energy shield in front of him. He paid the price and attacked again!<br/><br/>Blood flowed out of his body uncontrollably.<br/><br/>However, this time, the energy shield in front of him was broken by him.<br/><br/>“Boom!”<br/><br/>However, at this moment, the attack of the Five Elements Millstone had arrived!<br/><br/>He gritted his teeth and looked back with blood-red eyes. Two beams of holy light shot out of his eyes!<br/><br/>The holy light turned into the shadows of countless living beings and attacked the five elements Millstone! “Whoosh! Whoosh! Whoosh! ” “Whoosh! Whoosh! ”<br/><br/>“Come on, continue to fight! Don’t Run! ”<br/><br/>Lin Niu and Wang Xian rushed over quickly.<br/><br/>Lin Niu stared at the Holy Father and roared furiously with a ghastly expression!<br/><br/>They attacked the Holy Father at the same time, one on the left and one on the right!<br/><br/>“I will remember all of you. Just you wait. I will make you pay ten times or a hundred times the price! ”<br/><br/>The Holy Father’s expression was extremely ugly when he saw this scene!<br/><br/>He opened his mouth with some heartache, and a cross appeared in front of him!<br/><br/>The cross slowly began to melt, and a black hole appeared in front of him!<br/><br/>His body moved, and he directly entered the black hole.<br/><br/>The moment he entered, the black hole disappeared.<br/><br/>“Oh? Boss, this guy really has many tricks. He actually let him escape again!”<br/><br/>Lin Niu’s expression changed slightly when he saw his holy father escaping again!<br/><br/>“Let me see how many trump cards he has up his sleeves! ”<br/><br/>Wang Xian also raised his eyebrows. He didn’t expect this guy to have trump cards and treasures!<br/><br/>Wang Xian’s body trembled. He sensed the location and distance of his escape through the void.<br/><br/>“Netherworld Dragon ‘s pursuit! ”<br/><br/>In the next moment, Wang Xian’s eyes focused. A black hole also appeared in front of him!<br/><br/>Wang Xian looked at the linniu. The LINNIU’s body moved and flew directly into the black hole. He followed closely behind!<br/><br/>Buzz<br/><br/>It was located in the sky above the source of fire.<br/><br/>Below, Raging Flames soared into the sky, illuminating the entire void until it was red!<br/><br/>Countless fire spirits were floating in the surrounding void. From Afar, it looked exceptionally magnificent!<br/><br/>A black hole suddenly appeared out of thin air!<br/><br/>In the next second, an incomparably miserable figure covered in blood and emitting light attribute slowly emerged from the black hole.<br/><br/>He panted heavily, his expression incomparably cold and filled with killing intent!<br/><br/>“You all wait, wait for me! ”<br/><br/>He said with a face full of killing intent.<br/><br/>This time, he had used up two treasures. To him, it was not a small loss!<br/><br/>His expression kept changing as he thought about what he should do next!<br/><br/>Buzz<br/><br/>However, at this moment, a black hole appeared beside him!<br/><br/>When this black hole appeared, he was shocked and a hint of fear appeared on his face.<br/><br/>“Let me see if you still have any trump cards to escape!”<br/><br/>Wang Xian’s voice rang in his ears. When the Holy Father saw him and the unicorn ox appear from the black hole, his heart sank!<br/><br/>Boom<br/><br/>Without any hesitation, he immediately fled into the distance!<br/><br/>Searching for enemies in the Void! ”<br/><br/>“Mighty Heavenly Dragon! ”<br/><br/>Wang Xian let out a low growl. In the sky above, a gigantic divine dragon that was millions of kilometers long was suspended in the void. The terrifying divine dragon attacked the Holy Father!<br/><br/>Whoosh! Whoosh<br/><br/>The LINNIU’s eyes locked onto the Holy Father. His body moved and he chased after him at the same speed!<br/><br/>Holy Father saw that he was locked onto. With his current injuries, his speed had been greatly reduced. He wasn’t as fast as Wang Xian and Lin Niu!<br/><br/>The chassis in his hands had been completely depleted.<br/><br/>After entering the six paths universe, he only brought two chassis.<br/><br/>In his opinion, with two chassis, he could escape even if he encountered a heaven origin creator powerhouse from the six paths universe.<br/><br/>Moreover, if he were to bring more chassis here, it would be a huge loss if he were to really perish.<br/><br/>It was so huge that he could not bear it!<br/><br/>Now, he no longer had a chassis!<br/><br/>Without a chassis, what would he do if he could not escape?<br/><br/>He felt a little despair in his heart!<br/><br/>However, at this moment, Wang Xian would not let him off.<br/><br/>The Mighty Heavenly Dragon in the sky had already landed in the sky above him!<br/><br/>Lin Niu also chased after him quickly!<br/><br/>In Lin Niu’s hand was the five elements Millstone!<br/><br/>“It’s over! ”<br/><br/>When the Holy Father saw this scene, he felt a little helpless!<br/><br/>At this moment, he could at most withstand the attack of the Divine Dragon in the sky.<br/><br/>He could not withstand the attack of Lin Niu!<br/><br/>Not to mention, there was an offensive treasure that was comparable to the Heaven’s origin! “Boom!”<br/><br/>“Boom Boom! ”<br/><br/>One attack after another engulfed him.<br/><br/>At the center, there was still a burst of bright energy flashing at the beginning.<br/><br/>However, very soon, this ray of light was slowly extinguished!<br/><br/>This was the six paths universe, and the six paths universe did not have the light attribute!<br/><br/>In a battle here, he had a natural disadvantage compared to Wang Xian.<br/><br/>Coupled with the great grinding of the five elements of the Qilin Ox, without the serious injury to his chassis, his life force quickly disappeared!<br/><br/>Wang Xian sensed his life force that was rapidly disappearing. A smile appeared on his face.<br/><br/>With a move of his body, Wang Xian flew over!<br/><br/>With a casual wave of his hand, the energy impact dissipated, revealing a corpse that was rapidly falling toward the ground below!<br/><br/>Wang Xian flew over and collected all the blood from the corpse and the surrounding area.<br/><br/>The blood of a heaven origin creator was also an extremely precious treasure! “He’s dead. Haha, Boss, we’ve killed another heaven origin creator! ”<br/><br/>Lin Niu flew over and laughed out loud when he saw this. His face was filled with excitement.<br/><br/>“Foster father, foster father, you guys… you guys have killed a heaven origin<br/><br/>creator!”<br/><br/>Tianci’s face was filled with shock when he saw this scene and the corpse.<br/><br/>Today, he had been shocked by so many things.<br/><br/>It was to the extent that he didn’t even realize that he was in the source of fire.<br/><br/>A Heaven’s origin creator was killed by his foster father and the rest?<br/><br/>This had completely overturned his understanding.<br/><br/>“Although he was killed, a powerhouse at this level would have a resurrection treasure. However, he would have to pay a huge price to kill him!” Wang Xian smiled and kept the corpse. He looked at Tianci and replied!<br/><br/>“You guys are too powerful, foster father. You guys are too powerful. The battle just now was terrifying! ”<br/><br/>“Foster father, I didn’t expect you to be so powerful. So Powerful! ”<br/><br/>Tianci widened his eyes. He could not digest these things and continued to exclaim incoherently.<br/><br/>“Now you should know something. Lin Niu and I are not creatures from the six paths universe. We belong to other universes. Of course, this light-attributed heavenly fate expert belongs to other universes as well! ”<br/><br/>“When we enter this universe, we will be suppressed by the will of the six paths universe. Our strength will be suppressed to below the heavenly fate realm. The battle just now was nothing. ”<br/><br/>“Alright, we should return as soon as possible to prevent any accidents from happening. Also, we need to make some preparations!”<br/><br/>Wang Xian flew to Lin Niu’s side and patted Tianci’s head as he said with a smile..\t\t\t\t\t\t</div>", "images": {}, "success": true}