{"id": 1133, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074258.html", "title": "Chapter 4136 - Chapter 4136: 4135 Was Discovered", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4136 - Chapter 4136: 4135 Was Discovered</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4136: 4135 was discovered<br/><br/>Translator: 549690339<br/><br/>“Holy Father, we’ve been searching for 80 million years. Now, the six universes have formed a team of experts. Many of our experts have been killed by them. We Can’t go on like this! ”<br/><br/>In the Whirlpool Sea area, two figures respectfully knelt in front of an old man and continued to report!<br/><br/>“We’ll search for another 100 million years. If we don’t find anything after 100 million years, we’ll leave again!”<br/><br/>The old man stood in the air and said indifferently!<br/><br/>The two people kneeling on the ground didn’t dare to resist at all and immediately replied!<br/><br/>Search carefully. If I find out that half of you are still alive after 100 million years, I’ll test you two. If you can find information about the treasure, I won’t let anything happen to you in the upcoming Calamity Battle! ”<br/><br/>The old man suddenly looked at them and said calmly!<br/><br/>His words caused the bodies of the two kneeling people to tremble violently, and a trace of shock appeared on their faces!<br/><br/>The old man’s gaze shifted from them and directly flew into the distance!<br/><br/>The two kneeling people looked at each other, and their expressions were abnormally ugly!<br/><br/>The Holy Father’s order had already been given, and they knew that they had no choice.<br/><br/>They had to search carefully for the next 100 million years. And they had to search wantonly.<br/><br/>They couldn’t care less about how much they sacrificed.<br/><br/>Otherwise, if they didn’t search wantonly and didn’t find any treasures, and if half of them weren’t killed by the powerhouses of the six paths universe, then they might be the ones who died in the end.<br/><br/>They had no doubt that the Holy Father would destroy them in the end.<br/><br/>The two figures slowly stood up and flew into the distance.<br/><br/>In front of them, the Holy Father scanned his surroundings. Sensing the energy fluctuations in front of him, he slowly stretched out his hands.<br/><br/>A luxurious light attribute robe draped over his body, making his figure completely concealed!<br/><br/>“Captain TIANCI, we’ll be relying on you to kill the exploding turtle this time. ” “Okay, let’s try to kill everyone without any casualties this time.”<br/><br/>In the front, tianci and more than a dozen students from the Mu Li tribe were flying at high speed!<br/><br/>As the most outstanding disciple of the Mu Li tribe, Tianci exuded a strong sense of confidence.<br/><br/>His handsome face had a comfortable smile on his face.<br/><br/>The surrounding students were obviously led by him,<br/><br/>a hundred kilometers in front of them, the Holy Father Glanced at tianci and the others.<br/><br/>Soon, the distance between them was only ten or so kilometers, and they were still getting closer.<br/><br/>The ten or so students obviously didn’t see or sense the existence of this holy father.<br/><br/>They continued to fly forward.<br/><br/>“HMM?”<br/><br/>As they approached, Lin Niu, who was lying inside Tian Ci’s spatial item, suddenly opened his eyes.<br/><br/>That one-eyed man was looking outside.<br/><br/>He was looking at a figure not far away, and his eyes were sparkling.<br/><br/>In order to prevent being discovered, Lin Niu didn’t look too much and shifted his gaze.<br/><br/>He hesitated for a moment, took out his communication device, and sent a message to Wang Xian.<br/><br/>“Boss, we have just encountered a light-attributed Heaven’s origin creator. We haven’t pulled away from him yet. ”<br/><br/>After Lin Niu sent the message, he waited quietly.<br/><br/>He didn’t inform Tianci and the rest to leave either.<br/><br/>This was because the Heaven’s origin creator was too close to them.<br/><br/>If he told them, it would attract the attention of the Heaven’s origin creator.<br/><br/>Tianci had a heavenly yuan creation treasure in his body, but even a heavenly yuan creation realm expert wouldn’t be able to discover the situation in his body unless he was dozens of meters away from tianci.<br/><br/>Hence, Lin Niu didn’t act rashly!<br/><br/>“According to the direction and location they’re flying, Tianci and the others will stagger away from that old guy. There’s a distance of four to five thousand meters, they shouldn’t be discovered.”<br/><br/>Lin Niu looked ahead and calculated in his heart.<br/><br/>Lin Niu now had a branch of Tianci’s heavenly creation true treasure, and it was very powerful in terms of concealment.<br/><br/>Similarly, only a heavenly creation great being that was dozens of meters away from him would be able to discover him.<br/><br/>As long as he did not stare at him and not make him feel anything, he would not be discovered even if he did not have a heavenly creation level true treasure to scout.<br/><br/>“More and more heavenly creation-level great beings are entering the six paths universe. Where are the heavenly creation-level true treasures hidden? The chances of getting them are too low. ”<br/><br/>“However, I can’t give up even if it’s a one in ten thousand chance. Pll search here for another 100 million years. Otherwise, I won’t be satisfied. ”<br/><br/>Holy Father strolled in the air and murmured.<br/><br/>He was a little unhappy.<br/><br/>He swept his gaze around and once again glanced at a spot not far away.<br/><br/>There, the ten or so students of tianci were constantly discussing and making plans for their future training.<br/><br/>When the Holy Father heard this, he waved his somewhat irritated arm and an invisible energy enveloped tianci and the others!<br/><br/>(‘F * ck!”<br/><br/>At the same time, a few kilometers to the right.<br/><br/>Lin Niu sensed that the light-attributed Tianyuan creator had suddenly attacked. His expression changed slightly!<br/><br/>“D * mn it. This guy obviously didn’t sense Tianci or me. He wants to kill<br/><br/>Tianci and the rest! ”<br/><br/>Lin Niu’s eyes revealed a cold expression. He instantly sent a message to Wang<br/><br/>Xian!<br/><br/>Buzz<br/><br/>In the next instant, Lin Niu’s figure appeared directly beside Tian Ci.<br/><br/>A surge of energy gushed out from his body.<br/><br/>The energy directly knocked out more than a dozen students beside Tian Ci.<br/><br/>A surge of energy enveloped them before they were put away.<br/><br/>At the same time, a surge of energy also enveloped Tian Ci’s body.<br/><br/>Boom<br/><br/>Following that, a surge of energy landed on the defensive barrier.<br/><br/>The sudden change and Lin Niu’s sudden appearance and attack caused Tianci, who still had a smile on his face, to completely freeze.<br/><br/>He looked at Lin Niu in shock!<br/><br/>“There’s an expert who wants to kill all of you. ” Lin Niu looked at the stunned tianci and said!<br/><br/>“Little Niu, you actually know how to speak?”<br/><br/>Tianci looked at Lin Niu, who suddenly spoke, and a stunned expression appeared on his face.<br/><br/>This was a ‘pet’his adoptive father had given him on his first birthday.<br/><br/>At that time, his adoptive father had said that Lin Niu was his little brother and that he would follow him to protect his own safety.<br/><br/>After nearly a hundred million years, other than his slightly cute appearance, Lin Niu did not show any difference.<br/><br/>Now, he actually suddenly attacked and actually spoke in human language.<br/><br/>This made Tianci very surprised!<br/><br/>“Let’s leave this place immediately! ”<br/><br/>Lin Niu was somewhat speechless at the way Tianci addressed him.<br/><br/>However, this was not the time to talk to tianci.<br/><br/>Right now, the other party had yet to discover the situation inside Tianci’s body.<br/><br/>They had to leave this place immediately and get rid of him!<br/><br/>“Let’s Go! ”<br/><br/>As Lin Niu spoke, he directly enlarged and Ling Tianci sat on his ten-meter-long body.<br/><br/>Then, Lin Niu quickly flew to the back!\t\t\t\t\t\t</div>", "images": {}, "success": true}