{"id": 1132, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074254.html", "title": "Chapter 4135 - Chapter 4135: 4134 Tianci Was Discovered", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4135 - Chapter 4135: 4134 Tianci Was Discovered</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4135: 4134 tianci was discovered<br/><br/>Translator: 549690339<br/><br/>“Thank you! ”<br/><br/>Mu Liyin ‘Er’s eyes flickered as she looked at Wang Xian beside her. She could not help but thank him.<br/><br/>Wang Xian’s strength had exceeded her expectations.<br/><br/>This was too unbelievable!<br/><br/>Wang Xian’s strength was already at the top of the Mu Li tribe.<br/><br/>“You don’t have to thank me. You saved my life. Compared to this, what I did was just a small matter.”<br/><br/>Wang Xian smiled and shook his head.<br/><br/>“It’s really lucky that you can teach tianci. No Wonder Tianci’s strength has improved so quickly. It’s all because of your help! ”<br/><br/>Mu Liyin ‘er said gratefully.<br/><br/>When tianci first started to cultivate, his talent was very poor.<br/><br/>Later on, for some unknown reason, his strength suddenly improved by leaps and bounds. At that time, she was still happy for a long time.<br/><br/>Now, it seemed that it was possible that Wang Xian was helping her behind the scenes.<br/><br/>With Wang Xian’s powerful strength, he helped tianci cultivate day and night. The improvement was simply too terrifying.<br/><br/>The Masters of the universe at level seven were constantly teaching him. With such treatment, there was no other person in the entire Mu Li tribe.<br/><br/>(‘I didn’t help much. ”<br/><br/>When Wang Xian heard it, he knew that she had some misunderstanding. He shook his head at her.<br/><br/>Mu Liyin c er smiled.<br/><br/>“Miss Mu Liyin c er, would you like to rent a house?”<br/><br/>At this moment, before Mu Liyin ‘er could speak, an old man walked over and spoke.<br/><br/>The topic changed.<br/><br/>Next, Wang Xian bought the shop directly.<br/><br/>In the six paths universe, Wang Xian still bought some of the currency of this universe.<br/><br/>Moreover, under normal circumstances, currency was a resource. As long as the value was about the same, the other party would agree.<br/><br/>“Thank you very much, Miss Mu Liyin’er. Let me treat you to a meal today! ”<br/><br/>Wang Xian said to Mu Liyin’er.<br/><br/>“Sure!”<br/><br/>Mu Liyin ‘er nodded and the two of them went to eat!<br/><br/>Wang Xian moved to this place and had a leisurely day.<br/><br/>Tianci often came over. He called his mother and the three of them had a meal together.<br/><br/>It was interesting for Tianci to talk about his matters in school!<br/><br/>Time passed quickly.<br/><br/>Tens of thousands of years.<br/><br/>Tianci had grown from a child to a big boy!<br/><br/>The Ultimate Treasure of Tianyuan in his body was also improving rapidly!<br/><br/>During this period, Wang Xian also returned to the Dragon Palace for some time!<br/><br/>With an lie around, it was very convenient for him to travel back and forth.<br/><br/>“Mom, Foster Father, our academy will hold a trial tomorrow. After the trial, the top ten will be selected to participate in the six paths competition! ”<br/><br/>“This time, I will definitely be able to get into the top ten and shine in the six paths competition. At that time, I will let everyone know that mom has a good son like me!”<br/><br/>Ninety million years passed.<br/><br/>For the Mu Li tribe, a child had to stay in the academy for at least 200 million years from the moment he entered the academy.<br/><br/>For powerful cultivators who generally had more than 30 billion years of lifespan, 200 million years in the academy was not a lot! “Okay, okay. I don’t expect you to get a name, as long as you are safe! ” Mu Li Yin ‘er looked at tianci and said with a smile!<br/><br/>“That won’t do. I want to get a good ranking. I will protect you in the future, Mom. ”<br/><br/>Tianci shook his head, with a determined gaze, he said, “The principal said that the catastrophe is coming in a billion years. At that time, it will be a world-shaking battle. The weak will find it hard to survive. I will have great strength to protect Mom! ”<br/><br/>“Alright, Alright. Mom will be very happy with your words! ”<br/><br/>Mu Liyin ‘er nodded happily.<br/><br/>“When will the six paths competition be held?”<br/><br/>Wang Xian asked Tianci.<br/><br/>“The Dean will begin ten million years after our training ends. ”<br/><br/>Tianci looked at Wang Xian and said, “Foster father, my cultivation speed is much slower now. I still want to be the champion. It seems like it will be a little difficult now! ”<br/><br/>Currently, tianci had already reached the level of a universe Knight Level 3 in his water attribute cultivation.<br/><br/>He was definitely a top-notch heaven’s favorite in the Mu Li tribe.<br/><br/>Currently, Tianci was the pillar of his generation. Even those who were much older than him were not as strong as him.<br/><br/>The Mu Li tribe was the most outstanding existence in the past few billion years.<br/><br/>They were highly regarded by the powerhouses in the Academy!<br/><br/>And the six paths competition that was about to start was organized by the six paths universe and the two great tribes.<br/><br/>And these two great tribes were the two tribes that had great beings in the<br/><br/>Heavenly Yuan creation realm.<br/><br/>This time, the six paths competition.<br/><br/>To put it bluntly, it was the same as the nine origin universe sword and the Magic Universe. They were all preparing for the arrival of the calamity.<br/><br/>Using the last bit of time to cultivate another batch of top-tier great beings to deal with the arrival of the calamity.<br/><br/>If he could get a good ranking in the six paths competition, he would be able to enter the top-tier treasure land of the six paths universe!<br/><br/>To any participant, to be able to get a ranking was a great honor.<br/><br/>All the favored sons of Heaven from all the tribes in the six paths universe participated.<br/><br/>And the cultivation of the heaven-bestowed water element had reached the third level of a universe knight. In terms of wood element cultivation, it was even more terrifying.<br/><br/>Now, he had already broken through to the third level of a universe master.<br/><br/>To be able to reach such a level in less than 100 million years, it could be said to be extremely terrifying.<br/><br/>Of course, this was all because of the ultimate treasure of the Heaven’s origin.<br/><br/>“It’s normal. Your cultivation will get slower and slower in the future.”<br/><br/>Wang Xian heard what he said and replied with a smile.<br/><br/>He was forced to cultivate the water attribute. As he had the wood attribute, it allowed his cultivation speed to be faster.<br/><br/>However, when he reached a higher level of the water attribute, his cultivation speed would become slower and slower. In the end, he would lag behind others.<br/><br/>This was normal.<br/><br/>The water attribute was just a means of concealment.<br/><br/>It was just that Wang Xian wanted Tianci to have a complete life, a complete childhood and experience!<br/><br/>“That’s enough, tianci. Don’t tire yourself out. ” Mu Liyin ‘er instructed him with a happy face.<br/><br/>She was also very happy with her outstanding son.<br/><br/>A mother depended on her son. It was the same in the Mu Li tribe!<br/><br/>The three of them chatted as they ate.<br/><br/>The next day, Tianci participated in the Academy’s experiential learning.<br/><br/>The instructors of the academy brought them to a place for experiential learning so that they could undergo experiential learning and fight Elemental Beasts!<br/><br/>Wang Xian didn’t pay too much attention to this.<br/><br/>The Unicorn Ox had always been by Tianci’s side or hidden in his storage space.<br/><br/>Even if there was danger, there would always be the unicorn ox.<br/><br/>“Holy Father, there is still no news at the moment. It has been 100 million years. Could it be that this treasure has already been obtained by someone?” At the source of water, in a part of the Whirlpool Sea.<br/><br/>In this area, torrential rain was pouring down from above. On the surface of the sea below, there were terrifying whirlpools!<br/><br/>Two figures stood in front of an old man and reported to him from above!<br/><br/>“It’s over 80 million years old, and a heavenly fate treasure has been born. The hidden energy of this heavenly fate treasure is very strong, and it’s very difficult to discover. In addition, there are all sorts of detection treasures set up outside the six paths universe. Once someone obtains one, they’ll be immediately discovered when they bring it out<br/><br/>“As for the six paths universe, they are still searching for the heavenly fate treasure, so the chances of them obtaining it aren’t high either.”<br/><br/>The old man spoke indifferently!\t\t\t\t\t\t</div>", "images": {}, "success": true}