{"id": 1137, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074274.html", "title": "Chapter 4140 - Chapter 4140: 4139 Killed The Heaven’S Origin Manifestation Once Again", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4140 - Chapter 4140: 4139 Killed The Heaven’S Origin Manifestation Once Again</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4140: 4139 killed the Heaven’s origin manifestation once again<br/><br/>Translator: 549690339<br/><br/>“Damn it, they want to fight me! ”<br/><br/>When the Holy Father saw Wang Xian facing his attack and didn’t Dodge at all.<br/><br/>When he wanted to fight him head-on, his expression changed drastically.<br/><br/>He was confident that he could kill Lin Niu. However, now that there was another Heaven’s origin manifestation powerhouse, he was definitely not their match!<br/><br/>Under such circumstances, if he continued to fight, he would definitely be the one to die.<br/><br/>He had to escape!<br/><br/>However, if he wanted to escape, he had to get rid of their attacks.<br/><br/>Boom<br/><br/>At this moment, Wang Xian’s dragon claws collided with the staff in his hand.<br/><br/>A terrifying energy surged out in all directions.<br/><br/>The rain in the sky was instantly evaporated.<br/><br/>Even the seawater below had been annihilated by the energy and disappeared.<br/><br/>Wang Xian’s dragon claws instantly turned into a bloody mess. Each of his claws looked as if they were about to fall off.<br/><br/>However, the Holy Father didn’t feel good either.<br/><br/>Their battle was purely close combat. Their main bodies were the first to suffer the impact of the energy.<br/><br/>The arm that he was holding the staff in his hand collapsed immediately. His flesh and blood disappeared, leaving behind only his pale bones!<br/><br/>It also looked abnormally tragic!<br/><br/>Buzz<br/><br/>However, at this moment, the five elements millstone followed closely behind Wang Xian.<br/><br/>The five-colored divine dragon head attacked him.<br/><br/>The distance between the two parties was too close.<br/><br/>He was already fighting with the Kylin Bull and was prepared to end the battle quickly. Therefore, he was heavily injured.<br/><br/>Now that Wang Xian had suddenly attacked him, there was no way for him to dodge.<br/><br/>After dodging Wang Xian’s attack, the attacks from the five elements grinding also landed on his body.<br/><br/>Boom<br/><br/>The Five Elements Dragon head landed on his body directly.<br/><br/>The Holy Father’s eyes were about to split open as his entire body emitted a dazzling white light.<br/><br/>He took out a divine herb and placed it directly into his body!<br/><br/>Boom<br/><br/>The Five Elements Dragon head landed on his body and the spot on his chest emitted a powerful radiance!<br/><br/>A shield of light with patterns on it blocked the attack in front of him.<br/><br/>However, even though it blocked the attack of the Five Elements Dragon Head, its body fell down violently.<br/><br/>When Lin Niu saw this scene, his gaze froze.<br/><br/>“Fight, don’t you want to fight? Hahaha, let’s see who dies today. F * ck, I’ll let you be arrogant! ”<br/><br/>Lin Niu raised his head slightly, and the blood-red energy all over his body began to gather.<br/><br/>Behind him, the shadow of a Demon God appeared.<br/><br/>The Demon God slowly spread his arms and embraced the Holy Father!<br/><br/>The threat of death once again enveloped the Holy Father.<br/><br/>The Holy Father saw the attacks one after another, and he roared furiously.<br/><br/>The magic staff that had fallen to the side instantly arrived above him. The magic staff turned into a defensive barrier and wrapped around him.<br/><br/>Boom<br/><br/>The Demon God’s embrace wrapped around the holy father. A great terror was happening inside.<br/><br/>Countless demons were tearing at him from within!<br/><br/>Wang Xian moved his body and waved his arm. The space lock of the Starfield fragment was activated.<br/><br/>At the same time, stars appeared one after another, forming a line that connected the city!<br/><br/>Buzz<br/><br/>The energy of the Demon God’s embrace started to dissipate slowly. Wang Xian waved his arm and the stars that contained terrifying power attacked the Holy Father!<br/><br/>“This… foster father, foster father is here!”<br/><br/>From the moment Wang Xian arrived to the moment he launched his attack, everything happened in an instant.<br/><br/>Tianci, who was lying on the body of the Unicorn Ox, saw Wang Xian’s figure. His eyes widened and his face revealed a look of pleasant surprise.<br/><br/>When he saw the terrifying stars lined up in a row with no end in sight, his face was filled with shock.<br/><br/>His foster father was definitely a powerhouse in the Heaven’s origin realm.<br/><br/>A top-notch powerhouse in the world.<br/><br/>“All of you deserve to die, all of you deserve to die. If you dare to kill me, I will spread the news that all of you have obtained the ultimate treasure in the Heaven’s origin realm. ”<br/><br/>When the Holy Father saw the terrifying attacks coming at him one after another, his miserable body trembled violently as he shouted loudly!<br/><br/>“Kill him with all your strength! ”<br/><br/>Wang Xian stared at the Holy Father with a cold expression in his eyes. Since he had discovered tianci, he could not let him go no matter what would happen next.<br/><br/>On the contrary, after killing him, he would resurrect in his own universe. Even if he were to rush over, he would need a long time.<br/><br/>As for saying that he would announce TIANCPs matter to the public.<br/><br/>Wang Xian felt that the possibility was very small.<br/><br/>Now, kill him and Buy More Time!<br/><br/>As long as Tianci grew up, he would be unafraid of anyone. It would be impossible for other powerhouses to snatch the ultimate treasure of Tianyuan from him!<br/><br/>“Yes, Boss!”<br/><br/>Lin Niu immediately replied loudly. Energy began to brew on his body!<br/><br/>When the attacks from the planets were over, Lin Niu would launch another full-powered attack!<br/><br/>When the Holy Father heard Wang Xian’s words, he saw the terrifying stars.<br/><br/>He sensed his body and let out a furious roar!<br/><br/>With a move of his palm, a special ray of light appeared in his hand.<br/><br/>This long ray of light instantly flew into the distance.<br/><br/>It was so fast that Wang Xian and the rest could not react in time.<br/><br/>When the stars were about to land on his body, his body disappeared without a trace!<br/><br/>When Wang Xian saw this scene, his eyes narrowed slightly.<br/><br/>He knew that existences at this level had some means of escape.<br/><br/>Otherwise, they would not dare to step into the six paths universe!<br/><br/>However, it was a pity that he was severely injured when he was attacked by Lin Niu in the beginning!<br/><br/>His strength was now less than 50% !<br/><br/>“You want to escape! ”<br/><br/>“Chase after him! ”<br/><br/>Wang Xian growled at Lin Niu and chased after the line of light!<br/><br/>“Just you wait, just you wait. The Ultimate Treasure of Tianyuan belongs to me, belongs to me! ”<br/><br/>The Holy Father attached himself to the line of light and escaped quickly!<br/><br/>His face was filled with malevolence!<br/><br/>He still had a chance after this failure. He had to get his hands on the Heavenly Yuan Destiny Treasure!<br/><br/>However, at this moment, the sound of collision suddenly sounded.<br/><br/>In front of him, a five elements energy blocked the fast flying of the thin thread!<br/><br/>When the Holy Father saw this scene, his expression changed slightly!<br/><br/>He recovered from the thin line’s state, waved the staff in his hand, and smashed it forward!<br/><br/>“Boom!”<br/><br/>An invisible energy barrier appeared, and under his attack, it trembled slightly.<br/><br/>“Boom!”<br/><br/>Seeing the energy barrier trembling, his arm emitted a radiance that was transmitted to the staff, and he gritted his teeth and continued to attack!<br/><br/>“Crack Crack Crack! ”<br/><br/>Cracks started to appear on the energy shield!<br/><br/>He raised the staff in his hand again and continued to attack!<br/><br/>“If you want to attack, attack. If you want to escape, can you escape?”<br/><br/>At this moment, Wang Xian and Lin Niu were standing on top of a star at the back. They were flying towards him rapidly!<br/><br/>Boom<br/><br/>Wang Xian was holding the five elements millstone in his hand. With a wave of his arm, the five elements millstone turned into a terrifying killing weapon and smashed towards him!<br/><br/>“Damn it! ”<br/><br/>When the Holy Father saw Wang Xian and the rest chasing after him, his expression changed drastically again!\t\t\t\t\t\t</div>", "images": {}, "success": true}