{"id": 1134, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074262.html", "title": "Chapter 4137 - Chapter 4137: The Battle Of 4136 Erupted", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4137 - Chapter 4137: The Battle Of 4136 Erupted</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4137: The Battle of 4136 erupted<br/><br/>Translator: 549690339<br/><br/>The holy father casually waved his hand and did not look at the dozen or so youths beside him.<br/><br/>From his point of view, he only waved his hand and caused the dozen or so noisy ants to turn into ashes.<br/><br/>If he was in a bad mood, so what if he crushed a few ants?<br/><br/>However, when he saw that his attack was blocked.<br/><br/>When he saw the expert that looked like a demonic beast that suddenly appeared, his face revealed a stunned expression.<br/><br/>“This is? That Demon Beast is a heavenly creation realm great being. The energy he used is not from the six paths universe. What’s going on?”<br/><br/>The Holy Father’s gaze froze.<br/><br/>“This is strange. It’s very strange. Why would a heavenly creation realm great being follow a universe Knight and protect him?”<br/><br/>“Impossible. Why would a heavenly creation great being protect a six paths universe kid and make him sit on his own body? There must be something wrong! ”<br/><br/>His eyes were shining, and his mind was full of thoughts.<br/><br/>“Light covers the land! ”<br/><br/>“Holy light watches the land! ”<br/><br/>The holy father didn’t hesitate. He waved his hand, and a staff appeared in his hand.<br/><br/>His pupils emitted a luster.<br/><br/>The energy in his pupils was injected into his hair.<br/><br/>A holy light instantly enveloped the area in front of him.<br/><br/>It was so fast that it was much faster than Lin Niu.<br/><br/>Scram! ”<br/><br/>Lin Niu roared when he saw the holy light enveloping them.<br/><br/>The devil-like symbols on his scales rose into the sky.<br/><br/>They formed a blood-red sky.<br/><br/>The sky blocked the sky behind him!<br/><br/>The light and the sky clashed, and sizzling sounds rang out continuously!<br/><br/>Condense! ”<br/><br/>The Holy Father’s figure moved, stepping on the Holy Light as he quickly gave chase!<br/><br/>At the same time, the Holy Light in the sky condensed into an incomparably huge eye of holy light!<br/><br/>That Huge Eye of holy light instantly split into countless pupils.<br/><br/>The pupils covered the Lin Niu from all directions, like countless moths pouncing towards the flames!<br/><br/>“Eye of evil, Eye of Flower! ”<br/><br/>The Lin Niu sensed the situation behind him, and his expression slightly changed. A single eye similarly emitted energy. Behind him, an illusory single eye condensed into form.<br/><br/>It floated in the air.<br/><br/>In the center of this single eye, there was an extremely beautiful flower!<br/><br/>The strange and evil pupils were emitting a strange light!<br/><br/>“Heavenly Fate, you are a heavenly fate great being, yet you are protecting a universe knight realm brat from the six paths universe?”<br/><br/>Holy Father’s expression changed slightly when he saw Lin Niu’s terrifying attack. His expression was filled with solemnity.<br/><br/>His own strength belonged to an old-fashioned heavenly yuan creation realm expert.<br/><br/>An early-stage heavenly Yuan creation realm expert.<br/><br/>In other words, he could fight against two experts who had just entered the Heavenly Yuan creation realm.<br/><br/>However, according to his senses, Lin Niu’s strength was not much weaker than his!<br/><br/>Although Lin Niu had only entered the heavenly Yuan creation realm not long ago.<br/><br/>His increase in strength had absorbed all of the memories and energy of the Aga Heavenly Demon God.<br/><br/>The Asgard Heavenly Demon God was an old-fashioned heavenly yuan creation realm expert.<br/><br/>“You still need to care about what I do. Pm warning you, get lost immediately.<br/><br/>Otherwise, don’t blame me for being impolite! ”<br/><br/>Lin Niu glanced at the Holy Father and said with a face full of killing intent!<br/><br/>“To be able to make a heavenly yuan creation realm expert willingly stand by a kid’s side? Then… ”<br/><br/>The Holy Father did not care about Lin Niu’s majesty, his eyes slowly blossomed with a fiery glow.<br/><br/>A Heavenly Kismet being protecting a six paths universe kid was definitely strange.<br/><br/>What kind of situation could make a heavenly kismet being do such a thing?<br/><br/>Only when it involved a huge treasure.<br/><br/>It was ready to be revealed.<br/><br/>The six paths universe’s Heavenly Yuan Creation Treasure!<br/><br/>“Light, it’s everywhere!”<br/><br/>The Holy Father’s body immediately released a burst of light, and the entire light directly enveloped the world!<br/><br/>It also instantly enveloped Lin Niu.<br/><br/>Lin Niu saw that violent energy surged from his body, supporting the surrounding domain.<br/><br/>“Heavenly Yuan creation, Little Niu is actually a heavenly yuan creation level existence?”<br/><br/>At the same time, tianci, who was on the body of the Unicorn Ox, was completely dumbfounded!<br/><br/>He felt the terrifying might of the Unicorn Ox and the holy father in front of him.<br/><br/>Hearing their words, his heart was in turmoil!<br/><br/>Heavenly Fate, what level of existence was this?<br/><br/>He knew this.<br/><br/>It was a supreme existence.<br/><br/>It was the highest level existence in the entire six paths universe.<br/><br/>According to the dean of the Academy, there were three supreme lords in their six paths universe.<br/><br/>These three lords were the strongest in their six paths universe.<br/><br/>And the realm of these three lords was the Heavenly Yuan Destiny Realm. And now, the calf that had been following him for nearly 100 million years and had never made a move or spoken to him was actually the heavenly yuan destiny realm.<br/><br/>How could he dare to believe this?<br/><br/>This was simply too shocking for him!<br/><br/>That calf was a heavenly fate powerhouse. wasn’t his foster father the same?<br/><br/>The calf was his foster father’s little brother!<br/><br/>This? ? ? ?<br/><br/>“Oh? This… this… how is this possible? That little fellow actually has a heavenly fate supreme treasure in his body. The six paths universe’s heavenly fate supreme treasure is actually in his body.”<br/><br/>At this moment, a slightly crazy voice sounded from the front.<br/><br/>The Holy Father’s gaze was fixed on tianci. His gaze was filled with greed, fervor, and madness!<br/><br/>A heavenly origin creation true treasure!<br/><br/>The heavenly origin creation true treasure was actually right in front of his eyes.<br/><br/>The treasure that he had been searching for for 100 million years!<br/><br/>It had actually been discovered by him!<br/><br/>Tianci felt the Holy Father’s gaze. His heart was shocked, and a wave of fear and terror surged into his heart.<br/><br/>Facing the gaze of a heavenly fate realm powerhouse, he could not withstand it at all!<br/><br/>“Oh? Damn it, I was discovered! ”<br/><br/>Lin Niu’s expression changed slightly when he saw Tianci’s identity being exposed.<br/><br/>This was not good news.<br/><br/>Tianci had not matured yet. If his identity was completely exposed, they would not be able to protect him.<br/><br/>“A heavenly fate treasure is in his body, yet you did not take it away. Is there some special reason?”<br/><br/>The Holy Father continued to speak, his breathing slowly becoming hurried. “Or are you waiting for me to take it away?”<br/><br/>“Wishful thinking! ”<br/><br/>When Lin Niu heard his words, his eyes were filled with violent killing intent.<br/><br/>He didn’t continue to run away and slowly raised his head.<br/><br/>“Demon God, Flower of death, explode! ”<br/><br/>In the sky above him, the eye with the blood-red flower in its pupil blossomed with flower petals.<br/><br/>The flower petals attacked the holy father directly!<br/><br/>“Holy Bell, today I will fight to the death to obtain shocking fortune! ”<br/><br/>The holy father was extremely fanatical. With a wave of his arm, a divine bell of light floated in the sky.<br/><br/>The Divine Bell of light grew larger and enveloped the entire world!<br/><br/>Seeing that the other party wanted to use the divine bell to trap them, Lin Niu’s eyes flickered. He did not Dodge.<br/><br/>Nor did he attack the bell..\t\t\t\t\t\t</div>", "images": {}, "success": true}