{"id": 1130, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074246.html", "title": "Chapter 4133 - Chapter 4133: The 4132 Ancestral Tree Had A Breakthrough", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4133 - Chapter 4133: The 4132 Ancestral Tree Had A Breakthrough</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4133: The 4132 ancestral tree had a breakthrough<br/><br/>Translator: 549690339<br/><br/>The reason why he went into seclusion for more than 10,000 years was because Wang Xian thought that it was possible for him to achieve a breakthrough with the Tai Chi Dragon Plate.<br/><br/>Unfortunately, he did not succeed.<br/><br/>This made him extremely helpless.<br/><br/>For the rest of the time, he would not go into seclusion under normal circumstances.<br/><br/>“By the way, I heard that the tribe is preparing to establish an elite team of the Mu Li tribe. They will select a batch of elites from every age group and train them with all their might. Has Tianci informed you about this?”<br/><br/>Mu Li Yin er asked Tianci.<br/><br/>“Mom, the Academy has informed me. I will enter the Intermediate Academy immediately. Once I enter the Intermediate Academy, I will have resources that far surpass others. ”<br/><br/>Tianci nodded.<br/><br/>“From now on, tianci, you must train hard and strive to become one of the top powerhouses in our six paths universe.”<br/><br/>Mu Li Yin er said to him.<br/><br/>By now, all living beings in the six paths universe knew about the calamity.<br/><br/>Now, all the tribes were making preparations for the calamity.<br/><br/>Gathering resources and nurturing powerhouses.<br/><br/>Just so that when the calamity came, there would be more hope for survival.<br/><br/>“Don’t worry, Mom, I Will.”<br/><br/>Tianci nodded, and then suddenly asked, “Oh right, Mom, Where’s My<br/><br/>Grandfather? I haven’t seen him for a long time. Has He gone into seclusion<br/><br/>“No, your grandfather has followed the other experts in the tribe to search for invaders from other universes. ”<br/><br/>Mu Li Yin er said to him.<br/><br/>“Invaders from other universes? Why are the other universes invading us?” Tianci asked curiously.<br/><br/>“This mother doesn’t know much. I heard from your grandfather that a powerful treasure was born in our universe. There were experts from other universes who came and wanted to snatch the treasure. The three lords in our universe are also looking for that treasure. ”<br/><br/>“Speaking of which, when Tianci was born, our universe was enveloped by the primordial purple clouds. According to rumors, that was the day that the powerful treasure was born.”<br/><br/>Mu Liyin ‘er smiled and said to him.<br/><br/>This was the first time Tianci heard his mother telling him this.<br/><br/>He was stunned and looked at Wang Xian with a stunned expression.<br/><br/>Wang Xian smiled and didn’t say anything.<br/><br/>“Foster father, do you know something?”<br/><br/>He couldn’t help but send a telepathic message to Wang Xian.<br/><br/>“You don’t need to know now. Just Live Well! ”<br/><br/>Wang Xian didn’t answer him.<br/><br/>Seeing that Wang Xian didn’t answer him, Tianci had no choice.<br/><br/>However, he had some guesses in his heart!<br/><br/>After having a meal, Wang Xian and the rest went to a sparring ground. Wang Xian gave Tianci some pointers on his offensive techniques.<br/><br/>After that, the three of them returned home.<br/><br/>Time passed by quickly once again. 100,000 years, millions of years, tens of millions of years!<br/><br/>Buzz<br/><br/>On this day, Wang Xian, who was recovering from his injuries, suddenly felt a majestic life force coming from his body.<br/><br/>A surge of wood attribute energy surged into his entire body.<br/><br/>This energy healed the injuries in his body rapidly.<br/><br/>The injuries that would take another 80 to 90 million years to heal were healing at a terrifying speed.<br/><br/>“What’s the situation?”<br/><br/>Wang Xian was stunned by the sudden situation and his eyes widened.<br/><br/>He could feel the rapid recovery of his injuries.<br/><br/>This energy that was healing his injuries originated from the ancestral tree.<br/><br/>His gaze focused and his mind was focused on the ancestral tree.<br/><br/>When he sensed the ancestral tree, his face lit up with joy!<br/><br/>At this moment, the ancestral tree had towering branches and leaves.<br/><br/>There were fruits growing on it.<br/><br/>There were soul returning fruits, endless wood embryo fruits, and ordinary embryo fruits.<br/><br/>There were also Nirvana embryo fruits.<br/><br/>The fruits were growing.<br/><br/>Each branch contained all kinds of energy.<br/><br/>In addition, there was an eye-catching branch on the main trunk of the ancestral tree.<br/><br/>There were also more than a dozen branches on this branch.<br/><br/>These branches possessed a powerful force.<br/><br/>They were extremely dazzling and eye-catching on the entire ancestral tree.<br/><br/>Even the densely packed branches and fruits around them could not cover the sharpness of this branch.<br/><br/>All of this did not surprise Wang Xian. What shocked him the most was that there were fruits beginning to condense on the top branch of the ancestral tree.<br/><br/>Through his spiritual perception, there were more than 20 fruits.<br/><br/>Each fruit was the size of a palm.<br/><br/>However, these fruits had clearly just grown and were not ripe yet.<br/><br/>“The ancestral tree has already passed its growth period and reached its maturity period?”<br/><br/>When Wang Xian saw that the original body of the ancestral tree had actually borne fruits, he revealed a pleasantly surprised expression on his face.<br/><br/>Once the ancestral tree bore fruits and the fruits matured, it meant that the ancestral tree would completely enter its maturity period.<br/><br/>It would enter its peak stage.<br/><br/>The power of the ultimate treasure of Tianyuan would be fully displayed!<br/><br/>“Now, the power of the ancestral tree is beginning to Show! ” Wang Xian’s eyes sparkled.<br/><br/>Yes, he could already sense some changes at this moment.<br/><br/>The biggest change was his injuries.<br/><br/>Currently, Wang Xian’s recovery ability had reached a terrifying level! Now, if he were to suffer a serious injury like the last time, he wouldn’t need any treasures.<br/><br/>It wouldn’t take hundreds of millions of years.<br/><br/>As long as he recovered himself, he would be able to recover completely in tens of thousands of years.<br/><br/>This recovery ability was absolutely terrifying!<br/><br/>One must know that Wang Xian’s injury last time was very serious.<br/><br/>Now, if Wang Xian’s life force was at the control level in the past and attacked him ten times at full strength, Wang Xian wouldn’t be able to completely wipe him out if he didn’t defend himself.<br/><br/>Now, he would need to attack him twenty times with all his might!<br/><br/>The powerful recovery ability allowed him to recover rapidly after suffering a huge attack!<br/><br/>The current Wang Xian could rely on this recovery ability to fight against two powerhouses who had just entered the Heaven’s origin creation stage. There was no problem at all.<br/><br/>This was because Wang Xian could exchange injuries for injuries in battle now.<br/><br/>Two powerhouses who had just entered the Heaven’s origin creation stage could not kill him at all.<br/><br/>If he were to fight Wang Xian with his life on the line, it would be hard to say who would live and who would die!<br/><br/>All of this was under the circumstances where Wang Xian did not use the five elements grindstone.<br/><br/>If he were to use the five elements grindstone, there was no need to even mention it!<br/><br/>“Impressive, truly impressive. The ancestral tree is about to enter the maturation stage and I have already obtained so many benefits. When the ancestral tree has completely entered the maturation stage, wouldn’t I be comparable to a control-level existence?”<br/><br/>“The ancestral tree is merely a heaven’s origin creation treasure with a supporting nature. What about the Offensive Heaven’s origin creation treasure on Tianci? Is it possible for him to fight against two powerhouses at the control level as soon as he has just reached the Heaven’s origin creation level?”<br/><br/>“If that’s the case, it would be too terrifying! ”<br/><br/>Wang Xian exclaimed in his heart. This possibility was very high.<br/><br/>Even if he could not fight against two powerhouses at the control level, it should not be a problem for him to fight against one or two powerhouses at the beginner level!<br/><br/>It’s a good thing that I’ve recovered from my injuries. At the very least, I can deal with any special circumstances. The next step is to nurture TIANCPs growth. I’m really looking forward to the growth of the ultimate treasure of<br/><br/>Tianyuan in his body<br/><br/>Wang Xian thought to himself!\t\t\t\t\t\t</div>", "images": {}, "success": true}