{"id": 1147, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074314.html", "title": "Chapter 4150 - Chapter 4150: 4,149 Disciples", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4150 - Chapter 4150: 4,149 Disciples</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4150: 4,149 disciples<br/><br/>Translator: 549690339<br/><br/>“HM? Knight Level 5 strength?”<br/><br/>Tianci stood on the stage and announced his strength, all the disciples around him heard him and looked at him in shock.<br/><br/>Hidden Dragon’s stage, on this stage, all of them were under 200 million years old.<br/><br/>At this age, most of them had just stepped into the knight realm.<br/><br/>With a glance, there were only a few level 3 knights!<br/><br/>Not to mention a level 5 knight.<br/><br/>There wasn’t even one in the entire arena.<br/><br/>“Mu Li tribe, a level 5 knight, so strong, he’s definitely in the top 3 in our group!<br/><br/>“Almost, how does this guy train? Why is his level so high, most importantly, he’s not from the dead tribe or the Black Earth tribe.”<br/><br/>“Wow, this level, isn’t it much higher than ours?”<br/><br/>Some youths glanced at Tian Chi who stood out from the crowd, their faces filled with envy and respect.<br/><br/>In this hidden dragon and young Phoenix Arena, all of them were the top youths of the six paths universe.<br/><br/>They came from the various large tribes.<br/><br/>Every one of them was one of the top few existences in their own tribes.<br/><br/>But now, some of them had been struck by Tian Ci!<br/><br/>“HM, not bad, to be able to train for over 90 million years to possess such strength, that’s really not bad! ”<br/><br/>In the middle of the Hidden Dragon Chick’s arena, an old man floated in the air.<br/><br/>His gaze swept over Tian Ci, nodding his head, praising him generously!<br/><br/>“HMM? What? He hasn’t even cultivated for 100 million years?” “No way! He’s only half my age, but he’s already so powerful?”<br/><br/>“Hiss, how terrifying! ”<br/><br/>Everyone in the surroundings was slightly shocked when they heard the old man’s words.<br/><br/>“I really didn’t expect that I would be invincible in the same generation. I didn’t expect this brother to be so powerful as well. Hahaha, this is interesting! ”<br/><br/>At this moment, a youth flew over from the seat of honor at the front.<br/><br/>There were more than a hundred people beside the youth.<br/><br/>The youth in the middle was at least three meters tall and his entire body was filled with explosive muscles!<br/><br/>He looked extremely thick.<br/><br/>He looked at tianci and laughed out loud!<br/><br/>“Invincible in the same generation? You Are Tujiang Tong from the Mystic<br/><br/>Earth tribe, right? Your strength is not bad, but you are not my match! ”<br/><br/>“Huala! ”<br/><br/>The group of youths from the Mystic Earth tribe flew over and landed on the<br/><br/>arena.<br/><br/>The youth in the lead swept his gaze over Tujiang Tong and tianci.<br/><br/>“The two of you aren’t my match! ”<br/><br/>He said with confidence and arrogance!<br/><br/>At his neck was a human head that was flickering with a black light. The black light reflected on his pale face, making it look extremely strange.<br/><br/>“You two are so small, I’ll send you flying with a Slap! ”<br/><br/>Tu Jiang Tong saw the youth flying over and shook his head with disdain!<br/><br/>Tian Chi’s gaze swept over them, hearing their words, he smiled too!<br/><br/>“Two knights at Level 5, if they join forces, they can barely compare to me! ”<br/><br/>He moved his palm and the water in front of him condensed, a sharp sword appeared in his hand.<br/><br/>Tianci said indifferently.<br/><br/>It was as if he was talking about something very easy!<br/><br/>The moment he finished speaking, Tu Jiang Tong and the youth from the dead tribe were slightly stunned, their eyes focused on him.<br/><br/>“Haha, I thought I was confident enough, I didn’t expect you to be even more confident and arrogant than me! ”<br/><br/>Tu Jiang Tong stared at Tianci and laughed!<br/><br/>He narrowed his eyes and walked straight towards tianci. He sized him up and slowly extended his huge palm.<br/><br/>“Very good, let’s get to know each other! ”<br/><br/>Tu Jiang Tong walked over, extended his hand and said to tianci.<br/><br/>Tianci smiled and extended his hand to shake Tianci’s!<br/><br/>“HMM?”<br/><br/>All the gazes of the surrounding youths were focused on him.<br/><br/>This was clearly an open and hidden battle.<br/><br/>A pair of huge palms and a pair of small palms were clasped together.<br/><br/>Following that, everyone could feel waves of energy brewing in their palms.<br/><br/>Some of the weaker ones could not help but take a step back!<br/><br/>Tianci and Tu Jiang Tong smiled as they looked at each other.<br/><br/>Their bodies were somewhat out of sync!<br/><br/>But soon, the smile on Tu Jiangtong’s face began to disappear.<br/><br/>Five seconds later, he quickly pulled out his arm, and his huge arm kept shaking!<br/><br/>He stared at tianci, and his expression kept changing!<br/><br/>“Not bad! ”<br/><br/>Tianci looked at him, smiled, and said.<br/><br/>“Okay, okay, okay. It really is okay. It seems that if I want to beat you, I need to use all my trump cards! ”<br/><br/>Tu Jiang Tong’s expression changed slightly as he said to Tianci with a serious expression!<br/><br/>“I’m looking forward to the duel!”<br/><br/>Tianci smiled at him.<br/><br/>“Haha, Good, good, I’m looking forward to it! ”<br/><br/>“This is interesting. It seems like the first place of our group will be decided between us and this pretty boy!”<br/><br/>Tu Jiang Tong said with a loud laugh. He was very forthright!<br/><br/>When the youth from the dead tribe heard Tu Jiang Tong address him, his face turned black and he immediately cursed!<br/><br/>Tu Jiang Tong didn’t pay much attention when he heard that.<br/><br/>“That person called Mu Li Tianci is so handsome. He’s not at a disadvantage when facing the two elites from the Black Earth tribe and the dead tribe. He even has the upper hand. ”<br/><br/>“He’s really handsome. I didn’t expect him to be able to compete with Tu Jiang Tong and the others. He’s really amazing. ”<br/><br/>Some of the young men looked at the three of them and whispered among themselves.<br/><br/>Some of the young ladies looked at Mu Litianci with stars in their eyes.<br/><br/>“He is a little high-profile.”<br/><br/>Mu Liyin ‘er had been looking at tianci from below. When she saw this scene, she frowned slightly and said!<br/><br/>“Hehe, it’s a waste of a young man to not be arrogant! ”<br/><br/>When Wang Xian heard that, he smiled faintly and did not care about it at all.<br/><br/>This was the temperament that a young man should have.<br/><br/>Modest, confident, and proud!<br/><br/>“A talented young man should naturally be more flamboyant!”<br/><br/>Mu Liyin’s father, who was standing at the side, also said with a smile. His face was filled with happiness.<br/><br/>“Yin c er, you should also go to the arena to spar with each other. The calamity is about to arrive. Next, you should also raise your own strength! ” Mu Liyin’s father said to her, “Let’s see if we can obtain a decent result.”<br/><br/>“I’ll give it a try, but I’m afraid it’ll be a little difficult, there are too many strong fighters. ”<br/><br/>Mu Li Yin ‘er said.<br/><br/>In the other arenas, there were many proud fighters.<br/><br/>In the proud fighters’ group, the strong fighters had already reached the pinnacle of the Universe Knight Realm.<br/><br/>She was much weaker.<br/><br/>However, she could still give it a try.<br/><br/>Next, the six paths convention officially began.<br/><br/>The strong disciples of the four groups also began to compete for the 1,000 spots!\t\t\t\t\t\t</div>", "images": {}, "success": true}