{"id": 1148, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074318.html", "title": "Chapter 4151 - Chapter 4151: 4150. The Storm Was Coming", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4151 - Chapter 4151: 4150. The Storm Was Coming</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4151: 4150. The storm was coming<br/><br/>Translator: 549690339<br/><br/>The competition in the six paths universe would last for a long time.<br/><br/>In fact, the six paths convention would last for a million years. The battles between the Great Beings would usually take a long time to determine the winner.<br/><br/>In addition, the disciples of the Great Beings and the elites of the six paths universe would participate in the competition, so it would naturally take a longer time.<br/><br/>It would take more than 100,000 years just to select 1,000 spots.<br/><br/>In addition, the most important thing was that after the top 1,000 were selected, the following competitions would not be held at the same time.<br/><br/>Instead, for example, the hidden dragon fledgling Phoenix Group would decide the top 500 first, and then The Prodigy group would decide the top 500.<br/><br/>If they were not held at the same time, the time would naturally be longer!<br/><br/>The experts from the tribes condensed their energy into a chair and watched and discussed.<br/><br/>The battle between the experts would be of great use to the others.<br/><br/>This was also one of the implications of the six paths conference.<br/><br/>Time passed day by day. Wang Xian sat below and watched.<br/><br/>To Tianci, it was a piece of cake for him to enter the top 1,000!<br/><br/>He could even enter it directly!<br/><br/>After more than 100,000 years of selection, the official competition began.<br/><br/>From low to high, the hidden dragons and young Phoenixes would first decide the top 500.<br/><br/>And when the competition was decided this time, tianci would also have a battle.<br/><br/>The battle was very simple for Tianci.<br/><br/>The moment he entered the arena, his opponent surrendered immediately!<br/><br/>There was nothing he could do about it. The difference in levels was too great!<br/><br/>After Tianci’s duel, he relaxed and came to Wang Xian’s side!<br/><br/>“MOM has entered the top 1,000 of the Heaven’s favorites team. I wonder if she can enter the top 500! ”<br/><br/>The Hidden Dragon and young Phoenix team had decided on the top 500. The Heaven’s favorites team was next.<br/><br/>Mu Liyin’er had entered the top 1,000 and was about to start her first battle.<br/><br/>“It shouldn’t be a problem for your mother to enter the top 500! ”<br/><br/>Wang Xian said to tianci!<br/><br/>Although Mu Liyin ‘er wasn’t very strong, the Mu Li tribe was still able to rank in the top 50 among all the tribes.<br/><br/>As for Mu Liyin’er, she was able to rank in the top three of the Mu Li tribe in this generation!<br/><br/>It shouldn’t be a problem for the top three of the top 50 tribes to rank in the top 500!<br/><br/>Furthermore, Wang Xian had also sensed that Mu Liyin’er would be able to enter the top 500. It wouldn’t be a problem!<br/><br/>If it wasn’t enough for her to enter the top 300 from the top 500, it would be a little more difficult!<br/><br/>It was basically impossible for her to enter the top 100!<br/><br/>The Xuan Tu tribe and the tribe of the dead would occupy a large portion of the elites and heaven’s favorites.<br/><br/>There were also some other powerful tribes!<br/><br/>Just as Wang Xian expected, Mu Liyin’er easily entered the top 500!<br/><br/>Next was the combat strength of the Heaven Roll Group and the God of War Group.<br/><br/>In these two levels of competition, all of them were masters of the universe!<br/><br/>After watching for a while, Tianci and the rest left!<br/><br/>There was no other way. They could not see their battle moves clearly.<br/><br/>They could not see through their energy.<br/><br/>They were completely confused!<br/><br/>Wang Xian played with Tianci for a while before returning to his room to rest!<br/><br/>In the following days, Tianci made some friends!<br/><br/>Perhaps it was because heroes appreciated each other, but he had become friends with Tu Jiangtong.<br/><br/>There were also some young prodigies from other tribes!<br/><br/>After all, there was a common language between the young people.<br/><br/>Although Wang Xian was not very old, there was still quite a generation gap between Tianci and Wang Xian!<br/><br/>For the next period of time, Tianci played with his friends.<br/><br/>The competition continued!<br/><br/>Time passed quickly!<br/><br/>In the second round, Tianci easily entered the top 300.<br/><br/>Mu Liyin c er barely managed to enter the top 300 despite her injuries.<br/><br/>She estimated that she could only make it this far!<br/><br/>“Found it. It’s really troublesome to find a person here at the water source. ”<br/><br/>While the six paths conference was being held.<br/><br/>At the water source, Bai Kefu Sheng and the other six heavenly Yuan Destiny Realm powerhouses were hiding in a corner of the Mu Li tribe.<br/><br/>Bai Kefu Sheng’s face was wrinkled as he revealed a faint smile.<br/><br/>The last time, he had only seen heaven’s Gift’s face. It was very difficult to find it from just one face among the water source and the tens of billions of people in the tribe.<br/><br/>In addition, their luck was not very good. It took them more than 100,000 years to find it!<br/><br/>“Yes, they found it, but now there’s a huge problem. That youth is now participating in the six paths convention. The six paths convention is a grand competition of the six paths universe. They are preparing for the arrival of the Apocalypse. ”<br/><br/>“The Earth city where the six paths convention is held is the main city of the Black Earth tribe. The three heaven origin creation realm experts from the six paths universe should be paying attention to that place. In addition, over the past hundred million years, because of our entry, the six paths universe has also been on high alert against us! ”<br/><br/>“The current Earth City is definitely a dragon’s Den and tiger’s den. If we enter, there might be great danger. ”<br/><br/>A heaven origin creation realm expert frowned and said!<br/><br/>When Bai Kefu Sheng heard this, he also revealed a thoughtful expression.<br/><br/>This was indeed a huge problem.<br/><br/>A group of heaven origin creation realm experts coveted the heaven origin creation treasure of the six paths universe.<br/><br/>The Heaven origin creation realm experts of the six paths universe naturally hated them to the bone. They even formed a hunting team to search for their tracks and hunt them down!<br/><br/>Especially now, the location where the six paths universe held the six paths convention was the safest place in the entire universe.<br/><br/>When they entered this place, it was very likely that they would be discovered and killed as soon as they went over.<br/><br/>“There’s a way that we can try! ”<br/><br/>After a long silence, Bai Kefu Saint looked at them. “We can send out a message saying that the Heavenly Kismet Supreme Treasure is over at Tu Yuan, attracting the Heavenly Kismet powerhouses of other universes over there.”<br/><br/>“If that’s the case, we can disperse some of the earth city’s combat strength, and we can also disperse the strength of the three heaven origin creation realm experts from the six paths universes.”<br/><br/>His suggestion caused the other six heaven origin creation realm experts to frown slightly.<br/><br/>“There will be more trouble if we wait too long. This method is the best currently. Moreover, only we know the information about the heaven origin creation treasure. Our chances of success are very high! ”<br/><br/>Bai Kefu Sheng continued to speak!<br/><br/>“Alright, let’s do it according to your method! ”<br/><br/>One of the heavenly yuan destiny realm experts nodded and agreed.<br/><br/>This was the best choice at the moment!<br/><br/>It would attract the other heavenly yuan destiny realm experts to Tuyuan.<br/><br/>They would take the opportunity to enter Earth City!<br/><br/>Because they knew the specific information about the heavenly yuan destiny treasure, they had a huge advantage.<br/><br/>The other heavenly yuan treasures were still looking for a needle in a haystack, but they had a clear goal.<br/><br/>The group of seven discussed for a while and flew quickly in a direction..\t\t\t\t\t\t</div>", "images": {}, "success": true}