{"id": 1149, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074322.html", "title": "Chapter 4152 - Chapter 4152: 4151 Friend And Girlfriend", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4152 - Chapter 4152: 4151 Friend And Girlfriend</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4152: 4151 friend and girlfriend<br/><br/>Translator: 549690339<br/><br/>“There is news that the six paths universe’s heavenly fate treasure is located at<br/><br/>Tu Yuan. ”<br/><br/>“Is the news reliable?”<br/><br/>“Not very. This is a heavenly fate treasure that was sent out by a heavenly fate treasure. He said that he sensed the existence of the heavenly fate treasure and that it is at Tu Yuan?”<br/><br/>“Why did he spread this news?”<br/><br/>“That Heavenly Yuan creator did not hide anything. He said that the six paths universe in Tu Yuan is currently holding a six paths convention, and their defense is very strong. If he went in alone to search, he would be discovered by the Heavenly Yuan creator from the six paths universe. That’s why he used such a method. ”<br/><br/>“Oh? What do you think the possibility is?”<br/><br/>“The possibility is 50% . The six paths universe is holding the six paths convention in Tu Yuan. Maybe the Great Beings of the six paths universe also sensed that the heavenly creation true treasure is in Tu Yuan, so they deliberately held the six paths convention there to focus their efforts on searching. The other great being who released the news may already know the location of the heavenly creation true treasure and wants us to go there to share the combat power of the six paths universe. ”<br/><br/>“It’s indeed possible. Even if it’s only a 50% chance, we can’t give up. We have to go there and take a look! ”<br/><br/>“Alright. I estimate that all the Heavenly Yuan creation realm powerhouses in the six paths universe will head to Tu Yuan. It’s been 100 million years. No one will give up this chance!”<br/><br/>At the same time, two heavenly yuan creation realm powerhouses were chatting somewhere in the six paths universe.<br/><br/>After they discussed for a while, they flew directly towards Tu Yuan.<br/><br/>At the same time, at other places in the six paths universe, the heaven origin creation realm powerhouses were also heading towards Tu Yuan.<br/><br/>Almost 60 to 70 heaven origin creation realm powerhouses had gathered at Tu Yuan!<br/><br/>A storm gradually blew towards Tu Yuan’s location.<br/><br/>Time passed day by day.<br/><br/>The six paths convention continued.<br/><br/>Now That Tu Yuan was the place where countless disciples of the six paths universe gathered, its defensive power was naturally extremely strong.<br/><br/>Almost half of the top-tier combat power of the entire six paths universe was here.<br/><br/>In addition, two of the heaven origin creation realm experts had been sitting in the sky above Tu Yuan.<br/><br/>When a group of heaven origin creation realm experts entered tu yuan, they were immediately discovered by the six paths universe experts and the heaven origin creation realm experts.<br/><br/>A great battle broke out.<br/><br/>The group of heaven origin creation great beings could still resist against the peak-stage universe masters of the six paths universe.<br/><br/>When they encountered the heaven origin creation of the six paths universe, they could only escape quickly!<br/><br/>Tu Yuan’s powerful defense made some heaven origin creation great beings guess that the heaven origin creation true treasure was very likely here! This also made them even more unwilling to give up on this place.<br/><br/>This caused the entire earth plains to be in turmoil.<br/><br/>However, the changes in the earth plains did not cause any waves in earth city!<br/><br/>Heavenly Yuan creation realm experts had yet to set foot in earth city.<br/><br/>Currently, Earth City was the safest place in the entire earth plains.<br/><br/>The competition continued. In the fourth round, 150 out of 300 people were chosen to enter.<br/><br/>In this battle, Tianci still easily entered the top 150.<br/><br/>However, in this battle, Mu Li Yin c er stopped at this battle.<br/><br/>She lost to her opponent.<br/><br/>In the subsequent challenges, she was unable to succeed. In the end, she completely lost.<br/><br/>“It’s over, it’s over. It looks like this time, our hidden dragon fledgling Phoenix Group’s first place will be won by tianci. You’re too monstrous. You ‘ve fought three times in a row and I’ve lost! ”<br/><br/>In a sparring arena in Earth City, a group of more than 30 youths stood on the arena.<br/><br/>Among them, the three-meter-tall and incomparably burly Tu Jiang Tong stood in the middle and looked helplessly at the figure in front of him!<br/><br/>And in front of him, was naturally tianci!<br/><br/>Not far away, Gui San Qian also looked at tianci with a frown. After that, he shook his head with a trace of helplessness on his face!<br/><br/>Gui San Qian was the strongest person among the younger generation of the dead tribe.<br/><br/>After the three of them met for the first time, the heroes appreciated each other, and the youths had a common topic to talk about, so they walked together!<br/><br/>These hundreds of thousands of years had passed. Although they had participated in many battles, neither side had met.<br/><br/>This made their hands itch. Some of them were young and impulsive, and neither side was willing to submit to the other.<br/><br/>Therefore, they had to fight in private.<br/><br/>However, the few of them had fought three times in a row, and Tianci had won every time, completely suppressing Tu Jiang Tong and Gui San Qian.<br/><br/>This made the two of them look helpless!<br/><br/>“Hehe, thanks for letting me win. How about next time the two of you join hands, I’ll see how far you can push me.”<br/><br/>Tianci cupped his hands at him and said with a smile.<br/><br/>“Tianci, are you looking down on us? How much strength did you use in your fight with Tu Jiang Tong just now?”<br/><br/>Gui San Qian was speechless when he heard his words and asked Tianci.<br/><br/>“400/0<br/><br/>Tianci smiled faintly.<br/><br/>“40% ?”? “Only 40% . My grandfather has been teaching me since I was born. You should know that my grandfather is a level 9 master of the universe, and with the treasures in my hands, I can sometimes fight above my level. Now,<br/><br/>I’m not even as good as you?”<br/><br/>Tu Jiang Tong widened his eyes and said!<br/><br/>“I also have the guidance of a master. I really don’t know how you can be so abnormal!”<br/><br/>Gui San Qian shook his head and said speechlessly!<br/><br/>“Hehe, you have the guidance of a master, and I also have the guidance of my foster father. My foster father is very powerful! ”<br/><br/>Hearing their words, TIANCI smiled slightly and revealed a proud expression on his face.<br/><br/>What a joke, he knew that his foster father was a heavenly Yuan blessed realm expert.<br/><br/>A heavenly Yuan blessed realm expert had always taught him, how could he be inferior to your opponents?<br/><br/>In fact, if he displayed his true strength, he could scare you to death!<br/><br/>Tianci laughed in his heart!<br/><br/>“Too amazing, Tianci, you’re really amazing. Looks like our champion is you! ”<br/><br/>At the side, a girl flew to Tianci’s side with eyes full of love. She looked at him with a pair of bright eyes full of admiration.<br/><br/>The girl was about 1.65 meters tall. She was not very tall. She had a ponytail and was full of youth and cuteness!<br/><br/>“Hehe, no, no. Maybe one of us is keeping a low profile and concealing our strength. ”<br/><br/>Seeing the girl, Tianci scratched his head and revealed a bashful smile.<br/><br/>“That’s not fair. This time, the most beautiful person of our younger generation, Gong Chengmu, actually likes this guy. D * mn it, I’m a little envious! ”<br/><br/>On the other side, Tu Jiangtong’s mouth twitched when he saw this scene!<br/><br/>“Hehe, Big Brother Tu Jiangtong, don’t even think about it. My sister will not like you. Tianci and my sister are a true match made in heaven, a perfect match! ”<br/><br/>At the side, a youth said with a smile!\t\t\t\t\t\t</div>", "images": {}, "success": true}