{"id": 1140, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074286.html", "title": "Chapter 4143 - Chapter 4143: 4142 Tai Chi Dragon Plate Breakthrough", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4143 - Chapter 4143: 4142 Tai Chi Dragon Plate Breakthrough</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4143: 4142 tai chi dragon plate breakthrough<br/><br/>Translator: 549690339<br/><br/>Compared to a complete heaven origin creation, the power of the fragments of the ultimate treasure of Heaven origin creation was vastly inferior.<br/><br/>Even the book of water forbidden spell in Wang Xian’s hands was a part of two-thirds of the Heaven origin creation.<br/><br/>However, in terms of power, there was still a huge gap compared to the complete heaven origin creation.<br/><br/>This gap was more than ten times.<br/><br/>However, Wang Xian had three fragments of the Heaven’s origin creation treasure in his hands. In a battle of the same level, he was already at a huge advantage.<br/><br/>However, he might not have much of an advantage against the veteran Heaven’s origin creation stage powerhouses.<br/><br/>The veteran Heaven’s origin creation stage powerhouses had explored in the chaos for tens of billions of years. Hence, they usually had many trump cards in their hands.<br/><br/>The reason why Wang Xian was able to kill the powerhouses of the Heaven’s origin realm twice was that he didn ‘t bring all of their trump cards. “Foster father, our experiential learning is over. I will look for you now. ” Two years later, Tianci sent a message to Wang Xian.<br/><br/>When Wang Xian saw it, his body moved and he returned to his residence.<br/><br/>Not long after, Lin Niu rushed over with tianci. “How was your training?”<br/><br/>Wang Xian asked with a smile when he saw Tianci.<br/><br/>“Hehe, foster father. In the entire Mu Li tribe academy, other than the two who are much older than me and have better results than me, the rest are not as good as me! ”<br/><br/>Tianci said with some pride, “Moreover, I am completely invincible in battles of the same level. However, this is all because of your good teaching, Foster<br/><br/>Father! ”<br/><br/>Wang Xian smiled when he heard Tianci’s flattery.<br/><br/>He had watched Tianci grow up. He knew Tianci’s personality and habits like the back of his hand!<br/><br/>Although he was already close to 100 million years old, he was just a child in front of him.<br/><br/>Sometimes, he would show off his proud achievements.<br/><br/>He would even flatter him!<br/><br/>He would say almost everything to him!<br/><br/>“Come and sit down. I want to tell you something! ”<br/><br/>Wang Xian gestured to the seat in front of him and said to tianci!<br/><br/>“Foster father, are you going to tell me everything?”<br/><br/>Tianci looked at Wang Xian with a look of anticipation.<br/><br/>Although he had already guessed a large part of it, he still hoped to learn the real situation from Wang Xian.<br/><br/>Wang Xian did not answer him. With a wave of his arm, a wave of energy completely surrounded the surroundings!<br/><br/>“More than 90 million years ago, I came to the six paths universe. Speaking of which, it has been close to 100 million years. ” Wang Xian took out a teacup and poured a cup of tea.<br/><br/>Tianci looked at Wang Xian and listened attentively.<br/><br/>‘I come from the nine-origin universe. In our nine-origin universe, a senior said that the six paths universe will have the ultimate treasure of the Heaven’s origin creation. You might not know about the ultimate treasure of the Heaven’s origin creation, but you only need to know that this is the best treasure in the Universe! ”<br/><br/>“Not long after I received this news, I rushed over. I heard that this news came from a powerful heavenly origin creation great being. Many great beings knew about this news. ”<br/><br/>“Many heavenly origin creation great beings from the universe rushed over. As for the exact number, I’m not sure. But until now, it’s definitely not less than<br/><br/>50 to 60.”<br/><br/>“All the powerhouses are here for the ultimate treasure of the Heaven’s origin realm! ”<br/><br/>Wang Xian looked at him and said quietly.<br/><br/>“At least 50 to 60? Are they all at your level, Godfather?”<br/><br/>When Tianci heard that, his eyes widened slightly!<br/><br/>Some of them are stronger than me, and some of them are weaker than me. Godfather, I am the leader of the Dragon Palace in the nine-origin universe and the King of the Divine Dragon Clan. However, according to the information I received, the so-called three Masters in your six paths universe seem to be existences who have just entered the Heaven’s origin realm not long ago. Most of the Heaven’s origin realm powerhouses who have arrived are not weaker than the three masters. In fact, they are even stronger.”<br/><br/>“However, this is the six universes. The calamity has not arrived yet. If we enter, our strength will be suppressed.”<br/><br/>Wang Xian said to him.<br/><br/>“You will have to know about this in the future. I am mainly telling you now about the preciousness of the Heaven’s origin Destiny Treasure. ”<br/><br/>Wang Xian looked at him. “In the nine-origin universe, my foster father belongs to the Divine Dragon Clan. In the past, the Divine Dragon Clan experienced extermination once. I only rose up later and established the Dragon Palace. ”<br/><br/>“In the glorious era of the Divine Dragon Clan, there were hundreds of thousands of masters at the level of the Master of the universe. There were many masters at the pinnacle level of the Master of the universe. There was even a legendary Dragon King who was invincible at the pinnacle level of the master level. ”<br/><br/>“In addition, the Divine Dragon Clan possessed a Tianyuan Destiny, an old-fashioned one. It was a Tianyuan destiny that was stronger than the initial level. ”<br/><br/>“The Divine Dragon clan was exterminated because they fought with another peak race, another race that possessed the Tianyuan destiny. They fought for a Tianyuan Destiny Supreme Treasure and perished together. ”<br/><br/>“This is the preciousness of a treasure of the destiny of the Heaven. ”<br/><br/>Wang Xian looked at him and said!<br/><br/>When Tianci heard that, he opened his mouth slightly. His face was filled with disbelief.<br/><br/>“Then… then foster father, if I am discovered, what will be the result?”<br/><br/>He could not help but ask.<br/><br/>“There is only one result. Strip the treasure of the destiny of the heaven from your body. ”<br/><br/>Wang Xian looked at him and said, “You are one with the ultimate treasure of the Heaven’s origin creation. The reason why you don’t have a father now is not because of other reasons. It is because you were born. You descended directly into your mother’s stomach. ”<br/><br/>“ThiS…<br/><br/>Tianci was a little absent-minded when he heard this.<br/><br/>This matter was a very big secret to him.<br/><br/>When he was young, a child said that he was a bastard who didn’t have a father.<br/><br/>So this was the reason for everything.<br/><br/>Wang Xian drank his tea and waited for him to digest the news.<br/><br/>“Then my mother, her… foster father, should I be more careful in the future and not let others find out?”<br/><br/>Tianci opened his mouth and said with a frown.<br/><br/>“You have been exposed. That strong man in the Heaven’s origin realm will not give up. However, we can still buy some time. As long as you can step into the Heaven’s origin realm, there will be no problem.”<br/><br/>“In addition, I have given you the soul-returning fruit. It is a fruit for resurrection. If you are killed, you can be resurrected.”<br/><br/>“Apart from that, I will give you a soul-returning wood branch later to see if it can be absorbed by the Heaven’s origin realm treasure in your body and grow.<br/><br/>If it is possible, you can be resurrected directly when you die in the future. ”<br/><br/>Wang Xian said to him, (‘I can bring you back to my universe now and allow you to grow to the Heaven’s origin realm. However, there will always be some difficulties in life. ”<br/><br/>“From now on, you will live a normal life. If you really die, you can return to my universe and ascend to the Tianyuan blessed realm. You can come back for revenge in the future.”<br/><br/>“Most importantly, you are a creature from the six universes. You will be suppressed when you enter the nine-origin universe. You have your family and your tribe here. ”<br/><br/>Wang Xian looked at him and touched his head.<br/><br/>The last sentence was from his heart.<br/><br/>He had already treated Tianci as his son.<br/><br/>Tianci’s roots were in the six paths universe. His mother, grandparents, relatives, and friends were all here.<br/><br/>It was unfair to take him away..\t\t\t\t\t\t</div>", "images": {}, "success": true}