{"id": 1143, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074298.html", "title": "Chapter 4146 - Chapter 4146: 4145 Six Paths Assembly", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4146 - Chapter 4146: 4145 Six Paths Assembly</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4146: 4145 six paths assembly<br/><br/>Translator: 549690339<br/><br/>Wang Xian was sensing the ultimate treasure of Tianyuan in Tianci’s body.<br/><br/>He was sensing the roots of the same root!<br/><br/>There was an idea in his mind.<br/><br/>The use of the ability of the same root.<br/><br/>According to what Tianci said, and Wang Xian was sensing with energy.<br/><br/>The same root could enter a person’s body and control it perfectly.<br/><br/>It could absorb his life force and make it a part of his body!<br/><br/>What would happen if Wang Xian allowed these roots to enter his body without attacking him?<br/><br/>Could it be that Wang Xian could completely block his aura through these roots?<br/><br/>Wang Xian’s eyes sparkled.<br/><br/>With a thought, a branch of the ancestral tree emerged from his palm and entered heaven-bestowed’s body.<br/><br/>He came to the location of the root of the tree of God.<br/><br/>The branch of Wang Xian’s Ling ancestral tree was twining around the root of the tree of God and sensing the energy on it.<br/><br/>“Tianci, use the ability to root together with the branch that entered your body!<br/><br/>Wang Xian tried it out but to no avail.<br/><br/>This was because he could not control the tree of God in Tianci’s body.<br/><br/>“Yes, Foster Father! ”<br/><br/>Tianci nodded his head. With a thought, he activated the ability of the same root.<br/><br/>The roots in his body twined towards the branches of the ancestral tree.<br/><br/>Waves of aura belonging to the divine tree surged towards the ancestral tree.<br/><br/>The divine tree did not attack the ancestral tree. When this energy entered the ancestral tree, the ancestral tree did not resist.<br/><br/>Very soon, when the energy of the ancestral tree was covered by the same root, the same root’s energy surged towards Wang Xian’s body.<br/><br/>Very soon, he narrowed his eyes slightly and revealed an excited expression.<br/><br/>He could feel that the suppressive force of the six paths universe was getting weaker and weaker!<br/><br/>Gradually, the Suppressive Force disappeared completely.<br/><br/>It was as if the entire six paths universe now treated him as a living being<br/><br/>within the six paths universe.<br/><br/>Wang Xian narrowed his eyes slightly. With a move of his palm, he guided the same root’s energy and surged it into the body of the Unicorn Ox.<br/><br/>One by one, the roots came before the LINNIU.<br/><br/>“Eh? Boss?”<br/><br/>The Linniu saw the roots entering his body and did not stop them either!<br/><br/>He looked at it in astonishment.<br/><br/>Wang Xian did not explain. However, very soon, an excited expression appeared on the Linniu’s face.<br/><br/>“Boss, I can feel it. The suppression of the six universes has disappeared. It has completely disappeared! ”<br/><br/>Lin Niu stared at Wang Xian and said with his eyes wide open!<br/><br/>Wang Xian nodded his head and hesitated for a moment. With a move of his palm, a round ball appeared in his hand.<br/><br/>This round ball contained extremely terrifying energy.<br/><br/>It contained the energy of the Heaven’s origin creation.<br/><br/>However, the six paths universe did not attack him at all.<br/><br/>“The divine tree in the body of the Heaven’s gift is the ultimate treasure of the Heaven’s origin creation nurtured by the six paths universe. It belongs to the six paths universe, and the attack of the ultimate treasure of the Heaven’s origin creation can control the opponent 100% . ”<br/><br/>“When the roots of the same root enter the body, it is equivalent to being controlled by the divine tree. It is equivalent to becoming a part of the divine tree. Naturally, the six paths universe will not attack the divine tree. ”<br/><br/>Wang Xian mumbled as his eyes shone.<br/><br/>This was extremely good news for Wang Xian.<br/><br/>This was because once Wang Xian and the rest could unleash their peak combat strength, Wang Xian and the rest would not be afraid even if they were the powerhouses of Tianyuan in the six paths universe!<br/><br/>Regarding the situation of tianci, Wang Xian had always been worried that he would not be discovered by the powerhouses of the Heaven’s origin creation in the other universes.<br/><br/>Instead, Wang Xian was worried that tianci would be discovered by the powerhouses of the Heaven’s origin creation in the six paths universe.<br/><br/>Although tianci was a living being in the six paths universe and was their disciple.<br/><br/>However, Wang Xian did not believe that they would not be moved by the Supreme Treasure of the Heaven’s origin creation.<br/><br/>When the masters of Tianyuan in the six paths universe encountered tianci, it was very likely that they would snatch the ultimate treasure of Tianyuan.<br/><br/>This was what Wang Xian was most worried about.<br/><br/>Once they discovered the situation of tianci and wanted to snatch the ultimate treasure of Tianyuan, there was nothing Wang Xian could do!<br/><br/>There was no way to fight back.<br/><br/>Now that they could eliminate the suppression of the six paths universe, Wang Xian could completely protect Tianci in the six paths universe.<br/><br/>He was deep in thought. With a move of his palm, the Five Elements Millstone and the Tai Chi Dragon disc appeared in his hand.<br/><br/>They entered the five elements millstone at the same root. Very soon, the suppression of the six paths universe on the five elements millstone disappeared completely.<br/><br/>Once they entered the Tai Chi Dragon Disc’s body, the suppression of the universe was also completely eliminated. This made Wang Xian look satisfied.<br/><br/>“Foster father, what’s Wrong?”<br/><br/>Tian Ci looked at Wang Xian’s expression and couldn’t help but ask!<br/><br/>“Haha, Nothing. ”<br/><br/>Wang Xian laughed and didn’t tell him the good news. “From now on, cultivate well and live a good life. Don’t worry about anything. If the Sky Falls, foster father will take care of it for you. ”<br/><br/>“When my cultivation is successful and the Sky Falls, I will take care of it for foster father. ”<br/><br/>Tianci made a promise to Wang Xian.<br/><br/>“There is no rush in your cultivation now. It will be fine as long as you can cultivate to the destiny realm of the Heaven’s origin in two to three hundred million years. Life will be your priority. ” Wang Xian patted his head and said with a smile.<br/><br/>“Yes, Foster Father! ”<br/><br/>Tianci nodded his head. “Foster father, I will be going to the Earth City of the Earth Plains to participate in the six paths conference. I estimate that I will be staying there for a few million years. Foster father, are you going?” “You will be staying there for a period of time. Naturally, you have to go! ” Wang Xian nodded his head.<br/><br/>Tianci was also going to participate in the six paths universe martial arts tournament.<br/><br/>At that time, all the powerhouses and heaven’s favored disciples in the entire six paths universe would be participating.<br/><br/>Not only would there be battles at the level of tianci, but there would also be battles at the level of the Masters of the universe.<br/><br/>Once one could obtain a good ranking, there would be a large number of treasures as rewards.<br/><br/>This time, the six paths competition was jointly organized by the three heaven origin creation stage powerhouses from the six paths universe.<br/><br/>The treasures and resources awarded would be beyond everyone’s imagination. In fact, those who were truly heaven-defying would receive the nurturing of the three heaven origin creation stage nowerhouses.<br/><br/>“Yes, yes!”<br/><br/>Tianci nodded his head heavily when he heard Wang Xian’s words. His face was filled with happiness.<br/><br/>“Foster father, I’ll Call Mom. Let’s go for a meal and play together for two<br/><br/>days.” Tianci continued after that!<br/><br/>Wang Xian nodded his head with a smile.<br/><br/>In the next few days, Wang Xian and Tianci strolled around the Mu Li tribe.<br/><br/>A month later, the Mu Li tribe had already started to prepare to bring their strong disciples to the Tu Yuan region.<br/><br/>Many strong disciples of the Mu Li tribe had to participate in the six paths assembly.<br/><br/>In fact, all the powerful disciples could participate in the six paths convention.<br/><br/>There would be arenas set up according to age.<br/><br/>In the beginning, one had to get a ranking on the arenas before they could truly participate in the six paths convention.<br/><br/>At that time, the powerful disciples of every age group would begin their official battles.<br/><br/>The Masters at the pinnacle of the universe masters would be the judges.<br/><br/>This six paths convention would last for millions of years..\t\t\t\t\t\t</div>", "images": {}, "success": true}