{"id": 1144, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074302.html", "title": "Chapter 4147 - Chapter 4147: Earth City 4146", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4147 - Chapter 4147: Earth City 4146</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4147: Earth City 4146<br/><br/>Translator: 549690339<br/><br/>“Foster father, over here!”<br/><br/>In front of the main city area of the Mu Li tribe.<br/><br/>A group of strong disciples of the Mu Li tribe were floating in the air.<br/><br/>There were more than 10,000 strong disciples.<br/><br/>Some of these strong disciples were participating in the competition while others were there to watch the fun.<br/><br/>Tian Ci followed his mother and some of his elders. When he saw Wang Xian flying over, he waved his hand excitedly.<br/><br/>Okay!<br/><br/>Wang Xian flew over and nodded at him.<br/><br/>“Young master Wang Xian! ”<br/><br/>Mu Liyin er saw Wang Xian and greeted him with a smile.<br/><br/>Wang Xian nodded at her.<br/><br/>“Good Day, young master Wang Xian! ”<br/><br/>“Good Day, young master Wang Xian! ”<br/><br/>At the side, Mu Liyin er’s brothers greeted Wang Xian.<br/><br/>Wang Xian responded politely one by one.<br/><br/>Mu Liyin ‘er knew that Wang Xian had the strength of a level seven universe overlord.<br/><br/>He also told this news to his family.<br/><br/>After all, Tianci was growing up day by day and had outstanding talent. His family attached great importance to Tianci.<br/><br/>Naturally, he had to learn more about his adoptive father.<br/><br/>Mu Liyin ‘er did not hide anything and told her family directly.<br/><br/>This shocked his brothers and parents!<br/><br/>At the same time, they also understood!<br/><br/>Tian Ci’s current achievements and the fact that he had a god’s favored son that hadn’t appeared in the Mu Li tribe for tens of billions of years had a lot to do with his foster father.<br/><br/>After all, Tian Ci had always been taught by his foster father.<br/><br/>A universe ruler Level 7 expert that was taught almost every day had a very high possibility of having such strength.<br/><br/>As for the level seven of the universe dominator, such strength would be considered top-notch in their Mu Li tribe!<br/><br/>The leader was the only one stronger than him!<br/><br/>This also made them treat Wang Xian with exceptional respect.<br/><br/>In fact, they even had some doubts in the beginning.<br/><br/>Was It Wang Xian who knocked up their sister (daughter) and deliberately found an opportunity to approach her.<br/><br/>Otherwise, how could a master at the seventh level of the Universe Treat Tianci so well?<br/><br/>However, they had observed for a long time and knew that the possibility of this guess was very small!<br/><br/>“This is young master Wang Xian, right? Thank you for teaching Tianci. ”<br/><br/>At the front, the elders of the Mu Li tribe sized up Wang Xian and greeted him with a smile.<br/><br/>“Elders, you don’t have to stand on ceremony. Miss Mu Liyin c er has saved me before. It’s just a small matter for me to teach Tianci!”<br/><br/>Wang Xian smiled and said to the elders of the Mu Li tribe!<br/><br/>He was not surprised that the experts of the Mu Li tribe knew some of his abilities!<br/><br/>“Let’s go, let’s set off! ”<br/><br/>The elders nodded with a smile. Then. they flew in a direction!<br/><br/>“What a surprise! ”<br/><br/>At a location not far away, more than a dozen women gathered together. They looked in the direction of Wang Xian and Mu Liyin ‘er, and their expressions were unsightly!<br/><br/>Wang Xian had displayed the strength of a Master of the universe at level seven.<br/><br/>This was much better for Mu Liyin’er’s days in the Mu Li tribe!<br/><br/>Back then, Mu Liyin’er was pregnant with Tianci, which caused quite a stir in the entire Mu Li tribe.<br/><br/>The chastity of a woman was very important in the Mu Li tribe.<br/><br/>Especially when Mu Li Yin ‘er suddenly became pregnant. As the heavenly daughter of the Mu Li tribe, she was the most beautiful girl in the Mu Li tribe.<br/><br/>The most important thing was that at that time, the elders of the tribe wanted to marry Mu Li Yin ‘er to the woman of another tribe leader.<br/><br/>At that time, even Mu Liyin’er’s father was in agreement with this.<br/><br/>However, Mu Liyin’er was pregnant all of a sudden, so they could only let it go.<br/><br/>In fact, the elders of that tribe were extremely displeased!<br/><br/>However, with the rise of Tianci and the appearance of Wang Xian, the people in the tribe didn’t dare to ridicule Mu Liyin’er anymore.<br/><br/>They didn’t dare to say that TIANCI was a bastard!<br/><br/>“Foster father, have you been to Tuyuan before?”<br/><br/>Tianci was beside Wang Xian and Mu Liyin’er. He asked him excitedly.<br/><br/>This was the first time Tianci had gone on a long journey. It was the first time he had left the water source!<br/><br/>Wang Xian shook his head.<br/><br/>“Mom, What About You?”<br/><br/>Tianci looked at his mother and asked with a smile.<br/><br/>(‘I haven’t been to Tuyuan either. This time, we can take a stroll there. The<br/><br/>Tuyuan city that we are going to is the most prosperous place in the entire Tuyuan. It is the main city of the Xuan Tu tribe. ”<br/><br/>Mu Li Yin c er also shook her head.<br/><br/>“Then we have to take a good stroll there. Mother, why don’t we participate in the six paths convention together this time? Mother, you’re very powerful among your peers! ”<br/><br/>Tianci continued!<br/><br/>“Me?”? “Speaking of which, if I were to participate in the competition, I would only be one year older than you. However, mother, my strength is only one level higher than yours. This time, it’s a competition between the elites of the entire six paths universe. I Can’t be ranked at all.”<br/><br/>“Tianci, you still have a chance to get a good ranking. After all, you’re not even<br/><br/>100 million years old. At your age, you’re considered outstanding! ”<br/><br/>Mu Liyin’er shook her head and smiled at tianci!<br/><br/>“Mom, you’re not that old either. If you participate, you’ll be able to get a good ranking too! ”<br/><br/>Tianci said.<br/><br/>The three of them chatted and hurried on their way!<br/><br/>However, just as Wang Xian was following tianci and rushing towards Tuyuan city…<br/><br/>In the chaos at the edge of the six universes, a figure that was emitting light energy flew over!<br/><br/>He looked at the location in front of him.<br/><br/>In front of him, there were six figures floating quietly in the air. When they saw the light figure in front of them, their eyes lit up!<br/><br/>“Bai Kefu Sheng, are you sure you know the location of the Heavenly Yuan<br/><br/>Destiny Treasure?”<br/><br/>One of the six figures who was also emitting light asked Bai Kefu Sheng!<br/><br/>His eyes were filled with anticipation.<br/><br/>(‘I have to make fun of you. The Heavenly Yuan Destiny Treasure of the six universes doesn’t exist in a certain place, but in the body of a young man! ”<br/><br/>“And in that youth’s body, there are two heavenly Yuan creation realm experts guarding it. I don’t know why they didn’t take it away! ”<br/><br/>Bai Kefu saint’s gaze swept over them as he spoke!<br/><br/>“If we obtain the Heavenly Yuan creation treasure, how will the seven of US split<br/><br/>One of the Heavenly Yuan creation realm experts asked with a twinkle in his eyes!<br/><br/>(‘I can sense it. That Heavenly Yuan creation treasure is of the wood attribute and the wood attribute heavenly yuan creation treasure can split some branches. The treasure belongs to me, but I guarantee that you ‘Il be satisfied with the exact reward! ”<br/><br/>Bai Kefu Sheng’s gaze swept past them as he said!<br/><br/>The six figures hesitated for a moment before slowly nodding.<br/><br/>It was obviously unrealistic for seven figures to split a heavenly Yuan creation treasure.<br/><br/>Bai Kefu Sheng knew about this news, so he naturally wouldn’t say that he would give up on this heavenly Yuan creation treasure.<br/><br/>However, if this was a heavenly yuan creation tree, then it would be easy to split it!<br/><br/>As for whether there would be any disputes between them, that would have to wait until they obtained the treasure!<br/><br/>Now, at least they had to reach an agreement first!\t\t\t\t\t\t</div>", "images": {}, "success": true}