{"id": 1141, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074290.html", "title": "Chapter 4144 - Chapter 4144: Under The Breakthrough Of 4143 Tai Chi Dragon Plate", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4144 - Chapter 4144: Under The Breakthrough Of 4143 Tai Chi Dragon Plate</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4144: Under the breakthrough of 4143 tai chi dragon plate<br/><br/>Translator: 549690339<br/><br/>Wang Xian did not have a child of his own at the moment.<br/><br/>In the past 100 million years, he had been acting as Tianci’s adoptive father.<br/><br/>Without his father’s tianci, Wang Xian was equivalent to his father.<br/><br/>He also shouldered the responsibility.<br/><br/>He guided and taught him.<br/><br/>In Wang Xian’s eyes, this was the child he had watched grow up.<br/><br/>“Foster father.”<br/><br/>Tianci listened to Wang Xian’s words and looked at him. His face was filled with gratitude.<br/><br/>He could not help but kneel on the ground and kowtow to Wang Xian a few times.<br/><br/>“Foster father, 1 will definitely focus on my cultivation from now on. I will definitely improve to the Heaven’s origin realm as soon as possible. I will follow foster father to explore the universe in the future! ”<br/><br/>Tianci spoke to Wang Xian heavily!<br/><br/>Wang Xian looked at him and smiled, then, he shook his head at him. “Next, your priority is not to cultivate but to live. By the way, you are almost 100 million years old. You can look for a girlfriend, find some friendships, enjoy family love and love, and live a good life! ”<br/><br/>As the father of a child, Wang Xian did not wish for him to cultivate all day in the next few days.<br/><br/>He hoped that he could make some friends, get to know some people, and fall in love.<br/><br/>He wanted to enjoy family love.<br/><br/>He wanted to live a complete life.<br/><br/>Once he reached the Heaven’s origin realm, these things would be lacking.<br/><br/>An ordinary cultivator would not dare to make friends with a heaven’s origin realm cultivator.<br/><br/>There was no true love in the Heaven’s origin realm.<br/><br/>There wasn’t much pure love.<br/><br/>He wanted to take advantage of his youth to enjoy it!<br/><br/>As for Tianci’s elevation to the Heaven’s origin realm, it would be of great help to him.<br/><br/>Wang Xian didn’t care about this.<br/><br/>What a joke. Did He, Wang Xian, need his child to fight alongside him?<br/><br/>He wanted to use his own strength to fight his way to the top!<br/><br/>“This… foster father, this… this…”<br/><br/>Tianci opened his mouth but didn’t know what to say.<br/><br/>“Just live well and see if you can find a daughter-in-law for foster father.”<br/><br/>Wang Xian stood up and patted his head as he said with a smile.<br/><br/>“This… foster father, I don’t have a girl that I like yet! ”<br/><br/>Tianci stood up with a slightly red face.<br/><br/>“There’s no rush. If you meet her, chase after her boldly. Don’t be afraid! ”<br/><br/>Wang Xian spoke to him with a smile.<br/><br/>Tianci cracked a smile and did not speak.<br/><br/>Very soon, Mu Liyin’er rushed over and the three of them had a meal together!<br/><br/>This time, the Mu Li tribe’s training had ended. For the next period of time, tianci would be arranged to cultivate in a blessed land within the tribe for a few million years before participating in the six paths universe martial arts tournament!<br/><br/>The six paths universe was preparing for the upcoming calamity!<br/><br/>They began to select some elite disciples.<br/><br/>Tianci stayed at home for a year before he began to cultivate.<br/><br/>“The Tai Chi Dragon Plate has already absorbed a lot of energy. There is only one shackle. Now, there is the corpse of a light-attributed Tianyuan creator.<br/><br/>With some resources, it should be enough.”<br/><br/>After tianci entered the grotto-heaven blessed land to cultivate, Wang Xian began to study the Tai Chi Dragon Disc.<br/><br/>The improvement of the Tai Chi Dragon Disc was very important to Wang Xian and the Dragon Palace.<br/><br/>After all, the improvement of the Tai Chi Dragon Disc was equivalent to Wang Xian having one more Tianyuan creator-level combat strength.<br/><br/>A Tianyuan creator-level combat strength was very terrifying!<br/><br/>In the entire nine-origin universe, there were only nine of them.<br/><br/>If the Tai Chi Dragon Disc continued to improve, it would be equivalent to having four Heaven’s origin creator powerhouses on his side.<br/><br/>It would be equivalent to two heaven’s origin creator powerhouses on the mastery level.<br/><br/>Perhaps only the fallen shadow devil emperor could suppress Wang Xian and the rest.<br/><br/>As for whether he could kill Wang Xian and the rest, it was hard to say.<br/><br/>Moreover, this would be of great help to the danger that they might face in the future.<br/><br/>Wang Xian helped the tai chi dragon plate to absorb the energy from the corpse and the staff.<br/><br/>Time passed by quickly!<br/><br/>Buzz! Buzz! Buzz<br/><br/>Five million years later, a deep voice came from the Tai Chi Dragon Plate.<br/><br/>The two divine dragons intertwined and fused together.<br/><br/>Waves of powerful aura came from the Tai Chi Dragon Plate!<br/><br/>As time passed, the light and dark divine dragons slowly fused together.<br/><br/>The two divine dragons fused into one divine dragon!<br/><br/>When the two divine dragons were completely fused together, a special divine dragon appeared!<br/><br/>The Yin-yang Divine Dragon, which was emitting bright energy but had black dragon scales on its body, appeared in front of Wang Xian.<br/><br/>The powers of light and darkness fused perfectly together!<br/><br/>Slowly, the divine dragon turned into a circular plate.<br/><br/>The circular plate was pitch black, but it was emitting a dazzling white light. It was as strange as it looked!<br/><br/>Wang Xian sensed the energy on the Taiji Dragon Plate and smiled.<br/><br/>Finally, he made a breakthrough!<br/><br/>This made him smile.<br/><br/>“The Tai Chi Dragon Plate has achieved a breakthrough. Its strength has increased greatly! ”<br/><br/>Wang Xian said with a smile.<br/><br/>This was very good news!<br/><br/>The breakthrough of the Tai Chi Dragon Plate was a little difficult to describe, but it was also a little simple.<br/><br/>Following the breakthrough of the Tai Chi Dragon Plate, Wang Xian had a thought in his mind.<br/><br/>The formation of the Five Elements Millstone and the Tai Chi Dragon Plate might be a backup plan for the Divine Dragons!<br/><br/>Including the fact that Wang Xian was able to become a 9-essences divine dragon, it could be the arrangement of the Divine Dragon Clan who was once at the peak!<br/><br/>Otherwise, how could there be so many earth-shattering treasures on such a small earth?<br/><br/>This could be the arrangement of the Divine Dragon clan before they were annihilated.<br/><br/>The arrangement of the five elements origin and the power of yin and yang could be used to create treasures that could advance to the Heaven’s origin.<br/><br/>Arrange for the ancestral tree to be discovered and obtained by the inheritor of the Divine Dragon System.<br/><br/>Arrange for the inheritor of the Divine Dragon System to evolve into a nine-origin divine dragon.<br/><br/>If not, why didn’t that Lord Water God Dragon of the Divine Dragon Clan leave his inheritance to the inheritor of the Divine Dragon?<br/><br/>To make him break through to the heavenly fate with his water attribute?<br/><br/>This might be a backup plan of that Lord Water God Dragon of the Divine Dragon Clan.<br/><br/>She was worried that after her death, there would be a water-elemental powerhouse who would break through to the Heaven’s origin destiny realm and occupy the spot for the Divine Dragon Clan!<br/><br/>That was the reason for the arrangement!<br/><br/>“If that’s the case, that water god Dragon is really powerful. However, at the moment, he has completely exhausted the foundation of the Divine Dragon clan!<br/><br/>Wang Xian thought to himself.<br/><br/>However, what Wang Xian didn’t know was that there were some parts of his guess that were not right!<br/><br/>However, Wang Xian didn’t think too deeply about it. Wang Xian had relied on his own hands to be able to reach this stage.<br/><br/>The most important thing was to subdue the Unicorn Ox.<br/><br/>“Next, it’s time to wait for the day when the heaven-bestowed crisis will arrive. I have to make some preparations. I have to let an lie come over! ”<br/><br/>Wang Xian kept the tai chi dragon plate and muttered to himself as he walked out.<br/><br/>He had a premonition that the light-attributed Tianyuan creator whom they had killed the last time was coming!\t\t\t\t\t\t</div>", "images": {}, "success": true}