{"id": 1142, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074294.html", "title": "Chapter 4145 - Chapter 4145: 4,144 Of The Same Root, Striking The Divine Tree", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4145 - Chapter 4145: 4,144 Of The Same Root, Striking The Divine Tree</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4145: 4,144 of the same root, striking the divine tree<br/><br/>Translator: 549690339<br/><br/>The breakthrough of the Tai Chi Dragon Plate made Wang Xian relaxed.<br/><br/>In the following period of time, he strolled around the Mu Li tribe leisurely every day.<br/><br/>Tianci was cultivating. Tianci’s mother, Mu Liyin ‘er, was also cultivating.<br/><br/>Mu Liyin ‘er was very young. She could not fall behind in her cultivation.<br/><br/>Otherwise, she would not have any status in the Mu Li tribe.<br/><br/>Any tribe would be based on strength.<br/><br/>If you were strong, your status would be high. Even if there were powerful elders, your own strength couldn’t fall behind.<br/><br/>Otherwise, others wouldn’t respect you just because your father was strong.<br/><br/>Niu Li Yin ‘er was once the favored daughter of the heavens in the Mu Li tribe. Her talent was outstanding.<br/><br/>Even now, her talent was very strong in her generation.<br/><br/>Her strength was also ranked at the top.<br/><br/>However, she had kept a low profile ever since tianci was born.<br/><br/>She had to keep a low profile. There were too many rumors in the tribe! “Foster father, I’m coming to your house soon. 1 have something to tell you! ” Tens of thousands of years had passed. On this day, Tianci sent a message. Wang Xian received his message. He smiled and replied immediately.<br/><br/>“Foster Father! ”<br/><br/>Ten minutes later, tianci’s voice sounded in the room.<br/><br/>“Come in! ”<br/><br/>Wang Xian said to him. Tianci pushed the door open and entered!<br/><br/>Lin Niu followed beside him. His eyes were sparkling.<br/><br/>“Foster father, I have something important to tell you. During the period of my cultivation, the treasure in my body has grown a little. Furthermore, it has gained a powerful skill and a few branches! ”<br/><br/>Tianci walked up to Wang Xian and said excitedly.<br/><br/>“Oh? Let me take a look! ”<br/><br/>Wang Xian raised his eyebrows and placed his palm on Tianci’s body to sense his condition.<br/><br/>Water Elemental realm, level five universe Knight Realm.<br/><br/>Wood elemental realm, level four universe Dominator realm.<br/><br/>Level Four Universe Dominator realm. In any universe, this strength could be considered an elite existence.<br/><br/>The heavenly creation true treasure in his body was growing as his strength increased.<br/><br/>The tree in his body was already dozens of meters long.<br/><br/>There were many branches on it.<br/><br/>Among them were the soul-returning wood branches.<br/><br/>The soul-returning wood branches were growing on it.<br/><br/>Apart from that, there were hundreds of branches.<br/><br/>Each branch possessed different abilities and different offensive methods.<br/><br/>Even though Tianci was only at the fourth level of the universe dominator, he might not be a match for someone at the eighth level of the universe dominator if they were to fight.<br/><br/>An offensive type of Tianyuan destiny-level treasure was extremely terrifying!<br/><br/>Out of these few hundred branches, a large portion of Wang Xian knew about them.<br/><br/>However, compared to the past, there were more branches.<br/><br/>At the root, there were many densely packed roots!<br/><br/>At the top, there were two more extremely eye-catching branches.<br/><br/>These two branches were somewhat illusory. Among the numerous branches, they were also very eye-catching!<br/><br/>“Foster father, this new branch is very powerful. I call it the divine tree. I’ll cover it up for you! ”<br/><br/>As Tianci spoke, he moved his palm and an illusory branch appeared in his hand.<br/><br/>He held the branch and moved his body. A figure that looked exactly like him appeared in front of him.<br/><br/>When Wang Xian saw the figure that looked exactly like him, he raised his eyebrows slightly.<br/><br/>Buzz<br/><br/>Tianci waved his arm and swung it at the figure that looked exactly like him.<br/><br/>It was an ordinary attack.<br/><br/>The figure that looked exactly like him was ten meters away. It seemed that the attack could not reach him at all.<br/><br/>However, in the next second, the Gray branch landed on the figure that looked exactly like him.<br/><br/>The figure cracked under this attack and the life force in its body disappeared completely.<br/><br/>Then, it disappeared slowly!<br/><br/>Wang Xian sensed it from the side and revealed a surprised expression.<br/><br/>From what he sensed, be it the body that looked exactly like him or the gray divine striking tree branch, they were all very strange.<br/><br/>The divine striking tree branch waved its hand casually and this branch seemed to be able to teleport. It appeared in front of the target and struck directly.<br/><br/>There was no way for him to dodge.<br/><br/>As for the body that was exactly the same as tianci, in Xian’s opinion, the wood attribute energy in his body was no different from his own.<br/><br/>It was somewhat similar to the netherspirit avatar, but there were some differences.<br/><br/>The strength of this body was exactly the same as Tianci’s. It was even equivalent to one of Tianci’s avatars.<br/><br/>Moreover, the energy of this body came from the position of the root of the ultimate treasure of Tianyuan.<br/><br/>” Impressive. ”<br/><br/>Wang Xian complimented him generously.<br/><br/>“Hehe, foster father, as long as 1 hold this divine striking tree, I will have an attack range in my heart. Within this range, I can attack whoever I want. The attack will descend in an instant. ”<br/><br/>“Also, the clone that I made just now has the same root as me because this is the power from the root. Now, I can use the root to create clones that are exactly the same as me and possess the same strength as me.”<br/><br/>“1 even feel that these clones are myself. Now, I can create three clones! ” Tianci said excitedly!<br/><br/>“Also, foster father, Tonggensheng also has an attack method. Similarly, Tonggensheng has an attack range. Within this range, 1 can make the roots enter the enemy’s body, absorb his life force, and even control the enemy’s body!<br/><br/>He continued to add on!<br/><br/>“These two skills are very powerful. The power of the ultimate treasure of<br/><br/>Tianyuan is beginning to show.”<br/><br/>When Wang Xian heard that, he was slightly surprised. It was indeed an attack- type ultimate treasure of Tianyuan.<br/><br/>It could directly create clones and create three clones with the same strength as itself.<br/><br/>If it broke through to the Tianyuan creation stage and created three more clones, it would be equivalent to four beginner-level Tianyuan creation stage clones!<br/><br/>As for the divine tree, it was also powerful.<br/><br/>“Let me take a closer look! ”<br/><br/>As Wang Xian spoke, the energy of the ancestral tree entered Tianci’s body.<br/><br/>When the energy of the ancestral tree touched the treasure of Heaven’s origin creation, the treasure of Heaven’s origin creation, the divine tree, was obviously very excited and happy.<br/><br/>Speaking of which, Tianci was raised by him.<br/><br/>The divine tree in his body was also raised by the ancestral tree.<br/><br/>He had been instilled with the energy of the ancestral tree since he was young. Otherwise, it wouldn’t have grown so fast!<br/><br/>The branches wrapped around the energy of the ancestral tree as if they were welcoming it.<br/><br/>Wang Xian used the energy of the ancestral tree to sense the new divine striking tree and the roots beneath it!<br/><br/>When he touched the roots, an aura of origin was transmitted over.<br/><br/>These roots were extremely important to this divine tree.<br/><br/>It was even the strongest part of this divine tree.<br/><br/>This was some information that Wang Xian had obtained.<br/><br/>Following that, an extremely likely information flashed across his mind, causing his eyes to glow!\t\t\t\t\t\t</div>", "images": {}, "success": true}