{"id": 1156, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074350.html", "title": "Chapter 4159 - Chapter 4159: 4158 Trump Card Against His Backer! Go", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4159 - Chapter 4159: 4158 Trump Card Against His Backer! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4159: 4158 trump card against his backer! Go<br/><br/>Translator: 549690339<br/><br/>“Grandpa, his strength is very strong! ”<br/><br/>Liao Feiyu heard his grandpa’s words and replied with an embarrassed expression!<br/><br/>With the strength that Mu Litianci had just displayed, he might not be a match for him!<br/><br/>“Kill him, go!”<br/><br/>The old man looked at his grandson and frowned slightly. He patted his shoulder and said!<br/><br/>At the same time, a blood-red light entered Liao Feiyu’s body from his palm!<br/><br/>Liao Feiyu instantly felt a majestic energy enter his body.<br/><br/>Then, he saw an earthen-yellow earth hammer enter his blood.<br/><br/>The Earth Hammer contained a powerful force, as if it was going to burst his body!<br/><br/>He felt an endless amount of energy coming from the Earth Hammer.<br/><br/>Sensing the energy in his body, his eyes shone.<br/><br/>This was their Liao clan’s bloodline weapon!<br/><br/>The so-called bloodline weapon, as the name implied, was a weapon that could only be used by their Liao clan’s bloodline.<br/><br/>This kind of weapon, in their Liao clan, there were only a dozen of them!<br/><br/>Every one of them was in the hands of the top warriors of the Liao clan.<br/><br/>Liao Fei Yu’s grandfather was an official warrior of the Liao clan of the Black Earth tribe, a Level 9 universe overlord.<br/><br/>He had the potential to reach the Pinnacle Universe Overlord realm in the future.<br/><br/>This weapon was a bloodline weapon, so as the bloodline of the Liao clan, he didn’t need to nurture it and could use it directly.<br/><br/>Even if he could only borrow a trace of energy, it was enough!<br/><br/>A powerful bloodline weapon could even allow him to fight against a universe ruler at level one.<br/><br/>With this weapon, he had a 100% chance of killing that arrogant brat!<br/><br/>In the surrounding area, some warriors of the Liao clan of the Black Earth tribe looked at Liao Fei Yu and said indifferently!<br/><br/>“Grandpa, I will definitely kill this guy who dared to hurt my sister. I will kill him and let him know the consequences of looking down on our Xuan Earth Tribe !<br/><br/>Liao Fei Yu said with a face full of killing intent!<br/><br/>Beside him, a few pinnacle universe masters of the Xuan Earth tribe sensed everything and smiled.<br/><br/>Even though Mu Li Tian was gifted with a monstrous talent.<br/><br/>However, those who dared to hurt the top heaven’s favorites of the Xuan Tu tribe had to pay a terrible price!<br/><br/>The Xuan Tu tribe was very protective of their own people!<br/><br/>It had been a long time since someone dared to provoke them!<br/><br/>Heaven’s favorites, monstrous, so what!<br/><br/>It was still the same saying. Those Heaven’s favorites who had yet to grow up were all weaklings.<br/><br/>They didn’t need to care!<br/><br/>At this moment, at the side of the arena.<br/><br/>Wang Xian sat on a chair and looked at the Xuan Tu tribe. He raised his eyebrows slightly and a cold look flashed across his eyes.<br/><br/>Wang Xian had witnessed everything that had happened to them.<br/><br/>Even though Liao Feiyu’s grandfather’s actions were very secretive, so secretive that other than the nearest expert from the Xuan Tu tribe, no other expert had discovered it!<br/><br/>However, all of this could not be hidden from Wang Xian.<br/><br/>Including him, a powerful weapon had suddenly appeared in his body!<br/><br/>“You Want to kill Tianci? HMPH, do you really think that only you guys have a trump card and a backer?”<br/><br/>Wang Xian muttered softly. A book appeared under his feet.<br/><br/>The book turned into a stream of water and disappeared immediately!<br/><br/>At the same time, tianci, who was in the arena, suddenly sensed a surge of energy entering his body!<br/><br/>“Those guys wanted to cheat and gave him a powerful weapon. It seems like they want to use their trump cards and backers to suppress tianci. Hehe, feel this book of yours. The Treasure in your body has my aura and the book will accept you. Tianci, you can use the energy on it.”<br/><br/>“They want to kill you and kill Liao Feiyu directly. I want to see how shameless this Xuan Tu tribe can be! ”<br/><br/>Following that, Tianci heard Wang Xian’s voice transmission!<br/><br/>When he heard this news, TIANCI’s expression changed slightly.<br/><br/>Just now, when the expert from the Xuan Tu tribe said that he would not use his power to oppress others, he thought that the other party was very fair. In the end, he secretly gave Liao Feiyu a powerful treasure to kill him.<br/><br/>This was the Xuan Tu tribe?<br/><br/>This was justice!<br/><br/>Tianci’s gaze became colder and colder.<br/><br/>If he didn’t have a foster father, what could he do?<br/><br/>Expose his wood attribute strength?<br/><br/>Even if he was exposed, if the Black Earth tribe wanted to kill him, it would be very easy.<br/><br/>At this moment, he felt that he was weak.<br/><br/>However, Liao Feiyu had his grandfather and his backer.<br/><br/>He, Mu Litianci, also had his backer.<br/><br/>He had a foster father!<br/><br/>“Kid, you dare to hurt my sister. Today, I will take your head. ” “I want you to know the consequences of hurting my sister! ”<br/><br/>At this moment, Liao Feiyu’s cold voice was heard.<br/><br/>His body moved and he instantly returned to the arena. He stared at Tianci with a face full of killing intent!<br/><br/>“Well, today I want to see whether you die or I Die!”<br/><br/>Tianci stared at Liao Feiyu and said coldly!<br/><br/>“Damn, is there really going to be a life-and-death battle?”<br/><br/>“The Black Earth tribe didn’t stop it. Both sides are going to have a life-and-death battle. Then this is a life-and-death Battle! ”<br/><br/>“Mu Litianci was able to kill Liao Feiyan just now. Is Liao Feiyu Mu Litianci’s opponent?”<br/><br/>“Who would have thought that the young man from the Hidden Dragon and young Phoenix Group would have a life-and-death battle with the Heaven’s Pride Group. They are on completely different levels! ”<br/><br/>“Age is not a level, but the strength is a level, and just from the point of view, Mu Li Tianci is even stronger. ”<br/><br/>All around the strong disciples of the major tribes continued to discuss, eyes fixed on the ring!<br/><br/>At the same time, the arena of this news, but also crazy to the other parts of the city, as well as other tribes there!<br/><br/>Mu Li Tianci of the Hidden Dragon and young Phoenix Group was instantly killed by Liao Feiyan, one of the top ten prodigies of the Heaven’s Pride Group, because his mother was humiliated.<br/><br/>Then, he had a life and death battle with Liao Feiyu!<br/><br/>This news spread crazily in earth city. When everyone saw this news, they were all stunned and filled with shock.<br/><br/>“Bang Bang Bang! Sister, it’s bad. Brother-in-law is going to have a life and death battle with Liao Feiyu!”<br/><br/>Inside the Earth cave where the Nine River Tribe lived!<br/><br/>A youth knocked on a room’s door with all his might, his face filled with shock and disbelief as he shouted loudly!<br/><br/>In the room, Gong Cheng Mu was sitting cross-legged in the room when he suddenly heard his younger brother’s voice outside, his face filled with shock.<br/><br/>With a wave of her arm, she opened the room’s door!<br/><br/>SIS, something big has happened, something big has happened to brother-in-law! ”<br/><br/>The moment the door opened, the young man rushed over and shouted loudly!<br/><br/>“What happened to Tianci?”<br/><br/>Gong Cheng glanced at him and did not care about how his brother addressed tianci. He quickly stood up and stared at him with shock in his heart..\t\t\t\t\t\t</div>", "images": {}, "success": true}