{"id": 1158, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074358.html", "title": "Chapter 4161 - Chapter 4161: A 4160 Bloodline Weapon!", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4161 - Chapter 4161: A 4160 Bloodline Weapon!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4161: A 4160 bloodline weapon!<br/><br/>Translator: 549690339<br/><br/>“A piece of trash like you dares to harass my mother? You’re courting death! ”<br/><br/>In the arena, TIANCPs cold gaze locked onto Liao Feiyu, his face filled with disdain.<br/><br/>The discussions and exclamations around the arena didn’t reach his ears.<br/><br/>His gaze was only on Liao Feiyu.<br/><br/>As soon as he finished speaking, his attack continued!<br/><br/>His body moved and he split into dozens of clones. Each of them held a sharp sword in their hands.<br/><br/>Dozens of clones quickly surrounded Liao Feiyu!<br/><br/>“Earth, heavy blow, tremor, gravity suppression! ”<br/><br/>Liao Feiyu stared at Wang Xian with a cold and gloomy expression.<br/><br/>He let out a low growl and smashed the gigantic shield in his hand onto the ground.<br/><br/>The ground began to collapse and tremble violently. Like waves, waves spread out in all directions.<br/><br/>At the same time, the entire space seemed to have frozen.<br/><br/>A powerful gravity filled the entire arena!<br/><br/>An area-of-effect attack.<br/><br/>Tianci stood on the arena and immediately felt the gravity below increase to a terrifying degree!<br/><br/>His speed was directly reduced by half!<br/><br/>Tianci’s expression did not change. With a move of his palm, streams of seawater appeared out of thin air and covered the ground!<br/><br/>The seawater became higher and higher, drowning Tianci’s figure!<br/><br/>“Whoosh! ”<br/><br/>In the seawater, he was like a swimming fish as he continued to attack Liao Feiyu!<br/><br/>Liao Feiyu stared at him and let out a low roar. The long spear in his hand grew bigger again and he threw it directly at tianci.<br/><br/>Tianci was in the water and his figure flashed.<br/><br/>In the surrounding area, water clones held sharp swords and formed a sword formation!<br/><br/>Rays of light connected the swords together!<br/><br/>“He merged the formation into the sword technique. What a powerful sword formation. If the Sword Formation is formed, Liao Feiyu is definitely not Mu Litianci’s match! ”<br/><br/>Beside the arena, Gong Cheng glanced around. A few elders and middle-aged men appeared and looked at the arena in astonishment!<br/><br/>“Great-grandfather!”<br/><br/>“Grandfather, Father! ”<br/><br/>Gong Cheng Glanced’s younger brother saw a group of figures suddenly appear and hurriedly shouted!<br/><br/>“This Mu Litianci either obtained a heaven-defying opportunity or has an expert teaching him from behind. Otherwise, it’s impossible for him to have such a realm and possess such powerful combat techniques and experience! ”<br/><br/>Gong Cheng glanced at their great-grandfather and nodded. He continued to speak and his gaze fell on her, “Mu Litianci, do you understand him?”<br/><br/>“Great-grandfather, I. . . I didn’t know that he would have such powerful strength. Great-grandfather, will he be Alright?”<br/><br/>Gong Cheng glanced at her and immediately shook his head. He could not help but ask worriedly.<br/><br/>“No, his combat experience and reaction speed are much stronger than Liao Feiyu’s. He Won’t Lose!”<br/><br/>Gong Cheng Mu’s great-grandfather shook his head and said!<br/><br/>“That’s good, that’s Good! ”<br/><br/>Gong Cheng Mu let out a sigh of relief and continued to watch.<br/><br/>“To have such combat experience at such a young age, he must have a strong teacher behind him! ”<br/><br/>An old man standing beside Gong Cheng glanced at his great-grandfather and made a judgment!<br/><br/>The others nodded in agreement.<br/><br/>“Heavenly Sword, seal the Devil! ”<br/><br/>At this moment, Tianci’s cold voice sounded in the arena.<br/><br/>On the arena, an incomparably huge sword formation was formed.<br/><br/>The entire sword formation shone with a sharp luster. Countless sharp swords interweaved together to form a huge pattern.<br/><br/>The huge sword formation completely surrounded Liao Feiyu!<br/><br/>Numerous sharp swords continuously attacked him!<br/><br/>“Bang Bang Bang! ”<br/><br/>Liao Feiyu held his shield and blocked the attacks with an extremely ugly expression!<br/><br/>“Crack Crack Crack! ”<br/><br/>Cracks appeared on his huge shield!<br/><br/>“Damn it, how can this guy’s attacks be so strong!”<br/><br/>Liao Feiyu’s face was cold.<br/><br/>He didn’t plan to use his bloodline weapon immediately. He wanted to kill Tianci with his own strength.<br/><br/>Even if he won, others would know that he relied on his powerful weapon to kill Tianci.<br/><br/>But now, without using his bloodline weapon, he might not be his opponent!<br/><br/>“Whoosh! Whoosh! Whoosh! ”<br/><br/>Just as he was thinking, the situation suddenly changed.<br/><br/>Below him, numerous sharp swords suddenly pierced through the soil under his feet and shot toward him.<br/><br/>“What?”<br/><br/>Liao Feiyu saw this scene and his face changed drastically.<br/><br/>But at this moment, he couldn’t react in time.<br/><br/>“Bang! Bang! Bang!”<br/><br/>“Bang! Bang! Bang!”<br/><br/>The sharp swords twisted and killed him, causing his hundred-meter-long body to quickly collapse. Pieces of Earth element energy armor collapsed and fell off!<br/><br/>The huge impact caused his heart to tremble violently and fresh blood flowed out from his mouth!<br/><br/>His body couldn’t help but fly up into the sky!<br/><br/>“That Liao Fei Yu is going to lose! ”<br/><br/>“He lost a little too quickly. To be able to defeat someone of the same level so quickly, this Mu Li Tian Ci’s strength is much stronger than I thought, almost half a step into the universe ruler realm! ”<br/><br/>Around them, some of the stronger warriors looked at the battle on the stage and decided in their hearts.<br/><br/>“HMPH!”<br/><br/>In the upper seat, at the position of the Black Earth tribe, Liao Fei Yu’s father and grandfather looked at this scene, their faces cold!<br/><br/>“Mu Li Tian Chi, don’t think of defeating me, I said I want to destroy you, I will destroy you! ”<br/><br/>Liao Fei Yu spat out fresh blood and flew towards the sky.<br/><br/>His entire body was in extreme pain!<br/><br/>His face was slightly distorted, and his face was filled with a sinister expression.<br/><br/>Liao Feiyu’s palm slowly covered the spot on his chest, and he used all his strength to claw!<br/><br/>An earthen yellow hammer appeared in his hand, and when the entire Earth Hammer appeared.<br/><br/>It directly emitted an earthen yellow luster.<br/><br/>The water sword that was attacking him quickly crumbled and disappeared under this earthen yellow light.<br/><br/>It was as if it had encountered a terrifying existence!<br/><br/>Scram! ”<br/><br/>Liao Feiyu’s face was flushed red as he held the earth hammer and smashed it downwards.<br/><br/>The earthen yellow energy charged downwards, and the force of the impact covered the entire stage!<br/><br/>The shadow of the Earth Hammer covered the entire stage!<br/><br/>When Tianci saw this scene, his expression changed slightly. All the clones in the surroundings gathered towards him!<br/><br/>However, in the next instant, all of his clones crumbled under this energy!<br/><br/>Tianci raised the sharp sword in his hand. The sharp sword split into eight and circled around him, forming a defensive barrier!<br/><br/>Crack! Crack<br/><br/>However, this defensive barrier quickly crumbled under the Earth Hammer’s attack.<br/><br/>Fortunately, the Earth Hammer’s attack completely disappeared at this moment!<br/><br/>“Is this his foundation? Is this the treasure given to him by the experts of the Black Earth tribe?”<br/><br/>Tianci stared at the Earth Hammer and felt the threat of death.<br/><br/>However, his expression didn’t change much!<br/><br/>His foster father had already told him about Liao Feiyu’s treasure.<br/><br/>Now that he felt its terrifying power, he wasn’t worried at all. For the adoptive father, he has 100% confidence and trust!\t\t\t\t\t\t</div>", "images": {}, "success": true}