{"id": 1159, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074362.html", "title": "Chapter 4162 - Chapter 4162: The Power Of The 4161 Water Forbidden Spell Book", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4162 - Chapter 4162: The Power Of The 4161 Water Forbidden Spell Book</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4162: The power of the 4161 water forbidden spell book<br/><br/>Translator: 549690339<br/><br/>“Boom!<br/><br/>The sound of explosions rang out on the stage, and terrifying energy waves crashed into the defenses around the stage.<br/><br/>Liao Feiyu stood in the center with the Earth Hammer in his hand, and a sandstorm slowly formed around him.<br/><br/>Above him, the shadow of an Earth Hammer Condensed, emitting a powerful might.<br/><br/>The sudden change and Liao Fei Yu’s sudden counterattack shocked all the great disciples of the surrounding tribes.<br/><br/>“What is this? What a powerful treasure?”<br/><br/>At the Mu Li tribe, the elders and Great Beings, as well as the heavenly-bestowed seniors, saw Liao Fei Yu’s sudden counterattack and their expressions changed drastically.<br/><br/>They stared nervously at the Earth Hammer in Liao Fei Yu’s hand!<br/><br/>“This weapon is not simple. No, this weapon is very, very powerful. How can a mere disciple of a universe knight have such a powerful treasure?”<br/><br/>An elder of the Mu Li tribe said with an embarrassed expression!<br/><br/>As universe masters, they were naturally able to sense whether a treasure was good or bad!<br/><br/>The Earth Hammer in Liao Fei Yu’s hand contained terrifying energy and the power it exuded. Even the most powerful treasure of the Mu Li tribe was inferior to it!<br/><br/>“It shouldn’t be. A disciple of such a realm shouldn’t have such a powerful treasure. This is bad!<br/><br/>Another elder of the Mu Li tribe spoke with a gloomy expression!<br/><br/>When Tianci’s grandfather heard this, his expression changed drastically. His face was filled with worry and anxiety.<br/><br/>When Mu Liyin ‘er heard this, her heart trembled. She quickly flew to Wang Xian’s side!<br/><br/>“Young master Wang Xian, Will Heaven bestow him with danger?”<br/><br/>Mu Liyin ‘er looked at Wang Xian and asked while clenching her fists.<br/><br/>Her son had suddenly displayed such powerful and heaven-defying strength.<br/><br/>A strength that even her mother didn’t know was definitely related to Wang Xian.<br/><br/>Even if heaven bestowing was heaven-defying, it was definitely due to Wang Xian that he had such strength and combat experience.<br/><br/>Otherwise, it was impossible for such a powerful existence to be born.<br/><br/>“Don’t worry, there won’t be any danger.<br/><br/>Wang Xian looked at Mu Liyin er and smiled faintly at her.<br/><br/>“That’s good, that’s Good!”<br/><br/>Upon hearing Wang Xian’s words and seeing her smile, Mu Liyin er was completely relieved.<br/><br/>She had never known about the background of this mysterious young man whom she had saved until today!<br/><br/>Fortunately, she could tell that Wang Xian was sincere towards Tianci and treated Tianci as his own child!<br/><br/>On the side, Tianci’s grandfather and the elders of the Mu Li tribe heard it.<br/><br/>They looked at each other before their eyes landed on the arena once again.<br/><br/>They had witnessed the mysteriousness and power of Tianci’s foster father.<br/><br/>Not to mention anything else, being able to nurture Tian Chi into a pinnacle universe knight was already very terrifying!<br/><br/>“This is bad, this is bad, how did that guy have such a powerful weapon?”<br/><br/>On the Nine River Tribe’s side, Gong Cheng’s younger brother exclaimed and stared at him nervously.<br/><br/>Gong Cheng stared at him and bit his lips!<br/><br/>“Bloodline weapon, this kind of weapon is the most powerful treasure in every clan of our Dark Earth tribe right? Only the most powerful seniors can have it right? Tian Chi is going to be in trouble!<br/><br/>In the seat of honor, Tu Jiang Tong’s expression changed when he saw this scene and he said!<br/><br/>Even though he had a good relationship with tianci, under such circumstances, he couldn’t help at all.<br/><br/>He was only at the level 5 knight realm, he was too weak.<br/><br/>Besides, this matter concerned the Black Earth tribe and the Liao clan.<br/><br/>How could a universe knight at level five of the Tu clan manage the Liao clan’s matters?<br/><br/>Even if he were to look for his father and grandfather, it would be useless!<br/><br/>“TSK TSK! ”<br/><br/>Some great beings of the dead tribe looked at the Earth Hammer weapon and shook their heads lightly, mocking it!<br/><br/>They naturally knew about such a treasure.<br/><br/>It wasn’t something a Pinnacle Universe Knight disciple could have!<br/><br/>The great beings of the surrounding tribes understood!<br/><br/>This was the Black Earth tribe, and this was the Liao clan. They wanted to kill this freak!<br/><br/>“Little Bastard, are you ready to die?”<br/><br/>Liao Fei Yu stood there like an ancient war god. His gaze was heaven-sent, and his face was filled with coldness and disdain.<br/><br/>The powerful force made him feel that he could even fight against a universe ruler at the first level.<br/><br/>Around the arena, the other eight top 10 disciples also frowned.<br/><br/>They knew that with such a powerful treasure in their hands, they wouldn’t be able to fight against Liao Fei Yu.<br/><br/>“No, we can’t suppress Liao Fei Yu without reaching the universe overlord level!<br/><br/>A young genius from the dead tribe said!<br/><br/>“A dead person can make you more arrogant!<br/><br/>Tian ci stared at Liao Fei Yu, his expression unchanged, his eyes full of fighting spirit!<br/><br/>“I will first cripple your limbs, and then Bury your head!<br/><br/>Liao Fei Yu heard Tian Ci’s words, and his face showed a cold expression.<br/><br/>He raised the Earth Hammer in his hand, and the blood patterns connected!<br/><br/>He waved his arm, and an Earth Python condensed on the Earth Hammer, and it directly attacked Tian Ci.<br/><br/>The Earth Python was invincible against Knights!<br/><br/>“Tian Ci, be careful!<br/><br/>Below, Gong Cheng saw this terrifying attack and his expression changed as he shouted at Tian Ci!<br/><br/>“Do you think you’re the only one with powerful treasures?”<br/><br/>Tian Ci looked at the Earth Python’s power, his gaze focused and his body shook.<br/><br/>A book slowly appeared above his head!<br/><br/>There was a huge forbidden word on the book!<br/><br/>Roar!<br/><br/>The Earth Python let out a roar and moved its huge body towards tianci!<br/><br/>When the Earth Python arrived in front of tianci and was about to bind him, the book of Forbidden Water Spells released faint ripples!<br/><br/>A ripple of water rushed towards the surroundings!<br/><br/>As the ripple passed, the Earth Python’s attack instantly stopped, as if time had been frozen!<br/><br/>Following that, the earth python gradually became illusory and completely disappeared!<br/><br/>When Tianci saw this scene, he was also somewhat shocked!<br/><br/>He had only summoned this book and floated around him as a simple treasure, yet it had such a terrifying power.<br/><br/>What kind of treasure did his foster father give him?<br/><br/>Liao Feiyu’s pupils constricted when he saw this scene. He looked at tianci in disbelief!<br/><br/>“Die, die, die!”<br/><br/>He focused his gaze, raised the Earth Hammer in his hand, and directly attacked tianci.<br/><br/>In the sky, the shadow of an Earth Hammer appeared.<br/><br/>The entire earth hammer completely enveloped tianci, and there was no room for escape!<br/><br/>He raised the Earth Hammer with both hands, and forcefully smashed downwards!<br/><br/>“Boom!<br/><br/>A huge explosion sounded. Tianci raised his head and looked over.. Waves of water energy surged into the book of Forbidden Water Spells!\t\t\t\t\t\t</div>", "images": {}, "success": true}