{"id": 1150, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074326.html", "title": "Chapter 4153 - Chapter 4153: 4152. Mu Li Yin ‘Er’S Accident", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4153 - Chapter 4153: 4152. Mu Li Yin ‘Er’S Accident</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4153: 4152. Mu Li Yin ‘er’s accident<br/><br/>Translator: 549690339<br/><br/>“Waiter, don’t talk nonsense! ”<br/><br/>Gong Cheng’s face turned red when he heard his younger brother’s words. He turned around and glared at his own younger brother!<br/><br/>“Hehe, Alright, Alright. Don’t talk, Don’t Talk! ”<br/><br/>The youth chuckled when he saw his sister scolding him and immediately said!<br/><br/>“Sigh, I can’t be envious. He’s really a winner in life!” Gui San Qian looked at them and said with a smile! “The first place this time should be tianci!”<br/><br/>“He shouldn’t be able to escape.”<br/><br/>“Tianci is still powerful, especially that sword technique. It’s really terrifying.<br/><br/>When I watched from the side, I felt a chill run down my spine! ” The surrounding youths gathered around and said to Tianci with a smile!<br/><br/>“Hehe, it was all taught by my foster father!”<br/><br/>Tianci said with a smile!<br/><br/>“No, TIANCI, your talent is amazing. If it were anyone else, they wouldn’t be as amazing as you! ”<br/><br/>Gong Cheng Mu looked at him and bit his head.<br/><br/>“No, there’s no foster father, and there’s no me now.”<br/><br/>Tianci shook his head seriously at Gong Cheng Mu. “Foster father watched me grow up and taught me many things. ”<br/><br/>“Oh? Then your foster father must be very powerful! ”<br/><br/>Gong Chengmu tilted his head to look at him and asked with a smile. “Yes, I’ll take you to meet my foster father when I have the chance! ”<br/><br/>Tianci said with a smile!<br/><br/>Okay!<br/><br/>Gong Chengmu narrowed his eyes and answered with a smile.<br/><br/>“Hehe, then let’s find an opportunity! ”<br/><br/>Tianci nodded.<br/><br/>“Okay, okay, stop showing off your love. Let’s go. I’ll take you to a fun place in earth city today! ”<br/><br/>Tu Jiangtong said loudly!<br/><br/>Everyone laughed and flew out!<br/><br/>Time passed by day after day.<br/><br/>“Miss Mu Liyin’er, are you here?”<br/><br/>Wang Xian strolled around Earth City for a long time and sat in his room out of boredom.<br/><br/>One day, a voice suddenly came from outside the cave.<br/><br/>Wang Xian heard the voice and didn’t pay attention to it!<br/><br/>Buzz Buzz<br/><br/>However, at this moment, he received a message from Tianci.<br/><br/>When he saw this message, a smile appeared on his face.<br/><br/>He got up and walked out!<br/><br/>“I don’t have time. Pm really sorry.”<br/><br/>“Miss Mu Liyin er, you’ve rejected me ten times already. You Can’t reject me again this time, right? Let’s just have a simple meal! ”<br/><br/>“That’s right, yin’er. It’s not a big deal to have a meal. Furthermore, we will be with you!”<br/><br/>When Wang Xian walked out, he immediately saw a burly young man and three women conversing there.<br/><br/>Among them was Mu Liyin ‘er!<br/><br/>Wang Xian took a glance and nodded at Mu Liyin’er. Then, he continued walking out!<br/><br/>He came to a restaurant that Tianci had informed him about. Wang Xian<br/><br/>walked over and came to a private room on the top floor!<br/><br/>“Foster Father! ”<br/><br/>As soon as he arrived at the door, Tianci immediately opened the door and greeted Wang Xian with a smile.<br/><br/>Okay.<br/><br/>Wang Xian looked at tianci’s expression and nodded with a smile. Then, he looked inside.<br/><br/>“Hello, Uncle!”<br/><br/>In the room, Gong Cheng Mu lowered his head slightly. However, he raised his eyes and greeted Wang Xian shyly!<br/><br/>“Hehe, you have good taste, Kid!”<br/><br/>Wang Xian took a look at Gong Cheng Mu, patted his shoulder and walked inside!<br/><br/>“Hehe, foster father, let me introduce you. This is Mu Mu. Gong Cheng Mu is also from our water source, the Jiuhe tribe. ”<br/><br/>Tianci started to introduce Wang Xian and the rest. “Mu Mu, this is what I told you, my foster father. ”<br/><br/>“You’re not bad. Apart from this meeting, there’s nothing else. Just take a simple amulet! ”<br/><br/>Wang Xian looked at Gong Cheng peering. With a wave of his arm, an amulet floated in front of her!<br/><br/>“Thank you, thank you, Uncle!”<br/><br/>Gong Cheng peering sensed it immediately but didn ‘t put it away immediately. Instead, he looked at tianci.<br/><br/>“Take it. Foster father treats me very well! ” Tianci smiled at Gong Cheng Mu and said!<br/><br/>“Why didn’t you call your mother over?”<br/><br/>Wang Xian sat down and asked Tianci with a smile.<br/><br/>“Hehe, foster father, I’ll tell you first if you still don’t dare to tell my mother.”<br/><br/>Tianci smiled foolishly.<br/><br/>Wang Xian smiled and looked at Gong Cheng Mu to sense it.<br/><br/>With the strength of a level four universe knight, Gong Cheng Mu was considered one of the top heaven’s favorites of his generation!<br/><br/>He had a sweet and pretty face. Wang Xian was very satisfied with this! In addition, the Nine River Tribe was also a large tribe. It was much stronger than the Mu Li tribe.<br/><br/>Although the Nine River Tribe did not have a heaven’s origin creator to oversee it.<br/><br/>However, the Nine River Tribe was the strongest existence in the water source.<br/><br/>Among all the tribes, they could be ranked in the top five!<br/><br/>There were many existences at the peak of the Universe Overlord realm in the trihp<br/><br/>Tianci had a girlfriend, which made Wang Xian, his old father, feel very gratified!<br/><br/>Taking advantage of the time now, it was not bad to enjoy it!<br/><br/>Wang Xian had a meal with them. After chatting for a few hours, he left immediately!<br/><br/>There was still a generation gap between him and the younger generation!<br/><br/>His peaceful life continued. Occasionally, he would go to watch Tianci’s matches, and Wang Xian would stay in his room!<br/><br/>Meanwhile, Tianci’s match had also reached the top ten!<br/><br/>However, on this day, not long after Tianci’s match ended, Wang Xian stayed in his room to practice the Heaven’s origin sword technique. He was helping the void dragon body to comprehend.<br/><br/>“Foster father, foster father! ”<br/><br/>All of a sudden, an extremely anxious voice came from outside!<br/><br/>Wang Xian opened his eyes. A look of astonishment appeared on his face. He waved his arm and opened the door!<br/><br/>Outside the door, Tianci looked extremely anxious and his eyes were slightly red.<br/><br/>“Foster father, foster father, my mother is injured. She is seriously injured! ” Tianci looked at Wang Xian in panic and his voice was a little choked up!<br/><br/>“What’s the situation?”<br/><br/>Wang Xian focused his gaze and asked Tianci.<br/><br/>Mu Liyin ‘er had been eliminated from the competition. In the underground city, fighting and killing were prohibited. How could mu Liyin’er be injured? “I don’t know the exact situation either. Mom is seriously injured. Foster father, please come and take a look at Mom! ”<br/><br/>Tianci pulled Wang Xian’s arm and said anxiously! “It’s alright. Don’t worry. Foster father is here! ” Wang Xian patted tianci’s arm and said to him!<br/><br/>Okay!<br/><br/>Tianci nodded. He knew his foster father’s identity and some of his tricks.<br/><br/>As long as he was not completely destroyed, he could be treated!<br/><br/>Wang Xian followed tianci to a room not far away!<br/><br/>In the room, Mu Liyin’er’s parents and a few older brothers were inside!<br/><br/>“Grandpa, let adoptive father take a look at Mom. Let adoptive father take a<br/><br/>100k!<br/><br/>Tianci brought Wang Xian inside and said loudly to his grandfather!<br/><br/>Okay!<br/><br/>At this moment, Tianci’s grandfather nodded with a gloomy face in front of the bed.<br/><br/>“Although her injuries are a little serious, it’s fortunate that she’s not in any life-threatening condition! ”<br/><br/>Tianci’s grandfather took a glance at Wang Xian and spoke!<br/><br/>“Let me treat her! ”<br/><br/>Wang Xian nodded and walked to the bed to sense Mu Liyin’s injuries..\t\t\t\t\t\t</div>", "images": {}, "success": true}