{"id": 1153, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074338.html", "title": "Chapter 4156 - Chapter 4156: Young Man 4155 Was Furious", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4156 - Chapter 4156: Young Man 4155 Was Furious</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4156: Young Man 4155 was furious<br/><br/>Translator: 549690339<br/><br/>“The last spot in the top 10 of the Prodigy group should be out soon! ”<br/><br/>“It’s coming out soon. Obviously, Kong Chunyu is much stronger. He is suppressing everyone. ”<br/><br/>“Kong Chunyu from the dead tribe is still strong. I feel that he is the strongest in the prodigy group. After all, he can summon three Pinnacle Universe Knights to fight. With his own strength, it’s a four versus one fight! ”<br/><br/>“The disciples of the dead tribe are all very strong. They can summon corpses to fight with their numbers!”<br/><br/>“As expected, Kong Chunyu is in first place. If he’s in second place, he should be from the dead tribe.”<br/><br/>As the six paths convention was going on, countless disciples from the six paths universes were watching.<br/><br/>Basically, the Heaven’s Pride Group and the Heaven’s pride group were the two groups with the most people watching and discussing.<br/><br/>The disciples of the Hidden Dragon and young Phoenix Group were relatively weak. They were relatively young, so their attention was relatively low.<br/><br/>As for the war god Group, 99% of the strong disciples couldn’t see their battle situation.<br/><br/>In other words, most of the disciples couldn’t see the moves clearly when the two strong disciples were fighting, so they couldn ‘t see who was stronger and who was weaker.<br/><br/>Only the heaven’s pride group could understand and participate in the discussion!<br/><br/>“Whoosh! Whoosh! ”<br/><br/>Tianci flew over from his residence and looked towards the arena. His eyes were shining.<br/><br/>He scanned his surroundings and finally landed on the seat of honor.<br/><br/>He stared at a young man and then at the woman beside the young man. A cold expression slowly appeared in his eyes!<br/><br/>“Liao Feiyan. ”<br/><br/>He gritted his teeth and spat out three words!<br/><br/>Tianci stood there quietly, waiting for the battle on the arena to end!<br/><br/>At the back of Tianci, Wang Xian’s figure slowly appeared. He condensed into a chair and sat there with a calm expression.<br/><br/>He watched everything calmly!<br/><br/>The battle on the arena ended not long after.<br/><br/>Kong Chunyu easily won the competition!<br/><br/>The selection of the top ten of the Heaven’s favorites group had also entered the final stage!<br/><br/>“All the top 10 of the Heaven’s pride group have come to the arena. Now, if there are any who are unconvinced, you can come and challenge them. As long as you can successfully challenge them, you will be ranked in the top 10! ” An old man floated above the arena and spoke to all the disciples!<br/><br/>This was the competition rule of the six paths competition.<br/><br/>As long as one was strong, even if the top 10 were basically chosen, they could still challenge them. Once they succeeded, they would be able to occupy his position!<br/><br/>There weren’t many such challenges, but there were also many!<br/><br/>Hearing the old man’s words, Tianci’s emotionless eyes shone with a cold luster.<br/><br/>He had been waiting for this time.<br/><br/>“I want to challenge! ”<br/><br/>The moment the old man’s voice fell, Tianci’s body moved and he flew directly toward the arena.<br/><br/>He landed in front of the arena and stared at Liao Feiyan with a hint of killing intent in his eyes!<br/><br/>Tianci suddenly flew over and wanted to challenge him. Everyone was stunned and their faces were filled with shock.<br/><br/>“What’s going on? Who is that person?”<br/><br/>“This is Mu Li Tianci from the hidden dragon and young Phoenix team. He is known as the strongest youth in the hidden dragon and young Phoenix team. He is extremely talented. What is going on? What is he doing?”<br/><br/>“He wants to challenge? Why is he participating in the Battle of the Heaven’s Pride Team? His strength is only at level five knight. The top 10 of the Heaven’s Pride team are all at the peak of the Knight Realm. ”<br/><br/>“What is Mu Li Tianci trying to do?”<br/><br/>“It’s tianci. What is he trying to do?”<br/><br/>In the surrounding area, all the disciples were shocked and shocked when they saw Tianci flying over.<br/><br/>Even the elder on the stage and the top ten disciples of the Heaven’s pride group looked at Tianci in surprise.<br/><br/>However, Liao Feiyan’s gaze turned cold when she saw the killing intent in Mu Litianci’s eyes. Her expression was a little ugly!<br/><br/>“Mu Litianci… ”<br/><br/>“Liao Feiyan, my mother didn’t provoke you, but you severely injured him. I want to challenge you, regardless of life or death! ”<br/><br/>The old man on the ring knew about tianci. He frowned and said.<br/><br/>However, before he finished his words, TIANCI’s cold voice sounded.<br/><br/>His words stunned everyone again!<br/><br/>“This is?”<br/><br/>“Mu Litianci’s mother? Mu Litianci’s mother seems to be a member of the Heaven’s Pride Group. She has been eliminated. What’s going on?”<br/><br/>“I don’t know, but Mu Litianci actually wants to fight to the death with Liao Feiyan? Isn’t he courting death?”<br/><br/>All the surrounding experts ‘faces were filled with shock and gossip when they saw this sudden change!<br/><br/>“Humph, a reckless fellow dares to challenge me. You Don’t have the qualifications. Get Out! ”<br/><br/>Liao Feiyan looked at Tianci with an ugly expression and said coldly!<br/><br/>“Tianci Mu, this is the six paths competition. Don’t mess around. Get Out! ”<br/><br/>The elder above also frowned and warned tianci!<br/><br/>“Tianci, get down quickly! ”<br/><br/>“Tianci, get down! ”<br/><br/>At the position of the Mu Li tribe, some of the elders and disciples of the Mu Li tribe were also there. When they saw this scene, their expressions changed and they quickly shouted at tianci.<br/><br/>Right now, tianci was shining brightly in the six paths competition. If something unexpected happened, it would be a great loss to their Mu Li tribe!<br/><br/>“Head judge, the rules of the six paths competition do not say that I can not challenge the members of the Heaven’s Pride Group. Since I have chosen to challenge them, I will bear the consequences myself!”<br/><br/>Mu Li Tianci looked at the old man and said!<br/><br/>“Are you sure you want to bear the consequences yourself? If you want to bear the consequences, then do as you please. Being Young and impetuous is a good thing, but you have to consider your own strength!”<br/><br/>The old man looked at Tianci and reminded him lightly.<br/><br/>A disciple of the hidden dragon and young Phoenix Group challenging the top ten of the Heaven’s pride group was simply courting death in his eyes!<br/><br/>His simple reminder was also benevolent and righteous.<br/><br/>If he really didn’t care about death and challenged, then even if he had outstanding talent, he wouldn’t be able to go far.<br/><br/>There were many heaven’s pride disciples, but only those who could reach the end could be considered a true heaven’s pride!<br/><br/>“Liao Feiyan, get out! ”<br/><br/>Tianci heard the old man’s words and nodded. He looked at Liao Feiyan, his eyes filled with ice-cold killing intent!<br/><br/>In front, Liao Feiyan looked at Tianci with an embarrassed and ice-cold expression.<br/><br/>She didn’t expect that a little guy from the Hidden Dragon and Phoenix Group would dare to challenge her!<br/><br/>She also didn’t expect that the son of the woman she beat up would dare to challenge her.<br/><br/>“You Reckless Bastard, your mother shamelessly seduced my brother. Now you have the face to come and take revenge on me, Hehe! ”<br/><br/>Liao Feiyan stared at Tianci and took a few steps forward as she said with a gloomy face!<br/><br/>“Nonsense, it was clearly Liao Feiyu who pestered my mother. You reversed the truth, damn it!”<br/><br/>Tianci’s eyes turned red when he heard her words.. He gritted his teeth and growled!\t\t\t\t\t\t</div>", "images": {}, "success": true}