{"id": 1157, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074354.html", "title": "Chapter 4160 - Chapter 4160: 4159 Trump Card Versus Backer! Go", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4160 - Chapter 4160: 4159 Trump Card Versus Backer! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4160: 4159 trump card versus backer! Go<br/><br/>Translator: 549690339<br/><br/>“Brother-in-law is going to have a life and death battle with Liao Feiyu because of his mother’s matter. The battle is about to begin, and this matter has already spread like wildfire in the underground city! ”<br/><br/>At the location where the Nine River Tribe lived, a youth reported loudly to Gong Chengmu, his face filled with anxiety!<br/><br/>When Gong Chengmu heard this, his expression was a little dazed!<br/><br/>Tianci was going to have a life and death battle with Liao Feiyu?<br/><br/>Liao Feiyu?<br/><br/>Liao Feiyu, she knew, a top-tier Heaven’s Pride Group’s Heaven’s Pride Group’s Heaven’s Pride Group!<br/><br/>In the six paths universe, among the heaven’s pride generation, it was considered to be the hot favorite to win the championship!<br/><br/>Why would tianci want to have a life and death battle with Liao Feiyu!<br/><br/>“No, no, I have to stop him immediately. Tianci isn’t Liao Feiyu’s match at all, I have to stop him immediately!”<br/><br/>Gong Cheng Glanced at the panicked expression on his face and quickly ran outside!<br/><br/>“Ah, sister, don’t worry. Just now, brother-in-law killed Liao Fei Yu’s sister, Liao Fei Yan. Liao Fei Yan was a Pinnacle Universe Knight, and he was killed by brother-in-law! ”<br/><br/>“Brother-in-law hid his strength. His strength is also at the Pinnacle Universe Knight level. He’s extremely terrifying. Damn, this news is boiling in the entire earth city. Brother-in-law hasn’t cultivated for 100 million years, yet he has such terrifying strength. It’s simply heaven-defying! ”<br/><br/>The young man saw his sister’s panicked expression and hurriedly followed behind and said loudly.<br/><br/>This news was obtained from the chat group of the Hidden Dragon and young Phoenix Group.<br/><br/>When he heard this news, he was also dumbfounded and filled with disbelief!<br/><br/>Now, all the Great Beings from the tribes had rushed over to watch this life-and-death battle!<br/><br/>They had all come to take a look at that young man who had cultivated for less than 100 million years, yet had reached the pinnacle level of a universe knight! This could be said to be unprecedented in the entire six paths universe!<br/><br/>“What?”<br/><br/>Gong Cheng Xiao’s body stiffened slightly when he heard these words. However, he did not ask further and immediately flew out.<br/><br/>Outside the Earth cave where they lived was the arena.<br/><br/>When he flew out, he saw two figures standing on the arena!<br/><br/>The surrounding disciples were all rushing over!<br/><br/>“Damn, how is this possible, brother Tian Chi has the strength of a Pinnacle<br/><br/>Knight! ”<br/><br/>Gong Cheng Mu arrived at the edge of the arena and heard Tu Jiang Tong’s shocked Roar!<br/><br/>The disciples who had just arrived were all discussing in shock!<br/><br/>“Are you ready to die?”<br/><br/>In the arena, Liao Feiyu stared at Tianci with a cold face. His face was full of violent killing intent and confidence!<br/><br/>Today, Mu Litianci had made him lose a lot of face. He wanted to make him pay with his life!<br/><br/>“Damn it, it’s You!”<br/><br/>Hearing Liao Feiyu’s words, Tianci’s face was full of coldness. With a move of his hand, he held the sharp sword in his hand and directly attacked!<br/><br/>“TIANCI, be careful! ”<br/><br/>Below the stage, Gong Cheng Glanced at the battle that had erupted, and his face was filled with anxiety and concern as he shouted loudly!<br/><br/>“You don’t know Death! ”<br/><br/>Liao Feiyu saw Tianci taking the initiative to attack him, and his face was filled with a cold expression!<br/><br/>His palm moved, and a shield and a long spear appeared in his hand! He waved the long spear, and directly stabbed towards tianci!<br/><br/>“Rumble!”<br/><br/>With a single move, the arena cracked open and a burst of Earth attribute energy charged towards tianci!<br/><br/>Tianci waved his arm and numerous water attribute sharp swords flew towards his surroundings!<br/><br/>Following that, they swiftly floated above his head and formed a sword formation!<br/><br/>The sword formation directly met Liao Feiyu’s Attack!<br/><br/>“Peng Peng Peng! ”<br/><br/>The Sword Formation attacked. The sharp swords carried a powerful might as they directly broke through Liao Feiyu ‘s Attack!<br/><br/>Following that, the power of the sword formation did not decrease as it attacked towards Liao Feiyu’s Attack!<br/><br/>“Earth, Sky High! ”<br/><br/>Liao Feiyu felt the power of Tianci’s attack. His gaze focused and he immediately raised his shield!<br/><br/>The surrounding soil spread towards the shield and formed an incomparably thick and heavy defense!<br/><br/>“Water, Doppelganger! ”<br/><br/>“Water, sword tomb!”<br/><br/>Seeing this scene, Tianci’s eyes focused, and his body turned into dozens of doppelgangers!<br/><br/>Each of the doppelgangers held a water sword in their hands and stood in a fixed position.<br/><br/>Dozens of doppelgangers attacked Liao Feiyu at the same time!<br/><br/>“Humph! ”<br/><br/>Seeing this scene, Liao Feiyu’s face turned ugly!<br/><br/>He didn’t immediately use the bloodline weapon in his body!<br/><br/>If he used such a weapon right from the start, he would be despised by others!<br/><br/>He shouted loudly, and the surrounding soil rushed towards his body.<br/><br/>His entire body began to grow rapidly, and soon he became a hundred-meter-tall giant!<br/><br/>The long spear in his hand also became more than ten times bigger under the cover of the soil!<br/><br/>Liao Feiyu stared at Tianci’s figure with contempt, and the long spear in his hand swept out with a terrifying power!<br/><br/>Sword 21! ”<br/><br/>Tianci’s expression did not change when he saw this scene!<br/><br/>His 21 clones suddenly turned into water energy and surged into the water sword in his hand!<br/><br/>The water sword instantly shone brightly and streaked across a stream of light.<br/><br/>The 21 sharp swords connected together and brought with them a sharp edge as they went straight for the long spear. “Bang Bang Bang! ”<br/><br/>An intense collision sound rang out.<br/><br/>Everyone around could see that the long spear in Liao Feiyu’s hand slowly turned into soil and fell to the ground!<br/><br/>The water sword turned into a stream of water and attached itself to the long spear, instantly attacking his giant arm!<br/><br/>“Damn it, what kind of strange attack is This!”<br/><br/>When Liao Feiyu saw this scene, his expression changed drastically, and he hurriedly dodged!<br/><br/>One of his giant arms was broken!<br/><br/>However, he was not injured.<br/><br/>“This? ? Liao Feiyu was actually suppressed by Mu Litianci. Mu Litianci’s technique is so strong! ”<br/><br/>“Liao Feiyu is at a disadvantage. What sword technique does Mu litianci have? It’s so strong! ”<br/><br/>“Hiss, I can’t imagine it. Isn’t this Mu Litianci too monstrous?”<br/><br/>In the surrounding area, all the powerful disciples saw that Mu Litianci had completely suppressed Liao Feiyu. All of them opened their eyes wide and discussed.<br/><br/>The youths from the Hidden Dragon and young Phoenix Group were even more dumbfounded!<br/><br/>There was actually such a terrifying existence hidden among them?<br/><br/>This? ?<br/><br/>“What kind of opportunity did mu litianci obtain?”<br/><br/>The gazes of the upper seats and the experts from the top tribes flickered as they looked at Mu Li Tianci. Their Hearts were slightly shaken.<br/><br/>What kind of opportunity could cause such a young youth to possess such great strength?<br/><br/>“Tianci! ”<br/><br/>At this moment, Mu Li Yin c er, who was seated at the back, received the news. Her face was a little pale as she flew over.<br/><br/>When she saw the situation on the stage, she was also filled with shock!<br/><br/>Mu Li Yin ‘er’s parents and brother were also filled with shock and disbelief.<br/><br/>The youth on the stage was their grandson? Nephew?\t\t\t\t\t\t</div>", "images": {}, "success": true}