{"id": 1154, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074342.html", "title": "Chapter 4157 - Chapter 4157: Young Man 4156 Flew Into A Rage", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4157 - Chapter 4157: Young Man 4156 Flew Into A Rage</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4157: Young Man 4156 flew into a rage<br/><br/>Translator: 549690339<br/><br/>Liao Feiyan’s words completely ignited TIANCI’s rage!<br/><br/>Everything was clearly Liao Feiyu pestering his mother, yet here she was saying that it was his mother pestering his younger brother!<br/><br/>This made his heart burn with rage, and his eyes were filled with coldness!<br/><br/>In the area around Liao Feiyan, the top ten disciples of the elite group raised their eyebrows when they saw this scene.<br/><br/>They moved and flew out of the arena!<br/><br/>Liao Feiyu’s expression was a little awkward as he kept changing his expression!<br/><br/>“There seems to be some gossip?”<br/><br/>“Liao Feiyu? What’s going on? And why did Liao Feiyan Call Mu Litianci a bastard?”<br/><br/>In the surrounding area, all the strong disciples of the tribes looked at this scene with confusion and curiosity in their eyes.<br/><br/>In any place, gossip was very attractive!<br/><br/>“I need to reverse the situation. A bastard without a father. I’ll give you one second to disappear from my sight. Otherwise, don’t blame me for bullying the weak! ”<br/><br/>Liao Feiyan stared at Tianci with disdain and said coldly!<br/><br/>Tianci’s body trembled slightly when he heard her vicious words!<br/><br/>He slowly raised his head, and a water attribute sword appeared in his hand!<br/><br/>He stared at Liao Feiyan, his eyes filled with violent killing intent.<br/><br/>“Huala! ”<br/><br/>In the next moment, he didn’t hesitate at all, and directly charged towards Liao Feiyan!<br/><br/>“Courting death, a kid who has cultivated for less than 100 million years actually dares to challenge sister Feiyan, he’s simply courting death! ”<br/><br/>“This kid called Mu Litianci, he really doesn’t know what’s good for him. He thinks he’s very strong in the hidden dragon fledgling Phoenix Group, yet he wants to challenge an expert from the Heaven’s Pride Group?”<br/><br/>“Is this kid a bastard without a father? interesting. It seems that Liao Feiyu wouldn’t bother a girl with a child!”<br/><br/>“Of course. Liao Feiyu is a top-tier heaven’s pride in our six paths universe. How could he pursue such a girl? It must be that girl who tried to seduce Liao Feiyu and was discovered by Liao Feiyan! ”<br/><br/>“A little thing dares to challenge the celestial sect disciples of our Black Earth Tribe?”<br/><br/>At the moment when Tianci moved, some of the powerful disciples of the surrounding tribes were discussing.<br/><br/>Especially the powerful disciples of the Black Earth tribe. They looked at this scene with cold and disdainful faces.<br/><br/>A disciple of a small tribe actually wanted to die. He dared to challenge the elites of their black Earth tribe!<br/><br/>He was simply courting death!<br/><br/>When the elders and strong disciples of the Mu Li tribe saw this scene, their expressions changed drastically. They looked around the arena with a face full of worry and hurriedly looked around!<br/><br/>“Young master Wang Xian, heaven has bestowed him… ” An elder flew to Wang Xian’s side anxiously and spoke to him.<br/><br/>“Don’t Worry! ”<br/><br/>Wang Xian waved his hand and interrupted him. He looked at everything calmly!<br/><br/>“But… ”<br/><br/>The elder of the Mu Li tribe opened his mouth. His expression was extremely ugly!<br/><br/>It was rare for their Mu Li tribe to have such a talented disciple. If something were to happen to him, their Mu Li tribe would suffer a huge loss!<br/><br/>Boom<br/><br/>However, at this moment, a loud boom was heard from the arena!<br/><br/>The elder of the Mu Li tribe looked forward immediately! All the surrounding disciples were also staring at the arena.<br/><br/>“What? How is this possible?”<br/><br/>However. in the next moment. shocked exclamations sounded from the surroundings!<br/><br/>At the seat of Honor, the disciples of the Black Earth tribe and the dead tribe looked at this scene in shock!<br/><br/>How is this possible! !<br/><br/>Tianci stood in the center of the arena. In front of him was a headless corpse. Her head was not far from him!<br/><br/>The head of the corpse was still staring wide eyed, filled with disbelief!<br/><br/>At this moment, Liao Fei Yan didn’t react at all!<br/><br/>When Tian Ci attacked, she was still filled with contempt.<br/><br/>Only when she felt that Tian Ci’s speed was terrifying and exceeded her expectations did she react!<br/><br/>However, it was too late!<br/><br/>Tian Ci’s strength was now at the Pinnacle Universe Knight Realm!<br/><br/>As for his actual strength, it had already reached the fourth level of the Universe Overlord realm.<br/><br/>He had reflexes and senses that far surpassed those of the same level.<br/><br/>Under such circumstances, he even had the sword technique that Wang Xian had taught him!<br/><br/>Tianyuan sword technique!<br/><br/>The best sword technique in the universe!<br/><br/>In addition, he also had the teachings of Wang Xian over the past 100 million years!<br/><br/>Tianci himself had the strength of being invincible among those of the same level.<br/><br/>Now that Liao Feiyan had completely underestimated her opponent, she had no time to react!<br/><br/>Hence, this was the result!<br/><br/>“Whoosh! ”<br/><br/>While everyone was in a state of shock, the referees above were also in a state of shock!<br/><br/>Tianci waved the sharp sword in his hand and slashed at Liao Feiyan’s head and body again!<br/><br/>A powerhouse at the peak of the Universe Knight Realm would not die immediately if his head was taken away!<br/><br/>No killing was allowed in the arena.<br/><br/>Otherwise, he would suffer a huge punishment!<br/><br/>However, Tianci didn’t want to completely destroy his opponent.<br/><br/>However, if he didn’t, he would make his opponent pay a huge price!<br/><br/>The blade swept past, and Liao Feiyan’s body was instantly destroyed, turning into lifeless flesh and blood!<br/><br/>As the sword Ray swept past her head, her eyes, tongue, and ears, as well as most of her life force, were also completely destroyed!<br/><br/>There was only a trace of life force left.<br/><br/>If it was said that Mu Liyin ‘er’s injuries would take hundreds of millions of years to recover, it might even be difficult for her to recover for the rest of her life.<br/><br/>On the other hand, Liao Feiyan’s injuries were basically incurable without any top-tier treasures to treat her, and without the help of a heavenly yuan manifestation expert!<br/><br/>Her injuries were ten times more serious.<br/><br/>This was TIANCPs revenge.<br/><br/>And it was just the beginning!<br/><br/>Tianci decided that if he had the chance, if he could really step into the Heavenly Yuan creation realm, he would come again!<br/><br/>He would come and take her life personally.<br/><br/>He could suffer humiliation, but his mother could not be hurt!<br/><br/>His mother and foster father were people he would never allow anyone to hurt in his life!<br/><br/>stop!<br/><br/>The old referee’s expression changed drastically when he saw this scene. He widened his eyes and looked at tianci in disbelief.<br/><br/>He instantly landed in front of Liao Feiyan’s remaining head and a surge of energy protected it!<br/><br/>His expression sank when he sensed it!<br/><br/>There was only a sliver of hope left. If he didn’t treat it, he would die soon!<br/><br/>“Senior referee, I won. I hit him too hard. I’m sorry, but I didn’t kill him completely. I’m still young and impetuous! ”<br/><br/>Tianci looked at Liao Feiyan’s head and then at the old referee. He bowed to him and said!<br/><br/>Tianci also knew that he couldn’t kill him yet.<br/><br/>Whether it was his foster father’s words or the reason of the Mu Li tribe, he couldn’t kill her.<br/><br/>But he was very satisfied with the result so far!\t\t\t\t\t\t</div>", "images": {}, "success": true}