{"id": 1167, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074394.html", "title": "Chapter 4170 - Chapter 4170: 4169 Nine-Origin Universe, Dragon King Of The Dragon Palace! Down", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4170 - Chapter 4170: 4169 Nine-Origin Universe, Dragon King Of The Dragon Palace! Down</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4170: 4169 nine-origin universe, Dragon King of the Dragon Palace! down<br/><br/>Translator: 549690339<br/><br/>The strong disciples of the Mu Li tribe were stunned.<br/><br/>Mu Li Yin’s parents and the others were even more incredulous.<br/><br/>The young man who was saved by his daughter.<br/><br/>The young man who had lived in their home for a long time, stayed in their Mu Li tribe for nearly 100 million years, and taught tianci cultivation was actually the strongest in another universe.<br/><br/>He was the kind of existence that could contend against the three lords from their six paths universe.<br/><br/>This? ?<br/><br/>All the strong disciples from the surrounding tribes were also stunned!<br/><br/>“There’s an expert from the Heaven’s origin creation next to that precious treasure of the Heaven’s origin creation. Attack with all your might. Don’t delay any longer! ”<br/><br/>When Bai Kefu Sheng saw that the Earth’s core shield had actually blocked their attacks, his eyes turned red when he saw Wang Xian’s figure. He immediately shouted loudly.<br/><br/>Now, every second that they stayed here, they would be in greater danger.<br/><br/>They had to end the battle quickly and snatch away the ultimate treasure of the Heaven’s origin creation!<br/><br/>This time, he had gathered six powerhouses in order to end the battle quickly.<br/><br/>Even if there were two to three Heaven’s origin creation powerhouses beside the young man with the ultimate treasure of the Heaven’s origin creation, they could still end the battle quickly!<br/><br/>“Alright! ”<br/><br/>“Don’t hold back. Use Your Trump Card! ”<br/><br/>The other six sky origin creation great beings focused their eyes and immediately roared!<br/><br/>They attacked the center of the Earth once again!<br/><br/>This time, they used their powerful trump cards at the same time.<br/><br/>A terrifying energy was brewing in the sky.<br/><br/>“Resist, resist! ”<br/><br/>In the sky above the arena, more than 10 to 20 pinnacle universe master level Great Beings saw the terrifying power of the seven sky origin creation great beings.<br/><br/>Their expressions were abnormally ugly.<br/><br/>A peak of the Dominator realm expert from the dead tribe immediately roared loudly.<br/><br/>At this moment, they had no time to care about Wang Xian’s side.<br/><br/>Moreover, the group of peak of the Dominator realm experts also knew that this heaven origin creation realm expert from the nine-origin universe was not here to fight for the Heaven Origin Creation Supreme Treasure.<br/><br/>Even if he had killed one of their peak of the Dominator realm experts, it was the best choice to defend against the outside world at this moment.<br/><br/>In addition, the surrounding universe masters also started to move. They set up layers of powerful defensive barriers, wanting to help the peak masters defend against it!<br/><br/>However, when they faced the seven heavenly Yuan Creation Realm Masters, they knew what despair was.<br/><br/>What was a heaven origin creation realm expert.<br/><br/>A terrifying and strange energy directly landed on the Earth’s core.<br/><br/>Waves of energy directly caused the defense of the Earth’s core to collapse.<br/><br/>The defense of the other peak ruler realm experts, as well as a large number of ruler realm experts, also quickly collapsed under this attack.<br/><br/>All the disciples of the six paths universe were filled with shock.<br/><br/>“Even under the suppression of our six paths universe, their strength is still so terrifying. Is this a heaven origin creation realm expert? When will our Lord Heaven origin creation realm expert arrive! ?”<br/><br/>A peak ruler realm expert couldn’t help but shout loudly!<br/><br/>They stared ahead.<br/><br/>The Seven Heaven origin creation realm experts had broken through their defenses, but fortunately, their attacks had completely dissipated.<br/><br/>However, they only managed to block one attack from the opponent.<br/><br/>The seven powerhouses of the Heaven’s origin continued to attack them at a terrifying speed!<br/><br/>“Block them together. Otherwise, Mu Litianci will be killed by them! ”<br/><br/>One of the powerhouses of the tribe of the dead, who was at the peak of the ruler realm, looked at the desperate situation in front of him. He lowered his head and shouted at Wang Xian who was in the arena below!<br/><br/>At this moment, only Wang Xian and them would be able to hold him back for a little longer!<br/><br/>“This time, we are determined to obtain the ultimate treasure of the Heaven’s origin. Fellow from the nine-origin universe, just you wait. I will definitely take revenge for what happened last time! ”<br/><br/>Bai Kefu Sheng glanced at Wang Xian and growled with a murderous look on his face!<br/><br/>Hener<br/><br/>Wang Xian stood in the arena and ignored the words of the expert from the tribe of the dead. When he heard Bai Kefu Sheng’s words, a cold smile appeared on his face, he stood with his hands behind his back and said, “Do You Want Revenge? When the calamity arrives, I will visit your universe! ”<br/><br/>“HMPH!”<br/><br/>Bai Kefu Sheng’s face darkened when he heard Wang Xian’s words. He didn ‘t dare to continue bragging!<br/><br/>He had witnessed the strength of Wang Xian’s side. It was enough to kill him.<br/><br/>Unless he could obtain the ultimate treasure of the Heaven’s origin, he wouldn’t be able to fight against Wang Xian.<br/><br/>He locked his gaze on Tianci again and his speed increased abruptly!<br/><br/>“We can’t defend against it at all! ”<br/><br/>A powerhouse at the peak of the ruler realm saw that Wang Xian had no intention of attacking. His expression changed drastically as he shouted loudly!<br/><br/>How could he defend against seven powerhouses of Tianyuan if he was close to them!<br/><br/>“The Ultimate Treasure of Tianyuan is ours! ”<br/><br/>A heavenly creation realm great being saw this scene and his eyes lit up.<br/><br/>The heavenly creation true treasure was right in front of him.<br/><br/>He could get it easily!<br/><br/>Buzz! Buzz<br/><br/>Buzz! Buzz<br/><br/>“Huh? The heavenly creation true treasure is here! ”<br/><br/>“Attack!”<br/><br/>“How dare you! How dare you steal the true treasures in our six paths universe? Die! ”<br/><br/>However, the moment Bai Kefu Sheng and the others flew toward Tianci.<br/><br/>The Heaven origin creation realm experts who had used teleportation arrays and treasures through hidden lines suddenly appeared.<br/><br/>There were a total of five heaven origin creation realm treasures that had arrived this way!<br/><br/>The moment they appeared, they immediately locked onto Tianci’s location and quickly attacked.<br/><br/>Their sudden attack once again caught everyone off guard.<br/><br/>This included Bakfu saint and the others.<br/><br/>This made their expressions extremely ugly!<br/><br/>At the last moment, not only were there five more heaven origin creation realm experts.<br/><br/>The Heaven origin creation realm expert from the six paths universe, Jin Bao, also rushed over.<br/><br/>He looked at the situation from afar and roared with killing intent!<br/><br/>With a wave of his arm, a metal chain attacked the heaven origin creation realm experts.<br/><br/>“Our Lord Heavenly Fate Realm Powerhouse is here! This is great! ”<br/><br/>The disciples of the six paths universe revealed an excited and relaxed expression when they saw one of their heavenly fate realm powerhouses.<br/><br/>“Damn it! Damn it! ”<br/><br/>Bai Kefu Sheng couldn’t help but roar when he saw this scene.<br/><br/>This was troublesome. They were in big trouble now.<br/><br/>They never thought that the powerhouses of the six paths universe would arrive so quickly.<br/><br/>Furthermore, the other great beings of the Heavenly Yuan creation realm also arrived so quickly.<br/><br/>Next, it would be extremely difficult to obtain a heavenly yuan creation true treasure!<br/><br/>Hualala<br/><br/>The terrifying metal chains attacked the Great Beings of the Heavenly Yuan creation realm one by one.<br/><br/>This made the great beings of the Heavenly Yuan creation realm have no choice but to resist!<br/><br/>Their strength had been weakened, and they were no longer able to contend with the Great Beings of the Heavenly Yuan creation realm from the six paths universe.<br/><br/>If they didn’t resist, they would be easily killed.<br/><br/>“Good Chance! ”<br/><br/>However, there were two heavenly creation realm powerhouses among them whose eyes were shining..\t\t\t\t\t\t</div>", "images": {}, "success": true}