{"id": 1163, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074378.html", "title": "Chapter 4166 - Chapter 4166: 4165 Continued To Fight, Exposing Himself", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4166 - Chapter 4166: 4165 Continued To Fight, Exposing Himself</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4166: 4165 continued to fight, exposing himself<br/><br/>Translator: 549690339<br/><br/>When Mu Litianci came to the arena again.<br/><br/>When Liao Feiyu and his father Liao Zhiyang heard his words, their expressions instantly darkened!<br/><br/>However, in the next moment, Liao Zhiyang’s face was filled with a sinister and terrifying smile!<br/><br/>Just now, he cared about the face of the Black Earth tribe and did not completely kill Mu Litianci.<br/><br/>But now, he actually took the initiative to step onto the arena to challenge him. This was simply courting death!<br/><br/>“Hehe, good, good, very good. You want to challenge me?”<br/><br/>Liao Zhiyang had a cold smile on his face and his eyes were shining. “Just now, because of the rules, I let you live. You Don’t value it now, so die! ”<br/><br/>“If I want to kill you, it’s no different from squashing an ant. Go To Hell! ”<br/><br/>Liao Zhiyang said. This time, he didn’t hesitate at all. With a wave of his arm, an earth arrow condensed in front of him.<br/><br/>The Earth Arrow instantly attacked Tian Ci!<br/><br/>Although this earth arrow wasn’t the strongest attack of a level 5 universe master, even a Level 4 universe master would have to go all out to resist it!<br/><br/>The difference in level was huge!<br/><br/>The Earth Arrow instantly arrived in front of Tian Ci.<br/><br/>Tian ci stared at the Earth Arrow, his expression didn’t change at all!<br/><br/>Under his feet, a tree was growing rapidly, the huge tree branches were luxuriant.<br/><br/>“Sou Sou Sou!”<br/><br/>The branches directly condensed into a huge vine, facing the Earth Arrow!<br/><br/>The sound of collision sounded again.<br/><br/>Mu Litianci’s realm was only at the Level 4 universe overlord realm, but he still had the power of the Divine Tree of Heavenly Yuan creation in his body!<br/><br/>With the support of this power, it was not easy to fight against someone of a higher realm!<br/><br/>The huge collision sounded and the earth arrow slowly dissipated!<br/><br/>The huge vine was like a huge python, still emitting a powerful aura!<br/><br/>“Wood attribute! ”<br/><br/>“How is this possible, how did he grasp wood attribute?”<br/><br/>“Wood attribute power at least at the level five universe ruler realm, how is this possible?”<br/><br/>At this moment, everyone around the arena was stunned once again!<br/><br/>Yes, completely stunned!<br/><br/>They felt five thunderclaps, feeling that everything before their eyes was all an illusion!<br/><br/>A youth who had cultivated for less than 100 million years, possessing the power of a pinnacle universe knight, already made them feel freakish and shocked!<br/><br/>But now, this youth had displayed the strength of at least a universe ruler level five.<br/><br/>And this time, it wasn’t water, but wood!<br/><br/>A youth who had cultivated for less than 100 million years and was a universe ruler level five?<br/><br/>This was fake, right?<br/><br/>Unbelievable!<br/><br/>Every great being and disciple felt a little dazed by this scene and Mu Li Tian Chi’s strength!<br/><br/>Mu Li Yin ‘er, Tianci’s grandfather, the experts of the Mu Li tribe, were the same!<br/><br/>This strength? ?<br/><br/>Especially Tianci’s grandfather, his current strength was only at the level 5 universe overlord realm.<br/><br/>However, his grandson’s strength wasn’t weaker than his?<br/><br/>Furthermore, how did he control the wood attribute?<br/><br/>“Yin c er, what’s going on? Why is tianci still controlling the wood attribute?<br/><br/>And So Strong?”<br/><br/>He could not help but ask.<br/><br/>However, when he saw his daughter’s confused expression, he knew that his daughter did not know about this matter either.<br/><br/>Then everything…<br/><br/>He looked at the calm Wang Xian and felt that the current Wang Xian was extremely mysterious!<br/><br/>“You actually blocked it. Wood attribute. Your Wood attribute is so strong. How is this possible?”<br/><br/>Liao Zhiyang looked at this scene and roared in disbelief with his eyes wide open!<br/><br/>“My foster father said that I’m not suitable to cultivate the water attribute.<br/><br/>Wood attribute is my true attribute! ”<br/><br/>“Are you ready to die?”<br/><br/>Tianci stared at him with a calm expression. In the next moment, his gaze focused and the towering tree behind him instantly attacked Liao Zhiyang with its branches!<br/><br/>The branches that filled the sky were like giant pythons that could swallow the sky and the earth as they attacked Liao Zhiyang!<br/><br/>“Damn it, earth explosion meteorite! ”<br/><br/>Liao Zhiyang’s expression changed drastically. One of his hands turned into a giant arm and blasted towards the ground!<br/><br/>“Rumble!”<br/><br/>“Rumble!”<br/><br/>The earth cracked and the earth pieces formed into terrifying meteorites that went straight for the countless branch pythons!<br/><br/>“Boom!”<br/><br/>However, those branch pythons instantly covered countless meteorites and drowned them!<br/><br/>The energy of the two seemed to be on completely different levels!<br/><br/>The terrifying branches continued to attack Liao Zhiyang.<br/><br/>“What?”<br/><br/>Liao Zhiyang’s pupils constricted when he saw that his attack was easily destroyed.<br/><br/>He knew that Mu Litianci was much stronger than him.<br/><br/>He was not his opponent at all.<br/><br/>Although it was unbelievable and hard for him to accept, it was the truth!<br/><br/>“Father! Save Me! ”<br/><br/>Liao Zhiyang quickly cried out for help!<br/><br/>“Where exactly is this monster?”<br/><br/>Liao Zhiyang’s father stood at the seat of honor and stared at this scene with his eyes wide open. His expression kept changing.<br/><br/>He gestured to a middle-aged man at the side!<br/><br/>The middle-aged man beside him nodded, directly flying towards the arena!<br/><br/>stop!<br/><br/>The middle-aged man shouted loudly, waving his arm, a butcher’s knife condensed in the air.<br/><br/>The butcher’s knife was incomparably huge, almost able to stand up to the heavens and earth!<br/><br/>It directly slashed towards the direction of Tian Chi!<br/><br/>It was an attack of a universe overlord Level 8 expert!<br/><br/>And it was a very strong attack.<br/><br/>“Hehehe, how ironic. This is your black Earth tribe. You beat me up, then you beat me up, and now there’s an even older one. How despicable and Shameless! ”<br/><br/>The moment the middle-aged man made his move, Tian Ci had already sensed it.<br/><br/>He looked over, his face full of mockery and disdain!<br/><br/>And this mocking voice spread throughout the entire arena!<br/><br/>“It’s Liao Mingdao, he actually made a move! ”<br/><br/>“This is indeed a bit despicable and shameless. The younger ones can’t win, the older ones can’t win, and the stronger ones are coming? What’s the<br/><br/>“Isn’t this Xuan Tu tribe too shameless? Why don’t they just directly send experts to kill Mu Litianci?”<br/><br/>“Liao Feiyu is the son of the top ten of the Heaven’s Pride Group. Liao Zhiyang also entered the top 20 of the Heaven’s Pride Group, and this Liao Mingdao is even stronger. He’s a strong contender for the first place in the WARGOD group this time. Coming out one by one, he’s Too Shameless! ”<br/><br/>At this moment, when the surrounding strong disciples of the surrounding tribes saw that the Black Earth tribe had actually sent Liao Mingdao to attack, they couldn’t help but say this!<br/><br/>This series of actions.<br/><br/>Too Shameless!<br/><br/>“Hit the God!”<br/><br/>When Tianci saw Liao Mingdao’s attack, his body trembled. Three clones appeared around him.<br/><br/>The three clones held a branch in their hands. At the same time, a branch appeared in Tianci’s hands.<br/><br/>The main body and the three doppelgangers waved the branch in unison towards the huge butcher’s knife!<br/><br/>A violent collision sound was heard once again.<br/><br/>The Shadows of the four pieces of paper landed on the butcher’s knife.<br/><br/>The butcher’s knife slowly began to crumble!\t\t\t\t\t\t</div>", "images": {}, "success": true}