{"id": 1165, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074386.html", "title": "Chapter 4168 - Chapter 4168: The 4167 Heavenly Creation Realm Warriors Gathered", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4168 - Chapter 4168: The 4167 Heavenly Creation Realm Warriors Gathered</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4168: The 4167 Heavenly Creation Realm Warriors gathered<br/><br/>Translator: 549690339<br/><br/>“Sou! Sou! Soul”<br/><br/>“Sou! Sou! Soul”<br/><br/>The sky above the six paths competition arena was filled with wind and clouds!<br/><br/>The Black Earth tribe and the Dead Tribe’s Peak Universe Master Realm Warriors quickly arrived at the arena and stared at Tian Ci.<br/><br/>They stared at the god striking wood branch in Tian Ci’s hand!<br/><br/>On it, they could sense the pure information of the heavenly creation true treasure.<br/><br/>Tianci looked at them, his face full of calmness!<br/><br/>“Heavenly creation true treasure, the one in your hand is a heavenly creation true treasure?”<br/><br/>A patriarch of the Black Earth tribe stared at Tianci with a trembling body and growled in a low voice!<br/><br/>(‘I didn’t expect, I didn’t expect that the heavenly creation true treasure that the other universe’s heavenly creation Great Beings invaded and made us search for in the entire six paths universe would be in your hands, in your hands !<br/><br/>The great being of the dead tribe was trembling, and his eyes were filled with excitement.<br/><br/>A true treasure of Tian Yuan creation that caused the entire six paths universe to tremble and caused many great beings of Tian Yuan creation to chase after it appeared in front of them!<br/><br/>This made his breathing quicken!<br/><br/>“What? The treasure that caused other great beings of Tian Yuan creation to invade our universe and search for it, the treasure that our six paths universe has been searching for for hundreds of millions of years, is actually in the hands of Mu Litian?”<br/><br/>“Tian Yuan creation true treasure? This Mu Li Tianci was able to reach such a terrifying level at such a young age because of the Tian Yuan creation true treasure? Oh My God! ”<br/><br/>At this moment, all the Great Beings ‘disciples from the surrounding tribes felt their breathing stop!<br/><br/>Close to a hundred million years was the most chaotic year in the six paths universe.<br/><br/>It was also the year that all the great beings from the tribes felt the most dangerous!<br/><br/>The Great Beings of heavenly creation from other universes invaded.<br/><br/>Later on, those great beings of heavenly creation sent their subordinates into their universes.<br/><br/>For this reason, the three great beings of heavenly creation from the six paths universe even gave orders to form a team to hunt down the intruders!<br/><br/>The invasion of the other universe masters all originated from the birth of a heavenly creation true treasure in their six paths universe.<br/><br/>Now, this heavenly origin creation true treasure was in the hands of a youth.<br/><br/>“The heavenly origin creation true treasure isn ‘t in my hands, but has always belonged to me, and has always been one with me. My mother was unmarried and pregnant, and gave birth to me because the heavenly origin creation true treasure was born in my mother’s body.” Tianci looked at them calmly and said!<br/><br/>“What?”<br/><br/>The top-tier Universe Masters of the Black Earth tribe and the dead tribe widened their eyes when they heard Tian Ci’s words!<br/><br/>Around the arena, Mu Li Yin ‘er also opened her mouth when she heard the news!<br/><br/>Mu Li Yin ‘er was a person who kept her body clean. When she suddenly got pregnant, she was also a little confused and couldn’t understand it at all!<br/><br/>Later on, her father guessed that a powerhouse had controlled her body and defiled her, making him pregnant!<br/><br/>This was also the most reasonable and most likely scenario.<br/><br/>Even she accepted this answer.<br/><br/>But now, she was not defiled by anyone. She was pregnant and was given birth because of the Heavenly Yuan Destiny Treasure.<br/><br/>The Heavenly Yuan Destiny Treasure was born in her body?<br/><br/>This? ?<br/><br/>Mu Liyin ‘er was in a daze!<br/><br/>The surrounding disciples were also shocked!<br/><br/>“No wonder, no wonder the other universe masters, the three lords of our universe, and all the tribes tried their best to find the heavenly fate treasure but couldn’t find it. It turns out that the heavenly fate treasure was born in a person’s body and fused perfectly with a person! ”<br/><br/>A great being at the pinnacle of universe masters murmured.<br/><br/>In the past 100 million years, the entire six paths universe had been searched thoroughly, but they still couldn’t find the heavenly fate treasure!<br/><br/>So that was how it was!<br/><br/>“Heavenly Fate Treasure! ”<br/><br/>However, at the positions around the arena, some of the Great Beings’ disciples looked at the center of the arena with their eyes slightly wide open!<br/><br/>Their eyes flickered as they took out communication devices, treasures, and some special scrolls to spread some news!<br/><br/>Those who received the news were all heavenly Yuan creation realm powerhouses from other universes.<br/><br/>A group of Heavenly Yuan creation realm powerhouses had entered the six paths universe. In these 100 million years, their invasion of the six paths universe was already very deep!<br/><br/>Their subordinates would be suppressed by the six paths universe.<br/><br/>In that case, they could develop the subordinates of the six paths universe.<br/><br/>Regardless of whether it was coercion or enticement, it was simply too easy for the heaven origin creation Great Beings to control some of the Great Beings ‘disciples from the six paths universe!<br/><br/>In fact, there were even spies in the various tribes.<br/><br/>And their spies were for the news of the Heaven origin creation true treasure.<br/><br/>Especially since it was rumored that the Heavenly Yuan Destiny Supreme Treasure had appeared here, the group of Heavenly Yuan destiny realm experts naturally gathered some spies here.<br/><br/>There were many spies around Earth City!<br/><br/>Now that these spies had received this news, they immediately sent it out!<br/><br/>The Heavenly Yuan Destiny Supreme Treasure had appeared!<br/><br/>There were even some spies who scanned their surroundings warily and took out an item that looked like an altar.<br/><br/>Teleportation array!<br/><br/>It could instantly teleport a great being of heavenly origin creation!<br/><br/>“Take the heavenly origin creation true treasure away! ”<br/><br/>A great being at the Pinnacle Universe ruler realm from the Black Earth tribe focused his gaze and immediately decided to send a voice transmission to his companion beside him!<br/><br/>Beside him were three other great beings at the Pinnacle Universe ruler realm.<br/><br/>They were great beings who were watching the competition from the upper seats. Similarly, they were here to prevent other universe invaders from wantonly slaughtering the elites and great beings of their six paths universes!<br/><br/>Now that the heavenly creation true treasure had appeared, they knew the importance of the heavenly creation true treasure. They had to get it, even if they had to pay a terrible price!<br/><br/>Hong<br/><br/>Just as they were about to make their move, a powerful force rushed toward them from the side!<br/><br/>The Four Pinnacle Universe Masters of the Dead tribe were also ready to make their move toward Tian Ci.<br/><br/>This time, both sides had no scruples at all!<br/><br/>Even if it was a battle, they wouldn’t hesitate!<br/><br/>In fact, the three Pinnacle Universe Masters of the Dead tribe had already attacked the four great beings of the Black Earth tribe.<br/><br/>Obviously, they wanted to fight for a chance for their companion!<br/><br/>The sudden change made everyone’s expressions change drastically. The experts of the Black Earth tribe and the dead tribe actually started fighting!<br/><br/>This? ?<br/><br/>“Attack! That Heavenly Yuan Destiny Treasure belongs to us! ”<br/><br/>However, the instant they attacked, seven figures flew towards them at a terrifying speed from the entrance of the arena.<br/><br/>Their gazes locked onto Tianci, their eyes filled with excitement and greed!<br/><br/>The energy that erupted from their bodies caused the expressions of all the experts around the arena to change drastically!\t\t\t\t\t\t</div>", "images": {}, "success": true}