{"id": 1161, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074370.html", "title": "Chapter 4164 - Chapter 4164: 4163 Continued To Fight. He Was Exposed! Go", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4164 - Chapter 4164: 4163 Continued To Fight. He Was Exposed! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4164: 4163 continued to fight. He was exposed! Go<br/><br/>Translator: 549690339<br/><br/>The sound of shattering rang out in the arena!<br/><br/>The Giant Liao Feiyu’s body completely froze.<br/><br/>The earth hammer in his hand slowly began to crumble under everyone’s gaze!<br/><br/>It completely crumbled!<br/><br/>At this moment, he could feel the crumbling earth hammer. Seeing the powerful bloodline weapon belonging to their Liao clan crumble, he was completely stunned!<br/><br/>Yes, this time, he was completely stunned!<br/><br/>This Earth Hammer was one of the top weapons of the Liao clan.<br/><br/>Now it was actually destroyed.<br/><br/>It was destroyed in the hands of a Pinnacle Universe Knight!<br/><br/>In the seat of Honor, Liao Fei Yu’s grandfather’s face instantly paled, and he couldn’t help but spit out a mouthful of blood.<br/><br/>His eyes were slightly bloodshot as he stared at the arena, his body violently trembling!<br/><br/>“Damn it, the Silver Earth Hammer was actually destroyed, it was actually destroyed!<br/><br/>Liao Feiyu’s grandfather’s eyes were slightly bloodshot, and his face instantly revealed a savage expression.<br/><br/>He let out a low roar, and a terrifying might erupted from his body!<br/><br/>The Silver Earth Hammer was one of the few bloodline supreme treasures of their Liao clan.<br/><br/>It was one of the inheritance treasures of the Black Earth tribe.<br/><br/>Now, it had been destroyed, and their losses were too great!<br/><br/>“How is this possible? How could the hammer of silver earth be destroyed so easily? What kind of treasure is that young man holding?”<br/><br/>“Hiss, the bloodline inheritance treasure has been destroyed. This…<br/><br/>At this moment, many great beings stood up from the upper seat of the Black Earth tribe. Their expressions changed drastically as they watched this scene in shock.<br/><br/>A young man with the power of a universe knight had already shocked them!<br/><br/>The weapon in this young man’s hand had actually destroyed the bloodline weapon of their black Earth tribe.<br/><br/>This?<br/><br/>“No! »<br/><br/>Liao Fei Yu looked at the Silver Earth Hammer that had completely collapsed, and his eyes were also bloodshot as he roared madly!<br/><br/>“When you bullied my mother, did you think about this scene? Are You Ready to die?”<br/><br/>Tianci stared at them. His face was cold and cold, but his expression didn’t change much!<br/><br/>He continued to walk towards Liao Feiyu, his gaze fixed on him.<br/><br/>Liao Feiyu saw Tianci continue to get closer. This time, he couldn’t help but take two steps back. His face was filled with fear.<br/><br/>He didn’t want to die!<br/><br/>All the strong disciples of the tribes around were shocked.<br/><br/>Die!<br/><br/>Tianci suddenly increased his speed. A stream of water fell on the sharp sword in his hand.<br/><br/>A terrifying energy formed on the sharp sword. In the next moment, it slashed towards Liao Feiyu!<br/><br/>stop!<br/><br/>In the seat of Honor, Liao Feiyu’s father’s expression kept changing as he watched this scene.<br/><br/>He gritted his teeth and let out a low roar as he flew towards the arena. He stared at Tianci with killing intent flashing in his eyes.<br/><br/>With a wave of his arm, a cloud of sand flew towards Tianci.<br/><br/>Liao Fei Yu’s father had participated in the Battle of the Heaven Board.<br/><br/>Even though he didn’t make it into the top 10, he was still in the top 30.<br/><br/>He had the strength of A Level 4 universe master.<br/><br/>His attack was fatal to a disciple at the pinnacle of the Universe Knight Realm.<br/><br/>There was almost no chance of escaping!<br/><br/>Liao Fei Yu’s father’s sudden intervention stunned everyone around.<br/><br/>Tian Chi’s mother, grandfather, and the elders of the Mu Li tribe were all stunned when they saw this sudden change.<br/><br/>Some of the peak level 9 universe masters frowned when they saw Liao Fei Yu’s father’s sudden attack.<br/><br/>Some of them looked at the Black Earth tribe and shook their heads when they saw that they had no plans to stop them.<br/><br/>The Xuan Tu tribe was one of the top two tribes in the six paths universe. The other tribes didn’t dare to interfere in their affairs at all.<br/><br/>The scene in front of them was clearly the Xuan Tu tribe disregarding the rules and wanted to kill Mu Litianci.<br/><br/>Wang Xian shook his head when he saw this scene.<br/><br/>He waved his arm and a water sword instantly appeared in front of the sand to neutralize the attack of the sand!<br/><br/>“Is this the Xuan Tu tribe? If you are not their opponent, you have to use your power to suppress them. TSK TSK, this is the attack of a ruler of the universe. They want to kill you directly.<br/><br/>Wang Xian looked at the scene with a mocking expression.<br/><br/>He was not surprised by the scene before him.<br/><br/>Ever since Wang Xian’s rise to power on Earth, he had encountered too many such incidents.<br/><br/>He was from a powerful force that stood high up in the world. He was completely shameless enough to break the rules and directly killed the challengers that they thought were weak.<br/><br/>“Hehe, I, Mu Litianci, have witnessed the so-called big tribes today. Since I can’t defeat them, the old ones came. They even wanted to kill me directly. Is this the style of Your Xuan Tu Tribe?”<br/><br/>“Is this your Xuan Tu Tribe?”<br/><br/>Tianci saw this scene and a trace of cold sweat appeared on his face. Fortunately, his adoptive father had attacked just now.<br/><br/>Otherwise, unless he removed the restriction in his body, he would definitely die!<br/><br/>“Destroying the treasure of our Black Earth tribe, damn it!<br/><br/>“Insulting our Black Earth tribe, damn it!<br/><br/>Liao Feiyu’s father saw that his attack was blocked, and his eyes focused as he shouted with an embarrassed expression!<br/><br/>“The Disciples of Your Xuan Earth tribe fought with me in the arena. In the end, their weapons were destroyed and they actually said that I deserved to die. Is Your Xuan Earth tribe so Shameless? ‘Q “A dignified top-tier tribe actually said such shameless words. It’s truly shameless to the extreme!<br/><br/>Tianci could not help but shout when he saw the killing intent on Liao Feiyu’s father’s face!<br/><br/>“This Black Earth tribe is so shameless. I Can’t beat them in the arena battle, but the old one came up and wanted to kill Mu Li Tianci. Isn’t this too shameless?”<br/><br/>Liao Feiyu’s father’s attack also shocked the surrounding disciples.<br/><br/>A young man couldn’t help but say.<br/><br/>“Shut Up!<br/><br/>However, a middle-aged man next to him immediately scolded him.<br/><br/>The strong preyed on the weak.<br/><br/>The Black Earth tribe was not something that they could discuss.<br/><br/>All the rules were set by the strong.<br/><br/>The history books were also written by the strong.<br/><br/>The weak were ultimately the losers.<br/><br/>As long as the strong were shameless, the weak could not do anything about it.<br/><br/>Just like now.<br/><br/>“Shut up, my black Earth tribe is not someone that you can teach. Say One more word, and I’ll kill you!<br/><br/>When Liao Feiyu’s father heard Tianci’s words, his aura exploded as he spoke with a face full of killing intent!<br/><br/>When Tianci saw how domineering he was, his breathing quickened slightly.<br/><br/>The other party was completely unreasonable.<br/><br/>He was completely trying to use his power to oppress him!<br/><br/>“Lord of the Xuan Tu tribe, our Tianci is still young and insensible. I apologize on his behalf to you and to the Xuan Tu tribe. I’m sorry, I’m Sorry!<br/><br/>Tianci’s grandfather’s expression changed drastically at the back.<br/><br/>He quickly flew towards the arena and grabbed tianci’s arm, continuously apologizing to Liao Feiyu’s father!\t\t\t\t\t\t</div>", "images": {}, "success": true}