{"id": 1160, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074366.html", "title": "Chapter 4163 - Chapter 4163: Under The Power Of The 4162 Water Forbidden Spell Book", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4163 - Chapter 4163: Under The Power Of The 4162 Water Forbidden Spell Book</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4163: Under the power of the 4162 water forbidden spell book<br/><br/>Translator: 549690339<br/><br/>The energy in TIANCI’s body surged into the book of Water Forbidden Spell.<br/><br/>The book of water forbidden spell trembled again and released a ripple!<br/><br/>This ripple charged towards the giant earth hammer that was condensed in the sky!<br/><br/>It was still a very simple ripple, and it was still an attack that did not carry the slightest bit of powerful power.<br/><br/>When the wave rushed towards the Earth Hammer, the Earth Hammer seemed to turn into an illusion as it emitted waves!<br/><br/>Then, the Earth Hammer formed by the Earth attribute energy directly dissipated!<br/><br/>Tianci raised his head to look at this scene, and the corner of his mouth slightly curled up!<br/><br/>He stared at Liao Feiyu in front of him and walked towards him.<br/><br/>A river appeared under his feet. Tianci walked forward with a hint of elegance, and it was already a kind of contempt!<br/><br/>Calm and collected!<br/><br/>“No, no, no, how is this possible? This is a powerful bloodline weapon of our Liao clan. How can you withstand it? How is this possible?”<br/><br/>At this moment, Liao Feiyu saw that his attack had been instantly eliminated. He was completely flustered!<br/><br/>He shook his head and roared loudly. He raised the Earth Hammer in his hand and smashed it towards Tianci again!<br/><br/>“How… How is this possible? What kind of treasure is that? It can actually withstand the attack of our Liao clan’s bloodline weapon?”<br/><br/>In the seat of Honor, Liao Feiyu’s grandfather and some of the top experts of the Black Earth tribe couldn’t help but stand up and stare at the arena!<br/><br/>Bloodline weapons were the best weapons of the Black Earth tribe.<br/><br/>The Black Earth tribe had four clans, and each clan only had three or four bloodline weapons!<br/><br/>However, each bloodline weapon was extremely powerful!<br/><br/>It was forged with a large amount of treasures and resources from the entire Black Earth tribe!<br/><br/>And such a powerful weapon and treasure couldn’t do anything to that young man?<br/><br/>What kind of treasure was that young man carrying?<br/><br/>What grade was it?<br/><br/>“Hiss, that Mu Litianci actually has a treasure in his hands as well. Furthermore, the treasure in his hands is abnormally powerful, completely suppressing the treasure in Liao Feiyu’s hands!<br/><br/>In the surrounding area, when all the powerful disciples of the tribe saw this scene, their faces were filled with shock.<br/><br/>Many powerful experts had some understanding of the treasure in Liao Feiyu’s hands!<br/><br/>However, as a top-tier treasure of the Black Earth tribe, it was actually suppressed by the treasure in the hands of a youth?<br/><br/>This? ?<br/><br/>How was this possible?<br/><br/>(‘This<br/><br/>At the Nine River Tribe, Gong Cheng was looking at his grandfather and the others. The experts of the Nine River Tribe looked at the book of forbidden water curses floating above their heads. Their eyes were wide open and their breathing was slightly hurried.<br/><br/>They could feel an extremely powerful water energy from it.<br/><br/>This water energy was extremely pure!<br/><br/>“I’m going to kill you! I’m going to kill you!<br/><br/>Liao Feiyu widened his eyes and gritted his teeth. His face was filled with madness!<br/><br/>He watched as Mu Litianci walked towards him. His eyes were filled with fury. He was actually forced to such an extent by a guy who was a generation younger than him.<br/><br/>He was actually not his match?<br/><br/>His eyes were blood red as he raised the Earth Hammer in his hand!<br/><br/>In the next instant, his body was enveloped by the Earth attribute energy released by the Earth Hammer!<br/><br/>The earth hammer in his hand also rapidly grew bigger!<br/><br/>This time, he directly turned into a thousand meters tall giant!<br/><br/>His huge body, with the support of the Earth Hammer, caused his strength to instantly explode to its peak.<br/><br/>Especially the earth hammer in his hand, the faint roar of a giant beast could be heard!<br/><br/>The earth hammer shook and smashed toward Tian Chi!<br/><br/>This hammer was earth-shattering!<br/><br/>“It has already reached the destructive power of a level one universe ruler!<br/><br/>In the surrounding area, all the Great Beings at the universe ruler realm looked at this scene and said with focused gazes!<br/><br/>In the Mu Li tribe, everyone’s faces were filled with nervousness!<br/><br/>A huge earth hammer descended from the sky!<br/><br/>Tianci, who was in the arena, looked extremely tiny!<br/><br/>He looked like an ant that could be easily crushed to death!<br/><br/>Tianci felt Liao Feiyu’s power in front of him, and his face was filled with a solemn expression!<br/><br/>He slowly extended his right hand and placed it on the book of Forbidden Water Curses.<br/><br/>Waves of water energy surged into it!<br/><br/>When the water energy surged onto the book of Forbidden Water Curses, it only caused a slight ripple!<br/><br/>The entire book of forbidden water curses was still extremely calm!<br/><br/>The book of Forbidden Water Curses was too strong after all. It was a<br/><br/>two-thirds fragment of the Heavenly Yuan creation.<br/><br/>A treasure of this level was something that Tianci could not control.<br/><br/>In fact, tianci could not even open the first page of the book of Forbidden Water Curses.<br/><br/>But he didn’t need to open it. Even with the help of the book’s power, it was still extremely terrifying!<br/><br/>A treasure like the book of Forbidden Water Curses, even if a heavenly yuan creation realm warrior touched it, he would fight for it with all his might.<br/><br/>If this treasure was in the hands of a pinnacle universe ruler realm warrior, it wouldn’t be a good thing!<br/><br/>Because it would be coveted by the Heavenly Yuan creation realm!<br/><br/>The energy from Tian Chi’s body poured into the book of Forbidden Water Curse. This time, the book of forbidden water curse only emitted a weak light!<br/><br/>At this time, the humongous Earth Hammer had already arrived!<br/><br/>The attack of the Earth Hammer was like an endless mountain range crashing down. It was abnormally terrifying!<br/><br/>Hong<br/><br/>All the great disciples in the surroundings stared at this scene.<br/><br/>Tianci raised his head and stared.<br/><br/>In the next moment, the Earth Hammer landed on the book of water forbidden spells.<br/><br/>“The true treasure of our Liao clan is invincible. Die!<br/><br/>Liao Fei Yu roared, and his entire body was filled with energy!<br/><br/>An explosion sounded!<br/><br/>On the book of Water Forbidden Spells, there was a glimmer of light!<br/><br/>“It’s a little too high profile. I’m afraid the journey to the six universes is coming to an end!<br/><br/>Wang Xian shook his head when he saw this scene!<br/><br/>Using a powerful weapon to directly clash with the book of Forbidden Water Curses was something that Wang Xian did not expect.<br/><br/>He was already at the peak of the Universe Knight realm in terms of combat strength. Why did he still need to engage in close combat?<br/><br/>Couldn’t he just attack from afar?<br/><br/>Why did he have to use his weapon to fight against the book of Forbidden Water Curses?<br/><br/>Wang Xian was a little speechless!<br/><br/>He looked over and everyone looked over as well.<br/><br/>In his line of sight, the gigantic earth hammer collided with a Deep Blue Book.<br/><br/>The size of the two books were not on the same level.<br/><br/>However, after the collision, the book of Forbidden Water Curses was attacked. The entire cover of the book trembled slightly as if it was about to be torn open.<br/><br/>However, the power that the book of Forbidden Water Curses received was still not enough to make it open the first page!<br/><br/>The book of forbidden water curses trembled and formed a ripple that charged towards the earth hammer!<br/><br/>In the next moment, around the arena, under the gazes of the trillions of universe warriors and disciples, the incomparably huge Earth Hammer slowly started to crumble and dissipate!<br/><br/>This time, what crumbled and dissipated was not just the energy condensed from the Earth attribute.<br/><br/>It was the bloodline weapon, the Earth Hammer’s main body!<br/><br/>How could a powerful weapon forged after birth be able to clash head-on with a heavenly creation true treasure?<br/><br/>Even if it was just a fragment of a heavenly creation true treasure!\t\t\t\t\t\t</div>", "images": {}, "success": true}