{"id": 1166, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074390.html", "title": "Chapter 4169 - Chapter 4169: 41689 Origin Universe, Dragon Palace Dragon King! Go", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4169 - Chapter 4169: 41689 Origin Universe, Dragon Palace Dragon King! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4169: 41689 origin universe, Dragon Palace Dragon King! Go<br/><br/>Translator: 549690339<br/><br/>Just when everyone thought that the Black Earth tribe and the dead tribe had started to fight.<br/><br/>An aura that caused everyone to feel despair suddenly attacked!<br/><br/>This terrifying aura covered the sky and the Sun.<br/><br/>It far surpassed the power of the Black Earth tribe and the dead tribe warriors on the stage.<br/><br/>“Get Down, get down!”<br/><br/>Around the stage, all the warriors of the tribes sensed this terrifying power and shouted in fear!<br/><br/>This terrifying power could crush a universe knight to death!<br/><br/>It was fortunate that the warriors of the various tribes were able to defend themselves, allowing the disciples below the universe ruler realm to survive.<br/><br/>Even so, those universe ruler realm warriors were breathing heavily, and their foreheads were covered in cold sweat.<br/><br/>What kind of enemy was this?<br/><br/>“It’s the Heavenly Yuan creation realm experts from other universes!”<br/><br/>“Fight them! ”<br/><br/>The expressions of the peak universe masters from the Black Earth tribe and the death tribe changed drastically when they saw the seven figures flying over, and they hurriedly shouted!<br/><br/>At this moment, they gave up on both sides and faced the outside together!<br/><br/>Facing the outside enemy, they didn’t hesitate at all.<br/><br/>“Earth core, open! ”<br/><br/>A peak universe overlord from the mysterious Earth tribe didn’t hesitate at all. He took out a treasure and placed it on the ground, punching it.<br/><br/>In the next moment, an incomparably huge defense rose up on the stage, forming an incomparably strong defense!<br/><br/>“Break the defense! ”<br/><br/>The figures that flew over were naturally the seven heavenly fate realm experts.<br/><br/>Seeing the defense that rose up instantly, their eyes focused as weapons appeared in their hands one by one.<br/><br/>“Boom!”<br/><br/>“Boom Boom Boom! ”<br/><br/>Following that, all sorts of attacks landed on the Earth’s core defense!<br/><br/>“Crack Crack Crack! ”<br/><br/>When the attacks landed on the surface, the Earth’s core defense did not collapse immediately.<br/><br/>However, even so, huge cracks appeared on the circular defense that covered the entire arena!<br/><br/>The entire defense could only sustain two more attacks!<br/><br/>“All seven of them are heavenly yuan creation realm experts from other universes. All peak-stage universe masters, block them! ”<br/><br/>The expression of the peak universe masters of the Black Earth tribe changed drastically when they saw this scene. Immediately, they roared out loud!<br/><br/>This Earth core defense was set up by the Heavenly Yuan creation realm experts of their black Earth tribe!<br/><br/>Now, a huge crack had appeared on the other party’s Attack!<br/><br/>This scene caused them to be shocked!<br/><br/>“Block! All Peak Universe Masters, block them! ”<br/><br/>The peak ruler-level powerhouses of the Dead Tribe also roared!<br/><br/>There were more than 100 million disciples of the tribes around the arena. Among them, there were more than 10 peak ruler-level powerhouses other than the two tribes!<br/><br/>These were the peak powerhouses of the other tribes.<br/><br/>They didn’t refuse the orders of the Black Earth tribe and the dead tribe!<br/><br/>The current order of the Heavenly Yuan creation realm experts was to fight against the invaders from the other universes in unison!<br/><br/>“Boom! Boom! Boom!”<br/><br/>The top-tier experts instantly floated in the sky with weapons in their hands as they stared at the seven heavenly yuan creation realm experts outside.<br/><br/>Everything happened in an instant.<br/><br/>Tianci’s identity was exposed.<br/><br/>The Great Beings of the Black Earth tribe and the dead tribe attacked, and seven powerful intruders arrived.<br/><br/>Everything happened in an instant.<br/><br/>Tian Ci’s pupils shrank slightly when he saw this scene.<br/><br/>Only at this moment did he realize how fatal an attraction he had to the other great beings.<br/><br/>Even the great beings of the six paths universe wanted to attack him!<br/><br/>This made him look a bit embarrassed!<br/><br/>“Black Earth tribe, death tribe, I have merged with the heavenly creation true treasure. Do you still want to kill me and take the heavenly creation true treasure?”<br/><br/>Tianci looked at the top-tier Great Beings of the Black Earth tribe and death tribe and asked with an ugly expression.<br/><br/>He felt bad that the Great Beings of the same universe wanted to kill him and take the heavenly creation true treasure!<br/><br/>Was the six paths universe still his universe?<br/><br/>“Your life belongs to the six paths universe. The three lords will make the decision. Stand there and don’t move. Otherwise, I will kill you immediately. ”<br/><br/>A peak ruler of the Black Earth tribe glanced at Tianci and said with a dark face!<br/><br/>After saying that, he looked at the seven heavenly creation great beings in front of him and quickly passed the news to their black Earth tribe’s Lord Tianyuan creation!<br/><br/>When Tianci heard the words of the powerhouse from the Xuan Tu tribe, he looked extremely embarrassed.<br/><br/>This was the answer given to him by the powerhouses from the six paths universe.<br/><br/>As long as he dared to act rashly, he would be killed immediately!<br/><br/>His face was filled with bitterness.<br/><br/>At this moment, all the powerhouses’disciples from the surrounding tribes reacted slightly. When they saw this sudden scene, they were slightly shocked!<br/><br/>“You want to kill Tianci?”<br/><br/>Wang Xian, who had been standing in front of the arena, was not surprised at all when he saw this scene.<br/><br/>However, when he heard the words of the Xuan Tu tribe’s expert at the peak of the Universe Dominator realm, he raised his eyebrows slightly!<br/><br/>He opened his mouth and spoke calmly. His figure disappeared at the same time and appeared beside the expert at the peak of the Universe Dominator realm.<br/><br/>Before the expert who was at the peak of the universe dominator could react, he saw a figure suddenly appear beside him. He was stunned!<br/><br/>“You don’t know whether you are dead or Alive! ”<br/><br/>Wang Xian’s eyes were filled with coldness and killing intent as he stared at him.<br/><br/>In the next moment, he waved his arm and his palm turned into a dragon claw. He held it in his hand.<br/><br/>His life force was gone in an instant!<br/><br/>Instant Kill!<br/><br/>Then, as if nothing had happened, he quietly landed on the stage!<br/><br/>The sudden change, the sudden change, once again caused everyone to be stupefied!<br/><br/>Especially the experts surrounding the peak ruler of the Black Earth tribe, the dead tribe and the other peak ruler experts!<br/><br/>Before they could react, an expert of the same level was actually killed just like that!<br/><br/>This caused them to be filled with shock!<br/><br/>What kind of existence was this.<br/><br/>“You are also an expert of the heaven origin creation realm from the other universes!”<br/><br/>An expert at the peak of the Dominator realm from the tribe of the dead shouted loudly with a face full of shock!<br/><br/>Nearly twenty experts at the peak of the Dominator realm hurriedly got close to each other and stared at Wang Xian. Their faces were filled with shock!<br/><br/>“Let me introduce myself. I am the Dragon King of the Dragon Palace from the nine-origin universe. ”<br/><br/>Wang Xian looked at them and said calmly!<br/><br/>“The Dragon King of the Dragon Palace from the nine-origin Universe?”<br/><br/>At this moment, at the Mu Li tribe, Mu Liyin er, her father, brother, and all the strong disciples of the Mu Li tribe seemed to have a sudden flash of lightning in their minds!<br/><br/>“He… he…”<br/><br/>Mu Li Yin ‘er was tongue-tied and couldn’t believe it!<br/><br/>The young man he saved was actually an expert from another universe.<br/><br/>A heavenly yuan destiny realm expert!\t\t\t\t\t\t</div>", "images": {}, "success": true}