{"id": 1164, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074382.html", "title": "Chapter 4167 - Chapter 4167: The 4166 Heavenly Yuan Destiny Realm Experts Gathered", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4167 - Chapter 4167: The 4166 Heavenly Yuan Destiny Realm Experts Gathered</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4167: The 4166 Heavenly Yuan destiny realm experts gathered<br/><br/>Translator: 549690339<br/><br/>The Heavenly Yuan Destiny Realm Supreme Treasure was unleashed!<br/><br/>Four striking divine trees landed on the butcher’s blade, causing it to completely collapse!<br/><br/>And below, the countless branches were still attacking Liao Zhiyang!<br/><br/>Liao Mingdao originally thought that after he killed mu litianci, his attack would lose its energy.<br/><br/>However, he didn’t expect that his attack would be blocked!<br/><br/>He widened his eyes and felt numb!<br/><br/>Yes, today’s shock had made him feel numb!<br/><br/>“Save me!”<br/><br/>When the terrified cries for help continued to ring out, he finally reacted. He lowered his head and quickly flew towards Liao Zhiyang to save him!<br/><br/>“PA, PA, PA!”<br/><br/>However, at this moment, he heard a sound that sounded like the whipping of a willow branch. Following that, four extremely terrifying branches appeared around him.<br/><br/>These four branches seemed to want to annihilate him!<br/><br/>This made his scalp go numb, and he hurriedly tried to defend himself!<br/><br/>At this moment, a miserable cry was heard from below.<br/><br/>The countless branches pierced through Liao Zhiyang’s body, tearing apart every drop of his flesh and blood!<br/><br/>Liao Zhiyang was dead!<br/><br/>Liao Mingdao’s expression changed drastically!<br/><br/>“Father! ”<br/><br/>At the back, Liao Feiyu was completely stunned when he saw this!<br/><br/>His father was actually killed!<br/><br/>He was killed by Mu Litianci.<br/><br/>Hiss<br/><br/>At this moment, the surrounding people gasped.<br/><br/>What did they see?<br/><br/>Damn!<br/><br/>Even those universe masters at the pinnacle level of universe masters couldn’t help rubbing their eyes.<br/><br/>Was this a dream?<br/><br/>That Youth?<br/><br/>Or a normal human?<br/><br/>Or a human from their six paths universe?<br/><br/>How could he be so powerful?<br/><br/>Impossible!<br/><br/>“Eh? This… This Is? This is the aura of a heavenly fate treasure. This is definitely the aura of a heavenly fate treasure!”<br/><br/>At the same time, in a room outside Earth City!<br/><br/>Seven figures were gathered inside. It was slightly crowded, and their auras were concealed to the extreme!<br/><br/>The seven of them were the seven heavenly fate powerhouses from Bai Kefu saint.<br/><br/>During this period of time, they moved forward carefully and finally entered Earth city.<br/><br/>In order to prevent being discovered, they had no choice but to hide in this small room.<br/><br/>When they were discussing how to go deeper in, they suddenly felt the fluctuations of the heavenly fate treasure.<br/><br/>This made the seven of them instantly widen their eyes!<br/><br/>“It’s the aura of the heavenly fate treasure. It’s the aura of that heavenly fate treasure. ”<br/><br/>Bai Kefu Sheng’s eyes emitted a hot luster as he excitedly shouted!<br/><br/>However, his expression quickly changed.<br/><br/>“No, the aura of the Heavenly Yuan Creation Treasure has already been leaked. The Heavenly Yuan creation treasure is about to be exposed. We must act immediately. We must act immediately! ”<br/><br/>Bai Kefu Sheng anxiously said!<br/><br/>“Let’s go. Let’s charge over! ”<br/><br/>“We have to go over directly. Don’t worry about being exposed, we have to go over directly! ”<br/><br/>The other six great beings of heavenly creation also said crazily.<br/><br/>Hong<br/><br/>In the next moment, their bodies moved, and they flew directly in the direction of the aura of the heavenly creation true treasure.<br/><br/>Their speed was very fast!<br/><br/>The sudden exposure of the aura of the heavenly creation true treasure gave them a bad premonition.<br/><br/>Because the six paths of the universe of the heavenly elements are also looking for the heavenly elements of the ultimate treasure.<br/><br/>The exposure of this aura is likely to attract the heavenly karma of the six universes.<br/><br/>Once they’re there, it’ll be hard for them to compete!<br/><br/>Come on, we got ta hurry!<br/><br/>Seven figures, almost all of them.<br/><br/>According to their calculations, they can be there in less than a minute!<br/><br/>“HMM? What is this aura?”<br/><br/>At this moment, in the void around Earth City!<br/><br/>The news that Tu Yuan had a heavenly yuan creation treasure had been spread out!<br/><br/>A large number of heavenly yuan creation realm powerhouses had entered tu yuan.<br/><br/>The three Heavenly Yuan creation realm powerhouses from the six paths universe naturally knew about this news.<br/><br/>In addition to the six paths convention held by their six paths universe, the three Heavenly Yuan creation realm powerhouses had been here all along!<br/><br/>The metal-elemental cheetah-like heaven origin creation realm great being was not far from Earth City. Suddenly, he sensed an extremely powerful and pure power.<br/><br/>This power was the power of the heaven origin creation true treasure.<br/><br/>And with this pure power, it was definitely not from the fragment of the Heaven origin creation true treasure!<br/><br/>“Could it be that the heaven origin creation true treasure is really in earth origin or Earth City?”<br/><br/>The cheetah-like heavenly creation true treasure’s eyes shone brightly.<br/><br/>In an instant, his speed reached a terrifying level as he flew towards Earth City!<br/><br/>The heavenly creation true treasure appeared!<br/><br/>The heavenly creation true treasure sensed it.<br/><br/>Earth City’s Arena!<br/><br/>All the tribal disciples watched as Tian Chi killed the universe ruler Level 5 Liao Zhi Yang.<br/><br/>They watched him fight against a level 8 universe overlord, Liao Ming Dao!<br/><br/>In the seat of Honor, Liao Fei Yu’s grandfather saw his son being killed, and his eyes instantly revealed a berserk killing intent!<br/><br/>He stared fixedly at Tian Ci, preparing to directly suppress him.<br/><br/>He didn’t believe that such a young youth could have such powerful strength.<br/><br/>Hong! Hong<br/><br/>Hong! Hong! Hong<br/><br/>However, at this moment, in the center of the Great Beings of the Black Earth tribe.<br/><br/>In the center of the Great Beings of the dead tribe.<br/><br/>Two universe masters at the pinnacle of the universe ruler realm suddenly gave off powerful auras.<br/><br/>They stared at the godly wood branch in Tian Chi’s hand, their eyes wide open, full of shock and excitement.<br/><br/>“Tian Yuan Destiny Supreme Treasure! ”<br/><br/>“Tian Yuan Destiny Supreme Treasure! ”<br/><br/>A low roar came from their mouths!<br/><br/>Tian Yuan Destiny Supreme Treasure!<br/><br/>At this moment, they recognized the Tian Yuan Destiny Supreme Treasure!<br/><br/>As the core of the Black Earth tribe and the dead tribe, the people who were closest to the Tian Yuan destiny supreme treasure, they knew much more than the other great beings.<br/><br/>Among them, there was information about their six paths universe’s sky origin creation true treasure.<br/><br/>They had a detailed understanding of the sky origin creation true treasure, and they also had a treasure to check it.<br/><br/>Tianci couldn’t sense it before he used the power of the sky origin creation true treasure.<br/><br/>But now, they could!<br/><br/>In the surrounding area, all the great beings of the tribes looked over in shock when they saw the two pinnacle universe masters.<br/><br/>Today, they had been shocked too much!<br/><br/>A heaven-defying youth.<br/><br/>And now, he had spat out a heavenly yuan creation true treasure from the mouths of two pinnacle universe ruler realm great beings.<br/><br/>What was going on?<br/><br/>The Aura of a pinnacle universe ruler realm great being swept across the entire arena, making everyone feel extremely stifled!<br/><br/>All the tribes could feel that the sky was about to change!<br/><br/>It was as if something big was about to happen!\t\t\t\t\t\t</div>", "images": {}, "success": true}