{"id": 1162, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074374.html", "title": "Chapter 4165 - Chapter 4165: 4164 Continued To Fight, And He Was Exposed", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4165 - Chapter 4165: 4164 Continued To Fight, And He Was Exposed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4165: 4164 continued to fight, and he was exposed<br/><br/>Translator: 549690339<br/><br/>“Father, we can’t let him go, we can’t let him go. He destroyed the powerful bloodline true treasure of our Black Earth tribe. Kill him, kill him!<br/><br/>Liao Fei Yu saw his father making a move, and he stared at Tian Chi as he roared with a ferocious expression.<br/><br/>He had been completely defeated, and his bloodline weapon had been destroyed.<br/><br/>This caused him to lose his mind.<br/><br/>“Aren’t you all too shameless? The arena battle is fair and just, what’s the meaning of a universe ruler level warrior interfering now? If you all do this, how can it be fair in the future?”<br/><br/>Below, Gong Cheng Glanced and was furious, he couldn’t help but shout loudly.<br/><br/>His body moved and he wanted to fly towards the arena.<br/><br/>“Aim, come here, don’t talk nonsense!<br/><br/>Gong Cheng aimed at the great grandfather heard, face slightly changed, arm wave, a wave of energy wrapped around her body, pulled her back.<br/><br/>“Great-grandfather, I didn’t say anything. They are so shameless. They don’t follow the rules at all. How can they be convincing in the future? How can they…<br/><br/>Gong Cheng aimed to continue to speak loudly, but the words did not finish, then was completely sealed by a current.<br/><br/>Gong Chengmu opened his mouth and shouted, unable to make a sound.<br/><br/>Her gaze was filled with worry as she looked at Mu Litianci.<br/><br/>“I’m sorry to everyone in the Black Earth tribe, I’ll take this kid away now.<br/><br/>Tianci’s grandfather once again spoke apologetically to Liao Feiyu’s father, pulling him towards the bottom of the stage.<br/><br/>Liao Feiyu’s father’s face was gloomy and cold. He looked at him, but he didn’t make a move.<br/><br/>He wouldn’t make a move unless he received an order from his father or an expert from the tribe.<br/><br/>In this matter, they weren’t in the right.<br/><br/>It was fine if they killed the other party forcefully.<br/><br/>However, this would cause the Black Earth tribe to lose face.<br/><br/>It would negatively affect their reputation.<br/><br/>“There are plenty of opportunities to kill this brat. Find an opportunity to kill him easily.<br/><br/>He thought to himself!<br/><br/>“Tianci!<br/><br/>Tianci’s grandfather forcefully brought him to the bottom of the arena.<br/><br/>Mu Li Yin ‘er and the others immediately flew over and looked at him with concern.<br/><br/>“Tianci, let’s just forget about this matter. I’ll send you back to the tribe later. Tianci’s grandfather spoke to him with an extremely embarrassed expression.<br/><br/>Tianci had destroyed a powerful treasure of the Black Earth tribe.<br/><br/>He was worried that the Xuan Tu tribe would take revenge.<br/><br/>If they really took revenge, the Mu Li tribe would not be able to stop them.<br/><br/>In fact, if they dared to resist, the Mu Li tribe would be implicated.<br/><br/>Now, he could only let Tianci return to the tribe and pray that the Xuan Tu<br/><br/>tribe would not pursue the matter!<br/><br/>Tianci looked at his family members with an unwilling expression.<br/><br/>“Foster father, I’m Not Willing!<br/><br/>Tianci looked at Wang Xian and his face was filled with a strong sense of unwillingness.<br/><br/>“It’s their fault. Why are they still so arrogant? Why can they not follow the rules? Why can they break the rules? Why are they so Shameless?”<br/><br/>He spoke, gritted his teeth and said angrily!<br/><br/>“Because they think they are superior!<br/><br/>Wang Xian looked at him and replied calmly, “What can you do if you are unwilling?”<br/><br/>“However, you can make your own decision. With godfather around, there is nothing to worry about.<br/><br/>Wang Xian looked at him and added another sentence!<br/><br/>“Godfather, I want to become stronger. I want to become stronger as soon as possible!<br/><br/>Tianci looked at Wang Xian and gritted his teeth. He made a serious decision and said, “I want them to pay the price!<br/><br/>“Alright, let’s continue!<br/><br/>Wang Xian looked at Tianci’s decision and said calmly.<br/><br/>Since Tianci had chosen to expose himself, he would do so.<br/><br/>He wouldn’t be able to hide it for long anyway!<br/><br/>It was better to make the choice on his own than to expose himself passively!<br/><br/>Tianci listened to Wang Xian’s words and nodded his head heavily. He looked in the direction of the arena!<br/><br/>In the surrounding area, Mu Liyin ‘er, Tianci’s grandfather, and the rest were looking at the conversation between Tianci and Wang Xian with puzzled expressions.<br/><br/>What did this mean?<br/><br/>What did their conversation mean?<br/><br/>“Mom, grandfather, today, I want to show you guys my true strength!<br/><br/>Tianci smiled and raised his head slightly as he spoke.<br/><br/>He then looked in the direction where Gong Cheng was aiming.<br/><br/>Gong Cheng was also staring at her.<br/><br/>“Aim, today, I will let you see the Real Mu Li Tianci! Tianci shouted at her and turned his gaze to the arena.<br/><br/>peng!<br/><br/>In the next moment, the water attribute on his body started to spread outwards.<br/><br/>At the same time, a wood attribute energy started to explode!<br/><br/>“Liao Feiyu, and Liao Feiyu’s father. You all think yourselves superior, but I, Tianci, was born extraordinary. I’ve beaten the young, and now the old. Fine, I’ll kill you all today!<br/><br/>“I want to see how Shameless Your Black Earth tribe is. I want to see if you can continue to send the old guys up!<br/><br/>As Tianci spoke, his body moved, and he returned to the arena in an instant!<br/><br/>His speed was extremely terrifying. He returned to the arena in an instant! This speed was definitely not something that a universe knight could possess!<br/><br/>“Tianci!<br/><br/>Mu Liyin ‘er and Tianci’s grandfather were a little dumbfounded.<br/><br/>What was going on?<br/><br/>What was going on?<br/><br/>Tianci actually provoked the Xuan Tu tribe directly. This…<br/><br/>“Don’t worry. Just watch. Today is the day that Tianci will become famous in the universe. Hehe!<br/><br/>Wang Xian smiled lightly and said to them!<br/><br/>“Young master Wang Xian, what the hell…<br/><br/>Mu Liyin’er looked at Wang Xian and then at her son who was in the arena. Her face was filled with astonishment.<br/><br/>However, she also knew that Wang Xian would not harm her son.<br/><br/>“Then Mu Litianci is in the arena again. He actually wants to challenge Liao Zhiyang? No Way, is he crazy?”<br/><br/>“This? ? Directly challenging the Black Earth tribe, directly challenging Liao<br/><br/>Fei Yu’s father, challenging a universe overlord Level 5 warrior, is he courting<br/><br/>“Don’t Know? This Mu Li Tian Chi is a little reckless, what level is Liao Fei Yu’s father? How can he challenge him?”<br/><br/>“Young and vigorous, young and vigorous, what’s the use of being born extraordinary? This Mu Li Tian Chi’s cultivation talent is indeed very monstrous, but how can he be a match for a universe overlord Level 5 Warrior!<br/><br/>In the surrounding area, all the strong disciples of the tribes thought that this matter had ended just like that!<br/><br/>They thought that the Black Earth tribe would cherish their feathers and would not continue to break the rules.<br/><br/>However, they did not expect that Mu Li Tianci would actually take the initiative to go up to the arena again, wanting to beat up the older ones. To go up against a universe ruler Level 5 warrior, this was simply courting death!<br/><br/>In the arena, Liao Fei Yu’s father Liao Zhi Yang was also slightly stunned.<br/><br/>He let that kid go, but this kid actually charged over, wanting to fight with him?<br/><br/>Challenge Him?<br/><br/>Continue to provoke their black earth tribe?\t\t\t\t\t\t</div>", "images": {}, "success": true}