{"id": 1175, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074426.html", "title": "Chapter 4178 - Chapter 4178: 4177 Made His Move", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4178 - Chapter 4178: 4177 Made His Move</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4178: 4177 made his move<br/><br/>Translator: 549690339<br/><br/>“Lord Dragon King of the Dragon Palace, our Lord of the dead souls has said that we will become friends with you in the future. As for the incident of someone bullying a future heaven origin creator, we will naturally have to pay a heavy price.<br/><br/>“The Liao clan of the Black Earth tribe has been exterminated. Lord Dragon King of the Dragon Palace and Lord Mu Litianci, are you satisfied?”<br/><br/>Faced with Wang Xian’s words, the undead passed the news directly to the three strongest masters of the undead tribe and instructed them to pass it on to Wang Xian.<br/><br/>This was the undead’s explanation to Wang Xian and the rest!<br/><br/>This was also the best solution for the six paths universe!<br/><br/>As for Liao Fei and the Liao clan of the Xuan Tu tribe, they were simply courting death!<br/><br/>Relying on their own status and strength, they wanted to bully others.<br/><br/>Under normal circumstances, they did have the capital!<br/><br/>But this time, they had kicked an iron plate.<br/><br/>At this moment, after the three peak ruler realm experts of the dead tribe finished speaking.<br/><br/>From the side, cries of surprise could be heard from the Black Earth tribe.<br/><br/>Liao Feiyu, Liao Feiyu’s grandfather, the Liao clan’s peak ruler realm expert, after hearing this, their bodies trembled violently.<br/><br/>“Lord Undead Lord… We Are Disciples of the Black Earth tribe, we don’t belong to the Lord Undead Lord… we…<br/><br/>Liao Feiyu’s grandfather’s eyes widened as he said with a terrified expression!<br/><br/>“You dare to attack the future Heavenly Yuan creation realm expert, no one can save you!<br/><br/>The peak-stage sovereign realm expert of the undead tribe said with a cold expression!<br/><br/>“No, no, no, why do you want to kill us? You Can’t Kill Us. Elders, elders, you can’t Kill Us!<br/><br/>Liao Feiyu looked at the elders and shouted in fear!<br/><br/>“This matter clearly has nothing to do with us. It’s Liao Feiyu’s family’s actions. Why should the entire Liao family be responsible?”<br/><br/>Some experts from the Liao family of the Black Earth tribe said with fear and unwillingness!<br/><br/>“This is the words of our Lord Undead Lord. Lord tu shouldn’t refuse. Moreover, even if Lord Mu Litianci wants to destroy your black Earth tribe, I don’t think Lord Tu will refuse!<br/><br/>The three peak-stage sovereign realm experts of the dead tribe looked over and said coldly.<br/><br/>In the current situation, it was obvious that the Lord Undead had a request from the Dragon King of the Dragon Palace!<br/><br/>As for what he was asking for, it was very obvious.<br/><br/>They were currently fighting against more than 70 heavenly fate realm powerhouses, so it was obvious that they couldn’t hold on.<br/><br/>And if they couldn’t hold on, all the powerful disciples of the six paths universe’s tribes would die here.<br/><br/>There might even be something even more terrifying.<br/><br/>So what if the Liao clan sacrificed the Black Earth tribe?<br/><br/>Moreover, Mu Litianci now had a heavenly fate level foster father and a powerful background.<br/><br/>He would definitely be able to become a heavenly fate level powerhouse in the future.<br/><br/>If the Liao clan offended him now, when he broke through to become a heavenly fate level powerhouse in the future, would the Black Earth tribe have an easy time?<br/><br/>In addition, he had a heavenly fate supreme treasure on him. In the future, even the lord of Sand City wouldn’t be his match.<br/><br/>If he did not destroy you now, who would he destroy?<br/><br/>If he did not destroy the entire Black Earth tribe, it would be considered good!<br/><br/>When all the powerful disciples of the Black Earth tribe heard this, their expressions changed!<br/><br/>Especially the powerful disciples of the Liao family, their faces were filled with despair and death!<br/><br/>They never thought that Liao Feiyu would actually bring them a disaster!<br/><br/>“All the Xuan Earth tribe’s Liao clan disciples, kill yourselves!<br/><br/>Over at the Xuan Earth tribe, an expert at the peak of the ruler realm had a drastic change in expression as he said, “Just now, our Lord Tianyuan creation also gave this order!<br/><br/>The words of this expert from the Xuan Earth tribe once again caused the bodies of all the Liao clan disciples to tremble violently!<br/><br/>“Godfather, forget it. Among the Liao clan of the Xuan Tu tribe, only Liao Feiyu and the rest have a grudge against me. The rest have not provoked me either.” Mu Litianci’s eyebrows twitched violently when he saw this scene.<br/><br/>This was the first time he had encountered such an act of wiping out an entire clan so easily.<br/><br/>This caught him off guard and made him feel a little uncomfortable!<br/><br/>“A strong person should not be merciful to his enemies. A wildfire can not be extinguished and a spring breeze will come again. However, you can make your own decision on this matter. Godfather respects your choice.<br/><br/>When Wang Xian heard Tianci’s words, he looked at him and spoke!<br/><br/>“Foster father, I might still need to get used to it. Other than Liao Feiyu and the rest, let’s forget about the rest!<br/><br/>Tianci nodded his head. After pondering for a moment, he continued to speak to Wang Xian!<br/><br/>“Alright!<br/><br/>Wang Xian nodded his head.<br/><br/>“Thank you, Lord Mu Li Tianci. Why aren’t you all thanking Lord Mu Li Tianci?”<br/><br/>When the peak-stage ruler of the Black Earth tribe heard Tianci’s words, he heaved a heavy sigh of relief. He quickly thanked Tianci and berated the Liao clan’s disciples!<br/><br/>“Thank Lord Mu Li Tianci for not killing us!<br/><br/>The Liao clan’s disciples quickly lowered their heads and thanked him loudly!<br/><br/>Tianci was a little absent-minded when he saw this scene.<br/><br/>The experts from the Liao clan who wanted to kill him and bullied him just now actually wanted to thank him for not killing him!<br/><br/>All the experts from the surrounding tribes were also a little shocked and absent-minded when they saw this scene.<br/><br/>Who would have thought that the battle between Mu Li Tianci and the Black Earth tribe’s Liao clan would cause so many huge changes.<br/><br/>It would be such an outcome!<br/><br/>They looked at the young boy with a twinkle in their eyes.<br/><br/>Today’s matter could be passed peacefully, and this young boy looked down on them.<br/><br/>And they would also worship him!<br/><br/>“Dragon King of the Dragon Palace, our Lord of the undead has sent news that a group of heavenly fate realm experts are using their trump cards. They won’t be able to stop so many experts! ”<br/><br/>At this moment, the three peak-stage rulers of the dead tribe at the side hurriedly spoke up!<br/><br/>“Resist as many as they can!” Wang Xian spoke to them!<br/><br/>“Yes, my Lord!”<br/><br/>The three peak-stage rulers immediately responded!<br/><br/>“Break through. After obtaining the heaven origin creation treasure, we will kill that guy from the nine-origin universe! ”<br/><br/>Just as Wang Xian finished his sentence, two figures flew over from the sky at a rapid speed!<br/><br/>In the Void Universe, the Heaven’s Gate Duke and the other Heaven’s origin creation realm powerhouse broke through the defense of the golden leopard from the sand city and teleported over instantly!<br/><br/>Boom! Boom<br/><br/>When they rushed over, there were two figures flying over in a strange way from the left!<br/><br/>Apart from that, Wang Xian also sensed a cloud of sand coming from underground!<br/><br/>The Heaven’s origin powerhouses with special abilities could no longer hold it in.<br/><br/>They used special methods to attack tianci!<br/><br/>“Lin Niu, do it!”<br/><br/>Wang Xian sensed this scene and narrowed his eyes slightly!\t\t\t\t\t\t</div>", "images": {}, "success": true}