{"id": 1171, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074410.html", "title": "Chapter 4174 - Chapter 4174: 4173 Was In Chaos!", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4174 - Chapter 4174: 4173 Was In Chaos!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4174: 4173 was in chaos!<br/><br/>Translator: 549690339<br/><br/>Facing the attacks of more than ten heavenly Yuan creation realm warriors, the golden leopard quickly dodged.<br/><br/>However, he also knew that the opponent’s main target was the Heavenly Yuan creation treasure.<br/><br/>With a wave of his arm, a golden barrier covered the arena at a terrifying speed!<br/><br/>The golden barrier landed on the arena and quickly began to expand!<br/><br/>It enveloped the entire arena and all the disciples from the six paths of the universe!<br/><br/>“Peng Peng Peng! ”<br/><br/>One by one, the Heavenly Yuan creation realm experts flew towards the bottom of the arena. When they saw the golden shield enveloping the entire arena, their eyes focused!<br/><br/>One by one, they launched their attacks, wanting to break through this defensive shield!<br/><br/>However, this golden shield was, after all, a trump card of the Golden Leopard!<br/><br/>Without the suppression of the power of the universe, its defense was extremely terrifying.<br/><br/>As the attacks landed on it, the golden shield only trembled for a moment.<br/><br/>“You guys really deserve to die!”<br/><br/>The golden leopard stared at it, its eyes filled with a sinister expression.<br/><br/>Its gaze locked onto a figure that was also of the metal attribute. Its entire body drew out a golden light as it attacked the metal attribute heavenly fate realm expert!<br/><br/>“Damn it, this golden leopard has locked onto me!”<br/><br/>When that metal attribute heavenly creation realm expert saw this scene, his expression changed slightly. “Attack this golden leopard, he wants to break us one by one! ”<br/><br/>He roared loudly and quickly dodged to the side!<br/><br/>When the surrounding heavenly creation realm experts saw this scene, they frowned slightly.<br/><br/>They hesitated for a moment and did not help that expert.<br/><br/>They were pressed for time, and the most important thing was to get the heavenly origin creation true treasure.<br/><br/>If time dragged on, and the six paths universe sent another heavenly origin creation realm warrior, then their chances of getting the true treasure would be even slimmer!<br/><br/>Boom! Boom! Boom<br/><br/>The heavenly origin creation realm warriors continued to attack the Golden Light Shield!<br/><br/>The terrifying attacks caused the golden light shield to tremble.<br/><br/>“Attack!”<br/><br/>On the Void Pagoda, Four Heavenly Yuan creation realm experts also attacked the golden light barrier!<br/><br/>“Duke Tian men, I have a way to directly pass through this golden light barrier. ”<br/><br/>A heavenly Yuan creation realm expert from the Void universe frowned when he saw that his attack only caused a slight ripple on the golden light barrier! “No, that guy from the nine-origin universe is inside. His strength is not weak! ”<br/><br/>Duke of Heaven Gate shook his head and glanced at the situation inside the golden light barrier.<br/><br/>He quickly scanned his surroundings.<br/><br/>At the side, Jin Bao wanted to attack one by one. He was chasing after the metal-type heavenly Yuan creator.<br/><br/>That heavenly yuan creator did not hesitate at all. He immediately fled into the distance!<br/><br/>Under such circumstances, Jin Bao did not dare to continue chasing after him. He could only lock onto the second Heavenly Kismet Realm Expert.<br/><br/>“The defense of this golden light barrier is very strong. Attack one point of the golden light barrier together, quickly! ”<br/><br/>Duke of Heaven’s Gate roared loudly. A wave of space energy circled a point on the golden light barrier.<br/><br/>The power of space slicing shot towards the golden light barrier!<br/><br/>Duke Xi Ning and the other two heavenly yuan creation realm experts also attacked that spot!<br/><br/>“Attack!”<br/><br/>“Attack!”<br/><br/>The Heavenly Yuan creation realm experts around also attacked that spot!<br/><br/>This attack almost penetrated the entire world!<br/><br/>All kinds of energy attacked the spot.<br/><br/>Inside the golden light barrier, all the disciples of the six paths universe felt an endless chill when they saw this!<br/><br/>“If this defense is broken through, we might die under the pressure of these great beings! ”<br/><br/>A universe ruler-level great being swallowed a mouthful of saliva and said with a face full of shock!<br/><br/>It was too terrifying!<br/><br/>More than a dozen heaven origin creation realm great beings from other universes, this endless power made them feel terrified!<br/><br/>“Foster Father! ”<br/><br/>“Can this golden light barrier withstand their attacks? If they break through the defense, will they slaughter the people around them?” Tianci stood on the stage and was shocked when he saw this scene.<br/><br/>These experts were all here for him!<br/><br/>At this moment, he was a little worried about the Mu Li tribe. He was also a little worried that his family members and tribesmen would be affected!<br/><br/>“This is just the beginning. Once the golden shield is broken, just this pressure alone will be able to kill a weak master of the universe. ” “As for the Mu Li tribe, I will get Lin Niu to take care of them! ”<br/><br/>Wang Xian said to tianci!<br/><br/>“Wang Xian… Sir, is this… is this just the beginning? How… how many heaven origin creation stage powerhouses are there?”<br/><br/>Mu Li Tianci’s grandfather, who was at the back, trembled when he heard this. He asked in shock.<br/><br/>There were a total of sixteen heaven origin creation stage powerhouses around them.<br/><br/>16 of them!<br/><br/>In their entire universe, there were only three of them!<br/><br/>(‘I don’t know either! ”<br/><br/>Wang Xian shook his head, he swept his gaze across the surroundings. “I know. In our nine-origin universe, other than Lin Niu and I, there are still seven powerhouses in the Heaven’s origin realm who have yet to arrive.<br/><br/>However, they should be arriving soon. ”<br/><br/>As he spoke, he sensed a strong energy coming from the front.<br/><br/>“Another Heaven’s origin creator is here! ”<br/><br/>As Wang Xian spoke, he looked at the location of the Golden Light Shield.<br/><br/>There were cracks there!<br/><br/>“Whoosh! Whoosh! Whoosh! ”<br/><br/>In the sky above the Earth City, more than ten heaven’s origin creator powerhouses flew over this time.<br/><br/>“Golden leopard, kill them all! Kill them all!”<br/><br/>An extremely angry voice came from behind the dozen of figures.<br/><br/>The Yellow Earth that filled the sky was about to slowly devour the entire Earth City!<br/><br/>“There are too many enemies. How long will it take for the undead to rush over? !<br/><br/>Golden Leopard’s eyes shone when he saw the arrival of Earth Sand City. However, when he sensed the dozen or so figures that were chasing after earth sand city, his expression sank again.<br/><br/>When earth sand city was rushing over, he noticed a dozen or so heaven creation realm powerhouses rushing towards Earth City.<br/><br/>This infuriated him and he immediately launched an attack.<br/><br/>However, these ten heaven origin creation realm experts tacitly counterattacked.<br/><br/>As they counterattacked, they flew towards Earth City.<br/><br/>According to their group of heaven origin creation realm experts, a large number of heaven origin creation realm experts were gathered here in earth city.<br/><br/>They already knew that the heaven origin creation treasure had appeared in Earth City.<br/><br/>Next, they would definitely rush over at the fastest speed possible.<br/><br/>As more and more warriors gathered, the chances of obtaining the heavenly creation true treasure would become smaller.<br/><br/>At this time, all the heavenly creation realm warriors were working together in tacit understanding.<br/><br/>“They are already on their way here and are about to arrive. When the undead arrive, kill them all and chase them all away! ”<br/><br/>Earth Sand City roared angrily!<br/><br/>“As long as we can tie down the two guys from six paths universe, we can get the heavenly creation true treasure and attack them. The heavenly creation true treasure depends on our ability and luck! ”<br/><br/>A heavenly creation true treasure chased by Earth Sand City roared loudly!\t\t\t\t\t\t</div>", "images": {}, "success": true}