{"id": 1177, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074434.html", "title": "Chapter 4180 - Chapter 4180: 4179 Five Kills", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4180 - Chapter 4180: 4179 Five Kills</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4180: 4179 five kills<br/><br/>Translator: 549690339<br/><br/>“PFFT PFFT! ”<br/><br/>“PFFT PFFT PFFT! ”<br/><br/>A powerful horn and terrifying claws.<br/><br/>When Wang Xian was attacking the two heaven origin creation stage powerhouses in the Void Universe.<br/><br/>Lin Niu also launched an attack!<br/><br/>The sudden attack completely caught the two heaven origin creation stage powerhouses off guard!<br/><br/>On the other side, the Five Elements Millstone and the Tai Chi Dragon Plate also launched an attack!<br/><br/>Above the Five Elements Millstone, five divine dragons gathered together to form a five-colored divine dragon that attacked a heavenly yuan creation realm expert!<br/><br/>The Tai Chi Dragon Disk turned into a yin-yang divine dragon and attacked as well!<br/><br/>It attacked at the same time.<br/><br/>It was an attack that could kill instantly.<br/><br/>However, when the Tai Chi Dragon Disk’s attack landed on the one-meter-tall<br/><br/>Elder, the Elder’s skin cracked and he blocked the Tai Chi Dragon Disk’s attack.<br/><br/>Following that, the old man’s face was filled with fear as his figure quickly disappeared!<br/><br/>A Ray of light pierced through the sky!<br/><br/>Even so, Wang Xian, Lin Niu, and the Tai Chi Dragon Plate’s attacks were all successful!<br/><br/>The five heaven origin creation realm powerhouses were instantly killed by them!<br/><br/>Screams of pain rang out.<br/><br/>There were a total of seven heaven origin creation realm powerhouses who had used special methods to attack tianci and wanted to obtain the heaven origin creation treasure!<br/><br/>When the last Tianyuan creator heard this terrifying voice, his pupils constricted slightly and his face revealed a look of astonishment.<br/><br/>Without any hesitation, he used his trump card to escape and escaped from this place in an instant!<br/><br/>Wang Xian looked at the Tianyuan creator and did not pursue him!<br/><br/>The Tianyuan creator who was able to come here all had powerful trump cards.<br/><br/>If they wanted to escape, it would be extremely difficult for Wang Xian to chase after them.<br/><br/>Therefore, the seventh powerhouse who was in the Heaven’s origin realm managed to escape!<br/><br/>He looked at the five corpses of the powerhouses in the Heaven’s origin realm with a hint of excitement on his face.<br/><br/>The value of these corpses added together was even higher than a complete corpse in the Heaven’s origin realm! (a complete corpse is a corpse in the<br/><br/>Heaven’s origin realm that can not be resurrected when it is truly dead!)<br/><br/>Especially when two of the corpses were the corpses of a heaven origin creator who was at the control level!<br/><br/>Wang Xian waved his arm and kept them away. The corners of his mouth curled up slightly!<br/><br/>“Huh?”<br/><br/>“This is?”<br/><br/>On the planet that was a fragment of the Starfield, the powerful disciples of the six paths universe widened their eyes when they saw this scene.<br/><br/>The people on the lost planet were not affected by the energy emitted from the lost planet.<br/><br/>They only saw the Seven Heavenly Kismet realm powerhouses that were attacking Mu Litianci suddenly stop in their tracks.<br/><br/>Then, Mu Litianci’s foster father, the Dragon King, and the others began to attack quickly!<br/><br/>Five Heavenly Kismet Realm powerhouses were killed, and two escaped!<br/><br/>This shocked them greatly.<br/><br/>The three lords of the six paths universe had not been able to kill a single Heavenly Kismet Realm Powerhouse during this period of time.<br/><br/>And this Dragon King of the Dragon Palace had already killed six!<br/><br/>“Mu Litianci’s foster father and the others are so strong, they’re simply too strong!<br/><br/>“Yeah, I didn’t expect that Mu Litianci would have such luck. Not only did he have a Tianyuan creator’s treasure, but he also had such a powerful foster father to protect him!<br/><br/>“This is because Mu Liyin’er is kinder. If she hadn’t saved the injured Dragon King of the Dragon Palace, Mu Litianci would have been killed long ago without the protection of a powerhouse.<br/><br/>“It’s mainly because the Dragon King of the Dragon Palace is more loyal. Even a powerhouse of this level has a resurrection treasure, but the Dragon King of the Dragon Palace gave up the powerful Tianyuan Destiny Treasure because of this favor. It’s really admirable!<br/><br/>“The Dragon King of the Dragon Palace and the others are too strong. Mu Litianci shouldn’t be in any danger this time.<br/><br/>On the lost planet, the powerful disciples of the major tribes kept discussing.<br/><br/>They even deliberately praised the dragon king of the Dragon Palace and Mu Liyin ‘Er.<br/><br/>Everyone understood the situation before them.<br/><br/>The Dragon King of the Dragon Palace had once again killed Five Heavenly Yuan creation realm powerhouses. With his terrifying strength, it should not be a problem for him to protect Mu Litianci.<br/><br/>Then, Mu Litianci would be the Heavenly Yuan creation realm lord of their six paths universe in the future!<br/><br/>At this time, they naturally had to curry favor with him!<br/><br/>When the seven Tianyuan creation powerhouses suddenly passed through the defenses of the sand city’s undead and attacked the Tianyuan Creation Supreme Treasure.<br/><br/>The surrounding Tianyuan creation powerhouses were a little impatient as they stared at it closely.<br/><br/>However, when they saw the five Tianyuan creation powerhouses suddenly being killed and the two Tianyuan creation powerhouses fleeing, they were slightly shocked and had an incredulous expression on their faces.<br/><br/>Five Heaven origin creation stage powerhouses had been attacked. This was five of them!<br/><br/>Among them, there were even two heaven origin creation stage powerhouses from the Void Universe.<br/><br/>What was going on?<br/><br/>“D * MN Dragon King of the Dragon Palace, you guys are able to unleash all of your strength. How can you guys not be suppressed by the six paths universe?”<br/><br/>Duke Xining stared at Wang Xian’s position. When he saw that Duke Tianmen and his other companion were actually killed, his expression changed drastically. He shouted in shock and anger!<br/><br/>Even if they were in the six paths universe, it was exceptionally difficult for them to kill them.<br/><br/>Just like how Wang Xian was able to escape after being chased for so long!<br/><br/>However, now that five of them were killed, there was only one possibility. Those who possessed true strength could launch a sneak attack and kill them instantly.<br/><br/>This made it so that none of his trump cards could be used. Otherwise, there was no second possibility!<br/><br/>Duke Xining’s words caused the eyes of all the heaven origin creation realm experts to freeze slightly!<br/><br/>“Dragon King, do you want to protect this heaven origin creation treasure? Protect that youth?”<br/><br/>Among the heaven origin creation realm experts, the elven empress of the nine-origin universe, the Hetian saint, the Emperor of the Phoenix, and Patriarch Black Tortoise were among them.<br/><br/>They did not retreat to the side and did not make a move like the twelve ancestral warlocks did.<br/><br/>They still had some thoughts regarding the heaven origin Destiny Realm Treasure.<br/><br/>Now that they saw that Wang Xian could actually unleash the true strength of a heaven origin destiny realm powerhouse, they frowned slightly and immediately transmitted their voice to Wang Xian!<br/><br/>“Yes, everyone, stop fighting. You Can’t get it!<br/><br/>Wang Xian swept his gaze across them and said confidently!<br/><br/>Following that, his gaze landed on the undead and the rest. The corner of his lips curled up slightly. “We can send another ten heaven origin powerhouses over and let them fight over it!<br/><br/>“Alright!<br/><br/>The Undead’s eyes flickered as he looked at Wang Xian. His eyes were filled with astonishment.<br/><br/>The Dragon King of the Dragon Palace was able to resist the suppression of the six universes even though he did not know what method he used.<br/><br/>But this also meant that the Dragon King and the others could truly fight against them!<br/><br/>They could easily wreak havoc in their six paths of the universe.<br/><br/>Such an existence definitely couldn’t be their enemy.<br/><br/>“Heavenly Yuan creation realm experts, which ten of you want to obtain the Heavenly Yuan creation treasure? I Won’t Stop You!<br/><br/>The undead’s gaze swept across the Heavenly Yuan creation realm experts as he spoke indifferently!\t\t\t\t\t\t</div>", "images": {}, "success": true}