{"id": 1178, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074438.html", "title": "Chapter 4181 - Chapter 4181: 4180 Battle", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4181 - Chapter 4181: 4180 Battle</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4181: 4180 battle<br/><br/>Translator: 549690339<br/><br/>“Heavenly Yuan creator realm powerhouses, which ten of you want to obtain the Heavenly Yuan creation treasure? I can not stop you!<br/><br/>The voice of the undead sounded in the sky above Earth City!<br/><br/>He glanced at the Heavenly Yuan creator realm powerhouses around him and the corners of his mouth curled up slightly. His face was full of mockery.<br/><br/>Around him, more than 60 heavenly Yuan creator realm powerhouses heard this and their faces sank!<br/><br/>There was a 99% chance that the Dragon King of the Dragon Palace wouldn’t be suppressed by the six paths universe.<br/><br/>Although the scene of him attacking just now was blocked by the mirror image, so they couldn’t see the inside.<br/><br/>However, the heaven origin creation realm powerhouse beside him shouldn’t be suppressed by the six paths universe either.<br/><br/>Under such circumstances, ten heaven origin creation realm powerhouses against two heaven origin creation realm powerhouses who weren’t suppressed?<br/><br/>There was no way to fight them!<br/><br/>They were completely no match for them.<br/><br/>Only twenty heaven origin creation realm powerhouses could contend against them.<br/><br/>There was another problem. Now, there were only sixty heaven origin creation realm powerhouses. They were already at a disadvantage.<br/><br/>In the past twenty heaven origin creation realm powerhouses, the remaining forty or so were completely no match for the three heaven origin creation realm powerhouses from the six paths universe.<br/><br/>“Everyone has been searching for 100 million years in the six paths universe. No one is willing to give up at this time. Everyone, use your trump cards and use all your trump cards. Otherwise, it’s impossible to obtain the Heaven Origin Creation Realm Treasure!<br/><br/>“Use your trump cards and give it a try!<br/><br/>Bai Kefu Saint looked at this scene with an unwilling expression. With a move of his palm, a bright picture scroll appeared in the sky above him, exuding a terrifying power.<br/><br/>This was a powerful trump card of his.<br/><br/>Since he said this, then he had to take out his trump card first!<br/><br/>He had to take out his strongest attack and give it a try!<br/><br/>The Eyes of the surrounding Heavenly Kismet realm experts flickered slightly, and their faces revealed a hesitant expression.<br/><br/>They were also a little hesitant.<br/><br/>They believed that if all the experts took out their powerful trump cards, they would still be able to fight.<br/><br/>There was even a high chance of success.<br/><br/>However, it was only a hope.<br/><br/>Some of the ultimate trump cards of the strong ones in the Heaven’s origin realm could only be used once.<br/><br/>This would depend on whether they were willing to use it or not.<br/><br/>“Linniu, protect tianci and attack. Kill more of the strong ones in the Heaven’s origin realm!<br/><br/>However, just as Bai Kefu Sheng finished his sentence, Wang Xian roared and instantly attacked Bai Kefu Sheng!<br/><br/>It was better to strike first!<br/><br/>The various attacks from the group of Heaven’s origin creation stage powerhouses were very strange.<br/><br/>Wang Xian did not want to defend passively.<br/><br/>If he could take the lead and kill a few more heaven’s origin creation stage powerhouses, he would have profited greatly in this trip to the six paths of the universe!<br/><br/>“Roar! Roar! Roar!”<br/><br/>When Wang Xian flew out, he immediately transformed into the body of a divine dragon!<br/><br/>His gigantic body exuded an endless holy majesty!<br/><br/>The dragon’s roar resounded across the sky of the six paths of the universe!<br/><br/>The five elements grinding on the top of his head and the Tai Chi Dragon circling around him!<br/><br/>The roar of the divine dragon sounded in the six paths of the universe for the first time!<br/><br/>“Attack! Kill them!<br/><br/>“How dare you act so presumptuously in our six paths of the universe! Pay the price!<br/><br/>When the undead saw that Wang Xian was about to start a war and hunt down the Heaven’s origin creation stage powerhouses, he focused his gaze and roared loudly!<br/><br/>For the past 100 million years, the heaven origin creation stage powerhouses from the other universes had wantonly entered their territory, causing their hearts to burn with rage.<br/><br/>Now, it was time for them to start their counterattack!<br/><br/>The three heaven origin creation stage powerhouses from the six paths universe instantly launched their attacks!<br/><br/>“The Dragon Palace Dragon King has been following that heaven origin creation treasure youngster for close to 100 million years to hunt down those two fellows from the Void Universe. He must be 100% prepared. It’s basically impossible for him to obtain the heaven origin creation stage treasure. Let’s wipe out the Void Universe!<br/><br/>The 12 Ancestral Warlocks’eyes flickered when they saw this scene. They looked at the other heavenly yuan destiny realm experts in the nine-origin universe and immediately sent a voice transmission!<br/><br/>The Elven empress, Black Tortoise’s ancestor, the Hetian saint, and the rest of the heavenly yuan destiny realm experts fell into deep thought when they heard the 12 ancestral warlocks ‘words.<br/><br/>“Damn it, the Dragon Palace is going to have another heavenly yuan destiny realm expert.<br/><br/>The emperor of the Phoenix looked very embarrassed when he saw this scene.<br/><br/>It was very difficult to resolve the enmity between the Dragon Palace and the Phoenix clan.<br/><br/>The stronger the Dragon Palace was, the more dangerous it would be for the Phoenix clan.<br/><br/>Now, the Dragon King had a young man who was 100% able to step into the<br/><br/>Heavenly Yuan Destiny Realm and had a heavenly Yuan Destiny Realm Treasure. This was a huge crisis for the Phoenix clan.<br/><br/>However, he had no other choice.<br/><br/>The current Dragon King of the Dragon Palace wasn’t any weaker than him. If he added in his underling, he wouldn’t be a match for him at all.<br/><br/>“Attack!<br/><br/>At this moment, the Hetian saint, Patriarch Xuanwu, the Emperor of Angels, the elven empress, and the rest exchanged glances with the 12 ancestral witches. They immediately attacked Duke Xining and the others in the void space!<br/><br/>“Damn it, you bunch of darned fellows from the 9-essences universe! You actually didn’t snatch the Heavenly Yuan creation supreme treasure and attacked us instead!<br/><br/>Duke Xining’s expression changed drastically when he saw the 12 ancestral warlocks attacking the two of them. He roared furiously!<br/><br/>Once the Heavenly Yuan Creation Supreme Treasure from the 9 -essences universe attacked them, they would definitely not be able to obtain the Heavenly Yuan Creation Supreme Treasure Today!<br/><br/>“Those guys from the nine-origin universe have given up. We are lacking a few more powerful teammates!<br/><br/>“Oh no, the nine-origin universe wants to kill two people from the void space. We are lacking nearly ten experts.”<br/><br/>When the surrounding heavenly creation experts saw the nine-origin universe experts giving up their true treasures and directly attacking the void space experts, their expressions were abnormally ugly.<br/><br/>Now, the chances of obtaining the ultimate treasure of the Heavenly Genesis was already very slim, and this situation had happened again.<br/><br/>Even if they used all their trump cards, it would be very difficult for them to deal with the three masters from the six-origin universe and the Dragon King!<br/><br/>“Dragon King of the Dragon Palace, if it wasn’t for you, the ultimate treasure of the Heavenly Genesis would have belonged to me!<br/><br/>Bai Kefu Sheng roared furiously when he saw Wang Xian attacking him.<br/><br/>However, when he saw Wang Xian charging towards him, he didn’t hesitate at all. He quickly fled into the distance!<br/><br/>The strength that Wang Xian had displayed now was enough to kill him in an instant!<br/><br/>” Starfield Spatial Lock!<br/><br/>Wang Xian waved his arm and the starfield fragment flew in front of him, locking onto Bai Kefu Sheng’s figure!<br/><br/>At the same time, he swayed his gigantic dragon tail and charged towards the heaven origin destinies around Bai Kefu Sheng.<br/><br/>Around him were the six companions he had called over!<br/><br/>When they saw the gigantic dragon tail sweeping over, their expressions were extremely ugly!<br/><br/>“Are we just going to run away like this?”<br/><br/>The Six Heavenly Kismet realm experts roared with some unwillingness.<br/><br/>They were clearly the first to discover the Heavenly Kismet Supreme Treasure, yet they didn’t obtain anything. Instead, they wanted to use up their treasures to escape!<br/><br/>“Weng Weng!<br/><br/>However, two of the Heavenly Yuan creation realm experts didn’t hesitate to take out their treasures, wanting to escape!<br/><br/>“I will sacrifice my blood to the vast land, the six paths land, and trap you. Today, even if I have to pay a price, I will leave some of you guys here!<br/><br/>At this moment, above the arena, Sand City suddenly roared..\t\t\t\t\t\t</div>", "images": {}, "success": true}