{"id": 1170, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074406.html", "title": "Chapter 4173 - Chapter 4173: Situation 4,172", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4173 - Chapter 4173: Situation 4,172</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4173: Situation 4,172<br/><br/>Translator: 549690339<br/><br/>The twelve ancestral witches looked at Wang Xian with endless curiosity.<br/><br/>Currently, a large number of heaven origin creation stage powerhouses had entered the six paths universe. Even all the heaven origin creation stage powerhouses had arrived in the nine paths universe.<br/><br/>Even the Great Dao level fallen Shadow Devil Emperor had died here once.<br/><br/>Now that the Heaven origin creation treasure was within Wang Xian’s grasp, why didn’t he take it away?<br/><br/>“It’s because of some special reasons.”<br/><br/>When Wang Xian heard the twelve ancestral witches’words, he spoke with a smile on his face!<br/><br/>“Senior twelve ancestral witches, I want to protect him. Please do not participate in this. He will not be obtained by other powerhouses of Tianyuan! ” He spoke very politely to the twelve ancestral witches!<br/><br/>As soon as he finished his sentence, he raised his eyebrows slightly and looked into the distance.<br/><br/>He saw a familiar figure arriving again!<br/><br/>Within a short period of time, all the powerhouses in the Heaven’s origin realm were rushing over.<br/><br/>“Have you asked us if you want to protect him? “You are really the stupidest powerhouse in the Heaven’s origin realm that I have ever seen. You gave up the Heaven’s origin realm treasure just because his mother saved you and didn’t let this body of yours die. You even wanted to protect him. What a stupid and merciful person! ”<br/><br/>Bai Kefu Sheng stared at Wang Xian. When he sensed that another powerhouse was flying over from behind, he roared furiously.<br/><br/>Now, the longer he dragged on, the more powerhouses would come!<br/><br/>The chances of him obtaining the Heaven’s origin creation treasure would become even slimmer!<br/><br/>Everything was because of this damn fellow!<br/><br/>“Do I need you to teach me how to do things? I only need to have a clear conscience! ”<br/><br/>Wang Xian looked at Bai Ke Fu Sheng and said plainly.<br/><br/>“I can’t believe it’s because of this. Dragon King, Pm impressed!”<br/><br/>When the twelve ancestral witches heard this answer, they were filled with astonishment!<br/><br/>It was because his mother had saved his life and she didn’t even want the ultimate treasure of the Heaven’s origin creation.<br/><br/>Now, she had to protect him so that he could grow up.<br/><br/>This kind of behavior was very foolish to many powerhouses.<br/><br/>Those who could become strong practitioners in the Heaven’s origin realm had their hands stained with blood.<br/><br/>Which one of them didn’t kill hundreds of millions of lives?<br/><br/>However, at the same time, the 12 ancestral witches were also very impressed by Wang Xian’s behavior!<br/><br/>Such people could be befriended!<br/><br/>“Otherwise, why would I, Lin Niu, willingly follow Boss! ”<br/><br/>When Lin Niu heard the 12 ancestral witches ‘words, he opened his mouth and said with slight pride!<br/><br/>“This? ?<br/><br/>When Mu Li Yin c er heard this answer, her gaze was a little dazed!<br/><br/>She recalled a hundred million years ago when she was ridiculed and discussed by the entire tribe because of her pregnancy. She was in a bad mood and brought her maidservant out for a walk.<br/><br/>Under unexpected circumstances, she saved Wang Xian who was on his last breath.<br/><br/>At that time, she even said that it was a blessing for her son.<br/><br/>A casual action actually created the current scene.<br/><br/>A powerful heaven origin creator, a top-notch existence from other universes, was protecting her son.<br/><br/>This caused her to have mixed feelings!<br/><br/>In the sky, Jin Bao was also looking at Wang Xian with an astonished expression. He was also extremely astonished.<br/><br/>He didn’t expect such a situation to happen.<br/><br/>A Heaven Origin creator from another universe was actually protecting the supreme treasure of their six paths universe!<br/><br/>Weng<br/><br/>Right at this moment, an incomparably huge true treasure flew over from the front of the arena.<br/><br/>The surrounding space shook!<br/><br/>Jin Bao looked over and slightly frowned.<br/><br/>“I advise everyone to immediately get out of our six paths universe. Otherwise, I’ll let you all be stained with blood here! ”<br/><br/>Jin Bao’s face was filled with killing intent as he growled in a low voice!<br/><br/>The Flying Treasure opened a huge door and four figures stood there!<br/><br/>The flying treasure was the Void Pagoda.<br/><br/>Among the four figures, two of them were figures that Wang Xian was very familiar with.<br/><br/>The Void Empire’s guardian Duke of the Void Universe, Duke of Heaven’s Gate and Duke of Xining!<br/><br/>Duke of Heaven’s Gate and the rest swept a glance at the golden leopard. Their eyes were filled with vigilance as they swept their gaze across the surrounding powerhouses of the Heaven’s origin manifestation.<br/><br/>In the end, their eyes landed on tianci. Their eyes were burning with passion.<br/><br/>However, when they saw Wang Xian beside tianci, their gaze froze slightly! “It’s you, the Dragon King of the nine-origin Universe’s Dragon Palace! ”<br/><br/>The Duke of Heaven’s gate stared at Wang Xian. His eyes were filled with killing intent!<br/><br/>“Hehe, long time no see!”<br/><br/>Wang Xian smiled when he saw them.<br/><br/>If not for the fact that he was chased and injured by them, Wang Xian probably wouldn’t have met Mu Liyin ‘er!<br/><br/>“I didn’t kill you last time. Looks like Pll have to kill you this time! ” The Duke of Heaven’s Gate spoke with a face full of killing intent!<br/><br/>“Oh? Only the four of you came to Your Void Universe? If that’s the case, I’m afraid that there will be a few of you left! ”<br/><br/>Before Wang Xian could speak, the twelve ancestral witches looked at them and spoke indifferently!<br/><br/>Faced with the Void Universe, the heaven origin creation realm powerhouses from the nine-origin universe had always maintained a united front!<br/><br/>If they dared to make a move against Wang Xian, the 12 ancestral sorcerers would also make a move!<br/><br/>“You guys from the nine-origin universe, do you really think that we are afraid Of You?<br/><br/>Staring at the 12 ancestral sorcerers, Duke Xining spoke with a gloomy face!<br/><br/>“You guys are talking too much nonsense! ”<br/><br/>Wang Xian looked at the four heaven origin creation realm powerhouses from the Void Universe and said coldly!<br/><br/>“Everyone, stop stalling for time. The longer we delay, the more powerhouses will rush over. There is only one heaven origin creation realm powerhouse from the six paths universe here. With our strength, we can definitely fight against him. The Heaven origin creation realm is a treasure. We will have to rely on our own abilities!”<br/><br/>Bai kefule scanned the surroundings and said loudly.<br/><br/>There were seven of them on their side and they still had the advantage in numbers.<br/><br/>If they were to be in a stalemate, their chances of success would decrease!<br/><br/>And there were more than ten heavenly fate realm experts around them. Even if their strength was suppressed, it would still be easy for them to fight against the Golden Leopard.<br/><br/>After all, there wasn’t a single weakling that could come here.<br/><br/>There were even quite a number of control realm experts among them.<br/><br/>It wouldn’t be a problem for them to suppress the Golden Leopard!<br/><br/>When the rest of the Heavenly Kismet realm powerhouses heard this, their eyes flashed!<br/><br/>“Attack!”<br/><br/>A Heavenly Kismet Realm Powerhouse roared and waved his arm. A wave of energy directly attacked the Golden Leopard!<br/><br/>“Attack!”<br/><br/>When the other Heavenly Kismet realm powerhouses saw this scene, they knew that they couldn’t hesitate.<br/><br/>They attacked at the same time and attacked the golden leopard in the sky!<br/><br/>More than ten Heaven Origin Creation Realm Warriors launched their attacks at the same time, causing the golden leopard’s expression to change slightly.<br/><br/>He couldn’t take the opponent’s attack head-on!<br/><br/>He could at most block ten heaven origin creation realm warriors!<br/><br/>“All of you, deserve to die! ”<br/><br/>The golden leopard’s figure flashed and directly dodged to the side!<br/><br/>However, the opponent’s attacks covered a very large area. Once he dodged, the opponent might very likely take away the heaven origin creation true treasure that belonged to their six paths universe.<br/><br/>Even at this time, they couldn’t count on the Dragon King of the nine origin universe.<br/><br/>After all, there were too many opponents.<br/><br/>“Whoosh! ”<br/><br/>He waved his arm and took out a powerful chassis and threw it towards the arena!\t\t\t\t\t\t</div>", "images": {}, "success": true}