{"id": 1179, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074442.html", "title": "Chapter 4182 - Chapter 4182: 4181 Crazily Hunted For The Heavenly Fate", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4182 - Chapter 4182: 4181 Crazily Hunted For The Heavenly Fate</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4182: 4181 crazily hunted for the heavenly fate<br/><br/>Translator: 549690339<br/><br/>I sacrifice my blood to the vast earth!<br/><br/>This was a powerful ability of sand city. They had to pay a huge price to use their blood to form a powerful defense.<br/><br/>Blood sacrifice to the Pale Earth, the earth was spiritual.<br/><br/>It formed a special Earth Space Domain.<br/><br/>In this space domain, it could interfere with all escape abilities and skills.<br/><br/>Just like spatial teleportation, in my world, the distance of teleportation couldn’t exceed the limits of this world.<br/><br/>Of course, this ability of sand city wasn’t invincible. This restriction could only be maintained for a short period of time.<br/><br/>But even if it was a short period of time, in his opinion, it was enough!<br/><br/>The yellow soil that filled the sky formed a special pattern.<br/><br/>There was a blood-red pattern in the yellow soil.<br/><br/>The entire Earth city was enveloped by this move.<br/><br/>All the Heavenly Yuan creation realm experts were enveloped within it.<br/><br/>“Weng Weng!<br/><br/>The Heavenly Yuan creation realm experts who were preparing to escape, when they took out their treasures.<br/><br/>The treasures temporarily lost their effectiveness.<br/><br/>This caused their expressions to change slightly.<br/><br/>The expressions of the heavenly yuan creation realm experts who were preparing to escape also changed slightly.<br/><br/>“Damn the six paths universe, make your move and block this Dragon King. With our strength, we can completely block him for a while!<br/><br/>Bai Kefu Sheng sensed that he was locked on. He sensed the strange earth elemental energy around him that was preventing them from escaping. His expression was extremely gloomy.<br/><br/>He looked at the six heavenly yuan creation realm experts around him and roared loudly!<br/><br/>“Oh no, we can’t escape even if we want to in a short period of time!<br/><br/>The six heaven origin creation stage powerhouses around Bai Kefu Saint had a drastic change of expression when they saw this scene. They gritted their teeth as they looked at Wang Xian who was attacking them.<br/><br/>“Alright!<br/><br/>Wang Xian’s eyes lit up when he saw this scene.<br/><br/>The powerhouses from the six paths universe finally had some useful trump cards.<br/><br/>Although they could only trap these powerhouses for a dozen seconds, it was enough!<br/><br/>He locked his gaze on Bai Kefu Sheng and the other seven powerhouses and continued to sweep his dragon tail!<br/><br/>“Attack!<br/><br/>“Attack!<br/><br/>Bai Kefu Sheng and the other seven heaven origin creation realm powerhouses roared and immediately unleashed an extremely powerful attack.<br/><br/>The battle had completely erupted!<br/><br/>In the surrounding area, dozens of heaven origin creation realm powerhouses frowned slightly when they saw sand city trapping them.<br/><br/>When they saw the three heaven origin creation stage powerhouses from the six paths universe charging over, their expressions turned ugly.<br/><br/>Duke Xining and the rest from the void universe had even darker expressions.<br/><br/>They hurriedly blocked the attacks of the twelve ancestral warlocks and the rest.<br/><br/>“Boom! Boom! Boom!”<br/><br/>On Wang Xian’s side, when Wang Xian charged towards Bai Kefu Sheng and the other seven heaven origin creation stage powerhouses.<br/><br/>The surrounding heaven origin creation stage powerhouses naturally would not participate in it. They quickly hid.<br/><br/>Bai Kefu Sheng and the rest immediately tried to defend themselves.<br/><br/>A loud boom rang out. The seven powerhouses of the Heaven’s origin manifestation were sent flying rapidly under Wang Xian’s dragon tail.<br/><br/>The seven powerhouses of the Heaven’s origin manifestation looked a little gloomy.<br/><br/>“Hold on for more than ten seconds. The blockade from the six paths universe can only last for more than ten seconds.<br/><br/>One of the powerhouses of the Heaven’s origin manifestation said loudly with a gloomy face.<br/><br/>“It’s not a big problem to last for more than ten seconds. Everyone, don’t hold back!<br/><br/>Another Heaven’s origin creation stage powerhouse shouted loudly!<br/><br/>Roar!<br/><br/>Wang Xian stared at them and roared before flying directly towards them.<br/><br/>His incomparably huge body moved towards them in an attempt to tie them down!<br/><br/>He activated the nine origins dragon field.<br/><br/>Boom<br/><br/>The energy of the nine elements filled the entire space!<br/><br/>It completely enveloped the seven heaven origin creation realm experts.<br/><br/>The impact of the energy entered their bodies.<br/><br/>Light!<br/><br/>Bai Ke Fu Sheng roared as a ball appeared in his hand and opened it.<br/><br/>The holy light enveloped them all.<br/><br/>The other six powerhouses in the Heaven’s origin realm were also doing their best to defend themselves.<br/><br/>“Can you block it?”<br/><br/>Wang Xian’s dragon body surrounded them in the middle. He extended his dragon claws and clawed downwards.<br/><br/>At the same time, the five elements millstone above him turned into a five elements divine dragon.<br/><br/>The Tai Chi Dragon disk that was surrounded by him also turned into a yin-yang divine dragon!<br/><br/>They attacked Bai Copusheng and the other seven heaven origin destinies at the same time!<br/><br/>Boom<br/><br/>Wang Xian’s Dragon Claw landed on their defense. To Wang Xian’s surprise, the layers of defense were broken by him. The last layer of defense was still able to block him.<br/><br/>However, it was useless to just block his attack!<br/><br/>Roar! Roar peng!<br/><br/>The Five Elements Dragon Horn crashed into the last defense.<br/><br/>This made the expressions of Bai Fo Sheng and the other seven heavenly creation realm warriors change drastically.<br/><br/>“Not good, the true treasure in his hand can actually ignore the suppression of the six paths universe.<br/><br/>Bai Fo Sheng shouted with a face full of fear!<br/><br/>“Gan, I’ll block it. The rest of the defense is up to you guys!”<br/><br/>A heavenly fate realm powerhouse’s face revealed an extremely pained expression.<br/><br/>He waved his arm and a piece of cloth met the attack of the Five Elements Millstone!<br/><br/>peng!<br/><br/>The Dragon Horn crashed onto the piece of cloth, but it was blocked by the piece of cloth that was filled with strange patterns.<br/><br/>Following that, the piece of cloth slowly began to collapse and floated downwards!<br/><br/>Roar!<br/><br/>However, before they could be happy and continue to defend themselves, the Yin-yang divine dragon that was formed from the Taiji Dragon Disc had already arrived.<br/><br/>“Why are there still more?”<br/><br/>When the yin-yang Divine Dragon’s attack power that was comparable to that of a heaven’s origin manifestation powerhouse was attacking them, a look of despair appeared on the faces of the Heaven’s origin manifestation powerhouses.<br/><br/>Generally speaking, when they were suppressed by the six paths universe, ten suppressed powerhouses could withstand a heaven’s origin manifestation powerhouse that was not suppressed.<br/><br/>The seven of them were at a disadvantage when facing Wang Xian alone.<br/><br/>If they were to use the five elements grinding technique and their trump cards, they might be able to last for more than ten seconds.<br/><br/>However, there was a third existence who was comparable to the Heaven’s origin.<br/><br/>How were they supposed to fight this!<br/><br/>Boom<br/><br/>The power of yin and yang revolved and annihilated all the energy as it engulfed them!<br/><br/>Buzz<br/><br/>Before the Tianyuan creator could react, the energy swept across their bodies and instantly made them lose all their vitality!<br/><br/>Crack! Crack<br/><br/>One of the Tianyuan creator’s body cracked like porcelain, leaving behind a fake corpse!<br/><br/>His original body appeared at the side of the Earth where the blood sacrifice was being held.<br/><br/>His forehead was filled with cold sweat as he swept his gaze toward Wang Xian in fear!<br/><br/>Buzz<br/><br/>Wang Xian waved his arm and kept the six corpses.<br/><br/>In the next moment, his gaze focused and locked onto the two heaven origin creation stage powerhouses in the Void Universe!<br/><br/>“Get rid of them!<br/><br/>Wang Xian roared at the 12 ancestral warlocks and attacked them directly..\t\t\t\t\t\t</div>", "images": {}, "success": true}