{"id": 1173, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074418.html", "title": "Chapter 4176 - Chapter 4176: 4175 Had All Sorts Of Unpredictable Methods", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4176 - Chapter 4176: 4175 Had All Sorts Of Unpredictable Methods</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4176: 4175 had all sorts of unpredictable methods<br/><br/>Translator: 549690339<br/><br/>“Boom!<br/><br/>“Boom Boom!<br/><br/>Terrifying explosions resounded in the sky above the Earth City Arena.<br/><br/>Above them, golden leopard and sand city were fighting against close to 30 heaven creation realm powerhouses.<br/><br/>The undead alone was fighting against 40 heaven creation realm powerhouses.<br/><br/>Because this was earth city, sand city had a natural advantage.<br/><br/>In addition, the group of Heaven Origin Creation Realm powerhouses were also afraid that the heaven origin creation realm powerhouses from the six paths universe would single-handedly kill them. Hence, they were a little afraid!<br/><br/>This resulted in a balanced situation in the battle!<br/><br/>However, from Wang Xian’s point of view, this balance was short-lived!<br/><br/>“There are more than 70 heaven origin creation realm powerhouses from various universes. All of them are here for the heaven origin creation treasure. This scene is really spectacular!<br/><br/>Lin Niu stood beside Wang Xian. His gaze swept across the surroundings as he said with a slight sigh.<br/><br/>Among these heaven origin creation stage powerhouses, there were many existences at the control level.<br/><br/>On the other hand, the existences at the Great Dao level had yet to appear! If the Great Dao level powerhouses were in the six paths universe, they would not have much of an advantage.<br/><br/>No matter what level they were at, as long as they entered the six paths universe, the strength they unleashed would definitely not be able to reach the heaven origin creation stage.<br/><br/>All of them were suppressed to below the level of the Heaven’s origin manifestation.<br/><br/>This also caused the Heaven’s origin manifestation powerhouses at this level to not come over.<br/><br/>For example, the Fallen Shadow Devil Emperor did not come in again after being wiped out by the power of the universe.<br/><br/>“It’s time to make a move!”<br/><br/>Wang Xian stood at the side and flexed his wrist. A faint smile appeared on his face.<br/><br/>Just now, Wang Xian and the rest had killed a water element heaven’s origin manifestation powerhouse.<br/><br/>The corpse of a water-elemental Tianyuan creator along with some resources in his hands.<br/><br/>To the Dragon Palace, this was a huge amount of resources!<br/><br/>Even during the calamity, it was exceptionally difficult to kill a Tianyuan creator.<br/><br/>For example, during the war between the nine-origin universe and the Void Universe, in the last Calamity War, not a single Tianyuan creator died!<br/><br/>Of course, this kind of death was a true death.<br/><br/>But among the heaven origin creation realm experts, there were only six who were killed once.<br/><br/>Three from each universe!<br/><br/>Among them, fallen Shadow Demon Emperor killed two!<br/><br/>This kind of killing, the other party could have treasures to resurrect!<br/><br/>To truly kill a heaven origin creation realm expert, it was too difficult!<br/><br/>If he could kill them, each corpse would be a huge resource. He scanned his surroundings and revealed a confident expression.<br/><br/>“I hope he has a bloodline or something.<br/><br/>Lin Niu mumbled.<br/><br/>If he could kill a heaven’s origin creator with a bloodline or something, it would increase his strength.<br/><br/>Whoosh<br/><br/>At this moment, a rope suddenly flew towards Tianci on the stage!<br/><br/>A strange rope directly passed through the defenses of the golden leopard and sand city.<br/><br/>“A heaven’s origin creator is using his means!<br/><br/>Wang Xian’s eyes focused when he saw this scene. He stretched out his hand and grabbed at the rope!<br/><br/>Lin Niu, who was at the side, also made his move and grabbed at the rope!<br/><br/>The Heaven’s origin creator who was controlling the rope had just rushed over. He didn’t know that Wang Xian and the rest were beside Tian Ci.<br/><br/>When he saw Wang Xian and Lin Niu making their move, his expression changed slightly!<br/><br/>Wang Xian and Lin Niu made their move. They grabbed the rope in their hands in an attempt to control it!<br/><br/>However, the rope disappeared in an instant!<br/><br/>“What’s going on? There’s a heaven’s origin creator at the spot below. Isn’t he a powerhouse from the six paths universe?”<br/><br/>The heavenly creation great being took back the rope and shouted loudly with a face full of surprise!<br/><br/>The rope in his hand was a trump card. He was prepared to use it to snatch the heavenly creation true treasure.<br/><br/>In the end, he did not expect that the youth who was hiding the heavenly creation true treasure actually had two heavenly creation great beings guarding him.<br/><br/>This? ?<br/><br/>“There’s a foolish fellow who wants to protect the youth who has the heavenly creation true treasure. He wants to obtain the heavenly creation true treasure and also wants to kill him!<br/><br/>Bai Kefu Sheng’s gaze swept over as he roared with a gloomy face.<br/><br/>Now, the chances of him obtaining the Heavenly Yuan destiny true treasure were too small!<br/><br/>His words also attracted the attention of all the Heavenly Yuan Destiny Realm Great Beings!<br/><br/>“Use your trump card to attack and suppress the three fellows from the six paths universe!<br/><br/>Heavenly Gate Duke from the Void Universe looked around with killing intent as he roared loudly!<br/><br/>“Boom! Boom! Boom!<br/><br/>“Boom! Boom! Boom!”<br/><br/>At the surrounding area, a group of Heavenly Yuan Destiny Realm powerhouses immediately released powerful attacks and suppressed golden leopard and sand city!<br/><br/>However, the surrounding heavenly yuan destiny realm powerhouses would not take out their trump cards.<br/><br/>Their trump cards were used to obtain Heavenly Yuan Destiny Realm Supreme Treasures.<br/><br/>They did not take them out at this moment!<br/><br/>At the side, more than forty heavenly yuan destiny realm experts gradually led the battlefield to this side.<br/><br/>This was to make it easier for them to obtain the Heavenly Yuan Destiny Realm Treasure!<br/><br/>Duke Tian Men’s face darkened when he saw that the surrounding heavenly yuan destiny realm experts didn’t care about him at all and only increased their attack power slightly.<br/><br/>There were absolutely no fools who could become heavenly yuan destiny realm experts.<br/><br/>All of them were human spirits!<br/><br/>If it wasn’t for the sake of obtaining the ultimate treasure in the Heaven’s origin realm, no one would use their trump card!<br/><br/>Buzz<br/><br/>However, in the arena.<br/><br/>Tianci, who was standing beside Wang Xian, suddenly had red eyes. His body moved and he flew towards a direction at his fastest speed!<br/><br/>When Wang Xian saw this scene, his gaze focused slightly!<br/><br/>He waved his arm and a wave of energy enveloped him, fixing him in front of him!<br/><br/>Following that, Wang Xian’s palm landed on his body and the branches of the ancestral tree entered his body!<br/><br/>The soul-returning tree branch trembled slightly, causing his eyes to clear up. Tianci’s body paused as he looked at Wang Xian with a stunned expression!<br/><br/>“Foster father, what… What Happened to me just now?”<br/><br/>Tianci asked in astonishment!<br/><br/>“I’ve been controlled. You have to be careful from now on. The attacks of these powerhouses in the Heaven’s origin realm are very strange and they have countless means. It’s impossible to guard against them.<br/><br/>Wang Xian frowned slightly and said.<br/><br/>With a move of his palm, the roots of the ancestral tree extended into Tianci’s body and connected with the divine tree in his body!<br/><br/>The pressure from the six universes disappeared completely.<br/><br/>Wang Xian scanned his surroundings.<br/><br/>There were more than 70 heaven origin creation stage powerhouses around him. Many of them had strange and unpredictable methods and all kinds of trump cards!<br/><br/>Wang Xian might not be able to guard against these trump cards!<br/><br/>In fact, if they wanted to kill Tianci, it would be very easy!<br/><br/>At this moment, Wang Xian had to be on his guard!<br/><br/>The suppression of the six universes had disappeared, and the branches of the ancestral tree were still in Tianci’s body!<br/><br/>Wang Xian stood there and watched the battle in front of him quietly.<br/><br/>Very soon, there would be a strong cultivator in the heaven’s origin realm who could not hold back anymore!<br/><br/>At that time, it was time for him to make his move!\t\t\t\t\t\t</div>", "images": {}, "success": true}