{"id": 1186, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074470.html", "title": "Chapter 4189 - Chapter 4189: 4188 Was In The Midst Of A Breakthrough", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4189 - Chapter 4189: 4188 Was In The Midst Of A Breakthrough</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4189: 4188 was in the midst of a breakthrough<br/><br/>Translator: 549690339<br/><br/>The Celestial Nation took out sufficient resources and traded the corpse of a water-type heaven origin creation stage powerhouse to Wang Xian.<br/><br/>After Tianci and the rest strolled around the tree of chaos, they began their closed-door cultivation.<br/><br/>This time, Tianci wanted to raise his strength to the heaven origin creation stage as soon as possible!<br/><br/>Wang Xian had a thought and came to the Dragon Palace!<br/><br/>The Dragon Palace was also Wang Xian ‘s divine kingdom.<br/><br/>At the position of the Dragon Throne, the ancestral tree was growing luxuriously there.<br/><br/>The incomparably huge ancestral tree had already shown its majesty. The fruits on it were swaying.<br/><br/>There was something extra on the ancestral tree.<br/><br/>It was a huge branch with a forked branch. The branch had terrifying powers!<br/><br/>On the branch, there were roots of the same root, branches of the divine tree, and powerful branches.<br/><br/>These branches were all taken from the Heavenly Yuan creation treasure in Tianci’s body.<br/><br/>These branches had extremely powerful offensive and destructive power.<br/><br/>In the future, their power would be comparable to a beginner-level heavenly yuan creation expert.<br/><br/>Of course, this required them to fully mature.<br/><br/>There was still a long time before they fully matured.<br/><br/>Other than the branches of the Heavenly Treasure of Tianyuan in his body, the most eye-catching ones were the fruit trees on the ancestral tree.<br/><br/>The fruits grew on the main trunk of the ancestral tree.<br/><br/>Each fruit emitted a special energy.<br/><br/>Currently, the fruits had yet to mature. Wang Xian didn’t know what the specific effects were.<br/><br/>However, he was certain that these fruits were supplementary fruits.<br/><br/>The ancestral tree was more of a supplementary type.<br/><br/>“Within a billion years, the ancestral tree should be able to mature completely. After it matures, its strength will also be greatly enhanced. ” Wang Xian thought to himself.<br/><br/>Time passed day by day. A thousand years passed very quickly.<br/><br/>At the location of the Tree of chaos and the Dragon Palace’s domain, figures were flying over rapidly.<br/><br/>Wang Xian stood on a leaf of the tree of chaos and scanned his surroundings.<br/><br/>“Congratulations, Dragon King. Your trip to the six paths of the universe has yielded a huge harvest! ”<br/><br/>The Elven empress was the first to fly over. “By the way, Dragon King, your harvest this time is more than what I have gained in my entire life. I’m really envious of you. ”<br/><br/>They did not know exactly how much harvest Wang Xian had in the six paths of the universe.<br/><br/>However, they were aware that he had killed 11 powerhouses in the Heaven’s origin realm.<br/><br/>With just the corpses and resources of these powerhouses, it was not an exaggeration for the elven empress to say that she had obtained more treasures than she did in her lifetime.<br/><br/>From the moment the elven empress broke through to a powerhouse in the Heaven’s origin realm, she had only killed two powerhouses in the Heaven’s origin realm.<br/><br/>Furthermore, she had obtained their corpses.<br/><br/>However, Wang Xian had killed more than 10 of them in one go. She was well aware of the benefits of killing a heaven’s origin creator.<br/><br/>“Elven empress, you are too modest. I was just lucky! ”<br/><br/>Wang Xian smiled and shook his head.<br/><br/>“Dragon King, your luck is really heaven-defying. The speed at which your strength is improving makes us envious! ”<br/><br/>The twelve ancestral witches flew over and said to Wang Xian with a smile!<br/><br/>“That’s right. The current Dragon King and the current Dragon Palace have already surpassed the peak of the Divine Dragon Clan!”<br/><br/>The Hetian Saint flew over and said with a smile on his face!<br/><br/>“Everyone, you are exaggerating. I am still far from being comparable to you seniors! ”<br/><br/>Wang Xian smiled humbly when he heard their words.<br/><br/>“Hehe, the new generation surpasses the new. It is a blessing for our nine-origin universe to be able to produce such an expert. ” The ancestor of the Xuanwu clan said with a smile!<br/><br/>“Congratulations, Dragon King! ”<br/><br/>“Congratulations, Dragon King! ”<br/><br/>The skeleton clan and the Divine Tiger clan had sent some experts who were at the peak of the Dominator realm. They cupped their hands at Wang Xian and congratulated him respectfully.<br/><br/>“Hehe, alright. Senior Fallen Shadow Demon Emperor said that he won’t be coming this time. The rest are here too. Let’s make a deal. If you have any treasures, you can take them out! ”<br/><br/>Wang Xian nodded at them and said.<br/><br/>Wang Xian gave the corpse of a heaven origin creator with darkness attribute to the demon race. The Fallen Shadow Demon Emperor also sent a message to express his gratitude.<br/><br/>The Fallen Shadow Demon Emperor was not coming for the trade this time. He was wandering in the universe.<br/><br/>In addition, the Emperor of Phoenix did not come either.<br/><br/>This was because Wang Xian did not invite him at all.<br/><br/>This transaction was mainly conducted by him.<br/><br/>The rest of the powerhouses had arrived!<br/><br/>“Then, Dragon King, bring out the corpses and let us have a look!”<br/><br/>The Heaven origin creator of the royal family said with a fiery gaze.<br/><br/>Seniors, the corpses of the heaven origin creator are extremely precious. I also wish to sell them at a good price. I have the corpses of the Heaven Origin Creator with seven attributes metal, wood, Earth, wind, thunder, light, and darkness. I am prepared to sell four of them. You can choose from these four corpses! ”<br/><br/>“1 will keep the other two for the disciples of the Dragon Palace. The seven corpses are of similar value. The one with the highest price will get them in exchange for resources! ”<br/><br/>With a wave of his arm, Wang Xian took out six corpses and placed them in front of everyone.<br/><br/>He still had one of the dark attribute corpses in his hands.<br/><br/>Furthermore, he did not have the water attribute corpses anymore because he was trading with the Celestial Nation!<br/><br/>He did not take out the fire attribute corpses.<br/><br/>In addition, he only sold four of them. The higher the price, the better.<br/><br/>This way, he could increase the price by selling them!<br/><br/>The group of Heaven Origin Destinies swept their eyes across the corpses. Their eyes sparkled.<br/><br/>This required them to compete with each other.<br/><br/>Although it was not very intense, they could not obtain these corpses at a low price.<br/><br/>However, the group of Heaven Origin destinies were prepared as well. They took out their resources one by one.<br/><br/>What surprised Wang Xian was that the skeleton clan took out a sum of resources that Wang Xian could not reject. They directly bought the corpse with the darkness attribute!<br/><br/>As for the rest, the Elf clan obtained a wood attribute while the angel clan obtained a light attribute.<br/><br/>The royal clan obtained a wind attribute.<br/><br/>Wang Xian put away all the resources and was extremely excited!<br/><br/>These resources were enough to increase his strength.<br/><br/>At that time, he would be able to have existences that were on par with those at the control level.<br/><br/>Without using the Five Elements Millstone and the Tai Chi Dragon Plate, and without the help of the ancestral tree.<br/><br/>If the Five Elements Millstone and the Tai Chi Dragon Plate and the ancestral tree were added in, Wang Xian would be able to fight against two existences that had just stepped into the control level.<br/><br/>His strength could be said to have increased tremendously.<br/><br/>With the addition of the LINNIU, if the fallen Shadow Demon Emperor did not have a powerful trump card and was at an extremely deep level in the Great Dao realm, he would not be able to destroy the Dragon Palace!<br/><br/>“Everyone, I still have some ultimate treasures that can allow me to escape. Next, I would like to barter and conduct the transaction!”<br/><br/>The transaction of the corpse of the Heaven’s origin creator was completed. Wang Xian was ready to continue the transaction.<br/><br/>He currently had thirteen ultimate treasures that could allow him to escape.<br/><br/>These treasures were extremely precious to the Heaven’s origin powerhouses.<br/><br/>Wang Xian was ready to take out three of them and carry out the transaction!<br/><br/>“Alright, let’s take out all the treasures and see if there’s any interest in the transaction! ”<br/><br/>The unity saint nodded his head and took out some treasures.<br/><br/>The other experts also took out treasures!\t\t\t\t\t\t</div>", "images": {}, "success": true}