{"id": 1184, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074462.html", "title": "Chapter 4187 - Chapter 4187: 4,186 Enormous Treasures And Resources!", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4187 - Chapter 4187: 4,186 Enormous Treasures And Resources!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4187: 4,186 enormous treasures and resources!<br/><br/>Translator: 549690339<br/><br/>It had been over a hundred million years since the discovery of the tree of chaos in the 9-origin universe!<br/><br/>Over the past hundred million years, the Great Disciples of the 9-origin universe had been cultivating here! !<br/><br/>“Wow, what a huge tree! What kind of tree is this? How can it be so huge? And how can the energy here be so abundant?”<br/><br/>Gong Cheng’s younger brother, who had followed Gong Cheng over, looked at the incomparably huge tree of chaos and was somewhat dumbstruck!<br/><br/>“This is the tree of chaos in the chaos. It doesn’t belong to the six paths of the universe. For the time being, it has drifted to the edge of our nine-origin universe. ”<br/><br/>Wang Xian introduced it to them indifferently.<br/><br/>“Greetings. Dragon King! ”<br/><br/>At this moment, Prime Minister Gui and the Divine Dragons flew over and bowed respectfully to Wang Xian!<br/><br/>Okay.<br/><br/>Wang Xian nodded at them.<br/><br/>“This must be the crown prince of Tianci. ”<br/><br/>Prime Minister Gui looked at Mu Litianci and said with a smile!<br/><br/>“I am Mu Litianci! ”<br/><br/>Tianci looked at Prime Minister Gui and the divine dragons around him and nodded nervously.<br/><br/>“Let’s go. ”<br/><br/>Wang Xian smiled and flew forward.<br/><br/>Every peak race occupied a spot in the tree of chaos.<br/><br/>The place occupied by the Dragon Palace was also very spectacular after some construction!<br/><br/>In the middle, there was a palace.<br/><br/>Wang Xian introduced Prime Minister Gui to Tianci and the rest. Then, he sent someone to show them around the surrounding areas.<br/><br/>He also let the disciples of the Dragon Palace get to know each other.<br/><br/>Tianci was Wang Xian’s foster son. He could be considered the first crown prince of the Dragon Palace!<br/><br/>His position in the Dragon Palace was needless to say!<br/><br/>In addition to the fact that he possessed the ultimate treasure of the Heaven’s origin, Prime Minister Gui and the rest were very respectful towards TIANCI.<br/><br/>Tianci and the rest had also seen the other peak races in the nine-origin universe, as well as all kinds of powerful existences.<br/><br/>At present, due to the tree of chaos and the appearance of a group of Heaven’s origin creation powerhouses, the strength of the nine-origin universe had received a huge increase.<br/><br/>This increase was several times that of the past!<br/><br/>Wang Xian took a simple glance. The number of powerhouses at the ruler realm in the nine-origin universe had increased by a lot.<br/><br/>It was much more than the six-origin universe!<br/><br/>“Prime Minister Gui, how have you been recently?”<br/><br/>Wang Xian asked Prime Minister Gui.<br/><br/>Recently, Wang Xian had not paid attention to the situation in the Dragon Palace for a long period of time.<br/><br/>“Dragon King, there are more than 500,000 masters of the ruler realm in our Dragon Palace! ”<br/><br/>Prime Minister Gui said with a smile, “There is a lot of energy in the tree of chaos. In addition, the disciples of our Dragon Palace can easily use the energy to advance to the pinnacle of the Universe Knight Realm. Now, there are often disciples who have made breakthroughs!”<br/><br/>“It is convenient to have high-end combat strength. Last time, with the fragment of the Elemental God that you obtained, there are seven masters of the pinnacle of the ruler realm in our Dragon Palace! ”<br/><br/>“Currently, we are still in a state of rapid improvement! ”<br/><br/>Prime Minister Gui said, there was a hint of pride on his face. “Also, Dragon King, according to the information that I have received, among the other peak races, there are only about 300,000 powerhouses at the Overlord realm in the universe from the Phoenix race. We have a lot more than them!”<br/><br/>Wang Xian nodded with a satisfied look on his face.<br/><br/>At the moment, the skeleton clan might be the only one with more ascendants than them.<br/><br/>“I have obtained a lot of resources this time. This time, I can increase the number of ascendants at the peak of the Ascendant Realm in the Dragon<br/><br/>Palace. ”<br/><br/>Wang Xian spoke to Prime Minister Gui.<br/><br/>If the disciples of the Dragon Palace were to absorb the corpse of a heaven origin creator, they would be able to quickly produce ten ascendants at the peak of the Ascendant Realm.<br/><br/>He had 13 such corpses in his possession.<br/><br/>One of the original 14 had been consumed by the Tai Chi Dragon Plate.<br/><br/>“In addition, give this corpse of a heaven’s origin creator with the darkness attribute to the demon race. Tell them that the Dragon Palace is grateful to the fallen shadow demon emperor for informing them about the Heaven’s origin creation treasure!”<br/><br/>Wang Xian waved his arm and gave the corpse of a heaven’s origin creator with the darkness attribute to Prime Minister GUI.<br/><br/>During this trip to the six universes, Wang Xian had gained a lot.<br/><br/>All this information was given to them by the Fallen Shadow Demon Emperor.<br/><br/>Now that Wang Xian had given him the corpse of an expert, it could be considered as returning the favor.<br/><br/>Of course, there were also thoughts of befriending him.<br/><br/>After all, the fallen Shadow Demon Emperor was the only Great Dao expert in the nine-origin universe.<br/><br/>His strength was unfathomable.<br/><br/>Befriending him would be of great benefit to the Dragon Palace!<br/><br/>“It’s the Dragon King! ”<br/><br/>Prime Minister Gui replied immediately!<br/><br/>He gifted the Shadow Devil Emperor the corpse of a heaven’s origin creator.<br/><br/>There were still twelve corpses left!<br/><br/>Wang Xian was prepared to take out a few of these twelve corpses for a trade!<br/><br/>He wanted to obtain some resources to increase his strength.<br/><br/>Seeing Prime Minister Gui leave, Wang Xian had a thought. He opened the mother nest and checked the treasures inside.<br/><br/>When he was at the Earth City, Wang Xian had ambushed and killed 12 Heaven’s origin powerhouses.<br/><br/>He had obtained quite a number of treasures.<br/><br/>Among them, the Void Pagoda had obtained a powerful void pagoda. However, this void pagoda could only be used by the powerhouses from an lie and the Void Empire.<br/><br/>It was not of much use to him.<br/><br/>However, there were three spatial-type treasures. The most powerful one was the void ruler.<br/><br/>The world’s end near at hand could be used for long-distance teleportation!<br/><br/>At the same time, it possessed powerful offensive power.<br/><br/>The body of the Void Dragon could be used!<br/><br/>The other two treasures could be used with the body of the Void Dragon.<br/><br/>Initially, Wang Xian felt that it was very troublesome for the body of the Void Dragon to break through to the Tianyuan Destiny Realm.<br/><br/>But now, it was much easier!<br/><br/>He had three corpses of spatial attribute powerhouses in his hands. Among them, Lord Tianmen was a heaven’s origin creation stage powerhouse who was at the control level.<br/><br/>This allowed Wang Xian’s body of the Void Divine Dragon to be upgraded to the Heaven’s origin creation stage. The probability of this was greatly increased.<br/><br/>Wang Xian was even confident that he could make a breakthrough in his body of the Void Divine Dragon before the arrival of the calamity.<br/><br/>Other than the spatial attribute treasures,.<br/><br/>Wang Xian also obtained 13 ultimate treasures that could allow him to escape in an instant.<br/><br/>These treasures were all prepared by the heaven-origin creation stage powerhouses when they entered the six paths universe.<br/><br/>They were the ultimate treasures for escaping from the pursuit of the heaven-origin creation stage powerhouses!<br/><br/>However, due to Wang Xian’s sneak attack, they were unable to use these treasures. Now, all of them had become Wang Xian ‘s treasures. These treasures were also rare treasures to Wang Xian.<br/><br/>Every life-saving treasure was extremely precious.<br/><br/>Two of them were treasures that could be resurrected within a certain range in an instant.<br/><br/>They were definitely good treasures!<br/><br/>Other than these thirteen life-saving treasures, there were a few other treasures.<br/><br/>They were all the weapons of these powerhouses. These treasures were rare existences for powerhouses at the peak of the Dominator realm.<br/><br/>For Wang Xian, they were just a little lacking.<br/><br/>Currently, Wang Xian possessed two fragments of the ultimate treasure of Tianyuan. He also possessed the black resurrection Lily and the Tai Chi Dragon Plate. He really didn’t care about the other weapons..\t\t\t\t\t\t</div>", "images": {}, "success": true}