{"id": 1180, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074446.html", "title": "Chapter 4183 - Chapter 4183: 4182, The Fate Of The Heaven’S Origin That Was On The Run", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4183 - Chapter 4183: 4182, The Fate Of The Heaven’S Origin That Was On The Run</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4183: 4182, the fate of the Heaven’s origin that was on the run<br/><br/>Translator: 549690339<br/><br/>“Not good!<br/><br/>When Duke Xining heard Wang Xian’s voice and saw him attacking the two of them, his heart sank!<br/><br/>He swept his gaze over and was shocked.<br/><br/>Beside Wang Xian, there were two extremely terrifying divine dragons on the left and right. One was of the five elements while the other was of the Yin and yang!<br/><br/>The two divine dragons of the Yin and yang five elements were exuding a strength that was not weaker than the fate of the Heaven’s origin!<br/><br/>“This is? The Dragon King’s own strength is not weaker than the control level!<br/><br/>The Elven empress and the rest looked over. Their pupils contracted slightly and their faces were filled with shock.<br/><br/>“This Dragon King of the Dragon Palace is growing too fast!<br/><br/>Even the ancestor of Xuanwu exclaimed in astonishment!<br/><br/>It had not been long since Wang Xian possessed the strength of the Heaven’s origin realm. In the end, he was already comparable to an existence in the control level.<br/><br/>This was not even counting the fact that he still had a powerful subordinate!<br/><br/>In addition, he also had the foster son who would definitely become an expert at the Heaven’s origin blessed realm in the future. The future of the Dragon Palace was too strong!<br/><br/>“This is bad!”<br/><br/>The Emperor of Phoenix’s heart sank when he saw Wang Xian’s invincible aura. A bad premonition enveloped his heart.<br/><br/>The current Dragon King had a great chance of exterminating him!<br/><br/>“Void space!<br/><br/>When Duke Xining saw Wang Xian attacking him, he did not hesitate and took out an extremely powerful treasure.<br/><br/>Void space allowed him to be in another space.<br/><br/>As long as he could not find the entrance to void space, he would not be able to kill him.<br/><br/>Similarly, as he was in void space, he could not attack his opponents in the outside world.<br/><br/>This was a dodge-type treasure. The last time he encountered an undead, he used this treasure to escape easily!<br/><br/>However, he managed to dodge it. The Tianyuan creator from the void space was dumbfounded!<br/><br/>He looked at Wang Xian, who was attacking him, and the seven experts from the nine-origin universe who were surrounding him. A bitter and despairing expression appeared on his face.<br/><br/>There was no way for him to dodge.<br/><br/>It was already very difficult for him to fight against the twelve ancestral warlocks alone.<br/><br/>Not to mention the Dragon King from the Dragon Palace who was not suppressed by the six-origin universe, as well as the two treasures that were not suppressed by him.<br/><br/>With a teleport, he wanted to continuously Dodge.<br/><br/>As long as the blockade of sand city was ineffective, he still had the confidence to escape!<br/><br/>Whoosh<br/><br/>However, the speed of his teleportation was too slow in Wang Xian’s eyes!<br/><br/>Wang Xian’s body shook. The incipient Saint Wings appeared on both sides of his body. The power of wind and thunder flickered and he instantly appeared beside the void universe expert!<br/><br/>The Dragon Claw clawed at him directly!<br/><br/>The Void universe expert couldn’t Dodge at all. He roared in despair!<br/><br/>Wang Xian waved his arm and killed him directly. He kept his corpse! “Dragon King of the Dragon Palace, My Void Universe will definitely destroy you in the future!<br/><br/>When Duke Xining, who was hiding in the void space, saw this scene, he roared with a gloomy face full of murderous intent!<br/><br/>When Wang Xian heard his words, he smiled contemptuously.<br/><br/>After sensing Duke Xining’s location, Wang Xian did not attack him. Instead, he swept his gaze to the side!<br/><br/>He set his gaze on the twenty or so heaven origin creator powerhouses who were attacked by the undead.<br/><br/>Wang Xian swayed his huge body and flew over directly!<br/><br/>Only ten seconds had passed since Wang Xian killed Bai Kefu saint’s six heaven origin creator and the Heaven Origin creator in the Void Universe.<br/><br/>There were still a few seconds left.<br/><br/>Within these few seconds, Wang Xian could kill one more heaven origin creator and obtain a huge amount of resources.<br/><br/>This resource could allow the disciples of the Dragon Palace to achieve a terrifying improvement.<br/><br/>“This is bad. The Dragon King of the Dragon Palace has locked onto us. He has two special treasures that are comparable to the heaven origin creator. We are completely unable to contend against him!<br/><br/>When Wang Xian flew towards the twenty heaven origin creator, the expressions of the twenty heaven origin creator powerhouses changed drastically as they roared in shock and anger!<br/><br/>“We must break the blockade around us, or all of us will die!<br/><br/>One of the Heaven origin creation stage powerhouses roared crazily!<br/><br/>Boom! Boom! Boom<br/><br/>He took out a treasure and attacked the blockade set up by Earth Sand City!<br/><br/>A violent explosion rang out!<br/><br/>Faint ripples appeared on the blockade of Earth Sand City as it started to turn illusory!<br/><br/>“Thunder!<br/><br/>Wang Xian’s eyes focused when he saw this scene. He flapped his incorporeal holy wings.<br/><br/>An endless amount of thunder and lightning energy covered the entire space. All the Heaven’s origin creation stage powerhouses were covered in it!<br/><br/>Thunder shower!<br/><br/>Boom<br/><br/>The blockade was attacked again. It began to turn into nothingness!<br/><br/>Whoosh<br/><br/>At this moment, some Heaven’s origin creation stage powerhouses escaped through their treasures.<br/><br/>The surrounding Heaven’s origin creation stage ultimate treasures also escaped through their treasures rapidly.<br/><br/>This was especially so for the more than twenty Heaven’s origin creation powerhouses who were targeted by Wang Xian. Each and every one of them was not stingy with their trump cards!<br/><br/>When Wang Xian saw this scene, his eyes flickered slightly.<br/><br/>He waved his arm and the five elements divine dragon turned into the five elements millstone. Wang Xian injected the power of wind and thunder into it and waved his arm!<br/><br/>The Five Elements Millstone flew directly in a direction at a terrifying speed.<br/><br/>In the next moment, Wang Xian grabbed the tai chi dragon disc and waved it forcefully as he flew towards another direction!<br/><br/>Wind and Thunder Lock!<br/><br/>The Lightning had already landed in the bodies of all the Heaven’s origin creation stage powerhouses. After Wang Xian activated the wind and thunder lock, he immediately ordered the Tai Chi Dragon Disc and the five elements millstone to pursue the two heaven’s origin creation stage powerhouses. His gaze landed on Lord Xining who had stepped out of the void space in an instant!<br/><br/>The Heaven’s origin creator in the void space was his first target!<br/><br/>After Duke Xining came out of the void space, he opened a scroll with a flick of his palm and disappeared quickly!<br/><br/>Wang Xian moved and chased after Duke Xining according to his ability to search for enemies in the Void Space!<br/><br/>“Chase after them and kill them!<br/><br/>The eyes of the golden leopard and the rest of the undead were slightly red as they roared with murderous intent!<br/><br/>“Boom! Boom! Boom!”<br/><br/>In the surrounding area, a portion of the heavenly creation realm great beings did not use their treasures to escape. Instead, they fled in all directions!<br/><br/>Streams of energy attacks covered the entire world!<br/><br/>At this time, all the heavenly creation realm great beings no longer had the mood to fight for the heavenly creation true treasure.<br/><br/>They knew that beside the heavenly creation true treasure youth, there was another heavenly creation realm great being who was not suppressed by the universe energy.<br/><br/>It was too difficult for them to kidnap the youth from his hands! In an instant, all the Heavenly Yuan creation realm experts fled!<br/><br/>The undead chased after them!<br/><br/>In the sky above Earth City, the terrifying energy and aura quickly disappeared!<br/><br/>“Hu hu, Hu !”<br/><br/>“Hu hu!<br/><br/>When all the tribal disciples on the lost planet saw all the Heavenly Yuan creation realm experts leave, they panted heavily and wiped the cold sweat on their foreheads!<br/><br/>This time, for them, it was a complete return from hell!<br/><br/>At this moment, they were glad that they were still alive.<br/><br/>They were glad that they were not dead..\t\t\t\t\t\t</div>", "images": {}, "success": true}