{"id": 1187, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074474.html", "title": "Chapter 4190 - Chapter 4190: 4189 Made A Breakthrough", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4190 - Chapter 4190: 4189 Made A Breakthrough</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4190: 4189 made a breakthrough<br/><br/>Translator: 549690339<br/><br/>The Hetian Sage and the rest took out one treasure after another and placed them in front of him. They were prepared to carry out the transaction.<br/><br/>Wang Xian also took out three treasures and floated beside him.<br/><br/>Among the three treasures, one was called the illusionary water moon, one was called Kong Ming, and the other was a paper figurine!<br/><br/>Illusionary Water Moon, Kong Ming, and paper figurine!<br/><br/>These three treasures were treasures that could allow one to escape quickly and avoid fatal injuries.<br/><br/>These treasures were only slightly lower in value than those that could be resurrected without any injuries.<br/><br/>They were even more valuable than treasures that could be resurrected!<br/><br/>“The illusionary flower and water moon can create a figure that looks exactly like itself on the spot. It has its own defensive power, and its main body is in an illusion. It can quickly escape! ”<br/><br/>“The illusionary flower and water moon can instantly turn into the illusionary realm. It can ignore any attacks and double its speed.”<br/><br/>“Paper man. Release thousands of paper men and flee to the surroundings.<br/><br/>Each paper man can be your real body! ”<br/><br/>Wang Xian introduced the three treasures in front of him!<br/><br/>As soon as he finished his sentence, all the powerhouses in the Heaven’s origin realm looked over at the same time.<br/><br/>“It seems that the Dragon King has obtained a lot of treasures this time. ”<br/><br/>The unity saint exclaimed in surprise!<br/><br/>Wang Xian smiled. He was indeed lucky.<br/><br/>In the six paths of the universe, his strength was not suppressed due to the fact that they were of the same origin.<br/><br/>He was attacked by Wang Xian when the other powerhouses in the Heaven’s origin realm were not paying attention to him. Hence, he could not use these treasures at all.<br/><br/>These treasures belonged to Wang Xian!<br/><br/>“The three treasures in the Dragon King’s hands are a little valuable. I have one here… ”<br/><br/>One by one, the Heaven’s origin powerhouses took out their treasures. The skeleton clan, the Celestial Nation, and the Divine Tiger clan also took out some treasures and gave an introduction.<br/><br/>“I have a treasure here. I want to exchange it for the Supreme Kong Ming<br/><br/>Treasure in your hands, Dragon King! ”<br/><br/>The twelve ancestral witches took out a treasure and wanted to trade it with Wang Xian.<br/><br/>This was a treasure that could be used for scouting. It could detect all kinds of energy around one’s body.<br/><br/>The scope of this scouting was very wide.<br/><br/>It also possessed a great scouting ability for other powerhouses.<br/><br/>The 12 ancestral sorcerers hid it for Wang Xian.<br/><br/>Wang Xian discovered that he could detect it even if he hid his own body.<br/><br/>In addition, with the Heaven’s gift that possessed the ultimate treasure of Tianyuan and the concealment method of the ultimate treasure of Tianyuan, he could still detect it from more than 10,000 meters away.<br/><br/>One had to know that one would not be able to discover the condition of Tianci’s body unless they were dozens of meters away.<br/><br/>After Wang Xian saw this effect, he immediately made a deal with tianci.<br/><br/>Investigative treasures were extremely useful!<br/><br/>For the other two treasures, Wang Xian exchanged some fragments of the Elemental God and a treasure from the technological universe.<br/><br/>The treasure from the technological universe was a blueprint, the blueprint of the Universe Destroyer.<br/><br/>According to the blueprint, according to some scientific knowledge, a powerful cosmic destroyer could be created.<br/><br/>The Cosmic Destroyer had the ability to destroy the peak of the universe’s ruler.<br/><br/>There were many universes, and there were all kinds of them.<br/><br/>Naturally, there were universes that focused on technology. As for the technological universe, a powerful warship could destroy the destiny of the heaven.<br/><br/>It was incomparably powerful!<br/><br/>The blueprint of this cosmic destroyer was stored in an Al!<br/><br/>It contained all the knowledge of the construction of the cosmic destroyer.<br/><br/>Wang Xian hesitated for a moment before making the deal.<br/><br/>He asked Lin Wenluo, the fire hammer clan and Wu Sha from the Dragon Palace to study it.<br/><br/>Currently, the Fire Hammer clan was the auxiliary branch of the Dragon Palace. Their combat strength was relatively weak, but they were still very talented in forging and research.<br/><br/>Along with Lin Wenluo, Wu Sha, and the others, they had studied many treasures.<br/><br/>Sometimes, the sky array and the Dragon Wizards would also participate in their research.<br/><br/>Wizards were also different scientists who specialized in magic.<br/><br/>The technological universe was a very powerful universe. Warships bombarded saints and analyzed all kinds of energy, so their strength was extraordinary!<br/><br/>Soon, the trade fair ended.<br/><br/>The Heaven Creation Realm powerhouses were also very satisfied. The skeleton clan had also obtained some good treasures.<br/><br/>“It’s time for a breakthrough! ”<br/><br/>Wang Xian returned to the Dragon Palace and looked at the resources in his hands with a smile.<br/><br/>This trade fair was enough to raise his strength.<br/><br/>First, he called Prime Minister Gui over and handed the other five corpses to him so that the disciples of the Dragon Palace could absorb and improve rapidly.<br/><br/>Following that, he began to devour the resources.<br/><br/>As time passed, the energy in Wang Xian’s body was increasing rapidly.<br/><br/>With the improvement of his dragon energy, his strength was also increasing bit by bit.<br/><br/>The nine-colored radiance filled the entire Dragon King Hall.<br/><br/>Above the dragon scales, there were faint divine dragons flying.<br/><br/>Wang Xian’s enormous body was filled with endless majesty!<br/><br/>“Ding, Congratulations on your upgrade to level 8 of the Universe Overlord. ”<br/><br/>“Ding, Congratulations on your breakthrough to level 8 of the nine-origin<br/><br/>Dragon Realm. ” Name: Wang Xian Race: Nine-origin Divine Dragon (man-dragon unity)<br/><br/>Level: Level 8 of the Universe Overlord (nine transformations Unity)<br/><br/>Origin: 1% (99% needed for the next breakthrough)<br/><br/>Supernatural ability: ruling the water tribe (ruling the water tribe below their level)<br/><br/>Devouring creatures (devouring creatures to extract origin)<br/><br/>Control of the five elements<br/><br/>Cultivation Method: Divine Dragon Transformation<br/><br/>Divine ability: soul-absorbing, spirit-attaching<br/><br/>Law Divine Ability: Dragon Eye Lock, Five Elements Dragon Claw, Yin-yang realm-breaking, eight luminaries dragon scale, Sacred Dragon Shadow,<br/><br/>Heavenly Dragon Eight Tribes, Dragon Tomb, Cloud Dragon Rising, True<br/><br/>Dragon Body<br/><br/>Law aspect: eight dragon pillars, eight dragon avatars, towering dragon horns,<br/><br/>Mighty Heavenly Dragon, God’s tail playing Pearl, Life Dragon Breath, Shadow Dragon Avatars, dark dragon chasing, Dark Dragon Transformation, wind and Thunder Dragon Birth, Mad Dragon Star Explosion!<br/><br/>Domain: Nine Origins Dragon Realm<br/><br/>Control Law: metal, wood, water, fire, Earth, light, dark wind and thunder<br/><br/>Divine Kingdom: Dragon Palace Dragon Palace: Innate.<br/><br/>Dragon Palace members: 8060450<br/><br/>Boom<br/><br/>As the system’s voice rang out, Wang Xian’s body emitted an even more majestic aura as he charged towards his surroundings!<br/><br/>Wang Xian slowly opened his eyes. There was a pair of pupils, one yin and one Yang.<br/><br/>The dragon horns on his head were also a yin and a Yang. It was extremely strange!<br/><br/>However, it was extremely holy!<br/><br/>Wang Xian looked at his attributes in his mind and a smile appeared on his face!<br/><br/>He tried to sense his own strength. It was much stronger than before.<br/><br/>The Heaven’s origin creation, the control level!<br/><br/>In the universe, Wang Xian’s strength was considered very strong!<br/><br/>Even if he used all his trump cards, those at the Great Dao level might not be able to kill him.<br/><br/>Wang Xian’s body moved and transformed into a human form.<br/><br/>The Tai Chi Dragon Disc and the Five Elements Millstone flew out and the Tai Chi Dragon Disc transformed into a black dragon cannon.<br/><br/>The uninitiated holy wings on his back transformed into a wind and Thunder Divine Dragon Windbreaker!<br/><br/>Sensing his current appearance, Wang Xian nodded his head in satisfaction.<br/><br/>Very cool, very cool!<br/><br/>Very Majestic!<br/><br/>“I’ll make a trip to the sword and Magic Universe. I’ll give the three spatial attribute corpses to my void dragon body, so that it can reach the Heaven’s origin realm as soon as possible! ” Wang Xian pondered in his heart..\t\t\t\t\t\t</div>", "images": {}, "success": true}