{"id": 1189, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074482.html", "title": "Chapter 4192 - Chapter 4192: 4191 Met Another Expert Who Believed In The Universe", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4192 - Chapter 4192: 4191 Met Another Expert Who Believed In The Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4192: 4191 met another expert who believed in the universe<br/><br/>Translator: 549690339<br/><br/>Buzz<br/><br/>“It seems that the Dragon King’s strength has really improved by a lot. He entered the chaos without any scruples. ”<br/><br/>“The current Dragon King poses a great threat to me. I really don’t understand how the Dragon King managed to cultivate. How is it possible for him to break through so quickly?”<br/><br/>“We are still too weak. With the help of an expert like the Dragon King, it is also a good thing for us.”<br/><br/>At the periphery of the sword and magic universe, Liu Lan and Wang Xian watched Wang Xian enter the chaos with a look of amazement on their faces.<br/><br/>At the same time, they were also somewhat helpless.<br/><br/>As their own universe, they had no way to deal with the covetous people outside.<br/><br/>The calamity was about to arrive, but they had no way to deal with this disaster.<br/><br/>Wang Xian did not know what Liu Lan and the rest were thinking.<br/><br/>Even if he knew, he didn’t care!<br/><br/>After entering the chaos, Wang Xian scanned his surroundings and flew in one direction.<br/><br/>Based on what Liu Lan and Hopeless Heaven said, they felt that the place they were spying on was in another place!<br/><br/>Wang Xian entered the chaos from another direction and flew toward the place they mentioned.<br/><br/>The universe was very big. Wang Xian flew along the edge of the universe at a fast speed.<br/><br/>He scanned his surroundings and kept sensing.<br/><br/>At the same time, he took out the investigative treasure that he had traded with the twelve ancestral warlocks and looked at the situation above.<br/><br/>There was no sun or moon in the chaos. After flying for a few years, Wang Xian suddenly stopped and looked at the investigative treasure in his hand.<br/><br/>This investigative treasure was a gray piece in the chaos.<br/><br/>However, at this moment, other energy light spots suddenly appeared at the edge.<br/><br/>It was a white energy light spot. This white color was very strange. It was not a white light with the light attribute.<br/><br/>“A special attribute? There’s only one. The energy shows that it’s an existence at the control level. ”<br/><br/>Wang Xian read the information and mumbled.<br/><br/>An expert at the control level indeed had the ability to covet the Sword and the Magical Universe!<br/><br/>Wang Xian concealed his figure and inched forward bit by bit!<br/><br/>After flying for more than ten minutes, he looked ahead in astonishment!<br/><br/>There was a huge white building altar in front of him.<br/><br/>The white building was placed in a special position. It was obvious that it was an altar.<br/><br/>Waves of energy were resisting the erosion of the power of Chaos!<br/><br/>The entire altar area was extremely huge. It was comparable to a huge city.<br/><br/>Buzz<br/><br/>When Wang Xian arrived, a huge pupil suddenly rose in the sky above the white building.<br/><br/>The pupil looked in Wang Xian’s direction.<br/><br/>There was an illusory figure below the huge pupil.<br/><br/>The figure stared at Wang Xian coldly.<br/><br/>When Wang Xian saw that he had been discovered, he raised his eyebrows slightly.<br/><br/>However, he did not move.<br/><br/>“The power of faith, is it the power of faith in the Universe?” Wang Xian sensed this energy and thought to himself. “Fellow saint, May I know why you are spying on Me?”<br/><br/>The illusory figure stared at Wang Xian and asked faintly.<br/><br/>“Are you planning to set up the sword and the Magic Universe next to you?” Wang Xian stared at him and asked in return.<br/><br/>“HMM? Are you also planning to set up the sword and the Magic Universe?”<br/><br/>The illusory figure also asked in return. “I’m going to take a look around! ”<br/><br/>Wang Xian answered his question.<br/><br/>“That’s best. We shall not interfere in each other’s business! ”<br/><br/>The illusory figure said calmly!<br/><br/>Wang Xian nodded his head and left immediately.<br/><br/>As he flew into the distance, Wang Xian could sense that the huge pupil was looking at him.<br/><br/>He had a feeling that he was being spied on.<br/><br/>After flying for a whole day, the feeling of being spied on finally disappeared.<br/><br/>“This prying energy of the belief universe is really amazing!”<br/><br/>Wang Xian mumbled.<br/><br/>The scope of this probing was extremely bright.<br/><br/>No wonder he could directly probe into the sword and Magic Universe.<br/><br/>“That expert from the belief universe is at the control level. I wonder if he is the only one or if there are more of them. Looks like the belief universe has its eyes on the sword and Magic Universe. ”<br/><br/>Wang Xian spoke and did not continue to probe further. Instead, he flew towards the sword and Magic Universe!<br/><br/>According to Liu Lan and the rest, they only felt that they were being spied on in this direction.<br/><br/>Therefore, Wang Xian did not go anywhere else.<br/><br/>The universe was so big that it would take at least tens of thousands of years to fly around and investigate everything.<br/><br/>Wang Xian did not have that much time.<br/><br/>After entering the universe of swords and magic, Wang Xian sent a message to Liu Lan and Wang Xian.<br/><br/>Very soon, Liu Lan and Wang Xian came up to him!<br/><br/>“Dragon King, did you find anything?”<br/><br/>The two of them asked Wang Xian with hopeful expressions.<br/><br/>“Yes, there are heaven origin creation stage powerhouses who have faith in the universe and are controlling the sword and Magic Universe!”<br/><br/>Wang Xian nodded and replied!<br/><br/>“Heaven origin creation stage powerhouses who have faith in the universe and are controlling the universe? This… ”<br/><br/>Wang Xian’s expression changed slightly. He looked at Wang Xian and said,<br/><br/>“Dragon King, how many powerhouses are there?”<br/><br/>“I don’t know the exact number. I only saw one. ”<br/><br/>Wang Xian shook his head and said, “You guys know about the strength of the belief universe, right?”<br/><br/>“I know a little. The belief universe is a very powerful universe. During the last calamity, they conquered a universe. Although they won’t massacre everyone in the universe, they can change a person’s mind and make them believe in them. ”<br/><br/>Hopelessness heaven nodded and said with an embarrassed expression.<br/><br/>“Yes, the belief universe is not weak. Not long ago, our nine-origin universe fought with them in the starry universe. Of course, it was just a fight between ordinary disciples. When the cosmic calamity is about to arrive, if there are no special circumstances in our nine-origin universe, I will come over.”<br/><br/>Wang Xian spoke to them.<br/><br/>“Dragon King, your nine-origin universe is so strong. There shouldn’t be any problems, right?”<br/><br/>Liu Lan opened her mouth and couldn’t help but ask.<br/><br/>(‘I’m not sure either. ”<br/><br/>Wang Xian shook his head. “But I can guarantee that my void dragon body will be in your universe for the time being. If we work together, a control-level person can still be expelled. ”<br/><br/>Hopeless heaven and Liu Lan nodded their heads.<br/><br/>They were also very helpless as they didn’t have any good ideas.<br/><br/>Now that time was so short, they could only place their hopes on Wang Xian. Wang Xian didn’t stay in the sword and magic universe for too long. After that, he returned to the tree of chaos.<br/><br/>“Next, I have to prepare for the calamity!”<br/><br/>Wang Xian sat on the dragon throne and muttered.<br/><br/>The weak universe had already been surrounded by the powerful fate of the Heaven’s origin and began to lay out a plan.<br/><br/>His cold gaze was already staring at the flesh and blood and the resources inside!<br/><br/>Wang Xian also needed to continue to become stronger. The Dragon Palace also needed to continue to become stronger.<br/><br/>Apart from that, before the arrival of the calamity, Wang Xian wanted to resolve one thing.<br/><br/>The matter of the Phoenix clan.<br/><br/>He had to end it before the arrival of the calamity!\t\t\t\t\t\t</div>", "images": {}, "success": true}