{"id": 1190, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074486.html", "title": "Chapter 4193 - Chapter 4193: 4192 Heavenly Bestowal Breakthrough", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4193 - Chapter 4193: 4192 Heavenly Bestowal Breakthrough</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4193: 4192 heavenly bestowal breakthrough<br/><br/>Translator: 549690339<br/><br/>Disturbing the external world must first settle the internal world!<br/><br/>The feud between the Phoenix clan and the Dragon Palace must be resolved!<br/><br/>Wang Xian closed his eyes.<br/><br/>Currently, the only way to improve his strength was to have the body of the void God Dragon.<br/><br/>Currently, Wang Xian and the body of the Void God Dragon were comprehending the power of space together.<br/><br/>This could speed up the improvement of his clone’s realm.<br/><br/>Over at the Dragon Palace, due to the huge amount of resources that Wang Xian brought, the speed of the improvement of the disciples of the Dragon<br/><br/>Palace had increased by a lot.<br/><br/>Especially in the aspect of high-end combat strength.<br/><br/>With the corpses of four heaven origin blessed powerhouses, the speed of the birth of top-notch powerhouses in the Dragon Palace was also increasing.<br/><br/>In addition, the two elemental gods had already turned into a paradise.<br/><br/>The twelve ancestral wizards had already made preparations for this.<br/><br/>This also gave the Dragon Palace an additional top-notch training ground!<br/><br/>The blessed land that the elemental gods were born in was the best!<br/><br/>As time went by, the number of experts in the Dragon Palace increased.<br/><br/>One hundred million years later, Wang Xian’s void dragon body had reached the peak of the Universe Overlord realm. He was officially stepping into the Heaven’s origin blessed realm!<br/><br/>Time passed quickly.<br/><br/>Two hundred million years passed quickly.<br/><br/>“Tianci, how long will it take for you to break through?”<br/><br/>On this day, in the Dragon King’s Hall of the Dragon Palace, a group of people was eating delicacies on a big table.<br/><br/>Shu Qing and the other girls included Hua er, Cai’er, Xiao Yu, and Feng Lingtian.<br/><br/>There was also Tianci and his mother, Mu Liyin’er.<br/><br/>This was a family banquet!<br/><br/>Such a family banquet would only be held once every million years!<br/><br/>This was also a decision made by Guan Shuqing and the other girls as well as Xiao Yu.<br/><br/>They could not cultivate for too long. The members of the family had to get together frequently!<br/><br/>Wang Xian naturally had no objections. He asked Tianci.<br/><br/>As Wang Xian’s foster son, Guan Shuqing and the rest quickly accepted the fact that they suddenly had another foster son.<br/><br/>“Foster father, it will take at most a few tens of millions of years. I will be able to achieve a breakthrough soon. By then, the divine tree in my body will have reached its maturity stage! ”<br/><br/>TIANCI said, “At the tree of chaos, my cultivation speed is very fast. The growth rate of the divine tree in my body is also very fast! ”<br/><br/>“HMM, if you want to achieve a breakthrough, you have to go back to the six paths universe. There are no more slots in the nine-origin universe. ”<br/><br/>Wang Xian nodded and looked at Lan Qingyue. “Qingyue, does Xiao Lan and the rest have a chance to make a breakthrough?”<br/><br/>Currently, Xiao Lan and the rest were still in the starry universe.<br/><br/>With the cultivation of the Dragon Palace’s resources, their current strength had already reached the peak of the universe’s ruler.<br/><br/>“It’s very difficult. There are no more spots in the starry universe. If Xiao Lan and the rest want to make a breakthrough, they have to enter other universes with special bloodline energy. However, there aren’t many such universes! ”<br/><br/>Lan Qingyue spoke and then smiled. “However, it doesn’t matter. You are in the Dragon Palace now. It doesn’t matter whether we break through or not. ”<br/><br/>Wang Xian heard it and shook his head with a smile.<br/><br/>Only the strong ones in the Heaven’s origin realm could live forever.<br/><br/>Otherwise, their lifespan would be exhausted!<br/><br/>Wang Xian would think of a way to elevate all of them to the Heaven’s origin realm.<br/><br/>“Brother, is the ancestral tree about to reach its maturity stage?” Xiao Yu asked Wang Xian from the side.<br/><br/>“Yes, soon. It will probably mature in a few hundred million years.”<br/><br/>Wang Xian nodded his head.<br/><br/>After the ancestral tree had completely reached its maturity stage, Wang Xian’s strength could increase a little more.<br/><br/>“Oh right, when Xiao Tianci makes his breakthrough, let’s go to the six paths universe to have some fun. We haven’t gone on a trip for a long time and are tired of the nine-origin universe. Let’s go to the six paths universe to have some fun!”<br/><br/>“When Little Tianci breaks through, we can give him a chance. In the future, he will have to live in the six paths universe most of the time. We Can’t let others bully him! ”<br/><br/>Guan Shuqing suddenly said.<br/><br/>“That’s fine. We haven’t gone to other places for a long time. The six paths universe is a universe that we haven’t been to before. It’s a brand new world. It’s definitely very fun, and there’s definitely a lot of delicious food! ”<br/><br/>The group of girls began to agree!<br/><br/>Their faces were filled with anticipation.<br/><br/>“That’s fine. The six treasured lands of our six paths universe are all very unique. The food and scenery are also completely different from the nine-origin Universe! ”<br/><br/>Mu Liyin ‘er smiled and said to them, “When the time comes, I can bring my sisters around. ”<br/><br/>During this period of time, Mu Liyin ‘er had gotten familiar with Guan Shuqing and the others.<br/><br/>Although their relationship was not too deep, it was still pretty good.<br/><br/>As Heaven’s Gift’s mother, Mu Liyin ‘er was given a lot of resources from the dragon palace in terms of cultivation, including some faith hearts.<br/><br/>This allowed Mu Liyin’er’s current strength to reach the sixth level of a universe overlord. Her improvement could be said to be extremely terrifying!<br/><br/>There was nothing she could do. The Dragon Palace had Wang Xian and Lin Niu.<br/><br/>In addition to the Tianyuan creation treasure in Tianci’s body, the Dragon Palace had two complete Tianyuan creation treasures.<br/><br/>In addition to the large number of treasures, it was still very easy to nurture a person.<br/><br/>“Alright, let’s take a good look around and let tianci have a firm foothold in the six paths universe. ”<br/><br/>Wang Xian nodded with a smile and agreed.<br/><br/>The strength of the six paths universe was not weak, especially the strength of the undead.<br/><br/>He was able to summon three terrifying existences at the Heaven’s origin creation level.<br/><br/>His strength was equivalent to Wang Xian who did not use the five elements Millstone and the Tai Chi Dragon disc at the moment.<br/><br/>Ot course, the recovery energy of the ancestral tree had to be used.<br/><br/>If Tianci stepped into the Heaven’s origin creation level and borrowed the Heaven’s origin creation treasure, his strength would be about the same as the undead.<br/><br/>As for the Golden Leopard and sand city in the six paths universe, they were both at the beginner level.<br/><br/>After the discussion, they continued to chat for a while before continuing to cultivate and have fun.<br/><br/>Tianci, on the other hand, continued to cultivate.<br/><br/>Time passed day by day. Tens of millions of years passed very quickly.<br/><br/>“Foster father, I can break through! ”<br/><br/>From the tree of Chaos, Tianci flew towards Wang Xian with an excited expression.<br/><br/>He had cultivated here for more than 200 million years. He felt that he could step into the legendary realm at any time.<br/><br/>Although his adoptive father had always told him that he could easily step into the destiny realm of the Heaven’s origin.<br/><br/>However, he was still extremely excited at this moment!<br/><br/>“Can I break through?”<br/><br/>Wang Xian opened his eyes and looked at the excited tianci. He flew over and patted his shoulder!<br/><br/>Since that’s the case, let’s return to the six paths universe and prepare to break through! ”<br/><br/>Wang Xian said to him.<br/><br/>It was very easy for Tianci to break through.<br/><br/>This did not mean that one could easily break through to the Tianyuan blessed realm after obtaining the ultimate treasure of the Tianyuan blessed realm. This was because the ultimate treasure of the Tianyuan blessed realm and<br/><br/>Tianci had merged into one.<br/><br/>They were born as one!<br/><br/>It was also because of this that Wang Xian was envious of him back then.<br/><br/>He was born extraordinary. Even if he didn’t cultivate, he could still reach the Tianyuan Destiny Realm.<br/><br/>As for the other powerhouses who obtained the ultimate treasure of Tianyuan, they also needed to break their own shackles.<br/><br/>They couldn’t be compared to Tianci at all!<br/><br/>With TIANCI’s breakthrough, there would be one more powerhouse for Wang Xian in the future!\t\t\t\t\t\t</div>", "images": {}, "success": true}