{"id": 1193, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074498.html", "title": "Chapter 4196 - Chapter 4196: 4195 Burning Fruit", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4196 - Chapter 4196: 4195 Burning Fruit</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4196: 4195 burning fruit<br/><br/>Translator: 549690339<br/><br/>“Rumble!”<br/><br/>“Rumble!”<br/><br/>The Rumble of the six universes resounded through the sky above the grassland!<br/><br/>An ancient god tree with a powerful aura took root in the void.<br/><br/>It swayed its branches.<br/><br/>Tianci stood below the ancient god Tree and stepped on its branches.<br/><br/>Endless Wood elemental energy gathered around him.<br/><br/>The energy in TIANCPs body was increasing crazily.<br/><br/>At the same time, the ancient god Tree behind him was also growing rapidly.<br/><br/>This ancient god Tree needed to borrow the power of the universe and the energy absorbed by Tianci’s breakthrough to reach its maturity.<br/><br/>The vast divine tree seemed to have stood between heaven and Earth since ancient times.<br/><br/>The projection turned into a real object.<br/><br/>Below, all the powerful disciples felt this power, and their faces were filled with reverence.<br/><br/>Some wood element cultivators even knelt on the ground and closed their eyes to absorb the wood element energy between heaven and earth.<br/><br/>Wang Xian watched this scene quietly and quietly felt the process of Tianci’s breakthrough.<br/><br/>The strong cultivators from the Dragon Palace also watched quietly.<br/><br/>Buzz<br/><br/>Not long after, the ancient god tree behind Tianci suddenly started to shake.<br/><br/>The entire tree started to grow.<br/><br/>Two brand new branches appeared on the top of the Tree of God, one on the left and one on the right.<br/><br/>One of the two branches circled around the city while the other was filled with sharp thorns!<br/><br/>Wang Xian looked at the two newly grown branches and his eyes flickered slightly.<br/><br/>Following that, in the middle of the tree, at the main trunk, fruits began to grow.<br/><br/>Eight fruits appeared and two of them began to ripen rapidly!<br/><br/>“It’s about to reach maturity! ”<br/><br/>Wang Xian muttered as he looked at the transformation of the divine tree, the ultimate treasure of the Heaven’s origin.<br/><br/>He moved his palm and the immortal slaying calabash, which had been on the ancestral tree, flew towards the divine tree behind tianci.<br/><br/>Following that, Wang Xian looked at some of the branches on the ancestral tree.<br/><br/>The endless branches, the soul-returning branches, the parasol tree branches, the Fuchang tree branches, the Nirvana Lightning tree branches, and a black resurrection Lily all flew towards the ancient divine tree behind tianci. Each of the branches exuded a powerful and majestic aura and luster.<br/><br/>Each of them seemed to be a rare and extraordinary existence.<br/><br/>In the past, the endless parasol tree, the Fuchang tree, and the Nirvana Lightning tree were all branches at the level of a venerable.<br/><br/>However, because of the ancestral tree, they had evolved into the ruler realm.<br/><br/>The soul-returning wood and the immortal-slaying calabash were already at the ruler realm. Now, they were at the peak.<br/><br/>The immortal-slaying calabash was obtained by Wang Xian in the past. It was extremely powerful.<br/><br/>After his nurturing, the immortal sword in the immortal-slaying calabash could instantly kill a powerhouse at the peak of the ruler realm.<br/><br/>However, such a treasure was useless to him.<br/><br/>He gave it to Tianci because the ancient god Tree in Tianci’s body was an offensive heavenly yuan creation treasure.<br/><br/>As long as it was nurtured and rooted in the tree, the immortal-slaying Calabash’s power was only slightly weaker than the last two branches on the tree.<br/><br/>The other branches might not be as powerful.<br/><br/>As for the soul-returning wood, it was purely to increase some special methods and foundations.<br/><br/>One divine tree divine branch after another flew over.<br/><br/>The ancient God Tree extended a branch and accepted it before landing it on its own body.<br/><br/>The Tianyuan Destiny Supreme Treasure in Tianci’s body was very familiar with the ancestral tree in Wang Xian’s body.<br/><br/>Its body also had the aura of the ancestral tree.<br/><br/>The ancestral tree leaned towards supporting and nurturing!<br/><br/>The ancient god Tree in Tianci’s body was attacking!<br/><br/>Boom! Boom<br/><br/>As the ancient god Tree matured, the energy in Tianci’s body also received a huge boost.<br/><br/>His body gradually turned towards the Heaven’s origin creation!<br/><br/>Along with a boom, the shackles were broken.<br/><br/>Tianci, who was standing under the ancient God Tree, opened his eyes and smiled!<br/><br/>He looked at Wang Xian’s position.<br/><br/>“Hualala!”<br/><br/>The ancient god Tree behind him swayed its branches. The eight fruits on the trunk, one of the two that had matured, flew towards Wang Xian!<br/><br/>“A fruit that was born from the ultimate treasure of the Heaven’s origin, this… ”<br/><br/>Around them, the spirits of the dead and the rest were staring at this fruit with burning eyes. Their breathing was a little hurried!<br/><br/>This was a priceless treasure!<br/><br/>This kind of fruit definitely had a terrifying effect!<br/><br/>However, they didn’t dare to snatch it!<br/><br/>Wang Xian stretched out his hand and grabbed the fruit to sense it.<br/><br/>“After consuming the burning fruit, a burst of wood elemental energy will erupt from the body to form a forest. The forest will cover a certain area. Within this area, only by destroying all the trees can one kill the person who consumed the burning fruit. ”<br/><br/>“Within this area, if one is injured, one can consume the trees in the forest and heal their injuries! ”<br/><br/>Wang Xian mumbled as he sensed the information regarding the burning fruit.<br/><br/>He could not tell how strong the burning fruit was just from some information.<br/><br/>However, as a divine tree of Heaven’s origin, it could only bear eight fruits in its lifetime.<br/><br/>Its power must be extremely terrifying!<br/><br/>The ancient divine tree was different from the ancestral tree in terms of offensive power.<br/><br/>The ancestral tree could bear dozens of fruits of Heaven’s origin!<br/><br/>“Foster father, mother, I’ve broken through! ”<br/><br/>Tianci sensed the energy in his body and smiled at Wang Xian and the rest.<br/><br/>His body moved and he flew over immediately!<br/><br/>“Congratulations to nephew Mu Litianci for breaking through to the realm of Heaven’s origin! ”<br/><br/>The undead golden leopard sand city immediately congratulated loudly!<br/><br/>“Congratulations to Lord Mu Litian for breaking through to the Heavenly Yuan realm of Destiny!”<br/><br/>“We pay our respects to Lord Mu Litian! ”<br/><br/>Below, all the elite disciples immediately knelt on the ground and congratulated loudly, bowing and bowing!<br/><br/>“Mm, I, Mu Litian, the six beings of the universe, will definitely protect us, the people of the Universe! ”<br/><br/>TIANCI’s gaze focused as he swept his gaze across all the powerful disciples and said solemnly!<br/><br/>This was the responsibility of a heavenly Yuan creation stage powerhouse!<br/><br/>It was also the responsibility of a heavenly Yuan creation stage powerhouse!<br/><br/>(‘We worship Lord Mu Litianci as our faith. We will fight alongside Lord Mu<br/><br/>Litianci and protect our home! ”<br/><br/>Below, all the powerful disciples ‘eyes were burning as they roared loudly in their hearts!<br/><br/>This was the recognition of all living beings towards their own universe.<br/><br/>This was the unity of their beliefs towards the future before the arrival of the calamity!<br/><br/>“Haha, Our Six Paths Universe has gained a top-tier heavenly yuan destiny realm powerhouse. This is the great fortune of our six paths universe. Inform all the tribes to celebrate! ”<br/><br/>Earth Sand City laughed loudly and announced loudly!<br/><br/>“Yes, Sir! ”<br/><br/>Below, disciples immediately responded!<br/><br/>“Let’s go, this time, we have to celebrate properly! ”<br/><br/>Golden Leopard said with a smile.<br/><br/>The breakthrough given by the heavens was also a good thing for them.<br/><br/>When the apocalypse came, their pressure would be much less.<br/><br/>Under the circumstances where they could protect their own universe, they could also go to other universes to search for resources and opportunities.<br/><br/>This was the law of the apocalypse.<br/><br/>The strong preyed on the weak.<br/><br/>The weak protected their own universe, while the strong went out to plunder!<br/><br/>It was cruel!\t\t\t\t\t\t</div>", "images": {}, "success": true}