{"id": 1195, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074506.html", "title": "Chapter 4198 - Chapter 4198: 4197’S Strength Had Greatly Increased. It Was A Peeping Tom!", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4198 - Chapter 4198: 4197’S Strength Had Greatly Increased. It Was A Peeping Tom!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4198: 4197’s strength had greatly increased. It was a peeping tom!<br/><br/>Translator: 549690339<br/><br/>The improvement of the ancestral tree was a big deal for Wang Xian.<br/><br/>Especially with the four mature mother-embryo fruits.<br/><br/>The value and importance of the mother-embryo fruits were too high!<br/><br/>Wang Xian gave one of the four fruits to the unicorn ox.<br/><br/>The Unicorn Ox was one of his own.<br/><br/>“Next, it’s time to wait for the improvement of the Void Dragon God! ” Wang Xian mumbled.<br/><br/>Once the Void Divine Dragon made a breakthrough, Wang Xian’s strength would reach a whole new level.<br/><br/>The space attribute was a powerful attribute to begin with.<br/><br/>A newly-advanced space-based heaven-origin creator was comparable to the two weakest heaven-origin creator powerhouses with other attributes.<br/><br/>They were at the same level and could fight against opponents of a slightly higher level.<br/><br/>Once the Void Divine Dragon’s body made a breakthrough, Wang Xian’s own strength and the Five Elements Tai Chi Dragon Disc’s strength would be comparable to an existence at the level of Great Dao.<br/><br/>Against an existence at the level of the Great Dao, such strength was considered to be the strongest existence in all the major universes.<br/><br/>“There’s still time!”<br/><br/>A smile appeared on Wang Xian’s face. He waited quietly and cultivated quietly.<br/><br/>The following years were peaceful!<br/><br/>Even the Heaven’s origin creation powerhouses from the nine-origin universe returned one by one. They began to use the last bit of time to nurture their disciples.<br/><br/>The various races were also improving at a terrifying speed.<br/><br/>Time passed quickly.<br/><br/>With the appearance of the tree of chaos, the strength of the nine-origin universe was much stronger than before. Especially the number of ruler-level experts.<br/><br/>They had improved greatly.<br/><br/>After all, the surroundings of the tree of chaos were comparable to the top-tier Grotto-heavens!<br/><br/>In the past, there was only one top-tier grotto-heaven blessed land of the various peak races, at most two.<br/><br/>These two grotto-heaven blessed lands could only allow some core elite disciples to cultivate for a maximum of a hundred million years.<br/><br/>Unlike now, the entire nine-origin universe’s elite disciples could cultivate here for more than two billion years.<br/><br/>These two billion years could make the nine-origin universe much stronger.<br/><br/>Buzz<br/><br/>When the body of the Void Dragon had finished absorbing the corpses of the three heaven origin creation powerhouses, he had yet to make a breakthrough.<br/><br/>Wang Xian brought the body of the Void Dragon to the tree of chaos.<br/><br/>He absorbed energy here and began his cultivation.<br/><br/>The tree of chaos contained all kinds of energy. It was much faster for the body of the Void Dragon to cultivate here than in the sword and Magic Universe.<br/><br/>Time passed by little by little.<br/><br/>Hundreds of millions of years passed by quickly as well!<br/><br/>On this day, Wang Xian opened his eyes. A terrifying spatial energy surged out from his body.<br/><br/>Ripples appeared in the surrounding space.<br/><br/>The entire world was like a mirror.<br/><br/>“I can feel it. This shackle can be easily opened. Pm about to break through! ” A Ray of light shot out from Wang Xian’s eyes.<br/><br/>Wherever this ray of light passed, a thin and long spatial crack appeared!<br/><br/>Wang Xian could feel that his void dragon body had touched another realm!<br/><br/>Another realm was behind a mirror.<br/><br/>He could break this mirror easily.<br/><br/>However, he could feel that he was still some distance away from that mirror!<br/><br/>This mirror seemed to be in another void.<br/><br/>This was because of the quota.<br/><br/>It was impossible to make a breakthrough in the Chaos!<br/><br/>To enter the universe, this universe had to have this quota!<br/><br/>Wang Xian’s figure moved and he immediately returned to the Dragon Palace.<br/><br/>He followed closely behind him and flew into the sword and Magic Universe.<br/><br/>Buzz<br/><br/>When he arrived at the sword and Magic Universe, the Void Dragon body immediately flew over!<br/><br/>“Liu Lan, Brother Wangtian, I’m about to break through!”<br/><br/>When Wang Xian arrived at the sword and Magic Universe, he immediately sent a message to Liu Lan Wangtian!<br/><br/>Following that, the body of the Void Dragon flew to the sky.<br/><br/>“Roar! Roar!”<br/><br/>The body of the Void Dragon let out a roar and transformed into a divine dragon that looked like nothing.<br/><br/>As if there were no clouds in the sky, the body of the Void Dragon could not be seen.<br/><br/>The surroundings were pitch-black. Instead, one would be able to see a void dragon that looked like an illusion.<br/><br/>The gigantic divine dragon let out a roar that reverberated throughout the world.<br/><br/>Waves of spatial attributes surged into the body of the Void Dragon!<br/><br/>Wang Xian’s actual body was watching quietly from the side.<br/><br/>For this breakthrough, Wang Xian only informed Liu Lan and the hopeless sky.<br/><br/>He did not make a breakthrough at the center of the Sword and Magic Universe!<br/><br/>He was not prepared to cause too much of a stir.<br/><br/>After all, Wang Xian did not belong to the sword and Magic Universe.<br/><br/>Buzz Buzz<br/><br/>When the Void Dragon Body began to make a breakthrough, Liu Lan and Wang Xian rushed over through the teleportation formation at the side.<br/><br/>This place was at the edge of the sword and Magic Universe. However, as this place was connected to the nine-origin universe, Liu Lan and Wang Xian had set up a teleportation formation here.<br/><br/>It was also convenient for Wang Xian to teleport over quickly.<br/><br/>“Dragon King, is this avatar of yours about to make a breakthrough?”<br/><br/>Liu Lan, hopelessly sky, flew over and looked at the location of the Void Divine Dragon Avatar. He asked with a burning gaze!<br/><br/>Wang Xian smiled and nodded. He watched quietly.<br/><br/>“Congratulations, Dragon King! Congratulations, Dragon King! ”<br/><br/>Liu Lan, hopelessly sky, and the rest congratulated him immediately with faces full of envy!<br/><br/>Wang Xian nodded with a smile and quietly felt the process of his breakthrough.<br/><br/>He entered the universe of Swords and magic. Wang Xian could sense that the mirror was right in front of him.<br/><br/>He only used a little energy to break the mirror.<br/><br/>In the next moment, he was in a brand new realm.<br/><br/>The surrounding majestic energy surged towards him.<br/><br/>The power of space gathered in his body.<br/><br/>All sorts of deeper insights regarding the power of space surged into his mind.<br/><br/>“Ding! Congratulations to host for breaking through to the Heavenly Yuan blessed realm with the body of the Void Divine Dragon!” The system’s voice rang out, but Wang Xian ignored it.<br/><br/>All sorts of spatial attribute attacks appeared in his mind.<br/><br/>This made his eyes sparkle.<br/><br/>When one reached the Heavenly Yuan blessed realm, what they competed in was the control of space, the control of space.<br/><br/>They would also be competing in the control of the surrounding space!<br/><br/>With a casual wave of his hand, he would be able to unleash a powerful attack.<br/><br/>Buzz<br/><br/>Just as Wang Xian was quietly sensing, he suddenly felt as if he was being spied on!<br/><br/>Wang Xian felt something in his heart. From his senses, in the distant chaos, there was a huge pupil looking in his direction!<br/><br/>This made him frown slightly. With a thought, his main body immediately concealed his aura, completely concealing it.<br/><br/>The Tai Chi Dragon Disc and five elements great mill simultaneously concealed Wang Xian’s body.<br/><br/>His strength was not as strong as Wang Xian ‘s. With such a long distance between them, there was no difference between them!<br/><br/>At the side, Liu Lan and Wang Wangtian sensed this gaze. Their expressions changed and immediately turned gloomy.<br/><br/>He looked towards the location of the pupil. His gaze was filled with a sharp killing intent!<br/><br/>Wang Xian stood there quietly and didn’t look at the location of the pupil.<br/><br/>The body of the Void Divine Dragon in front of him was breaking through. His aura couldn’t be concealed at all!<br/><br/>A thought suddenly appeared in his mind!\t\t\t\t\t\t</div>", "images": {}, "success": true}