{"id": 1194, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074502.html", "title": "Chapter 4197 - Chapter 4197: The 4196 Ancestral Tree Had Matured And Its Strength Had Increased", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4197 - Chapter 4197: The 4196 Ancestral Tree Had Matured And Its Strength Had Increased</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4197: The 4196 ancestral tree had matured and its strength had increased<br/><br/>Translator: 549690339<br/><br/>Tianci had made a breakthrough!<br/><br/>This was a joyous occasion for the six paths universe.<br/><br/>It was also a joyous occasion for Wang Xian and the rest.<br/><br/>Tianci was a living creature from the six paths universe, but he was also Wang Xian’s adopted son.<br/><br/>He was also the Crown Prince of the Dragon Palace!<br/><br/>Tianci was also Wang Xian’s biological father!<br/><br/>Following that, the six paths universe celebrated Tianci’s breakthrough for more than ten years.<br/><br/>Wang Xian had nothing to do, so he accompanied the group of girls and began to tour the six paths universe.<br/><br/>Tianci had not been to many places, and he had not been to many places in the six paths universe.<br/><br/>He also followed Wang Xian and the group to tour the six paths universe!<br/><br/>This made Wang Xian and the rest completely relaxed.<br/><br/>The current Dragon Palace and its influence were no longer weak.<br/><br/>They even called for tianci. The influence of the Dragon Palace was already at the top level in the nine-origin universe!<br/><br/>Wang Xian now had the strength of a control-level entity while Tianci also had the strength of a control-level entity!<br/><br/>In addition to the Tai Chi Dragon Plate, the great mill of the five elements, and the Unicorn Ox in Wang Xian’s hands, the Dragon Palace was equivalent to having three existences at the control-level.<br/><br/>In addition, there were one or two existences at the beginner-level for the specific strength.<br/><br/>Meanwhile, three control-level experts would be able to fight against one great dao-level expert.<br/><br/>In other words, even if the demon race became enemies with the Dragon Palace, the Dragon Palace wouldn’t be afraid of their current strength!<br/><br/>Even if the fallen Shadow Demon Emperor made a move against Wang Xian and the rest, Wang Xian wouldn’t be afraid!<br/><br/>Of course, as an experienced expert, the fallen Shadow Demon Emperor should have more trump cards.<br/><br/>However, if he were to really deal with the Dragon Palace, he would harm himself and the enemy.<br/><br/>After all, Wang Xian and Tianci had the ultimate treasures of the Heaven’s origin!<br/><br/>Wang Xian and the rest had stayed in the six paths universe for over a hundred million years.<br/><br/>Over a hundred million years, they had visited almost every corner of the six paths universe!<br/><br/>It also made them completely relaxed!<br/><br/>After a hundred million years, Wang Xian and the rest returned to the Dragon Palace once again!<br/><br/>Tianci did not return. Instead, he began to settle some matters within the tribe in the six paths universe.<br/><br/>He began to improve the strength of the disciples in the tribe to deal with the upcoming calamity.<br/><br/>“There are 1.8 billion years left. The calamity is about to begin! ”<br/><br/>After returning to the Dragon Palace, Wang Xian estimated the time and muttered.<br/><br/>1.8 billion years. It was neither long nor short.<br/><br/>He began his closed-door cultivation.<br/><br/>He was helping the Void Dragon body to comprehend the power of space!<br/><br/>Now, Wang Xian still had two areas that he could improve on.<br/><br/>One was the void dragon body.<br/><br/>The other was the maturity of the ancestral tree.<br/><br/>The maturity of the ancestral tree was inevitable. All he had to do now was to wait!<br/><br/>It was hard to say how long it would take for the Void Dragon Body to achieve a breakthrough!<br/><br/>Time passed day by day.<br/><br/>Another 200 million years passed in the blink of an eye!<br/><br/>Ding! “Congratulations to the host, the ancestral tree, for completely maturing. ”<br/><br/>On this day, Wang Xian was cultivating in seclusion. Suddenly, he sensed a majestic life force surging into his body.<br/><br/>Following that, the system’s voice rang out abruptly.<br/><br/>This made him slightly stunned. Following that, his face was filled with a<br/><br/>smile.<br/><br/>The ancestral tree had finally broken through!<br/><br/>His body moved, and he immediately teleported into the Dragon Palace!<br/><br/>At the same time, with a thought, information about the ancestral tree appeared in his mind!<br/><br/>Ancestral Tree: Heavenly Fate<br/><br/>Branch: Soul-returning Wood Branch (ruler level, with the soul-returning fruit!)<br/><br/>Parasol tree branch (ruler level, the tree where the Phoenix resides, the<br/><br/>Phoenix Nest, the land of Nirvana!)<br/><br/>Endless Tree Branch (ruler level, with endless fruits, increasing the speed of fire attribute cultivators!)<br/><br/>Constant tree branch (ruler level, with the fruit of eternal birth, activating the intelligence of living beings!)<br/><br/>Nirvana tree branch (ruler level, with the fruit of nirvana, increasing the cultivation speed of thunder attribute cultivators!)<br/><br/>Black Resurrection Lily (ruler level, special flower, possessing mysterious and unfathomable abilities!)<br/><br/>Fruit: mother’s womb fruit (tianyuan-level, giving birth to 29 mother’s womb fruits, four are already ripe!)<br/><br/>Burning Fruit (unique!)<br/><br/>Abilities: 1. Able to revive all wood-related plants. As the ancestral tree’s energy level increases, it can increase the upper level of the branches.<br/><br/>Subsidiary: Ancient Lake Moon Bay (ruler-level, able to quickly recover from injuries, able to recover irreversible injuries.)<br/><br/>Wang Xian looked at the information and immediately came to the Dragon King’s Palace!<br/><br/>Looking at the ancestral tree behind the dragon throne in the Dragon King’s palace, Wang Xian smiled.<br/><br/>The lush ancestral tree was filled with endless vitality.<br/><br/>It had a completely different power compared to the heaven-bestowed divine tree of creation.<br/><br/>The ancestral tree seemed to be able to nurture all living things.<br/><br/>The various branches and fruits on it were emitting a majestic energy. This was especially so for the 29 fruits on the main trunk. Four of them had completely matured!<br/><br/>The mother’s womb fruit!<br/><br/>Wang Xian flew over and waved his arm. A mother’s womb fruit landed in his hand.<br/><br/>At the same time, a stream of information was transmitted into his mind.<br/><br/>The mother’s womb fruit could be swallowed into the body in advance.<br/><br/>When faced with the threat of death, it could erupt with a terrifying vitality. This vitality could continue to heal one’s injuries.<br/><br/>It would last until the energy was exhausted.<br/><br/>As for how long it would last, it would depend on the specific situation. Wang Xian would have to try it out himself.<br/><br/>However, the mother’s womb fruit had a terrifying effect. It could revive without any injuries.<br/><br/>Yes, after the mother’s womb fruit’s energy was exhausted.<br/><br/>After he was killed, he could revive in the dragon palace without any injuries.<br/><br/>After he was revived, he would still have his original strength without any losses.<br/><br/>This was not something that the soul-returning womb fruit could compare to.<br/><br/>This kind of resurrection treasure was extremely rare in all the universes.<br/><br/>It was extremely precious!<br/><br/>“The effects of this mother’s womb fruit are really powerful. It’s really terrifying! ”<br/><br/>Wang Xian’s eyes emitted a fiery glow.<br/><br/>Under such circumstances, he was not afraid of anyone. Even if he was dead, he could revive instantly!<br/><br/>Most importantly, there were a total of 29 such fruits on the ancestral tree! Compared to the fruits produced by the divine tree in Tianci’s body, there were many, many more.<br/><br/>Of course, the ancient divine tree in Tianci’s body had a terrifying boost to his strength!<br/><br/>This time, the ancestral tree had completely reached its maturity stage. It also gave Wang Xian’s recovery ability and physical strength a huge boost.<br/><br/>Previously, Wang Xian’s body was comparable to the control level.<br/><br/>With the blessing of the ancestral tree, he was able to fight against a control level powerhouse who had just stepped into the Heaven’s origin creation stage.<br/><br/>Now, he was able to fight against a control level powerhouse and two powerhouses who had just stepped into the Heaven’s origin creation stage!<br/><br/>This was equivalent to Wang Xian being able to fight against a control level powerhouse and two of the weakest Heaven’s origin creation level powerhouses.<br/><br/>“Using the Five Elements Millstone and the Tai Chi Dragon Disc, I am equivalent to being able to fight against two control-level and one of the weakest heaven origin creation-level powerhouses!”<br/><br/>Wang Xian opened his mouth and revealed an excited expression.<br/><br/>This strength was already very strong!<br/><br/>With his own strength and foundation, he could easily kill the emperor of<br/><br/>Phoenix and the Emperor of angels who had yet to reach the control-level.<br/><br/>Even the elven empress and the twelve ancestral witches could easily suppress them!\t\t\t\t\t\t</div>", "images": {}, "success": true}