{"id": 1199, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074522.html", "title": "Chapter 4202 - Chapter 4202: 4201 Exploded", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4202 - Chapter 4202: 4201 Exploded</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4202: 4201 exploded<br/><br/>Translator: 549690339<br/><br/>“We’re getting closer! ”<br/><br/>Tian Ci kept advancing forward.<br/><br/>Wang Xian and the rest followed behind him.<br/><br/>He looked at the distance and his eyes flickered slightly.<br/><br/>The last time he came to this position, he was already discovered!<br/><br/>The main reason was that Wang Xian didn’t have his current strength last time.<br/><br/>The last time, the Void Dragon Body didn’t have a breakthrough and the ancestral tree didn’t mature.<br/><br/>As he continued to move forward, a few minutes later, a huge white building altar appeared in his sight!<br/><br/>“Two, one is at the mastery level and the other is at the beginner level!”<br/><br/>As he approached the white building altar, Wang Xian looked at the scouting item in his hand. His eyes flickered slightly!<br/><br/>There were two heaven origin powerhouses. There was one more than the last time he was here.<br/><br/>However, the extra one was only at the beginner level. It wasn’t a big problem!<br/><br/>“Tianci, let’s surround them from another direction. Linniu, take Liu Lan and the Wang brothers and don’t move! ”<br/><br/>Wang Xian sent a voice transmission to tianci who was in front of him and began to instruct Linniu and the rest!<br/><br/>Linniu and the rest nodded their heads!<br/><br/>“Let’s go. We’ll go this way. You guys listen to my orders! ”<br/><br/>Wang Xian and Tianci flew in another direction.<br/><br/>Their concealment techniques were better than Lin Niu, Liu Lan, and the rest.<br/><br/>Wang Xian and Tianci moved forward discreetly. A few minutes later, they separated.<br/><br/>Ten minutes later, Wang Xian arrived at the left side of the building altar.<br/><br/>Tianci was at the back of the building altar!<br/><br/>“Get Closer! ”<br/><br/>Wang Xian took out his communication stone plate and sent a message to Lin Niu Tianci and the rest!<br/><br/>Following that, they immediately surrounded the building altar!<br/><br/>The body of the Void Dragon that had teleported to the right of the building altar also got closer bit by bit!<br/><br/>When Wang Xian and the rest surrounded them, they were at the location of the building altar.<br/><br/>The old man from the belief universe was at the center of the building. There was a tower-like building there.<br/><br/>He and a middle-aged man were sitting cross-legged on the tower. Suddenly, a thought came to his mind.<br/><br/>His eyes focused and he immediately looked forward!<br/><br/>The entire tower was also emitting light!<br/><br/>“Father, what’s going on?”<br/><br/>The middle-aged man was slightly shocked and immediately asked!<br/><br/>The old man frowned and looked forward.<br/><br/>On the top of the tower, a pupil was also beginning to condense!<br/><br/>The pupil was staring at the spot in front.<br/><br/>“It’s the guy from the sword and Magic Universe. There’s an Extra Heavenly<br/><br/>Kismet Powerhouse. It should be the one who broke through not long ago!”<br/><br/>The old man from the belief universe said, “Those who are courting death. It seems like we have to fight them in advance! ”<br/><br/>“Father, we have the altar. Here, three initial-level Heavenly Kismet powerhouses are not our match at all. Let’s teach them a lesson this time. ”<br/><br/>The middle-aged man beside him said coldly!<br/><br/>“Dragon King, we’ve been discovered! ”<br/><br/>At this moment, Lin Niu and the rest sensed that they had been discovered. They immediately sent a message to Wang Xian!<br/><br/>“Unleash your power and fly over quickly to attract their attention! ” Wang Xian’s eyes flickered as he immediately gave the order!<br/><br/>Boom! Boom<br/><br/>When Lin Niu and the rest received the message, their bodies immediately released a strong power and flew towards the building altar!<br/><br/>Liu Lan and Wang Xian also released a strong power and flew over quickly. “HMM? They rushed over after being discovered?”<br/><br/>At the building altar tower, the old man looked in the direction of Lin Niu and the rest.<br/><br/>With a move of his palm, a white stone slab appeared in front of him.<br/><br/>With a wave of his arm, a part of the building altar began to emit light!<br/><br/>“There are three heavenly yuan destiny realm experts. The one in the middle has energy comparable to the two weakest existences. The other two are the weakest heavenly yuan destiny realm experts! ”<br/><br/>The old man analyzed the strength of Lin Niu and the others and said indifferently, “We can easily deal with them! ”<br/><br/>After all, the old man had set up this place for hundreds of millions of years.<br/><br/>This building altar was like a spell formation set up by a wizard in advance, allowing him to burst out with even more powerful strength.<br/><br/>“Then let’s show them father’s strength! ”<br/><br/>The middle-aged man next to him said with a smile!<br/><br/>However, just as the middle-aged man finished speaking.<br/><br/>The white stone slab in front of the old man beside him emitted waves of ripples!<br/><br/>The sudden fluctuation caused the old man’s gaze to freeze. He immediately looked over!<br/><br/>When he saw the fluctuation information on the white stone slab, his expression changed drastically!<br/><br/>The old man flew directly to the sky above the tower. His entire body enlarged and he became a giant that was 10,000 meters in size!<br/><br/>He was dressed in white clothes that were filled with the power of faith! He had a kind face and his entire person looked majestic and sacred. It was very convincing!<br/><br/>However, at this moment, his expression was a little ugly!<br/><br/>His pair of eyes were emitting the radiance of faith. It was as though he wanted to penetrate the surrounding chaos and sweep his gaze around!<br/><br/>“Do it! Destroy them! ”<br/><br/>On the left side, Wang Xian shouted when he saw that his group had been discovered!<br/><br/>They were now very, very close to the construction altar!<br/><br/>He could even see the position of tianci.<br/><br/>Lin Niu and the rest unleashed their power and attracted the attention of the two experts from the belief universe!<br/><br/>As for Wang Xian and the rest, they were either stronger or about the same as the old man and the rest.<br/><br/>After most of their attention was attracted, they did not realize that Wang Xian and the rest were already so close!<br/><br/>This made Wang Xian and the rest’s encirclement completely formed!<br/><br/>“You guys who believe in the universe, if you want to Covet Our Sword and Magic Universe, you will have to pay the price today. Go To Hell! ”<br/><br/>Wang Wangtian stared at the two powerhouses who believed in the universe. His entire body was filled with violent killing intent.<br/><br/>Covet their universe.<br/><br/>Once the calamity arrived, who knew how many lives would die in their hands.<br/><br/>Although it didn’t happen, to them, it was already a deep hatred!<br/><br/>“Oh no, we’re surrounded. The other party’s strength is very strong. How is this possible? The Sword and magic universe is clearly a very weak universe. How can there be so many strong beings! ?”<br/><br/>When the elder who believed in the universe saw this scene, his expression changed greatly!<br/><br/>His pupils revealed a trace of panic.<br/><br/>Under his senses, the power from the front, back, left, and right were all extremely powerful!<br/><br/>The weakest one on the right was also a heaven origin creator with the space attribute. He was extremely difficult to deal with!<br/><br/>“Attack!”<br/><br/>At this moment, Wang Xian let out a low roar and instantly transformed into his divine dragon body!<br/><br/>He opened his dragon mouth which was filled with an illusory energy beam and attacked directly towards the center of the building altar!<br/><br/>“Hualala!”<br/><br/>Tianci waved his arm and a branch appeared in his hand. He slashed forward!<br/><br/>The Five Elements Millstone and the Tai Chi Dragon Plate flew out and continued towards the altar!<br/><br/>The Void Dragon Body also approached quickly.<br/><br/>Liu Lan and Wangtian flew over quickly. Their bodies were emitting energy as they began to attack!<br/><br/>Hunting Tian Yuan destiny, burst!\t\t\t\t\t\t</div>", "images": {}, "success": true}