{"id": 1198, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074518.html", "title": "Chapter 4201 - Chapter 4201: The 4200 Started To Encircle And Annihilate", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4201 - Chapter 4201: The 4200 Started To Encircle And Annihilate</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4201: The 4200 started to encircle and annihilate<br/><br/>Translator: 549690339<br/><br/>“According to what I read in the book, the belief universe is a very powerful universe. They will develop their believers. The more believers they have, the stronger the believers will be, and the stronger they will be.”<br/><br/>“The path of belief in the belief universe is the easiest path to enter the Heaven’s origin realm of creation. In the last calamity, they occupied a universe with many believers and powerful strength! ”<br/><br/>Tianci told Wang Xian about his understanding of the belief universe!<br/><br/>Wang Xian nodded his head when he heard that.<br/><br/>“Yes, the belief universe is very powerful. Their power of belief is a little special. However, if one day you can kill the experts and disciples of the belief universe, you can obtain the heart of belief. To cultivators, the heart of belief is a huge treasure! ”<br/><br/>“The power of belief is very strong. The heart of belief is the condensation of the power of belief. Not long ago, I fought with the nine-origin universe. Now, they occupy two universes. Be it the strong cultivators of Tianyuan or the number of disciples, they are both very large. ”<br/><br/>He continued to speak!<br/><br/>Wang Xian’s understanding of the belief universe was rather deep.<br/><br/>When he was in the starry universe, he had absorbed the memories of many strong cultivators at the level of the ruler of the belief universe and obtained many things from them.<br/><br/>Just one universe that believed in the universe had twenty-four palaces.<br/><br/>There were at least a dozen supreme gods in that universe!<br/><br/>Wang Xian did not get a specific number.<br/><br/>However, according to his estimation, the twenty-four palaces were equivalent to twenty-four powerhouses in the Heaven’s origin realm.<br/><br/>Of course, all of this was hard to say.<br/><br/>“Foster father, will anything happen to us when we hunt down the powerhouses of the belief universe?”<br/><br/>Tianci asked Wang Xian.<br/><br/>“It’s fine. All the Heaven’s origin creation in the belief universe are not of the same mind. They are powerful. After the calamity, they will lead their believers to invade other universes and develop believers. At most, it will be a few heaven’s origin creation joining forces. ”<br/><br/>“They will not invade the universe with powerful strength. What they need is more believers and not resources! ”<br/><br/>Wang Xian said with a smile.<br/><br/>With Wang Xian’s current strength, he was somewhat fearless.<br/><br/>The two of them chatted while Lin Niu followed by the side. Soon, they arrived at the sword and Magic Universe!<br/><br/>Once they entered the sword and Magic Universe, Tianci was instantly suppressed by the universe!<br/><br/>“Dragon King! ”<br/><br/>At this moment, Liu Lan and Wang Xian had been waiting here.<br/><br/>When they saw Wang Xian and the rest, they immediately went up to welcome them.<br/><br/>Their eyes swept across tianci who was beside them, and their eyes sparkled!<br/><br/>“This is my foster son, tianci. They are the Heaven’s origin creation of the sword and magic universe, Liu Lan and Wang Xian! ” When Wang Xian saw them, he nodded his head.<br/><br/>“Hello, Aunt Liu Lan and uncle Wangtian! ”<br/><br/>Tianci greeted them with a smile!<br/><br/>(‘I dare not.”<br/><br/>Liu Lan and Wangtian were slightly shocked when they heard Wang Xian’s introduction!<br/><br/>“We won’t waste any more time. We will enter the chaos directly. You guys can just wait here! ”<br/><br/>Wang Xian spoke to Liu Lan and the rest!<br/><br/>“Dragon King, let us go with you. They are coveting our universe. We can’t just stay here. Although we are weak, we can contribute a little! ”<br/><br/>Hopeless Heaven immediately spoke up!<br/><br/>“Yes, Dragon King. We Are, after all, Tianyuan manifestation powerhouses. Even if the other party is an existence at the control level, we can still bring them huge trouble. Moreover, we can’t be sure how many Tianyuan manifestation powerhouses the other party has! ”<br/><br/>Liu Lan also echoed from the side.<br/><br/>The two of them wanted to fight together with Wang Xian.<br/><br/>This was their universe after all.<br/><br/>They naturally had to take action against their enemies.<br/><br/>Besides, being able to fight alongside the Dragon King would also increase their friendship.<br/><br/>It would be beneficial to their sword and magic universe.<br/><br/>“Alright, let’s go together then! ”<br/><br/>Wang Xian nodded his head.<br/><br/>He gestured to the heaven-bestowed Qilin Bull. With a thought, he immediately flew towards the chaos at the side!<br/><br/>Buzz<br/><br/>Liu Lan and Wang Xian immediately followed behind him!<br/><br/>“Huff! Foster father, is this the chaos? It’s all gray. However, this is much more comfortable than the sword and magic universe. At the very least, there isn’t any suppression. ”<br/><br/>This was the first time Tianci had entered the chaos. He looked ahead and said with a twinkle in his eyes.<br/><br/>“Hehe, that’s right. There is no life in the chaos. It’s all gray everywhere. If we can encounter other special items, they will definitely be huge treasures!”<br/><br/>Wang Xian nodded with a smile. “Tianci, use your strongest technique to conceal your aura. We must conceal ourselves and approach. Brother Liu Lan and Wang Wangtian, listen to my command. Conceal yourselves First! ” He looked at Liu Lan and Wang Wangtian.<br/><br/>Tianci nodded. With a wave of his arm, the illusory divine tree enveloped his surroundings and headed toward Wang Xian and the rest!<br/><br/>Wang Xian also used the same technique. He used the five elements grinding tai chi dragon disc at the same time!<br/><br/>“Let’s Go! ”<br/><br/>His body moved and he flew forward.<br/><br/>Tianci immediately followed closely behind.<br/><br/>“This… The adopted son of the Dragon King is very strong. He is much stronger than us!”<br/><br/>Hopeless Heaven sensed tianci’s technique and the energy in his body. His pupils constricted slightly as he transmitted his voice to Liu Lan!<br/><br/>Liu Lan nodded his head silently. He was a little shocked.<br/><br/>He now had some understanding of the Dragon King’s power!<br/><br/>The five of them concealed themselves and flew forward.<br/><br/>Wang Xian knew the location of the building altar. This time, he was familiar with it.<br/><br/>He took out the treasures he exchanged from the twelve ancestral warlocks and approached them bit by bit!<br/><br/>“I’ve already sensed the other party’s location. The last time I came here, I met an old man who was at the control level of the belief universe. When I approached him, he also noticed me very quickly!”<br/><br/>“His means of detection are very strong. Be On Your Guard! ”<br/><br/>As Wang Xian spoke, the body of the Void Dragon flew out from his body.<br/><br/>The body of the Void Dragon held the Five Elements Millstone and teleported to the front right!<br/><br/>“Foster father, my concealment ability is very strong. I shouldn’t be discovered, right?”<br/><br/>Tianci looked at Wang Xian and said.<br/><br/>“Yes, your concealment ability is very strong. Unless you are hundreds of millions of kilometers away, you shouldn’t be discovered!”<br/><br/>Wang Xian nodded his head. “Of course. In order to prevent any accidents from happening and to alert the others, TIANCI, you go first! ”<br/><br/>“If you are discovered, the other party will not run away immediately. This way, we still have a chance and time! ”<br/><br/>As he spoke, the black and white dragon robe draped over his body landed on Tianci’s body.<br/><br/>Tianci touched the black and white dragon robe that was transformed from the Taiji Dragon Plate and nodded at Wang Xian. He cracked a smile and said, “Foster father, leave it to me! ”<br/><br/>Wang Xian nodded his head and watched as Tianci continued to move forward.<br/><br/>They tried their best to conceal themselves and followed behind him.<br/><br/>As time passed, they were getting closer and closer to the white altar!\t\t\t\t\t\t</div>", "images": {}, "success": true}