{"id": 1196, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074510.html", "title": "Chapter 4199 - Chapter 4199: 4198 Was Ready To Hunt For The Heavenly Kismet", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4199 - Chapter 4199: 4198 Was Ready To Hunt For The Heavenly Kismet</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4199: 4198 was ready to hunt for the Heavenly Kismet<br/><br/>Translator: 549690339<br/><br/>“HMM? There’s actually a Heavenly Kismet realm powerhouse in the Sword and Magic Universe. In that case, there are three Heavenly Kismet Realm powerhouses in this universe!”<br/><br/>“Although it will add another trouble, just adding one Heavenly Kismet Realm Powerhouse isn’t a big problem! ”<br/><br/>At the same time, in the chaotic space around the sword and Magic Universe.<br/><br/>An old man and a middle-aged man stood in the sky above a huge building altar, looking in the direction of the sword and Magic Universe, mumbling.<br/><br/>In the sky above them, there was an extremely huge pupil.<br/><br/>“Father, this sword and Magic Universe’s heaven origin creation powerhouses are all at the beginner level, and they are the weakest. With your strength, father, you can fight against the three of them, including me. ”<br/><br/>“We are enough to occupy a large area of this universe, develop believers, and allow my little brother to make a breakthrough! ”<br/><br/>The middle-aged man said to the old man beside him!<br/><br/>“Yes, this sword and Magic Universe is a good place. It is weak and has a few spots for Heavenly Kismet powerhouses. Once the calamity arrives, we will take action to prevent others from coming over to take a share. ”<br/><br/>The old man nodded and said.<br/><br/>He had been setting up here for a long time.<br/><br/>Setting up an extremely powerful altar.<br/><br/>Just the setting up of this altar took him hundreds of millions of years.<br/><br/>When the calamity arrives, this altar can unleash terrifying power.<br/><br/>His army can also be quickly summoned over.<br/><br/>Just now, the difference between the sword and magic universe was so great that he used his supreme treasure to spy on it.<br/><br/>Although the sword and the Magic Universe had an extra Heaven’s origin creator, everything was fine and was still within the plan.<br/><br/>Roar!<br/><br/>In the sword and the Magic Universe, the Void Dragon let out a roar that belonged to a heaven’s origin creator.<br/><br/>That spy pupil had also disappeared at this moment!<br/><br/>When Wang Xian saw that the void Dragon’s body had made a complete breakthrough, he smiled!<br/><br/>“Congratulations, Dragon King! ”<br/><br/>Liu Lan and Wang Xian squeezed out a smile and congratulated him.<br/><br/>The elated look on Wang Xian’s face earlier had also disappeared.<br/><br/>That peeping pupil had appeared again!<br/><br/>The enemy was right around their universe.<br/><br/>Once the calamity erupted, they would face a terrifying crisis.<br/><br/>This made them very worried.<br/><br/>During the last cataclysm, the Asgardian Demon God had led countless demonic beasts to invade the interior of their universe.<br/><br/>Countless people in the sword and magic universe had been killed or injured.<br/><br/>They did not know what would happen this time!<br/><br/>“No need. Let’s go to a secret place. A place where we can not be spied on!”<br/><br/>Wang Xian looked at them and said.<br/><br/>“HMM? It’s the Dragon King! ”<br/><br/>Liu Lan and Wang Xian nodded their heads and gestured to Wang Xian before entering the teleportation formation.<br/><br/>Wang Xian followed them and arrived at the center of the universe of swords and magic through the teleportation formation.<br/><br/>Then, they arrived at the place where Wang Xian was cultivating.<br/><br/>“That pupil of mine is impossible to be spied on. In the past few hundred million years, that gaze has spied on me a few more times!”<br/><br/>Wang Xian sat down and said with a hint of worry!<br/><br/>“Is it still that gaze? Are there any new gazes?”<br/><br/>Wang Xian asked them. “No, it’s that gaze!”<br/><br/>Wang Xian shook his head.<br/><br/>“If it’s still that old fellow, I’ll hunt him down! ”<br/><br/>Wang Xian said with a twinkle in his eyes!<br/><br/>Wang Xian already possessed strength comparable to the Great Dao level.<br/><br/>And the strength of the Great Dao level was able to kill an existence at the control level!<br/><br/>Three control levels were comparable to one great dao level.<br/><br/>One Great Dao level could kill one control level.<br/><br/>This killing was the kind where, even if one had a life-saving treasure, there was still a 95% chance of killing it.<br/><br/>This was the difference between the control level and the Great Dao level.<br/><br/>When the Void Dragon broke through, his strength added up to the Great Dao level.<br/><br/>And he knew that old fellow who believed in the universe. He was an existence at the control level.<br/><br/>With this strength, Wang Xian could be killed!<br/><br/>“Oh? Dragon King, are you going to kill that spy? Are You Confident, Dragon King?<br/><br/>Liu Lan was slightly shocked when she heard that. She stared at Wang Xian with her eyes wide open.<br/><br/>Wang Xian nodded his head and looked at them. Following that, he smiled.<br/><br/>Buzz<br/><br/>In the next moment, he activated the energy in his body, the five elements great grinding tai chi dragon disc and the energy of the Void Divine Dragon.<br/><br/>Four streams of energy instantly enveloped Liu Lan and Wang Xian!<br/><br/>At this moment, the expressions of Liu Lan and Wang Xian changed drastically.<br/><br/>The threat of death instantly shrouded their hearts.<br/><br/>They felt as though the sky was falling down.<br/><br/>Their life force seemed to be strangled!<br/><br/>Their foreheads were instantly filled with cold sweat as they looked at Wang Xian in astonishment.<br/><br/>Wang Xian smiled gently and all the energy dissipated.<br/><br/>“Just in case, I’ll bring the Lin Niu over. I’ll also call for another strong cultivator in the heaven’s origin realm. ” He spoke to the two of them calmly!<br/><br/>“Huff! Huff! ”<br/><br/>Liu Lan and Wangtian could sense the energy around them disappearing.<br/><br/>They could feel the threat of death dissipating as they panted heavily.<br/><br/>They looked at Wang Xian with some shock and fear.<br/><br/>“Dragon King, your strength… on behalf of all living beings in the sword and Magic Universe, I thank you, Dragon King. ”<br/><br/>Wangtian and Liu Lan looked at each other. They stood up and bowed to Wang Xian with deep tremors!<br/><br/>This time, Wang Xian had given them too much of a shock!<br/><br/>They felt that with Wang Xian’s current strength, it would be too easy to kill them.<br/><br/>He could easily kill them.<br/><br/>They didn’t even have the strength to resist!<br/><br/>This made them extremely shocked.<br/><br/>How terrifying was the current Dragon King.<br/><br/>Now that the Dragon King wanted to help them get rid of the threats from the outside world, they were grateful, but at the same time, they were a little terrified.<br/><br/>Would the Dragon King have other thoughts about their sword and the magic universe.<br/><br/>If so, how desperate would they be.<br/><br/>There was simply no way to resist!<br/><br/>“No need to thank me. We are friends now, and the sword and the magic universe also has my family and friends. Although my strength has broken through very quickly, the most I can do is to let my subordinates break through here. I Won’t Hurt Your Universe. ”<br/><br/>“If there are no major accidents, I can save the Sword and magic universe from danger after the arrival of the Apocalypse! ”<br/><br/>Wang Xian saw their anxious expressions and said with a smile.<br/><br/>He had made a move earlier to demonstrate his strength.<br/><br/>He didn’t have any other thoughts.<br/><br/>“We believe in you, Dragon King. With your current strength, there’s no need to hide anything from us even if you want to do something. ”<br/><br/>Liu Lan opened her mouth and heaved a heavy sigh of relief in her heart.<br/><br/>With the strength displayed by Wang Xian, he could do whatever he wanted in the sword and magic universe. There was no need to lie to them.<br/><br/>That was because they were no longer qualified.<br/><br/>At this moment, they were also feeling a little fortunate. If the Dragon King was truly willing to help them.<br/><br/>In that case, their sword and magic universe would not be in too much danger during this calamity!\t\t\t\t\t\t</div>", "images": {}, "success": true}