{"id": 1192, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074494.html", "title": "Chapter 4195 - Chapter 4195: 4194 Heaven And Earth Rumbled As They Celebrated!", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4195 - Chapter 4195: 4194 Heaven And Earth Rumbled As They Celebrated!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4195: 4194 heaven and earth rumbled as they celebrated!<br/><br/>Translator: 549690339<br/><br/>“Tianci is about to break through. Hurry up, we are rushing to the grassland. Tianci is back and under the lead of the Dragon King, he is about to break through to the Grassland! ”<br/><br/>“It has only been 200 million years and Tianci is about to break through. Our Mu Li tribe is about to rise up completely! ”<br/><br/>“It’s the Heavenly Yuan Destiny Realm. I didn’t expect that our Mu Li tribe would have a heavenly yuan destiny realm powerhouse! ”<br/><br/>“Our ancestors showed their spirit. Before the catastrophe, our Mu Li tribe had such a powerhouse. With the Dragon King of the Dragon Palace as a backer, we are not afraid at all when the catastrophe arrives! ”<br/><br/>“Hurry, Hurry, all the tribesmen rush to the grassland. Mu Li Tianci is about to break through! ”<br/><br/>When TIANCI returned to the six paths universe, Tianci’s grandfather and the others passed the news to the Mu Li tribe.<br/><br/>The Nine River Tribe also received the news.<br/><br/>This caused the Mu Li tribe and the Nine River tribe to be completely excited.<br/><br/>The Mu Li tribe had given birth to a heavenly yuan creation realm expert. In the future, they would be one of the top three tribes in the six paths universe!<br/><br/>They would be able to occupy even more resources.<br/><br/>Especially with the impending calamity, having a heavenly yuan creation realm expert to protect them and not having a heavenly yuan creation realm expert to protect them were two completely different concepts.<br/><br/>The Dragon King of the Dragon Palace led mu litianci to the grassland to make a breakthrough. This news swept through the entire six paths universe at a terrifying speed.<br/><br/>After the undead and the Golden Leopard received this news, they immediately rushed towards the grassland.<br/><br/>Countless powerful disciples also rushed towards the grassland.<br/><br/>They worshipped and watched!<br/><br/>Half a year later, 13 gigantic divine dragons stepped into the sky above the grassland.<br/><br/>Below, all the strong disciples were shocked when they saw the gigantic divine dragon flying over and pulling the Divine Dragon Throne.<br/><br/>Everyone knew that the Dragon King had arrived and Mu Litianci had arrived.<br/><br/>“The leaders of the major tribes of the grassland welcome the Dragon King,<br/><br/>Lord Mu Litianci, Lord Mu Litianci, and Lord Mu Litianci to the grassland for a<br/><br/>breakthrough. We are all in the sky above the center of the grassland and have prepared everything for you, Lord! ”<br/><br/>“We are here to welcome you under the orders of the spirits of the dead.”<br/><br/>As soon as they arrived in the air above the grassland, the leaders of the major tribes of the grassland came over personally to welcome them and greeted them loudly!<br/><br/>“Lead the way! ”<br/><br/>Tianci looked at them, nodded and said.<br/><br/>In the past half a year, Wang Xian had also taught him some knowledge about the skills of emperors.<br/><br/>As a creator of the Heaven’s origin, as long as he had his own clan and tribe, he had to know some control skills.<br/><br/>As a strong person, he had to have the attitude of a strong person.<br/><br/>As there was the existence of the apocalypse, a strong person in the universe had to know tactics and know how to give orders.<br/><br/>Wang Xian had given him a lot of these things in the past half a year.<br/><br/>Tianci was still young, unlike Wang Xian who had killed his way here.<br/><br/>His path was relatively simple, so there were some things that needed to be taught!<br/><br/>For example, the way to deal with the major tribes in the six paths universe, as well as the attitude towards the other three heaven origin creator powerhouses.<br/><br/>He could respect them as a junior.<br/><br/>However, he also needed to gain the respect of the other party.<br/><br/>Otherwise, there was no need to respect the other party at all. Strength spoke the loudest.<br/><br/>Wang Xian was very respectful towards the experts from the nine-origin universe. Many times, he would address them as seniors.<br/><br/>He was indeed a junior. He had to be humble.<br/><br/>However, at the same time, he had to treat them with respect.<br/><br/>This was the foundation!<br/><br/>For the following matters, he would let Tianci handle it himself. Wang Xian would only watch from the side.<br/><br/>After that, Prime Minister Gui would also send a few members of the Dragon Palace to help him sort out some problems.<br/><br/>The think tank was still very important.<br/><br/>Even if Tianci had become a powerhouse in the Heaven’s origin realm, Wang Xian, the old father, was not completely at ease!<br/><br/>“It’s Lord Mu Litianci! ”<br/><br/>The leaders of the tribes looked at Mu Litianci and were slightly shocked. They responded respectfully.<br/><br/>Tianci was sitting on the dragon throne. Behind him, there was the shadow of a divine tree. It was emitting a fierce aura.<br/><br/>On his head, there was a crown with a unique design of a tree and a divine dragon. It added a lot of majesty to his young face.<br/><br/>He was dressed in the wood divine dragon robe, exuding a sense of nobility!<br/><br/>The Divine Dragon pulled the carriage and sat on the dragon throne.<br/><br/>He had a complete heavenly yuan creation treasure. Even if he had not broken through, his strength was not weaker than a heavenly yuan creation realm expert who had just entered.<br/><br/>His Majesty was revealed!<br/><br/>The thirteen Divine Dragons pulled their dragon chairs and continued flying forward!<br/><br/>Soon, they arrived in the sky above a forest!<br/><br/>Below them, there were already countless strong disciples waiting.<br/><br/>The Sand City of the dead and the golden leopard were sitting on the throne in the void!<br/><br/>“Foster Father! ”<br/><br/>Looking at the specially cleared void in the sky ahead, Tianci stood up slowly to visit Wang Xian!<br/><br/>Wang Xian nodded at him and stood up slowly!<br/><br/>“It’s foster father! ”<br/><br/>Tianci did not talk to the others, nor did he talk to the undead and the other three powerhouses!<br/><br/>His body moved and he flew straight up into the sky!<br/><br/>Buzz<br/><br/>Behind him, a god tree that was not very thick, was slightly thin and long. There were some sharp thorns on it, and it was filled with a fierce aura. It appeared directly behind him!<br/><br/>The God tree was emitting a suffocating aura.<br/><br/>An aura that was not weaker than a beginner-level heavenly kismet expert charged downwards!<br/><br/>“He’s about to break through. This? ? He hasn’t broken through yet, but he already has an aura that’s not weaker than mine? If he breaks through, wouldn’t that be?”<br/><br/>Undead Sand City and the others saw the thirteen divine dragons. They saw Tianci fly up into the sky and directly attempt to break through.<br/><br/>Feeling this power, they were shocked.<br/><br/>The golden leopard could not help but ask in a low voice.<br/><br/>“According to the rumors in the universe, if a heavenly yuan creation realm expert who has just made a breakthrough has an attack-type heavenly Yuan creation treasure, he can fight against a control-level existence. In other words, it’s easy for him to fight against three of them!”<br/><br/>The undead said from the side, his eyes flashing.<br/><br/>“He reached the Heavenly Yuan creation realm after cultivating for more than 300 million years. He’s much stronger than me when he just stepped into it.<br/><br/>I’m really envious! ”<br/><br/>Earth Sand City couldn’t help but say.<br/><br/>“Tianci’s luck is indeed heaven-defying. Not only was he born extraordinary, but he also met a foster father who treats treasures like nothing. I can’t compare to him! I can’t compare to him! ”<br/><br/>The undead shook his head and looked up into the sky!<br/><br/>At this moment, all the powerful disciples ‘gazes were focused on TIANCI.<br/><br/>The divine tree behind Tianci seemed to have taken root in the void.<br/><br/>The branches and leaves above completely covered tianci.<br/><br/>Tianci stood on top, and countless wood elemental energy surged into his body.<br/><br/>In the sky, the Phantom of the divine tree appeared, swaying its branches.<br/><br/>Flowers bloomed.<br/><br/>Tianci stood there, slowly spreading his arms.<br/><br/>The tree of God behind him also began to sway its branches.<br/><br/>At this moment, the starry sky seemed to dim, and only the most dazzling tree of God and Tianci remained.<br/><br/>“Rumble!”<br/><br/>“Rumble!”<br/><br/>The World Roared, celebrating!\t\t\t\t\t\t</div>", "images": {}, "success": true}