{"id": 1206, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074550.html", "title": "Chapter 4209 - Chapter 4209: 4208 Would Be A Good Fortune For The Heaven’S Origin. There Was No Need To Respect Someone Of The Same Level", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4209 - Chapter 4209: 4208 Would Be A Good Fortune For The Heaven’S Origin. There Was No Need To Respect Someone Of The Same Level</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4209: 4208 would be a good fortune for the Heaven’s origin. There was no need to respect someone of the same level<br/><br/>Translator: 549690339<br/><br/>Under Wang Xian’s senses, he felt that the fallen shadow demon Emperor was very strong.<br/><br/>However, this strength was not something that he could not fight against!<br/><br/>With his current strength and foundation, he was able to fight against the Fallen Shadow Demon Emperor.<br/><br/>This was under the circumstance that they were not considered to have been gifted by the heavens.<br/><br/>After all, Wang Xian had the ultimate treasure of the Heaven’s origin.<br/><br/>With the arrival of the Fallen Shadow Devil Emperor, almost all the powerful disciples had arrived!<br/><br/>“CHIRP CHIRP! ”<br/><br/>The 10th day had arrived. At this moment, a phoenix cry sounded!<br/><br/>An extremely powerful water phoenix flew over.<br/><br/>He flapped his phoenix wings and droplets of crystal-clear water droplets surrounded him.<br/><br/>His entire body exuded a strength that could make a peak overlord realm powerhouse’s heart tremble.<br/><br/>The king of the Water Phoenix.<br/><br/>The Emperor of the Phoenix revealed a smile when he saw the king of the water phoenix fly over.<br/><br/>After today, their Phoenix clan would have one more heavenly yuan creation realm expert.<br/><br/>With two Heavenly Yuan creation realm experts, their Phoenix clan’s might would rise by a level.<br/><br/>Although they had just entered, they still had one more heavenly yuan creation realm expert.<br/><br/>He also had one more powerful trump card.<br/><br/>“The Water Phoenix King Is Here! ”<br/><br/>“The breakthrough is about to begin. After today, our Phoenix clan will have two heavenly fate experts! ”<br/><br/>“I feel that the Water Phoenix King’s might is terrifying. ”<br/><br/>Over at the Phoenix clan, when their disciples saw the Water Phoenix king flying over, their eyes burned with excitement as they spoke.<br/><br/>Sigh<br/><br/>Over at the Celestial Nation, beside the floating queen, a group of experts helplessly watched this scene.<br/><br/>Their faces were filled with bitterness.<br/><br/>Fate was playing a trick on people.<br/><br/>If the floating queen had yet to touch the threshold and the shackle, they might not be so disappointed.<br/><br/>But now, the floating queen had already touched the threshold.<br/><br/>She would be able to break through in a month at most!<br/><br/>What a pity!<br/><br/>In the surroundings, the disciples of the other races looked on, their eyes shining.<br/><br/>“Greetings, Lord Water Phoenix. Congratulations, Lord Water Phoenix is about to break through to the Heavenly Fate Realm!”<br/><br/>The Water Phoenix King landed in front of the disciples of the Phoenix race and turned into a human.<br/><br/>All the disciples of the Phoenix race immediately bowed respectfully.<br/><br/>The king of the Water Phoenix nodded with a smile and flew to the center.<br/><br/>There, there were many parasol trees that formed a square formation.<br/><br/>The king of the Water Phoenix came to the position above and floated there.<br/><br/>He looked at the position in front of him.<br/><br/>The king of the Water Phoenix bowed to the king of the Phoenix and cupped his hands to the fallen Shadow Demon Emperor. Following that, he cupped his hands to the rest of the Heaven’s origin destiny realm powerhouses as well. This could be considered as a simple way of bowing to the mountain.<br/><br/>However, the king of the Water Phoenix ignored Wang Xian.<br/><br/>After bowing to the elven empress, the Hetian Saint, and the rest one by one, he did not bow to Wang Xian.<br/><br/>“Hehe! ”<br/><br/>The king of the Phoenix smiled faintly when he saw this scene.<br/><br/>Below him, the eyes of all the powerful disciples of the various races flickered when they saw this scene.<br/><br/>It was obvious that they didn’t take the Dragon King seriously.<br/><br/>However, this was normal. The Phoenix clan had a grudge with the Dragon Palace, so it was normal for them not to bow down to him.<br/><br/>“Any disciple who is disrespectful to the Heaven’s origin creator should be beheaded! ”<br/><br/>Lin Niu, who was sitting beside Wang Xian, frowned slightly when he saw this scene. He spoke coldly!<br/><br/>“He will be a heaven’s origin creator. There’s no need to respect someone of the same level. Everything depends on whether the other party is worthy of respect. ”<br/><br/>The emperor of the Phoenix knocked on his seat and replied indifferently!<br/><br/>When his voice fell, the parasol tree below the water phoenix king emitted rays of light.<br/><br/>This was a powerful array formation.<br/><br/>A defensive array formation.<br/><br/>The strongest foundation of the Phoenix clan stood here on Phoenix Mountain.<br/><br/>This defensive array formation could withstand the attacks of a heavenly creation realm powerhouse!<br/><br/>Even if it was at the control level, it would take a few seconds to break this formation.<br/><br/>And a few seconds was enough to do a lot of things!<br/><br/>“Hehe! ”<br/><br/>Wang Xian waved his hand at Lin Niu and smiled faintly.<br/><br/>This scene was witnessed by all the powerful disciples of the various races.<br/><br/>However, no one dared to discuss this matter!<br/><br/>“HMPH!”<br/><br/>The experts of the Dragon Palace all had cold expressions on their faces as their cold auras spread around.<br/><br/>“People of the Dragon Palace, don ‘t be so angry. This is our Phoenix Mountain. Just watch the Water Phoenix King break through. Watch carefully and see if you can gain any insights! ”<br/><br/>Some experts of the peak-stage ruler realm from the Phoenix clan looked over coldly and said.<br/><br/>Prime Minister Gui waved his hand at the group of experts.<br/><br/>A few small incidents happened.<br/><br/>All the experts and disciples focused their gazes on the Water Phoenix King in the sky.<br/><br/>“CHIRP CHIRP! ”<br/><br/>“CHIRP CHIRP! ”<br/><br/>The Water Phoenix King transformed into its true form and roared once more as it spread its wings.<br/><br/>A vast power surged into the sky.<br/><br/>In an instant, the surrounding sky underwent a drastic change.<br/><br/>Drops of rain condensed out of thin air and gathered towards the Water Phoenix King.<br/><br/>At this moment, it was as if the divine water of the nine heavens had poured into the water Phoenix King’s body and tidied it up.<br/><br/>The energy within the Water Phoenix King’s body became more and more terrifying.<br/><br/>“CHIRP CHIRP! ”<br/><br/>“CHIRP CHIRP! ”<br/><br/>In the surrounding Phoenix Mountain, the Phantoms of Phoenixes appeared on the parasol trees.<br/><br/>One after another, the Phoenixes looked in the direction of the Water Phoenix King and let out cries!<br/><br/>A hundred birds facing the Phoenix!<br/><br/>A hundred phoenixes facing the King!<br/><br/>In the sky, the enormous phantoms of water phoenixes formed and slowly merged with the Water Phoenix King!<br/><br/>This enormous power and the enormous water energy undulations in the surroundings shocked all the powerful disciples!<br/><br/>“Is this the breakthrough of a Heavenly Yuan creation realm expert? This faint pressure almost made me kneel down! ”<br/><br/>“Yeah, it’s too strong. This pressure is too terrifying. It completely covers the entire Phoenix Mountain. When will I be able to reach such a level?”<br/><br/>“It’s really something to look forward to!”<br/><br/>Countless disciples looked at this scene and muttered.<br/><br/>Queen floating water also looked at this scene. At this moment, her emotions were extremely complicated.<br/><br/>Looking at the breakthrough of the Water Phoenix King, she realized that she was getting closer and closer to it!<br/><br/>She even realized that she could break through her shackles!<br/><br/>Her shackles were getting smaller and smaller under the impact of this power.<br/><br/>However, there were no more slots left. She would never be able to step out of this step in the nine-origin universe.<br/><br/>This was her fate!<br/><br/>The king of the Water Phoenix began to break through!<br/><br/>She began to complete the last step!<br/><br/>All the strong disciples in the nine-origin universe watched.<br/><br/>Wang Xian was also watching quietly.<br/><br/>“CHIRP CHIRP CHIRP! ”<br/><br/>An hour later, a surge of majestic energy rushed into the clouds.<br/><br/>Accompanied by a phoenix cry filled with majesty.<br/><br/>“The Phoenix Cry of the Nine Heavens, our water phoenix king has made a breakthrough.. The second heaven-origin creation of our Phoenix Clan has been born! “\t\t\t\t\t\t</div>", "images": {}, "success": true}