{"id": 1203, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074538.html", "title": "Chapter 4206 - Chapter 4206: 4205 Was Born And Died", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4206 - Chapter 4206: 4205 Was Born And Died</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4206: 4205 was born and died<br/><br/>Translator: 549690339<br/><br/>In the Grand Hall of the Tree of Chaos Celestial Nation, Wang Xian looked at the information on the communication stone plate and frowned slightly.<br/><br/>This matter was not a good thing for Wang Xian.<br/><br/>It was even more bad news for Queen of the floating waters and the rest!<br/><br/>The celestial nation paid a huge price to obtain the corpse of a heaven origin creator from him. Just as they were about to make a breakthrough, someone beat them to it!<br/><br/>“Oh? Sir Dragon King, What’s the situation?”<br/><br/>At the side, the celestial nation’s experts were slightly stunned when they saw Wang Xian frowning. They asked in astonishment.<br/><br/>“Fellow Daoists and friends, today, the Phoenix tribe announces something.<br/><br/>Ten days later, the Phoenix tribe invites all of you to come and watch the Phoenix Tribe’s Water Phoenix king breakthrough and advance to the Heaven origin blessed realm. We welcome all the strong disciples to participate!”<br/><br/>“Fellow Daoists and friends, my Phoenix clan would like to make an announcement today. Ten days later, my Phoenix clan would like to invite all of you to witness the breakthrough of the Water Phoenix King of my Phoenix clan and the Ascension to the Destiny realm of the Heaven’s origin. All the strong disciples are welcome to attend! ”<br/><br/>Before Wang Xian could reply, a voice came from outside.<br/><br/>This voice was repeated three times and spread to every corner of the tree of chaos.<br/><br/>All the strong disciples in the nine-origin universe could hear it clearly.<br/><br/>When all the strong disciples heard this voice, they were slightly stunned and looked surprised.<br/><br/>Over at the Celestial Nation, Queen of the floating waters and the rest were completely stunned when they heard this.<br/><br/>The smile on their faces disappeared completely!<br/><br/>“Ten days later, the king of the Water Phoenix broke through to the Heavenly Yuan blessed realm?”<br/><br/>An expert from the celestial nation muttered. His body could not help but take a step back. His expression was a little absent-minded. “How is this possible? How can this be such a coincidence?”<br/><br/>“Ten days later, he broke through. In front of me…”<br/><br/>The Queen of the Floating Water Tribe’s expression also changed drastically. She turned pale instantly. She quickly looked at Wang Xian in front of her and asked, “Sir Dragon King, is this… is this real?”<br/><br/>“It shouldn’t be fake. The king of the Water Phoenix will break through in ten days. Unless you can break through before him, don’t even think about breaking through for the time being! ”<br/><br/>Wang Xian nodded at her.<br/><br/>Fate was a little tricky.<br/><br/>There was only one spot in the nine-origin universe. Whoever broke through first would not be able to break through.<br/><br/>Unless he entered another universe with a spot, he would never be able to break through until the king of the Water Phoenix died.<br/><br/>The Floating Queen’s face was filled with bitterness and confusion. He would need at least two months to break through, which was the fastest time.<br/><br/>He couldn’t break through more than a month in advance. Besides, no one could help her break through this shackle.<br/><br/>She knew better than anyone.<br/><br/>“How could this be? How could this be? The Water Phoenix King beat me to it, just a little bit more time. How could this be?”<br/><br/>One of the floating water queen’s older brothers couldn’t accept this reality. He kept on talking and completely lost his composure.<br/><br/>A heavenly Yuan creation realm expert was too important to the immortal empire!<br/><br/>Everything was unknown in the calamity. If it was like the previous calamity, a peak race without a heavenly yuan creation realm expert could be wiped out.<br/><br/>It wasn’t that this didn’t happen in the previous calamity.<br/><br/>Only with a strong cultivator in the heaven’s origin realm, this peak race wouldn’t be wiped out.<br/><br/>Now, the realm of the Heaven’s origin realm that was within reach had been conquered.<br/><br/>They were overjoyed and found it hard to accept.<br/><br/>It made them break down a little.<br/><br/>“Huff! Huff! ”<br/><br/>Some of them were breathing rapidly!<br/><br/>Wang Xian stood there with his eyes flickering.<br/><br/>“Don’t be anxious. Everything will be in ten days.”<br/><br/>He looked at the queen of floating water and said faintly. He didn’t say anything else.<br/><br/>Wang Xian’s figure moved and left immediately!<br/><br/>He was going to carry out some plans.<br/><br/>“Let’s not despair now. Don’t be anxious. Floating water has already touched the bottleneck of breaking through. She can break through easily. If the quota for the nine-origin universe is taken, we can go to another universe with a quota when the calamity arrives. Then, we can let floating water break through. We still have a great chance! ”<br/><br/>Seeing Wang Xian leave, the experts from the Celestial Nation spoke up.<br/><br/>“Yes, yes, we still have a chance. Floating water has already taken the most important step. There are no more spots in the nine-origin universe, and there will be spots in other universes as well. Let’s go to other universes and occupy this spot!”<br/><br/>The surrounding experts began to agree. They kept consoling themselves and the others.<br/><br/>However, they knew that it was so easy to go to other universes to make a<br/><br/>breakthrough and take up a spot in other universes?<br/><br/>The spot in the Heavenly Yuan blessed realm was extremely important to any universe.<br/><br/>If they wanted to go to another universe to make a breakthrough and take up their spot, it would be a death feud for the experts and living beings in that universe.<br/><br/>They would not rest until one of them died!<br/><br/>When the calamity arrived, a large portion of the chaos would be like this.<br/><br/>The spot for the Heavenly Yuan creator.<br/><br/>There was another thing, and that was to break through to another universe. The risk was very, very great.<br/><br/>Breaking through to the Heavenly Yuan creator realm required one’s mind and body to be one!<br/><br/>In other words, after one broke through, one’s life would change.<br/><br/>All of the Resurrection Treasures from before would lose their effectiveness and need to be renurtured.<br/><br/>Under such circumstances, the ultimate treasure of the Heaven’s origin was the weakest.<br/><br/>Once it died, it would truly die!<br/><br/>This was the reason why the Aga Heavenly Demon God was truly annihilated.<br/><br/>When Tianci made his breakthrough, Wang Xian brought people over to prevent any accidents from happening.<br/><br/>This was the protective array.<br/><br/>The true body of a heaven’s origin creation realm expert was extremely valuable.<br/><br/>During the calamity, there were indeed heavenly yuan creation realm experts who specialized in killing Heavenly Yuan creation realm experts who were in the midst of breaking through.<br/><br/>This was because at this time, their resurrection treasures would lose their effectiveness.<br/><br/>Of course, this time was very short.<br/><br/>As long as they refined them again and hid their resurrection treasures somewhere, it wouldn’t be a problem.<br/><br/>In addition, even if some experts had special resurrection treasures.<br/><br/>However, if he was killed after breaking through the Tianyuan blessed realm, even if he had special treasures to resurrect himself, his realm would drop completely.<br/><br/>It would be difficult for him to break through the Tianyuan blessed realm for the rest of his life.<br/><br/>That was because his foundation was completely destroyed.<br/><br/>The powerhouses of the Celestial Nation stood in the main hall and kept talking.<br/><br/>Their faces were filled with deep sighs!<br/><br/>Why was their celestial nation in such a miserable state?<br/><br/>Wang Xian did not care about the matters of the celestial nation. He brought Tianci to the position of the Dragon Palace.<br/><br/>“Dragon King. ”<br/><br/>Prime Minister Gui rushed over when he saw Wang Xian. He bowed to Wang<br/><br/>Xian!<br/><br/>“Dragon King, the king of the water phoenix is about to make a breakthrough. This is not a good thing for us!”<br/><br/>He frowned and said!<br/><br/>“In ten days, let the strong disciples of the Dragon Palace go and witness the birth of a strong cultivator in the heaven’s origin realm.”<br/><br/>Wang Xian smiled faintly as his eyes flickered.<br/><br/>He wanted to witness the birth of a strong cultivator in the heaven’s origin realm.., and the Fall!\t\t\t\t\t\t</div>", "images": {}, "success": true}