{"id": 1200, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074526.html", "title": "Chapter 4203 - Chapter 4203: 4202’S Powerful Suppression And Attack!", "volume": 12, "volume_title": "Volume 12", "body": "<h1>Chapter 4203 - Chapter 4203: 4202’S Powerful Suppression And Attack!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4203: 4202’s powerful suppression and attack!<br/><br/>Translator: 549690339<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>Terrifying energy raged. Around the altar, streams of terrifying energy attacked the two heaven origin creation realm experts of the belief universe.<br/><br/>That terrifying energy caused the surrounding chaotic energy to tremble.<br/><br/>“There are two or three control-level experts with deep foundations. We<br/><br/>Aren’t their opponents. Run! ”<br/><br/>When the waves of energy attacked them, the old man’s heart trembled again.<br/><br/>His expression was extremely ugly as he shouted in fear!<br/><br/>He did not understand why this was the case.<br/><br/>A small sword and magic universe, with only two existences that had just entered the Heavenly Kismet Realm.<br/><br/>He coveted this place and was already fully prepared.<br/><br/>In the end, there were suddenly so many powerful powerhouses who had entered the Heaven’s origin realm.<br/><br/>What was going on?<br/><br/>The old man and the middle-aged man fled directly in the direction of the Void Dragon.<br/><br/>According to his senses, that direction was the weakest and the easiest to break through.<br/><br/>However, when they flew toward the Void Dragon’s body.<br/><br/>This clone of Wang Xian let out a low roar. The dragon scales on his body released mirror-like fragments.<br/><br/>One by one, the space fragments charged towards them!<br/><br/>“Break through! ”<br/><br/>The old man let out a low roar. With a wave of his arm, a huge human-headed staff appeared in his hand.<br/><br/>He waved his staff forward. The human-headed staff released pure power of faith and attacked the space fragments!<br/><br/>Under their attacks, the densely packed space fragments shattered rapidly one by one.<br/><br/>They increased their speed and continued to fly forward.<br/><br/>“What?”<br/><br/>However, in the next moment, they were met with waves of attack energy.<br/><br/>This caused their expressions to change slightly.<br/><br/>“Father, our position has been changed! ”<br/><br/>The expression of the middle-aged man who was in the Heaven’s origin realm changed slightly. Similarly, he held a human-headed staff in his hand and waved it forward.<br/><br/>When they were attacking Wang Xian’s space fragments earlier, their position had changed unknowingly.<br/><br/>This was the control of the Void Dragon’s body over space!<br/><br/>They flew forward. In fact, they were heading towards the back.<br/><br/>Wang Xian and the rest’s attacks had arrived in front of them. The terrifying attacks made their faces extremely ugly.<br/><br/>These streams of energy were not something they could withstand.<br/><br/>An existence at the level of the Great Dao could easily kill an existence at the level of control.<br/><br/>Wang Xian’s strength was comparable to the level of the Great Dao.<br/><br/>The middle-aged man beside the old man was only at the beginner level.<br/><br/>His strength was inferior to Lin Niu and was only on the same level as Liu Lan.<br/><br/>Even Tianci could easily destroy him.<br/><br/>Not to mention, there were Lin Niu, Liu Lan, and hopeless heaven around them.<br/><br/>It was a huge suppression.<br/><br/>“Father, what should we do? They are very strong. We are not their match at all!<br/><br/>The middle-aged man who was in the Heaven’s origin realm resisted the attacks of Wang Xian and the rest with great difficulty. He even took out a defensive trump card.<br/><br/>However, the moment he took out his trump card, it was directly destroyed.<br/><br/>This caused a look of horror and horror to appear on his face.<br/><br/>Ever since he broke through to the Heaven’s origin, this was the first time he had encountered such a terrifying powerhouse!<br/><br/>“Don’t be stingy with your trump card. Just Run Away! ”<br/><br/>The old man blocked the attacks from Wang Xian and the rest. His body was sent flying under the attacks as he roared loudly!<br/><br/>His body shook and a cloud formed from the power of faith appeared!<br/><br/>The cloud started to spread out at a terrifying speed.<br/><br/>His body merged directly into the cloud and his position could not be seen at all!<br/><br/>“HMPH, you want to escape? If I let you escape today, it would be too embarrassing! ”<br/><br/>Wang Xian snorted coldly when he saw this scene.<br/><br/>He flapped his incorporeal holy wings and extended his Dragon Claw!<br/><br/>An extremely huge dragon claw clawed at the cloud!<br/><br/>The Five Elements Millstone and the Tai Chi Dragon Plate followed the position of Wang Xian’s Dragon Claw and attacked!<br/><br/>Liu Lan, the Hopeless Heaven Kylin Bull, and the rest unleashed an area-of-effect attack that covered the entire cloud!<br/><br/>“Faith, Chant! ”<br/><br/>The elder who was in the clouds sensed the attacks from all directions and let out a low roar!<br/><br/>“Buzz Buzz Buzz! ”<br/><br/>“Buzz Buzz Buzz! ”<br/><br/>In the next instant, the whispers of the believers were heard continuously.<br/><br/>Waves of special energy attacks were transmitted into the ears of Wang Xian and the rest.<br/><br/>This voice was filled with bewitchment and temptation!<br/><br/>It caused Wang Xian and the rest to fall into a momentary daze!<br/><br/>Buzz<br/><br/>In just an instant, the branches of the soul-returning wood on the ancestral tree trembled and he regained his clarity!<br/><br/>By the time he regained his clarity, the huge cloud had already broken free from their blockade!<br/><br/>“Wind and thunder, show yourself!”<br/><br/>Wang Xian focused his gaze. The inoriginator holy wings burst out with a dazzling light of wind and thunder!<br/><br/>Amidst the clouds, two figures appeared with a striking light of wind and thunder!<br/><br/>God-striking! ”<br/><br/>Not far away, Tianci had also recovered. With a wave of his arm, the branches in his hand struck at the two figures!<br/><br/>“Father, save me!”<br/><br/>In an instant, a scream sounded out. Under the attack of the god-striking branches, the middle-aged heavenly Yuan creator’s body was rapidly torn apart!<br/><br/>It looked extremely miserable!<br/><br/>His life force was also quickly dissipating!<br/><br/>“Believers, bless! ”<br/><br/>The old man’s face was filled with fear as his body released an extremely dense power of faith.<br/><br/>The Shadows of countless believers appeared above him.<br/><br/>One by one, the believers prostrated on the ground and chanted softly.<br/><br/>Streams of power of faith enveloped their surroundings and protected them tightly!<br/><br/>At this moment, Wang Xian flew over instantly. The dragon horns emitted a glow and attacked their location!<br/><br/>“Crack! Crack! Crack!”<br/><br/>The light and dark energy swept past. The attack from the blessing of the Believers was instantly broken!<br/><br/>The old man spat out a large amount of blood instantly.<br/><br/>The Shadows of the believers in the sky fell one after another!<br/><br/>The moment the old man spat out blood, the body of the void God Dragon appeared in the old man’s hands.<br/><br/>A dragon claw slashed across the middle-aged man beside him.<br/><br/>“Father! ”<br/><br/>The middle-aged man roared. There was no time for him to dodge, so the Dragon Claw grabbed him and took him away!<br/><br/>The terrifying power of space consumed his life force.<br/><br/>The middle-aged man, who had been heavily injured by God’s will, was instantly killed!<br/><br/>“Damn it, who are you people? How dare you ruin the Good Thing of our belief universe?”<br/><br/>The Old Man’s face changed when he saw this scene, and he roared angrily!<br/><br/>“Hehe, since you dare to covet other universes, We Can’t Kill You? Die, Old<br/><br/>Wang Xian moved and appeared in front of the old man in an instant.<br/><br/>His dragon claws landed on the top of the old man’s head.<br/><br/>“Divine Dragon, you are the Divine Dragon of the nine-origin universe. I will remember all of you! ”<br/><br/>The old man stared at Wang Xian with blood-red eyes and roared loudly.<br/><br/>“Those who believe in me will live forever. Return to the Holy Church! ” The old man roared and a white black hole appeared on his body!<br/><br/>His entire body was instantly sucked away by the black hole!\t\t\t\t\t\t</div>", "images": {}, "success": true}