{"id": 1208, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074558.html", "title": "Chapter 4211 - Chapter 4211: 4,210 Kills", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4211 - Chapter 4211: 4,210 Kills</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4211: 4,210 kills<br/><br/>Translator: 549690339<br/><br/>Wang Xian’s last sentence was extremely overbearing.<br/><br/>It was even a little unreasonable!<br/><br/>The Dragon Palace could decide who would get the spot that was vacated by the Divine Dragon Clan?<br/><br/>This was obviously a joke.<br/><br/>However, as long as one was strong enough, this was not a joke!<br/><br/>Without my permission, you can not achieve a breakthrough.<br/><br/>If you achieve a breakthrough, I will kill you on the spot!<br/><br/>This is strength!<br/><br/>Wang Xian’s words entered everyone’s ears.<br/><br/>What happened just now happened in an instant.<br/><br/>All the strong disciples did not react in time.<br/><br/>Now that they had reacted, they were all dumbfounded!<br/><br/>All of them widened their eyes. They did not even dare to breathe!<br/><br/>However, in the middle of the scene, from the Celestial Nation, the sound of rapid breathing could be heard continuously.<br/><br/>The top experts of the celestial nation widened their eyes as they watched the scene in front of them.<br/><br/>The Water Phoenix King was killed by the Dragon King!<br/><br/>After he broke through to the Heavenly Yuan Destiny Realm, he was killed!<br/><br/>He was completely killed!<br/><br/>The water attribute slot was empty again.<br/><br/>Furthermore, the Dragon King said to let the floating water queen break through.<br/><br/>This also meant that this quota would be theirs!<br/><br/>Their celestial nation was about to give birth to a heavenly yuan creation realm expert.<br/><br/>This made them so excited that they trembled and their breathing became extremely rapid.<br/><br/>In addition, the Dragon King had just killed a heavenly yuan creation realm expert, which made everyone feel shocked.<br/><br/>It was unbelievable!<br/><br/>How did the Dragon King do it?<br/><br/>The Heaven’s origin creator, who was high and mighty just a moment ago, was killed by the Dragon King.<br/><br/>Dragon King, this was too strong!<br/><br/>“Dragon King of the Dragon Palace, i, Feng Qing Lou, can not live under the same sky as you! ”<br/><br/>When the Emperor of Phoenix heard this, his body trembled as he roared furiously!<br/><br/>“Dragon King, you are a little overbearing. You have gone too far! ” At this moment, the Hetian saint could not help but say something!<br/><br/>“Hehe! ”<br/><br/>When Wang Xian heard the words of the Hetian saint, he smiled faintly and said, “My Dragon Palace has a grudge with the Phoenix clan. This Water Phoenix King deserves to die! ”<br/><br/>“I really didn’t expect that your strength would increase so quickly. In such a short period of time, you have almost surpassed me. You Are Really Amazing! ”<br/><br/>The Fallen Shadow Demon Emperor looked at Lin Niu and tianci. His gaze landed on Wang Xian as he sighed.<br/><br/>When Wang Xian made his move just now, he was also extremely shocked.<br/><br/>He had captured the spatial energy, which belonged to the spatial power of a heaven origin creator.<br/><br/>In addition, the strength that Wang Xian had unleashed just now was able to kill a heaven origin creator in an instant. In his opinion, it was already close to the power of the Great Dao.<br/><br/>In fact, it had already reached the Great Dao realm.<br/><br/>Other than that, one of the Dragon King’s subordinates and an adopted son were originally heaven origin creator powerhouses from other universes. However, they were able to unleash all their strength in the nine-origin universe.<br/><br/>He guessed that this should be the power of the Heaven’s origin manifestation treasure.<br/><br/>One of his underlings, along with the adopted son who possessed the Heaven’s origin manifestation treasure, the fallen Shadow Demon Emperor felt that he wouldn’t be able to gain any benefits even if he met the Dragon King and the rest.<br/><br/>This power was too strong!<br/><br/>“Senior fallen Shadow Demon Emperor, you are too awesome. There is still a distance between us! ”<br/><br/>Wang Xian looked at fallen shadow demon Emperor and said politely.<br/><br/>In the nine-origin universe, only fallen Shadow Demon Emperor was stronger than him.<br/><br/>He had to be a little wary.<br/><br/>Wang Xian had already surpassed the other heaven origin destiny realm powerhouses!<br/><br/>The only thing he had to care about was fallen shadow demon Emperor’s attitude.<br/><br/>Besides, it was a good thing for the nine-origin universe that he had become stronger.<br/><br/>The other Heavenly Yuan creation realm powerhouses in the nine-origin universe wouldn’t offend him for the sake of the Phoenix race.<br/><br/>“How… How is this possible?”<br/><br/>The emperor of the Phoenix widened his eyes and roared in disbelief when he heard the fallen Shadow Demon Emperor’s words!<br/><br/>How was this possible?<br/><br/>The Dragon King of the Dragon Palace’s strength was actually close to the Fallen Shadow Demon Emperor?<br/><br/>How was this possible?<br/><br/>How long had he been cultivating?<br/><br/>However, when he thought about how the Water Phoenix King was killed in an instant, his expression began to change drastically.<br/><br/>Below the Water Phoenix King was the strongest defensive formation of the Phoenix clan.<br/><br/>It would take a few seconds for a control-level cultivator to break through it.<br/><br/>But just now, even the Dragon King wasn’t able to block the formation’s defense in an instant!<br/><br/>This power was terrifying!<br/><br/>It was not something that a controlling level heaven origin creator could possess!<br/><br/>Around them, the elven empress, the 12th ancestor of the Hetian saint, Wu Xuanwu, the ancestor of the Angels, the Emperor of angels, and the rest of the heaven origin creator powerhouses sucked in a breath of cold air.<br/><br/>They looked at Wang Xian in shock.<br/><br/>The current Dragon King had already surpassed them?<br/><br/>He was already close to the Great Dao level?<br/><br/>This? ?<br/><br/>They thought of the Dragon King’s subordinates and adopted son who had exploded with power.<br/><br/>The Dragon King’s subordinates belonged to the experts of the Dragon Palace.<br/><br/>The adopted son of the Dragon King wasn’t an ordinary adopted son either. That kind of relationship could be said to be the Dragon King’s biological son!<br/><br/>To a certain extent, the Dragon King’s adopted son was also an expert of the Dragon Palace.<br/><br/>With the addition of the two of them, the strength of the Dragon Palace was unstoppable!<br/><br/>Even if the demon clan encountered the Dragon Palace, they wouldn’t be able to gain any advantage.<br/><br/>“Our Water Phoenix King was killed by the Dragon King! ”<br/><br/>At the Phoenix clan.<br/><br/>All the experts of the Dragon clan reacted.<br/><br/>They looked at everything in disbelief.<br/><br/>Everything had changed too quickly.<br/><br/>They had been celebrating excitedly just now.<br/><br/>But in the next second, their water Phoenix King was killed by the Dragon King!<br/><br/>Killed by force.<br/><br/>In an instant.<br/><br/>The Dragon King of the Dragon Palace was terrifyingly powerful.<br/><br/>And from the conversation of the Heavenly Yuan creation realm powerhouses, this dragon king was extremely terrifying.<br/><br/>Even the strongest fallen Shadow Demon Emperor was a little afraid!<br/><br/>“Boom!”<br/><br/>Just as all the powerhouses and disciples were shocked!<br/><br/>Just as the Phoenix clan was panicking…<br/><br/>At the celestial Nation!<br/><br/>A terrifying aura surged from queen floating water’s body.<br/><br/>Following that, he flew straight up into the sky as strands of terrifying energy stirred.<br/><br/>Queen floating water did not make a breakthrough immediately. Instead, she looked at Wang Xian.<br/><br/>“Dragon King, I have just realized something. I can make a breakthrough at any time now! ”<br/><br/>The Queen of the floating waters spoke!<br/><br/>“Let me protect your formation. Break through! ”<br/><br/>Wang Xian looked at the queen of the floating waters and nodded at her.<br/><br/>“Thank you, Dragon King! ”<br/><br/>The Queen of the floating waters was filled with gratitude.<br/><br/>Although the Dragon King had invested in her and made a deal with her, it was still a deal.<br/><br/>However, if it wasn’t for the Dragon King, she wouldn’t be able to break through!<br/><br/>She had already experienced the ups and downs!<br/><br/>At this moment, she was filled with gratitude towards the Dragon King!<br/><br/>Queen floating water knelt on the ground and kowtowed to Wang Xian.<br/><br/>The highest level of etiquette!<br/><br/>Just now, the king of the Water Phoenix didn’t even bow to the Dragon King!<br/><br/>But now, the king of the Water Phoenix who was about to achieve a breakthrough directly kowtowed to the highest level!<br/><br/>“Thank you, Dragon King! ”<br/><br/>Over at the Celestial Nation, the elder brother of the Queen of the floating water, the top experts of the celestial nation.<br/><br/>At this moment, they were so excited that they even shed tears.<br/><br/>They directly knelt down on the ground and followed the queen of the floating water to kneel and worship!<br/><br/>The Willows and the flowers are bright again!\t\t\t\t\t\t</div>", "images": {}, "success": true}