{"id": 1207, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074554.html", "title": "Chapter 4210 - Chapter 4210: 4209 Suppression, Overbearing", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4210 - Chapter 4210: 4209 Suppression, Overbearing</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4210: 4209 suppression, overbearing<br/><br/>Translator: 549690339<br/><br/>“Phoenix cries to the nine heavens, our water phoenix king has broken through. Our Phoenix Race’s second Tianyuan creation has been born! ” From the Phoenix race’s side, an extremely excited voice sounded.<br/><br/>All the experts of the Phoenix race revealed excited expressions.<br/><br/>“Today, this king has broken through to the Tianyuan creation realm. Together with our emperor, we will protect our Phoenix race. Anyone who dares to harm our Phoenix race will be killed! ”<br/><br/>“Today, this king has broken through. If any of the little generals retreat, our<br/><br/>Phoenix race will become stronger and stronger! ”<br/><br/>The Water Phoenix king floated in the air with an extremely excited expression.<br/><br/>He had broken through!<br/><br/>He had broken through to the Heavenly Yuan Destiny Realm!<br/><br/>From now on, he would stand tall between heaven and earth!<br/><br/>He would become the Phoenix race, a peak existence in the nine origin universe!<br/><br/>At this moment, he was filled with pride.<br/><br/>His heart was filled with fighting spirit.<br/><br/>Feeling the energy in his body, he had a feeling of invincibility!<br/><br/>Those who had not reached the heavenly yuan destiny realm were all mortals!<br/><br/>“Haha, Good, Good!”<br/><br/>When the Emperor of the Phoenix saw this scene, his face was filled with excitement as he shouted loudly!<br/><br/>“Congratulations to the Water Phoenix King for advancing to the Heavenly<br/><br/>Yuan Destiny Realm! ”<br/><br/>“Congratulations to the Water Phoenix King for advancing to the Heavenly<br/><br/>Yuan Creation Stage! ”<br/><br/>All the powerful disciples of the Phoenix clan loudly shouted as they directly knelt on the ground.<br/><br/>One had to kneel in front of a heavenly Yuan creation stage expert!<br/><br/>All the powerful disciples of the other clans also knelt respectfully.<br/><br/>However, all the powerful disciples of the Dragon Palace stood indifferently in front of the group of peak clans. They did not offer any congratulations or kneel!<br/><br/>Okay!<br/><br/>The king of the Water Phoenix looked down and raised his head slightly. A smile appeared on his face.<br/><br/>This was the courtesy of a heaven origin creator!<br/><br/>All the strong disciples in the nine-origin universe had to kowtow to him!<br/><br/>“Huh? Why? Do the disciples of the Dragon Palace not know their manners?” However, when he saw the Dragon Palace, he spoke coldly!<br/><br/>“Disrespectful to the Heaven’s origin creator, you should be executed!”<br/><br/>The Emperor of Phoenix looked at this scene and turned to Wang Xian with a smile.<br/><br/>Lin Niu had said this just now. Now, he was going to return the favor!<br/><br/>Furthermore, the king of the Water Phoenix was a heaven’s origin creator, so he could be disrespectful.<br/><br/>However, the disciples of the Dragon Palace must know how to respect! “That’s right. Disrespectful to the Heaven’s origin creator, you should be executed! ”<br/><br/>Wang Xian looked at the king of Phoenix and nodded with a faint smile.<br/><br/>The moment he finished his sentence, Wang Xian’s figure had already disappeared instantly!<br/><br/>The Fallen Shadow Demon Emperor, who was sitting in the middle, was slightly stunned. His eyebrows twitched and his eyes were filled with astonishment. He immediately looked up!<br/><br/>The sound of the formation breaking rang out, causing everyone to be slightly stunned.<br/><br/>Where did the sound come from?<br/><br/>What was this? What was going on?<br/><br/>At the surrounding area, all the strong disciples did not manage to react in time.<br/><br/>They could not see any of Wang Xian ‘s movements at all.<br/><br/>It was too fast!<br/><br/>At the group of Heaven’s origin destiny realm powerhouses, they only managed to react when the sound rang out. They quickly looked over!<br/><br/>In the next instant, their eyes widened. They were filled with disbelief and shock!<br/><br/>When they looked at the king of the Water Phoenix in the sky.<br/><br/>Another voice sounded.<br/><br/>Following that, a shocking scene appeared!<br/><br/>In the sky, the king of the Water Phoenix still had a smile on his face!<br/><br/>However, at this moment, his head and body had been separated!<br/><br/>Wang Xian held the head of the king of the water phoenix in his hand and floated quietly in the air.<br/><br/>Fast, too fast!<br/><br/>Everything happened in the blink of an eye!<br/><br/>Before all the strong disciples could react, the head of the king of the Water Phoenix had already been beheaded!<br/><br/>“Disrespectful to the strong practitioners of the Heaven’s origin realm, you shall be beheaded. You will be disrespectful to me for the strong practitioners of the Heaven’s origin realm. You shall be beheaded as well. I will behead you after you break through. You can rest in peace! ”<br/><br/>Wang Xian stared at the head of the King of the Water Phoenix and said indifferently.<br/><br/>His voice entered everyone’s ears.<br/><br/>However, this sentence was like a bomb that rang in everyone’s mind!<br/><br/>“No, no, no, no!”<br/><br/>The life force of the king of the Water Phoenix had yet to completely disappear.<br/><br/>He sensed his own situation and saw the Dragon King in front of him. Even his soul was trembling!<br/><br/>How was this possible!<br/><br/>No, no!<br/><br/>He had just broken through to the Heaven’s origin manifestation stage.<br/><br/>He didn’t want to die!<br/><br/>He couldn’t die!<br/><br/>Once he died, he would really die!<br/><br/>stop!<br/><br/>At this moment, the Emperor of the Phoenix also reacted. His eyes instantly turned blood red as he roared!<br/><br/>All the auras belonging to the Heavenly Yuan creation realm instantly erupted!<br/><br/>“Boom!” “Boom Boom! ”<br/><br/>“Boom Boom! ”<br/><br/>However, when his aura erupted, Lin Niu and Tianci who were sitting at the side immediately stood up.<br/><br/>Behind tianci, the image of an incomparably sharp ancient tree slowly emerged!<br/><br/>In an instant, a terrifying power enveloped the entire world!<br/><br/>“You have just broken through to the Heaven’s origin blessed realm and you dare to be so arrogant. I will crush an ant like you to death! ”<br/><br/>Wang Xian glanced at the emperor of the Phoenix and his gaze landed on the king of the Water Phoenix.<br/><br/>A surge of energy surged directly into his head and body.<br/><br/>It was annihilated! “Ahhhhh! ”<br/><br/>“No…”<br/><br/>An incomparably miserable cry rang out.<br/><br/>However, the sound only lasted for an instant!<br/><br/>His life force vanished violently.<br/><br/>The emperor of Phoenix stood there. His body was trembling violently and his entire body was trembling!<br/><br/>He could sense that the life force of the king of Water Phoenix was disappearing.<br/><br/>He felt the terrifying energy that was locked onto him by the side. He was alarmed.<br/><br/>“Lord Shadow Devil Emperor, everyone…”<br/><br/>The Emperor of Phoenix immediately looked at Shadow Devil Emperor and the rest of the heaven origin creation realm experts and said!<br/><br/>“Dragon King, the calamity is coming. As heaven origin creation realm experts in the nine-origin universe, we shouldn’t kill each other! ”<br/><br/>Black Tortoise’s ancestor frowned and couldn’t help but say!<br/><br/>He stood up and emitted a powerful aura.<br/><br/>It was forbidden to commit suicide and slaughter. This was the rule among the heaven origin manifestation powerhouses in the nine-origin universe.<br/><br/>If such a thing happened, all of them would stop it!<br/><br/>Xuanwu’s patriarch stood up. The other heaven origin manifestation powerhouses also stood up slowly.<br/><br/>However, the fallen Shadow Demon Emperor sat there and did not move. He looked at Wang Xian and shook his head helplessly.<br/><br/>“Dragon King, we are both heaven origin creation realm powerhouses. We can not kill each other. If you kill him, our nine-origin universe will lose one heaven origin creation realm powerhouse! ”<br/><br/>The Fallen Shadow Demon Emperor said.<br/><br/>“It’s alright. It’s just a powerhouse who has just stepped into the heaven origin creation realm. Let queen of floating water fill this spot. Queen of floating water will be able to break through in a few days! ”<br/><br/>Wang Xian saw a group of heaven origin creation realm powerhouses stand out and looked at the fallen Shadow Demon Emperor. He smiled faintly and said nonchalantly!<br/><br/>“Also, the water attribute slot was vacated by the Divine Dragon Clan. The Phoenix clan doesn’t have the right to occupy it! ”<br/><br/>Wang Xian said faintly at the end.<br/><br/>It was a very domineering and extremely domineering sentence!\t\t\t\t\t\t</div>", "images": {}, "success": true}