{"id": 1209, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074562.html", "title": "Chapter 4212 - Chapter 4212: 4211 Dragon King, Do You Want To Destroy The Phoenix Clan?", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4212 - Chapter 4212: 4211 Dragon King, Do You Want To Destroy The Phoenix Clan?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4212: 4211 Dragon King, do you want to destroy the Phoenix Clan?<br/><br/>Translator: 549690339<br/><br/>“Our Immortal Empire’s floating queen is about to break through?”<br/><br/>Over at the immortal empire, all the strong disciples were stunned.<br/><br/>The Disciples of the Immortal Empire didn’t know that their floating queen was about to break through.<br/><br/>Now, the scene in front of them shocked them.<br/><br/>“Kneel down and thank the Dragon King! ”<br/><br/>An expert shouted in a low voice and kneeled on the ground, kowtowing.<br/><br/>“Thank you, Dragon King! ”<br/><br/>“Thank you, Dragon King! ”<br/><br/>All the disciples of the Celestial Nation kneeled on the ground. They were a little absent-minded, but also a little excited.<br/><br/>Their celestial nation was going to have one more heavenly Yuan creation realm expert!<br/><br/>Their celestial nation had completely stood at the peak!<br/><br/>At the surrounding area, the disciples of all the races were a little dazed when they saw this scene.<br/><br/>This was Phoenix Mountain.<br/><br/>It was the Water Phoenix king who had broken through.<br/><br/>They were also here to participate in the Water Phoenix King’s ascension ceremony.<br/><br/>In the end, they didn’t expect the water Phoenix King to be directly killed by the Dragon King.<br/><br/>The floating water queen continued to break through to the Heavenly Yuan creation realm!<br/><br/>“The Dragon King’s strength is too terrifying. ”<br/><br/>“He actually killed the water phoenix king and allowed the floating water queen to break through, allowing the floating water queen to occupy this spot in the Heavenly Yuan Destiny Realm. This is too powerful, too terrifying! ”<br/><br/>“Hiss, the Dragon King’s current might is too terrifying. On your stands, one of them is the Dragon King’s Mount, a Lord of the Heavenly Yuan Destiny<br/><br/>Realm. The other is the Dragon King’s foster son, a Lord of the Heavenly Yuan<br/><br/>Destiny Realm from the other universes. This might is too powerful. ”<br/><br/>“It’s said that the fallen Shadow Demon Emperor is the oldest and most powerful existence in our nine-origin universe, but now, the fallen Shadow Demon Emperor seems to be a little afraid of the Dragon King! ”<br/><br/>All the powerful disciples around couldn’t help but discuss in low voices.<br/><br/>Everything that had happened today was too shocking for them! The Dragon King’s tyranny also made them feel deep respect.<br/><br/>“Boom! Boom!”<br/><br/>After kneeling down, queen floating water immediately stood up and broke through.<br/><br/>A terrifying aura started to brew once again.<br/><br/>Just as the Water Phoenix King broke through, she was instantly killed and queen floating water continued to break through!<br/><br/>In just a few short hours, two heavenly yuan creation realm experts broke through!<br/><br/>And one of them had already been killed.<br/><br/>“The celestial nation’s queen floating water is breaking through. After she breaks through, the water attribute slot will belong to her!”<br/><br/>Over at the Phoenix clan, all the phoenixes saw that the experts of the celestial nation had broken through at their Phoenix Mountain.<br/><br/>After their water Phoenix King was killed, they felt extremely humiliated.<br/><br/>Killing and killing!<br/><br/>stop!<br/><br/>When the Phoenix Emperor saw that the water queen had broken through here, his expression changed drastically. His eyes turned blood-red as he roared.<br/><br/>He wanted to move, but at this moment, Wang Xianlin ox and Tianci’s gazes landed on him.<br/><br/>A threat of death appeared in his mind.<br/><br/>He was certain that if the Dragon King and the rest wanted to make a move, he wouldn’t even have the chance to resist or escape.<br/><br/>“Hu hu!”<br/><br/>He began to breathe rapidly as he looked at the fallen Shadow Demon Emperor and the rest.<br/><br/>“Everyone, the Dragon King of the Dragon Palace killed a heaven’s origin creation stage powerhouse of my Phoenix clan and openly broke the rules. Are We just going to let this go?”<br/><br/>The Emperor of Phoenix asked in a low voice with an embarrassed expression.<br/><br/>When the calamity was about to arrive and the calamity erupted, the rules of the nine-origin universe forbade any infighting among Heaven’s origin creation stage powerhouses.<br/><br/>Now, Wang Xian had already broken the rules.<br/><br/>When the fallen Shadow Demon Emperor heard his words, he looked at Wang Xian.<br/><br/>His eyes flickered slightly, but he did not speak.<br/><br/>“Feng Qing Lou, how did Shui Yun Die? What exactly happened back then?<br/><br/>Also, it’s just a matter of time before you become a heaven-origin creator. You Can ‘t be disrespectful to a heaven-origin creator. ”<br/><br/>At the side, the elven empress suddenly asked the Emperor of Phoenix.<br/><br/>The Elven race used to have a good relationship with the Divine Dragon Race.<br/><br/>Now, the relationship between the Dragon Palace and the elven race was also good.<br/><br/>At this time, the Elven empress speaking was undoubtedly a stance.<br/><br/>It was a bias.<br/><br/>In the nine-origin universe, the relationship with the Dragon Palace was relatively good. It was between the elven race and the Wizard race.<br/><br/>The Wizard race was friendly with the Dragon Palace and had something to do with the blessed land that the Elemental God had turned into. Both sides had mutual interests.<br/><br/>The strength of the skeleton clan and the Dragon Palace could be considered decent.<br/><br/>“I don’t know anything about the Divine Dragon Clan! ”<br/><br/>The emperor of Phoenix’s expression darkened when he heard the elven empress suddenly speak. His expression was extremely unsightly as he replied.<br/><br/>At this moment, he had a bad premonition in his heart!<br/><br/>“The calamity is about to arrive. In our nine-origin universe, peace is the most important thing. The overall situation is the most important! ”<br/><br/>The Hetian saint was a good person. He glanced at them and said.<br/><br/>“The Hetian Saint, don’t tell me that the Heaven origin creator of our Phoenix<br/><br/>Tribe is dead?”<br/><br/>The Emperor of the Phoenix looked at him and said.<br/><br/>“Dragon King, give us an explanation. Give the Phoenix tribe an explanation! ” The Hetian Saint looked at Wang Xian and said!<br/><br/>Wang Xian glanced at the Hetian saint and was very familiar with his way of doing things.<br/><br/>Back then, before he had reached the dominator level, he had heard all sorts of legends about the unity saint.<br/><br/>Wang Xian had a good impression of him.<br/><br/>He was a pretty good saint.<br/><br/>“Hehe, let’s talk about it after the queen of the floating waters has made a breakthrough! ”<br/><br/>Wang Xian smiled and said!<br/><br/>After he finished speaking, he looked at the place where the Queen of the floating waters was.<br/><br/>The unity saint was deep in thought. After that, he nodded and watched quietly as well.<br/><br/>The rest of the Heavenly Yuan creation realm powerhouses didn’t say anything.<br/><br/>Now, they could see the situation very clearly.<br/><br/>The Dragon King’s power was beyond their imagination and expectations.<br/><br/>In addition, the Dragon King’s mount and his foster son were also very powerful.<br/><br/>Especially his foster son.<br/><br/>Most importantly, they were all able to burst out with all their strength in the nine-origin universe and not be suppressed by the power of the universe.<br/><br/>This was very terrifying.<br/><br/>The Dragon King of the Dragon Palace was too powerful.<br/><br/>Even though they had a good relationship with the emperor of the Phoenix in the past, they didn’t say anything at this moment.<br/><br/>All the powerful disciples in the surroundings also quieted down and stared blankly at the breakthrough of the Floating Queen of the Celestial Nation in the sky!<br/><br/>The powerful breakthrough power appeared again.<br/><br/>The Floating Queen began to transform!<br/><br/>But at this moment, all the powerful disciples of the Phoenix clan felt very uncomfortable when they saw this scene.<br/><br/>They even had a bad premonition in their hearts.<br/><br/>The celestial nation’s Floating Queen’s breakthrough would definitely be on the Dragon King’s side.<br/><br/>At that time, their celestial nation would have one more enemy!<br/><br/>“Boom, Boom, Boom! ”<br/><br/>The power of the breakthrough continued for dozens of minutes.<br/><br/>The Queen of the floating water tribe had completely transcended.<br/><br/>She was floating in the air, emitting a powerful aura.<br/><br/>Below, all the strong disciples of the Celestial Nation were trembling in excitement.<br/><br/>“Floating water tribe, we have succeeded in breaking through! ”<br/><br/>One of the elder brothers of the Queen of the floating water tribe said excitedly.<br/><br/>The Queen of the floating water tribe in the sky was also excited and happy.<br/><br/>She slowly looked in the direction of Wang Xian.<br/><br/>“Dragon King, do you want to destroy the Phoenix Clan?”\t\t\t\t\t\t</div>", "images": {}, "success": true}