{"id": 1204, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074542.html", "title": "Chapter 4207 - Chapter 4207: The Birth And Fall Of 4206", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4207 - Chapter 4207: The Birth And Fall Of 4206</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4207: The birth and fall of 4206<br/><br/>Translator: 549690339<br/><br/>Although the breakthrough of the King of the Water Phoenix had some impact on Wang Xian’s plans.<br/><br/>However, the impact was not too great!<br/><br/>Since he had decided to make a move, there was no need for Wang Xian to give up on this matter.<br/><br/>It was just that he had one more powerhouse who had just stepped into the destiny realm of the Heaven’s origin!<br/><br/>Should he just kill him directly?<br/><br/>When the time came, Wang Xian would make a move instantly and kill him directly. After all was said and done, who would have any objections?<br/><br/>Would the nine-origin universe be short of a Heaven’s origin creation?<br/><br/>It would be fine as long as the queen of floating water took over!<br/><br/>Everything depended on one’s strength. Wang Xian felt that he had to display his strength and dignity appropriately!<br/><br/>“Oh? It’s the Dragon King! ”<br/><br/>Prime Minister Gui was slightly taken aback when he saw Wang Xian s expression. He then nodded his head immediately.<br/><br/>A Battle of this level was not something that the current strong disciples of the Dragon Palace could participate in.<br/><br/>He only needed to be responsible for the matters of the disciples of the Dragon Palace.<br/><br/>As for the rest, the Dragon King would decide for himself!<br/><br/>“The Water Phoenix King is actually going to break through. These three have the best chance of breaking through to the Heavenly Yuan Destiny Realm. I didn’t expect the Water Phoenix King to take this step ahead of Time!” “Amazing. Once the Water Phoenix King breaks through, the Phoenix clan will have two heavenly yuan destiny realm experts. That’s two! ”<br/><br/>“Recently, due to the rise and power of the Dragon Palace, the Phoenix clan has been keeping a low profile. Now that the Water Phoenix King has broken through, the Phoenix Clan will have two Heavenly Kismet realm experts. By then, they won’t have to fear the dragon palace at all! ”<br/><br/>“At least they won’t be as low profile as before. Now, I reckon that even if the water phoenix king breaks through, there’s still a gap between them and the Dragon King. However, this gap is no longer as exaggerated as before! ”<br/><br/>“After the Dragon Palace, the Phoenix clan is the only one among the peak races that has two heaven origin destiny realm experts. In the future, the Phoenix clan will probably become stronger and stronger! ”<br/><br/>“The Dragon Palace and the Phoenix clan have a grudge. In the past, they could easily suppress it, but now it’s going to be difficult to come to an end!”<br/><br/>In the tree of chaos, all the strong disciples of the major races were constantly discussing.<br/><br/>The Phoenix clan giving birth to a heavenly fate expert was a huge event for any of the powerful disciples in the nine-origin universe.<br/><br/>Especially since the Phoenix clan had a huge grudge with the Dragon Palace.<br/><br/>All the powerful disciples in the nine-origin universe were clear about this grudge.<br/><br/>This was definitely not something that the angel clan could easily resolve.<br/><br/>The grudge between the Angel clan and the Dragon Palace was something that the Angel clan had always been at a disadvantage, as long as they were willing to accept it.<br/><br/>However, the Dragon Palace and the Phoenix race were different. This was related to the destruction of the Divine Dragon Race.<br/><br/>It definitely wouldn’t be so easy to resolve!<br/><br/>“However, no matter what, the Dragon Palace and the Phoenix race should be in a stalemate in the future. This situation should also be in a stalemate for a long time. After all, it’s too difficult to kill a heaven origin creation realm expert! ”<br/><br/>An expert said in the end.<br/><br/>The calamity was about to arrive, so the enmity between the Dragon Palace and the Phoenix clan would be temporarily put on hold.<br/><br/>Time passed day by day.<br/><br/>All the expert disciples discussed the Water Phoenix clan’s breakthrough every day.<br/><br/>On the other hand, the Phoenix clan’s expert disciples excitedly began to set up.<br/><br/>The breakthrough would be in the nine-origin universe!<br/><br/>Naturally, the Phoenix clan had to choose their Phoenix Mountain as the location for the breakthrough!<br/><br/>At present, the various peak races had already established a long-distance teleportation array from the tree of chaos to their nest.<br/><br/>As long as they passed through the teleportation array, they would be able to reach Phoenix Mountain in an instant.<br/><br/>Furthermore, they had made a lot of preparations for the Water Phoenix King’s breakthrough ceremony this time.<br/><br/>They had made a lot of modifications.<br/><br/>They were going to show the dignity and imposing manner of the Phoenix clan.<br/><br/>“I’ve been a bit sullen recently. Now that the Water Phoenix King has made a breakthrough, we won’t be afraid of the Dragon Palace Anymore! ”<br/><br/>“That’s right. The experts and disciples of the Dragon Palace have been a bit arrogant recently. If they dare to be arrogant in front of us in the future, we’ll teach them a good lesson. It’s just a small Dragon Palace! ”<br/><br/>“Haha, No Matter What, our Phoenix Clan’s strength in the nine-origin universe will increase greatly. Let the Dragon Palace take a good look this time!<br/><br/>The experts and disciples of the Phoenix clan were also very excited.<br/><br/>They had been very sullen recently because of the Dragon Palace.<br/><br/>Now, the Dragon Palace still dared to be arrogant?<br/><br/>The number of heavenly yuan fortunes of the Phoenix clan was no less than that of the Dragon Palace!<br/><br/>Compared to the celebration and excitement of the Phoenix clan, the immortal nation was a little gloomy and worried.<br/><br/>Fortunately, only the top experts of the immortal nation knew about queen floating water’s breakthrough.<br/><br/>“Today, the teleportation array of the Phoenix clan has been opened. We welcome all the disciples of the clan to come and worship the Water Phoenix<br/><br/>King of the Phoenix clan for his breakthrough. ”<br/><br/>On the ninth day, another voice came from the Phoenix race!<br/><br/>The voice resounded throughout the entire tree of chaos.<br/><br/>The Phoenix race’s teleportation array had been opened!<br/><br/>Within the tree of chaos, all the powerful disciples heard the news and did not hesitate at all. They immediately flew towards the teleportation array.<br/><br/>The breakthrough of a heaven origin creation realm expert!<br/><br/>This was a grand occasion!<br/><br/>Who did not want to see it?<br/><br/>Who did not want to see it?<br/><br/>Moreover, the birth of a Heavenly Yuan creation realm expert, they also needed to go over and worship it.<br/><br/>This was also the unspoken rule of the nine-origin universe!<br/><br/>One after another, the powerful disciples rushed over. For example, the weaker peak races of the Divine Tiger clan, the powerful disciples of the clan all rushed over.<br/><br/>The powerful disciples of the various peak races rushed over.<br/><br/>At the Dragon Palace, Prime Minister Gui led most of the strong disciples and flew towards the teleportation formation.<br/><br/>“Are all the strong ones in the Heaven’s origin realm here?”<br/><br/>“Yes. Recently, all the strong ones in the Heaven’s origin realm are around the universe. The birth of a strong one in the Heaven’s origin realm is a major event. Naturally, all of them are here.”<br/><br/>At the Dragon Palace, Wang Xian and the elven empress were talking through the communication stone plate.<br/><br/>Wang Xian was asking about some things.<br/><br/>All the powerhouses in the Heaven’s origin realm in the nine-origin universe were here.<br/><br/>“It’s good that they are all here! ”<br/><br/>Wang Xian smiled, he looked at the heaven-bestowed qilin cow and said, “Let’s go. When the time comes, I’ll use the ancestral tree to connect to the same root in your body. When I connect to the Qilin Cow, all of you will be able to unleash your full strength. ”<br/><br/>“However, you may not have to do anything this time. I should be able to handle it myself! ”<br/><br/>He spoke to the two of them while Tianci nodded his head.<br/><br/>“Foster father, are all the experts from your universe here? Can they see everything?”<br/><br/>Tianci asked with interest and curiosity.<br/><br/>Wang Xian nodded his head and said, “This is a grand occasion in the nine-origin universe!”<br/><br/>As he spoke, he flew out!<br/><br/>He looked at the teleportation formation of the Phoenix clan and flew over with a smile on his face.<br/><br/>“Greetings, Dragon King! ”<br/><br/>“Greetings, Dragon King! ”<br/><br/>In the surrounding area, when the group of strong disciples saw Wang Xian and the rest flying over, they were slightly stunned and immediately bowed respectfully!\t\t\t\t\t\t</div>", "images": {}, "success": true}