{"id": 1202, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074534.html", "title": "Chapter 4205 - Chapter 4205: 4204 Blocks", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4205 - Chapter 4205: 4204 Blocks</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4205: 4204 blocks<br/><br/>Translator: 549690339<br/><br/>An unexpected piece of good news suddenly reached Wang Xian.<br/><br/>The news came from the celestial nation. It was from the Queen of the floating waters!<br/><br/>And the news was that she was about to break through!<br/><br/>The current her had a feeling that she would be able to break through in a month or two at most.<br/><br/>When the queen of the floating waters sensed that she could break through her shackles, she immediately passed the good news to Wang Xian.<br/><br/>After Wang Xian saw the news, his eyes sparkled.<br/><br/>This was a good thing.<br/><br/>It was also a good thing for the Dragon Palace.<br/><br/>Similarly, it was also a good thing for the nine-origin universe.<br/><br/>“The breakthrough of the Queen of floating water will definitely be a great joyous occasion for the nine-origin universe. At that time, all the powerhouses in the Heaven’s origin realm should be here.” Wang Xian thought to himself as his eyes sparkled.<br/><br/>It’s time to make a move!<br/><br/>Wang Xian made up his mind!<br/><br/>It’s time to make a move against the Phoenix clan.<br/><br/>To end all the grudges.<br/><br/>To end everything!<br/><br/>With his current strength and the current strength of the Dragon Palace, he could definitely make a move!<br/><br/>Previously, Wang Xian had the strength to destroy the Phoenix clan.<br/><br/>The reason why he didn’t do it was because he wasn’t 100% confident.<br/><br/>This 100% confidence didn’t mean that he couldn’t destroy the Phoenix clan.<br/><br/>It was because he was worried that the other heaven origin creation powerhouses in the nine-origin universe would interfere.<br/><br/>They might not help the Phoenix clan.<br/><br/>However, they might not let Wang Xian destroy the Phoenix clan for the sake of the nine-origin universe’s strength.<br/><br/>The calamity was about to arrive. With the addition of a powerful peak race, there would naturally be a large number of experts.<br/><br/>For the sake of the future of the nine-origin universe, there might be some heaven’s fate who would not advise Wang Xian to make a move.<br/><br/>Even the fallen shadow demon emperor might not let Wang Xian make a move for the sake of the overall situation.<br/><br/>This was what he was most worried about.<br/><br/>But now, there was no need for him to worry!<br/><br/>The Queen of the floating waters would break through and stand by his side!<br/><br/>With his current strength and the presence of Heaven’s gift, even the shadow devil emperor had to hesitate when he sensed this power and consider the consequences.<br/><br/>Wang Xian firmly believed that this consequence would be on his side!<br/><br/>Having made up his mind, Wang Xian sent a message to the queen of the floating waters.<br/><br/>“Brother Liu Lan Wangtian, let’s part ways here. Pm going back to the nine-origin universe!”<br/><br/>Wang Xian looked at Liu Lan Wangtian and the rest and said directly.<br/><br/>“HMM? Dragon King, why don’t you stay with us a little longer? We haven’t thanked you properly yet! ”<br/><br/>Liu Lan Wangtian said hurriedly.<br/><br/>“No need. I have an expert who is about to make a breakthrough. I have to go back and take care of some other matters. My clone will go back with me! ”<br/><br/>Wang Xian smiled and shook his head. He waved his hand at them and rushed towards the nine-origin universe.<br/><br/>Liu Lan and Wangtian opened their mouths and watched as Wang Xian and the rest disappeared quickly.<br/><br/>“Your first real battle is not bad! ”<br/><br/>Wang Xian said to Tianci as he rushed towards the nine-origin universe.<br/><br/>“Foster father, the main reason is that this person is too weak. Furthermore, it was you who made the move, so I used the immortal binding twigs! ”<br/><br/>Tianci said with a smile.<br/><br/>“This immortal binding twigs of yours is very strong. It can render some of the escaping treasures ineffective. It is very lethal to weak heaven origin powerhouses!”<br/><br/>Wang Xian said to him.<br/><br/>Tianci used the immortal binding twigs at the last moment. It could render a control-level powerhouse unable to escape even if he used a supreme treasure. Such an effect and ability was very terrifying.<br/><br/>It was worthy of being the ultimate treasure of the Heaven’s origin!<br/><br/>“HMM, the next time, godfather, you asked me to fight more. In the past, I still had my companions to train and spar with. Now, there’s no one left. It’s too boring!<br/><br/>Tianci said.<br/><br/>“Hehe! ”<br/><br/>Wang Xian smiled. “If you’re bored, I’ll spar with you. ”<br/><br/>“Godfather, you’re too strong. Two powerful treasures and a powerful clone. Your strength is comparable to the Great Dao, right?”<br/><br/>Tianci asked curiously.<br/><br/>“More or less!”<br/><br/>Wang Xian nodded his head. “This time, follow me to the nine-origin universe.<br/><br/>I want to get rid of an enemy. ”<br/><br/>“Oh? Foster father, are you going to get rid of another Tianyuan Creator?” Tianci’s eyes lit up as he spoke!<br/><br/>“Yes, he is not strong. He is not as strong as you. He is one of the top races in the nine-origin universe. He has a grudge with the Divine Dragon clan who used to be foster father.” Wang Xian nodded.<br/><br/>Buzz<br/><br/>He chatted with Tianci and soon arrived at the location of the teleportation.<br/><br/>Through the teleportation formation, he quickly teleported to the tree of Chaos!<br/><br/>“This way! ”<br/><br/>Wang Xian gestured to tianci and quickly flew toward the Celestial Nation!<br/><br/>Buzz<br/><br/>Soon, Wang Xian sensed the aura of the queen of the floating water.<br/><br/>Beside him, a group of experts from the celestial nation gathered in front of her. Their faces were filled with excitement.<br/><br/>Wang Xian flew over and sensed the situation of queen floating water.<br/><br/>“Greetings, Dragon King! ”<br/><br/>“Greetings, Dragon King! ”<br/><br/>When queen floating water saw Wang Xian flying over, she immediately bowed respectfully!<br/><br/>The group of powerhouses from the Celestial Nation also bowed respectfully!<br/><br/>Their eyes couldn’t help but glance at Tianci who was beside Wang Xian.<br/><br/>From that aura, they immediately confirmed that this was a powerhouse from the Heaven’s origin realm.<br/><br/>“You ‘re welcome! ”<br/><br/>Wang Xian nodded his head faintly. He looked at Queen of floating water and smiled. “Congratulations, you’ve succeeded! ”<br/><br/>(‘I have to thank you for your treasure, Dragon King. If not for your treasure, it would be impossible for me to achieve a breakthrough. ”<br/><br/>Queen of floating water’s face was filled with a smile. (‘I can already sense the mirror before my breakthrough. Now that the mirror has cracked, I’ll achieve a breakthrough in two months at most! ”<br/><br/>“It is your own good fortune that you are able to achieve a breakthrough. ”<br/><br/>Wang Xian smiled at her and said, “I am contacting the various Heaven’s origin destinies now. Your breakthrough is a big deal for our nine-origin Universe! ”<br/><br/>As he spoke, he took out a communication stone plate.<br/><br/>Buzz Buzz<br/><br/>Coincidentally, just as Wang Xian took out the communication stone plate used by the Heaven’s origin destinies to communicate with each other, a message suddenly came from it.<br/><br/>When Wang Xian saw this message, he was slightly stunned.<br/><br/>“Everyone should be in the nine-origin universe. Our Phoenix Clan has an important announcement. Ten days later, our Phoenix clan’s disciple, the Water Phoenix King, the Water Phoenix King, has made a breakthrough and invited everyone to come and watch the ceremony. At that time, our Phoenix clan will invite all the powerful disciples in the universe to a banquet to add a heaven’s origin creator to our universe! ”<br/><br/>This was a message from the communication stone plate.<br/><br/>It was a message from the emperor of the Phoenixes.<br/><br/>When Wang Xian saw this message, he was stunned.<br/><br/>This was such a coincidence!<br/><br/>The queen of floating water was about to break through to the Heaven’s origin blessed realm. It would take at most two months.<br/><br/>The Queen of the water phoenixes from the Phoenixes announced that she would break through in ten days!<br/><br/>The time taken for her to break through was merely more than a month longer than the queen of floating water!<br/><br/>This is simply a joke of fate.<br/><br/>It is simply heaven playing with the floating queen.<br/><br/>The last slot, was actually cut off!\t\t\t\t\t\t</div>", "images": {}, "success": true}