{"id": 1213, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074578.html", "title": "Chapter 4216 - Chapter 4216: 4215 Phoenix Treasury", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4216 - Chapter 4216: 4215 Phoenix Treasury</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4216: 4215 Phoenix Treasury<br/><br/>Translator: 549690339<br/><br/>A complete heavenly yuan creation corpse was equivalent to the entire essence of a heavenly yuan creation expert.<br/><br/>Its value was extremely high.<br/><br/>Back then, the unicorn ox had broken through without touching the shackle and had absorbed the Asgard Heavenly Demon God’s corpse.<br/><br/>Of course, this had a lot to do with them being of the same origin.<br/><br/>The two bodies could not be said to be the greatest harvest.<br/><br/>There were also a large number of Phoenix race experts ‘bodies.<br/><br/>The Phoenix race had over a dozen peak universe ruler realm experts!<br/><br/>Of these over a dozen, a portion of them had broken through from the tree of chaos, while a portion had been secretly nurtured by the Emperor of the<br/><br/>Phoenix race.<br/><br/>There were over a dozen peak universe ruler realm experts ‘bodies. In addition, there were a large number of level nine universe rulers and level eight universe rulers.<br/><br/>Secondly, besides the large amount of corpse resources, the Phoenix clan, as a peak race that had survived several eons, had a large amount of treasures and resources.<br/><br/>Just the venerable-level divine parasol trees were a terrifying amount of resources and treasures.<br/><br/>In addition, the Phoenix clan’s Land of treasures, the Treasury of the Phoenix clan, all belonged to the Dragon Palace.<br/><br/>“Dragon King, the treasures of the Phoenix clan are very huge, much more than the resources of our Dragon Palace. This is their divine land, and there are a lot of divine herbs and divine trees planted in it. ”<br/><br/>“The place in front is the Phoenix clan’s treasury of the Phoenix clan. We can’t open it with our strength. We need you to open it yourself, Dragon King! ”<br/><br/>All the powerful disciples of the Dragon Palace began to investigate the entire Phoenix Mountain and transfer all the resources that could be transferred to the Dragon Palace.<br/><br/>The divine herbs and divine trees of the Phoenix clan were extremely numerous. They were completely incomparable to the Dragon Palace!<br/><br/>Among them, there were more than a hundred divine trees at the peak of the Universe Overlord Realm!<br/><br/>However, many of these divine trees did not bear fruit.<br/><br/>This was the accumulation of the Phoenix clan for generations.<br/><br/>The Phoenix clan did not only give birth to one of the Heaven’s origin destinies, the Phoenix Clan’s heritage. It was also not just the accumulation of the Phoenix clan by the Phoenix clan alone.<br/><br/>Wang Xian looked at the huge amount of resources and his eyes glowed.<br/><br/>After all, the Dragon Palace had just been established not too long ago. All kinds of heritage could not be compared to the Phoenix clan!<br/><br/>“Transfer all the divine herbs, divine trees, and parasol trees to the Dragon palace !<br/><br/>“Open up a divine field in the Dragon Palace.”<br/><br/>Wang Xian instructed them one by one.<br/><br/>With the ancestral tree in the Dragon Palace, there was an immense amount of energy in it. Regardless of what divine tree or divine grass it was, it could grow in the dragon palace.<br/><br/>“It’s the Dragon King! ”<br/><br/>Prime Minister Gui nodded.<br/><br/>Wang Xian moved and flew forward.<br/><br/>In front of him was the treasure vault of the Phoenix clan.<br/><br/>It was the core treasure vault of the Phoenix clan.<br/><br/>In the Phoenix clan, other than the Phoenix sentiment tower, only a few powerhouses of the Phoenix clan were able to open it.<br/><br/>Wang Xian came to the spot in front of the treasury and sized it up.<br/><br/>There were three gigantic phoenixes standing at the entrance of the Treasury.<br/><br/>In the middle of the three phoenixes, there was a huge door.<br/><br/>The door looked extremely sturdy. This door could not be opened by a strong practitioner at the peak of the Overlord realm of the Dragon Palace.<br/><br/>Wang Xian walked over and placed his palm on the door, forcefully breaking it open.<br/><br/>“The door to the Phoenix Treasury is very sturdy. I reckon that even an existence at the control level would not be able to break through it. ”<br/><br/>Wang Xian mumbled.<br/><br/>As expected of the Phoenix clan with a deep foundation.<br/><br/>The defense of the treasury was not inferior to that of the Divine Dragon Clan.<br/><br/>Back then, the Divine Dragon clan and the Emperor of the Phoenix clan could not open the door.<br/><br/>When the door to the treasury was opened, a space with three attributes appeared in front of him.<br/><br/>Metal, fire, and water attributes!<br/><br/>The three types of energy were extremely majestic.<br/><br/>At the same time, there were all kinds of sharp and special energy fluctuations inside-<br/><br/>These were all the energy fluctuations of the treasury.<br/><br/>Wang Xian took a glance and realized that there were many ruler-level Phoenix Claws and wings inside.<br/><br/>As a powerful Phoenix clan, their claws and wings were extremely precious materials!<br/><br/>There weren’t many innate supreme treasures because the Phoenix clan was the same as the Dragon Clan. They didn’t rely too much on treasures.<br/><br/>Of course, if they had the fragments of the Heaven Origin Destiny Supreme Treasure or treasures from the chaos, they would be able to increase their strength.<br/><br/>“Eh, this is?”<br/><br/>At the center of the Phoenix Treasury, Wang Xian saw a small pond, a two-meter-wide pond.<br/><br/>In the middle of the pond, there were pools of Phoenix Blood.<br/><br/>These phoenix blood emitted an extremely rich energy. There were also strands of special flames on them.<br/><br/>Golden Flames, fiery red flames, and aqua blue flames.<br/><br/>“This is a treasure! ”<br/><br/>Wang Xian walked over. His gaze focused. With a wave of his arm, drops of Phoenix blood appeared in his hand.<br/><br/>Feeling the energy in the blood, Wang Xian had an understanding of it.<br/><br/>These phoenix blood could also be said to be nirvana blood.<br/><br/>The strong practitioners of the Phoenix clan could recover instantly when they burned their life force to unleash their powerful strength.<br/><br/>They could even burn these fresh blood to unleash their strength.<br/><br/>Other than that, these Phoenix blood had another effect, which was to increase their strength.<br/><br/>The effect was extremely heaven-defying.<br/><br/>However, such precious nirvana blood was usually used as a trump card of a Phoenix!<br/><br/>The disciples of the other races were not allowed to use these nirvana blood.<br/><br/>However, the Dragon Palace had a peak dragon seed, the Heavenly Lightning Earth Fire Dragon Phoenix seed.<br/><br/>The Heavenly Lightning Earth Fire Dragon Phoenix seed could be used.<br/><br/>The Nirvana blood in the two-meter pond could improve the Heavenly Lightning Earth Fire Dragon Phoenix seed significantly.<br/><br/>After all, this was the ultimate treasure that was kept in the Phoenix Treasury!<br/><br/>Wang Xian kept all the treasures one by one. Then, he began to search the surroundings.<br/><br/>After that, he found a lot of treasures, but none of them were as valuable as the Nirvana blood.<br/><br/>Some of the ultimate treasures that were too powerful must have been kept by the Emperor of Phoenix in his divine kingdom.<br/><br/>As for the Emperor of Phoenix’s divine kingdom, it was not kept in Phoenix Mountain.<br/><br/>“Choo-choo, choo-choo! ”<br/><br/>“Choo-choo! Choo-choo!”<br/><br/>At the same time, in the middle of the chaos, in the middle of a huge gray meteorite.<br/><br/>There was an extremely huge palace.<br/><br/>In the palace, the Emperor of Phoenix flapped his wings and roared furiously!<br/><br/>The might on his body had decreased, but it had reached the level of a heavenly yuan creation realm powerhouse.<br/><br/>It was obvious that the resurrection treasure he had used was extremely powerful.<br/><br/>“Dragon King of the Dragon Palace, you destroyed my Phoenix clan. One day, I Will Destroy Your Dragon Palace and Bury Your Dragon Palace and my Phoenix Clan together. Just you wait. ”<br/><br/>“And Fallen Shadow Demon Emperor, you guys will have to pay the price for watching the Dragon King of the Dragon Palace break the rules! ” The Emperor of the Phoenix roared crazily.<br/><br/>The Phoenix clan was destroyed, and his clan completely disappeared.<br/><br/>As long as the Dragon Palace and the Dragon King were here, he would never be able to step into the nine-origin universe.. He had to take revenge!\t\t\t\t\t\t</div>", "images": {}, "success": true}