{"id": 1210, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074566.html", "title": "Chapter 4213 - Chapter 4213: 4212 Phoenix Slayer, Dragon’S Might", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4213 - Chapter 4213: 4212 Phoenix Slayer, Dragon’S Might</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4213: 4212 Phoenix Slayer, Dragon’s might<br/><br/>Translator: 549690339<br/><br/>“Dragon King, do you want to destroy the Phoenix Clan?” Queen floating water broke through.<br/><br/>She floated in the air and looked at Wang Xian as she spoke.<br/><br/>This was also a way of expressing her stance!<br/><br/>She was able to break through this time because of the Dragon King of the Dragon Palace.<br/><br/>This favor was greater than the heavens!<br/><br/>From now on, she would do whatever she wanted!<br/><br/>Previously, when the Floating Queen received the Dragon King’s investment, she wanted to stand on the Dragon Palace’s side and fight against the Phoenix clan!<br/><br/>Now, she would act without the Dragon King’s permission!<br/><br/>This was gratitude!<br/><br/>“All the disciples of the Celestial Nation will fight for the Dragon King! ”<br/><br/>When the floating queen spoke, all the powerhouses of the celestial nation immediately cupped their hands and replied loudly to Wang Xian!<br/><br/>All the disciples from the Celestial Nation were fighting for the Dragon King!<br/><br/>At this moment, a sharp killing intent erupted from their bodies.<br/><br/>At this moment, the expressions of all the surrounding powerhouses’ disciples changed drastically.<br/><br/>No one expected that after queen floating water broke through, she would fight for the Dragon King.<br/><br/>She would become the enemy of the Phoenix clan!<br/><br/>No one expected that the entire celestial nation would start a war against the Phoenix clan.<br/><br/>When the group of Heaven Origin Destiny Realm powerhouses heard the words of queen floating water, their brows instantly furrowed!<br/><br/>The expression of the emperor of the Phoenix changed drastically as hints of fear appeared on his face.<br/><br/>“What are you guys trying to do?”<br/><br/>The Emperor of the Phoenix roared loudly!<br/><br/>“Roar Roar Roar! ”<br/><br/>“Roar Roar Roar! “<br/><br/>As the Emperor of the Phoenix’s voice faded.<br/><br/>Wang Xian’s crown and the black and white dragon cannon on his body let out<br/><br/>a roar at the same time.<br/><br/>One on the left and one on the right, they turned into two divine dragons.<br/><br/>Five Elements Divine Dragon, Yin-yang Divine Dragon.<br/><br/>The power of the two divine dragons was no weaker than that of a beginner-level heaven origin creator.<br/><br/>“Roar Roar! ”<br/><br/>In the next moment, another divine dragon flew out from Wang Xian’s body.<br/><br/>It was a special illusory divine dragon.<br/><br/>However, the power it emitted caused the space around Wang Xian to crack.<br/><br/>A special energy surged towards the surroundings!<br/><br/>“Space Energy?”<br/><br/>When the body of the Void Divine Dragon flew out, the twelve ancestral witches’eyes narrowed as they shouted in a low voice!<br/><br/>“Roar! Roar! ”<br/><br/>The Unicorn Ox roared and came to Wang Xian’s side, revealing its true form.<br/><br/>Tianci held the branch of the Ancient Tree of destiny in his hand and was on the other side!<br/><br/>Their might was fully displayed!<br/><br/>“Our Dragon Palace is inherited from the Divine Dragon Clan. Today, we will help our ancestors resolve their grudges! ”<br/><br/>“I hope everyone will not stop us! ”<br/><br/>Wang Xian stood there quietly and began to speak!<br/><br/>“This? ?<br/><br/>At the side, a few other powerhouses of Heaven’s origin creation saw that Wang Xian was really going to attack the Phoenix clan.<br/><br/>When they saw the might displayed by Wang Xian, they took a deep breath.<br/><br/>“How… How can the Dragon King be so strong? Not counting the few divine dragons of the Heaven’s origin realm around Wang Xian, his body still contains a majestic energy that can easily kill me. How is this possible? Didn’t he just break through?”<br/><br/>The Emperor of angels saw this scene and spoke while trembling.<br/><br/>Beads of cold sweat appeared on his forehead.<br/><br/>What the F * Ck.<br/><br/>What kind of strength was this?<br/><br/>How long had it been since the Dragon King broke through?<br/><br/>In the past, under the pressure of the angel and Phoenix clans, even the disciples of the Dragon Palace didn’t dare to appear in the nine-origin universe.<br/><br/>Later on, because the Dragon King had broken through, he had a mount of the Heaven’s origin creation level.<br/><br/>At that time, he thought twice and decided not to make the Dragon Palace his enemy!<br/><br/>He resolved the past grudges.<br/><br/>Now, it seemed that this decision was the best decision he had ever made in his life.<br/><br/>The current Dragon Palace, not to mention killing the emperor of the Phoenix, even including his Angel clan, was not enough for the Dragon Palace to kill!<br/><br/>He was 100% sure that the fallen Shadow Demon Emperor would avoid the Dragon King’s power!<br/><br/>He would have to avoid it!<br/><br/>This power had reached the Great Dao level, and the ordinary Great Dao level would have to be suppressed by the Dragon King and the others.<br/><br/>It was too terrifying!<br/><br/>(‘I don’t know! ”<br/><br/>The other Heavenly Yuan creation realm experts also shook their heads with grave expressions.<br/><br/>Saint Hetian pursed his lips, not knowing what to do at this moment.<br/><br/>Stop the Dragon King?<br/><br/>But with his strength alone, how could he stop it?<br/><br/>Moreover, even if the fallen Shadow Demon Emperor spoke up and stopped it with him, wouldn’t that be making things difficult for the Dragon King?<br/><br/>With the current power of the Dragon Palace, if the Dragon Palace didn’t get along with the nine-origin universe, it would also be a huge loss to the nine-origin universe.<br/><br/>The main reason was that this power of the Dragon Palace was too powerful.<br/><br/>If the fallen Shadow Demon Emperor didn’t exist, they would probably need all the other heavenly yuan creation realm experts to fight against him.<br/><br/>He looked at the Fallen Shadow Demon Emperor!<br/><br/>If the fallen Shadow Demon Emperor did not speak, he would not have the right!<br/><br/>“There’s something fishy about the divine dragon clan being exterminated. I don’t know what role the Phoenix clan is involved in. Feng Qing Lou, if you can’t come up with a reasonable explanation, we won’t help you. ”<br/><br/>“Dragon King, if the Phoenix clan really did something, My Angel clan will also stand on your side! ”<br/><br/>The expression of the emperor of angels kept changing.<br/><br/>In the end, he gritted his teeth and decided to curry favor with the Dragon King.<br/><br/>After all, the Dragon Palace and the Angel clan had a grudge.<br/><br/>Although it was resolved in the end, the way they dealt with it at that time was only to put the grudge on hold and neither side would pursue it.<br/><br/>However, what if the Dragon Palace pursued their Angel clan in the future?<br/><br/>F * ck, with the power of the Dragon Palace and the Dragon King’s strength, he might not even know who killed him.<br/><br/>The Dragon King already had the strength to kill him in an instant.<br/><br/>Now, he absolutely couldn’t let the Dragon King have any opinions about the angel clan.<br/><br/>Otherwise, who knew if he would secretly take revenge?<br/><br/>Who could stop him?<br/><br/>As for the agreement between the powerhouses of the nine-origin universe? What was the use?<br/><br/>They didn’t even know how they died.<br/><br/>What did it have to do with the Dragon Palace?<br/><br/>“Emperor of Angels, you…”<br/><br/>The emperor of Phoenix’s expression changed drastically when he saw the emperor of angels saying such words. He roared in shock and anger!<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>At this moment, Prime Minister Gui waved his arm from below.<br/><br/>Divine Dragons, the peak dragon species of the Dragon Palace, rose up directly!<br/><br/>They swayed their huge bodies and came to the back of Wang Xian. They stood in opposition to all the strong disciples of the Phoenix clan.<br/><br/>Next, as long as Wang Xian gave the order, a huge battle would break out at any moment!<br/><br/>“Oh my God, is this a fight?”<br/><br/>“It’s not a fight. They are going to destroy the Phoenix clan. The Dragon King of the Dragon Palace and the rest are too strong. Their power is too strong! ”<br/><br/>“Which peak race in the nine-origin universe can compete with this power?<br/><br/>Even the demon clan can’t do it, right? are the Dragon King of the Dragon<br/><br/>Palace going to make a move next?”<br/><br/>“The Emperor of angels is on the side of the Dragon King of the Dragon palace !<br/><br/>At this moment, all the powerful disciples of the other races in the surroundings saw this scene.<br/><br/>They saw the powerful disciples of the Dragon Palace making their move.<br/><br/>They watched the might of the Dragon King of the Dragon Palace and the faint killing intent.<br/><br/>They were all filled with shock.<br/><br/>Were they really going to kill the Phoenix Clan?\t\t\t\t\t\t</div>", "images": {}, "success": true}