{"id": 1219, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074602.html", "title": "Chapter 4222 - Chapter 4222: 4221 Split The Heavens And Earth! Go", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4222 - Chapter 4222: 4221 Split The Heavens And Earth! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4222: 4221 split the heavens and earth! Go<br/><br/>Translator: 549690339<br/><br/>“Lord Dragon King’s rise is so fast? So terrifying! ”<br/><br/>“This dazzling rise is simply unbelievable. Lord Dragon King’s deeds are too awesome. He relied on great perseverance, great wisdom, and great strength to<br/><br/>kill his way here. He’s too strong!”<br/><br/>(‘I didn’t expect that our nine-origin universe’s extremely powerful Phoenix clan would be easily destroyed by Dragon King. Dragon King and the others are too strong, right?”<br/><br/>“The Phoenix clan, which is comparable to other peak races, was wiped out by the Dragon King. They are simply invincible. ”<br/><br/>“The Dragon King has killed his way here. He is invincible all the way. ”<br/><br/>“Invincible. But then again, the rise and growth of the Dragon Palace’s Dragon King and the others were all because other forces coveted the Dragon Palace. They were the ones who wanted to deal with the Dragon Palace’s Dragon King and the others. ”<br/><br/>“The Dragon Palace endured many times and took revenge after they became stronger. This is the rise of a true powerhouse, the rise of a truly powerful force. ”<br/><br/>The universe’s Al was extremely lively.<br/><br/>When all the outer disciples of the nine-origin universe saw what happened to the Dragon King, they all became excited.<br/><br/>They started to discuss.<br/><br/>This also made the Dragon Palace’s Dragon King’s reputation thoroughly resound throughout all corners of the universe’s Al.<br/><br/>The reputation of the Dragon King of the Dragon Palace even surpassed that of any other heaven origin creator.<br/><br/>Naturally, Wang Xian knew about the matters regarding the universe’s Al.<br/><br/>Recently, when he was bored, he would check the information on the universe’s Al.<br/><br/>During these billions of years, Wang Xian did not receive much improvement.<br/><br/>Now, if Wang Xian wanted to continue his breakthrough, he would need too many resources.<br/><br/>When the cataclysm arrived, Wang Xian would go out to take a look while ensuring the safety of the nine-origin universe and the Dragon Palace.<br/><br/>He would look for some opportunities and resources for his breakthrough.<br/><br/>Once he made another breakthrough, he would be able to match the Great Dao level of Heaven’s origin creation without the aid of any treasures.<br/><br/>At that time, the fallen Shadow Demon Emperor might not be his match.<br/><br/>However, although he did not improve, he had obtained another powerful treasure.<br/><br/>At this moment, on top of the ancestral tree, there was another flower apart from the mother fruits.<br/><br/>This was a flower that was half white and half black.<br/><br/>The flower looked extremely strange and emitted a special energy.<br/><br/>This was the Resurrection Lily.<br/><br/>The fusion of darkness and light resurrection Lily.<br/><br/>The Dragon Palace had the black flower of the other shore.<br/><br/>And the white flower of the other shore of light was owned by the Angel clan. The flower of the other shore of light could travel back and forth between life and death.<br/><br/>The flower of the other shore of darkness represented the reincarnation of the other shore.<br/><br/>One could bring people back to life in an instant, and the other could go back to a few seconds ago.<br/><br/>Now, the flower of the other shore of light and darkness had fused with the assistance of the ancestral tree.<br/><br/>It became the flower of the other shore.<br/><br/>There was no division between light and darkness.<br/><br/>The flower of the other shore had the same ability as the flower of the other shore of Light and darkness. Furthermore, it had an additional powerful ability.<br/><br/>That was foresight.<br/><br/>It could predict how much damage the other party’s attack could cause to it.<br/><br/>This was a very powerful ability.<br/><br/>It could predict the strength of the other party’s attack. This was a great guarantee when facing some old silver coins.<br/><br/>Moreover, it could prevent sneak attacks.<br/><br/>There was only one such resurrection Lily, and it would take a long time to recover after using it.<br/><br/>The Radiant Resurrection Lily was a gift from the Emperor of angels to the Dragon Palace.<br/><br/>It could also be considered as an apology to the Dragon Palace.<br/><br/>This resurrection Lily was also very precious in the Angel clan. There were at most a dozen of them.<br/><br/>Wang Xian’s strength did not improve much. However, the strength of the entire dragon palace had improved tremendously.<br/><br/>This was especially so when the dragon palace had the corpses of the powerhouses in the Heaven’s origin realm.<br/><br/>The corpses of these powerhouses in the Heaven’s origin realm were too precious and hard to come by.<br/><br/>The other peak races had to pay a huge price and resources to obtain these corpses from Wang Xian.<br/><br/>With the help of these corpses, the disciples of the powerhouses in the Dragon Palace had improved tremendously over the past billion years.<br/><br/>The number of Peak Universe Masters had reached 55.<br/><br/>Yes, it had reached more than 50.<br/><br/>Currently, the number of experts at the Dragon Palace’s level could be ranked first in the nine-origin universe.<br/><br/>In addition, out of the more than eight million disciples of the Dragon Palace, one million had already reached the ruler realm.<br/><br/>There was a reason why there were so many disciples at the ruler realm.<br/><br/>That was the seed of advancement that Wang Xian had obtained back then!<br/><br/>By devouring the seed of advancement, a master at the peak of the Universe Knight Realm could break through the shackles and reach the realm of a Master of the universe.<br/><br/>This seed of advancement took root and sprouted on the ancestral tree. Now, due to the maturity of the ancestral tree, one seed of advancement could be born every 100,000 years.<br/><br/>One seed per 100,000 years, one thousand would be born every 100 million years, and more than 10,000 would be born every billion years.<br/><br/>Plus, they were all cultivating in the tree of chaos, so the number of rulers in the Dragon Palace had reached a terrifying one million.<br/><br/>Of course, the number of rulers in the other peak races had increased by three to four times in the past billion years.<br/><br/>It had reached 500,000 to 600,000.<br/><br/>In terms of disciples, the Dragon Palace’s strength was still very terrifying.<br/><br/>After all, the Dragon Palace had the Heavenly Yuan creation supreme treasure ancestral tree, which was auxiliary, and the technology of the Bug clan and the Divine Dragon Clan.<br/><br/>They had obtained all the resources of the Phoenix clan and all the corpses of the Phoenix clan.<br/><br/>1.3 million ruler realm experts. This was the exact number of experts of the Dragon Palace.<br/><br/>Time passed day by day again.<br/><br/>The arrival of the Apocalypse was getting closer and closer.<br/><br/>The atmosphere of the various peak races became more and more solemn.<br/><br/>When the Apocalypse arrived, they would no longer have the peace they had now.<br/><br/>When the time came, they might have to go to the battlefield and face a powerful enemy.<br/><br/>Some of them were excited and a little apprehensive. Most of them were indomitable and had an invincible aura.<br/><br/>They believed that they were not weaker than the powerhouses from other universes.<br/><br/>One hundred million years passed very quickly!<br/><br/>The Countdown to the Cataclysm began gradually!<br/><br/>“There’s still one year before the cataclysm. Fellow Daoists, please make your final decision! ”<br/><br/>There was still a year before the cataclysm.<br/><br/>A piece of news reached Wang Xian.<br/><br/>Upon seeing this news, he did not hesitate and flew out immediately.<br/><br/>The cataclysm was about to begin. There were still some things that they needed to make a decision on!<br/><br/>“Greetings, Dragon King! ”<br/><br/>When Wang Xian arrived, there were already many strong disciples there.<br/><br/>Among them were the skeleton clan and the Divine Tiger clan.<br/><br/>This time, all the strong practitioners from the peak races had arrived.<br/><br/>Although the skeleton clan and the Divine Tiger clan did not have any strong practitioners in the Heaven’s origin manifestation realm, their strength was not weak in the nine-origin universe.<br/><br/>Especially the skeleton clan. There were many strong practitioners in the dominator realm in their clan.<br/><br/>They were comparable to other forces with strong practitioners in the Heaven’s origin manifestation realm.<br/><br/>Okay!<br/><br/>Wang Xian nodded his head and his gaze landed on Ling Honggu.<br/><br/>Ling Honggu was an expert from the skeleton clan. She had a powerful inheritance in her body.<br/><br/>Currently, her strength had already reached the pinnacle of the universe..\t\t\t\t\t\t</div>", "images": {}, "success": true}