{"id": 1217, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074594.html", "title": "Chapter 4220 - Chapter 4220: 4219 Welcomed The Arrival Of The Calamity", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4220 - Chapter 4220: 4219 Welcomed The Arrival Of The Calamity</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4220: 4219 welcomed the arrival of the calamity<br/><br/>Translator: 549690339<br/><br/>“The Void universe belongs to the same neutral faction as our nine-origin universe. Their universe only has one attribute, the spatial attribute. However, as a universe, it is impossible for there to be one spot for a heaven-origin creator. Therefore, the Void universe can give birth to five heaven-origin creators.”<br/><br/>When the 12 ancestral witches heard the fallen Shadow Devil Emperor’s words, they nodded and began to introduce it to Wang Xian and the rest.<br/><br/>“The space attribute is recognized as the top attribute in all the major universes. A newly broken through Tianyuan destiny can fight against an old-fashioned beginner-level existence, so they are very powerful. ”<br/><br/>“They head to the universes that possess the space attribute to allow their disciples to break through. During the last calamity, they had eight Tianyuan destiny-level powerhouses. ”<br/><br/>“The Void Universe is controlled by the king of Void. Their king, the Void Saint, is an existence at the level of Great Dao. ”<br/><br/>The twelve ancestral witches glanced at the fallen shadow demon emperor and said, “In terms of strength, we, the fallen Shadow Demon Emperor, can barely resist him! ”<br/><br/>(‘I can barely resist him too, but I can’t stop him! ”<br/><br/>The Fallen Shadow Demon Emperor added on from the side and then looked at Wang Xian, a smile appeared on his face. “However, it’s not certain this time. The Dragon King is very strong. If I’m not wrong, the Dragon King should have a heavenly yuan destiny treasure on him, right?”<br/><br/>The Fallen Shadow Demon Emperor’s words surprised the few heavenly yuan destiny powerhouses. However, the Elf Queen and the twelve ancestral warlocks were not too surprised.<br/><br/>Obviously, they had already guessed it.<br/><br/>The Divine Dragon clan was once wiped out by the Phoenix Clan because of the ultimate treasure of the Heaven’s origin realm.<br/><br/>The reason why Wang Xian could rise up so quickly was obviously because of the existence of the ultimate treasure of the Heaven’s origin realm.<br/><br/>“Wood attribute, supplementary attribute. It doesn’t have too many buffs in battle!<br/><br/>Wang Xian did not hide anything. He smiled and said, “The ultimate treasure of the Heaven’s origin realm that my foster son has is an offensive type. It’s very powerful. If their universe isn’t in too much danger, I can call him over to join the battle. ”<br/><br/>“Dragon King, your improvement is really amazing. If your foster son can participate in the battle, the strength of our nine-origin universe will be greatly improved. He is an offensive-type heaven origin creation treasure!”<br/><br/>The emperor of angels exclaimed in astonishment.<br/><br/>Now, he was showing signs of fawning over him.<br/><br/>However, the Dragon Palace was too powerful.<br/><br/>The Dragon King was comparable to the Fallen Shadow Devil Emperor. He had a subordinate who was similar to him and an adopted son who possessed the ultimate treasure of the Heaven’s origin.<br/><br/>This was simply too heaven-defying!<br/><br/>Now, he was afraid that Wang Xian would settle old scores with him.<br/><br/>“Thank you. It’s only because I have the heritage of the Divine Dragon Clan. ”<br/><br/>Wang Xian smiled.<br/><br/>This smile also made the Emperor of angels smile.<br/><br/>Spatial-type powerhouses are very difficult to deal with. Their teleportation ability is hard to defend against. They can sneak attack and escape in an instant. Powerful spatial-type powerhouses can’t even sense us. We are in a very passive position when we fight them. ”<br/><br/>The 12 ancestral witches continued, they looked at Patriarch Xuanwu, he tiansheng, the royal family’s patriarch, and the floating queen. “Especially you guys. You guys are greatly suppressed when you fight against spatial-type powerhouses. The other party is unwilling to fight you head-on. There’s nothing you can do about it.”<br/><br/>Black Tortoise patriarch nodded silently.<br/><br/>He was good at defense, so he was very passive when facing the experts of the Void Universe.<br/><br/>“I’m good at defense. During the calamity, I can guard the nine-origin universe. ”<br/><br/>Black Tortoise Patriarch said.<br/><br/>“I can control the universe’s Al in the nine-origin universe, and I can guard the nine-origin universe.”<br/><br/>He Tian Sheng also took the initiative to speak.<br/><br/>“1 have a detection item for space-attribute experts. I will give one to each of you. ”<br/><br/>The twelve ancestral wizards said.<br/><br/>“He Tian, use the universe’s Al to simulate the Battle of space-attribute experts. Let everyone experience it. ” The ancestor of the Dark Clan said.<br/><br/>Okay!<br/><br/>He Tian Sheng nodded. He could simply use the universe’s Al.<br/><br/>Simulation was one of the functions of the universe’s artificial intelligence.<br/><br/>This simulation was very realistic.<br/><br/>It could be said to be 100% realistic.<br/><br/>“Let me do it. There’s still 100 million years. In this 100 million years, Pll accompany you guys to practice! ”<br/><br/>Wang Xian’s gaze swept across them. He saw that all of them were preparing for the calamity. They were all preparing for the safety of the nine-origin universe. He spoke directly.<br/><br/>His body moved, and the body of the Void Divine Dragon appeared at the side. “HMM? Is this your special treasure, Dragon King?”<br/><br/>The Elven empress looked at the Void Divine Dragon and asked with a twinkle in her eyes.<br/><br/>This was not the first time they saw it. When Wang Xian killed the emperor of the Phoenix, he had already displayed it.<br/><br/>However, she thought that it was just a powerful treasure of Wang Xian. A treasure that could create a clone.<br/><br/>After all, when he killed the emperor of Phoenix, Wang Xian did not use much of his strength.<br/><br/>“This is my void Dragon clone. It has a spatial attribute and achieved a breakthrough in the sword and Magic Universe. This clone of mine should be able to display a portion of the abilities of a spatial attribute powerhouse. ”<br/><br/>Wang Xian spoke truthfully.<br/><br/>“Clone? How did you manage to create such a clone?”<br/><br/>The Elven queen asked with a shocked expression.<br/><br/>“It was an item from the Divine Dragon Clan. I borrowed the vitality of the Heaven’s origin treasure token to create a clone.”<br/><br/>Wang Xian smiled and explained.<br/><br/>“The Void Dragon God? I know about that. It’s just that this plan failed back then. I didn’t expect it to succeed now.”<br/><br/>The ancestor of Xuanwu said, “With this clone of yours, Dragon King, we will have a deeper understanding of the space attribute. ”<br/><br/>“Dragon King, do us a favor. With your help, we will be able to create more arrays and items that target the space attribute experts. ” The eyes of the twelve ancestor witches lit up as they spoke.<br/><br/>“No Problem! ”<br/><br/>Wang Xian nodded with a smile.<br/><br/>“Alright, Alright. Next, Dragon King, get your doppelganger to engage in more battles with them. Also, distribute some energy to the disciples of the various peak races for them to experience. ”<br/><br/>“In addition, we need to form a defensive team to protect our nine-origin universe. The strength of the team shouldn’t be too strong. Each peak race will produce two powerhouses at the peak of the Universe Overlord Realm. ” Shadow Devil Emperor continued.<br/><br/>“That won’t be a problem. This team will act as a mobile team. If any reckless guys step into our 9-origin universe, we’ll kill them! ”<br/><br/>The Dark clan ancestor said with a murderous look.<br/><br/>When the calamity arrived, any other universe master disciples who entered their 9-origin universe would be regarded as an invasion.<br/><br/>They could be killed directly.<br/><br/>No questions asked.<br/><br/>Their 9-origin universe was not a weak universe.<br/><br/>A powerful universe had the power of a powerful universe!\t\t\t\t\t\t</div>", "images": {}, "success": true}