{"id": 1216, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074590.html", "title": "Chapter 4219 - Chapter 4219: 4218 To Welcome The Apocalypse", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4219 - Chapter 4219: 4218 To Welcome The Apocalypse</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4219: 4218 to welcome the apocalypse<br/><br/>Translator: 549690339<br/><br/>The duration of the Apocalypse was not continuous. It was more than five billion years.<br/><br/>During this period of time, the various universes no longer had any suppressive force.<br/><br/>The battle for the spot of the Heavenly Yuan creator.<br/><br/>The battle for resources.<br/><br/>There was even the battle for blood and food.<br/><br/>The battle for life.<br/><br/>The ordinary cultivators of the universe mainly focused on resources.<br/><br/>But there were also many universes where they cultivated in different directions.<br/><br/>For example, to believe in the universe, they need to believe, they need to believe in life.<br/><br/>To develop a universe of life into their own believers.<br/><br/>They Don’t slaughter life wantonly, but after becoming their believers, they have no idea.<br/><br/>They can change the mind of a living creature, and make it their own slave.<br/><br/>A thought to make it die.<br/><br/>This was completely equivalent to raising livestock.<br/><br/>This was a type of.<br/><br/>There was also something even more cruel.<br/><br/>The cultivation of some creatures in the universe was not resources, but blood food.<br/><br/>What was blood food?<br/><br/>It was to use living creatures as food to increase their strength.<br/><br/>Before the apocalypse, they were natural disasters to the weak universe.<br/><br/>These demons ate humans and other living beings as food and devoured them.<br/><br/>The quota battle was only one part of it.<br/><br/>To put it bluntly, the quota battle was only a battle between top-tier experts.<br/><br/>Some of the demons that hadn’t reached this level, the experts that believed in the universe, would sneak into a universe and secretly devour living beings to develop believers.<br/><br/>This was also very terrifying for the weak.<br/><br/>Of course, these demons were also resources for some cultivators. They could hunt demons and refine weapons and pills.<br/><br/>Hunters and prey existed together.<br/><br/>This was why the calamity was called the calamity.<br/><br/>It was bloody and cruel!<br/><br/>There was no morality at all.<br/><br/>The law of the cataclysm was that the strong preyed on the weak.<br/><br/>Of course, there were also some merciful powerhouses and some formations.<br/><br/>When Wang Xian and the rest heard what Patriarch Xuanwu said, they nodded their heads slightly.<br/><br/>“The cataclysm lasts for a very long time. Although the cataclysm is extremely cruel, there is a general division of camps. In general, there are three camps.<br/><br/>Sequence massacre, sequence justice, and sequence neutrality! ”<br/><br/>After Black Tortoise Patriarch finished speaking.., the Elven empress began to add, “Three factions. From the name, we can see that our 9-essences universe is sequence neutral. What is a neutral faction? “A neutral faction has a unique characteristic, and that is to not kill the innocent. Of course, there is a prerequisite. Others must not provoke us. If they do, they will similarly massacre the city and wipe out the entire race.”<br/><br/>Sequence neutrality is the division of our nine-origin universe by the other universe masters. Sequence neutrality means that most of the living universes are dominated by humans. Some of the weaker universes, for the sake of safety, would form a group to resist the invaders. Over time, they also gave birth to powerful heavenly fate! ”<br/><br/>“Their main focus is on defense and killing the sequence slaughterers. However, we can’t treat them as good people. There are many hypocrites among them, as well as secretly massacring cities and exterminating races.<br/><br/>However, there are very few of them. ”<br/><br/>“As for the serial killer camps, they are the true Raiders and killers of the Apocalypse. Facing the serial killer camps, you can kill them if you want to. If you can cooperate with them, you can also cooperate with them. We are focused on benefits.”<br/><br/>“Of course, be it the justice or the serial killer camps, they are also focused on benefits. In their camps, some universes will have wars or even slaughter. ”<br/><br/>“To put it bluntly, everything is still for their own interests. It’s just that their methods are different. Some are cruel and radical while some still have justice. ”<br/><br/>The Elven queen told Wang Xian and the rest about the three factions.<br/><br/>When Wang Xian and the rest heard that, they nodded their heads slightly.<br/><br/>The nine-origin universe was not a universe dominated by humans.<br/><br/>It was a universe dominated by the various peak races.<br/><br/>Although Wang Xian belonged to the human race, he also belonged to the<br/><br/>Divine Dragon Race.<br/><br/>The calamity was all for the sake of benefits.<br/><br/>There was no absolute camp.<br/><br/>It was just divided according to the degree of cruelty.<br/><br/>However, the people in the serial killing camp could be said to be extremely cruel.<br/><br/>Most of them ate the living beings with blood.<br/><br/>Wang Xian would not be lenient when he faced the serial killing camp.<br/><br/>After all, with the integration of the bloodthirsty insect race’s technology, the Dragon Palace’s dragon transformation pool could be said to be an existence comparable to the blood-eating creatures.<br/><br/>Wang Xian was not a bloodthirsty person. However, he felt at ease killing some of the creatures from the serial killer faction.<br/><br/>(‘We have added some new members this time. I would like to say something here. If we provoke a powerful enemy outside, if we are not their opponent and the other party wants to kill our way into the nine-origin universe, if we want all the other powerhouses to help us defend, we need to take out resources to invite others. Otherwise, we will negotiate with the other party and allow them to enter the nine-origin universe.”<br/><br/>“That’s one point. In addition, everyone should also try to cooperate and help each other. After all, we are comrades from the same universe. Only by uniting will other universes fear us and fear us. ”<br/><br/>The Fallen Shadow Demon Emperor said.<br/><br/>The other heavenly creation powerhouses nodded.<br/><br/>“Let’s talk about the tree of chaos. During the calamity, there might be other universes that want to occupy the tree of chaos. We need to make some preparations. ”<br/><br/>The Shadow Devil Emperor continued to speak!<br/><br/>“Every peak race will take out a portion of divine stones. Our Wizard clan will set up a powerful formation here.”<br/><br/>The twelve ancestral wizards spoke.<br/><br/>“For this cataclysm, I will let Lin Niu stay on the Dragon Palace’s side. We can completely take care of the tree of Chaos. ”<br/><br/>Wang Xian spoke.<br/><br/>“The formation of the twelve ancestral wizards and one heaven origin creation stage powerhouse is enough. We Can ‘t Let Your Dragon Palace’s Heaven origin creation stage powerhouse stay here for free. We have to give them sufficient rewards! ”<br/><br/>“If there are really three or four heaven origin creation realm experts who want to occupy our tree of chaos, then we will ask our disciples to leave. All the other experts will rush over and start a war with them!”<br/><br/>“We will keep one heaven origin creation realm expert to prevent our disciples from being massacred! ”<br/><br/>Fallen Shadow Demon Emperor said.<br/><br/>It was impossible for the heaven origin creation realm experts in the nine-origin universe to stay here at the tree of chaos forever.<br/><br/>It was sufficient as long as one of them was in charge.<br/><br/>When the time came, they would be able to be on guard in case of an accident.<br/><br/>As for the invasion of three to four heaven origin creator powerhouses, it was easy to handle. They would step aside and all the heaven origin creator powerhouses in the nine-origin universe would rush over.<br/><br/>war!<br/><br/>The strength of the nine-origin universe was not weak. One could even say that it was very strong.<br/><br/>If a universe dared to wage war against them, they would naturally accept the challenge.<br/><br/>Wang Xian and the rest nodded.<br/><br/>“Twelve ancestral witches, next, tell the new members of the Dragon King and the rest about the means of the void space experts! ”<br/><br/>The Fallen Shadow Demon Emperor said to the twelve ancestral witches.<br/><br/>The void space was their only enemy at the moment!\t\t\t\t\t\t</div>", "images": {}, "success": true}