{"id": 1212, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074574.html", "title": "Chapter 4215 - Chapter 4215: 4214 Took Over Phoenix Mountain", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4215 - Chapter 4215: 4214 Took Over Phoenix Mountain</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4215: 4214 took over Phoenix Mountain<br/><br/>Translator: 549690339<br/><br/>“This… This is crazy. The Emperor of Phoenix is completely crazy. ”<br/><br/>“The Dragon King of Dragon Palace wants the Emperor of Phoenix to sacrifice his own life for the lives of all the powerful disciples of the Phoenix clan. The Emperor of Phoenix doesn’t agree at all! ”<br/><br/>“In the eyes of the Emperor of Phoenix, his own life is more important than the lives of the powerful disciples of his own clan. This…”<br/><br/>“Isn’t the Dragon King of the Dragon Palace Too Strong?”? “He was able to kill the Emperor of Phoenix in an instant before he even unleashed his full strength. Did you see that? The Emperor of Phoenix hasn’t died yet because he has a treasure that can instantly dodge the damage and revive him. ”<br/><br/>“He’s too strong. The Emperor of Phoenix, who is at the heavenly fate level, couldn’t resist the Dragon King at all. Is this the Dragon King of the Dragon Palace?<br/><br/>In the Phoenix Mountain, streams of energy enveloped the sky above the disciples of the peak-level powerhouses.<br/><br/>In the outside world, Wang Xian had killed the emperor of the Phoenix time and time again.<br/><br/>This shocked all the powerhouses’ disciples.<br/><br/>At the same time, they despised the emperor of the Phoenix’s actions.<br/><br/>Many powerhouses were willing to die for their loved ones.<br/><br/>In the end, the Emperor of the Phoenix didn’t hesitate to exterminate the entire Phoenix clan for his own life!<br/><br/>His actions made many powerful disciples despise him.<br/><br/>“Lord Emperor of the Phoenix Clan, you must avenge us. Destroy the Dragon Palace and kill the disciples of the Dragon Palace! ”<br/><br/>“Lord Emperor of the Phoenix Clan, you can’t die. We can die. You must avenge us in the future! ”<br/><br/>“Kill the Dragon King and the disciples of the Dragon Palace! ”<br/><br/>However, some experts of the Phoenix clan roared with bloodshot eyes!<br/><br/>Their faces were also filled with madness.<br/><br/>It was as if they were willing to die for their emperor.<br/><br/>The idea of being willing to die for the emperor of the Phoenix Clan had already entered their minds.<br/><br/>They could die, but their emperor of the Phoenix clan couldn’t die.<br/><br/>Their emperor of the Phoenix clan would take revenge for the Phoenix clan in the future.<br/><br/>“Very loyal, then die! ”<br/><br/>Lin Niu didn’t hold back at all, the terrifying energy covered them.<br/><br/>Facing Lin Niu’s attack, the Phoenix clan’s disciples didn’t have the slightest chance to resist!<br/><br/>In fact, when the energy swept over, they didn’t even have time to react!<br/><br/>In addition, Lin Niu was a heavenly yuan creation level powerhouse, ordinary resurrection treasures were useless against a heavenly yuan creation level kill.<br/><br/>Only those powerful resurrection treasures could resurrect them under the annihilation of an elite in the Heaven’s origin realm!<br/><br/>“Good, good! ”<br/><br/>The Emperor of Phoenix roared crazily when he saw his disciple being killed.<br/><br/>He stared fixedly at Wang Xian as though he wanted to remember it in his<br/><br/>mind.<br/><br/>Boom<br/><br/>Wang Xian stared at him indifferently. With a wave of his arm, a wave of energy covered him directly. The destructive energy annihilated him.<br/><br/>This time, the Emperor of Phoenix did not Dodge.<br/><br/>His corpse fell to the ground quietly!<br/><br/>He was resurrected elsewhere.<br/><br/>Wang Xian waved his arm and kept the corpse.<br/><br/>He looked to the side where the disciples of the Phoenix clan were. At this moment, all the corpses had been kept.<br/><br/>When they died, there was no pain at all.<br/><br/>Under the attack of the Linniu, they lost consciousness in an instant.<br/><br/>“The grudges on the Dragon King’s side have been resolved. Do the others have any grudges? If so, let’s resolve them as well. After all the grudges have been resolved, our nine-origin universe will become one. We will advance and retreat together to welcome the upcoming calamity. ”<br/><br/>The Shadow Devil Emperor saw that everything was over and spoke.<br/><br/>Since Wang Xian had already made an exception, who could continue to make a move if they had any grudges.<br/><br/>The current nine-origin universe was already powerful enough.<br/><br/>It was much, much stronger than the previous calamity.<br/><br/>The main reason was that during the previous calamity, he was the only existence at the Great Dao level. Now, he could be considered to have an additional dragon king.<br/><br/>This caused the strength of the entire nine-origin universe to increase by a lot.<br/><br/>It did not matter even if one or two heaven origin creation realm powerhouses died.<br/><br/>The other heaven origin creation realm powerhouses shook their heads when they heard the fallen Shadow Demon Emperor’s words.<br/><br/>Strength is king. Dragon King, with your current strength, you can break the rules. Next, are you willing to set a new rule with us? We will abide by it together. ”<br/><br/>The Hetian Saint looked at Wang Xian and said.<br/><br/>“Thank you, everyone. I broke the rules this time to avenge the entire Divine Dragon Clan. If it wasn’t for the Phoenix clan, the Divine Dragon Clan wouldn’t have perished. The hatred between us can not be resolved.”<br/><br/>“I don’t have any conflicts with the rest of you. We are creatures of the nine-origin universe. Next, I am willing to fight with you to defend our nine-origin universe. ”<br/><br/>Wang Xian looked at the fallen Shadow Demon Emperor and the rest. He cupped his hands at them and said.<br/><br/>This was also a statement.<br/><br/>Although he was very strong. he was still a creature from the nine-origin universe.<br/><br/>Naturally, he did not want to see the universe where he was living in suffering and being invaded by other universes.<br/><br/>“It’s understandable. Now that the Phoenix clan has been exterminated by you, Dragon King, Your Dragon Palace will take over this place. Queen of the floating waters, Congratulations on your breakthrough. Should we arrange a celebration ceremony in a few days to celebrate it properly?”<br/><br/>The Royal Heavenly Yuan Creation Realm Powerhouse looked at queen floating water and said with a smile.<br/><br/>He was not strong, and the time for his breakthrough was not too long.<br/><br/>Now that the Dragon King of the Dragon Palace was so powerful, he naturally wanted to be closer to him.<br/><br/>He also wanted to be friendlier.<br/><br/>Queen floating water smiled and nodded.<br/><br/>“Thank you, everyone! ”<br/><br/>She cupped her hands and said, “In ten days, my immortal nation will invite you to a banquet.”<br/><br/>“Hehe, Queen Floating Water’s breakthrough is a blessing for my nine-origin universe. ”<br/><br/>Black Tortoise patriarch smiled faintly and said politely.<br/><br/>Since things had come to this point, everyone had already accepted this fact!<br/><br/>“See you in ten days!”<br/><br/>The Elven Queen Said and then led all the powerful disciples of the Elf race away.<br/><br/>After that, the Heavenly Yuan creation realm experts also left with their disciples.<br/><br/>This was the territory of the Dragon Palace!<br/><br/>The Dragon Palace would have to clean up the Phoenix clan as well!<br/><br/>“Thank you again, Dragon King! ”<br/><br/>Queen of floating water saw the powerhouses of the Heaven’s origin realm leaving one after another. She bowed to Wang Xian once again. “Dragon King, I’m really sorry that I wasn’t able to help you this time.”<br/><br/>“Hehe, there’s no need. It’s your good fortune to be able to achieve a breakthrough. Refine some resurrection treasures first. This is very important to the new powerhouses of the Heaven’s origin realm. ”<br/><br/>Wang Xian smiled at her.<br/><br/>This time the result, Wang Xian is very satisfied!<br/><br/>And, more than expected, the harvest is greater!<br/><br/>This time, not only accepted the entire Phoenix clan, beheaded the Phoenix Emperor.<br/><br/>In addition, he also obtained a Tianyuan destiny strong man’s corpse.<br/><br/>A whole body!\t\t\t\t\t\t</div>", "images": {}, "success": true}