{"id": 1225, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074626.html", "title": "Chapter 4228 - Chapter 4228: What A Surprise!", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4228 - Chapter 4228: What A Surprise!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4228: What a surprise!<br/><br/>Translator: 549690339<br/><br/>Wang Xian brought along the chaos and flew towards the direction he was pointing at.<br/><br/>Their speed was very fast, much faster than the speed of an ordinary Heaven’s origin cosmic behemoth.<br/><br/>After flying for more than half a year, Wang Xian sensed a strong energy fluctuation in front of him!<br/><br/>This energy fluctuation was not concealed at all.<br/><br/>The aura of the wilderness was surging around.<br/><br/>There was also a stench mixed in!<br/><br/>“It’s right in front!”<br/><br/>Wang Xian said to Hun Dun. With a move of his palm, he took out the investigative treasure.<br/><br/>This was the investigative treasure that he had traded with the twelve ancestral warlocks.<br/><br/>After Wang Xian opened it, some information about the space behemoth was displayed on it.<br/><br/>According to the information displayed on the investigative treasure, Hun Dun was right. This Nine Corpse Beast Emperor was an existence that had just entered the heaven’s origin creation level.<br/><br/>Due to the characteristics of the space behemoth, even if it was an existence who had just entered the Heaven’s origin creation level, Wang Xian was not 100% certain that he could kill it completely.<br/><br/>This was similar to how Wang Xian’s current strength was very strong. He could kill an existence at the control level.<br/><br/>However, although an expert at the control level could be killed by Wang Xian, they all had resurrection treasures.<br/><br/>The space behemoths didn’t have such treasures.<br/><br/>They didn’t know how to use such treasures either.<br/><br/>However, there was a catch!<br/><br/>Their talents, their life-saving means, and their abilities were numerous.<br/><br/>It was still extremely difficult to completely kill a space behemoth.<br/><br/>The difficulty was no less than completely killing a heaven ‘s origin creation powerhouse who had a resurrection treasure.<br/><br/>Therefore, when Wang Xian approached, he did not act rashly!<br/><br/>Moreover, battles could not erupt in the starry universe.<br/><br/>There were also Heaven’s origin creator level space beasts in the infinite starry universe that did not leave.<br/><br/>Wang Xian had been following behind the Nine Corpse Beast Emperor.<br/><br/>He followed closely behind based on its aura.<br/><br/>A year passed very quickly. During this year, Wang Xian and the rest had arrived at the edge of the starry universe.<br/><br/>However, just as Wang Xian and the rest were about to step out of the starry universe, a few red dots suddenly appeared on the investigative treasure in his hand.<br/><br/>This made Wang Xian slightly stunned. His gaze focused and he immediately stopped.<br/><br/>Hun Dun was slightly stunned when he saw Wang Xian suddenly stopping. He revealed an astonished expression, “Dragon King, What’s Wrong?”<br/><br/>“There are other heaven origin creator-level powerhouses appearing. Four of them!”<br/><br/>Wang Xian opened his mouth and said. His eyes flickered slightly.<br/><br/>“What?”<br/><br/>Hundun was slightly shocked when he heard that.<br/><br/>“Three of them are at the mastery level and one is at the beginner level. They are located in front of the Nine Corpse Beast Emperor. Their goal should be the Nine Corpse Beast Emperor. ”<br/><br/>Wang Xian started guessing and frowned slightly.<br/><br/>To think that there were still powerhouses of the Heaven’s origin manifestation who had their eyes on the Nine Corpse Beast Emperor.<br/><br/>Was this a coincidence or something?<br/><br/>No, the possibility of a coincidence was too small.<br/><br/>“How is this possible? Why would there be other powerhouses of the Heaven’s origin manifestation who want to attack the Nine Corpse Beast Emperor? How did they know?”<br/><br/>Hun Dun also focused his gaze and whispered.<br/><br/>“There are two possibilities. First, there are powerhouses of the Heaven’s origin manifestation from other universes who have their eyes on the starry universe and have set up all sorts of scouting treasures in the starry universe. ”<br/><br/>Second, there are creatures from the starry universe who have contacted the powerhouses from other universes and obtained traces of the Nine Corpse Beast Emperor in advance. ”<br/><br/>Wang Xian spoke.<br/><br/>He was more inclined towards the second possibility.<br/><br/>If it was the first possibility, then Wang Xian would have been discovered by now.<br/><br/>However, it was obvious that he had not been exposed yet.<br/><br/>Furthermore, if the starry universe was set up with all sorts of scouting methods by the powerhouses from other universes, under normal circumstances, with Wang Xian’s strength, he should be able to discover it in advance.<br/><br/>After all, he was not the Nine Corpse Beast Emperor without intelligence.<br/><br/>His strength was also much stronger than the Nine Corpse Beast Emperor.<br/><br/>It was very rare for him to be able to hide from his scouting.<br/><br/>If it was the second case, it would be interesting!<br/><br/>Hun Dun was floating at the side with his eyes flickering slightly.<br/><br/>Clearly, he had some guesses!<br/><br/>Wang Xian stood there quietly. He did not move forward nor did he retreat.<br/><br/>He was waiting.<br/><br/>At the same time, at the position in front of him.<br/><br/>In human form, both of his legs were stepping on the void. He had nine arms.<br/><br/>The head of a humanoid was filled with corroded flesh and blood.<br/><br/>Each of them had huge teeth that were exposed outside. They were emitting a dark glow.<br/><br/>His body was extremely huge. A planet in front of him was only the size of a ping pong ball.<br/><br/>He was flying in the starry sky.<br/><br/>In front of him was the primal Chaos!<br/><br/>The Peaceful Primal Chaos!<br/><br/>“He’s about to come out. Get ready to make a move later! ”<br/><br/>At the same time, in the primal chaos space outside the starry sky.<br/><br/>Four figures were located in four different directions.<br/><br/>Their bodies were emitting pure white holy light.<br/><br/>Different from the white of light attribute, this White was even purer!<br/><br/>They all looked towards the interior of the starry universe. Obviously, they were waiting for the arrival of the Nine Corpse Beast Emperor.<br/><br/>They were heaven origin destiny realm powerhouses who believed in the universe.<br/><br/>They paid a huge price to break through the starry universe’s passageway ahead of time.<br/><br/>It wasn’t for that little bit of the starry universe’s resources.<br/><br/>It was for the starry universe’s starry behemoths.<br/><br/>The starry behemoths could use their powerful will power and the power of faith to make them submit and become believers.<br/><br/>Furthermore, because of the vitality and strength of the starry behemoths.<br/><br/>A single starry behemoth believer was equivalent to tens of billions of powerful human believers.<br/><br/>Of course, the heavenly fate level starry behemoths couldn’t develop into believers.<br/><br/>However, by hunting them, they could help their believers increase their strength.<br/><br/>Once the space beast was developed into a believer, they would never betray it.<br/><br/>Through some methods, the few experts from the belief universe accurately learned some information about the Nine Corpse Beast Emperor.<br/><br/>“It’s Out! ”<br/><br/>At this moment, a heaven origin creation realm expert from the belief universe focused his gaze and said!<br/><br/>“Get Ready! ”<br/><br/>Four Heaven origin creation realm experts suddenly sat cross-legged.<br/><br/>The power of faith radiated from their bodies as they quietly sensed the nine corpse beast emperor fly out of the universe! (‘I will lead all living beings to heaven! ”<br/><br/>“I will lead all living beings to heaven!”<br/><br/>When the four heaven creation realm experts saw the Nine Corpse Beast Emperor come out.<br/><br/>When they saw the Nine Corpse Beast Emperor enter the position they had set up, they muttered.<br/><br/>A majestic power of faith erupted from their bodies.<br/><br/>A phantom image of heaven instantly enveloped the nine corpse beast emperor.<br/><br/>Following that, the Nine Corpse Beast Emperor’s figure disappeared instantly!<br/><br/>Following that, the four heaven origin creation powerhouses who believed in the universe also disappeared!<br/><br/>At the same time, at the back, Wang Xian had been quietly sensing the situation in front of him.<br/><br/>When he sensed that their figures had all disappeared, his expression changed slightly! “Let’s Go! ”<br/><br/>Wang Xian’s figure moved and flew forward quickly!<br/><br/>He took a look at the scouting treasure in his hand. There was no longer any indication on it.<br/><br/>“What’s going on? are the four heaven origin powerhouses the ones who transferred the Nine Corpse Beast Emperor Away?”<br/><br/>Wang Xian was astonished..\t\t\t\t\t\t</div>", "images": {}, "success": true}