{"id": 1229, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074642.html", "title": "Chapter 4232 - Chapter 4232: 4231 Succeeded", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4232 - Chapter 4232: 4231 Succeeded</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4232: 4231 succeeded<br/><br/>Translator: 549690339<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>The moment Tianci made his move, the god striking branch instantly arrived in front of the body of a king of all gods.<br/><br/>It ignored the distance in space and launched an attack instantly.<br/><br/>This caused the expression of the king of all gods who was at the control level to change drastically. He hurriedly tried to defend himself!<br/><br/>He tried to dodge!<br/><br/>A treasure at the heaven origin creation level had a terrifying offensive power!<br/><br/>It would cause tremendous damage to other powerhouses!<br/><br/>Buzz<br/><br/>At the moment when Tianci made his move, Wang Xian moved again.<br/><br/>He did not charge at the Nine Corpse Beast Emperor.<br/><br/>Instead, his body shook.<br/><br/>The five elements grinding mill and the Tai Chi Dragon Plate immediately transformed into a divine dragon and attacked a king of Pantheon who was at the control level.<br/><br/>At the same time, Wang Xian moved his body and attacked the third king of Pantheon!<br/><br/>“You ‘re courting death. You actually want to snatch the spoils of war from our belief universe. You ‘re really courting death! ”<br/><br/>The faces of the three king of Pantheon who were at the control level were filled with rage!<br/><br/>Surround and attack him! ”<br/><br/>One of the king of Pantheon shouted loudly at the son of a beginner-level heaven origin creation stage powerhouse who was sitting cross-legged at the side!<br/><br/>The gaze of the heaven origin creation stage powerhouse who was sitting cross-legged at the side froze.<br/><br/>He made use of the chains around him to attack the Tai Chi Dragon Plate directly!<br/><br/>One of the kings of Pantheon who was at the control level was dealing with the tai chi dragon plate and the five elements grinding mill!<br/><br/>One of the kings of Pantheon who was at the control level was being held back by tianci!<br/><br/>The third king of Pantheon who was at the control level charged straight at Wang Xian!<br/><br/>“With your strength, you still want to snatch our spoils of war? Die! ”<br/><br/>When the king of Gods, who was at the control level, saw Wang Xian attacking him, he let out a furious roar!<br/><br/>He moved his palm and held a huge sword. It was filled with the power of faith as he slashed at Wang Xian!<br/><br/>A sword ray broke through the chaos.<br/><br/>Within the sword ray, there was a bewitching sound.<br/><br/>Facing this sword ray, it gave people an illusion.<br/><br/>It felt like this wasn’t the sword of execution, it wasn’t the sword of judgment.<br/><br/>It was the sword that led to heaven!<br/><br/>Strange and terrifying!<br/><br/>When Wang Xian saw this scene, the corner of his mouth curled up slightly. His dragon horn emitted a radiance and a nine-colored ray of light attacked the sword ray directly!<br/><br/>“Bang Bang! ”<br/><br/>At this moment, the five elements grinding tai chi dragon disc was facing the attack of a control level and a beginner level heaven origin creation level powerhouse. It had no ability to resist.<br/><br/>At this moment, they were sent flying in an instant!<br/><br/>Buzz<br/><br/>However, the moment the Five Elements Millstone and the Tai Chi Dragon Disc stopped them.<br/><br/>On Wang Xian’s body, the body of the Void Divine Dragon had already disappeared!<br/><br/>At this moment, he was already very close to the Nine Corpse Beast Emperor!<br/><br/>When the Five Elements Millstone and the Tai Chi Dragon disc were sent flying backwards.<br/><br/>The body of the Void Divine Dragon had already arrived beside the Nine Corpse Beast Emperor!<br/><br/>The body of the Void Divine Dragon waved his arm, and a stream of space energy directly cut his body.<br/><br/>The Void Divine Dragon, which was already on the verge of death, was instantly wiped out of all its life force.<br/><br/>Following that, the body of the Void Divine Dragon brought the corpse of the Nine Corpse Beast Emperor away in an instant!<br/><br/>“Not good. ”<br/><br/>At the side, the king of Gods, who believed in the universe, saw that the body of the Nine Corpse Beast Emperor was divided into half and stored in the spatial storage. His expression changed drastically when he saw that it was taken away!<br/><br/>All the king of all gods were trying to stop Wang Xian and the rest.<br/><br/>However, they did not expect that a space-attributed heaven origin creator would fly out from Wang Xian’s body.<br/><br/>When Wang Xian teleported over earlier, the ten types of energy in his body were mixed together. They did not sense that Wang Xian’s body still had the power of space!<br/><br/>Even though he had teleported, they thought that it was another type of energy.<br/><br/>However, the sudden appearance of a space-attributed heaven origin creation-level powerhouse made them look extremely embarrassed.<br/><br/>It made them feel anxious and anxious!<br/><br/>They had spent more than a billion years in order to hunt down a heaven origin creation-level space beast.<br/><br/>Now that they were about to succeed, it was snatched away by other powerhouses.<br/><br/>This was something they could not accept!<br/><br/>“Retreat!”<br/><br/>Wang Xian saw that he had succeeded. His eyes lit up as he let out a wild roar and transmitted his voice to tianci!<br/><br/>“It’s foster father! ”<br/><br/>Tianci waved the god-slaying branch in his hand. His body moved and he immediately flew towards the direction of the starry universe.<br/><br/>Wang Xian also did not hesitate at all. He immediately fled to the back!<br/><br/>He was prepared to leave immediately.<br/><br/>When tianci was fleeing, the god-slaying branches did not land on the four kings of pantheon.<br/><br/>Instead, they landed on the Feilian, Gong Ya, Yayu, and the four space behemoths.<br/><br/>Although the life force of the space behemoths was extremely terrifying, they could not resist against a destructive force that was comparable to the control level.<br/><br/>The terrifying god-striking branches landed on their bodies and instantly wiped them out completely!<br/><br/>stop!<br/><br/>“Don’t even think about escaping! ”<br/><br/>The four kings of the gods who believed in the universe roared with murderous intent.<br/><br/>Their eyes were bloodshot. They immediately unleashed terrifying attacks and attacked Wang Xian and the rest!<br/><br/>However, their strength was not stronger than Wang Xian and the rest.<br/><br/>In the Heaven’s origin blessed realm, it was impossible for them to kill their opponents with similar strength!<br/><br/>Faced with their attacks, Wang Xian quickly dodged and flew forward.<br/><br/>The four kings of pantheon trembled slightly as they chased after them furiously!<br/><br/>“Tianci, let’s go.”<br/><br/>Wang Xian’s face was full of smiles at this moment.<br/><br/>Looking at an lie who was waiting in front of him, a smile appeared on his face!<br/><br/>They flew to the front of an lie and disappeared instantly under the cover of an Lie’s energy!<br/><br/>At the back, the king of Pantheon, who was chasing after Wang Xian, saw that they had disappeared instantly. His face turned grim.<br/><br/>They immediately used their treasures to sense their surroundings.<br/><br/>However, their faces turned grim very quickly.<br/><br/>Their faces were almost bleeding!<br/><br/>“Who are they? How dare they snatch our spoils of war! ”<br/><br/>One of the kings of the gods couldn’t help but Roar in anger.<br/><br/>Their long-planned plan had been completely ruined.<br/><br/>Even the four space beasts that they had spent a lot of effort to subdue were killed.<br/><br/>This was something that the four kings of the gods couldn’t accept.<br/><br/>“Father, it’s the Dragon God, the Dragon God of the 9-origin universe, and those two damn fellows again! ”<br/><br/>The newly-promoted king of gods looked at his father and said with a gloomy face.<br/><br/>“It’s them. The Dragon Palace Dragon King from the nine-origin universe killed many of our disciples in the Starry Universe. ”<br/><br/>The old man nodded coldly, and his breathing was a little hurried.<br/><br/>They had planned to go to the sword and the magic universe, but they were attacked by the Great Beings from the nine-origin universe and a godly dragon, and they were killed.<br/><br/>Because he was afraid of that godly dragon, who was comparable to a great dao, he gave up on the sword and Magic Universe.<br/><br/>Instead, he went to plan this place with the kings of the gods from other universes.<br/><br/>Unexpectedly, it was destroyed by this guy again!<br/><br/>“Dragon Palace Dragon King from the 9-origin universe?”<br/><br/>The other two heaven origin creation great beings at the control level murmured with cold expressions.<br/><br/>But soon, their faces were filled with unwillingness and helplessness..\t\t\t\t\t\t</div>", "images": {}, "success": true}