{"id": 1226, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074630.html", "title": "Chapter 4229 - Chapter 4229: 4228 Tamed Beast King!", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4229 - Chapter 4229: 4228 Tamed Beast King!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4229: 4228 tamed Beast King!<br/><br/>Translator: 549690339<br/><br/>Wang Xian did not expect an accident to happen to the Nine Corpse Beast<br/><br/>Emperor.<br/><br/>After all the auras disappeared, he flew forward quickly.<br/><br/>At the same time, his brain was thinking crazily.<br/><br/>“If I want to hunt down the space beasts in the starry universe, in order to prevent them from escaping into the starry universe and alerting the other heaven origin creation Space Beasts, I will definitely lure them to somewhere far away from the Starry Universe! ”<br/><br/>“Now that the Nine Corpse Beast Emperor and the four Heaven’s origin creation realm powerhouses have suddenly disappeared, the four powerhouses must have used some kind of method to teleport the Nine Corpse Beast Emperor to another place! ”<br/><br/>“There are three Heaven’s origin creation realm powerhouses at the control level and one who has just entered the beginner level. Their strength is already very terrifying, comparable to an existence at the Great Dao level. ” Wang Xian pondered in his heart and flew forward quickly.<br/><br/>When he arrived at the spot where the Nine Corpse Beast Emperor had disappeared, he stood there quietly and sensed it.<br/><br/>“The power of faith! ”<br/><br/>Wang Xian sensed this familiar energy and his eyes flickered slightly.<br/><br/>He moved his body and continued flying forward.<br/><br/>It was impossible for the Nine Corpse Beast Emperor to be killed in an instant.<br/><br/>They must have used a special method to teleport him to another place.<br/><br/>The best place was a place far away from the starry universe.<br/><br/>In other words, a straight line was the furthest.<br/><br/>It should be in front.<br/><br/>He thought to himself.<br/><br/>“You wait here first. I’ll go ahead and take a look.”<br/><br/>Wang Xian instructed the nine-corpse beast emperor. Then, he concealed himself and flew forward rapidly.<br/><br/>While flying in the chaos in front of the universe, Wang Xian kept scanning his surroundings.<br/><br/>After flying for two days, he did not sense the aura of the nine-corpse beast emperor or the fluctuation of faith energy.<br/><br/>This made him frown slightly.<br/><br/>“It seems that the nine-corpse Beast Emperor has been teleported very far away !<br/><br/>Wang Xian mumbled and continued flying forward.<br/><br/>The time required to kill a space beast was definitely not something that could be achieved in a few days.<br/><br/>It would take at least more than ten days.<br/><br/>And this was based on the powerful combat strength of the belief universe.<br/><br/>Buzz Buzz<br/><br/>When Wang Xian flew forward for another two days, an energy fluctuation was transmitted from the front.<br/><br/>“Roar Roar Roar! ”<br/><br/>Following that, another roar was heard.<br/><br/>“As expected! ”<br/><br/>When Wang Xian heard the roar and the terrifying energy fluctuation, his eyes lit up.<br/><br/>He took out the treasure for investigation.<br/><br/>When he saw the investigation situation on the compass, he was astonished.<br/><br/>On the investigation compass, not only were there four heaven origin powerhouses and the Nine Corpse Beast Emperor, but there were also hundreds of thousands of universe masters.<br/><br/>They formed a circle and surrounded the nine corpse beast emperor.<br/><br/>Wang Xian concealed his energy and slowly approached.<br/><br/>Soon, the scene in front of him appeared in his sight.<br/><br/>In his sight, hundreds of thousands of universe masters formed a circular encirclement.<br/><br/>They did not launch any attacks. Instead, they sat cross-legged in the void, closed their eyes, put their palms together, and chanted continuously. Waves of faith power surged out of their bodies, forming a chain.<br/><br/>The chain was connected to one place.<br/><br/>There, a faith universe great being who had just entered the initial stage of heavenly creation was also sitting cross-legged.<br/><br/>All the chains were concentrated on his body.<br/><br/>He was also chanting, and an even larger and stronger faith chain came out of his body and wound toward Nine Corpse Beast Emperor in the center.<br/><br/>At the triangle of the Nine Corpse Beast Emperor, there were three figures!<br/><br/>Two of them held magic staffs, and one held a huge sword.<br/><br/>They didn’t attack, but instead formed a triangular barrier.<br/><br/>The extremely dense power of faith completely surrounded the Nine Corpse Beast Emperor in the center.<br/><br/>At the center.<br/><br/>Symbols and weapons formed from the power of faith continuously attacked the Nine Corpse Beast Emperor!<br/><br/>The nine-corpse Beast Emperor was trapped in the middle and had no way of resisting at all.<br/><br/>Clearly, the experts from the belief universe had set up an altar here in advance.<br/><br/>The nine-corpse Beast Emperor was trapped in this powerful altar and had no way of escaping.<br/><br/>After Wang Xian arrived, he didn’t attract the attention of the experts from the belief universe.<br/><br/>His strength far surpassed any of the experts from the other party.<br/><br/>In addition, all the experts from the belief universe were gathered on the body of the Nine Corpse Beast Emperor!<br/><br/>Wang Xian sized up everything around him. His gaze landed on one spot and flickered slightly.<br/><br/>There were four gigantic space beasts there.<br/><br/>They were located at the back. They were nervous but also a little excited as they watched this scene.<br/><br/>“These should be the space beasts that are reporting the news to the belief universe! ”<br/><br/>Wang Xian sized them up and sent their images to Hun Dun through the communication device!<br/><br/>“Dragon King, that’s feilian, Gong Ya, yayu, and Xu Hao. Why… why are they together with the experts from the belief universe?”<br/><br/>Very soon, an unbelievable message came from Hun Dun!<br/><br/>Feilian, Gong Ya, yayu, and Xu Hao. The four of them had come to the starry universe together with Hun Dun from the nine-origin universe!<br/><br/>Now, the four of them, without his knowledge, were mixed together with the Heaven’s origin creation of the belief universe.<br/><br/>This shocked him greatly.<br/><br/>“They must have been taken in as believers by the powerhouses of the belief universe! ”<br/><br/>Wang Xian looked at feilian, Gong Ya, yayu, and Xu Hao and replied to Hun Dun!<br/><br/>The four powerful starry beasts looked at the Heaven’s origin creation powerhouses of the belief universe with burning eyes.<br/><br/>Apparently, they had been taken in as believers!<br/><br/>However, they did not know how they had quietly taken in the four space beasts as their believers!<br/><br/>After all, the four space beasts had already touched the threshold of breaking through.<br/><br/>“They should have been taken in by the people who believe in the universe through insidious means. Because of the special energy in my body, the power of faith is ineffective against me, so I escaped a disaster.” Primal Chaos City leader said.<br/><br/>Then he thought of Feilian, Gong Ya, yayu, and Xu Yu.<br/><br/>The space beasts under them must have been subdued by the Great Beings from the belief universe!<br/><br/>He was furious and terrified.<br/><br/>If it weren’t for the special energy in his body.<br/><br/>If it weren’t for his strong resistance to the power of belief, he would have become a lackey of the belief universe.<br/><br/>“It seems that after the disciples of the nine-origin universe left, the belief universe made a lot of arrangements. After more than a billion to two billion years of arrangements, they were able to subdue even space behemoths like Feilian, Gong Ya, yayu, and Xu Hao! ”<br/><br/>Wang Xian was also amazed.<br/><br/>Feilian, Gong Ya, yayu, and Xu Hao, the four beast kings, were subdued. Naturally, the space behemoths that followed the four beast kings were subdued as well.<br/><br/>Now, they began to attack the heavenly creation-level beasts..\t\t\t\t\t\t</div>", "images": {}, "success": true}