{"id": 1220, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074606.html", "title": "Chapter 4223 - Chapter 4223: 4222 Splitting The Heaven And Earth", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4223 - Chapter 4223: 4222 Splitting The Heaven And Earth</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4223: 4222 splitting the heaven and earth<br/><br/>Translator: 549690339<br/><br/>The fact that Ling Honggu was able to reach such a level naturally had something to do with Wang Xian.<br/><br/>Although Ling Honggu wasn ‘t the Dragon Queen of the Dragon Palace, their relationship was pretty close.<br/><br/>The girls of the Dragon Palace had already acknowledged him.<br/><br/>After all, Ling Honggu had fought side by side with the Dragon Palace back then.<br/><br/>She had survived a crisis.<br/><br/>She had spent a long period of time with the Dragon Palace and Wang Xian!<br/><br/>However, Ling Honggu did not want to join the Dragon Palace. Her father and grandfather were very good to her.<br/><br/>With the support of the Dragon Palace’s various powerful resources, she had already become a top-notch master of the skeleton clan at the peak of the universe.<br/><br/>Furthermore, the skeleton clan also knew about the relationship between Ling Honggu and Wang Xian. The other kings of the skeleton clan were very polite to Ling Honggu and even respected him.<br/><br/>After all, the current Dragon King of the Dragon Palace was too powerful!<br/><br/>Wang Xian nodded his head at Ling Honggu.<br/><br/>Ling Honggu also smiled at him.<br/><br/>Wang Xian scanned his surroundings. The skeleton clan, the Divine Tiger clan, and the Saint clan all had powerhouses at the peak of the Overlord realm.<br/><br/>“The Dragon King is here. Sit!”<br/><br/>When the Hetian saint saw Wang Xian, he gestured with a smile on his face.<br/><br/>Okay!<br/><br/>Wang Xian sat at the side. Soon, the other powerhouses of the Heaven’s origin realm also rushed over.<br/><br/>“There’s still a year before the calamity begins. Let’s have a final discussion. ”<br/><br/>The Fallen Shadow Demon Emperor arrived. He scanned all the powerhouses around him and asked, “Currently, how many people have already touched the threshold of the Heaven’s origin realm?”<br/><br/>“Lord Fallen Shadow Demon Emperor, I have already touched the threshold of the Heaven’s origin realm. As long as there’s a spot, I will be able to break through! ”<br/><br/>An elder from the skeleton clan bowed and said!<br/><br/>“Your subordinate, Tiger Roar Mountain, has also touched the threshold of a heavenly yuan creation realm expert. ”<br/><br/>An expert from the Divine Tiger clan immediately bowed.<br/><br/>(‘My saint lineage has a water-type disciple who has touched the threshold! ”<br/><br/>The Hetian Saint also spoke!<br/><br/>“Mm, my demon clan also has a disciple.”<br/><br/>The Fallen Shadow Demon Emperor nodded, he said, “During the last calamity, my demon race had a disciple who was able to break through. Unfortunately, I was watched by the Void Empire and was unable to leave the nine-origin universe. He went to break through on his own but never came back. This time, with the Dragon King around, it’s an opportunity for us! ”<br/><br/>As the Fallen Shadow Demon Emperor spoke, he looked at Wang Xian with a rare smile on his face.<br/><br/>Senior fallen Shadow Demon Emperor, you are in charge of the nine-origin universe. I admire you. My current strength is enough to fight against ordinary Great Dao Masters. ”<br/><br/>Wang Xian cupped his hands at the fallen Shadow Demon Emperor.<br/><br/>The Fallen Shadow Demon Emperor was very powerful. Logically speaking, he could bring his powerful disciples to other universes to make a breakthrough.<br/><br/>With him protecting them, the chances of success were very high.<br/><br/>However, because of the Void universe, he had to guard the nine-origin universe and could not go far away. That was why the demon race had never produced a second heaven origin creator.<br/><br/>It could be said that the demon race had sacrificed themselves in exchange for the Peace of the entire nine-origin universe!<br/><br/>Wang Xian still respected this point!<br/><br/>“This time, I will take charge of the nine-origin universe. Senior Shadow Devil Emperor can lead the disciples to break through and protect the array. ” Wang Xian hesitated for a moment before speaking again.<br/><br/>“Let me handle the matter of taking charge of the nine-origin universe. After all, I have experience and I have a very good understanding of the void. ”<br/><br/>Shadow Devil Emperor shook his head. “I still can’t leave the nine-origin universe. Dragon King, you will protect them. ”<br/><br/>The Fallen Shadow Demon Emperor was a little worried about Wang Xian.<br/><br/>After all, if he failed, it would be a huge blow to the nine-origin universe!<br/><br/>Countless lives would die.<br/><br/>The Fallen Shadow Demon Emperor and Wang nihility of the Void dynasty had been fighting for a very long time.<br/><br/>Both parties were more familiar with each other, so he was more confident.<br/><br/>“That’s fine too! ”<br/><br/>Wang Xian nodded. The Fallen Shadow Demon Emperor’s presence was beneficial to Wang Xian!<br/><br/>After all, this way, he could move around in peace!<br/><br/>“If we can increase the number of heaven origin creator powerhouses in our nine-origin universe, I suggest that we attack the Void Universe. ” A hint of killing intent flashed in Wang Xian’s eyes as he spoke!<br/><br/>“In the early stages, both of us and the other party should investigate the strength of both parties. We will consider whether to attack after the initial stages have passed. ”<br/><br/>The eyes of the fallen Shadow Demon Emperor flickered as he spoke.<br/><br/>Wang Xian nodded.<br/><br/>“The few of you who can make a breakthrough, go and look for a universe that can make a breakthrough. Look for a universe that has a quota for your attributes. After you find it, contact the Dragon King. The Dragon King will protect you. ”<br/><br/>The Fallen Shadow Demon Emperor spoke to the experts of the Divine Tiger clan’s skeleton clan.<br/><br/>As for the powerhouse from his tribe and the Saint tribe, he would naturally not let them take the risk.<br/><br/>They would help in the search.<br/><br/>This was the benefit of having a powerhouse of the Heaven’s origin manifestation in their tribe.<br/><br/>The skeleton tribe and the Divine Tiger tribe could only search for a suitable universe on their own.<br/><br/>Moreover, this universe could not be too strong!<br/><br/>Wang Xian and the rest could not help in the search for the universe. After all, their relationship was just that.<br/><br/>Moreover, protecting the array was already a great gift to the powerhouses of the Divine Tigers of the skeleton race.<br/><br/>It was not difficult to find a universe that could be broken through.<br/><br/>The difficulty was how to make the breakthrough and how to leave after the breakthrough.<br/><br/>This was a huge problem.<br/><br/>To them, it could even be described as a narrow escape.<br/><br/>The probability of success was only one-tenth.<br/><br/>If Wang Xian protected the formation, the probability of success would reach<br/><br/>After all, an existence at the level of the Great Dao was still very terrifying.<br/><br/>It was a strong guarantee for their breakthrough.<br/><br/>“Thank you, Lord Shadow Devil Emperor, thank you, Dragon King, thank you all!<br/><br/>The powerhouses from the skeleton clan and the Divine Tiger clan expressed their gratitude immediately with excitement and excitement.<br/><br/>With the Dragon King protecting their formation, their chances of breaking through would be as high as 90% .<br/><br/>Unless they were too unlucky.<br/><br/>Otherwise, the chances of them breaking through would be very, very high.<br/><br/>This made them extremely excited. This was the benefit of a powerful universe.<br/><br/>“There’s no need! ”<br/><br/>Wang Xian shook his head lightly.<br/><br/>“According to what we’ve said before, in the early stages, we’ll focus on observing the situation of the nearby universe. We’ll investigate the situation of the Void Universe. We’ll have to make some arrangements for this!” The Fallen Shadow Devil Emperor continued.<br/><br/>“The Dragon King is busy protecting the path. Leave the investigation of the<br/><br/>Void Universe to me.”<br/><br/>The 12 ancestral witches were the first to speak.<br/><br/>“Alright, the investigation of the Void Universe is the most dangerous. You must pay attention to your safety.”<br/><br/>The Fallen Shadow Demon Emperor said to them. “If there’s anything, you can contact me directly. ” Wang Xian also spoke to the 12 ancestral witches..\t\t\t\t\t\t</div>", "images": {}, "success": true}