{"id": 1221, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074610.html", "title": "Chapter 4224 - Chapter 4224: 4223 Splitting The Heavens And Earth! Descend", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4224 - Chapter 4224: 4223 Splitting The Heavens And Earth! Descend</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4224: 4223 splitting the heavens and earth! Descend<br/><br/>Translator: 549690339<br/><br/>Wang Xian was having a discussion with the fallen Shadow Demon Emperor and the rest.<br/><br/>During the early stages of the Cataclysm, which was the first 100 to 200 million years, the main focus was on scouting and scouting for all sorts of information.<br/><br/>At this time, the nine-origin universe would not take the initiative to start a battle.<br/><br/>After scouting and helping a few disciples of the nine-origin universe to achieve a breakthrough, they would proceed with their next action.<br/><br/>They would decide whether to attack the void universe or something else.<br/><br/>After everything was discussed, Wang Xian and the rest returned to their respective races.<br/><br/>One year was too fast for them!<br/><br/>Buzz<br/><br/>On this day, Wang Xian felt something and flew out of the palace.<br/><br/>Countless disciples of the Dragon Palace were in the surroundings.<br/><br/>A group of disciples from the peak races also sensed something. They flew out of the palace where they were cultivating.<br/><br/>Countless strong disciples stood on the branches of the tree of chaos and looked around.<br/><br/>Buzz Buzz Buzz<br/><br/>Buzz Buzz Buzz<br/><br/>At this moment, the entire chaos seemed to be trembling.<br/><br/>The chaos that was filled with dead silence seemed to have survived.<br/><br/>The gray chaotic destructive power slowly began to become gentle.<br/><br/>Chaos was no longer a place of death that could not be lived in for other living beings.<br/><br/>A large amount of energy surged into the surroundings.<br/><br/>Gold, wood, water, fire, Earth, light, darkness, wind, thunder, space, and so on.<br/><br/>The power of chaos seemed to have transformed into all energy.<br/><br/>In this place, all the disciples of experts could absorb all kinds of energy.<br/><br/>All of them could cultivate.<br/><br/>Buzz<br/><br/>At this moment, there was a huge ball of light in the distance in front of the tree of chaos.<br/><br/>The ball of light was emitting light.<br/><br/>One could vaguely see the planets and meteorites inside, the boundless starry sky.<br/><br/>Wang Xian stood on top of the tree of chaos and watched everything quietly.<br/><br/>This scene was like the creation of Heaven and earth!<br/><br/>It was like the chaos had been separated.<br/><br/>And the place where the light ball was located was the nine-origin universe.<br/><br/>“The calamity is coming. We should strengthen ourselves and protect the nine-origin universe and our homes! ”<br/><br/>All the strong disciples in the surroundings were filled with shock when they saw this scene.<br/><br/>The Unity Saint stood on top and shouted loudly!<br/><br/>Strengthen ourselves and protect the nine-origin universe! ”<br/><br/>Strengthen yourself and protect the nine-origin universe! ” All the powerful disciples of the peak races shouted loudly! “Nine-origin universe protection team, get into position! ”<br/><br/>The Hetian saint continued to shout.<br/><br/>“Tree of Chaos Protection Team, get into position! ”<br/><br/>Lin Niu stood beside Wang Xian and shouted as well.<br/><br/>Lin Niu was currently guarding the Tree of Chaos.<br/><br/>Similarly, Lin Niu could only reach the dragon palace in an instant if he wanted to.<br/><br/>“The Cataclysm has begun. All the universes have erupted with huge lumps of light. This lumps of light makes all the universes extremely eye-catching in the chaos. It can be seen from afar! ”<br/><br/>Wang Xian muttered as he watched all the changes.<br/><br/>The Cataclysm has begun!<br/><br/>Energy could be absorbed in the chaos.<br/><br/>At this moment, all the universes were like Glowing Suns. They could be seen clearly in the chaos!<br/><br/>“I am here to guard the nine-origin universe. Everyone, the place that you are heading to must not exceed the area that your divine kingdom can sense. If there is any accident, everyone should be able to rush back immediately!”<br/><br/>The voice of the Fallen Shadow Demon Emperor was transmitted into the ears of Wang Xian and the other heaven origin creation stage powerhouses.<br/><br/>The nine-origin universe had a very powerful point.<br/><br/>It was the Cultivation System of the nine-origin universe, the Divine Kingdom!<br/><br/>The powerhouses in the nine-origin universe could return to their divine kingdom in an instant.<br/><br/>Of course, there was a limit to this.<br/><br/>Before the calamity broke out, one could not sense their divine kingdom in the chaos.<br/><br/>However, now that the calamity had broken out, the chaos was calm and gentle. One could sense one’s divine kingdom.<br/><br/>However, there was a limit to sensing one’s divine kingdom.<br/><br/>The stronger one was, the further one could sense one’s divine kingdom. Just like Wang Xian and the rest, they could sense the existence of their divine kingdom even if they came to the nearest universe.<br/><br/>They could also return to the divine kingdom in an instant.<br/><br/>However, the masters of the universe could not sense the presence of the divine kingdom from such a distance!<br/><br/>“Alright! ”<br/><br/>The group of Heavenly Genesis Masters nodded at the Fallen Shadow Demon Emperor.<br/><br/>“Prime Minister Gui, send the disciples of the Dragon Palace to explore. Tell them to pay attention to their safety. If they encounter danger or die, get an lie to bring them back to life with the soul-returning wood branch!”<br/><br/>Wang Xian said to Prime Minister Gui.<br/><br/>With the arrival of the calamity, the Dragon Palace was going to send a portion of their experts to explore the surrounding areas.<br/><br/>They were going to search for treasures and various information.<br/><br/>“It’s the Dragon King! ”<br/><br/>Prime Minister Gui replied immediately.<br/><br/>Wang Xian stood on top of the tree of chaos and looked at the world around him quietly.<br/><br/>He did not leave immediately. Instead, he waited quietly for some news.<br/><br/>The Void Dragon Body had already arrived at the sword and Magic Universe through the teleportation formation.<br/><br/>The Sword and Magic Universe was very far away from the nine-origin universe. If Wang Xian reached there, he would not be able to sense the existence of the divine kingdom.<br/><br/>However, the sword and magic universe was too weak. He needed to take charge of it.<br/><br/>The calamity had already begun. All the living beings in the nine-origin universe could sense some changes in the heaven and earth.<br/><br/>Even at the periphery of the nine-origin universe, the energy had suddenly increased explosively.<br/><br/>To some cultivators, this was a huge surprise.<br/><br/>The rest of the heaven origin creation powerhouses in the nine-origin universe did not act rashly.<br/><br/>They were all waiting for some news.<br/><br/>With the Cataclysm beginning, the nine-origin universe had instead sunk into a short period of peace.<br/><br/>However, before Wang Xian and the rest could calm down for a few days.<br/><br/>A message was sent by the Guardian Army of the nine-origin universe.<br/><br/>When Wang Xian saw this message, he was slightly taken aback.<br/><br/>“In the mountains and seas of the nine-origin universe, there are galactic beasts from the starry universe that came through the passage. They are extremely violent and have been killed for the time being! ”<br/><br/>At this moment, a message was sent by the Guardian Army formed by a group of peak races.<br/><br/>There were more than 20 pinnacle great beings at the level of universe masters in the Guardian Army. They were definitely part of a powerful army.<br/><br/>They were responsible for the safety of the 9 -origin universe during the calamity.<br/><br/>Any living being that entered the 9-origin universe would be immediately killed by them.<br/><br/>The passageway between the 9 -origin universe and the starry universe had existed for a very, very long time.<br/><br/>However, after the discovery of the tree of chaos, the various peak races evacuated all the strong disciples.<br/><br/>Even the starry city was empty.<br/><br/>To the nine-origin universe, there was nothing left to exploit in the starry universe.<br/><br/>As for the center of the starry universe, that was not something they could enter.<br/><br/>The Starry Universe was a very powerful universe.<br/><br/>There were terrifying space beasts there.<br/><br/>However, this time, there were actually space beasts that entered the nine-origin universe from the passageway. Moreover, there were more than a thousand of them. This made Wang Xian and the rest very curious.<br/><br/>“There are fifteen slots for the space beasts in the starry universe.<br/><br/>Furthermore, this slot is already full.”<br/><br/>Wang Xian thought to himself, “Back then, the group of Space Beasts from the mountain and sea region entered the starry universe.. What’s the situation now? Did something happen in the Starry Universe?”\t\t\t\t\t\t</div>", "images": {}, "success": true}