{"id": 1228, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074638.html", "title": "Chapter 4231 - Chapter 4231: 4230 Dragon God Was Behind Him", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4231 - Chapter 4231: 4230 Dragon God Was Behind Him</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4231: 4230 Dragon God was behind him<br/><br/>Translator: 549690339<br/><br/>Nine Corpse Beast Emperor’s roar continued from the front.<br/><br/>From the beginning when one of his arms was suppressed, six of his arms had been completely suppressed!<br/><br/>Among them, there was one of his teeth.<br/><br/>It was a tooth that was emitting a terrifying aura.<br/><br/>The tooth wanted to break through the defense of the universe god King, but it was still blocked.<br/><br/>The Nine Corpse Beast Emperor didn’t have the ability to resist at all.<br/><br/>What awaited him was death!<br/><br/>His life force was also dissipating bit by bit.<br/><br/>Buzz<br/><br/>Not long after, Tian Ci and an lie appeared beside Wang Xian.<br/><br/>“Foster Father! ”<br/><br/>Tian Ci saw Wang Xian and shouted immediately!<br/><br/>Wang Xian nodded and gestured at him!<br/><br/>Tian Ci looked over.<br/><br/>“Foster father, what kind of existence is this? It’s so huge and terrifying!”<br/><br/>When Tianci saw the nine-corpse beast emperor, his face was filled with shock.<br/><br/>“It’s a space beast from the starry universe. It’s an existence at the destiny level of the heaven origin. It doesn’t have intelligence, but its vitality and special abilities are very powerful. ”<br/><br/>Wang Xian spoke.<br/><br/>When the kings of the gods from the belief universe were attacking the nine-corpse beast emperor, Wang Xian saw that the Beast Emperor had displayed several powerful talents.<br/><br/>However, they were all blocked by the kings of the gods in the belief universe with special treasures and abilities. The gap between them was still too big!<br/><br/>“What a terrifying existence! ”<br/><br/>Tianci’s eyes sparkled as he looked at the Beast Emperor. His expression was filled with astonishment. Following that, he exclaimed, “Foster father, weren’t we the ones who killed the middle-aged man and the old man last time?”<br/><br/>“Yes, we coincidentally met them this time. When the Nine Corpse Beast Emperor was about to be killed, we will immediately take action and snatch the corpse of the Nine Corpse Beast Emperor away. Also, Tianci, kill the four space beasts beside you! ”<br/><br/>“If there’s a chance, kill those gods who believe in the universe and disturb them. ”<br/><br/>Wang Xian instructed tianci.<br/><br/>“Yes, Foster Father! ”<br/><br/>TIANCI nodded and stood beside Wang Xian, watching quietly.<br/><br/>Wang Xian also stared ahead coldly as he watched them besiege the Nine Corpse Beast Emperor.<br/><br/>Time passed by minute by minute.<br/><br/>The Nine Corpse Beast Emperor would occasionally unleash its powerful talents. It wanted to fight back and escape.<br/><br/>However, it was blocked by the king of the gods who believed in the universe.<br/><br/>This time, in order to completely destroy this nine corpse beast emperor, they had also paid quite a bit of resources!<br/><br/>“This nine corpse beast emperor is about to die. Make preparations to prevent him from making a final counterattack! ”<br/><br/>“At the last moment, we can’t let him escape. In addition, leave a trace of his life force behind. ”<br/><br/>Another few days passed, and a king of the gods shouted loudly.<br/><br/>His face was filled with excitement.<br/><br/>At this moment, the power of the Nine Corpse Beast Emperor was very, very weak!<br/><br/>It was about to be completely destroyed by them.<br/><br/>However, they didn’t intend to directly kill it.<br/><br/>They wanted to preserve a trace of its life force.<br/><br/>This was to prepare for the next action.<br/><br/>Next, they wanted to evolve. Should they make a believer of the space behemoth break through!<br/><br/>How to completely control it after a breakthrough.<br/><br/>This was a very important matter.<br/><br/>Leaving a trace of life was also to prevent the other space beasts in the universe from finding an extra spot and directly making a breakthrough!<br/><br/>The four space beasts, Fei Lian, Gong Ya, Yu Yu, and Xu Hao, in the surrounding area, let out low roars.<br/><br/>Their eyes were burning as they stared at the Nine Corpse Beast Emperor that was about to be suppressed.<br/><br/>Even though they had become believers of the universe.<br/><br/>But in their hearts, they still yearned to become heaven origin creation level existences.<br/><br/>“Prepare to completely suppress it. After suppressing it, we can obtain huge benefits, hahaha! ”<br/><br/>The vitality of the nine corpse beast emperor was getting weaker and weaker. The strength of its resistance was also getting weaker and weaker.<br/><br/>It was almost on the verge of death! A king of the gods shouted excitedly!<br/><br/>“Get Ready! ”<br/><br/>At the front, Wang Xian saw this scene. His eyes were sparkling.<br/><br/>The Nine Corpse Beast Emperor was already very weak.<br/><br/>It was so weak that it didn’t even have the combat strength of a peak-level universe overlord!<br/><br/>Now, it was almost time to make a move.<br/><br/>Tianci nodded, and the Phantom of the Tree of God slowly appeared behind him!<br/><br/>“Prepare to suppress!”<br/><br/>Another king of gods shouted from the front!<br/><br/>They were prepared to completely suppress the Nine Corpse Beast Emperor, leaving only a trace of life!<br/><br/>They wanted to split the corpse of the Nine Corpse Beast Emperor!<br/><br/>These corpses were priceless!<br/><br/>It was enough for them to nurture more than a dozen followers of the space beasts who were at the peak of the Universe Overlord Realm! At that time, their power of faith would be greatly enhanced!<br/><br/>At the moment when they were about to suppress it.<br/><br/>Wang Xian shouted softly and was ready to take action immediately!<br/><br/>His figure immediately disappeared from the spot!<br/><br/>The power of space!<br/><br/>Teleportation! Buzz Buzz<br/><br/>Buzz Buzz<br/><br/>Teleportation was a very powerful travel skill.<br/><br/>The reason why the Void universe was so powerful was that they could escape easily if they could not defeat them.<br/><br/>They could carry out instant assassinations!<br/><br/>The speed of their teleportation was much faster than those of the same level!<br/><br/>Wang Xian completed a teleportation instantly.<br/><br/>This allowed Wang Xian to be very close to them!<br/><br/>In the next instant, he didn’t hesitate at all.<br/><br/>He instantly transformed into the body of the Divine Dragon!<br/><br/>Following that, he teleported again!<br/><br/>This time, he arrived directly in front of the Nine Corpse Beast Emperor.<br/><br/>The Tai Chi Dragon Plate, the five elements grinding, the body of the Divine Dragon in the void, and his own strength were all activated. He attacked the Nine Corpse Beast Emperor directly!<br/><br/>“Not good, there’s a strong enemy! ”<br/><br/>However, when Wang Xian teleported for the second time, the three kings of Pantheon who were at the control level had already sensed Wang Xian’s terrifying aura.<br/><br/>An expert who was hiding in the dark actually wanted to hunt the cicada.<br/><br/>This made their faces filled with shock and anger!<br/><br/>They did not hesitate at all and attacked Wang Xian directly!<br/><br/>Wang Xian let out a low roar as the energy in his entire body boiled.<br/><br/>Nine attributes!<br/><br/>No, including the power of space, the energy of ten attributes wrapped around his body.<br/><br/>Streams of energy shot out in all directions!<br/><br/>“Boom! Boom! Boom! Boom!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>The attacks of the three god-level believers landed on Wang Xian’s body!<br/><br/>However, when their attacks landed on Wang Xian, his body trembled.<br/><br/>Cracks appeared on some of the dragon scales.<br/><br/>The combined strength of these three kings of the gods was slightly stronger than Wang Xian!<br/><br/>However, their attacks were a little scattered and was blocked by Wang Xian!<br/><br/>“Hit the God!”<br/><br/>At this moment, tianci, who was at the back, also started to move.<br/><br/>He immediately used the strongest branch of the ultimate treasure of Tianyuan in his body, the hit the God branch.<br/><br/>The god-striking branch attacked toward a control-level king of gods!\t\t\t\t\t\t</div>", "images": {}, "success": true}