{"id": 1233, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074658.html", "title": "Chapter 4236 - Chapter 4236: 4235 Battle Against The King Of All Gods In The Belief Universe!", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4236 - Chapter 4236: 4235 Battle Against The King Of All Gods In The Belief Universe!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4236: 4235 battle against the King of all gods in the belief universe!<br/><br/>Translator: 549690339<br/><br/>“Make your move. Even if we can’t get it, the Dragon King can forget about getting it. ”<br/><br/>The four kings of all gods in the belief universe said with killing intent on their faces.<br/><br/>The last time, the Dragon King had ruined their plans that had lasted for more than a billion years.<br/><br/>This time, they would definitely not let the Dragon King succeed.<br/><br/>The four of them followed the direction of the strong energy fluctuation and flew away quickly.<br/><br/>At the location of the battlefield, Wang Xian was completely suppressing the<br/><br/>Beast Emperor Qian Jiang.<br/><br/>Tianci had just arrived and was about to make his move. However, Wang Xian sensed something and frowned slightly.<br/><br/>“As expected, he’s still here! ”<br/><br/>He thought to himself and immediately sent a voice transmission to tianci!<br/><br/>“Huala! ”<br/><br/>At the same time, Wang Xian’s body shook and the incipient Saint Wings appeared on his body.<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>Waves of powerful wind and thunder energy attacked the Beast Emperor.<br/><br/>The power of the wind and thunder locked onto the enemy surged into the body of the Beast Emperor. “Roar! Roar! Roar!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>Miserable screams kept coming from the Beast Emperor.<br/><br/>Faced with the attacks of Wang Xian and the rest, the Beast Emperor had no room to resist.<br/><br/>He could only use his innate ability to dodge.<br/><br/>He relied on his strong vitality to support himself.<br/><br/>Whoosh<br/><br/>The incorporeal holy wings turned into a shadow, and the power of wind and thunder filled Beast Emperor Qian Jiang’s body.<br/><br/>“Dragon King of the Dragon Palace. ”<br/><br/>Just as Wang Xian was about to attack, an angry roar was heard.<br/><br/>Accompanied by a terrifying holy sword light, it slashed directly at Wang Xian’s enormous body.<br/><br/>“HMPH!”<br/><br/>“You guys who believe in the universe, you guys have hidden yourselves quite well !<br/><br/>Wang Xian saw the holy sword that was attacking him. He waved his arm and the Tai Chi Dragon coiled in the void and turned into a tai chi pattern to block it directly!<br/><br/>“Last time, you ruined our plan. This time, you want to hunt down the space behemoth? Wishful Thinking! ”<br/><br/>A king of Pantheon who was at the control level spoke with a face full of killing intent!<br/><br/>“Chant, convert! ”<br/><br/>As the King of Pantheon spoke, Holy Words came out from his mouth. Chanting and rumbling sounds could be heard from the surroundings.<br/><br/>This was a special type of energy.<br/><br/>The power of faith condensed into symbols and attacked Wang Xian!<br/><br/>The symbols were densely packed and filled with strange energy!<br/><br/>Once the symbols of faith entered one’s body, one’s mind would be attacked.<br/><br/>“Great dharma celestial phenomenon, belief in the body of the gods, exorcism! ”<br/><br/>The other three kings of the gods immediately displayed a series of powerful attacks.<br/><br/>There were strange symbols of faith.<br/><br/>There was a huge and majestic body condensed from the power of faith.<br/><br/>There was a holy temple suspended high in the sky.<br/><br/>There were also many bald and naked saints.<br/><br/>This time, the four kings of the gods had clearly used all of their strength.<br/><br/>They wanted to challenge Wang Xian.<br/><br/>They wanted to teach Wang Xian a good lesson.<br/><br/>Even if they couldn’t kill him, they had to make him pay the price!<br/><br/>“Tianci, let’s play with them! ”<br/><br/>When Wang Xian saw this scene, his eyes focused as he shouted with a cold expression!<br/><br/>“Mighty Heavenly Dragon! ”<br/><br/>Wang Xian growled and a gigantic dragon head appeared in the sky above him.<br/><br/>The dragon head spat out nine-colored rays of light and attacked them directly!<br/><br/>Good!<br/><br/>Tianci’s eyes were filled with fighting spirit.<br/><br/>He waved his arm and a branch appeared in his hand!<br/><br/>The Phantom of the divine tree appeared behind him.<br/><br/>He held the branch in his hand and waved it forward.<br/><br/>In the void, countless vines appeared. They pierced through the void and attacked a king of Pantheon who was at the control level!<br/><br/>“Roar! Roar! Roar!”<br/><br/>Qian Jiang Beast Emperor saw waves of terrifying energy from the side.<br/><br/>When he saw that Wang Xian didn’t care about him, he let out a low roar in fear.<br/><br/>He didn’t hesitate at all and instantly used his powerful innate skill!<br/><br/>Splash<br/><br/>His gigantic body carried a terrifying and endless river as he disappeared into the void.<br/><br/>It was as if his body had disappeared into the sea and disappeared in an instant!<br/><br/>Wang Xian sensed that the beast emperor Qian Jiang had escaped and didn ‘t pay it any attention.<br/><br/>He swayed his humongous body and the five elements millstone floated above his dragon head.<br/><br/>He was wearing the tai chi dragon disc and was facing the two kings of pantheon.<br/><br/>Two of them were at the mastery level.<br/><br/>The last one who had just entered the mastery level, Hun Dun, who was at the side, rushed forward.<br/><br/>The battle erupted in an instant!<br/><br/>“Daluo Heavenly Seal! ”<br/><br/>The two kings of Pantheon, who were at the mastery level, saw Wang Xian charging toward them.<br/><br/>When they saw that their other two companions were blocked, their expressions changed slightly.<br/><br/>The two of them immediately unleashed numerous gigantic hand seals to meet the gigantic dragon head phantom in front of Wang Xian!<br/><br/>“Boom! Boom! Boom!” “Boom! Boom!”<br/><br/>The sound of the collision rang out.<br/><br/>“These two people are not as strong as me when they join forces! ”<br/><br/>Wang Xian’s gaze froze when he saw the collision.<br/><br/>There were also differences in the strength of the Heaven’s origin creation at the mastery level.<br/><br/>Some at the mastery level could fight against the weakest mastery level as well as the weakest beginner level.<br/><br/>Some at the mastery level could even fight against two at the mastery level.<br/><br/>Under normal circumstances, there were experts who divided the four levels of beginner control into four levels.<br/><br/>Beginner levels were divided into two levels.<br/><br/>Beginner Level One was the weakest, beginner level two could fight against two beginner level one.<br/><br/>Then there was control level one, control level one was the weakest, control level eight was the highest.<br/><br/>After control level eight was the Great Dao level.<br/><br/>Great Dao from level one to level twenty-six.<br/><br/>As for those above level twenty-six, they would be at the level of Chaos!<br/><br/>The specific classification was based on those who had just stepped into the Heaven’s origin realm.<br/><br/>Wang Xian had reached the level of Great Dao. It could be said that he was equivalent to a level nine powerhouse.<br/><br/>In other words, he could fight against nine existences who had just stepped into the Heaven’s origin realm.<br/><br/>The two king of Pantheon who believed in the universe were not the weakest masters at the level of mastery.<br/><br/>The combined strength of the two of them was about level seven or eight.<br/><br/>There was still a gap between their strength and Wang Xian’s.<br/><br/>Buzz<br/><br/>Wang Xian’s body trembled. The Void Dragon body in his body led his body to teleport!<br/><br/>In the next moment, Wang Xian’s figure appeared in the test of a king of the gods who believed in the universe!<br/><br/>He waved his dragon claw instantly.<br/><br/>A burst of energy attacked him.<br/><br/>The Dragon Claw contained nine types of energy. The collision of the nine types of energy was extremely chaotic!<br/><br/>“The path of belief! ”<br/><br/>The expression of the king of all gods who was attacked changed drastically. He waved his arm and an infinitely long path appeared in front of him.<br/><br/>His body arrived at the end of the path at a strange speed.<br/><br/>In front of him, his body had also dodged to an extremely far position.<br/><br/>“Be careful, he has the power of space.”<br/><br/>The king of all gods shouted loudly with a solemn face!<br/><br/>“If you don’t believe in the gods, don’t enter the cycle of reincarnation and die!<br/><br/>The other king of all gods had an unsightly expression. He raised the staff in his hand and a huge white circle appeared.<br/><br/>This white circle seemed to be a terrifying existence that could devour living beings. It directly covered Wang Xian!<br/><br/>“Explode! ”<br/><br/>Wang Xian’s dragon tail swept out and the huge white circle exploded!\t\t\t\t\t\t</div>", "images": {}, "success": true}