{"id": 1234, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074662.html", "title": "Chapter 4237 - Chapter 4237: 4236 Pursued And Fought", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4237 - Chapter 4237: 4236 Pursued And Fought</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4237: 4236 pursued and fought<br/><br/>Translator: 549690339<br/><br/>“Roar! Roar! ”<br/><br/>Wang Xian let out a furious roar. His gigantic body of the divine dragon was exuding a terrifying aura.<br/><br/>Dragon claws and tail attacked the bodies of the two kings of Pantheon one after another!<br/><br/>“We have to join hands. Otherwise, we won’t be able to fight against them! ” The attacks of the two kings of Pantheon were easily destroyed by Wang Xian.<br/><br/>This caused their expressions to change drastically.<br/><br/>The short exchange of blows made them understand that they had to coordinate perfectly.<br/><br/>Otherwise, once their powers were dispersed.<br/><br/>Once their attacks were dispersed, they were no match for the Dragon King of the Dragon Palace.<br/><br/>After all, Wang Xian was a single entity. All of his powers could be mobilized at will.<br/><br/>The two kings of pantheon were weaker than him. If they didn’t join forces completely, they were no match for Wang Xian.<br/><br/>(‘D * mn it. The Dragon King of the Dragon Palace’s strength is already comparable to the Great Dao realm. Even if we join forces, we would not be a match for him. ”<br/><br/>One of the kings of the gods felt Wang Xian’s attack and spoke with an embarrassed expression!<br/><br/>They could only fight against Wang Xian if they joined forces perfectly.<br/><br/>Otherwise, they would be suppressed miserably.<br/><br/>They would even have to pay a price.<br/><br/>After all, the Dragon King was much stronger than them alone!<br/><br/>“We are working together after all! ”<br/><br/>Wang Xian stared at the two kings of pantheon. His gaze focused as the yin-yang Taiji power revolved around his body and locked onto one of the kings of Pantheon!<br/><br/>Buzz<br/><br/>Using the power of space teleportation, Wang Xian arrived in front of him in an instant and attacked with all his might!<br/><br/>“Life Dragon Breath! ” Soaring Dragon Horn! ”<br/><br/>“Water Forbidden Spell! ”<br/><br/>One violent attack after another attacked him directly!<br/><br/>“Damn it, support me! ”<br/><br/>The king of Pantheon who had suffered from Wang Xian’s violent attacks had a drastic change in expression. He immediately roared loudly.<br/><br/>He picked up a small figure condensed from the power of faith and placed it on his chest.<br/><br/>The small figure emitted a radiance that enveloped his body.<br/><br/>He focused his attention and the majestic power of faith surged into the small figure.<br/><br/>However, Wang Xian’s attacks continued to land on his body. The radiance emitted by the small figure became dimmer and dimmer.<br/><br/>Cracks started to appear slowly!<br/><br/>stop!<br/><br/>When the other king of Pantheon saw this, his expression was extremely cold.<br/><br/>He moved his palm and a beating heart of faith appeared in his palm. He threw it directly at Wang Xian.<br/><br/>Boom! Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>The heart of faith exploded immediately after it touched Wang Xian’s outer defense.<br/><br/>The explosion contained special symbols of faith.<br/><br/>It contained broken arms and heads.<br/><br/>These severed limbs and heads of the symbols tore at Wang Xian’s body!<br/><br/>Wang Xian did not dodge the powerful attack at all.<br/><br/>The Dragon Claws continued to attack the other king of Pantheon!<br/><br/>The Violent Dragon Claws reached out and directly wrapped around the king of Pantheon!<br/><br/>“Oh no, this guy wants to kill me even if he is injured.”<br/><br/>When the king of Pantheon saw this scene, his expression changed drastically. Without any hesitation, he took out a treasure that looked like a pupil.<br/><br/>The pupil emitted a radiance that reflected a path.<br/><br/>The king of Pantheon felt a little heartache as he stepped onto that path!<br/><br/>This was a powerful escape treasure.<br/><br/>It was about to be used up!<br/><br/>“Retreat, retreat, we are not the Dragon King’s match! ”<br/><br/>The king of Pantheon, who was attacking Wang Xian, saw his comrade using his treasure to dodge. His expression changed slightly and he immediately shouted loudly!<br/><br/>At the side.<br/><br/>Tianci was fighting against a king of Pantheon who was at the control level in the belief universe!<br/><br/>Tianci had the divine tree of Heaven’s origin creation. His current strength was equivalent to the control level one, which was equivalent to four existences who had just stepped into the Heaven’s origin creation level. His opponent was equivalent to the control level two.<br/><br/>He was slightly stronger than Tianci.<br/><br/>In addition, his powerful battle experience was not something Tianci could compare to.<br/><br/>Tianci had always been suppressed.<br/><br/>However, although tianci had always been suppressed, it was not a one-sided battle.<br/><br/>He could also put up a tenacious resistance.<br/><br/>In another position, chaos was fighting with a king of the gods who had just entered the level.<br/><br/>Their strength was equal and neither of them had the upper hand.<br/><br/>Now, hearing the king of the gods’words, the two kings of the gods ‘expressions changed slightly.<br/><br/>“Retreat!”<br/><br/>They did not hesitate at all.<br/><br/>They knew that the other two king of Pantheon were no match for the Dragon King, and they were completely suppressed.<br/><br/>At this time, they had to retreat as soon as possible.<br/><br/>Otherwise, they would have to pay a price!<br/><br/>The price of fleeing and the treasures of fleeing were very precious.<br/><br/>With one, there would be one less.<br/><br/>The two kings of the gods immediately broke away from Tianci and Hun Dun and fled in one direction!<br/><br/>“Chase after them! ”<br/><br/>Wang Xian did not stop immediately when he saw this scene. He focused his gaze and shouted loudly. Immediately, he chased after them!<br/><br/>He had his own plan.<br/><br/>However, for this plan, he had to chase away the gods who believed in the universe first!<br/><br/>Wang Xian swayed his huge body and charged forward.<br/><br/>The injuries on his body that were left behind by the king of gods’ attack were recovering at a terrifying speed.<br/><br/>The mature ancestral tree had allowed Wang Xian’s recovery ability to reach a terrifying level!<br/><br/>“Roar Roar Roar! ”<br/><br/>“Eight Dragon Pillars!”<br/><br/>Wang Xian let out a low roar. Dragon pillars descended from the sky one after another and attacked the four kings of the belief universe!<br/><br/>“This D * MN Guy, he still wants to chase after us.”<br/><br/>When the four king of Pantheon saw that Wang Xian did not give up, their faces darkened.<br/><br/>They immediately counterattacked and attacked the dragon pillars in all directions.<br/><br/>After that, they saw Tianci and Hun Dun attacking and continued to flee into the distance.<br/><br/>They knew that the four of them were weaker than the Dragon King.<br/><br/>If they continued to fight, they would not be able to gain any advantage.<br/><br/>Following closely, the four kings of Pantheon were in pursuit.<br/><br/>Wang Xian and the rest were in pursuit.<br/><br/>The terrifying power surged in the chaotic space.<br/><br/>The unparalleled power caused the chaotic space to tremble! The four of them fled while Wang Xian and the rest pursued.<br/><br/>Soon, the day of pursuit passed!<br/><br/>The four kings of the gods looked gloomy. However, a day’s worth of fighting was nothing to them.<br/><br/>They continued to flee.<br/><br/>They fought as they fled.<br/><br/>Although Wang Xian was above them, when the four kings of the gods were together, they would not be seriously injured when faced with the attacks of Wang Xian and the rest.<br/><br/>After chasing for three days, Wang Xian’s eyes flickered!<br/><br/>“Heaven-bestowed chaos, get ready to leave. I’ll go hunt down the river-migrating Beast Emperor! ”<br/><br/>On the third day, Wang Xian spoke to heaven-bestowed chaos and the rest directly!<br/><br/>The river-migrating Beast Emperor was severely injured by Wang Xian’s powerful attack.<br/><br/>His body was still filled with the power of wind and thunder.<br/><br/>Through the power of wind and thunder to lock down the enemy, Wang Xian could sense the location of the river-migrating Beast Emperor.<br/><br/>He could even use the Netherworld Dragon to chase after the Beast Emperor and arrive at his side in an instant.<br/><br/>He had been fighting with the king of all gods who believed in the universe for three days in order to drive them to a faraway place.<br/><br/>By the time they reacted, his plan had already been completed!\t\t\t\t\t\t</div>", "images": {}, "success": true}