{"id": 1230, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074646.html", "title": "Chapter 4233 - Chapter 4233: 4232 Had One More Subordinate", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4233 - Chapter 4233: 4232 Had One More Subordinate</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4233: 4232 had one more subordinate<br/><br/>Translator: 549690339<br/><br/>They were a little unwilling.<br/><br/>Such a long plan was about to succeed.<br/><br/>They would be able to reap a huge harvest.<br/><br/>Now, everything had failed.<br/><br/>However, they were very helpless.<br/><br/>Just now, the strength that the other party had displayed was not weaker than theirs.<br/><br/>In fact, if they did not join hands, they would not be the opponent at all.<br/><br/>The Dragon King of the Dragon Palace displayed the might of a Great Dao.<br/><br/>Revenge?<br/><br/>Revenge was a must. This grudge had already been formed.<br/><br/>But it would be difficult to take revenge now.<br/><br/>The Dragon King was so strong.<br/><br/>Although they weren’t weak themselves, they had to fight him head-on?<br/><br/>This would disrupt many of their plans.<br/><br/>The strength of the nine-origin universe and the Dragon King of the Dragon Palace weren’t easy to deal with.<br/><br/>In fact, it would take them billions of years to deal with the Dragon King of the Dragon Palace.<br/><br/>With these billions of years, they could obtain more things.<br/><br/>If they continued to fight with the Dragon King of the Dragon Palace, they would be injured instead.<br/><br/>This made them shake their heads helplessly.<br/><br/>“Father, the Dragon King of the Dragon Palace has sabotaged our plan twice.<br/><br/>Are We just going to let it go?”<br/><br/>The middle-aged man who had just entered the Heavenly Yuan creation realm said angrily.<br/><br/>“For now. If there’s a chance, we’ll make him pay ten times the price! ”<br/><br/>The old man said with an uncertain expression.<br/><br/>“This…<br/><br/>The middle-aged man was still unwilling, but he didn’t say anything when he saw his father’s cold aura.<br/><br/>His father was more thoughtful than he was. “What about the starry universe? Should we continue?”<br/><br/>A king of gods frowned and looked at the others.<br/><br/>Since the Dragon King of the Dragon Palace was able to ambush us, they must have set something up in the starry universe. They killed the Nine Corpse Beast Emperor directly, and it’s possible that they’ve also subdued the space beasts that can break through. ”<br/><br/>“Our strength is not weaker than theirs. Send someone to keep an eye on them. If any space beasts at the beginner level come out of the starry universe, continue to inform us.”<br/><br/>“That Dragon King has obtained a Space Beast’s corpse this time. He must want a second one as well.”<br/><br/>“If he wants to continue hunting, then we will also attack in secret. Even if we can’t kill them, we have to ruin their plan.” A control-level king of Pantheon said.<br/><br/>The other two nodded slightly.<br/><br/>They couldn’t take revenge immediately, but they could wait for an opportunity!<br/><br/>They had arranged many followers in the starry universe.<br/><br/>As long as there was a slight movement, they would know.<br/><br/>If the Dragon Palace Dragon King continued hunting the starry behemoths, then they would change their roles and ruin the Dragon King’s plans.<br/><br/>Of course, they would not continue to waste time with the Dragon King of the Dragon Palace.<br/><br/>At the same time, in the starry universe.<br/><br/>Under the lead of an lie, Wang Xian and the rest arrived in the starry universe in an instant.<br/><br/>When he was about to kill the Nine Corpse Beast Emperor and destroy its last bit of life force, Wang Xian had already passed the news to Hun Dun.<br/><br/>Without needing Wang Xian to say anything, Hun Dun had been sensing the space beasts ever since he arrived in the starry universe.<br/><br/>He was sensing the quota in the starry universe.<br/><br/>The moment the quota appeared, he did not hesitate and immediately proceeded to make a breakthrough!<br/><br/>Buzz Buzz Buzz<br/><br/>Buzz Buzz Buzz<br/><br/>Wang Xian came to the starry universe and sensed waves of powerful energy fluctuations.<br/><br/>He sensed this majestic power and smiled.<br/><br/>This was the aura of Hun Dun.<br/><br/>He had a breakthrough!<br/><br/>Wang Xian’s body moved and flew rapidly towards the direction of Chaos’s breakthrough!<br/><br/>When they arrived, chaos was floating in the starry sky, absorbing the energy between heaven and earth. It was undergoing a transformation.<br/><br/>This process of transformation would last for a period of time!<br/><br/>“Foster Father, this space beast is about to have a breakthrough. His body is huge too. Who Is He?”<br/><br/>Tianci looked at the chaos and sized it up curiously.<br/><br/>“I knew a space beast in the past. It was born with intelligence. I will help him improve this time. In the future, he will listen to my orders! ”<br/><br/>Wang Xian said.<br/><br/>“Foster father, you are the best. It has only been a short while and you have managed to subdue another powerful subordinate!”<br/><br/>Tianci flattered him.<br/><br/>Wang Xian smiled. With a wave of his arm, he passed one-fifth of the Nine Corpse Beast Emperor’s body to Tianci.<br/><br/>Wang Xian said to tianci.<br/><br/>Tianci took the interspatial ring. When he saw the huge amount of flesh and blood inside, his eyes widened. “Foster father, this?”<br/><br/>“The value of this flesh and blood is extremely high. I brought you here to help me. I Can’t let you run away for nothing! ”<br/><br/>Wang Xian smiled at him and said, “Take it. You can use this flesh and blood to nurture your tribesmen and increase their strength. It should be enough to increase your mu Li tribe by five to six masters at the peak of the Universe<br/><br/>Overlord Realm. ”<br/><br/>“This foster father, I didn’t do anything. ”<br/><br/>Tianci opened his mouth. The value of this flesh and blood was extremely terrifying.<br/><br/>(‘I have more in my hands. Furthermore, your Mu Li tribe cultivates in the water element. There are slots for the water element in the six paths universe and the water element in the Heaven’s origin creation. See if you can nurture a water element in the Heaven’s origin creation realm!”<br/><br/>“If you have the potential, bring him over. I will ask your floating queen of the nine origin universe to teach him! ”<br/><br/>Wang Xian continued to speak to Tianci.<br/><br/>Based on his relationship with Tianci, if the Mu Li tribe could increase the number of heaven origin creation stage powerhouses, it would be equivalent to the number of people on his side.<br/><br/>There was no doubt about that.<br/><br/>Most importantly, there was a quota for water element heaven origin creation stage powerhouses in the six paths universe.<br/><br/>“Yes, foster father.”<br/><br/>Tianci had an excited expression on his face as he nodded his head heavily.<br/><br/>Wang Xian smiled and looked at Hun Dun.<br/><br/>After Hun Dun’s breakthrough, the Dragon Palace had another heaven origin creator.<br/><br/>Other than that, the resources of the Nine Corpse Beast Emperor could allow the Dragon Palace to add more than ten existences at the peak of the Universe<br/><br/>Overlord realm.<br/><br/>There was also the most important point.<br/><br/>After Hun Dun’s breakthrough, he had a powerful subordinate in the starry universe.<br/><br/>Hun Dun could pay close attention to the other starry universes in the starry universe. This way, he could find an opportunity to hunt them down.<br/><br/>Whether Xiao Lan’s little house and Xiao Bai could make a breakthrough depended entirely on Hun Dun.<br/><br/>Moreover, regardless of which breakthrough Xiao Lan’s little house and Xiao Bai made, Qing Yue would make a breakthrough!<br/><br/>Wang Xian had an idea. He wanted Qing Yue, Shu Qing, and the other girls to complete the breakthrough!<br/><br/>It would be best if he could do it in these five billion years.<br/><br/>Of course, if he wanted to increase the number of Heaven’s origin powerhouses in the Dragon Palace, he would need to reach the chaos level.<br/><br/>In other words, he would need to level up two levels consecutively.<br/><br/>In addition, he would need to obtain unimaginable resources.<br/><br/>Wang Xian did not have the confidence to do so in these five billion years!<br/><br/>“I will start helping them bit by bit. The duration of the calamity is around five to eight billion years. It has only just begun. ” Wang Xian mumbled..\t\t\t\t\t\t</div>", "images": {}, "success": true}