{"id": 1232, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074654.html", "title": "Chapter 4235 - Chapter 4235: 4234 Made His Move", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4235 - Chapter 4235: 4234 Made His Move</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4235: 4234 made his move<br/><br/>Translator: 549690339<br/><br/>“A beast emperor who has been detected in the starry universe has left the starry universe. ”<br/><br/>Similarly, we have also detected the Dragon King of the Dragon Palace and the space behemoth who had just broken through. ”<br/><br/>Just as Wang Xian followed the Beast Emperor Qian Jiang into the chaos. The kings of the gods who had learned their lesson the last time rushed over as soon as they received the news.<br/><br/>They also made many arrangements.<br/><br/>Information was quickly transmitted to them.<br/><br/>“This time, even if we don’t gain anything, we can ‘t let that Dragon King succeed! ”<br/><br/>One of the kings of the belief universe said with a cold expression!<br/><br/>The other two kings of the belief universe also nodded heavily.<br/><br/>“Keep a close watch. That Dragon Palace Dragon King won’t make a move at the edge. At least after flying for a few days, we’ll make our move. We’ll do our detection methods along the way. Don’t be discovered! ”<br/><br/>One of the kings of the gods gave another order and flew off in a certain direction.<br/><br/>The other three followed closely behind. With the powerful means of their belief in the universe, it would be difficult for the powerhouses from other universes to discover their detection methods.<br/><br/>The belief power of the belief in the universe was a very special kind of energy.<br/><br/>Wang Xian followed closely behind the Qianjiang Beast Emperor. He was also very vigilant as he scanned his surroundings.<br/><br/>However, he did not find any clues!<br/><br/>He did not find any traces of the king of the gods who worshipped the universe.<br/><br/>“Is he not here or is he hiding around?”<br/><br/>Wang Xian pondered in his heart. He was more inclined towards the latter.<br/><br/>An existence that could occupy a universe, with the ability and background to hide around him without being discovered!<br/><br/>“Tianci, follow the king of Qianjiang Beast Emperor. If you encounter any danger, leave immediately. I will go and investigate the surroundings! ” Wang Xian instructed tianci and flew to the surroundings.<br/><br/>He wanted to look for the king of the gods who believed in the universe.<br/><br/>Although he was very strong and had tianci with him, he still had to be wary.<br/><br/>However, he still had to be wary of whether the king of the gods who believed in the universe had set up some powerful altars to target them.<br/><br/>After all, according to his understanding, there were powerhouses in the universe of belief who were at the Great Dao level.<br/><br/>If they were to join forces, Wang Xian would also die here.<br/><br/>Wang Xian checked his surroundings carefully, but he didn’t find any fluctuations of the power of belief.<br/><br/>“No matter what, we’ll take action in two days! ”<br/><br/>Since he couldn’t find it, Wang Xian gave up immediately.<br/><br/>He returned to Tianci and continued to follow behind the Qianjiang Beast Emperor.<br/><br/>“Let’s take action here! ”<br/><br/>It had been five days since they left the galaxy. Wang Xian said to tianci.<br/><br/>Tianci nodded his head.<br/><br/>Swoosh<br/><br/>In the next moment, Wang Xian transformed into his divine dragon form and flew straight ahead.<br/><br/>Wang Xian’s speed was very fast. It was far from what the Qianjiang Beast Emperor could compare to!<br/><br/>Roar<br/><br/>However, when the Qianjiang Beast Emperor sensed Wang Xian’s aura, he suddenly let out a low roar!<br/><br/>Splash<br/><br/>All of a sudden, the water flow around his body transformed into a water sword. With a speed that was two times faster than before, he fled to the left.<br/><br/>Seeking good fortune and avoiding bad luck?”<br/><br/>When Wang Xian saw this scene, his eyes narrowed slightly. He immediately reduced his speed.<br/><br/>The body of the Void Divine Dragon flew out from his body. Bringing along the five elements Millstone and the Tai Chi Dragon Disk, he teleported away instantly and chased after him from the side!<br/><br/>When Beast Emperor Qian Jiang sensed that Wang Xian was not chasing after him, he also slowed down slowly!<br/><br/>However, after flying for an hour, the body of the Void Divine Dragon appeared.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The body of the Void Divine Dragon teleported and arrived directly in front of Beast Emperor Qian Jiang.<br/><br/>He waved his dragon claws at him.<br/><br/>Even though he was far away, he instantly appeared in front of Beast Emperor Qian Jiang when he arrived at the spatial rift.<br/><br/>“Roar Roar! ”<br/><br/>When Qian Jiang Beast Emperor saw the Void Dragon body that suddenly appeared, he did not immediately run away.<br/><br/>Instead, his body moved and he charged forward violently, not afraid at all!<br/><br/>“Roar Roar! ”<br/><br/>The Void Dragon body let out a low roar and teleported to the right side of Qian Jiang Beast Emperor.<br/><br/>The Dragon Claw that contained the power of space tearing clawed at his body!<br/><br/>When the Dragon Claw that was filled with the power of space tearing landed on the side of the Qianjiang Beast Emperor.<br/><br/>The river water around him condensed into a huge shield!<br/><br/>“Bang Bang! ”<br/><br/>The shield blocked the attack of the Void Dragon Body!<br/><br/>“Roar Roar Roar! ”<br/><br/>The Void Dragon body let out a low growl and waved its dragon claw. The Five Elements Millstone and the Tai Chi Dragon Disc flew out.<br/><br/>The Tai Chi Dragon Disc’s five elements millstone turned into yin-yang and five elements divine dragons.<br/><br/>They swayed their huge bodies and attacked Beast Emperor Qian Jiang directly!<br/><br/>At the back, when Wang Xian saw that the body of the Void Dragon was trembling together with Beast Emperor Qian Jiang.<br/><br/>His body trembled.<br/><br/>The transformation of the Netherworld Dragon!<br/><br/>His figure appeared directly beside the body of the Void Dragon!<br/><br/>The moment Wang Xian arrived here, his dragon horn emitted a nine-colored glow. A beam of light shot straight towards the Qianjiang Beast Emperor!<br/><br/>“Boom! Boom!”<br/><br/>The nine-colored glow penetrated the flow of water around the Qianjiang<br/><br/>Beast Emperor and entered his body!<br/><br/>“Roar! Roar! ”<br/><br/>A blood-curdling scream was heard instantly.<br/><br/>The Qianjiang Beast Emperor sensed Wang Xian’s powerful strength and wanted to escape in a hurry!<br/><br/>He knew that he was no match for Wang Xian.<br/><br/>Starfield Spatial Lock! ”<br/><br/>Wang Xian took out the starfield fragment without any hesitation!<br/><br/>The chaotic space around him immediately underwent a huge change.<br/><br/>Numerous gigantic planet meteorites appeared around the entire Starfield!<br/><br/>It was as if they had entered another universe in an instant!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Wang Xian waved his arm and planets and meteorites that contained various types of energy charged towards Beast Emperor Qian Jiang!<br/><br/>“Bang! Bang! Bang!”<br/><br/>The next moment, intense sounds of collision rang out.<br/><br/>The water flow around Beast Emperor Qian Jiang shot out in all directions. The planets landed on his body and struck him heavily.<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>Qian Jiang Beast Emperor felt intense pain and let out a roar.<br/><br/>The water flow around him started to spin and formed a terrifying whirlpool!<br/><br/>An incomparably huge black hole appeared in the whirlpool.<br/><br/>His body entered the black hole directly!<br/><br/>When Wang Xian saw this scene, his eyes focused. He knew that this was Qian Jiang Beast Emperor’s innate skill!<br/><br/>Crack! Crack! Crack<br/><br/>The Black Hole in the vortex spun continuously. He heard a sound that sounded like glass shattering.<br/><br/>This was the sound of the space lock shattering in the Starfield.<br/><br/>Wang Xian sensed it and his gaze flickered slightly.<br/><br/>It was indeed difficult to kill this space beast.<br/><br/>The difference in their strength was so great that it was actually able to escape.<br/><br/>If it was an ordinary beginner-level heaven origin creation stage powerhouse, he would have already been killed by Wang Xian.<br/><br/>His vitality was really tenacious!<br/><br/>“Then, the Dragon King has made his move. ”<br/><br/>At this moment, in the distant surroundings, such a powerful commotion caused a huge commotion.<br/><br/>The four kings of the gods in the belief universe immediately sensed something..\t\t\t\t\t\t</div>", "images": {}, "success": true}