{"id": 1249, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074722.html", "title": "Chapter 4252 - Chapter 4252: 4251 Made A Breakthrough", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4252 - Chapter 4252: 4251 Made A Breakthrough</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4252: 4251 made a breakthrough<br/><br/>Translator: 549690339<br/><br/>Wang Xian looked at the various messages in the Heaven’s origin communicator. His eyes were sparkling.<br/><br/>The distress messages contained some distress messages similar to the mountain range universe.<br/><br/>They had suffered an invasion and hoped to receive reinforcements.<br/><br/>The resources and price they had to pay was also extremely huge.<br/><br/>Wang Xian was a little envious as he looked at it!<br/><br/>“From now on, I can take on these requests for help.”<br/><br/>Wang Xian thought to himself.<br/><br/>Those universes that were requesting for help had even taken out their quotas to trade.<br/><br/>This was of great use to the Dragon Palace.<br/><br/>In addition, with the huge amount of resources, Wang Xian might have a way to achieve a breakthrough!<br/><br/>“Let’s wait until I sell the corpse of the river-migrating Beast Emperor and exchange it for resources. Let’s talk about it after I Breakthrough!”<br/><br/>Wang Xian mumbled.<br/><br/>He was still in the midst of the outbreak of the quantum tribulation. He wasn’t sure what would happen next.<br/><br/>He would talk about it after the nine-origin universe had settled down.<br/><br/>Furthermore, as the guardian of the nine-origin universe, Wang Xian still had a mission.<br/><br/>He might need to protect the DAO at any time!<br/><br/>Moreover, accepting this kind of mission to seek help did not mean that he could complete it 100% . There were also risks involved.<br/><br/>There were also terrifying existences in the evil sequence faction.<br/><br/>It could even be an existence on the level of Chaos!<br/><br/>After putting away the Tianyuan Communicator, Wang Xian looked at his surroundings. Then, he found a pretty good restaurant in the sky and ordered some delicious food.<br/><br/>To Wang Xian, the universe of justice was very bright and prosperous.<br/><br/>Such a prosperous scene could not be compared to the nine-origin universe!<br/><br/>With a glance, Wang Xian could sense hundreds of thousands of masters in the ruler realm.<br/><br/>This was a universe with as many masters as dogs.<br/><br/>It was hard to imagine how many masters in the ruler realm existed in the entire universe of justice.<br/><br/>There were probably tens of millions of them!<br/><br/>Of course, this was not a single ruler in the universe. It included the powerhouses in the surrounding dozens of universes.<br/><br/>“From the looks of it, the Dragon Palace is not very powerful!”<br/><br/>Wang Xian thought to himself.<br/><br/>There were more than a million rulers in the Dragon Palace.<br/><br/>The reason why there were so many of them was that Wang Xian had killed too many powerhouses in the Heaven’s origin realm.<br/><br/>Especially in the six paths universe.<br/><br/>That time was a huge opportunity for Wang Xian!<br/><br/>“Currently, Xiao Lan and the rest are the ones closest to the Heaven’s origin realm in the Dragon Palace. It’s best if I can upgrade Xiao Lan and the rest!”<br/><br/>He was deep in thought.<br/><br/>In the following period of time, Wang Xian wandered around the justice universe.<br/><br/>The security of the entire justice universe was still very good. No living beings dared to cause trouble here.<br/><br/>In the Tianyuan communication device, the corpse of the Qianjiang Beast Emperor that Wang Xian had sent for auction also received intense competition.<br/><br/>The corpse of a space beast was such a treasure. It was a great opportunity for a ruler-level powerhouse.<br/><br/>If the flesh and blood of a space beast in the Tianyuan destiny-level could be used to aid in cultivation, it could allow a ruler-level powerhouse to improve rapidly.<br/><br/>Such resources could be used to nurture the strong. It was something that could only be obtained by luck!<br/><br/>In addition to the items that Wang Xian traded with, ordinary resources could also be used. This caused the factions of the Justice Sequence Alliance to engage in an intense competition.<br/><br/>The price continued to rise.<br/><br/>When Wang Xian saw this scene, a smile appeared on his face!<br/><br/>Before ten years had passed, Wang Xian calculated the highest bid. It was enough for him to achieve a breakthrough in his strength!<br/><br/>Ten years passed very quickly.<br/><br/>The amount of resources exchanged had increased significantly!<br/><br/>After the auction ended, Wang Xian immediately contacted the final bidder!<br/><br/>The final bidder was also in the Justice Universe. Clearly, he was determined to get the body of the Qianjiang Beast Emperor!<br/><br/>After Wang Xian met him, he carried out the exchange!<br/><br/>The Trader was also a strong man in the Heaven’s origin realm. Wang Xian could sense that he had the strength of a controller.<br/><br/>Wang Xian didn’t interact much with him. After obtaining the resources, he separated a simple physical body and summoned an lie over!<br/><br/>Then, he ordered an lie to teleport him back to the nine-origin universe!<br/><br/>After returning to the Dragon Palace, Wang Xian didn’t hesitate and immediately began to devour!<br/><br/>Boom! Boom! Boom<br/><br/>Roar! Roar! Roar<br/><br/>In the Dragon Palace, as Wang Xian devoured, the energy in his body became more and more terrifying.<br/><br/>A weak dragon’s roar could be heard from his dragon scales and his flesh and blood.<br/><br/>It was like a drop of blood that could transform into an extremely terrifying universe divine dragon!<br/><br/>A nine-colored light enveloped it.<br/><br/>The Phantom of the Divine Dragon flickered continuously.<br/><br/>Ancient, sacred and noble!<br/><br/>One couldn’t even look directly at it!<br/><br/>The weak wouldn’t even be able to make eye contact with Wang Xian!<br/><br/>“Ding, congratulations to host for increasing your level and breaking through to the level nine realm of the Universe Dominator.”<br/><br/>“Ding, congratulations to host for breaking through and strengthening the nine origins Dragon Field.”<br/><br/>As Wang Xian continued to absorb, a shackle was broken. Following that, the system’s voice sounded in his mind!<br/><br/>He felt that his strength was unprecedentedly powerful!<br/><br/>Name: Wang Xian<br/><br/>Race: Nine-origin Divine Dragon (man-dragon unity)<br/><br/>Level: Universe Overlord level nine (nine transformations return to one)<br/><br/>Origin: 1% (99% needed for the next breakthrough)<br/><br/>Supernatural ability: rule the water race (rule the water race below one’s level)<br/><br/>Devour living beings (devour living beings to extract origin)<br/><br/>Control of the five elements<br/><br/>Cultivation Method: Divine Dragon Transformation<br/><br/>Supernatural ability: soul capture, spirit attachment<br/><br/>Law supernatural ability: Dragon Eye Lock, five-element Dragon Claw, Yin-yang realm-breaking, eight luminaries dragon scale, Holy Dragon Shadow, Heavenly Dragon Eight Tribes, Dragon Tomb, Cloud Dragon Soaring, True Dragon body<br/><br/>Laws and Abhijnas: eight Dragon Pillars, eight dragon clones, towering dragon horns, Mighty Heavenly Dragon, Divine Tail Pearl, Life Dragon Breath, Shadow Dragon Clone, Netherworld Dragon Pursuit, Netherworld Dragon Transformation, wind and Thunder Dragon Birth, Mad Dragon Star Explosion!<br/><br/>Domain: Nine Origins Dragon Domain<br/><br/>Control laws: metal, wood, water, fire, Earth, light, dark wind and thunder<br/><br/>Kingdom of God: Dragon Palace<br/><br/>Dragon Palace: Innate.<br/><br/>Members of Dragon Palace: 8060450<br/><br/>With a thought, Wang Xian looked at his attributes and smiled!<br/><br/>I’ve made a breakthrough!<br/><br/>I’ve finally made another breakthrough!<br/><br/>This breakthrough allowed his main body to match the level of the Great Dao without the aid of any treasures!<br/><br/>“The current me might not be able to run amok in the calamity, but I’m basically one of the top existences!”<br/><br/>Wang Xian smiled.<br/><br/>Even for the Justice Sequence Alliance, with Wang Xian’s strength, he could probably be ranked at the top!<br/><br/>Of course, this was just his guess!<br/><br/>On the surface, the justice sequence alliance only had about ten Great Dao level powerhouses!<br/><br/>“If I continue to level up, the amount of resources required will be even greater. The amount of resources required will probably require the sum of resources from several universes!”<br/><br/>Wang Xian took a look at the amount of resources required for the next level up and was a little speechless!<br/><br/>Compared to the amount of resources required for his breakthrough this time, it was dozens of times more!<br/><br/>It would require the sum of all the resources in several universes at least!<br/><br/>“The next goal is to increase the number of powerhouses in the heaven origin creation realm in the Dragon Palace first, or to upgrade the level of the Void Dragon Body!”<br/><br/>Wang Xian was planning for the future!\t\t\t\t\t\t</div>", "images": {}, "success": true}