{"id": 1244, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074702.html", "title": "Chapter 4247 - Chapter 4247: 4246, Each Of Them Was Protecting The Universe", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4247 - Chapter 4247: 4246, Each Of Them Was Protecting The Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4247: 4246, each of them was protecting the universe<br/><br/>Translator: 549690339<br/><br/>Boom<br/><br/>Under the terrifying energy, Wang Xian saw that the Heaven’s origin creator stopped resisting.<br/><br/>When he saw that his body was emitting a special energy, he raised his eyebrows slightly.<br/><br/>He knew that he had given up on resisting!<br/><br/>When the energy swept over, his body lost its vitality.<br/><br/>If he didn’t have a powerful treasure that could revive him instantly, he would need a long time to recover to his peak.<br/><br/>Wang Xian didn’t stop. He moved his body and immediately took away his<br/><br/>corpse!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>At the same time, the body of the Void Divine Dragon started to move. It started to hunt down the surrounding experts from the evil sequence camp.<br/><br/>At this moment, the power and terror of the space attribute was unmistakable!<br/><br/>The instant teleportation wiped out the experts in the ruler realm. They didn ‘t have the slightest ability to resist!<br/><br/>With a space tremor, his body disappeared instantly. He turned into a corpse and was kept by Wang Xian.<br/><br/>He even used the power of space to forcefully teleport the enemy to him.<br/><br/>All kinds of methods were abnormally terrifying!<br/><br/>“I’m leaving! ”<br/><br/>Wang Xian finished everything in just two seconds.<br/><br/>In one second, he killed two powerhouses who were in the Heaven’s origin realm.<br/><br/>In one second, he had killed the Dominators of the evil sequence around him.<br/><br/>He had harvested 100,000 corpses!<br/><br/>It only took him two seconds.<br/><br/>His speed was very fast.<br/><br/>However, two seconds was enough for a powerhouse at Wang Xian’s level to do a lot of things!<br/><br/>Buzz<br/><br/>After Wang Xian had killed them, he disappeared instantly!<br/><br/>The transformation of the Netherworld Dragon!<br/><br/>“Hiss, what a terrifying attack. Is this the power of a powerhouse at the Great Dao Level?”? “No wonder some experts in the Justice Sequence Alliance said that as long as a Great Dao realm existence was born in the universe, the calamity wouldn’t be too dangerous. ”<br/><br/>“Terrifying, truly terrifying. An existence that has just entered the Heavenly Yuan creation realm was instantly killed. If we were to face this Dragon King alone, we would probably be in the same situation.”<br/><br/>“Too powerful. With this Dragon King around, our mountain universe should be able to be defended. Look, the Dragon King instantly arrived at another heavenly yuan creation realm expert. ”<br/><br/>The Four Heavenly Yuan creation realm experts from the mountain range universe were shocked when they saw the situation here through the heavenly copper mirror.<br/><br/>With such terrifying strength, even if they joined forces, they would probably be crushed and killed.<br/><br/>This power was too terrifying!<br/><br/>At the same time, around the core of the mountain range universe.<br/><br/>At the other six locations of the evil sequence camp.<br/><br/>When they saw the terrifying power coming from the right, their expressions changed slightly.<br/><br/>“What’s the situation?”<br/><br/>They looked over at the same time. Some of the powerhouses who had quick reactions immediately flew towards the teleportation formation.<br/><br/>During this period of time, they had set up teleportation formations at every location to prevent the Heaven’s origin manifestation powerhouse from launching a sneak attack!<br/><br/>However, the spot closest to the right was the spot closest to the powerhouse of the Heaven’s origin realm that Wang Xian had killed.<br/><br/>When the powerhouse of the Heaven’s origin realm from the evil sequence faction flew out, he sensed a terrifying energy that was attacking him.<br/><br/>This was a giant bird-type powerhouse of the Heaven’s origin realm whose entire body was filled with violent wind energy.<br/><br/>He had an extremely sharp mouth and a large number of sharp teeth were exposed on the outside of his mouth.<br/><br/>The commotion that came from the side caught his attention.<br/><br/>However, he did not expect that just as he flew out from the war weapon, a death threat was transmitted to him.<br/><br/>His pupils contracted slightly and he immediately sent out a distress signal to the other five heaven origin creation stage powerhouses!<br/><br/>Through the ability of the Netherworld Dragon Transformation, Wang Xian arrived here in an instant.<br/><br/>The body of the Void Divine Dragon teleported.<br/><br/>The incipient saint wings were flapped.<br/><br/>It allowed his speed to reach a terrifying level!<br/><br/>According to the energy in the heaven-seeing bronze mirror, this wind-attributed heaven-origin creator was only at the level of someone who had just stepped into the first level.<br/><br/>It was also at the level of someone who had just stepped into the first level.<br/><br/>He was the weakest existence.<br/><br/>Wang Xian was able to kill an expert at this level in an instant!<br/><br/>The five elements grinding tai chi dragon plate unleashed its strongest attack.<br/><br/>“What is this?”<br/><br/>Sensing Wang Xian’s invincible strength, a look of horror appeared on his face.<br/><br/>Without any hesitation, he fled into the distance!<br/><br/>However, just as he turned around, he saw Wang Xian’s figure appearing in front of him.<br/><br/>A Terrifying Dragon Claw attacked him!<br/><br/>He growled and his entire body immediately turned into dozens of pieces and shot out in all directions!<br/><br/>Every part of his body was moving at an abnormally terrifying speed.<br/><br/>When Wang Xian saw this scene, his eyes flickered.<br/><br/>Boom<br/><br/>He swung his dragon claw and more than half of his body was turned into his hand!<br/><br/>The vitality of that part of his body was instantly extinguished by him!<br/><br/>Buzz<br/><br/>The body of the Void Divine Dragon moved slightly and instantly clawed at his fleeing body!<br/><br/>The escaping ability of this heaven origin creator was indeed powerful.<br/><br/>He was able to instantly dodge a full-strength attack from a great dao level cultivator!<br/><br/>Unfortunately, Wang Xian possessed ten attributes in his body.<br/><br/>He possessed the body of the Void Divine Dragon.<br/><br/>In an instant, he arrived beside the other body of the heaven origin creator and killed him!<br/><br/>It was very easy to kill such a weak beginner-level Heaven’s origin creator at the Great Dao level.<br/><br/>This was also the reason why a heaven’s origin creator was able to defend an entire universe.<br/><br/>His individual combat strength was too strong!<br/><br/>After Wang Xian killed him, it only took him one to two seconds.<br/><br/>Following that, his body disappeared again!<br/><br/>He forcefully used the ability of the Netherworld Dragon transformation.<br/><br/>This caused a trace of Blood to spill out from his mouth.<br/><br/>However, the ancestral tree could recover from such injuries quickly!<br/><br/>However, when Wang Xian’s body appeared in the third spot.<br/><br/>He saw the heaven origin creator standing in front of a huge building.<br/><br/>The Heaven Origin creator was also staring at him.<br/><br/>At the next moment, his expression changed drastically. Without any hesitation, he stepped into the teleportation formation and disappeared!<br/><br/>“Huh? You reacted quickly! ”<br/><br/>Wang Xian noticed that he had disappeared instantly and adjusted his brows slightly.<br/><br/>However, he looked around and waved his arm.<br/><br/>The body of the Void Divine Dragon disappeared instantly.<br/><br/>“Ahhhh!”<br/><br/>Following that, a scream was heard. The powerful disciples of the ruler and venerable realm from the evil sequence faction were killed quickly.<br/><br/>Faced with Wang Xian’s attacks, they did not have the ability to resist at all.<br/><br/>In just a few seconds, all the powerful disciples in the surroundings were hunted down.<br/><br/>After the hunt was over, Wang Xian did not leave. Instead, he stood there and waited quietly.<br/><br/>He wanted to wait for the powerful disciples of the evil sequence faction to arrive.<br/><br/>He wanted to let them know that this universe was under his protection! If they wanted to continue fighting against this universe, they would have to make an enemy out of him.<br/><br/>They would have to pay the price!<br/><br/>“Weng Weng! ”<br/><br/>And at this moment, just as he had expected, they were located at the teleportation array.<br/><br/>Waves of energy flickered with a luster.<br/><br/>An expert had teleported over!\t\t\t\t\t\t</div>", "images": {}, "success": true}