{"id": 1242, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074694.html", "title": "Chapter 4245 - Chapter 4245: The Transaction Between 4244 And The Mountain Universe! Go", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4245 - Chapter 4245: The Transaction Between 4244 And The Mountain Universe! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4245: The transaction between 4244 and the mountain universe! Go<br/><br/>Translator: 549690339<br/><br/>“Who… Who Are You?”<br/><br/>The four heaven origin creator powerhouses from the mountain universe looked at Wang Xian with a serious expression and asked with an embarrassed expression.<br/><br/>What kind of existence could come to them without making a sound?<br/><br/>This made them terrified.<br/><br/>If the other party was a powerhouse among the intruders, they would be in trouble!<br/><br/>(‘I was passing by and saw that your mountain universe was invaded. I was curious and came to take a look. I happened to hear your conversation and wanted to make a deal with you!”<br/><br/>Wang Xian looked at them and said with a smile.<br/><br/>“A deal?”<br/><br/>The four heaven origin creation realm experts from the mountain universe looked at each other and their eyes landed on Wang Xian. “Pay the price and I will help you defend the mountain universe!”<br/><br/>Wang Xian stared at them and said!<br/><br/>“Help us defend the Mountain Universe?”<br/><br/>The four heaven origin creation stage powerhouses from the mountain universe had a drastic change in expression as their bodies trembled!<br/><br/>“What? You Don’t believe me?” Wang Xian stared at them and smiled.<br/><br/>Boom<br/><br/>In the next moment, an extremely terrifying pressure engulfed the four heaven origin creation stage powerhouses!<br/><br/>“Bang! Bang! Bang!”<br/><br/>The four of them trembled and their thrones collapsed instantly.<br/><br/>They bent their knees.<br/><br/>The four of them revealed a hint of fear in their eyes.<br/><br/>“An existence at the level of the Great Dao?”<br/><br/>The one at the center, the one at the level of the Heaven’s origin, shouted in a low voice!<br/><br/>Wang Xian smiled and the pressure disappeared!<br/><br/>“How is it?”<br/><br/>Wang Xian looked at them and asked with a smile!<br/><br/>Sir, are… are you really willing to help our mountain range universe? What…<br/><br/>what price do we have to pay?”<br/><br/>A Heaven origin creator from the mountain range universe asked excitedly!<br/><br/>The other three people were also staring at him eagerly. However, there was still a hint of calmness in their eyes.<br/><br/>They were afraid that Wang Xian would ask for too much!<br/><br/>“What are the resources that you have to pay to seek help from the Justice Sequence Alliance? Tell me! ”<br/><br/>Wang Xian stared at them and asked!<br/><br/>“This is the amount of resources required to support the Justice Sequence Alliance! ”<br/><br/>The Heaven Origin creator from the mountain range universe did not hesitate and directly sent a message to Wang Xian.<br/><br/>They did not dare to play any tricks now.<br/><br/>If they were to be discovered by this great dao existence before them, they would be courting death.<br/><br/>Furthermore, if the other party was willing to help them in the mountain range universe, they would be willing to pay a huge price!<br/><br/>Wang Xian received their message and looked at the price they had to pay to request for help. He narrowed his eyes slightly.<br/><br/>Huge!<br/><br/>Huge amount of resources.<br/><br/>Not only were there two slots for the Heaven’s origin creator, the resources were also huge.<br/><br/>It was so huge that these resources were twice as much as the ones he obtained from the Phoenix tribe!<br/><br/>(‘I want a slot for a metal-type heaven origin creation stage powerhouse. The other slot can be exchanged for resources. I Won’t ask for too much. The other resources are the same as the ones you guys requested for help with. ” Wang Xian looked at them and said.<br/><br/>If Wang Xian were to exchange the Qianjiang Beast Emperor’s corpse into treasures, these resources would be enough for Wang Xian to level up!<br/><br/>Once he upgraded, Wang Xian would be able to fight against existences of the Great Dao level without the aid of any treasures.<br/><br/>This was a huge upgrade!<br/><br/>“Thank you, sir! Thank you, Sir! ”<br/><br/>The four Heaven’s origin powerhouses from the mountain range universe were slightly stunned when they heard Wang Xian’s words.<br/><br/>Following that, they expressed their gratitude with faces full of excitement.<br/><br/>They thought that the sir in front of them would ask for a lot of resources.<br/><br/>They didn’t expect that the amount of resources requested was not more than that of the Justice Sequence Alliance.<br/><br/>One had to know that asking for support within the Justice Sequence Alliance was considered an alliance price.<br/><br/>If one didn’t ask for support from the experts in the alliance and asked for support from those experts from the neutral camp, the amount of resources required would be much more than that!<br/><br/>This made the four people from the mountain range universe filled with gratitude!<br/><br/>Wang Xian waved his hand and said. “After I help you guys through the crisis. give me all the resources. At that time, I will also let one of my disciples have a breakthrough with you guys! ”<br/><br/>He spoke directly.<br/><br/>Wang Xian didn’t ask for some resources in advance because there was no need.<br/><br/>If he really helped them solve the crisis, would the mountain universe dare to not give him resources?<br/><br/>Then, Wang Xian would be able to kill the entire mountain universe!<br/><br/>Although Wang Xian’s strength was not as strong as the evil faction that invaded the mountain universe this time.<br/><br/>However, Wang Xian alone was comparable to an existence at the level of the Great Dao.<br/><br/>Just like now, he could easily enter the core of the mountain universe.<br/><br/>He came to the front of the four heaven origin creation stage powerhouses in the mountain universe.<br/><br/>The invaders from the evil faction could not do it!<br/><br/>There was still a huge difference between the combined strength and the individual strength!<br/><br/>The reason why Wang Xian was confident that he could help the mountain range universe through this crisis was also due to his own strength.<br/><br/>He could defeat the invaders one by one!<br/><br/>“Yes, we will hand over all the resources to you. We can even give you a portion of the resources now!”<br/><br/>The Heaven origin creator of the mountain range universe immediately said!<br/><br/>“There’s no need! ”<br/><br/>Wang Xian shook his head. “Let’s talk about it after everything is settled! ”<br/><br/>“Thank you, sir. May I know how we should address you?” A powerhouse of the Tianyuan universe asked respectfully.<br/><br/>“Just Call Me Dragon King! ”<br/><br/>Wang Xian spoke up!<br/><br/>“It’s Dragon King! ”<br/><br/>The four powerhouses of the Tianyuan universe immediately called out respectfully!<br/><br/>“Do you have any plans of the intruders outside? I’m ready to take action immediately! ”<br/><br/>Wang Xian did not want to waste any time, nor did he want the intruders of the evil sequence faction to spend more time preparing!<br/><br/>Sir Dragon King, there’s a treasure in our universe that can detect everything about the intruders. We can also detect the location of their powerhouses! ” The powerhouse in the center of the universe reported to Wang Xian!<br/><br/>“Oh? That’s even better. Show it to me! ”<br/><br/>Wang Xian raised his eyebrows and nodded.<br/><br/>“It’s Sir Dragon King! ”<br/><br/>The four powerhouses in the universe nodded. With a wave of their arms, an ancient bronze mirror slowly appeared in the center of their universe.<br/><br/>The bronze mirror slowly dissipated.<br/><br/>With a tap of their arms, a miniature image of the center of the mountain range universe appeared!<br/><br/>With this image, one could clearly see the layout of the intruders from the evil sequence faction around the mountain range universe!<br/><br/>“What a treasure!”<br/><br/>Wang Xian sighed in his heart when he saw it.<br/><br/>A universe still had its unique and powerful aspects.<br/><br/>The scope of this bronze mirror was terrifyingly large.<br/><br/>It was extremely powerful in monitoring the world!<br/><br/>Of course, the 9-origin universe’s Al also had similar abilities!<br/><br/>“Lord Dragon King, seeing that the heavenly bronze mirror can detect everything around us, including the location of the experts of their level, we also relied on this treasure to attack their weak spots when they attacked. It achieved a miraculous effect and made them fearful! ”<br/><br/>“If it wasn’t for this, they would have attacked us long ago! ”<br/><br/>A heavenly Yuan creator said!<br/><br/>The heaven-seeing bronze mirror was one of their trump cards!\t\t\t\t\t\t</div>", "images": {}, "success": true}