{"id": 1241, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074690.html", "title": "Chapter 4244 - Chapter 4244: The Deal Between 4243 And The Mountain Universe! Go", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4244 - Chapter 4244: The Deal Between 4243 And The Mountain Universe! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4244: The deal between 4243 and the mountain universe! Go<br/><br/>Translator: 549690339<br/><br/>“Two at the control level and five at the beginner level!”<br/><br/>Wang Xian read through all the information about the intruders and mumbled.<br/><br/>Two at the control level could be compared to six of the weakest heaven origin creation stage powerhouses.<br/><br/>The remaining five could at least be compared to six to seven of the weakest heaven origin creation stage powerhouses.<br/><br/>If the other party attacked him together, Wang Xian might not be a match for them.<br/><br/>“It seems like it’s the right choice to let the Tiger Roar Mountain not break through. Once they break through, they will definitely be attracted over. When that happens, I won’t be able to defend myself! ”<br/><br/>Wang Xian thought to himself!<br/><br/>Currently, the intruders had already surrounded the center of the mountain range and universe.<br/><br/>They had used the teleportation formation to connect all the places.<br/><br/>In other words, they were preparing to launch a general attack.<br/><br/>Once they launched a general attack, it would definitely be a devastating blow to the mountain range universe.<br/><br/>The four heaven origin creation stage powerhouses in the mountain range universe would not be a match for them at all.<br/><br/>In the entire mountain range universe, unless the four heaven origin creation stage powerhouses were able to take away a portion of the living beings, the rest would be massacred!<br/><br/>It could be said to be extremely tragic!<br/><br/>Wang Xian left the nest-like war weapon and flew to the side with a thoughtful look on his face.<br/><br/>According to the information he received, the universe that initiated the invasion not only needed blood and food, but it also needed some Powerhouses to make a breakthrough.<br/><br/>As for what kind of attribute the powerhouses had to make a breakthrough, Wang Xian did not receive any specific information.<br/><br/>Overall, the probability of metal attribute was still one-fifth.<br/><br/>This probability was not small.<br/><br/>If there were two disciples who wanted to break through in this invading universe, the probability of needing a metal attribute slot would be increased by another one-fifth.<br/><br/>(‘I can’t wait for the Drobabilitv to be equal. Moreover, if the invading universe really occupies this universe, even if they don’t need a metal attribute slot, they will sell this slot to the powerhouses from the evil sequence faction. ” Wang Xian pondered in his heart.<br/><br/>If he wanted to make huming mountain achieve a breakthrough, he couldn’t let the intruder occupy this universe!<br/><br/>“Perhaps we can cooperate! ”<br/><br/>Wang Xian’s eyes flickered slightly. He felt that he could give it a try. Perhaps, he could obtain some benefits as well!<br/><br/>With a plan in mind, Wang Xian moved his body and concealed himself. He flew toward the center of the mountain range universe.<br/><br/>He easily passed through the blockade line of the intruder universe and entered the interior of the mountain range universe.<br/><br/>After flying for a few hours, a huge mountain peak that stretched as far as the eye could see appeared.<br/><br/>It was like a life planet connecting to a Life Planet!<br/><br/>Wang Xian came to the top of these life mountain peaks and could see countless living beings shuttling back and forth.<br/><br/>Most of the living beings ‘eyes were filled with horror.<br/><br/>It was obvious that the invasion of the experts from the evil sequence faction had frightened them and made them feel despair!<br/><br/>However, what could they do?<br/><br/>Escape? Where could they escape to?<br/><br/>Their roots were right here. Where could they escape to?<br/><br/>Countless living beings were filled with sorrow.<br/><br/>At this moment, they could only pray that the four lords from their mountain range and universe would be able to resist the invasion of external enemies!<br/><br/>Wang Xian flew over the mountain peaks and felt the helplessness of the creatures below. He shook his head slightly.<br/><br/>He had truly experienced the cruelty of the calamity!<br/><br/>Wang Xian continued to fly forward and passed through the huge mountain peaks quickly!<br/><br/>Ten days later, he arrived at the core of the mountain range universe.<br/><br/>There were more than ten huge mountain peaks in the sky.<br/><br/>They were emitting an extremely terrifying aura.<br/><br/>These mountain peaks were all forged into war weapons.<br/><br/>The place where the war weapons surrounded was an extremely huge mountain peak.<br/><br/>The mountain peak was incomparable.<br/><br/>The majestic energy within filled the surroundings!<br/><br/>When Wang Xian flew over, he could feel that there were four powerful auras within the mountain peak!<br/><br/>“Indeed, none ot them are at the control level. There are two who are at the beginning to enter level two!”<br/><br/>Wang Xian mumbled. His strength could not be compared to the intruders at all.<br/><br/>If the intruders were to attack them, they would not be able to defend against them.<br/><br/>At this moment, four powerhouses of the Heaven’s origin realm were gathered together.<br/><br/>Their brows were knitted tightly. Their faces were filled with worry and helplessness.<br/><br/>As the strongest powerhouses in the mountain universe, the Saints of the mountain universe!<br/><br/>Now that they were facing the invasion of foreign enemies, there was nothing they could do!<br/><br/>This made them feel a little despair!<br/><br/>“How’s the request for reinforcements from the justice sequence?”<br/><br/>Four figures sat in a hall located at the highest point of an unparalleled mountain peak.<br/><br/>One of them asked solemnly.<br/><br/>“The other side agreed, but their request was too ruthless. They actually want two spots for our mountain universe’s Tianyuan creation and a large amount of resources from us. Sigh! ”<br/><br/>An elder in the heavenly fate realm said helplessly!<br/><br/>“As long as they can come to support us, everything will be given. However,<br/><br/>I’m afraid that we won’t be able to hold on until then! ”<br/><br/>A heavenly fate realm powerhouse in the center said with a helpless expression!<br/><br/>Justice Sequence Alliance.<br/><br/>They were one of them!<br/><br/>With the arrival of the calamity, they huddled together.<br/><br/>However, if the members of the Justice Sequence Alliance were to encounter danger and wanted to ask for help…<br/><br/>They would have to pay a price!<br/><br/>The enemies that the mountain universe had encountered this time were too powerful!<br/><br/>This would require at least seven or eight ordinary heaven origin creation realm experts.<br/><br/>Or they could invite powerful Great Dao realm experts over to help.<br/><br/>However, inviting so many experts, or such powerful experts, the price was too great!<br/><br/>Not only did they need resources, they also needed two heaven origin creation realm experts.<br/><br/>To them, the price was very heavy.<br/><br/>But even if it was heavy, they had to ask for help.<br/><br/>Right now, what they were worried about was that their mountain range universe would not be able to hold on before the reinforcements arrived!<br/><br/>At that time, if they wanted to take back the universe, the price they had to pay would be even greater.<br/><br/>And for the reinforcements to arrive, they would need at least a thousand years.<br/><br/>A Thousand Years!<br/><br/>The four Heaven’s origin creation realm powerhouses suddenly fell silent. They leaned on their seats and felt helpless!<br/><br/>Buzz<br/><br/>At this moment, Wang Xian, who was outside, happened to hear their conversation.<br/><br/>This caused Wang Xian to squint his eyes slightly.<br/><br/>He moved his body and headed straight into the hall!<br/><br/>Wang Xian entered the hall. The four Heaven’s origin creation realm powerhouses were slightly stunned. Then, they looked in a direction. They were too close to him and could sense Wang Xian’s aura.<br/><br/>Wang Xian looked at them and slowly revealed his figure!<br/><br/>When the four Heaven’s origin powerhouses saw Wang Xian’s figure, they were instantly horrified.<br/><br/>A person had entered their area and they only realized it when they were so close to him!<br/><br/>This? ?<br/><br/>Boom<br/><br/>The four Heaven’s origin powerhouses in the mountain universe instantly erupted with a terrifying aura as they locked their eyes on Wang Xian.<br/><br/>“Everyone, don’t be afraid. I’m not an intruder from your mountain universe.<br/><br/>I’m here to make a deal with all of you! ”<br/><br/>Wang Xian saw their vigilant expressions and spoke with a smile on his face!\t\t\t\t\t\t</div>", "images": {}, "success": true}