{"id": 1248, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074718.html", "title": "Chapter 4251 - Chapter 4251: 4,250 For A Breakthrough", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4251 - Chapter 4251: 4,250 For A Breakthrough</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4251: 4,250 for a breakthrough<br/><br/>Translator: 549690339<br/><br/>“It’s really dazzling. I’m actually able to meet a heaven origin creator.”<br/><br/>Wang Xian looked around as his eyes sparkled.<br/><br/>Such a powerful existence like a heaven origin creator was actually able to meet one here. Wang Xian didn’t know if it was due to his good luck or the fact that there were more heaven origin creator powerhouses here.<br/><br/>Of course, the latter was more likely.<br/><br/>That was because the current radiation circle of the Justice Universe had reached dozens of universes.<br/><br/>With dozens of universes interconnected, the Justice Universe was at the center.<br/><br/>This also meant that the heaven origin creator powerhouses from dozens of universes could frequently appear here.<br/><br/>If there were five heaven origin creator powerhouses in each universe, there would be hundreds of heaven origin creator powerhouses!<br/><br/>“They are indeed powerful, but from the looks of it, the evil sequence alliance should be even more powerful!”<br/><br/>The Evil Sequence Alliance was an invader.<br/><br/>They would do anything to increase their strength. Under such circumstances, the evil sequence alliance had even more champions.<br/><br/>The Justice Sequence Alliance was slightly better. They would not destroy their good nature just to increase their strength!<br/><br/>If that was the case, the evil sequence alliance would be even more powerful.<br/><br/>Of course, although the evil sequence alliance was stronger, they were not as united as the Justice Sequence Alliance!<br/><br/>Wang Xian thought to himself and flew forward quickly!<br/><br/>A universe appeared in his line of sight.<br/><br/>Unlike the nine-origin universe, the Justice Universe was a huge continent.<br/><br/>It was the same as the sword and Magic Universe.<br/><br/>The entire universe was the earth!<br/><br/>Wang Xian approached and saw that the periphery of the justice universe was extremely prosperous!<br/><br/>There were all kinds of ancient and powerful divine beasts with bloodlines.<br/><br/>Soaring Cloud Flying Sword.<br/><br/>Technological spaceship!<br/><br/>Myth and technology coexisted!<br/><br/>Magic and flying sword.<br/><br/>All Kinds of creatures from different races, such as treemen, murlocs, Birdmen, and all kinds of human beings, as well as other demonic birds and the like.<br/><br/>Wang Xian looked at all of this and his eyes flickered slightly.<br/><br/>He moved his body and entered the universe of justice.<br/><br/>“The Guide to the universe of Justice!”<br/><br/>When Wang Xian entered the universe, a mechanical voice sounded in his mind.<br/><br/>When Wang Xian heard it, he adjusted his brows slightly.<br/><br/>Following that, waves of information were transmitted into his mind, allowing him to have a basic understanding of the universe of justice.<br/><br/>Furthermore, he could obtain some information about the transactions and purchases of items in the universe of Justice!<br/><br/>Based on the information in his mind, Wang Xian immediately flew in a certain direction.<br/><br/>He arrived at a registration location.<br/><br/>“Respected Tian Yuan creator, welcome!”<br/><br/>When Wang Yun entered a registration location, a mechanical voice sounded.<br/><br/>Following that, in the main hall in front, an old man walked over immediately and looked at Wang Xian respectfully.<br/><br/>“Welcome to our Justice Universe, sir. May I know how can I help you?”<br/><br/>A few old men walked over and asked respectfully.<br/><br/>Wang Xian looked at them and raised his eyebrows slightly.<br/><br/>He did not hide his aura. It was normal for him to be sensed!<br/><br/>“I would like to make some transactions here. Also, I would like to obtain the Justice Sequence Alliance’s Tian Yuan Communicator!”<br/><br/>The Justice Sequence Alliance’s Heaven Element Communicator was the information communicator for the Justice Sequence Alliance’s experts.<br/><br/>Within this communicator, trade information could be posted, and help could be requested.<br/><br/>It was mainly a platform for trade and communication.<br/><br/>“Yes, my Lord. My lord, in order to prevent the experts from the evil sequence alliance from obtaining our Heaven Element Communicator, we need you to conduct a Test!”<br/><br/>“It’s not a test either. The main purpose is for you to answer a question in front of one of our treasures. The question is, are you from the evil sequence faction?”<br/><br/>The old man said respectfully to Wang Xian!<br/><br/>“Oh? No Problem!”<br/><br/>Wang Xian nodded his head. He had heard about this test from the powerhouses of the Heaven’s origin in the mountain range universe.<br/><br/>In the Justice Sequence Alliance, there was an ultimate treasure of the Heaven’s origin. This ultimate treasure did not have any offensive power. It was a fully supported ultimate treasure.<br/><br/>It was called the mirror of reality!<br/><br/>The Mirror of reality could make a contract to authenticate reality.<br/><br/>Even a heavenly fate expert could do so.<br/><br/>In other words, in front of the mirror of reality, all lies would be exposed.<br/><br/>Furthermore, after obtaining the heavenly fate communicator, one would have to make a contract with the mirror of reality.<br/><br/>The moment one joined the evil sequence alliance in the future, the Heavenly Fate Communicator would directly collapse!<br/><br/>This was the restraining ability of the mirror of reality!<br/><br/>“Sir, please follow me!”<br/><br/>A few elders brought Wang Xian into a room.<br/><br/>The next process was very simple. Wang Xian didn’t see the mirror of reality, the Ultimate Treasure of the Heaven’s origin!<br/><br/>After walking out of the room, Wang Xian held a communicator in his hand and looked at the information on it!<br/><br/>There was a group chat function in the communicator. There weren’t many members displayed on it.<br/><br/>This Tian Yuan Communicator wasn’t something that only Tian Yuan destiny realm experts could have. Those powerful factions that didn’t have Tian Yuan destiny realm experts also had Tian Yuan communicators.<br/><br/>After all, although some factions didn’t have Tian Yuan destiny realm experts, they still had a lot of resources and treasures!<br/><br/>Also, if the experts of these factions wanted to break through, they could carry out transactions and seek a breakthrough!<br/><br/>Other than a group chat, the next area was the trading area.<br/><br/>He would upload the items he wanted to trade first and then intentionally communicate with each other!<br/><br/>After Wang Xian understood the information of this Tianyuan communication device, he immediately placed the items he wanted to trade on it.<br/><br/>This time, he was auctioning them.<br/><br/>There would naturally be competition for the popular items. The item would belong to whoever bid the highest.<br/><br/>The corpse of a cosmic behemoth in the Heaven’s origin realm was definitely a treasure.<br/><br/>Moreover, this kind of treasure could improve the strength of a strong disciple in the ruler realm by quite a lot!<br/><br/>After Wang Xian uploaded the item, he proceeded with the auction for ten years.<br/><br/>In the end, the highest bidder obtained the item!<br/><br/>The location of the transaction was in the Justice Universe!<br/><br/>Time was sufficient!<br/><br/>After Wang Xian uploaded all of this, he checked the other information in the Tianyuan communication device.<br/><br/>In this transaction area, Wang Xian saw many treasures. There were even powerful treasures that could be revived.<br/><br/>Of course, the revived treasures were also divided into different levels.<br/><br/>For example, the soul-returning fruit was the lowest level of the revived treasures.<br/><br/>After reviving, one had to start from scratch.<br/><br/>The more powerful the resurrection treasure was, the more power it could retain.<br/><br/>The highest level resurrection treasure could allow one to be resurrected without any injuries!<br/><br/>Among the ten heaven origin creation stage powerhouses, perhaps only two to three of them had such a treasure!<br/><br/>It was a true treasure!<br/><br/>Other than that, there were many other treasures. However, Wang Xian did not have anything to exchange for.<br/><br/>Innate treasures were considered ordinary treasures here. No one in the Heaven’s origin realm would be interested in them.<br/><br/>The Shattered Heaven’s origin realm treasures were extremely precious and of high value.<br/><br/>However, such treasures were hard to come by. Wang Xian did not intend to sell them!<br/><br/>After taking a look around, Wang Xian shook his head regretfully.<br/><br/>Following that, he opened the information on the cooperation of the Heaven’s origin communicator.<br/><br/>There was a message of cooperation to hunt down the strong disciples of the evil sequence camp.<br/><br/>There was a message of cooperation to carry out the universe of the evil sequence camp.<br/><br/>There was also a message requesting for reinforcements!\t\t\t\t\t\t</div>", "images": {}, "success": true}