{"id": 1243, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074698.html", "title": "Chapter 4246 - Chapter 4246: 4245 Each To Protect One Universe! Go", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4246 - Chapter 4246: 4245 Each To Protect One Universe! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4246: 4245 each to protect one universe! Go<br/><br/>Translator: 549690339<br/><br/>“Alright, with this treasure, it will be easier to move! ”<br/><br/>Wang Xian narrowed his eyes slightly, and his eyes were sparkling.<br/><br/>He stared at the map of the intruder universe. There were seven powerhouses of the Heaven’s origin realm in seven different locations.<br/><br/>At the center of the map were two existences of the control level.<br/><br/>Wang Xian was deep in thought. Finally, he locked onto the right side of the map!<br/><br/>Sir Dragon King, what should we do next? Our Mountain Ridge Universe will go all out!”<br/><br/>The four powerhouses of the Heaven’s origin creation realm in the mountain ridge universe looked at Wang Xian and asked.<br/><br/>“I will immediately attack the intruders on the right side. You guys stay here and monitor the two powerhouses of the Heaven’s origin creation realm on the right side. If they have any intentions, inform me immediately! ”<br/><br/>Wang Xian looked at them and said!<br/><br/>“Alright, Dragon King! ”<br/><br/>The four heaven origin creation level powerhouses in the mountain range universe nodded immediately.<br/><br/>They also understood that Wang Xian wanted to carry out a surprise attack.<br/><br/>It was very terrifying for a great dao level Powerhouse to make a breakthrough!<br/><br/>Moreover, he didn’t want them to follow him because he was worried that the matter would be exposed!<br/><br/>“Dragon King, this is our mountain range universe’s communication device. If there are any changes, we will inform you immediately! ”<br/><br/>They had given Wang Xian a communication device!<br/><br/>Wang Xian nodded his head. With a move of his body, he immediately flew to the right.<br/><br/>Very soon, Wang Xian disappeared from the perception of the four Heaven’s origin powerhouses in the mountain range universe!<br/><br/>However, they immediately looked at the heaven-looking bronze mirror.<br/><br/>In the heaven-looking bronze mirror, they could clearly see Wang Xian’s figure with a wave of their arms!<br/><br/>“I hope that this Lord Dragon King who suddenly appeared can help us defend against external enemies! ”<br/><br/>“This Lord Dragon King seems to be quite upright. At least he didn’t take advantage of the situation and didn’t ask us to give him the resources in advance. ”<br/><br/>“It should be. There’s no need for him to plot against us.”<br/><br/>The four heaven origin creation powerhouses from the mountain universe said softly.<br/><br/>The Dragon King was very powerful. He was able to conquer the entire mountain range universe by himself!<br/><br/>Furthermore, if an existence of such level were to really attack without restraint for the sake of resources…<br/><br/>Then he would be able to obtain even more resources.<br/><br/>The four of them looked at the scene in the heavenly bronze mirror and prayed that Wang Xian would succeed!<br/><br/>Buzz<br/><br/>Wang Xian flew forward. When he was close to the encirclement of the evil sequence camp, he hid himself once again!<br/><br/>What Wang Xian wanted to do now was to carry out a hunting operation!<br/><br/>He wanted to hunt down the Heaven’s origin creation stage powerhouses from the evil sequence camp as soon as possible.<br/><br/>It would be best if he could hunt down a few more.<br/><br/>This time, Wang Xian locked onto the position on the right.<br/><br/>This was because there were three beginner-level Heaven’s origin creation stage powerhouses at this position.<br/><br/>With Wang Xian’s current strength, it was still very easy for him to kill beginner-level Heaven’s origin creation stage powerhouses!<br/><br/>Especially when he was launching a sneak attack!<br/><br/>He had to kill him within at least three seconds!<br/><br/>Otherwise, his reinforcements would arrive!<br/><br/>Wang Xian moved forward while concealing his figure.<br/><br/>On the right, there were three beginner-level heaven origin creation stage powerhouses. He first came to the rightmost position.<br/><br/>He placed a netherspirit avatar there!<br/><br/>Following that, he went to the beginner-level heaven origin creation stage powerhouse in the center and placed the second netherspirit avatar there as well.<br/><br/>Following that, he went to the third powerhouse who had just entered the Heaven’s origin realm.<br/><br/>After setting everything up, Wang Xian’s eyes sparkled.<br/><br/>He stared at the powerhouse who had just entered the Heaven’s origin realm and was the closest to the center.<br/><br/>The powerhouse who had just entered the Heaven’s origin realm was the weakest one according to the detection of the heaven-seeing bronze mirror!<br/><br/>He was the one who had just broken through not too long ago!<br/><br/>“Let’s get rid of this first! ”<br/><br/>He thought to himself as he slowly inched closer!<br/><br/>There was a huge evil sequence army here.<br/><br/>There were 100,000 ruler realm experts scattered around.<br/><br/>There were also 500,000 to 600,000 venerables.<br/><br/>In the center was a huge war machine!<br/><br/>It was an ancient tree filled with darkness, and there were many bat-like creatures hanging on it.<br/><br/>The entire ancient tree was abnormally huge. The branches on it were black.<br/><br/>The ancient tree swayed its branches from time to time.<br/><br/>It was obvious that this was a living creature!<br/><br/>There was a huge palace located above the ancient tree.<br/><br/>The powerhouse who had just entered the Heaven’s origin realm was in this palace!<br/><br/>Wang Xian could sense the location of the powerhouse who had just entered the Heaven’s origin realm.<br/><br/>“It’s best if I can kill him instantly! ”<br/><br/>Wang Xian got close to a certain distance and took a deep breath.<br/><br/>He couldn’t drag this out for too long.<br/><br/>Otherwise, the Heaven’s origin creator from other places would be able to teleport over quickly.<br/><br/>At that time, it would be troublesome!<br/><br/>Swoosh<br/><br/>Wang Xian stared ahead and adjusted his condition to its peak.<br/><br/>He started to move instantly.<br/><br/>All the energy in his body was activated!<br/><br/>In an instant, Wang Xian arrived at a spot not far away from the palace.<br/><br/>The sudden vast and mighty energy caused the heaven origin creator in the palace to open his eyes!<br/><br/>His expression changed drastically!<br/><br/>Teleportation!<br/><br/>However, at this moment, Wang Xian had already teleported to the top of the palace!<br/><br/>He stretched out an extremely powerful dragon claw and clawed downwards!<br/><br/>The Dragon Claw covered the entire palace!<br/><br/>On both sides, the Tai Chi Dragon Disc, the great grinding of the five elements, and the body of the Void Divine Dragon instantly surrounded the palace!<br/><br/>The strongest force also attacked!<br/><br/>Wang Xian’s pair of dragon eyes stared at the Heaven’s origin manifestation powerhouse inside.<br/><br/>Boom<br/><br/>The extremely terrifying ocean of energy moved away clearly!<br/><br/>The Heaven’s origin manifestation powerhouse inside the palace didn’t even have the time to react before he was covered by the energy!<br/><br/>The surrounding ancient trees that were affected and the numerous evil sequence alignment disciples were instantly annihilated in the ocean of energy!<br/><br/>The difference was too great!<br/><br/>The Heavenly Kismet Realm Expert let out a miserable cry!<br/><br/>His body instantly collapsed!<br/><br/>However, at the instant he collapsed, his shadow suddenly moved and fled into the distance!<br/><br/>The shadow gradually solidified and turned into a body.<br/><br/>A powerful instant resurrection treasure!<br/><br/>Wang Xian was not surprised at all when he saw this scene.<br/><br/>Many powerhouses in the Heaven’s origin realm had powerful life-saving trump cards.<br/><br/>A trump card that was immune to death!<br/><br/>“Towering Dragon Horn! ”<br/><br/>Wang Xian shouted in a low voice. The dragon horn emitted a luster.<br/><br/>Destructive energy covered his body once again.<br/><br/>In an instant, it landed on his body!<br/><br/>At the same time, the body of the Void Divine Dragon emitted a powerful space- sealing force!<br/><br/>“An existence at the Great Dao Level?”<br/><br/>The Tianyuan creator who had just been resurrected through a treasure felt death approaching again and roared in horror!<br/><br/>These attacks that could destroy him one after another were definitely not something that a control-level expert could do.<br/><br/>If a control-level expert wanted to kill a beginner-level expert, it would also take a very long time!<br/><br/>Only a great dao expert could be so terrifying!<br/><br/>A look of despair appeared on his face. With a thought, he transmitted some of the treasures on his body through a secret technique.<br/><br/>Following that, he directly waited for death!<br/><br/>He knew that he would not be able to hold on for long.<br/><br/>He would not be able to hold on until the support of other experts!<br/><br/>Now, to minimize the loss!\t\t\t\t\t\t</div>", "images": {}, "success": true}