{"id": 1240, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074686.html", "title": "Chapter 4243 - Chapter 4243: 4242 Miserable Mountain Universe!", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4243 - Chapter 4243: 4242 Miserable Mountain Universe!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4243: 4242 miserable mountain universe!<br/><br/>Translator: 549690339<br/><br/>Wang Xian quickly flew towards the center of the mountain universe.<br/><br/>Wang Xian did not expect such an unexpected breakthrough at Huming Mountain to happen.<br/><br/>He did not expect that he would encounter a universe that was invaded by the evil sequence faction.<br/><br/>There were seven heaven origin creation realm powerhouses in this universe that initiated the invasion.<br/><br/>If these seven powerhouses in the Heaven’s origin realm joined forces, there was a high chance that Wang Xian would not be their match.<br/><br/>Of course, the prerequisite was that they had to join forces.<br/><br/>If they were to split up, Wang Xian would be very easy to hunt.<br/><br/>However, there was one point. If huming mountain made a breakthrough, it would attract their attention.<br/><br/>If these seven powerhouses in the Heaven’s origin realm all flew over, Wang Xian would be able to protect himself easily. However, he could not be sure if huming mountain would encounter danger.<br/><br/>However, this universe was indeed suitable for huming mountain to make a breakthrough.<br/><br/>Therefore, Wang Xian was prepared to check out the situation of this universe.<br/><br/>In addition, he also wanted to know if the intruders needed metal-attributed disciples to make a breakthrough.<br/><br/>If they did not have metal-attributed disciples to make a breakthrough, with Wang Xian protecting the formation, the intruders might not dare to offend them.<br/><br/>One had to know that Wang Xian was an existence at the level of the Great Dao.<br/><br/>He brought Huming Mountain and flew at high speed.<br/><br/>“Ahhhh!”<br/><br/>“Don’t Kill Us, don’t Kill Us. Please, don’t Kill Us! ”<br/><br/>“Ahhhh!”<br/><br/>Wang Xian flew very fast. After flying for more than ten days, he suddenly heard a loud scream.<br/><br/>When Wang Xian heard the scream, he frowned slightly.<br/><br/>His pair of dragon eyes looked forward.<br/><br/>In his vision, there was a huge mountain peak in front of him.<br/><br/>The mountain peak was equivalent to the planet in this universe.<br/><br/>Billions of living beings lived on it.<br/><br/>In his vision, on top of that mountain peak, various evil invaders were slaughtering and devouring the Aborigines on the mountain peak.<br/><br/>The aborigines were mainly humans, and there were also other intelligent creatures.<br/><br/>The strongest aborigines on the mountain peak were only existences at the venerable realm.<br/><br/>They were completely no match for the evil invaders.<br/><br/>The thousands of evil invaders were either flying or galloping.<br/><br/>Human after human were grabbed by them and directly swallowed.<br/><br/>There were also several hundred thousand creatures that were sucked into his mouth with his powerful magic power and flapping of his wings.<br/><br/>Disaster.<br/><br/>A terrifying disaster.<br/><br/>At this moment, life was like an ant in front of them!<br/><br/>“Hahaha, hahaha, it’s been a long time since I had such a good meal, Haha! ”<br/><br/>“Roar Roar, I can have a good meal today! ”<br/><br/>Excited roars came from there, causing Wang Xian to squint his eyes slightly.<br/><br/>This was the tragedy of the weak universe.<br/><br/>The arrival of the Apocalypse was like hell to them! At this moment, they were even worse than ants.<br/><br/>“Lord Dragon King! ”<br/><br/>As Wang Xian got closer, huming mountain also saw the scene in front of him. He frowned slightly.<br/><br/>In the nine-origin universe, although the various races would erupt into fights, there was no such thing.<br/><br/>However, such a bloody and cruel scene like this had never happened before.<br/><br/>It was extremely cruel to completely eat other creatures alive.<br/><br/>“Whoosh! ”<br/><br/>Wang Xian’s body trembled and instantly appeared in the sky above the mountain!<br/><br/>He waved his hand and thousands of dragon claws went straight for those evil demons!<br/><br/>“PFFT PFFT PFFT!”<br/><br/>In an instant, all the evil demons were pierced through by the dragon claws!<br/><br/>Wang Xian kept their corpses and continued to fly forward.<br/><br/>Since he could make a move, Wang Xian would naturally not sit idly by.<br/><br/>Such evil and wicked people deserved to die!<br/><br/>He continued to fly forward.<br/><br/>Not long after, he came across a mountain peak that was filled with the smell of blood.<br/><br/>At this moment, the mountain peak was in a state of destruction. Blood was everywhere.<br/><br/>The entire mountain peak had lost all signs of life.<br/><br/>It was possible that the billions of living beings had all been killed!<br/><br/>Wang Xian sighed in his heart.<br/><br/>Even though Wang Xian had wiped out a large number of factions along the way, he still felt extremely cruel when he saw this scene.<br/><br/>What crime did these ordinary living beings commit?<br/><br/>As he flew towards the center of the mountain range and universe, Wang Xian saw at least dozens of mountains that had been completely wiped out.<br/><br/>These mountains contained countless vengeful souls!<br/><br/>“Dragon King, we are almost at the center! ”<br/><br/>After flying for a few years, huming mountain looked around and reported to Wang Xian!<br/><br/>Wang Xian nodded his head. At this moment, he had completely focused his mind.<br/><br/>Waves of energy covered him and huming mountain!<br/><br/>Wang Xian’s body was concealed, causing his body to be placed in a spatial crack.<br/><br/>This kind of concealment ability could only be discovered by powerhouses in the Heaven’s origin manifestation stage.<br/><br/>However, with Wang Xian’s strength, he had already discovered the other party long before ordinary powerhouses in the Heaven’s origin realm discovered him!<br/><br/>Wang Xian came to the center mainly to investigate the current situation.<br/><br/>Hiding in the void, Wang Xian approached little by little.<br/><br/>“Boom Boom Boom! ”<br/><br/>Not long after, Wang Xian sensed a strong energy fluctuation coming over.<br/><br/>He hesitated for a moment before flying over immediately.<br/><br/>Not long after, a huge treasure that resembled a bird’s nest was suspended in the starry sky.<br/><br/>This treasure that resembled a bird’s nest emitted a terrifying aura.<br/><br/>Even an expert at the peak of the ruler realm would retreat when they came into contact with it.<br/><br/>This was a powerful weapon of war.<br/><br/>The entire bird’s nest was the size of more than ten planets. One could see the evil demons flying around on it.<br/><br/>One could also see a large number of evil demons entering and leaving the nest.<br/><br/>In this bird nest, Wang Xian could sense four to five auras at the peak of the Universe Overlord realm.<br/><br/>Wang Xian looked at this huge bird nest and his eyes flickered slightly.<br/><br/>There were no existences at the Heaven’s origin level in it.<br/><br/>He moved his body and kept the humming tiger mountain into the mother nest. Then, he flew directly toward the bird nest.<br/><br/>He concealed his aura to the extreme. Wang Xian came to the interior of the mother nest. According to his senses, he came to the place of a demon at the peak of the Universe Overlord realm.<br/><br/>Soul Catcher!”<br/><br/>Wang Xian stood in front of him and activated his soul catcher power.<br/><br/>Waves of information entered his mind directly.<br/><br/>After that, Wang Xian left directly.<br/><br/>The demon who was at the peak of the Dominator realm suddenly shook his head and revealed a puzzled expression.<br/><br/>However, from the beginning to the end, he didn’t know that his memories had been read unknowingly!<br/><br/>Wang Xian went to the other few demonic beasts at the peak of the ruler realm to read their information.<br/><br/>A large amount of information entered his mind. Wang Xian had a detailed understanding of the universe that invaded the mountain range universe.<br/><br/>At the same time, he also had some understanding of their strength.<br/><br/>According to their memories, there were seven powerhouses at the Heaven origin creation realm, two at the control level, and the rest were at the beginner level.<br/><br/>Other than that, there were also the powerhouses of their entire universe.<br/><br/>More than a million evil demons in the ruler realm.<br/><br/>Countless venerables and celestial emperors.<br/><br/>They invaded the mountain range universe and arrived here in just 20 years..\t\t\t\t\t\t</div>", "images": {}, "success": true}