{"id": 1252, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074734.html", "title": "Chapter 4255 - Chapter 4255: 4254 Fought For The Third Time. The Price! Go", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4255 - Chapter 4255: 4254 Fought For The Third Time. The Price! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4255: 4254 fought for the third time. The price! Go<br/><br/>Translator: 549690339<br/><br/>The four kings of the gods who believed in the universe spent more than a billion years on the layout of the starry universe.<br/><br/>In addition, they paid a great price!<br/><br/>After being destroyed by the Dragon King, they were naturally very unwilling!<br/><br/>Although they couldn’t fight the Dragon King or the nine-origin universe, they wouldn’t let the Dragon Palace Dragon King have it easy either.<br/><br/>After talking for a while, the four of them immediately flew to a place.<br/><br/>They had already received detailed information through their spies in the universe.<br/><br/>It was still the Dragon King and his group.<br/><br/>The four kings of the gods who believed in the universe had already thoroughly understood the strength of the Dragon King and his group!<br/><br/>With their strength, although they weren’t a match for the Dragon King and his group, it was completely impossible for the Dragon King to kill them.<br/><br/>“The last time the Dragon King chased us away, he might have used a special tracking method to chase after the Qianjiang Beast Emperor. This time, we can’t make him use the same method. We’ll go over directly and attack the Centipede Beast Emperor first, making him escape!”<br/><br/>“We’ll use this method to make him leave quickly, and then we’ll Pester the Dragon King for some time!”<br/><br/>The four kings of the gods who believed in the universe were discussing and making decisions!<br/><br/>What happened last time couldn’t happen again!<br/><br/>This time, they had to completely ruin the Dragon King’s plan!<br/><br/>After they finished discussing, they moved and sped up!<br/><br/>A few months later, they caught up with Beast Emperor Gong Wu from the side.<br/><br/>“Do it!”<br/><br/>The four kings of the gods who believed in the universe looked at each other without any hesitation.<br/><br/>They knew the position of the Dragon King at the back.<br/><br/>If they made a move, the Dragon King of the Dragon Palace and the others would rush over as well.<br/><br/>The four of them immediately made their move. A terrifying energy covered the whole area of the Centipede Beast Emperor!<br/><br/>The terrifying energy caused the centipede beast emperor to be slightly shocked. A hint of fear and fear appeared on his face.<br/><br/>The Centipede Beast Emperor could sense that he was no match for them at all!<br/><br/>“Huh?”<br/><br/>At the same time, when they started, Wang Xian could also sense them from the back.<br/><br/>He could sense that the four kings of the gods were about to attack Beast Emperor Centipede Wu.<br/><br/>This made Wang Xian frown. He immediately increased his speed and a cold look appeared in his eyes.<br/><br/>“Huh?”<br/><br/>Hundun Tianci and the rest could sense it. Their eyes focused as they flew over.<br/><br/>A dozen seconds later, when Wang Xian flew over, he immediately saw that Beast King Wu was under a huge attack. He was resisting and speeding up his escape!<br/><br/>“I want to leave the power of wind and thunder on him!”<br/><br/>Wang Xian’s expression changed slightly. His eyes focused as he shouted at TIANCI, “Tianci, summon the god striking branch. I want to use it!”<br/><br/>“Yes, Foster Father!”<br/><br/>Tianci replied immediately. The god-slaying branch instantly landed in Wang Xian’s hands.<br/><br/>The Ultimate Treasure of Tianyuan in Tianci’s body contained the energy of the ancestral tree as it was nurtured by the ancestral tree in the beginning.<br/><br/>The god-slaying branch did not reject Wang Xian’s energy!<br/><br/>After all, they were all acquaintances.<br/><br/>Buzz<br/><br/>The power of wind and thunder was infused into the god-slaying branch. Wang Xian waved it and attacked the centipede King!<br/><br/>The god-slaying branch could ignore the distance of space. If Wang Xian flew over, he would waste a lot of time.<br/><br/>Therefore, he borrowed the power of the heaven-bestowed Ultimate Treasure of the Heaven’s origin!<br/><br/>“Bang!”<br/><br/>A gigantic branch appeared in the sky above the Centipede Beast Emperor in an instant. It contained a terrifying power of wind and thunder!<br/><br/>It landed on his body like a lightning punishment!<br/><br/>“Roar Roar Roar!”<br/><br/>In an instant, a huge wound was left on his body. The Centipede Beast Emperor let out a miserable cry.<br/><br/>Wang Xian heaved a sigh of relief.<br/><br/>If the Centipede Beast Emperor had escaped before he was strong enough to make a move, it would have been even more difficult for him to capture and kill him!<br/><br/>“The Dragon King Is Here!”<br/><br/>“He has made his move. Chase the Centipede Beast Emperor Away First!”<br/><br/>When the four kings of gods saw this, their expressions changed slightly as they shouted loudly!<br/><br/>“Roar! Roar! Roar!”<br/><br/>There was no need for the four kings of gods to say anything. At this moment, when Centipede Beast Emperor saw Wang Xian, he could feel the intense pain in his body. His face revealed a fearful expression.<br/><br/>His body began to curl up slowly. Following that, a black hole appeared and he instantly entered the black hole.<br/><br/>The four kings of the gods didn’t do anything to stop him when they saw this scene!<br/><br/>“You’re courting death!”<br/><br/>Wang Xian looked at him and shouted coldly. He attacked them directly!<br/><br/>“Stop the Dragon King for a few days!”<br/><br/>The four kings of the gods sneered. They stood together and prepared to fight.<br/><br/>With their strength, it was easy for them to stall the Dragon King of the Dragon Palace for a few days!<br/><br/>By then, Beast Emperor Wu would have long disappeared without a trace!<br/><br/>Although Beast Emperor Wu was slightly injured, these injuries were not too severe for him.<br/><br/>He would recover very quickly!<br/><br/>“Divine chaos, lock onto two!”<br/><br/>When Wang Xian saw that they actually wanted to fight him, he sneered in his heart. With a wave of his arm, the Five Elements Millstone flew into divine chaos’s hand!<br/><br/>He shouted at them!<br/><br/>“It’s foster father!”<br/><br/>“It’s the Dragon King!”<br/><br/>Tianci shouted and charged toward a king of Pantheon who had just entered the control level!<br/><br/>“You guys deal with those two guys. Leave the Dragon King of the Dragon Palace to us!”<br/><br/>The king of Pantheon in the middle said to the two king of Pantheon on the right. Then, he looked at the king of Pantheon on his left!<br/><br/>“We can’t pull apart the distance. We have to attack and defend together. Otherwise, we will be broken one by one.”<br/><br/>The king of Pantheon continued!<br/><br/>“I know. With the two of us working together, the Dragon King can forget about defeating US quickly!”<br/><br/>The king of Pantheon on the left said confidently!<br/><br/>They had fought with the Dragon King of the Dragon Palace not long ago, so they were confident.<br/><br/>The last time, they were able to hold on for such a long time even when they were separated.<br/><br/>This time, they had learned their lesson from the last time. The two of them advanced and retreated together. They had no problem against the Dragon King of the Dragon Palace for tens of thousands of years!<br/><br/>“Charge!”<br/><br/>They let out a low roar at the same time and charged at Wang Xian!<br/><br/>“You’re courting death!”<br/><br/>When Wang Xian saw them charging at him, a cold expression appeared on his face.<br/><br/>He did not use the body of the void divine dragon, the Taiji Dragon disc, or the power of the ancestral tree.<br/><br/>All these powers were hidden in his body!<br/><br/>He let out a low growl and transformed into the body of the Divine Dragon. An illusory dragon claw attacked them!<br/><br/>Boom! Boom! Boom<br/><br/>In the next moment, a violent rumbling sound was heard.<br/><br/>It came from Wang Xian, Hun Dun, and Tianci respectively!<br/><br/>The collision began!<br/><br/>The battle began!<br/><br/>The two king of Pantheon who were at the control level collided with Wang Xian. Their bodies flew backward for some distance.<br/><br/>However, their eyes were glowing and filled with fighting spirit!<br/><br/>“Dragon King of the Dragon Palace, you have ruined the good deed of our belief in the universe. We will not let you have your way even if we believe in the universe. Humph, there is cause and effect. This is the price you have to pay!”<br/><br/>A king of the gods said to Wang Xian with a cold face!\t\t\t\t\t\t</div>", "images": {}, "success": true}