{"id": 1258, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074758.html", "title": "Chapter 4261 - Chapter 4261: 4260 Phoenix Emperor’S Revenge", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4261 - Chapter 4261: 4260 Phoenix Emperor’S Revenge</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4261: 4260 Phoenix Emperor’s revenge<br/><br/>Translator: 549690339<br/><br/>“Your Majesty, according to my investigation, a Dragon Palace Dragon King has appeared in the nine-origin universe. His strength has already reached the Great Dao level. Compared to the previous universe, he is indeed much stronger. If we continue to fight with them, the situation might be similar to the previous calamity!”<br/><br/>In the central hall of the Void Dynasty.<br/><br/>After the golden-armored middle-aged man finished speaking, another old man with a fan in his hand reported to the emperor of the Void dynasty with a solemn expression!<br/><br/>Compared to the previous calamity, the strength of their void universe had indeed improved greatly.<br/><br/>However, the improvement of the nine-origin universe this time was even greater.<br/><br/>Especially the rise of the Dragon King, which added another great dao existence to the nine-origin universe.<br/><br/>This was very bad news for the Void Universe!<br/><br/>“The universe’s AI is extremely useful to the Void dynasty. If we can obtain the universe’s AI, our void universe can give birth to even more heaven origin creation realm powerhouses.”<br/><br/>The Void Dynasty’s king coldly said, “If there’s a chance, then we can’t Give Up!”<br/><br/>“Your Majesty, this Emperor of the Phoenix clearly wants their 9 origin universe to suffer heavy losses. For him to be able to return there, he is trustworthy and useful to us. That Dragon King harmed a few of our warriors in the 6 paths universe, we must take revenge!”<br/><br/>The Void Universe Country Duke Xining said!<br/><br/>His entire body was filled with killing intent.<br/><br/>In the six paths universe, they had been harmed terribly by the Dragon Palace Dragon King.<br/><br/>They had wasted a large amount of treasures.<br/><br/>“Right now, there are two great dao level existences in the 9 origin universe. If we attack them head on, we won’t be able to obtain the universe ai. The Emperor of the Phoenix has the confidence to sneak in, we can carry out a surprise attack.”<br/><br/>“The Universe AI is located at the saint’s side. If this is an attack, I suggest that all of our experts move out. We will go to the other peak races and tie down their heavenly yuan creation realm experts.”<br/><br/>“Your Majesty, go to the saintly line to investigate, bring the universe treasure over!”<br/><br/>The middle-aged man in Golden Armor suggested!<br/><br/>“Yes, we can’t wait any longer. The 9-essences universe isn’t weak. Right now, they can have one dao-level leader and another leading his disciples to other universes to break through. In the future, their strength will become stronger and stronger, and the chances of them obtaining the universe’s AI will become smaller and smaller.”<br/><br/>“The arrival of the Emperor of the Phoenix is indeed a good opportunity for us. Let’s discuss and take action!”<br/><br/>The emperor of the Void Dynasty thought for a moment before finally making a decision!<br/><br/>“I’m willing to fight for Your Majesty everywhere!”<br/><br/>“I’m willing to fight for Your Majesty everywhere!”<br/><br/>After the emperor of the Void dynasty made his decision, numerous heavenly yuan creation realm experts stood up and shouted respectfully!<br/><br/>The Void dynasty, the only king.<br/><br/>The most ambitious existence.<br/><br/>One sentence from him could decide the life and death of the entire universe!<br/><br/>The power of the Void Universe was also an existence that no one dared to provoke.<br/><br/>In addition to the special and powerful nature of the space attribute, no one dared to provoke them in the surrounding universes!<br/><br/>The situation in the Void Universe.<br/><br/>The Revenge of the Emperor of the Phoenix.<br/><br/>No one knew about the nine-origin universe!<br/><br/>At this moment, the nine-origin universe was still thriving.<br/><br/>The arrival of the Apocalypse did not bring any changes to the nine-origin universe.<br/><br/>The group of Heaven origin creation powerhouses in the nine-origin universe were also wandering around the universe, looking for some information.<br/><br/>Wang Xian was located at the tree of chaos. Together with the body of the Void Divine Dragon, he was comprehending the power of space and trying to improve his strength.<br/><br/>However, the improvement of the body of the Void Divine Dragon did not last long.<br/><br/>If he wanted to improve further, he might need some time.<br/><br/>Even if he had the heart of faith at the control level and the corpse of the space behemoth at the control level!<br/><br/>However, Wang Xian was not in a hurry.<br/><br/>Time passed by little by little.<br/><br/>Buzz<br/><br/>On this day, on the heaven-splitting chaotic land in the nine-origin universe!<br/><br/>A bird-type expert at the venerable realm was flying in the sky.<br/><br/>Suddenly, his body trembled, and his eyes emitted a terrifying flame radiance!<br/><br/>The Aura on his body also underwent an earth-shaking change!<br/><br/>He stopped in the void, and his eyes were filled with killing intent!<br/><br/>“Nine-origin universe, I, Feng Qing Lou, can come and go as I please. Dragon Palace Dragon King, you destroyed my Phoenix clan and chased me away. Shadow Devil Emperor, you guys didn’t even stop me. HMPH, I’ll make you pay a terrible price!”<br/><br/>“You will regret it!”<br/><br/>As he spoke, his face was filled with coldness!<br/><br/>His body moved and immediately flew in a direction.<br/><br/>He was once the emperor of the Phoenix clan and was a powerful heaven origin creation realm expert in the nine-origin universe.<br/><br/>As a veteran heaven origin creation realm expert, he naturally had powerful abilities.<br/><br/>This time, he used the power of his bloodline and instantly returned to the nine-origin universe without anyone noticing!<br/><br/>This demonic bird had the bloodline of the Phoenix. The emperor of the Phoenix could use the power of his bloodline to descend on his body at any time!<br/><br/>The emperor of the Phoenix controlled this body and flew in the nine-origin universe.<br/><br/>He was the first to arrive at the territory of the saint lineage and made some arrangements!<br/><br/>Then, he came to the surroundings of the Dragon Palace and the demon race and made some arrangements!<br/><br/>He wanted to bring the powerful enemies of the Void universe over.<br/><br/>Although he knew that the target of the Void Universe was the universe AI and would not fight to the death with the Heavenly Yuan creation realm powerhouses of the nine-origin universe.<br/><br/>However, as long as the powerhouses of the Void universe came over, there would definitely be a war.<br/><br/>There would definitely be bloodshed!<br/><br/>Even if he could not resurrect him completely, as long as he saw the nine-origin universe pay the price, the emperor of the Phoenix would be happy in his heart!<br/><br/>In addition, he understood the Dragon King of the Dragon Palace.<br/><br/>The Dragon King of the Dragon Palace was a person who would seek revenge.<br/><br/>This time, the Dragon King of the Dragon Palace was very likely to take revenge for the invasion of the void space.<br/><br/>He wanted the Dragon King of the Dragon Palace to fight to the death with the void space.<br/><br/>He hoped that the nine-origin universe and the void space would fight to the death.<br/><br/>It would be best if a heavenly yuan creator fell.<br/><br/>Only then would he have a chance to return to the nine-origin universe.<br/><br/>After all, he was a creature from the nine-origin universe.<br/><br/>During the calamity, he could ignore it, but once the calamity ended, he couldn’t just wander aimlessly in the chaos?<br/><br/>He couldn’t possibly not have a place to return to?<br/><br/>The nine-origin universe was his root after all.<br/><br/>He still wanted to return!<br/><br/>After using more than ten years, the Emperor of Phoenix finished setting up all of this.<br/><br/>Then, he flew to the location of the Dragon Palace, and a ghastly expression appeared on his face.<br/><br/>“Dragon Palace, Dragon King, just you wait. This is just the beginning!”<br/><br/>He said with a grim expression. Then, he took out a treasure and sent a message.<br/><br/>After sending the message, he waited quietly. Then, he stared at the Divine Dragon Island with a pair of sharp eyes full of killing intent.<br/><br/>He stared at the location of the Dragon Palace!\t\t\t\t\t\t</div>", "images": {}, "success": true}