{"id": 1257, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074754.html", "title": "Chapter 4260 - Chapter 4260: 4259 Phoenix Emperor’S Revenge", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4260 - Chapter 4260: 4259 Phoenix Emperor’S Revenge</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4260: 4259 Phoenix Emperor’s revenge<br/><br/>Translator: 549690339<br/><br/>This time, the operation ended successfully.<br/><br/>Tianci also excitedly returned to the sword and Magic Universe.<br/><br/>This time, his gains were not small.<br/><br/>Half of the corpse of a control level heavenly fate expert, and one-fifth of the corpse of a control level space beast.<br/><br/>These resources were enough to allow him to make a significant improvement!<br/><br/>After all, his strength was only at the beginner level. He had just stepped into the Heavenly Yuan creator’s realm not too long ago.<br/><br/>Wang Xian’s operation this time had also ended satisfactorily.<br/><br/>This time, it could be said to be a huge harvest!<br/><br/>Xiao Lan’s breakthrough had also added another powerhouse in the Heavenly Yuan Creator’s realm to the Dragon Palace.<br/><br/>Overall, there were three of them.<br/><br/>The harvest this time was the corpse of the king of Pantheon. Wang Xian was prepared to use it for himself.<br/><br/>He would let the body of the void divine dragon absorb it to see if he could increase his strength.<br/><br/>After returning to the Dragon Palace, Wang Xian immediately let the body of the Void Divine Dragon absorb the heart of faith and the flesh and blood energy of the king of beasts Wu for cultivation.<br/><br/>While Wang Xian was cultivating.<br/><br/>At the belief universe, the few kings of gods sat in their respective halls with ugly expressions!<br/><br/>“Damn that Saint Tianyang. If he hadn’t escaped, I wouldn’t have been killed. He caused me to lose a powerful resurrection treasure. Damn that fellow!”<br/><br/>In one of the halls, the king of the gods who had been killed by Wang Xian sat on his throne with an ugly expression. He growled in a low voice with a cold expression!<br/><br/>This time, the loss was too great for him!<br/><br/>“Half of my body has been cut off. If I knew this earlier, I wouldn’t have been stingy with the treasures for escaping. The Dragon Palace Dragon King from the nine-origin universe is too powerful. Now that Jiuhua God has been killed and Saint Tianyang has escaped, it will be difficult for us to work together in the future.”<br/><br/>In another part of the belief universe, a king of the gods muttered with a gloomy face.<br/><br/>The Dragon King of the Dragon Palace was far more powerful than they had expected,<br/><br/>after suffering heavy losses this time, they didn’t dare to be enemies with the Dragon King of the Dragon Palace.<br/><br/>Most importantly, there was already a gap between them.<br/><br/>Especially between Jiuhua God and Shengtian Yang and the others.<br/><br/>It would be difficult for them to work together like this in the future!<br/><br/>“The starry universe is giving up!”<br/><br/>As he spoke, there was a hint of unwillingness on his face, but he was also extremely helpless.<br/><br/>The Dragon King’s strength was too terrifying!<br/><br/>The belief universe had already given up on the confrontation with Wang Xian!<br/><br/>However, in another universe in the chaos.<br/><br/>An incomparably huge palace was suspended in the void.<br/><br/>The entire palace was incomparably huge and vast!<br/><br/>The entire palace was constructed from Space God stones that contained powerful energy.<br/><br/>Within the palace, there were all sorts of extremely powerful god trees planted.<br/><br/>The large number of God trees emitted an incomparably profound spatial energy!<br/><br/>At the back of the palace, there was a circular disc suspended above.<br/><br/>At a glance, the entire circular disc was as dazzling as a powerful universe!<br/><br/>This was no ordinary treasure.<br/><br/>This was a heavenly fate treasure!<br/><br/>Divine trees and divine trees were common here!<br/><br/>All sorts of extremely powerful divine stones and treasures were piled up into walls and floors.<br/><br/>On the tall pillars, there were treasures and energy that could drive a ruler realm expert crazy.<br/><br/>At the entrance of the hall, over 1,000 ruler realm experts and above stood quietly on both sides.<br/><br/>On each side, there was a ruler at the peak of the ruler realm.<br/><br/>At the top, there was a card face that contained a powerful pressure.<br/><br/>The card face was emitting a wave of energy, enveloping the surrounding void.<br/><br/>The words ‘Void Dynasty’were written on it!<br/><br/>This was the center of the Void Universe, the Palace of the Void Dynasty!<br/><br/>A universe that was completely unified, and a universe that belonged to a dynasty.<br/><br/>One could imagine how powerful this force would be.<br/><br/>This was the Void dynasty!<br/><br/>At this moment, in a hall at the center of the Void Dynasty!<br/><br/>In this circular hall, there were twelve enormous seats in front of them!<br/><br/>Especially the seat in the center was even larger. Above the seat, the disk of the Heavenly Yuan Creation Treasure’s image was reflected.<br/><br/>At this moment, there were 12 figures sitting on each of the 12 seats.<br/><br/>With the final throne as the center.<br/><br/>That throne was the throne of the Void Dynasty, the founder of the Void Dynasty!<br/><br/>At this moment, there was an old man sitting there.<br/><br/>The old man was tall and sturdy. He had white pupils and a pair of special wings that were as thin as cicada wings on his back.<br/><br/>At this moment, his gaze was fixed on the seat in front of him.<br/><br/>On his other eleven thrones, there were eleven figures.<br/><br/>The information from the nine origin universe was wrong.<br/><br/>No, it should be said that after the last calamity, the strength of the Void universe had increased tremendously.<br/><br/>Their heavenly Yuan blessed realm experts had increased again.<br/><br/>There were twelve of them.<br/><br/>In front of the thrones, there was a figure standing.<br/><br/>It was a figure with a powerful fire attribute energy.<br/><br/>“How interesting. Emperor of Phoenix, Can We Trust Your Words?”<br/><br/>A middle-aged man in golden armor stood beside the central throne. He stared at the figure and asked indifferently!<br/><br/>“You’ll know whether my words are true or not after you go to the 9-origin universe to check.”<br/><br/>Emperor of Phoenix replied in a low voice, “I don’t need to lie to you. The reason why I’m willing to cooperate with you will be known after you check.”<br/><br/>“Do you have the confidence to bring us into the 9-origin universe?”<br/><br/>The golden-armored void space great being continued to ask him.<br/><br/>“I have the confidence to enter the 9-origin universe without making a sound. As for whether or not I can teleport you here, that will depend on whether or not you have any teleportation treasures. However, your void space empire must have many such teleportation treasures!”<br/><br/>The Emperor of Phoenix replied!<br/><br/>“If you cooperate with us, what will our void Space Empire have to pay?”<br/><br/>The void space great being in golden armor continued to ask.<br/><br/>“Nothing!”<br/><br/>The Emperor of Phoenix’s face was gloomy, and a trace of killing intent flashed in his eyes. “I now hope that those fellows in the 9-origin universe can be exterminated, and all of them can be exterminated!”<br/><br/>“Hehe, I will consider your cooperation with me. Men, bring the Emperor of Phoenix to rest for a while.”<br/><br/>On the throne in the center, the burly void King with wings spoke slowly as he looked at the Emperor of Phoenix. “I will give you an answer within a day!”<br/><br/>“Alright, Void King, you can seize this opportunity. The current nine-origin universe is much stronger than the previous calamity. I believe that your void universe has already investigated this point.”<br/><br/>The emperor of the Phoenix nodded. His gaze swept across the Heavenly Yuan creation realm experts in the Void universe before he turned around and left with the Void Dynasty’s experts!<br/><br/>“Your Majesty, the Emperor of the Phoenix was killed by the Dragon Palace’s Dragon King. He was abandoned by the Heavenly Yuan creation realm experts in the nine-origin universe and his race was exterminated. His words are still very credible!”<br/><br/>After the emperor of the Phoenix left, the golden-armored middle-aged man looked at his disappearing figure and spoke!\t\t\t\t\t\t</div>", "images": {}, "success": true}