{"id": 1250, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074726.html", "title": "Chapter 4253 - Chapter 4253: 4252 Hunted The Space Beast Once Again", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4253 - Chapter 4253: 4252 Hunted The Space Beast Once Again</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4253: 4252 hunted the space beast once again<br/><br/>Translator: 549690339<br/><br/>The breakthrough this time made Wang Xian very happy!<br/><br/>For the next period of time, Wang Xian continued to stay in the Dragon Palace.<br/><br/>The nine-origin universe was still very stable.<br/><br/>Overall, the nine-origin universe was still somewhat famous in the nearby universe.<br/><br/>Everyone knew that the nine-origin universe had existences on the level of the Great Dao.<br/><br/>Some Great Dao disciples didn’t dare to come and seek death.<br/><br/>As for invading the 9-origin universe?<br/><br/>That was even more impossible!<br/><br/>A universe with a Great Dao presence wouldn’t be in too much danger during the calamity.<br/><br/>The only enemy of the 9-origin universe was the Void Universe!<br/><br/>The Void Universe didn’t dare to enter the 9-origin universe rashly.<br/><br/>The twelve ancestral warlocks were currently investigating the situation in the Void universe, but there was no news at the moment!<br/><br/>Hundreds of millions of years passed by quickly once again!<br/><br/>And on this day, Wang Xian received a piece of good news!<br/><br/>On Xiao Lan’s side, she had already touched the bottleneck of breaking through.<br/><br/>At the moment, she was just one spot away from breaking through!<br/><br/>Xiao Lan herself had already reached the realm of the ruler of the universe. After absorbing the corpse of a Heaven Origin Cosmic Beast, she was also on the verge of breaking through.<br/><br/>However, although Xiao Lan had reached this stage, she still needed a quota.<br/><br/>When he was in the justice universe, Wang Xian checked the information on the Heaven’s origin communication device that was similar to the starry universe. However, he didn’t get any information.<br/><br/>The Cosmic Beast was known as the evil behemoth in the Justice Sequence Camp!<br/><br/>This behemoth was similar to the Chaos Behemoth. There was no record of the universe that gave birth to this behemoth in the Justice Universe.<br/><br/>It was possible that there would be an existence similar to the starry universe in the evil sequence camp.<br/><br/>There would be a place that would allow Xiao Lan and the others to break through!<br/><br/>Since there was a lack of spots, Wang Xian had no choice but to wait.<br/><br/>During this period of 100 million years, there were also galactic beasts that left the starry universe.<br/><br/>However, there was indeed a galactic beast of the Great Dao level that left the starry universe.<br/><br/>When Wang Xian received the news of chaos, he completely ignored it.<br/><br/>A Cosmic Beast of the Great Dao level was not something that they could kill.<br/><br/>Even if they called all the experts that Wang Xian could summon, it would still be difficult to kill it!<br/><br/>However, a few million years later, another piece of news came from chaos.<br/><br/>This time, it was good news!<br/><br/>There was another space beast flying out from the starry universe.<br/><br/>This space beast seemed to be at the control level. As for whether it had achieved it, Hun Dun could not be sure!<br/><br/>However, according to Hun Dun’s guess, even if it had the strength of a control level, it was the type that had just stepped into the realm!<br/><br/>After Wang Xian received this news, his eyes immediately lit up!<br/><br/>It was not impossible to kill a space beast that had just stepped into the control level.<br/><br/>With Wang Xian’s current strength breakthrough, if he were to call for TIANCI, they would be able to match up to two existences at the Great Dao level.<br/><br/>Not to mention the addition of Chaos!<br/><br/>In short, with Wang Xian’s current strength, he was confident that he could completely kill a space beast at the control level!<br/><br/>“I’ll go over immediately!”<br/><br/>Wang Xian didn’t hesitate at all. He ordered an lie to bring it to Hun Dun.<br/><br/>At the same time, he asked an lie to contact a heavenly bestowal to get him ready!<br/><br/>“Dragon King!”<br/><br/>When Wang Xian appeared, Hun Dun shouted at Wang Xian respectfully!<br/><br/>“Okay!”<br/><br/>Wang Xian nodded and looked at him with a twinkle in his eyes. “Where is the Space Beast Now?”<br/><br/>“Dragon King, that space beast still needs about five years before it can fly out of the space beast. We call this Space Beast King Centipede. We can’t be too sure about its actual strength!”<br/><br/>Hun Dun replied to Wang Xian!<br/><br/>Wang Xian nodded his head and looked around.<br/><br/>Not far away, Xiao Lan was floating in the void.<br/><br/>“Dragon King!”<br/><br/>When he saw Wang Xian’s gaze, he immediately flew over and greeted him respectfully!<br/><br/>“Xiao Lan, how is it?”<br/><br/>Wang Xian looked at him with a smile.<br/><br/>“Dragon King, as long as there’s a spot, you can make a breakthrough immediately!”<br/><br/>Xiao Lan replied!<br/><br/>“Alright, Summon Qingyue over first. This time, prepare yourself and try your best to make a breakthrough!”<br/><br/>Wang Xian said to him.<br/><br/>All along, as long as Xiao Lan achieved a breakthrough, Lan Qingyue would also achieve a breakthrough.<br/><br/>If nothing went wrong, as long as Xiao Lan could reach the Heaven’s origin destiny realm, Lan Qingyue should be able to reach this realm directly!<br/><br/>However, Wang Xian wasn’t sure. This was because there was only one spot in the starry universe for a breakthrough!<br/><br/>It was hard to say if Lan Qingyue could make a breakthrough as well!<br/><br/>It was also possible that Lan Qingyue and Xiao Lan’s special cultivation system allowed them to make a breakthrough at the same time.<br/><br/>All of these were possible!<br/><br/>“It’s the Dragon King!”<br/><br/>Xiao Lan nodded and immediately contacted Lan Qingyue.<br/><br/>Buzz<br/><br/>Not long after, Lan Qingyue’s figure appeared.<br/><br/>“Xiao Xian!”<br/><br/>When Lan Qingyue saw Wang Xian, she immediately shouted with a smile!<br/><br/>“Yes!”<br/><br/>Wang Xian smiled and nodded at her. “There’s a chance for Xiao Lan to make a breakthrough. However, it’s not certain if you will also improve when the time comes!”<br/><br/>“My current strength is also at the peak of the Overlord realm. However, I have yet to touch the shackle of a breakthrough. As for whether I can make a breakthrough, I don’t know either.”<br/><br/>Lan Qingyue said.<br/><br/>The ancient god who fed the Kun master in the past had not reached this stage. Therefore, Lan Qingyue was not sure if she could make a breakthrough together with Xiao Lan!<br/><br/>“I hope I can make a breakthrough!”<br/><br/>Wang Xian nodded his head!<br/><br/>Buzz<br/><br/>“Foster father, foster mother!”<br/><br/>At this moment, an lie came with Tian Ci.<br/><br/>When Tian Ci saw Wang Xian and Lan qingyue, he immediately shouted!<br/><br/>“Tian Ci is here!”<br/><br/>Lan qingyue smiled and nodded at him.<br/><br/>“Foster father, it’s me!”<br/><br/>Tianci smiled and looked at Wang Xian. “Foster father, are you going to continue hunting the Space Beast?”<br/><br/>“Yes!”<br/><br/>Wang Xian nodded. “The space beast this time is much stronger than the previous two times. This time, we must kill it completely. Don’t let it escape!”<br/><br/>“Alright, Foster father. We will listen to your arrangements!”<br/><br/>Tianci nodded his head.<br/><br/>“Dragon King, if we make a move, we have to be careful of those experts who believe in the universe.”<br/><br/>Hun Dun reminded him from the side!<br/><br/>Wang Xian nodded his head. His eyes were sparkling.<br/><br/>“Indeed, we have to be careful. However, if they come this time, we will teach them a good lesson!”<br/><br/>A hint of killing intent flashed across Wang Xian’s eyes.<br/><br/>This time, if the powerhouses from the universe of faith came again, Wang Xian was prepared to kill one or two of them!<br/><br/>There were four powerhouses from the universe of faith. Three of them were at the control level and one was at the beginner level.<br/><br/>This person was very strong and was comparable to an existence at the Great Dao level!<br/><br/>However, being comparable was still comparable. Just like last time, if they could not work together perfectly, Wang Xian could defeat them one by one!<br/><br/>Tianci and Hun Dun could totally fight against one control-level and one beginner-level!<br/><br/>As for the remaining two control-level existences, the body of the Void Divine Dragon, the Five Elements Millstone, and the Tai Chi Dragon Disc could easily fight against one.<br/><br/>On the other hand, Wang Xian himself, with the blessing of the ancestral tree, could completely destroy a control-level existence.\t\t\t\t\t\t</div>", "images": {}, "success": true}