{"id": 1253, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074738.html", "title": "Chapter 4256 - Chapter 4256: 4255, The Third Exchange. The Price! Hit", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4256 - Chapter 4256: 4255, The Third Exchange. The Price! Hit</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4256: 4255, the third exchange. The price! hit<br/><br/>Translator: 549690339<br/><br/>“Hehe!”<br/><br/>When Wang Xian heard the king of all gods’words, he laughed. He stared at the two kings of all gods with disdain in his eyes. “To be my enemy, you are seeking your own death!”<br/><br/>As Wang Xian spoke, his figure flashed and closed the distance between them!<br/><br/>“Attack!”<br/><br/>When the two kings of all gods saw Wang Xian approaching them, their eyes focused and they shouted loudly!<br/><br/>The corners of Wang Xian’s mouth curled up slightly. His body trembled and the body of the Void Divine Dragon flew out from his body. The tai chi dragon disk surrounded him!<br/><br/>He attacked one of the kings of the gods directly!<br/><br/>At the same time, Wang Xian attacked the other king of the gods!<br/><br/>“Defend!”<br/><br/>The two kings of the gods felt that these two attacks were a little terrifying. They had completely surpassed the previous battle.<br/><br/>Their expressions changed slightly and they immediately shouted at the same time!<br/><br/>The two of them waved their arms and two gigantic palms slowly appeared around them.<br/><br/>One on the left and one on the right. The Palms of faith that were condensed from the power of faith enveloped them.<br/><br/>It protected them!<br/><br/>Wang Xian’s gaze focused. He extended his dragon claws and attacked the gigantic palms!<br/><br/>Boom<br/><br/>The attack of the Void Dragon body landed on the two gigantic palms first.<br/><br/>The powerful attack caused the palms to tremble violently and the power of faith dimmed a little.<br/><br/>However, it did not break through the defense of the palms.<br/><br/>However, in the next moment, Wang Xian’s Dragon Claw landed on the palms.<br/><br/>Bang<br/><br/>Following that, the already dim palms started to collapse rapidly!<br/><br/>A huge hole appeared!<br/><br/>“What? How is this possible?”<br/><br/>The expressions of the two kings of pantheon changed drastically when they saw this scene.<br/><br/>Although their strength was not comparable to the Great Dao realm, when they joined forces, the Great Dao realm would not be able to break through their combined defense.<br/><br/>It would not be so easy either!<br/><br/>However, the Dragon King’s Dragon Claw broke through their defense as easily as breaking a dried branch!<br/><br/>They were attacked directly!<br/><br/>This made the hearts of the two kings of Pantheon Sink!<br/><br/>Why was the Dragon King’s attack this time so terrifying?<br/><br/>Before they could react!<br/><br/>The void God Dragon Body carried the Tai Chi Dragon Disc as the Dragon King continued to attack them!<br/><br/>The void God Dragon Body, the Tai Chi Dragon Disc, was still locked onto one of the kings of Pantheon!<br/><br/>Wang Xian was attacking the other one!<br/><br/>“Defend!”<br/><br/>The two kings of the gods hurriedly retreated and tried to defend again!<br/><br/>However, this time, they did not join forces to defend.<br/><br/>Instead, they formed a powerful defense with the power of faith in front of them!<br/><br/>The Shadows of countless believers appeared behind them!<br/><br/>One by one, the believers were kneeling and kowtowing while mumbling piously.<br/><br/>“Bang!”<br/><br/>“Bang!”<br/><br/>The Void Dragon brought the Tai Chi Dragon Coil and landed on the attack of a king of gods. It was blocked.<br/><br/>However, at the side, Wang Xian’s dragon claw easily penetrated the defense of another king of gods!<br/><br/>“Roar!”<br/><br/>Wang Xian let out a low roar. A nine-colored light shot out from his mouth. The light instantly engulfed the king of gods!<br/><br/>“What? How is this possible?”<br/><br/>When the king of Pantheon saw this scene, a look of horror appeared on his face.<br/><br/>His body trembled and a beating heart condensed from the power of faith floated in front of him.<br/><br/>“Bang!”<br/><br/>The beating heart collapsed instantly under the nine-colored energy torrent.<br/><br/>However, after the collapse of the heart of faith, Wang Xian’s attack was blocked by a mysterious energy and dissipated completely!<br/><br/>In the illusion of the follower behind the king of Pantheon, a large number of followers collapsed instantly as if they were already dead!<br/><br/>This was because he had used a powerful life-saving item to block Wang Xian’s terrifying attack!<br/><br/>When Wang Xian saw this scene, his expression didn’t change. He swayed his huge body and stretched out his dragon head, flying towards him.<br/><br/>At the same time, a terrifying energy bloomed from the Dragon Horn.<br/><br/>An illusory dragon head appeared above the Dragon Horn!<br/><br/>“Oh no, help me. His strength is much stronger than the last time. Much Stronger!”<br/><br/>The king of Pantheon saw Wang Xian continuing to attack him.<br/><br/>Sensing the terrifying power that belonged to the Great Dao realm, he roared in horror!<br/><br/>How was this possible?<br/><br/>How long had it been?<br/><br/>How could the Dragon King’s strength have increased so much?<br/><br/>“This clone of his is only slightly weaker than me. I’m trapped by him and can’t get away for the time being!”<br/><br/>The king of Pantheon felt the situation of his teammate and was shocked.<br/><br/>He wanted to help, but he couldn’t!<br/><br/>The clone of the Dragon King in front of him was already very troublesome!<br/><br/>The clone of the Dragon King of the Dragon Palace possessed the strength of a master!<br/><br/>Although he thought that the clone of the Dragon King was not as strong as him, it was similarly impossible for him to suppress it in a short period of time!<br/><br/>“The strength of his main body is also at the Great Dao level. I’m no match for him at all!”<br/><br/>King of Pantheon, who was being attacked by Wang Xian, heard his teammate’s words. His heart trembled violently as he roared loudly!<br/><br/>At this moment, he could feel a strong suppressive force!<br/><br/>This suppressive force made him shudder!<br/><br/>It made him feel suffocated!<br/><br/>This Dragon King could kill him!<br/><br/>“No, no, run. We have to run. Otherwise, I will die here!”<br/><br/>He was horrified.<br/><br/>The speed at which this Dragon King of the Dragon Palace was improving was too terrifying!<br/><br/>After splitting his clone to fight against a control-level existence, he still had the ability to kill him?<br/><br/>One had to know that he was not an ordinary control-level expert.<br/><br/>After fighting against an ordinary control-level existence, he was still able to fight against two of the weakest beginner-level heavenly yuan creation-level experts.<br/><br/>However, even so, he still felt the threat of death.<br/><br/>This proved that the Dragon King was not the weakest in the Great Dao realm!<br/><br/>Flee!<br/><br/>He had to flee!<br/><br/>Buzz<br/><br/>His body trembled. Without any hesitation, he took out an escape treasure!<br/><br/>A strange, headless corpse with its arms spread out appeared in front of him.<br/><br/>The headless corpse was in the form of a hug as it hugged him!<br/><br/>Without any hesitation, he hugged the headless corpse and disappeared in an instant!<br/><br/>When Wang Xian saw him using his escape treasure, he did not try his best to stop it!<br/><br/>It was obviously unrealistic to keep the four kings of pantheon here today.<br/><br/>Now that one of them was the first to escape, he would let him escape.<br/><br/>After he escaped, the other king of Pantheon would have to face an even more terrifying attack!<br/><br/>“F * ck!”<br/><br/>At the side, the other king of Pantheon’s expression changed drastically when he saw his companion escaping instantly. He could not help but curse!<br/><br/>He gritted his teeth, wanting to take out a true treasure to escape!<br/><br/>“If he escapes, can I still let you escape?”<br/><br/>However, in the next second, a cold voice entered his ears, causing his body to stiffen!<br/><br/>“Water forbidden spell, Life Shock!”<br/><br/>The book of water forbidden spell floated above his head, and a powerful forbidden spell enveloped the king of Pantheon!\t\t\t\t\t\t</div>", "images": {}, "success": true}