{"id": 1251, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074730.html", "title": "Chapter 4254 - Chapter 4254: 4253 Hunted The Space Beast Once Again", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4254 - Chapter 4254: 4253 Hunted The Space Beast Once Again</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4254: 4253 hunted the space beast once again<br/><br/>Translator: 549690339<br/><br/>“Qingyue, wait for my news. Prepare to break through at any time. Heaven’s gift, chaos, let’s Go!”<br/><br/>Wang Xian instructed Lan Qingyue and the rest.<br/><br/>Then, he flew in the direction where Beast Emperor Centipede left.<br/><br/>“Dragon Palace, the Beast Emperor Centipede we hunted this time is different from the previous Beast Emperor Qian Jiang. Once we are disturbed, Beast Emperor Centipede can escape easily!”<br/><br/>Wang Xian and the rest were flying rapidly in the starry universe.<br/><br/>A few months later, they could feel the aura left behind by the Centipede Beast Emperor.<br/><br/>“Let’s Go!”Hun Dun said with a solemn face!<br/><br/>Tianci also looked at Wang Xian and nodded his head in agreement!<br/><br/>“My strength has achieved a breakthrough compared to before. When the time comes, Hun Dun, you will deal with a beginner-level heaven origin creator. Tianci, you will deal with a control-level powerhouse. Leave the rest to me. If they have two control-level powerhouses, I can keep one of them. If they dare to fight, I can keep all of them!”<br/><br/>Wang Xian spoke confidently!<br/><br/>“Foster father, have you achieved a breakthrough?”<br/><br/>Tianci’s eyes lit up as he asked with a burning gaze!<br/><br/>“Yes. Without any external help, I can match an existence at the level of the Great Dao.”<br/><br/>Wang Xian smiled and nodded.<br/><br/>“Congratulations, Dragon King!”<br/><br/>Hun Dun, who was at the side, was shocked.<br/><br/>When he first met Wang Xian, how strong was he?<br/><br/>He had not even reached the peak of the ruler realm.<br/><br/>However, he had already reached the Great Dao realm!<br/><br/>This was simply unbelievable!<br/><br/>The speed of his growth was too unrealistic!<br/><br/>How could he break through so quickly?<br/><br/>He took a look at the Dragon King and his mind was filled with thoughts!<br/><br/>A foster son who possessed the ultimate treasure of the Heaven’s origin and a subordinate of the Heaven’s origin.<br/><br/>If he succeeded this time, the Dragon Palace would have another heavenly yuan creation level powerhouse.<br/><br/>In that case, the Dragon Palace’s strength would be even more terrifying!<br/><br/>Maybe…<br/><br/>He had some thoughts.<br/><br/>It was good to enjoy the shade under the big tree!<br/><br/>Would the dragon palace allow him, Xiao Lan, and the others to unify the entire Starry Universe one day?<br/><br/>This was not impossible in Hun Dun’s eyes!<br/><br/>Although the starry beasts in the starry universe were powerful and terrifying, their lack of intelligence was a huge flaw.<br/><br/>Just like now, they could continuously hunt down the starry beasts.<br/><br/>This was impossible in other universes!<br/><br/>While Hun Dun was deep in thought, the figure of Beast Emperor Centipede appeared in Wang Xian’s line of sight!<br/><br/>Beast Emperor Centipede was somewhat like a centipede, possessing a ferocious and terrifying body.<br/><br/>Its aura was obviously much stronger than that of the Beast Emperor of Qian Jiang!<br/><br/>“It is indeed at the control level. It should be considered to have just stepped into the control level!”<br/><br/>Wang Xian sensed the aura of the beast emperor of Centipede Wu and muttered!<br/><br/>It could be killed!<br/><br/>“Foster father, if we have just stepped into the control level, with our strength, we can totally kill it!”<br/><br/>When Tianci heard Wang Xian’s words, his eyes lit up!<br/><br/>In the past few hundred million years, Tianci’s strength had been greatly stabilized.<br/><br/>Following Wang Xian’s few moves, his combat experience had also increased by a lot.<br/><br/>In addition, the gains from these few times could be said to be very rich!<br/><br/>The two gains allowed his tribe to gain five to six experts at the peak of the ruler realm.<br/><br/>This was something unimaginable to the Mu Li tribe in the past!<br/><br/>In the past, the Mu Li tribe didn’t even have a pinnacle ruler realm warrior.<br/><br/>And Tianci also knew that he was usually very safe when he fought with his foster father!<br/><br/>His foster father wouldn’t let him take the risk!<br/><br/>Besides, even if he took the risk and really died, he still had the revival true treasure his foster father gave him.<br/><br/>It could instantly revive him!<br/><br/>“Alright, the only thing we need to pay attention to now is the experts who believe in the universe.”<br/><br/>Wang Xian nodded his head.<br/><br/>After his strength had broken through, Wang Xian still had a 90% chance of killing the space behemoth that had just stepped into the control level.<br/><br/>The only variable was the king of all gods who believed in the universe!<br/><br/>Of course, if they were still the four kings of all gods, Wang Xian would not be afraid at all. Perhaps he would be able to obtain some unexpected gains!<br/><br/>Wang Xian restrained the energy in his body and followed the centipede king out of the starry universe.<br/><br/>Time passed little by little. A few years later, the Centipede King flew out of the starry universe and headed towards a void at high speed!<br/><br/>Wang Xian and the rest followed closely behind!<br/><br/>“That Dragon King is indeed on the move. They are going to hunt this centipede King!”<br/><br/>At the same time, at a certain place at the edge of the starry universe, four figures were floating in the void.<br/><br/>One of them, the beginner-level king of the gods, spoke up!<br/><br/>“Last time, that Dragon King intentionally chased us away. I wonder if his operation against the river-migrating Beast Emperor was successful!”<br/><br/>One of the king of the Gods said with a twinkle in his eyes.<br/><br/>“It should have failed. There aren’t any new space beasts in the starry universe. This means that the river-migrating beast emperor wasn’t killed by this Dragon King!”<br/><br/>The king of gods was guessing. He looked at another king of gods and said, “There are people in the nine-origin universe. Is there any news?”<br/><br/>“Yes. According to the news from the believers in the nine-origin universe, the current nine-origin universe is very powerful. The Dragon King of the Dragon Palace appeared out of nowhere and is suspected to have the strength of a Great Dao. The floating queen of the Celestial Nation made a breakthrough. The Divine Tiger clan gave birth to a heavenly yuan creation with the help of the Dragon King. The Demon Clan has an old heavenly yuan creation expert, Shadow Demon Emperor.”<br/><br/>“However, the Phoenix clan of the nine-origin universe was exterminated by Dragon Palace Dragon King, and the Emperor of the Phoenix fled the nine-origin universe as his mortal enemy. Overall, this nine-origin universe is abnormally powerful.”<br/><br/>The king of the gods said, “In addition, the nine-origin universe and the Void universe are mortal enemies, and we know how powerful the Void Universe is.”<br/><br/>“This nine-origin universe is too powerful, and it doesn’t fit the goal of our belief universe, so we can’t tangle with them.”<br/><br/>Hearing that, the kings of the gods frowned slightly.<br/><br/>When the great disciples of the nine-origin universe were fighting with the belief universe in the starry universe, many great disciples of the nine-origin universe had been secretly taken in as their believers.<br/><br/>They could quickly understand the information of the nine-origin universe.<br/><br/>However, the power of the nine-origin universe was beyond his imagination.<br/><br/>A universe at this level could not be considered an enemy.<br/><br/>Even if they were mortal enemies with the Void Universe, they had no intention of joining forces with the Void Universe.<br/><br/>After all, this did not conform to the development of their belief in the universe.<br/><br/>To start a war with such a powerful universe was simply asking for trouble!<br/><br/>Moreover, even if they wanted to start a war, the kings of the other gods in the belief universe would not agree.<br/><br/>“Although we won’t start a war with them, we’re not so easy to provoke. The Dragon King has ruined our plan, so we can’t let him have it easy. Anyway, we have no other actions on our side at the moment!”<br/><br/>One of the kings of the gods said with a cold gaze!<br/><br/>The other three kings of the gods nodded.<br/><br/>This time, they still acted!\t\t\t\t\t\t</div>", "images": {}, "success": true}