{"id": 1254, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074742.html", "title": "Chapter 4257 - Chapter 4257: 4256 Had Fought For The Third Time. The Price Had To Be Paid", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4257 - Chapter 4257: 4256 Had Fought For The Third Time. The Price Had To Be Paid</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4257: 4256 had fought for the third time. The price had to be paid<br/><br/>Translator: 549690339<br/><br/>“Water forbidden spell, life tremor!”<br/><br/>The king of Pantheon, who was under the attack of the Void Dragon’s body, wanted to escape as well.<br/><br/>However, when he saw his companion escaping…<br/><br/>Wang Xian’s attack had arrived!<br/><br/>Before he could take out his escape treasure, he felt the flesh and blood in his body. All his life force was trembling violently.<br/><br/>Waves of terrifying water energy condensed into symbols and entered his body!<br/><br/>He felt as though his body was about to collapse!<br/><br/>“Ahhhh, the baptism of faith!”<br/><br/>He let out a pained roar. The clothes on his body emitted a brilliant light of faith.<br/><br/>Special particles of faith surged into his body!<br/><br/>The Baptism of faith cleansed the attack of the water forbidden spell, life shock!<br/><br/>“He has some tricks up his sleeve!”<br/><br/>Wang Xian raised his eyebrows slightly when he saw that the dragon had actually broken his attack.<br/><br/>The body of the Void Divine Dragon instantly entered his body and augmented the energy in his body.<br/><br/>The tai chi dragon plate was also hovering around him and fused with his dragon scales!<br/><br/>“Dragon Domain!”<br/><br/>Wang Xian’s body trembled and the surrounding scene changed instantly!<br/><br/>A nine-colored dragon domain enveloped the king of Pantheon.<br/><br/>“Roar Roar!”<br/><br/>The moment the nine-colored radiance appeared, a golden divine dragon appeared in front of him and attacked him!<br/><br/>“Oh no!”<br/><br/>“D * MN Saint Tianyang.”<br/><br/>When the king of Pantheon saw this scene, his face revealed a look of shock. He could not help but curse his companion who had escaped. He was extremely shocked and furious!<br/><br/>Once Shengtian Yang left, he was now facing the Dragon Palace Dragon King alone!<br/><br/>And the Dragon Palace Dragon King’s strength made him feel despair!<br/><br/>The Gap was too big!<br/><br/>At this level, even the possibility of him escaping was minimal!<br/><br/>“Belief Holy Spring!”<br/><br/>He growled and raised his fist. His entire fist seemed to have turned into a holy holy spring. An endless stream of belief power attacked the Golden Divine Dragon!<br/><br/>“Bang!”<br/><br/>Under his attack, the golden divine dragon slowly began to dissipate.<br/><br/>“Roar! Roar! Roar!”<br/><br/>However, the moment the Golden Divine Dragon disappeared, an azure dragon followed closely behind and attacked him!<br/><br/>Every attack was comparable to a great dao expert’s attack!<br/><br/>“Pu!”<br/><br/>This time, the king of all gods who believed in the universe was unable to block it. He directly spat out large mouthfuls of blood!<br/><br/>After the Azure Dragon’s attack ended, a water dragon appeared and attacked his body.<br/><br/>The terrifying power caused his life force to disappear quickly!<br/><br/>He took out a treasure with great difficulty. His heavily injured body had mostly recovered.<br/><br/>However, he was not allowed to escape. The fire dragon appeared!<br/><br/>“No, no, no!”<br/><br/>The king of all gods who believed in the universe revealed a look of despair.<br/><br/>The Gap was too big!<br/><br/>Especially when Wang Xian was using his full strength.<br/><br/>He was using his powerful domain directly.<br/><br/>It was not a battle of the same level.<br/><br/>Now, Wang Xian did not need to rely on the strength of his main body. He could fight to a draw with the strength of the ancestral tree, the body of the Void Divine Dragon, and the Tai Chi Dragon Disc.<br/><br/>Coupled with Wang Xian’s main body?<br/><br/>It was simply brutal!<br/><br/>“How did you improve so quickly?”<br/><br/>When the Fire Dragon’s attack ended, the king of gods who believed in the universe had almost lost all his vitality. He stared at Wang Xian with his dying breath and asked in disbelief.<br/><br/>It was too difficult for a heaven-blessed level powerhouse to improve.<br/><br/>However, the Dragon King of the Dragon Palace had improved so terrifyingly in less than 200 million years.<br/><br/>It made him shudder.<br/><br/>He had no doubt that the Dragon King of the Dragon Palace was much stronger than the strongest person in the universe that they believed in!<br/><br/>Among the Great Dao level, he was also an existence above average.<br/><br/>He didn’t die in vain!<br/><br/>However, he wasn’t willing to die either!<br/><br/>That guy, Sheng Tianyang, ran too fast that he couldn’t escape at all!<br/><br/>The treasure that could save his life was killed before he could take it out!<br/><br/>“Bang!”<br/><br/>“Die!”<br/><br/>Wang Xian didn’t answer his nonsense. He didn’t give him any time to catch his breath!<br/><br/>He flew over and waved his dragon claw to end his life!<br/><br/>After killing him, Wang Xian didn’t hesitate and kept the corpse.<br/><br/>The dragon field disappeared instantly. He looked to the side.<br/><br/>“How is this possible?”<br/><br/>The moment the dragon field disappeared, the control-level king of Pantheon, who was fighting with tianci, was already fleeing while fighting!<br/><br/>When Holy Sky Central let out a terrified roar, he had a bad feeling.<br/><br/>Especially when he saw Holy Sky Central escape through the escape treasure, he made a prompt decision and wanted to escape.<br/><br/>However, he was not willing to use the escape treasure he had on him.<br/><br/>In his opinion, although Shengtian Yang had escaped, the Dragon King was now going to kill his other control-level companion.<br/><br/>When he killed him, it was enough for him to escape.<br/><br/>However, he miscalculated. He did not expect that his companion, the control-level king of Pantheon, would be killed in such a short time!<br/><br/>How was this possible? Just how strong was the Dragon King?<br/><br/>He was shocked. Without any hesitation, he immediately took out the treasure that could save his life!<br/><br/>“Die!”<br/><br/>In front of him, tianci, who had been fighting TIANCI, saw this scene and his eyes focused.<br/><br/>The branch in his hand turned into a terrifyingly sharp wooden sword and slashed at him, preventing him from escaping!<br/><br/>“Damn it!”<br/><br/>When the control-level king of Pantheon saw this scene, his expression was extremely ugly.<br/><br/>However, he did not block Tianci’s attack. He still took out his escape treasure and injected energy into it.<br/><br/>“Pu!”<br/><br/>The wooden sword that carried the power of the heavenly fate treasure slashed at his body from top to bottom, splitting his body in two!<br/><br/>However, one of his body parts was grabbed by a pair of arms and disappeared!<br/><br/>Only the other half of his body was left behind as he slowly collapsed!<br/><br/>“Huh?”<br/><br/>Tianci raised his eyebrows slightly when he saw this scene.<br/><br/>Wang Xian looked over and revealed a smile on his face.<br/><br/>This control-level heaven origin creator had escaped.<br/><br/>However, he had to pay the price of half of his body!<br/><br/>This half of his body was also a huge treasure to other heaven origin creator-level powerhouses.<br/><br/>Especially since its body contained a huge amount of power of faith, it was a huge benefit to heaven-bestowed’s cultivation!<br/><br/>It could be considered a good harvest!<br/><br/>Over at Primal Chaos City, the king of gods who had just entered the Heavenly Yuan creation realm had long escaped through a supreme treasure.<br/><br/>After seeing that Sacred Tianyang had escaped, he did not hesitate to escape.<br/><br/>After all, he was the weakest and was even more timid and steady.<br/><br/>At this point, the four kings of the gods who believed in the universe had left behind one and a half corpses!<br/><br/>“Foster father, did you kill that King of the Gods?”<br/><br/>Tianci saw that the battle had ended in a short period of time. He looked at Wang Xian and asked with a burning gaze.<br/><br/>“I killed one!”<br/><br/>Wang Xian smiled and nodded!<br/><br/>“Dragon King is mighty. Dragon King, you are truly invincible!”<br/><br/>Hun Dun was slightly shaken at the side.<br/><br/>The powerful gods who believed in the universe were actually beheaded by the Dragon King and escaped.<br/><br/>The current Dragon King was too terrifying!<br/><br/>If one wanted to kill him, it would be easy to destroy him!\t\t\t\t\t\t</div>", "images": {}, "success": true}