{"id": 1259, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074762.html", "title": "Chapter 4262 - Chapter 4262: 4261 War Broke Out", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4262 - Chapter 4262: 4261 War Broke Out</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4262: 4261 war broke out<br/><br/>Translator: 549690339<br/><br/>“Your Majesty, the Emperor of the Phoenix has sent a message. The teleportation channel has been established!”<br/><br/>In the primal chaos that was some distance away from the nine-origin universe.<br/><br/>Numerous enormous void towers were floating in the air.<br/><br/>There were twelve void towers, and the void tower in the middle contained an extremely terrifying energy aura.<br/><br/>Just the aura of this void tower was no weaker than that of an ordinary heaven origin creation realm expert.<br/><br/>Within this void Pagoda, twelve figures sat upright.<br/><br/>The golden-armored middle-aged man looked at the Void Dynasty’s king in the middle and reported respectfully!<br/><br/>“This might very well be this king’s last chance.”<br/><br/>The void King muttered as he looked at his subordinates. “All of you will have to hold back the experts from the nine-origin universe for at least five minutes.”<br/><br/>“Yes, your Majesty!”<br/><br/>The Heavenly Yuan creation realm experts nodded heavily.<br/><br/>This time, if they wanted to succeed and obtain the universe’s AI, they had to tie down the fallen Shadow Demon Emperor and the Dragon Palace Dragon King.<br/><br/>This time, they had already arranged everything.<br/><br/>They ordered the four control-level heavenly yuan creation realm experts to tie down the Dragon Palace Dragon King and the others.<br/><br/>The control-level powerhouses of the space element were slightly stronger than those of the same level.<br/><br/>For example, if they had just entered the control-level, the space element could deal with one that had just entered the control-level and one that had just entered the control-level.<br/><br/>This was the advantage of the space element.<br/><br/>It was still possible for two control-level powerhouses to pin down one dao-level powerhouse.<br/><br/>After all, although they would be suppressed, they wouldn’t be easily destroyed by a great dao-level expert!<br/><br/>“Do it!”<br/><br/>The void King’s eyes narrowed, and a terrifying aura emanated from his body!<br/><br/>His body moved, and a black hole teleportation array appeared in front of him.<br/><br/>In front of each void Pagoda, there was a huge black hole!<br/><br/>Their bodies moved, and they entered their respective void pagodas.<br/><br/>“Weng!”<br/><br/>In the next instant, 12 void pagodas entered the black hole at the same time!<br/><br/>At the same time, in the 9-origin universe.<br/><br/>Around the peak races, a black hole suddenly appeared.<br/><br/>Following that, the incomparably huge void pagoda appeared around the peak races.<br/><br/>Especially the demon race. In front of the Dragon Palace, there were two void pagodas that contained terrifying energy undulations!<br/><br/>As for the saint lineage, there was a void tower that contained the pressure of heaven and earth.<br/><br/>When this void tower appeared, the surrounding space immediately froze.<br/><br/>Twelve Void Towers suddenly appeared in the interior of the nine-origin universe!<br/><br/>At this moment, at the position of the Tree of chaos, Wang Xian’s expression changed slightly.<br/><br/>“Lin Niu, go back!”<br/><br/>With a thought, he shouted at Lin Niu and disappeared instantly!<br/><br/>“That’s the lair of the Dragon Palace!”<br/><br/>At the same time, two gigantic void towers were floating in front of the Divine Dragon Island.<br/><br/>Two existences at the level of the sovereign of the Void universe were looking in the direction of the Divine Dragon Island!<br/><br/>“Attack!”<br/><br/>Without any hesitation, the two void towers released two terrifying spatial destructive forces.<br/><br/>The powerful spatial vibrations swept in the direction of the Dragon Palace!<br/><br/>In the surroundings, some of the disciples of the Dragon Palace Masters who were outside died instantly under this force!<br/><br/>“The Masters of the Void universe are courting death!”<br/><br/>Wang Xian returned to the Dragon Palace in an instant. When he sensed the two void towers in the sky in front of him and the terrifying energy that was attacking him, his eyes froze!<br/><br/>His face was instantly filled with a violent killing intent.<br/><br/>He didn’t expect that there were actually two experts from the Void universe who dared to attack the Dragon Palace.<br/><br/>They were simply courting death!<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Disciples of the Dragon Palace, don’t go out. Lin Niu, Kill Your Way Out!”<br/><br/>Wang Xian instantly transformed into his divine dragon form and let out a low roar.<br/><br/>He spat out a stream of energy and met the attacks released by the two void towers directly!<br/><br/>The terrifying nine-colored dragon breath suppressed the vibration of the space. Furthermore, this stream of energy attacked the two void towers!<br/><br/>“Dragon King of the Dragon Palace, you used treasures to kill us in the six paths universe. This time, I will make you pay a terrible price!”<br/><br/>In one of the Void Towers, Duke Xining, the country protector of the Void Universe, saw Wang Xian coming out. His face was filled with killing intent as he roared.<br/><br/>Last time, their void universe had suffered a great loss from the Dragon King in the six paths universe.<br/><br/>This time, even if they were no match for the Dragon King, they could still make use of the sneak attack to cause some losses to the Dragon Palace!<br/><br/>“The void Quaked in all directions, and the sky collapsed!”<br/><br/>Duke Xining growled in a low voice. He raised his arm in the Void Pagoda.<br/><br/>The entire void pagoda shook.<br/><br/>It was as if the entire sky had descended. A wave of energy was pressing down from above.<br/><br/>It enveloped the entire void.<br/><br/>Even the surrounding Divine Dragon Island was enveloped in it!<br/><br/>“You are courting death. How dare you come to the Dragon Palace to look for trouble!”<br/><br/>Lin Niu rushed out. His blood-red eyes were staring at the two void pagodas!<br/><br/>“Mighty Heavenly Dragon!”<br/><br/>Wang Xian’s gaze focused when he saw the attacks of the two powerhouses in the Void Universe.<br/><br/>The head of a divine dragon was condensed above and charged directly at the endless space energy!<br/><br/>Boom<br/><br/>The sound of collision rang out. This endless space energy was completely destroyed by Wang Xian once again!<br/><br/>“Two control-level existences. I can kill you once and I can kill you a second time!”<br/><br/>Wang Xian stared at them. His face was filled with violent killing intent. He charged straight into the sky and attacked the two void towers!<br/><br/>Lin Niu, who was at the side, followed closely behind!<br/><br/>“The Void universe is making a move. Two control-level powerhouses have arrived. They are enough to hold back the Dragon King and the rest for a while. I’m going to make my move too. I’ll make use of this little bit of time to make the Dragon Palace suffer a heavy loss!”<br/><br/>At this moment, at a spot not far away from the Dragon Palace, a figure was staring at this scene calmly. His eyes were filled with a sinister look.<br/><br/>His body shook, and he walked out of a piece of flesh and blood. His body slowly became bigger, and he turned into a fire phoenix that was emitting endless flames!<br/><br/>“Chirp! Chirp!”<br/><br/>He let out a roar filled with hatred and directly rushed toward the Dragon Palace!<br/><br/>In the Dragon Palace, the Void Space Universe Masters suddenly arrived, and all the disciples of the Dragon Palace hurriedly hid inside.<br/><br/>The Great Beings of the Dragon Palace looked at this scene in shock!<br/><br/>“Oh no, that’s the Emperor of the Phoenix! He’s coming toward us!”<br/><br/>At this moment, when the emperor of the Phoenix showed up and rushed toward the Dragon Palace, the disciples of the Dragon Palace had a slight change in expression!<br/><br/>“The Emperor of the Phoenix! They’re mixed up with the void space! They’re courting death! I’ll deal with him!”<br/><br/>Lan Qingyue was in the Dragon Palace. She didn’t attack immediately to prevent any accidents from happening.<br/><br/>However, she didn’t expect the emperor of the Phoenix to be united with the Void Universe.<br/><br/>They actually came to attack the Dragon Palace!<br/><br/>Lan Qingyue’s body shook, and a shadow of little blue appeared behind her!<br/><br/>Although she couldn’t break through in the Void universe this time, she could borrow 100% of Little Blue’s power!\t\t\t\t\t\t</div>", "images": {}, "success": true}