{"id": 1256, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074750.html", "title": "Chapter 4259 - Chapter 4259: 4258 Was Successfully Killed", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4259 - Chapter 4259: 4258 Was Successfully Killed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4259: 4258 was successfully killed<br/><br/>Translator: 549690339<br/><br/>“Boom! Boom! Boom!”<br/><br/>The terrifying attacks were incessant. One by one, the small-sized beast kings were quickly killed.<br/><br/>The vitality of this beast king centipede was extremely tenacious.<br/><br/>One had to know that Wang Xian’s strength was extremely terrifying now.<br/><br/>In addition to the heaven-bestowed chaos, they were already comparable to two existences who had just stepped into the Great Dao realm.<br/><br/>Just like that, they did not manage to kill this beast Emperor Wu within half an hour.<br/><br/>However, this beast Emperor Wu did not have the ability to resist the attacks of Wang Xian and the rest!<br/><br/>Even if it could split into smaller Beast Emperor Wu, it was still killed by Wang Xian and the rest quickly!<br/><br/>“Foster father, this beast Emperor Wu’s vitality is really terrifying. We have been killing him for an hour, but we still haven’t managed to kill him completely!”<br/><br/>An hour later, Tianci couldn’t help but speak out.<br/><br/>Now that Beast Emperor Centipede was getting weaker and weaker, it was becoming easier for them to kill him!<br/><br/>“I think he is going to be destroyed soon. His vitality is running out!”<br/><br/>Wang Xian revealed a smile on his face!<br/><br/>Beast Emperor Centipede tried to use his powerful innate skill to escape several times, but he was suppressed by Wang Xian!<br/><br/>Due to the difference in strength, it was difficult for the Beast Emperor to escape.<br/><br/>Of course, if Wang Xian was just an ordinary expert of the Great Dao realm, there was a possibility of him escaping!<br/><br/>However, the strength of Wang Xian and the rest was too strong!<br/><br/>“Leave the last of your life force!”<br/><br/>“Buzz!”<br/><br/>Another ten minutes passed. The entire void was filled with the corpses of the small-sized beast emperor.<br/><br/>Wang Xian waved his arm and sealed a piece of flesh that was still alive. Then, he spoke to the Hundun heavenly gift and the rest!<br/><br/>The Hundun heavenly gift immediately stopped and looked at Wang Xian.<br/><br/>Wang Xian waved his arm and kept the last piece of flesh that was still alive.<br/><br/>In addition, he kept all the flesh and blood of the other centipede king.<br/><br/>Through the soul capturing technique, Wang Xian already knew that this centipede king did not have any flesh and blood that escaped!<br/><br/>“We’ve succeeded. Let’s return to the Starry Universe First!”<br/><br/>Wang Xian spoke to them.<br/><br/>Tianci Hun nodded and followed Wang Xian to fly towards the starry universe.<br/><br/>They were not too far away from the starry universe. Within a few months, they had arrived at the starry universe!<br/><br/>“Xiao Xian, have you succeeded?”<br/><br/>When they returned to Hun Dun’s lair, Lan Qingyue and Xiao Lan immediately came forward and asked in anticipation!<br/><br/>“We did it!”<br/><br/>Wang Xian nodded with a smile. He looked at Xiao Lan who was beside him, he took out the last piece of flesh that contained life force from the Wu Gong beast emperor and said, “When I completely exterminate this piece of flesh and blood, there will be an additional spot in the starry universe. Xiao Lan, you will have a breakthrough immediately!”<br/><br/>“It’s the Dragon King. Thank you, Dragon King!”<br/><br/>Xiao Lan’s eyes were filled with anticipation as she nodded her head heavily!<br/><br/>“Alright, Get Ready!”<br/><br/>Wang Xian nodded his head. He smiled as he watched Xiao Lan floating in the air.<br/><br/>With a move of his arm, he completely destroyed the last trace of life force of Beast Emperor Wu!<br/><br/>After Beast Emperor Wu was destroyed, there would naturally be an additional spot in the starry universe!<br/><br/>“Woo Woo Woo!”<br/><br/>Xiao Lan felt this life force and her eyes glowed.<br/><br/>He let out a low roar and instantly broke through the shackles. Following that, the energy in the world crazily surged towards him!<br/><br/>“Xiao Lan is about to break through!”<br/><br/>When Lan Qingyue saw this scene, her eyes also shone with excitement.<br/><br/>The Heavenly Yuan Destiny Realm was a supreme realm!<br/><br/>In other universes, the Heavenly Yuan Destiny realm was also known as the Saint Realm, the supreme realm, the king of gods realm, and so on!<br/><br/>At this realm, even in the calamity, he was a supreme existence.<br/><br/>If he had more treasures in his hands, it would be difficult to kill him even if he wanted to!<br/><br/>Although Wang Xian was very powerful now, it was extremely difficult for him to kill a beginner in the Heaven’s origin realm completely.<br/><br/>If he had many trump cards and resurrected treasures, it would be impossible to kill him!<br/><br/>The reason why Wang Xian was able to kill an existence in the Heaven’s origin realm was also due to special reasons.<br/><br/>Just like the space behemoth, it didn’t have intelligence or Resurrection Treasures!<br/><br/>However, this was still a minority!<br/><br/>Xiao Lan was floating in the sky above the starry universe, and her power was rising continuously!<br/><br/>“Qingyue, feel it and see if you can make a breakthrough as well.”<br/><br/>Wang Xian spoke to Lan Qingyue.<br/><br/>Due to its uniqueness, Lan Qingyue had a high chance of making a breakthrough at the same time.<br/><br/>Lan qingyue nodded and watched quietly.<br/><br/>Time passed by little by little. Xiao Lan’s aura became more and more terrifying.<br/><br/>A few hours later, his aura rose to the Heaven’s origin realm!<br/><br/>A wave of aura that belonged to the Heaven’s origin realm was emitted from his body!<br/><br/>“Woo Woo!”<br/><br/>Xiao Lan let out a low growl as endless energy was absorbed into his body. He swayed his body in excitement!<br/><br/>His gaze was directed at Wang Xian and Lan Qingyue!<br/><br/>“Qingyue, how did you sense it?”<br/><br/>Seeing that Xiao Lan had completed her breakthrough, Wang Xian smiled and looked at Lan Qingyue!<br/><br/>“Xiao Lan has made a breakthrough, but I didn’t!”<br/><br/>Lan qingyue frowned slightly.<br/><br/>“Xiao Lan has fed me a powerful force, allowing me to see the shackle. However, when I wanted to break this shackle, I was blocked by an unknown force.”<br/><br/>“It should be because of the quota. If I want to make a breakthrough, I need to occupy a quota. However, Xiao Xian, I can borrow Xiao Lan’s strength now. In other words, even if I haven’t made a breakthrough, with Xiao Lan’s strength, I might be able to unleash the strength of the Heaven’s origin blessed realm!”<br/><br/>“However, there is a flaw. After I borrow Xiao Lan’s strength, Xiao Lan won’t be able to unleash all of her strength!”<br/><br/>Lan qingyue said to Wang Xian.<br/><br/>“It’s a little regretful!”<br/><br/>When Wang Xian heard that, he shook his head slightly. However, he quickly smiled and said, “Qingyue, you are already on the verge of a breakthrough. When you have the opportunity to hunt another space beast, you will be able to make a breakthrough!”<br/><br/>“En, there’s no rush!”<br/><br/>Lan qingyue nodded with a smile.<br/><br/>In the Dragon Palace, Xiao Lan was the first to break through. Now, Lan Qingyue was the only one who had reached the threshold of breaking through!<br/><br/>If Lan Qingyue wanted to break through, she would need to do so in the starry universe.<br/><br/>In addition, he had obtained a lot of resources this time around.<br/><br/>The corpse of the Beast Emperor of the centipede craze was sufficient to allow little white and the rest to reach the verge of breaking through as well!<br/><br/>Apart from that, there was also the corpse of the king of all gods who was at the control level!<br/><br/>This corpse had the heart of faith. It would be extremely beneficial to those who were at the Heaven’s origin level!<br/><br/>Apart from this one, there was another half of the king of all gods’corpse. Wang Xian gave it to tianci.<br/><br/>“Tianci, I’ll give you one-fifth of the corpse of the Centipede Beast Emperor. Together with the half of the king of all gods’corpse on you, you can use it to increase your strength. The resources at the control level will be of great use to you!”<br/><br/>Wang Xian took out a portion of the king of Pantheon’s body and handed it to Tianci!\t\t\t\t\t\t</div>", "images": {}, "success": true}