{"id": 1263, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074778.html", "title": "Chapter 4266 - Chapter 4266: 4265 King Of Void Was Just So-So!", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4266 - Chapter 4266: 4265 King Of Void Was Just So-So!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4266: 4265 king of Void was just so-so!<br/><br/>Translator: 549690339<br/><br/>“Alright, Hetian saint, settle the disciples around you first. Leave this to me!”<br/><br/>Wang Xian’s face was filled with coldness when he saw the king of Void’s furious expression!<br/><br/>He swayed his huge body and stared at the king of Void coldly!<br/><br/>Buzz Buzz<br/><br/>The King of Void stared at Wang Xian with a face full of hatred. He waved the scepter in his hand.<br/><br/>The space power that was brewing in the space disk attacked Wang Xian instantly!<br/><br/>When Wang Xian saw this scene, his eyes narrowed slightly. His face was also filled with caution!<br/><br/>The other party was the king of the Void dynasty. He was the controller of the universe.<br/><br/>In addition, he had a space treasure of the heaven origin creation level on his head!<br/><br/>A treasure of the heaven origin creation level with such a combat ability was extremely terrifying!<br/><br/>Buzz Buzz<br/><br/>In the next instant, Wang Xian’s expression suddenly changed!<br/><br/>He could sense a terrifying spatial force cutting towards his body!<br/><br/>“Ignore the distance!”<br/><br/>His body trembled as the nine-colored energy from his body surrounded his entire body.<br/><br/>The dragon scales emitted a luster.<br/><br/>His entire body was blocking it.<br/><br/>PFFT PFFT PFFT PFFT<br/><br/>However, terrifying wounds still appeared on his body!<br/><br/>The wounds directly entered his body!<br/><br/>This space-attributed heavenly Yuan creation treasure could ignore space when it attacked. In fact, it could even break through one’s defenses!<br/><br/>It was extremely terrifying!<br/><br/>“A fellow who has just stepped into the Great Dao realm, I will kill you and Take Your Dragon Head!”<br/><br/>When the void King saw this scene, a cold and sinister expression appeared on his face!<br/><br/>He flew directly to the top of the Void Pagoda and disappeared with the entire void pagoda in an instant!<br/><br/>“With just you?”<br/><br/>Wang Xian’s eyes revealed a sinister expression. His body trembled.<br/><br/>The energy of the ancestral tree began to circulate. The dozens of serious wounds on his body were recovering at a terrifying speed!<br/><br/>You have the ultimate treasure of the Heaven’s origin!<br/><br/>Wang Xian also has it!<br/><br/>“Roar!”<br/><br/>The next moment, Wang Xian raised his head and roared furiously at the top.<br/><br/>A nine-colored torrent shot upward!<br/><br/>The terrifying torrent seemed to be able to penetrate the entire starry sky!<br/><br/>“The Dragon King of the Dragon Palace is here. The Dragon King of the Dragon Palace is here. He is here to help us!”<br/><br/>“That’s great. The Dragon King is also an existence at the level of the Great Dao. With the Dragon King here, we can totally fend off this king of the Void Universe!”<br/><br/>“Quick, quick, let’s Get Far Away quickly!”<br/><br/>Wang Xian’s sudden arrival made the fleeing disciples of the saint lineage look excited and relieved.<br/><br/>The last minute was like hell to them.<br/><br/>That terrifying king of the Void universe easily killed their Hetian saint!<br/><br/>With a wave of his hand, the mountains and rivers of their saint lineage collapsed and the void was torn apart!<br/><br/>All the powerful disciples felt as if they were ants.<br/><br/>They were easily slaughtered!<br/><br/>Even a trace of energy would turn them into ashes!<br/><br/>This was their doomsday.<br/><br/>If they were unlucky, they would die.<br/><br/>In a short minute, one-third of the powerful disciples of their saint lineage died!<br/><br/>It was extremely terrifying!<br/><br/>Now that the Dragon King had arrived, he could fight against this terrifying king of the void.<br/><br/>If the Dragon King had arrived a few minutes later, their saint’s disciples would have been destroyed!<br/><br/>“All the disciples, Retreat!”<br/><br/>Saint Hetian swallowed the pills in large mouthfuls to recover from his injuries.<br/><br/>He looked at all the disciples around him and immediately ordered loudly!<br/><br/>“Boom!”<br/><br/>At this moment, an extremely violent collision sound came from the sky.<br/><br/>The nine-colored dragon breath crashed into the void above.<br/><br/>However, the king of Void was standing under the Void Pagoda above, and a wave of spatial energy surged downwards.<br/><br/>Two terrifying energies were confronting each other!<br/><br/>When everyone saw this scene, their faces were filled with shock.<br/><br/>This scene was simply too shocking!<br/><br/>At the center of the collision of energies.<br/><br/>It had turned into a dead zone. Even space had been penetrated.<br/><br/>“Is This It?”<br/><br/>The King of void stared at Wang Xian and said with a gloomy face!<br/><br/>He waved the scepter in his hand.<br/><br/>Above his head, the space disk was spinning slowly.<br/><br/>With every rotation, a terrifying gigantic space disk would fly out from it.<br/><br/>Soon, more than ten huge disks attacked Wang Xian in an arc in the surrounding void!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>The terrifying disks attacked Wang Xian at an unbelievable speed!<br/><br/>Wang Xian waved his dragon claws and illusory dragon claws attacked the disks!<br/><br/>“Bang! Bang! Bang!”<br/><br/>The sound of violent collisions rang out.<br/><br/>However, Wang Xian’s attacks were unable to withstand the attacks of all the circular discs.<br/><br/>The three spatial discs penetrated into Wang Xian’s body directly!<br/><br/>A terrifying wound was created on his body!<br/><br/>“Phew!”<br/><br/>Wang Xian took a deep breath. The wood attribute energy in his body circulated, and the powerful recovery ability allowed the wound to heal at a terrifying speed.<br/><br/>“King of the Void Universe, is this your full strength? It’s just so-so!”<br/><br/>Wang Xian stared coldly at the king of the Void Universe and mocked.<br/><br/>The king of the Void’s own strength could only be comparable to those who had just stepped into the Great Dao realm.<br/><br/>In addition to the Heavenly Yuan Destiny Treasure, his own space attribute, and that powerful void pagoda.<br/><br/>This allowed him to deal with five new Tianyuan destiny-level existences!<br/><br/>This was all of his strength.<br/><br/>As for Wang Xian, although he didn’t bring the body of the Void Divine Dragon, the Tai Chi Dragon Disc, and the five elements great mill with him.<br/><br/>However, he had the ancestral tree in his body.<br/><br/>With the blessing of the ancestral tree, he could allow her to fight against two new Tianyuan destiny-level existences.<br/><br/>In other words, the king of void and his strength were only lacking three new Tianyuan destiny-level existences!<br/><br/>It was the difference of a control-level powerhouse.<br/><br/>Such a difference was not fatal to Wang Xian and the rest!<br/><br/>“Huh?”<br/><br/>The king of Void saw that the injuries on Wang Xian’s body were recovering at a terrifying speed. His expression changed slightly!<br/><br/>“Do you have a recovery-type Heaven’s origin creation treasure on You?”<br/><br/>His expression darkened as he stared at Wang Xian and shouted!<br/><br/>“Hehe!”<br/><br/>Wang Xian sneered and stared at him. “I just killed a control-level powerhouse in your void universe. If you don’t leave today, I will kill you too!”<br/><br/>“Impudent, arrogant!”<br/><br/>The king of Void’s face darkened. “I want to let you know what the foundation of a powerhouse is!”<br/><br/>Buzz<br/><br/>The king of Void’s face was filled with fury as he entered the Void Pagoda!<br/><br/>In the next instant, the Void Pagoda disappeared!<br/><br/>Buzz<br/><br/>Following that, Wang Xian sensed an extremely terrifying force heading toward him!<br/><br/>“Huh?”<br/><br/>Wang Xian was slightly shocked. He didn’t sense the trajectory of the king of Void’s Attack!<br/><br/>Bang<br/><br/>A powerful force crashed into his body.<br/><br/>The spatial attribute’s cutting force caused large scales on Wang Xian’s body to fall off. Dragon blood also dripped down slowly!<br/><br/>Boom<br/><br/>Wang Xian’s body trembled. One dragon pillar after another appeared around him!\t\t\t\t\t\t</div>", "images": {}, "success": true}