{"id": 1269, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074802.html", "title": "Chapter 4272 - Chapter 4272: The 4271 Massacre Began", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4272 - Chapter 4272: The 4271 Massacre Began</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4272: The 4271 massacre began<br/><br/>Translator: 549690339<br/><br/>The experts of the Void dynasty did not know how powerful the palace was.<br/><br/>However, they had heard from the seniors of the royal family that it could withstand a heaven origin creation-level existence.<br/><br/>Now, they saw that the defense and attack system of the palace was completely useless against this intruder.<br/><br/>This made them extremely terrified!<br/><br/>“This is a divine dragon, a divine dragon from the nine-origin universe, the Divine Dragon recorded in the records of our Royal Family!”<br/><br/>An expert from the royal family stared at Wang Xian. Sensing this terrifying aura, he roared loudly!<br/><br/>“Damn it, an expert from the nine-origin universe actually dares to invade our void universe. You are courting death!”<br/><br/>An expert from the royal family roared at Wang Xian with a face full of anger!<br/><br/>“Defend! With the help of the power of our palace, we can unleash a strength that far surpasses that of ordinary powerhouses in the Heaven’s origin realm.”<br/><br/>They shouted loudly.<br/><br/>More than 200,000 powerhouses in the Dominator realm of the Void universe immediately gathered waves of terrifying energy and prepared to cover Wang Xian.<br/><br/>At the same time, the powerhouses around the palace also flew over quickly.<br/><br/>Their faces were filled with fighting spirit.<br/><br/>“Fight for the Void dynasty. Any intruders shall die!”<br/><br/>They roared loudly, wanting to protect their dynasty palace.<br/><br/>Wang Xian was floating in the sky above the palace. He stared at them coldly with a mocking expression on his face.<br/><br/>There were more than 200,000 experts at the ruler realm below.<br/><br/>There were over a million people who were rushing over from the surroundings!<br/><br/>One-third of them were masters of the ruler realm.<br/><br/>This was the power that guarded the palace of the Void dynasty!<br/><br/>More than 500,000 masters of the ruler realm.<br/><br/>This number was not small!<br/><br/>One had to know that this was merely the power that was gathered in the palace of the Void Dynasty!<br/><br/>The overall power of the entire void universe was still very powerful.<br/><br/>At the very least, it was much stronger than the nine-origin universe!<br/><br/>“Die!”<br/><br/>Wang Xian stared at them with a cold expression on his face.<br/><br/>He waved his dragon claws downwards.<br/><br/>“Roar! Roar! Roar!”<br/><br/>Below, more than 200,000 masters in the ruler realm were also staring at Wang Xian with cold eyes.<br/><br/>The combined space power attacked Wang Xian’s body.<br/><br/>“PFFT!”<br/><br/>However, their power was like a fragile mirror when faced with Wang Xian’s attack.<br/><br/>All the space power was destroyed by the Dragon Claw!<br/><br/>Following that, the power of death descended on their bodies!<br/><br/>“This is bad. The opponent’s strength is too terrifying. He might be an existence at the Great Dao Level!”<br/><br/>“He’s Invincible!”<br/><br/>Sensing this invincible power, some of the powerhouses at the peak of the Overlord realm of the royal family roared with Trembling Hearts!<br/><br/>Boom<br/><br/>However, in the next moment, the terrifying dragon claws directly suppressed over 200,000 powerhouses at the ruler realm.<br/><br/>They were all killed!<br/><br/>With a wave of his arm, Wang Xian collected all their corpses!<br/><br/>Then, he swept his gaze across the surroundings.<br/><br/>He swept his gaze toward the Void dynasty’s powerhouse disciples who were charging toward him!<br/><br/>“Ants!”<br/><br/>He said coldly and swept his dragon tail across!<br/><br/>“We are invincible! Run!”<br/><br/>“We seek help from his majesty, the Sacred King! We seek help from the nation-guarding dukes and Generals!”<br/><br/>All the Void Dynasty’s elite soldiers who were flying toward him saw what was happening.<br/><br/>They were overwhelmed with shock as they shouted in horror!<br/><br/>The elite disciples who were originally charging toward him immediately fled in fear.<br/><br/>“Hehe!”<br/><br/>Wang Xian stared at them with a mocking expression on his face.<br/><br/>Could they escape?<br/><br/>The terrifying dragon tail had already swept across. Endless nine-colored energy was attacking their bodies.<br/><br/>Faced with this terrifying energy torrent, they had no way of resisting at all!<br/><br/>Death enveloped them instantly!<br/><br/>They didn’t even have the chance to scream!<br/><br/>They were all dead!<br/><br/>Wang Xian flew over and collected all the corpses!<br/><br/>The corpses of these 500,000 Void Universe Masters were a huge resource!<br/><br/>“Roar!”<br/><br/>Wang Xian let out a dragon’s roar as he sensed the energy in the palace of the Void dynasty.<br/><br/>Where there was a strong energy fluctuation, he waved his dragon claw and kept it!<br/><br/>Especially at the back of the Palace of the Void dynasty, there was a large number of divine trees and herbs planted there.<br/><br/>There was also an extremely powerful mountain formed from the accumulation of Void Stones!<br/><br/>“There are a total of 300,000 to 400,000 divine trees in the ruler realm!”<br/><br/>Wang Xian’s heart was burning with excitement. There were also quite a number of divine trees in the peak of the ruler realm!<br/><br/>There was even a pond there that contained a vast amount of energy!<br/><br/>This energy was close to the strength of a heaven’s origin creator!<br/><br/>It was definitely a powerful treasure!<br/><br/>Wang Xian’s heart was burning with passion. He moved his body and kept it away.<br/><br/>This pond was obviously sealed by a powerful energy.<br/><br/>However, this energy could not withstand Wang Xian’s strength!<br/><br/>“Roar!”<br/><br/>After Wang Xian kept it away, he kept a large number of divine herbs, divine trees, and spatial gemstones!<br/><br/>All sorts of valuable treasures were plundered!<br/><br/>A large number of treasures were stored away in just a few minutes!<br/><br/>Boom! Boom<br/><br/>Roar! Roar<br/><br/>After some useful treasures were stored away, Wang Xian hovered above the palace. He spewed out a mouthful of dragon breath downwards!<br/><br/>The terrifying torrent of energy caused the palace to collapse and penetrated it directly!<br/><br/>Countless fragments flew in all directions!<br/><br/>The items used to create the palace were not ordinary items either!<br/><br/>However, Wang Xian still did not care about these materials!<br/><br/>Under the Dragon Breath.<br/><br/>The entire palace began to collapse rapidly!<br/><br/>Some of the Void dynasty’s strong disciples who hid in the palace also died under the impact of the energy!<br/><br/>“Hiss, look at our palace, what’s going on? What’s going on?”<br/><br/>“What happened? What happened? That huge creature is wreaking havoc in our palace!”<br/><br/>“Where’s our sacred king? Where’s Our Void Dynasty’s Heavenly Yuan Creation Realm Expert?”<br/><br/>“Oh my God, the palace is rapidly collapsing, and all the experts in the palace were killed. What kind of creature is that? How could it be so terrifying?”<br/><br/>“How could it be? There’s actually a powerful existence attacking our palace!”<br/><br/>At the same time, around the palace of the Void dynasty.<br/><br/>As the palace of the Void dynasty, there were many experts entering and leaving every day.<br/><br/>All sorts of royal families and ministers of the dynasty would enter and leave frequently!<br/><br/>At this moment, some who had just arrived and some who had just left the palace.<br/><br/>Looking at the situation in the palace, their faces were filled with shock!<br/><br/>That terrifying gigantic creature was like a world-destroying devil, wreaking havoc in their dynasty palace!<br/><br/>This was their Void Dynasty’s Palace!<br/><br/>A dynasty palace that had stood erect in their universe for hundreds of billions of years!<br/><br/>Today, it was actually destroyed wantonly by a powerful existence!\t\t\t\t\t\t</div>", "images": {}, "success": true}