{"id": 1264, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074782.html", "title": "Chapter 4267 - Chapter 4267: 4266 King Of Void Left", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4267 - Chapter 4267: 4266 King Of Void Left</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4267: 4266 king of void left<br/><br/>Translator: 549690339<br/><br/>“Eight dragon pillars to suppress the eight desolates!”<br/><br/>Wang Xian sensed the king of Void’s terrifying attack and his face was extremely cold.<br/><br/>His body shook and eight dragon pillars appeared around him, forming a terrifying energy of the Dragon Field.<br/><br/>Following that, the dragon pillars started to spin and cleaned up all the energy in the surroundings except for Wang Xian!<br/><br/>“Boom Boom Boom!”<br/><br/>Boom! Boom! Boom<br/><br/>The collision of the five elements began. The dragon pillars continued to collide with the Void Pagoda!<br/><br/>The Void Pagoda of the King of Void started to tremble violently!<br/><br/>Buzz<br/><br/>At this moment, the body of the king of Void flew out from the Void Pagoda.<br/><br/>The staff in his hand turned into a pitch-black dagger.<br/><br/>The entire dagger contained a terrifying black energy aura.<br/><br/>Within the black energy aura, there was also the power of space!<br/><br/>“World of wind and Thunder!”<br/><br/>Wang Xian stared at the king of Void. The incipient Saint Wings appeared behind his back!<br/><br/>The surrounding void was instantly enveloped by the power of wind and thunder!<br/><br/>“Bang Bang!”<br/><br/>“Bang Bang Bang!”<br/><br/>Wang Xian waved his dragon claws and directly went up to meet the King of Void!<br/><br/>The King of Void’s body appeared above him. The dagger and the dragon claws collided!<br/><br/>“Bang! Bang! Bang!”<br/><br/>The king of Void’s eyes focused. He immediately began to teleport rapidly.<br/><br/>“Buzz! Buzz! Buzz!”<br/><br/>“Bang! Bang! Bang!”<br/><br/>Every time the King of Void teleported, Wang Xian would be able to lock onto the spot and directly meet it head-on.<br/><br/>With the difference of a mastery level, the king of Void could not suppress Wang Xian in a short period of time.<br/><br/>This also allowed Wang Xian to fend off his attacks one after another!<br/><br/>“Damn it, this fellow’s strength is about the same as the fallen Shadow Demon Emperor!”<br/><br/>The king of Void’s face was gloomy and ugly!<br/><br/>He could not suppress the Dragon King of the Dragon Palace in a short period of time.<br/><br/>And if this continued for a longer period of time, the heaven origin manifestation powerhouses from other places in the nine-origin universe would rush over.<br/><br/>Especially the fallen Shadow Demon Emperor.<br/><br/>The two mastery level subordinates he sent were no match for the Fallen Shadow Demon Emperor.<br/><br/>They couldn’t hold him back for long!<br/><br/>Once the fallen Shadow Demon Emperor came, he could only escape immediately!<br/><br/>“The surrounding wind and thunder energy can sense my teleportation location. I can’t continue to be entangled like this!”<br/><br/>The void King’s face was gloomy. With a move of his palm, the space disk above his head appeared in front of him.<br/><br/>“I’ll give it my all!”<br/><br/>He gritted his teeth and prepared to use his strongest trump card!<br/><br/>The space disk in front of him was glowing.<br/><br/>Slowly, a pattern appeared on the space disk.<br/><br/>The pattern was something like a sphere. Inside this sphere, it was as if there was a world!<br/><br/>“Space Lock, Pierce through all space!”<br/><br/>The King of void let out a low growl.<br/><br/>His body moved. This time, he did not continue to attack Wang Xian. Instead, he channeled his energy into the space disk.<br/><br/>A black hole appeared in his vision!<br/><br/>“Not good, Dragon King. He wants to use a powerful treasure to lock onto the position of the universe’s AI. He wants to snatch away the universe’s AI!”<br/><br/>At this moment, at the back, the expression of the He Tian Saint, who had teleported his disciples away, changed slightly. He shouted at Wang Xian loudly!<br/><br/>“Huh?”<br/><br/>Wang Xian was also slightly stunned. He didn’t expect the king of Void to suddenly change his target.<br/><br/>Furthermore, he used such an unbelievable method to snatch the universe’s artificial intelligence!<br/><br/>“Where is the universe’s artificial intelligence?”<br/><br/>Wang Xian’s gaze focused as he asked.<br/><br/>“It’s omnipresent. As long as someone uses the universe’s artificial intelligence, it can be anywhere. It’s just that I have a deeper connection with it. However, even if it’s omnipresent, it still has a source.”<br/><br/>“No one knows where this source is. The King of Void used the ultimate treasure of Heaven’s origin to lock onto the source and wanted to plunder it!”<br/><br/>The expression of the unity saint changed slightly as he spoke to Wang Xian anxiously!<br/><br/>“You dare to be distracted while fighting with me?”<br/><br/>Wang Xian heard it and moved his body. He attacked the king of void directly!<br/><br/>Terrifying chains were wrapping around him!<br/><br/>“Come over!”<br/><br/>The king of Void ignored Wang Xian and continued to stare at the black hole. He stretched out his arm and grabbed at the cosmic artificial intelligence inside!<br/><br/>“Flee, flee, Flee!”<br/><br/>When he saw this scene, he trembled and gathered all his energy to control the cosmic artificial intelligence.<br/><br/>Buzz<br/><br/>The King of Void’s arm went into the black hole and grabbed towards the source of the universe’s artificial intelligence.<br/><br/>However, in the next moment, his arm went straight through the universe’s artificial intelligence.<br/><br/>It was as if the universe’s artificial intelligence was an illusion!<br/><br/>“Damn it!”<br/><br/>The king of Void’s face revealed a violent expression!<br/><br/>The black hole was aimed directly at Wang Xian’s position.<br/><br/>Boom<br/><br/>The chain attack released by Wang Xian was completely absorbed by the black hole!<br/><br/>“The Ultimate Treasure of the Heaven’s origin is after all the ultimate treasure of the Heaven’s origin. It’s not so easy for you to snatch it away. King of the Void, your goal today is destined to fail!”<br/><br/>The unity saint’s forehead was filled with cold sweat as he stared at the Void and roared furiously!<br/><br/>Whoosh<br/><br/>“Unity Saint, Lord Dragon King, I’m here to help you!”<br/><br/>At this moment, Jiuli from the demon race flew over from the teleportation formation below.<br/><br/>He swept his gaze across the surroundings, looked at the Unity Heaven Saint and Wang Xian, and immediately came over!<br/><br/>“Huh?”<br/><br/>The Unity Heaven saint was slightly stunned when he saw this unfamiliar heaven origin destiny realm powerhouse!<br/><br/>“Is everything alright with the demon race?”<br/><br/>Wang Xian looked at Jiuli and asked!<br/><br/>“Sir Dragon King, everything is fine over there. The Fallen Shadow Demon Emperor is currently suppressing two powerhouses in the Void Universe. Sir said that he will be able to come over very soon!”<br/><br/>Jiuli nodded and reported to Wang Xian!<br/><br/>“Very good!”<br/><br/>Wang Xian nodded and looked at the king of Void who was burning with anger!<br/><br/>Whoosh! Whoosh<br/><br/>Wang Xian moved and directly attacked the king of Void!<br/><br/>Saint Hetian’s body recovered a little and he also rushed over immediately!<br/><br/>Jiuli was at the back and a pair of demonic wings appeared behind him.<br/><br/>“Just you wait. My Void Universe will come again. One day, I will destroy you bunch of reckless fools!”<br/><br/>When the king of Void saw Wang Xian and the others rushing over, he threw his head back and roared indignantly.<br/><br/>He did not continue to fight with Wang Xian and the others.<br/><br/>His last resort still prevented him from taking away the universe’s AI. At this moment, he had given up.<br/><br/>There was no need to continue staying here!<br/><br/>With the Dragon King around, he had no way!<br/><br/>On the contrary, if the fallen shadow demon emperor were to come over and more heavenly yuan creation realm experts from the 9-origin universe came, he would probably be in danger!<br/><br/>Therefore, there was no need to continue fighting!<br/><br/>The void King’s body directly entered the Void Pagoda.<br/><br/>The entire void pagoda trembled slightly!<br/><br/>Boom<br/><br/>In the next instant, he left the nine-origin universe!<br/><br/>Wang Xian and the rest were not surprised to see this scene.<br/><br/>“This king of Void is really terrifying!”<br/><br/>Jiuli was also shocked when he saw the king of void disappearing from his senses.<br/><br/>As expected of a powerful enemy who could force the fallen Shadow Demon Emperor to take charge of the nine-origin universe.\t\t\t\t\t\t</div>", "images": {}, "success": true}