{"id": 1268, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074798.html", "title": "Chapter 4271 - Chapter 4271: The 4270 Massacre Began", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4271 - Chapter 4271: The 4270 Massacre Began</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4271: The 4270 massacre began<br/><br/>Translator: 549690339<br/><br/>Wang Xian flew in the direction of the Void dynasty!<br/><br/>Not long after, an incomparably huge palace appeared in his line of sight!<br/><br/>There were also a large number of strong disciples entering and exiting from the surrounding areas!<br/><br/>These were all the royal disciples of the Void Dynasty!<br/><br/>The entire palace of the Void dynasty was abnormally huge. He stood at the center of the Void universe as though he was overlooking the entire universe!<br/><br/>Wang Xian looked at the palace of the Void dynasty with a shocked expression on his face.<br/><br/>The scale and power of the Void dynasty far exceeded the ten dragon palaces!<br/><br/>The energy whirlpool in the space was condensing in the sky!<br/><br/>The entire Void dynasty didn’t seem to come from this layer of space. Instead, it seemed to be in a deeper layer of space!<br/><br/>On both sides of the entrance of the Palace of the Void dynasty, there were rows of soldiers!<br/><br/>The uniform armor of these soldiers were all existences at the ruler realm.<br/><br/>With a glance, there were tens of thousands of them. None of them were lower than the ruler realm!<br/><br/>At the entrance of the dynasty palace, a flag was fluttering!<br/><br/>The flag was made of powerful treasures. It stood in the sky and was fluttering rhythmically.<br/><br/>There was a terrifying aura contained on it.<br/><br/>Wang Xian had no doubt that if a heaven’s origin strong cultivator charged over directly, he would be suppressed by the flag.<br/><br/>This was not the power of the flag itself, but the power of the entire palace of the dynasty.<br/><br/>The entire palace of the dynasty was built on a large number of planets. It contained the energy of the planets!<br/><br/>This energy was condensed together and transmitted to the flag. It could erupt with a vast amount of power!<br/><br/>Wang Xian watched from afar. His face revealed a look of shock.<br/><br/>At least, the Dragon Palace didn’t have this ability!<br/><br/>His eyes flickered as he sized up the entire palace of the Void dynasty.<br/><br/>“What a powerful force. I feel that even if there are no powerhouses of the Heaven’s origin realm guarding the palace, even if a control-level powerhouse of the Heaven’s origin realm stepped into the palace, he would still be able to withstand it!”<br/><br/>Wang Xian mumbled.<br/><br/>This palace of the Void dynasty was far more powerful than what he could see!<br/><br/>According to his perception with his void dragon body, this palace of the Void dynasty was in another dimension!<br/><br/>In this dimension, there were all sorts of complicated dimensions!<br/><br/>Ordinary powerhouses who had just entered the Heaven’s origin manifestation realm would immediately get lost inside and suffer from terrifying attacks!<br/><br/>Even if a control-level expert were to barge in, they would still be trapped!<br/><br/>In the Void universe, their usage of space power had already reached a terrifying level!<br/><br/>“They really have an extremely deep foundation. If the king of Void was here, the entire palace would be even more terrifying!”<br/><br/>Wang Xian spoke.<br/><br/>He thought of the King of Void’s heaven origin creation treasure.<br/><br/>It was a space-attribute heaven creation attack treasure!<br/><br/>With all his trump cards, Wang Xian would only have an additional fighting strength at the initial heaven creation level if he were to fight against the King of Void!<br/><br/>The gap between them was very small.<br/><br/>I’m afraid it will be difficult for me to sneak in<br/><br/>Wang Xian thought to himself. He concealed himself and flew towards the palace of the Void dynasty.<br/><br/>All the way to the entrance, the surrounding void universe could not sense his existence at all.<br/><br/>Looking at an invisible energy in front of him, Wang Xian walked straight into the palace!<br/><br/>Buzz<br/><br/>When he entered the palace, the flag of the Void dynasty that was not far away trembled slightly.<br/><br/>Following that, Wang Xian sensed a powerful spatial force enveloping him!<br/><br/>The commotion here immediately attracted the attention of the surrounding soldiers!<br/><br/>“Be careful, there’s an intruder!”<br/><br/>An expert at the peak of the Dominator realm focused his gaze and immediately looked in the direction where the spatial energy was locked onto. His eyes were filled with killing intent!<br/><br/>The rest of the soldiers held their weapons and stared at him!<br/><br/>“HMPH!”<br/><br/>Wang Xian felt the energy that was attacking him and his gaze turned cold!<br/><br/>This force was indeed powerful, but it was not enough to hurt him.<br/><br/>His gaze focused, and a ray of light burst out from his dragon eyes. He slashed directly at the flag of the Void Empire!<br/><br/>“Bang!”<br/><br/>Under the powerful force, the flag of the Void Empire was directly cut off!<br/><br/>At the same time, Wang Xian revealed himself. His gaze swept across the powerful disciples in the surrounding void universe, and his eyes were filled with killing intent.<br/><br/>“The void space has intruded into my nine-origin universe and killed countless disciples. It is impolite to not reciprocate. Today, the Dragon King is here to kill!”<br/><br/>Wang Xian swept his gaze across the powerful disciples in the two sides of the void space and waved his arm!<br/><br/>Buzz<br/><br/>A wave of energy directly killed more than 10,000 masters in the ruler realm on both sides.<br/><br/>Their corpses were directly collected by Wang Xian!<br/><br/>Following that, Wang Xian walked into the palace of the Void dynasty!<br/><br/>Buzz<br/><br/>As soon as he stepped into the palace, Wang Xian felt the scene around him change. It was as if he had entered another dimension!<br/><br/>This dimension was boundless. The palace building just now had completely disappeared.<br/><br/>“Break!”<br/><br/>Wang Xian shouted in a low voice.<br/><br/>Roar<br/><br/>He growled and immediately transformed into the body of a divine dragon. The surrounding space collapsed and the palace of the Void dynasty appeared in his sight!<br/><br/>At the same time, Wang Xian’s gigantic divine dragon body was revealed in the sky above the palace of the Void dynasty!<br/><br/>The sudden appearance of the gigantic divine dragon immediately attracted the attention of the entire army in the palace of the Void dynasty!<br/><br/>The expressions of the experts changed drastically when they saw Wang Xian appearing!<br/><br/>“There’s an enemy invasion. All experts, defend against the external enemies!”<br/><br/>An expert at the peak of the ruler realm immediately flew to the sky and roared loudly.<br/><br/>His voice spread throughout the entire palace!<br/><br/>“Let’s end this quickly!”<br/><br/>Wang Xian focused his gaze and scanned his surroundings with his dragon eyes.<br/><br/>An incomparably violent aura was emitted from his body!<br/><br/>“Roar! Roar! Roar!”<br/><br/>Wang Xian let out a wild roar and opened his dragon mouth. A wave of dragon breath gushed forward directly!<br/><br/>All the buildings and all the defenses collapsed instantly under Wang Xian’s Attack!<br/><br/>On his body, the Five Elements Millstone, the Tai Chi Dragon Disc, and the body of the Void Divine Dragon charged forward.<br/><br/>They locked onto the powerful disciples of the Void Universe and were prepared to slaughter them wantonly!<br/><br/>This time, the king of Void and the rest had slaughtered a large number of powerful disciples from the nine-origin universe.<br/><br/>Wang Xian wanted them to pay the price.<br/><br/>Pay a tragic price!<br/><br/>His dragon eyes swept across the area. He could sense that in front of the palace, more than 200,000 strong disciples from the Void Universe in the ruler realm were gathering rapidly!<br/><br/>He swayed his incomparably huge body and flew over in an instant!<br/><br/>Although the palace of the Void dynasty was incomparably huge, it only took Wang Xian less than ten seconds to fly from one side to the other!<br/><br/>Before the army of the Void Dynasty had gathered, the Dragon King had already arrived above them!<br/><br/>“Oh no, it’s an expert at the Heaven’s fate level. Moreover, the defense of our Void Dynasty’s palace is actually useless against him. The other party’s strength is extremely terrifying!”<br/><br/>An expert from the Void Dynasty’s royal family shouted in horror when he saw Wang Xian flying over instantly!\t\t\t\t\t\t</div>", "images": {}, "success": true}