{"id": 1266, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074790.html", "title": "Chapter 4269 - Chapter 4269: It Was Impolite Not To Reciprocate", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4269 - Chapter 4269: It Was Impolite Not To Reciprocate</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4269: It was impolite not to reciprocate<br/><br/>Translator: 549690339<br/><br/>“That’s fine too. With the Dragon King around this time, as long as our disciples can reach the brink of a breakthrough, they will have a great chance of making a breakthrough.”<br/><br/>When Xuanwu patriarch and the rest heard the fallen Shadow Demon Emperor’s words, they were all stunned, they nodded their heads as well. “Next, we can groom our disciples. If we can produce a few more heaven origin blessed realm powerhouses, then we will be able to deal a heavy blow to the Void Universe!”<br/><br/>“If it’s a full-scale attack, we can wait a little longer.”<br/><br/>Wang Xian nodded his head in agreement.<br/><br/>He had not reached his limit yet. With sufficient resources, he could still make another breakthrough.<br/><br/>If Wang Xian were to make another breakthrough, he would be an existence at the level of chaos.<br/><br/>At that time, he would be able to crush the entire void universe.<br/><br/>“However, I plan to go to the Void universe to take a look!”<br/><br/>Wang Xian spoke with a hint of coldness in his eyes.<br/><br/>This time, if the Void Universe dared to attack the Dragon Palace, they would have to pay a price!<br/><br/>Moreover, Wang Xian had always wanted to verify one thing.<br/><br/>That was whether the teleportation location in an Lie’s mind was the Void Universe.<br/><br/>If it was, he could ask an lie to bring him there directly.<br/><br/>He could stroll around the Void universe.<br/><br/>He could also make the Void Universe pay a price!<br/><br/>“HMM? Dragon King, are you planning to go to the Void Universe?”<br/><br/>As soon as he finished his sentence, the elven empress and the rest looked at Wang Xian in astonishment.<br/><br/>Wang Xian nodded.<br/><br/>“Dragon King, you have to be careful if you want to go to the Void Universe.”<br/><br/>The Shadow Devil Emperor reminded him solemnly.<br/><br/>“Don’t worry, I will be fine.”<br/><br/>Wang Xian smiled confidently. He had a treasure that could resurrect him. Even if something really happened to him, he would be able to resurrect himself.<br/><br/>At most, he would lose a mother’s womb fruit.<br/><br/>Wang Xian could afford such a loss.<br/><br/>Currently, a few more mother’s womb fruits in the dragon palace had matured.<br/><br/>All in all, the treasure that could resurrect him was enough for him to use.<br/><br/>“Dragon King, you are really vengeful. It’s their bad luck that the Void Universe provoked you.”<br/><br/>The Abyss race ancestor smiled. “I rather admire your style of doing things.”<br/><br/>Wang Xian smiled.<br/><br/>The group chatted for a while more before leaving.<br/><br/>This time, the Void Universe had invaded the nine-origin universe. Although the nine-origin universe had suffered a lot of losses.<br/><br/>However, both parties had already understood the strength of the nine-origin universe and the Void Universe.<br/><br/>In the future, if the Void Universe dared to deal with the nine-origin universe again, they would have to consider whether they could bear the wrath of the nine-origin universe!<br/><br/>At the same time, while Wang Xian and the rest were talking and discussing.<br/><br/>The universe’s AI brain was completely boiling.<br/><br/>Tian Yuan destiny-level powerhouses were erupting all over the center of the heaven-opening primeval continent.<br/><br/>The terrifying might could even be sensed by the planets around the heaven-opening primeval continent!<br/><br/>This shocked everyone.<br/><br/>When all the strong disciples learned that the Tian Yuan destiny-level powerhouses from the Void Universe had invaded the nine-origin universe, they were even more shocked!<br/><br/>“The Void Universe, under the leadership of the King of Void, invaded our nine-origin universe wantonly. All the peak races were attacked. This is too terrifying!”<br/><br/>“The saint bloodline suffered heavy losses. Even the Hetian saint was killed by the Void King once. At least one-third of the saint bloodline’s disciples were killed!”<br/><br/>“Is this the terror of the Apocalypse? Even the peak races were attacked. This is too terrifying!”<br/><br/>“The Void Universe invaded us. It was too tragic in such a short time. If it wasn’t for the Dragon King from the Dragon Palace, the saint bloodline would have been destroyed!”<br/><br/>“When the experts of the Void universe came to ambush us, I was not far from the Dragon Palace. I saw the battle there. F * ck, the strength of the Dragon King of the Dragon Palace is simply heaven-defying. The Emperor of the Phoenix also participated in the battle. He wanted to attack the Dragon Palace but was instantly killed by the Dragon King. Yes, he was easily killed. In addition, a heavenly origin creation realm expert of the Void Universe was also killed by the Dragon King. The Dragon King is too powerful!”<br/><br/>“The Dragon King’s strength is indeed extremely terrifying. He easily suppressed the intruders. In addition, besides the Dragon King and Lord Lin Niu, there’s also an existence at the Heavenly Kismet Realm in the Dragon Palace. It seems to be a dragon queen of the Dragon Palace!”<br/><br/>“This time, the Dragon Palace has displayed three experts at the Heavenly Kismet Realm. They’re too powerful!”<br/><br/>“Our Demon race also has an expert at the Heavenly Kismet Realm. Only now do we know.”<br/><br/>“The Void King of the Void Universe was defeated by the Dragon King and the others. Although the other party’s sneak attack caused a great loss to our nine-origin universe, the strength of the Lords of our nine-origin universe is also abnormally strong and invincible!”<br/><br/>“I feel that the Dragon King of the Dragon Palace is somewhat invincible. He’s too strong!”<br/><br/>On the universe’s AI, countless powerful disciples were discussing.<br/><br/>They were discussing the outcome of this battle.<br/><br/>They were discussing the situation of this battle.<br/><br/>The battle results of the Dragon Palace shocked the entire nine-origin universe.<br/><br/>The Emperor of the Phoenix was instantly killed by the Dragon King.<br/><br/>A void universe expert was killed!<br/><br/>This battle result was too strong!<br/><br/>In this battle, only the Dragon King killed a powerful enemy.<br/><br/>Wang Xian didn’t know about the discussion on the universal AI.<br/><br/>At this moment, he had already arrived at the Dragon Palace.<br/><br/>This time, the sudden attack from the void universe had caused some casualties among the disciples of the Dragon Palace. However, it was not a big problem.<br/><br/>The loss of the Dragon Palace was considered the best among all the peak races!<br/><br/>Furthermore, this time, the Dragon Palace had obtained the corpse of the Emperor of the Phoenix and a control-level void universe master.<br/><br/>“The corpse of this void universe master, coupled with the strength of those who believe in the universe, is enough to improve my void dragon body by quite a bit!”<br/><br/>Wang Xian thought to himself.<br/><br/>Overall, the gains of the Dragon Palace this time were greater than the losses.<br/><br/>“An lie!”<br/><br/>With a thought, he called an lie over.<br/><br/>“Dragon King!”<br/><br/>Very soon, an Lie’s figure appeared in the Dragon King’s Hall. He bowed respectfully to Wang Xian!<br/><br/>“Get Ready. Let’s go to the locations in your mind where we can teleport. We will teleport there directly.”<br/><br/>Wang Xian spoke to an lie!<br/><br/>An lie was a mutated existence of the devil spirit altar.<br/><br/>The coordinates of the devil spirit altar were in his mind.<br/><br/>He could teleport to these coordinates.<br/><br/>An lie had teleported once before. In the end, he realized that it was not the nine-origin universe.<br/><br/>It belonged to another universe.<br/><br/>An Lie’s essence was still the space attribute, and he could absorb the space attribute to improve.<br/><br/>Because of an Lie’s special nature, the Dragon Palace also far surpassed the other disciples in nurturing an lie.<br/><br/>At present, an lie already had the strength of a level nine universe ruler.<br/><br/>The reason why he hadn’t reached the peak of the ruler realm was because an Lie’s breakthrough was much more difficult than ordinary space attribute cultivators!<br/><br/>“Dragon King, are we going over? That might be the Void Universe.”<br/><br/>An Lie’s eyes lit up as he guessed!\t\t\t\t\t\t</div>", "images": {}, "success": true}