{"id": 1265, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074786.html", "title": "Chapter 4268 - Chapter 4268: 4267 Also Went Forward", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4268 - Chapter 4268: 4267 Also Went Forward</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4268: 4267 also went forward<br/><br/>Translator: 549690339<br/><br/>“The king of Void has escaped!”<br/><br/>“Who is that Heavenly Yuan Destiny Realm Expert? He seems to be from the demon race.”<br/><br/>“He should be from the demon race. The Dragon King of Dragon Palace is so powerful. It Won’t be a problem to fight against the King of Void Alone!”<br/><br/>“Our saint lineage suffered a terrible loss this time. Fortunately, the Dragon King and the others came relatively quickly. If they had come a little later, we would have been killed!”<br/><br/>“Sigh, this time, our saint lineage has lost tens of millions of disciples. They deserve to die in the Void Universe!”<br/><br/>When the void King left, all the saint lineage disciples saw the end of the battle and discussed among themselves.<br/><br/>There was a hint of sadness on their faces.<br/><br/>This time, the saint lineage was too miserable!<br/><br/>“Phew!”<br/><br/>When he saw the king of void leave, he heaved a heavy sigh of relief.<br/><br/>In just a short period of time, he was killed by the king of Void once.<br/><br/>He was also heavily injured.<br/><br/>It could be said to be extremely tragic.<br/><br/>If not for the arrival of Wang Xian, the entire saint’s lineage would have been destroyed.<br/><br/>Furthermore, the universe’s artificial intelligence could have been taken away by the king of Void.<br/><br/>“Thank you, Dragon King, for coming to rescue us. Thank you, brother from the demon race!”<br/><br/>The Hetian saint immediately cupped his hands in gratitude to Wang Xian and Jiuli.<br/><br/>“We are duty-bound for the invasion of the Void Universe!”<br/><br/>Wang Xian shook his head.<br/><br/>“How did the experts from the Void Universe come here this time? How did they manage to come to the interior of our nine-origin universe in an instant?”<br/><br/>Jiu Li asked with a look of astonishment on his face.<br/><br/>In the nine-origin universe, especially in the heaven-opening desolate land, they could instantly sense the arrival of a heaven-origin creation-level expert.<br/><br/>Before the other party came over, the peak races of the nine-origin universe were already able to react.<br/><br/>This sudden attack from the void universe could be said to be extremely sudden. It was something that even the peak races did not expect.<br/><br/>“It should be related to the emperor of the Phoenix!”<br/><br/>Wang Xian’s eyes revealed a cold expression as he spoke!<br/><br/>“The Emperor of the Phoenix?”<br/><br/>When he heard that, he was slightly stunned. “He was involved?”<br/><br/>“He and the experts from the Void Universe attacked our Dragon Palace. However, I killed him!”<br/><br/>Wang Xian spoke.<br/><br/>“The emperor of the Phoenix could enter our place without being discovered. It’s possible that he was the mole. This D * MN Guy!”<br/><br/>The He Tian Saint spoke with a gloomy expression!<br/><br/>“After the other side is done, let’s gather and discuss. Lock the Emperor of the Phoenix out of our nine-origin universe!”<br/><br/>Wang Xian’s eyes flickered as he spoke!<br/><br/>The He Tian saint nodded his head.<br/><br/>This time, if it wasn’t for the Emperor of the Phoenix, their saint lineage wouldn’t have suffered such heavy losses!<br/><br/>After the king of void left, the other heaven origin creation realm powerhouses in the Void Universe also left quickly!<br/><br/>They were already resisting with great difficulty. After receiving the king’s message, they heaved a heavy sigh of relief!<br/><br/>After the fallen Shadow Demon Emperor and the other powerhouses in the Void Universe left, they saw the message in their communication devices and immediately rushed toward the saint lineage through the teleportation array!<br/><br/>“Is there a big problem?”<br/><br/>The group of Heavenly Yuan creation realm experts arrived. The Fallen Shadow Demon Emperor looked around and asked the Hetian saint.<br/><br/>“Many of my disciples were killed or injured.”<br/><br/>The Hetian saint shook his head helplessly. “The Dragon King said that this matter is related to the emperor of the Phoenix. Next, we have to take some precautions against the emperor of the Phoenix!”<br/><br/>“The Emperor of the Phoenix? I told you that without an insider, the experts in the Void universe wouldn’t be able to enter our faction. This damn guy actually allied with the Void Universe!”<br/><br/>One of the 12 ancestral witches said with a face full of killing intent.<br/><br/>“Next, we will extract the bloodline of the Phoenix. In the future, as long as the emperor of the Phoenix enters the heaven-opening primal continent, we will send out an alarm!”<br/><br/>The 12 ancestral witches continued to say.<br/><br/>This kind of defense was what the 12 ancestral witches were best at.<br/><br/>As long as they had enough resources, their array formation could even cover the entire heaven-opening primal continent!<br/><br/>“The strength of the Void universe is much stronger than the last calamity!”<br/><br/>The Fallen Shadow Demon Emperor spoke at this moment, “There are two control-level experts from our demon race. Dragon King, how many do you have?”<br/><br/>“I have two here as well!”<br/><br/>Wang Xian spoke!<br/><br/>“The ones from our side are all at the beginner-level. However, because they are of the spatial attribute, they are a little difficult to deal with!”<br/><br/>Elven empress Xuanwu and the rest also spoke up.<br/><br/>“In other words, there are currently 12 heaven origin creator-level powerhouses in the Void Universe. One of them is at the void King’s Great Dao level, four are at the control level, and seven are at the beginner-level.”<br/><br/>The Hetian Saint spoke up.<br/><br/>“Our strength is not weaker than theirs. In fact, we are even a little stronger. From now on, the Void Universe will no longer dare to provoke our nine origin universe, nor will they dare to come and snatch the universe’s intelligence brain!”<br/><br/>The Fallen Shadow Demon Emperor opened his mouth and looked at Wang Xian, there was a hint of doubt on his face. “Dragon King, Your Dragon Palace was able to rush over so quickly despite the invasion of two control-level powerhouses and the Emperor of the Phoenix. It seems that the Dragon Palace’s strength is stronger than what we imagined.”<br/><br/>“It’s just one more heaven origin creation-level powerhouse. If I were to kill the Emperor of the Phoenix and one powerhouse from the Void universe within a short period of time, my void Dragon Body, Lin Niu, and the others would be able to tie down another void universe powerhouse before they could rush over!”<br/><br/>Wang Xian smiled and said!<br/><br/>“You killed one?”<br/><br/>A hint of shock flashed in the eyes of the fallen Shadow Demon Emperor. “If that’s the case, including the 12 ancestral warlocks in our nine-origin universe, we have 15 heaven origin creation stage existences.”<br/><br/>“15. Senior Dragon King and Fallen Shadow Demon Emperor, all of you are at the Great Dao stage. The control stage includes me, the elven empress, Patriarch Xuanwu, and the 12 ancestral warlocks. In the nine-origin universe, there are barely five heaven synthesis stage existences. Hehe, our overall strength is already a little stronger than the Void Universe!”<br/><br/>The Patriarch of the Dark Race said with a smile!<br/><br/>“Then should we go to the Void Universe and take a look?”<br/><br/>The Elven Empress’eyes flickered slightly as she said with a smile!<br/><br/>In the past, the Void Universe had always had the upper hand.<br/><br/>It was the 9-origin universe that was at a disadvantage.<br/><br/>Now that the strength of the 9-origin universe had already surpassed them, they could totally counterattack!<br/><br/>“There’s no rush. We haven’t reached our limit yet. Even if we go over, we can’t kill too many of their disciples when they are ready.”<br/><br/>Fallen Shadow Demon Emperor pondered for a moment and shook his head. “Right now, there are still two disciples in our nine-origin universe who can break through. We should try to break through as soon as possible. If they can break through as soon as possible, we might be able to give it a try.”<br/><br/>Having two more heavenly Yuan blessed realm experts was still of great use in the battle.\t\t\t\t\t\t</div>", "images": {}, "success": true}