{"id": 1267, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074794.html", "title": "Chapter 4270 - Chapter 4270: 4269 Palace Of The Void Dynasty", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4270 - Chapter 4270: 4269 Palace Of The Void Dynasty</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4270: 4269 palace of the Void Dynasty<br/><br/>Translator: 549690339<br/><br/>“Go over!”<br/><br/>Wang Xian looked at an lie. With a wave of his arm, the tai chi dragon disc wrapped around his entire body!<br/><br/>An lie nodded his head in excitement. With a move of his body, he disappeared with Wang Xian in an instant!<br/><br/>In the past, an lie had once entered these unfamiliar coordinates, but he encountered a crisis.<br/><br/>When he was teleported over, there was a terrifying existence!<br/><br/>Since that time, an lie did not take any risks.<br/><br/>Wang Xian also forbade him from taking any risks.<br/><br/>After all, an Lie’s strategic position in the Dragon Palace was still very high.<br/><br/>It was still more important in the Dragon Palace.<br/><br/>Buzz<br/><br/>When an lie teleported with Wang Xian, Wang Xian narrowed his eyes slightly. The surrounding scenery changed!<br/><br/>A figure that was at least 100 meters tall was staring at Wang Xian and an lie.<br/><br/>This figure had the appearance of a human. However, it was much larger than a human. There was no mouth or nose on its face. Instead, there were many strange pupils!<br/><br/>It looked horrifying!<br/><br/>Its body was emitting the aura of a Master of the universe!<br/><br/>Buzz<br/><br/>Before he could react, Wang Xian waved his arm and channeled the soul-absorbing power into his mind.<br/><br/>Following that, a stream of information was transmitted into Wang Xian’s mind!<br/><br/>“Huh?”<br/><br/>After receiving this information, Wang Xian raised his eyebrows slightly!<br/><br/>“So Yaoxie was transmitted from the Void universe. Due to the characteristics of the nine-origin universe, Yaoxie lost the spatial attribute and instead possessed other attributes. In addition, their demonic altar was preserved.”<br/><br/>Wang Xian looked at the information in his mind and mumbled.<br/><br/>This was indeed the Void universe.<br/><br/>And this 100-meter tall humanoid monster belonged to the living beings in the Void universe.<br/><br/>In the Void Universe, the Void dynasty ruled everything!<br/><br/>However, the Void universe was so big that there were clans born in some places. They did not join the Void dynasty completely.<br/><br/>Furthermore, even within the area covered by the Void dynasty, there were some clans that existed.<br/><br/>After all, the void King could not win over the hearts of everyone.<br/><br/>The void King did not care about these weak clans.<br/><br/>Unless there was a heavenly yuan destiny realm powerhouse born within his clan, otherwise, he would not care.<br/><br/>Perhaps with his strength and status, these clans were no different from ants.<br/><br/>There was even a domain in the Void universe that the Void dynasty did not care about.<br/><br/>Within that domain, it was filled with killing and competition.<br/><br/>This was also a place that the Void dynasty had deliberately arranged, in order to nurture experts.<br/><br/>In the killing, experts could be born better.<br/><br/>As long as these experts waited for the calamity to erupt, when they went out to break through, the Void Dynasty would give them great treatment and recruit them.<br/><br/>In the Void universe, they bred Yaoxie and Yaoxie was their war machine!<br/><br/>However, none of Yaoxie’s strength had reached the ruler realm.<br/><br/>They could quickly nurture Yaoxie who was at the supremacy level, but it was very difficult for them to cultivate Yaoxie who was at the ruler level.<br/><br/>The place where Wang Xian and an lie had teleported over was called the giant-eyed planet!<br/><br/>The humans that lived on this planet were called the giant-eyed humans.<br/><br/>They were the type of humans that Wang Xian had just captured!<br/><br/>“It’s about a year’s journey from here to the Void Empire.”<br/><br/>Wang Xian calculated the distance based on the information.<br/><br/>The king of Void and the rest had just launched a sneak attack on the nine-origin universe. They should be rushing over quickly.<br/><br/>However, it would take at least 5,000 years to fly from the nine-origin universe to the Void Universe.<br/><br/>Even if they were to borrow some treasures, it would take at least a few hundred years.<br/><br/>As for returning to the Void Universe in an instant, Wang Xian felt that it was unlikely.<br/><br/>Not every universe would give birth to a special existence like an lie.<br/><br/>“If I can sense the Void dynasty quickly, I might be able to wreak havoc before they arrive!”<br/><br/>Wang Xian thought to himself.<br/><br/>“An lie, let’s go to the Void Dynasty!”<br/><br/>Wang Xian enveloped an lie with energy and brought him to the Void dynasty quickly!<br/><br/>He wanted to make use of the time difference to rush to the Void dynasty.<br/><br/>He wanted to make the Void Dynasty pay a terrible price!<br/><br/>Just as Wang Xian was flying towards the Void dynasty.<br/><br/>It was about a few years away from the nine-origin universe.<br/><br/>The king of Void and the rest were floating in the void.<br/><br/>Beside them, void towers were emitting terrifying energy!<br/><br/>The King of Void stood on top of a void tower and swept his subordinates with a gloomy expression!<br/><br/>“What’s going on at the Dragon Palace? Where’s Duke Xining?”<br/><br/>His gaze landed on one of his subordinates as he questioned coldly!<br/><br/>“Your Majesty, it’s Our Fault!”<br/><br/>The control-level powerhouse immediately faced the king of Void and knelt in the air with his head lowered. “Duke Xining was killed by the Dragon King. The strength of the Dragon Palace is far from what we expected.”<br/><br/>“The Dragon Palace has two heaven-origin creation-level powerhouses, two treasures that can unleash the might of the heaven-origin creation-level, and a divine dragon with the void attribute. This divine dragon came out of the Dragon Palace’s Dragon King’s body!”<br/><br/>“Besides, the Dragon King of the Dragon Palace is also very powerful. When I was entangled, Duke Xining was killed by the Dragon King in less than a minute. They are too powerful!”<br/><br/>The powerhouse reported respectfully with an embarrassed expression.<br/><br/>“So powerful? The Demon clan also has a heavenly yuan creation-level powerhouse. He is not in our calculations!”<br/><br/>The warrior in golden armor frowned and said from the side!<br/><br/>“If that’s the case, the overall strength of this 9-origin universe is already a little stronger than us!”<br/><br/>Another heaven origin creation realm warrior at the control level said with a frown!<br/><br/>The void King’s expression was extremely ugly when he heard that!<br/><br/>“How can this 9-origin universe improve so quickly? We’ve already improved enough this time. This 9-origin universe…”<br/><br/>A Tianyuan creator said in a deep voice. His expression was ugly!<br/><br/>The king of Void’s expression was extremely ugly!<br/><br/>If he was defeated this time, there might not be a next time!<br/><br/>“Let’s go back first!”<br/><br/>He said in a deep voice. He entered the Void Pagoda and immediately flew towards the Void Universe!<br/><br/>His subordinates immediately followed!<br/><br/>A year passed very quickly.<br/><br/>In a void space in the void space, Wang Xian was flying at a high speed with dark ferocity.<br/><br/>In a year’s time, Wang Xian avoided life planets one by one.<br/><br/>Along the way, he met some experts from the void space. Under his soul control, Wang Xian obtained more information about the Void dynasty!<br/><br/>The Palace of the Void Dynasty was located at the center of the Void Space.<br/><br/>This was the place with the densest spatial attribute.<br/><br/>Dozens of planets were transformed into an incomparably huge palace of the Void dynasty!<br/><br/>The Strongest Army and the most Elite Forces of the Void Universe were gathered there!\t\t\t\t\t\t</div>", "images": {}, "success": true}