{"id": 1273, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074818.html", "title": "Chapter 4276 - Chapter 4276: Saint 4275 Was Heartless And Treated All Living Things As His Own", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4276 - Chapter 4276: Saint 4275 Was Heartless And Treated All Living Things As His Own</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4276: Saint 4275 was heartless and treated all living things as his own<br/><br/>Translator: 549690339<br/><br/>Boom! Boom! Boom<br/><br/>A rumbling sound rang out as the scholar began his breakthrough!<br/><br/>The energy of the entire universe began to gather.<br/><br/>Saint Hetian watched this scene quietly with an expectant look on his face.<br/><br/>Once the scholar made a breakthrough, their saint lineage would have one more powerhouse in the Heaven’s origin realm.<br/><br/>This was very important to their branch of saints!<br/><br/>Wang Xian stood at the side and watched quietly.<br/><br/>The water energy tide began to gather.<br/><br/>On some distant planets, the huge energy tide attracted the attention of countless powerhouses.<br/><br/>They all looked over in this direction.<br/><br/>At the same time, it was located in the center of the sky-absorbing universe.<br/><br/>In the center of the sky-absorbing universe, there was a huge continent where the saints of the sky-absorbing universe lived.<br/><br/>The entire continent was inhabited by the people of the Saints of the sky-absorbing universe!<br/><br/>In the Great Hall in the center of the continent, two heaven origin creation powerhouses of the sky-absorbing universe were sitting in the Great Hall.<br/><br/>In front of them were three old men in black robes.<br/><br/>The old men were emitting a terrifying aura of the dead spirit.<br/><br/>The dead silent energy was lingering around their bodies.<br/><br/>Disciples at the venerable realm would probably be infected by the Dead Spirit Energy and die instantly just by looking at the three black-robed old men!<br/><br/>The two saints from the Na Tian universe were talking to the three black-robed old men.<br/><br/>At this moment, they were slightly stunned. They immediately stood up and looked in one direction!<br/><br/>“You’re courting death. There’s actually an expert who dares to break through in our Natiantian Universe!”<br/><br/>A saint from the natiantian universe had a cold look in his eyes. His face was filled with killing intent as he growled in a low voice!<br/><br/>“Let’s settle this matter first. As for the other transactions, we’ll talk about it later!”<br/><br/>The other saint from the natiantian universe focused his gaze and said to the three black-robed elders.<br/><br/>As the sound of his voice faded, their bodies moved and they quickly flew towards the location where the energy gathered.<br/><br/>“Whoosh! Whoosh!”<br/><br/>They came to a teleportation array and directly teleported over a long distance!<br/><br/>“Hehe, let’s go take a look too!”<br/><br/>The three black-robed elders smiled and followed closely behind.<br/><br/>In a universe, regardless of whether it was strong or weak, when the calamity arrived, they would set up teleportation arrays to deal with all kinds of problems.<br/><br/>They were naturally prepared for the Na Tian universe.<br/><br/>Moreover, the subjugation heaven universe was not a weak universe.<br/><br/>The two saints from the Subjugation Heaven universe soon arrived at the nearest planet.<br/><br/>Their eyes were staring straight ahead, filled with cold light.<br/><br/>Boom! Boom! Boom<br/><br/>They unleashed all their might and flew straight in that direction.<br/><br/>Behind them, three black-robed elders followed them. They looked at this scene with a smile.<br/><br/>“They’re here!”<br/><br/>At this moment, Wang Xian, who was floating quietly in the air, sensed that an expert was coming. He spoke faintly.<br/><br/>“Are they here?”<br/><br/>A hint of wariness appeared on the face of the Hetian Sage.<br/><br/>Breaking through to other universes was an extremely difficult task.<br/><br/>One needed to find a universe that one could break through to.<br/><br/>One needed to deal with the experts in this universe.<br/><br/>Under normal circumstances, if a peak-level ruler did not have a dao protector, breaking through would be a narrow escape.<br/><br/>In this life, he had found an extremely weak universe.<br/><br/>Here, before the heavenly fate realm expert could react, he would break through and escape.<br/><br/>If it was like the sky-absorbing universe, a peak-level ruler without a dao protector, breaking through here would be courting death.<br/><br/>Furthermore, even if there were dao protectors, they had to be at the Great Dao level.<br/><br/>Otherwise, there would still be danger.<br/><br/>Boom Boom<br/><br/>“I don’t care which Cosmos you are from. Get out immediately. Otherwise, I will make your cosmos pay a terrible price!”<br/><br/>Before the two saints from the Na Tian Cosmos could fly over, their murderous voices had already pierced through.<br/><br/>Boom<br/><br/>Wang Xian looked in their direction and waved his hand.<br/><br/>A terrifying dragon claw attacked them directly!<br/><br/>The Dragon Claw blotted out the sky and covered the sun, exuding the might of the Great Dao.<br/><br/>“Huh?”<br/><br/>The two powerhouses from the sky-holding universe who were charging over felt the terrifying might of the Dragon Claw and their expressions changed slightly.<br/><br/>They hurriedly dodged to the side!<br/><br/>“I want a spot. Don’t force me to make a move!”<br/><br/>Wang Xian stared at them and spoke indifferently!<br/><br/>“A powerhouse of the Great Dao Level?”<br/><br/>The expressions of the two saints of the entire universe changed. They dodged Wang Xian’s attack and flew over to glance at the scholar who had achieved a breakthrough, the Hetian saint, and finally, Wang Xian.<br/><br/>Wang Xian locked onto them quietly and didn’t say anything else!<br/><br/>Deterrence!<br/><br/>There was no need for sound!<br/><br/>Only strength was required!<br/><br/>“Great Dao level. Don’t think that just because you are at the Great Dao level, you can occupy the saint spot in our universe. We don’t care what kind of powerhouse you are. If you dare to occupy the saint spot in our universe, you will have to pay the price!”<br/><br/>“We are not your match, but we will go to your universe. Then, the blood of the living beings in your universe will pay the price for this spot!”<br/><br/>“This is not a warning!”<br/><br/>The two saints from the universe stared at Wang Xian and the rest with a grim expression and threatened them directly.<br/><br/>“Oh?”<br/><br/>Wang Xian’s face was full of surprise when he heard their sudden threat.<br/><br/>“Hehe, you want to cause trouble in our universe? Aren’t you afraid that we will destroy your universe?”<br/><br/>The Hetian saint also frowned slightly and spoke with a cold expression!<br/><br/>“Anyone who dares to snatch the spot of Saint in our universe will have to pay a price. Even if we suffer a great loss, we are not warning you again.”<br/><br/>The two saints from the universe were still staring at Wang Xian and the rest with murderous intent as they spoke!<br/><br/>“With just the two of you?”<br/><br/>Wang Xian listened to their threats and narrowed his eyes slightly. A sinister expression appeared on his face as well!<br/><br/>However, at this moment, he sensed everything and looked behind them.<br/><br/>“Haoyang saint, looks like you guys are in trouble. There are 10,000 beings from high-level planets. How about we help you guys?”<br/><br/>At this moment, three black-robed figures flew over at an extremely terrifying speed.<br/><br/>They had a strange smile on their faces as they swept their gaze across Wang Xian and the rest. Their gaze landed on the two saints from the entire universe.<br/><br/>“Oh? This is bad!”<br/><br/>When the He Tian saint saw the three black-robed old men who had suddenly appeared and sensed the aura from their bodies, his expression changed slightly!<br/><br/>“Two in control, one just entered!”<br/><br/>Wang Xian looked at the three other heaven origin creation stage powerhouses who had appeared. His gaze flickered slightly.<br/><br/>However, it was obvious that they did not belong to the Na Tian universe.<br/><br/>“There’s no need. If they dare to snatch the spot of our na Tian universe, we will slaughter the living beings in their universe and make them pay a heavy price!”<br/><br/>The two heaven origin creation stage powerhouses in the Na Tian universe shook their heads coldly and stared at Wang Xian and the rest. They continued to threaten them, “Even if you want to exterminate the living beings in our na Tian universe, you will still have to pay a heavy price!”<br/><br/>“I advise you not to provoke us!”<br/><br/>The two of them spoke in an eerie manner. Their eyes were filled with coldness and killing intent!\t\t\t\t\t\t</div>", "images": {}, "success": true}