{"id": 1272, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074814.html", "title": "Chapter 4275 - Chapter 4275: 4274 Protected The Path Once Again!", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4275 - Chapter 4275: 4274 Protected The Path Once Again!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4275: 4274 protected the path once again!<br/><br/>Translator: 549690339<br/><br/>“It’s time for me to go out and take a look!”<br/><br/>The increase in his strength once again gave Wang Xian the idea of going out!<br/><br/>In Wang Xian’s opinion, it was a little difficult for him to increase the strength of a heaven’s origin creator.<br/><br/>His body of the Void Divine Dragon had absorbed the corpses of two control-level powerhouses before he managed to achieve a breakthrough. In order to achieve a rapid breakthrough, he would need even more resources!<br/><br/>In fact, he would even need a lot of time!<br/><br/>He was prepared to go to other universes to see if he could find some opportunities!<br/><br/>Buzz! Buzz<br/><br/>Just as Wang Yun was thinking about where to go…<br/><br/>The Hetian Saint suddenly sent him a message!<br/><br/>After seeing this message, his eyes flickered slightly!<br/><br/>“Dragon King, the Hetian Saint Is Here!”<br/><br/>Not long after, Prime Minister GUI reported!<br/><br/>“Yes, please come in, the Hetian Sage!”<br/><br/>Wang Xian nodded.<br/><br/>After the battle with the Void Universe, the position of the Dragon Palace had improved tremendously in the nine-origin universe.<br/><br/>Now, all the strong disciples knew that the Dragon Palace was the most powerful existence in the nine-origin universe.<br/><br/>There were already three heaven-origin creation-level existences!<br/><br/>The strength of the Dragon King of the Dragon Palace was even more terrifying!<br/><br/>Now, there were experts who guessed that he might be much stronger than the Fallen Shadow Devil Emperor!<br/><br/>Now that Saint Hetian had come to the Dragon Palace, he had to inform and report in advance!<br/><br/>Unknowingly, Wang Xian’s status in the nine-origin universe was already very high!<br/><br/>“Dragon King!”<br/><br/>“Greetings, Dragon King!”<br/><br/>Saint Hetian arrived with a disciple of the saint’s lineage by his side.<br/><br/>Wang Xian knew this disciple, the scholar.<br/><br/>Back then, he was competing with Queen of floating water and the rest for the last water-elemental disciple in the nine-origin universe.<br/><br/>Now, he should be able to achieve a breakthrough!<br/><br/>“HMM, Saint of Unity, is this disciple of your saint’s lineage about to achieve a breakthrough?”<br/><br/>Wang Xian gave them a seat and asked Saint of Unity.<br/><br/>“Yes, Dragon King. I have found a suitable universe.”<br/><br/>The Hetian sage nodded his head and said, “The sky-absorbing universe is a universe with two cultivators in the Heaven’s origin realm. However, the two powerhouses in this universe have the ability to control the universe!”<br/><br/>“No problem. I have time now. I can set off immediately!”<br/><br/>Wang Xian nodded his head. In his opinion, the strength of this universe was not strong. There was no big problem!<br/><br/>“Thank you, Dragon King. Let’s set off as soon as possible!”<br/><br/>“Thank you, Dragon King, for protecting the way!”<br/><br/>Saint Hetian stood up and cupped his hands to express his gratitude.<br/><br/>The scholar even knelt on the ground.<br/><br/>“No need. Get Up. We will rush over immediately!”<br/><br/>Wang Xian waved his hand. A wave of energy enveloped Saint Hetian and the scholar.<br/><br/>“Saint Hetian, show us the way!”<br/><br/>He opened his mouth and led them out.<br/><br/>Wang Xian’s current strength was not something that Saint Hetian could compare to in terms of speed!<br/><br/>Therefore, in order to save time, it was the best choice for him to lead them out.<br/><br/>“Dragon King, in that direction, it’s about a few thousand years away from our nine-origin universe. That place is at the edge of the Justice Sequence Alliance. However, that universe doesn’t belong to the Justice Sequence Alliance. Instead, it’s a neutral universe!”<br/><br/>The Hetian Saint spoke to Wang Xian!<br/><br/>“No problem. It doesn’t matter even if it’s the universe of the Justice Sequence Alliance.”<br/><br/>Wang Xian shook his head.<br/><br/>He had stayed in the justice universe for a period of time.<br/><br/>He had a very clear understanding of the Justice Sequence Alliance.<br/><br/>In the universe of the Justice Sequence Alliance, when they encountered some danger, they had to pay resources to seek help from the experts in the alliance.<br/><br/>After all, it was impossible to be protected by the Alliance just by joining the Alliance!<br/><br/>There was a reward for the effort.<br/><br/>The better part was that the price to join the alliance and seek the protection of the powerhouses was relatively lower.<br/><br/>It was more affordable!<br/><br/>There were still many benefits for a weak universe to join the Justice Sequence Alliance!<br/><br/>Wang Xian had to protect the path for the disciples of the nine-origin universe, regardless of whether they were from the Justice Sequence Alliance or the evil faction.<br/><br/>As a neutral nine-origin universe, he could do whatever he wanted.<br/><br/>Strength was the most important thing.<br/><br/>Moreover, the current strength of the nine-origin universe was strong enough.<br/><br/>“Thank you, Dragon King!”<br/><br/>The Unity Saint said gratefully once again!<br/><br/>“No need. Speaking of which, if it wasn’t for the Emperor of the Phoenix, your saint lineage wouldn’t have suffered such a huge loss!”<br/><br/>Wang Xian shook his head and said nonchalantly.<br/><br/>“This is the good fortune of the saint lineage. We have the universe’s artificial intelligence, so we have to bear some costs!”<br/><br/>The He Tian saint shook his head as well. “This will happen sooner or later. However, with the Dragon King around, this won’t happen again.”<br/><br/>As he spoke, a smile appeared on his face.<br/><br/>Although their saint lineage suffered a huge loss this time, it had something to do with the Dragon King and the Emperor of the Phoenix.<br/><br/>However, in the long run, it would be of great benefit to them.<br/><br/>After this incident, the Void Universe did not dare to step into the Void universe anymore.<br/><br/>Wang Xian smiled and chatted with the unity saint. They quickly shuttled through the Chaos!<br/><br/>“Dragon King, it’s the universe in front of us!”<br/><br/>Three thousand years later, the Unity Saint pointed to a universe in front of them and spoke to Wang Xian!<br/><br/>Wang Xian nodded and looked at the universe in front of him.<br/><br/>During the Cataclysm, the universe was like a huge sun. It was exceptionally eye-catching.<br/><br/>After flying for a full year, Wang Xian and the rest finally arrived at the edge of the universe.<br/><br/>Wang Xian and the rest entered the universe and scanned their surroundings.<br/><br/>The energy contained in the universe was the same as the nine-origin universe.<br/><br/>In fact, most of the universes had the five elements, wind, thunder, and light.<br/><br/>These attributes were the mainstream of the universe!<br/><br/>“Can I make a breakthrough?”<br/><br/>Wang Xian looked at the scholar and asked him.<br/><br/>“Dragon King, there are spots for me to make a breakthrough in this universe!”<br/><br/>The scholar nodded his head.<br/><br/>“Let’s go then. Choose a place to make a breakthrough!”<br/><br/>Wang Xian nodded his head and spoke to him!<br/><br/>Saint he Tian also nodded his head.<br/><br/>They flew forward for some distance to ensure that they had sufficient energy!<br/><br/>It took time for a heaven’s origin powerhouse to break through.<br/><br/>The closer they were to the center of the universe, the more energy there was and the shorter the time needed for a breakthrough!<br/><br/>If they were at the edge of the universe, the time needed for a breakthrough could be several months or even longer.<br/><br/>At the edge of the universe, the water elemental energy was too thin. They flew forward for a day!<br/><br/>“This is more or less the same. Let’s Make a breakthrough!”<br/><br/>After flying for a day, he could sense the existence of life planets in front of him. Wang Xian decided to make a breakthrough here!<br/><br/>Once he made a breakthrough, he would attract the attention of the powerhouses in the Heaven’s origin realm in this universe.<br/><br/>However, Wang Xian did not care!<br/><br/>The strength of this universe was nothing to him!<br/><br/>“It’s the Dragon King!”<br/><br/>The scholar nodded his head in excitement. His body moved and he flew directly into the sky.<br/><br/>Boom<br/><br/>His body shook and a majestic energy was emitted.<br/><br/>The color of the world began to change.<br/><br/>The water elemental energy was gathering towards him.<br/><br/>At this moment, the entire universe could sense that a strong person was breaking through!\t\t\t\t\t\t</div>", "images": {}, "success": true}