{"id": 1271, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074810.html", "title": "Chapter 4274 - Chapter 4274: 4273 Increase In Strength!", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4274 - Chapter 4274: 4273 Increase In Strength!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4274: 4273 increase in strength!<br/><br/>Translator: 549690339<br/><br/>When the king of Void was powerless to roar, Wang Xian had already returned to the Dragon Palace under the lead of an lie!<br/><br/>This time, Wang Xian had reaped a huge harvest!<br/><br/>A large number of space-type treasures and corpses were a terrifying resource for the Dragon Palace!<br/><br/>Just these corpses could greatly increase the strength of the Dragon Palace.<br/><br/>After all, these were 500,000 ruler realm experts!<br/><br/>And they were all at least at the ruler realm level 3.<br/><br/>Among them, there were more than 100 peak ruler realm experts!<br/><br/>These were all the elites of the Void dynasty.<br/><br/>The Void dynasty didn’t expect their losses to be so tragic.<br/><br/>They would never have thought that their safest palace would suffer such a terrifying attack!<br/><br/>“However, it’s a pity that the treasures obtained this time are useless to the Dragon Palace. They are going to sell them off!”<br/><br/>Wang Xian mumbled.<br/><br/>A large number of divine herbs, divine trees, and gemstones with spatial attributes were simply too much.<br/><br/>These resources were huge.<br/><br/>However, the Dragon Palace could not use them!<br/><br/>“There is one treasure that I can cultivate. If I can upgrade it, my void Dragon Body will also have a powerful treasure that can greatly enhance my strength!”<br/><br/>As Wang Xian spoke, he moved his palm and a spatial attribute pool appeared in front of him!<br/><br/>This was a pool that stored the power of space. The power of space in the pool flowed like half of a liquid!<br/><br/>The entire pool was 10,000 meters in size and could be even bigger!<br/><br/>It was a pity that this pool of space absorbed the power of space and turned into a liquid.<br/><br/>When the liquid in the pool was full, it would possess the power of the Heaven’s origin creation realm!<br/><br/>Such a treasure would be an exceptionally powerful existence in any universe.<br/><br/>It must have been obtained by the king of Void who had obtained a huge opportunity!<br/><br/>A treasure that was comparable to the Tianyuan blessed realm could be said to be the best other than the Tianyuan Blessed Supreme Treasure!<br/><br/>It was just like Wang Xian’s five elements grinding mill and the Tai Chi Dragon Plate!<br/><br/>However, such a treasure had a flaw. This flaw also caused them to never be able to compare to the Tianyuan blessed supreme treasure.<br/><br/>That was, they were already at their limit when they were upgraded to the Heaven’s origin creation stage!<br/><br/>At most, they could be comparable to an initial heaven’s origin creation stage powerhouse.<br/><br/>Even so, this was a treasure that could drive a heaven’s origin creation stage powerhouse crazy.<br/><br/>This was much more powerful than the fragments of the ultimate treasure of the Heaven’s origin creation stage!<br/><br/>“This pond should only take a few billion years to reach the Heaven’s origin creation stage.”<br/><br/>Wang Xian looked at it and calculated in his heart.<br/><br/>He hesitated for a moment and threw a large number of space gemstones into the pool!<br/><br/>Buzz<br/><br/>Pieces of space gemstones landed on the surface and were slowly assimilated by the space power in the pool, turning into some liquid!<br/><br/>“Eh? It can be accelerated!”<br/><br/>Wang Xian’s eyes lit up when he saw that. He threw a large number of space gemstones into the pool!<br/><br/>This method of his was a very extravagant act. It could even be said to be a very wasteful act.<br/><br/>This was because this pool could automatically absorb the power of space and slowly condense it into liquid energy.<br/><br/>It would only take a few billion years for it to transform!<br/><br/>The space gems that Wang Xian threw into the pool were all in the ruler realm.<br/><br/>Every single one of them was extremely precious!<br/><br/>In the Void universe, this was also the top-grade space God stone that the ruler realm experts hoped to obtain!<br/><br/>To the heaven origin blessed realm experts, time was of the lowest value.<br/><br/>Therefore, the king of Void did not use the space stones to create this space pool!<br/><br/>It was too wasteful.<br/><br/>These space god stones could be used to create other treasures.<br/><br/>However, to Wang Xian, these space god stones were just stones.<br/><br/>They were not of much use to his void dragon body.<br/><br/>To the disciples of the Dragon Palace, they were useless as well!<br/><br/>Therefore, he decided to throw them directly into this space pool.<br/><br/>It would be best if this space pool could be upgraded within a few hundred million years!<br/><br/>“I should be able to shorten the time by a few billion years!”<br/><br/>Wang Xian threw all the divine stones into the pool as he muttered to himself.<br/><br/>It was because he had obtained too many space divine stones this time around!<br/><br/>“Let’s call it the Void Dragon Pool in the future!”<br/><br/>A smile appeared on his face. His gains this time around were simply too great!<br/><br/>In the following period of time, the nine-origin universe had completely calmed down.<br/><br/>After this incident, all the living beings in the nine-origin universe had also realized the terror of the calamity.<br/><br/>Even the saint’s Bloodline, which was as powerful as a pinnacle race, had lost one-third of their powerful disciples in a single disaster.<br/><br/>This was a very terrifying thing!<br/><br/>However, the counterattack of the nine-origin universe this time had completely shocked the void universe.<br/><br/>It even shocked some of the surrounding universes.<br/><br/>The Apocalypse had already begun for hundreds of millions of years, and all the major universes were also investigating the news.<br/><br/>Although some universes were not strong and did not have the intention of invading other universes.<br/><br/>However, they would still gather some information to prevent the surrounding universes from invading them.<br/><br/>If there was an invasion from the surrounding universes, they would also find a way to deal with it!<br/><br/>The strength of the nine-origin universe was also discovered by some of the surrounding universes.<br/><br/>This made their hearts tremble. They were filled with fear, afraid that the nine-origin universe would suddenly attack them!<br/><br/>The peaceful days continued.<br/><br/>Wang Xian did not stay idle. The body of the Void Divine Dragon absorbed the heart of faith at the control level.<br/><br/>He was absorbing the corpses of the control level experts in the Void universe.<br/><br/>He was in the process of upgrading!<br/><br/>It was very difficult to upgrade when one reached the Heaven’s origin blessed realm.<br/><br/>Usually, it would take tens of billions of years to upgrade one step!<br/><br/>However, Wang Xian had too many resources.<br/><br/>Which beginner-level heaven origin creator could use the corpse of a control-level powerhouse to upgrade?<br/><br/>No!<br/><br/>Not to mention that he had the help of the heart of faith.<br/><br/>This made the strength of Wang Xian’s void dragon body increase bit by bit!<br/><br/>After 200 million years, the void dragon body trembled slightly.<br/><br/>It had upgraded!<br/><br/>From the weakest beginner-level, it had reached the veteran beginner-level.<br/><br/>In addition to the special properties of the space attribute, Wang Xian’s body of the Void Dragon was comparable to the weakest control level.<br/><br/>In other words, it was the strength of the elven empress and the rest!<br/><br/>“That’s not right. The Void Dragon Pool is about to be upgraded to the Heaven’s origin creation level. When that happens, my strength will increase a little more!”<br/><br/>Wang Xian looked at the situation of the Void Dragon Pool. In less than a million years, he would definitely be able to improve.<br/><br/>This was an upgrade in exchange for resources.<br/><br/>If other strong cultivators of the Heaven’s origin realm saw this, they would definitely be heartbroken!<br/><br/>They couldn’t bear to waste it like this!<br/><br/>A million years passed very quickly. The Void Dragon Pool had gotten an upgrade as promised!<br/><br/>Wang Xian sensed his own strength.<br/><br/>Currently, he could fight against a strong cultivator who had just stepped into the Great Dao level. In addition, he could fight against the eight weakest cultivators of the Heaven’s origin realm.<br/><br/>In other words, he was at level 17!<br/><br/>As long as Wang Xian improved a little more, he would be able to fight against two existences at the Great Dao level!<br/><br/>His strength was already extremely terrifying!\t\t\t\t\t\t</div>", "images": {}, "success": true}