{"id": 1274, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074822.html", "title": "Chapter 4277 - Chapter 4277: The 4276 Saints Were Heartless And Treated Everything As Their Own", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4277 - Chapter 4277: The 4276 Saints Were Heartless And Treated Everything As Their Own</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4277: The 4276 saints were heartless and treated everything as their own<br/><br/>Translator: 549690339<br/><br/>The strength of the two heaven origin creation realm powerhouses in the Na Tian universe had completely exceeded Wang Xian’s expectations.<br/><br/>They were able to say such threatening words even when facing him.<br/><br/>This made him even more surprised.<br/><br/>They completely disregarded the death of the living beings in his universe?<br/><br/>He stared at the two saints in the Na Tian universe and could tell that they were not threats that were fierce on the surface but weak on the inside.<br/><br/>He looked at the other three black-robed elders and narrowed his eyes slightly.<br/><br/>These three black-robed elders were existences at the Heaven’s origin level. Their bodies were filled with the aura of the dead souls.<br/><br/>With a glance, one could sense the bloody and evil aura on their bodies.<br/><br/>There were two types of situations.<br/><br/>One was that they had cultivated an abnormally evil cultivation method.<br/><br/>The second was that they had killed too many living beings.<br/><br/>Of course, there was also a third situation where he had both of them!<br/><br/>Recalling what they had said just now, Wang Xian narrowed his eyes slightly.<br/><br/>They were willing to take out 10,000 living beings from high-level planets!<br/><br/>Using living beings as a trade?<br/><br/>“Dragon King, the two heaven origin creation stage powerhouses in the Na Tian universe don’t seem to care about the death of the living beings in their universe at all. The three black-robed elders don’t seem to be good people either!”<br/><br/>The Hetian saint also sensed something and transmitted his voice to Wang Xian!<br/><br/>Wang Xian nodded his head faintly and stared at the two heaven origin creator powerhouses in the Na Tian universe.<br/><br/>“Do you know that I hate threats the most? Therefore, you are courting death!”<br/><br/>Wang Xian stared at them and a terrifying killing intent surged from his body instantly!<br/><br/>Boom<br/><br/>In the next instant, Wang Xian instantly transformed into his divine dragon body.<br/><br/>Buzz<br/><br/>His body trembled slightly as the Void Dragon body flew out from his body. The void dragon pool floated below him.<br/><br/>A majestic spatial force was surging!<br/><br/>Boom<br/><br/>Wang Xian locked onto one of the Heaven’s origin manifestation powerhouses from the Na Tian universe.<br/><br/>The void body locked onto another one as well.<br/><br/>His figure disappeared instantly.<br/><br/>The Void Dragon Body also teleported instantly!<br/><br/>At the next moment, Wang Xian and the Void Dragon Body arrived in front of the two heaven origin creation realm powerhouses in the Na Tian universe.<br/><br/>Wang Xian’s terrifying aura enveloped them and his dragon claws attacked them!<br/><br/>Boom! Boom<br/><br/>The terrifying aura spread out in all directions.<br/><br/>“Oh no, he actually dares to attack us.”<br/><br/>The two heaven origin creation powerhouses in the entire universe had a drastic change in expression as they shouted loudly!<br/><br/>“I’m attacking you, and I’m going to exterminate you!”<br/><br/>Wang Xian said with a face full of killing intent.<br/><br/>He dared to threaten him?<br/><br/>Did he really think that he would be afraid of their threat?<br/><br/>Putting everything else aside, was the current nine-origin universe something that two control-level existences could threaten?<br/><br/>Now that the Shadow Devil Emperor was in charge of the nine-origin universe, the two control-level existences would be suppressed even if they went there!<br/><br/>Furthermore, Wang Xian was not going to let them off this time.<br/><br/>Boom<br/><br/>A terrifying dragon claw attacked a heaven-origin creation-level powerhouse.<br/><br/>The body of the Void Dragon was attacking another heaven-origin creation-level powerhouse.<br/><br/>With the help of the Void Dragon Pool, the current body of the Void Dragon was stronger than a powerhouse who had just stepped into the control-level!<br/><br/>After all, the Void Dragon Pool had been upgraded to the heaven-origin creation-level!<br/><br/>This treasure of the Void King of the Void Universe had completed its transformation in his hands!<br/><br/>Boom! Boom<br/><br/>The expressions of the two Tianyuan blessed realm experts changed drastically when they faced Wang Xian’s Attack!<br/><br/>One of them hurriedly released a powerful defense to block the attack of the Void Dragon God.<br/><br/>However, the other one spat out a large amount of blood when he faced Wang Xian’s terrifying Dragon Claw. His body was on the verge of collapsing and he was sent flying backward!<br/><br/>“This is bad. He is not an ordinary existence at the Great Dao level. His strength is terrifying!”<br/><br/>The control-level powerhouse who was severely injured by Wang Xian roared loudly with a horrified expression!<br/><br/>His strength was merely at the control-level!<br/><br/>On the other hand, Wang Xian was already stronger than him with the five elements grinding tai chi dragon coiling and the blessing of the ancestral tree.<br/><br/>Not to mention the strength of Wang Xian’s actual body!<br/><br/>The difference was huge!<br/><br/>“You guys dare to threaten me, the Dragon King?”<br/><br/>Wang Xian stared at them and continued to speak with a face full of killing intent.<br/><br/>He did not know who gave them the courage.<br/><br/>To dare to speak such a threat!<br/><br/>Boom! Boom! Boom<br/><br/>When Wang Xian spoke, the five elements grinding flew above the control-level powerhouse. The Tai Chi Dragon Disc formed a tai chi pattern and completely surrounded him!<br/><br/>“Immortal spirit cultivator, make your move. We are willing to take out 10,000 high-level life forms to help us block it!”<br/><br/>The Heaven’s origin manifestation powerhouse who was injured by Wang Xian’s attack felt the might of the five elements Millstone and the Tai Chi Dragon Disc. His expression changed drastically and he immediately roared loudly!<br/><br/>“If the three of you dare to interfere, I will kill my way into your universe!”<br/><br/>When Wang Xian heard him asking for help from the three black-robed elders, he swept his cold gaze across the three of them and warned them coldly!<br/><br/>Boom<br/><br/>At the same time, Wang Xian stretched out his dragon claw once again and attacked the control-level powerhouse.<br/><br/>The nine types of energy in his body were boiling, even when he waved his dragon claw casually.<br/><br/>This terrifying destructive power was not something that a control-level powerhouse could withstand!<br/><br/>“It’s not just a simple dao-level powerhouse. When his clone is suppressing a control-level powerhouse, he can easily kill a control-level powerhouse!”<br/><br/>The smiles on the three black-robed elders’faces disappeared completely.<br/><br/>When they heard the request for help from the Haoyang saint, they showed a hesitant look.<br/><br/>The three of them looked at each other and didn’t make a move!<br/><br/>If Wang Xian was only at the ordinary Great Dao realm, they would be willing to help!<br/><br/>This was because it was extremely difficult to kill the Haoyang saint and the other two control-level cultivators at the ordinary Great Dao realm. It could even be said that they couldn’t kill them at all!<br/><br/>And Now?<br/><br/>It’s a terrifying presence that can easily overwhelm one master and easily overwhelm another.<br/><br/>They act, although can help haoyang sage they alleviate the current situation.<br/><br/>But to offend such a terrifying existence.<br/><br/>Their universe is strong enough to stand up to an existence on the level of the Great Way.<br/><br/>But if such a terrible power really want to retaliate against them, kill into their universe, then they will suffer heavy losses!<br/><br/>It was not worth it!<br/><br/>Boom<br/><br/>At this moment, Wang Xian’s dragon claws landed on the body of the Haoyang saint once again.<br/><br/>The terrifying dragon claws crushed his body directly.<br/><br/>A drop of his flesh and blood escaped to the side. A blood-red flower bloomed on his flesh and blood.<br/><br/>His body recovered in an instant.<br/><br/>This was a powerful life-saving treasure!<br/><br/>However, the Haoyang saint, who had recovered from his injuries, was still filled with fear!<br/><br/>He quickly took out another life-saving treasure.<br/><br/>It was a treasure that could escape in an instant.<br/><br/>“Bang!”<br/><br/>When Wang Xian saw the treasure in his hand that was emitting a special aura, a cold expression appeared on his face.<br/><br/>With a slight move of his Dragon Claw, a branch instantly struck the treasure.<br/><br/>Following that, countless thorns wrapped around the treasure.<br/><br/>The difference in strength was so great that it didn’t even have a chance to use the treasure.\t\t\t\t\t\t</div>", "images": {}, "success": true}