{"id": 1278, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074838.html", "title": "Chapter 4281 - Chapter 4281: 4280 Ordinary Life Forms Asking For Help", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4281 - Chapter 4281: 4280 Ordinary Life Forms Asking For Help</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4281: 4280 ordinary life forms asking for help<br/><br/>Translator: 549690339<br/><br/>Wang Xian looked at the information on the communication stone plate and shook his head.<br/><br/>This was because the saint of haoyang and the saint of Futu had absolute strength.<br/><br/>The other life forms did not dare to talk about the two saints.<br/><br/>Regarding the destruction of hundreds of thousands of planets, the other life forms would only think that they had angered the Saints.<br/><br/>“The birth of two saints in one universe is really the tragedy of the Universe!”<br/><br/>Wang Xian mumbled.<br/><br/>Time passed by little by little. The scholar was making a breakthrough at a rapid speed.<br/><br/>A breakthrough at the center would indeed be very, very fast!<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>The power of the scholar was getting stronger and stronger.<br/><br/>He was getting closer and closer to the Heavenly Yuan blessed realm!<br/><br/>The unity saint was watching from the side with a smile on his face.<br/><br/>This time, their saint faction would have one more Tianyuan blessed realm expert.<br/><br/>The strength of their saint faction would be greatly improved.<br/><br/>The most important thing for a faction was the Tianyuan blessed realm expert.<br/><br/>In the past, every peak faction only had one Tianyuan blessed realm expert, or not at all.<br/><br/>But because of the appearance of the Dragon King, they became stronger and stronger.<br/><br/>“That’s the saint’s Palace. Quick, quick, let’s go and seek help from our saint. Seek help from Saint Haoyang, seek help from Saint Futu!”<br/><br/>Just as the scholar was about to break through.<br/><br/>At the same time, it was located around the saint’s Palace.<br/><br/>The Palace of Saint Haoyang and Saint Futu was forbidden for other disciples to enter!<br/><br/>After Wang Xian arrived here, he had already killed all the brainwashed disciples of the Saint!<br/><br/>At this moment, tens of thousands of strong disciples from the entire universe flew over.<br/><br/>Their faces were filled with fear and Panic!<br/><br/>“There’s a powerful force over there. The Saints are there. We must be respectful when we get there. We must be respectful!”<br/><br/>The old man in the lead had cold sweat on his forehead. His body was trembling as he flew.<br/><br/>His eyes were filled with tears.<br/><br/>Even though he had the strength of a ruler, at this moment, he looked extremely weak!<br/><br/>As he spoke, he looked at the place that was emitting a powerful aura!<br/><br/>“It’s the Elder!”<br/><br/>The group of people quickly flew over and arrived in front of the saint’s Palace.<br/><br/>They looked up at the place where the terrifying energy was concentrated.<br/><br/>“A group of planet creatures from the sky-absorbing universe pays their respects to the saint. We beseech the saint to save us weak creatures!”<br/><br/>Tens of thousands of people came to the front of the saint’s Palace. They did not dare to step in.<br/><br/>Everyone knelt on the ground and shouted loudly. They kept kowtowing to the front!<br/><br/>“All the living beings from the stars in the universe pay their respects to the saint. We beseech the saint to save us weak living beings!”<br/><br/>All the strong disciples shouted in unison. There was a trace of sadness and indignation in their voices!<br/><br/>“Huh?”<br/><br/>In the saint’s Palace, Wang Xian and the others were waiting for the scholar to complete his breakthrough.<br/><br/>Upon hearing this voice, they raised their eyebrows slightly!<br/><br/>“Speak!”<br/><br/>The saint took a glance at Wang Xian. After hesitating for a moment, he replied in a deep voice!<br/><br/>“Sir Saint, we don’t know where these terrifying demons came from. They are slaughtering the lives of the planets crazily. All the lives of the planets they went to were all killed. There are already more than 100,000 lives of the planets that have been slaughtered by them!”<br/><br/>“I beg you, my Lord Saint, to take action and kill the demons. Otherwise, who knows how many lives on these planets have been massacred by them!”<br/><br/>The old man in the lead shouted with a face full of grief and indignation!<br/><br/>He was extremely miserable!<br/><br/>“Huh?”<br/><br/>When Wang Xian and the Hetian saint heard their words, their brows raised slightly!<br/><br/>Wang Xian waved his arm and the group of strong disciples who were outside instantly arrived in front of them!<br/><br/>More than 10,000 strong disciples saw the changes in their surroundings and were stunned. Then, they looked at Wang Xian, the Hetian saint, and the rest.<br/><br/>This made them stunned again!<br/><br/>“Are you saying that there are demons massacring the life planets on a large scale?”<br/><br/>Wang Xian looked at them and asked.<br/><br/>“Yes… Sir, may I know who you are? Where Is Our Saint?”<br/><br/>The group of strong disciples looked at Wang Xian and asked in astonishment.<br/><br/>“He was killed by me. He should be resurrected somewhere else!”<br/><br/>Wang Xian looked at them and said calmly, “Also, don’t expect your two saints to save you. He treated you as livestock and made a deal with the strong practitioners from the evil sequence faction. The ones who killed you should be the strong practitioners from the evil sequence faction.”<br/><br/>“What? How is this possible? Our Lord and the rest…”<br/><br/>Wang Xian’s words made them feel a rumble in their heads. Their faces were filled with disbelief!<br/><br/>“You guys are more unlucky. You met two heartless powerhouses from the Heaven’s origin. Did Xi Mingyu, who has hundreds of thousands of life planets, provoke the Saints to be killed?”<br/><br/>“Hehe, they merely sold the lives on those life planets as resources to the evil sequence faction in exchange for treasures!”<br/><br/>Wang Xian sneered and continued!<br/><br/>“This is impossible… impossible…”<br/><br/>The more than 10,000 strong disciples in front of them could not accept this fact and shook their heads in a daze.<br/><br/>“Why should we, the Dragon King, lie to weaklings like you? You are just a bunch of pitiful people!”<br/><br/>Saint he Tian looked at them and shook his head.<br/><br/>Buzz<br/><br/>At this moment, in the sky, the scholar had completed his breakthrough.<br/><br/>“Phew!”<br/><br/>He exhaled and looked at Wang Xian. “Thank you, Dragon King, for protecting my path and allowing me to achieve my breakthrough. Thank you, Saint he Tian!”<br/><br/>“No Need!”<br/><br/>Wang Xian smiled and shook his head.<br/><br/>Saint he Tian also had a happy expression on his face!<br/><br/>The scholar bowed respectfully once again. He couldn’t help but glance at the disciples of the heaven-receiving universe beside him and shook his head slightly.<br/><br/>Now, he was somewhat glad that he was a disciple of the nine-origin universe!<br/><br/>In the nine-origin universe, a group of heaven origin creation realm powerhouses faced off against the strong!<br/><br/>First, there was Lord Fallen Shadow Demon Emperor. He guarded the nine-origin universe and didn’t come out, guarding the safety of the nine-origin universe.<br/><br/>Now, the Dragon King of the Dragon Palace was guarding the path and breaking through for these weak disciples!<br/><br/>Compared to the living beings in the entire universe, he was undoubtedly very lucky!<br/><br/>“The realm of saints!”<br/><br/>The more than 10,000 strong disciples of the entire universe looked at the scholar who had not restrained his power. Their faces were filled with shock.<br/><br/>Then, they looked at Wang Xian and the Hetian saint. Their expressions kept changing!<br/><br/>“My Lord Saint, can you… can you save us? Save us poor people. Right now, countless strong disciples are being massacred every minute and every second. Please, can you save them? Save Us?”<br/><br/>The old man in the lead gritted his teeth and kneeled toward Wang Xian and the rest, begging for mercy!<br/><br/>Right now, the living beings were being massacred, and their two saints had yet to appear.<br/><br/>Whatever the reason, now they only hope to save other creatures, other companions.<br/><br/>As long as they can save them, no matter who the other is!\t\t\t\t\t\t</div>", "images": {}, "success": true}