{"id": 1275, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074826.html", "title": "Chapter 4278 - Chapter 4278: 4277, The Cruel Saint", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4278 - Chapter 4278: 4277, The Cruel Saint</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4278: 4277, the cruel saint<br/><br/>Translator: 549690339<br/><br/>“No.”<br/><br/>A terrified voice came from the Heavenly Genesis Realm Powerhouse in the Universe!<br/><br/>He looked at his precious treasure being entangled by thorns, and a look of despair appeared on his face.<br/><br/>Too strong!<br/><br/>This self-proclaimed Dragon King was too terrifying!<br/><br/>It was completely beyond their expectations!<br/><br/>They thought that this was only a great dao level.<br/><br/>With their strength, although they weren’t his match, they could still block a few of his attacks!<br/><br/>However, they had never expected that this wasn’t an ordinary Great Dao level existence.<br/><br/>Instead, it was an existence that could easily crush them!<br/><br/>“Bang!”<br/><br/>In the next instant, a terrifying energy landed on his body.<br/><br/>The clothes on his body turned into an incomparably terrifying spiritual robe, blocking this attack that was enough to kill him.<br/><br/>However, the Dharma Robe on his body only lasted for a second before it collapsed!<br/><br/>Boom<br/><br/>A terrifying force landed on his body, causing his life force to disappear rapidly!<br/><br/>“Oh no, itinerant immortal spirit, we are willing to take out 20,000 high-level planet creatures to make a deal with you to help us block them.”<br/><br/>On the other side, the powerhouse from the Na Tian universe who was fighting against the Void Dragon body continued to shout at the three black-robed elders with a face full of shock and anger when he saw his companion being killed!<br/><br/>“We don’t want to provoke such a strong enemy!”<br/><br/>The three black-robed elders looked at Wang Xian with fear when they saw that Wang Xian had killed a control-level existence so quickly!<br/><br/>Boom<br/><br/>At this moment, Wang Xian’s body moved. His gaze locked onto another powerhouse from the Nantian universe and he charged forward.<br/><br/>“Run, run, run!”<br/><br/>When the heavenly origin creator powerhouse from the Nantian universe saw Wang Xian charging toward him, his face revealed a look of fear.<br/><br/>He quickly took out his treasure and crushed it without any hesitation!<br/><br/>Buzz<br/><br/>In the next instant, his figure became illusory.<br/><br/>Wang Xian saw it and focused his gaze. A bolt of lightning energy covered his illusory figure.<br/><br/>Cracks appeared on his illusory figure, but he still managed to escape!<br/><br/>When Wang Xian saw this scene, his gaze flickered slightly!<br/><br/>He swept his gaze around and his gaze landed on the three black-robed elders.<br/><br/>“Scram!”<br/><br/>Wang Xian shouted softly. His face was filled with a cold expression.<br/><br/>The expressions of the three black-robed elders changed slightly. They looked at each other and immediately flew into the distance.<br/><br/>With their strength, they were not qualified to fight against such a terrifying existence.<br/><br/>At this moment, leaving was the best choice.<br/><br/>“That expert is too powerful!”<br/><br/>The three of them quickly flew into the distance. One of the black-robed elders said with an ugly expression!<br/><br/>“There’s nothing we can do. who asked him to be so powerful? We’re not his match at all!”<br/><br/>The black-robed elder in the middle shook his head and said helplessly.<br/><br/>They were already very powerful, but the other party was even more terrifying.<br/><br/>Even if they joined forces, they could still kill them!<br/><br/>“Damn it, I wonder if our deal with the Na Tian universe can still proceed smoothly!”<br/><br/>The last elder said in a deep voice!<br/><br/>“There should be no problem. Let’s Go!”<br/><br/>The three black-robed elders said as they flew rapidly toward the center of the Na Tian Universe!<br/><br/>“Stop the Breakthrough First!”<br/><br/>At this moment, they were at the position where Wang Xian and the rest were.<br/><br/>Saint he Tian was still looking at Wang Xian with a shocked expression.<br/><br/>He was shocked by the strength that he had displayed just now.<br/><br/>Wang Xian’s gaze swept toward the scholar who was in the midst of a breakthrough and suddenly spoke!<br/><br/>“HMM?”<br/><br/>Saint he Tian was slightly stunned. The scholar also looked at Wang Xian with a stunned expression.<br/><br/>“Your Majesty Dragon King, What’s Wrong?”<br/><br/>The scholar stopped absorbing the energy of the universe.<br/><br/>He had naturally sensed everything that had happened just now!<br/><br/>When he saw that Wang Xian suddenly stopped him from breaking through, his face was filled with astonishment.<br/><br/>“I’m going to kill that guy who escaped. In addition, I’m going to break through at the center of the universe. This way, it’ll be faster!”<br/><br/>Wang Xian spoke to the scholar!<br/><br/>“HMM? Dragon King, are you going to kill your way to the center of the Universe?”<br/><br/>Saint Hetian was slightly shocked and asked Wang Xian!<br/><br/>“Yes, these two guys from the universe are not good people. I’m going to destroy them!”<br/><br/>Wang Xian narrowed his eyes slightly. With a wave of his arm, a wave of energy enveloped Saint Hetian and the scholar!<br/><br/>Boom<br/><br/>His body shook and a black hole appeared in front of him.<br/><br/>“Let’s go, Let’s Go!”<br/><br/>The black hole was naturally the chasing ability of the Netherworld Dragon.<br/><br/>The power of wind and thunder had already attached itself to the escaping na Tian universe’s powerhouse. Wang Xian could immediately chase after him!<br/><br/>When the Hetian saint and the rest saw this scene, they immediately nodded their heads.<br/><br/>The energy enveloped them and Wang Xian brought them into the black hole!<br/><br/>Buzz<br/><br/>In the next moment, the scene around them underwent a huge change!<br/><br/>Not far away from them, the heaven origin creator of the Na Tian universe who had just escaped was sitting cross-legged on a pool to recover from his injuries.<br/><br/>When he saw Wang Xian and the rest suddenly appearing, his eyes were wide open and filled with shock!<br/><br/>“You still want to escape after threatening us?”<br/><br/>Wang Xian stared at him with a cold expression!<br/><br/>“We… We definitely don’t dare to attack your universe. You can let your disciples break through here. Don’t kill me!”<br/><br/>The Heaven Origin creator of the entire universe shouted in horror when he saw Wang Xian chasing after him!<br/><br/>“It’s Too Late!”<br/><br/>Wang Xian stared at him with a hint of disdain on his face!<br/><br/>Boom! Boom<br/><br/>In the next moment, a terrifying aura erupted from his body. He came to his side and penetrated his body!<br/><br/>The Heaven Origin creator of the entire universe wanted to resist, but he was completely unqualified to do so in front of Wang Xian who was in his full form.<br/><br/>The difference was too great!<br/><br/>“Bang!”<br/><br/>Wang Xian killed him and scanned his surroundings!<br/><br/>“Dragon King, your strength is really terrifying!”<br/><br/>When he saw this scene, he could not help but exclaim in surprise!<br/><br/>After leaving the nine-origin universe, without the support of the universe’s artificial intelligence, he was only at the initial stage of the Tianyuan creator level. Although he was a veteran, he would be killed instantly in front of the Dragon King!<br/><br/>Wang Xian smiled faintly and flew towards the pool in front of him.<br/><br/>“HMM?”<br/><br/>When he flew to the front of the pool, a strong vitality and bloody force came over, causing Wang Xian to frown slightly!<br/><br/>“Dragon King, the blood essence in this pool seems to be the blood essence of living beings. It seems that some other divine herbs and herbs have been added into this pool to create a healing pool!”<br/><br/>The Hetian Sage flew over and sensed the energy in the pool before he spoke.<br/><br/>The life energy in this pool could allow a heaven origin creator to recover rapidly.<br/><br/>Judging from the energy and blood essence in the pool, even if a control-level cultivator was severely injured and only a drop of blood was left, he could recover rapidly!<br/><br/>It could be considered a healing treasure!<br/><br/>Wang Xian nodded his head slightly. With a wave of his arm, he kept the pool!\t\t\t\t\t\t</div>", "images": {}, "success": true}