{"id": 1277, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074834.html", "title": "Chapter 4280 - Chapter 4280: The Sorrow Of The 4279 Universe", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4280 - Chapter 4280: The Sorrow Of The 4279 Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4280: The sorrow of the 4279 universe<br/><br/>Translator: 549690339<br/><br/>Wang Xian’s powerful attack had killed two heaven origin powerhouses in the entire universe!<br/><br/>Floating in the air, he scanned his surroundings.<br/><br/>This was the nest of the two heaven origin powerhouses in the entire universe.<br/><br/>There were a lot of treasures and resources here!<br/><br/>Some of the treasures and resources might be hidden in very secret places.<br/><br/>However, some of the divine trees and grass were planted around their lair.<br/><br/>The two great heaven origin powerhouses occupied 80% of the resources in the entire universe.<br/><br/>The amount of these resources was huge. It was only a little less than the amount in the Void universe!<br/><br/>To Wang Xian, it was also a huge treasure trove that was hard to come by!<br/><br/>“Scholar, break through here!”<br/><br/>Wang Xian moved his body and commanded the body of the void God Dragon to plunder all the treasures.<br/><br/>He smiled and said to the scholar!<br/><br/>“It’s His Majesty, the Dragon King!”<br/><br/>The scholar nodded respectfully to Wang Xian.<br/><br/>He was extremely respectful towards the current Dragon King.<br/><br/>Even if he made a breakthrough this time, he was just an existence that could be easily killed in front of the Dragon King!<br/><br/>The scholar moved his body and continued to make a breakthrough!<br/><br/>This was the center of the entire universe. If he were to make a breakthrough here, the time would be reduced by ten times compared to the previous position!<br/><br/>The density of the energy was different!<br/><br/>The scholar began to make a rapid breakthrough!<br/><br/>Wang Xian stood there and watched quietly. This time, there were no other experts rushing over to interfere!<br/><br/>At the same time, in two places in the entire universe.<br/><br/>Saint Haoyang and Saint Futu were resurrected in a very secret place!<br/><br/>They could sense the power of the breakthrough of the experts from the center. Their expressions were abnormally ugly!<br/><br/>“Damn it, the losses this time are too great. That D * MN Fellow!”<br/><br/>Their eyes were bloodshot. Their eyes were filled with anger and unwillingness!<br/><br/>However, this time, they didn’t dare to provoke them anymore!<br/><br/>The two took out their communication stone plates and contacted each other before making a decision!<br/><br/>“HMM?”<br/><br/>At this moment, on a life planet in the sky bearing universe.<br/><br/>Three black-robed elders from the evil sequence camp suddenly received a message from the vast sun saint and the Buddha saint. They looked at each other!<br/><br/>“I really didn’t expect that the Grand Sun Saint and Saint Futu would be killed by that mysterious expert. That mysterious expert is truly terrifying. He’s an existence that can intimidate an entire faction in our evil sequence faction!”<br/><br/>A black-robed elder couldn’t help but speak up!<br/><br/>“These two guys are really not bad. They’re willing to trade more with us, but right now, they seem to be in an extremely weak state. Hehe!”<br/><br/>A black-robed elder’s eyes flickered, filled with a cold and sinister expression.<br/><br/>“Directly attack? But those two guys are a bit ruthless. If we directly attack and rob them, they’ll probably take revenge on us!”<br/><br/>The other black-robed elder said hesitantly.<br/><br/>They were experts from the evil sequence faction, and they treated other creatures like ants.<br/><br/>However, the Great Sun saint and Buddha saint who were trading with them weren’t good people either.<br/><br/>They would take revenge for the smallest grievance, and they needed to pay attention to this point!<br/><br/>“Let’s attack directly. Now that they’re at their weakest, why do we need to trade with them if we’re going to slaughter them directly? Take revenge on us? If they dare to come to our place, we’ll make them pay the price!”<br/><br/>The last black-robed elder said with a cold expression!<br/><br/>“Alright!”<br/><br/>The other two black-robed elders hesitated for a moment before nodding. They licked their lips, and their eyes were filled with a sinister expression!<br/><br/>They looked at the living beings on this planet, and the corners of their mouths curled up slightly!<br/><br/>Boom<br/><br/>In the next instant, they floated in the air.<br/><br/>The three of them waved their arms, and the flags flew out one by one.<br/><br/>The blood-red flags were filled with a strange, terrifying, and bloody smell!<br/><br/>The blood-red energy flowed on them like a sea of blood.<br/><br/>In the Sea of blood, there were also black creatures’Phantoms. They stretched out their claws with ferocious faces, as if they wanted to break free and tear apart everything in the world!<br/><br/>The three strange, terrifying flags grew bigger in the wind, and the black creatures’Phantoms in the Sea of blood broke free from them.<br/><br/>They flew towards the entire planet at a terrifying speed.<br/><br/>“What is this thing?”<br/><br/>“What a terrifying and evil aura, run!”<br/><br/>“Run, run, run!”<br/><br/>On the planet, all the life-forms were shocked by this ominous aura!<br/><br/>They felt a deep fear from their souls.<br/><br/>All the life-forms ran frantically.<br/><br/>But the black and strange life-form phantom was even more terrifying.<br/><br/>They directly pierced through the shadow of a living creature, and that living creature instantly turned into a skeleton.<br/><br/>A decaying skeleton!<br/><br/>It was as if it had been dead for countless years!<br/><br/>As for that strange and sinister Black Shadow, the black light on its body grew even more intense, and a puddle of blood appeared around it!<br/><br/>Countless strange black shadows quickly wreaked havoc on the entire planet.<br/><br/>The living beings and humans on the planet didn’t even have the slightest bit of strength left to resist!<br/><br/>Miserable screams continued to ring out.<br/><br/>Fear spread throughout the entire planet.<br/><br/>However, this terrifying destructive disaster only lasted for a few minutes!<br/><br/>The entire planet was deathly silent!<br/><br/>There was not a single living creature.<br/><br/>“Kekekekeke, it’s been a long time since I’ve raised the soul refining blood sea flag to such a high level. Next, I have to raise it properly!”<br/><br/>One of the black-robed men could not help but laugh maniacally.<br/><br/>“Haha!”<br/><br/>The other two men also had ferocious smiles on their faces.<br/><br/>There was blood flowing on their black robes.<br/><br/>The three black-robed elders moved their bodies and entered the teleportation formation directly, heading to the next planet!<br/><br/>This was a brutal and inhumane massacre!<br/><br/>It was the massacre of weak creatures by the powerhouses of the Heaven’s origin realm.<br/><br/>This was also the tragedy of the universe!<br/><br/>Wang Xian did not know what was happening here.<br/><br/>At this moment, he was not far away from the scholar. He was holding a communication stone plate and reading some information.<br/><br/>This communication stone plate was obtained from an expert in the ruler realm of the universe.<br/><br/>From the communication stone plate, Wang Xian had a detailed understanding of the universe!<br/><br/>In the universe, Saint Futu and Saint Haoyang were in charge of the saint’s Palace.<br/><br/>They did not participate in anything else in the universe.<br/><br/>They allowed them to develop.<br/><br/>However, what all the living beings in the universe did not know was that their strong disciples were nothing more than their two saints’livestock.<br/><br/>As long as they were useful, they could be traded directly.<br/><br/>They could be directly taken away.<br/><br/>In the communication stone plate, there was a record of a matter not too long ago.<br/><br/>It was said that the living beings in the entire universe had disrespected the saints, and the Saints had sent down heavenly punishment.<br/><br/>Over a hundred thousand living beings from the planets were all killed.<br/><br/>This matter caused quite a stir, but no living beings in the Universe dared to belittle the two saints!\t\t\t\t\t\t</div>", "images": {}, "success": true}