{"id": 1279, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074842.html", "title": "Chapter 4282 - Chapter 4282: 4281 Made His Move", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4282 - Chapter 4282: 4281 Made His Move</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4282: 4281 made his move<br/><br/>Translator: 549690339<br/><br/>“Please, Saint, Save the disciples of our Universe!”<br/><br/>More than 10,000 strong disciples of the universe knelt in front of Wang Xian and begged!<br/><br/>They were at the end of their rope. No matter who Wang Xian and the rest were, they only wanted the other party to save them!<br/><br/>Wang Xian looked at the more than 10,000 disciples and their pleading expressions. He sighed in his heart!<br/><br/>“I am from the nine-origin universe. I didn’t want to interfere in the matter of your universe, and I shouldn’t have!”<br/><br/>Wang Xian looked at them and said. Then, he waved his arm and a sharp sword that was hanging on the old man at the front flew into his hand.<br/><br/>“Take this sword as a reward!”<br/><br/>He opened his mouth and looked at them. “Wait a moment. Lead the way!”<br/><br/>After he finished speaking, he looked at Saint Hetian, scholar, and the rest. “Saint Hetian, you guys don’t have to get involved in this matter!”<br/><br/>“It’s the Dragon King!”<br/><br/>Saint Hetian nodded and cupped his hands at Wang Xian. “Then I’ll be leaving with scholar first. The kindness of the Dragon King will always be remembered by the saint’s lineage!”<br/><br/>Their involvement in this matter wouldn’t be of much use!<br/><br/>Moreover, they could clearly tell that the Dragon King had his own arrangements. They wouldn’t be of much help if they followed the Dragon King!<br/><br/>“HMM, pass these two corpses to senior fallen Shadow Devil Emperor. Tell him that it’s the Dragon King’s reward for giving them to the Devil Race to guard the nine-origin universe. Also, ask him to take care of the Dragon Palace while I’m away!”<br/><br/>Wang Xian waved his arm and passed the bodies of the Haoyang saint and Saint Futu to the Hetian Saint!<br/><br/>Giving the Fallen Shadow Devil Emperor Two corpses of a control-level existence was also returning the favor.<br/><br/>In the following period of time, Wang Xian was prepared to travel in the chaos. He might not stay in the nine-origin universe often.<br/><br/>In that case, the consolation of the nine-origin universe would depend on the fallen Shadow Devil Emperor.<br/><br/>Although the fallen Shadow Devil Emperor had said that he was in charge of the nine-origin universe.<br/><br/>At the very least, Wang Xian had to express his gratitude.<br/><br/>In addition, there were still enemies in the Dragon Palace.<br/><br/>The Emperor of Phoenix, as well as this Buddha saint and the vast sun saint who were killed, might seek revenge.<br/><br/>Therefore, giving the fallen shadow devil emperor some treasures would allow him to better take charge of the nine-origin universe and protect the Dragon Palace!<br/><br/>The value of these two corpses could be said to be extremely high!<br/><br/>If the Buddha saint and the vast sun saint were to join forces, the Fallen Shadow Devil Emperor would not be able to kill them.<br/><br/>It was no exaggeration to say that this level of resources could increase the demon race by 60 to 70 peak-stage rulers.<br/><br/>It was even possible to give birth to an existence that could break through the shackles.<br/><br/>After all, this was the corpse of a control-level expert!<br/><br/>“Oh? It’s the Dragon King!”<br/><br/>Saint Hetian took the two corpses and was somewhat amazed at the Dragon King’s generosity.<br/><br/>This was too huge compared to the resources!<br/><br/>It was so huge that even if he used all the resources of the saint lineage, he would not be able to exchange for these two corpses.<br/><br/>Even if the Hetian saint used them himself, he was confident that he would be able to improve his strength within a few billion years.<br/><br/>“Dragon King, we will definitely send the resources to senior fallen Shadow Devil Emperor. We will also explain everything!”<br/><br/>The Saint of Unity spoke again and cupped his hands toward Wang Xian!<br/><br/>“Okay, be careful when you go back!”<br/><br/>Wang Xian nodded.<br/><br/>“Don’t worry, Dragon King!”<br/><br/>The Saint of Unity nodded. “If I encounter danger, I can contact the universe’s AI remotely and force my way back!”<br/><br/>“Alright!”<br/><br/>Wang Xian nodded.<br/><br/>The Saint of unity cupped his hands toward Wang Xian. The scholar bowed deeply and the two of them left quickly!<br/><br/>When Wang Xian saw them leaving, his gaze landed on the tens of thousands of disciples from the universe!<br/><br/>“I’ll Bring You There!”<br/><br/>Wang Xian looked at them and said!<br/><br/>“It’s the saint. Thank you, thank you!”<br/><br/>The old man in the lead quickly replied, “Sir, they are currently massacring the southern light region. Many planets have been massacred by them!”<br/><br/>Buzz<br/><br/>Wang Xian waved his arm and a soul-absorbing force entered the old man’s mind. He immediately grasped the specific information!<br/><br/>“Let’s Go!”<br/><br/>Wang Xian waved his arm and the energy dragon looked for them. In an instant, they arrived at the location of a teleportation formation!<br/><br/>In the saint’s Palace, there was a teleportation formation that was used to teleport to various planets.<br/><br/>Wang Xian brought them to the teleportation formation. He glanced at them and entered directly!<br/><br/>The scene changed and they appeared on another planet!<br/><br/>“Let’s escape quickly. The cold spell planet is suffering from a terrifying massacre. Let’s escape to the starry sky!”<br/><br/>“Where is our saint? where is our saint, Buddha Saint?”<br/><br/>“The saints from the other universes are here to massacre us. Let’s Escape!”<br/><br/>As soon as they were teleported to this planet, there were noises coming from the surroundings!<br/><br/>Countless people from the entire universe were fleeing frantically.<br/><br/>They were screaming in terror!<br/><br/>The lives on the planets were destroyed one by one. Furthermore, one planet was destroyed within a few minutes.<br/><br/>Such a terrifying thing made them shudder in fear!<br/><br/>“My Lord Saint, according to the information I received, the three demons are on the frigid spell planet. We can teleport over directly from here!”<br/><br/>Behind them, the old man who was the leader reported to Wang Xian!<br/><br/>“Alright!”<br/><br/>Wang Xian nodded his head. With a movement of his energy, he enveloped them and teleported to another teleportation formation!<br/><br/>Following that, they entered the teleportation formation once again!<br/><br/>“Wu Wu Wu!”<br/><br/>“No, no, no!”<br/><br/>“Ah Ah Ah!”<br/><br/>When they arrived at the frigid spell planet through the teleportation formation, they heard whistling sounds, miserable screams, and terrified sounds!<br/><br/>“It’s them, it’s them!”<br/><br/>“What a terrifying aura!”<br/><br/>“They are the demons!”<br/><br/>The over ten thousand disciples of the entire sky-holding universe who were following behind Wang Xian looked at their surroundings with horrified expressions.<br/><br/>Their bodies were trembling slightly.<br/><br/>In the surrounding void space, countless terrifying blood-red shadows passed through the bodies of the disciples of the sky-holding universe.<br/><br/>The blood-red phantoms passed by, leaving behind a rotting corpse.<br/><br/>These Phantoms were originally black, but they were now drenched in blood.<br/><br/>The tens of thousands of disciples of the sky-holding universe watched this scene with trembling bodies!<br/><br/>At this moment, suddenly, thousands of blood-red ferocious phantoms rushed towards them!<br/><br/>This caused them to reveal horrified expressions.<br/><br/>Wang Xian stood there quietly. His gaze swept across the surroundings. His pair of dragon eyes penetrated through everything as he looked towards the void space.<br/><br/>From there, he saw three figures floating in the void.<br/><br/>Their eyes were cold and ferocious as they watched this scene!<br/><br/>“Damn it!”<br/><br/>Wang Xian muttered under his breath. At the same time, an aura burst out from his body!<br/><br/>Boom<br/><br/>In the next instant, nine-colored energy burst out from his body and swept across the entire planet!<br/><br/>Buzz! Buzz! Buzz<br/><br/>“Ah Ah Ah!”<br/><br/>All the terrifying Phantoms let out sizzling sounds as they melted.<br/><br/>Painful screams came from those strange phantoms!<br/><br/>In an instant, the entire planet’s evil energy was directly wiped out!\t\t\t\t\t\t</div>", "images": {}, "success": true}