{"id": 1270, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074806.html", "title": "Chapter 4273 - Chapter 4273: 4272 Left With A Full Load", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4273 - Chapter 4273: 4272 Left With A Full Load</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4273: 4272 left with a full load<br/><br/>Translator: 549690339<br/><br/>The powerful disciples of the Void dynasty were extremely terrified.<br/><br/>The palace that they thought was invincible had been destroyed wantonly!<br/><br/>Some of the royal family’s powerhouses immediately passed the news to the Tianyuan Destiny Realm powerhouses in the Void Universe.<br/><br/>They passed it to His Majesty the Sacred King!<br/><br/>In the chaotic void.<br/><br/>The void King and the others quickly shuttled back and forth, and the Void Pagoda would teleport from time to time.<br/><br/>They were moving extremely fast!<br/><br/>This failure made them all look extremely embarrassed!<br/><br/>Void King sat on the throne of void tower, staring coldly ahead.<br/><br/>The failure of the 9-origin universe meant the power of the 9-origin universe.<br/><br/>Then this calamity wouldn’t be able to compete with the 9-origin universe like the last calamity!<br/><br/>Evolution needed to undergo some changes!<br/><br/>Although the universe AI was extremely important to him, he had no choice but to give up at this moment!<br/><br/>He should first increase his own strength and the Void Empire’s strength!<br/><br/>He thought to himself!<br/><br/>“Buzz Buzz!”<br/><br/>At this moment, a message came from his communication device!<br/><br/>At this moment, not only him, but the other heavenly yuan creation realm powerhouses in the Void Universe also received this message.<br/><br/>When the Void King opened the communication device and saw the contents, his body shook.<br/><br/>Boom<br/><br/>He stood up and a terrifying aura spread out!<br/><br/>His eyes were wide open and his face was filled with cold killing intent!<br/><br/>“The dynasty palace was attacked? The Divine Dragon? How is this possible? How can a divine dragon from the 9-origin universe appear in the Void Universe? A normal controller can’t even break into the Palace!”<br/><br/>The king of Void looked at this information with an extremely ugly expression!<br/><br/>“It’s the Dragon Palace Dragon King!”<br/><br/>However, when he saw the confirmation from Duke Xining, his expression changed drastically!<br/><br/>“How did he suddenly appear in the Void Universe? How did he rush over so quickly?”<br/><br/>The king of Void’s expression was extremely gloomy!<br/><br/>“Boom! Boom!”<br/><br/>At this moment, the surrounding void pagodas approached him. One by one, the Heavenly Yuan creation realm experts arrived in front of the king of Void!<br/><br/>“Your Majesty, News has come from Duke Xining and the palace. Something has happened there!”<br/><br/>The middle-aged man in Golden Armor said with an ugly expression!<br/><br/>“I’ll rush over immediately. Damn Dragon King of the Dragon Palace, he actually destroyed my palace. Damn him!”<br/><br/>The Void King roared with a gloomy expression!<br/><br/>He moved his palm and took out a treasure.<br/><br/>He gritted his teeth and floated the treasure in front of him.<br/><br/>The treasure was a mirror.<br/><br/>“Peng!”<br/><br/>He shattered the mirror and entered it, disappearing!<br/><br/>This treasure was a one-time use.<br/><br/>Long distance teleportation!<br/><br/>Such a treasure was a strategic treasure for the Void King.<br/><br/>It could allow him to return to the Void Universe from a faraway place!<br/><br/>Under normal circumstances, he would not be willing to use it!<br/><br/>But now, his palace had been destroyed by the Dragon King!<br/><br/>One had to know that his palace had been built for countless years to reach its current size.<br/><br/>There were many treasures inside as well as the defensive measures he had built.<br/><br/>Now, it was being destroyed!<br/><br/>The king of Void rushed over, and the other heavenly yuan creation realm experts frowned.<br/><br/>“According to the news from the Void Universe, the palace has been severely damaged. I’m afraid the King will be furious.”<br/><br/>An expert from the Void Universe said helplessly!<br/><br/>At the same time, in the Void Universe.<br/><br/>Because of Duke Xining’s death this time, he was directly resurrected in the Void Universe.<br/><br/>Looking at the message from his subordinate, his expression was abnormally ugly.<br/><br/>The Dragon King of the Dragon Palace had actually charged over!<br/><br/>This? ? ?<br/><br/>He sighed helplessly.<br/><br/>The successive deaths had caused him to no longer have that kind of treasure that could resurrect without injury.<br/><br/>The current him was comparable to the weakest heavenly yuan creation realm powerhouse.<br/><br/>He needed a lot of time to recover from his injuries.<br/><br/>At this time, he did not dare to look for trouble with the Dragon King.<br/><br/>With the Dragon King’s strength, he could easily kill him.<br/><br/>He had already seen how terrifying the Dragon King was!<br/><br/>“Boom!”<br/><br/>At this time, in the sky above the palace of the Void Dynasty.<br/><br/>A crack appeared in the Void, and a mirror appeared!<br/><br/>Then, the Void King walked out of the mirror.<br/><br/>When the void King saw the situation in his palace below, an extremely terrifying aura directly erupted from his body!<br/><br/>His eyes instantly turned blood red!<br/><br/>“Dragon Palace, Dragon King!”<br/><br/>“I’m going to kill you!”<br/><br/>The king of Void’s originally white eyes were filled with blood. When he saw the Dragon King’s rampaging figure in front of him, he roared furiously!<br/><br/>At this moment, when the king of Void arrived, Wang Xian had already noticed it.<br/><br/>Looking at his violent expression, the energy in his entire body was boiling.<br/><br/>Wang Xian smiled.<br/><br/>“King of Void, since you dare to come to my nine-origin universe to kill, I dare to slaughter in Your Void Universe. It’s impolite to not reciprocate. The grudge between us is just the beginning!”<br/><br/>“HMPH, there’s still time in the future!”<br/><br/>Wang Xian said coldly!<br/><br/>This time, although the nine-origin universe suffered heavy losses.<br/><br/>Tens of millions of lives were killed.<br/><br/>However, the Void Empire also suffered heavy losses!<br/><br/>This was especially so for the masters of their mastery level.<br/><br/>One must know that the loss of the Masters of the nine-origin universe was less than one-fifth of the Void Empire!<br/><br/>Buzz<br/><br/>As soon as Wang Xian finished his sentence, his body moved.<br/><br/>An intense energy enveloped him from the side and they disappeared in an instant!<br/><br/>“Dragon King of the Dragon Palace!”<br/><br/>The king of Void flew towards him with a terrifying spatial energy.<br/><br/>A terrifying crack appeared in the space around him!<br/><br/>However, before he could charge over, Wang Xian had already disappeared!<br/><br/>The king of Void could not sense Wang Xian’s aura. His body was trembling slightly.<br/><br/>He scanned his surroundings.<br/><br/>Eighty percent of the entire palace had been destroyed.<br/><br/>All the treasures, divine trees and divine trees, as well as some precious items, had been taken away.<br/><br/>Although his most precious treasures were kept in a secret place, the treasures and resources in the palace were extremely terrifying!<br/><br/>Especially one treasure that almost had the might of a heavenly yuan manifestation realm!<br/><br/>Apart from that, the Void Dynasty Army’s losses were too huge!<br/><br/>The most Elite Forces in the Void Universe were all at the Void Dynasty Palace.<br/><br/>500,000 ruler realm experts.<br/><br/>They were all peak existences in the ruler realm within the Void Universe.<br/><br/>None of them were weaker than a level 3 universe ruler.<br/><br/>However, such a powerful force had been completely annihilated by the Dragon Palace Dragon King.<br/><br/>Among them, there were at most 1% who had resurrection treasures!<br/><br/>Tragic!<br/><br/>It was too tragic!<br/><br/>This time, their void universe’s losses were too tragic!<br/><br/>The void King’s body trembled slightly, and his breathing was somewhat hurried!<br/><br/>It had been a very, very long time since their void universe had suffered such a heavy loss!<br/><br/>“Dragon Palace Dragon King!”<br/><br/>He gritted his teeth hatefully and roared in a low voice.<br/><br/>However, there was also some helplessness!\t\t\t\t\t\t</div>", "images": {}, "success": true}