{"id": 1276, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074830.html", "title": "Chapter 4279 - Chapter 4279: Under The Cruel Saint", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4279 - Chapter 4279: Under The Cruel Saint</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4279: Under the cruel saint<br/><br/>Translator: 549690339<br/><br/>“Let’s take a look around.”<br/><br/>Wang Xian swept his gaze across the palace and spoke to the Hetian saint and the rest!<br/><br/>Since they were already here, Wang Xian was prepared to plunder the entire universe!<br/><br/>He was going to collect all the resources and treasures!<br/><br/>“Alright Dragon King, we are not in a hurry!”<br/><br/>The Hetian saint and the rest also knew of Wang Xian’s plan and nodded their heads!<br/><br/>Buzz<br/><br/>Wang Xian’s body moved and flew out of the palace. He used his mind to sense his surroundings!<br/><br/>Hovering in the air, Wang Xian looked around.<br/><br/>“This place is somewhat similar to the Void Empire. Two heaven origin powerhouses control most of the resources in the Universe!”<br/><br/>He looked at some of the powerhouses in the universe and waved his arm.<br/><br/>A powerhouse at the peak of the Dominator realm was immediately caught in front of Wang Xian without the slightest reaction!<br/><br/>“Soul Catcher!”<br/><br/>A stream of information was instantly transmitted into Wang Xian’s mind.<br/><br/>Very soon, Wang Xian frowned slightly and a faint killing intent surged from his body!<br/><br/>“What’s wrong, Dragon King?”<br/><br/>The Hetian saint who was at the side sensed Wang Xian’s killing intent. He was slightly shocked and asked!<br/><br/>“These two heaven origin creator powerhouses from the Na Tian universe call themselves saints. In the minds of these powerhouses, there is their restriction. This restriction will make their disciples obey their orders 100% !”<br/><br/>“Apart from that, they use all living creatures as livestock and keep them in captivity to carry out transactions!”<br/><br/>“Based on the information I obtained and some speculations, the three black-robed elders are powerhouses from the evil sequence camp. The two heaven origin creator powerhouses from the Na Tian universe use the lives of the universe to carry out transactions with them in exchange for various resources.”<br/><br/>“The blood pool just now was traded by them from the powerhouses from the evil sequence faction. The resources they are trading are the lives of millions of ordinary life planets!”<br/><br/>Wang Xian opened his mouth and said with a cold glint in his eyes.<br/><br/>“What?”<br/><br/>His words shocked the saint who had fused with his body!<br/><br/>“The three powerhouses from the evil sequence faction are using the souls of their lives to refine treasures. Their flesh and blood are condensed into a blood pool!”<br/><br/>Wang Xian added another sentence!<br/><br/>“This… The powerhouses from the Heaven’s origin realm in this universe are actually so cruel. They actually used the living beings in the universe to refine treasures and conduct transactions.”<br/><br/>The expression of the he tian saint changed slightly. Soon after, he thought of something. “The three black-robed elders are using the living beings to conduct transactions with them?”<br/><br/>Wang Xian nodded and shook his head slightly. “Let’s go. The Heaven’s origin realm powerhouse that I just killed didn’t resurrect here. However, the other person called the Hao Yang Saint should be resurrected in his palace not far away!”<br/><br/>As he spoke, energy enveloped Saint Hetian and scholar scholar. They immediately flew to the right.<br/><br/>There were two saints in the Tianyuan universe. One was called Saint Haoyang and the other was called Saint Futu!<br/><br/>They controlled the entire universe.<br/><br/>Logically speaking, the two of them could nurture other Tianyuan destiny realm powerhouses.<br/><br/>However, they didn’t do so.<br/><br/>They took all the resources for themselves!<br/><br/>They used all the living beings in the entire universe as their own resources to trade and upgrade!<br/><br/>It could be said that their upgrade was done with the blood and souls of all the living beings in the entire universe!<br/><br/>It could be said to be extremely cruel!<br/><br/>This was the first heaven origin powerhouse that Wang Xian had seen who was so cruel.<br/><br/>In the other universes, the heaven origin creator powerhouses were all thinking of ways to make their own universes stronger.<br/><br/>On the other hand, they were thinking of ways to make themselves stronger.<br/><br/>As for the other living beings in the universe, they did not care about life and death at all!<br/><br/>Wang Xian sighed in his heart. This was the tragedy of a universe.<br/><br/>Moreover, there might be more than one such universe!<br/><br/>There might be many of them!<br/><br/>“Damn it!”<br/><br/>Wang Xian stared at the spot in front of him. There, he could sense a familiar aura.<br/><br/>This was the aura of the Haoyang Saint!<br/><br/>He was resurrected in his own lair!<br/><br/>“Damn it, damn it. Don’t let me know which universe you came from. If I know, I will definitely slaughter all the living beings in your universe and slaughter your disciples. I will make you pay a heavy price!”<br/><br/>“So what if you are at the terrifying Great Dao level? If I can’t kill you, how can I not kill your disciples?”<br/><br/>At the same time, in a palace of the Great Sun Saint!<br/><br/>The Great Sun Saint stood on a high platform with a gloomy face!<br/><br/>He was holding a communication device in his hand and sending a message to Saint Futu. His body was full of killing intent!<br/><br/>The reason why they didn’t feel the slightest fear when facing a great dao level powerhouse was because they couldn’t defeat a great dao level powerhouse.<br/><br/>However, they could go to the universe where the Great Dao level powerhouse resided and take revenge!<br/><br/>As for whether they would suffer the revenge of a Great Dao level powerhouse, they did not care.<br/><br/>How vast the chaos was, and how vast the universe was!<br/><br/>As long as they hid, Great Dao level powerhouses would not be able to find them.<br/><br/>As for taking revenge on their universe?<br/><br/>They didn’t care!<br/><br/>Other creatures were like livestock in their eyes!<br/><br/>This was also why they dared to threaten Great Dao experts.<br/><br/>Boom<br/><br/>However, at this moment, an extremely terrifying aura enveloped them.<br/><br/>“What?”<br/><br/>Sensing this aura, the vast sun saint’s expression changed drastically!<br/><br/>He immediately knew that this familiar draconic aura was that great dao expert rushing over!<br/><br/>“How is this possible? How can he rush over so quickly at such a long distance?”<br/><br/>His expression changed drastically. Without the slightest hesitation, he immediately fled into the distance!<br/><br/>Boom<br/><br/>At this moment, he sensed a terrifying energy attacking him!<br/><br/>This caused the vast sun saint’s expression to change drastically. He gritted his teeth and took out a treasure that could save his life!<br/><br/>Weng<br/><br/>However, before he could react, he saw a familiar figure appear 1,000 meters away from him!<br/><br/>Looking at this figure, the great sun saint’s heart trembled violently.<br/><br/>He had just been killed once.<br/><br/>He had been resurrected through a powerful true treasure!<br/><br/>However, he only had one true treasure that could be resurrected without injury!<br/><br/>This one was something he had exchanged from other universe masters with a heaven origin creation quota in the universe!<br/><br/>A treasure of this level was too precious!<br/><br/>“It’s over!”<br/><br/>A look of despair appeared on his face!<br/><br/>He saw a terrifying dragon claw clawing towards him.<br/><br/>The surrounding void was confined and the terrifying dragon aura made him unable to move!<br/><br/>The Dragon Claw penetrated his body directly!<br/><br/>His eyes were blood red as he stared at Wang Xian, filled with hatred!<br/><br/>He wanted revenge, he wanted revenge!<br/><br/>He wanted to kill his way into the universe where this powerhouse was and slaughter his disciples!<br/><br/>“You’re courting death!”<br/><br/>Wang Xian could sense the hatred and killing intent in his mind. His eyes were filled with coldness and fury!<br/><br/>He clenched his Dragon Claw and crushed it!<br/><br/>When the Hetian Saint, who was following behind, saw this scene, his heart was filled with hatred once again!<br/><br/>“The Dragon King’s strength should far exceed that of senior shadow Devil Emperor!”<br/><br/>He thought to himself!\t\t\t\t\t\t</div>", "images": {}, "success": true}