{"id": 1289, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074882.html", "title": "Chapter 4292 - Chapter 4292: 4291 Divination Lamp", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4292 - Chapter 4292: 4291 Divination Lamp</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4292: 4291 divination lamp<br/><br/>Translator: 549690339<br/><br/>“I have finally found the remaining star field fragment!”<br/><br/>Saint Shan Tian looked at the star field fragment in his hand with an extremely excited expression on his face.<br/><br/>This star Field’s ultimate treasure of Tianyuan was accompanied by his rise and glory.<br/><br/>After more than 30 billion years, it had once again returned to his hands and was restored to its peak.<br/><br/>Wang Xian stood at the front and looked at the divination lamp in his hand. He injected energy into it and refined it!<br/><br/>“Hehe, Happy Business!”<br/><br/>After briefly feeling the magic of the divination lamp, Wang Xian put it away and said to Saint Shan Tian with a smile!<br/><br/>“The divination lamp can predict the direction of the chaos stone in the riot zone. It is a very powerful supplementary treasure.”<br/><br/>Saint Shan Tian looked at Wang Xian and said!<br/><br/>Wang Xian nodded with a smile. His body moved and he flew into the distance.<br/><br/>Saint Shan Tian looked at Wang Xian’s departing figure and didn’t say anything.<br/><br/>The transaction had been completed. Even though he was a little unhappy in his heart, everything had become a reality.<br/><br/>He wouldn’t be upset or hold a grudge.<br/><br/>Furthermore, Wang Xian’s strength.<br/><br/>It was obviously irrational for an expert of such a level to make an enemy out of him.<br/><br/>It was even a foolish act.<br/><br/>In addition, he was the first to make a move this time. He had predicted the strength of his opponent.<br/><br/>“This might be fate!”<br/><br/>Saint Shan Tian said. He returned to the tower and placed the pieces of the god of elements on top of it again.<br/><br/>Wang Xian flew out of the area and came to a distant location. With a wave of his arm, a palace appeared in the void<br/><br/>Wang Xian entered the palace and took out the divination lamp again.<br/><br/>A surge of energy was injected into it and Wang Xian began to completely refine it!<br/><br/>The energy entered the divination lamp and slowly gathered towards the wick of the divination lamp.<br/><br/>Once the divination lamp was used, the divination lamp would light up.<br/><br/>If he wanted to perform divination, he would need to light up the divination lamp.<br/><br/>However, Wang Xian realized that the energy required to light up the lamp of divination was extremely terrifying.<br/><br/>He had been pouring energy into the lamp of divination. The amount of energy that he had poured in for an hour did not even reach 1/10,000 of the amount of energy stored in the wick!<br/><br/>Furthermore, Wang Xian realized that the energy that he had poured in could not be used to perform divination.<br/><br/>That was because there was not enough energy!<br/><br/>As expected, the divination lamp could not be used indefinitely. It needed to store energy. However, he did not know how many divinations it could store once.<br/><br/>Wang Xian thought to himself and began to infuse energy continuously.<br/><br/>Time passed day by day.<br/><br/>“I’ve finally filled it up!”<br/><br/>A year passed. Wang Xian looked at the divination lamp in his hand and smiled.<br/><br/>After a year of continuous energy infusions, the lamp was finally filled.<br/><br/>Wang Xian had a thought and began to experiment wholeheartedly.<br/><br/>If one wanted to perform divination with the divination lamp, there were some conditions that had to be met.<br/><br/>One type of divination was to look at the target and perform divination on the target.<br/><br/>Divination of all information about the target.<br/><br/>Including the birth and future.<br/><br/>Of course, this type of divination was more effective for the weaker ones.<br/><br/>For example, if Wang Xian used it on a supremacy, he would be able to divine the past of this supremacy-level disciple and what would happen in the next 10,000 years.<br/><br/>Of course, there was a prerequisite for this divination. That was, this supremacy-level disciple did not come into contact with a powerhouse in the Heavenly Yuan blessed realm. Otherwise, he would not be prepared or the divination would fail.<br/><br/>If Wang Xian were to perform divination on a powerhouse of the Great Dao level, he could only divine what happened a second ago and what happened a second later.<br/><br/>For a beginner-level powerhouse, he could divine what happened 20 seconds ago and 20 seconds later.<br/><br/>The more powerful one was, the shorter the divination time would be!<br/><br/>This was a kind of face-to-face divination.<br/><br/>There was another type of divination where the opponent was not beside him. This type of divination required Wang Xian to possess the object of the target.<br/><br/>Divination was done through this object.<br/><br/>Through object divination, the position of the opponent could be divined.<br/><br/>For long-distance divination, divination experts could only divine the position at most.<br/><br/>It was impossible to divine his past and future.<br/><br/>On the other hand, for those who were below the Tianyuan blessed realm, they could obtain more effects by divining objects.<br/><br/>“Divine the location of the Dragon Palace.”<br/><br/>Wang Xian took out an item from the dragon palace and immediately began divination.<br/><br/>The next moment, the lamp of divination lit up. Under the light, the image of the Dragon Palace appeared. At the same time, a stream of information surged into Wang Xian’s mind.<br/><br/>Along with the appearance of the image and information, Wang Xian saw that the energy in the divination lamp was being consumed crazily.<br/><br/>In just a few seconds, half of the energy was consumed!<br/><br/>Wang Xian immediately stopped this divination.<br/><br/>The divination result only showed the appearance of a Dragon Palace, the appearance of the nine-origin universe.<br/><br/>Even the name of the nine-origin universe was not divined.<br/><br/>“Divination of the Dragon Palace gives me little information. This is because I belong to the Dragon Palace. In addition, the Dragon Palace has the presence of the Green Moon and the Unicorn Ox. There are too many strong people in the Heaven’s origin realm. If they are too strong, the interference and consumption of divination power will increase!”<br/><br/>Wang Xian calculated in his heart.<br/><br/>He had more or less understood about the lamp of divination.<br/><br/>If Wang Xian were to divine his opponent of the same level during a battle, he might only be able to divine for ten seconds before his energy was depleted!<br/><br/>Next, if he wanted to predict, he would need to replenish his energy.<br/><br/>Ten seconds was very short. If his opponent were to continue to defend, it would be useless.<br/><br/>He would not be able to control the outcome of the battle.<br/><br/>“However, this lamp of divination is very powerful. It is not difficult to lock onto a weakling.”<br/><br/>Wang Xian thought to himself.<br/><br/>In the future, if Wang Xian wanted to completely kill a powerhouse who had just entered the Heaven’s origin realm, he could do so through the lamp of divination.<br/><br/>He could lock onto his position and kill his way over.<br/><br/>“Not bad, not bad. This divination lamp is very useful.”<br/><br/>Wang Xian’s face was full of smiles.<br/><br/>With a wave of his arm, the surrounding palaces disappeared. Wang Xian looked at the riot area in front of him and prepared to enter to take a look.<br/><br/>The divination lamp could predict danger to a certain extent.<br/><br/>He could enter to take a look.<br/><br/>In front of him was the core area of the riot zone. If he wanted to obtain treasures, he would have to take the risk and enter.<br/><br/>Otherwise, if he wanted to obtain treasures outside, he would have to depend on the probability!<br/><br/>“I’ll enter and take a look. I’ll see if I can obtain some treasures.”<br/><br/>Wang Xian thought to himself. He moved his body and flew straight inside.<br/><br/>There were many chaos gems in the core area.<br/><br/>Some of the chaos gems were undoubtedly operating.<br/><br/>Each of the chaos gems contained a special and powerful energy.<br/><br/>Wang Xian flew towards one of the chaos gems.<br/><br/>He came before a huge chaos gem and sensed it.<br/><br/>“Wind, metal, space, darkness, and some special energy are mixed within. They are completely condensed together. Although they contain energy, they can not be absorbed.”<br/><br/>Wang Xian sensed the energy in the chaos stone and thought to himself.\t\t\t\t\t\t</div>", "images": {}, "success": true}