{"id": 1288, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074878.html", "title": "Chapter 4291 - Chapter 4291: Under The Negotiation Of 4290", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4291 - Chapter 4291: Under The Negotiation Of 4290</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4291: Under the negotiation of 4290<br/><br/>Translator: 549690339<br/><br/>Saint Shan Tian looked at Wang Xian firmly.<br/><br/>It was impossible for him to give up the Starfield.<br/><br/>It was because of the starfield that he was able to rise to the current stage.<br/><br/>It was also the reason why he was able to establish the current good heaven world.<br/><br/>The Starfield was very, very important to him.<br/><br/>Even if he could not obtain it now, he would not hand it over to others!<br/><br/>When Wang Xian heard Saint Shan Tian’s words and saw his determined expression, he raised his eyebrows slightly. ”…”<br/><br/>Naturally, he could see Saint Shan Tian’s determination.<br/><br/>The galactic fragment was not that important to Wang Xian.<br/><br/>That was because he had obtained it by accident.<br/><br/>Naturally, he wanted to obtain a complete galaxy as well. However, if he did not obtain it, he would not be too disappointed.<br/><br/>He was different from the saint of Heavenly Saints.<br/><br/>“The starfield fragment in my hand, when combined with the Starfield fragment in your hand, is a complete treasure of Tianyuan. You should understand how precious it is!”<br/><br/>Wang Xian fiddled with the starfield fragment in his hand and spoke to the saint of Heavenly Saints!<br/><br/>“To you, it’s only important if you obtain the starfield fragment in my hand. If you can’t obtain the Starfield fragment in my hand, it’s not important to you!”<br/><br/>“But I also know that you won’t give it to me easily. Give me a condition. As long as it’s not too excessive, my goodness heaven realm will agree with you. I hope that we can become friends!”<br/><br/>Saint Saint Saint Saint Saint took a deep breath and said!<br/><br/>The starfield lock fragment was now useless in the hands of both sides.<br/><br/>Only by gathering it together would it be able to recover to the Heavenly Yuan Destiny Supreme Treasure Realm!<br/><br/>He was also prepared for the other party to ask for more!<br/><br/>The star field was very important to him.<br/><br/>As long as he obtained the star field, he would be able to enter the center of the riot and obtain more treasures.<br/><br/>This would make the Good Heaven World even stronger!<br/><br/>“Make a friend? Hehe!”<br/><br/>Wang Xian smiled faintly. His gaze landed on the palm of Saint Shan Tian and the corner of his mouth curled up slightly. “Then, this friend, can you introduce the lamp in your hand?”<br/><br/>The lamp in Saint Shan Tian’s hand was not simple in Wang Xian’s eyes!<br/><br/>He seemed to be able to predict his actions.<br/><br/>Furthermore, this lamp also had the ability to investigate. Furthermore, the effect of the investigation was extremely powerful!<br/><br/>He had been keeping the galactic fragment in the mother nest. Logically speaking, it should be impossible for it to be discovered.<br/><br/>However, Saint Shan Tian had sensed it.<br/><br/>In addition, the lamp could quickly determine his own strength. It was not simple!<br/><br/>Wang Xian also wanted to obtain the other party’s galactic fragment, but it was obvious that the probability was almost zero.<br/><br/>The galactic fragment was not important to him. If he could exchange it for a powerful treasure, he would not be reluctant to give it up!<br/><br/>This galactic fragment was indeed of little value to the current him!<br/><br/>When Saint Shan Tian heard Wang Xian’s words, his expression changed slightly!<br/><br/>He tightened his grip on the divination lamp in his hand. His expression was extremely grave!<br/><br/>“Divination lamp, a treasure that can be used for divination and prophecy. It is an all-supporting treasure!”<br/><br/>Saint Shan Tian introduced it!<br/><br/>“Please be more specific, my friend!”<br/><br/>Wang Xian stared at his divination lamp and continued to speak!<br/><br/>“I will not use this lamp to make a trade!”<br/><br/>When Saint Shan Tian saw that Wang Xian was coveting the divination lamp in his hand, his expression changed as he spoke!<br/><br/>“Hehe, forget it then!”<br/><br/>Wang Xian smiled faintly and kept the star field fragment in his bag.<br/><br/>“I can use other items to make a trade with you. The fragment of the god of elements and cultivation treasures are both available!”<br/><br/>Saint Shan Tian’s expression changed again as he spoke!<br/><br/>“You can’t give me what I need, so why should I trade with you?”<br/><br/>Wang Xian stared at him and said plainly, “Other than this lamp of divination, what else can tempt me?”<br/><br/>His words made Saint Shan Tian clench his fists tightly as he looked at the lamp of divination in his hand!<br/><br/>“Patriarch, the divination lamp is also incomparably precious. It was a treasure that you risked your life to obtain.”<br/><br/>Behind Saint Shan Tian, the control-level expert spoke with an unsightly expression!<br/><br/>The divination lamp in their patriarch’s hand was a treasure that he had risked his life to obtain.<br/><br/>It was also because of that time that he had risked entering the chaotic region with the chaos gems.<br/><br/>It was also because of that time that although he had obtained this treasure, the Starfield had become a fragment and he had died once!<br/><br/>It could be said that the price of obtaining the divination lamp was the star field shattering and dying once.<br/><br/>This price wasn’t worth it!<br/><br/>Now, they actually had to face such a choice!<br/><br/>“In order to obtain this divination lamp, the star field fragment shattered that time. Although the divination lamp is a supporting treasure, its functions are incomparably powerful. It can predict and predict.”<br/><br/>“It can predict the opponent’s position, predict the opponent’s moves, and even predict the opponent’s strength. The lamp of divination is an extremely precious treasure to any heaven origin destiny realm powerhouse.”<br/><br/>Saint Shan Tian looked at the lamp of divination in his hand and muttered. There was a hint of struggle on his face.<br/><br/>Wang Xian was surprised when he heard his words.<br/><br/>He didn’t expect that the reason why the Starfield had become a fragment had something to do with this divination lamp!<br/><br/>The ability to predict the future was indeed powerful.<br/><br/>“This might be fate. It might be destiny!”<br/><br/>Wang Xian said to Saint Shan Tian with a smile on his face!<br/><br/>“Yes, this might be fate. It might be destiny!”<br/><br/>Saint Shan Tian stared at Wang Xian and said, “Give me the starfield fragment in your hand. Also, return the god of elements fragment to us. This is my condition. Otherwise, there is no need to make a deal!”<br/><br/>“HMM?”<br/><br/>Wang Xian looked at his expression and nodded with a smile. “Sure. Congratulations. After obtaining the galactic fragment in my hands, you will be able to recover the full power of the ultimate treasure of the Heaven’s origin!”<br/><br/>“If you want to fully recover the ultimate treasure of the Heaven’s origin, you will need a large number of treasures and resources to nurture it. It will take some time!”<br/><br/>Saint Shan Tian said. With a move of his palm, the divination lamp floated in front of him!<br/><br/>“You cut off the connection with the divination lamp, and I’ll cut off the connection with the Starfield lock fragment. If you don’t want to have a mortal enemy, don’t play any tricks!”<br/><br/>With a move of Wang Xian’s palm, the starfield fragment also floated in front of him!<br/><br/>“Similarly, you have to remember this sentence of yours!”<br/><br/>Saint Shan Tian said!<br/><br/>“Don’t worry, the fragment of the Starfield is not that important to me!”<br/><br/>Wang Xian smiled and nodded!<br/><br/>“Let’s do it together!”<br/><br/>Saint Shan Tian said as he stared at Wang Xian.<br/><br/>Wang Xian nodded.<br/><br/>Their palms moved and the fragment of the Starfield flew towards him.<br/><br/>At the same time, the divination lamp flew towards Wang Xian.<br/><br/>Wang Xian could sense the peculiar energy contained within the divination lamp.<br/><br/>This energy was extremely mystical!<br/><br/>Wang Xian felt that it was extremely worth it to exchange a galactic fragment for such a treasure!\t\t\t\t\t\t</div>", "images": {}, "success": true}