{"id": 1285, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074866.html", "title": "Chapter 4288 - Chapter 4288: 4287 Was Fighting", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4288 - Chapter 4288: 4287 Was Fighting</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4288: 4287 was fighting<br/><br/>Translator: 549690339<br/><br/>“One is at the Great Dao level, one is at the control level, and two are at the beginner level.”<br/><br/>Wang Xian was floating in front of the chaotic meteorite in the center of the riot.<br/><br/>When he saw the four heaven origin creation stage powerhouses who suddenly flew over and stared at him, his eyes flickered slightly as he thought to himself!<br/><br/>A hint of seriousness appeared on his face.<br/><br/>The combined strength of the four of them was only slightly weaker than him.<br/><br/>Moreover, he wasn’t sure if they would still have companions!<br/><br/>“Four of you, staring at others like that will cause no regrets!”<br/><br/>Wang Xian narrowed his eyes slightly and completely restrained the energy in his body. There was a hint of coldness on his face as well.<br/><br/>To any powerhouse, staring at them like that was a provocation.<br/><br/>“My friend, do you have the fragment of the Celestial Domain, the Ultimate Treasure of Tianyuan?”<br/><br/>The saint of Heavenly Saints, who was in the lead, stared at Wang Xian and asked with a slightly heated tone!<br/><br/>The divination lamp in his hand was still emitting light.<br/><br/>Wang Xian’s figure was reflected in the light!<br/><br/>“The fragment of the Celestial Domain?”<br/><br/>Upon hearing his words, Wang Xian glanced at the divination lamp beside him and raised his eyebrows slightly. “I didn’t expect that you guys would have such a treasure. You guys are actually able to detect the treasure on me?”<br/><br/>“The fragment of the Starfield belongs to our sect’s ancestor. However, it broke due to an accident. Naturally, our treasure can sense it!”<br/><br/>The old man beside Saint Shan Tian immediately spoke up!<br/><br/>“Your treasure? Hehe, you are going overboard with your words. Why would your treasure appear in My Hands?”<br/><br/>Wang Xian looked at the old man, shook his head, and said with a smile!<br/><br/>“How many galactic fragments do you have in your hands? If you can take them out, I am willing to trade with you at a high price. Although the fragments of the ultimate treasure of Tianyuan are valuable, they are not of much use to the powerhouses of Tianyuan!”<br/><br/>Saint Shan Tian waved his hand at his subordinate and said to Wang Xian!<br/><br/>“My friend, since you are looking for galactic fragments, you must have galactic fragments in your hands as well. Can I take a look at the galactic fragments in your hands? If possible, I also want to repair this ultimate treasure of Tianyuan!”<br/><br/>Wang Xian squinted his eyes slightly and said!<br/><br/>What a joke!<br/><br/>Wang Xian also had the idea of repairing the galactic fragment.<br/><br/>Of course, this kind of thing was something that could be encountered but not sought!<br/><br/>He was only thinking about the possibility.<br/><br/>He did not have much hope.<br/><br/>However, this great dao level powerhouse in front of him clearly had the galactic fragment in his hands!<br/><br/>This was a little special!<br/><br/>“Why don’t you take out the starfield fragment in your hands and I’ll take out the starfield fragment in mine. Let’s take a look?”<br/><br/>Saint Shan Tian stared at Wang Xian with a twinkle in his eyes as he spoke!<br/><br/>“Hehe, if you take it out, I can naturally take it out too!”<br/><br/>Wang Xian saw Saint Shan Tian’s expression and naturally knew what he was thinking.<br/><br/>However, this was also what he was thinking.<br/><br/>The fragment of the Celestial Domain!<br/><br/>If both parties only controlled a small portion of it, then they might be safe and sound.<br/><br/>However, if the fragment of the celestial domain in both parties’hands could be combined into a complete heaven’s origin creation treasure.<br/><br/>Then, everything would be hard to say!<br/><br/>As Wang Xian spoke, he moved his palm and held the fragment of the celestial domain in his hand.<br/><br/>Saint Shan Tian stared at Wang Xian and moved his palm as well.<br/><br/>Buzz Buzz Buzz<br/><br/>However, Wang Xian and the rest did not need to check.<br/><br/>When Saint Shan Tian took out the ultimate treasure of the Heaven’s origin creation, the galactic fragment in Wang Xian’s hand started to tremble violently!<br/><br/>Even if the galactic fragment was completely refined by him.<br/><br/>However, at this moment, the galactic fragment instinctively wanted to fuse with the galactic fragment in Saint Shan Tian’s hand!<br/><br/>The same thing happened to Saint Shan Tian!<br/><br/>“Good, good, I’ve finally found it!”<br/><br/>Saint Shan Tian’s face revealed an excited expression. He was once the owner of the star field fragment, and now he understood what this meant.<br/><br/>The star field fragment in the other party’s hands was actually the part that he was missing.<br/><br/>Once he could obtain it, he would be able to completely restore the Heavenly Yuan Destiny Treasure Star Field!<br/><br/>This made him extremely excited!<br/><br/>The celestial domain was too important to him!<br/><br/>“The fragment of the celestial domain in the other party’s hand, together with the one in my hand, is a complete celestial domain’s ultimate treasure of the Heaven’s origin creation!”<br/><br/>When Wang Xian saw this scene, his gaze also focused!<br/><br/>Once the ultimate treasure of the Heaven’s origin creation was shattered, there was a possibility for it to be restored.<br/><br/>At that time, he would at most take out some treasures to nourish it.<br/><br/>A complete ultimate treasure of the Heaven’s origin was worth a terrifying amount of money.<br/><br/>Wang Xian’s eyes also revealed a hint of excitement.<br/><br/>“Friend, name a price. I want the galactic fragment in your hands!”<br/><br/>Saint Shan Tian stared at Wang Xian and said with a burning gaze!<br/><br/>“Name a price. I want the galactic fragment in your hands too.”<br/><br/>Wang Xian stared at him and said the same thing!<br/><br/>An offensive-type Heaven’s origin destiny-level treasure. This was able to enhance the combat strength of an expert at the control level.<br/><br/>The experts at the Great Dao level were also envious and tempted!<br/><br/>Boom<br/><br/>Just as Wang Xian finished his sentence, Saint Shan Tian started to move from the opposite side.<br/><br/>He clearly realized that Wang Xian didn’t want to give him the galactic fragment in his hands.<br/><br/>Instead, he wanted the galactic fragment in his hands.<br/><br/>Since that was the case, there was no need to negotiate anymore!<br/><br/>Although he could not sense the strength of this powerhouse, he, Shan Tian, was confident!<br/><br/>That was because he was an existence at the level of the Great Dao.<br/><br/>In the entire Justice Alliance, an existence at this level could be considered as one of the top existences.<br/><br/>He was also one of the higher-ups of the Justice Alliance!<br/><br/>He was one of them!<br/><br/>“Surround him!”<br/><br/>When the three Heaven’s origin creation powerhouses beside Saint Shan Tian saw their sect leader making a move, their eyes froze.<br/><br/>They did not attack but flew to the sides immediately.<br/><br/>They wanted to surround Wang Xian and prevent him from escaping!<br/><br/>“Hehe!”<br/><br/>Wang Xian was not surprised to see Saint Shan Tian making a move!<br/><br/>However, when he saw the other Heaven’s origin powerhouses trying to surround him, his face was filled with sarcasm!<br/><br/>Boom<br/><br/>Wang Xian looked at Saint Shan Tian who was attacking him. A cold look appeared in his eyes.<br/><br/>Saint Shan Tian waved his palm and a huge palm print covered him.<br/><br/>Great Heaven Palm Print!<br/><br/>Wang Xian extended his dragon claw directly. The power of the five elements great grinding tai chi dragon disc and the body of the Void Divine Dragon were all superimposed on it.<br/><br/>When faced with an expert at the level of Great Dao, he would not hold back at all. He could not hold back either!<br/><br/>Boom<br/><br/>A terrifying dragon claw headed toward Saint Shan Tian’s great heaven palm print!<br/><br/>When Saint Shan Tian sensed the power of Wang Xian’s Dragon Claw, a bad premonition appeared on his face!<br/><br/>The Dragon Claw landed on the Great Heaven Palm Print and broke it!<br/><br/>Following that, the terrifying power of the Dragon Claw rushed in front of Saint Shan Tian.<br/><br/>“Suppress!”<br/><br/>Saint Shan Tian’s body shook. An Energy Phantom shot out from his body and headed toward the Dragon Claw!<br/><br/>“Bang! Bang! Bang!”<br/><br/>The intense collision continued.<br/><br/>However, Saint Shan Tian’s expression changed drastically. He was still unable to withstand the terrifying dragon claw.<br/><br/>He spat out a lot of blood and flew backward!\t\t\t\t\t\t</div>", "images": {}, "success": true}