{"id": 1287, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074874.html", "title": "Chapter 4290 - Chapter 4290: 4289 On The Negotiation", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4290 - Chapter 4290: 4289 On The Negotiation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4290: 4289 on the negotiation<br/><br/>Translator: 549690339<br/><br/>“He wants to obtain those elemental gods and destroy our elemental divine tower!”<br/><br/>When Saint Shan Tian saw Wang Xian rushing towards the tower, his face was extremely embarrassed.<br/><br/>They could only pin down Wang Xian, but it was impossible to trap him in a single area.<br/><br/>Now that Wang Xian was targeting those towers, Saint Shan Tian and the rest couldn’t stop him at all!<br/><br/>“We can’t let him take the god of elements away. I’ll hold him back. You guys take the god of elements away!”<br/><br/>Saint Shan Tian continued to roar loudly!<br/><br/>His body trembled and began to grow bigger.<br/><br/>In an instant, he transformed into an incomparably huge giant that covered the sky.<br/><br/>He extended a finger and pointed it directly at Wang Xian!<br/><br/>That finger broke off from his palm and carried an invincible might.<br/><br/>Beside him, the expressions of the other three Heaven’s origin powerhouses changed when they saw their sect leader attacking at the cost of sacrificing his life force.<br/><br/>They quickly grabbed at the fragments of the Elemental God!<br/><br/>These fragments of the Elemental God were extremely important to their goodness heaven world.<br/><br/>This was the strongest elemental god that their goodness heaven world had gathered over the past tens of billions of years.<br/><br/>“Hehe!”<br/><br/>When Wang Xian saw that the saint of Goodness Heaven wanted to stop him, a cold expression appeared on his face.<br/><br/>“Roar! Roar!”<br/><br/>Wang Xian let out a low roar. He swayed his huge body and went straight for the broken finger of the Saint of Goodness Heaven.<br/><br/>At the same time, the body of the Void Divine Dragon flew out from his body.<br/><br/>Carrying the five elements millstone, the Void Dragon Pool teleported and clawed at the elemental gods one by one!<br/><br/>“Bang!”<br/><br/>In the next instant, Wang Xian’s dragon claw wrapped around the Tai Chi Dragon Disk and directly resisted the broken finger of Saint Shan Tian.<br/><br/>A huge explosion sounded as the broken finger collided with the Dragon Claw.<br/><br/>A deep wound appeared on Wang Xian’s Dragon Claw!<br/><br/>The energy carried by the broken finger caused Wang Xian’s dragon claw to be slightly broken!<br/><br/>However, the flesh and blood started to heal rapidly at the place where it was broken!<br/><br/>When Saint Shan Tian saw this scene, there wasn’t the slightest hint of surprise on his face.<br/><br/>He looked to the side and his expression sank.<br/><br/>He had sacrificed one of his fingers to unleash an attack that had injured his opponent.<br/><br/>However, the terrifying existence in front of him had split out a powerful force.<br/><br/>This force instantly arrived in front of an elemental god!<br/><br/>“This is the power of space. From his body, I can feel the power of other attributes. How many abilities and trump cards does this mysterious powerhouse have?”<br/><br/>The saint of Good Days Face is embarrassed low voice roar way!<br/><br/>“Stop!”<br/><br/>At this time, the three strong Tianyuan creation, thought that their patriarch can resist that strong enemy.<br/><br/>However, they did not expect that just when they put away the first elemental god, a doppelganger of the powerful enemy instantly arrived in front of a fragment of the Elemental God.<br/><br/>They could only watch helplessly as he kept the fragment of the god of elements in his bag!<br/><br/>This made their expressions extremely awkward!<br/><br/>“Hehe, you think you can stop me just because of your sect leader? All of you together won’t be able to stop me!”<br/><br/>Wang Xian looked at them and sneered. He stared at the other god of elements fragments and flew over directly!<br/><br/>“I’ll stop him. All of you, put away the fragment of the god of elements!”<br/><br/>One of the control-level powerhouses roared and attacked the body of the void God Dragon!<br/><br/>“Hehe!”<br/><br/>Wang Xian’s body of the void God dragon laughed coldly. He waved his arm and the five elements grinding mill and the void dragon pool emitted a terrifying energy, forming a powerful defense in front of him!<br/><br/>Following that, his figure disappeared instantly and teleported to another fragment of the god of elements!<br/><br/>With a wave of his arm, he kept it in his bag!<br/><br/>Even though there was an energy protection around the fragment of the god of elements, it was still easily destroyed by Wang Xian.<br/><br/>“Not good. He has the space attribute and is very difficult to deal with!”<br/><br/>The expression of the control-level powerhouse changed drastically. Knowing that he could not restrain his opponent, he gave up and started to collect the fragments of the god of elements one by one!<br/><br/>Saint Shan Tian swept his gaze over and his expression was abnormally ugly!<br/><br/>He took a deep breath and stared at Wang Xian. He stopped his attempts to stop and attack!<br/><br/>“My friend, I know it’s My Fault for taking the initiative to attack. Take as many God of elements fragments as you can. Can We have a talk?”<br/><br/>Saint Shan Tian gave up completely.<br/><br/>He couldn’t beat Wang Xian in a fight.<br/><br/>He couldn’t stop him even if he wanted to.<br/><br/>He might as well give up generously.<br/><br/>Compared to the fragment of the god of elements, the fragment of the star field was more important to him.<br/><br/>He didn’t want to get into a deadlock with Wang Xian!<br/><br/>If he became his enemy, he would never be able to recover the ultimate treasure of the Heaven’s origin in the star field!<br/><br/>“Hehe, now you know how to have a talk?”<br/><br/>Wang Xian stared at Saint Shan Tian with a mocking expression on his face. However, Wang Xian did not continue to attack!<br/><br/>With the Void Dragon Body’s rapid teleportation, he obtained pieces of the god of elements!<br/><br/>Out of the eight pieces of the god of elements, he had snatched a total of five pieces.<br/><br/>These five pieces were much more precious than the ones he had obtained from the surroundings of the tree of chaos.<br/><br/>One fragment was equivalent to almost all of them.<br/><br/>“These five fragments of the god of elements are equivalent to your feeble apology just now!”<br/><br/>Wang Xian calmed his mind and the body of the Void Divine Dragon returned to his body.<br/><br/>He looked at these five fragments of the god of elements and said with a smile on his face!<br/><br/>“You…”<br/><br/>When the other three Heaven’s origin creation stage powerhouses heard Wang Xian’s words, a hint of anger appeared on their faces.<br/><br/>They had never suffered such humiliation before.<br/><br/>However, when they thought of the methods of this mysterious powerhouse, they could only hold back the rest of their words!<br/><br/>“My friend, I want to exchange for the galactic fragment in your hands. Name a price!”<br/><br/>Saint Shan Tian took a deep breath, looked at Wang Xian, and asked.<br/><br/>“I want to exchange for the galactic fragment in your hands. What Price Do you want?”<br/><br/>Wang Xian asked back when he heard his words. The smile on his face disappeared.<br/><br/>Currently, the galactic fragment that the other party possessed could restore the entire galaxy to the state of the Heaven’s origin creation!<br/><br/>This was also very important to Wang Xian.<br/><br/>A complete treasure of the Heaven’s origin creation could only be obtained by chance!<br/><br/>Even a great dao expert would fight for it!<br/><br/>However, Wang Xian already understood the other party’s strength.<br/><br/>Although it was inferior to him, it was impossible for him to kill the other party.<br/><br/>Similarly, the other party wanted to trade with him because he saw how powerful he was.<br/><br/>Now, it would depend on who offered the highest price and who could move the other party!<br/><br/>“The star field used to Be My Heaven’s origin Destiny Treasure. It was shattered due to an accident. I have been searching for it for tens of billions of years. I will not give it up, nor will I hand it over to others.”<br/><br/>Saint Shan Tian said with a determined gaze. He looked at Wang Xian and gritted his teeth. “Name a price. As long as I can afford it, I will agree!”\t\t\t\t\t\t</div>", "images": {}, "success": true}