{"id": 1286, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074870.html", "title": "Chapter 4289 - Chapter 4289: 4288 Fought Against Wang Xian", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4289 - Chapter 4289: 4288 Fought Against Wang Xian</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4289: 4288 fought against Wang Xian<br/><br/>Translator: 549690339<br/><br/>“How is this possible!”<br/><br/>Saint Shan spat out a mouthful of blood as he stared at Wang Xian in shock.<br/><br/>He was actually defeated.<br/><br/>He was able to determine the winner with just one move!<br/><br/>He was an expert at the Great Dao level. He was also a well-known existence in the entire Justice Alliance.<br/><br/>However, he was completely no match for this unfamiliar heaven origin creator.<br/><br/>Since when did Great Dao realm experts appear everywhere?<br/><br/>The reason why he dared to make such a move was because he was confident!<br/><br/>He couldn’t possibly be extremely unlucky to meet an extremely terrifying existence, right?<br/><br/>But he never thought that he would actually meet one!<br/><br/>“What?”<br/><br/>“Not good!”<br/><br/>On both sides, the other three heavenly fate realm experts saw their sect leader being sent flying with a single strike. They spat out fresh blood and their expressions changed drastically!<br/><br/>“A powerhouse who has just stepped into the Great Dao level dares to take the initiative to attack me?”<br/><br/>Wang Xian’s face was filled with a cold expression. He moved his body and charged straight towards him.<br/><br/>When Saint Shan Tian saw Wang Xian charging towards him, his expression changed drastically!<br/><br/>“Come here, let’s join hands behind me!”<br/><br/>Saint Shan Tian’s expression changed slightly. He quickly dodged and shouted at his three subordinates!<br/><br/>“It’s the leader!”<br/><br/>The Three Heaven’s origin powerhouses did not hesitate at all. They immediately flew towards Saint Shan Tian!<br/><br/>Buzz<br/><br/>As Saint Shan Tian dodged, a surge of energy was injected into the divination lamp.<br/><br/>Following that, the divination lamp flickered with a luster.<br/><br/>There was a message on it!<br/><br/>“Close to the strength of two Great Dao level powerhouses?”<br/><br/>Saint Shan Tian sensed the message on the divination lamp and let out a low growl. He widened his eyes and stared at Wang Xian with an unsightly expression!<br/><br/>“You want to snatch the galactic fragment from my hands. It’s perfect. I also want to obtain it from your hands!”<br/><br/>Wang Xian’s gaze swept across the divination lamp and revealed a hint of surprise.<br/><br/>Following that, his body moved and transformed into the body of a divine dragon!<br/><br/>Buzz! Buzz! Buzz<br/><br/>A wave of fog enveloped them completely. The entire void was enveloped by the fog!<br/><br/>“Divination, Wentian!”<br/><br/>Saint Shan Tian’s expression changed slightly when he saw that his surroundings were enveloped by the dense fog!<br/><br/>A wave of energy surged into the divination lamp. Following that, a message was transmitted into his mind!<br/><br/>“Attack!”<br/><br/>Saint Shan Tian roared loudly and attacked directly to his right!<br/><br/>“Huh?”<br/><br/>At the same time, Wang Xian’s body trembled and teleported to his right.<br/><br/>The moment he completed his teleportation, he felt a terrifying energy attacking him.<br/><br/>This gave him a slight shock!<br/><br/>The dragon scales on his body glowed and blocked their attacks directly!<br/><br/>“Bang! Bang! Bang!”<br/><br/>Intense sounds of collision rang out. Numerous attacks landed on his dragon scales and were blocked with great difficulty.<br/><br/>“Roar!”<br/><br/>Wang Xian let out a low roar. In the sky, a terrifying dragon head headed straight for them!<br/><br/>“Block it!”<br/><br/>Saint Shan Tian continued to roar loudly.<br/><br/>The three subordinates who flew behind him attacked according to his orders!<br/><br/>A terrifying energy soared into the sky and met the dragon head that was descending from the sky.<br/><br/>“Don’t hold back!”<br/><br/>Saint Shan Tian’s expression changed slightly when he saw the result of the collision.<br/><br/>The lamp wick of the divination lamp emitted a ray of light and met the dragon head head!<br/><br/>Saint Shan Tian and the rest joined hands. There was still a gap of two people who had just entered the Heaven’s origin blessed realm from Wang Xian.<br/><br/>This gap was not huge.<br/><br/>However, they would not be able to gain the upper hand when they fought against Wang Xian!<br/><br/>“My friend, you are very strong. However, the gap between us joining hands is not huge either. Let’s have a good talk!”<br/><br/>Saint Shan Tian’s expression changed drastically as he shouted at Wang Xian!<br/><br/>“Hehe, you are not my match. Now that you know how to make peace, if I am not your match, wouldn’t I be killed by you guys?”<br/><br/>Wang Xian’s face was filled with a cold expression. “Even if I can’t kill you guys, I can still kill your disciples!”<br/><br/>As he spoke, his gaze focused as he looked behind Saint Shan Tian and the rest!<br/><br/>Just now, Wang Xian also saw them coming from there.<br/><br/>The tall tower buildings were absorbing the energy in the center of the chaotic area.<br/><br/>The fragments of the god of elements above were obviously worth a lot!<br/><br/>At the bottom of the tall tower, he could sense the aura of the mastery realm disciples!<br/><br/>The moment Wang Xian finished his sentence, he flew straight ahead!<br/><br/>“Oh no!”<br/><br/>When Saint Shan Tian saw that Wang Xian had set his target at their tower, his expression changed drastically!<br/><br/>“Stop, we can talk about anything. We each have half of the starfield fragment. If you want to get the other half, if you want to complete it, we need to talk!”<br/><br/>“Otherwise, even if we are not your match, you can forget about getting the starfield fragment in my hands!”<br/><br/>Saint Shan Tian’s expression changed drastically as he shouted at Wang Xian!<br/><br/>Saint Shan Tian had a complete understanding of Wang Xian’s strength.<br/><br/>It was obviously impossible for him to take away the galactic fragment from his hands.<br/><br/>However, it was also impossible for the other party to take it away from him.<br/><br/>However, with his terrifying strength, if he were to deal with the Celestial World Tower of the Saint Tian World, Saint Shan Tian would also be unable to organize the other party’s disciples here!<br/><br/>Boom<br/><br/>Wang Xian heard his words and ignored him. He swayed his huge body and dashed towards the direction of the tower!<br/><br/>“All Disciples of the Shan Tian World, escape immediately. We will stop him!”<br/><br/>When the saint of the Shan Tian world saw that Wang Xian completely ignored him, his expression changed drastically. He immediately shouted at the disciples behind him!<br/><br/>“Huh? What?”<br/><br/>“Our sect leader and the rest are actually not a match for that powerhouse. Quick, quick, run!”<br/><br/>At the back, the disciples of the Saint Heaven Realm had sensed and watched the battle between their sect leader and Wang Xian.<br/><br/>Now, when they heard their sect leader’s voice, their expressions changed drastically.<br/><br/>The group of powerhouses who were at the peak of the Overlord realm did not hesitate at all. They immediately led all the disciples into the teleportation formation!<br/><br/>This was a cultivation treasure ground built by their sect leader.<br/><br/>However, in order to prevent the Chaos Stone’s energy from exploding in the center, they were prepared to escape!<br/><br/>Therefore, the group of disciples entered the teleportation formation and left this place!<br/><br/>“If you want to stop me, can you stop me?”<br/><br/>Wang Xian’s eyes were filled with coldness when he saw Saint Shan Tian and the rest blocking him.<br/><br/>Ten types of energy gathered on his body and lingered around him.<br/><br/>He was like a world-destroying divine dragon in the chaos as he charged forward!<br/><br/>Saint Shan Tian and the rest circulated the energy in their bodies and bombarded Wang Xian continuously.<br/><br/>However, they were still unable to withstand Wang Xian’s charge for long.<br/><br/>In just ten seconds, Wang Xian broke through their defenses!<br/><br/>He stared ahead.<br/><br/>The Disciples of the Goodness Heaven World had all escaped through the teleportation formation.<br/><br/>However, the elemental gods on the eight towers were still floating in the air.<br/><br/>These elemental gods were huge treasures and were extremely valuable!\t\t\t\t\t\t</div>", "images": {}, "success": true}