{"id": 1280, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074846.html", "title": "Chapter 4283 - Chapter 4283: 4282 Killed Another Control-Level Existence Once Again", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4283 - Chapter 4283: 4282 Killed Another Control-Level Existence Once Again</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4283: 4282 killed another control-level existence once again<br/><br/>Translator: 549690339<br/><br/>Boom<br/><br/>When the energy in Wang Xian’s body swept across the entire planet, it was located in the sky above the coldlaw universe.<br/><br/>The smiling faces of the three black-robed elders suddenly froze!<br/><br/>Their expressions changed drastically.<br/><br/>Their gazes were all fixed on the spot where Wang Xian was!<br/><br/>When they saw Wang Xian’s face, the expressions of the three black-robed elders changed once again!<br/><br/>“It’s You? Dragon King?”<br/><br/>The expression of one of the black-robed elders changed slightly. He stared coldly at Wang Xian and growled in a low voice!<br/><br/>They had used the flesh and blood of living beings to upgrade the blood sea flag of soul refinement.<br/><br/>They had just massacred a large number of planets. Now, they had suffered a terrifying attack in an instant!<br/><br/>Everything that they had done previously had gone down the drain!<br/><br/>This made them extremely furious!<br/><br/>“It’s me, the Dragon King, who has accepted the rewards from the living beings of the entire universe to settle your matters!”<br/><br/>Wang Xian stared at them and said with a cold face!<br/><br/>“Dragon King, aren’t you being a little nosy? When you killed Fu Tu and Hao Yang, we didn’t interfere. Now, you actually interfered in our matters. Are you trying to make an enemy out of us?”<br/><br/>A black-robed elder stared at Wang Xian with a cold face and said with a gloomy face!<br/><br/>“Those two fellows from the entire universe are courting death. They are not worthy of being saints of the same universe. Hehe, trading with you guys from the evil sequence faction is really inhumane!”<br/><br/>Wang Xian said calmly!<br/><br/>“The weak are prey to the strong. Dragon King, you are able to reach this level. Not to mention that you have never killed other living beings, why are you pretending to be a righteous Saint Now? Moreover, this is not the universe you are in. This is the entire universe.”<br/><br/>A black-robed elder spoke with a gloomy face!<br/><br/>“I have killed many living beings, but I will not kill innocents indiscriminately. I will not treat ordinary living beings as livestock. After I have received my reward, I will intervene.”<br/><br/>Wang Xian stared at them. His eyes slowly revealed killing intent!<br/><br/>“Dragon King, do you really think that we are to be trifled with?”<br/><br/>The three black-robed elders looked extremely embarrassed. When they sensed Wang Xian’s killing intent, their hearts were filled with vigilance!<br/><br/>Rumble<br/><br/>Crackle<br/><br/>However, as soon as they finished speaking, a terrifying force of wind and thunder surged through the entire void.<br/><br/>It completely enveloped the three black-robed elders!<br/><br/>In the next instant, Wang Xian disappeared and appeared directly in front of the three black-robed elders.<br/><br/>At the same time, the cold spell universe below flew into the distance under the force of Wang Xian!<br/><br/>“What? What happened? A saint is saving us!”<br/><br/>“Which saint is it? Who is the Dragon King? And why did the three demons say that the Dragon King killed Saint Haoyang and Saint Futu?”<br/><br/>“I don’t know. However, that saint is saving us. They are trying to drive the three demons out of our universe!”<br/><br/>“We are saved! We Are Saved!”<br/><br/>“Did we, the Great Sun Saint and Saint Futu, make a deal with these three demons?”<br/><br/>On the cold spell planet, Wang Xian’s sudden move saved the lives on the planet that had yet to be massacred.<br/><br/>As they survived the calamity, their faces were filled with shock when they heard the words of Wang Xian and the rest.<br/><br/>“Heavens, did we, the Saint Futu and the Great Sun Saint, really make a deal with these three demons? Furthermore, those hundreds of thousands of life planets were destroyed. Was it a deal between the two of us and the three demons?”<br/><br/>The more than ten thousand disciples who had followed them from the teleportation array were shocked!<br/><br/>They knew more than ordinary creatures!<br/><br/>They had invited this saint called the Dragon King in the saint’s Palace.<br/><br/>And the saint’s palace was the nest of Saint Futu and Saint Haoyang.<br/><br/>Obviously, since the Dragon King could appear there, it was very likely that Saint Haoyang and Saint Futu had been killed by him!<br/><br/>Now, from their words, they actually obtained two of their saints and made a deal with these three demons.<br/><br/>What Deal?<br/><br/>When they thought of how the lives of dozens of planets had angered the saints and been punished by the heavens, their expressions changed drastically!<br/><br/>“Do we have a reason to be deceived by these saints?”<br/><br/>The old man laughed bitterly and said!<br/><br/>There was a trace of despair on his face.<br/><br/>They would never have thought that the saints of their universe would treat them as livestock and trade with the demons!<br/><br/>“Then the two saints of our Universe?”<br/><br/>Some disciples could not accept this fact and were on the verge of collapse.<br/><br/>The Saints of their universe not only did not protect them, but also traded them with the demons.<br/><br/>This? ? ?<br/><br/>“Sigh!”<br/><br/>The old man sighed helplessly and looked at the sky.<br/><br/>Boom<br/><br/>At this moment, a terrifying collision sound was heard!<br/><br/>Wang Xian’s figure appeared in front of the three black-robed old men. He transformed into the body of a divine dragon and swept out with his dragon tail!<br/><br/>“Let’s go. We can not fight with him. We are not his match!”<br/><br/>The three black-robed elders’faces changed when they saw Wang Xian attacking them. They made a quick decision and made a decision immediately!<br/><br/>Boom! Boom! Boom<br/><br/>The three of them raised the blood sea flag in their hands. Terrifying black ferocious shadows flew out from it and charged toward Wang Xian.<br/><br/>At the same time, they moved and immediately turned into a black flame as they fled into the distance!<br/><br/>They had already witnessed Wang Xian’s strength and knew that the three of them were no match for him. In fact, they might even be killed.<br/><br/>Therefore, they had no intention of fighting him!<br/><br/>“Your speed is too slow!”<br/><br/>Wang Xian’s face was grim. His body trembled as he activated the power of space and teleported directly!<br/><br/>Buzz! Buzz<br/><br/>After two consecutive teleportations, Wang Xian’s figure was only a few thousand kilometers away from them!<br/><br/>This distance was too close for experts at their level!<br/><br/>“Use your secret technique and let your soul waste away!”<br/><br/>The black-robed elder in the middle roared loudly.<br/><br/>A shadow erupted from their bodies and disappeared into the void!<br/><br/>Wang Xian stared at them and extended his dragon claws.<br/><br/>The dragon claws clawed at their bodies!<br/><br/>However, just as they were about to reach their bodies, their figures disappeared instantly!<br/><br/>“Hehe!”<br/><br/>Wang Xian sneered and made a grab at the void in front of him. A black hole appeared in front of him.<br/><br/>Wang Xian entered the black hole directly!<br/><br/>Buzz<br/><br/>The moment he came out of the black hole, Wang Xian saw three black-robed elders.<br/><br/>Roar! Roar<br/><br/>Wang Xian let out a low roar. The fragments of the Starfield above his head spun and planets appeared in the surrounding void space!<br/><br/>“Not good! That Dragon King is chasing after us! Escape!”<br/><br/>When the three black-robed elders who had just escaped saw Wang Xian appearing behind them, their hearts pounded violently as they roared loudly!<br/><br/>“Damn it!”<br/><br/>Their hearts sank. “Don’t be stingy with your treasures. We must flee with all our might for an expert of this level. Otherwise, we will be killed!”<br/><br/>Boom! Boom! Boom<br/><br/>The three black-robed elders emitted a terrifying black glow to defend against Wang Xian’s attack.<br/><br/>At the same time, they took out their treasures without any hesitation!\t\t\t\t\t\t</div>", "images": {}, "success": true}