{"id": 1281, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074850.html", "title": "Chapter 4284 - Chapter 4284: 4283 Killed Another Control-Level Existence", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4284 - Chapter 4284: 4283 Killed Another Control-Level Existence</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4284: 4283 killed another control-level existence<br/><br/>Translator: 549690339<br/><br/>Buzz! Buzz! Buzz<br/><br/>The three black-robed elders looked extremely embarrassed.<br/><br/>They didn’t expect the Dragon King to kill them!<br/><br/>This made them extremely shocked and furious!<br/><br/>However, at the same time, they didn’t hesitate and used their powerful treasures to escape!<br/><br/>“Explode!”<br/><br/>Wang Xian stared at them. His eyes were filled with a cold expression.<br/><br/>He extended his dragon claw and clawed at the Void where the three black-robed elders were!<br/><br/>Boom! Boom! Boom<br/><br/>The entire void started to explode violently.<br/><br/>The expressions of the three black-robed elders changed drastically.<br/><br/>Under this terrifying attack, some of the escape treasures could not be used!<br/><br/>“Ah! Ah!”<br/><br/>“Defend!”<br/><br/>“Buzz! Buzz!”<br/><br/>The three black-robed elders roared loudly.<br/><br/>Two of them disappeared in the violently shaking space!<br/><br/>However, there was another black-robed elder who didn’t use the treasure in his hand due to the violent fluctuations of the space and the terrifying energy impact.<br/><br/>This caused his expression to change drastically, revealing a hint of despair.<br/><br/>“You can stay!”<br/><br/>Wang Xian stared at the black-robed elder who couldn’t escape and teleported in front of him instantly!<br/><br/>The Void Dragon Pool appeared around him.<br/><br/>The space around him froze. It was as if time had frozen.<br/><br/>The black-robed old man’s body seemed to have been frozen. He only had a pair of eyes that were filled with fear!<br/><br/>Wang Xian stared at him and waved his arm with a cold expression!<br/><br/>“Bang!”<br/><br/>The Dragon Claw swept over and destroyed all the life force of the black-robed old man!<br/><br/>Then, he summoned the corpse over!<br/><br/>“I killed another powerhouse at the control level. Not Bad, not bad!”<br/><br/>Wang Xian smiled.<br/><br/>As for the other two black-robed old men escaping, Wang Xian did not care too much about it.<br/><br/>“This treasure for escaping is not bad. I’ll Take It!”<br/><br/>Wang Xian checked the treasure on the old man.<br/><br/>A treasure for escaping was killed by Wang Xian before it could be used!<br/><br/>“Eh?”<br/><br/>At this moment, Wang Xian opened his storage space and suddenly discovered something special.<br/><br/>Wang Xian had killed quite a number of heaven origin creation realm powerhouses, but he did not find any items that he was interested in from these powerhouses.<br/><br/>However, when he saw the few items on the black-robed old man, he was surprised.<br/><br/>A treasure map!<br/><br/>A partial map of the chaotic space!<br/><br/>There was also a fragment of the ultimate treasure of the Heaven’s origin!<br/><br/>Wang Xian looked at the three items and his face was filled with pleasant surprise!<br/><br/>He picked up the fragment of the ultimate treasure of the Heaven’s origin and examined it carefully.<br/><br/>At the same time, he moved his palm and the fragment of the galaxy appeared in his hand.<br/><br/>He placed the fragment of the galaxy together with the fragment of the ultimate treasure of the Heaven’s origin and the two fragments began to fuse slowly!<br/><br/>“This is the other part of the Starfield Fragment!”<br/><br/>Wang Xian thought to himself.<br/><br/>The Starfield fragment was the first piece of the ultimate treasure of the Heaven’s origin creation that he had obtained.<br/><br/>This was an extremely terrifying ultimate treasure.<br/><br/>However, now that Wang Xian’s strength had increased, the starfield fragment was no longer of much use to him!<br/><br/>Although there were a few more fragments this time and the fusion had taken place, there was still a huge gap between him and the complete ultimate treasure of the Heaven’s origin creation!<br/><br/>It wasn’t even at the Heaven’s origin destiny realm yet!<br/><br/>He kept the star field fragment and looked at the other two items.<br/><br/>The map of the chaotic space was indeed of great use to Wang Xian.<br/><br/>“It should be a map created by the powerhouses of the evil sequence camp. This map has a detailed division of the areas where the evil sequence camp and the Justice Alliance are located!”<br/><br/>Wang Xian mumbled.<br/><br/>No one knew how big the chaotic space was.<br/><br/>It was obviously unrealistic to draw a map of the entire chaotic space.<br/><br/>This map had a detailed record of the domain of the chaotic space where Wang Xian was located.<br/><br/>There were more than 500 universes involved!<br/><br/>Among them, the evil sequence faction and the Justice Alliance were the main ones.<br/><br/>This map was of great use to Wang Xian.<br/><br/>At the very least, it could let him know where there was a universe in the surrounding void and what this universe was called.<br/><br/>The last item was a treasure map.<br/><br/>There were some records on the treasure map!<br/><br/>“The chaotic riot zone. Stepping into the center of the riot zone will allow one to obtain invincible power. This galactic fragment was obtained by the black-robed old man in the riot zone.”<br/><br/>“However, this galactic fragment was not born in the chaotic region. Instead, there was an expert who brought the ultimate treasure of Tianyuan destiny into the chaotic region. He suffered a tremendous horror and the ultimate treasure of Tianyuan Destiny was shattered into pieces and scattered!”<br/><br/>“After the death of that Ultimate Treasure of Tianyuan Destiny, it was lost and shattered!”<br/><br/>Wang Xian looked at the information on the treasure map and his eyes flickered slightly.<br/><br/>This treasure map was a map that went deep into the riot zone.<br/><br/>However, this treasure map was created by the Heaven’s origin creator.<br/><br/>Therefore, the exact value of it was still uncertain.<br/><br/>However, it was clear that using this treasure map would not allow one to obtain invincible power in the riot zone!<br/><br/>“What is invincible power? This is the first time I’ve heard of this chaotic region!”<br/><br/>Wang Xian mumbled!<br/><br/>“According to the treasure map, there are fragments of the Starfield there. I can go and take a look myself!”<br/><br/>Wang Xian thought to himself.<br/><br/>The Celestial Destiny Treasure Starfield was extremely powerful. If he could find all the fragments and nourish them with energy, the fragments of the Starfield might be able to return to its peak.<br/><br/>This star field was an offensive treasure!<br/><br/>An offensive treasure could increase one’s combat power by one’s control level!<br/><br/>For example, tianci had just stepped into the heavenly origin creation realm. Because he had an offensive treasure, it was comparable to the weakest control level and the weakest beginner level!<br/><br/>The preciousness of a heavenly origin creation treasure could make great beings go crazy.<br/><br/>It was equivalent to the six paths universe. With just a single piece of news, 70 to 80 powerhouses of the Tianyuan universe had come.<br/><br/>Existences at the level of the Great Dao were even willing to take the risk to enter!<br/><br/>“Tell them to leave on their own!”<br/><br/>Wang Xian made up his mind. With a move of his body, he immediately flew towards the frigid spell planet.<br/><br/>After flying for more than ten hours, he finally arrived at the frigid spell planet!<br/><br/>At this moment, in the frigid spell planet, the more than 10,000 disciples from the heaven-receiving universe were still waiting there.<br/><br/>Wang Xian sensed them and teleported directly in front of them!<br/><br/>“Greetings, Saint. Thank you for your help, Saint!”<br/><br/>When the more than 10,000 disciples from the heaven-receiving universe saw Wang Xian, they immediately knelt on the ground and thanked him respectfully!<br/><br/>“There’s no need. After killing one fellow, the other two escaped. As for whether they will continue to massacre your entire universe, I’m not sure.”<br/><br/>“Also, after the two saints of the entire universe are resurrected, will they treat you as livestock in exchange for resources? I’m not sure either. I Can’t stay here forever!”<br/><br/>Wang Xian looked at them and said faintly.\t\t\t\t\t\t</div>", "images": {}, "success": true}