{"id": 1298, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074918.html", "title": "Chapter 4301 - Chapter 4301: At The Core Region Of The 4300 Cross-Shaped Primordial Spirit", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4301 - Chapter 4301: At The Core Region Of The 4300 Cross-Shaped Primordial Spirit</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4301: At the core region of the 4300 cross-shaped primordial spirit<br/><br/>Translator: 549690339<br/><br/>“Eh? I seem to have broken the balance here.”<br/><br/>Wang Xian looked at the changes in the surroundings and raised his eyebrows slightly.<br/><br/>The entire region was beginning to change due to the changes of the two elemental gods.<br/><br/>This change was extremely huge. It was radiating towards the surroundings at a rapid speed!<br/><br/>Wang Xian looked at it for a while and did not continue to pay attention to it.<br/><br/>He flew towards the back rapidly.<br/><br/>After two days, he flew out of the quicksand region and arrived at the location outside.<br/><br/>With a move of his palm, Wang Xian took out the sword of light and examined it carefully.<br/><br/>This sword did not have a hilt. It looked a little simple.<br/><br/>Wang Xian took out some materials and made a simple sword hilt.<br/><br/>Following that, he injected a beam of light power into it.<br/><br/>In an instant, small sharp swords appeared around the sword of light.<br/><br/>He waved his arm and countless sharp swords covered the area in front of him. They carried a terrifying amount of energy and power.<br/><br/>The Great Dao was simple.<br/><br/>This sharp sword didn’t have many abilities.<br/><br/>Just by injecting energy into it, a large number of swords of light could be produced.<br/><br/>Each sword of light contained the killing power of light!<br/><br/>It was indeed a little terrifying!<br/><br/>There was another characteristic. This sword of light could be hidden in one’s body all the time.<br/><br/>After it was integrated into one’s body, one would be able to unleash powerful swords of light from all over the body when he activated the energy!<br/><br/>This was very useful for Wang Xian.<br/><br/>After all, when he transformed into the body of the divine dragon, it was impossible for him to fight with a sharp sword!<br/><br/>He fused it into his body in satisfaction and began to nurture and refine it bit by bit.<br/><br/>“Currently, my strength is already comparable to two existences of the Great Dao!”<br/><br/>Wang Xian said with a smile on his face.<br/><br/>The reward this time could be said to be very huge for Wang Xian!<br/><br/>A powerful sword of light.<br/><br/>There were also some fragments of the elemental god in his hands, as well as a powerful corrosive treasure with the dark matter attribute.<br/><br/>That treasure could also be forged into a powerful weapon.<br/><br/>After playing with it for a while, Wang Xian took out the divination lamp and prepared to fill the energy in the divination lamp.<br/><br/>“Eh?”<br/><br/>However, when Wang Xian was filling the energy in the divination lamp, the quicksand region in front of him suddenly changed.<br/><br/>The originally huge quicksand region actually slowly separated into a region from the center.<br/><br/>To be more precise, it was more like a road.<br/><br/>The quicksand region was located on both sides. The center was a relatively calm and safe region.<br/><br/>This road extended towards the interior of the front. It seemed to extend for a very, very long distance.<br/><br/>“What’s going on? Could it be that the change in the entire region was triggered by the change of the god of light and dark elements? This?”<br/><br/>Wang Xian was astonished!<br/><br/>Following that, under his astonished gaze, he actually saw some chaos gems that contained powerful energy floating slowly in the middle of the empty road area.<br/><br/>Buzz<br/><br/>Wang Xian’s body moved and he immediately flew over.<br/><br/>It was a very strange change!<br/><br/>The quicksand that was filled with danger split into a hollow space.<br/><br/>Wang Xian flew over and arrived in front of the chaos gem.<br/><br/>Half of this chaos gem was of the water attribute.<br/><br/>It was a full thousand meters in size. The portion of the water attribute contained an enormous amount of energy.<br/><br/>It was much more than the amount of energy that Wang Xian obtained from the god of elements.<br/><br/>“This is equivalent to picking up a precious treasure for free.”<br/><br/>Wang Xian opened his mouth and said!<br/><br/>There was no risk at all. It was a complete waste of money!<br/><br/>“What is this situation? Is It related to me?”<br/><br/>Wang Xian muttered as he looked at the area that was completely safe.<br/><br/>He hesitated for a moment and looked forward!<br/><br/>Then, he moved his body and flew into the area.<br/><br/>He wanted to see what changes had happened in this area.<br/><br/>When Wang Xian flew for an hour, the safe road still hadn’t reached its end.<br/><br/>However, Wang Xian saw two familiar figures in front of him.<br/><br/>One was sword-shaped, and the other was a human elder.<br/><br/>“Song Ta and that Sword Elder!”<br/><br/>Wang Xian muttered. After hesitating for a moment, he flew over quickly.<br/><br/>“The two of you, we meet again!”<br/><br/>Wang Xian flew over and took the initiative to greet them!<br/><br/>“Oh? Brother Wang Xian, Hehe, what a coincidence!”<br/><br/>Song ta turned around and looked at Wang Xian with a smile on his face.<br/><br/>“What happened in the riot zone? How did such a huge change happen?”<br/><br/>Wang Xian asked the two of them.<br/><br/>Song Ta and old man Jian had obviously stayed here for a long time and understood this place very well.<br/><br/>Therefore, even though Wang Xian had a vague feeling that this place had something to do with him, he still wanted to ask.<br/><br/>“This has something to do with the place where we met. The balance between the two elemental gods has been greatly disturbed. If the balance is broken in one place, it will affect other areas. I have seen this many times!”<br/><br/>“Some of the changes are not very big, but some will be very big. It is possible that some of the treasures that were not successfully obtained will be buried by the energy tide due to this change. It is also possible that some of the treasures that are buried in other places will be washed out.”<br/><br/>Song Ta introduced the treasures to Wang Xian with a smile!<br/><br/>“Oh? I See!”<br/><br/>Wang Xian nodded his head slightly and asked again, “Where are the two of you planning to go?”<br/><br/>“Hehe, let’s go to the core area where there are more Great Dao level elemental gods. Let’s see if there are any changes there. If there are treasures that were washed out, it would be a huge profit if we can pick them up!”<br/><br/>Song ta replied with a smile. He didn’t hide anything!<br/><br/>“If you are interested, let’s go and take a look together!”<br/><br/>Song Ta continued to speak to Wang Xian!<br/><br/>“Alright, I am indeed curious about this place.”<br/><br/>Wang Xian nodded and flew to the side of them.<br/><br/>“The change this time is really interesting. A special path has appeared. I wonder if it can lead to the core area!”<br/><br/>Old Man Jian looked at Wang Xian and spoke after that!<br/><br/>“The possibility of reaching the core is almost zero.”<br/><br/>Song ta shook his head.<br/><br/>“What’s in the core?”<br/><br/>Wang Xian followed them and asked curiously as they flew forward!<br/><br/>“According to the rumors, if one can enter the core and obtain the treasures inside, one can obtain invincible power. There are also rumors that the formation of this region is due to a treasure in the core!”<br/><br/>Song ta replied with a smile, “However, this can’t be trusted. How can an invincible power be so easy to control? Not to mention, there are ten Great Dao level elemental gods mixed together in the center.”<br/><br/>“Ten Great Dao level elemental gods in one region?”<br/><br/>Wang Xian was astonished.<br/><br/>Ten Great Dao level. What kind of change was this?<br/><br/>Even if it was a primal chaos level existence, they wouldn’t be able to hold on for long after entering this region.\t\t\t\t\t\t</div>", "images": {}, "success": true}