{"id": 1299, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074922.html", "title": "Chapter 4302 - Chapter 4302: Under The Core Area Of The 4301 Cross Immortal Soul", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4302 - Chapter 4302: Under The Core Area Of The 4301 Cross Immortal Soul</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4302: Under the core area of the 4301 Cross Immortal Soul<br/><br/>Translator: 549690339<br/><br/>The area where the ten Great Dao level elemental gods were mixed together.<br/><br/>It contained invincible power.<br/><br/>When Wang Xian heard song Ta and the Rest’s words, he thought of the information he obtained from the treasure map.<br/><br/>Invincible Power?<br/><br/>“Invincible Power. Hehe, it’s just a rumor. Such a rumor might be spread by some bored and evil-minded powerhouse.”<br/><br/>Wang Xian thought to himself.<br/><br/>There was no such thing as invincible power.<br/><br/>If he knew about the invincible power, why didn’t the rumored powerhouse possess it?<br/><br/>If he didn’t possess it, why would he say that he was invincible?<br/><br/>However, the Ten Great Dao level elemental gods were indeed equivalent to invincible power.<br/><br/>However, if there were more than a hundred heaven origin creator powerhouses who entered the area, they would be able to suppress this invincible power!<br/><br/>Of course, the prerequisite was that the hundred strong cultivators in the Heaven’s origin realm would be able to enter the region.<br/><br/>One must know that the deeper they went, the more terrifying the quicksand’s energy became.<br/><br/>At the end of the journey, those who didn’t have the ability to control the quicksand wouldn’t be able to walk in the region!<br/><br/>Wang Xian followed old man song Ta Jian and flew forward.<br/><br/>After flying for two days, they arrived at the end of the road.<br/><br/>“This is considered an extremely deep region. After flying for three days, we should be able to reach the core region!”<br/><br/>Wang Xian and the rest were moving at a very fast speed.<br/><br/>Song Ta looked at the end of the road, he continued, “If this road doesn’t disappear, this is a treasured land used to nurture disciples. We can set up a formation and absorb the energy from both sides. TSK TSK, it will be quite crazy.”<br/><br/>Song ta looked around and sighed.<br/><br/>When Wang Xian heard his words, he thought of the precious place of cultivation that Saint Shan Tian and the rest had set up for their disciples.<br/><br/>That precious place was a holy place of cultivation for powerhouses in the ruler realm.<br/><br/>It was not a holy place that was born in the universe or could be compared to a holy place that was born according to the ordinary elemental gods.<br/><br/>And the heavenly saints, they are very far away in the periphery of the layout of the precious land of practice.<br/><br/>Now here is a road, if this road does not disappear, it must cause a lot of disputes.<br/><br/>Because it would be unthinkable to lay down a training ground here and absorb the energy of the surroundings to cultivate disciples.<br/><br/>Under this kind of energy washing, there are all kinds of energy fluctuation evolution around.<br/><br/>If a first level ruler realm expert cultivated here for 100 million years, it was equivalent to cultivating in his own universe for tens of billions of years!<br/><br/>That was how terrifying it was!<br/><br/>After all, the violent energy in the surroundings could threaten control-level existences.<br/><br/>Even if it was a beginner-level heaven creation realm expert cultivating here, there would be huge benefits!<br/><br/>Of course, there might also be risks.<br/><br/>In addition, setting up a cultivation treasure ground required a huge amount of treasures and resources like the Elemental God.<br/><br/>The amount of resources would definitely be able to absorb the amount of energy.<br/><br/>“If this path doesn’t disappear, I can indeed come here to cultivate.”<br/><br/>Wang Xian nodded his head.<br/><br/>Currently, the Dragon Palace had 50 to 60 disciples at the peak of the ruler realm as well as millions of disciples at the ruler realm. If they were to cultivate here, it would be able to increase the combat strength of the Dragon Palace in a short period of time.<br/><br/>The number of disciples at the peak of the ruler realm who could break through the threshold of the Dragon Palace would increase by at least several times!<br/><br/>“Everything is unstable at the moment. It’s hard to say. The balance hasn’t been completely formed yet.”<br/><br/>Old Man Jian glanced around and said faintly.<br/><br/>“Let’s go to the center and see if there are any changes in there. Let’s see if any treasures have been attacked!”<br/><br/>Song Ta looked at the quicksand area in front of him and flew straight in. “It would be great if that ultimate treasure of the Heaven’s origin was attacked to the outside!”<br/><br/>“Huh? Ultimate Treasure of the Heaven’s origin?”<br/><br/>Wang Xian was slightly shocked when he heard that.<br/><br/>“Yes, there is a ultimate treasure of the Heaven’s origin in the core area of the cross-shaped primordial spirit. It is located within the range of the spatial elemental god. It has been over ten billion years and no powerhouse has been able to obtain it.”<br/><br/>Song ta nodded.<br/><br/>Then, he introduced the heavenly creation true treasure to him.<br/><br/>It was a space elemental heavenly creation true treasure. As for whether it was an attack or a support, it was unknown.<br/><br/>One could only see that it was a gourd.<br/><br/>A great being used a true treasure to forcefully enter the Space Elemental God’s place, but he instantly lost his way.<br/><br/>There were countless spaces there. He had no idea where the ultimate treasure of space elements was located.<br/><br/>Unless he could completely destroy the God of space elements, it would be difficult to get his hands on it.<br/><br/>Wang Xian was slightly surprised when he heard song Ta’s words.<br/><br/>This chaotic area was really a treasure land filled with opportunities and dangers.<br/><br/>The three of them flew deeper into the place. The energy became more and more violent the deeper they went.<br/><br/>When Wang Xian and the rest arrived in front of a multi-colored light, the violent quicksand energy here could already kill an ordinary control-level powerhouse.<br/><br/>It was truly terrifying to the extreme!<br/><br/>“Is the core area of the cross-shaped primordial spirit ahead?”<br/><br/>Wang Xian looked ahead and mumbled.<br/><br/>The scene in front of him was extremely magnificent and gorgeous!<br/><br/>The terrifying energy of ten attributes was like a terrifying planet that was about to erupt at any moment.<br/><br/>A heart-palpitating feeling surged into his heart.<br/><br/>Even Wang Xian felt that he was a little tiny in his heart.<br/><br/>“These elemental gods are not the ordinary elemental gods of the Great Dao level.”<br/><br/>Wang Xian was feeling proud.<br/><br/>Just like the current Wang Xian. Although he was also an expert of the Great Dao level, he was able to deal with two ordinary elemental gods of the Great Dao level.<br/><br/>It was the same for the ten elemental gods.<br/><br/>“Let’s act on our own for the time being. If there’s a need to join forces, we can contact them!”<br/><br/>Old Man Jian looked at Wang Xian and said.<br/><br/>“Alright!”<br/><br/>Wang Xian nodded his head.<br/><br/>He wasn’t too familiar with the two of them. If they acted together, there would be conflicts due to some treasures.<br/><br/>Of course, if there were treasures that a few of them couldn’t obtain by themselves, they could also join forces.<br/><br/>Wang Xian already had the means to contact the two of them!<br/><br/>The three of them separated and Wang Xian continued to move forward.<br/><br/>Very soon, he arrived at the edge of the core of the cross-shaped primordial spirit.<br/><br/>Wang Xian stood in front and looked inside with a surprised expression on his face.<br/><br/>There were ten types of energy mixed in the area in front of him.<br/><br/>The ten types of energy were almost interwoven together.<br/><br/>The interwoven energy gave people a feeling of dead silence. It was as if the apocalypse had not arrived yet. It was a chaotic feeling.<br/><br/>Besides that, standing at the edge, other than causing Wang Xian to feel palpitations in his heart.<br/><br/>He could not sense how powerful the energy inside was.<br/><br/>When the ten types of energy were interwoven together, he could not sense how terrifying the destructive power was.<br/><br/>Wang Xian stretched out his arm and extended it directly into his body.<br/><br/>Instantly, streams of energy surged crazily into his body like poisonous snakes.<br/><br/>This caused Wang Xian’s expression to change slightly. He quickly pulled it out!<br/><br/>At this moment, there were many terrifying patterns on his arm.<br/><br/>These patterns seemed to be the result of being poisoned. They looked extremely terrifying!\t\t\t\t\t\t</div>", "images": {}, "success": true}