{"id": 1292, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074894.html", "title": "Chapter 4295 - Chapter 4295: 4294 Treasure Hunt! Go", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4295 - Chapter 4295: 4294 Treasure Hunt! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4295: 4294 treasure hunt! Go<br/><br/>Translator: 549690339<br/><br/>“There are still too few treasures that can be used by Great Dao level powerhouses!”<br/><br/>Wang Xian looked around and kept dodging the attacks of the chaos stones as he spoke!<br/><br/>The higher he went, the more difficult it became.<br/><br/>Looking into the depths, Wang Xian continued to fly.<br/><br/>There was no danger for him here.<br/><br/>The deeper he went, the greater the chances of obtaining treasures!<br/><br/>He kept flying forward. Soon, Wang Xian arrived at a deeper area.<br/><br/>Chaotic Quicksand!<br/><br/>This quicksand was densely packed. It was almost impossible to avoid it. He could only withstand it head-on.<br/><br/>Among the quicksand, there were all kinds of chaos stones.<br/><br/>What was very peculiar was that they seemed to revolve around a certain center.<br/><br/>At the periphery, some chaos stones were being sucked into it.<br/><br/>“There are some small-scale fragments of the Elemental God!”<br/><br/>When Wang Xian approached the periphery, he noticed some fragments of the elemental god as well as some pure attribute chaos stones!<br/><br/>“As expected, the closer I get to the center, the more treasures there are. However, I’m afraid it’s a little dangerous inside!”<br/><br/>Wang Xian stared at the spot in front of him.<br/><br/>The spot he was at now was the very core!<br/><br/>The chaotic sand flow, the terrifying chaotic stone in the sand flow.<br/><br/>All kinds of violent energy!<br/><br/>Some of the sand flow even contained strange energy, making one’s heart palpitate!<br/><br/>Wang Xian’s entire body was wrapped in energy as he tried to enter the sand flow!<br/><br/>When he entered the sand flow, he felt a continuous stream of terrifying energy attacking him.<br/><br/>This kind of attack was continuous.<br/><br/>Although the impact of the sand flow was only equivalent to a control level existence.<br/><br/>However, this kind of impact was long-lasting and continuous!<br/><br/>“I can only stay here for more than 20 hours at most, and this is without encountering the impact of large-scale chaos stones!”<br/><br/>At this moment, Wang Xian had a solemn expression on his face.<br/><br/>The impact of the energy here was too terrifying.<br/><br/>Wang Xian could only last for more than 20 hours here.<br/><br/>According to Wang Xian’s speculation, Saint Shan Tian could only last for more than 10 hours here!<br/><br/>“His star field might have been destroyed here!”<br/><br/>Wang Xian guessed in his heart.<br/><br/>A power at the level of Great Dao could destroy the ultimate treasure of the Heaven’s origin!<br/><br/>The destructive power here could also be destroyed over a long period of time!<br/><br/>Wang Xian’s entire body was wrapped in energy as he charged towards a fragment of the god of elements.<br/><br/>The powerful impact of the energy made his speed extremely slow!<br/><br/>Meanwhile, that fragment of the god of elements was still moving forward at a rapid speed!<br/><br/>However, this place was located at the periphery. Fortunately, Wang Xian managed to catch up with that fragment of the god of elements.<br/><br/>Holding it in his hand, Wang Xian looked at the other fragments of the god of elements and the special chaos stones. They had already disappeared!<br/><br/>They were mixed in the quicksand. They would appear in one second and disappear in the next!<br/><br/>It was very difficult to find them!<br/><br/>“This won’t do. This area is very big. I Can’t stay here forever!”<br/><br/>Wang Xian frowned slightly.<br/><br/>This place was more dangerous than he had imagined.<br/><br/>Wang Xian was already very strong, but he wouldn’t be able to hold out here for long.<br/><br/>He wouldn’t be able to enter this place if he was at the weak control level!<br/><br/>With a movement, Wang Xian hurriedly flew out of this immeasurable area.<br/><br/>Looking at this area, he frowned slightly.<br/><br/>As expected, it was not easy to obtain all the treasures!<br/><br/>I have to make use of my advantage. I Can’t just blindly search here<br/><br/>Wang Xian thought to himself.<br/><br/>He had an advantage that other experts did not have. That was because he could enter the area of the Elemental God!<br/><br/>Especially when he entered the area of two or three elemental gods who were constantly colliding.<br/><br/>The stronger the area where the elemental gods were clashing against each other, the easier it was for Wang Xian to obtain powerful treasures!<br/><br/>This was his greatest advantage when compared to other Great Dao level experts!<br/><br/>With this thought in mind, Wang Xian began to fly around this area.<br/><br/>There were also elemental gods among the chaotic currents.<br/><br/>Furthermore, they were elemental gods of Great Dao level. As long as he could touch them, he would be able to enter the area.<br/><br/>Perhaps he would be able to obtain some benefits!<br/><br/>Wang Xian began to fly around this area.<br/><br/>“Roar!”<br/><br/>When he was flying around this area for more than ten days, a roar suddenly came from within!<br/><br/>This made Wang Xian’s eyes freeze slightly!<br/><br/>“There are giant beasts of chaos in the quicksand region. The giant beasts of chaos that are able to survive here are definitely extremely powerful Great Dao existences!”<br/><br/>Wang Xian had a solemn expression on his face.<br/><br/>If they were able to survive in the quicksand region, the gigantic beasts of primordial chaos in there would probably be no weaker than Wang Xian!<br/><br/>After all, Wang Xian could not stay in this region for a long time!<br/><br/>“I need to be careful of such gigantic beasts of Primordial Chaos!”<br/><br/>Wang Xian was on high alert as he continued to fly around this region!<br/><br/>However, when Wang Xian had been circling this area for a year, he realized that the area of this quicksand region was extremely terrifying!<br/><br/>“It’s much bigger than I imagined.”<br/><br/>He continued to fly around this area.<br/><br/>However, his eyes suddenly lit up as he looked ahead.<br/><br/>Wang Xian saw some light in the interior of the quicksand ahead.<br/><br/>The white and black rays of light were colliding and distorting!<br/><br/>“The god of light and the God of Darkness!”<br/><br/>Wang Xian was certain in his heart as his eyes lit up.<br/><br/>This was what he was looking for!<br/><br/>An elemental god that could stand in the quicksand of chaos and emit such a large amount of light must be at the Great Dao level.<br/><br/>In other words, these were two great dao levels.<br/><br/>As long as he could enter the quicksand, he would have a chance to obtain something!<br/><br/>And for an elemental god of such a high level to obtain a treasure, the value would definitely be extremely high!<br/><br/>With this thought in mind, Wang Xian directly entered the quicksand!<br/><br/>The violent energy surged into his body, and Wang Xian immediately unleashed his strongest defense.<br/><br/>This was to prevent the quicksand from containing special energy.<br/><br/>This was the information that Wang Xian had obtained from his observation of the quicksand over the past year.<br/><br/>The quicksand was far more dangerous than he had imagined.<br/><br/>There was a peculiar and terrifying energy in the quicksand.<br/><br/>He had to guard against this energy!<br/><br/>Wang Xian entered the quicksand and flew rapidly towards the bright and dark spots.<br/><br/>After passing through the quicksand, Wang Xian arrived in front of the two elemental gods!<br/><br/>The power of light and darkness filled the area in front of him. Wang Xian realized that the power of light and darkness had opened up a separate space in the torrent.<br/><br/>There was no quicksand in this space.<br/><br/>This was good news for Wang Xian!<br/><br/>However, although there was no quicksand, Wang Xian could sense that there were some terrifying light and dark substances in it.<br/><br/>These substances were not simple!\t\t\t\t\t\t</div>", "images": {}, "success": true}