{"id": 1297, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074914.html", "title": "Chapter 4300 - Chapter 4300: 4299, Success", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4300 - Chapter 4300: 4299, Success</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4300: 4299, success<br/><br/>Translator: 549690339<br/><br/>“Failure!”<br/><br/>“Failure!”<br/><br/>“Failure!”<br/><br/>Wang Xian looked at the results in the lamp of divination. His eyes sparkled.<br/><br/>He had been quietly waiting and checking.<br/><br/>As long as he had an idea in his mind, there would be an ending. He did not have to try it step by step.<br/><br/>The energy in the lamp of divination was exhausted. Wang Xian used another year to replenish it!<br/><br/>Time passed quickly once again.<br/><br/>However, this time, in just five years, a successful result appeared under the lamp of divination.<br/><br/>When Wang Xian saw this scene, an excited expression appeared on his face.<br/><br/>He didn’t dare to hesitate. With a wave of his arm, he threw the bait out.<br/><br/>Following that, in Wang Xian’s vision, a dark tide surged towards the bait, surging towards the position of the Sword of light.<br/><br/>With this force, the bait surged to the back of the Sword of light!<br/><br/>At this moment, Wang Xian focused his attention and directed the bait towards the sword of light!<br/><br/>Buzz<br/><br/>In the next instant, the bait carried the fishing line and circled the Sword of light twice!<br/><br/>“I’ve succeeded!”<br/><br/>Wang Xian was pleasantly surprised.<br/><br/>The result was exactly the same as the result in the lamp of divination.<br/><br/>However, although he had succeeded now, he still needed to pull the sword of light over.<br/><br/>The Sword of light contained a terrifying power. If Wang Xian pulled the fishing line directly, the sword of light might be able to cut the fishing line.<br/><br/>Therefore, to be on the safe side, it was best for Wang Xian to transfer the energy to the fishing line so that the sturdiness of the fishing line would be enhanced.<br/><br/>If it was not enough, the balance might be broken the moment he made his move.<br/><br/>The energy in Wang Xian’s body would also overflow and he would be attacked by the surrounding energy!<br/><br/>“Although these two elemental gods are very terrifying, my strength is not weak either. Even if I were to be attacked by two elemental gods at the same time, I would be able to withstand them for some time!”<br/><br/>Wang Xian mumbled to himself. For the sake of safety, he was prepared to make a move and use force!<br/><br/>Buzz<br/><br/>A surge of energy surged along the fishing line at a rapid speed. The entire fishing line emitted a ray of Luster!<br/><br/>In the next moment, he pulled forcefully with his arm.<br/><br/>The fishing line wrapped around the sword of light and flew towards him at a rapid speed!<br/><br/>When Wang Xian saw that the sharp sword did not put up too much of a resistance, his eyes were filled with joy!<br/><br/>“Boom! Boom!”<br/><br/>“Boom! Boom!”<br/><br/>However, at this moment, Wang Xian’s actions had affected the impact of the surrounding energy.<br/><br/>The source of the energy was Wang Xian. The surrounding forces of darkness and light were also surging towards him.<br/><br/>After all, Wang Xian was a living being. Under such circumstances, he had to resist!<br/><br/>Once he resisted with all his might, the balance in his body would be broken!<br/><br/>Boom<br/><br/>However, at this moment, Wang Xian’s body trembled. He quickly flew to the side of the Sword of light and kept it away!<br/><br/>Boom! Boom! Boom<br/><br/>The moment Wang Xian moved, the surrounding light and dark energy seemed to have completely boiled up and attacked Wang Xian directly!<br/><br/>The terrifying tides were filled with the penetration of light and the Corrosion of darkness.<br/><br/>The terrifying characteristics of the two elemental energies were completely unleashed.<br/><br/>The slightly calm battlefield was like a huge tsunami as it charged towards Wang Xian!<br/><br/>Boom<br/><br/>At this moment, Wang Xian could no longer maintain the balance between light and darkness!<br/><br/>This was because the energy had already charged towards him. He could only defend himself and escape quickly!<br/><br/>His body trembled and he flew out like a sharp sword!<br/><br/>The surrounding energy was pressing towards him.<br/><br/>The energy in Wang Xian’s entire body was boiling as it broke through all the energy!<br/><br/>Boom! Boom<br/><br/>Boom! Boom<br/><br/>At this moment, the god of light and the God of darkness seemed to have locked onto Wang Xian. Streams of vast energy were chasing after him!<br/><br/>Boom! Boom<br/><br/>Wang Xian did not turn back and continued to attack.<br/><br/>Originally, he would need two days to fly out of this area.<br/><br/>However, at this moment, he only needed one to two minutes to unleash his full strength.<br/><br/>However, he had to withstand the full-strength attack of these two elemental gods for one to two minutes!<br/><br/>The five elements millstone appeared around him and wrapped him up.<br/><br/>The Tai Chi Dragon Disc continued to wrap him up!<br/><br/>The powers of the Void Dragon Body and the Void Dragon Pool surged into Wang Xian’s body and tore apart the obstacles in front of him!<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>The roars of the two elemental gods seemed to be coming from the back.<br/><br/>The sudden appearance of such a powerful existence at Wang Xian’s level in their territory made the two elemental gods extremely violent.<br/><br/>The two elemental gods even began to move their bodies and get closer to Wang Xian.<br/><br/>However, they did not give chase with all their might unconsciously!<br/><br/>However, at this moment, due to Wang Xian’s attack, the balance of the entire area was broken.<br/><br/>The power of light and darkness in the entire area was boiling.<br/><br/>It was as though a calm lake was stirring up huge waves!<br/><br/>“What’s going on?”<br/><br/>At another location, Song Ta and Old Man Sword were fishing with their eyes closed!<br/><br/>The sudden violent energy caused their expressions to change slightly.<br/><br/>They hurriedly pulled out the fishing line to prevent the violent energy from cutting off the fishing line and losing the bait!<br/><br/>“The two elemental gods have experienced violent fluctuations. An extremely powerful existence has entered and destroyed the balance within. This area is about to be changed!”<br/><br/>Old Man sword frowned as he watched the scene in front of him!<br/><br/>“The riot area has been in a state of balance for a very long time. Now that the balance has been broken, it will affect the entire body. I reckon that the entire riot area will undergo some changes.”<br/><br/>“This may be a good thing, or it may be a very bad thing. I have to make preparations. Before the other balance is reached, it won’t be safe for the time being.”<br/><br/>Song Ta’s eyes flickered as he said, “I don’t know if it’s a good thing or a bad thing.”<br/><br/>“It’s time for us to move. Every time the equilibrium is broken, there will be opportunities.”<br/><br/>The sword old man swept his gaze around and said!<br/><br/>Song Ta also nodded.<br/><br/>Under normal circumstances, very few people would break the equilibrium of the riot zone.<br/><br/>Especially when the riot zone had not been completely explored.<br/><br/>Or when he knew that there was a treasure somewhere that he had yet to obtain.<br/><br/>Once the balance was broken, everything might be broken.<br/><br/>However, this was something that Wang Xian, who had just arrived here, did not know about!<br/><br/>At this moment, Wang Xian had already rushed out of the area of the two elemental gods and flew to the quicksand region.<br/><br/>At this moment, Wang Xian also noticed the movement behind him. It seemed to be much bigger than he had imagined.<br/><br/>The balance between the two elemental gods was broken, and the range of their battlefield had also changed.<br/><br/>They were even moving as they fought, looking for the next balance.<br/><br/>The two elemental gods had changed, and the quicksand around them had also changed drastically.\t\t\t\t\t\t</div>", "images": {}, "success": true}