{"id": 1295, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074906.html", "title": "Chapter 4298 - Chapter 4298: Under The 4297 Special Angler", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4298 - Chapter 4298: Under The 4297 Special Angler</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4298: Under the 4297 Special Angler<br/><br/>Translator: 549690339<br/><br/>A special thin rope and a special fragment of the god of elements. This caught Wang Xian’s attention and curiosity!<br/><br/>This situation was a little special.<br/><br/>The divination lamp appeared in front of him once again. Wang Xian’s mind stirred and he began to perform divination.<br/><br/>Buzz<br/><br/>The divination lamp lit up and an image appeared under the light!<br/><br/>Looking at this image, Wang Xian was slightly stunned and revealed a stunned expression.<br/><br/>In the image, there was a figure standing at the side of the battlefield of the two elemental gods. He was holding a long fishing rod in his hand.<br/><br/>The fishing rod was tied with a fishing line. The location of the hook and the bait was the fragment of the Elemental God!<br/><br/>“What is this? Fishing? It can actually fish in the battlefield of the Elemental God?”<br/><br/>Wang Xian’s face was filled with astonishment!<br/><br/>The energy here was so intense that darkness and light were striking everything.<br/><br/>How did he manage to fish here?<br/><br/>Furthermore, to be able to stand outside and fish, even if his strength was not at the level of the Great Dao, he was probably close to this level!<br/><br/>Wang Xian put away his divination lamp and pondered for a moment before flying in the direction of the fisherman.<br/><br/>He didn’t make any rash moves.<br/><br/>This was just in case.<br/><br/>Divination could be used to divine this angler. However, was there any other angler beside this angler?<br/><br/>Wang Xian needed to know more about this!<br/><br/>According to the information on the divination lamp, Wang Xian flew towards the back of the God of darkness.<br/><br/>When he flew over, he could vaguely sense the aura of a figure outside.<br/><br/>“The darkness attribute is very strong. It should be at the level of the Great Dao. Furthermore, there seems to be more than one aura!”<br/><br/>Wang Xian sensed something and hesitated for a moment. Then, he flew out from the battlefield of the two elemental gods from the side.<br/><br/>After flying out of the domain of the Elemental God and supporting an area in the surrounding quicksand, Wang Xian flew in the direction of the angler.<br/><br/>He was a little curious.<br/><br/>These anglers were obviously using a special method to search for the treasures in the Elemental God.<br/><br/>How did they do it?<br/><br/>If he had this method, Wang Xian would have a high chance of obtaining the sword with the light attribute!<br/><br/>This was very important to him.<br/><br/>Although it was said that if he were to recklessly make contact with other powerhouses in such an area, it would arouse their vigilance.<br/><br/>However, as long as one maintained a distance, there wouldn’t be any problems!<br/><br/>After all, when two experts met, they wouldn’t choose to make a move when both parties couldn’t do anything to each other.<br/><br/>On the contrary, it was more of a trade!<br/><br/>Wang Xian wanted to make a trade with them to see if he could learn about their fishing methods and fishing treasures.<br/><br/>“Huh?”<br/><br/>Wang Xian flew over. Soon, two figures in front of him noticed his appearance.<br/><br/>Two pairs of eyes were focused on him, sizing him up.<br/><br/>An old man even took out a treasure that looked like a pagoda. Information was flashing on it.<br/><br/>Wang Xian did not hide his strength too much. He was emitting the might of the Great Dao.<br/><br/>After all, it was impossible for a weakling to be able to carry out activities in this area.<br/><br/>While they were looking at Wang Xian, Wang Xian was also sizing them up.<br/><br/>Both of them were of the darkness attribute.<br/><br/>One of them was in the form of a human.<br/><br/>However, the other form of an expert surprised Wang Xian.<br/><br/>He had the appearance of a sharp sword.<br/><br/>Although he had a body of flesh and blood, his appearance was the same as a sharp sword.<br/><br/>On the hilt of the sword was the head.<br/><br/>It was a very special creature.<br/><br/>The strength of both of them should be at the Great Dao level.<br/><br/>“Nice to meet you both. I didn’t mean to offend you.”<br/><br/>Wang Xian cupped his hands at them and said indifferently!<br/><br/>“HMM, if there’s nothing else, don’t disturb our fishing!”<br/><br/>The sword-shaped powerhouse looked at Wang Xian and said calmly!<br/><br/>“I’ve just arrived at this chaotic area not too long ago. I’m a little curious about your fishing. Can you tell me about it? Also, I’ve obtained some items of darkness attribute here. I can also make a trade with you two!”<br/><br/>Wang Xian said this to convey his goodwill.<br/><br/>“Oh?”<br/><br/>Not far away, the old man holding the pagoda raised his eyebrows slightly, he looked at Wang Xian and said, “You’re not an expert from the Alliance of Justice and the evil sequence faction, are you? Our fishing line is made from the material inside the Elemental God. Then, we use the fragments of the elemental god as spiritual bait to search for treasures inside.”<br/><br/>“This method is not a secret.”<br/><br/>The old man who was holding the pagoda replied. Wang Xian nodded his head slightly.<br/><br/>“It’s true that I don’t come from the two factions. I wonder if you can approach the Elemental God with this method. If you do, will you be attacked?”<br/><br/>“No. Both the fishing line and the bait come from the main body of the Elemental God. Naturally, you won’t be attacked. However, there’s another point. When faced with the energy impact inside, the bait will lose control. After all, the closer you are to the Elemental God, the greater the impact. Even if you won’t be attacked by the Elemental God, there will still be an impact.”<br/><br/>The old man who was holding the pagoda answered without hiding anything.<br/><br/>“Thank you very much. I have two large pieces of the god of darkness elemental fragment in my hands. I wonder if you are interested in trading. I would like to exchange the fishing line and the way to make the bait. As for the other items, I can trade them for some ordinary resources!”<br/><br/>Wang Xian spoke. With a move of his palm, he took out two pieces of the god of darkness elemental fragment.<br/><br/>“Oh? The two pieces of the god of elements in your hands are indeed powerful. They are rare and have the same aura as the god of darkness in front of you. Did you obtain them from here?”<br/><br/>The old man who was holding the pagoda looked at the two pieces of the god of elements with a surprised expression and asked.<br/><br/>“Yes!”<br/><br/>Wang Xian nodded.<br/><br/>“You entered with your body? TSK TSK, I can sense that your aura is relatively young. Do all young people work so hard? Hehe, old man Jian, you have a set of fishing line in your hand. You can trade with him!”<br/><br/>The old man smiled as he spoke. He glanced at the sword-shaped powerhouse beside him, then, he said to Wang Xian, “The bait can use the god of elements fragment in your hand to guide your spirit into it using a special method to control it. This method of spiritual guidance is rather simple. I’ll give it to you for free!”<br/><br/>As the old man spoke, he spat out a symbol.<br/><br/>The symbol came in front of Wang Xian and formed words and information.<br/><br/>Wang Xian sensed this symbol. When there was no danger, he immediately absorbed the information.<br/><br/>“Let’s exchange for equal value. I’ll take out some resources for you.”<br/><br/>The sword-shaped old man waved his arm and a fishing line made of a special material floated in front of him.<br/><br/>Then, there were some resources, all of which were divine fruits and herbs at the peak of the ruler realm.<br/><br/>There were hundreds of them!\t\t\t\t\t\t</div>", "images": {}, "success": true}