{"id": 1290, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074886.html", "title": "Chapter 4293 - Chapter 4293: 4292 Entered The Core Region", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4293 - Chapter 4293: 4292 Entered The Core Region</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4293: 4292 entered the core region<br/><br/>Translator: 549690339<br/><br/>The energy of the chaos stones was solidified and could not be absorbed.<br/><br/>There were other impure energies mixed within. Even though Wang Xian had ten attributes, he could not absorb them.<br/><br/>Wang Xian sensed for a moment and flew forward!<br/><br/>Boom! Boom! Boom<br/><br/>As he flew deeper into the core region, the speed at which the chaos stones revolved became faster.<br/><br/>There were no rules to speak of.<br/><br/>Furthermore, some of the chaos stones collided with each other, resulting in a loud explosion. After the collision, they shot out at an even more terrifying speed.<br/><br/>He needed to keep an eye on the chaos stones that were shot out.<br/><br/>Otherwise, once he was hit, he would suffer some damage.<br/><br/>The hardness of these chaos stones was something that even Wang Xian could not break!<br/><br/>It was extremely sturdy!<br/><br/>As he continued to fly inside, Wang Xian sized up his surroundings.<br/><br/>Treasures were not as common as he had imagined. Furthermore, the reason why treasures were being born in this chaotic region was because of the collision between the chaos stones.<br/><br/>It was because of the collision between the chaos stones. After the chaos stones broke apart, the fragments of the Elemental God were formed.<br/><br/>It was possible that a fragment of the Elemental God was born not long after you left this place.<br/><br/>Everything depended on fate and luck!<br/><br/>Of course, to obtain the Elemental God fragment, it didn’t mean that it was easy to obtain it!<br/><br/>It was possible to search for it for hundreds of millions of years without finding a single piece.<br/><br/>However, there was one point. The closer one was to the center, the greater the probability of obtaining the Elemental God fragment!<br/><br/>The closer one was to the center, the more dangerous it was.<br/><br/>The speed of some chaos stones was terrifying. Under the situation where one was caught off guard, even a powerhouse in the Heaven’s origin blessed realm wouldn’t be able to avoid it!<br/><br/>Wang Xian was still relatively strong. Therefore, he flew straight towards the core.<br/><br/>“Bang! Bang! Bang!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>The deeper he flew, the louder the sounds of collision and the more there were.<br/><br/>The deafening sound was accompanied by the splashing of some energy!<br/><br/>Flames, lightning, cold rays, and so on!<br/><br/>It was to the extent that Wang Xian had to set up a defense around himself at the back to ward off the splashing energy waves.<br/><br/>After flying for a month, Wang Xian did not gain anything. He did not even see a single treasure.<br/><br/>He was not anxious either. This was a normal phenomenon.<br/><br/>Even though he was deep in the area, some control-level powerhouses did not dare to step in.<br/><br/>“If I want to obtain treasures here, it’s either luck or absolute strength. It’s just absolute strength to obtain treasures. I still need to go deeper!”<br/><br/>This area was very large. Wang Xian looked ahead.<br/><br/>There were some special situations in front of him.<br/><br/>In front of him, there were some elemental gods.<br/><br/>Powerful elemental gods.<br/><br/>They were moving around unconsciously.<br/><br/>Wang Xian also saw that the two elemental gods were engaged in an intense fight. There were even chaos stones colliding in the surroundings.<br/><br/>In that area, it was as if everything was going to be destroyed.<br/><br/>However, in that area, Wang Xian could clearly see the fragments of the Elemental God were located there.<br/><br/>There were also special chaos stones.<br/><br/>“Eh, there are fragments of the Elemental God at that location. The power of the two elemental gods are at the control level. However, one of the elemental gods is a little special.”<br/><br/>Wang Xian looked over and frowned slightly.<br/><br/>One of the elemental gods was not just a simple attribute.<br/><br/>The Sea of fire enveloped it and it also possessed the power of lightning.<br/><br/>Streaks of lightning flashed continuously in the Sea of fire.<br/><br/>This caused Wang Xian to raise his eyebrows slightly.<br/><br/>A dual-attribute elemental god?<br/><br/>Wang Xian had yet to meet a heaven origin creator with two attributes in the chaos.<br/><br/>Of course, the special bloodline of the Unicorn Bull did not count.<br/><br/>Wang Xian had yet to meet anyone who possessed the compatibility of the two attributes and had reached the heaven origin realm.<br/><br/>However, the magic of the chaos gave birth to the Elemental God who possessed two attributes.<br/><br/>The Elemental God had a unique characteristic.<br/><br/>If the elemental god was of the fire attribute, then you were of the fire attribute as well. You would not be attacked if you entered.<br/><br/>There were huge benefits to cultivating in there.<br/><br/>But if the disciples of other attributes entered the fire elemental god, they would suffer endless attacks.<br/><br/>Either you would be expelled, or you would be suppressed by the Elemental God!<br/><br/>The two elemental gods fought against each other. If the other attributes entered, they would be attacked by the two elemental gods at the same time.<br/><br/>Although these two elemental gods were only at the control level, they still contained some berserk chaos gems.<br/><br/>Under the guidance of energy, these chaos gems flew and revolved rapidly. They were also extremely destructive.<br/><br/>There was an elemental god fragment inside, but if one wanted to obtain it, they would immediately be attacked by the two elemental gods.<br/><br/>Even if a great dao expert entered, they wouldn’t be able to gain any advantage.<br/><br/>Whether or not they could obtain an elemental god fragment would depend on luck.<br/><br/>“Fire, lightning, Elemental God, and a metal elemental god… is it the same as before? As long as one has fire, lightning, and metal attributes, after entering, the three attributes will continuously circulate, and they won’t be attacked?”<br/><br/>“If that’s the case, the chances of me obtaining the fragment of the god of elements will be much higher.”<br/><br/>Wang Xian thought to himself.<br/><br/>He felt that the possibility was very high. After all, he had encountered such a situation in the past.<br/><br/>If that was the case, Wang Xian would definitely have a good harvest this time.<br/><br/>With this thought in mind, he flew directly towards the location of the god of elements.<br/><br/>When he arrived at the edge, the violent energy in front of him surged over.<br/><br/>Once he entered, it was equivalent to being attacked by two powerhouses at the control level at all times.<br/><br/>Even existences at the Great Dao level could only focus on defense.<br/><br/>However, even if he were to open up his defense, he could only last for a few hours inside.<br/><br/>After all, an attack could be launched at any time!<br/><br/>It shouldn’t be a problem for me to enter this place by myself<br/><br/>Wang Xian thought to himself. He moved his body and flew forward.<br/><br/>The moment he entered, Wang Xian could instantly sense the violent energy in the surroundings surging towards him!<br/><br/>His expression changed slightly when he sensed this terrifying energy.<br/><br/>This terrifying energy came wave after wave. He could sense that the violent energy in this space was attacking him.<br/><br/>The attacking energy was getting stronger and more terrifying!<br/><br/>At the end of the day, the violent energy in the entire area would be concentrated on his body!<br/><br/>Buzz<br/><br/>Wang Xian’s body shook as he resisted the violent energy.<br/><br/>At the same time, he began to sense the energy in this area and started to circulate the energy in his body.<br/><br/>Fire, lightning, and metal attributes!<br/><br/>Under the circulation of the energy, Wang Xian immediately deactivated the defense in front of him.<br/><br/>The next moment, a smile appeared on Wang Xian’s face!\t\t\t\t\t\t</div>", "images": {}, "success": true}