{"id": 1296, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074910.html", "title": "Chapter 4299 - Chapter 4299: Old Man Jian 4298, Song Ta", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4299 - Chapter 4299: Old Man Jian 4298, Song Ta</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4299: Old Man Jian 4298, Song Ta<br/><br/>Translator: 549690339<br/><br/>The fragment of the god of elements in Wang Xian’s hands was very valuable.<br/><br/>The old man with the sword form was one of the transactions with Wang Xian.<br/><br/>Wang Xian saw the resources in front of him and nodded. With a wave of his arm, a fragment of the god of elements flew in front of him.<br/><br/>The resources in front of him also flew over.<br/><br/>Wang Xian grabbed the fishing line and sensed it carefully.<br/><br/>This was indeed the same aura that the god of dark elements emitted earlier.<br/><br/>This was forged from the material produced by the god of dark elements.<br/><br/>Wang Xian grabbed the fishing line and the fishing information that the old man in the pagoda gave him surfaced in his mind.<br/><br/>To fish, one must first refine some of the fragments of the god of elements!<br/><br/>After refining it, a wisp of his spirit could sink into it.<br/><br/>Then, he tied the fishing line to the fragment of the Elemental God and threw it into it.<br/><br/>As it was the same material, it would not be attacked.<br/><br/>He controlled the fragment of the Elemental God with his spirit and searched for other treasures in it. Then, he used the fishing line to bind it.<br/><br/>This was the method of the fisherman!<br/><br/>“I am Wang Xian. Thank you for your advice!”<br/><br/>After Wang Xian understood everything, he cupped his hands at the two of them!<br/><br/>“My Name Is Song Ta. You can call him Geezer Jian. He’s not good with words.”<br/><br/>Song Ta, who was holding the pagoda, cupped his hands at Wang Xian with a smile. “It’s just a small matter. Since this brother is fine, you can fish here too!”<br/><br/>“I won’t fish for the time being. I want to go in and take a look later!”<br/><br/>Wang Xian smiled and shook his head.<br/><br/>Song Ta and Geezer Jian were both strong practitioners of the Great Dao. Wang Xian would give them a lot of face.<br/><br/>The two of them naturally knew that Wang Xian was not simple, so he was very polite to him.<br/><br/>This was the respect brought about by strength!<br/><br/>Wang Xian cupped his hands at the two of them once again. His body moved and he flew into the distance!<br/><br/>“This Wang Xian is very strong. I wonder which universe he is from.”<br/><br/>Watching Wang Xian leave, song ta opened his mouth and said.<br/><br/>“He is very strong!”<br/><br/>Old Man Jian echoed. The two of them did not say anything else.<br/><br/>The universe was vast and chaotic. Similarly, there were countless experts.<br/><br/>Before the arrival of the apocalypse, they were invincible existences in their own universe.<br/><br/>However, when the apocalypse arrived, the experts from the other universes would also come out to gain experience and search for treasures and opportunities!<br/><br/>There were too many mysterious powerhouses!<br/><br/>They did not delve too deeply into it!<br/><br/>After Wang Xian entered the battlefield and distanced himself from the two powerhouses, he once again entered the battlefield of the two elemental gods.<br/><br/>The power of yin and yang circulated. After Wang Xian entered the battlefield, he immediately flew toward the elemental god of light.<br/><br/>Two days later, he arrived in front of the elemental god of light and stared at the sharp sword once again!<br/><br/>The Sword of light was still floating there and did not disappear.<br/><br/>Wang Xian’s eyes were shining.<br/><br/>“I wonder if I can get it with the fishing method!”<br/><br/>Wang Xian thought to himself. He took out a fishing line and tied a bait to it.<br/><br/>Following that, he threw the bait with his arm and wrapped it around the sharp sword.<br/><br/>This fishing line was very special. It was made from the light and dark substances in this area.<br/><br/>The condition of this material was similar to Wang Xian’s current condition!<br/><br/>Furthermore, this fishing line was very soft and west. Its interior was extremely sturdy and would not break under the impact.<br/><br/>As long as the bait was used to entangle the sharp sword, there was a chance to pull the sword over.<br/><br/>The bait was made using a special method. Wang Xian could control it and he was also Wang Xian’s other eye.<br/><br/>Under Wang Xian’s control, the bait approached the sharp sword!<br/><br/>Buzz! Buzz<br/><br/>When the bait approached, a bright force suddenly charged over.<br/><br/>The bait made from the god of elements’fragments flew into the distance under this force.<br/><br/>Wang Xian frowned slightly when he saw this scene.<br/><br/>He couldn’t use energy to resist the force of the impact.<br/><br/>Although the fishing line was very strong, there was a prerequisite that it could not compete with the energy of the Elemental God.<br/><br/>Otherwise, once it was resisted, the fishing line would be melted!<br/><br/>It could follow the energy fluctuations and could not compete with the energy!<br/><br/>When Wang Xian saw this, he could only helplessly control the bait to approach the sword of light bit by bit.<br/><br/>The Sword of light was located next to the Elemental God.<br/><br/>All the light elemental energy in the surroundings originated from the elemental god of light.<br/><br/>It would erupt waves of light elemental energy tides in the surroundings.<br/><br/>There were no rules regarding the time when the tides would erupt.<br/><br/>Once the tides erupted and struck the fishing line, it would not be able to approach the sword of light at all!<br/><br/>In addition, there would be dark tides that would sometimes come charging over.<br/><br/>If there was such a situation, it would be easy for the bait to get close to the Sword of light.<br/><br/>However, there was another point. When the dark tide arrived, the direction of impact was not fixed.<br/><br/>It might be able to impact the bait to another part of the Sword of light.<br/><br/>In short, after Wang Xian had tried for two whole days, the bait had only recently reached the position of a thousand meters away from the sword of light.<br/><br/>It could be said that there was still a huge gap between them.<br/><br/>“This is very difficult. It is too difficult to obtain the treasures beside the god of elements.”<br/><br/>“It is almost impossible to fish in such a manner unless one’s luck is heaven-defying!”<br/><br/>Wang Xian thought to himself as a helpless expression appeared on his face.<br/><br/>However, for now, this was the only chance for Wang Xian.<br/><br/>If he were to fish outside the elemental god, the probability of obtaining this sharp sword was one in ten billion.<br/><br/>If he were to fish here, the probability would be one in a million!<br/><br/>The probability was much higher, but it still required countless attempts.<br/><br/>“Let’s take it slow. After all, this is a treasure that is comparable to the combat strength of a beginner in the Heaven’s origin creation. How can it be so easy to obtain!”<br/><br/>Wang Xian thought to himself. He was not in a hurry. He was calmly fishing in the battlefield of the god of elements!<br/><br/>As he failed time and time again, time passed day by day.<br/><br/>Soon, tens of thousands of years passed. However, Wang Xian still did not manage to catch the Sword of light!<br/><br/>Time passed again. Wang Xian tried tens of billions of times but failed every time.<br/><br/>This made him feel that the probability of success was much lower than what he had predicted.<br/><br/>“Oh right, I forgot about the divination lamp. I can use the divination lamp to perform divination again and again. The efficiency is tens of thousands of times faster than my current speed, right?”<br/><br/>Another hundred thousand years passed. Wang Xian suddenly patted his head and took out the divination lamp.<br/><br/>The divination lamp could not predict whether he would succeed or not in advance.<br/><br/>Therefore, it could save him a lot of time.<br/><br/>The only drawback was that the lamp of divination could only perform divination for five minutes.<br/><br/>Using it for five minutes would take more than a year to recharge.<br/><br/>This was still many times faster than before!<br/><br/>This was because after these five minutes, Wang Xian could obtain countless results.<br/><br/>With this thought in mind, Wang Xian immediately took out the lamp of divination to test the success rate!\t\t\t\t\t\t</div>", "images": {}, "success": true}