{"id": 1291, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074890.html", "title": "Chapter 4294 - Chapter 4294: 4293 Entered The Core Region", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4294 - Chapter 4294: 4293 Entered The Core Region</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4294: 4293 entered the core region<br/><br/>Translator: 549690339<br/><br/>“I’ve succeeded. It’s just as I expected!”<br/><br/>Wang Xian was at the edge of the two elemental gods. He smiled as he felt the energy around him.<br/><br/>The energy in his body could be converted.<br/><br/>This conversion was perfect.<br/><br/>It was different from the energy of the Kylin bull which relied on its bloodline.<br/><br/>The energy of the bloodline attribute was complicated and could not be perfectly transformed.<br/><br/>In other words, Wang Xian was able to enter this place and remain safe and sound within the range of the Elemental God. This was a special case.<br/><br/>It was a special case that was difficult to replicate!<br/><br/>Of course, if there was a heaven’s origin creator who broke through with two attributes, he would be able to achieve this if he happened to meet the Elemental God who corresponded with his two attributes.<br/><br/>However, the probability of such a situation was too slim!<br/><br/>It was so slim that there might not even be one in a few billion years.<br/><br/>“Without the Elemental God’s attack, I can easily obtain the fragment of the Elemental God!”<br/><br/>Wang Xian thought to himself as he looked ahead.<br/><br/>There was a fragment of the elemental god in his line of sight.<br/><br/>He immediately flew over and grabbed at the fragment of the god of elements!<br/><br/>Buzz Buzz Buzz<br/><br/>However, at this moment, Wang Xian sensed that some of the chaos stones in the surroundings were moved and flew towards him.<br/><br/>The chaos stones carried a terrifying amount of energy and power. Wang Xian had no choice but to fend them off!<br/><br/>HMM? What’s going on? Why do I feel like my arrival has affected the chaos stones here? Is it because some special balance has been broken<br/><br/>Wang Xian thought to himself and raised his eyebrows slightly.<br/><br/>However, these chaos gems were nothing to Wang Xian.<br/><br/>Although the terrifying power of each chaos gem was comparable to those who had just entered the Heaven’s origin creation level.<br/><br/>However, these chaos gems did not attack at the same time.<br/><br/>Under such circumstances, Wang Xian was able to put up a good defense!<br/><br/>Bang! Bang! Bang<br/><br/>His arms turned into dragon claws and attacked the chaos stones one by one.<br/><br/>He directed one of the chaos stones to attack the other chaos stones.<br/><br/>At the same time, he flew toward the fragment of the god of elements rapidly.<br/><br/>Buzz<br/><br/>Soon, he arrived in front of the fragment of the god of elements and grabbed it in his hand.<br/><br/>“Very good. This god of elements is very valuable, especially for disciples at the peak of the ruler realm.”<br/><br/>Wang Xian smiled.<br/><br/>He looked to the side.<br/><br/>There was a special piece of Chaos Stone there.<br/><br/>This chaos stone belonged to a single attribute chaos stone. In other words, there was only one attribute left after being polished.<br/><br/>This kind of chaos stone was similar to the god of elements fragment.<br/><br/>However, it was more malleable than the god of elements fragment.<br/><br/>Under normal circumstances, this kind of chaos stone would have special functions.<br/><br/>Furthermore, under the influence of the chaos, this chaos stone could be forged into an extremely powerful treasure for some special reasons.<br/><br/>The lamp of divination was formed by the influence of the chaos.<br/><br/>Treasures like the lamp of divination were usually unique existences in the chaos.<br/><br/>It was almost impossible to produce a second one.<br/><br/>Wang Xian flew over and grabbed the chaos gem in his hand. A surge of lightning energy burst out from within.<br/><br/>This was a thunder-attributed chaos gem. When he held it in his hand, Wang Xian only needed to infuse a little lightning energy into it to cause the chaos gem to burst out with terrifying bolts of lightning.<br/><br/>“This thunder-attributed chaos gem can be used to forge weapons. However, the treasure forged can not reach the combat strength of the Heaven’s origin creation level. It is not of much use to me!”<br/><br/>“However, to the strong disciples in the ruler realm, this is indeed a rare treasure!”<br/><br/>Wang Xian thought to himself and kept it. Then, he looked around.<br/><br/>The two elemental gods were still clashing with each other.<br/><br/>Wang Xian was among them. The energy of the elemental gods did not attack him.<br/><br/>Although some chaos stones were clashing violently, it did not affect Wang Xian much!<br/><br/>However, after obtaining these two treasures, Wang Xian didn’t obtain any other treasures.<br/><br/>“In this area, experts of the Great Dao level will enter. As long as they are careful, there won’t be too much danger. This might also result in the fact that there aren’t many treasures in this area where the god of elements is battling!”<br/><br/>Wang Xian mumbled.<br/><br/>The fragments of the god of elements that he obtained couldn’t be compared to the eight fragments of the god of elements that Saint Shan Tian had!<br/><br/>In fact, there was a huge gap between them!<br/><br/>However, to be able to obtain such a harvest, it was already very good for any powerhouse!<br/><br/>Wang Xian flew out from here and flew towards the depths of the place once again.<br/><br/>Chaos stones whizzed past the surrounding areas.<br/><br/>Wang Xian continued to dodge them.<br/><br/>When he flew for another two days, the chaos stones whizzed past from time to time. It was already enough to almost kill a powerhouse who had just entered the Heaven’s origin blessed realm!<br/><br/>Only those who had reached the level of control could fly here.<br/><br/>Moreover, they also needed to pay attention to the chaos stones that whistled past from time to time.<br/><br/>“This place is indeed more dangerous. There seems to be a chaotic torrent ahead!”<br/><br/>Wang Xian’s gaze looked ahead as his eyes flickered slightly.<br/><br/>Deep inside, there were not only the chaos stones that were constantly flying but also the chaotic torrent.<br/><br/>The torrents that were gathered together like sand were as suffocating as the terrifying beasts in the Chaos!<br/><br/>Furthermore, there were some lights in the deeper parts of the cave.<br/><br/>These lights came from the elemental gods. However, some of these elemental gods were already comparable to existences at the level of the Great Dao.<br/><br/>Wang Xian flew into the cave to avoid the chaotic stones.<br/><br/>“Eh?”<br/><br/>At this moment, he saw a chaos stone that was emitting a strong vitality.<br/><br/>It was a chaos stone that was at least 100 meters in size. One part of it was emitting a majestic vitality while the other part of its energy was very chaotic.<br/><br/>The chaotic place had no value. However, the part of it that was emitting vitality was indeed a rare wood-type energy treasure.<br/><br/>It could be used!<br/><br/>This was equivalent to a treasure that had yet to be completely polished.<br/><br/>Wang Xian stared at the piece of Chaos Stone and chased after it rapidly.<br/><br/>Boom! Boom! Boom<br/><br/>The booming sounds in the surroundings were incessant. Some of the energy from the collision of the Chaos Stones was filling up the surroundings.<br/><br/>Those who were at the peak of the ruler realm would not live for more than two seconds after arriving here.<br/><br/>Wang Xian chased after the piece of chaos stone rapidly. His powerful speed allowed him to chase after it rapidly.<br/><br/>Here, the power of space was greatly restricted. It was impossible to teleport in space.<br/><br/>Wang Xian came to the front of the chaos gem and sensed this energy. Then, he kept it.<br/><br/>The value of this chaos gem was much higher than what he had just obtained.<br/><br/>This wood-elemental energy could be turned into a treasure ground for cultivation.<br/><br/>It could be turned into treasures.<br/><br/>Wang Xian wasn’t too happy after obtaining three treasures.<br/><br/>After all, these treasures weren’t of much use to him.<br/><br/>It wasn’t bad for him to use them to nurture his disciples!\t\t\t\t\t\t</div>", "images": {}, "success": true}