{"id": 1294, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074902.html", "title": "Chapter 4297 - Chapter 4297: 4296 Special Angler", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4297 - Chapter 4297: 4296 Special Angler</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4297: 4296 special angler<br/><br/>Translator: 549690339<br/><br/>Wang Xian looked at the treasured sword in front of him and felt a little excited!<br/><br/>There was a limit to the number of weapons that an expert could control.<br/><br/>It was impossible for an expert to control treasures indefinitely.<br/><br/>For example, if a beginner-level expert were to control hundreds of Heaven’s origin fortunes, wouldn’t he be invincible in the universe?<br/><br/>That was not the case. An beginner-level expert could control a heaven’s origin fortunes treasure at most.<br/><br/>If he was given another treasure that had the combat power of a beginner-level heavenly yuan creation treasure, he wouldn’t be able to control it!<br/><br/>In addition, Heavenly Yuan creation treasures were hard to control even for Great Dao level powerhouses.<br/><br/>Especially if a great dao level powerhouse had two offensive heavenly Yuan creation treasures.<br/><br/>If he used them at the same time, it would be difficult for two offensive heavenly yuan creation treasures to give him two control-level combat power.<br/><br/>It would be very difficult for him to unleash the power of the two heaven-origin destiny-level treasures.<br/><br/>At most, it would be slightly better than one heaven-origin destiny-level treasure.<br/><br/>Of course, there was another possibility. It was possible to maximize his own strength and control more heaven-origin destiny-level treasures.<br/><br/>That was, he had one offensive, one defensive, and one supporting type.<br/><br/>The offensive, defensive, and supporting types did not interfere with each other. He could control more of them!<br/><br/>For example, an attack-type weapon. Since the five elements grinding mill and the Tai Chi Dragon disk contained the dragon soul, in fact, Wang Xian didn’t need to control it.<br/><br/>The Void Dragon Pool had the body of the Void Divine Dragon to control it, so he didn’t need it either.<br/><br/>Now that he had the supportive ancestral tree in his body, he could still control an attack-type treasure in his hands.<br/><br/>This seemingly powerful sword of light could enhance Wang Xian’s strength.<br/><br/>This enhancement was calculated based on this sharp sword.<br/><br/>And this sharp sword should have the power of a beginner in the Heaven’s origin creation stage.<br/><br/>Wang Xian’s heart was burning with passion.<br/><br/>If he could obtain this sharp sword and forge it slightly, his combat strength would be comparable to two great dao existences!<br/><br/>“If I want to obtain this sword of light, I need to be careful!”<br/><br/>Wang Xian was deep in thought. With a move of his palm, he used the power of light and darkness to create a space!<br/><br/>Following that, he took out the lamp of divination.<br/><br/>The lamp of divination was purely a supporting treasure. It did not provide much boost to one’s combat strength!<br/><br/>However, if it was used to predict danger, it would bring great benefits.<br/><br/>Buzz<br/><br/>Wang Xian injected a stream of energy into the lamp of divination. At the same time, a stream of information was transmitted into it.<br/><br/>Buzz<br/><br/>As the divination lamp lit up, an image was transmitted under the light!<br/><br/>Looking at this image, Wang Xian frowned!<br/><br/>In the image, he flew towards the god of light elements and grabbed towards the sword of light!<br/><br/>This triggered the fluctuations of the god of elements. A terrifying wave of energy attacked him.<br/><br/>He used all his strength to resist. Under the resistance, he triggered the fluctuations of the god of darkness elements. A certain balance was broken and a powerful force of darkness attacked him.<br/><br/>Facing the direct attack of two Great Dao level elemental gods, Wang Xian could not maintain the balance of yin and yang in his body at all!<br/><br/>Following that, violent energy covered him!<br/><br/>Buzz! Buzz! Buzz<br/><br/>Buzz! Buzz! Buzz<br/><br/>At this moment, Wang Xian saw the energy in the divination lamp burning crazily. It was depleting crazily!<br/><br/>According to the burning speed, the energy would burn out in at most five seconds!<br/><br/>As Wang Xian watched, he extinguished the divination lamp immediately!<br/><br/>Looking at the situation before him, there was already a result!<br/><br/>He failed!<br/><br/>Before he could grab the spatial sword, the balance of yin and yang in his body was broken.<br/><br/>Once the balance in his body was broken, he would naturally be attacked!<br/><br/>Therefore, he would fail if he tried to snatch it directly.<br/><br/>I have to think of another way. Besides, this divination lamp is indeed a powerful treasure. No wonder Saint Shan Tian risked his life to obtain this divination lamp. Impressive<br/><br/>Wang Xian thought to himself.<br/><br/>He put away the divination lamp and looked at the spatial sword again.<br/><br/>However, after thinking for a while, he still couldn’t think of a way!<br/><br/>He could use the light attribute to form a rope to grab it.<br/><br/>However, when his energy entered here, it would be assimilated by the power of light as well as the impact of the power of darkness.<br/><br/>A power that was too weak would be useless in the face of an attack from an elemental god that was close to the Great Dao level.<br/><br/>After thinking for a few minutes, Wang Xian could only shake his head in the end!<br/><br/>“Let’s go to other places first and think of a way!”<br/><br/>Wang Xian could only give up temporarily. He took a stroll around the surroundings before flying towards the direction of the Elemental God of darkness.<br/><br/>When he arrived at the side of the Elemental God of darkness, the dark energy here was much more than the light energy.<br/><br/>The surroundings were pitch-black and his vision was even worse than the other side.<br/><br/>Buzz! Buzz! Buzz<br/><br/>However, when Wang Xian was flying, a corrosive sound was suddenly heard.<br/><br/>This gave him a slight shock. He immediately looked in front of him.<br/><br/>A dark, substance-like energy that looked like liquid was looking down on his physical body.<br/><br/>“Good heavens, this substance-like energy that is filled with corrosion is indeed a treasure. I have overlooked it!”<br/><br/>Wang Xian wrapped it with energy as his eyes sparkled.<br/><br/>The corrosive material dark liquid had a radius of 100 meters.<br/><br/>This corrosive force could severely injure an expert who had just entered the Heaven’s origin realm.<br/><br/>If it was used to forge a weapon, it could be comparable to an expert who had just entered the Heaven’s origin realm.<br/><br/>Of course, this was different from the sharp sword. This special dark liquid needed to be refined at a later stage.<br/><br/>Otherwise, it wouldn’t be easy to control and use!<br/><br/>After putting it away, he continued to search around.<br/><br/>After a few hours, he once again obtained four darkness Elemental God fragments.<br/><br/>This made him very pleasantly surprised!<br/><br/>“Eh? This Is?”<br/><br/>When he continued to search, he was suddenly slightly stunned and looked ahead with a face full of surprise.<br/><br/>There was a dark elemental god fragment in front of him. However, this elemental god fragment had the appearance of a special demonic beast.<br/><br/>It had a blood-red pupil and looked like a living creature!<br/><br/>There was a thin rope above the elemental god fragment.<br/><br/>This rope was connected to this special elemental God fragment!<br/><br/>The thin rope extended all the way to the top. It looked extremely strange!<br/><br/>“What’s going on?”<br/><br/>Wang Xian looked at this special scene and his face was filled with astonishment.<br/><br/>This was obviously not formed in this area.<br/><br/>The fragment of the god of elements that was tied by the thin rope?<br/><br/>The thin rope?<br/><br/>At this moment, Wang Xian saw the fragment of the god of elements moving towards him!<br/><br/>However, Wang Xian could clearly sense that the fragment of the god of elements did not sense him.<br/><br/>He hesitated for a moment before retreating immediately!<br/><br/>Then, he took out the lamp of divination again!\t\t\t\t\t\t</div>", "images": {}, "success": true}