{"id": 1300, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074926.html", "title": "Chapter 4303 - Chapter 4303: 4302 Special Creature With 10 Attributes", "volume": 13, "volume_title": "Volume 13", "body": "<h1>Chapter 4303 - Chapter 4303: 4302 Special Creature With 10 Attributes</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4303: 4302 special creature with 10 attributes<br/><br/>Translator: 549690339<br/><br/>“The energy in here is very terrifying. It’s even more terrifying than I imagined. I merely used my hand to reach the edge of the area before I was attacked by a powerful force.”<br/><br/>Wang Xian looked at his arm. His face was filled with a solemn expression!<br/><br/>The area where many types of energy were fused was much more terrifying than he imagined.<br/><br/>Wang Xian looked ahead and pondered for a moment. Then, his body entered the area completely.<br/><br/>Of course, after entering the area, Wang Xian was immediately attacked.<br/><br/>With a thought, he circulated the energy in his body.<br/><br/>The current Wang Xian had the body of the Void Dragon in his main body.<br/><br/>His body also possessed ten different attributes.<br/><br/>Logically speaking, Wang Xian could try to circulate ten different types of energy and fuse them into this area.<br/><br/>However, Wang Xian soon discovered a huge problem!<br/><br/>The energy of the space attribute in his body could not fuse perfectly with the nine attributes in his body.<br/><br/>This also caused the energy in his body to be different from the energy in this region.<br/><br/>The energy in this region treated him as an intruder.<br/><br/>Waves of energy invaded his body.<br/><br/>In just a few seconds, Wang Xian flew out of it hurriedly.<br/><br/>He couldn’t hold on for long in this place.<br/><br/>A dao-level person, even if he had powerful treasures, could only stay in this place for a few dozen seconds at most.<br/><br/>The space attribute is not completely compatible with me, nor is it in balance with the energy in my body. Therefore, it’s basically impossible for me to enter the domain of the Elemental God like before<br/><br/>Wang Xian was deep in thought.<br/><br/>He moved his palm and extracted some of the energy within. Then, he sensed it quietly!<br/><br/>Very soon, an idea popped up in Wang Xian’s mind.<br/><br/>Since he could not integrate himself into an area, could he disguise himself as the energy in this area?<br/><br/>As long as he disguised himself as the same energy as this area, would he not be attacked by the energy in this area?<br/><br/>Wang Xian thought to himself and prepared to give it a try.<br/><br/>The so-called disguise was to put on a piece of clothing for himself.<br/><br/>The energy in this piece of clothing was exactly the same as the energy in this area.<br/><br/>If that was the case, would he be able to withstand the attack of the energy in this area?<br/><br/>Wang Xian felt that there was a possibility of success.<br/><br/>He could feel the characteristics of the ten types of energy in this area mixing together. Then, he began to control the energy in his body to simulate this type of energy.<br/><br/>After a few hours, Wang Xian had successfully simulated it.<br/><br/>His body moved and his surroundings were enveloped by the energy of the ten types of attributes, forming a colorful shirt!<br/><br/>Wang Xian stared ahead and slowly stepped into this area.<br/><br/>Buzz<br/><br/>When he entered this area, the feeling of being attacked didn’t appear immediately.<br/><br/>However, Wang Xian frowned very quickly.<br/><br/>“It’s somewhat useful, but I can’t completely avoid the invasion of this energy.”<br/><br/>Wang Xian mumbled.<br/><br/>In this cross-shaped primordial spirit area, the ten elemental gods were all at the level of the powerful Great Dao.<br/><br/>The stronger the elemental gods were, the more characteristics they possessed.<br/><br/>For example, erosion, detection, and so on.<br/><br/>Although Wang Xian’s disguise was very perfect, he could still be seen through by the energy here and attacked.<br/><br/>However, his disguise was still useful.<br/><br/>The amount of energy that invaded him was much less. The time he could last in this area was also much longer.<br/><br/>In the past, he might be able to stay in this area for a minute if he went all out.<br/><br/>But now, he could stay in this area for at least two minutes.<br/><br/>There was a prerequisite that he could not make a move while he was in there.<br/><br/>Once he mobilized the energy in his body, the disguise would fail.<br/><br/>Regardless, this disguise would be of great benefit to Wang Xian.<br/><br/>“I can take a look around!”<br/><br/>There were some effects. Wang Xian smiled and began to explore the surroundings.<br/><br/>Song Ta, old man Jian, and the rest wouldn’t enter the place after they arrived.<br/><br/>However, according to Wang Xian’s guess, they should have bait in their hands.<br/><br/>There should be fishing lines in this area.<br/><br/>They should be able to obtain treasures through fishing.<br/><br/>Wang Xian observed the surroundings. The treasures that he expected to find easily did not appear.<br/><br/>After searching for a few days, he still did not find anything.<br/><br/>The main reason was that Wang Xian did not enter the place.<br/><br/>Boom<br/><br/>On this day, when Wang Xian continued to search the surroundings, a strong energy fluctuation was transmitted.<br/><br/>Wang Xian focused his gaze and sped up to look ahead!<br/><br/>In his line of sight, a figure wearing a black bamboo hat and emitting an evil aura was floating above the area of the cross primordial spirit.<br/><br/>A part of this figure’s body was a little strange!<br/><br/>In front of his strange black arm, there was a creature connected to it.<br/><br/>Under Wang Xian’s perception, this creature actually possessed ten different attributes.<br/><br/>The strange creature connected to his arm was long and slender like a python, extending all the way inside.<br/><br/>According to Wang Xian’s perception, he could sense that this strange existence connected to his body was only at the level of the void God Emperor.<br/><br/>“Who is spying on us? Leave immediately!”<br/><br/>The figure wearing the bamboo hat sensed Wang Xian. A pair of triangular blood-red glowing eyes flashed under the bamboo hat as he spoke with a sinister expression!<br/><br/>“I rushed over after hearing the commotion. I didn’t mean to offend you!”<br/><br/>Wang Xian sensed the aura of this figure and frowned slightly before explaining.<br/><br/>The bloody aura of this figure wearing the bamboo hat was abnormally dense.<br/><br/>The Darkness attribute on his body was different from that of the old man from Song Pagoda Sword. The Aura on his body was even more bloody.<br/><br/>“Then get lost.”<br/><br/>The figure wearing the bamboo hat continued to speak coldly!<br/><br/>Wang Xian raised his eyebrows and looked at him. Then, he looked at the strange creature that extended into the area of the cross-shaped primordial spirit. He turned around and left.<br/><br/>Those who were able to come here were at least at the level of the Great Dao.<br/><br/>“However, this fellow is a little arrogant. There’s also that strange creature on his arm!”<br/><br/>Wang Xian didn’t leave too far away. He muttered as he thought of the strange creature on the figure in the bamboo hat.<br/><br/>That strange creature should be an existence created by the figure in the bamboo hat.<br/><br/>A creature with ten attributes fused into one. It was exactly the same as the energy in the area of the Cross’s primordial spirit.<br/><br/>Such a python-like creature would not be attacked when it entered the Cross’s primordial spirit region.<br/><br/>Similarly, the special creature created by the hooded figure was not very strong.<br/><br/>It was only at the level of an Emperor God.<br/><br/>In this region, it was like an ant that could be destroyed at any time.<br/><br/>However, Wang Xian could also guess that it was not that the hooded figure did not want to create a powerful creature with ten attributes. Instead, it was extremely difficult to create such a creature.<br/><br/>After all, it was a creature with ten perfectly fused attributes.<br/><br/>With so many attributes, it was extremely difficult for a great dao-level heaven origin creator to solve the problem of fusion and rejection!\t\t\t\t\t\t</div>", "images": {}, "success": true}