{"id": 1301, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074930.html", "title": "Chapter 4304 - Chapter 4304: 4303 Joined Forces", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4304 - Chapter 4304: 4303 Joined Forces</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4304: 4303 joined forces<br/><br/>Translator: 549690339<br/><br/>Wang Xian left the detection range of the old man in the bamboo hat. He squinted his eyes slightly and looked in that direction.<br/><br/>However, after hesitating for a moment, Wang Xian did not engage in a fight with the old man in the bamboo hat.<br/><br/>Even if he were to make a move now, it would be difficult for him to do anything to the old man!<br/><br/>There was no point in engaging in a fight with the old man!<br/><br/>Moreover, Wang Xian had no idea about the old man’s background at all!<br/><br/>With this thought in mind, he flew in another direction.<br/><br/>At the same time, Wang Xian was very curious about the special creature on the old man.<br/><br/>This creature had ten attributes and was able to enter the region of the cross-shaped primordial spirit.<br/><br/>This was an inspiration to Wang Xian.<br/><br/>This method was somewhat similar to the fishing method.<br/><br/>However, Wang Xian felt that this method might be more suitable for him.<br/><br/>After all, he had ten attributes at the moment.<br/><br/>If he were to create a living creature, he would definitely be able to create something even more powerful.<br/><br/>Putting everything else aside, he was still confident in the ruler realm.<br/><br/>And the ruler realm was something that the divine emperor realm could not compare to.<br/><br/>However, this kind of living creature is not something that I can create casually. After all, this is the aspect of creation. I need to master secret techniques or I need to continue researching<br/><br/>Wang Xian thought to himself and temporarily gave up on this idea.<br/><br/>He swept his gaze across the surroundings and continued to search the area.<br/><br/>However, if he were to search from the outside, it was purely a matter of luck!<br/><br/>Wang Xian’s luck could not always be very good.<br/><br/>This time, Wang Xian did not discover any treasures just from the outside.<br/><br/>I still have to go deep inside. For example, Sword Elder Song Ta and the rest should have fishing tools here. After all, this is the core area<br/><br/>Wang Xian thought to himself.<br/><br/>Currently, Wang Xian’s background here was considered the worst.<br/><br/>I still have to go in<br/><br/>Wang Xian moved his body and entered the cross-shaped primordial spirit area directly.<br/><br/>There was an energy camouflage around him.<br/><br/>Two minutes was not a short time for him, but it was definitely not a long time either.<br/><br/>Especially in this place where his movement speed was greatly reduced.<br/><br/>There were not many places that could be explored in two minutes.<br/><br/>Once it was more than two minutes, it would be dangerous.<br/><br/>As for the divination lamp, it was useless here.<br/><br/>If one wanted to divine the ten elemental gods of the Great Dao level, it was possible to exhaust all their energy in one second.<br/><br/>Wang Xian could only use such a stupid method to start the search.<br/><br/>At the very least, he needed to find some materials so that he could create his own fishing tool.<br/><br/>In that case, he could try fishing.<br/><br/>Although it was only two minutes, the other great dao level experts would probably only be able to stay in there for a few dozen seconds.<br/><br/>After entering the area of the cross primordial spirit, Wang Xian quickly looked around.<br/><br/>After a minute and a half, he came out immediately to prevent any accidents.<br/><br/>In the next few months, Wang Xian managed to find some special materials.<br/><br/>It was a material that was like a weed. There were ten kinds of energy attributes on it.<br/><br/>Wang Xian could use this material to create fishing lines.<br/><br/>“I might as well go to those ordinary areas of the Elemental God.”<br/><br/>A few months later, Wang Xian shook his head. He didn’t gain much.<br/><br/>This gave him the idea of leaving this place.<br/><br/>After all, obtaining treasures didn’t mean that he could only obtain them in the core.<br/><br/>It was easier to obtain treasures in a place that was more suitable for him.<br/><br/>“This won’t do. There’s a special vortex inside this place. It Won’t be able to last long if we rely on our strength.”<br/><br/>At the same time, they were at another location in the cross-shaped primordial spirit region.<br/><br/>Old Man Jian and song Ta were floating together.<br/><br/>They were staring at the location in front of them with their brows knitted tightly.<br/><br/>Both old man Jian and song Ta had stayed in this region for a very, very long time.<br/><br/>They also knew a lot about everything in the cross-shaped primordial spirit region.<br/><br/>It was completely incomparable to Wang Xian.<br/><br/>After they separated from Wang Xian, the two of them separated as well.<br/><br/>However, song TA had found this place not long ago. He discovered that there were a few pieces of the god of elements fragments as well as fire-type treasures inside.<br/><br/>However, there was a small whirlpool formed here. If he wanted to obtain these treasures, he had to enter the whirlpool!<br/><br/>Although this place wasn’t far from the safe zone outside, he couldn’t hold on for long due to the existence of this whirlpool.<br/><br/>Therefore, he called old man Jian over.<br/><br/>However, the result of the two of them working together was still unable to bring him up.<br/><br/>They would not be able to hold on for so long.<br/><br/>“I need to continue to look for helpers. Only by combining the powers of the two powerhouses on my body can I obtain those few treasures.”<br/><br/>Song Ta opened his mouth and said, “There are not many old fellows here. Moreover, our relationship with them is just average. Why don’t we look for that Wang Xian?”<br/><br/>“Him? Sure, his strength isn’t weak. However, we aren’t afraid of any accidents if we join forces. He should be around and can rush over quickly.”<br/><br/>The old man with the sword thought for a while and nodded his head in agreement.<br/><br/>“Alright!”<br/><br/>Song ta replied. Then, he took out his heaven origin communication device and sent a message to Wang Xian.<br/><br/>On the other side, Wang Xian, who was about to leave, suddenly received a message from song TA. He had a surprised expression on his face.<br/><br/>“Huh? Are you looking for me to join forces?”<br/><br/>When Wang Xian received this message, he also had a surprised expression on his face.<br/><br/>He was not familiar with the old man song Ta Jian.<br/><br/>Inviting him to join forces at this moment was obviously a problem that both of them could not solve.<br/><br/>Wang Xian did not hesitate. He replied a message directly and flew towards their location.<br/><br/>Since the other party was looking for him to join forces, he believed that they were extremely confident.<br/><br/>Since they were working together, they would gain something.<br/><br/>Wang Xian had stayed here for a period of time and did not gain anything. Now that there was an opportunity, he naturally went over to take a look.<br/><br/>Buzz<br/><br/>Two days later, Wang Xian arrived at the location where song Ta, old man Jian, and the rest were.<br/><br/>When he saw the two of them, Wang Xian’s eyes flickered slightly and he immediately approached them!<br/><br/>“Brother Wang Xian, sorry to disturb you!”<br/><br/>Song ta greeted Wang Xian with a smile when he saw him approaching!<br/><br/>“There’s no need to disturb me. It’s very beneficial for me to be called over by the two of you!”<br/><br/>Wang Xian smiled and replied!<br/><br/>“Since I’ve called you over, brother Wang Xian, I’m confident that I’ll be able to obtain the treasures in there with your help.”<br/><br/>Song ta said, he pointed to the bottom and said, “There is a special vortex there. In the center of this vortex, there are some fragments of the god of elements and treasures. If I were to join forces with old man sword, I wouldn’t be confident. If I were to join forces with you, brother Wang Xian, I would be confident!”<br/><br/>“Brother Wang Xian, you can go in and take a look. The treasures are those. When the time comes, we can distribute them!”<br/><br/>“Oh? Alright!”<br/><br/>When Wang Xian heard his words, he looked at the place he was pointing at and nodded.<br/><br/>Under song TA’s signal with a smile, Wang Xian moved his body and flew down.\t\t\t\t\t\t</div>", "images": {}, "success": true}