{"id": 1303, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074938.html", "title": "Chapter 4306 - Chapter 4306: The Evil Sequence 4305 Spirit Kneader", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4306 - Chapter 4306: The Evil Sequence 4305 Spirit Kneader</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4306: The evil sequence 4305 spirit kneader<br/><br/>Translator: 549690339<br/><br/>“Damn it!”<br/><br/>Faced with Wang Xian’s killer moves one after another, the figure wearing the bamboo hat was a little moved at this moment.<br/><br/>Naturally, he still remembered Wang Xian. The last time they met, he left after giving a reprimand.<br/><br/>This made the figure wearing the bamboo hat think that Wang Xian was just an ordinary great dao expert.<br/><br/>Therefore, there was a huge commotion over here. It was suspected that there was a treasure. After he rushed over, he didn’t pay too much attention to Wang Xian’s warning.<br/><br/>However, when he saw his opponent’s killing moves that were getting more and more terrifying, his expression changed completely!<br/><br/>He waved the flag in his hand and a terrifying phantom image of a monster appeared.<br/><br/>This monster was behind him. It opened its huge mouth and directly swallowed the figure in the bamboo hat, completely protecting it.<br/><br/>The Sword of light landed on the head of this terrifying monster.<br/><br/>Countless Thunderbolts landed on its body.<br/><br/>The entire phantom of the monster began to dissipate slowly, revealing the figure in the bamboo hat.<br/><br/>However, it managed to fend off Wang Xian’s two attacks.<br/><br/>“Roar!”<br/><br/>At this moment, Wang Xian had already arrived in front of him. Both parties were very close to each other!<br/><br/>“You are courting death!”<br/><br/>The figure in the bamboo hat was a little angry. Looking at Wang Xian who was attacking him, he roared furiously.<br/><br/>Being killed one after another made him angry!<br/><br/>“Evil spirit, kill him!”<br/><br/>He raised the flag in his hand. The flag emitted a glow and a terrifying evil spirit pounced on Wang Xian!<br/><br/>The moment the evil spirit pounced on him, the figure in the bamboo hat waved his arm. Waves of energy and means entered the evil spirit’s body directly!<br/><br/>This made the evil spirit’s aura even more terrifying!<br/><br/>Buzz<br/><br/>Wang Xian stared at the figure in the bamboo hat. His eyes were filled with awe.<br/><br/>The divination lamp appeared directly at his side. The strength of the figure in the bamboo hat appeared in his mind.<br/><br/>It was comparable to a great dao level, a control level, and a beginner level!<br/><br/>This strength was similar to the strength of the king of the Void Dynasty in the Void Universe!<br/><br/>“How dare a dog like you act so presumptuously in front of me?”<br/><br/>Wang Xian stared at the figure in the bamboo hat. Two streams of energy bloomed from his Dragon Horn and attacked the evil spirit directly.<br/><br/>At the same time, numerous densely packed swords of light around him attacked him as well!<br/><br/>“Ahhhh!”<br/><br/>The extremely powerful evil spirit let out a blood-curdling scream in the face of Wang Xian’s attack.<br/><br/>A mournful scream came out from his mouth. The energy in his body was slowly melting.<br/><br/>Boom<br/><br/>Wang Xian swept his dragon tail across and landed heavily on the evil spirit.<br/><br/>The evil spirit was somewhat illusory, as if it was going to disappear at any moment.<br/><br/>It flew directly toward the figure in the bamboo hat!<br/><br/>“This fighting strength…”<br/><br/>The figure in the bamboo hat looked at Wang Xian’s destructive power and saw that the evil spirit he released was defeated. An ugly expression appeared on his face.<br/><br/>At this moment, he could also sense how strong Wang Xian was.<br/><br/>He could also roughly estimate that Wang Xian’s strength was at the level of two Great Dao.<br/><br/>He was no match for him.<br/><br/>If he were to fight, he would not be able to gain the upper hand.<br/><br/>If he were to fight for a long time, he would be injured and suffer some losses!<br/><br/>“Eight-sided Dragon Pillar!”<br/><br/>“Mighty Heavenly Dragon!”<br/><br/>The figure in the bamboo hat had the intention to retreat. However, Wang Xian would not let him off so easily.<br/><br/>Wang Xian did not have a good impression of this figure in the bamboo hat.<br/><br/>He did not say anything about the last time. This time, he actually dared to offend him. He would have to pay a price!<br/><br/>Eight terrifying dragon pillars surrounded him and sealed him in the middle.<br/><br/>In the sky, an extremely huge divine dragon swooped down!<br/><br/>“Huh?”<br/><br/>At the same time, at the back.<br/><br/>In the cross-shaped primordial spirit region, song Ta and old man Jian came out with joyful expressions on their faces.<br/><br/>However, the moment they came out, they sensed the battle ahead.<br/><br/>The two of them focused their gaze and looked over immediately!<br/><br/>“Wang Xian is fighting against a powerhouse.”<br/><br/>Old Man Jian looked over and said immediately.<br/><br/>“That is? It’s that dog, the spirit kneader. It’s him.”<br/><br/>Song ta landed on the figure in the bamboo hat that was surrounded by energy. His gaze focused as he spoke.<br/><br/>“Wang Xian is at the upper hand now. He has suppressed the spirit kneader. Song Ta!”<br/><br/>Old Man Jian’s gaze turned cold as he looked at Song Ta!<br/><br/>“F * ck!”<br/><br/>Song ta did not hesitate at all. His eyes were filled with killing intent!<br/><br/>With a move of his palm, a pagoda appeared in his hand.<br/><br/>The pagoda rose straight up and released a terrifying energy.<br/><br/>This was the power of the ultimate treasure of the Heaven’s origin.<br/><br/>The pagoda enlarged and flew directly to the side of the Mighty Heavenly Dragon!<br/><br/>Old Man Jian closed his eyes slowly. His entire person had turned into an extremely terrifying demonic sword!<br/><br/>In an instant, he disappeared!<br/><br/>“Brother Wang Xian, we are here to help you kill that evil sequence alignment spirit kneader!”<br/><br/>Song Ta’s figure moved and appeared above the pagoda as if he had teleported. He shouted at Wang Xian!<br/><br/>“Song Ta, you are here too?”<br/><br/>“And you, Demonic Sword!”<br/><br/>When the spirit kneader, who was surrounded by the eight dragon pillars, heard song Ta’s voice and saw the pagoda that was the most precious treasure of the Heaven’s origin creation, his expression changed drastically. When he sensed old man Jian’s aura again, his heart pounded violently and he roared!<br/><br/>“Haha, it’s Me, your ancestor. I didn’t expect that we would be able to catch you today. Haha!”<br/><br/>Song Ta’s eyes shone brightly!<br/><br/>“Evil sequence spirit kneader?”<br/><br/>Wang Xian heard their conversation and gained some understanding of the figure in the bamboo hat.<br/><br/>His gaze focused and the powers of the eight dragon pillars and the Mighty Heavenly Dragon descended at the same time!<br/><br/>“Oh no!”<br/><br/>The Spirit kneader revealed a panicked expression. He gritted his teeth and pressed his palms together!<br/><br/>“Palm of the gods, break the boundary and divide the spirit!”<br/><br/>He pressed his palms together, and it was as if there were countless gods contained within.<br/><br/>He spread his hands open, and the countless gods attacked the eight-sided dragon pillar and the Mighty Heavenly Dragon!<br/><br/>In the next instant, the flag beside him included him as he fled downwards!<br/><br/>“Abyss Gaze.”<br/><br/>At this moment, old man Jian appeared below him.<br/><br/>He was like a sword, a terrifying demonic sword from the Abyss!<br/><br/>Old Man Jian was an extremely extreme and terrifying expert who had turned himself into a demonic sword.<br/><br/>His strength was not weaker than the spirit kneader!<br/><br/>An abyss seemed to have appeared below the spirit kneader, and this abyss was like a terrifying demonic sword.<br/><br/>The Abyss wanted to devour the spirit kneader and Pierce through it.<br/><br/>“Hahaha, Spirit kneader, you have such a day!”<br/><br/>Above him, song ta laughed maniacally. The pagoda beneath him released a stream of power.<br/><br/>A pagoda’s phantom image covered him, as if it wanted to completely suppress him!<br/><br/>Song Ta and Old Man Sword didn’t expect to see this scene just as they flew out of the cross-shaped primordial spirit region.<br/><br/>They were experts of the Justice Alliance, while the Spirit KNEADER was an expert of the evil sequence.<br/><br/>Moreover, the two sides had many conflicts.<br/><br/>However, the difference in strength between them wasn’t that great, and neither of them had gained any advantages.<br/><br/>Now, they didn’t expect to see the spirit kneader being suppressed and beaten as soon as they came out.\t\t\t\t\t\t</div>", "images": {}, "success": true}