{"id": 1304, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074942.html", "title": "Chapter 4307 - Chapter 4307: 4,306 Against One, A Huge Gain!", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4307 - Chapter 4307: 4,306 Against One, A Huge Gain!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4307: 4,306 against one, a huge gain!<br/><br/>Translator: 549690339<br/><br/>They were shocked by Wang Xian’s strength.<br/><br/>Being able to suppress the spirit kneader meant that Wang Xian was stronger than them.<br/><br/>This was an opportunity for song Ta and old man Jian.<br/><br/>With Wang Xian joining forces this time, the spirit kneader would definitely pay a heavy price!<br/><br/>“Damn it, since when did your justice alliance have such a strong expert?”<br/><br/>The Spirit Kneader’s heart sank when he saw this scene, and he could not help but growl in a low voice!<br/><br/>“Hehe, I’m not a member of the Justice Union. I met you not long ago, and you told me to Scram. I didn’t hold it against you. Now that you’re in my territory, you actually dare not scram when I tell you to SCRAM. Dog, I thought that you were very strong, but this is just so-so!”<br/><br/>“I wonder who gave you the confidence to be so arrogant!”<br/><br/>Wang Xian stared coldly at the spirit kneader.<br/><br/>The Mighty Heavenly Dragon and the eight dragon pillars slowly disappeared under his strong resistance.<br/><br/>However, at this moment, the spirit kneader would be facing the attacks of Song Ta and Geezer Jian.<br/><br/>Wang Xian could also see that they were enemies.<br/><br/>If there was a chance, the powerhouses from two different camps would definitely not let the other party off.<br/><br/>Now, he was facing three Great Dao level powerhouses.<br/><br/>Especially since each of them was not weaker than him.<br/><br/>In a three versus one situation, he could definitely kill them.<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom<br/><br/>While Wang Xian was speaking, two terrifying energies had already arrived in front of the spirit kneader.<br/><br/>The attacks of the two powerhouses were almost fatal when the spirit kneader was not prepared!<br/><br/>The Spirit Kneader’s heart sank when he saw the two attacks.<br/><br/>He moved his palm and a clay figurine appeared in his hand.<br/><br/>“Bang! Bang!”<br/><br/>All the attacks landed on his body but the spirit kneader did not put up any resistance!<br/><br/>The clay figurine in his hand collapsed and vanished into thin air.<br/><br/>His original body was not injured at all.<br/><br/>The damage was transferred.<br/><br/>He transferred the fatal damage to the clay figurine!<br/><br/>“Hehe, let me see how many trump cards you have!”<br/><br/>Wang Xian was not surprised by the trump cards of such a strong person.<br/><br/>He also had a similar trump card in his hands!<br/><br/>Wang Xian extended his dragon claw, which was condensed with ten kinds of terrifying and vast energy. He clawed at the spiritual kneader!<br/><br/>“Haha, I want to see it too!”<br/><br/>Song Ta saw that he had used up a powerful treasure. He laughed out loud and continued to prepare for the second round of Attack!<br/><br/>The old man with the sword was also preparing for the second round of attack.<br/><br/>They would launch a fatal attack the moment Wang Xian’s attack landed.<br/><br/>With the strength of the spirit kneader, it was already very difficult for him to defend against Wang Xian’s attack. In addition to the attacks from the two top-notch experts, he could only use his trump cards to defend or take it head-on!<br/><br/>Every time, it was good to use up a powerful treasure like the clay figurine.<br/><br/>“Spirit, waste!”<br/><br/>The spirit kneader also realized this problem.<br/><br/>He gritted his teeth and did not hesitate at all. He used his powerful escaping ability and his body turned illusory as he fled in all directions!<br/><br/>“Spirit kneader, have you forgotten me? The pagoda suppresses the void!”<br/><br/>Song Ta saw that the spirit kneader wanted to escape, and his gaze focused. The entire pagoda shook slightly in the Void!<br/><br/>Buzz<br/><br/>In an instant, everything in the surroundings seemed to freeze. The illusory image of a pagoda enveloped the entire world.<br/><br/>Even quicksand stopped moving.<br/><br/>If he wanted to escape from this world, he needed to break through this pagoda!<br/><br/>“Embrace the Abyss!”<br/><br/>Old Man Jian also let out a low growl. His body transformed into terrifying demonic swords.<br/><br/>The demonic swords connected together and formed an abyss that enveloped the surroundings.<br/><br/>Wang Xian’s dragon claws continued to attack the illusionary figure of the spirit kneader!<br/><br/>“Song ta, the Demon Sword, and you… I will remember all of you. Just you wait. I will make all of you pay for everything that happened today!”<br/><br/>The spirit kneader sensed the terrifying powers around him and roared with an extremely ugly expression.<br/><br/>He knew that he was no match for Wang Xian and the rest who were working together.<br/><br/>The longer the battle went on, the greater his losses would be!<br/><br/>At this moment, he broke his wrist.<br/><br/>The body of the spirit kneader gradually solidified. However, he could sense that his life force and soul seemed to be draining away from his body!<br/><br/>This move of his was suicide.<br/><br/>Similarly, this move of his was also a form of escape!<br/><br/>“Haha, Life Disintegration, a strong man breaking his wrist, a spirit kneader. Good move. Haha, Thank You for sending such a great gift. We will accept this great gift!”<br/><br/>Song Ta saw the pinching of the spiritual man’s action and laughed out loud. He stopped his attack!<br/><br/>The old sword man also stopped his attack.<br/><br/>“Huh?”<br/><br/>Wang Xian looked at this scene and revealed a surprised expression.<br/><br/>Under his senses, the pinching of the spiritual man had abandoned his body. Half of his life force and soul were escaping into the distance.<br/><br/>“Don’t you need to leave behind his escaping life force and Soul?”<br/><br/>Wang Xian looked at song Ta and the rest and asked.<br/><br/>“Haha, brother Wang Xian, there’s no need.”<br/><br/>Song ta laughed in excitement. “This is a means of escape for the spiritual pinch man. Half of his life force and soul are escaping, leaving behind his body and the other half of his life force. If we stop his life force and soul from escaping, his body will explode.”<br/><br/>“When the time comes, our harvest will not be as good as one-tenth of what we have now.”<br/><br/>“Oh?”<br/><br/>Upon hearing his words, Wang Xian raised his eyebrows slightly and watched as the life force and soul of the spiritual kneader disappeared rapidly.<br/><br/>In the middle, there was a corpse.<br/><br/>Although the corpse still contained a huge amount of life force, it was already dead in reality.<br/><br/>It had already become an unconscious corpse!<br/><br/>“I really didn’t expect it to be so detailed!”<br/><br/>Old Man Jian looked at the corpse with a glint in his eyes.<br/><br/>“Brother Wang Xian, how about we divide this corpse according to merit and strength? “You were the one who discovered the spirit kneader and you were the first to suppress it. Furthermore, your strength is the strongest. You will take half and we will split the other half. What do you think?”<br/><br/>Song Ta looked at the corpse of the spirit kneader with a fiery gaze. He looked at Wang Xian and said!<br/><br/>“Of course!”<br/><br/>Wang Xian nodded and was in a great mood!<br/><br/>Without song Ta and Geezer Jian, it was impossible for him to make the spirit kneader leave a corpse here.<br/><br/>Although this was not a complete corpse of a great dao level powerhouse, it was equivalent to 70% of it!<br/><br/>The energy contained in it was of great benefit to experts like song TA and old man Jian.<br/><br/>In addition, he had left behind some treasures that had not been completely refined!<br/><br/>The items that could be placed on the body of a great dao level expert were naturally valuable!<br/><br/>This time, it was a huge gain for Wang Xian!<br/><br/>Wang Xian’s body moved and returned to his human form. He flew towards the corpse of the spiritual kneader.<br/><br/>Song Ta and old man Jian also flew over. They were preparing to split this treasure!\t\t\t\t\t\t</div>", "images": {}, "success": true}