{"id": 1306, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074950.html", "title": "Chapter 4309 - Chapter 4309: Creation 4308", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4309 - Chapter 4309: Creation 4308</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4309: Creation 4308<br/><br/>Translator: 549690339<br/><br/>Creation was very simple for an expert at Wang Xian’s level.<br/><br/>If they were willing, they could easily create a living being.<br/><br/>If Wang Xian was serious, he could even create a disciple at the Overlord level.<br/><br/>It would not be a big problem for him to attempt to create a peak race.<br/><br/>However, it was very easy to create a simple creation. It would not be so easy to create a special living being!<br/><br/>This was especially so for a creature that had ten attributes fused together.<br/><br/>Such a creature was an existence as strong as the spirit kneader. Experts at the Great Dao level focused on creating, but they still only created an existence at the divine emperor level.<br/><br/>It was impossible to create a supremacy level creature!<br/><br/>To create a creature, one had to consider the creature’s potential and lifespan.<br/><br/>For a creature with ten attributes fused together, survival and potential were a huge problem.<br/><br/>This was related to the repulsion and fusion of the attributes.<br/><br/>Wang Xian, a creature with nine attributes fused together, was completely an accident in the chaos.<br/><br/>Just like an lie, he was an existence that was difficult to replicate.<br/><br/>In the future, there would be repulsion and some fusion between attributes.<br/><br/>For the ten attributes, the problem of repulsion had to be solved first.<br/><br/>Otherwise, even if it was created, this creature would not be able to survive for long.<br/><br/>Wang Xian looked at the information recorded by the spirit kneader and understood it bit by bit.<br/><br/>Very soon, he realized that the early stage of creation was about the use of attributes. As for the aspect of flesh and blood, it was very simple for a heaven origin creator.<br/><br/>Even for the soul, it was also very simple.<br/><br/>The most important aspect was the attributes.<br/><br/>The strong absorption of attribute power represented a creature’s talent.<br/><br/>Of course, there was also the bloodline power.<br/><br/>The bloodline power was even simpler.<br/><br/>When the spirit kneader created a creature with ten attributes, the most difficult problem was the fusion of ten attributes.<br/><br/>He could achieve the fusion of five elements, wind and thunder, and yin and yang.<br/><br/>But he could not fuse the five elements, the wind and thunder, and the Yin and yang.<br/><br/>The power of space was fine, but space could contain everything. This was more of a fusion.<br/><br/>But he could not do the other fusion methods.<br/><br/>At the moment, he only used a special method to make the ten elemental creatures he created have ten attributes.<br/><br/>And this method was the blood vessel.<br/><br/>The spirit kneader had achieved the fusion of the five elements, wind, thunder, and Yin-yang power, but the final fusion could not be achieved.<br/><br/>So he separated these powers separately.<br/><br/>He made the five elements power stored in a blood vessel, wind, thunder power stored in a blood vessel, and yin-yang power stored in a blood vessel.<br/><br/>He made the body of this creature with the power of space.<br/><br/>The most important point was that it used a kind of chaos gem as a transit.<br/><br/>This Chaos Gem was obtained from the cross-shaped primordial spirit region.<br/><br/>This kind of Chaos Gem was also unique to the cross-shaped primordial spirit region.<br/><br/>It was called the cross-shaped chaos gem.<br/><br/>The cross-shaped chaos gem was a perfect fusion of ten types of energy.<br/><br/>The spirit kneader could not fuse ten types of attributes, so he used this chaos gem to place it into the body of a living creature as a transit.<br/><br/>The energy from the blood vessels entered the chaos gem one by one before it was transferred.<br/><br/>A living being with ten attributes had been created here.<br/><br/>However, this kind of living being had pseudo-ten attributes.<br/><br/>It had a huge flaw and had no potential.<br/><br/>Wang Xian moved his palm and took out the ten attributes living being created by the spirit kneader.<br/><br/>He took out the ten attributes of the chaos gem directly.<br/><br/>“If I can analyze the essence of this chaos gem, I might be able to create a perfect ten-elemental creature. However, it’s obvious that I can’t analyze this chaos gem!”<br/><br/>Wang Xian looked at the chaos gem and began to study the creature at the side.<br/><br/>Time passed little by little. Wang Xian was completely immersed in the research of this creature.<br/><br/>Ten million years, twenty million years…<br/><br/>50 million years passed very quickly. Wang Xian had studied everything thoroughly and had a new research according to his own situation!<br/><br/>At this moment, in front of him, there was a special divine dragon.<br/><br/>Nine-colored rays of light enveloped it. Its flesh and scales were emitting the power of space.<br/><br/>The aura of this special divine dragon had reached the combat strength of the peak of the universe dominator.<br/><br/>I’m still a little lacking. Using the power of my bloodline to create, I can indeed create creatures with nine attributes. In addition, I can transform my flesh and blood into flesh and blood condensed from the power of space<br/><br/>The power of space was the body, while the other nine attributes were the internal organs.<br/><br/>Wang Xian looked at the creature he created and mumbled.<br/><br/>This was the result of his 50 million years of effort.<br/><br/>Initially, Wang Xian created according to the idea of the spirit kneader. However, he could not solve one thing, which was the fusion of the nine attributes.<br/><br/>Even though Wang Xian had nine attributes, he still could not create a creature that was the same as him.<br/><br/>Subsequently, he changed his method and created the creature with his bloodline.<br/><br/>The creature created by his bloodline naturally had its own characteristics.<br/><br/>Hence, he created the divine dragon with the perfect fusion of nine attributes.<br/><br/>However, this was no longer a creation. More accurately, it was a clone of Wang Xian himself.<br/><br/>It was a forgery.<br/><br/>Apart from that, Wang Xian changed the body of the Divine Dragon that he created with the space attribute.<br/><br/>There was another problem in the process.<br/><br/>It was a problem of potential.<br/><br/>The body could be created, but the divine dragon that he created could not be upgraded.<br/><br/>This was because once he absorbed the nine attributes, it was possible for his body to explode.<br/><br/>Once he absorbed the space attribute, it was possible for him to suppress the nine attributes in his body.<br/><br/>In the end, this was not a complete creation.<br/><br/>“Fusing ten attributes is simply too difficult. It’s even impossible. I really don’t know how this Cross Chaos Gem was formed.”<br/><br/>Wang Xian shook his head. Looking at the results in front of him, a satisfied look appeared on his face.<br/><br/>Although he could not cultivate, the combat strength of the creatures created had reached the peak of the Overlord realm.<br/><br/>Such a creature with such strength entered the cross-shaped primordial spirit region. Although it could not be said to roam freely inside, it was still very safe as long as it did not encounter the whirlpool that he encountered last time.<br/><br/>There was another point. It was not difficult for Wang Xian to create such a creature now.<br/><br/>“Yes, yes. Let It enter the region of the primordial spirit of the cross. Perhaps I can obtain some treasures.”<br/><br/>Wang Xian’s eyes sparkled.<br/><br/>He moved his body and kept the divine dragon that he created. Then, he flew toward the region of the primordial spirit of the cross again.<br/><br/>Compared to the ten types of celestial emperor-level creatures created by the spirit kneader, Wang Xian was much more powerful.<br/><br/>It could be said that the ten types of celestial emperor-level creatures could only move one meter in a minute in the area of the cross primordial spirit.<br/><br/>However, the creatures created by Wang Xian could move around a hundred meters in a minute.<br/><br/>If they didn’t encounter any special circumstances, they could even search the entire area of the cross primordial spirit!\t\t\t\t\t\t</div>", "images": {}, "success": true}