{"id": 1305, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074946.html", "title": "Chapter 4308 - Chapter 4308: 4307 Spirit Kneading Method", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4308 - Chapter 4308: 4307 Spirit Kneading Method</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4308: 4307 spirit kneading method<br/><br/>Translator: 549690339<br/><br/>“Hehe, let’s see if there are any treasures in this dog’s corpse.”<br/><br/>Song Ta flew to Wang Xian’s side and said while staring at the corpse of the spirit kneading man with a fiery gaze!<br/><br/>“Search it!”<br/><br/>Wang Xian smiled. Under his sensing, he took out a spatial treasure from the spirit kneading man’s body.<br/><br/>Then, he opened it directly.<br/><br/>“Gan, there are so few treasures. There are only some fragments of the Elemental God. There isn’t even a heaven-origin creation-level treasure!”<br/><br/>Song Ta couldn’t help but Grumble as he sensed the treasures inside!<br/><br/>Wang Xian smiled. There were quite a number of treasures in the spiritual kneader’s storage space.<br/><br/>There were more than a dozen fragments of the Elemental God. Their value wasn’t low at all!<br/><br/>There was also a recording tablet. It contained some divine herbs and divine fruits that were extremely useful to powerhouses in the heaven-origin creation-level.<br/><br/>This was quite a lot of resources.<br/><br/>However, Wang Xian and the rest were of a high level. Therefore, these treasures were not of much use to them!<br/><br/>There were no unexpected surprises!<br/><br/>“Divide them according to their value.”<br/><br/>Wang Xian took out all the treasures and took out the recording tablet.<br/><br/>When he sensed the contents on the recording tablet, he narrowed his eyes slightly.<br/><br/>“This is the recording tablet of the spiritual kneader’s creation of creatures. There are records of his research on creatures with ten attributes on it!”<br/><br/>Wang Xian scanned through the huge amount of information on it and spoke to Old Man Song Pagoda Jian!<br/><br/>“Oh, is that so?”<br/><br/>Both Old Man Song Pagoda Jian and Old Man Song Pagoda Jian immediately looked over.<br/><br/>“The spiritual kneader’s specialty is to create powerful demonic spirits and powerful creatures. He once created a demonic spirit at the heaven’s fate level.”<br/><br/>Old Man sword said, “There is no record of him creating a demon spirit on this record tablet. There is only a record of him creating creatures.”<br/><br/>“The spirit kneader would not use a secret technique like creating a demon spirit on himself. I think he would imprint it in his mind. After all, this is his specialty. However, this guy’s method of creating creatures is also very powerful.”<br/><br/>Song ta nodded his head. “Let’s Make a copy of this information. Each of us will get a copy. On it, we will create creatures with ten attributes. It is used by this fellow to search for treasures in the cross primordial spirit region. To a certain extent, the effect is better than us fishing.”<br/><br/>Wang Xian nodded his head. He was also very curious about the method of creating creatures with ten attributes that the spirit kneader used.<br/><br/>He felt that this secret method should be of great benefit to him.<br/><br/>Following that, Wang Xian looked at the position of his right arm.<br/><br/>There was a creature hidden in his right arm.<br/><br/>It was a creature that looked like a giant python.<br/><br/>It was not dead yet. Instead, it was stored in his arm. The entire creature was very long.<br/><br/>However, it only had the combat strength of an Emperor God.<br/><br/>“I want to study the creature inside the corpse of the spiritual pinch man!”<br/><br/>Wang Xian spoke to Song Ta and Geezer Jian.<br/><br/>“No problem. It’s just a small toy.”<br/><br/>Geezer song ta and Geezer Jian nodded nonchalantly.<br/><br/>Following that, the three of them began to divide the corpse of the spiritual pinch man.<br/><br/>According to the distribution of energy, Wang Xian took up half of it while the other half belonged to Song Ta and Geezer Jian.<br/><br/>They also distributed the resources of the spirit kneader.<br/><br/>“I still have five pieces of the god of elements fragments here. I’ll take one away first. There’s also a fire attribute treasure.”<br/><br/>Song Ta took out the treasure that he obtained from the cross-shaped primordial spirit region and distributed it among them.<br/><br/>“The fire attribute treasure can be absorbed. It contains the good fortune of the fire attribute. There’s a high possibility that it can allow a ruler at the peak of the realm to touch the good fortune of the Tian Yuan realm. This fire attribute treasure is the most precious.”<br/><br/>Song Ta continued, holding the fire-type treasure, he said, “There are not many fire-type treasures in my disciple’s possession. If there is a need, the three of us will take out some elemental god fragments to exchange for them. If none of us want them, we will sell them at the market price.”<br/><br/>“I want them!”<br/><br/>Wang Xian looked at the fire-type energy gem. His eyes sparkled as he immediately bought it.<br/><br/>This fire elemental gemstone was worth a lot!<br/><br/>It was a great fortune for a fire elemental master!<br/><br/>At the moment, Wang Xian wanted to nurture some heaven origin powerhouses from the Dragon Palace. This gemstone was definitely a rare existence.<br/><br/>Its value was even higher than two to three pieces of the god of elements fragment!<br/><br/>One must know that the value of the god of elements fragment was not low.<br/><br/>They might have obtained five pieces easily.<br/><br/>However, this was due to the change in the riot zone and Song Ta had discovered it by accident.<br/><br/>In addition, in order to obtain these five pieces of God of elements fragments, three existences at the level of the Great Dao were mobilized.<br/><br/>This was especially so for Wang Xian, who was not an ordinary powerhouse at the level of the Great Dao.<br/><br/>“Haha, Good, good. We have a good cooperation this time!”<br/><br/>After the three of them shared all the resources, Song Ta said loudly happily.<br/><br/>Even the stern old sword who was in his sword form revealed a smile.<br/><br/>The gains this time far exceeded the gains they had made in the past 30 to 40 billion years!<br/><br/>“If there’s a chance, we can continue to work together!”<br/><br/>Wang Xian smiled and nodded his head. He was also very satisfied.<br/><br/>This half-corpse of a spiritual kneader was twice as much as what he had gained from hunting the space beasts in the universe.<br/><br/>“Haha, Alright, Alright. Brother Wang Xian, your strength is stronger than all of us. If there’s a chance, let’s work together!”<br/><br/>The joint battle had also brought their relationship closer.<br/><br/>“I’ll find a place to study something. We’ll contact each other if there’s anything!”<br/><br/>Wang Xian chatted with them for a while before leaving.<br/><br/>He was prepared to study some methods to create creatures with ten attributes.<br/><br/>He wanted to see if he could gain anything from it!<br/><br/>“He’s very strong. He’s an existence that has reached the level of two great daos. The energy in his body is also extremely abundant.”<br/><br/>Looking at the place where Wang Xian disappeared, song Ta’s eyes flickered as he spoke.<br/><br/>“His original form is not human. I wonder which universe he came from!”<br/><br/>Old Man Jian spoke, “There are still many strong beings in the Chaos!”<br/><br/>“HMM, there isn’t any strong killing intent from him. At the moment, he is still amiable!”<br/><br/>Song ta nodded his head.<br/><br/>At their level, there were some things that they had to pay attention to.<br/><br/>Wang Xian did not continue to stay at the location of the cross-shaped primordial spirit. Instead, he flew towards the back.<br/><br/>A few days later, he arrived at the path where there were no energy attacks. With a wave of his arm, a palace appeared there.<br/><br/>Wang Xian stepped into the palace.<br/><br/>It was easier for him to search for treasures in other places than in the region of the primordial spirit of the cross.<br/><br/>Therefore, Wang Xian did not plan to stay there any longer.<br/><br/>However, now that he had obtained the method to create ten types of elemental creatures, he could do some research.<br/><br/>If he could succeed in his research, Wang Xian could return to the region of the primordial spirit of the cross.<br/><br/>After all, the level of the treasures in the cross primordial spirit was the highest.<br/><br/>When he arrived at the palace, Wang Xian took out the recording tablet and read the records on it.<br/><br/>The records on the tablet were the research process, research plan, and research direction of the spirit kneader.<br/><br/>Wang Xian could totally conduct research based on the records on it.\t\t\t\t\t\t</div>", "images": {}, "success": true}