{"id": 1308, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074958.html", "title": "Chapter 4311 - Chapter 4311: 4310 Core Chaos Sphere", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4311 - Chapter 4311: 4310 Core Chaos Sphere</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4311: 4310 core chaos sphere<br/><br/>Translator: 549690339<br/><br/>Wang Xian had stayed in the area of the cross primordial spirit for a few years.<br/><br/>During these few years, he had searched the surroundings thoroughly.<br/><br/>He had even arrived in front of the god of elements a few times.<br/><br/>However, Wang Xian did not rashly approach the positions of the god of elements.<br/><br/>In these few years, he had reaped abnormally bountiful harvests.<br/><br/>Basically, he had already explored the periphery of the cross-shaped primordial spirit region.<br/><br/>He did not manage to get all the treasures.<br/><br/>In this region, there were more than a dozen areas where energy collided. There were also treasures such as the fragments of the god of elements in those areas. Moreover, there were quite a number of them.<br/><br/>However, these were not places that Wang Xian could approach.<br/><br/>As he was in a deeper position, Wang Xian could not approach them either.<br/><br/>However, he had gained a lot this time!<br/><br/>I have basically explored the outer perimeter. Should I go to the core to take a look<br/><br/>Wang Xian thought to himself.<br/><br/>The location of the core was extremely risky.<br/><br/>However, even if these ten elemental dragons were to die, the loss would not be too great<br/><br/>Wang Xian made a prompt decision and immediately controlled the ten elemental dragons to fly towards the core.<br/><br/>He approached it little by little to avoid some chaotic energy.<br/><br/>Very soon, an elemental god appeared in Wang Xian’s line of sight.<br/><br/>This was the elemental god of fire attribute which was emitting a huge amount of fire attribute energy.<br/><br/>Wang Xian could not get close to this elemental god. Once he got close to it, the blazing flames would burn it to ashes.<br/><br/>After deviating from the elemental god of fire attribute, Wang Xian continued to fly in.<br/><br/>“That’s the god of metal element over there.”<br/><br/>After avoiding the god of fire element, Wang Xian saw the god of metal element very quickly.<br/><br/>The two god of elements were not close to each other.<br/><br/>There were many terrifying impact zones in the middle of the two god of elements.<br/><br/>The energy there was not completely fused.<br/><br/>Flames and golden rays were extremely violent!<br/><br/>Wang Xian searched for a few days before he found a relatively safe place and continued flying forward.<br/><br/>After he passed through the area where the flames and golden rays were violent, he traveled for an hour.<br/><br/>The scene in front of him shocked him.<br/><br/>In front of him, there was an extremely calm sea surface.<br/><br/>Yes, it was very calm and quiet. There was no energy fluctuation at all!<br/><br/>The entire area, which was close to the Elemental God, was the color of the Elemental God.<br/><br/>It was like the red color of the flames and the gold color of the metal attribute.<br/><br/>The deeper one went, the grayish color of the chaos.<br/><br/>It was grayish, as if the apocalypse had not arrived yet. That grayish energy.<br/><br/>Wang Xian looked at it and his face was filled with astonishment.<br/><br/>He could vaguely see that the elemental gods in the distance were emitting a luster.<br/><br/>The ten elemental gods seemed to have completed a circle.<br/><br/>In front of him was the center of the circle. It was a peaceful area.<br/><br/>“What’s going on? Why is the center area so peaceful? Furthermore, it has formed a gray energy. This… ? ?”<br/><br/>“This gray energy seems to have completely fused the ten attributes together.”<br/><br/>Wang Xian thought to himself.<br/><br/>Although there were also ten different attributes mixed together in the location outside.<br/><br/>However, this kind of fusion was the kind where metal, wood, water, fire, and earth were separated.<br/><br/>Various attributes were interwoven together.<br/><br/>The location in front of him seemed to be more than just energy interweaving together. It seemed to be completely fused, forming a new type of energy.<br/><br/>Wang Xian pondered in his heart. After hesitating for a moment, he moved his body and continued flying in.<br/><br/>His speed was very slow. He was afraid that something unexpected would happen.<br/><br/>After flying for an hour, he finally arrived in front of the gray energy.<br/><br/>Wang Xian extended his Dragon Claw and entered the gray energy.<br/><br/>Buzz<br/><br/>A deathly stillness was felt. This feeling was somewhat similar.<br/><br/>“This? This is the feeling of entering the chaos before the Apocalypse.”<br/><br/>Wang Xian thought to himself.<br/><br/>The gray energy was filled with deathly stillness. He couldn’t absorb any energy from it.<br/><br/>Wang Xian extended his entire body into it.<br/><br/>This feeling was exactly the same as when he entered the chaos back then!<br/><br/>“What’s going on? Ten attributes fused together to form the deathly stillness energy of the Chaos?”<br/><br/>Wang Xian’s face was filled with astonishment.<br/><br/>He moved his body and entered the dead dead energy.<br/><br/>A powerhouse who was at the peak of the Dominator realm could enter this place.<br/><br/>It was just that he couldn’t live for too long!<br/><br/>However, there was no problem for him to survive for a few years.<br/><br/>Wang Xian entered the place and scanned his surroundings.<br/><br/>It was Gray and dead silent. There was no energy fluctuation at all.<br/><br/>There was nothing in there either.<br/><br/>He continued to fly deeper and deeper, wanting to explore this place.<br/><br/>Everything in the core was full of astonishment.<br/><br/>Could it be that the core of the cross-shaped primordial spirit region was like this?<br/><br/>He kept driving and driving.<br/><br/>Wang Xian felt that he had been driving for a very, very long time, but he still hadn’t reached the end.<br/><br/>This made him a little surprised.<br/><br/>What was going on?<br/><br/>For example, with the range of the ten elemental gods, he should have reached the end long ago and flown to the position of the other elemental god.<br/><br/>But Now?<br/><br/>Was it because of the spatial attribute of the elemental god that made this area look small, but there was a huge space inside?<br/><br/>Wang Xian guessed as he continued to fly in.<br/><br/>Following that, Wang Xian continued to fly forward.<br/><br/>Year after year passed. Just when Wang Xian thought he couldn’t fly to the end, something suddenly appeared in front of him. Wang Xian was shocked.<br/><br/>There, there was a ball in Wang Xian’s line of sight.<br/><br/>The ball was about 10 meters in size. It was filled with the aura of death and vitality.<br/><br/>This was a very peculiar feeling.<br/><br/>Death and vitality were contained on the same item at the same time.<br/><br/>Wang Xian’s eyes glowed as he flew over immediately.<br/><br/>To be able to exist in this space, it must be a rare and powerful treasure.<br/><br/>It might even be an existence on the level of the ultimate treasure of the Heaven’s origin.<br/><br/>Wang Xian approached the ball and came to a hundred meters away from it. He sized it up quietly.<br/><br/>“No matter what it is, I must get rid of it!”<br/><br/>Wang Xian couldn’t figure out what was going on. He went straight to the ball and prepared to take it away.<br/><br/>The Dragon Claw reached out and landed on it.<br/><br/>However, in the next moment, Wang Xian felt an extremely powerful devouring force.<br/><br/>This devouring force wanted to engulf him into the interior of the ball.<br/><br/>Wang Xian’s expression changed slightly and he hurriedly tried to defend himself.<br/><br/>However, the devouring force of this sphere was too terrifying. It was not something that he, who was at the peak of the Dominator realm, could withstand.<br/><br/>Buzz<br/><br/>In the next instant, Wang Xian felt his body being sucked into the sphere.<br/><br/>Following that, his consciousness was slowly absorbed by the sphere as though he had fused with it.<br/><br/>However, in less than two seconds, his consciousness was completely destroyed and he was dead!<br/><br/>Wang Xian, who was outside the cross primordial spirit region, sensed all of this and his gaze focused!\t\t\t\t\t\t</div>", "images": {}, "success": true}