{"id": 1307, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074954.html", "title": "Chapter 4310 - Chapter 4310: 4309 Entered The Region Of The Cross Primordial Spirit Once Again", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4310 - Chapter 4310: 4309 Entered The Region Of The Cross Primordial Spirit Once Again</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4310: 4309 entered the region of the cross primordial spirit once again<br/><br/>Translator: 549690339<br/><br/>Wang Xian flew and arrived at the region of the cross primordial spirit once again.<br/><br/>When he arrived at this region once again, he scanned his surroundings with a smile on his face.<br/><br/>The last time, Wang Xian could only stay in the region of the cross primordial spirit for two minutes even though he had ten attributes and a disguise.<br/><br/>Therefore, other than working with old man song Ta Jian, he did not gain anything.<br/><br/>This time, with the creation of the Divine Dragon with ten attributes, Wang Xian had a huge advantage in exploring the area!<br/><br/>In the area of the cross primordial spirit, regardless of whether it was anglers or creatures with ten attributes like the spirit kneader, it was very difficult to explore the area of the cross primordial spirit.<br/><br/>In the area of the other elemental gods, they could make the bait swim quickly.<br/><br/>However, the energy here was complicated. It was impossible to move quickly.<br/><br/>Wang Xian stared at the spot in front of him. He circulated the energy around his body and put on a disguise of ten attributes.<br/><br/>Following that, Wang Xian entered the area of the cross primordial spirit.<br/><br/>Buzz<br/><br/>The moment he entered, waves of erosive energy came over and melted Wang Xian’s disguise.<br/><br/>With a move of his palm, he released the Divine Dragon that he had created.<br/><br/>This divine dragon with ten attributes was similar to Wang Xian’s clone.<br/><br/>His consciousness also belonged to Wang Xian.<br/><br/>When the Divine Dragon appeared here, Wang Xian could feel that the surrounding energy with ten attributes did not attack the Divine Dragon.<br/><br/>This Divine Dragon clone with ten attributes seemed to be a part of this place.<br/><br/>In the region of the ten elemental gods, all the attributes were entangled together.<br/><br/>Wang Xian controlled this ten-attribute divine dragon avatar and continuously circulated the energy in his body.<br/><br/>In the Yin-yang five elemental wind and thunder space, all kinds of energy circulated around his body.<br/><br/>It was used to simulate the energy here so that he would not be attacked violently.<br/><br/>Entanglement and entanglement were the main theme of this place.<br/><br/>The energy that was entangled together no longer had a strong destructive force.<br/><br/>Of course, there were also places that had yet to form a balance, forming a special vortex and a special collision.<br/><br/>Wang Xian’s original body moved and flew to the position outside. After that, he focused his attention on his clone.<br/><br/>The ten-elemental divine dragon swayed his body and scanned his surroundings. Then, he began to move.<br/><br/>Although the ten-attribute divine dragon was slightly weaker here, he was at least at the peak of the Overlord realm.<br/><br/>It was still possible for him to traverse through the area and guide the energy in the surrounding one meter.<br/><br/>It was as though he had merged into the cross-shaped primordial spirit region. His pair of Yin-yang dragon eyes scanned his surroundings.<br/><br/>Search!<br/><br/>Wang Xian placed his target in the interior of the cross-shaped primordial spirit region.<br/><br/>The location inside was a place where even great dao-level powerhouses would find it difficult to enter.<br/><br/>Even if great dao-level powerhouses were fishing or were like the spirit kneader, it would be difficult for them to enter the depths.<br/><br/>They could only search at the edge of the cross-shaped primordial spirit region.<br/><br/>Now, Wang Xian was trying to wander into the depths.<br/><br/>The speed of the ten-attribute divine dragons inside was not fast, but it was not slow either. They could move a hundred meters per second.<br/><br/>After all, it was more dangerous here. If the speed was too fast, something might happen.<br/><br/>He moved and explored little by little.<br/><br/>Time passed day by day.<br/><br/>Buzz<br/><br/>Two days later, Wang Xian focused his gaze and stared at the spot in front of him.<br/><br/>In front of him, there was a resplendent primal chaos stone that was emitting a blue glow.<br/><br/>This primal chaos stone emitted an energy that made one’s heart palpitate. The energy of the ten attributes in the surroundings revolved around it continuously.<br/><br/>It floated there quietly and was very dazzling.<br/><br/>“This is?”<br/><br/>Wang Xian stared at this chaos gem and his eyes immediately lit up.<br/><br/>His body moved and he flew over immediately.<br/><br/>An extremely cold energy surged towards Wang Xian. When he got closer, he could even feel a bone-piercing coldness!<br/><br/>“Damn, the energy of this chaos gem can actually cause my body of ten attributes to collapse. This… ?”<br/><br/>Wang Xian looked at the chaos gem in shock.<br/><br/>This was a powerful treasure.<br/><br/>It was like an extremely cold ice cube.<br/><br/>A mutated water-type chaos gem should belong to the ice attribute.<br/><br/>It had already surpassed the boundary of the peak of the ruler realm and had reached the Heaven’s origin level.<br/><br/>The energy contained in this ice-type chaos gem was much more valuable than the elemental god and the fire-type gem that song Ta had obtained previously.<br/><br/>“As expected of the cross primordial spirit region, the core of the riot region!”<br/><br/>Wang Xian was a little excited. He extended his dragon claw and condensed ten types of elemental energy on it before wrapping it around the ice attribute gem.<br/><br/>When the energy wrapped around the GEM, the wrapping energy was slowly frozen and dissipated rapidly.<br/><br/>When Wang Xian saw this scene, his expression changed slightly. He hurriedly injected his energy and pulled the ice attribute gem towards the edge!<br/><br/>The ice-attributed gemstone corroded the entangled energy while Wang Xian’s ten-attributed divine dragon body continued to pour energy into it.<br/><br/>Even so, Wang Xian had to take a break after moving it for dozens of kilometers to recover his energy and continue to pull it!<br/><br/>It took him a full five hours to move it to the edge.<br/><br/>Buzz<br/><br/>Wang Xian’s original body jumped down and grabbed the ice-attributed gemstone.<br/><br/>It was a gemstone that even a master at the peak of the Dominator realm could not touch. One could imagine how powerful it was.<br/><br/>Wang Xian grabbed it in his hand and an icy force was transmitted.<br/><br/>“The icy force can be absorbed. It is a gemstone that can increase one’s strength. Furthermore, it contains various powers of the icy force. One can comprehend the powers within.”<br/><br/>Wang Xian’s eyes sparkled.<br/><br/>His disciple, bei Shuang, was the Frost Divine Dragon. Perhaps she could make use of this stone of ice to achieve a breakthrough in her strength!<br/><br/>Wang Xian’s heart was burning with passion.<br/><br/>Bei Shuang was a mutated divine dragon. A mutated divine dragon indeed had a huge advantage.<br/><br/>However, when one reached the peak of the Overlord realm, there was a huge flaw.<br/><br/>That was, the difficulty of breaking through to the Heaven’s origin realm was ten times that of an ordinary divine dragon.<br/><br/>This was because she did not know how to cultivate anymore. She did not know where to go.<br/><br/>Now that she had this gemstone, the chances of northern frost breaking through would increase by dozens of times.<br/><br/>After all, this gemstone was too precious. The energy it contained was too strong.<br/><br/>Moreover, if northern frost could break through, there was one benefit. It was that he could break through in the nine-origin universe.<br/><br/>Although there were nine slots in the nine-origin universe, anyone who could achieve a breakthrough with the wind and thunder attributes and the light and dark attributes could do so too.<br/><br/>“Not bad, not bad. I have gained so much in just two days. Let’s continue!”<br/><br/>Wang Xian was in a great mood. He controlled the Divine Dragon with ten attributes and flew into the nine-origin universe again.<br/><br/>For the next period of time, Wang Xian stayed there quietly.<br/><br/>Along with Wang Xian’s exploration, he obtained the god of elements fragments and gemstones one by one.<br/><br/>The energy of the god of elements lock fragments here was much higher than that of the god of light and dark elements fragments.<br/><br/>In just a few years, Wang Xian had obtained more than 30 god of elements fragments.<br/><br/>This was a huge number.<br/><br/>It was also a terrifying resource!\t\t\t\t\t\t</div>", "images": {}, "success": true}