{"id": 1302, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074934.html", "title": "Chapter 4305 - Chapter 4305: If 4304 Encountered The Figure In The Bamboo Hat Again, He Would Kill Him Immediately!", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4305 - Chapter 4305: If 4304 Encountered The Figure In The Bamboo Hat Again, He Would Kill Him Immediately!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4305: If 4304 encountered the figure in the bamboo hat again, he would kill him immediately!<br/><br/>Translator: 549690339<br/><br/>Buzz<br/><br/>Wang Xian entered the area where song Ta was pointing at and entered the area of the cross-shaped primordial spirit.<br/><br/>He didn’t go deep for long when he saw a special vortex not far away.<br/><br/>It was a vortex located in the area of the cross-shaped primordial spirit.<br/><br/>The vortex was spinning crazily.<br/><br/>In the center of the vortex were five pieces of the god of elements fragments and treasures that were unknown for a year.<br/><br/>It was unknown whether the fire attribute gemstones could be absorbed or forged into weapons.<br/><br/>However, just the five fragments of the Elemental God made Wang Xian’s eyes freeze.<br/><br/>The fragments of the five elemental gods were much larger than the ones he had obtained before.<br/><br/>Furthermore, the energy contained in them was even more terrifying!<br/><br/>He scanned his surroundings and flew out when he sensed that his defense was being destroyed crazily!<br/><br/>“What do you think, brother Wang Xian?”<br/><br/>Song Ta looked at him and asked.<br/><br/>“Five pieces of the god of elements fragment and one fire-type treasure. It’s extremely precious.”<br/><br/>Wang Xian nodded his head.<br/><br/>“Hehe, alright. Let’s talk about the distribution of the treasures first. As the discoverer, I will take one more piece of the god of elements fragment. We will split the rest equally!”<br/><br/>Song ta smiled and nodded his head!<br/><br/>“Alright!”<br/><br/>Wang Xian and Geezer Jian nodded.<br/><br/>As the discoverer, song ta naturally had to obtain more!<br/><br/>“Alright. The attack power of the vortex is very strong. I Won’t be able to last long in there. However, I have a treasure that can store energy for a short period of time. All of you need to channel your defensive means into the treasure. I will bring this treasure with me and go down to get all the fragments of the god of elements!”<br/><br/>Song Ta continued speaking to Wang Xian and the rest!<br/><br/>With a move of his palm, a black shirt appeared on his body.<br/><br/>The shirt was extremely deep, as though it contained an abyss!<br/><br/>Wang Xian looked over and nodded his head slightly. “No Problem!”<br/><br/>“Alright, let’s begin then. I need all of you to input a powerful defensive technique. Otherwise, I won’t be able to pass through that Vortex!”<br/><br/>Song TA reminded them!<br/><br/>Wang Xian and the rest nodded.<br/><br/>With a move of his palm, a powerful defensive energy shield appeared in front of Song Ta. Under his instructions, he transferred the defensive energy shield into his special clothes!<br/><br/>Following that, Wang Xian consecutively released a large amount of defensive energy shield into the black clothes!<br/><br/>Old Man Jian also laid down a series of defensive means and inserted them into the black clothes.<br/><br/>Twenty minutes later, Wang Xian and the rest stopped.<br/><br/>This set of clothes could store defensive and offensive measures. However, the storage time was very short. They had to enter the area now.<br/><br/>“I’ll enter the area first. Geezer Jian, brother Wang Xian, wait for Me Here!”<br/><br/>Song Ta wrapped his black clothes and said to them!<br/><br/>“Be careful!”<br/><br/>Wang Xian and Geezer Jian reminded song ta.<br/><br/>Song ta nodded and flew down.<br/><br/>Boom! Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>After song TA entered the bottom for more than ten seconds, a violent sound suddenly came from below.<br/><br/>An extremely terrifying power came from below!<br/><br/>When Wang Xian and Geezer Jian saw this scene, they raised their eyebrows slightly.<br/><br/>Song Ta should be fighting against the vortex now.<br/><br/>The power of the fight caused an energy riot from below!<br/><br/>The terrifying rumbling continued for dozens of seconds and it wasn’t over yet. This made Wang Xian, Geezer Jian, and the rest of them look solemn!<br/><br/>“Brother Wang Xian, I’ll go down and take a look. You can wait for us outside.”<br/><br/>Geezer Jian said to Wang Xian.<br/><br/>“Alright, you go and wait for Brother Song Ta. See if there’s an accident!”<br/><br/>Wang Xian nodded and replied to old man Jian.<br/><br/>Old Man Jian moved his body and entered directly!<br/><br/>When he had just entered the inner area of the cross-shaped primordial spirit.<br/><br/>Wang Xian suddenly had a thought and looked to the right!<br/><br/>On the right, a figure wearing a bamboo hat with his arms tucked under a wide black robe was flying over quickly.<br/><br/>Clearly, he was attracted by the commotion over here!<br/><br/>When Wang Xian saw this figure, he raised his eyebrows slightly. His gaze swept down and landed on him again!<br/><br/>The figure wearing a bamboo hat had a blood-red glow in his eyes.<br/><br/>He also saw Wang Xian. After sizing him up, his blood-red gaze turned towards the direction where the commotion was coming from!<br/><br/>A second later, the blood-red light in his pupils started to throb. His figure approached again!<br/><br/>“Scram!”<br/><br/>Wang Xian stared at the figure wearing the bamboo hat and spat out a word coldly.<br/><br/>Wang Xian did not have a good impression of this fellow.<br/><br/>When he approached the figure wearing the bamboo hat, the figure berated him.<br/><br/>Wang Xian could understand that he had entered the other party’s territory.<br/><br/>But now, he had entered his territory as well.<br/><br/>No matter how the other party treated him, he would not give him a good look!<br/><br/>As soon as Wang Xian finished his sentence, the figure with the bamboo hat narrowed his eyes slightly and stood there without moving!<br/><br/>Wang Xian slowly faced him with killing intent in his eyes!<br/><br/>The figure with the bamboo hat still stood there and did not retreat!<br/><br/>“Very good!”<br/><br/>Wang Xian laughed.<br/><br/>Boom<br/><br/>Roar! Roar<br/><br/>In the next moment, he did not hesitate and transformed into the body of a divine dragon.<br/><br/>“Bastard, if you don’t get out of my range, you will die!”<br/><br/>Wang Xian let out a furious roar filled with killing intent as he swayed his huge body.<br/><br/>He did not hold back at all. All the energy in his body was activated. The Taichi Dragon Disc, the body of the Void Divine Dragon, and the Void Dragon Pool were all activated!<br/><br/>The nine-colored light around Wang Xian’s body began to revolve. Finally, it formed a terrifying energy that surged toward his head.<br/><br/>He opened his dragon mouth and an extremely terrifying sword of light surged toward the old man with the bamboo hat.<br/><br/>Around the sword of light, there was also a powerful spatial force.<br/><br/>This sword of light was comparable to the sword of light that was at the initial stage of the Heaven’s origin creation realm.<br/><br/>Wang Xian called it the Light Dragon Sword!<br/><br/>The power of the Light Dragon Sword carried all the power in Wang Xian’s body.<br/><br/>This was an attack that belonged to two great dao levels. It went straight for the figure with the bamboo hat!<br/><br/>The speed was terrifying and the power was fierce. The eyes of the figure with the bamboo hat narrowed slightly!<br/><br/>He quickly dodged to the side!<br/><br/>Buzz! Buzz! Buzz<br/><br/>Buzz! Buzz! Buzz<br/><br/>When he dodged, Wang Xian locked onto him completely and charged over again!<br/><br/>His speed was equally terrifying!<br/><br/>The figure wearing the bamboo hat waved his arm, and a huge dark flag appeared in front of him.<br/><br/>The figure of a terrifying monster appeared on the flag, and it covered a large area of Wang Xian.<br/><br/>It covered the entire void!<br/><br/>“Bang!”<br/><br/>At this moment, the sword of light was still locked onto the figure with the bamboo hat under Wang Xian’s control.<br/><br/>It directly penetrated the terrifying demonic beast that flew out from the flag!<br/><br/>“Crack! Crack!”<br/><br/>“Let’s bathe in the Divine Dragon Lightning!”<br/><br/>The energy in Wang Xian’s body circulated crazily once again and transformed into the power of lightning, bathing the entire space in the Lightning!<br/><br/>One killer move after another!\t\t\t\t\t\t</div>", "images": {}, "success": true}