{"id": 1309, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074962.html", "title": "Chapter 4312 - Chapter 4312: 4311 Spirit Kneader’S Revenge", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4312 - Chapter 4312: 4311 Spirit Kneader’S Revenge</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4312: 4311 spirit kneader’s revenge<br/><br/>Translator: 549690339<br/><br/>Terrifying!<br/><br/>A terrifying feeling spread throughout Wang Xian’s entire body.<br/><br/>When the Divine Dragon of the ten attributes was strangely devoured and died, Wang Xian felt a faint palpitation in his heart.<br/><br/>It was as if he was completely devoured.<br/><br/>This feeling made him feel hopeless.<br/><br/>“What grade is this treasure? What is its use?”<br/><br/>Wang Xian revealed a look of astonishment.<br/><br/>It was a treasure that existed at the core of the cross primordial spirit region.<br/><br/>A ball at the center of the ten elemental gods.<br/><br/>This was definitely an extremely powerful treasure.<br/><br/>As he thought to himself, his eyes sparkled.<br/><br/>Looking at the cross primordial spirit region in front of him, Wang Xian was a little tempted.<br/><br/>He estimated that the value of that ball should be more than a heaven origin treasure.<br/><br/>“The possibility is very high.”<br/><br/>Wang Xian mumbled.<br/><br/>However, that place was too far away. Although the Divine Dragons with ten attributes could approach it, they could not subdue it.<br/><br/>Perhaps only Wang Xian himself could enter that place and obtain it.<br/><br/>However, it was simply impossible for Wang Xian to enter it himself.<br/><br/>“Unless I can transform myself into a divine dragon with ten attributes.”<br/><br/>Wang Xian thought to himself.<br/><br/>This was not impossible.<br/><br/>However, the risk of transforming himself was too great!<br/><br/>Furthermore, the pain he would have to endure would be extremely terrifying.<br/><br/>He had to transform himself into one with ten different attributes.<br/><br/>Firstly, he had to balance the energy of the ten different attributes in his body.<br/><br/>In other words, the energy would be equally powerful!<br/><br/>Under such circumstances, he would need to remove the external items such as the Tai Chi Dragon coiling divine sword, the Void Dragon Pool, and the ancestral tree.<br/><br/>After removing these external items, Wang Xian’s combat strength would be reduced by six people who had just entered the initial stage of the Heaven’s origin creation.<br/><br/>In other words, it was equivalent to the strength of twelve people who had just entered the initial stage of the Heaven’s origin creation.<br/><br/>Excluding the enhancement of the space attribute, Wang Xian’s nine attributes had already reached a balance. However, the space attribute was still a little stronger.<br/><br/>This required Wang Xian to weaken the energy of the Void Dragon’s body.<br/><br/>It was equivalent to crippling his martial arts and lowering the level of the Void Dragon.<br/><br/>There was another point. He had to rebuild his dragon body.<br/><br/>Wang Xian’s dragon body had flesh and blood. It was a fusion of nine attributes.<br/><br/>If he were to transform himself into ten attributes, he would need to tear his flesh and turn the Void Dragon into his own flesh and blood.<br/><br/>This way, with the space attribute as the shell and the other nine attributes as the internal organs, the ten attributes could be completely fused.<br/><br/>As for the benefits of the fusion, apart from being able to enter the region of the cross primordial spirit, there were no other benefits.<br/><br/>On the contrary, there were disadvantages.<br/><br/>On the contrary, his strength would be reduced. This was not worth it.<br/><br/>Another important point was that Wang Xian did not know if he could still cultivate after transforming himself.<br/><br/>This was very important.<br/><br/>“There’s another way!”<br/><br/>Wang Xian stood there and said, “There’s another way. It’s to temporarily transform your body into ten different attributes. After that, you can commit suicide and revive without any injuries through the mother’s womb fruit.”<br/><br/>This was indeed a method. If that treasure was really precious, Wang Xian could consider sacrificing one mother’s womb fruit.<br/><br/>Now, eight mother’s womb fruits had matured. He gave Xiao Lan One, the unicorn ox one, the heaven-bestowed one, and five more.<br/><br/>However, before that, I have to find out whether that item is a powerful treasure or not. Can I get it away<br/><br/>Wang Xian made up his mind and began to create a divine dragon with ten attributes.<br/><br/>He let Xiao Lan continue to explore the interior.<br/><br/>He had to check the sphere.<br/><br/>After all, the mother’s womb fruit was too precious. One fruit was less than one fruit.<br/><br/>Time passed little by little. The second divine dragon with ten attributes was being created little by little.<br/><br/>However, when Wang Xian was creating the second divine dragon, it was located in the region of the cross-shaped primordial spirit. One was wearing a bamboo hat while the other had an illusory black body.<br/><br/>A figure with two antennae on his head and no eyes or nose came here.<br/><br/>These three figures had a terrifying aura.<br/><br/>There was no doubt that there would be no weaklings who could enter this region.<br/><br/>It wouldn’t be anyone below the level of the Great Dao.<br/><br/>“Heaven’s duty, did you sense that fellow?”<br/><br/>The one wearing the black bamboo hat was naturally the spirit kneader.<br/><br/>Ever since he was besieged by Wang Xian and the rest, the spirit kneader had abandoned half of his body and lost the treasures in his body.<br/><br/>This made him extremely furious.<br/><br/>While he was recuperating, he used all his strength to check the information of the person who claimed to be the Dragon King.<br/><br/>In the end, according to the information he received, the Justice Sequence Alliance did not have this powerhouse.<br/><br/>And based on his understanding of the song Pagoda Sword Old Man, that Dragon King should have appeared recently.<br/><br/>In other words, he was not a powerful expert of the Justice Sequence Alliance.<br/><br/>However, he did not care whether the other party was from the Justice Sequence Alliance or not.<br/><br/>How could he be willing to accept the fact that he had been harmed so badly by him?<br/><br/>He had fought with the powerful experts of the Justice Sequence Alliance for so long, but he had never been so miserable?<br/><br/>He had to take revenge.<br/><br/>But it was easier said than done to take revenge on such experts.<br/><br/>However, he still found two experts.<br/><br/>By sensing the condition of his flesh and blood, he could lock onto the location of his target.<br/><br/>Since he had given up his body, he would be divided among the three of them.<br/><br/>He found a seer of the evil sequence alliance, an existence of the same level as the Great Dao, the divine duty, to help him lock onto the location of his body.<br/><br/>As long as he could lock onto it, it would definitely be in the hands of his enemy.<br/><br/>“I’ve sensed the location of your body. I wonder if it’s the Dragon King You’re looking for.”<br/><br/>With antennae on top of his head and no Face, Heaven’s duty spoke out.<br/><br/>“Those three fellows will definitely split my body. Song Ta and that demonic sword are basically together. Have you only sensed one now? That guy might be the only one for a long time!”<br/><br/>The spirit kneader’s eyes were filled with ruthlessness as he analyzed!<br/><br/>“Spirit kneader, according to what you said, that Dragon King’s strength is comparable to two great dao realm experts. If we want to kill him, I’m afraid it won’t be easy. The possibility of him escaping is very high!”<br/><br/>Tian Ji said.<br/><br/>“Hehe, that’s why I called the illusory realm brother over. When the time comes, we just need to send him directly into the cross-yuan Shen region. He won’t be able to come out!”<br/><br/>The spirit kneader sneered and said!<br/><br/>“The illusionary realm plus his weapon, coupled with my prophecy, can indeed work.”<br/><br/>Tian Ji nodded.<br/><br/>“Tian Ji, you lead the way, causing me to lose so much. I want his life. After killing him, you can trace back to the universe he’s in.”<br/><br/>The spirit kneader said with a face full of killing intent!<br/><br/>Tian Ji nodded, and very quickly looked in a direction, flying straight over.<br/><br/>The Spirit KNEADER and the other expert immediately followed.<br/><br/>After flying for five days, Tian Ji waved his hand and pointed ahead!<br/><br/>“Even though we can’t see or sense anything, it’s just ahead. We can sense it within ten breaths, and the other party can sense us as well!”<br/><br/>Tian Ji said!\t\t\t\t\t\t</div>", "images": {}, "success": true}