{"id": 1311, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074970.html", "title": "Chapter 4314 - Chapter 4314: Danger 4313, Transforming His Body", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4314 - Chapter 4314: Danger 4313, Transforming His Body</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4314: Danger 4313, transforming his body<br/><br/>Translator: 549690339<br/><br/>“He’s moving, at this position!”<br/><br/>When Wang Xian was shuttling through the region of the cross primordial spirit.<br/><br/>At the position above, the heaven’s duty tentacle emitted a luster as it spoke to the spirit kneader and the illusory realm.<br/><br/>When the spirit kneader and the rest heard the words of Heaven’s duty, their bodies moved and they flew towards a certain location.<br/><br/>At the position below, Wang Xian immediately changed his position after performing a divination through the divination lamp.<br/><br/>The spirit kneader and the rest had sent him into the region of the primordial spirit cross. It was obvious that they were going to deal a fatal blow the moment he came out.<br/><br/>This was because it was extremely difficult for Wang Xian to dodge from the region of the Primordial Spirit Cross.<br/><br/>Therefore, this blow was almost guaranteed to hit him.<br/><br/>It could cause him to be severely injured in an instant!<br/><br/>It would be difficult for him to escape after being severely injured.<br/><br/>Therefore, Wang Xian changed his location and flew out!<br/><br/>When Wang Xian flew in the area of the cross-shaped primordial spirit for more than 20 seconds, he stopped.<br/><br/>In the area of the cross-shaped primordial spirit, he couldn’t sense the situation outside. Similarly, the spirit kneader outside couldn’t sense him inside either.<br/><br/>However, Wang Xian still used the divination lamp to perform divination again in order to be careful.<br/><br/>However, what made Wang Xian frown was that the divination lamp showed that he would still be attacked by a powerful force.<br/><br/>“HMM? What’s going on? I will still be attacked if I leave this place?”<br/><br/>Wang Xian’s expression changed slightly. He moved his body and traveled for 30 seconds.<br/><br/>He could only stay in the cross-shaped primordial spirit region for two minutes.<br/><br/>After two minutes, Wang Xian would be attacked by a terrifying force!<br/><br/>He wouldn’t be able to withstand such an attack for long!<br/><br/>Buzz<br/><br/>After Wang Xian flew for 30 seconds, he took out the divination lamp and continued to perform divination.<br/><br/>However, the result of the divination was that he would still be attacked.<br/><br/>This made Wang Xian frown.<br/><br/>“They sent themselves into the region of the cross-shaped primordial spirit because they could lock onto themselves. Things are getting worse!”<br/><br/>Wang Xian’s expression changed slightly!<br/><br/>The spirit kneader and the rest wanted to kill him.<br/><br/>Now, he had a lot of treasures in his hands.<br/><br/>Especially the body of the spirit kneader. It was extremely valuable.<br/><br/>If he were to die, these treasures would be gone too.<br/><br/>This was something that Wang Xian found hard to accept!<br/><br/>This place was too far away from the nine-origin universe. Furthermore, there was the energy interference from the region of the cross-shaped primordial spirit.<br/><br/>He could not contact an lie at all!<br/><br/>Wang Xian kept thinking in his mind. He flew in another direction for more than ten seconds!<br/><br/>Following that, his body moved and he flew out directly!<br/><br/>His flying speed was very slow. He carefully poked his head out!<br/><br/>“Dragon King, you want to escape? impossible. Today, I will bury you here. TSK TSK TSK, I will make you pay ten times the price!”<br/><br/>Just as he stuck his head out, three extremely terrifying attacks came at him.<br/><br/>When Wang Xian saw this scene, his expression changed drastically. He immediately entered the cross-shaped primordial spirit region!<br/><br/>Boom<br/><br/>A tremor came from above!<br/><br/>Wang Xian’s expression was a little ugly!<br/><br/>“D * mn it, he has forced himself into a desperate situation!”<br/><br/>As Wang Xian spoke, his mind was spinning non-stop!<br/><br/>Now, there was only one way!<br/><br/>“That Dragon King has entered the region of the primordial spirit of the cross. He should be able to guess that we can ambush him from the outside!”<br/><br/>Tian dui spoke when he saw Wang Xian entering the region of the primordial spirit of the Cross!<br/><br/>“This fellow probably doesn’t want to leave his corpse to us!”<br/><br/>The illusory realm looked on and spoke as well!<br/><br/>Wang Xian entered the region of the cross primordial spirit once again and didn’t come out. This seemed very normal to them.<br/><br/>This was because if he died in the region of the cross primordial spirit, at least his body and the treasures in his body couldn’t be obtained by the enemy.<br/><br/>If it were them, they would do the same!<br/><br/>“Keke, in order to prevent any accidents, we have been guarding here for a period of time!”<br/><br/>The Spirit Kneader spoke steadily!<br/><br/>He wanted to ensure that the dragon king was completely killed so that he could take revenge.<br/><br/>“Ah!”<br/><br/>At the same time, Wang Xian let out a painful scream in the area of the cross-shaped primordial spirit!<br/><br/>Want to kill him?<br/><br/>It wouldn’t be that easy?<br/><br/>Wang Xian wouldn’t die if he were to knead in the area of the cross-shaped primordial spirit.<br/><br/>He could turn himself into a ten-attribute state.<br/><br/>Although he had been hesitating about this matter and had not prepared for it.<br/><br/>At this moment, Wang Xian had no choice but to take this step!<br/><br/>He would forge himself into a state with ten attributes to escape this crisis.<br/><br/>Then, he would call an lie over and take away all the treasures in his hands.<br/><br/>After that, he would enter the core of the cross primordial spirit!<br/><br/>With this thought in mind, Wang Xian began to tear apart his physical body.<br/><br/>Now, he couldn’t hold on for much longer. He had to act as soon as possible!<br/><br/>Tearing apart his flesh and blood piece by piece was an extremely painful thing!<br/><br/>It wasn’t just a matter of flesh and blood. He wanted to tear apart his body of the Void Dragon God.<br/><br/>The energy contained in the body of the Void Dragon God was much more than that of the other attributes!<br/><br/>“Time is running out!”<br/><br/>Wang Xian could feel the surrounding energy attacking him.<br/><br/>He had to resist it all the time.<br/><br/>At this moment, he had to modify his body. It was too late for him!<br/><br/>“Damn it, I can’t do it at all!”<br/><br/>“I don’t have enough time!”<br/><br/>Although Wang Xian had some confidence in modifying his body, he couldn’t withstand the attack of the surrounding energy in such a short period of time!<br/><br/>He gritted his teeth and took out a fruit.<br/><br/>This was a wood-attributed fruit that contained a huge amount of vitality!<br/><br/>This was a burning fruit.<br/><br/>It was a fruit that was born from the heaven-bestowed ultimate treasure of the Heaven’s origin.<br/><br/>There were only eight fruits in total, and heaven-bestowed one to him!<br/><br/>The burning fruit could turn his surroundings into a forest.<br/><br/>In this forest, all the trees could provide Wang Xian with a huge amount of vitality.<br/><br/>As long as the forest was not destroyed, he would not die.<br/><br/>During this period of time, any injuries that he suffered could be healed quickly!<br/><br/>At this moment, Wang Xian could only take out the burning fruit!<br/><br/>He could use the burning fruit to support himself for a while.<br/><br/>Buzz<br/><br/>He swallowed the burning fruit directly into his stomach. At the position around him, trees were formed one by one.<br/><br/>These trees helped him withstand the attacks of the Elemental God’s energy!<br/><br/>He seized this time to quickly transform his body and tear it apart.<br/><br/>The spatial attribute had the strongest wrapping effect, so he used space as his body.<br/><br/>He used the other nine attributes as his internal organs!<br/><br/>This was the result of the research of the spirit kneader!<br/><br/>Now, Wang Xian was using it on his body!<br/><br/>Intense pain was felt. Fortunately, he had the energy from burning the fruit, which reduced his pain by a lot.<br/><br/>“Burning the fruit can last for one minute.”<br/><br/>Wang Xian had a feeling in his heart. He quickly brought his body to a balanced state!<br/><br/>His flesh and blood flowed into the surroundings and was quickly melted by the surrounding energy.<br/><br/>Wang Xian’s transformation was also carried out quickly!\t\t\t\t\t\t</div>", "images": {}, "success": true}