{"id": 1316, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074990.html", "title": "Chapter 4319 - Chapter 4319: 4318 Primal Chaos Stone, Controlling Time!", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4319 - Chapter 4319: 4318 Primal Chaos Stone, Controlling Time!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4319: 4318 Primal Chaos Stone, controlling time!<br/><br/>Translator: 549690339<br/><br/>The ball had lost the palpitating energy from before.<br/><br/>It looked much calmer now.<br/><br/>Wang Xian’s soul fragment stood in front of the ball and sized it up curiously.<br/><br/>“Let’s see if I can get it away.”<br/><br/>Wang Xian decided to study the ball carefully.<br/><br/>The loss this time was too great. He had to retrieve it from the ball.<br/><br/>Otherwise, he would suffer a huge loss!<br/><br/>Wang Xian’s soul fragment stretched out his arm and wrapped around the round ball.<br/><br/>Buzz<br/><br/>To his surprise, this round ball could move him easily.<br/><br/>This surprised Wang Xian.<br/><br/>“Prepare for research!”<br/><br/>Wang Xian thought to himself.<br/><br/>A portion of the soul in the tree of Chaos returned to the Dragon Palace.<br/><br/>Following that, Wang Xian arrived at the ancestral tree and entered a mother’s womb fruit.<br/><br/>There were eight mother’s womb fruits that were originally ripe. Now, there were only two left.<br/><br/>The other three were drained of their energy and withered.<br/><br/>After entering the mother’s womb fruit, Wang Xian’s body slowly condensed.<br/><br/>Gradually, his body recovered completely, including the body of the Void Dragon God.<br/><br/>“I used up four maternal fruits in one go.”<br/><br/>Wang Xian felt his heart ache. He moved his body and arrived at the location of the tree of chaos once again.<br/><br/>Following that, he flew into the distance again.<br/><br/>This round ball was a little strange and powerful. If Wang Xian wanted to study him, he naturally had to find a safe place.<br/><br/>In order to prevent any accidents from happening.<br/><br/>After flying into the chaotic void, Wang Xian’s mind stirred.<br/><br/>The current him had a passageway with the sphere.<br/><br/>Wang Xian’s soul fragment, which was beside the sphere, pulled the sphere and flew into the passageway.<br/><br/>Crack! Crack<br/><br/>When he flew over with the sphere, Wang Xian could see that the passageway had started to collapse again.<br/><br/>Following that, a sphere appeared in front of him.<br/><br/>When the sphere arrived in front of Wang Xian, it seemed that there was no longer any danger.<br/><br/>He sized up the ball that had cost him a lot. His eyes sparkled.<br/><br/>Wang Xian stretched out his hand and injected a surge of energy into the ball. The ball did not react at all.<br/><br/>This made him raise his eyebrows.<br/><br/>“It’s not absorbing energy anymore. It seems that it’s completely saturated. What is the use of this ball absorbing so much energy?”<br/><br/>Wang Xian said as he got closer. He studied it carefully, wanting to analyze it thoroughly.<br/><br/>However, even with Wang Xian’s powerful strength, he couldn’t see through this ball.<br/><br/>“What is this thing? If I didn’t see its power before, I would have thought that this is an ordinary chaos stone.”<br/><br/>Wang Xian frowned.<br/><br/>He pondered for more than ten minutes before a thought came to his mind!<br/><br/>Wang Xian spat out a mouthful of blood. Following that, the energy enveloped the ball and he was prepared to refine it.<br/><br/>He was prepared to use the method of refining the treasure to refine this ball.<br/><br/>Buzz<br/><br/>However, in the next moment, it had a huge effect.<br/><br/>When Wang Xian’s spirit and blood landed on the ball, a stream of information appeared in Wang Xian’s mind.<br/><br/>Following that, an image appeared in Wang Xian’s mind.<br/><br/>The image was extremely shocking. It was as though the world had been split apart!<br/><br/>In his mind, a sphere was suspended in the dead silence of the Void. Suddenly, the entire sphere exploded and was divided into ten pieces.<br/><br/>Each piece contained a type of elemental energy.<br/><br/>This was metal, wood, water, fire, Earth, wind, lightning, light, darkness, and space.<br/><br/>The ten pieces of energy were suspended in the void and began to collide with each other.<br/><br/>The collision of the ten elemental energies caused various scenes to appear in the surrounding void!<br/><br/>Following that, some special energies were born around the ten elemental energy stones.<br/><br/>Various attributes were also born around them.<br/><br/>For example, rocks, trees, meteorites, Frost, and all sorts of special items.<br/><br/>Following the continuous attacks of the ten elemental energy stones, all sorts of items appeared.<br/><br/>There were even planets being born.<br/><br/>This seemed to be the beginning of the world.<br/><br/>Wang Xian looked at the scene in his mind and his face was filled with shock.<br/><br/>The ball exploded and was categorized into ten attributes. When the ten attributes collided, the universe was transformed into a galaxy.<br/><br/>This? ? ?<br/><br/>“Primal Chaos Stone!”<br/><br/>Finally, a piece of information appeared in Wang Xian’s mind.<br/><br/>Primal Chaos Stone. This was the name of the ball.<br/><br/>Buzz Buzz<br/><br/>At this moment, the primal chaos stone trembled slightly and flew directly into Wang Xian’s body.<br/><br/>Wang Xian did not panic at all as he watched.<br/><br/>The Primal Chaos Stone had been refined by him initially.<br/><br/>When the primal Chaos Stone entered his body, it did not shrink to a certain part of his body.<br/><br/>Instead, it completely fused with Wang Xian’s body.<br/><br/>However, Wang Xian could feel that this fusion was not a perfect fusion.<br/><br/>It seemed to have only fused with one-ten-thousandth of his body.<br/><br/>“Ding, a powerful energy has been detected fusing with the host. The fusion rate is one-ten-thousandth!”<br/><br/>At this moment, the voice of the Divine Dragon System rang out once again, causing Wang Xian’s eyes to flicker slightly.<br/><br/>The Primal Chaos Stone disappeared and fused with Wang Xian.<br/><br/>He floated there quietly and felt the changes in his body.<br/><br/>When the primal Chaos Stone entered his body, it did not increase Wang Xian’s strength significantly.<br/><br/>This was because Wang Xian was not able to completely control the primal chaos stone.<br/><br/>He was only able to fuse with one-thousandth of it.<br/><br/>However, after fusing with one-thousandth of it, Wang Xian had a hint of control over the primal chaos stone.<br/><br/>With a move of his palm, the primal chaos stone appeared in front of him once again.<br/><br/>Wang Xian stared at the primal chaos stone with his mind. The Primal Chaos Stone opened an entrance that allowed people to enter.<br/><br/>Wang Xian’s body of the Void Divine Dragon was separated from his body and entered the stone directly.<br/><br/>After entering the primal chaos stone that was only ten meters in size, the space inside was extremely huge. It was even boundless.<br/><br/>Wang Xian sensed it quietly. With a move of his palm, he took out a piece of the god of elements fragment and threw it into the hands of the Void Divine Dragon.<br/><br/>The body of the Void Divine Dragon held this piece of the god of elements fragment and activated the energy within to surround his body.<br/><br/>Following that, Wang Xian had a strange feeling.<br/><br/>He felt that time around him had become very, very slow. It was as if time had frozen!<br/><br/>At the same time, the energy of the fragment of the god of elements in his hand was also being consumed continuously.<br/><br/>As Wang Xian sensed all of this, a fiery glow erupted from his eyes.<br/><br/>“This… controls the flow of time?”<br/><br/>Wang Xian revealed a shocked expression.<br/><br/>Even though he had some guesses in his heart, he was still extremely shocked after experiencing it.<br/><br/>In the entire universe, there was only one person who was the most powerful and invincible — time!<br/><br/>However, in this primal chaos stone, it could actually slow down time.<br/><br/>This was simply unbelievable!<br/><br/>The time in the primal chaos stone was different from the time in the outside world.<br/><br/>As for the exact difference in the flow rate, Wang Xian still needed to conduct continuous experiments.<br/><br/>However, just this point in the primal chaos stone was enough to shock him.<br/><br/>If he could control time, he would be invincible.<br/><br/>“If I want to control time, I might have to fuse with the primal chaos gem 100% !”\t\t\t\t\t\t</div>", "images": {}, "success": true}