{"id": 1312, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074974.html", "title": "Chapter 4315 - Chapter 4315: 4314 Core, On The Primal Chaos Stone", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4315 - Chapter 4315: 4314 Core, On The Primal Chaos Stone</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4315: 4314 core, on the primal Chaos Stone<br/><br/>Translator: 549690339<br/><br/>Intense pain was felt.<br/><br/>Wang Xian’s transformation had come to the final step.<br/><br/>Due to his experience in transformation, his transformation time was not very long.<br/><br/>“Huff!”<br/><br/>One minute later, Wang Xian heaved a heavy sigh. The Aura on his body had decreased by a lot.<br/><br/>His strength had also decreased by a lot.<br/><br/>However, at the same time, Wang Xian could feel that the attacks from the surrounding energy had also decreased by a lot.<br/><br/>“It’s a little different from the divine dragons of the ten attributes that I modified. The Divine Dragons of the ten attributes will not be attacked by the surrounding energy. They will still be slowly corroded by the surrounding energy.”<br/><br/>Wang Xian looked at his body.<br/><br/>He was much weaker now. He had kept all the treasures and did not integrate them into his body.<br/><br/>“It’s because of the impurities. Although I placed the treasures in my storage space, in this space, the treasures in my storage space can still be sensed by the surrounding energy. If there are impurities, I will definitely be attacked.”<br/><br/>“But the good thing is that the power of this attack is very weak. At most, it will be able to kill a beginner Tianyuan creator. It won’t cause any fatal damage to me.”<br/><br/>“Of course, if I enter the interior of the cross-shaped primordial spirit, I might not be able to hold on for long!”<br/><br/>He guessed in his heart.<br/><br/>However, at this moment, he could move around at the edge of this place for a very long time!<br/><br/>At least, he wouldn’t encounter any life-threatening situations for a few years!<br/><br/>Wang Xian began to restrain his mind and aura to the extreme.<br/><br/>The energy in his body circulated. After the transformation, Wang Xian’s aura had indeed changed.<br/><br/>He dived deeper into the depths.<br/><br/>“How is it? Is That Guy Dead?”<br/><br/>At the same time, the spirit kneader, who was located at the top, stared at the area of the Cross of primordial spirit. Seeing that Wang Xian did not appear again, he asked Tian Ji who was at the side.<br/><br/>The antennae on Tian Ji’s head were emitting a luster as he was sensing his premonition bit by bit.<br/><br/>“The other party is very strong. I Can’t be sure, but what I can be sure of is that he is bleeding and is starting to get injured!”<br/><br/>Tian Ji replied!<br/><br/>“What about my body? Did you sense anything?”<br/><br/>The spirit kneader continued to ask.<br/><br/>“Under my sensing, that part of your body is falling downwards and entering deeper into the area of the cross primordial spirit. The exact situation is unknown.”<br/><br/>Heaven’s vocation continued to reply!<br/><br/>He could make a prediction, but this kind of prediction was similar to the divination lamp.<br/><br/>The powerful creature of the other party was not prepared for the prediction and could not even predict.<br/><br/>Even Wang Xian could not get an accurate answer from heaven’s vocation’s prediction.<br/><br/>“Has my body fallen deeper into the region? If that fellow is dead, it is possible that he would be sucked deeper into the region of the primordial spirit of the cross by the energy.”<br/><br/>The spirit kneader revealed a smile. “Tian Gong, let’s wait here for a while longer!”<br/><br/>Tian Gong nodded his head. He had no objections!<br/><br/>Time ticked by and Wang Xian dived deeper into the region.<br/><br/>When he sensed that the corrosion on him was getting stronger and stronger, he stopped and waited there quietly.<br/><br/>The depth that Wang Xian was at was no longer something that other experts could explore.<br/><br/>He had to be careful when he entered this place to prevent any accidents from happening.<br/><br/>Time passed day by day. Soon, a few months had passed.<br/><br/>“Let’s go. That fellow might be dead. It’s impossible for a great dao expert to stay in this place for so long!”<br/><br/>Three months later, the spirit kneader opened his eyes and said with a smile!<br/><br/>“He should be dead!”<br/><br/>Tianju nodded at the side.<br/><br/>“Well, Tianju, tell me which universe that guy is in and where he is. I intercepted his energy at the beginning of the battle.”<br/><br/>The Spirit kneader said with satisfaction and put a ball of energy in front of tianju.<br/><br/>He wanted to take revenge, not just this time to destroy the Dragon King!<br/><br/>He wanted to find his universe and destroy his universe.<br/><br/>He wanted to make him pay ten times or a hundred times the price!<br/><br/>“Okay!”<br/><br/>Tianju nodded. “If I use the tracking prophecy, it might not be very accurate to rely on this mass of energy alone!”<br/><br/>“It doesn’t matter. I believe in your strength, tianju!”<br/><br/>The spirit kneader said with a smile.<br/><br/>Tianju nodded. The mass of energy floated above his head and immediately began to predict.<br/><br/>But soon, he shook his head.<br/><br/>“No, I can’t predict it at all!”<br/><br/>Tian Ji said with a solemn tone.<br/><br/>“What happened? How did it fail?”<br/><br/>The spirit kneader was slightly surprised.<br/><br/>“There are two possibilities. The first is that the planet where the Dragon King is is too far away, so far away that I can’t predict it at all. The second possibility is that this universe is very strong, so strong that I can’t predict it!”<br/><br/>Tian dui said solemnly, “However, I am more inclined to the second possibility!”<br/><br/>“The second possibility? In a universe that you can not predict, there should be at least three or four great dao level powerhouses guarding it, right? “Then the Dragon King counts as two. In other words, there might be two great dao level powerhouses in this universe?”<br/><br/>The spirit kneader’s expression changed slightly as he spoke!<br/><br/>“Yes, at least two great dao level experts.”<br/><br/>Tian Gong nodded. “Spirit kneader, the universe that the Dragon King lives in is not simple. If you want revenge, I will not participate!”<br/><br/>“If the universe he lives in is really so strong, I will not continue to take revenge!”<br/><br/>The spirit kneader said with an unsightly expression.<br/><br/>A universe had the combat strength of about four great dao levels. The strength of such a universe was already extremely terrifying!<br/><br/>Even if he was an expert from the evil sequence faction, he wouldn’t rashly provoke such a powerful universe.<br/><br/>“Then forget it. That Dragon King has already paid a terrible price!”<br/><br/>The illusory realm suggested from the side!<br/><br/>The Spirit KNEADER nodded with a solemn expression. “Let’s go back!”<br/><br/>The three of them moved and flew into the distance quickly.<br/><br/>If Wang Xian knew all of this, he wouldn’t be surprised.<br/><br/>The current strength of the nine-origin universe was indeed very strong. Other than himself, the Shadow Devil Emperor was also an existence at the Great Dao level.<br/><br/>In addition, the nine-origin universe had many experts.<br/><br/>The Elven empress, Patriarch Xuanwu, and the Abyss Race’s patriarch, their combined strength was comparable to an existence at the Great Dao level.<br/><br/>In addition, the Hetian saint’s combat strength in the nine-origin universe was also at the control level.<br/><br/>With the twelve ancestral witches and three existences at the beginner level, he was comparable to an expert at the Heavenly Yuan creation level.<br/><br/>The strength of the nine-origin universe was now comparable to five experts at the Great Dao level.<br/><br/>It was impossible for him to predict such a powerful universe!<br/><br/>The difference was too great!<br/><br/>When the spirit kneader and the rest left, Wang Xian was still waiting quietly in the area of the cross primordial spirit.\t\t\t\t\t\t</div>", "images": {}, "success": true}