{"id": 1310, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074966.html", "title": "Chapter 4313 - Chapter 4313: 4312 Was Sent Into The Cross-Shaped Primordial Spirit Zone", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4313 - Chapter 4313: 4312 Was Sent Into The Cross-Shaped Primordial Spirit Zone</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4313: 4312 was sent into the cross-shaped primordial spirit zone<br/><br/>Translator: 549690339<br/><br/>“Each of you take a position and attack at the same time. That way, he can escape!”<br/><br/>“Sky Job, you and I will trap that fellow. Illusory realm, you will find an opportunity to send him into the cross-shaped primordial spirit zone!”<br/><br/>The spirit kneader stared at them and said!<br/><br/>“No Problem!”<br/><br/>Sky Job and illusory realm nodded.<br/><br/>They had been invited by the spirit kneader, so they were naturally prepared for everything!<br/><br/>“Let me predict it.”<br/><br/>The antennae on top of his head glowed as he spoke.<br/><br/>Since it involved a heavenly yuan creator who was stronger than him, he could only predict the insignificant problem.<br/><br/>As for whether he could kill the Dragon King with his prediction, he couldn’t predict it.<br/><br/>The other party was too strong.<br/><br/>“If we go from this direction, the other party can’t escape!”<br/><br/>Very soon, Heaven’s duty planned out three positions and spoke to the illusionary realm of the spirit kneader!<br/><br/>The two people from the illusionary realm of the spirit kneader nodded their heads. Their bodies moved and they immediately flew towards the two positions.<br/><br/>Following that, the three of them surrounded Wang Xian at the same time.<br/><br/>Their speed was very fast. After ten breaths, they had already sensed Wang Xian’s existence.<br/><br/>However, at this moment, Wang Xian, who was in front of the cross-shaped primordial spirit region, did not notice them immediately.<br/><br/>Wang Xian focused his attention on creating the divine dragon with ten attributes.<br/><br/>“Attack!”<br/><br/>At this moment, the spiritual kneader and the rest sensed Wang Xian’s location. Their eyes focused as they charged forward with killing intent.<br/><br/>When the energy in their bodies rose, Wang Xian instantly sensed something.<br/><br/>He turned around and immediately swept his gaze around!<br/><br/>“Damn you, you reptile. You actually dared to hurt me last time. This time, I will take your life!”<br/><br/>A cold voice filled with killing intent came from behind.<br/><br/>When Wang Xian heard this voice, his gaze froze slightly.<br/><br/>Spirit kneader!<br/><br/>This fellow actually came to take revenge on him?<br/><br/>His gaze immediately swept to two other places. He could sense that there were two existences at the Great Dao level there.<br/><br/>Although their strength was inferior to his, Wang Xian was completely no match for the three of them working together!<br/><br/>“Run!”<br/><br/>Wang Xian did not hesitate and immediately prepared to escape!<br/><br/>“You want to escape?”<br/><br/>A cold expression appeared on the spirit kneader’s face. He waved his arm and countless dark shadows covered Wang Xian, sealing off all his positions.<br/><br/>“Void God Burial!”<br/><br/>Tian Ji stared at Wang Xian and shouted in a low voice.<br/><br/>In the next moment, terrifying claws appeared beneath Wang Xian and clawed at him.<br/><br/>When Wang Xian saw the sudden attack and entanglement, his eyes narrowed!<br/><br/>Boom<br/><br/>He stomped his foot and a terrifying energy surged downwards.<br/><br/>He waved his arm and turned it into a dragon claw. Nine types of elemental energy blasted forward!<br/><br/>“Dragon King, don’t even think about escaping this time. Last Time, you joined forces with the song Pagoda Demon Sword to attack me. This time, I will make you pay ten times the price. I will make you die here!”<br/><br/>The Spirit kneader roared with a cold face. Behind him, countless black shadows emerged.<br/><br/>The Black Shadows attacked Wang Xian. They were densely packed and endless.<br/><br/>The spirit kneader unleashed all his strength without holding back!<br/><br/>He wanted to leave Wang Xian here completely!<br/><br/>He wanted to kill him completely!<br/><br/>When Wang Xian saw this scene, his expression changed slightly!<br/><br/>The strength of the spirit kneader was not as strong as him. However, with the addition of another great dao expert, it would be difficult for Wang Xian to resist!<br/><br/>Furthermore, there was another expert who had yet to make a move.<br/><br/>Buzz<br/><br/>Without any hesitation, Wang Xian moved his palm and a fleeing treasure appeared in his hand.<br/><br/>Wang Xian had many treasures that were used for escaping. All of them were obtained from the six paths universe.<br/><br/>He immediately opened a scroll.<br/><br/>A wisp of energy enveloped him.<br/><br/>Wang Xian saw that there was an additional path in front of him.<br/><br/>This path led to an extremely far location. However, he was able to take a step forward.<br/><br/>“Illusory realm, forbidden!”<br/><br/>“Illusory realm, illusory!”<br/><br/>However, at this moment, a cold voice was heard.<br/><br/>Following that, Wang Xian saw that the path in front of him disappeared instantly as though it had never appeared.<br/><br/>The scroll in his hand had lost its effect.<br/><br/>Upon seeing this scene, Wang Xian’s expression changed slightly!<br/><br/>However, a sense of crisis engulfed him immediately.<br/><br/>His gaze was fixed in front of him, but he could not sense the location of the crisis.<br/><br/>However, the crisis was still lingering in his heart.<br/><br/>There was some kind of mysterious and strange attack that was attacking him!<br/><br/>Wang Xian’s expression changed slightly. Without any hesitation, the energy in his entire body wrapped around his entire body.<br/><br/>The Tai Chi Dragon Plate on his body transformed into a dragon cannon. With the support of various types of energy, it looked extremely heavy!<br/><br/>It had an invincible defensive power!<br/><br/>Buzz<br/><br/>In the next instant, Wang Xian sensed an energy coming from in front of him.<br/><br/>This energy was extremely gentle, but it seemed to be enveloping the entire void around him!<br/><br/>He was within this encirclement!<br/><br/>As Wang Xian sensed this energy, he had a bad premonition in his heart!<br/><br/>Buzz<br/><br/>At this moment, he could feel his body rushing down rapidly!<br/><br/>This caused his expression to change slightly!<br/><br/>He rushed up quickly!<br/><br/>“Suppress him!”<br/><br/>Tian Gong roared in a low voice. With a wave of his arm, a sword of judgment appeared above Wang Xian and pressed down on him directly.<br/><br/>“Die, die, die, die!”<br/><br/>The spirit kneader let out an excited roar. Countless Phantoms were entangled in the void around Wang Xian.<br/><br/>Along with the Void and Wang Xian in the void, he was pulled down!<br/><br/>In addition, there was a vast force in the sky. It wanted to suppress Wang Xian’s body and make him fall into it.<br/><br/>Wang Xian sensed the force and his expression changed slightly.<br/><br/>He looked down and saw the area of the cross primordial spirit.<br/><br/>“Are they trying to push themselves into the area of the cross primordial spirit just to push themselves into it? What exactly are they trying to do to me?”<br/><br/>Wang Xian was bewildered.<br/><br/>What the other party was doing was not something he could fight against.<br/><br/>Although the current situation was better than the previous situation of the spirit kneader.<br/><br/>However, it wasn’t much better.<br/><br/>The opponent’s attacks were very strange!<br/><br/>Boom<br/><br/>In the next instant, Wang Xian’s body was thrown into the cross-shaped primordial spirit zone!<br/><br/>When Wang Xian entered the zone, the attacks of the spirit kneader and the rest disappeared as well!<br/><br/>He frowned slightly and didn’t fly out immediately. Instead, he fled upwards.<br/><br/>He moved his palm and created a space. The divination lamp appeared in front of him.<br/><br/>At the same time, waves of energy simulated his surroundings, allowing him to stay in the cross-shaped primordial spirit region for a longer period of time.<br/><br/>Buzz<br/><br/>A wave of energy was injected into the divination lamp.<br/><br/>Divination.<br/><br/>What would he encounter if he flew out of the cross-shaped primordial spirit region?<br/><br/>Buzz Buzz<br/><br/>The divination lamp emitted light and an image appeared!<br/><br/>The moment he went out, he would be attacked by three terrifying attacks.<br/><br/>Wang Xian looked at this scene and frowned slightly. He immediately flew into the distance.\t\t\t\t\t\t</div>", "images": {}, "success": true}