{"id": 1317, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074994.html", "title": "Chapter 4320 - Chapter 4320: 4319 Ten Attributes Combined With The Power Of Chaos!", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4320 - Chapter 4320: 4319 Ten Attributes Combined With The Power Of Chaos!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4320: 4319 ten attributes combined with the power of Chaos!<br/><br/>Translator: 549690339<br/><br/>Wang Xian was a little shocked.<br/><br/>He didn’t expect that this primal chaos stone would have such a powerful effect.<br/><br/>Just by controlling time, it was an invincible existence.<br/><br/>One had to know that in the universe, time couldn’t be controlled.<br/><br/>There was no such thing as the time attribute.<br/><br/>“If I can control time, I would be completely invincible.”<br/><br/>Wang Xian mumbled.<br/><br/>Unfortunately, he couldn’t control it at all.<br/><br/>Although he could summon the primal chaos stone and allow people to enter the primal chaos stone, he needed to consume energy in order to change the flow of time.<br/><br/>As for the exact amount of energy consumed and the difference between the flow of time in the primal Chaos Stone and the outside world, Wang Xian would have to slowly study it himself.<br/><br/>In addition, Wang Xian felt that this primal chaos stone had other uses.<br/><br/>He calmed his heart and studied it bit by bit.<br/><br/>As time passed, Wang Xian had a thorough understanding of the ability of the entire primal chaos stone.<br/><br/>Currently, the primal chaos stone could control the flow of the internal space.<br/><br/>For example, under the consumption of energy, it could achieve a maximum of one day outside and one hundred days inside.<br/><br/>The flow rate was one to one hundred.<br/><br/>This was the limit.<br/><br/>Of course, under the circumstances of the limit, the consumption of energy would also increase.<br/><br/>In addition, the primal Chaos Stone had another function.<br/><br/>That was to conceal Wang Xian’s strength.<br/><br/>Wang Xian could hide his energy in the primal chaos stone and only reveal one attribute. If that was the case, anyone who saw him would only think that he was an expert at the peak of the Dominator realm.<br/><br/>The effect of this ability to conceal one’s strength was very terrifying. As long as Wang Xian did not reveal himself, the other experts would not be able to see it at all.<br/><br/>It could be said that this was a powerful skill of pretending to be a pig to eat a tiger.<br/><br/>Other than these two effects, the primal Chaos Stone did not give Wang Xian any other abilities.<br/><br/>This also made Wang Xian feel a little helpless.<br/><br/>Speaking of which, these two abilities did not increase Wang Xian’s strength at all.<br/><br/>One had to know that he had suffered a huge loss this time.<br/><br/>However, the future of the primal chaos stone was extremely terrifying in Wang Yun’s eyes.<br/><br/>It could even make him invincible.<br/><br/>However, Wang Xian attempted to fuse it and discovered a situation.<br/><br/>The more the primal chaos stone fused into his body, the more the energy in his body would change.<br/><br/>This change was beneficial.<br/><br/>This was because Wang Xian realized that with the birth of the primal chaos stone, there would be an additional type of energy in his body.<br/><br/>This type of energy was exactly the same as the aura of the primal chaos stone.<br/><br/>This was the energy of the fusion of ten attributes. It was filled with vitality and deathly stillness. It was filled with strangeness.<br/><br/>Wang Xian called this type of energy the power of chaos.<br/><br/>The power of chaos was an energy that was obviously higher than any other attribute.<br/><br/>Wang Xian was filled with anticipation towards this power of chaos.<br/><br/>The speed of the fusion with the primal chaos stone was very slow. In fact, this fusion was not something that Wang Xian could decide.<br/><br/>Instead, it was the primal chaos stone itself that was slowly fusing with its own body.<br/><br/>Wang Xian did not know how long it would take for the complete fusion to be completed!<br/><br/>However, no matter what, the harvest this time was still not bad!<br/><br/>Wang Xian moved his body and arrived at the tree of chaos once again.<br/><br/>Looking at the gigantic tree of chaos with yellow leaves growing out from it, Wang Xian was still extremely shocked!<br/><br/>The Primal Chaos Stone was too good at absorbing energy!<br/><br/>In Wang Xian’s opinion, the energy of the tree of chaos was hundreds of times more than the energy in his entire body combined.<br/><br/>Even if his strength was equivalent to two great dao levels, he could only cut off the branches of the tree of chaos.<br/><br/>However, such a huge creature was actually withering to such an extent.<br/><br/>It really shocked him!<br/><br/>“Dragon King!”<br/><br/>When Wang Xian arrived, he heard a voice.<br/><br/>Following that, he saw the Shadow Devil Emperor flying over.<br/><br/>“Senior Shadow Devil Emperor!”<br/><br/>When Wang Xian saw him, he greeted him with a smile.<br/><br/>“Don’t call me senior. Dragon King, your current strength is already stronger than mine. Hehe!”<br/><br/>The Fallen Shadow Demon Emperor smiled and looked at the tree of chaos. “Dragon King, what do you think about this matter?”<br/><br/>“I don’t know either. I didn’t expect it either.”<br/><br/>Wang Xian shook his head and said ambiguously.<br/><br/>It was impossible for him to say that the tree of Chaos’s withering was related to him.<br/><br/>That would be too shocking.<br/><br/>“There are too many mysteries and mysteries in the chaos. The tree of Chaos’s withering is not a good thing for us.”<br/><br/>The Fallen Shadow Demon Emperor said.<br/><br/>“We can find some other cultivation grounds.”<br/><br/>Wang Xian’s mind stirred as he spoke!<br/><br/>“Oh?”<br/><br/>When the Fallen Shadow Demon Emperor heard Wang Xian’s words, he looked at him in surprise. “Dragon King, do you know of any other cultivation grounds?”<br/><br/>“I know of one, but it needs to be built by myself. Moreover, it is not safe yet. If that place stabilizes, I will tell the Fallen Shadow Demon Emperor about it.”<br/><br/>Wang Xian spoke and continued, “This kind of place is not a secret place. Even the Justice Alliance knows about it.”<br/><br/>The Fallen Shadow Demon Emperor nodded.<br/><br/>After chatting with the fallen Shadow Demon Emperor for a while, Wang Xian returned to the Dragon Palace.<br/><br/>The withering of the Tree of Chaos made this place unsuitable for cultivation.<br/><br/>The strong disciples of the nine-origin universe had also returned to the universe.<br/><br/>Naturally, all the disciples of the Dragon Palace had returned as well!<br/><br/>“Prime Minister Gui!”<br/><br/>Upon arriving at the Dragon Palace, the Dragon King transmitted his voice to Prime Minister Gui.<br/><br/>“Greetings, Dragon King!”<br/><br/>Soon, Prime Minister Gui flew over and greeted Wang Xian respectfully.<br/><br/>“Are there any disciples in the Dragon Palace who are on the verge of a breakthrough?”<br/><br/>Wang Xian asked Prime Minister Gui.<br/><br/>“Dragon King, the Dragon Palace has yet to produce disciples at this level. Currently, there are 68 disciples at the peak of the Dragon Palace’s Overlord Realm!”<br/><br/>Prime Minister GUI reported!<br/><br/>Wang Xian nodded his head slightly. He was prepared to nurture some disciples in the Heaven’s origin realm.<br/><br/>Currently, Wang Xian had a lot of resources in his hands.<br/><br/>Although he had lost a lot this time, his gains were equally terrifying.<br/><br/>A fire elemental energy gem that could be absorbed.<br/><br/>An ice elemental treasure.<br/><br/>In addition, he had also obtained three other elemental treasures in the cross-shaped primordial spirit region.<br/><br/>These gemstones were extremely useful for the cultivation of powerhouses in the Heaven’s origin blessed realm.<br/><br/>In addition to these treasures, Wang Xian was prepared to use the primal chaos stones.<br/><br/>He wanted them to cultivate in the primal chaos stones to increase their strength as soon as possible.<br/><br/>One had to know that if one cultivated in the primal chaos stones and had sufficient energy, cultivating for 10 million years was equivalent to cultivating for one billion years.<br/><br/>“Give all these treasures to them. Let them use them for cultivation so that they can reach the bottleneck of breaking through as soon as possible!”<br/><br/>Wang Xian waved his arm and passed the precious energy gemstones to Prime Minister Gui.<br/><br/>He asked him to distribute them to the disciples of the Dragon Palace who were at the peak of the Overlord realm.<br/><br/>“Yes!”<br/><br/>Prime Minister Gui replied immediately.<br/><br/>Wang Xian sat there and pondered for a moment. Then, he prepared to go to the riot zone once again.<br/><br/>Once there, he would train the disciples of the Dragon Palace well.\t\t\t\t\t\t</div>", "images": {}, "success": true}