{"id": 1315, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074986.html", "title": "Chapter 4318 - Chapter 4318: The 4317 Terrifying Ball", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4318 - Chapter 4318: The 4317 Terrifying Ball</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4318: The 4317 terrifying ball<br/><br/>Translator: 549690339<br/><br/>“This won’t do. Although the speed of my assimilation within the ball has decreased by a lot, and even though a portion of my soul has escaped, this strange ball has actually invaded through the passageway!”<br/><br/>Wang Xian’s face was filled with shock.<br/><br/>He didn’t understand what kind of existence this ball was.<br/><br/>How could it be so terrifying.<br/><br/>The system had forcefully connected to the Dragon Palace and consumed a large number of fruits of the mother’s womb. Only after consuming a large number of soul-returning embryo fruits did he manage to pull a portion of Wang Xian’s soul over.<br/><br/>However, this passageway had actually been invaded by the energy within this sphere.<br/><br/>This strange sphere was like a bottomless pit, wanting to devour any kind of energy.<br/><br/>“It won’t be long before this sphere can pass through this passageway and enter the Dragon Palace. At that time, the entire Dragon Palace will probably be devoured by it!”<br/><br/>Wang Xian’s expression was a little awkward.<br/><br/>He had never expected to encounter such a situation!<br/><br/>He had actually suffered such a huge loss!<br/><br/>I have to solve the problem at hand. Otherwise, the Dragon Palace will be in danger<br/><br/>Wang Xian looked at this scene with an extremely grave expression.<br/><br/>The system’s confrontation with this sphere was considered a failure.<br/><br/>This sphere wanted to absorb all kinds of energy.<br/><br/>Wang Xian’s mind was constantly running as he pondered over the problem in front of him.<br/><br/>At this moment, his gaze focused as his soul moved. He went straight to the teleportation formation.<br/><br/>Although he only had one soul left, his strength could still burst out to the level of a ruler.<br/><br/>In addition, with a wave of his arm, the five elements grinding tai chi dragon plate and the other treasures entered his body.<br/><br/>Wang Xian teleported to the location of the tree of chaos through the teleportation formation.<br/><br/>His expression turned fierce.<br/><br/>Didn’t you want to absorb energy?<br/><br/>Couldn’t you assimilate anything?<br/><br/>Then, try calling the tree of Chaos!<br/><br/>Wang Xian arrived at the location of the Tree of chaos. Under his telepathic perception, a passageway immediately appeared in his chest.<br/><br/>The passageway was gradually eroded. It would only take a few hours at most before it would invade.<br/><br/>Wang Xian connected the tunnel to the tree of chaos and waited quietly.<br/><br/>Time passed little by little. The invisible tunnel had been completely assimilated by the sphere.<br/><br/>Following that, Wang Xian could sense a force of assimilation coming from the tunnel.<br/><br/>He watched nervously.<br/><br/>That was because he was not sure what would happen next.<br/><br/>Buzz<br/><br/>However, at this moment, he could feel that the area where he was connected to the tree of chaos was yellowish. It seemed to have withered a little.<br/><br/>“The energy of the sphere is absorbing and assimilating the tree of chaos.”<br/><br/>Wang Xian’s heart trembled. The tree of chaos was incomparably huge. It was able to stand in the midst of chaos. With such luxuriant foliage, it was simply an invincible existence.<br/><br/>Its vitality was unimaginable.<br/><br/>Now, it was being assimilated and absorbed rapidly. It was simply unimaginable.<br/><br/>Moreover, the rate of absorption was extremely fast.<br/><br/>Wang Xian’s body, which was located in the sphere, had been completely assimilated and absorbed within a few hours.<br/><br/>One had to know that Wang Xian’s body was an existence at the Great Dao level.<br/><br/>An expert at the Great Dao level was actually absorbed so quickly.<br/><br/>This was simply terrifying to the extreme!<br/><br/>Wang Xian watched quietly as his eyes sparkled.<br/><br/>Through the passage, the ball was absorbing the power of the tree of chaos.<br/><br/>The tree of chaos had no consciousness and would not resist. It was just like an ordinary tree, allowing itself to be absorbed.<br/><br/>Time passed day by day, Day by day.<br/><br/>Wang Xian could no longer imagine how much energy the ball had absorbed.<br/><br/>However, when he looked at the tree of chaos, the shock on his face could not be concealed!<br/><br/>“Eh? What happened? Why did the energy around the tree of chaos suddenly decrease by so much? Furthermore, look at the leaves of the tree of chaos. They are starting to turn yellow. What… What exactly happened?”<br/><br/>“I don’t know. Could it be that the tree of chaos can die of old age? However, isn’t the rate of aging too fast? It’s unbelievable!”<br/><br/>“No way! The Primal Chaos Tree can die of old age and wither?”<br/><br/>At the same time, around the primal chaos tree.<br/><br/>Countless disciples of great beings from the 9-origin universe were using the power of the primal chaos tree to cultivate.<br/><br/>However, they suddenly sensed that the energy around the primal chaos tree was becoming thinner.<br/><br/>They even saw that the primal chaos tree was starting to turn yellow and become old!<br/><br/>This shocked all the powerful disciples.<br/><br/>This? ? ?<br/><br/>How was this possible?<br/><br/>However, because they didn’t know much about the tree of chaos, they didn’t know the specific reason.<br/><br/>Even the He Tian saint from the nine-origin universe and the others had come to check on the change in the tree of chaos, but they didn’t get any results.<br/><br/>They didn’t know much about the tree of chaos either!<br/><br/>They didn’t know if the tree of chaos would die of old age or wither!<br/><br/>“It’s only been a few years, but the vast and mighty tree of chaos is actually beginning to wither. This… What the hell is this ball? How long is it going to absorb for?”<br/><br/>At this moment, Wang Xian was also sensing everything with a shocked expression.<br/><br/>The energy absorbed by this ball was too terrifying!<br/><br/>It was so terrifying that it made one’s hair stand on end!<br/><br/>Buzz Buzz<br/><br/>Another few months passed. The tree of chaos was withering and the surrounding energy was becoming thinner and thinner.<br/><br/>It was even inferior to some of the blessed lands in the nine-origin universe!<br/><br/>Just when Wang Xian thought that this ball was a bottomless pit, he suddenly saw the ball trembling.<br/><br/>The ball, which was filled with dead silence and vitality, stopped absorbing.<br/><br/>Rays of light kept flashing from the sphere.<br/><br/>“This? ? ?”<br/><br/>Wang Xian stared at it carefully.<br/><br/>This was the luster of attributes. It was the luster of ten attributes.<br/><br/>The luster lingered around the sphere for a few days before the luster gradually disappeared.<br/><br/>The sphere returned to its original appearance.<br/><br/>The difference was that when Wang Xian looked at the sphere again, the feeling that made his heart palpitate had disappeared from the sphere.<br/><br/>It was as though there was no danger at all.<br/><br/>Wang Xian looked at the ball through the passageway with an astonished expression on his face.<br/><br/>“What’s the situation? has the ball stabilized after absorbing the energy? Or has it reached some kind of balance that wouldn’t be so dangerous?”<br/><br/>Wang Xian’s expression changed as he made a guess.<br/><br/>He pondered for a moment before splitting his soul.<br/><br/>Wang Xian wanted to enter the sphere through the passageway!<br/><br/>This sphere was too terrifying.<br/><br/>The energy it absorbed was too terrifying!<br/><br/>He had to investigate it thoroughly.<br/><br/>Having lost a large number of treasures, Wang Xian was not afraid that the soul that entered would be absorbed again!<br/><br/>The split soul moved and entered the interior of the sphere through the passageway.<br/><br/>In an instant, a special feeling was transmitted into Wang Xian’s mind.<br/><br/>When he entered the sphere again, the feeling of assimilation and devouring had completely disappeared.<br/><br/>Instead, there was a gentle feeling.<br/><br/>Wang Xian’s mind stirred. At that instant, his soul came out of the sphere and entered the chaotic domain.<br/><br/>The sphere was right in front of him!\t\t\t\t\t\t</div>", "images": {}, "success": true}