{"id": 1314, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074982.html", "title": "Chapter 4317 - Chapter 4317: 4316 Was Terrifying!", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4317 - Chapter 4317: 4316 Was Terrifying!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4317: 4316 was terrifying!<br/><br/>Translator: 549690339<br/><br/>“What a terrifying attractive force.”<br/><br/>Wang Xian’s body was sucked into the sphere rapidly.<br/><br/>This caused his expression to change drastically.<br/><br/>After transforming into the body of the Divine Dragon, Wang Xian’s body was extremely huge.<br/><br/>However, even so, he was instantly pulled into the interior of the sphere.<br/><br/>What shocked Wang Xian was that this sphere actually wanted to completely devour and Fuse Wang Xian.<br/><br/>It wanted to devour his consciousness.<br/><br/>This caused Wang Xian’s expression to change drastically.<br/><br/>He sensed that he had entered a pitch-black world. This world was filled with deathly silent energy.<br/><br/>The entire world was incomparably vast and boundless.<br/><br/>This was completely different from everything in the outside world.<br/><br/>It was as though time had stopped inside.<br/><br/>Wang Xian’s consciousness was melted and fused by this space.<br/><br/>He wanted to completely destroy it and make it a part of this place.<br/><br/>Wang Xian’s heart was beating violently as he urged all the energy in his body to resist.<br/><br/>At the same time, his soul-stirring body emitted a luster.<br/><br/>“Roar Roar Roar!”<br/><br/>“Roar Roar Roar!”<br/><br/>Wang Xian roared with all his might.<br/><br/>However, very soon, he felt that his body was disappearing bit by bit as he fused with the surrounding energy!<br/><br/>This made Wang Xian a little scared. He mobilized all the energy in his body to resist.<br/><br/>However, no matter how hard he tried to resist, he couldn’t resist the melting of his body.<br/><br/>He couldn’t feel the pain in his body, but he could feel that his body was losing.<br/><br/>Along with it was his soul!<br/><br/>“No, I can’t be swallowed by this ball. Otherwise, all my efforts will go down the drain!”<br/><br/>Wang Xian’s expression was extremely ugly.<br/><br/>Once he was merged, he would die.<br/><br/>This operation would fail.<br/><br/>This caused him to suffer a huge loss.<br/><br/>Moreover, at this moment, his heart was palpitating. There was always a strong sense of danger.<br/><br/>This sense of danger caused him to be horrified from the bottom of his heart.<br/><br/>He felt that he was not truly dead when he was merged by this ball. Instead, he was merging with this ball.<br/><br/>Merging did not mean that he would die.<br/><br/>In that case, he might not be able to resurrect!<br/><br/>This was an instinct that came from the depths of his heart.<br/><br/>This instinct made him feel a little terrified!<br/><br/>If he was really merged and survived in another way, it would be equivalent to his complete annihilation.<br/><br/>It would be equivalent to the complete disappearance of the Dragon King!<br/><br/>“No, my consciousness can not disappear. Otherwise, I might really die.”<br/><br/>Wang Xian did not expect to encounter such a situation.<br/><br/>If he knew that there was such a risk, he would definitely not take it.<br/><br/>At the same time, he was deeply shocked by this ball.<br/><br/>The energy contained in this ball and the ability it displayed was too terrifying.<br/><br/>It would assimilate you directly instead of destroying you completely.<br/><br/>You were still alive, but it was equivalent to you being dead!<br/><br/>Wang Xian took a deep breath. The energy wrapped around his remaining body and he wanted to fly out.<br/><br/>Buzz Buzz Buzz<br/><br/>Buzz Buzz Buzz<br/><br/>However, Wang Xian soon realized that he couldn’t get out at all.<br/><br/>It was as if this space was endless!<br/><br/>This caused Wang Xian’s expression to change drastically again!<br/><br/>“Ding, the system has detected that the host is encountering a huge crisis. Please separate your soul and enter the system Dragon Palace to avoid complete death!”<br/><br/>“Ding, the system has detected that the host is encountering a huge crisis. Please separate your soul and enter the system Dragon Palace to avoid complete death!”<br/><br/>Just when Wang Xian was unable to escape or escape from this space and was being melted bit by bit, the system’s voice suddenly rang out.<br/><br/>The Divine Dragon system was the cheat that allowed Wang Xian to grow so quickly.<br/><br/>However, ever since Wang Xian became stronger and stronger, the system’s role became less and less useful.<br/><br/>This was because this system was created by the strongest person of the Divine Dragon Clan in the past. He was not as strong as the current Wang Xian.<br/><br/>Therefore, the system was now just a simple support.<br/><br/>Regardless, this system was created by the Divine Dragon Clan in the past. They perished together with the peak race of the insect clan.<br/><br/>It also had many unique features.<br/><br/>Another point was that the system was connected to the Dragon Palace.<br/><br/>Now, the system sensed Wang Xian’s danger and forcefully connected to the Dragon Palace.<br/><br/>When Wang Xian heard the system’s voice, he quickly separated his consciousness.<br/><br/>At this moment, he could sense the existence of the Dragon Palace.<br/><br/>He quickly separated his soul and used the power of the system to open the passage to the Dragon Palace.<br/><br/>Buzz! Buzz! Buzz<br/><br/>Such a long-distance teleportation caused the entire dragon palace to shake.<br/><br/>The ancestral tree of the dragon palace shone with light, especially the branches of the soul-returning tree.<br/><br/>The soul-returning fruits slowly withered, fell, and disappeared!<br/><br/>A large number of soul-returning fruits died.<br/><br/>Soon after, the maternal fruit above the ancestral tree began to fall.<br/><br/>The fruits on top started to wither and dissipate.<br/><br/>In just a few seconds, three mother embryo fruits had withered.<br/><br/>At this moment, the connection between Wang Xian and the Dragon Palace was getting stronger.<br/><br/>An invisible passageway seemed to have opened up!<br/><br/>A wisp of Wang Xian’s soul passed through this passageway and entered the Dragon Palace.<br/><br/>Wang Xian’s soul entered the Dragon Palace.<br/><br/>He looked at the location of the passageway in horror.<br/><br/>He could see that at the end of the passageway, most of his body was in an unfamiliar world. He was being absorbed by this world.<br/><br/>That world seemed to be able to assimilate everything.<br/><br/>Just when Wang Xian thought that he had escaped this calamity, the passageway opened by the system slowly turned gray.<br/><br/>Wang Xian could sense that an energy was spreading towards the dragon palace through this passageway.<br/><br/>“What?”<br/><br/>Wang Xian was shocked when he saw this scene. A shocked expression appeared on his face.<br/><br/>What was this?<br/><br/>The energy in the sphere was spreading through the passageway opened by the system. Was it trying to assimilate the entire Dragon Palace?<br/><br/>Was it trying to assimilate everything?<br/><br/>His expression changed drastically. With a wave of his arm, a stream of energy entered the passageway.<br/><br/>This stream of energy was quickly assimilated!<br/><br/>When Wang Xian saw this scene, his expression changed drastically.<br/><br/>The energy in the sphere was about to invade.<br/><br/>It was like a universe that could devour everything and assimilate everything.<br/><br/>Wang Xian’s soul trembled slightly as he stared at it with an embarrassed expression.<br/><br/>“Huff! Huff!”<br/><br/>His breathing was rapid as he forced himself to calm down.<br/><br/>He waved his arm and mobilized the energy of the Dragon Palace to enter the passageway in an attempt to block the passageway.<br/><br/>However, when the energy entered the passageway, it was assimilated bit by bit.<br/><br/>“That’s not right. The speed at which this sphere assimilates individual elemental energy is much slower.”<br/><br/>At this moment, Wang Xian suddenly noticed a problem.<br/><br/>His gaze focused as he sensed that the body that was still in the sphere had exploded.<br/><br/>“Roar Roar Roar!”<br/><br/>Wang Xian’s body that was in the sphere was directly divided into ten divine dragons that were dripping with blood.<br/><br/>They were divided into individual elemental beings.<br/><br/>After the separation, Wang Xian immediately sensed that the speed of assimilation was reduced by dozens of times compared to before.<br/><br/>However, it was still being assimilated.\t\t\t\t\t\t</div>", "images": {}, "success": true}