{"id": 1313, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15074978.html", "title": "Chapter 4316 - Chapter 4316: 4315 Core, Under The Primal Chaos Stone", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4316 - Chapter 4316: 4315 Core, Under The Primal Chaos Stone</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4316: 4315 core, under the primal Chaos Stone<br/><br/>Translator: 549690339<br/><br/>Wang Xian didn’t know when the spirit kneader and the rest would leave.<br/><br/>Therefore, he had been waiting in the region of the cross primordial spirit.<br/><br/>He would use the divination lamp to perform divination from time to time to see if he would be attacked again!<br/><br/>When he continued his fifth divination, he got a good result.<br/><br/>“Looks like they have left!”<br/><br/>Wang Xian revealed a smile and heaved a sigh of relief.<br/><br/>His body moved and he flew towards the location outside.<br/><br/>Wang Xian did not go to the core of the cross primordial spirit to look for the treasure immediately.<br/><br/>In order to avoid any accidents, Wang Xian had to make a trip back first.<br/><br/>He asked an lie to bring the treasures and resources he had to the Dragon Palace.<br/><br/>He had too many resources and treasures in his hands now.<br/><br/>He had obtained more than 30 god of elements fragments in the cross primordial spirit region.<br/><br/>Including the god of elements fragments obtained from the spirit kneader and the others, he had more than 40 of them in his hands.<br/><br/>In addition, he had to place the Tai Chi Dragon disc in the Dragon Palace.<br/><br/>This was because if he wanted to enter the core region, he couldn’t have any impurities on his body.<br/><br/>Otherwise, he would be attacked!<br/><br/>After flying out of the cross-shaped primordial spirit area, Wang Xian flew straight out.<br/><br/>Although his strength was weaker now, it was not something that an ordinary great dao could contend against.<br/><br/>Wang Xian flew out of the chaotic area.<br/><br/>Without the interference of this energy, Wang Xian could vaguely contact the dragon palace through the ancestral tree.<br/><br/>Then, he summoned an lie over.<br/><br/>“Dragon King!”<br/><br/>Not long after, an lie came up to him and bowed respectfully.<br/><br/>“Yes, an lie. Tell me to bring all these treasures to the Dragon Palace. I don’t have time to go back for now. As for the treasures, I’ll deal with them when I get back.”<br/><br/>Wang Xian instructed an lie.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded immediately and replied.<br/><br/>After Wang Xian gave all the treasures and resources to an lie, he stepped into the area of the cross primordial spirit once again.<br/><br/>Without all the treasures and resources, Wang Xian was much weaker now.<br/><br/>Fortunately, there was no problem for him to enter the area of the cross primordial spirit.<br/><br/>When he came to the area of the cross primordial spirit again, Wang Xian stared at it with anticipation in his eyes.<br/><br/>He had paid a huge price to enter the cross-shaped primordial spirit region this time.<br/><br/>Although it was also because of the spirit kneader.<br/><br/>However, after entering the core region, if Wang Xian wanted to recover to his previous state, he would have to commit suicide and resurrect himself.<br/><br/>This was because his current body was already fixed by himself. He could not cultivate nor could he recover to his previous state.<br/><br/>He had to commit suicide and resurrect himself!<br/><br/>With this thought in mind, Wang Xian entered the area and swam towards that area.<br/><br/>His speed was very fast. It was far from what the body of a ten-elemental divine dragon could compare to.<br/><br/>“The last time, I used the body of a ten-elemental divine dragon to search for treasures here. There were many treasures that I could not get my hands on in the area where the energy was unstable. This time, with my body, I should be able to get my hands on them.”<br/><br/>“Also, according to Song Ta and the rest, there are supreme treasures of the Heaven’s origin. I didn’t manage to find them last time. Should I look for them this time?”<br/><br/>Wang Xian thought to himself. A thoughtful look appeared on his face.<br/><br/>This cross-shaped primordial spirit area was a huge treasure trove.<br/><br/>If he could get his hands on all the treasures here, the resources would definitely be insane.<br/><br/>After hesitating for a moment, Wang Xian put down the treasures temporarily. The most important thing now was to get his hands on the sphere at the core.<br/><br/>After confirming the location in front of him, Wang Xian flew over quickly.<br/><br/>It took him a long time to reach the place last time. This time, Wang Xian only used one day.<br/><br/>This was because there were no impurities on Wang Xian’s body. He wouldn’t be attacked by the surrounding energy at all.<br/><br/>Hovering beside an elemental god, Wang Xian looked at the chaotic region in front of him.<br/><br/>Since Wang Xian came here in his true form, his perception of the surroundings was wider.<br/><br/>He could see that the ten elemental gods were in a circular shape around him.<br/><br/>The elemental gods were releasing powerful elemental energy as they surged forward.<br/><br/>One elemental god was like the source of a long river, flowing forward.<br/><br/>The place where the ten elemental gods’energy rivers intersected formed a chaotic region.<br/><br/>Wang Xian moved his body and continued swimming forward.<br/><br/>Soon, Wang Xian entered the place where the energy rivers intersected.<br/><br/>Upon entering, Wang Xian had the exact same feeling as if he was staying in a chaotic space.<br/><br/>“What’s going on? Why is the place where the ten elemental gods’energy intersected a dead silence of Chaos? Is it because the power of Chaos is formed from the combination of ten elemental energies?”<br/><br/>“Or could it be that this chaotic region is caused by other reasons? The sphere in the core region?”<br/><br/>Wang Xian kept guessing in his heart.<br/><br/>He looked at his surroundings and continued flying in.<br/><br/>Half a day later, Wang Xian bumped into the sphere that he bumped into the last time.<br/><br/>Looking at the sphere that was emitting a strange energy, his eyes sparkled.<br/><br/>The ball, which was a fusion of life force and deathly stillness, was extremely unique and strange.<br/><br/>This feeling was even more peculiar than when the two types of energy, light and darkness, were intertwined together.<br/><br/>Wang Xian didn’t move the ball immediately.<br/><br/>This ball contained a strange energy. The last time he devoured the Divine Dragon with ten attributes, Wang Xian had to deal with it carefully.<br/><br/>In addition, he was prepared to completely explore this area!<br/><br/>After sizing up the sphere for a while, Wang Xian continued to explore the surroundings.<br/><br/>However, after exploring for a full two days, Wang Xian went through every part of this area.<br/><br/>Apart from the sphere in the middle, he did not find any other items.<br/><br/>“This is the core of the cross primordial spirit region, the core of the ten elemental gods, and the core of the entire riot region!”<br/><br/>Wang Xian came to the front of the ball once again. His eyes were sparkling as he looked at the ball.<br/><br/>What kind of existence was the core of everything?<br/><br/>What kind of treasure was it?<br/><br/>A treasure that surpassed the Heaven’s origin creation?<br/><br/>If he were to obtain it, would he be able to possess invincible strength.<br/><br/>Wang Xian had some anticipation in his heart. At the same time, he was also somewhat vigilant!<br/><br/>He slowly approached the ball. When he was about ten meters away from the ball, Wang Xian slowly extended his arm.<br/><br/>His arm turned into a huge dragon claw and grabbed towards the ball!<br/><br/>Buzz<br/><br/>When Wang Xian’s dragon claw touched the ball, the ball, which had been in a peaceful state, suddenly trembled slightly.<br/><br/>Following that, Wang Xian felt a terrifying suction force surging towards him.<br/><br/>This suction force was extremely vast.<br/><br/>Wang Xian’s expression changed slightly and he wanted to resist it.<br/><br/>However, the strength of this suction force was far beyond his imagination.<br/><br/>Buzz<br/><br/>Before Wang Xian could react, his entire body was pulled into the sphere.<br/><br/>Roar! Roar<br/><br/>Wang Xian let out a low roar and transformed into the body of a divine dragon.<br/><br/>However, his huge body was still useless.\t\t\t\t\t\t</div>", "images": {}, "success": true}