{"id": 1319, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075002.html", "title": "Chapter 4322 - Chapter 4322: 4321 Building A Holy Land For Cultivation!", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4322 - Chapter 4322: 4321 Building A Holy Land For Cultivation!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4322: 4321 building a holy land for cultivation!<br/><br/>Translator: 549690339<br/><br/>After taking a stroll around the area of the cross-shaped primordial spirit, Wang Xian flew out from it.<br/><br/>The place where the cross-shaped primordial spirit was located was the same as before. All kinds of energy were filled up.<br/><br/>Wang Xian scanned his surroundings and felt that someone was looking in his direction.<br/><br/>He looked over as well.<br/><br/>His gaze landed on a middle-aged figure.<br/><br/>The two of them exchanged a glance before separating.<br/><br/>Wang Xian left as well.<br/><br/>He realized that after the changes in the riot zone, there were many more powerhouses here.<br/><br/>These powerhouses were all scouting out the situation around them.<br/><br/>Clearly, they were also planning something.<br/><br/>They had to be fully prepared if the Great Dao of Heaven was stable.<br/><br/>Otherwise, if something unexpected happened, it would be a devastating blow to the disciples who were cultivating in the Great Dao of heaven.<br/><br/>Therefore, many experts from the major sects and many universes came to investigate.<br/><br/>If the Great Dao of Heaven was completely stable, they would be able to set up a holy land for cultivation in peace.<br/><br/>Wang Xian walked around once and returned to the Great Dao of heaven.<br/><br/>The entire Great Dao of heaven was extremely long, and its width could reach thousands of kilometers.<br/><br/>Wang Xian came to the center of the Great Dao of heaven and looked around.<br/><br/>In the direction near the edge, there were some experts from the universe who had established a cultivation ground there.<br/><br/>Wang Xian moved his palm and established a group of palaces with a wave of his hand.<br/><br/>He planted a flag of the Dragon Palace in the sky above the group of palaces.<br/><br/>Following that, Wang Xian placed the five elements Millstone and the Tai Chi Dragon Plate in the group of palaces to intimidate the Little Rascals.<br/><br/>Following that, Wang Xian entered the Central Palace and released an lie.<br/><br/>“Let’s go back.”<br/><br/>Wang Xian instructed an lie.<br/><br/>An lie nodded and enveloped Wang Xian with his energy. They returned to the Dragon Palace in an instant.<br/><br/>“Prime Minister Gui, gather all the disciples who are at the peak of the Overlord realm of the Dragon Palace immediately. Also, gather 200,000 disciples from other places and follow me to a place for cultivation.”<br/><br/>Wang Xian immediately transmitted his voice to Prime Minister Gui!<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui replied immediately.<br/><br/>Soon, the disciples of the Dragon Palace rushed over.<br/><br/>Wang Xian sat in the Dragon King Palace and sent a message to the fallen Shadow Devil Emperor. At the same time, he also sent a message to all the powerhouses in the nine-origin universe.<br/><br/>He told them about the matter regarding the Great Dao of heaven.<br/><br/>Currently, it was no longer possible to cultivate at the tree of chaos. The Great Dao of Heaven was a good place to go.<br/><br/>Although that place was extremely far away, it was fine to bring some disciples with potential there.<br/><br/>With the current strength of the nine-origin universe, there were no other universes that dared to offend.<br/><br/>Even the Void Universe had given up on the idea of the nine-origin universe.<br/><br/>After the Fallen Shadow Devil Emperor and the rest received the message, they immediately sensed Wang Xian.<br/><br/>Wang Xian did not wait for them and did not let an lie bring them over.<br/><br/>An lie was a strategic talent in the Dragon Palace. He was very important to the entire Dragon Palace.<br/><br/>Therefore, Wang Xian was not prepared to expose him.<br/><br/>Even if the other experts had their own guesses.<br/><br/>“Let’s go, Let’s Go!”<br/><br/>After telling the fallen Shadow Devil Emperor and the rest, Wang Xian glanced at the disciples of the Dragon Palace. He nodded with a smile and said.<br/><br/>“Get Ready, don’t resist!”<br/><br/>After an lie said that, his energy enveloped everyone. In an instant, they disappeared and came to the palace of the Great Dao of heaven!<br/><br/>“This place is filled with majestic energy. It’s even more abundant than the energy in the tree of Chaos.”<br/><br/>“Yeah, if I cultivate here, I’ll be able to reach the peak of the ruler realm soon.”<br/><br/>“It’s at least twice as much as the tree of chaos, right? Where did the Dragon King take us?”<br/><br/>The disciples of the Dragon Palace came here and looked around in surprise.<br/><br/>“This is a special place in the chaos, called the riot zone. On both sides of this road, there are terrifying energy tides. The energy there can threaten powerhouses who have just entered the Heavenly Yuan blessed realm.”<br/><br/>“With your abilities, you will be killed instantly if you enter. Don’t enter recklessly.”<br/><br/>Wang Xian instructed all the disciples.<br/><br/>This time, there were more than 200,000 disciples from the Dragon Palace. They were among the first batch.<br/><br/>If everything went smoothly and there were no unforeseen circumstances, Wang Xian could consider summoning all the other disciples.<br/><br/>After all, cultivating here was much faster than cultivating in the Dragon Palace.<br/><br/>“All of you can move around in the surroundings for the time being. I’ll make some preparations too.”<br/><br/>Wang Xian instructed them.<br/><br/>“It’s the Dragon King!”<br/><br/>The disciples of the Dragon Palace replied immediately.<br/><br/>Wang Xian moved his palm and pieces of the Elemental God flew out.<br/><br/>Just like the Good Heaven Realm, Wang Xian wanted to use the elemental god pieces to attract the energy in the violent area and use them to build a cultivation treasure ground.<br/><br/>Wang Xian waved his arm. There were nine fragments of the Elemental God. Each of them had a certain attribute.<br/><br/>He entered one palace after another.<br/><br/>There were ten palaces built by Wang Xian.<br/><br/>Nine of them had nine different attributes. Each palace had a thousand cultivation spots.<br/><br/>After Wang Xian placed the fragments of the Elemental God into the palace, he waved his arm and began to draw them in.<br/><br/>He used the god of elements to guide nine types of energy into the palace.<br/><br/>Then, he guided them to the cultivation cattails in the palace.<br/><br/>The energy that was drawn over could not possibly allow all 200,000 disciples to cultivate.<br/><br/>If that was the case, the effects would be spread out too much.<br/><br/>Each cultivation venue had 1,000 cultivation cattails. This could increase the cultivation speed of these 1,000 disciples by ten times!<br/><br/>This was absolutely terrifying!<br/><br/>It was not difficult to guide the energy. Although Wang Xian did not understand the heaven’s fate level array formation, he had ten attributes, so it was very easy for him to guide it!<br/><br/>When the god of elements fragment was sent into the palace.<br/><br/>One could see that from the chaotic energy region at the side, rays of light were being guided into the palace.<br/><br/>Each ray of light represented an attribute.<br/><br/>That was the energy tunnel!<br/><br/>After Wang Xian received the light, he went to the location of the Tenth Palace, which was the central palace.<br/><br/>He took out the nine god of elements fragments again to create a core cultivation treasure ground.<br/><br/>In addition, Wang Xian waved his arm and the primal Chaos Stone appeared at the central location.<br/><br/>That’s right, the tenth palace. Wang Xian was using it to nurture disciples in the Heaven’s origin realm.<br/><br/>In this place, Wang Xian would use the primal chaos stone to open up the flow of time.<br/><br/>He would let the disciples in the Dragon Palace who were at the peak of the Dominator realm enter the palace to cultivate so that they could reach the threshold of a breakthrough as soon as possible.<br/><br/>This time, Wang Xian tried his best to increase the number of disciples in the Heaven’s origin realm in the Dragon Palace.<br/><br/>“Among the disciples of the Dragon Palace who came this time, 9,000 of them will enter the palace to cultivate according to their respective attributes. There will be a change every 10,000 years. All the disciples who are at the peak of the ruler realm, come to me.”<br/><br/>After Wang Xian finished setting up, his voice entered the ears of all the disciples.\t\t\t\t\t\t</div>", "images": {}, "success": true}