{"id": 1324, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075022.html", "title": "Chapter 4327 - Chapter 4327: 4326 Seconds To Kill The Ancestor Of The Sword Sect!", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4327 - Chapter 4327: 4326 Seconds To Kill The Ancestor Of The Sword Sect!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4327: 4326 seconds to kill the ancestor of the sword sect!<br/><br/>Translator: 549690339<br/><br/>Wang Xian’s gaze swept across the group of strong disciples of the Xiao Yao sect. He picked up the tea on the table and took a sip.<br/><br/>“They want to snatch the treasures in my hands. Naturally, I have to kill them.”<br/><br/>Wang Xian stared at them and spoke with a calm expression!<br/><br/>“Snatch Your Things? HMPH, would the disciples of the Xiao Yao sect snatch your things?”<br/><br/>More than 20 dominant disciples stared at Wang Xian and said coldly.<br/><br/>“Believe it or not, it’s up to you!”<br/><br/>Wang Xian looked at them and continued to speak indifferently!<br/><br/>“You’re courting death. Suppress him and hand him over to the Deacons of our sect to be judged!”<br/><br/>Among the more than 20 dominant disciples of the Xiao Yao sect, one of them who was at the peak of the dominant state spoke.<br/><br/>As soon as he finished his sentence, he waved his arm and a round ball attacked Wang Xian.<br/><br/>In the surrounding area, all the disciples of the Xiao Yao sect attacked in an attempt to suppress Wang Xian!<br/><br/>“Since you all want to die, I will grant your wish!”<br/><br/>Wang Xian stared at them with a cold expression on his face.<br/><br/>He waved his arm and a stream of flames attacked the more than 20 strong disciples of the Xiao Yao sect.<br/><br/>The Flames swept past, and the spheres that were charging towards him were instantly extinguished!<br/><br/>The Flames instantly covered their bodies.<br/><br/>“Quick, Dodge!”<br/><br/>The twenty plus ruler realm experts saw the terrifying flames instantly attack them.<br/><br/>They felt death approaching.<br/><br/>The peak ruler realm expert in the center couldn’t help but let out a wild roar.<br/><br/>However, as soon as he finished his sentence, their bodies were instantly incinerated and their vitality vanished.<br/><br/>Wang Xian waved his arm and stored all their corpses away.<br/><br/>These were considered a considerable amount of resources.<br/><br/>“Hiss!”<br/><br/>“This? This is the level of a saint. This is definitely the level of a Saint!”<br/><br/>“That fire attribute powerhouse is an existence at the level of the Heaven’s origin creation. Otherwise, it would be impossible for him to easily destroy a few existences at the peak of the Dominator realm!”<br/><br/>“Instant kill, instant kill. He is definitely an existence at the heavenly fate level.”<br/><br/>Everyone in the surrounding area was slightly shocked when they saw this scene. They said with shock on their faces!<br/><br/>Instant kill of a group of experts from the carefree sect, including a few existences at the peak of the ruler realm.<br/><br/>This was definitely an existence at the saint level, an existence at the heavenly fate level.<br/><br/>In the Justice Alliance, there were many titles for existences at this level.<br/><br/>A saint, a Tianyuan creation, and a sect leader.<br/><br/>The strength displayed by Wang Xian was definitely at the level of a saint.<br/><br/>“Eh?”<br/><br/>At this moment, a few hundred strong disciples flew over on swords.<br/><br/>These few hundred disciples were all strong disciples of the sword sect.<br/><br/>Just a moment ago, they received news that a great opportunity in the body of a disciple of their sword sect, a treasure at the Heavenly Yuan creation level, had been taken away by an expert at the peak of the ruler realm.<br/><br/>And they had been exterminated.<br/><br/>This made them extremely furious.<br/><br/>He actually dared to kill a disciple of their sword sect.<br/><br/>He dared to snatch the treasures of their sword sect?<br/><br/>Hundreds of sword sect disciples quickly gathered together and rushed over.<br/><br/>However, the moment they rushed over, they saw a group of strong disciples from the carefree sect being killed.<br/><br/>This made them slightly shocked and looked at Wang Xian with a face full of fear.<br/><br/>“Which universe are you a saint from? You killed the disciples of our sword sect and the carefree sect and stole our treasures. Are you trying to make an enemy out of our two great sects?”<br/><br/>At the sword sect, an expert who was at the peak of the Dominator realm stared at Wang Xian with a solemn expression and asked.<br/><br/>Although Wang Xian was strong, they had a powerful sect behind them. They were not afraid of an expert who was in the Heaven’s origin realm.<br/><br/>At the same time, they immediately reported the news to the saint of the sword sect.<br/><br/>“I’m snatching treasures? Your Sword sect disciples don’t know how to repay kindness with kindness. Since they have failed to educate you, I can only help you to educate them!”<br/><br/>Wang Xian stared at them and said coldly.<br/><br/>“It’s your turn to educate the disciples of my sword sect?”<br/><br/>However, the moment Wang Xian finished his sentence, a powerful pressure came crushing down on him.<br/><br/>“The saint of the sword sect is here!”<br/><br/>“He’s here. Currently, there are many powerhouses at the heaven-reaching Great Dao. Many saints of the sword sect are here!”<br/><br/>“The saint of the Xiao Yao sect should be here soon. In addition, the Xiao Yao boat is in the riot zone. The leader of the Xiao Yao sect should be here too. This saint is done for!”<br/><br/>In the surrounding area, when all the strong disciples heard this voice, their eyes narrowed slightly.<br/><br/>The experts from the sword sect had arrived!<br/><br/>Wang Xian looked ahead and saw a middle-aged man dressed in white who was riding a sword. His eyes flickered slightly!<br/><br/>“I want to see who dares to be impudent with our sword sect!”<br/><br/>The middle-aged man dressed in white stared at Wang Xian and spoke with a cold expression!<br/><br/>“Greetings, Patriarch of the Windless sect!”<br/><br/>“Greetings, Patriarch of the Windless sect!”<br/><br/>When the strong disciples of the sword sect saw their patriarch of the windless sect flying over, they immediately greeted him respectfully!<br/><br/>“It seems that your sword sect lacks education from bottom to top!”<br/><br/>Wang Xian stared at the middle-aged man in white and spoke indifferently!<br/><br/>In the next instant, his figure disappeared instantly!<br/><br/>“HMM?”<br/><br/>In the sword sect, the ancestor of the wind attribute windless sect saw Wang Xian disappear instantly and his pupils contracted slightly.<br/><br/>A bad premonition appeared in his eyes.<br/><br/>How was this possible?<br/><br/>He actually couldn’t figure out his figure.<br/><br/>“You lack education. Then die!”<br/><br/>In the next instant, the ancestor of the windless sect sensed a voice appearing by his ear.<br/><br/>This made his hair stand on end and he revealed a terrified expression.<br/><br/>His strength was only at the beginner level.<br/><br/>There was a huge gap between him and Wang Xian.<br/><br/>Faced with Wang Xian’s attack, there was no way for him to dodge.<br/><br/>“Bang!”<br/><br/>A flaming palm landed on the head of the ancestor of the windless sect. The terrifying power of the Flames instantly destroyed his life force!<br/><br/>He was killed before he could even let out a scream!<br/><br/>The difference was too great!<br/><br/>Wang Xian waved his arm and kept the corpse of the patriarch of the windless sect.<br/><br/>Now, it was too easy for him to kill a beginner-level powerhouse.<br/><br/>“This… this… This is impossible!”<br/><br/>An instant change.<br/><br/>The Patriarch of the windless sect was killed in an instant.<br/><br/>This caused the more than 200 disciples of the sword sect to reveal expressions of shock.<br/><br/>How was this possible?<br/><br/>One of their sword sect’s patriarchs had just flown over on his sword and was instantly killed.<br/><br/>This intense contrast made them too shocked!<br/><br/>An existence that had stepped into the saint realm was actually instantly killed.<br/><br/>Just who was this youth?<br/><br/>Just what kind of existence was he that was fighting against their sword sect?<br/><br/>“Hiss!”<br/><br/>At this moment, all the surrounding experts and disciples were extremely shocked when they saw this scene.<br/><br/>The Saint Realm was an existence in the Heavenly Yuan blessed realm.<br/><br/>In their eyes, he was an existence that was immortal and lofty.<br/><br/>But now, a sword sect’s patriarch was instantly killed just like that.<br/><br/>He was killed as if he had crushed an ant.<br/><br/>This made them feel incredible!<br/><br/>They were horrified!\t\t\t\t\t\t</div>", "images": {}, "success": true}