{"id": 1328, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075038.html", "title": "Chapter 4331 - Chapter 4331: 4330 Song Ta And Old Man Jian Had Rushed Over!", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4331 - Chapter 4331: 4330 Song Ta And Old Man Jian Had Rushed Over!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4331: 4330 song Ta and old man Jian had rushed over!<br/><br/>Translator: 549690339<br/><br/>Saint Shan Tian had already experienced Wang Xian’s strength.<br/><br/>It was obviously an unwise choice for an expert of such a level.<br/><br/>Furthermore, no one knew if he had his own forces or if he had other subordinates in the Heavenly Yuan blessed realm.<br/><br/>If he did, he would be even more troublesome and powerful.<br/><br/>Therefore, the sage of good days will not act when he sees this situation.<br/><br/>Although, he and the Xiaoyao sect are both members of the Justice League.<br/><br/>The Justice League. They may be a league, but they have many rules.<br/><br/>For example, in the face of the invasion of the evil sequence camp, they have to cooperate.<br/><br/>But in this case, it’s clearly personal.<br/><br/>This kind of situation even happened in the Justice Alliance from time to time.<br/><br/>An alliance couldn’t be an iron plate.<br/><br/>Sometimes, there would be fights within the alliance.<br/><br/>There would also be casualties.<br/><br/>However, under normal circumstances, a great battle wouldn’t break out.<br/><br/>Great battles would be stopped, and peace would be negotiated!<br/><br/>“The divination lamp that was traded to Saint Saint Shan Tian seems to be something that you can’t refuse!”<br/><br/>Xiaoyao cult patriarch heard the words of the saint of good days, the face of the solemn opened his mouth and said.<br/><br/>The lamp of divination. He knows.<br/><br/>In a way, it can change the course of a battle.<br/><br/>We can attack, we can retreat.<br/><br/>He could not understand why the saint was willing to trade such a treasure.<br/><br/>You know, the entire Justice League, many powerful people are coveting this treasure of the Sage of heaven.<br/><br/>Saint Shan Tian smiled and didn’t say anything!<br/><br/>“Hiss, this? ? The carefree sect ancestor and Saint Shan Tian from the good heaven realm are all here.”<br/><br/>“That mysterious expert said that the carefree sect ancestor isn’t his match? No Way? He’s So Strong?”<br/><br/>“Hiss, how terrifying. Saint Shan Tian actually made a deal with that mysterious expert.”<br/><br/>All the experts in the surroundings were extremely shocked when they saw this scene.<br/><br/>Saint Shan Tian, the ancestor of the Xiao Yao sect. This was a well-known existence in the entire Justice Alliance!<br/><br/>Now, they were all gathered here.<br/><br/>“I don’t care who you are, which universe you come from, or how much power you have. Now, give me an explanation. Otherwise, let’s start a war!”<br/><br/>The ancestor of the Xiao Yao sect stared at Wang Xian and spoke with a cold expression!<br/><br/>Although Wang Xian was very strong, the Xiaoyao sect was not afraid at all!<br/><br/>“Hehe, I will give you an explanation. You can investigate the details yourself. You are not qualified yet. Let Me Give You an explanation!”<br/><br/>Wang Xian did not give the patriarch of the Xiaoyao sect any face and replied with disdain!<br/><br/>“Kill!”<br/><br/>When the Patriarch of the Xiaoyao sect heard Wang Xian’s words, killing intent flashed in his eyes.<br/><br/>His palm landed on the dragon boat, which trembled slightly. In the ocean below, an extremely powerful sea monster attacked Wang Xian directly.<br/><br/>“Hehe, then let’s Fight!”<br/><br/>Wang Xian sneered. He waved his arm and a divine dragon attacked the sea monster.<br/><br/>“Make your move. We Don’t care where you are from, but this time, you are provoking the Xiaoyao sect and our sword sect!”<br/><br/>An expert at the control level of the sword sect shouted with a face full of killing intent!<br/><br/>They launched their attacks at the same time and charged at Wang Xian.<br/><br/>When Wang Xian saw their attacks, a cold look appeared in his eyes. “Since we are going to start a war, I will make the carefree sect and the sword sect pay a terrible price after today!”<br/><br/>Boom<br/><br/>Wang Xian’s body trembled and he flew towards a direction.<br/><br/>Wang Xian was prepared to retreat!<br/><br/>If he continued to fight with them, Wang Xian would not gain any advantage at all!<br/><br/>In that case, there was no need to continue the battle!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Whoosh! Whoosh<br/><br/>Just as Wang Xian was about to retreat, his gaze focused slightly!<br/><br/>“Our sword ancestor is here. Trap him!”<br/><br/>At the Sword sect, the five heaven origin creation stage powerhouses felt the aura coming from behind. Their faces lit up as they shouted immediately!<br/><br/>Streams of energy were heading towards Wang Xian!<br/><br/>“The sword ancestor of the Sword sect and song Ta are here!”<br/><br/>When the carefree sect ancestor felt the aura coming from behind, his gaze focused and his eyes shone.<br/><br/>“Carefree Heaven and Earth!”<br/><br/>Without any hesitation, he took a step towards the carefree boat with his right foot.<br/><br/>The vast ocean below the carefree boat was spreading towards the surroundings at a terrifying speed.<br/><br/>In an instant, Wang Xian was enveloped above the ocean!<br/><br/>“The strongest person in the sword sect, the senior devil sword ancestor, is here!”<br/><br/>“The Great Dao level experts from the sword sect are here. With this, the carefree sect and the sword sect are on the upper hand!”<br/><br/>“That’s not right. Other than the sword ancestor, there’s another great dao level expert.”<br/><br/>At this moment, dozens of heaven origin blessed realm experts were hiding in the surrounding void.<br/><br/>All of them were here to watch the Show!<br/><br/>Now that they saw the strongest person from the sword sect rushing over, their gaze froze!<br/><br/>Once the strongest person from the sword sect came over, the sword sect and the carefree sect would have the complete upper hand.<br/><br/>They could even make that mysterious powerhouse pay a heavy price!<br/><br/>Wang Xian swept his gaze across the ocean below.<br/><br/>The Patriarch of the carefree sect wanted to use the powerful Heaven’s origin blessed supreme treasure to trap him for some time.<br/><br/>However, when he sensed the two auras in the distance.<br/><br/>Wang Xian, who was prepared to leave immediately and fight with them in the future, stopped.<br/><br/>The two figures who were rushing over from the distance had very familiar auras!<br/><br/>Especially the sharp sword rays!<br/><br/>“It’s them!”<br/><br/>Wang Xian recognized them. He hesitated for a moment and looked over quietly!<br/><br/>The discussions around him also made Wang Xian understand a little!<br/><br/>However, this made him very surprised.<br/><br/>All of this was really a coincidence!<br/><br/>He didn’t expect that this sword sect actually had such a deep relationship with that old man sword.<br/><br/>Furthermore, the old man sword was suspected to be the strongest person in the sword sect?<br/><br/>This? ? ?<br/><br/>He had fought with an acquaintance?<br/><br/>After the last time when he joined hands with the old man sword, Song Ta, and the others, Wang Xian admitted that he had some friendship with them!<br/><br/>Wang Xian stopped.<br/><br/>Two figures from afar also rushed over at a terrifying speed!<br/><br/>“Sword ancestor, you came at the right time!”<br/><br/>The carefree sect’s ancestor was a little surprised when he saw that Wang Xian did not escape.<br/><br/>He did not think too much about it. He looked at the two figures who were flying over quickly and spoke!<br/><br/>“Senior sword ancestor, you are finally here. Wufeng was killed by him. Many disciples of the sword sect were also killed by him!”<br/><br/>The eyes of the experts from the sword sect were glowing. They immediately reported loudly to the sword ancestor of the sword sect!<br/><br/>The sword old man still had the appearance of a demon sword. He looked a little strange and terrifying.<br/><br/>At the side, Song Ta was on his body. He was holding a pagoda in his hand!<br/><br/>However, the two of them did not attack immediately when they arrived.<br/><br/>They didn’t reply to their words either.<br/><br/>They looked at Wang Xian in astonishment.<br/><br/>“What’s going on, brother Wang Xian?”<br/><br/>Song Ta looked at Wang Xian before looking around. He asked in astonishment, “Why are our people fighting?”<br/><br/>“Huh?”<br/><br/>His words stunned all the strong disciples around him.<br/><br/>What was going on?<br/><br/>Our people?\t\t\t\t\t\t</div>", "images": {}, "success": true}