{"id": 1329, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075042.html", "title": "Chapter 4332 - Chapter 4332: 4331 Revenge Turned Into Kindness", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4332 - Chapter 4332: 4331 Revenge Turned Into Kindness</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4332: 4331 revenge turned into kindness<br/><br/>Translator: 549690339<br/><br/>The arrival of the strongest expert of the sword sect and the arrival of Song Ta.<br/><br/>Two experts of the Great Dao level rushed over, causing all the surrounding experts and disciples to reveal shocked expressions.<br/><br/>Within a short period of time, four of the most top-notch sect ancestors and Saints had arrived!<br/><br/>These people were the most top-notch existences in the entire Justice Alliance.<br/><br/>Including that mysterious expert, there were already five of them.<br/><br/>However, just as they thought that there would be a world-shaking battle, Song Ta’s words caused all the expert disciples to be stunned.<br/><br/>“What’s going on? The expert beside the sword ancestor actually knows that mysterious expert?”<br/><br/>“One of their own? Looks like they know each other!”<br/><br/>“No way! What’s going on? Which faction is that mysterious expert from? Is He also a top-tier expert of the Justice Alliance?”<br/><br/>All the expert disciples stared at this scene with their mouths Agape as they asked!<br/><br/>The carefree sect ancestor was also slightly stunned when he heard song Ta’s words!<br/><br/>His face was filled with shock!<br/><br/>“Song Ta, you guys know each other?”<br/><br/>The carefree sect ancestor’s expression changed slightly as he asked Song Ta.<br/><br/>They were all top-tier experts within the Justice Alliance.<br/><br/>They naturally knew each other!<br/><br/>Song Ta was a powerful expert from the justice universe.<br/><br/>He was one of the founders of the Justice Alliance.<br/><br/>He wasn’t the strongest within the Justice Alliance, but his status was very high.<br/><br/>Another point was that the justice universe that song Ta was in was the strongest universe in the Justice Alliance.<br/><br/>At the same time, the leader of the Justice Alliance was the strongest in the justice universe.<br/><br/>Similarly, he was also the strongest existence in the Justice Alliance.<br/><br/>However, the leader of the Justice Alliance had not appeared for a long time!<br/><br/>“We know each other, of course we know each other. Not long ago, Old Man Sword and I teamed up with brother Wang Xian to kill that fellow, the spirit kneader. Hehe.”<br/><br/>Song Ta said with a smile on his face!<br/><br/>“HMM?”<br/><br/>His words gave the ancestors of the Xiaoyao sect a slight shock.<br/><br/>“Brother Song Ta, Brother Old Man Jian, I didn’t expect to meet you so soon, and in such a manner.”<br/><br/>Wang Xian looked at them, shook his head slightly and said!<br/><br/>“It’s indeed very fast. The flood has really washed over the Dragon King Temple!”<br/><br/>The serious old man Jian nodded his head and said, “I don’t know what small matter it is that caused brother Wang Xian to make such a big fuss!”<br/><br/>“Old man Jian, are you the sword ancestor of the sword sect? I came across something good while I was wandering around just now.”<br/><br/>Wang Xian smiled and moved his palm. He did not hide anything and took out the embryo directly. “A disciple of your sword sect was possessed by an expert. I happened to sense it, so I took it out.”<br/><br/>“Later on, they said it was their treasure. Hehe, I casually destroyed them!”<br/><br/>“However, I was really lucky this time. There was actually a great dao level powerhouse who was parasitizing your sword sect’s disciples. I think that with this powerhouse’s parasitizing technique, you wouldn’t be able to find out. Therefore, this belongs to me. Hehe!”<br/><br/>“Of course, if this parasitizing technique belonged to your sword sect’s powerhouse, that’s another story!”<br/><br/>As Wang Xian spoke, he smiled faintly.<br/><br/>This expert at the level of the Great Dao was indeed strong in his ability to possess.<br/><br/>If it wasn’t for the fact that Wang Xian could sense the power of chaos in his body, he wouldn’t have been able to notice it!<br/><br/>If he couldn’t notice it, then with old man Jian’s strength, he wouldn’t be able to notice it either!<br/><br/>At that time, a disciple from the sword sect would also be possessed silently.<br/><br/>Of course, Wang Xian wasn’t unreasonable.<br/><br/>If this was a strong practitioner of the sword sect who possessed a disciple of their own sect, Wang Xian would return the embryo to him!<br/><br/>“This is?”<br/><br/>When Wang Xian took out the embryo, the eyes of the patriarch of the Xiaoyao sect froze and a look of shock appeared on his face!<br/><br/>“A strong practitioner of the Great Dao level, possessing a parasite?”<br/><br/>Song ta cried out in surprise and flew directly towards Wang Xian. His gaze was fixed on the embryo!<br/><br/>Old Man Jian also flew over immediately and sized up the embryo carefully!<br/><br/>“D * mn, old man Jian, feel the aura of this embryo. This is the F * cking aura of a devil man. Didn’t we kill this fellow completely?”<br/><br/>All of a sudden, song ta cried out in surprise and shouted at old man Jian!<br/><br/>“It is indeed the aura of a devil man. No, this is a devil man!”<br/><br/>Old Man sword stared at the embryo, his eyes slowly revealing a serious expression.<br/><br/>“More than 10 billion years ago, this guy raised creatures from the universe and was completely destroyed by US and the Deputy Alliance leader. I thought he really was completely killed. I didn’t expect that this guy actually didn’t die!”<br/><br/>“And he actually latched onto old man sword’s disciple. This is obviously revenge!”<br/><br/>Song ta exclaimed, his expression changing slightly!<br/><br/>The Demon was an expert of the sword universe. Speaking of which, he was an existence that was even older and stronger than old man sword.<br/><br/>However, old man sword caught up later, and the sword sect grew stronger. With a leap, he became the strongest force in the sword universe, and Old Man Sword also became the strongest existence.<br/><br/>At that time, there was a conflict with the sect created by the demon.<br/><br/>However, both sides were stable.<br/><br/>But later, the demons were unwilling to live under others, unwilling to let the sword sect grow stronger, so they wanted to quickly increase their own strength.<br/><br/>They raised living beings to slaughter, taking their souls and preparing to refine the demon sword.<br/><br/>In the end, the matter was exposed.<br/><br/>The actions of the demons were completely dehumanizing existences that had no connection with the evil sequence alliance.<br/><br/>Therefore, old man sword reported this matter to the Justice Alliance.<br/><br/>After verification, it was confirmed that they had eliminated them!<br/><br/>However, he didn’t expect that they didn’t die. They were still living in the body of a sword sect disciple!<br/><br/>“The demons cultivate all kinds of evil techniques. There’s a slight possibility that they didn’t die. They are living in the body of a sword sect disciple. They must be seeking revenge!”<br/><br/>“I wonder how long he’s been parasitizing for, but he hasn’t been discovered!”<br/><br/>Old Man Jian said with a grave expression!<br/><br/>This was a major event for the sword sect, an extremely terrifying event.<br/><br/>Old Man Jian had a deep understanding of the terror of the demon!<br/><br/>Back then, in order to exterminate it, four great dao experts and the powers of all the heaven origin creation experts of the sword sect had been mobilized.<br/><br/>They had paid a great price to completely destroy it.<br/><br/>At that time, they thought that they had killed it, but they did not expect that they had let it escape with a chance of survival.<br/><br/>They had actually let it live in a disciple’s body, preparing to possess it.<br/><br/>Most importantly, the devil was right under their noses, and they had not even noticed it.<br/><br/>Just imagining it made him feel a little terrifying!<br/><br/>If he were to recover his strength bit by bit, it would be an unimaginable disaster for the sword sect and the sword universe!<br/><br/>“Old Man Sword, you didn’t notice the crisis under your noses. Now that brother Wang Xian has discovered it, this is a huge good thing for your sword sect. Your Sword sect should thank him properly.”<br/><br/>Song Ta spoke to Old Man Sword!\t\t\t\t\t\t</div>", "images": {}, "success": true}