{"id": 1323, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075018.html", "title": "Chapter 4326 - Chapter 4326: 4325 Greed Was The Original Sin", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4326 - Chapter 4326: 4325 Greed Was The Original Sin</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4326: 4325 greed was the original sin<br/><br/>Translator: 549690339<br/><br/>“Is it really the body and consciousness of a heaven-origin creation-level powerhouse?”<br/><br/>In the trading area, six young men and women surrounded Wang Xian. When they heard that Wang Xian actually admitted that the embryo was of the heaven-origin creation-level.<br/><br/>This made their eyes burn with excitement.<br/><br/>It was a treasure of the heaven-origin creation-level.<br/><br/>Possession and rebirth.<br/><br/>If a powerhouse of this level could undergo possession and rebirth, he would be able to possess the inheritance and everything of this heaven-origin creation-level powerhouse.<br/><br/>A treasure of this level was extremely terrifying!<br/><br/>Any disciple or faction would be tempted!<br/><br/>Jian Tianyao pursed her lips and her eyes revealed a fiery expression.<br/><br/>“My friend, this treasure belongs to our friend. Isn’t it inappropriate for you to take it away like this?”<br/><br/>A young man squinted his eyes and stared at Wang Xian as he spoke!<br/><br/>Jian Tianyao heard him and looked at him without saying a word!<br/><br/>“This treasure belongs to our sword sect. This treasure belongs to my junior sister. Please hand it over as well!”<br/><br/>Jian Tianyao’s young senior brother stared at Wang Xian as he spoke with an expressionless face!<br/><br/>Wang Xian couldn’t help but laugh when he heard their words.<br/><br/>“Greed is the greatest sin!”<br/><br/>Wang Xian stared at them and said, “Now, this treasure belongs to me. If you want to take it away, I won’t hold back either!”<br/><br/>“This item originally belongs to me. Although it was discovered by you, our sword sect has many powerhouses in the Heaven’s origin realm. If it wasn’t discovered by you today, it would have been discovered by the other powerhouses. I am very grateful to you. When the time comes, I will give you some rewards and return the embryo to me!”<br/><br/>Jian Tian Yao’s expression changed as she spoke to Wang Xian!<br/><br/>She wanted to obtain such a powerful treasure.<br/><br/>A treasure of this level was a huge treasure for the sword sect.<br/><br/>They had to fight for it.<br/><br/>Furthermore, this was a treasure in her body.<br/><br/>It was just returning it to its owner!<br/><br/>Wang Xian squinted his eyes slightly when he heard Jian Tianyao’s words. He swept his gaze across them and said, “Don’t you know how to repay a debt of gratitude? All of you are courting death, do you understand?”<br/><br/>“We are courting death? I think you are courting death. Hand over the treasure immediately. Otherwise, don’t blame us for being impolite!”<br/><br/>Jian Tianyao’s senior brother stared at Wang Xian coldly and berated him.<br/><br/>At this moment, he had also shed all pretenses of cordiality!<br/><br/>“What if I say no?”<br/><br/>Wang Xian looked at them indifferently and spoke coldly!<br/><br/>“Then our sword sect will not let you off!”<br/><br/>Jian Tian Yao stared at Wang Xian coldly.<br/><br/>At the same time, they began to send messages in secret.<br/><br/>They knew Wang Xian’s strength. Furthermore, he did not hide his strength and was at the peak of the Dominator realm.<br/><br/>They were not his match.<br/><br/>However, there were a large number of strong disciples from their sword sect in the surroundings.<br/><br/>They were able to rush over quickly!<br/><br/>“You’re courting death!”<br/><br/>Wang Xian stared at them with a hint of killing intent on his face!<br/><br/>He waved his arm and a stream of flame shot towards them!<br/><br/>In the trading zone, all the forces silently agreed that there would not be any fighting.<br/><br/>However, there were no specific rules.<br/><br/>However, the powerhouses from all the universes also warned their disciples not to cause trouble in the trading zone.<br/><br/>This was because there were too many strong disciples from all the universes in the current chaotic zone.<br/><br/>If they were to incur the wrath of the masses, or if they were to fight here and affect the disciples from the powerful universes, they would have to wait for their revenge.<br/><br/>Therefore, the strong disciples from the big sects of the universe would not fight here.<br/><br/>Wang Xian’s sudden attack caused the expressions of Jian Tian Yao and the rest to change drastically!<br/><br/>The expressions of the six of them changed drastically as they hurriedly dodged to the side.<br/><br/>However, their dodging speed was still a little slow!<br/><br/>The terrifying flames landed directly on their bodies.<br/><br/>The few of them were not very strong to begin with. Even if Wang Xian had concealed his strength, there was still no room for resistance!<br/><br/>The bodies of the six of them were instantly burned to death!<br/><br/>“Eh? What Happened?”<br/><br/>“There was actually a battle here. Six of them were instantly killed. What kind of conflict happened?”<br/><br/>“Interesting. They actually dared to fight in the trading area. Who are they? Which universe and which faction are they from?”<br/><br/>“The few people who were killed seemed to be disciples of the sword sect and the carefree sect. No Way. The disciples of the sword sect and the carefree sect also dared to kill them?”<br/><br/>Wang Xian’s sudden attack from the surrounding areas attracted the attention of all the strong disciples.<br/><br/>They looked over and revealed an astonished expression.<br/><br/>“Eh? He actually dared to kill the disciples of our Xiao Yao Sect?”<br/><br/>Among them, there were even disciples of the Xiao Yao sect. When they looked over, their eyes focused. Their eyes were filled with a cold and sinister look.<br/><br/>The news of the disciples of the two major religions being killed spread to the surroundings at a terrifying speed.<br/><br/>Wang Xian casually killed six people without any change in his expression.<br/><br/>He swept his gaze across the surroundings and felt some hostility.<br/><br/>Wang Xian didn’t pay any attention to it. He flew straight to a high tower.<br/><br/>This was a mechanical high tower. There was a platform on the high tower.<br/><br/>There were robots performing on the platform.<br/><br/>Wang Xian sat there and ordered some tea indifferently. He sat there and waited quietly.<br/><br/>He had to understand this matter.<br/><br/>Wang Xian didn’t want them to go to the palace of the great way of the heavens and disturb the cultivation of the disciples of the Dragon Palace.<br/><br/>“This guy didn’t leave!”<br/><br/>“He must have some background. Otherwise, he wouldn’t stay so calm after killing the disciples of the sword sect and the carefree sect!”<br/><br/>“In the universe around us, the sword sect and the carefree sect are the top sects. Now that he dares to kill the disciples of two sects at the same time, who can protect him?”<br/><br/>Some of the universe’s disciples looked at him in surprise and whispered.<br/><br/>“Boom! Boom! Boom! Boom!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>While they were talking, terrifying auras flew toward them!<br/><br/>The powerful disciples gave off killing intent.<br/><br/>“Who dares to kill the disciples of the Walkabout sect?”<br/><br/>More than 20 overlord realm disciples flew over. The five leading them were all existences at the peak of the Overlord realm.<br/><br/>The disciple in the middle was holding a blood-red needle in his hand.<br/><br/>The needle was pointing at Wang Xian’s position.<br/><br/>“How fast!”<br/><br/>Wang Xian had just sat down when he saw them flying over. His eyes revealed a cold expression.<br/><br/>Whoosh! Whoosh! Whoosh! Whoosh<br/><br/>One by one, figures flew over and locked their eyes on Wang Xian.<br/><br/>“It has nothing to do with you. Move aside.”<br/><br/>An expert who was at the peak of the ruler realm from the carefree sect glanced at the disciples around Wang Xian and said!<br/><br/>“Let’s Go and watch the show from the side!”<br/><br/>Some of the strong disciples around them exchanged glances and quickly made way for them.<br/><br/>“Interesting. Someone actually dares to provoke the carefree sect!”<br/><br/>The strong disciples looked over with interest.<br/><br/>“Did you kill the disciples of our Xiao Yao Sect?”<br/><br/>More than 20 figures stared at Wang Xian and questioned him coldly.\t\t\t\t\t\t</div>", "images": {}, "success": true}