{"id": 1320, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075006.html", "title": "Chapter 4323 - Chapter 4323: Trade Area 4322", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4323 - Chapter 4323: Trade Area 4322</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4323: Trade Area 4322<br/><br/>Translator: 549690339<br/><br/>“Greetings, Dragon King.”<br/><br/>“Greetings, Master!”<br/><br/>Sixty-eight disciples at the peak of the Universe Dominator realm came up to Wang Xian and greeted him respectfully.<br/><br/>Wang Xian looked at them and nodded his head in satisfaction.<br/><br/>“All of you enter this place to cultivate and strive to reach the threshold of the Heaven’s origin realm. Inform me immediately once you reach it.”<br/><br/>Wang Xian looked at them. “The flow of time in this place is 100 times slower than in the outside world. In other words, all of you will cultivate in this place for 10,000 years, which is equivalent to one million years.”<br/><br/>“In addition, I will guide the surrounding energy into the place where all of you cultivate. Cultivating in this place is much higher than cultivating in the tree of Chaos.”<br/><br/>“Don’t disappoint me!”<br/><br/>Wang Xian said faintly to them.<br/><br/>“It’s the Dragon King. We will do our best to reach the threshold of the Heaven’s origin realm.”<br/><br/>The disciples of the Dragon Palace said with determination.<br/><br/>They had advanced to their current level, but they had consumed too many resources.<br/><br/>The corpses of the experts in the Heaven’s origin realm could be easily absorbed.<br/><br/>All kinds of powerful energy were for them to consume.<br/><br/>A large portion of the resources of the Dragon Palace were concentrated on them.<br/><br/>“Go!”<br/><br/>Wang Xian nodded at them.<br/><br/>The group of disciples of the Dragon Palace immediately entered the primal Chaos Stone and began to cultivate!<br/><br/>In the other few palaces, the group of disciples also began to cultivate.<br/><br/>The God of elemental fragments attracted the energy in the surroundings and emitted powerful fluctuations. It was exceptionally eye-catching on the Great Dao of heaven.<br/><br/>Wang Xian made some simple arrangements to conceal the energy of the god of elemental fragments.<br/><br/>After that, he stayed quietly in the palace and opened the heaven-origin communication device.<br/><br/>In Wang Xian’s hands, there were still a lot of resources.<br/><br/>For example, the corpse of the spiritual person.<br/><br/>Half of the corpse of the spiritual person could be exchanged for a huge amount of resources.<br/><br/>Although it was not enough for Wang Xian to achieve a breakthrough in his strength, he could obtain a lot of accumulation.<br/><br/>In addition, he still had more than ten fragments of the Elemental God in his hands.<br/><br/>These fragments of the Elemental God were also very valuable.<br/><br/>Of course, Wang Xian could also use these fragments of the Elemental God to continue to build a holy land for cultivation.<br/><br/>However, in order to prevent any accidents from happening, Wang Xian still gave up.<br/><br/>In this chaotic area, no one knew if there would continue to be unrest.<br/><br/>If there were to be another huge change, it would be extremely dangerous for too many disciples to stay here.<br/><br/>Through the Heaven’s origin communication device, he also learned that a large number of factions from the Justice Alliance had come to the Great Dao of heaven to build a cultivation ground.<br/><br/>This also made the chaotic area extremely lively.<br/><br/>Naturally, there would be business in places where there were many strong disciples.<br/><br/>At the entrance of the Great Dao of Heaven, a trading area was formed.<br/><br/>Wang Xian looked at the information and then looked at the information in the trading area. He was considering whether he should make a move on the other half of the spiritual being’s body.<br/><br/>After thinking for a while, he gave up. There was no rush.<br/><br/>There were still many more resources before he needed to make a breakthrough.<br/><br/>There was no rush to make a move now.<br/><br/>“Disciples of the Dragon Palace, if you have nothing to do, you can take a stroll around.”<br/><br/>Wang Xian read some information and sent a voice transmission to all the disciples of the Dragon Palace.<br/><br/>Things like cultivation were not always done in seclusion.<br/><br/>Sometimes, inspiration was needed.<br/><br/>In fact, inspiration was more important than hard work.<br/><br/>In addition, he wanted to let the disciples of the Dragon Palace meet the strong disciples outside to broaden their horizons.<br/><br/>Some of the disciples of the Dragon Palace nodded their heads in excitement when they heard Wang Xian’s words.<br/><br/>Some of the disciples even prepared to form a team to take a look around.<br/><br/>In any case, there were only 9,000 spots for cultivation in the nine palaces.<br/><br/>Although the cultivation speed here was very fast, they had been cultivating for a long time and wanted to take a look around as well.<br/><br/>Some of the disciples left.<br/><br/>Wang Xian closed his eyes quietly.<br/><br/>Not long after, an lie came over with a piece of news. There were many peak races in the nine-origin universe who were prepared to bring their disciples over.<br/><br/>Among them, the Shadow Devil Emperor would also come over to take a look.<br/><br/>After Wang Xian received this news, he was not surprised.<br/><br/>Now that the nine-origin universe was in a relatively safe situation, it was normal for some experts to seek opportunities in the chaos.<br/><br/>However, it would take them tens of thousands of years to rush here from the nine-origin universe.<br/><br/>With this thought in mind, Wang Xian sat down cross-legged and began to cultivate.<br/><br/>After cultivating for thousands of years, Wang Xian felt a little bored.<br/><br/>Cultivating here for thousands of years was simply too little for the improvement of the Dragon Qi in his body.<br/><br/>Based on this cultivation speed, it was estimated that Wang Xian would need tens of billions of years to break through.<br/><br/>He looked at the interior of the primal chaos stone.<br/><br/>A group of disciples were cultivating.<br/><br/>However, among them, bei Shuang was the most powerful.<br/><br/>This time, Wang Xian obtained an ice attribute chaos gem. The grade of this gem was extremely high.<br/><br/>There was a high chance that bei Shuang would be able to achieve a breakthrough.<br/><br/>As a mutated divine dragon, bei Shuang’s current strength was extremely terrifying.<br/><br/>The chaos gem floated above his head as he absorbed it bit by bit.<br/><br/>In the surrounding area, the other disciples were equally powerful.<br/><br/>This was the future pillar of the Dragon Palace.<br/><br/>He swept his gaze across the surroundings and flew out of the palace.<br/><br/>He looked to his left and right. A few thousand kilometers away from both sides, there were factions that had built their own cultivation treasure grounds.<br/><br/>They did not disturb each other.<br/><br/>He had also seen it in the Tianyuan communication device. Some of the experts from the Justice Alliance had said that it was best not to fight in the riot zone.<br/><br/>This had gained the support of many experts.<br/><br/>Wang Xian flew straight towards the starting point of the Great Dao of heaven.<br/><br/>Over the past few thousand years, a large-scale trading ground had been formed there.<br/><br/>Wang Xian flew over, and the energy in his entire body was restrained.<br/><br/>Currently, he had fused 2/10,000 of the primal chaos stone.<br/><br/>There was an additional type of energy in his body, along with the power of chaos.<br/><br/>Although this energy was extremely rare in Wang Xian’s body, its level was terrifyingly high.<br/><br/>As Wang Xian circulated it, his aura was directly reduced to the peak of the ruler realm, the fire attribute.<br/><br/>Although the primal Chaos Stone was now separated from his body, after this period of research, he was able to summon the primal chaos stone over in an instant.<br/><br/>Another point was that other experts could not control the primal chaos stone at all.<br/><br/>Therefore, he was not worried that the primal chaos stone would be taken away.<br/><br/>With a move, Wang Xian flew rapidly towards the trading ground in the riot zone.<br/><br/>On the avenue of Heaven, he could see all kinds of powerful disciples.<br/><br/>Technology, magic, mystery, immortals, Buddhas, and all kinds of special flying machines.<br/><br/>“It’s quite lively.”<br/><br/>Wang Xian came to this trading ground.<br/><br/>The trading area was very big now. Some of the universes and forces even started doing business here.<br/><br/>Cultivation was a lonely place for any strong disciple.<br/><br/>Sometimes, it was a good choice to come here to relax.<br/><br/>Wang Xian walked in the trading area and looked at all kinds of strong disciples from different universes. He was in a good mood.<br/><br/>It had been a long time since he last walked around the bustling area.\t\t\t\t\t\t</div>", "images": {}, "success": true}