{"id": 1325, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075026.html", "title": "Chapter 4328 - Chapter 4328: 4327, Instantly Killing A Control-Level Expert", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4328 - Chapter 4328: 4327, Instantly Killing A Control-Level Expert</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4328: 4327, instantly killing a control-level expert<br/><br/>Translator: 549690339<br/><br/>“Instantly killing the sword sect’s Wufeng sect’s ancestor. Although the sword sect’s Wufeng sect’s ancestor’s strength has just entered the Heavenly Yuan blessed realm, to be able to instantly kill him, he must at least have the strength of a control-level expert. Furthermore, he must be a veteran control-level expert with a deep foundation!”<br/><br/>“To dare to go against the sword sect and directly kill the sword sect’s expert, it seems like this person isn’t simple!”<br/><br/>In the trading zone of the riot zone, a heaven’s origin blessed realm expert was forcefully suppressed. This caused a huge commotion.<br/><br/>This news also spread to the surroundings at a terrifying speed.<br/><br/>In the trading zone, some Heaven’s origin blessed realm experts hid their strength and were among the group of disciples.<br/><br/>When they saw Wang Xian forcefully killing the patriarch of the windless sect, they muttered to themselves. Their faces were also filled with shock.<br/><br/>An expert who could kill the Patriarch of the Zephyr sect in an instant was no weakling in the entire Justice Alliance.<br/><br/>“Eh? What did you guys say? Zephyr sect was killed by a mysterious expert?”<br/><br/>“Damn it, he actually dared to kill an expert from our sword sect. Let’s go over!”<br/><br/>“A mysterious expert killed a disciple of our carefree sect? Killed the Patriarch of the sword sect?”<br/><br/>The news quickly spread to the sword sect and the carefree sect.<br/><br/>The powerhouses from the two major sects in the trading zone were rushing over.<br/><br/>At the same time, in the trading zone.<br/><br/>Wang Xian had killed a powerhouse in the Heaven’s origin realm without any change in his expression.<br/><br/>He looked to the side.<br/><br/>There was also a group of sword sect’s powerhouse disciples there.<br/><br/>He waved his arm and a flame engulfed them.<br/><br/>“Not good!”<br/><br/>“Run, run, run! We are not his match. Run!”<br/><br/>When they saw Wang Xian’s cold gaze sweeping across them, they were horrified.<br/><br/>They moved and wanted to escape.<br/><br/>However, how could they escape when faced with Wang Xian’s attack?<br/><br/>After the flames, more than 200 disciples from the sword sect were killed!<br/><br/>Wang Xian kept the corpses and revealed a faint smile on his face.<br/><br/>Other things aside, killing was the fastest way to obtain resources.<br/><br/>Boom! Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>At the instant when Wang Xian killed all the strong disciples of the sword sect.<br/><br/>Wang Xian saw a terrifying energy pressure erupting from two locations.<br/><br/>Even though they were very far away, he could feel powerful figures flying over.<br/><br/>“The experts from the Xiao Yao sect and the sword sect are rushing over!”<br/><br/>“A heavenly Yuan creation realm expert was killed. This is a huge matter, especially since this mysterious expert killed a sword sect expert. Furthermore, he killed a disciple of the Xiao Yao sect. The two sects will definitely not stop. A huge battle is about to break out!”<br/><br/>The surrounding Heavenly Yuan creation realm experts thought to themselves as they prepared to watch the show.<br/><br/>Further away, some of the strong practitioners of the Heaven’s origin creation who had received the information flew over with great interest.<br/><br/>They wanted to see what kind of existence it was that dared to provoke the sword sect and the carefree sect.<br/><br/>One had to know that these two great sects had existences at the level of Great Dao!<br/><br/>Wang Xian sensed the auras of those two places. With a move of his palm, the divination lamp appeared in front of him.<br/><br/>Buzz<br/><br/>The divination lamp lit up and a message appeared under the light.<br/><br/>“Those who are flying over now, one is at the control level, two are at the beginner level, two are at the control level, and three are at the beginner level!”<br/><br/>Wang Xian looked at the message on the divination lamp and raised his eyebrows slightly.<br/><br/>He had naturally sensed the discussions around him.<br/><br/>However, the strength of these two sects had indeed exceeded Wang Xian’s expectations.<br/><br/>With so many experts flying over, they were almost on par with him!<br/><br/>Furthermore, the experts from these two sects who were at the Great Dao level had yet to arrive.<br/><br/>Wang Xian frowned slightly.<br/><br/>“However, if they want to make an enemy out of me, I’m not afraid of them. It has been a long time since a war broke out!”<br/><br/>Wang Xian’s eyes flashed with a cold killing intent!<br/><br/>He stood there and watched quietly as the experts from both sides flew over quickly!<br/><br/>Boom! Boom! Boom<br/><br/>“Whoever dares to kill the disciples and experts of our sword sect, our sword sect will not rest until one of them is dead!”<br/><br/>“Whoever dares to make an enemy out of our carefree sect will die!”<br/><br/>In less than a second, a terrifying aura was emitted!<br/><br/>Following that, cold voices were heard.<br/><br/>“Disciples, stay away!”<br/><br/>“Those who don’t want to die, stay away!”<br/><br/>The experts from the sword sect and the carefree sect arrived. When the surrounding heavenly fate realm experts saw this scene, they immediately said in a soft voice.<br/><br/>The voice entered the ears of all the ruler realm disciples.<br/><br/>“Quick, quick, once this level of battle affects us, we won’t be able to resist it at all!”<br/><br/>“Retreat, Retreat!”<br/><br/>The group of disciples hurriedly flew into the distance. They didn’t dare to get close to the surroundings.<br/><br/>They didn’t even have the right to spectate a battle of this level!<br/><br/>One wrong move and they would vanish into thin air!<br/><br/>Boom! Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>Wang Xian floated in the air and looked left and right.<br/><br/>There was one control-level disciple in the carefree sect, two beginner-level disciples, two control-level disciples in the sword sect, and three beginner-level disciples in the sword sect!<br/><br/>This force was very strong!<br/><br/>When they arrived, they locked onto Wang Xian with murderous intent.<br/><br/>“Before the battle starts, you guys better understand why I killed them.”<br/><br/>Wang Xian swept his gaze across them and said coldly!<br/><br/>“We will understand after you die!”<br/><br/>The expert at the control level of the Xiao Yao sect stared at Wang Xian with murderous intent and said coldly!<br/><br/>Buzz<br/><br/>When he said that, Wang Xian knew that the battle was about to start!<br/><br/>Since the battle was about to start, he would not hold back at all!<br/><br/>The opponent was very strong and it was very likely that there would be more powerhouses rushing over!<br/><br/>At this moment, he wanted to reduce the number of his opponents!<br/><br/>He wanted to kill a few of them first!<br/><br/>Buzz<br/><br/>Wang Xian teleported and disappeared. He then used spatial teleportation!<br/><br/>In the next instant, his figure appeared behind the control-level powerhouse from the Xiao Yao sect!<br/><br/>“Be careful!”<br/><br/>“Attack him together and kill him. Don’t let him escape!”<br/><br/>On the right, when the experts from the sword sect saw Wang Xian making his move, they focused their eyes and shouted loudly!<br/><br/>“Die!”<br/><br/>When the control-level powerhouse from the Xiao Yao sect sensed that Wang Xian had appeared behind him, his eyes also focused!<br/><br/>He waved his arm and a sharp awl shot toward Wang Xian!<br/><br/>“I’ll Kill You First!”<br/><br/>However, at this moment, a voice rang in his ears!<br/><br/>“Bang!”<br/><br/>A terrifying claw crushed his attack directly and covered him.<br/><br/>An attack that he couldn’t defend against and suffocated him swept toward him!<br/><br/>At this moment, he was a little stunned!<br/><br/>This? ?<br/><br/>How was this possible?<br/><br/>Why didn’t he even have the courage to defend?<br/><br/>Boom<br/><br/>At this moment, that terrifying claw grabbed onto his body.<br/><br/>A destructive power covered his entire body.<br/><br/>His eyes were wide open, and his expression was filled with disbelief!<br/><br/>“You’re courting death!”<br/><br/>At the side, the two early-stage heavenly Yuan creation realm experts were also extremely shocked when they saw this scene.<br/><br/>They immediately unleashed their strongest attacks.\t\t\t\t\t\t</div>", "images": {}, "success": true}