{"id": 1327, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075034.html", "title": "Chapter 4330 - Chapter 4330: 4329 Carefree Boat, The Ancestor Of The Carefree Sect!", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4330 - Chapter 4330: 4329 Carefree Boat, The Ancestor Of The Carefree Sect!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4330: 4329 carefree boat, the ancestor of the carefree sect!<br/><br/>Translator: 549690339<br/><br/>“I’ve found the flaw!”<br/><br/>Wang Xian concealed his figure and disappeared between the heaven and earth!<br/><br/>His concealment technique could be sensed by experts of the same level or even the control level.<br/><br/>However, those experts who had just entered the Heaven’s origin manifestation level could not sense Wang Xian.<br/><br/>They could not sense Wang Xian at all when they saw him disappear.<br/><br/>This made their hearts clench!<br/><br/>Swoosh<br/><br/>Wang Xian’s body flashed and instantly arrived at the side of a powerhouse who had just entered the level of Heaven’s origin creation.<br/><br/>The ability of teleportation caused the powerhouse who had just entered the level of Heaven’s origin creation to have no time to react.<br/><br/>Puff<br/><br/>A Sword of light from space instantly arrived above his head and slashed at him!<br/><br/>“Save me!”<br/><br/>When the powerhouse saw this terrifying attack, his expression changed drastically. He cried out for help with a terrified expression!<br/><br/>“Attack!”<br/><br/>“Damn it!”<br/><br/>When the rest of the Heaven’s origin manifestation powerhouses saw this scene, their expressions changed drastically!<br/><br/>They immediately attacked Wang Xian who had appeared.<br/><br/>“PFFT!”<br/><br/>However, the sword of light still pierced into the body of the Heaven’s origin manifestation powerhouse.<br/><br/>However, his body was slightly illusory, and a strange creature flew out from his body.<br/><br/>The creature flew to the side and turned into the figure of the expert.<br/><br/>He used a treasure to avoid this fatal attack!<br/><br/>“Defend, directly defend.”<br/><br/>When a control-level expert from the sword sect saw this scene, his expression changed drastically, and he immediately roared loudly!<br/><br/>Defense!<br/><br/>All-round defense.<br/><br/>This way, they could stop the other party’s repeated attacks and prevent them from breaking through one by one.<br/><br/>Although the other party could break through their defenses.<br/><br/>However, if they wanted to completely kill them, they would need some time!<br/><br/>During this time, the sword sect and the carefree sect’s support would be enough to rush over!<br/><br/>“Buzz Buzz Buzz!”<br/><br/>Buzz! Buzz! Buzz<br/><br/>“Don’t hold back!”<br/><br/>The group of experts roared loudly. At the same time, they unleashed their strongest defensive techniques and surrounded them.<br/><br/>When Wang Xian saw their defenses, he raised his eyebrows slightly!<br/><br/>His figure appeared. With a wave of his arm, an incomparably huge dragon head headed straight for them.<br/><br/>Boom! Boom! Boom<br/><br/>The sound of explosions rang out.<br/><br/>Their defenses began to crumble.<br/><br/>However, they could still withstand it!<br/><br/>Wang Xian continued to wave his arm and continued to attack!<br/><br/>“So powerful. Even when the sword sect and the Xiao Yao sect joined forces, the Seven Heaven origin creation stage powerhouses were completely suppressed. This…”<br/><br/>“That mysterious powerhouse’s strength is too terrifying!”<br/><br/>When all the powerful disciples around saw this scene, their faces were filled with shock.<br/><br/>This was especially so for the disciples who were in the ruler realm.<br/><br/>When had they ever witnessed such a scene?<br/><br/>He had fought against eight people from the two great sects and even suppressed them.<br/><br/>What level of existence was this?<br/><br/>“Boom Boom!”<br/><br/>Very soon, Wang Xian’s second attack was aimed at them.<br/><br/>The loud rumbling continued.<br/><br/>At the center, the strong practitioners from the sword sect and the carefree sect were resisting with great difficulty. Their expressions were abnormally ugly!<br/><br/>“The world is free and unfettered, and I am the only one who reigns supreme!”<br/><br/>However, at this moment, a voice was heard!<br/><br/>Following that, an incomparably terrifying huge boat was flying towards them at a terrifying speed!<br/><br/>Many huge fish were accompanying the huge boat.<br/><br/>The surroundings of the huge boat was a vast ocean.<br/><br/>When the huge fish were flying over, they leaped out of the water and attacked Wang Xian!<br/><br/>“Huh?”<br/><br/>When Wang Xian saw this scene, his eyes narrowed and he revealed a serious expression.<br/><br/>“Towering Dragon Horn!”<br/><br/>Wang Xian growled and a divine dragon horn attacked the big fish that were attacking him!<br/><br/>“Our sect leader is here!”<br/><br/>“Phew, our sect leader is here!”<br/><br/>The two newly advanced heaven origin creation stage powerhouses from the Xiaoyao sect who were suppressed by Wang Xian heaved a sigh of relief when they saw their sect leader rushing over.<br/><br/>Following that, they stared at Wang Xian coldly and gritted their teeth.<br/><br/>“Sect leader of the carefree sect, he is very strong. Let’s surround and attack him together.”<br/><br/>A control-level powerhouse from the sword sect also had a glow in his eyes as he shouted at the sect leader of the carefree sect!<br/><br/>“Surround him!”<br/><br/>The members of the carefree sect stood on the carefree boat.<br/><br/>Dressed in green, he stared at Wang Xian with a solemn expression in his eyes.<br/><br/>“Bang, Bang, Bang!”<br/><br/>At this moment, the towering dragon horns collided with the huge fish.<br/><br/>As the huge fish dissipated, the remaining power of the towering dragon horns continued to attack the carefree boat!<br/><br/>“Your strength is comparable to two great dao realm experts. May I know which universe are you from?”<br/><br/>When the carefree sect’s ancestor saw that the first collision had ended, he immediately judged Wang Xian’s strength and asked!<br/><br/>“Dragon King of the Dragon Palace in the nine-origin Universe!”<br/><br/>Wang Xian stared at the Patriarch of the Xiaoyao sect and replied indifferently!<br/><br/>“You have to pay the price for killing the experts of our Xiaoyao sect!”<br/><br/>The Patriarch of the Xiaoyao sect stared at Wang Xian coldly!<br/><br/>“Hehe, you guys don’t have the qualifications to make me pay the price. Your strength is inferior to mine!”<br/><br/>Wang Xian stared at the patriarch of the Xiaoyao sect. The divination lamp had also detected the other party’s strength.<br/><br/>It was comparable to the strength of two masters of the Great Dao!<br/><br/>This strength was not weak at all!<br/><br/>However, it was still lacking when compared to him!<br/><br/>Furthermore, even if he were to join forces with the other eight heaven origin creation stage powerhouses, they would not be able to suppress him!<br/><br/>At worst, Wang Xian could just escape!<br/><br/>“This is the territory of the Justice Alliance. It’s not something that you can be impudent about!”<br/><br/>The leader of the Xiaoyao sect frowned slightly and stared at him coldly.<br/><br/>He did not make a move rashly.<br/><br/>This was because he knew that with their strength, it would be very difficult for them to keep Wang Xian here!<br/><br/>Unless two more experts of the Great Dao level came.<br/><br/>“Your disciples are courting death by provoking me. I can only teach them a lesson on your behalf!”<br/><br/>Wang Xian was still calm!<br/><br/>Beside him, the lamp of divination continued to light up.<br/><br/>He was divining the time when the other party would make a move and whether there would be any more experts rushing over!<br/><br/>“Lamp of divination?”<br/><br/>However, at this moment, the Patriarch of the Xiaoyao sect noticed the lamp of divination floating beside Wang Xian. His gaze froze slightly!<br/><br/>“What is your relationship with Saint Shan Tian? Why is his lamp of divination in your hands?”<br/><br/>The ancestor of the Xiaoyao sect stared at Wang Xian and asked!<br/><br/>“I have no relationship with this Dragon King. He used some treasures to trade for my divination lamp.”<br/><br/>When the ancestor of the Xiaoyao sect finished his sentence.<br/><br/>A voice was heard from the back.<br/><br/>Saint Shan Tian with long hair and white beard flew over. He swept his gaze across Wang Xian and the ancestor of the Xiaoyao sect and spoke!<br/><br/>There was such a huge commotion over here. Even a heaven origin creator had died. Naturally, he rushed over to take a look since he was at the Great Dao of Heaven.<br/><br/>However, he did not expect that the main character of time was the Dragon King who had made a deal with him!<br/><br/>“HMM?”<br/><br/>The Patriarch of the Xiaoyao sect’s gaze froze when he heard his words.<br/><br/>“I will not interfere in your grudges!”<br/><br/>When Saint Shan Tian saw Wang Xian looking at him, he spoke directly and made his stance clear!\t\t\t\t\t\t</div>", "images": {}, "success": true}