{"id": 1339, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075082.html", "title": "Chapter 4342 - Chapter 4342: 4341 Had Completely Annihilated The Control-Level Powerhouses", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4342 - Chapter 4342: 4341 Had Completely Annihilated The Control-Level Powerhouses</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4342: 4341 had completely annihilated the control-level powerhouses<br/><br/>Translator: 549690339<br/><br/>“They are not moving. Hehe, are they waiting for me to get closer?”<br/><br/>Wang Xian was flying rapidly in this space.<br/><br/>He was not far away. Wang Xian could sense the auras of Saint Futu and Saint Haoyang.<br/><br/>Seeing that they were not moving, the corners of Wang Xian’s mouth curled up slightly.<br/><br/>This method of concealing his figure with the power of chaos was indeed powerful.<br/><br/>Wang Xian was flying at the speed of a ruler at the peak of the realm!<br/><br/>“I can make my move now!”<br/><br/>When he was very close to Saint Futu and Saint Haoyang.<br/><br/>His gaze focused slightly.<br/><br/>Wang Xian’s body immediately transformed into the body of a divine dragon.<br/><br/>The incomparably huge dragon body directly enveloped the surrounding space.<br/><br/>The dragon tail and dragon body directly enveloped Saint Futu and Saint Haoyang.<br/><br/>“Explode!”<br/><br/>Wang Xian shouted in a low voice. An unparalleled energy attacked them!<br/><br/>“What?”<br/><br/>“Oh no, damn it, it’s that Dragon King! How is this possible!”<br/><br/>Saint Futu and Saint Haoyang, who were hiding in the two meteorites, looked horrified when they saw the sudden attack.<br/><br/>They never expected that the Dragon King would return.<br/><br/>He had even come to kill them.<br/><br/>What frightened them the most was how the Dragon King knew where they were?<br/><br/>Especially Saint Futu, whose expression changed drastically.<br/><br/>Now he finally understood why he had a feeling of being locked on.<br/><br/>The sudden attack completely terrified Saint Futu and Saint Haoyang.<br/><br/>They immediately wanted to escape into the distance.<br/><br/>However, the terrifying power completely enveloped them.<br/><br/>Even if they had the most precious treasure to flee for their lives, it was too late for them to use it now!<br/><br/>“Dragon King, we will not live under the same sky as you!”<br/><br/>Saint Haoyang roared furiously with a ferocious look on his face!<br/><br/>He had killed them twice. They had already been killed twice!<br/><br/>They must take revenge for this!<br/><br/>They had to take revenge!<br/><br/>“Die!”<br/><br/>Wang Xian stared at them with disdain.<br/><br/>The terrifying energy quickly wiped out their vitality.<br/><br/>They did not have the ability to escape!<br/><br/>The two experts who had not recovered to their peak state could not put up any resistance.<br/><br/>After Wang Xian killed them, he waved his arm and kept their corpses.<br/><br/>A smile appeared on his face!<br/><br/>The lamp of divination!<br/><br/>Wang Xian took out the lamp of divination and immediately divined the location of their resurrection.<br/><br/>After being killed by Wang Xian, Saint Futu and Saint Haoyang had their strength reduced once again.<br/><br/>This made it easier for Wang Xian to perform divination.<br/><br/>“You won’t be able to escape from there!”<br/><br/>Wang Xian divined the location of the two of them and smiled.<br/><br/>He moved and immediately flew towards their location.<br/><br/>At the same time, it was a remote place in the universe.<br/><br/>This was a newborn planet.<br/><br/>The entire planet was still in a very primitive state!<br/><br/>This was the place where the two of them were resurrected.<br/><br/>In this planet, they had placed resurrection treasures.<br/><br/>However, the aura on their bodies had become weaker after this resurrection!<br/><br/>Their strength was only at the initial stage of the Heavenly Yuan creation realm.<br/><br/>And it was at the weakest level!<br/><br/>The two of them broke out of the two strange eggs.<br/><br/>They looked at each other, and their expressions were abnormally ugly. They immediately absorbed the energy from the egg shells!<br/><br/>When the energy from the two egg shells was completely absorbed by them, the two of them took a deep breath!<br/><br/>“That Damn Dragon King, why did he attack us again?”<br/><br/>The Haoyang saint growled in a low voice with an incomparably ferocious expression!<br/><br/>His expression looked incomparably crazy!<br/><br/>They had always been on a smooth path, but ever since the calamity began, they had suffered a huge blow from the Dragon King.<br/><br/>This made his heart incomparably violent!<br/><br/>But, there was no other way!<br/><br/>He was unwilling!<br/><br/>“No wonder I have a feeling of being locked on. I don’t know what method that Dragon King used to lock onto us.”<br/><br/>Saint Futu’s expression changed drastically as he spoke!<br/><br/>“What about now? Futu, do you have that feeling of being locked on?”<br/><br/>Saint Haoyang’s heart tightened when he heard that.<br/><br/>He was afraid that the Dragon King could still lock onto them!<br/><br/>“I can’t sense them now. I don’t know if it’s because I’m weaker or because I’ve escaped this lock!”<br/><br/>Saint Futu shook his head, feeling a little uneasy!<br/><br/>“Then what should we do now?”<br/><br/>The vast sun saint’s heart tightened as well. If they were still locked onto, what would they do?<br/><br/>“Wait here. If he can really lock onto us, we won’t be able to escape even if we want to!”<br/><br/>Saint Futu shook his head.<br/><br/>Yes, right now, their strength was comparable to the weakest heaven origin creation realm expert.<br/><br/>If they were really locked onto, then they wouldn’t be able to escape either!<br/><br/>Right now, the only way was to wait here.<br/><br/>To confirm if the two of them were still locked onto!<br/><br/>This made them feel helpless as if they were resigned to fate!<br/><br/>They were control realm experts after all!<br/><br/>Yet, they had fallen to such a state!<br/><br/>“Huff! Huff!”<br/><br/>The two of them took a deep breath.<br/><br/>“We’re Here!”<br/><br/>Ten years later, Wang Xian was flying rapidly in the Na Tian universe.<br/><br/>He looked at a life planet in front of him with a smile on his face.<br/><br/>He could sense the auras of Saint Futu and Saint Haoyang on that life planet.<br/><br/>“I only have the strength of someone who has just stepped into the Heaven’s origin creation stage. Hehe!”<br/><br/>Wang Xian smiled lightly and flew over while concealing his figure.<br/><br/>He had powerful concealment techniques and a huge difference in strength.<br/><br/>When Wang Xian approached the planet, they did not sense his arrival!<br/><br/>Buzz<br/><br/>Wang Xian teleported and arrived in front of them.<br/><br/>“You can’t escape. Die!”<br/><br/>Wang Xian smiled coldly as a wave of energy enveloped them.<br/><br/>“No!”<br/><br/>Both of them widened their eyes as despair filled their faces!<br/><br/>PFFT<br/><br/>Wang Xian moved his palm and killed them instantly!<br/><br/>“Hehe!”<br/><br/>Wang Xian smiled. He moved his palm and took out the divination lamp to continue his divination.<br/><br/>“HMM?”<br/><br/>“The place of resurrection this time is so far away. The consumption of the divination lamp is too great!”<br/><br/>At this moment, Wang Xian saw the divination message and frowned slightly.<br/><br/>This time, the place where Saint Futu and Saint Haoyang were resurrected was very far away.<br/><br/>It was so far away that Wang Xian had to fly for tens of thousands of years!<br/><br/>Moreover, because of the distance, he could only divine a vague location.<br/><br/>This caused Wang Xian to shake his head helplessly.<br/><br/>Every Heaven’s fate level powerhouse has three guesses. It will be extremely difficult to completely destroy them<br/><br/>Wang Xian thought to himself.<br/><br/>With a move of his palm, he set up a few demon spirit altars in the entire na Tian universe.<br/><br/>Then, with a thought, he took out a map that he obtained from the evil sequence faction’s powerhouse and started to investigate.<br/><br/>“This place?”<br/><br/>Very soon, Wang Xian found the location predicted by the divination lamp on the map.<br/><br/>He raised his eyebrows.<br/><br/>This place was relatively close to the six paths universe.<br/><br/>He would head to the six paths universe first. He estimated that he would reach it after flying for a few thousand years!\t\t\t\t\t\t</div>", "images": {}, "success": true}