{"id": 1332, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075054.html", "title": "Chapter 4335 - Chapter 4335: 4334 Demonic Fiend’S Fortuitous Encounter And Breakthrough", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4335 - Chapter 4335: 4334 Demonic Fiend’S Fortuitous Encounter And Breakthrough</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4335: 4334 Demonic Fiend’s fortuitous encounter and breakthrough<br/><br/>Translator: 549690339<br/><br/>“Great Dao level, demonic human, an embryo with darkness attribute!”<br/><br/>In the Great Dao of Heaven, Wang Xian looked at the embryo in front of him. His eyes were sparkling.<br/><br/>According to Saint Shan Tian, Song Ta, and the rest.<br/><br/>This embryo with darkness attribute could at the very least nurture an expert who had just entered the Heaven’s origin realm.<br/><br/>It was normal to nurture an existence at the control level.<br/><br/>If they could fuse perfectly, they would be able to nurture an existence at the Great Dao level.<br/><br/>However, it was too difficult to obtain it perfectly.<br/><br/>In the embryo, the demon didn’t have any attributes yet, but if his life was threatened, the demon would resist.<br/><br/>In fact, he would even fight to the death!<br/><br/>Once the embryo was destroyed, the embryo wouldn’t be perfect.<br/><br/>It wouldn’t be able to inherit everything from the demon.<br/><br/>In other words, the more perfect the embryo was, the more inheritance it would receive from the demon.<br/><br/>If it was completely obtained, it would be equivalent to possessing the demon.<br/><br/>“If it’s possession of the embryo, the Dragon Palace’s darkness attributes would be fine. However, overall, the venom horned dragon species is the most suitable.”<br/><br/>Wang Xian thought to himself.<br/><br/>The poisonous horned dragon species had a terrifying innate ability when it came to possession.<br/><br/>When the poisonous horned dragon species possessed an embryo, it was much stronger than the other darkness attribute divine dragons!<br/><br/>He was prepared to let the demonic fiend possess this embryo.<br/><br/>However, although the poisonous horned dragon species had a special ability when it came to possession, Wang Xian was still unsure if the demonic fiend was able to possess it perfectly.<br/><br/>If there was even the slightest mistake, the embryo would be destroyed!<br/><br/>It would not be able to completely obtain everything that belonged to the demonic humans!<br/><br/>A perfect possession was the most important thing!<br/><br/>How to achieve a perfect fusion was an extremely difficult task.<br/><br/>“Demonic Fiend, come out First!”<br/><br/>Wang Xian came to the side of the primal Chaos Stone and called out the demonic fiend who was cultivating inside!<br/><br/>Mo Sha now possessed the strength of a ruler at the peak of the realm.<br/><br/>There was still a gap between him and the Heaven’s origin blessed realm.<br/><br/>In the Dragon Palace, the purebred divine dragons were the easiest to break through to the Heaven’s origin blessed realm.<br/><br/>It was actually very difficult for a purebred dragon like the poisonous horned dragon to break through.<br/><br/>This required great opportunities and good fortune.<br/><br/>“Dragon King!”<br/><br/>Upon receiving Wang Xian’s call, Mo sha immediately flew out and greeted him respectfully!<br/><br/>“Yes!”<br/><br/>Wang Xian nodded his head, he looked at the embryo in front of him and said, “There is a huge good fortune here. I am prepared to give it to you. This is the embryo of a Great Dao level heaven origin creator. If you can possess him, you will be able to possess everything about him!”<br/><br/>“However, the embryo is alive. Once it awakens, there is a possibility of a life-and-death battle. He is very weak now and you can easily suppress him. However, it is still a little difficult to obtain it perfectly. Take a look and see what the chances of obtaining it perfectly are!”<br/><br/>“HMM?”<br/><br/>Mo Sha was slightly shocked when he heard Wang Xian’s words. Following that, his eyes lit up. “It’s the Dragon King. Thank you for your nurturing, Your Majesty.”<br/><br/>Mo Sha immediately knelt down and bowed to Wang Xian.<br/><br/>Wang Xian waved his hand and allowed him to sense the embryo in front of him.<br/><br/>Mo Sha placed his palm on the embryo and sensed it quietly.<br/><br/>“Dragon King, this embryo is only at the eighth level of the Universe Overlord realm. However…”<br/><br/>Mo sha sensed it and frowned slightly. “There is a very strong soul power and a very strong pressure inside him. I have the confidence to possess him, but the soul and pressure inside may cause some interference to me!”<br/><br/>“Yes!”<br/><br/>Wang Xian heard his words and frowned slightly. “You have no way to completely resist the soul and pressure inside? Do you have the confidence to possess him 100% ?”<br/><br/>“Dragon King, I don’t have such confidence. In fact, if I were to possess it, I would definitely encounter resistance!”<br/><br/>Mo Sha shook his head!<br/><br/>Wang Xian nodded his head and looked deep in thought.<br/><br/>This was indeed a problem.<br/><br/>The situation at that time was also a thorny problem in the eyes of the song tower’s carefree sect’s patriarch and the other Great Dao experts.<br/><br/>They couldn’t obtain everything about this embryo perfectly!<br/><br/>This was because the will of a great dao level expert was extremely terrifying!<br/><br/>Even if he were to make a move himself, it was possible for him to fail!<br/><br/>Not to mention letting a weakling make a move!<br/><br/>Wang Xian looked at this embryo and kept pondering.<br/><br/>A few hours later, his gaze focused slightly.<br/><br/>He recalled the time when he approached the primal chaos stone. The Primal Chaos Stone could devour him directly.<br/><br/>It could melt his consciousness and everything.<br/><br/>In other words, it could completely melt him!<br/><br/>Then, could it be possible to use the primal chaos stone?<br/><br/>“The Primal Chaos Stone is one point, and so is the power of Chaos!”<br/><br/>“What if I use the power of Chaos to assist the Demonic Fiend?”<br/><br/>The more Wang Xian thought about it, the more he felt that there was a high chance of success.<br/><br/>The Primal Chaos Stone at that time could absorb everything.<br/><br/>Even a powerful tree of chaos was absorbed by it until it withered!<br/><br/>This was the power of the primal Chaos Stone, and it was also the power of the power of chaos.<br/><br/>In that case, if he placed the demonic fiend inside the primal chaos stone, would it be able to fuse perfectly with the help of the power of Chaos?<br/><br/>“Let me perform a divination first!”<br/><br/>Wang Xian narrowed his eyes slightly and took out the lamp of divination!<br/><br/>This lamp of divination was indeed a rare treasure at times.<br/><br/>With a thought, Wang Xian performed an ordinary divination.<br/><br/>Under normal circumstances, if he were to possess, how many inheritances of the embryo would he be able to possess.<br/><br/>Very soon, the lamp of divination gave an answer.<br/><br/>30% .<br/><br/>“30% ? For an expert of the Great Dao realm to possess 30% , it’s equivalent to the control level!”<br/><br/>Wang Xian mumbled.<br/><br/>Following that, his body moved and brought the demonic embryo into the primal Chaos Stone!<br/><br/>After entering, Wang Xian continued to perform divination.<br/><br/>With the help of his own power of chaos, the demonic embryo’s possession talent was sealed by the primal chaos stone.<br/><br/>Under such circumstances, how much could he obtain?<br/><br/>Wang Xian thought to himself as the lamp of divination was burning rapidly.<br/><br/>The result appeared very quickly — 90% .<br/><br/>This result made Wang Xian’s eyes freeze.<br/><br/>He was pleasantly surprised but also a little disappointed.<br/><br/>90% was already very high.<br/><br/>However, he was still a little short of 100% !<br/><br/>“What’s the reason? Is it because the demonic fiend doesn’t possess the power of chaos, so it can’t achieve a perfect possession without achieving a perfect suppression?”<br/><br/>“If I let the demonic fiend refine some of the power of chaos, will I be able to achieve 100% ?”<br/><br/>Wang Xian kept pondering.<br/><br/>After that, he separated a trace of the power of chaos and let the demonic fiend refine it.<br/><br/>The power of chaos was a high-grade energy, one of the highest-grade energy in all living things!<br/><br/>Logically speaking, any powerhouse would be able to refine it.<br/><br/>However, no powerhouse would be able to control it!<br/><br/>Except for Wang Xian!<br/><br/>When the demonic fiend refined a trace of the power of chaos, it could only allow its body to possess such a trace of energy. It would not be able to control it.<br/><br/>However, by using the power of chaos, it could suppress the soul and aura of the demonic human in the embryo.<br/><br/>It could completely suppress or even fuse with it!\t\t\t\t\t\t</div>", "images": {}, "success": true}