{"id": 1331, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075050.html", "title": "Chapter 4334 - Chapter 4334: The Value Of The 4333 Embryo", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4334 - Chapter 4334: The Value Of The 4333 Embryo</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4334: The value of the 4333 embryo<br/><br/>Translator: 549690339<br/><br/>“As the demons were feeding on living beings, they fed on all living beings as their blood and were eliminated by us. This time, thank you for discovering it, brother Wang Xian.”<br/><br/>“Speaking of which, the demons have been eliminated by us for more than 10 billion years. They should have been hiding under the eyes of our sword sect. However, we didn’t expect that they were not discovered. If you have any needs in the future, please let us know directly!”<br/><br/>In a sword peak of the sword sect.<br/><br/>A group of five Great Dao level powerhouses were sitting on their chairs. Old Man Jian transformed into a human form and toasted Wang Xian with a smile on his face.<br/><br/>At the same time, he owed Wang Xian a favor!<br/><br/>“Hehe, it’s just a small matter. Speaking of which, being able to discover the embryo of the demon is also a huge opportunity for me!”<br/><br/>Wang Xian smiled at old man Jian. This time, he had gained even more!<br/><br/>“TSK TSK, an expert at the level of Great Dao would possess the embryo. The value of his embryo is extremely terrifying. If he could reverse the possession, he would be able to nurture an existence at the level of Great Dao!”<br/><br/>Saint Shan Tian spoke with an envious expression on his face!<br/><br/>“It’s not that simple. Although he has obtained the embryo of an expert at the level of Great Dao, the embryo still possesses consciousness. If he were to sense that he has been possessed, I’m afraid he would be torn between life and death. However, it shouldn’t be a problem to nurture an expert at the level of control!”<br/><br/>The carefree sect’s ancestor spoke!<br/><br/>His face was also filled with envy.<br/><br/>Even nurturing a control realm expert was exceptionally difficult for any universe or any great sect.<br/><br/>The difficulty was too high!<br/><br/>It was still fine if it was an expert who had just entered the heavenly yuan manifestation realm, but with a huge amount of resources, he could be formed from numerous disciples.<br/><br/>However, the control realm would depend on one’s own luck and Luck!<br/><br/>It might not even be possible for an expert at the Great Dao level to help someone who had just entered the Heaven’s origin realm to advance to the level of control!<br/><br/>Any expert would be very concerned about the fact that an embryo could easily nurture an existence at the level of control.<br/><br/>It was no exaggeration to say that this embryo was comparable to an ultimate treasure of the Heaven’s origin realm!<br/><br/>In fact, its potential was even higher than an ultimate treasure of the Heaven’s origin realm!<br/><br/>“Brother Wang Xian, this embryo is indeed a rare treasure. However, it is very difficult to obtain it perfectly. You can study it and perhaps nurture a top-notch powerhouse. Hehe.”<br/><br/>Song ta smiled and said, “Oh right, Dragon King, you have your own forces, right?”<br/><br/>“Yes, I have my own forces, the Dragon Palace!”<br/><br/>Wang Xian nodded.<br/><br/>“Oh?”? Dragon Palace, are you interested in joining the Justice League? There are many benefits to joining the Justice League. Furthermore, we worked together to kill the spirit kneader the last time. The spirit kneader is a vengeful person. If you join the Justice League and encounter the Evil Sequence Alliance, you can look for the league to help you!”<br/><br/>Song Ta looked at Wang Xian and invited him!<br/><br/>“This…”<br/><br/>Wang Xian pondered for a moment. “Our nine-origin universe is too far away from the Justice Alliance. In addition, we have many friends in the nine-origin universe. If we join them, we have to inform them as well!”<br/><br/>“Oh? Brother Wang Xian, there are still many experts in your nine-origin universe?”<br/><br/>Old Man Jian looked at Wang Xian in surprise.<br/><br/>“Hehe, fortunately, we still have one friend at the Great Dao level, four to five at the control level, and a few at the beginner level.”<br/><br/>Wang Xian said with a smile.<br/><br/>“So Strong? Looks like the universe you’re in is a top-tier universe!”<br/><br/>Song Ta was slightly shocked.<br/><br/>Wang Xian’s strength was already so strong, yet there was still an existence at the Great Dao level.<br/><br/>There were also so many existences at the level of control.<br/><br/>In the entire Justice Alliance, a universe at this level was considered the best!<br/><br/>There weren’t many who could match up to it!<br/><br/>Wang Xian smiled. “We have a grudge with the universe beside us. We haven’t settled this grudge yet!”<br/><br/>“Do you guys have another universe that is comparable to yours?”<br/><br/>Wang Xian’s words made song ta even more astonished!<br/><br/>“It’s not that much of a match. In a space-attributed universe, there is an existence at the level of the Great Dao and many experts.”<br/><br/>Wang Xian stopped talking and gave a simple explanation!<br/><br/>“Hehe, brother Wang Xian, you can ask those friends of yours. If you are interested, you can join our Justice Alliance. Although your universe is far away, there are still many benefits.”<br/><br/>Song ta said one last sentence!<br/><br/>“No Problem!”<br/><br/>Wang Xian nodded, then, he looked at them and said, “Oh right, I have half of the body of the spiritual being in my hands. I am prepared to exchange it for some resources. The level of the resources doesn’t need to be too high. As long as you have enough, you can proceed with the transaction if you are interested!”<br/><br/>“HMM?”<br/><br/>His words made the eyes of Saint Shan Tian and the Patriarch of the Xiaoyao sect freeze. Then, they revealed an eager look.<br/><br/>It was the corpse of an expert at the Great Dao level. To them, this could be used for cultivation.<br/><br/>It could even be used to nurture an expert at the Heavenly Yuan blessed realm.<br/><br/>It was an absolute treasure.<br/><br/>Furthermore, the resources that Wang Xian exchanged for were only ordinary resources. There were no other requirements.<br/><br/>Such an exchange opportunity had never happened before.<br/><br/>“Brother Wang Xian, do you really want to trade with the corpse of the spiritual man?”<br/><br/>Saint Shan Tian stared at Wang Xian eagerly and asked.<br/><br/>“Yes.”<br/><br/>Wang Xian nodded. Wang Xian was prepared to use the corpse of the spiritual kneader to improve his own strength!<br/><br/>Therefore, he had to exchange this half-corpse for resources.<br/><br/>Coincidentally, there were four great dao experts here. They were the ancestors of the great sects. They could eat this corpse!<br/><br/>“Alright, Alright. I want a portion of this half-corpse!”<br/><br/>Saint Shan Tian said directly!<br/><br/>“I want it too!”<br/><br/>“Hehe, everyone who sees it will get a share!”<br/><br/>The patriarchs of the Xiao Yao sect said without hesitation!<br/><br/>Song ta also smiled and rubbed his hands together!<br/><br/>Wang Xian nodded and took out the corpse!<br/><br/>Following that, they discussed the value of the corpse and how many resources to exchange for it.<br/><br/>After a round of trade, it was obvious that the Xiao Yao sect’s patriarch and Saint Shan Tian were closer to Wang Xian.<br/><br/>The grudges and estrangement from the past had disappeared completely!<br/><br/>The group of people chatted about their cultivation and some of the strange things they had encountered. It was very harmonious!<br/><br/>Wang Xian also inquired about the information regarding the spirit kneader.<br/><br/>Wang Xian was not prepared to let the spirit kneader take revenge on him.<br/><br/>The group chatted for a few days before they left.<br/><br/>The carefree sect’s ancestor, Saint Shan Tian, and the rest went to their respective sects to prepare resources.<br/><br/>The value of the spirit kneader was very high. They didn’t bring too many resources with them, so they needed to make some preparations!<br/><br/>Wang Xian also returned to the Great Dao of heaven.<br/><br/>The harvest this time wasn’t bad, especially the embryo of the Devil Man.<br/><br/>Wang Xian had to make good use of this embryo.<br/><br/>If he could obtain it perfectly, it would be able to increase the existence of the avenue of heavenly arrival in the Dragon Palace!\t\t\t\t\t\t</div>", "images": {}, "success": true}