{"id": 1337, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075074.html", "title": "Chapter 4340 - Chapter 4340: 4339 Reappeared In The Universe", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4340 - Chapter 4340: 4339 Reappeared In The Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4340: 4339 reappeared in the universe<br/><br/>Translator: 549690339<br/><br/>The leader of the water god Dragon of the Dragon Palace had achieved a breakthrough. This was a joyous occasion for the Dragon Palace.<br/><br/>However, Wang Xian would need to look for the quota to break through the Heaven Creation Realm and the universe that he had broken through.<br/><br/>In the universe that Wang Xian knew and understood.<br/><br/>The Sword and Magic Universe had water-type powerhouses in the heaven creation realm.<br/><br/>The last time he went to the Na Tian universe, the water element quota was occupied by the scholar.<br/><br/>He knew of a universe that had the water element quota, and that was the six paths universe.<br/><br/>However, the six paths universe was the universe that heaven bestowed.<br/><br/>The tribe that heaven bestowed was the water element tribe. Wang Xian was too embarrassed to occupy the quota of the six paths universe.<br/><br/>Wang Xian would have to search for this spot himself.<br/><br/>However, after checking the information in the Heaven’s origin communication device, Wang Xian did not find any information about the selling spot.<br/><br/>The spot in the Heaven’s origin creation was a foundation for a universe.<br/><br/>Once it was sold, it would feel like digging one’s own grave.<br/><br/>A universe would not sell a spot unless it was in a critical situation.<br/><br/>However, there were a few universes that sent out a message asking for help. Wang Xian immediately contacted them below.<br/><br/>The reward that he wanted was naturally a water element spot.<br/><br/>However, the result that Wang Xian received was that the other party rejected it.<br/><br/>Or perhaps, the other party did not have a spot in the water element of the Heaven’s origin blessed realm in the other universe!<br/><br/>“I can’t find it here in the Heaven’s origin communicator. Looks like I have to go out and look for it myself.”<br/><br/>Wang Xian mumbled.<br/><br/>He was not anxious about this quota.<br/><br/>It was not that easy to find such a quota.<br/><br/>For example, it had been a long time since the skeleton race found a universe with a quota of darkness attribute.<br/><br/>“Let’s Wait a little longer. It seems that there are still disciples who are about to reach the bottleneck of breaking through.”<br/><br/>Wang Xian looked into the primal chaos stone.<br/><br/>The arrival of bei Shuang.<br/><br/>The arrival of the leader of the Water God Dragon.<br/><br/>This made Wang Xian sense this aura.<br/><br/>When they reached the threshold of breaking through, their bodies would emit a transcendent aura.<br/><br/>In the primal chaos stone, Wang Xian sensed that there were still disciples who were about to reach.<br/><br/>Time passed once again. Ten thousand years in the outside world and one million years in the primal chaos stone.<br/><br/>On this day, Wang Xian sensed something and looked inside.<br/><br/>“Roar! Roar!”<br/><br/>An excited roar came from inside.<br/><br/>The leader of the Fire Elemental Divine Dragon, who was emitting the power of flames, swayed his body.<br/><br/>“Congratulations, leader of the Fire Elemental Divine Dragon!”<br/><br/>In the primal Chaos Stone, the rest of the disciples who were at the peak of the ruler realm looked over and congratulated him!<br/><br/>“Hehe, I’ll take my leave first. I’ll be waiting for my brothers in the Heaven’s origin blessed realm.”<br/><br/>Leader Huo said excitedly.<br/><br/>Then, he flew out of the primal chaos stone and looked at Wang Xian. Immediately, he turned into his human form and knelt in front of him.<br/><br/>“Greetings, Dragon King. I have lived up to your high expectations. I have reached the threshold of a breakthrough.”<br/><br/>Leader Huo knelt there and said respectfully.<br/><br/>Wang Xian nodded and said, “Wait here with leader Shui. I’ll help you find a spot next.”<br/><br/>“It’s the Dragon King!”<br/><br/>Chief Huo replied respectfully.<br/><br/>Wang Xian looked at the primal chaos stone and his gaze landed on Mo Sha.<br/><br/>Mo Sha’s strength had already reached the control level.<br/><br/>Furthermore, it was comparable to two existences at the control level.<br/><br/>This strength was already very strong.<br/><br/>However, he could still improve.<br/><br/>However, the improvement was already very slow.<br/><br/>Other than the resources that Wang Xian had prepared for himself, the rest of the resources in Wang Xian’s hands had been used up.<br/><br/>“Mo Sha!”<br/><br/>Wang Xian transmitted his voice to Mo Sha.<br/><br/>“Dragon King!”<br/><br/>When Mo Sha heard him, he immediately flew out and stood respectfully beside Wang Xian.<br/><br/>“I’ll be out for a period of time. You take care of everything here first. If anything unexpected happens, bring all the disciples away.”<br/><br/>Wang Xian instructed Mo Sha.<br/><br/>“It’s the Dragon King!”<br/><br/>Mo Sha nodded.<br/><br/>“Okay, you guys can cultivate outside for the time being.”<br/><br/>Wang Xian also kept the primal chaos stone.<br/><br/>He had no choice. This time, he had to go to the primal chaos to look for a spot for a breakthrough. Hence, he had to take this primal chaos stone away and fuse it into his body.<br/><br/>“It’s the Dragon King!”<br/><br/>The group of disciples came out from the primal chaos stone and nodded.<br/><br/>Wang Xian gave some instructions to the demonic fiend and flew out with an lie.<br/><br/>Right now, the Fallen Shadow Demonic Emperor was here as well as a group of experts from the nine-origin universe.<br/><br/>After he left, no one dared to touch the palace of the Dragon Palace or the fragments of the Elemental God.<br/><br/>Of course, with Wang Xian’s current reputation, no one was courting death and provoking the Dragon Palace.<br/><br/>“I’ll go to the sky-absorbing universe to take a look first.”<br/><br/>Wang Xian flew quickly. There was a place in his heart.<br/><br/>The sky-absorbing universe was the universe where the scholar made his breakthrough.<br/><br/>There were two powerhouses in the sky-absorbing universe who were at the Heaven origin creation level. Both of them were at the control level.<br/><br/>One of them, the Haoyang saint, was a fire-attributed powerhouse.<br/><br/>Wang Xian did not have a good impression of the Haoyang saint and the Buddha saint.<br/><br/>He used living beings as livestock to trade with the powerhouses of the evil universe.<br/><br/>Wang Xian was prepared to go over again to see if he could meet the Haoyang saint.<br/><br/>If he could find him, he was confident that he could destroy him completely.<br/><br/>That was because he had the divination lamp now.<br/><br/>The divination lamp.<br/><br/>With his strength, using the divination lamp, he could lock onto a powerhouse at the control level.<br/><br/>However, the prerequisite was that Wang Xian could touch him.<br/><br/>Only by touching him would he be able to lock onto him.<br/><br/>With this thought in mind, Wang Xian flew rapidly.<br/><br/>The distance to the Na Tian universe was very far and was not within the boundaries of the Justice Alliance universe.<br/><br/>It would take him at least ten thousand years to fly there.<br/><br/>However, there was nothing he could do about it.<br/><br/>Time was the most worthless thing in the Chaos!<br/><br/>Moreover, the calamity had only just begun. It had not even been 200 million years!<br/><br/>Wang Xian shuttled through the chaos.<br/><br/>His full speed was still extremely terrifying!<br/><br/>Ten thousand years later, Wang Xian arrived in front of the Na Tian universe. Looking at this universe from afar, he shook his head slightly.<br/><br/>The living beings in this universe were also sad!<br/><br/>The Saints were heartless!<br/><br/>However, the soul-returning wood branch that I gave to the old man did not ask for help. Saint Futu and Saint Haoyang should not have continued to kill the innocent<br/><br/>Wang Xian thought to himself. He concealed his figure and entered the Na Tian universe.<br/><br/>Hopefully, he is still in this universe<br/><br/>When he arrived at the Na Tian universe, Wang Xian immediately took out the divination lamp!<br/><br/>“Is there a strong person in the Heaven’s origin destiny realm in this universe?”<br/><br/>Wang Xian began his divination.<br/><br/>Soon, the divination lamp sent him a message.<br/><br/>The answer was yes!<br/><br/>Where was the location?<br/><br/>Wang Xian continued his divination.<br/><br/>Soon, a map was displayed on the divination lamp.<br/><br/>His eyes sparkled when he saw the information on the map.<br/><br/>“Looks like I have to kill the saint of the Na Tian Universe!”<br/><br/>Wang Xian narrowed his eyes. His eyes were filled with coldness.<br/><br/>According to the map displayed by the divination lamp, Wang Xian flew forward.\t\t\t\t\t\t</div>", "images": {}, "success": true}