{"id": 1335, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075066.html", "title": "Chapter 4338 - Chapter 4338: 4337’S Heart Of Respect", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4338 - Chapter 4338: 4337’S Heart Of Respect</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4338: 4337’s heart of respect<br/><br/>Translator: 549690339<br/><br/>“It’s the Dragon King!”<br/><br/>The group of experts answered. They stood on the five elements millstone and followed Wang Xian as they flew forward rapidly.<br/><br/>Their eyes scanned their surroundings curiously. Their eyes were filled with astonishment.<br/><br/>This was especially so for the disciples in the ruler realm.<br/><br/>They had no understanding of the universe in the outside world.<br/><br/>The living disciples who saw the various universes were also extremely shocked.<br/><br/>In particular, they realized that most of these disciples were stronger than them.<br/><br/>The Masters of the universe at level eight or level nine could be seen almost everywhere.<br/><br/>Those at the peak of the master realm could be seen at a glance.<br/><br/>Technology, magic, Xianxia, fantasy.<br/><br/>All kinds of styles and styles!<br/><br/>“Dragon King, are these the strong disciples of the Justice Alliance? Will we be in danger here?”<br/><br/>Ling Honggu scanned his surroundings and asked Wang Xian after a moment of hesitation.<br/><br/>Ling Honggu was now one of the leaders of the skeleton clan.<br/><br/>Currently, among the peak races, only the skeleton clan did not have any strong practitioners in the Heavenly Kismet realm.<br/><br/>This also caused the strong practitioners of the skeleton clan to be very distressed.<br/><br/>Fortunately, they knew that Ling Honggu had a good relationship with the Dragon King and had fought together before.<br/><br/>With the Dragon King around, nothing would happen to the skeleton clan.<br/><br/>However, there were no powerhouses from the Heaven’s origin realm who belonged to their own race.<br/><br/>“The Justice Alliance is a very loose alliance. Under normal circumstances, they wouldn’t care about internal conflicts. Their only goal is to fight against the Evil Sequence Alliance.”<br/><br/>“Here, as long as you don’t deliberately cause trouble, just tell me my name if anything happens!”<br/><br/>Wang Xian said.<br/><br/>When he spoke, the five elements Millstone had already led them into the inner area.<br/><br/>“Oh? That’s the Dragon King.”<br/><br/>“Yes, it’s the Dragon King. This Dragon King is really strong. I wonder which universe he came from.”<br/><br/>“Look at those powerhouses beside the Dragon King. Hiss, there are so many existences at the Heaven’s origin level. Are they the Dragon King’s subordinates or something?”<br/><br/>“I don’t know. Let’s not talk about anything else. The Dragon King’s strength alone is comparable to those top sects in the Justice Alliance!”<br/><br/>Wang Xian flew with the fallen Shadow Demon Emperor and the rest.<br/><br/>Without any concealment, he naturally attracted the attention of the surrounding powerhouses’disciples.<br/><br/>One had to know that even in the riot zone, existences at the Great Dao level would not appear frequently.<br/><br/>Some of the powerful disciples of the sword sect even bowed to Wang Xian from afar to show their respect!<br/><br/>Ever since the incident last time, the sword sect had also issued an order.<br/><br/>The Dragon King was the benefactor of the sword sect, and he owed the sword sect a favor.<br/><br/>When the disciples of the sword sect saw this, they had to be respectful.<br/><br/>This was the rule of the sword sect.<br/><br/>The group of powerful disciples naturally did not dare to disobey it!<br/><br/>“Oh? Dragon King, it seems that you are very famous here?”<br/><br/>The Fallen Shadow Demon Emperor heard the voices around him and spoke with a smile on his face!<br/><br/>“It’s alright. I’ve gotten to know a few powerful people through fighting.”<br/><br/>Wang Xian smiled and looked at Ling Honggu. “Honggu, has that person from your skeleton clan made a breakthrough yet? Have you not found a suitable universe yet?”<br/><br/>“Sir Dragon King, I haven’t found a suitable universe yet.”<br/><br/>From the skeleton clan, an old man flew out and reported to Wang Xian bitterly.<br/><br/>“Yes, safety is the priority. As long as there are no Great Dao experts in that universe, I can help you to protect your path.”<br/><br/>Wang Xian spoke to him!<br/><br/>“Then… Then Dragon King, what if there are three control-level universes?”<br/><br/>The old man was slightly taken aback. Soon after, he asked with excitement and anticipation.<br/><br/>“It’s fine.”<br/><br/>Wang Xian shook his head. “Let’s go to their universe and take up a spot. To any universe, this is the act of starting a war. However, three control-level universes shouldn’t be a problem!”<br/><br/>“Thank you, Dragon King. Thank you, Dragon King. I do know of one place. I will go and investigate it in detail soon!”<br/><br/>The elder from the skeleton clan thanked him excitedly.<br/><br/>“Dragon King, your strength has improved again. This is unbelievable. We are all old!”<br/><br/>The Fallen Shadow Demon Emperor watched from the side.<br/><br/>As they ventured deeper into the Great Dao of heaven, they encountered more powerful disciples.<br/><br/>When some of the powerful disciples saw Wang Xian, they were discussing him carefully.<br/><br/>The Fallen Shadow Demon Emperor could also clearly hear the discussions of some disciples in the ruler realm.<br/><br/>What kind of existence was comparable to two great dao levels.<br/><br/>The carefree sect’s ancestor was no match for him.<br/><br/>Wait, wait, wait!<br/><br/>They could all hear it.<br/><br/>This made the fallen shadow demon Emperor Sigh again. Wang Xian’s strength had improved too quickly!<br/><br/>With such strength, he could indeed protect his disciples easily!<br/><br/>“I haven’t improved much either.”<br/><br/>Wang Xian smiled. It was true that he hadn’t improved much recently.<br/><br/>While everyone was conversing, they came to the Great Dao of the heavens.<br/><br/>A group of strong disciples from the nine-origin universe looked at both sides of the Great Dao of the passageway with a shocked expression on their faces.<br/><br/>“Cultivating here is indeed several times better than the tree of Chaos!”<br/><br/>The Elven empress said with a slight tremble.<br/><br/>One should not underestimate this. This was a huge gap, a huge gap.<br/><br/>“If you can obtain the fragment of the god of elements and draw the energy from the two sides, you can create an even more powerful cultivation land!”<br/><br/>Wang Xian spoke to them.<br/><br/>“Yes, using the fragment of the god of elements to draw the energy from both sides can create a powerful cultivation holy land. However, with our formation, there are some effects.”<br/><br/>The 12 ancestral witches spoke. Then, they looked at Wang Xian and asked, “Sir Dragon King, is this path stable? Once the energy in the surroundings is in chaos, it will be very dangerous. Even beginner-level existences will be killed.”<br/><br/>“No one can guarantee that it will be stable. However, I will be here for this period of time. Fallen Shadow Demon Emperor, you should be here as well. In case anything unexpected happens, have Hetian Sage and the rest keep a close watch over our nine-origin universe. If there is any danger, I can return immediately.”<br/><br/>Wang Xian replied.<br/><br/>“Alright!”<br/><br/>Fallen Shadow Demon Emperor nodded.<br/><br/>“Other than that, 12 ancestral witches, you can create an array formation. It will cover all the disciples in the nine-origin universe. I will take care of the resources for the array formation. You can continue to set up the array formation in your respective peak races.”<br/><br/>Wang Xian continued to instruct the 12 ancestral witches.<br/><br/>“Dragon King, this…”<br/><br/>“It’s alright. We are all from the same universe. It will be beneficial to me if you become stronger.”<br/><br/>When the twelve ancestral witches and the group of powerhouses heard that, they opened their mouths slightly.<br/><br/>Wang Xian waved his hand and interrupted them!<br/><br/>“Thank you, Dragon King!”<br/><br/>The group of Heaven origin creation powerhouses from the nine-origin universe replied respectfully.<br/><br/>They had also heard the discussion about Wang Xian from the surrounding disciples of the universe. They also knew about Wang Xian’s current strength.<br/><br/>Other than the fallen Shadow Demon Emperor, he could barely match up to him.<br/><br/>The difference between the other powerhouses was too great.<br/><br/>The huge difference in strength was no longer on the same level.<br/><br/>This also made them feel a surge of respect in their hearts.\t\t\t\t\t\t</div>", "images": {}, "success": true}