{"id": 1338, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075078.html", "title": "Chapter 4341 - Chapter 4341: 4340. Kill All The Control-Level Powerhouses", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4341 - Chapter 4341: 4340. Kill All The Control-Level Powerhouses</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4341: 4340. Kill all the control-level powerhouses<br/><br/>Translator: 549690339<br/><br/>Wang Xian carried the divination lamp and flew rapidly in the universe, looking for the figures of Fu Tu and the Great Sun saint.<br/><br/>At the same time, on a planet in the universe.<br/><br/>Fu Tu and the Great Sun Saint were hiding in the underground palace of this planet.<br/><br/>Since they were killed by Wang Xian the last time, they were burning with anger after being resurrected.<br/><br/>However, they soon received the news that itinerant immortal spirit and the rest were killed and fled.<br/><br/>This shocked Saint Futu and Saint Hao Yang!<br/><br/>They were shocked by Wang Xian’s strength!<br/><br/>However, although they were shocked, it also made them hate Wang Xian even more!<br/><br/>They immediately contacted itinerant immortal spirit and the rest to seek revenge.<br/><br/>Futu and Saint Hao Yang were people who would seek revenge for any flaws.<br/><br/>Even if the other party was a great dao expert.<br/><br/>However, they didn’t have their own forces and didn’t have any worries. So what if it was a great dao expert?<br/><br/>However, after they contacted itinerant immortal spirit, they didn’t want to provoke such a powerful great dao expert.<br/><br/>This made their faces a bit embarrassed.<br/><br/>In the end, they came up with a condition.<br/><br/>That was the creatures of the entire universe.<br/><br/>Yes, they came up with the creatures of the entire universe to let loose immortal spirit and the others cooperate with them.<br/><br/>Although the Dragon King who killed them was very strong.<br/><br/>He was a powerhouse at the Great Dao level.<br/><br/>But as long as they worked together, they would have four powerhouses at the control level, plus one at the beginner level.<br/><br/>In fact, if they were to count in detail, they would have five control-level experts.<br/><br/>This was because the immortal spirit loose cultivator and the others were not the weakest control-level experts.<br/><br/>Five control-level experts, even if the Dragon King was very strong, as long as they joined forces, they could still contend with him.<br/><br/>They could still make the Dragon King pay a terrible price!<br/><br/>When the immortal spirit loose cultivator from the evil sequence camp received the news of Saint Futu and Saint Haoyang, he secretly thought that they were crazy, but he also agreed.<br/><br/>After all, this was a creature of the entire universe.<br/><br/>If they could obtain it, they would be able to improve quite a bit.<br/><br/>In addition, when they joined forces, they weren’t afraid of the Dragon King at all!<br/><br/>However, they had just been killed by the Dragon King, so they needed to recover their strength.<br/><br/>In addition, they needed to find the Dragon King’s location.<br/><br/>Therefore, they didn’t take any action.<br/><br/>“HMM? Why do I feel like I’m locked on?”<br/><br/>At this moment, in the Underground Palace of the Life Planet.<br/><br/>Saint Futu suddenly opened his eyes, and a surprised look appeared on his face.<br/><br/>He was a light-attributed expert, and he had a special sense.<br/><br/>He would sense danger.<br/><br/>He frowned slightly, and with a thought, he immediately sent a voice transmission to Saint Haoyang.<br/><br/>“Haoyang, I have a bad feeling. I feel that I’m locked on.”<br/><br/>Saint Futu sent a voice transmission to Saint Haoyang!<br/><br/>“Eh?”<br/><br/>After receiving his message, the Haoyang Saint moved and instantly appeared at his side.<br/><br/>“What’s going on? I have set up the Life Spirit Heaven Flame around me, but I didn’t sense any experts approaching. Why do you have such a Feeling?”<br/><br/>The Haoyang saint frowned slightly, and a solemn expression appeared on his face.<br/><br/>The Haoyang Saint paid great attention to Saint Futu’s senses.<br/><br/>“I don’t know. I keep feeling like I’m locked on.”<br/><br/>Buddha saint shook his head. He moved his palm and took out a treasure that was on the run, holding it in his hand.<br/><br/>“Let me check it out!”<br/><br/>The vast sun saint moved his palm and flicked his finger. A streak of flame fused into the planet and quickly spread out in the surroundings.<br/><br/>However, the vast sun saint searched for a full hour, but he didn’t find anything.<br/><br/>“There’s nothing wrong. Should we go somewhere else?”<br/><br/>The vast sun saint paid a lot of attention to Saint Futu’s premonition.<br/><br/>Experts at their level usually had premonitions prepared.<br/><br/>“Okay, let’s go somewhere else!”<br/><br/>The vast sun saint nodded, and the two left immediately.<br/><br/>They hadn’t recovered to their peak yet.<br/><br/>They still needed tens of millions of years of cultivation to recover.<br/><br/>The two of them moved to another empty space.<br/><br/>They were surrounded by meteorites, and the entire Void was dead silent.<br/><br/>“Do you still have this feeling?”<br/><br/>The Great Sun Saint looked at Saint Futu and asked.<br/><br/>“Yes, could it be the Dragon King?”<br/><br/>Saint Futu frowned. This special premonition always gave him a bad feeling.<br/><br/>It was a terrifying feeling!<br/><br/>“It shouldn’t be. He has been away for a long time. It’s impossible for him to come here again. Besides, it’s impossible for him to completely kill us. He should be clear about it.”<br/><br/>Saint Haoyang shook his head and scanned his surroundings. “Could there be experts around our universe spying on My Universe?”<br/><br/>“It’s very possible. We will act according to the situation.”<br/><br/>Saint Futu nodded and reminded the saint of haoyang.<br/><br/>The saint of haoyang nodded his head.<br/><br/>“They actually changed their location?”<br/><br/>At the same time, at the edge of the universe, Wang Xian could predict their change of location through the divination lamp. He raised his eyebrows slightly.<br/><br/>However, Wang Xian was already quite far away from them, so the general direction did not change much.<br/><br/>He continued to fly forward.<br/><br/>Time passed by little by little.<br/><br/>The universe was very big. Even with Wang Xian’s current strength, it would take him hundreds of years to fly from one side to the other.<br/><br/>This was under the condition of Wang Xian’s extreme speed.<br/><br/>However, the location where Saint Futu and Saint Haoyang were located was at the center of the universe.<br/><br/>Two hundred years later, Wang Xian arrived at the center of the universe.<br/><br/>The divination lamp continued to perform divination, and Wang Xian obtained an accurate location.<br/><br/>Then, he flew over quickly.<br/><br/>After flying for a few more years, Wang Xian arrived at a barren area.<br/><br/>Looking at this area, the corner of his mouth curled up slightly.<br/><br/>Saint Futu and Saint Haoyang were inside.<br/><br/>Wang Xian circulated his body and the power of chaos enveloped his entire body. His aura and energy were transformed.<br/><br/>In an instant, his aura changed completely.<br/><br/>Even if he was an expert at the Great Dao level, he would still be considered an expert at the peak of the Dominator realm after careful inspection.<br/><br/>Wang Xian changed his appearance and entered the void where there were no living beings.<br/><br/>There were meteorites around the void.<br/><br/>The distance between Wang Xian and Saint Futu, Saint Hao Yang, was getting closer and closer!<br/><br/>A few days later, Wang Xian sensed something and pretended to be an ordinary living being as he continued flying forward.<br/><br/>At this moment, Saint Futu and Saint Hao Yang, who were hiding in the two meteors, sensed something.<br/><br/>“A living being at the peak of the Dominator realm!”<br/><br/>Saint Hao Yang transmitted his voice!<br/><br/>“Don’t bother about it.”<br/><br/>Saint Futu pondered for a moment and said.<br/><br/>He still felt that he was locked on, but nothing had happened in the past few years, so he didn’t want to cause any more trouble.<br/><br/>Now, it wouldn’t be long before their strength was restored to its peak.<br/><br/>When the time came, he would investigate why he had this feeling.\t\t\t\t\t\t</div>", "images": {}, "success": true}