{"id": 1330, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075046.html", "title": "Chapter 4333 - Chapter 4333: 4332. Quiet", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4333 - Chapter 4333: 4332. Quiet</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4333: 4332. quiet<br/><br/>Translator: 549690339<br/><br/>The strength of Wang Xian song pagoda and old man Jian have seen it.<br/><br/>They are no match for each other in a one-on-one fight.<br/><br/>Although they are also very powerful, in the Justice League position is very high.<br/><br/>But if you can make friends, make friends.<br/><br/>What’s more, this time, Wang Xian really solved a huge hidden danger for the Sword Master!<br/><br/>“You really need to thank him properly.”<br/><br/>The old man nodded and looked at Wang Xian. “Thank you, brother Wang Xian. Come to my sword sect later and let us thank you. As for the misunderstanding just now, I apologize on behalf of the sword sect!”<br/><br/>“It’s nothing. If I knew that you are a strong practitioner of the sword sect, I wouldn’t have made a move. Hehe!”<br/><br/>Wang Xian smiled and waved his arm.<br/><br/>One corpse after another flew out. These were the powerful disciples of the sword sect and the Footloose sect that Wang Xian had just killed!<br/><br/>One of them had just entered the Heavenly Yuan blessed realm while the other was at the control level.<br/><br/>The one who had just entered the control level was from the sword sect while the one who had just entered the control level was from the Footloose sect!<br/><br/>“Patriarch of the Footloose sect, I’m really sorry that you guys are involved in this matter. Our Sword sect will give you guys some compensation. Let’s just forget about this matter. How about it?”<br/><br/>The old man looked at the Patriarch of the Footloose sect and said to him!<br/><br/>The Patriarch of the Footloose sect stood there, his expression changing slightly.<br/><br/>He hadn’t expected this outcome either.<br/><br/>Not only did they not fight, but this mysterious expert had become a guest of the sword sect!<br/><br/>In addition, the embryo was an extremely powerful treasure in his eyes.<br/><br/>He was very tempted and envious.<br/><br/>However, after seeing the attitude of old man Jian and Song Ta, he knew that they had a good relationship. The embryo belonged to that mysterious expert.<br/><br/>In the end, their carefree sect’s patriarch had interfered in the matter between the sword sect and this expert, and had instead stirred up trouble!<br/><br/>This made him somewhat angry. It seemed like it was time for his disciples to be properly dealt with!<br/><br/>“Forget it. This matter was originally my fault for teaching my disciples. Give me the corpses of our disciples and forget about this matter. This is your friend. Let’s make friends.”<br/><br/>“This friend, can you give me the corpses of my strong disciples? You have taught them a lesson anyway.”<br/><br/>The leader of the Xiaoyao sect nodded his head and looked at Wang Xian!<br/><br/>“Sure!”<br/><br/>Wang Xian nodded his head and passed the corpse to the ancestor of the Xiaoyao sect.<br/><br/>“Hehe, I didn’t expect that this would be considered as an exchange of blows!”<br/><br/>Saint Shan Tian’s eyes flickered when he saw this scene.<br/><br/>He didn’t expect such a situation either. However, he chuckled and said.<br/><br/>“The lamp of divination is in brother Wang Xian’s hands. What’s the matter, Shan Tian? Have you fought with brother Wang Xian before?”<br/><br/>Song ta heard his words and looked at Saint Shan Tian. He raised his eyebrows and asked.<br/><br/>“Haha, we have fought before. It can be said that we don’t know each other without fighting. We have made a deal with the Dragon King.”<br/><br/>Saint Shan Tian replied with a smile!<br/><br/>“I’m very curious to be able to trade for your divination lamp. Are you sure that this divination lamp is not the spoils of War of brother Wang Xian?”<br/><br/>Song Ta could not help but tease him!<br/><br/>“Song Ta, don’t spout nonsense. Brother Wang Xian happens to have another part of my star field. Otherwise, why would I be willing to hand over the divination lamp?”<br/><br/>Saint Shan Tian shook his head and said speechlessly!<br/><br/>“Oh? Your Star Field’s Ultimate Treasure of Tianyuan Destiny is about to reappear in the Universe?”<br/><br/>Song Ta revealed a look of surprise.<br/><br/>“At that time, Your Song Ta won’t be my match!”<br/><br/>Saint Shan Tian slightly narrowed his eyes!<br/><br/>“Hehe, everyone, if there’s nothing else, come to my sword sect and have a seat.”<br/><br/>The sword old man laughed and said to them.<br/><br/>“Hehe, good!”<br/><br/>Saint Shan Tian nodded and agreed.<br/><br/>The carefree sect’s ancestor also agreed.<br/><br/>At their level, although they were basically invincible, very few could suppress them.<br/><br/>However, if they could get to know experts of the same level, it would also be beneficial.<br/><br/>After all, in their universe, they were already invincible and lonely.<br/><br/>It was also a good thing to be able to make a few friends of the same level.<br/><br/>If anything happened in the future, they could take care of each other.<br/><br/>“Hahaha, let’s go. I’ll take out the fine wine that I’ve brewed for a long time!”<br/><br/>Song ta laughed.<br/><br/>Everyone nodded and followed old man sword to fly toward the sword sect.<br/><br/>“This? This? I didn’t expect this to be the end.”<br/><br/>“Not only did they not fight, but they even went to drink together?”<br/><br/>“At their level, there are hardly any opponents left. Besides, there is no need for the Xiaoyao sect to offend such a powerful enemy. Moreover, the sword sect owes that mysterious powerhouse a favor.”<br/><br/>“That mysterious powerhouse is called Wang Xian, and Saint Shantian called him Dragon King. It seems that he is the strongest powerhouse in a powerful universe.”<br/><br/>“It’s normal for the ancestors of the Xiaoyao sect to not care about it. Although they have killed and injured their powerful disciples, the control-level powerhouse can definitely be resurrected. Now that the corpse is returned to the Xiaoyao sect, they can accept the loss. It’s much better to have such a powerful friend than to have one more enemy.”<br/><br/>“It seems that another terrifying powerhouse will appear here in the future.”<br/><br/>In the surrounding area, all the powerful disciples’eyes sparkled when they saw Wang Xian and the rest leaving. They were discussing among themselves.<br/><br/>The battle today had broadened their horizons.<br/><br/>At the same time, the name of Dragon King Immortal entered the line of sight of all the powerful disciples.<br/><br/>He was a terrifying existence.<br/><br/>An almost invincible existence.<br/><br/>At the very least, his strength was stronger than the carefree sect’s patriarch and the rest!<br/><br/>Wang Xian and the rest did not mind the discussion and shock in the trading zone.<br/><br/>The group followed old man Jian and the rest to a palace in the sword sect!<br/><br/>It was more like a huge sword peak that was emitting a majestic aura.<br/><br/>Behind them, five strong cultivators of the Heaven’s origin creation followed.<br/><br/>When they flew over, they had already contacted their disciples to investigate the specific reason for this matter.<br/><br/>If this matter was really as the Dragon King had said.<br/><br/>Then, those disciples who provoked the Dragon King would have to pay a price!<br/><br/>After all, if their sword ancestor didn’t know him, their sword sect might have befriended a powerful existence.<br/><br/>Not to mention, this Dragon King had helped their sword sect solve a huge hidden danger this time.<br/><br/>He had saved the sword sect a huge trouble in the future.<br/><br/>It was even a huge trouble that could threaten the life and death of the sword sect!<br/><br/>“Your Excellency Dragon King, we have offended you just now. We will give you a satisfactory explanation for this matter.”<br/><br/>“Your Excellency Dragon King, Your Excellency ancestor of the Xiaoyao Sect, your excellency Saint Shan Tian, please come in!”<br/><br/>They came to the front of a sword peak.<br/><br/>An expert at the control level of the sword sect apologized to Wang Xian respectfully. Then, he opened the door to the top of the sword peak and extended his hand to signal to Wang Xian!<br/><br/>“Settle this matter properly!”<br/><br/>The old man nodded and looked at Wang Xian and the rest. “Please come in.”\t\t\t\t\t\t</div>", "images": {}, "success": true}