{"id": 1334, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075062.html", "title": "Chapter 4337 - Chapter 4337: 4336 Experts From The Nine-Origin Universe Had Arrived", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4337 - Chapter 4337: 4336 Experts From The Nine-Origin Universe Had Arrived</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4337: 4336 experts from the nine-origin universe had arrived<br/><br/>Translator: 549690339<br/><br/>Mo Sha’s improvement this time was very important to the Dragon Palace and the entire nine-origin universe.<br/><br/>Needless to say, the improvement of the Dragon Palace.<br/><br/>They could plan the starry universe.<br/><br/>They could attack the Void universe.<br/><br/>If all of these were successful, the Dragon Palace would have more heavenly yuan creation realm experts.<br/><br/>“100 million years. In 100 million years, I will restore Mo Sha’s strength to the Great Dao level. In addition, I will also increase the number of heaven origin creation stage powerhouses in the Dragon Palace.”<br/><br/>Wang Xian thought to himself as his eyes sparkled.<br/><br/>100 million years. With the primal chaos stone, this cultivation period could be extended to 10 billion years.<br/><br/>In other words, in 10 billion years, Wang Xian wanted to increase the strength of the Dragon Palace by a huge margin.<br/><br/>“However, maintaining the flow of time with the primal chaos stone requires a lot of resources.”<br/><br/>Wang Xian mumbled and frowned slightly.<br/><br/>The amount of resources consumed was quite a lot.<br/><br/>An ordinary fragment of the Elemental God could only last for about ten million years.<br/><br/>One had to know that the energy of these fragments of the elemental god was comparable to that of a powerhouse who had just entered the Heaven’s origin realm.<br/><br/>If it was activated for 100 million years, it would require 10 fragments of the Elemental God.<br/><br/>This consumption was extremely terrifying.<br/><br/>Of course, the time spent in the primal chaos stone was related to the number of disciples who entered.<br/><br/>If one person were to experience the time spent, one fragment of the Elemental God would be able to last for more than 50 million years.<br/><br/>“I can still afford 10 fragments of the Elemental God.”<br/><br/>Fortunately, Wang Xian obtained more pieces of the god of elements in this chaotic region.<br/><br/>Moreover, if he really lacked them, Wang Xian would not be idle.<br/><br/>He could continue to create the ten elemental divine dragons and enter the cross-shaped primordial spirit region.<br/><br/>Although Wang Xian had obtained the primal chaos primordial stone in the cross-shaped primordial spirit region, there were still many treasures in that region.<br/><br/>At the very least, Wang Xian did not see any of the ultimate treasures of the Heaven’s origin that song Ta and the rest mentioned in the area of the cross primordial spirit.<br/><br/>The energy in the entire area was fluctuating. It was possible that Wang Xian had searched through an entire area.<br/><br/>In the next moment, the energy surged and treasures came to the area where he had searched.<br/><br/>Time passed day by day.<br/><br/>A few thousand years later, Song Ta, Saint of Heaven, and the ancestors of the carefree sect came separately.<br/><br/>They took out enough resources to trade with Wang Xian.<br/><br/>They bought a portion of the corpse of the spiritual kneader.<br/><br/>Buzz Buzz<br/><br/>On this day, while Wang Xian was cultivating in the palace with his legs crossed.<br/><br/>The communication device in his hand suddenly rang.<br/><br/>He took it out and saw the message on it. A smile appeared on his face.<br/><br/>The Fallen Shadow Demon Emperor and the rest had rushed over!<br/><br/>Wang Xian’s figure moved and immediately flew towards the location outside.<br/><br/>After the fallen Shadow Demon Emperor and the rest received news from Wang Xian, they rushed over immediately.<br/><br/>At the same time, the strong disciples of all the other peak races were also rushing over.<br/><br/>Almost all the strong practitioners of the Heaven’s origin manifestation had arrived.<br/><br/>Only the Unity Saint and Lin Niu were in charge of the nine-origin universe.<br/><br/>Wang Xian used the coordinates on the communication device to quickly welcome them.<br/><br/>Their communication device was made by the twelve ancestral warlocks.<br/><br/>If they were too far away, they wouldn’t be able to contact them.<br/><br/>However, as long as they were close enough, they would be able to communicate.<br/><br/>The Fallen Shadow Devil Emperor and the rest weren’t too far away from Wang Xian.<br/><br/>After flying for more than ten days, Wang Xian arrived at the periphery of the riot zone!<br/><br/>He looked ahead and saw a group of powerful disciples flying over.<br/><br/>The Fallen Shadow Demon Emperor, the Elven empress, the ancestor of the Netherworld race, the black tortoise ancestor, the ancestor of the royal family, the Emperor of angels, the twelve ancestor witches, the celestial nation’s floating water empress, the Divine Tiger Clan’s Tiger Roar Mountain, and the many powerful experts of the skeleton clan.<br/><br/>Beside them were more than 100,000 disciples.<br/><br/>These disciples were all at least at the fourth level of the Overlord realm.<br/><br/>They could be said to be the elites of their peak races.<br/><br/>“Dragon King!”<br/><br/>When the fallen Shadow Demon Emperor and the rest saw Wang Xian flying over, they heaved a sigh of relief in their hearts and immediately went up to welcome him with a smile.<br/><br/>When they first arrived here, they were a little shocked by everything that was happening in front of them.<br/><br/>Those streams of energy were too terrifying.<br/><br/>Even the powerhouses in the Heaven’s origin realm could feel their hearts palpitating.<br/><br/>In addition, they could vaguely sense that there were a large number of powerhouses in the Heaven’s origin realm in front of them.<br/><br/>It was their first time here, so they had to be cautious.<br/><br/>“Hehe, fallen Shadow Demon Emperor, everyone, you are here. Let’s go.”<br/><br/>Wang Xian looked at them and said with a smile!<br/><br/>“Dragon King, there are many powerhouses here.”<br/><br/>The Shadow Devil Emperor Glanced ahead and said to Wang Xian in shock.<br/><br/>“Yes, there are a lot of strong people from the Justice Union here. There are at least a few hundred of them.”<br/><br/>“Now, there are a lot of living beings here because there is a very suitable area for cultivation. After all, there are a few hundred strong disciples from the universe here.”<br/><br/>Wang Xian introduced them with a smile. With a wave of his arm, the Five Elements Millstone appeared under their feet!<br/><br/>“Let’s go. I’ll show you around!”<br/><br/>He continued.<br/><br/>“Thank you, Dragon King.”<br/><br/>The group of powerhouses immediately responded.<br/><br/>Especially the queen of floating water of huming mountain. When facing Wang Xian, they were like disciples.<br/><br/>“I know a little about the universe of the Justice Alliance. However, the area I used to be active in was in another area in the chaos. That area is where the disciples of some neutral universe powerhouses are active.”<br/><br/>“That area is called origin. It’s an incomparably huge chaos stone. However, there are more chaos behemoths there.”<br/><br/>The Fallen Shadow Demon Emperor stood beside Wang Xian and said!<br/><br/>“Origin? Chaos Behemoth?”<br/><br/>Wang Xian nodded slightly when he heard that.<br/><br/>The Fallen Shadow Demon Emperor was very powerful. Before the apocalypse, he spent most of his time in the chaos.<br/><br/>However, he was not going to this place, but in another direction.<br/><br/>There was also a place similar to the riot zone there.<br/><br/>“Yes, but it’s not suitable for disciples to cultivate there.”<br/><br/>The Fallen Shadow Demon Emperor nodded. “Of course, I don’t know if there are any changes since the apocalypse has arrived.”<br/><br/>“Dragon King, the energy in front of us is really scary. are those glowing lights the elemental gods?”<br/><br/>The Elven empress looked ahead and asked in slight shock.<br/><br/>“Yes, there are many elemental gods here, and the position inside is even more chaotic. Before this place became gentler, no one at the control level could enter the core.”<br/><br/>“In the center of this chaotic area, there are ten elemental gods, each with ten attributes. Each of these ten elemental gods’energy is comparable to the might of two great dao level experts. They are very terrifying.”<br/><br/>“Great Dao level powerhouses can’t last more than a minute in their zone. Of course, there are also fragments of elemental gods. To obtain them, we need some means.”<br/><br/>Wang Xian introduced them to the elven empress one by one!<br/><br/>“Is it that terrifying?”<br/><br/>The Elven empress and the rest of them were shocked.<br/><br/>“There are many treasures here, but there is also a huge crisis. You can go and take a look, but be careful.”<br/><br/>Wang Xian reminded them.\t\t\t\t\t\t</div>", "images": {}, "success": true}