{"id": 1333, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075058.html", "title": "Chapter 4336 - Chapter 4336: 4335 — Perfect Possession", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4336 - Chapter 4336: 4335 — Perfect Possession</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4336: 4335 — perfect possession<br/><br/>Translator: 549690339<br/><br/>“Mo Sha, refine this wisp of energy and wrap it around your body.”<br/><br/>Wang Xian moved his palm and a wisp of energy appeared in his palm.<br/><br/>It flew to Mo Sha.<br/><br/>“It’s the Dragon King!”<br/><br/>Mo sha nodded and started to refine it immediately!<br/><br/>It was still extremely difficult to refine a wisp of chaotic energy.<br/><br/>Time passed by minute by minute. A few thousand years later, the Wisp of chaotic energy was completely refined by Mo Sha.<br/><br/>However, a few thousand years in the primal Chaos Stone was only a few decades in the outside world!<br/><br/>“Dragon King, the refinement is successful!”<br/><br/>Mo sha wiped the sweat off his forehead and said to Wang Xian!<br/><br/>“Alright, try to wrap this energy around your entire body.”<br/><br/>Wang Xian continued to instruct Mo Sha.<br/><br/>Mo Sha nodded his head and moved that wisp of energy bit by bit.<br/><br/>Infusing his body with the energy of the power of chaos.<br/><br/>Time passed little by little again.<br/><br/>Wang Xian stared at Mo sha as his eyes sparkled.<br/><br/>“It’s about time!”<br/><br/>Wang Xian saw that Mo Sha’s aura was tainted with the power of chaos. He took out the divination lamp and continued his divination.<br/><br/>The current demonic fiend had traces of the power of chaos on its body.<br/><br/>And the power of Chaos originated from the primal chaos stone.<br/><br/>This primal chaos stone once possessed a terrifying fusion power.<br/><br/>At that time, a divine dragon of ten attributes that Wang Xian created was absorbed perfectly in an instant.<br/><br/>Wang Xian didn’t even have the slightest ability to resist.<br/><br/>Furthermore, he was almost fused by this primal chaos stone.<br/><br/>Fortunately, the system had warned him to use up a large amount of resources to open up the Dragon Palace, allowing him to escape.<br/><br/>Otherwise, Wang Xian would have already disappeared.<br/><br/>He had already fused with this primal chaos stone and survived in another way.<br/><br/>In this way, Wang Xian had no consciousness. It was equivalent to another form of death.<br/><br/>The characteristics of the power of chaos could turn everything into chaos. Everything could also turn into chaos.<br/><br/>With a trace of the power of chaos, could this form of possession achieve perfection?<br/><br/>Very soon, the lamp of divination gave Wang Xian a result.<br/><br/>Wang Xian’s eyes revealed a hint of excitement.<br/><br/>The perfection of possession had reached 99.99% .<br/><br/>This was already considered a perfect form of possession.<br/><br/>“Mo Sha, carry out the possession immediately!”<br/><br/>Wang Xian’s eyes glowed as he instructed mo sha.<br/><br/>“It’s the Dragon King!”<br/><br/>Mo Sha nodded his head and looked at the embryo.<br/><br/>The half-liquid body entered the embryo and began the possession!<br/><br/>Wang Xian stared at it intently.<br/><br/>“Ah!”<br/><br/>Mo Sha entered the embryo and quickly absorbed everything from the demon.<br/><br/>The demon who had been in a deep sleep was suddenly invaded into the core. At the moment of life-and-death crisis, he woke up.<br/><br/>Feeling that he was rapidly losing control of the embryo, he let out a terrified scream.<br/><br/>“Who are you?”<br/><br/>“You dare to possess me?”<br/><br/>“Do you know what a great existence I am?”<br/><br/>The demon’s sharp voice rang out. His voice was filled with fear!<br/><br/>“Damned ant, you dare to possess me? Die!”<br/><br/>“Ah, what is this? What is this?”<br/><br/>“No, no, no. My last hope of resurrection. No, no, no, don’t possess me. Don’t kill me. I can do whatever you want!”<br/><br/>“I can be your slave. I can be your slave. Don’t kill me!”<br/><br/>In the embryo, the demon’s voice went from anger to fear to despair.<br/><br/>Finally, it turned into a plea.<br/><br/>Wang Xian looked at it coldly from the side. His eyes were sparkling!<br/><br/>“What kind of energy is this? Why Can’t I resist it? No!”<br/><br/>When the last scream was heard.<br/><br/>The embryo slowly released a wave of energy.<br/><br/>This was an energy that Wang Xian was very familiar with.<br/><br/>The Scream came to an abrupt end. The demon was replaced.<br/><br/>Just like how Mo Sha and the rest used to parasitize other living beings, they were able to receive everything from them perfectly.<br/><br/>Memories, opportunities, and aptitude.<br/><br/>The Devil Man was an existence with the darkness attribute, and so was Mo Sha.<br/><br/>This was because waves of energy were surging out from the embryo.<br/><br/>This energy belonged to Mo Sha.<br/><br/>He had completely eliminated his original body from the embryo.<br/><br/>This was because, compared to everything about the Devil Man, everything about Mo Sha was a impurity.<br/><br/>As long as one had consciousness, everything else would be abandoned.<br/><br/>This was a true possession, a perfect possession!<br/><br/>Buzz<br/><br/>When Wang Xian saw this scene, he waved his arm and an elemental god fragment appeared in his hand.<br/><br/>The Darkness Attribute Elemental God fragment was emitting a powerful energy.<br/><br/>Wang Xian controlled the energy of the elemental god fragment and slowly poured it into the embryo.<br/><br/>The entire embryo was absorbing it rapidly.<br/><br/>It was like a sponge, absorbing the energy at a terrifying speed.<br/><br/>At the same time, the embryo grew bigger and turned into the appearance of Mo Sha.<br/><br/>Wang Xian moved his palm again and took out all the god of elements fragments with the darkness attribute in his hand and placed them beside Mo Sha.<br/><br/>There were a total of four pieces of God of elements fragments with the darkness attribute.<br/><br/>These four pieces of God of elements fragments were extremely valuable.<br/><br/>To any large sect, they were all rare treasures.<br/><br/>Mosha was rapidly absorbing them, and the energy in his body was also growing rapidly.<br/><br/>His aura quickly reached the peak of the ruler realm.<br/><br/>However, all of this did not stop.<br/><br/>Mosha had inherited everything from the demon, and it was also a perfect possession.<br/><br/>This was equivalent to him being a demon, and the demon was him.<br/><br/>The Devil Man was originally a Great Dao level powerhouse.<br/><br/>A powerhouse at this level would cultivate again after death without any shackles.<br/><br/>As long as there was enough energy, he could recover quickly.<br/><br/>With enough resources, he could quickly recover to the Great Dao level.<br/><br/>Now that he had the energy of the Elemental God fragment, without shackles, mosha could quickly improve.<br/><br/>The peak of the ruler realm was just the beginning.<br/><br/>Very soon, a surge of energy gushed out from Mo Sha’s body.<br/><br/>His strength had directly reached the initial stage of the Heaven’s origin creation realm.<br/><br/>Naturally, there was no need for the quota of the Heaven’s origin creation realm for the powerhouses to come back from the dead to cultivate again.<br/><br/>When Mo Sha broke through to the Heaven’s origin creation realm, he didn’t even use up a single fragment of the god of elements.<br/><br/>The energy of the surrounding fragments of the god of elements continued to surge into his body.<br/><br/>Wang Xian exited the primal chaos stone and sensed it with a smile in the outside world.<br/><br/>In the future, besides him, the Dragon Palace would also have top-notch heaven origin creation-level powerhouses.<br/><br/>Along with Lin Niu and Xiao Lan, the Dragon Palace’s strength was not weak.<br/><br/>However, from Wang Xian’s point of view, it was not too strong.<br/><br/>He was not satisfied.<br/><br/>According to what he knew, there were about ten heaven origin creation-level powerhouses in old man Jian’s sword sect.<br/><br/>The Dragon Palace was still lacking.<br/><br/>They still needed to continue to nurture them!<br/><br/>“If the demonic fiend can reach the Great Dao level, I can consider sweeping across the entire starry universe. Even little white and the rest have broken through!”<br/><br/>Wang Xian thought to himself as a look of anticipation appeared on his face.<br/><br/>However, if the demonic fiend wanted to recover to the Great Dao level, it would require a lot of energy. It was too huge!\t\t\t\t\t\t</div>", "images": {}, "success": true}