{"id": 1336, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075070.html", "title": "Chapter 4339 - Chapter 4339: 4338, The Second Disciple Who Had Reached The Threshold!", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4339 - Chapter 4339: 4338, The Second Disciple Who Had Reached The Threshold!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4339: 4338, the second disciple who had reached the threshold!<br/><br/>Translator: 549690339<br/><br/>Wang Xian brought them to the location of the Dragon Palace.<br/><br/>Following that, the 12 ancestral sorcerers immediately set up the formation.<br/><br/>Wang Xian took out some relatively precious items to set up the formation.<br/><br/>After that, he did not bother about these matters.<br/><br/>Time passed bit by bit. Wang Xian was in the palace watching the situation of the disciples of the Dragon Palace.<br/><br/>Soon, five million years passed.<br/><br/>On this day, a cold gleam swept across the entire primal chaos stone.<br/><br/>In the surrounding area, a group of disciples of the Dragon Palace opened their eyes and looked at bei Shuang.<br/><br/>“Congratulations, bei Shuang. You have touched the threshold of a breakthrough!”<br/><br/>The group of disciples of the Dragon Palace immediately congratulated her with envy in their eyes!<br/><br/>“Phew!”<br/><br/>Bei Shuang opened her eyes. Her eyes were filled with excitement.<br/><br/>“I’m also relying on the treasure to take the first step. Good luck, everyone!”<br/><br/>Bei Shuang smiled and said to the group of leaders of the disciples from the Dragon Palace.<br/><br/>At the same time, Wang Xian also sensed bei Shuang’s change. A smile appeared on his face.<br/><br/>The disciples from the Dragon Palace were finally the first to complete the breakthrough.<br/><br/>Moreover, it was his own disciple, bei Shuang.<br/><br/>Bei Shuang’s breakthrough did not exceed Wang Xian’s expectations. After all, the energy of that mutated frost gem was indeed terrifying.<br/><br/>It was also very suitable for bei Shuang.<br/><br/>Moreover, once bei Shuang made a breakthrough, as an existence with mutated attributes, his strength was stronger than an expert who had just stepped into the Heaven’s origin creation level.<br/><br/>The reason for the mutation attribute allowed him to be comparable to an expert who had just stepped into the Heaven’s origin creation level with the space attribute.<br/><br/>“That’s right, bei Shuang. Let’s go back to the nine origin universe to make a breakthrough!”<br/><br/>Wang Xian said to her with a smile on his face.<br/><br/>Bei Shuang’s uniqueness allowed him to make a breakthrough directly in the nine origin universe.<br/><br/>This was one of the benefits of the mutation attribute.<br/><br/>“Yes, Master!”<br/><br/>Bei Shuang nodded her head happily.<br/><br/>If one didn’t enter the Heaven Origin Creation Realm, one would eventually face death!<br/><br/>Only by entering the Heaven’s origin would one be able to transcend everything!<br/><br/>Wang Xian called an lie over and brought bei Shuang back to the nine-origin universe!<br/><br/>“Let’s break through!”<br/><br/>They flew out of the Dragon Palace directly. Wang Xian said to bei Shuang with a smile on his face!<br/><br/>“Okay!”<br/><br/>Bei Shuang nodded her head heavily.<br/><br/>“Roar!”<br/><br/>His body moved and he immediately flew to the sky above the Dragon Palace.<br/><br/>When some of the strong disciples in the Dragon Palace saw this, they flew out one after another!<br/><br/>“Lord bei Shuang is about to break through!”<br/><br/>“I didn’t expect our Lord bei Shuang to be the first to break through.”<br/><br/>“With the help of Lord Dragon King, Our Dragon Palace will have more and more heaven origin destiny realm powerhouses.”<br/><br/>When the disciples of the Dragon Palace saw this scene, they revealed excited expressions.<br/><br/>“Dragon King!”<br/><br/>“Xiao Xian!”<br/><br/>At this moment, Linniu Lan Qingyue and the rest also flew over and came to Wang Xian’s side!<br/><br/>“Is bei Shuang about to break through?”<br/><br/>Guan Shuqing looked at bei Shuang who had turned into a frost divine dragon and asked with a twinkle in her eyes.<br/><br/>“Yes, she’s about to break through. All of you must work hard and strive to reach the destiny realm of the Heaven’s origin realm.”<br/><br/>Wang Xian looked at the group of girls and said with a smile!<br/><br/>The group of girls were not as serious in their cultivation as the leaders of the Dragon Palace.<br/><br/>Other than Qing Yue, none of them had reached the peak of the Dominator realm.<br/><br/>However, they had already reached the ninth level of the Dominator realm!<br/><br/>They were not far away from the peak of the Dominator realm.<br/><br/>In the next four to five billion years, they would just have to touch the threshold of breaking through!<br/><br/>Wang Xian believed that he could make them reach this stage!<br/><br/>“Looks like we have to train hard!”<br/><br/>The group of girls said.<br/><br/>“Roar! Roar! Roar!”<br/><br/>Bei Shuang raised her head and roared. An endless amount of water energy surged towards them.<br/><br/>The moment it got close to her, it turned into crystals that shimmered under the sunlight.<br/><br/>The terrifying power caused the powerhouses in the nine-origin universe to be shocked!<br/><br/>“HMM? There are powerhouses making a breakthrough? How is this possible? Aren’t the slots in our nine-origin universe used up? In the direction of the Dragon Palace!”<br/><br/>Hetian saint immediately flew out of the palace and looked over after sensing this powerful force.<br/><br/>He hesitated for a moment and directly teleported toward the Dragon Palace through the teleportation array!<br/><br/>Not long after the demon race made a breakthrough, Jiuli, who was in charge of the nine-origin universe, also flew out of the Demon Abyss. His eyes flickered as he directly teleported toward the Dragon Palace!<br/><br/>Buzz! Buzz! Buzz<br/><br/>Buzz! Buzz<br/><br/>The two peak races had teleportation arrays that could directly reach the Dragon Palace.<br/><br/>When they teleported over, they immediately saw Northern Frost, who had made his breakthrough in the sky.<br/><br/>“This is? The mutated Divine Dragon, Frost Divine Dragon, the disciple of the Dragon King, a powerhouse with mutated attributes. This is unique in the entire nine-origin universe!”<br/><br/>“No wonder he could achieve a breakthrough.”<br/><br/>When he saw this scene, Saint Hetian’s eyes narrowed as he spoke in shock.<br/><br/>“Congratulations, Dragon King. The Dragon Palace has another powerhouse.”<br/><br/>Saint Hetian immediately flew over and bowed respectfully to Wang Xian.<br/><br/>“Congratulations, Dragon King! Congratulations, Dragon Palace!”<br/><br/>Jiuli also flew over and congratulated Wang Xian respectfully.<br/><br/>Wang Xian nodded at them and looked at bei Shuang.<br/><br/>Bei Shuang’s breakthrough was very smooth.<br/><br/>“Master, I’ve made a breakthrough!”<br/><br/>Bei Shuang had made a breakthrough and flew to Wang Xian with a face full of joy.<br/><br/>“Not bad!”<br/><br/>Wang Xian nodded. “For the next period of time, you should stabilize your cultivation at the Dragon Palace.”<br/><br/>“Yes, Master!”<br/><br/>Bei Shuang nodded her head.<br/><br/>“Congratulations, bei Shuang.”<br/><br/>A group of girls flew over and congratulated bei Shuang.<br/><br/>This made bei Shuang smile in embarrassment.<br/><br/>“Dragon King, do you want to arrange a celebratory feast for Miss bei Shuang?”<br/><br/>Saint he Tian said with a smile from the side.<br/><br/>“Forget it for the time being. The experts from the nine-origin universe are all outside now. We can prepare when we have time.”<br/><br/>Wang Xian shook his head.<br/><br/>After chatting with them for a while, Wang Xian returned to the Dragon Palace.<br/><br/>Although bei Shuang’s breakthrough was not celebrated in the nine-origin universe, it was held in the Dragon Palace!<br/><br/>Wang Xian stayed in the Dragon Palace for some time before returning to the Great Dao of heaven.<br/><br/>Time passed once again.<br/><br/>Another 100,000 years passed. In the primal chaos stone, another 10,000,000 years passed.<br/><br/>On this day, another powerhouse from the Dragon Palace reached the threshold of a breakthrough!<br/><br/>The second person to reach the threshold was Shui Linglong’s father, the leader of the water element in the Dragon Palace.<br/><br/>With the huge amount of resources, the dragon palace began to produce disciples who had reached the shackle!<br/><br/>“Dragon King!”<br/><br/>Shui Linglong’s father, the leader of the Water God Dragon, looked at Wang Xian with excitement and called out respectfully.<br/><br/>“Very good. Wait here for now. I need to find a universe that can help you break through!”<br/><br/>Wang Xian said to him with a smile on his face!<br/><br/>“It’s the Dragon King!”<br/><br/>The leader of the Water Dragon God nodded his head.<br/><br/>Wang Xian took out his heaven’s origin communicator and browsed through it while looking at the messages one by one.<br/><br/>On the Heaven’s origin communicator, the Heaven’s origin creation quota was sold.<br/><br/>Similarly, some universes encountered a crisis and would take out the Tian Yuan creator slot to trade for help.<br/><br/>The backers could even raise this condition!\t\t\t\t\t\t</div>", "images": {}, "success": true}