{"id": 1340, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075086.html", "title": "Chapter 4343 - Chapter 4343: 4342 Completely Annihilated Those Below The Control Level", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4343 - Chapter 4343: 4342 Completely Annihilated Those Below The Control Level</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4343: 4342 completely annihilated those below the control level<br/><br/>Translator: 549690339<br/><br/>There was a demonic spirit altar at Tianci’s place in the six paths universe.<br/><br/>Wang Xian could let an lie bring him to the six paths universe in an instant.<br/><br/>In the next instant, after Wang Xian arrived at the six paths universe, he immediately flew out.<br/><br/>Tianci was not at the Mu Li tribe.<br/><br/>Wang Xian did not greet the Mu Li tribe either. Instead, he flew straight out.<br/><br/>The strength of the six paths universe was not bad. No universe dared to invade them at will.<br/><br/>Wang Xian flew out of the universe in a year through the teleportation formation of the six paths universe.<br/><br/>“Saving tens of thousands of years in one go. Not bad. I don’t think Saint Futu and saint haoyang would be able to react in time.”<br/><br/>Wang Xian smiled and flew straight out of the chaos.<br/><br/>“Damn it, damn it!”<br/><br/>“That damn fellow actually wants to destroy us completely.”<br/><br/>At the same time, at the land of origin.<br/><br/>The land of origin was a place where many powerhouses of the universe gathered.<br/><br/>There were a large number of powerhouses and some chaos behemoths running amok here.<br/><br/>Many powerhouses in the Heaven’s origin realm were trying to hunt down the chaos behemoths here.<br/><br/>In the land of origin, there was a huge chaos meteorite.<br/><br/>There were many holes in the meteorite.<br/><br/>The huge meteorite was like a beehive.<br/><br/>There was a pool in the deep hole.<br/><br/>There were two flowers in the pool.<br/><br/>The flowers were huge, four to five in size.<br/><br/>At this moment, angry voices came from the flowers.<br/><br/>Soon after, the flower began to open and begin to wither.<br/><br/>The figures of Saint Futu and Saint Haoyang slowly appeared.<br/><br/>This was one of their resurrection treasures.<br/><br/>It was the place they thought was the safest for resurrection treasures.<br/><br/>“That Dragon King has a way to lock onto us. Damn it, we’ve lost too much this time!”<br/><br/>Saint Haoyang’s expression was very ugly.<br/><br/>They had been killed several times in a row, and their losses were too great.<br/><br/>The supreme treasure they had resurrected had consumed too much energy.<br/><br/>This was even the last supreme treasure they had that could maintain the strength of the Heavenly Yuan blessed realm.<br/><br/>If they were to be killed again, their strength would drop to the ruler realm.<br/><br/>“Will we be discovered again if we resurrect here?”<br/><br/>The Haoyang Saint looked at Saint Futu and said with an embarrassed expression!<br/><br/>“I don’t know, but this place is very far away from our sky-receiving universe. Even if he is a great dao expert, it will take him fifty to sixty thousand years or more to get here.”<br/><br/>“He might not be able to lock on to us from such a far place!”<br/><br/>Saint Futu said with a gloomy face!<br/><br/>“We’re not afraid of anything.”<br/><br/>Saint Haoyang said with a gloomy face, “However, this place is very secretive and hard to find. If he finds us, we won’t be able to escape from him at all. We’ll just wait for death.”<br/><br/>“No, the Dragon King won’t be able to find us here.”<br/><br/>Saint Futu firmly believed that it was as if he was hypnotizing himself.<br/><br/>However, they really didn’t believe that they would be able to find such a hidden place even though they had been resurrected so far away!<br/><br/>“There are some resources here. Let’s recover our strength first. This place of origin is very dangerous.”<br/><br/>Saint Haoyang nodded with a solemn face and continued speaking!<br/><br/>Saint Futu nodded.<br/><br/>This place of resurrection was the safest place they thought.<br/><br/>That was because it was far enough.<br/><br/>Even if the enemies were to attack their universe and kill them, they would be able to resurrect here!<br/><br/>In addition, they had left some resources here!<br/><br/>For accidents to happen and for rapid recovery.<br/><br/>The two of them sat cross-legged and began to recover immediately.<br/><br/>Time passed by slowly.<br/><br/>At the same time, Wang Xian was flying rapidly in the chaos.<br/><br/>The distance from the six universes to this place was a little further than he had imagined.<br/><br/>After flying for more than six thousand years, Wang Xian finally arrived here.<br/><br/>“According to the map of the expert from the evil sequence faction, this is the location in front.”<br/><br/>“And this is also the place where the Shadow Devil Emperor mentioned. It’s the place of origin. The disciples of the experts from the nine-origin universe used to look for treasures in this direction and roam the Chaos!”<br/><br/>Wang Xian thought to himself.<br/><br/>In the chaos, the Justice Alliance and the Evil Sequence Alliance were only a small part of the chaos.<br/><br/>No one knew how big the chaos was!<br/><br/>The strong disciples who were active in the place of origin were mostly from the neutral camp.<br/><br/>Wang Xian flew over and looked at the incomparably huge chaos stone that was like a beehive. His face was filled with shock.<br/><br/>This chaos gem was too huge.<br/><br/>It was so huge that it was comparable to the size of a universe.<br/><br/>One could imagine how terrifying it was.<br/><br/>According to the Fallen Shadow Devil Emperor, there were many chaos behemoths living here.<br/><br/>Those deep pits were the nests of some chaos behemoths.<br/><br/>The interior of this chaos gem contained a special and terrifying energy. It was extremely dangerous for a powerhouse to enter it.<br/><br/>This was a special domain similar to the riot zone.<br/><br/>However, it was different from the riot zone. There was no elemental God here. Naturally, there were no elemental god fragments and all sorts of gemstones.<br/><br/>The chaos behemoths here were resources.<br/><br/>It was extremely difficult to hunt and kill the chaos behemoths.<br/><br/>Wang Xian did not come here to investigate the situation.<br/><br/>Nor did he have the interest to study this place in detail.<br/><br/>The priority was to get rid of Saint Futu and Saint Haoyang first.<br/><br/>With a move of his palm, the divination lamp began to perform divination.<br/><br/>A detailed path appeared in his sight.<br/><br/>Wang Xian’s figure moved and immediately flew towards the place of origin.<br/><br/>The closer he got to the huge chaos meteorite, the more shocked he was.<br/><br/>In front of this chaos meteorite, he was smaller than an ant.<br/><br/>There were some extremely huge caves inside. The entrances were extremely terrifying, like a terrifying abyss.<br/><br/>Wang Xian could sense that there were some powerhouses in the Heaven’s origin realm in the surroundings.<br/><br/>There were many powerhouses gathered in this area.<br/><br/>The information that the six paths of the universe had the ultimate treasure of the Heaven’s origin realm came from here.<br/><br/>Wang Xian did not probe further. He flew into a cave and flew straight into it.<br/><br/>The cave was extremely deep and he could not sense the end of it.<br/><br/>Wang Xian had been flying in this cave for more than ten years.<br/><br/>To Wang Xian, this was a little terrifying.<br/><br/>Furthermore, Wang Xian discovered many small caves in the interior of the cave.<br/><br/>These caves seemed to have been dug by other powerhouses or space beasts.<br/><br/>“It is indeed very difficult to find a needle in a haystack if it is hidden in here!”<br/><br/>Wang Xian mumbled as he looked at it.<br/><br/>Fortunately, he was able to lock onto it through the divination lamp.<br/><br/>After entering some small caves, Wang Xian proceeded forward bit by bit.<br/><br/>There were more than a hundred such caves.<br/><br/>“It’s in front. It’s really well hidden. However, all of you will still die!”<br/><br/>Wang Xian mumbled as a smile appeared on his face!\t\t\t\t\t\t</div>", "images": {}, "success": true}