{"id": 1349, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075122.html", "title": "Chapter 4352 - Chapter 4352: 4351 Swords And The Disaster Of The Magic Universe", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4352 - Chapter 4352: 4351 Swords And The Disaster Of The Magic Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4352: 4351 swords and the disaster of the magic universe<br/><br/>Translator: 549690339<br/><br/>“Let’s go, we’re still in the north!”<br/><br/>Liu Lan and hopeless sky listened to the faint roars, their faces trembling.<br/><br/>They had already teleported for a long distance, but they had not yet met the existence that was roaring.<br/><br/>Where was he?<br/><br/>How terrifying was he? He was able to emit such a terrifying roar from so far away!<br/><br/>They continued to enter the teleportation array and headed towards the north.<br/><br/>They had teleported five times and had already arrived at the periphery of the continent.<br/><br/>Only then did they see that huge figure.<br/><br/>“What kind of existence is this?”<br/><br/>When they arrived above a city and looked at the location in front of them, a deep expression of shock appeared on their faces.<br/><br/>What kind of existence was this?<br/><br/>Its body was like a terrifying crocodile, but unlike the crocodile, its body and mouth were too huge!<br/><br/>Those terrifying teeth were densely packed, covered with some flesh and blood and all sorts of residue.<br/><br/>Every tooth was the size of a city in their sword and magic universe.<br/><br/>This huge creature’s body was comparable to dozens of huge cities.<br/><br/>The cities were extremely small in front of him.<br/><br/>This was the capital of a magic country in the 9-origin universe, surrounded by many guarding cities.<br/><br/>But now, those guarding cities were swallowed by that terrifying beast!<br/><br/>Yes, the beast was swallowing a city.<br/><br/>In that city, Liu Lan and the hopeless sky could see the terrified and desperate people!<br/><br/>Countless powerful disciples were frantically fleeing into the distance.<br/><br/>There were also a large number of powerful experts who were fleeing towards the teleportation array!<br/><br/>“Roar Roar Roar!”<br/><br/>The Space Beast Roared. There was an incomparably huge wound on its body, making it look incomparably miserable!<br/><br/>However, its terrifying might and violent aura still caused Liu Lan and hopeless sky to tremble!<br/><br/>“What kind of monster is this? How can it be so terrifying? How did it suddenly enter our sword and Magic Universe?”<br/><br/>Hopeless Sky stared at the monster, his body trembling as he growled in a low voice!<br/><br/>The might of the monster in front of him made him feel powerless.<br/><br/>They were definitely no match for it!<br/><br/>“Save the creatures here first!”<br/><br/>Liu Lan widened his eyes and roared loudly. With a wave of his arm, he sucked the creatures into his space!<br/><br/>“Sirs of Heavenly Yuan creation, save us!”<br/><br/>“Save Us, save us!”<br/><br/>Some disciples sensed Liu Lan and Wangtian and quickly cried out for help!<br/><br/>Liu Lan’s Wangtian’s expression was extremely unsightly as he immediately took action to collect all the living beings!<br/><br/>“Not good, this gigantic Beast’s devouring speed is too fast. It’s coming towards us!”<br/><br/>At this moment, when Hopeless Sky saw the giant beast moving towards them, his expression changed drastically.<br/><br/>The giant beast was too huge.<br/><br/>It was so huge that it was comparable to a magical kingdom!<br/><br/>Just by moving a little, it was already a very long distance!<br/><br/>He devoured all the energy, his gaze sweeping towards Liu Lan and hopeless sky, his eyes revealing his desire for food!<br/><br/>“He has his eyes on us. Run!”<br/><br/>The moment they were targeted by this giant beast, Liu Lan and Wang Wangtian felt a terrifying threat.<br/><br/>Their hair stood on end as they shouted in horror.<br/><br/>Without any hesitation, they flew into the distance.<br/><br/>“Boom! Boom! Boom! Boom!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>However, the next moment, what frightened them was that the terrifying giant beast had locked onto them.<br/><br/>The Beast rushed toward them. The ground collapsed, and the buildings were flattened under his feet like an ant nest!<br/><br/>“Use Your Treasures!”<br/><br/>Liu Lan and Hopeless Heaven felt the power of the Space Beast and roared loudly!<br/><br/>Use your treasures to escape.<br/><br/>The space beast behind them was too fast!<br/><br/>It was so fast that they couldn’t use the teleportation array to escape!<br/><br/>“Roar!”<br/><br/>“Roar!”<br/><br/>However, when they were about to take out their escape true treasures and run away, they heard a terrifying roar from behind them.<br/><br/>Then, they felt the world go dark, and an extremely terrifying sky-swallowing mouth covered them.<br/><br/>“No, this is impossible!”<br/><br/>“What kind of existence is this? How can it be so terrifying?”<br/><br/>Flowing blue and hopeless heaven were in despair and terror!<br/><br/>They were already very far away from this giant beast, but the speed of the other party’s pursuit made it impossible for them to escape.<br/><br/>Now, they were prepared to use their treasures, but in the end, the world-engulfing mouth directly enveloped them.<br/><br/>They were Heavenly Yuan blessed realm existences!<br/><br/>But now, they couldn’t even escape!<br/><br/>“Roar!”<br/><br/>They heard a slightly excited voice, and then, their life force disappeared!<br/><br/>Instant Kill!<br/><br/>“Hu hu!”<br/><br/>“Hu hu!”<br/><br/>In the next instant, at the center of the Sword and Magic Universe.<br/><br/>In a pool, Liu Lan sat up straight, breathing heavily, her face full of fear!<br/><br/>They were killed instantly!<br/><br/>This was an instant kill!<br/><br/>“What kind of monster has come to our sword and Magic Universe!”<br/><br/>Liu Lan said with a trembling voice.<br/><br/>“Weng Weng!”<br/><br/>At this moment, a message from hopeless sky was sent.<br/><br/>He had been killed too!<br/><br/>He had just been resurrected!<br/><br/>When Liu Lan saw the message, he did not hesitate and flew to the sky.<br/><br/>“Wu Wu Wu!”<br/><br/>“Wu Wu Wu!”<br/><br/>Following that, the entire center of the sword and magic universe was filled with an urgent sound.<br/><br/>The sound was ear-piercing and urgent. After hearing it, it would make people extremely nervous!<br/><br/>Alert State!<br/><br/>Highest Alert State!<br/><br/>At the center of the Sword and Magic Universe, when all the powerful disciples heard this sound, their faces were filled with shock.<br/><br/>“What happened?”<br/><br/>“The highest alert state, this is the highest alert state. Only when the enemy invades the center of our universe will there be such vigilance. What exactly happened? Is there an enemy invasion?”<br/><br/>“An enemy invasion? Are We entering the period of war? is the calamity really coming?”<br/><br/>At the center, all the powerful disciples were discussing in shock.<br/><br/>They all widened their eyes.<br/><br/>It was too sudden.<br/><br/>All of this was too sudden!<br/><br/>They were not prepared!<br/><br/>“All disciples, regardless of whether they are in closed door cultivation or not, all of them are floating in the air. All of them are floating in the air!”<br/><br/>At this moment, the voice of hopeless rang in the ears of all the disciples.<br/><br/>Upon hearing this voice, the expressions of all the strong disciples changed again.<br/><br/>The situation was probably even more critical than they had imagined!<br/><br/>The strong disciples did not dare to have any objections. They directly floated in the air and quietly waited for the orders of the two Heavenly Fate Lords!<br/><br/>“That giant beast is too strong. We don’t even have the right to resist. If he continues to wreak havoc in our universe, our sword and Magic Universe will be finished. Liu Lan, immediately contact the Dragon King and see if the Dragon King can come and help!”<br/><br/>“Otherwise, we can only escape.”<br/><br/>Hopeless Sky flew to Liu Lan’s side and said with cold sweat on his forehead.\t\t\t\t\t\t</div>", "images": {}, "success": true}