{"id": 1346, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075110.html", "title": "Chapter 4349 - Chapter 4349: 4348 For Training", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4349 - Chapter 4349: 4348 For Training</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4349: 4348 for training<br/><br/>Translator: 549690339<br/><br/>“With the departure of a control-level space beast, we can train our troops. Furthermore, Xiao Bai can already achieve a breakthrough. The only thing that is missing is a spot!”<br/><br/>Wang Xian revealed a smile when he received this information.<br/><br/>Currently, the disciples of the Dragon Palace who had just achieved a breakthrough in the Heaven’s origin blessed realm had very little actual combat experience. They needed some training.<br/><br/>“An lie, bring me to Mo Sha before returning to the Dragon Palace!”<br/><br/>Wang Xian instructed an lie.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded and brought Wang Xian to Mo Sha.<br/><br/>“Mo Sha, you have a spy here, right? I’ll bring you to the real battle first.”<br/><br/>Wang Xian immediately spoke when he came to Mo Sha’s side!<br/><br/>“HMM? Dragon King? To a real battle? Where?”<br/><br/>Mo Sha was slightly taken aback. His eyes shone brightly as he asked.<br/><br/>“In the starry universe, a control-level starry behemoth might take a few years. Make the arrangements here!”<br/><br/>Wang Xian said to him.<br/><br/>“Hehe, no problem, Dragon King. There are disciples of the poisonous horned dragon species here. The two treasured lands in the core of the Nantian universe have a cultivation speed that is not slower than the Great Dao of heaven. They will report to me if there is any news here.”<br/><br/>Mo sha nodded his head excitedly.<br/><br/>Wang Xian nodded his head and they returned to the Dragon Palace.<br/><br/>“Bei Shuang, Lin Niu, leader of water, leader of fire, leader of Thunder, all of you, come over!”<br/><br/>Wang Xian immediately transmitted his voice after returning to the Dragon Palace!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>In the next instant, bei Shuang and the rest flew over.<br/><br/>“Master!”<br/><br/>“Greetings, Dragon King!”<br/><br/>Bei Shuang and the rest shouted immediately!<br/><br/>“Okay, I’ll bring you guys to a real battle this time so that you can train yourselves.”<br/><br/>Wang Xian glanced at them and said with a smile!<br/><br/>“Dragon King, which universe are we going to attack?”<br/><br/>The fire leader’s eyes lit up as he asked.<br/><br/>“No, we’re going to hunt a space beast at the control level. The life force and special abilities of the space beast are very strong. It can improve your combat experience and let you guys experience the terror of other heaven origin powerhouses.”<br/><br/>Wang Xian said to them!<br/><br/>“Space Beast? Master, when do we set off?”<br/><br/>Bei Shuang also asked with great interest.<br/><br/>“Now.”<br/><br/>Wang Xian said.<br/><br/>They nodded.<br/><br/>Wang Xian gestured to an lie. With a move, they appeared in the starry universe!<br/><br/>“Greetings, Dragon King!”<br/><br/>“Greetings, Dragon King!”<br/><br/>In the starry universe, Hun Dun and Xiao Lan sensed his presence and immediately greeted him respectfully!<br/><br/>“Hehe, good. Hun Dun, where is that Space Beast Now?”<br/><br/>Wang Xian nodded at them and asked.<br/><br/>“Dragon King, that Space Beast should be able to leave the area of the starry universe in a few months’time. We call him the multi-jointed bird emperor. He is very powerful and is stronger than an ordinary control-level space beast!”<br/><br/>Hun Dun immediately replied!<br/><br/>“Multi-jointed bird emperor?”<br/><br/>Wang Xian nodded. “How many space behemoths are still in the space behemoth?”<br/><br/>“Dragon King, there are only four of them. However, two of them are at the Great Dao level.”<br/><br/>Hun Dun spoke!<br/><br/>Wang Xian nodded. It was still very difficult for him to clear the space behemoths in the starry universe.<br/><br/>Although the space beasts did not have intelligence, if there were external heavenly yuan creator powerhouses in the starry universe who massacred the space beasts in the starry universe, they would be hunted down by the powerful space beasts.<br/><br/>With the current strength of the Dragon Palace, they were not afraid of two space beasts of the Great Dao level.<br/><br/>However, it was impossible to hunt them down.<br/><br/>Space Beasts were too difficult to kill.<br/><br/>Take Chaos as an example. To kill them, one would need at least five experts of the same level as bei Shuang.<br/><br/>Only with five of them working together would they be able to kill them.<br/><br/>On the other hand, an ordinary heaven origin creator would only need three of them to kill them.<br/><br/>Even if Wang Xian’s strength had reached the chaos level, he would not be able to kill two of the two space beasts of the Great Dao level in the universe.<br/><br/>However, if there was only one Great Dao level space beast in the starry universe, Wang Xian could consider bringing the experts from the Dragon Palace to hunt it down.<br/><br/>“Let’s head over first and kill that multi-jointed winged bird emperor.”<br/><br/>Wang Xian nodded, his gaze swept across them. “This time, you guys take action. I’ll watch from the side and try my best to kill it. Also, the control level space beasts are very terrifying. Their innate skills are also very strong. Be careful. If you’re not careful, you might suffer a heavy blow.”<br/><br/>“It’s the Dragon King!”<br/><br/>Bei Shuang and the rest had solemn expressions on their faces.<br/><br/>“Dragon King, are these all the experts from Your Dragon Palace?”<br/><br/>Hun Dun’s gaze swept across bei Shuang and the rest. There was a hint of shock in his eyes as he asked.<br/><br/>“Yes.”<br/><br/>Wang Xian nodded, he looked at them and continued, “Mo Sha, your strength is comparable to the strength of two control-level experts. Bei Shuang and Lin Niu, in addition to leader fire and the rest of you, you are also comparable to two control-level experts. Leader Lei and Xiao Lan, you are comparable to one. With Hun Dun, your strength can be suppressed by ordinary Great Dao experts.”<br/><br/>“Of course, this requires all of you to cooperate perfectly. If you don’t, you will be killed by the ultimate counter-attack. All of you need to be careful!”<br/><br/>Bei Shuang and the rest nodded solemnly.<br/><br/>Naturally, they knew a lot about the space beasts in the starry universe.<br/><br/>They were also very clear about the strength of the space beasts.<br/><br/>Their strength and vitality were both terrifying!<br/><br/>“Let’s Go!”<br/><br/>Wang Xian instructed them.<br/><br/>Everyone nodded.<br/><br/>Currently, in the Starry Universe, chaos had made some arrangements and there were many teleportation formations.<br/><br/>Through the teleportation formations, they were quickly teleported to the location closest to the multi-jointed bird emperor.<br/><br/>After flying for ten days, Wang Xian sensed the aura of the multi-jointed bird emperor ahead.<br/><br/>“Follow behind.”<br/><br/>Wang Xian instructed them.<br/><br/>Demon Beisheng and the rest nodded their heads and followed behind Wang Xian.<br/><br/>Hun Dun was among them. When he swept his gaze across demon and the rest, he was amazed!<br/><br/>The current Dragon Palace was too strong!<br/><br/>Moreover, after killing this Space Beast, the Dragon Palace would be able to add another heaven origin creator.<br/><br/>That was because Xiao Bai could make a breakthrough now. The only thing that was missing was a spot!<br/><br/>Wang Xian and the rest followed behind the multi-jointed bird emperor and flew out of the starry universe.<br/><br/>Three months later, they flew out of the starry universe.<br/><br/>Wang Xian did not order them to make a move immediately. Instead, he continued to follow behind the multi-jointed bird emperor.<br/><br/>After flying for another month, Wang Xian looked at Mo Sha and the rest.<br/><br/>“Get ready to make your move. For this battle, apart from preventing him from escaping, the rest will be up to you guys. This multi-jointed bird emperor’s strength is equivalent to one control level and two beginner levels. You guys are more than enough to kill it.”<br/><br/>Wang Xian said to them.<br/><br/>The reason why it was said that only five heaven origin powerhouses could kill a space beast was because this space beast could use its innate skill to escape.<br/><br/>Now, Wang Xian would leave it behind when he escaped.<br/><br/>Therefore, with their strength, they could kill it.<br/><br/>Of course, they had to be careful and cooperate with each other!<br/><br/>Otherwise, something would happen again!\t\t\t\t\t\t</div>", "images": {}, "success": true}