{"id": 1348, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075118.html", "title": "Chapter 4351 - Chapter 4351: 4,350 Heaven’S Origin Creation Experts", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4351 - Chapter 4351: 4,350 Heaven’S Origin Creation Experts</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4351: 4,350 heaven’s origin creation experts<br/><br/>Translator: 549690339<br/><br/>The breakthrough of the small house was very smooth.<br/><br/>This also brought the number of Heaven’s origin creation experts from the Dragon Palace to nine.<br/><br/>“Congratulations to the small house for the breakthrough!”<br/><br/>The experts from the Dragon Palace congratulated the small house.<br/><br/>“Thank you!”<br/><br/>The small house replied with joy in its eyes.<br/><br/>“Congratulations to the small house, Congratulations to the Dragon King!”<br/><br/>Hun Dun made up his mind and congratulated Wang Xian and the rest.<br/><br/>Wang Xian nodded his head and smiled.<br/><br/>“Dragon King, I wonder if I can join the Dragon Palace and become a member of the Dragon Palace?”<br/><br/>Hun Dun looked at Wang Xian and continued to speak!<br/><br/>A hint of anticipation appeared in his eyes.<br/><br/>“Oh? Hun Dun, you wish to join the Dragon Palace? Of course, I would welcome you!”<br/><br/>Wang Xian raised his eyebrows slightly when he heard his words and said immediately.<br/><br/>“I, Hun Dun, was born in the nine-origin universe. Although I am now in the Starry Universe, my former companions have already left. Other than some of my subordinates, I am very bored.”<br/><br/>“Dragon King, you are very strong. The Dragon Palace also has many powerhouses in the Heaven’s origin blessed realm. Joining you will be of great benefit to me!”<br/><br/>Hun Dun told Wang Xian the truth.<br/><br/>“If you want to join us, we will naturally welcome you. With you joining us, the Dragon Palace will be able to improve a little. In addition, the Dragon Palace will gradually take over the entire starry universe. Coincidentally, you, Xiao Lan and the rest will be in the starry universe by then.”<br/><br/>Wang Xian smiled and said to him.<br/><br/>“Then from now on, I, Hun Dun, will treat you as my king. I will listen to your orders and become a part of the Dragon Palace.”<br/><br/>Hun Dun lowered his head slightly and said respectfully!<br/><br/>“Hehe, welcome brother Hun Dun to join our Dragon Palace. With you joining us, the number of Heavenly Yuan blessed realm experts in our Dragon Palace will reach ten!”<br/><br/>Mo Sha laughed and welcomed him.<br/><br/>Bei Shuang and the rest also immediately opened their mouths to welcome him.<br/><br/>Hun Dun was a space beast, and space beasts were extremely powerful.<br/><br/>As a mutated divine dragon, bei Shuang could not gain any benefits from facing Hun Dun.<br/><br/>Even if they met a space-type heaven origin creation realm powerhouse of the same level, they would still be able to escape.<br/><br/>“It’s my honor to have you in the Dragon Palace!”<br/><br/>Wang Xian looked at them and said in satisfaction.<br/><br/>“Without you, Dragon King, we wouldn’t be where we are now.”<br/><br/>Leader water replied with a sigh.<br/><br/>They understood that everything was because of the Dragon King that they were where they were now.<br/><br/>Wang Xian smiled and swept his gaze across them.<br/><br/>The demonic fiend was comparable to two control levels!<br/><br/>Xiao Lan, Hun Dun, Lin Niu, Xiao Zhai, and bei Shuang were all comparable to the two weakest beginner-level heaven origin creation.<br/><br/>The leader of the Water God Dragon, the leader of the Fire God Dragon, and the leader of the Thunder Dragon were among the weakest heaven origin creation levels.<br/><br/>And now, their combined strength was comparable to two great dao level existences.<br/><br/>In addition to that, there was the weakest existence who had just entered the Heaven’s origin creation level.<br/><br/>With the addition of Wang Xian, the strength of the Dragon Palace was comparable to four existences of the Great Dao level and one of the weakest ones.<br/><br/>This strength was already very powerful!<br/><br/>And just when Wang Xian and the rest were in the starry universe.<br/><br/>The sword and the magic universe.<br/><br/>The Sword and Magic Universe did not encounter any danger after the arrival of the apocalypse.<br/><br/>The only crisis was solved by the Dragon King before the Apocalypse even happened!<br/><br/>The Sword and Magic Universe was still thriving.<br/><br/>However, although the sword and Magic Universe was safe and sound, Liu Lan and Wang Wangtian were constantly on guard outside.<br/><br/>The Sword and magic universe was too weak.<br/><br/>Their strength was only in the initial stage of the Heavenly Yuan blessed realm.<br/><br/>Any control-level existence would be able to attack their universe.<br/><br/>The only good thing was that the Dragon King of the nine-origin universe was very powerful. If they were in danger, they could ask for help.<br/><br/>However, they also knew that if they asked the Dragon King to help them many times, they would have to pay a price.<br/><br/>It was either the price of resources or the price of the quota for the Heavenly Yuan creation in the sword and Magic Universe.<br/><br/>The quota for the Heaven’s origin creation was the foundation of their universe.<br/><br/>When all the quotas were occupied, their sword and magic universe would never be able to turn the tables.<br/><br/>They would always be in a weak state.<br/><br/>“I hope that this calamity can pass as soon as possible. This way, we can nurture the Heaven’s origin creation realm experts during this period. Only when there are more heaven’s origin creation realm experts in our universe will we be able to truly become stronger.”<br/><br/>At the center of the Sword and Magic Universe, Wangtian sighed at Liu Lan.<br/><br/>“Yes, we are still too weak.”<br/><br/>Liu Lan nodded.<br/><br/>If they fell behind, they would be beaten up!<br/><br/>Last time, if it wasn’t for Wang Xian’s intervention, their sword and magic universe would have been conquered by now.<br/><br/>It had already been occupied by other powerhouses.<br/><br/>However, although their relationship with the Dragon King was good, after all, the Dragon King couldn’t help them every time.<br/><br/>Unless they could pay the price.<br/><br/>Besides, the Dragon King had his own forces. What could they do if the Dragon King wanted a spot in the Heaven’s origin creation realm?<br/><br/>There was nothing they could do.<br/><br/>Moreover, if they were close to the two of them, the sword and magic universe might be occupied now, and there might not be any spots left.<br/><br/>They could not refuse the Dragon King’s request for a spot.<br/><br/>“Long Yinyin and long Yinhao’s strength has improved very quickly. They are almost at the peak of the ruler realm. Their talent is very high and they have a chance to reach the Tianyuan blessed realm. However, there are no spots for the water element in our universe anymore.”<br/><br/>Liu Lan said thoughtfully.<br/><br/>She was looking for disciples who had a chance to reach the Tianyuan blessed realm.<br/><br/>Long yinyin and long Yinhao were too young.<br/><br/>However, with the resources given by the Dragon King, their strength was almost at the peak of the ruler realm.<br/><br/>With their age, they had a great chance of making a breakthrough.<br/><br/>However, the quota was a problem!<br/><br/>“There are not many slots for the Heavenly Yuan blessed realm in our universe now. We need to use those few slots to train disciples.”<br/><br/>Hopeless Sky also mused.<br/><br/>“Roar Roar!”<br/><br/>“Roar Roar!”<br/><br/>Just as the two of them were discussing, a roar suddenly sounded in their ears.<br/><br/>The roar was very weak, as though it came from an extremely distant domain.<br/><br/>However, when Liu Lan and hopeless sky heard these two roars, their expressions changed drastically and they immediately stood up.<br/><br/>“What is that sound?”<br/><br/>Liu Lan’s expression turned pale and he could not help but Roar in a low voice!<br/><br/>Wang Wangtian also revealed a grave expression as he looked in a certain direction. “In that direction, this roar actually caused me to feel a deep palpitation and fear. What is this?”<br/><br/>“Let’s go, Let’s Go!”<br/><br/>Liu Lan’s expression changed drastically as they quickly flew in a certain direction.<br/><br/>When they arrived in front of a teleportation array, they immediately teleported!<br/><br/>When they teleported to a city, all the powerful disciples in the city all looked in one direction.<br/><br/>They also heard that terrifying roar!<br/><br/>However, they didn’t see the existence that was roaring.\t\t\t\t\t\t</div>", "images": {}, "success": true}