{"id": 1343, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075098.html", "title": "Chapter 4346 - Chapter 4346: 4345 Double Breakthroughs", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4346 - Chapter 4346: 4345 Double Breakthroughs</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4346: 4345 double breakthroughs<br/><br/>Translator: 549690339<br/><br/>The evil-aligned universes were much more powerful than the Righteous Alliance’s universes.<br/><br/>This was because of their cultivation methods.<br/><br/>In order to increase their strength, they would take the flesh and blood of other creatures.<br/><br/>This was like taking a shortcut, taking the good fortune of other creatures to increase their strength.<br/><br/>The voodoo universe was biased toward the wizard lineage of the nine-origin universe.<br/><br/>However, it was very different from the wizard lineage.<br/><br/>“We’re almost there. It’s just ahead. We need to investigate some information about this voodoo universe.”<br/><br/>Wang Xian looked at the universe ahead and said to spirit red bone and the rest, “I’ll put you guys into the space first.”<br/><br/>“It’s the Dragon King!”<br/><br/>The elder from the skeleton clan was called the dark night withered king. He immediately responded respectfully.<br/><br/>The leader of the water god Dragon Clan also responded.<br/><br/>“Mosha, you should also hide first!”<br/><br/>Wang Xian put mosha into his mother nest as well. His body moved and he flew towards the sorcerer Spirit Universe.<br/><br/>In order to be safe, Wang Xian had to be fully prepared.<br/><br/>There were three control-level powerhouses in the sorcerer Spirit Universe. Their strength was not weak at all!<br/><br/>There was another point. After all, they were the universe of the evil sequence alignment camp.<br/><br/>Wang Xian had to prevent them from sending reinforcements.<br/><br/>If they were to ask for help from the other powerhouses of the evil sequence alignment camp, the other universes…<br/><br/>After they rushed over immediately, it would be a huge problem for Wang Xian and the rest.<br/><br/>Therefore, he had to investigate thoroughly.<br/><br/>He wanted to investigate this universe and see if there were any teleportation arrays that were connected to the other evil sequence alignment camps.<br/><br/>While he was deep in thought, Wang Xian had already entered the sorcerer Spirit Universe.<br/><br/>His gaze swept across the universe and he flew forward quickly.<br/><br/>Hiding his aura, Wang Xian flew towards the center of the universe.<br/><br/>After flying for a few hundred years, Wang Xian discovered a problem.<br/><br/>The number of life planets in the sorcerer Spirit universe was much, much less than the nine-origin universe.<br/><br/>Even after flying for such a long time, he did not encounter many living beings.<br/><br/>However, the living beings he encountered were not weak.<br/><br/>The weakest one had the strength of a venerable.<br/><br/>“Soul Catcher!”<br/><br/>When Wang Xian encountered more than a dozen experts again, he silently performed the soul catcher technique.<br/><br/>Following that, information was transmitted into his mind one by one.<br/><br/>“Witch Spirit Palace!”<br/><br/>Very soon, Wang Xian obtained some information and gained a detailed understanding of this universe.<br/><br/>There were not many living beings in the witch spirit universe.<br/><br/>Most of the strong disciples were gathered at the center of the Witch Spirit Universe.<br/><br/>There were many life planets in the witch spirit universe, but these life planets were all modified by the Witch Spirit Palace.<br/><br/>The Voodoo Shrine was the largest force in the voodoo universe.<br/><br/>They nurtured the lives that were originally born on the life planets. After that, they extracted their bloodlines and carried out experiments.<br/><br/>From there, they nurtured even more powerful lives.<br/><br/>They raised these lives either as their subordinates or to a certain extent, they would slaughter them.<br/><br/>In other words, they played with the lives as livestock!<br/><br/>Everything was done in order to improve their own strength.<br/><br/>Wang Xian looked at the information and was slightly amazed.<br/><br/>He had seen some of the madness of the evil sequence faction universe.<br/><br/>They were like scientists, the living beings on a life planet were just white mice.<br/><br/>They slaughtered white mice and nurtured stronger white mice.<br/><br/>Wang Xian found this concept hard to accept.<br/><br/>Creatures without intelligence could be called animals.<br/><br/>For survival and food, they could be slaughtered<br/><br/>However, it was a little bloody and cruel to treat intelligent creatures like this!<br/><br/>It was an act of cannibalism.<br/><br/>“Let’s go to the center of the Witch Spirit Universe.”<br/><br/>Wang Xian moved his body and quickly looked toward the center.<br/><br/>A few decades later, Wang Xian arrived at the center of the Witch Spirit Universe.<br/><br/>This was the territory of the Witch Spirit Palace.<br/><br/>In the Witch Spirit Universe, three control-level powerhouses had established three witch spirit palaces.<br/><br/>The three witch spirit palaces controlled the entire universe.<br/><br/>In the center of the universe, there were more and more powerful disciples in the Witch Spirit Universe.<br/><br/>Each and every one of them looked a little strange. Their bodies were covered with all kinds of tattoos.<br/><br/>It was as if there were tattoos all over a person’s body.<br/><br/>These weren’t ordinary tattoos. Instead, they were formations carved on their bodies in a special way, allowing them to possess powerful energy.<br/><br/>They used their own bodies to communicate with the heavens and earth and mobilize the power of their attributes!<br/><br/>Their weapons were also formation compasses made from flesh and blood.<br/><br/>Once they were used, they would erupt with powerful strength.<br/><br/>At the center of the Voodoo Universe, a large number of life planets were gathered.<br/><br/>It was extremely prosperous!<br/><br/>Wang Xian concealed his aura so that he could only display his strength at the peak of the ruler realm.<br/><br/>His entire body was wrapped in a black robe.<br/><br/>He could sense that there were many surveillance formations in the central area.<br/><br/>The surveillance powers of these formations were extremely terrifying!<br/><br/>Wang Xian flew and arrived at the base camp of the three voodoo temples through the teleportation formation.<br/><br/>There were three huge palaces suspended in the void.<br/><br/>The three palaces stood in a triangle in the void.<br/><br/>There were all kinds of terrifying formations in the surrounding area.<br/><br/>Wang Xian entered the space easily and used his soul-absorbing power to search through them one by one.<br/><br/>He strolled through the three witch spirits’palaces easily.<br/><br/>In the Witch Spirits’universe, there were only three control-level powerhouses.<br/><br/>According to the information he obtained, there seemed to be only one control-level powerhouse in the Witch Spirits’universe at the moment.<br/><br/>The other two weren’t in the universe.<br/><br/>Of course, this wasn’t certain.<br/><br/>Because the information he obtained from the Disciples’memories wasn’t prepared.<br/><br/>How could the disciples know the specific location of a control-level powerhouse?<br/><br/>But one thing was certain, there was indeed a control-level powerhouse in the Magus universe.<br/><br/>“According to the information obtained, the Magus universe doesn’t have a teleportation array leading to other universes. Of course, there might be one, but only three control-level powerhouses know.”<br/><br/>“Therefore, there is no other way. I can only break through directly and adapt to the changing situation!”<br/><br/>Wang Xian checked around and made a decision in his heart.<br/><br/>The strength of their side was strong enough, so they could fight directly!<br/><br/>Wang Xian moved his body and flew towards the location outside.<br/><br/>After flying for a year, he checked his surroundings.<br/><br/>There was no teleportation formation and no life planet.<br/><br/>If the experts from the Wizard Spirit Universe were unable to arrive here in an instant, the King of darkness and the leader of the water god Dragon could break through and leave quickly.<br/><br/>Buzz<br/><br/>Wang Xian waved his arm and summoned the King of Darkness, the leader of the Water God Dragon, the demon spirit red bone, and the rest.<br/><br/>“There’s not much information. Let’s break through directly.”<br/><br/>Wang Xian spoke to them and then looked at the demon spirit. “Let’s guard this place and listen to my orders!”<br/><br/>“It’s the Dragon King!”<br/><br/>“It’s the Dragon King!”<br/><br/>The leader of the Dark Night King, the water god Dragon, and the rest replied excitedly.<br/><br/>They looked at each other and flew into the air to begin their breakthrough!\t\t\t\t\t\t</div>", "images": {}, "success": true}