{"id": 1347, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075114.html", "title": "Chapter 4350 - Chapter 4350: Under 4349’S Training", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4350 - Chapter 4350: Under 4349’S Training</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4350: Under 4349’s training<br/><br/>Translator: 549690339<br/><br/>“Surround and Attack!”<br/><br/>“Hunt and kill!”<br/><br/>Mosha Northern Frost and the rest looked at each other, then their bodies moved, directly attacking the multi-segmented bird emperor in front of them.<br/><br/>The multi-segmented Bird Emperor was a bird-type astral beast.<br/><br/>It had enormous wings, which spread out and blotted out the sky.<br/><br/>The most terrifying thing was that it had a tail, which was segment by segment, like an incomparably sharp steel whip.<br/><br/>It could tear everything apart!<br/><br/>Mosha, Northern Frost, and the others surrounded him.<br/><br/>Mosha was the strongest and directly attacked.<br/><br/>On the left and right, northern frost, Lin Niu, Xiao Lan, and the others attacked at the same time!<br/><br/>An extremely terrifying energy attacked the multi-jointed bird emperor.<br/><br/>“CHIRP CHIRP CHIRP!”<br/><br/>Facing Mosha and the others’attack, the multi-jointed bird emperor’s eyes emitted a fierce light.<br/><br/>However, faced with the terrifying attacks, the multi-jointed bird emperor flapped his huge wings, wanting to break through!<br/><br/>He chose the position on the right.<br/><br/>On the right were bei Shuang, the water god Dragon, and the others. In the eyes of the multi-jointed bird emperor, this was the easiest position to break through.<br/><br/>However, although this was bei Shuang and the others’first battle to break through to the Heavenly Yuan blessed realm, they had also sparred before.<br/><br/>Frost, fire dragons, water chains, and other powerful attacks charged towards the multi-jointed bird emperor.<br/><br/>“Degree strangulation!”<br/><br/>Mo Sha had inherited everything from the demons. Naturally, he had inherited all of his attacking methods.<br/><br/>A terrifying giant hand charged towards the multi-jointed bird emperor!<br/><br/>The battle instantly became intense.<br/><br/>Wang Xian watched quietly from the side and did not intervene.<br/><br/>This was an unequal battle. Even though the life force of the space behemoth was stronger and its innate ability was stronger, the combined strength of Mo Sha and the rest was too strong. They could completely suppress it.<br/><br/>Time passed little by little.<br/><br/>After enduring for dozens of minutes, injuries began to appear on the body of the multi-jointed bird emperor.<br/><br/>Following that, the injuries became more and more serious.<br/><br/>The multi-jointed bird emperor used his innate ability in an attempt to escape.<br/><br/>As a bird-type space beast, his means of escape were extremely powerful.<br/><br/>However, before Wang Xian could make a move, Mo Sha had already intercepted his means of escape.<br/><br/>Mo Sha had inherited everything from the demons, and his battle experience was also in his mind.<br/><br/>This also made him, although he had yet to reach the peak of the demons, his various means and timing were extremely terrifying!<br/><br/>“Mo Sha, restrain some of your energy and train bei Shuang and the rest!”<br/><br/>Wang Xian smiled when he saw how Brave Mo Sha was!<br/><br/>“It’s the Dragon King!”<br/><br/>Mo Sha smiled and nodded.<br/><br/>This time, it was mainly to train the powerhouses of the Dragon Palace. He couldn’t suppress the multi-jointed bird emperor alone!<br/><br/>As Mo Sha’s attack power decreased, the pressure on bei Shuang and the rest increased.<br/><br/>In fact, the fire chief was injured by the multi-jointed bird emperor’s innate skill!<br/><br/>The battle lasted for a total of five years.<br/><br/>The multi-jointed bird emperor tried to escape many times but was stopped by the demonic fiend.<br/><br/>After five years of battle, the multi-jointed bird emperor’s body was riddled with injuries. Its vitality was extremely weak!<br/><br/>In the end, it was killed by their last round of attacks!<br/><br/>Wang Xian kept the last drop of blood that was still alive.<br/><br/>“Phew, this is really hard to kill. We are much stronger than it. It took us five years to completely destroy it!”<br/><br/>After the battle, leader Shui took a deep breath and spoke!<br/><br/>This battle was a little difficult for them.<br/><br/>It was the longest battle.<br/><br/>However, their battle experience had improved a lot during this battle.<br/><br/>“Hehe, not bad. Your combat experience needs to be improved through continuous battles. You guys have done well this time. Let’s go back first. Now that there’s an extra spot for the Space Beast in the universe, we can start our breakthrough!”<br/><br/>Wang Xian flew over with a smile. He kept the corpse and said to them!<br/><br/>“It’s the Dragon King!”<br/><br/>“It’s Master!”<br/><br/>Bei Shuang and the rest replied with smiles on their faces.<br/><br/>“Let’s go.”<br/><br/>The dark and intense energy enveloped them. Wang Xian and the rest returned to the starry universe!<br/><br/>“Little House!”<br/><br/>After coming to the territory of Hun Dun and the rest, Wang Xian looked at the two huge figures in the distance and shouted at the little house.<br/><br/>Now, both the little house and Xiao Bai could make a breakthrough!<br/><br/>However, the small house was born earlier and belonged to his elder brother. Naturally, he would let the small house make a breakthrough first!<br/><br/>“Dragon King!”<br/><br/>The small house swayed its huge body as it flew over and shouted respectfully at Wang Xian.<br/><br/>“Get Ready, make a breakthrough!”<br/><br/>Wang Xian touched the small house’s body and said to him with a smile!<br/><br/>“A breakthrough? Thank you, Dragon King, thank you!”<br/><br/>Xiao Zhai shouted happily!<br/><br/>“Yes, you can make a breakthrough first. In the future, Xiao Bai will be able to make a breakthrough as well.”<br/><br/>Wang Xian looked at Xiao Bai who was flying over and said with a smile!<br/><br/>“Woo Woo!”<br/><br/>Xiao Bai cried out and flew over to rub Wang Xian’s arm!<br/><br/>Xiao Lan and Xiao Bai from Xiao Zhai could be said to be Lan Qingyue’s children.<br/><br/>Wang Xian was naturally very friendly to them!<br/><br/>Buzz<br/><br/>“Breakthrough!”<br/><br/>Wang Xian took out the blood of the multi-jointed bird emperor that was still alive and directly destroyed it. Then, he spoke to Xiao Zhai!<br/><br/>“Woo Woo!”<br/><br/>Xiao Zhai let out an excited roar. He flew to the sky and began to make a breakthrough!<br/><br/>A huge amount of energy began to gather!<br/><br/>“If Xiao Zhai makes another breakthrough, there will be eight powerhouses in the Heaven’s origin realm in our Dragon Palace. Including the Dragon King, there will be nine of them!”<br/><br/>Mo Sha watched the Little House’s breakthrough and spoke with his mouth wide open!<br/><br/>A force with nine heaven origin creation stage powerhouses was extremely terrifying.<br/><br/>Even if it was placed in the Justice Union, it would be a top sect!<br/><br/>“HMM, in the future, our Dragon Palace will produce more heaven origin creation stage powerhouses. They will be even stronger and become an invincible existence.”<br/><br/>Bei Shuang took a glance at the little house and his gaze landed on Wang Xian. His eyes were filled with admiration!<br/><br/>Everything was done by his own master. He had led the Dragon Palace to a terrifying level in a short period of time!<br/><br/>Wang Xian smiled faintly when he heard their words!<br/><br/>Hun Dun who was listening from the side had a contemplative look on his face!<br/><br/>He swept his gaze across the experts around him.<br/><br/>At this moment, he suddenly had an idea.<br/><br/>And this idea was to join the Dragon Palace!<br/><br/>Yes, join the Dragon Palace!<br/><br/>His breakthrough was because of the Dragon King, and during this calamity, he obeyed the Dragon King’s orders!<br/><br/>And now, the terrifying strength of the Dragon Palace, and the powerful strength of the Dragon King.<br/><br/>He felt that joining the Dragon Palace was the best choice.<br/><br/>Little did he know that the Little Blue House and Little White, which he thought were weak in the past, had two breakthroughs now, and their strength was the same as his.<br/><br/>Little White’s breakthrough was only a matter of time!<br/><br/>Only by following such a strong dragon palace and such a strong Dragon King could he become stronger.<br/><br/>He was not a space beast without intelligence in the starry universe.<br/><br/>He knew a lot and also needed friends.<br/><br/>Otherwise, he would be very bored.<br/><br/>Joining the Dragon Palace was the best choice.\t\t\t\t\t\t</div>", "images": {}, "success": true}