{"id": 1344, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075102.html", "title": "Chapter 4347 - Chapter 4347: With 4346 Pairs Of Breakthroughs", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4347 - Chapter 4347: With 4346 Pairs Of Breakthroughs</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4347: With 4346 pairs of breakthroughs<br/><br/>Translator: 549690339<br/><br/>“Boom! Boom!”<br/><br/>“Boom! Boom!”<br/><br/>The King of darkness and the leader of the water god Dragon started to break through.<br/><br/>A violent aura spread out in the surroundings.<br/><br/>The entire starry sky gathered energy.<br/><br/>Wang Xian and the demonic fiend watched quietly.<br/><br/>To prevent any accidents from happening.<br/><br/>“HMM?”<br/><br/>At the same time, at the center of the Wizard Spirit Universe.<br/><br/>At the three wizard Spirit Halls.<br/><br/>At the center of one of the sorcerer spirit halls, there was one with three heads. Each head was bald, and there were dense patterns and words on them.<br/><br/>The three-headed old man sat cross-legged inside and suddenly opened his eyes. His deep gaze was looking in a direction.<br/><br/>“Breakthrough? You’re courting death. There are actually people who dare to make a breakthrough in my sorcerer Spirit Universe, and there are two of them!”<br/><br/>The three-headed old man stood up, his three faces filled with ice-cold expressions.<br/><br/>With a wave of his arm, a map image appeared in front of him.<br/><br/>On the map, there were two dots of light.<br/><br/>The three-headed old man’s expression was dark and cold, and a surge of energy was injected into the map.<br/><br/>Following that, the patterns on his legs spread to his surroundings, as if forming a special altar.<br/><br/>Buzz<br/><br/>This was not an altar, but a teleportation formation.<br/><br/>The teleportation formation slowly emitted a glow, and the figure of the three-headed old man quickly disappeared.<br/><br/>In an instant, his figure appeared in an area not far away from Wang Xian and the rest.<br/><br/>The three-headed old man raised his head and looked at the two places where he had made his breakthrough. A murderous intent appeared in his eyes!<br/><br/>Boom<br/><br/>His body moved and he flew straight over!<br/><br/>“Huh?”<br/><br/>At this moment, Wang Xian was quietly watching the breakthrough of the Dark Night King and the leader of the Water God Dragon.<br/><br/>At this moment, he raised his eyebrows. His face was filled with astonishment.<br/><br/>“He came here so quickly? There isn’t any teleportation formation in the surroundings, yet he managed to come here so quickly. Is this a special teleportation?”<br/><br/>Wang Xian looked in a direction with a puzzled expression.<br/><br/>Soon, a figure with three heads appeared in his line of sight!<br/><br/>The figure with three heads didn’t hesitate at all when he arrived.<br/><br/>He waved his arm and a surge of energy attacked the King of darkness and the leader of the Water God Dragon.<br/><br/>This surge of energy was formed by countless runes. It looked like a long snake and was extremely terrifying!<br/><br/>Mo Sha saw his attack and a cold look appeared in his eyes.<br/><br/>He waved his arm that was eager to give it a try. A huge phantom of a devil head headed towards the attack of the three-headed old man.<br/><br/>“Roar Roar!”<br/><br/>The Phantom of the Devil Head let out a low roar and easily swallowed the attack of the three-headed old man.<br/><br/>“Who are you people? You actually dared to make a breakthrough in our voodoo universe and want to occupy the spot of the Heaven origin creation in our universe. Are you trying to start a war with our voodoo universe?”<br/><br/>The three-headed old man saw that his attack was easily blocked. He focused his gaze and looked at Mo Sha and Wang Xian!<br/><br/>“We want the spot of darkness and water element in your voodoo universe!”<br/><br/>Mo Sha stared at him and said with a cold face!<br/><br/>“Are you looking for death? With just you guys? Wishful Thinking!”<br/><br/>The eyes of the three-headed old man were filled with fury. The runes above his head began to rotate.<br/><br/>Around him, one after another, the runes started to cover Wang Xian and the rest.<br/><br/>A large-scale attack formation was quickly formed!<br/><br/>“Kill them directly!”<br/><br/>Wang Xian saw this scene and started to move.<br/><br/>Wang Xian did not have a good impression of the universe of the evil sequence faction and these powerhouses.<br/><br/>He started to move and decided to kill the three-headed old man directly!<br/><br/>Buzz<br/><br/>Wang Xian’s figure flashed and teleported to the side of the three old men!<br/><br/>With a wave of his arm, the Phantom of a divine dragon surrounded the three old men!<br/><br/>The threat of death instantly enveloped him.<br/><br/>“Oh no!”<br/><br/>“Oh no, who are you people? Which Universe are you from? We are the universe of the evil sequence faction. If you kill me, I will ask the experts in the faction to make you pay the price!”<br/><br/>The moment Wang Xian made his move.<br/><br/>The expression of the three-headed old man instantly turned horrified as he roared loudly.<br/><br/>Boom<br/><br/>Wang Xian didn’t say anything to him. The terrifying divine dragon directly coiled around him.<br/><br/>The three-headed old man wanted to escape. However, under the encirclement of the Divine Dragon, all his energy had been controlled.<br/><br/>He couldn’t even escape!<br/><br/>An expert who had just stepped into the control level couldn’t even retaliate against Wang Xian.<br/><br/>Wang Xian could even kill him instantly!<br/><br/>With the divine dragon around him, the three-headed old man wanted to resist.<br/><br/>However, all resistance was futile!<br/><br/>Wang Xian opened his mouth and spat out a terrifying sharp sword.<br/><br/>With a terrifying speed, it pierced through the body of the three-headed old man and completely obliterated him.<br/><br/>Following that, Wang Xian waved his arm and kept the corpse.<br/><br/>There was no change in his expression.<br/><br/>“Get Ready. There might be a big battle coming up!”<br/><br/>Wang Xian reminded Mo Sha.<br/><br/>“It’s the Dragon King. Your strength is so strong!”<br/><br/>Mo Sha looked at Wang Xian with admiration and said!<br/><br/>“Mo Sha, your starting point is very high now. You have a chance to reach my current level!”<br/><br/>Wang Xian smiled and said!<br/><br/>He scanned his surroundings and waited quietly.<br/><br/>He didn’t know how many experts from the witch spirit universe would rush over.<br/><br/>However, everything was out of Wang Xian’s expectations.<br/><br/>Time passed by minute by minute.<br/><br/>The breakthrough of the leader of the water god Dragon and the king of dark night withered gradually came to the final moment!<br/><br/>However, the experts from the sorcerer Spirit universe still did not come over.<br/><br/>This caused Wang Xian to reveal a hint of surprise.<br/><br/>“There are no experts coming over. What’s the situation? Are we too late?”<br/><br/>Wang Xian mumbled to himself. Looking at the two disciples who were about to complete their breakthrough, a smile appeared on his face!<br/><br/>Indeed.<br/><br/>After Wang Xian killed the three-headed old man in an instant and the three-headed old man was resurrected, he immediately informed the other two experts about the situation in the sorcerer Spirit Universe.<br/><br/>However, the other two powerhouses in the witch spirit universe were far away.<br/><br/>They could have used up their treasures to rush over in an instant. However, they did not rush over immediately.<br/><br/>Instead, they sought the support of other powerhouses immediately.<br/><br/>A great dao existence who could kill a control-level powerhouse in an instant was definitely not an ordinary great dao powerhouse.<br/><br/>They needed to find at least four control-level powerhouses or a great dao powerhouse to help them!<br/><br/>However, after they contacted them, even though they finally found four control-level great beings who were willing to help.<br/><br/>However, it would take them a few years to rush to the Witch Spirit Universe.<br/><br/>A few years was already very short.<br/><br/>However, after a few years, everything was too late.<br/><br/>This made the three great beings of the witch spirit universe look a little ugly and angry.<br/><br/>It was too late!<br/><br/>Under such circumstances, they could only watch helplessly as the foreign universe powerhouses occupied two spots in their universe.<br/><br/>There was nothing they could do even if they were unwilling.<br/><br/>This also made Wang Xian’s protection of the path exceptionally smooth.<br/><br/>This was also a huge benefit of being a top-notch powerhouse!\t\t\t\t\t\t</div>", "images": {}, "success": true}