{"id": 1342, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075094.html", "title": "Chapter 4345 - Chapter 4345: Under The Breakthrough Of The 4344 Disciples Of The Dragon Palace", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4345 - Chapter 4345: Under The Breakthrough Of The 4344 Disciples Of The Dragon Palace</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4345: Under the breakthrough of the 4344 disciples of the Dragon Palace<br/><br/>Translator: 549690339<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>The leader of the Fire God Dragon was making a breakthrough.<br/><br/>Because he was in the center of the universe and there was no interference, the speed of the leader of the Fire God Dragon’s breakthrough was very fast.<br/><br/>“Thank you for your nurturing, Dragon King. In the future, I will fight for you and live for You!”<br/><br/>After the leader of the Fire God Dragon made a breakthrough, he immediately knelt respectfully in front of Wang Xian and pledged his loyalty.<br/><br/>“Hehe, get up. Go back to the Dragon Palace and stabilize your strength.”<br/><br/>Wang Xian nodded his head in satisfaction.<br/><br/>Lin Niu, Xiao Lan, bei Shuang, the leader of the Fire Divine Dragon, Mo Sha. The Dragon Palace now had five powerhouses in the Heaven’s origin realm!<br/><br/>Mo Sha was the strongest. As long as he had time and resources, he would be able to reach the level of Great Dao.<br/><br/>“It’s still not enough!”<br/><br/>Wang Xian mumbled.<br/><br/>The current Dragon Palace was at the stage where its strength was about to explode.<br/><br/>After killing Saint Futu and Saint Haoyang, Wang Xian had obtained quite a number of resources.<br/><br/>These resources would allow the disciples of the Dragon Palace to improve greatly.<br/><br/>“In the entire universe, the disciples of the Dragon Palace need to be in charge. If someone were to make a breakthrough here, I would be able to rush over in an instant and expel him.”<br/><br/>Wang Xian pondered.<br/><br/>He was prepared to arrange for the Unicorn Ox to oversee the universe.<br/><br/>Having made up his mind, Wang Xian asked an lie to bring the unicorn ox over.<br/><br/>After that, he went to the Great Dao of Heaven once again. He was prepared to search for a universe with a water attribute quota.<br/><br/>Buzz Buzz<br/><br/>However, when he had just arrived at the Great Dao of Heaven, information was transmitted over one by one.<br/><br/>It was a message from Ling Honggu.<br/><br/>The message was that the skeleton clan’s disciple who was at the peak of the Dominator realm had found a universe that could allow him to break through.<br/><br/>He was looking for his dao protection!<br/><br/>After Wang Xian received this message, he immediately sent a message to Ling Honggu.<br/><br/>“Dragon King!”<br/><br/>Not long after, Ling Honggu and the skeleton clan’s powerhouse flew over.<br/><br/>“Have you found a suitable universe?”<br/><br/>Wang Xian looked at the elder from the skeleton clan and asked with a smile.<br/><br/>“Dragon King, I’ve found it.”<br/><br/>The elder from the skeleton clan nodded his head, a look of anticipation appeared on his face. “Dragon King, there are spots for the breakthrough of the Darkness Attribute in that universe. However, Dragon King, the strength of that universe is not weak. There are three existences at the control level.”<br/><br/>“It’s not a big problem.”<br/><br/>Wang Xian shook his head and asked, “Where is that universe? Is It far away? However, it’s best if it’s not the universe of the Justice Alliance. It will cause a backlash from the Justice Alliance.”<br/><br/>“It’s not the universe of the Justice Alliance. It’s a universe of the evil sequence camp. It’s at the edge of the evil sequence camp. This universe is not weak. However, according to my inquiry, the three powerhouses at the control level in this universe are not at the veteran control level.”<br/><br/>“Are they from the evil sequence faction?”<br/><br/>Wang Xian raised his eyebrows. He didn’t have a good impression of the evil sequence faction.<br/><br/>The cultivation methods of the powerhouses in this faction were abnormally cruel.<br/><br/>“Yes, this universe is called the Voodoo Spirit Universe. The cultivation method is similar to the voodoo race, but it’s much crueler than the voodoo race. They use their flesh, blood, bones, and souls to create a huge array. Their cultivation methods are extremely cruel.”<br/><br/>The elder from the skeleton race replied.<br/><br/>“In that universe, other than the quota for the darkness attribute, are there any other attributes?”<br/><br/>Wang Xian’s eyes flickered slightly as he asked.<br/><br/>“Yes, there are also water, metal, light, and Earth attributes.”<br/><br/>The elder from the skeleton race answered truthfully!<br/><br/>“There are water attributes!”<br/><br/>Wang Xian’s eyes sparkled as he smiled. “It just so happens that my Dragon Palace has a disciple with the water attribute. I was just about to find a place for him!”<br/><br/>“That’s perfect.”<br/><br/>When the elder from the skeleton clan heard that, his eyes lit up as well. He nodded his head.<br/><br/>There was a disciple from the Dragon Palace who was about to make a breakthrough. In his opinion, the Dragon King might be a little more serious!<br/><br/>“How far is it from here?”<br/><br/>Wang Xian looked at him and continued to ask.<br/><br/>“With the help of treasures, I can travel at the speed of a beginner in the Heaven’s origin realm. It will take me a million years. Dragon King, since you are fast, it should only take you a few hundred thousand years.”<br/><br/>The elder from the skeleton clan replied.<br/><br/>“That’s quite far.”<br/><br/>Wang Xian nodded his head and took out a map. “This is a map. The Universe Records of the evil sequence camp are very clear. Is It this voodoo universe?”<br/><br/>On the map that Wang Xian obtained, there was information on all the universes of the evil sequence camp.<br/><br/>He pointed at one of the edges and asked!<br/><br/>“Yes!”<br/><br/>The old man from the skeleton clan nodded and replied.<br/><br/>“It is indeed a little far. Can We Act immediately?”<br/><br/>Wang Xian looked at him and asked.<br/><br/>“I can do it anytime!”<br/><br/>The old man replied immediately!<br/><br/>“Alright!”<br/><br/>Wang Xian nodded.<br/><br/>“I’ll go and take a look too. Is that Alright?”<br/><br/>Ling honggu, who was at the side, asked Wang Xian with a smile.<br/><br/>“Sure.”<br/><br/>Wang Xian nodded with a smile. “How far are you from the Heaven’s origin realm of Destiny?”<br/><br/>“I should be able to break through within a few billion years. Hehe, the seniors in the clan have taken good care of me.”<br/><br/>Ling Honggu smiled.<br/><br/>“Hehe, alright. I’ll find a spot for you to break through then!”<br/><br/>Wang Xian nodded with a smile.<br/><br/>“Demonic Fiend!”<br/><br/>He shouted!<br/><br/>“Dragon King!”<br/><br/>Very soon, Mo Sha flew over and cupped his hands respectfully.<br/><br/>“Follow me to protect my path. I will ask the Fallen Shadow Devil Emperor to take care of the matters here.”<br/><br/>Wang Xian instructed him.<br/><br/>“It’s the Dragon King!”<br/><br/>Mo Sha nodded immediately.<br/><br/>“HMM? When did mo sha break through?”<br/><br/>When Ling Honggu saw Mo Sha and sensed his aura, he was slightly shocked. He couldn’t help but ask.<br/><br/>“Mo Sha’s breakthrough is a special opportunity. He possessed a powerhouse, so he advanced directly!”<br/><br/>Wang Xian replied, “This time, Mo Sha and I will protect the path. There won’t be any problems!”<br/><br/>“Thank you, Dragon King. Thank you, Lord Mo Sha!”<br/><br/>The elder from the skeleton clan felt the might of Mo sha and was slightly shocked.<br/><br/>Mo Sha gave him a very terrifying feeling.<br/><br/>This feeling was much stronger than an ordinary heaven origin creator!<br/><br/>The strength of the Dragon Palace was increasing at a terrifying speed.<br/><br/>He was shocked and thought to himself!<br/><br/>“Let’s Go!”<br/><br/>Wang Xian brought along the leader of the water god Dragon and waved his arm. A wave of energy enveloped them and flew towards the Magus universe!<br/><br/>The Voodoo universe was very far away from here.<br/><br/>It was even further away from the nine-origin universe!<br/><br/>It would take a million years for a powerhouse who had just entered the Heaven’s origin realm to fly there.<br/><br/>One could imagine the distance.<br/><br/>Wang Xian’s speed was very fast. However, he estimated that it would still take about 70,000 to 80,000 years.<br/><br/>However, with the spirit red bone by his side, the two of them chatted from time to time. It was not that boring.<br/><br/>Time passed day by day.<br/><br/>More than 70,000 years passed by quickly.<br/><br/>Wang Xian looked at the map. His eyes were sparkling.<br/><br/>They were almost there!<br/><br/>The sorcerer Spirit Universe, the universe at the edge of the evil sequence camp.<br/><br/>Although it was at the edge, this universe wasn’t weak.<br/><br/>It should be said that the universe of the evil sequence camp wasn’t weak at all!\t\t\t\t\t\t</div>", "images": {}, "success": true}