{"id": 1345, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075106.html", "title": "Chapter 4348 - Chapter 4348: The Situation In The 4347 Galaxy!", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4348 - Chapter 4348: The Situation In The 4347 Galaxy!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4348: The situation in the 4347 galaxy!<br/><br/>Translator: 549690339<br/><br/>“Dragon King, we’ve made a breakthrough!”<br/><br/>In the sorcerer Spirit Universe, the Dark Night King was feeling his own strength. He flew to Wang Xian’s side with an excited expression and said!<br/><br/>He had made a breakthrough!<br/><br/>He had finally made a breakthrough!<br/><br/>He had only made a breakthrough today after nearly two hundred million years of searching for the tribulation!<br/><br/>Moreover, this breakthrough was all thanks to the protection of the Dragon King.<br/><br/>He could clearly sense the situation at the beginning.<br/><br/>A control-level powerhouse had arrived and was killed by the Dragon King.<br/><br/>If he had made a breakthrough here, he would be dead!<br/><br/>“There’s no need. I have a treasure in my hands. I’ll bring you all back directly. Should I return to the nine-origin universe or the Great Dao of Heaven?”<br/><br/>Wang Xian said to the dark night withered king.<br/><br/>“Dragon King, I’ll return to the nine-origin Universe.”<br/><br/>The Dark Night King replied. He looked at Ling honggu and said, “Honggu, I’ll return to the nine-origin universe first to improve the skeleton race. Then, I’ll take charge of the nine-origin universe and stabilize my strength.”<br/><br/>“Yes, Uncle Dark Night, you’re the first Tianyuan creator of our skeleton race. Returning to the nine-origin universe will also boost our skeleton race’s momentum.”<br/><br/>Ling honggu nodded with a smile.<br/><br/>Currently, only the skeleton clan did not have a strong person in the Heaven’s origin creation realm.<br/><br/>The breakthrough of the King of Darkness was of great significance to the skeleton clan.<br/><br/>“Alright!”<br/><br/>The King of darkness nodded with a smile.<br/><br/>“Let’s go. It just so happens that I have to send chief water to the Dragon Palace.”<br/><br/>Wang Xian nodded. He looked at Chief Water God Dragon and gestured for him to keep it in the space of the mother nest.<br/><br/>He also kept the King of darkness.<br/><br/>After that, Wang Xian called an lie over and brought them back to the Dragon Palace.<br/><br/>“In the future, if the Dragon King has anything to do, you can directly instruct our skeleton clan. We, the skeleton clan, will not hesitate to do anything.”<br/><br/>After returning to the Dragon Palace, the King of Darkness bowed respectfully to Wang Xian once again before leaving.<br/><br/>“Alright, go. Consolidate your strength in the nine-origin universe. If you have nothing to do, you can look for Northern Frost, the leader of water, the leader of fire, the scholars from the saint’s lineage, and Jiuli from the demon clan to spar. All of you have just stepped into the Heaven’s origin blessed realm not long ago, and all of you are in the nine-origin universe.”<br/><br/>Wang Xian nodded at him.<br/><br/>“It’s the Dragon King!”<br/><br/>The Dark Night King nodded. He was also very shocked.<br/><br/>The Dragon Palace actually had so many powerhouses in the Heavenly Yuan Destiny Realm Now?<br/><br/>He knew about Northern Frost, the Dragon King’s disciple and the only frost divine dragon in the Dragon Palace.<br/><br/>Naturally, he knew about the leader of the Fire Divine Dragon in the Dragon Palace, the leader of the Water Divine Dragon.<br/><br/>The leader of the water divine dragon was easy to deal with since he broke through together with him.<br/><br/>But when did bei Shuang and the leader of the Fire Dragon Clan break through?<br/><br/>In the past, when the Void Universe had invaded the nine-origin universe, the Dragon Clan had already shown the existence of Lin Niu and a post-dragon heavenly yuan creation.<br/><br/>Now, with this fiend, how many heavenly yuan creations were there in the Dragon Clan?<br/><br/>Especially when the fiend in front of him hadn’t broken through, he felt that it was very powerful.<br/><br/>Now, he felt that he was even more unfathomable.<br/><br/>At the very least, he could be easily killed in front of him.<br/><br/>In addition, the Tiger Cry Mountain of the Divine Tiger clan and the floating water empress of the celestial nation had both broken through because of the Dragon King.<br/><br/>Now, in the entire nine-origin universe, the Dragon Palace was the strongest, with several peak races embracing each other.<br/><br/>In the future, the skeleton race, because of the spirit red bones, and because of his breakthrough, would also fight for the Dragon Palace.<br/><br/>The power of the Dragon Palace was too terrifying.<br/><br/>It was so terrifying that even if the other peak races, including the Fallen Shadow Demon Emperor and the other experts joined forces, they would only be on par with the Dragon Palace!<br/><br/>With shock, the dark night withered king flew towards the skeleton clan.<br/><br/>He also knew that in the future, the Dragon King would be the most prestigious existence in the nine-origin universe.<br/><br/>If the skeleton clan wanted to be stronger in the future, they would need the Dragon King’s help.<br/><br/>Because only the Dragon King could they give birth to more powerhouses in the Heavenly Yuan Destiny Realm.<br/><br/>However, he knew that because Ling Honggu could reach the heavenly yuan destiny realm, no matter what, Ling Honggu was a member of the skeleton clan.<br/><br/>“I have to take good care of Ling Honggu’s father and the others.”<br/><br/>King dark night thought to himself and shook his head.<br/><br/>This was because Ling Honggu’s father and grandfather had a very high status in the skeleton clan.<br/><br/>Even they were polite to her in the past.<br/><br/>After all, Ling Honggu had a good relationship with the Dragon King.<br/><br/>Wang Xian didn’t stay long after he returned to the Dragon Palace.<br/><br/>Now, the Dragon Palace had beishuang, the fire god Dragon leader, the Water God Dragon leader, and Lin Niu. Wang Xian didn’t have to worry about them.<br/><br/>He ordered an lie to bring them to the Great Dao of heaven.<br/><br/>“Continue to cultivate!”<br/><br/>Wang Xian ordered the disciples who were at the peak of the Overlord realm of the Dragon Palace to cultivate in the primal chaos stone.<br/><br/>Now, due to the abundant energy in the Great Dao of heaven, there were also disciples from the Dragon Palace who had broken through to the peak of the Overlord realm.<br/><br/>This also caused the number of disciples who were at the peak of the Overlord realm to increase.<br/><br/>Mo Sha was overseeing the entire na Tian universe.<br/><br/>As Mo Sha was a poisonous horned dragon, he had a strong ability in parasitic control.<br/><br/>He was overseeing the entire na Tian universe. As long as there were experts who had broken through here, he would be able to sense them immediately.<br/><br/>When the time came, Wang Xian would head over directly to ensure that the quota would not be occupied.<br/><br/>Time passed quickly once again.<br/><br/>In the next million years, the Dragon Palace produced a powerhouse in the Heaven’s origin creation realm.<br/><br/>A thunder-attributed Heaven’s origin creation realm was the leader of the Thunder Dragons.<br/><br/>Wang Xian had the quota for the breakthrough of the thunder-attributed. He did not need to look for it at all. He could achieve a breakthrough directly.<br/><br/>This also allowed the Dragon Palace to produce the fourth divine dragon in the Heaven’s origin creation realm.<br/><br/>“One million years in the space of the primal chaos stone is equivalent to one hundred million years. Under the support of a huge amount of resources, it is still very difficult to produce a powerhouse in the Heaven’s origin creation realm.”<br/><br/>Wang Xian thought to himself.<br/><br/>The reason why the leader of the Thunder Dragon of the Dragon Palace was able to achieve a breakthrough was also related to the resources that Wang Xian obtained this time.<br/><br/>The corpse of the three-headed old man.<br/><br/>He had absorbed the energy from the three-headed old man’s corpse in order to achieve a breakthrough.<br/><br/>“Dragon King!”<br/><br/>Just as Wang Xian was deep in thought at the Great Dao of Heaven, an lie rushed over.<br/><br/>Currently, an lie was in charge of transmitting and some important information.<br/><br/>There must be some news for an lie to come over.<br/><br/>“What is it?”<br/><br/>Wang Xian looked at an lie and asked.<br/><br/>“Dragon King, there is news from the space behemoth chaos. It said that a control-level space behemoth is about to leave the universe. Let me tell you this news!”<br/><br/>An lie reported.<br/><br/>“Oh?”<br/><br/>Wang Xian raised his eyebrows slightly when he received the news.<br/><br/>It had been a long time since there had been any news from the space beasts.<br/><br/>Currently, there were still a few powerful space beasts in the starry universe. This time, the one who went out was a control-level existence.<br/><br/>“A control-level space beast can be killed. In addition, there aren’t many space beasts in the starry universe!”<br/><br/>Wang Xian thought to himself.\t\t\t\t\t\t</div>", "images": {}, "success": true}