{"id": 1341, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075090.html", "title": "Chapter 4344 - Chapter 4344: The Breakthrough Of The 4343 Disciples Of The Dragon Palace", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4344 - Chapter 4344: The Breakthrough Of The 4343 Disciples Of The Dragon Palace</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4344: The breakthrough of the 4343 disciples of the Dragon Palace<br/><br/>Translator: 549690339<br/><br/>Buzz<br/><br/>In a secret place of origin.<br/><br/>A cave entrance was opened directly. Wang Xian entered it and a surge of energy enveloped him.<br/><br/>Inside the cave entrance, Saint Futu and Saint Haoyang were sitting cross-legged in the energy liquid to recover.<br/><br/>The moment Wang Xian rushed over, Saint Futu and Saint Haoyang were stunned.<br/><br/>They looked at Wang Xian’s figure and felt the sealed space around them. Their faces were filled with shock and bewilderment.<br/><br/>“Am I hallucinating?”<br/><br/>Saint Haoyang stared at Wang Xian in disbelief and growled in a low voice.<br/><br/>Gulp<br/><br/>Saint Futu’s eyes were also wide open. His face was filled with shock. “This is impossible. This is impossible. How could you come here from the Na Tian universe so quickly? This is impossible!”<br/><br/>He screamed in fear.<br/><br/>How could they believe it.<br/><br/>How long had it been?<br/><br/>The Dragon King of the Dragon Palace had actually chased after them.<br/><br/>He wanted to kill them all!<br/><br/>“Hehe, the mistake is that you have provoked the wrong person!”<br/><br/>Wang Xian stared at them. His eyes were filled with coldness.<br/><br/>He waved his arm and an energy enveloped them.<br/><br/>In an instant, they were wiped out.<br/><br/>After killing them, Wang Xian kept their corpses and took out the divination lamp to continue his divination.<br/><br/>There were many treasures for a powerhouse in the Heaven’s origin realm to be resurrected.<br/><br/>After his divination was completed, the information was clearly displayed.<br/><br/>They would be resurrected in a place in the entire universe!<br/><br/>The treasures that they used to resurrect could only sustain them to the peak of the Dominator realm.<br/><br/>They had fallen to the Overlord realm.<br/><br/>Divination was much easier now.<br/><br/>Wang Xian waved his arm and released an lie. Then, he moved his body and arrived in the Na Tian universe in an instant.<br/><br/>Following that, Wang Xian quickly flew towards the outside of the Na Tian universe.<br/><br/>According to the information obtained from the lamp of divination.<br/><br/>The place where they were resurrected this time was outside of the Na Tian universe.<br/><br/>Of course, it was also very close to the universe.<br/><br/>This was because they had already fallen into the Heavenly Yuan blessed realm.<br/><br/>If the calamity did not arrive, their strength, which was at the peak, would not be able to survive for long in the chaos.<br/><br/>Wang Xian flew over at a very fast speed.<br/><br/>At the same time, Saint Futu and Saint Haoyang were resurrected again.<br/><br/>They looked at each other and trembled slightly.<br/><br/>“We are locked on by the Dragon King. He will probably come after us again soon.”<br/><br/>They were panicking!<br/><br/>The Dragon King of the Dragon Palace was going to destroy them completely!<br/><br/>They were terrified and trembling!<br/><br/>They didn’t want to die!<br/><br/>If the dragon king kept chasing them, they would disappear in this universe.<br/><br/>This made them, who were high up in the sky and Immortal, extremely terrified!<br/><br/>“Run!”<br/><br/>“Let’s split up and run!”<br/><br/>Saint Futu and Saint Haoyang gritted their teeth and split up.<br/><br/>If they split up, they might still have a chance.<br/><br/>Perhaps only one of them was locked on?<br/><br/>They prayed in their hearts.<br/><br/>They flew directly into the boundless chaos.<br/><br/>However, their speed was too slow!<br/><br/>The difference between the speed of a ruler at the peak and that of a king immortal was too great!<br/><br/>Time passed day by day.<br/><br/>In just over 500 years, Wang Xian looked at a figure in front of him with a mocking expression.<br/><br/>Buzz<br/><br/>Wang Xian teleported and arrived in front of Saint Futu. “You can’t escape. You can’t escape at all!”<br/><br/>His voice appeared in Saint Futu’s mind.<br/><br/>This caused Saint Futu’s body to stiffen. He couldn’t help but look behind him.<br/><br/>“No, no, no. Dragon King, let me go. Let Me Go. I can do whatever you want me to do. Let Me Go!”<br/><br/>Saint Futu was on the verge of collapse!<br/><br/>He widened his eyes.<br/><br/>He had caught up to him in just over six hundred years?<br/><br/>How was this possible!<br/><br/>From the origin to the universe, it would take them over two hundred thousand years to fly by themselves!<br/><br/>How could he be so fast.<br/><br/>He broke down and wanted to beg for mercy!<br/><br/>“Guys like you are not worthy of the Heaven’s origin creation.”<br/><br/>Wang Xian stared at him coldly. With a move of his arm, he absorbed the soul!<br/><br/>This time, he did not kill him directly!<br/><br/>His strength had dropped to the Heaven’s origin creation stage. Wang Xian could use the soul absorbing power to obtain all of his memories.<br/><br/>In this way, he could store all the treasures that he resurrected and erase all his information.<br/><br/>Saint Futu was in a trance in an instant. One by one, information was transmitted into Wang Xian’s mind.<br/><br/>Wang Xian did not kill him. After storing them, he continued to pursue the Haoyang saint.<br/><br/>A few decades later, Wang Xian arrived in front of the Haoyang saint and similarly obtained all his information.<br/><br/>Following that, Wang Xian flew toward the places where they were resurrected!<br/><br/>In the next thousand years, Wang Xian wiped out all the treasures that they resurrected.<br/><br/>This also meant that as long as they were killed, they would be completely dead!<br/><br/>Wang Xian did not kill them immediately.<br/><br/>The Haoyang Saint had the fire attribute while the Buddha Saint had the light attribute.<br/><br/>Wang Xian kept them in his hands and would kill them when the disciples of the Dragon Palace came here to make a breakthrough!<br/><br/>“It’s fortunate that I came here. Otherwise, these two reckless fellows would really take revenge on me and the nine-origin universe!”<br/><br/>After Wang Xian received the information about the two of them, a cold look flashed in his eyes.<br/><br/>The Buddha saint and the Haoyang Saint deserved to die!<br/><br/>“In addition, in the entire universe, other than the fire attribute and the light attribute, there are three slots for the Heaven’s origin destinies. One is for gold, one is for wood, and the other is for thunder. These slots are useful to the Dragon Palace!”<br/><br/>Wang Xian mumbled as his eyes sparkled.<br/><br/>“An lie, bring the leader of the water god Dragon here. Let him break through First!”<br/><br/>Wang Xian released an lie and instructed him.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded his head. With a move of his body, he immediately arrived at the heavenly path.<br/><br/>Soon, the leader of the Fire God Dragon was brought over.<br/><br/>“Greetings, Dragon King!”<br/><br/>The leader of the Fire God Dragon bowed respectfully!<br/><br/>“Break through!”<br/><br/>Wang Xian said to him with a smile on his face.<br/><br/>“It’s the Dragon King. Thank you, Dragon King!”<br/><br/>The leader of the Fire God Dragon nodded his head excitedly.<br/><br/>“Roar! Roar!”<br/><br/>He let out a low roar and flew directly to the sky to begin his breakthrough!<br/><br/>Wang Xian stood there and watched with a smile.<br/><br/>“This can be considered as the second divine dragon to achieve a breakthrough in the Dragon Palace.”<br/><br/>He thought to himself, “In the sword and magic universe, there are four spots in the Heaven’s origin destinies with wood, Earth, wind, light, and thunder attributes. After the leader of the Fire God Dragon used one, there are still eight spots left. They are one gold, two wood, one Earth, one wind, two light, and one thunder.”<br/><br/>This was also a fortune for the Dragon Palace.<br/><br/>At least, there were many attributes. If the disciples of the Dragon Palace broke through, they wouldn’t need to look for slots.<br/><br/>However, the Dragon Palace didn’t have a water attribute slot.<br/><br/>After the fire attribute was used up, there was no more!<br/><br/>There was no darkness attribute either.<br/><br/>But this wasn’t a big problem!\t\t\t\t\t\t</div>", "images": {}, "success": true}