{"id": 1351, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075130.html", "title": "Chapter 4354 - Chapter 4354: 4353 Descended", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4354 - Chapter 4354: 4353 Descended</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4354: 4353 descended<br/><br/>Translator: 549690339<br/><br/>“Has the Dragon King replied?”<br/><br/>“Not yet. We just sent a message over. The Dragon King can’t be so fast. If the Dragon King is busy right now, I’m afraid he’ll need more time!”<br/><br/>At the center of the Sword and Magic Universe.<br/><br/>Liu Lan and hopeless sky were floating in the sky as they spoke with grave expressions.<br/><br/>At this moment, they could only wait for news from the Dragon King. There was nothing they could do.<br/><br/>If the gigantic beast were to fly towards them at a rapid speed, they would have to lead their disciples to escape!<br/><br/>“Brother Wang Xian hasn’t replied to us yet, but he will be here soon!”<br/><br/>Long Yin spoke with confidence!<br/><br/>Buzz! Buzz<br/><br/>Buzz! Buzz<br/><br/>Roar<br/><br/>Just as long yin finished his sentence, there was a place below them.<br/><br/>There was a palace.<br/><br/>This palace was specially built by Liu Lan and Wang Xian for Wang Xian.<br/><br/>The entire palace took up a huge area.<br/><br/>It was majestic and magnificent. It was no weaker than the two forces of the Heaven’s origin.<br/><br/>However, at this moment, waves of terrifying energy rose from the palace.<br/><br/>Vast!<br/><br/>Barbaric!<br/><br/>Ancient!<br/><br/>Powerful!<br/><br/>Mysterious!<br/><br/>All kinds of powerful feelings instantly surged into the hearts of the surrounding disciples.<br/><br/>The disciples who were floating in the air felt an inexplicable pressure.<br/><br/>They felt a fear that came from the depths of their hearts.<br/><br/>Their eyes widened, and their faces were filled with shock.<br/><br/>Their bodies couldn’t help but fall down!<br/><br/>Countless powerful disciples fell to the ground like rain, looking in that direction in shock.<br/><br/>Liu Lan and Wang Wangtian’s eyes also focused!<br/><br/>At this moment, all the powerful disciples saw three enormous creatures appear above the palace.<br/><br/>The size of these three creatures was unbelievable to them.<br/><br/>How could there be such gigantic creatures in the world!<br/><br/>“It’s brother Wang Xian! Brother Wang Xian is here!”<br/><br/>At this moment, long yinyin was pleasantly surprised when he saw the creatures.<br/><br/>He had been to the Dragon Palace and knew the existence of Xiao Lan and the rest.<br/><br/>She looked up and searched for the figures of Wang Xian and the rest.<br/><br/>At this moment, all the strong disciples saw seven figures flying rapidly towards them from the gigantic beast in the middle!<br/><br/>“This? ? This is the Dragon King? That’s the Dragon King?”<br/><br/>“Hiss, what are these three gigantic beasts? Why do I feel that they are extremely terrifying? It’s even more terrifying than the might of the two of us!”<br/><br/>“Look at the six subordinates of the Dragon King. Their auras are equally terrifying. Are these all existences in the Heaven’s origin realm? Oh My God!”<br/><br/>“Is this the Dragon King’s influence? Who are these people of the Dragon King?”<br/><br/>In the surrounding area, all the strong disciples noticed Wang Xian’s figure. Their faces were filled with shock.<br/><br/>This way of appearance!<br/><br/>It was a complete descent!<br/><br/>Yes, a descent into their universe!<br/><br/>Liu Lan and Wang Wangtian looked at each other. Through each other’s eyes, they could see the deep shock in each other’s eyes.<br/><br/>They were strong cultivators in the Heaven’s origin realm. They could sense the strength of Wang Xian and the rest.<br/><br/>Even the weakest among them had their own strength.<br/><br/>Most of them thought that they were stronger than them.<br/><br/>Was this the Dragon King of the Dragon Palace in the nine-origin universe?<br/><br/>He was much stronger than the strength he displayed last time!<br/><br/>He brought nine existences in the Heavenly Yuan blessed realm here?<br/><br/>He was simply invincible!<br/><br/>It was easy for such existences to destroy their sword and Magic Universe!<br/><br/>“Dragon King!”<br/><br/>Liu Lan and hopeless sky moved their bodies and quickly went up to welcome him!<br/><br/>“D * MN, is this brother-in-law’s way of appearing? This is simply awesome! Ahhh!”<br/><br/>Long Yinhao looked at this scene with a look of admiration.<br/><br/>He followed long yinyin and quickly went up to welcome him!<br/><br/>“Brother-in-law, you’re finally here!”<br/><br/>Long Yinhao shouted excitedly!<br/><br/>“Brother Wang Xian!”<br/><br/>Long yinyin rolled his eyes at him and greeted Wang Xian with a smile!<br/><br/>“Okay!”<br/><br/>Wang Xian nodded with a smile and waved at long yinyin and the rest. “Yinyin, are you alright?”<br/><br/>“I’m Fine!”<br/><br/>Long yinyin shook his head!<br/><br/>“Greetings, Dragon Queen!”<br/><br/>“Greetings, Mistress!”<br/><br/>At the side, Demon Beisheng and the rest bowed to long yinyin!<br/><br/>As the Dragon Queen, all the disciples of the Dragon Palace knew about long yin.<br/><br/>She had also been to the Dragon Palace and stayed there for some time.<br/><br/>Although their strength had increased, the Dragon Queen’s position in the Dragon Palace was higher.<br/><br/>In the Dragon Palace, the Dragon King was in the lead, followed by the Dragon Queen, and then Prime Minister Gui.<br/><br/>Finally, they were the leaders!<br/><br/>Even though Prime Minister Gui had not reached the Heavenly Yuan realm yet.<br/><br/>After all, as the head butler of the Dragon Palace, he had always served the Dragon King and managed the Dragon Palace. They all respected Prime Minister Gui very much.<br/><br/>“Well, Hello!”<br/><br/>Long Yinyin’s face turned slightly red when he saw the experts treating his luggage so respectfully. He immediately replied!<br/><br/>Liu Lan and the others were shocked when they saw this scene.<br/><br/>These experts were all experts from the Dragon Palace?<br/><br/>They were all subordinates of the Dragon King?<br/><br/>This? ? ?<br/><br/>“Liu Lan and Wangtian, what exactly is going on?”<br/><br/>Wang Xian glanced toward the north and then looked at Liu Lan and Wangtian as he asked.<br/><br/>“Dragon King, we don’t know what is going on either. Not long ago, we heard a roar. When we rushed over, we saw an extremely huge beast wreaking havoc in our sword and Magic Universe!”<br/><br/>“Its body is incomparably huge. It can devour an entire city with just a single opening of its mouth. Its body size is comparable to the size of a magic kingdom. Its strength is extremely terrifying. After we rushed over and were discovered by it, it easily devoured us. We didn’t even manage to escape!”<br/><br/>Hopeless Sky’s expression was unsightly as he immediately said, “This huge beast’s strength is extremely terrifying!”<br/><br/>“Oh? A giant beast that suddenly broke into the nine-origin universe? What does it look like exactly?”<br/><br/>Wang Xian continued to ask them!<br/><br/>“It has an incomparably huge head. Its mouth occupies a large portion of its head. Its densely packed teeth are exposed outside. It’s extremely terrifying. Its body is like that of a crocodile!”<br/><br/>“That’s exactly what it looks like. In addition, we found a terrifying scar on the body of this giant beast. It should be injured.”<br/><br/>Liu Lan waved her arm and condensed the appearance of the giant beast.<br/><br/>“Eh? This Is?”<br/><br/>When Wang Xian saw the appearance of the giant beast condensed by Liu Lan, his gaze froze slightly!<br/><br/>“Dragon King, this is the heaven-devouring earth-eating beast emperor, one of the three Great Dao Beast Emperors in the starry universe. It likes to devour living beings and items with energy.”<br/><br/>At this moment, Hundun, who was at the back, saw this image and immediately spoke up!\t\t\t\t\t\t</div>", "images": {}, "success": true}