{"id": 1350, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075126.html", "title": "Chapter 4353 - Chapter 4353: 4352 Descended", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4353 - Chapter 4353: 4352 Descended</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4353: 4352 descended<br/><br/>Translator: 549690339<br/><br/>“Keep an eye on that giant beast’s movements. The moment it flies towards us, we’ll immediately escape!”<br/><br/>“An existence of this level isn’t something we can contend against. Why are we so unlucky in the sword and Magic Universe?”<br/><br/>Hopeless Sky, who was floating in the air, kept on saying with an ugly expression.<br/><br/>He felt that his universe was very unlucky.<br/><br/>But at the same time, he also knew in his heart that it was not that they were unlucky, but that they were too weak.<br/><br/>If they were weak, they would be targeted by other powerhouses.<br/><br/>“I have immediately contacted the Dragon King, but I don’t know how long it will take for the Dragon King to Rush Here!”<br/><br/>Liu Lan said.<br/><br/>Disaster, a huge disaster.<br/><br/>Facing this disaster, they had no way to resist.<br/><br/>That terrifying beast could devour a magic country within a few seconds. Even the entire sword and magic universe couldn’t withstand his rampage.<br/><br/>Before long, the entire sword and magic universe would be plunged into misery!<br/><br/>“My lord, what exactly happened?”<br/><br/>At this time, the peak-stage rulers of the sword and Magic Universe flew over and asked them with a solemn expression.<br/><br/>“A disaster!”<br/><br/>Liu Lan looked at them and said with a solemn expression.<br/><br/>“My Lord, is there an enemy invading our sword and Magic Universe? We’ll fight them to the death and protect our home. Even if we die, we’re not afraid!”<br/><br/>“Yes, my Lord. Anyone who wants to invade our sword and Magic Universe will have to pay the price. None of our disciples are afraid!”<br/><br/>“That’s right!”<br/><br/>The powerful disciples said indignantly, their faces filled with determination!<br/><br/>The Dragon’s Roar, the Dragon’s roar, and the Flowing Water Saintess’eyes were also filled with fighting spirit.<br/><br/>The Sword and Magic Universe was their home. No one could invade it!<br/><br/>Even if they had to pay the price of their lives, they had to protect it!<br/><br/>“I don’t know which universe’s creature or the beast in the chaos, but I can’t resist a powerful Beast!”<br/><br/>Hopeless Heaven suppressed the pain in his heart and looked at them calmly. “I went with your Lord Liu Lan and was instantly killed. I couldn’t resist at all and could only be resurrected through treasures. This is not an enemy we can fight against.”<br/><br/>“What?”<br/><br/>Hopeless Heaven’s words caused the powerful disciples from the sword and Magic Universe to widen their eyes. They were filled with shock and disbelief.<br/><br/>Their two lords were instantly killed?<br/><br/>How was this possible?<br/><br/>“Now, we can only seek help from the Dragon King. Let’s see if the Dragon King has any way to resist!”<br/><br/>Liu Lan was silent for a moment before he spoke. His gaze landed on long yinyin. “Yinyin, inform the Dragon King as well. Tell him the truth about the situation here!”<br/><br/>“Yes!”<br/><br/>Long Yinyin opened his mouth and replied immediately.<br/><br/>He had been in closed-door cultivation all this while and didn’t have the time to contact Wang Xian.<br/><br/>She took out the soul-returning wood branch that Wang Xian had given him and carved some words on it.<br/><br/>Once the words were carved on the soul-returning wood branch, the words would appear on the soul-returning wood branch of the ancestral tree in Wang Xian’s body.<br/><br/>This was their way of contacting each other from afar.<br/><br/>“Look at the communicator. Oh My God, there’s a terrifying giant beast that is wreaking havoc in our sword and magic universe. Some people say that the giant beast is even larger than a magical country. It can devour all the living beings in a city!”<br/><br/>“Hiss, look, there’s even a video of that giant beast on it. Even the Ako mountain range is extremely tiny in front of it. How is this possible? How can there be such a huge monster in the universe!”<br/><br/>“It’s too terrifying, too terrifying. A magical country was actually devoured by him within a few minutes. That giant beast is heading towards the direction of our interior. It’s devouring and advancing at the same time. All life forms and all energy have been devoured by it!”<br/><br/>“There are also experts and disciples saying that the two of US rushed over and were instantly devoured!”<br/><br/>At this moment, countless experts and disciples floating in the air suddenly broke out into a commotion.<br/><br/>The news of this disaster was transmitted into the communication device by many experts and disciples.<br/><br/>Through the communication device, they saw that terrifying giant beast.<br/><br/>They knew that there was a giant beast that was devouring their universe life forms.<br/><br/>There was even a message saying that both of them had been directly devoured!<br/><br/>This caused all the powerful disciples to widen their eyes in shock.<br/><br/>They looked up and looked at their two heavenly yuan destiny realm powerhouses.<br/><br/>When they saw that the two of them did not immediately give them any orders, they had a bad premonition.<br/><br/>Perhaps it was as the powerful disciples on the communication device had said, that gigantic beast was not something that the two of them could contend against.<br/><br/>Countless powerful disciples were in a commotion and kept discussing.<br/><br/>In the face of disaster and death, everyone was in a mess!<br/><br/>“We have already contacted the Dragon King of the Dragon Palace of the nine-origin universe. If the Dragon King comes, we might be able to resist him, but… we have to be prepared to escape!”<br/><br/>Liu Lan looked at all the powerful disciples who were at a loss and said!<br/><br/>As soon as she finished her words, countless powerful disciples quieted down.<br/><br/>“Brother Wang Xian will definitely rush here as soon as he gets the news.”<br/><br/>Long yinyin looked at Liu Lan and clenched her fists slightly as she said firmly.<br/><br/>“We believe it.”<br/><br/>Liu Lan looked at long yinyin and nodded.<br/><br/>They believed that the Dragon King would rush here after receiving the news.<br/><br/>But would the Dragon King be a match for that giant beast?<br/><br/>That giant beast was too powerful.<br/><br/>So powerful that they didn’t have much confidence in the Dragon King.<br/><br/>“HM?”<br/><br/>At the same time, in the starry universe.<br/><br/>Not long after the small house broke through, he suddenly felt something in his heart.<br/><br/>Communicating with the words carved on the soul-returning wood branches would consume the soul-returning embryo fruits on the wood.<br/><br/>Therefore, under normal circumstances, they would send messages secretly and would not use the soul-returning tree branches to communicate.<br/><br/>Using the soul-returning tree branches to communicate, there must be something urgent.<br/><br/>Wang Xian’s mind stirred. He sensed the information on it and frowned slightly.<br/><br/>He had seen the messages sent by Liu Lan and Long Yin!<br/><br/>“A giant beast wreaking havoc in the sword and Magic Universe? It killed Liu Lan and Hopeless Heaven in an instant?”<br/><br/>Wang Xian’s eyes flickered slightly as he read the information.<br/><br/>Was it a space beast or a Chaos Beast?<br/><br/>To be able to devour Liu Lan and Wang Xian in an instant without giving them a chance to escape, it should be at the Great Dao level!<br/><br/>Otherwise, it would be very difficult for a control-level beast to devour the two of them in an instant.<br/><br/>“There are giant beasts wreaking havoc in the sword and Magic Universe. They might be at the Great Dao level. All of you, come with me.”<br/><br/>Wang Xian looked at Mo Sha and the rest and said!<br/><br/>“It’s the Dragon King!”<br/><br/>Mo Sha and the rest immediately replied respectfully!<br/><br/>“An lie, bring all of us there. Is that Alright?”<br/><br/>Wang Xian looked at an lie and asked.<br/><br/>“No Problem!”<br/><br/>An lie nodded!\t\t\t\t\t\t</div>", "images": {}, "success": true}