{"id": 1354, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075142.html", "title": "Chapter 4357 - Chapter 4357: 4356 Hunting The Cosmic Behemoth Of The Great Dao", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4357 - Chapter 4357: 4356 Hunting The Cosmic Behemoth Of The Great Dao</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4357: 4356 hunting the cosmic behemoth of the Great Dao<br/><br/>Translator: 549690339<br/><br/>“What a strange escape method.”<br/><br/>The world instantly recovered.<br/><br/>The heaven-devouring Earth Beast Emperor also disappeared in an instant.<br/><br/>It was as if he had never appeared in this piece of void.<br/><br/>The speed of his escape was extremely fast!<br/><br/>“This? ? How did he disappear?”<br/><br/>Liu Lan, Hopeless Heaven, and the rest felt the strength of the Dragon King and the rest. At the same time, they were also shocked by the disappearance of the heaven-devouring Earth Beast Emperor in an instant!<br/><br/>“It’s just a powerful escape tactic. Follow Me and chase after him!”<br/><br/>Wang Xian waved his dragon claw and unleashed the Netherworld Dragon’s pursuit.<br/><br/>A black hole appeared in front of them!<br/><br/>Wang Xian entered the black hole directly.<br/><br/>“Let’s Go!”<br/><br/>Mo Sha and the rest shouted in a low voice and followed him into the black hole.<br/><br/>Liu Lan and Wang Wangtian looked at the black hole and entered it immediately.<br/><br/>“Buzz!”<br/><br/>“Roar!”<br/><br/>When they came out of the black hole, they heard the furious roar of the heaven-swallowing earth-devouring Beast Emperor.<br/><br/>An incomparably huge mouth was already closing in on them before they came out!<br/><br/>“Mad Dragon Star Explosion!”<br/><br/>Wang Xian let out a low growl. All kinds of energy were gathered together.<br/><br/>All the energy was enhanced and distorted.<br/><br/>Boom<br/><br/>Following a loud explosion, the huge mouth was blasted apart.<br/><br/>Roar<br/><br/>The heaven-swallowing earth-eating beast emperor was affected by the aftermath of the explosion. Dense wounds appeared on its body once again.<br/><br/>It let out an angry roar. It opened its huge mouth and bit forward. A piece of void was torn apart.<br/><br/>The black spatial crack was revealed.<br/><br/>Following that, it entered the spatial crack directly.<br/><br/>The heaven-devouring beast King could sense the strength of Wang Xian and the rest. It also knew that it was no match for them.<br/><br/>Therefore, it chose to escape and did not fight with them at all.<br/><br/>“Give chase!”<br/><br/>Wang Xian saw it entering the space crack. With a wave of its dragon claws, a wave of energy enveloped mo sha and the rest.<br/><br/>It brought them directly into the space crack!<br/><br/>After entering the space crack, Wang Xian saw the heaven-devouring beast king fleeing frantically.<br/><br/>Its speed was extremely terrifying.<br/><br/>Wang Xian swayed his huge dragon body and chased after it rapidly.<br/><br/>He chased after it and prevented it from escaping with its flesh and blood, allowing some of his flesh and blood to escape.<br/><br/>The heaven-swallowing earth-eating beast emperor obviously used its powerful talent. Its speed in the crack in the Void was actually not slower than Wang Xian’s.<br/><br/>One had to know that Wang Xian’s strength was double his.<br/><br/>The heaven-swallowing earth-eating Beast Emperor’s strength was merely at the level of an ordinary Great Dao.<br/><br/>Wang Xian was equivalent to two of it.<br/><br/>Under such circumstances, Wang Xian was still unable to catch up to it. The eruption of his talent skills was indeed terrifying!<br/><br/>“It’s really difficult to hunt down a space beast of this level!”<br/><br/>Wang Xian continued his pursuit from behind.<br/><br/>With the power of wind and thunder to lock down enemies and the divination lamp, Wang Xian would not pursue it!<br/><br/>Even so, the heaven-swallowing earth-eating beast King erupted for a whole year at such a terrifying speed.<br/><br/>This shocked Wang Xian a little.<br/><br/>It erupted for a whole year at such a fast speed.<br/><br/>If not for the fact that Wang Xian’s speed was much faster than his, Wang Xian would have already lost track of it.<br/><br/>It had already escaped!<br/><br/>“Crash!”<br/><br/>One year later, the speed of the heaven-devouring Beast Emperor began to slow down.<br/><br/>It also rushed out of the sword and Magic Universe and entered the chaos.<br/><br/>There were no void cracks in the chaos!<br/><br/>The speed of the heaven-devouring beast emperor slowed down.<br/><br/>Wang Xian quickly chased after it. Numerous extremely terrifying chains were entangling it.<br/><br/>Huala<br/><br/>Countless chains were entangling the body of the heaven-devouring beast emperor, causing it to struggle violently!<br/><br/>“Demon Pendulum!”<br/><br/>Seeing that the heaven-devouring beast emperor was temporarily restrained, Mo Sha let out a low roar!<br/><br/>An incomparably huge pendulum appeared in the sky above the heaven-devouring beast emperor.<br/><br/>The pendulum shook, and countless black shadows drilled into the body of the heaven-devouring Beast Emperor!<br/><br/>Bei Shuang and the others immediately unleashed powerful attacks.<br/><br/>All sorts of attacks landed on the body of the heaven-devouring Beast Emperor, causing its flesh and blood to fly everywhere!<br/><br/>“Aooo!”<br/><br/>The heaven-swallowing earth-eating Beast Emperor let out a painful cry.<br/><br/>It opened its huge mouth and countless dense meteorites flew out from its huge mouth.<br/><br/>Each meteorite carried an unparalleled destructive power!<br/><br/>The meteorites covered Wang Xian and the rest.<br/><br/>“Huh? Be careful. The attacks of these meteorites are very strong. All of you, come behind me.”<br/><br/>Wang Xian felt the attacks of these meteorites and his gaze focused.<br/><br/>These meteorites, even he had to take them seriously!<br/><br/>When the demonic fiend northfrost flowing blue Wangtian and the rest heard Wang Xian’s words, they hurriedly flew behind him!<br/><br/>“Bang, Bang, Bang!”<br/><br/>Wang Xian formed a defense around him and resisted the attacks of the countless meteorites.<br/><br/>“Bang, Bang, Bang!”<br/><br/>“Bang, Bang, Bang!”<br/><br/>Just when the countless meteorites arrived in front of Wang Xian and the rest, all of them suddenly exploded.<br/><br/>The entire chaotic space began to boil in an instant.<br/><br/>The surrounding chaotic space began to change, turning into a space filled with meteorites.<br/><br/>In an instant, it was as if they had arrived at another chaotic space.<br/><br/>The heaven-swallowing earth-eating beast emperor disappeared from their sight once again.<br/><br/>“What kind of attack is this? Did the heaven-swallowing earth-eating Beast Emperor escape again?”<br/><br/>The fire leader looked around with a shocked expression.<br/><br/>Everything around them was extremely peaceful.<br/><br/>The meteorite that was filled with a powerful aura instantly calmed down as if it had lost its offensive power.<br/><br/>The space they were in was also extremely strange.<br/><br/>“We don’t know. At that time, we only knew that the Heaven and Earth Devouring Beast Emperor could devour the world and possess a bottomless pit body.”<br/><br/>Hun Dun looked around and shook his head solemnly.<br/><br/>A beast emperor of this level was not something that they could investigate.<br/><br/>“It’s a trapping formation. It’s still at the front. It wants to trap us in here.”<br/><br/>Wang Xian frowned. He couldn’t help but exclaim at the various means of this heaven-devouring Earth Beast Emperor.<br/><br/>These innate skills of escaping were too strong!<br/><br/>He waved his dragon claws to attack the meteorites around him, but he could not break through this strange space!<br/><br/>Buzz<br/><br/>Wang Xian immediately used the divination lamp to perform divination.<br/><br/>The divination lamp burned intensely.<br/><br/>Such a powerful existence like divination consumed the energy of the divination lamp very quickly.<br/><br/>In just a few seconds, it would be depleted!<br/><br/>“Attack here!”<br/><br/>Wang Xian immediately instructed mo sha and the rest.<br/><br/>He opened his dragon mouth and 10 beams of light shot towards one direction!<br/><br/>Mo Sha and the rest immediately headed towards one direction as well!<br/><br/>Rumble<br/><br/>The powerful attack made the countless meteorites around them disappear!<br/><br/>The chaotic space around them reappeared in their line of sight.<br/><br/>And the heaven-devouring earth-eating beast disappeared once again!<br/><br/>“HMPH, after more than a year, I can easily use the Netherworld Dragon’s pursuit again!”<br/><br/>Wang Xian snorted coldly and a black hole appeared in front of them.<br/><br/>Wang Xian entered the black hole quickly once again. Mo Sha and the rest followed closely behind him!<br/><br/>“Roar!”<br/><br/>When Wang Xian and the rest entered the black hole.<br/><br/>Located at an extremely distant place, the heaven-devouring beast King could sense the black hole beside him.<br/><br/>This time, he didn’t hesitate at all and opened his huge mouth.<br/><br/>A huge phantom appeared in front of him. He went straight into the huge mouth!<br/><br/>Buzz<br/><br/>When Wang Xian and the rest appeared, the heaven-devouring Beast Emperor disappeared once again!\t\t\t\t\t\t</div>", "images": {}, "success": true}