{"id": 1358, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075158.html", "title": "Chapter 4361 - Chapter 4361: Plan 4360 Failed", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4361 - Chapter 4361: Plan 4360 Failed</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4361: Plan 4360 failed<br/><br/>Translator: 549690339<br/><br/>Buzz<br/><br/>On a planet in the Void universe, the figures of Wang Xian and an lie appeared.<br/><br/>Wang Xian concealed his figure and nodded at an lie.<br/><br/>After an lie left, Wang Xian sensed his surroundings.<br/><br/>He was currently on a planet in the Void Universe.<br/><br/>His figure moved and Wang Xian immediately flew forward.<br/><br/>It wasn’t Wang Xian’s first time in the Void Universe. The last time, he wreaked havoc in the Void universe.<br/><br/>Wang Xian could be said to know the Void universe like the back of his hand.<br/><br/>The soul capturing technique had obtained a large amount of information. He was also familiar with this piece of space!<br/><br/>His body moved and Wang Xian quickly headed toward the center of the Void Universe.<br/><br/>At the center of the Void Universe, the palace of the Void dynasty was completely destroyed by Wang Xian. He didn’t know if it was repaired yet!<br/><br/>I need to check the recent situation of the Void Universe<br/><br/>Wang Xian thought to himself as he flew toward the strongest planet nearby.<br/><br/>On that planet, there was a teleportation that led to the center.<br/><br/>After Wang Xian arrived, he had a thought and sensed the strongest person on this planet. Following that, he obtained some information using the soul capturing technique.<br/><br/>After the palace of the Void dynasty was destroyed the last time, the king of void reconstructed it.<br/><br/>Currently, the Palace of the Void Dynasty had been rebuilt!<br/><br/>As for other information, Wang Xian did not get it.<br/><br/>“I still have to go to the palace of the Void dynasty to get the information from there!”<br/><br/>Wang Xian thought to himself.<br/><br/>Wang Xian wanted to know where the heaven origin blessed realm powerhouses in the Void universe were.<br/><br/>Especially where the king of Void was.<br/><br/>If he could find out, Wang Xian and the rest would be able to capture the king of Void first.<br/><br/>They would kill the King of Void first.<br/><br/>Then, everything would be much simpler!<br/><br/>Wang Xian thought to himself as he arrived at the teleportation formation on this planet and teleported to the planet closest to the Void dynasty.<br/><br/>After the teleportation.<br/><br/>Wang Xian flew to the top of the planet and looked ahead.<br/><br/>The majestic and magnificent palace of the Void dynasty was restored once again.<br/><br/>“Hehe!”<br/><br/>Wang Xian looked at the palace and revealed a smile on his face!<br/><br/>More than ten days later, Wang Xian flew into the palace of the Void dynasty in the form of a middle-aged man.<br/><br/>This middle-aged man was a powerhouse of the Heaven’s origin realm in the Void Dynasty and a descendant of Duke Kong Jing Kong.<br/><br/>Wang Xian entered the palace easily with this identity.<br/><br/>Following that, Wang Xian started to search for information in the palace!<br/><br/>Wang Xian didn’t dare to touch the heaven-origin creation stage powerhouse here directly. However, Wang Xian could easily capture the souls of those below the heaven-origin creation stage.<br/><br/>He could obtain all information about them.<br/><br/>Due to the power of chaos, the investigation methods in the palace of the Void Dynasty couldn’t discover him at all.<br/><br/>Now, the strength of the Palace of the Void dynasty was a level lower than before.<br/><br/>The powerful array formation had been destroyed by Wang Xian back then, and it had yet to be completely restored!<br/><br/>Perhaps even the king of Void did not expect Wang Xian to sneak into the palace of their dynasty again.<br/><br/>“I have obtained information on a few Tianyuan blessed realm powerhouses in the Void dynasty, but I have not obtained any information on the king of Void.”<br/><br/>Wang Xian mumbled.<br/><br/>Under his senses, he could not sense the king of Void’s aura in the palace.<br/><br/>He did not know where the king of Void had gone.<br/><br/>However, Wang Xian was not in a hurry.<br/><br/>He still had injuries on his body. As he searched for information, he healed his injuries.<br/><br/>However, tens of millions of years had passed.<br/><br/>Wang Xian had used up some resources. His injuries were more than half healed, but there was still no news about the king of Void.<br/><br/>This made him frown slightly.<br/><br/>“For an existence at the Heaven’s origin level, sometimes a closed-door cultivation would take hundreds of millions of years. If this fellow is really in closed-door cultivation, I would have wasted too much time.”<br/><br/>Wang Xian mumbled and frowned slightly.<br/><br/>However, Wang Xian was certain that the heaven’s origin level powerhouses from the Void Empire should know the location of the king of Void.<br/><br/>There were four strong practitioners of the Heaven’s origin realm in the palace of the Void Dynasty.<br/><br/>“The upgrade of the demonic fiend inherits everything from the demonic man. Therefore, his parasitic means have been greatly reduced. He can’t parasitize a strong practitioner of the Heaven’s origin realm, and neither can his soul-absorbing power.”<br/><br/>“Unless he is threatened. However, the probability of obtaining information through coercion is too low.”<br/><br/>Wang Xian felt helpless.<br/><br/>The lamp of divination was used for divination. Such a powerful existence could not be divined at all.<br/><br/>In the next million years, Wang Xian still did not have any information on the king of Void.<br/><br/>In the end, Wang Xian did not plan to waste any more time.<br/><br/>Time was very precious to Wang Xian.<br/><br/>If he were to open the primal chaos stone, it was enough to make a disciple of the Dragon Palace reach a bottleneck!<br/><br/>He called an lie over and returned to the Great Dao of heaven.<br/><br/>There was nothing he could do. Without any information on the king of Void, it would not be of much significance if he were to make a move at this time.<br/><br/>It would not be too much of a blow to the Void universe.<br/><br/>“Dragon King, how is it?”<br/><br/>The Fallen Shadow Demon Emperor sensed the arrival of Wang Xian and flew over to ask.<br/><br/>“The king of Void is not in the Void universe. This is a very thorny problem. If we can’t destroy the king of Void, even if we can conquer the void universe, it won’t be of much significance.”<br/><br/>Wang Xian shook his head and said helplessly.<br/><br/>“The king of Void?”<br/><br/>The Shadow Devil Emperor heard Wang Xian’s message, a pensive look appeared on his face. “Dragon King, most of the active areas of our neutral universes are in the land of origin. The battles, battles, and conquests of the various universes are all around the land of origin. The king of Void doesn’t have any children in the Void universe. It should be around the land of origin.”<br/><br/>“If we can find the king of Void, the problem will be even simpler. As long as we destroy the king of Void, everything else will be very simple.”<br/><br/>Wang Xian spoke.<br/><br/>“I know an expert who can divine the universe from the low origin. Let’s see if he can help.”<br/><br/>The Fallen Shadow Demon Emperor pondered for a moment before speaking!<br/><br/>“Alright, you can ask. Even if there is a price to pay, as long as it is within reason, it is fine.”<br/><br/>Wang Xian said!<br/><br/>The Fallen Shadow Demon Emperor nodded his head.<br/><br/>The matter of conquering the Void universe was not as smooth as Wang Xian had imagined.<br/><br/>This also made him very helpless.<br/><br/>It all depended on whether the fallen shadow demon Emperor had any results.<br/><br/>If the fallen Shadow Demon Emperor did not have any results, then the matter of temporarily attacking the Void universe could only be put on hold.<br/><br/>Perhaps only after Wang Xian’s strength had improved would he be able to invade again.<br/><br/>“I hope there will be good news.”<br/><br/>Wang Xian thought to himself.<br/><br/>Since his plan had failed once, Wang Xian could only nurture the disciples of the Dragon Palace again.<br/><br/>He summoned the primal chaos stone and allowed the disciples of the Dragon Palace to cultivate inside.<br/><br/>However, tens of millions of years later, the Fallen Shadow Devil Emperor suddenly received a piece of news.<br/><br/>A message from the Void King…\t\t\t\t\t\t</div>", "images": {}, "success": true}