{"id": 1352, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075134.html", "title": "Chapter 4355 - Chapter 4355: 4354 Heaven-Swallowing Earth-Eating Beast Emperor", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4355 - Chapter 4355: 4354 Heaven-Swallowing Earth-Eating Beast Emperor</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4355: 4354 heaven-swallowing earth-eating Beast Emperor<br/><br/>Translator: 549690339<br/><br/>“Heaven-swallowing earth-eating Beast Emperor?”<br/><br/>Wang Xian’s eyes flickered when he heard Hun Dun’s words.<br/><br/>He did not expect to meet a top-notch Beast Emperor of a space beast here.<br/><br/>One of the three Great Dao existences!<br/><br/>“Has he just stepped into the Great Dao level, or has he stepped into it for a long time?”<br/><br/>Wang Xian asked Hun Dun.<br/><br/>“The heaven-swallowing earth-eating Beast Emperor is not the oldest of the three beast emperors. It broke through more than 20 billion years ago. As for how strong it is, we don’t know!”<br/><br/>Hun Dun said, “When the calamity first arrived, the heaven-swallowing earth-eating Beast Emperor left the starry universe and went out to eat. It can devour any object with energy to increase its strength. Among the starry beasts, it is very ferocious and brutal. It mainly eats.”<br/><br/>“Liu Lan, Wangtian, do you guys think this starry beast is injured?”<br/><br/>Wang Xian asked Liu Lan and Wangtian to confirm.<br/><br/>“There is a very long wound on its body. The wound is very deep. It should have been cut by a sword.”<br/><br/>Wangtian nodded and confirmed.<br/><br/>“Dragon King, if it was the heaven-swallowing earth-eating beast emperor at its peak, it would be difficult for us to completely destroy it. However, if it is in an injured state now, we have a chance to completely kill it!”<br/><br/>Hun Dun’s eyes sparkled as he suggested to Wang Xian!<br/><br/>“It’s a space beast of the Great Dao level. It’s almost a top-notch existence in Hun Dun.”<br/><br/>Mo Sha’s eyes also sparkled with a fiery glow. He looked at Wang Xian and waited for his orders!<br/><br/>“Hehe, that’s true.”<br/><br/>Wang Xian nodded. His gaze swept past Liu Lan and Wang Xian. “Bring us there and see if we can destroy it!”<br/><br/>“It’s the Dragon King!”<br/><br/>Liu Lan and Wang Xian’s gaze was a little absent-minded when they heard what Wang Xian said.<br/><br/>Just now, they were worried that the Dragon King would be able to deal with the giant beast.<br/><br/>However, the Dragon King and the rest were already considering how to completely destroy it!<br/><br/>They felt that they could no longer keep up with the Dragon King and the Rest’s strength and rhythm!<br/><br/>“Lead the way. An Lie, you and Hun Dun Xiao Lan will stay here for now. Wait for me to set up the Devil Spirit Altar and bring them here!”<br/><br/>Wang Xian instructed an lie who was still on Hun Dun!<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded.<br/><br/>“Dragon King, this way!”<br/><br/>Liu Lan and Wang Xian immediately led the way!<br/><br/>“Brother-in-law, can we go over and take a look?”<br/><br/>Long Yinhao’s eyes were filled with anticipation as he hurriedly spoke to Wang Xian!<br/><br/>“Hunting a space behemoth of the Great Dao level. In a battle of this level, you will be gone with just a sweep of your energy. If you want to take a look, you can teleport to a teleportation formation that is close to you. At least three to four countries of magic are apart. Don’t go to the center. If there is a situation, escape immediately!”<br/><br/>“Otherwise, you will lose your life. Think about it yourself, Kid.”<br/><br/>Wang Xian said to long yinhao!<br/><br/>“Don’t worry, brother-in-law. I know this. Just watch from afar!”<br/><br/>Long Yinhao replied quickly!<br/><br/>Wang Xian nodded and nodded to long yinyin as well. Then, he followed Liu Lan and the rest into the teleportation formation!<br/><br/>Buzz<br/><br/>Liu Lan, Wang Wangtian, and the rest had been paying attention to the movements of the heaven-devouring Earth Beast Emperor.<br/><br/>With his huge body, there were traces of him wherever he was in the communication device!<br/><br/>“Roar!”<br/><br/>“Roar!”<br/><br/>When they were teleported to a magical kingdom, the roar of the heaven-devouring Earth Beast Emperor rang out in front of them!<br/><br/>“Run! Run!”<br/><br/>“The teleportation formation over there has been destroyed. We can’t escape. We can’t escape at all!”<br/><br/>“No, no, no. I don’t want to die. I don’t want to Die!”<br/><br/>Terrified voices could be heard from all directions.<br/><br/>The speed of the heaven-devouring beast was too fast. Many of the strong disciples had no time to escape.<br/><br/>Moreover, when he arrived at a place where all the living beings gathered, the ordinary teleportation formation would collapse due to the vibration of the energy.<br/><br/>Wang Xian and the rest came over from a secret and special teleportation formation. This teleportation formation that Liu Lan, Wang Wang Tian, and the rest had personally set up was much stronger!<br/><br/>Looking Ahead, an extremely huge astral beast was opening its huge mouth and devouring everything!<br/><br/>Living beings were like ants in front of him!<br/><br/>The moment he opened his mouth, countless living beings were devoured by him.<br/><br/>“In such a short period of time, he has devoured at least a dozen countries of Magic!”<br/><br/>When Liu Lan Wangtian saw the heaven-swallowing earth-eating beast emperor in front of him, his face turned extremely pale.<br/><br/>Faced with such a huge beast, he was really terrified!<br/><br/>Wang Xian moved his body and flew to the sky.<br/><br/>Looking over, his gaze landed on the horrifying wound on the body of the heaven-swallowing earth-eating Beast Emperor.<br/><br/>The injury was not light!<br/><br/>Wang Xian immediately made a judgment in his heart. His eyes shone brightly.<br/><br/>If it was a cosmic beast at its peak, it would probably require five to six of the same level to kill it.<br/><br/>However, it was obvious that the heaven-swallowing earth-eating beast emperor was seriously injured. Therefore, this was an opportunity for Wang Xian and the rest!<br/><br/>The strength of Wang Xian and the rest was comparable to four existences at the Great Dao level!<br/><br/>There was a huge chance!<br/><br/>He waved his arm and set up a devil spirit altar!<br/><br/>“Mo Sha, bei Shuang, all of you attack immediately. Use all of your strength. This time, try to leave him here completely!”<br/><br/>“Liu Lan has no hope. All of you attack as well.”<br/><br/>Wang Xian immediately ordered them!<br/><br/>“Yes!”<br/><br/>Mo Sha and the rest responded immediately.<br/><br/>Buzz! Buzz! Buzz<br/><br/>At this moment, an lie brought along Xiao Lan and Hundun as well!<br/><br/>“An lie, teleport us to the sky above the heaven-devouring Earth Beast Emperor!”<br/><br/>When Wang Xian saw them arriving, he immediately ordered an lie!<br/><br/>“It’s the Dragon King!”<br/><br/>An lie responded immediately and teleported with them!<br/><br/>Roar! Roar<br/><br/>When Wang Xian and the rest came out from the teleportation formation, the heaven-devouring Earth Beast Emperor had sensed them!<br/><br/>However, as Wang Xian had concealed his strength with the power of Chaos, the heaven-swallowing earth-eating Beast Emperor did not feel threatened!<br/><br/>“Attack!”<br/><br/>“Roar!”<br/><br/>“Roar!”<br/><br/>When Wang Xian and the rest appeared in the sky above the heaven-swallowing earth-eating Beast Emperor!<br/><br/>Wang Xian immediately transformed into his gigantic body of a divine dragon.<br/><br/>Even though he had transformed into the body of a divine dragon, he was still very small in front of him.<br/><br/>However, the power that Wang Xian exuded was much stronger than the heaven-swallowing earth-eating Beast King!<br/><br/>“Eight Dragon Pillars!”<br/><br/>Wang Xian did not hesitate. Eight Dragon Pillars appeared directly and attacked the heaven-swallowing earth-eating Beast King!<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Woo! Woo! Woo!”<br/><br/>Bei Shuang and the rest immediately transformed into the huge body of a divine dragon.<br/><br/>They roared and attacked the Heaven Devouring Earth Beast Emperor Below!<br/><br/>In an instant, all sorts of powerful attacks descended!<br/><br/>Liu Lan and Wang Wangtian’s eyes shone with a cold light as they attacked with all their might!\t\t\t\t\t\t</div>", "images": {}, "success": true}