{"id": 1357, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075154.html", "title": "Chapter 4360 - Chapter 4360: 4,359, Get Ready", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4360 - Chapter 4360: 4,359, Get Ready</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4360: 4,359, get ready<br/><br/>Translator: 549690339<br/><br/>Little White’s breakthrough was very smooth.<br/><br/>The 11th Heaven origin creation realm expert of the Dragon Palace was born.<br/><br/>The strength of the entire Dragon Palace was already very terrifying!<br/><br/>Thinking about the current nine-origin universe, how many heaven origin creation realm experts were there?<br/><br/>Two from the demon race, one from the ELF race, one from the angel race, one from the Divine Tiger race, one from the black tortoise race, one from the voodoo race, one from the skeleton race, and two from the saint race.., one Nether, one celestial nation, and one Royal!<br/><br/>In total, there were only thirteen of them!<br/><br/>Furthermore, the celestial nation and the skeleton race, the Divine Tiger, were the top races. They were led by the Dragon Palace.<br/><br/>“Mo Sha, let’s go back. Let’s raise your strength to the peak level of the demons. Bei Shuang, you guys go back first. In the near future, prepare for a big battle!”<br/><br/>When Wang Xian saw Xiao Bai’s breakthrough, his eyes flashed as he spoke to Mo Sha and the rest!<br/><br/>“It’s the Dragon King!”<br/><br/>Bei Shuang and the rest nodded.<br/><br/>Wang Xian left with Mo Sha.<br/><br/>In front of Mo Sha was the universe. He brought a portion of the corpse of the heaven-devouring Earth Beast Emperor to recover his strength.<br/><br/>Wang Xian came to the Great Dao of heaven.<br/><br/>He sat cross-legged and opened the primal chaos stone to recover from his injuries.<br/><br/>He also allowed the disciples of the Dragon Palace to cultivate inside.<br/><br/>Time passed day by day.<br/><br/>Buzz Buzz<br/><br/>A few million years later, a piece of good news came from Mo Sha!<br/><br/>His strength had recovered to the peak of the demonic humans.<br/><br/>When the demonic humans were at their peak, they were comparable to one of the weakest Great Dao realm cultivators and two of them were at the beginner level!<br/><br/>Their strength was not weak!<br/><br/>With the corpse of the Great Dao Level Space Beast, the Demonic Fiend’s strength increased very quickly.<br/><br/>After all, there were no shackles. As long as there were sufficient resources, he would be able to recover.<br/><br/>The corpse of the Space Beast was a treasure to recover his strength!<br/><br/>When Wang Xian received this news, his eyes sparkled.<br/><br/>Since the Demonic Fiend had reached the Great Dao level, it also meant that the Dragon Palace had produced a Second Great Dao level existence.<br/><br/>Now, with their strength, they could totally attack and conquer the starry universe!<br/><br/>“The king of the void in the starry universe is at the level of one Great Dao, one control level, and two beginner levels.”<br/><br/>Wang Xian thought to himself.<br/><br/>He was comparable to two Great Dao levels while the demonic fiend was comparable to one great dao and two beginner levels. The abilities of the Fallen Shadow Demon Emperor and the demonic fiend should be about the same!<br/><br/>The probability of them wanting to completely destroy the king of Void was at 90% .<br/><br/>The probability of success was less than 100% . This was because spatial attribute experts had their own unique abilities when it came to escaping.<br/><br/>However, the probability of this happening was already extremely high!<br/><br/>Wang Xian pondered in his heart.<br/><br/>Other than the king of Void, there were also 11 heaven origin blessed realm experts in the Void Universe.<br/><br/>Among them, there were four existences at the control level.<br/><br/>If a huge battle broke out, these four existences at the control level would need to be dealt with by experts or even killed.<br/><br/>On Wang Xian’s side, there were the elven empress, the ancestor of the Netherworld race, the ancestor of Xuanwu, the twelve ancestor warlocks, and the others who were at the beginner level.<br/><br/>“If we were to face them head-on, the Void universe might be attacked by the nine-origin universe. They might escape.”<br/><br/>Wang Xian thought to himself.<br/><br/>It was very difficult to kill all the enemies head-on.<br/><br/>It was a good choice to kill them one by one.<br/><br/>However, killing them one by one required a detailed understanding of the experts in the Void Universe!<br/><br/>“Before the big battle, I need to investigate the situation in the Void Universe.”<br/><br/>Wang Xian thought to himself.<br/><br/>Putting everything aside, if there was an opportunity, it would be the best choice to kill the King of Void first.<br/><br/>After killing him, the rest could be easily killed one by one.<br/><br/>“If I want to investigate the king of Void, it’s best to go there by myself.”<br/><br/>Wang Xian thought to himself.<br/><br/>He possessed the space attribute and had the power of chaos to conceal his aura. Even the king of Void would not be able to discover him!<br/><br/>“Fallen Shadow Demon Emperor.”<br/><br/>With this thought in mind, Wang Xian came to the palace at the side.<br/><br/>Sensing the information of Fallen Shadow Demon Emperor, he shouted.<br/><br/>“Huh? Dragon King!”<br/><br/>Fallen Shadow Demon Emperor looked at Wang Xian and immediately went up to him.<br/><br/>“There’s something I want to talk to you about.”<br/><br/>Wang Xian said with a smile.<br/><br/>“Dragon King, just say it!”<br/><br/>Fallen Shadow Demon Emperor said with a smile.<br/><br/>“I’m prepared to launch an all-out attack on the Void Universe in the near future to end the past grudges.”<br/><br/>Wang Xian spoke as his eyes sparkled.<br/><br/>“Attack the void space in an all-out manner?”<br/><br/>The Fallen Shadow Demon Emperor’s eyes narrowed slightly. “Dragon King, are you confident?”<br/><br/>“Yes. With our current strength, we can suppress the king of Void to death. There is even a 20-30% chance of killing him. However, our Dragon Palace has added another great dao existence. There is a 90% chance of killing the king of Void!”<br/><br/>Wang Xian spoke!<br/><br/>“The Dragon Palace has produced an existence at the level of the Great Dao? This? ?”<br/><br/>The Fallen Shadow Demon Emperor widened his eyes in disbelief.<br/><br/>“Due to a special opportunity, I obtained the embryo of an expert who was possessed by a parasite. Hehe.”<br/><br/>Wang Xian smiled. “Don’t tell anyone about this, fallen Shadow Demon Emperor.”<br/><br/>“I know, I know!”<br/><br/>Fallen Shadow Demon Emperor was still in shock. The Dragon King’s strength was already very terrifying.<br/><br/>In addition, the Dragon Palace now had another existence at the Great Dao level. The current Dragon Palace was able to exterminate their demon race.<br/><br/>The speed of their growth was too fast!<br/><br/>“I plan to go to the Void universe to gather some information. If the time is right, I will start a war.”<br/><br/>Wang Xian spoke and continued!<br/><br/>“If you, Dragon King, have such strength, we can totally destroy the entire void universe!”<br/><br/>The Fallen Shadow Demon Emperor spoke with excitement, his eyes bursting with murderous intent.<br/><br/>During the previous few Apocalypses, the Void universe had slaughtered countless beings and disciples from the nine-origin Universe!<br/><br/>This hatred was etched in the hearts of every powerhouse from the nine-origin universe.<br/><br/>All of them wanted to take revenge one day.<br/><br/>However, the strength of the Void Universe had always been too strong.<br/><br/>This time, the rise and power of the Dragon Palace had brought this opportunity.<br/><br/>The Fallen Shadow Demon Emperor was very excited!<br/><br/>“It’s fine if we don’t make a move. Once we do, we will completely destroy the Void universe and make the king of void disappear forever. Therefore, we must be fully prepared!”<br/><br/>Wang Xian’s eyes sparkled as he spoke.<br/><br/>The Fallen Shadow Demon Emperor nodded. “Then, I will wait for your information. As long as you say yes, the rest of the experts in the nine-origin universe can fight at any time!”<br/><br/>“Alright!”<br/><br/>Wang Xian nodded and smiled.<br/><br/>After discussing some details with the fallen shadow demon emperor, Wang Xian left.<br/><br/>My injuries have yet to recover. However, I can still search for information and recover at the same time<br/><br/>Wang Xian thought to himself and called an lie over.<br/><br/>An lie could bring him directly to the Void Universe!\t\t\t\t\t\t</div>", "images": {}, "success": true}