{"id": 1353, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075138.html", "title": "Chapter 4356 - Chapter 4356: 4355 On The Space Beast Of The Hunting Great Dao", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4356 - Chapter 4356: 4355 On The Space Beast Of The Hunting Great Dao</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4356: 4355 on the space beast of the Hunting Great Dao<br/><br/>Translator: 549690339<br/><br/>“Boom Boom Boom!”<br/><br/>In an instant, countless attacks attacked the Heaven and Earth Devouring Beast Emperor below.<br/><br/>Below, the incomparably huge heaven and Earth Devouring Beast Emperor sensed these terrifying attacks. It raised its head and revealed an expression of shock and anger.<br/><br/>Its pupils emitted an intense luster. It opened its huge mouth and directly spat out a strange space.<br/><br/>It seemed to have spat out a space from its mouth.<br/><br/>Meanwhile, the body of the heaven-swallowing earth-eating beast emperor strangely shifted to an extremely distant position at the back.<br/><br/>Wang Xian and the rest’s attacks all missed!<br/><br/>“Huh?”<br/><br/>Wang Xian’s eyes narrowed slightly when he saw this move of the heaven-swallowing earth-eating Beast Emperor.<br/><br/>His body moved and instantly moved to the front of the heaven-swallowing earth-eating Beast Emperor!<br/><br/>“Roar! Roar! Roar!”<br/><br/>When the heaven-swallowing earth-eating beast emperor saw that Wang Xian was attacking him again, it let out an angry roar.<br/><br/>It opened its mouth and spat out the teeth formed from energy. It charged toward Wang Xian.<br/><br/>Wang Xian opened his dragon mouth and slashed out terrifying swords of light.<br/><br/>“Bang! Bang! Bang!”<br/><br/>The intense sounds of collision rang out. The teeth that contained powerful attack power were directly cut off.<br/><br/>Numerous swords of light continued to attack the heaven-swallowing earth-eating beast emperor.<br/><br/>Numerous swords of light landed on its body, leaving many scars.<br/><br/>“Roar!”<br/><br/>The heaven-swallowing earth-eating Beast Emperor was in pain. It shook its huge body and wanted to escape.<br/><br/>It could sense Wang Xian’s strength and could sense that it was not Wang Xian’s match.<br/><br/>“Nine-origin Dragon Realm!”<br/><br/>When Wang Xian saw the heaven-swallowing earth-eating beast emperor trying to escape, his eyes narrowed. The nine-colored Divine Dragon Realm covered it!<br/><br/>At the same time, chains were wrapped around the heaven-swallowing earth-eating Beast Emperor!<br/><br/>The divination lamp was hovering by his side, performing divination!<br/><br/>“Attack!”<br/><br/>“Divine Dragon’s Breath!”<br/><br/>Beisheng Mosha and the rest also rushed over quickly.<br/><br/>Beishou and the rest of the divine dragons spat out terrifying dragon’s breath and attacked the heaven-swallowing earth-eating beast emperor.<br/><br/>“Demon’s curse, tear!”<br/><br/>Mosha stared at the wound of the heaven-swallowing earth-eating beast emperor and streams of black energy flew towards it.<br/><br/>When the black energy met the wound, it transformed into a ferocious claw and began to tear the wound and corrode it!<br/><br/>“Attack with all your might!”<br/><br/>Wang Xian predicted from the divination lamp that the heaven-devouring beast emperor would not use any means to escape in the short term. He immediately roared loudly!<br/><br/>In the sky above him, a gigantic leader swooped down and charged at the heaven-devouring Beast Emperor!<br/><br/>“Woo Woo!”<br/><br/>Xiao Lan and the rest opened their mouths and let out roars.<br/><br/>The gray energy on their bodies condensed into countless fish.<br/><br/>Each fish had sharp thorns that were hundreds of meters long!<br/><br/>Chaos also used his innate ability.<br/><br/>The two tentacles above his head shone.<br/><br/>Mountains were pressing down on the heaven-devouring Beast Emperor!<br/><br/>All kinds of attacks were coming!<br/><br/>“Roar!”<br/><br/>“Roar!”<br/><br/>The heaven-devouring Beast Emperor felt the threat and opened his mouth.<br/><br/>His mouth seemed to have turned into an abyss in an instant, devouring all the attacks!<br/><br/>Be It Wang Xian’s attacks or Mo Sha’s attacks, all of them fell into his abyss mouth.<br/><br/>“Roar!”<br/><br/>After devouring, he let out a painful sound.<br/><br/>A large amount of blood oozed out from the wound on his back. It was a little more serious.<br/><br/>However, these injuries were not fatal!<br/><br/>“HMM? He actually absorbed all the attacks directly and only suffered a little damage?”<br/><br/>Wang Xian’s expression changed slightly when he saw this scene.<br/><br/>This space beast indeed had a strong vitality.<br/><br/>It was able to absorb the attacks that were four times stronger than its own body!<br/><br/>“Kill!”<br/><br/>Wang Xian shouted in a low voice. He shook his gigantic dragon tail and attacked the heaven-swallowing Earth Beast Emperor once again.<br/><br/>On his dragon tail, the energy of the Tai Chi Dragon Disc and the five elements millstone rotated and stacked on top of each other!<br/><br/>“Roar!”<br/><br/>When the heaven-swallowing Earth Beast Emperor saw this attack, it let out a loud roar in shock and anger. It opened its mouth and bit towards the void at the side.<br/><br/>The void at the side was directly bitten into his mouth.<br/><br/>Following that, he threw it at Wang Xian’s attack.<br/><br/>The dragon tail swept across the void. Wang Xian instantly felt that his attack seemed to hit the air.<br/><br/>And the heaven-swallowing earth-eating Beast Emperor seemed to be in a different space from him!<br/><br/>“Attack the right side with all your strength. Attack the place I marked!”<br/><br/>At this moment, Wang Xian used the divination lamp to divine that the heaven-swallowing earth-eating Beast King wanted to escape. He immediately gave the order.<br/><br/>At the right side of Wang Xian’s Mark, a bright spear appeared and pierced towards that direction!<br/><br/>Mo Sha and the rest followed the order and attacked that location as well.<br/><br/>When they launched their attack, the body of the heaven-swallowing earth-eating Beast King had already appeared there strangely.<br/><br/>It spat out a strange void, and its attack method was very strange.<br/><br/>“Bang! Bang! Bang!”<br/><br/>However, under the divination lamp’s prediction, this attack directly landed on its enormous body.<br/><br/>This caused a large number of wounds to appear on the body of the heaven-devouring Beast Emperor!<br/><br/>“Ao! Ao! Ao!”<br/><br/>The heaven-devouring Beast Emperor was a little crazy. He stared at Mo Sha and the others with a dense gaze.<br/><br/>He opened his mouth.<br/><br/>An incomparably huge mouth enveloped mo sha and the rest.<br/><br/>“Be careful. This move of his is very terrifying. We were instantly swallowed by this move of his.”<br/><br/>Liu Lan Wangtian was shocked when he saw this move. He immediately roared loudly!<br/><br/>“Don’t be afraid. Gather together and defend together!”<br/><br/>Mo sha shouted loudly and gathered everyone together. Xu Ying in his body expanded and enveloped everyone within it.<br/><br/>Bei Shuang and the rest immediately unleashed their defenses.<br/><br/>“HMPH, you have many tricks up your sleeve. However, you will die today!”<br/><br/>Wang Xian stared at the heaven-swallowing earth-eating beast emperor with a grim expression. He waved his dragon claws and clawed at it.<br/><br/>The gigantic dragon claws landed on the body of the heaven-swallowing earth-eating Beast Emperor.<br/><br/>Streams of energy circulated around its body and blocked Wang Xian’s attack.<br/><br/>However, this heaven-swallowing earth-eating beast emperor was much weaker than Wang Xian.<br/><br/>It was easier said than done to block it.<br/><br/>A large number of wounds appeared on his body once again!<br/><br/>“Roar! Roar!”<br/><br/>He let out a cry from his pupils again!<br/><br/>His pupils revealed a look of horror!<br/><br/>“Roar!”<br/><br/>He raised his head and a huge mouth that seemed to be able to devour the world appeared!<br/><br/>The huge mouth enveloped Wang Xian and the rest!<br/><br/>Even the real body of the heaven-devouring earth-devouring beast emperor was enveloped by the huge mouth!<br/><br/>The world turned dark as if everything was being devoured!<br/><br/>Wang Xian stared at this strange attack and looked at the divination lamp!<br/><br/>“Attack its real body!”<br/><br/>Wang Xian shouted and continued to give orders to Mo Sha and the rest.<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom<br/><br/>All kinds of attacks were directed at the main body of the heaven-devouring earth-devouring beast!<br/><br/>Bang! Bang! Bang<br/><br/>The attacks landed on his body, causing more and more wounds to appear on his body.<br/><br/>However, at this moment, Wang Xian felt that the world had turned dark.<br/><br/>The heaven-devouring earth-devouring beast king in front of him had mysteriously disappeared!\t\t\t\t\t\t</div>", "images": {}, "success": true}