{"id": 1356, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075150.html", "title": "Chapter 4359 - Chapter 4359: 4358, A Huge Harvest!", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4359 - Chapter 4359: 4358, A Huge Harvest!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4359: 4358, a huge harvest!<br/><br/>Translator: 549690339<br/><br/>“Dragon King, let me search for the flesh and blood that he escaped from. I have a way.”<br/><br/>Mo Sha spoke to Wang Xian!<br/><br/>He had inherited the ability of the Devil Man and had a special way to search for it.<br/><br/>“Sure, go and search for it. Leave the last piece of flesh and blood alive. I will wait for You Here!”<br/><br/>Wang Xian nodded at Mo Sha.<br/><br/>Mo Sha was powerful enough now. Some things could be shared with him.<br/><br/>“It’s the Dragon King!”<br/><br/>Mo Sha nodded. “Dragon King, you just need to recover your strength here.”<br/><br/>Wang Xian nodded and watched Mo sha leave.<br/><br/>He didn’t recover his injuries here. Instead, he took out the lamp of divination and infused energy into it.<br/><br/>The lamp of divination could divine the location of the heaven-devouring Earth Beast Emperor’s flesh and blood.<br/><br/>If Mo Sha hadn’t finished searching, he would perform another divination.<br/><br/>In case something unexpected happened.<br/><br/>After all, he had paid a huge price to kill the heaven-devouring Beast Emperor!<br/><br/>Of course, this price was still acceptable.<br/><br/>If he didn’t use resources to recover from the injuries in his body, he would be able to fully recover in a hundred million years.<br/><br/>Hundreds of millions of years was acceptable.<br/><br/>However, this injury was quite serious.<br/><br/>However, it was nothing compared to his gains.<br/><br/>After injecting some energy into his body, Wang Xian did not refill it immediately.<br/><br/>He transformed into his human form and sat cross-legged on the ground to treat the wounds on his body!<br/><br/>“This cosmic beast of the Great Dao level is really hard to kill. It has escaped for such a long distance continuously. Even Our Dragon King has to pay a price in order to pursue it!”<br/><br/>“Our Dragon King’s strength is comparable to two Heaven and Earth Devouring Beast Kings, but it’s still very difficult to kill a Great Dao Space Beast.”<br/><br/>“However, our harvest this time is very huge. I wonder if this harvest will allow our Dragon King’s strength to increase again.”<br/><br/>“Even if it’s not enough, it’s almost enough.”<br/><br/>At the side, the leader of the northern frost water tribe, leader Huo, and the others were discussing with smiles on their faces.<br/><br/>As for Liu Lan and hopeless heaven, they were even more shocked.<br/><br/>“This is the Dragon King, this is the Dragon Palace.”<br/><br/>Liu Lan sighed slightly.<br/><br/>Too Strong.<br/><br/>This time, if it weren’t for the Dragon King and the others, the entire sword and magic universe would have been ravaged.<br/><br/>At most, they would lead some disciples to escape and return after the space beast left.<br/><br/>However, this was only the beginning of the apocalypse.<br/><br/>Whether there would be any crisis later, they could not predict it at all.<br/><br/>Nor could they resist it.<br/><br/>“If the Dragon King can always protect us and give all the spots in our universe to the Dragon King and the others, we can also accept it.”<br/><br/>Liu Lan spoke.<br/><br/>Hopeless Heaven nodded in agreement this time, after thinking for a moment, he said, “I think we can raise Yin Yinhao and the others to the point of breaking through the shackles. With the Dragon King’s strength, we can totally find a space for her to break through. In the future, with the dragon roars and Yin Yinhao and the others, the Dragon King will not ignore our matters.”<br/><br/>“Indeed.”<br/><br/>Liu Lan nodded.<br/><br/>They decided in their hearts that they would train Yin Yin and long Yinhao well in the future.<br/><br/>Especially Yin Yin.<br/><br/>The Dragon Palace powerhouse who could easily destroy them would respectfully call Yin Yin the Dragon Queen.<br/><br/>Yin Yin’s status in the Dragon King’s heart was very high.<br/><br/>In addition, Yin Yin was a person in their universe.<br/><br/>Liu Lan and Wang Xian were deep in thought as they transmitted their voices.<br/><br/>Mo Sha used a secret technique to chase after the flesh of the heaven-devouring Earth Beast Emperor.<br/><br/>Mo Sha only returned a year later!<br/><br/>“Dragon King, this is the last piece of flesh that has life. Take a look.”<br/><br/>Mo Sha took a piece of flesh and handed it over.<br/><br/>Wang Xian opened his eyes and nodded. He used the divination lamp to perform a divination.<br/><br/>“Yes, the last piece of flesh!”<br/><br/>He stood up and smiled. “Let’s go back to the starry universe. We have gained a lot this time.”<br/><br/>This time, not only did they obtain the flesh of a Great Dao level starry beast, but there was also a quota.<br/><br/>“Liu Lan, Wang Xian, let’s go back first. Tell Yin Yin and Yin Hao to advance to the peak of the ruler realm first. When that happens, I will bring them to a place to cultivate and strive to break through within one to two billion years!”<br/><br/>Wang Xian spoke to Liu Lan and Wang Xian.<br/><br/>“It’s the Dragon King. Thank you for your help this time. Otherwise, our sword and magic universe would be finished!”<br/><br/>Liu Lan and the rest immediately expressed their gratitude respectfully.<br/><br/>“No need. Contact me if there’s anything.”<br/><br/>Wang Xian shook his head and released an lie. He gestured to him.<br/><br/>Buzz<br/><br/>Soon, Wang Xian and the rest disappeared.<br/><br/>As for Liu Lan and the rest, they looked at each other and flew toward the universe of swords and magic.<br/><br/>This time, without the Dragon King and the rest, at least three-quarters of the living beings in the entire universe would be gone.<br/><br/>Buzz<br/><br/>In the universe, Wang Xian and the rest came to the territory of Chaos!<br/><br/>“Xiao Bai, prepare to break through!”<br/><br/>Wang Xian looked at Xiao Bai in the distance and shouted at him!<br/><br/>“Woo Woo!”<br/><br/>When Xiao Bai heard Wang Xian’s words, he let out an excited roar and rushed over while swaying his huge body.<br/><br/>“Dragon King, can I break through now?”<br/><br/>Xiao Bai asked excitedly.<br/><br/>“Yes, you can break through now!”<br/><br/>Wang Xian moved his palm and completely destroyed the flesh and blood of the heaven-swallowing earth-devouring Beast Emperor.<br/><br/>As soon as a spot appeared, Xiao Bai immediately began to make a breakthrough!<br/><br/>Wang Xian stood at the bottom and watched with a smile on his face.<br/><br/>After Xiao Bai made a breakthrough, the number of powerhouses in the heaven-origin creation stage of the Dragon Palace could reach eleven.<br/><br/>I have to let Qingyue nurture another Kun to prepare for the future<br/><br/>Wang Xian thought to himself.<br/><br/>Lan Qingyue’s breakthrough also needed to be carried out in the starry universe. She needed to occupy a spot.<br/><br/>However, Wang Xian was confident about this spot. He even had the chance to obtain two to three spots in the future.<br/><br/>This corpse of a cosmic beast of the Great Dao level. If I were to exchange it for resources, I’m afraid it would still be a little lacking<br/><br/>Wang Xian thought to himself as he pondered in his heart.<br/><br/>He hesitated for a moment and had an idea in his mind.<br/><br/>Taking out one-fifth to one-sixth of the corpse of this cosmic beast of the Great Dao level was enough to allow the demonic fiend’s strength to completely recover to the Great Dao level.<br/><br/>If Mo Sha could restore his strength to the Great Dao level, then Wang Xian would be able to do one thing.<br/><br/>That was to attack the Void Universe!<br/><br/>Completely destroy the Void universe.<br/><br/>With the current strength of the Dragon Palace and the abilities of the Fallen Shadow Devil Emperor and the rest, Wang Xian was confident that he could completely destroy the entire void universe!<br/><br/>By destroying them and obtaining the resources, Wang Xian was 100% confident that he would be able to break through to the peak of the ruler realm.<br/><br/>By then, he would be able to possess the strength of the primal Chaos Realm!<br/><br/>In the entire universe, he was almost invincible!<br/><br/>“Then, I shall first raise the demonic fiend to the level of the demonic humans. After that, I shall prepare for a great battle.”<br/><br/>Wang Xian’s eyes flashed with a cold glint.<br/><br/>Against the enemies of the nine-origin universe, the Void universe, Wang Xian would not show the slightest mercy.<br/><br/>As long as he had the strength and the opportunity, Wang Xian would completely destroy them!\t\t\t\t\t\t</div>", "images": {}, "success": true}