{"id": 1359, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075162.html", "title": "Chapter 4362 - Chapter 4362: 4361 Locked Onto The King Of Void", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4362 - Chapter 4362: 4361 Locked Onto The King Of Void</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4362: 4361 locked onto the king of Void<br/><br/>Translator: 549690339<br/><br/>“Dragon King!”<br/><br/>After Wang Xian received the information about the fallen shadow demon emperor, he immediately rushed over.<br/><br/>The Fallen Shadow Demon Emperor was already welcoming him in the palace.<br/><br/>“Fallen Shadow Demon Emperor, what’s the situation now?”<br/><br/>Wang Xian looked at him and asked expectantly.<br/><br/>The king of Void was related to Wang Xian’s future advancement. Therefore, he was very concerned about this matter.<br/><br/>“Dragon King, according to my divination, I received news from a powerhouse who I have a good relationship with in the universe. The King of Void is currently in another universe. He has taken over that universe now.”<br/><br/>The Fallen Shadow Demon Emperor spoke.<br/><br/>“Oh?”<br/><br/>Wang Xian raised his eyebrows slightly when he heard that.<br/><br/>“In the Void universe, there can only be six powerhouses in the Heavenly Yuan blessed realm at most. For the Void universe to be able to produce so many powerhouses, it is also because they have taken over the slots in other universes. Under normal circumstances, they can only take over the space attribute slots.”<br/><br/>“This time, according to the information I received, due to the loss of the palace of the Void dynasty, they have occupied a universe and are preparing to sell some spots for the powerhouses in the Heavenly Kismet realm in this universe.”<br/><br/>“And the people they are trading with are some powerhouses from the evil sequence faction.”<br/><br/>The Fallen Shadow Devil Emperor gave a detailed introduction to Wang Xian.<br/><br/>“In that universe, other than the king of Void, how many other powerhouses are there?”<br/><br/>Wang Xian continued to ask.<br/><br/>“The exact situation is unknown. However, according to my friend, there are at most three subordinates following him. The King of Void is very powerful. It shouldn’t be too difficult for them to occupy an entire universe.”<br/><br/>The Fallen Shadow Demon Emperor replied.<br/><br/>Wang Xian nodded. With a move of his palm, he took out the divination lamp and divined the authenticity of the news from the Fallen Shadow Demon Emperor.<br/><br/>When the lamp of divination divined, its energy was consumed at a crazy rate.<br/><br/>Obviously, divination would consume a lot of energy if one was an expert in divination.<br/><br/>Fortunately, the lamp of divination divined it.<br/><br/>What he said was true.<br/><br/>“Alright, I will call the demon emperor over. Let’s Get Ready.”<br/><br/>Wang Xian looked at the fallen Shadow Demon Emperor and said.<br/><br/>The Fallen Shadow Demon Emperor nodded. His eyes were flashing with a fiery glow.<br/><br/>In terms of hatred, the fallen Shadow Demon Emperor hated the king of Void even more.<br/><br/>He had experienced two great catastrophes.<br/><br/>Now that he could hunt the king of Void, he was very excited.<br/><br/>“In addition, inform the elven empress and the rest. Also, tell them to be prepared for a great battle at any time. As long as we can hunt the king of void once or twice and reduce his strength, we can start an all-out war.”<br/><br/>Wang Xian continued.<br/><br/>“Alright, Dragon King. We will send them a message at the same time and tell them to be ready!”<br/><br/>The Fallen Shadow Demon Emperor nodded.<br/><br/>After the two of them had arranged everything, Mo Sha was brought over by an lie.<br/><br/>“Let’s Go!”<br/><br/>Following that, the three of them flew rapidly into the vast chaos.<br/><br/>The king of Void was located extremely far away.<br/><br/>Even if Wang Xian and the rest flew over, it would still take them hundreds of thousands of years.<br/><br/>The area he was in was in the direction of the land of origin.<br/><br/>However, there was still a long distance to the land of origin.<br/><br/>Wang Xian asked an lie to bring them to the six paths universe, which could shorten the distance by half.<br/><br/>After that, they quickly rushed towards that universe from the six paths universe.<br/><br/>That universe was called the Qianqiu universe, and it contained ten types of attributes.<br/><br/>Under normal circumstances, a universe with ten types of attributes would be in a worse state if there were no powerhouses guarding it.<br/><br/>It was easy for it to become the target of other powerhouses.<br/><br/>Wang Xian and the rest flew at their fastest speed for 180,000 years before they got close to that universe.<br/><br/>The journey was very long.<br/><br/>“It’s the universe in front of us.”<br/><br/>The Fallen Shadow Demon Emperor looked at the universe in front of him and said.<br/><br/>“I’ll go and check it out. You guys wait for me here.”<br/><br/>Wang Xian said to the fallen Shadow Demon Emperor and the rest.<br/><br/>“Alright, Crush this directly if you have any news. We can go there in an instant.”<br/><br/>The Fallen Shadow Demon Emperor gave Wang Xian a demon circle.<br/><br/>“Alright!”<br/><br/>Wang Xian nodded his head.<br/><br/>He concealed his aura and flew towards the universe in front of him with his aura at the peak of the Overlord realm.<br/><br/>“Even I can’t sense the dragon king’s concealment technique.”<br/><br/>The Fallen Shadow Demon Emperor looked at Wang Xian’s figure and exclaimed in surprise!<br/><br/>“Our Dragon King is very strong and our luck is also very good. Hehe, of course, my luck is also very good. I followed the Dragon King.”<br/><br/>Mo Sha said with a smile.<br/><br/>The Shadow Devil Emperor looked at Mo Sha and shook his head speechlessly.<br/><br/>He had cultivated for more than a hundred billion years before he had the strength he had today.<br/><br/>As for Mo Sha?<br/><br/>From the time he was born until now, he was only more than a hundred million years old.<br/><br/>His strength was about the same as his.<br/><br/>Who was he going to reason with?<br/><br/>Wang Xian entered the universe of a thousand years. He did not reveal his strength at all. Instead, he flew forward with the strength of a ruler at his peak.<br/><br/>His concealment techniques were very strong, but the prerequisite was that he did not expose himself.<br/><br/>The King of Void was a king of the universe and possessed many resources.<br/><br/>To prevent being discovered, it was not a big mistake to be careful.<br/><br/>Halfway through, Wang Xian performed soul control on some living beings and received some news.<br/><br/>A million years ago, the Qianqiu universe was invaded.<br/><br/>In their Qianqiu universe, there were three powerhouses at the control level of the Tianyuan blessed realm and two at the beginner level.<br/><br/>This power was already very powerful.<br/><br/>But unfortunately, they encountered the king of Void and the others.<br/><br/>The king of Void used the power of space to attack and took the lead in killing two control-level powerhouses.<br/><br/>This extermination was the type that was completely eliminated.<br/><br/>The King of Void also had tracking treasures.<br/><br/>After killing two control-level powerhouses, the other powerhouses in the Qianqiu universe immediately led a large number of disciples to flee, not daring to compete with the king of Void and the others.<br/><br/>In the current Qianqiu universe, all living beings knew that their universe had been occupied by other experts.<br/><br/>However, they had no way to do anything about it.<br/><br/>The powerful disciples had already escaped with the heaven origin blessed realm experts.<br/><br/>They were not strong. Entering the vast chaos was simply suicide.<br/><br/>Therefore, they could only stay in the universe and pray for a miracle to happen.<br/><br/>As for whether the king of Void and the others would massacre the entire universe, they were not sure.<br/><br/>It might happen.<br/><br/>It might not happen.<br/><br/>Because once they massacred the entire universe, the experts who escaped might also launch a sneak attack on the Void Universe.<br/><br/>Everything was uncertain.<br/><br/>After Wang Xian received the information, his eyes flickered slightly as he flew straight to the center of the universe.<br/><br/>The King of Void and the others were currently in the Qianqiu universe.<br/><br/>A hundred years later, Wang Xian was close to the center of the Qianqiu universe.<br/><br/>Here, he saw some disciples of the Void universe flying in the surrounding void space.<br/><br/>Wang Xian easily killed one of his disciples and obtained the information through the soul capturing technique.<br/><br/>After that, he continued to fly towards the interior.<br/><br/>Soon, he saw four incomparably huge void pagodas standing in the sky above an extremely huge planet.<br/><br/>Among them, one of the Void Towers was emitting ripples that even rippled the surrounding space.<br/><br/>The aura that belonged to the Tianyuan creation level could be seen at a glance.<br/><br/>That was the Void Tower of the Void King!\t\t\t\t\t\t</div>", "images": {}, "success": true}