{"id": 1355, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075146.html", "title": "Chapter 4358 - Chapter 4358: 4357, Hunting The Great Dao Space Beast", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4358 - Chapter 4358: 4357, Hunting The Great Dao Space Beast</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4358: 4357, hunting the Great Dao Space Beast<br/><br/>Translator: 549690339<br/><br/>“He escaped again?”<br/><br/>Mo Sha and the others saw the Heaven and Earth Devouring Beast Emperor disappear again when they first came out, and a serious expression appeared on their faces.<br/><br/>It was too difficult to kill.<br/><br/>When they joined hands, their strength was already much stronger than the Heaven and Earth Devouring Beast Emperor.<br/><br/>In addition, the Heaven and Earth Devouring Beast Emperor was still injured.<br/><br/>Under such circumstances, he could still continue to escape. His innate skill was too strong.<br/><br/>The ability of the space beast to escape was too strong!<br/><br/>“I can sense where he is. Chase after him!”<br/><br/>The body of the heaven-swallowing earth-eating beast emperor contained the power of wind and thunder.<br/><br/>Wang Xian could sense his location through the lock of wind and thunder.<br/><br/>However, the distance that the heaven-swallowing earth-eating beast emperor could instantly escape was very far. If they wanted to chase after him, they would need at least a few months.<br/><br/>In this time, that Devourer Beast Emperor, may release some flesh and blood, for escape.<br/><br/>The Beast of the stars, though it has no resurrection treasure.<br/><br/>But they can make living flesh escape.<br/><br/>These flesh, if the original survival of the situation, flesh and blood will soon lose vitality.<br/><br/>But if the body dies, the flesh and blood can be reborn.<br/><br/>Wang Xian wanted to kill him completely and obtain a spot in the starry universe.<br/><br/>“Let’s fight it out!”<br/><br/>“Follow me!”<br/><br/>Wang Xian shouted in a low voice. He waved his arm and forcefully used the Netherdragon transformation!<br/><br/>A black hole was opened.<br/><br/>When the black hole was opened, Wang Xian’s body was riddled with wounds.<br/><br/>The wounds were not light!<br/><br/>However, it was totally worth it to be able to kill the heaven-devouring earth-devouring Beast Emperor!<br/><br/>Buzz<br/><br/>Wang Xian instantly entered the black hole.<br/><br/>Mo Sha and the rest followed closely behind!<br/><br/>In another part of the chaos, when the heaven-swallowing earth-eating beast sensed that the black hole was chasing after it again, its body trembled slightly.<br/><br/>The injuries on its body were very serious. It had used its powerful innate skill many times, causing its injuries to worsen.<br/><br/>Now, the enemies at the back were chasing after it again?<br/><br/>“Roar! Roar! Roar!”<br/><br/>The heaven-devouring Beast Emperor let out an angry roar.<br/><br/>Pieces of flesh and blood on its body flew in all directions. There were a few thousand pieces!<br/><br/>At the same time, it swung its gigantic tail and swept towards the black hole!<br/><br/>Boom! Boom<br/><br/>The moment Wang Xian came out of the black hole, the position of the dragon horn emitted a brilliant light.<br/><br/>A sharp sword that was the combination of light and darkness attacked the heaven-swallowing earth-eating beast emperor’s tail.<br/><br/>The terrifying force landed on its tail and caused a huge wound.<br/><br/>At the same time, its body flew backward for a long distance.<br/><br/>The heaven-swallowing earth-eating beast emperor was not Wang Xian’s match at all.<br/><br/>In a head-on confrontation, Wang Xian had a huge advantage.<br/><br/>“Kill!”<br/><br/>Mo Sha and the rest, who followed closely behind, immediately unleashed powerful attacks that covered the heaven-swallowing earth-eating beast emperor!<br/><br/>“Surround him!”<br/><br/>Wang Xian rushed over. The dragon scales on his body emitted a luster.<br/><br/>The luster condensed into a chain that sealed off the surrounding space!<br/><br/>Wang Xian wanted to leave the heaven-swallowing earth-eating beast emperor here completely, even if he had to pay a tragic price!<br/><br/>“Kill his life force!”<br/><br/>Mo Sha Stared at the heaven-swallowing earth-eating Beast Emperor who was being protected and spread his arms.<br/><br/>“Embrace of the demons, blood!”<br/><br/>He roared loudly and an extremely terrifying phantom image appeared behind him.<br/><br/>The black phantom image attacked the heaven-swallowing earth-eating beast emperor directly.<br/><br/>Beisheng Hundun and the rest immediately unleashed a powerful and terrifying attack.<br/><br/>Frost, fire, lightning.<br/><br/>Gray and terrifying energy.<br/><br/>All kinds of energy raged.<br/><br/>“What terrifying life force. Even under such a siege, he didn’t die.”<br/><br/>Flowing blue and the others were filled with shock.<br/><br/>They felt that if they were attacked by the Dragon King and the others, they could die dozens of times!<br/><br/>However, the heaven-swallowing earth-devouring Beast King continued to roar.<br/><br/>Its aura was overwhelming!<br/><br/>“Roar! Roar!”<br/><br/>The heaven-swallowing earth-devouring beast king passively defended against the attacks of Wang Xian and the rest.<br/><br/>However, the injuries on its body were getting more and more horrifying!<br/><br/>It roared in fear.<br/><br/>It raised its huge head and the phantom image of a huge mouth appeared once again.<br/><br/>When this phantom image appeared, Wang Xian’s expression changed slightly.<br/><br/>“Slash its body with all your might.”<br/><br/>Wang Xian let out a low growl. All the chains around him condensed into a sharp sword and slashed at his body!<br/><br/>Mo Sha and the rest followed up with their attacks and slashed at him together!<br/><br/>The figure of the heaven-devouring earth-eating beast King disappeared slowly once again.<br/><br/>However, this time, it escaped, leaving behind an extremely tragic part of its body.<br/><br/>Its gigantic body was enough to cut off half of Wang Xian’s body!<br/><br/>“Pursue it!”<br/><br/>Wang Xian shouted in a low voice. He kept half of the heaven-devouring earth-eating beast King’s gigantic body and forcefully opened the space of the Netherworld Dragon’s pursuit again!<br/><br/>Forcefully opening the space of pursuit was very damaging to Wang Xian.<br/><br/>Forcefully using it four times was his limit.<br/><br/>After four times, he would die immediately!<br/><br/>After the second time, the injuries on Wang Xian’s body were even more serious!<br/><br/>However, when they came out of the Black Hole, the heaven-devouring Beast Emperor was even more miserable!<br/><br/>Half of his body had been cut off, and the power and attack power of his body had been reduced by more than half!<br/><br/>Now, his destructive power couldn’t even threaten the demonic fiend!<br/><br/>“Kill!”<br/><br/>Wang Xian growled!<br/><br/>“Demonic Abyss, descend!”<br/><br/>The demonic fiend growled, “Dragon King, this move of mine can seal the space. If he wants to escape in an instant, he can’t do it at all!”<br/><br/>The heaven-swallowing earth-eating Beast King was severely injured. The Demonic Fiend’s seal of space could seal it!<br/><br/>“Alright!”<br/><br/>Wang Xian’s eyes lit up and everyone rushed over to attack him.<br/><br/>“Roar! Roar!”<br/><br/>The heaven-swallowing earth-eating Beast King was extremely furious. The body behind its huge mouth suddenly turned into flesh and blood as it flew into its huge mouth.<br/><br/>In the end, it was only left with a huge mouth.<br/><br/>This move made its power almost return to its peak.<br/><br/>“Gan, so fierce? If he can still use his escape ability, I won’t be able to withstand it!”<br/><br/>Mo Sha couldn’t help but Roar!<br/><br/>Wang Xian’s eyes were filled with a solemn expression.<br/><br/>This heaven-swallowing earth-eating beast king was indeed extremely difficult to deal with!<br/><br/>However, what made Wang Xian and the rest relieved was that it didn’t use its escape ability again.<br/><br/>The life force of the heaven-swallowing earth-eating beast King gradually disappeared.<br/><br/>After besieging it for dozens of hours, it was completely destroyed!<br/><br/>“Phew!”<br/><br/>Wang Xian took a deep breath and squeezed out a smile. “It’s finally destroyed. This life force is really terrifying.”<br/><br/>“Master, our strength is so much stronger than his, and we even caused you to suffer such serious injuries.”<br/><br/>Bei Shuang looked at Wang Xian and said with concern.<br/><br/>“It’s indeed difficult to deal with. If I don’t use my injuries to pursue it, it might really escape. However, he released some of his flesh and blood to escape. I need to pursue him.”<br/><br/>Wang Xian spoke!\t\t\t\t\t\t</div>", "images": {}, "success": true}