{"id": 1360, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075166.html", "title": "Chapter 4363 - Chapter 4363: 4362, An All-Out War, Universe War 1", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4363 - Chapter 4363: 4362, An All-Out War, Universe War 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4363: 4362, an all-out War, Universe War 1<br/><br/>Translator: 549690339<br/><br/>Wang Yun stared at the Void Pagoda, his eyes gleaming.<br/><br/>Since the Void Pagoda of the Void King was here, there was a 90% chance that he was inside.<br/><br/>There were three void pagodas beside him, which were the three powerhouses of the Void Universe.<br/><br/>According to Wang Xian’s estimation, these three powerhouses of the Void Universe should be at the control level!<br/><br/>Wang Xian narrowed his eyes slightly and stared at them carefully.<br/><br/>“In other words, the combat strength of the king of Void is comparable to two existences at the Great Dao level.”<br/><br/>Wang Xian mumbled.<br/><br/>However, although there were two of them, Wang Xian was in the dark while they were in the open.<br/><br/>If he could instantly kill the three masters at the control level, it would be much easier to deal with the king of Void.<br/><br/>“The problem shouldn’t be too big.”<br/><br/>Wang Xian pondered.<br/><br/>Out of the three control-level powerhouses, Wang Xian, Mo Sha, and the Fallen Shadow Demon Emperor could kill one of them first.<br/><br/>If they were caught off guard, the great dao-level powerhouses could ambush the control-level existences.<br/><br/>The success rate could reach 90% .<br/><br/>In addition, there was an 80% chance of killing them instantly.<br/><br/>There were no powerhouses at the control level in the Void universe.<br/><br/>They had just stepped into this level.<br/><br/>If Wang Xian and the rest launched a sneak attack, they would have no room to resist!<br/><br/>First, they would kill three of the control level powerhouses. Then, they would surround and attack the king of Void.<br/><br/>Wang Yun made up his mind. Then, he took out his communication device and told Mo Sha and the Fallen Shadow Demon Emperor about the situation here!<br/><br/>After they received the message, they quickly sent a message back.<br/><br/>“Since we are going to fight, it means that we are all going to fight. Let the Army of the nine-origin universe begin to move!”<br/><br/>Wang Xian sent another message to the fallen Shadow Demon Emperor.<br/><br/>The Fallen Shadow Demon Emperor nodded.<br/><br/>Following that, they passed the message to the elven empress, the ancestor of the dark race, and the rest through an lie.<br/><br/>The Elven empress and the rest, who had already prepared in advance, immediately took action.<br/><br/>Wang Xian also instructed an lie to expose his ability. He led a group of experts from the nine-origin Universe and teleported to the front of the Void universe quickly.<br/><br/>Over there, Wang Xian and the rest had already prepared the devil spirit altar in advance!<br/><br/>“What… What are we doing? Our Lord had US begin to prepare more than 100,000 years ago. Now that we have been teleported here directly, all the elites of our angel race have arrived!”<br/><br/>“Oh? Look, the disciples of the saint lineage, the immortal empire, and the few lords of the Tianyuan blessed realm, including Saint Hetian, Saint calligrapher, and Saint Empress Floaty, are also here!”<br/><br/>“Where are we? Where in the chaos? which universe is that bright universe in front of us?”<br/><br/>In order to prevent accidents, other than the powerhouses of the Tianyuan blessed realm, the other disciples did not know that the nine-origin universe had attacked the Void Universe.<br/><br/>After all, the Emperor of the Phoenix had happened back then. It was impossible for them to tell such an important matter to all the disciples.<br/><br/>One by one, the peak races were teleported over by an lie.<br/><br/>At the front, the heavenly fate realm experts from the peak races looked at each other, their eyes filled with excitement.<br/><br/>“Hahaha, hahaha, I have been waiting for this day for a very, very long time. I never thought that I would be able to wait until this day arrives!”<br/><br/>On the side of the Saints, the Hetian saint’s face was filled with excitement, but his eyes were filled with terrifying killing intent!<br/><br/>The Saints’side didn’t talk about the past.<br/><br/>When this calamity had just begun, all the Saints’disciples had been massacred by the king of Void.<br/><br/>Today, he could finally take revenge!<br/><br/>Today, he could finally kill his way to that universe!<br/><br/>Around him, the elven empress, the Dark clan patriarch, and the Black Tortoise patriarch all had fierce killing intent in their eyes.<br/><br/>They looked at each other and scanned their surroundings.<br/><br/>This time, every peak race had sent a million disciples.<br/><br/>The weaker ones had reached the fifth level of the venerable realm.<br/><br/>Since the war had started, it wasn’t a simple invasion.<br/><br/>They wanted to take revenge for the two previous catastrophes.<br/><br/>They wanted to make all the living beings in the universe pay the price of blood!<br/><br/>A real war in the universe!<br/><br/>“The Dragon Palace hasn’t arrived yet.”<br/><br/>The twelve ancestral wizards glanced around and said with a smile.<br/><br/>“The strength of the Dragon Palace will probably exceed everyone’s imagination.”<br/><br/>The newly advanced Heavenly Yuan creation realm expert of the skeleton clan, dark night withered emperor, said with a smile.<br/><br/>He knew a little about the current strength of the Dragon Palace.<br/><br/>“Since the Dragon King and the fallen Shadow Demon Emperor are absolutely going all out, they are naturally confident. With the Dragon King in the Dragon Palace, they have been improving very quickly. I wonder how many Heavenly Yuan creation realm experts there are now. I heard that the disciple of the Dragon King has broken through.”<br/><br/>The Elven empress said curiously.<br/><br/>Bei Shuang had broken through in the nine-origin universe. They had already received the news!<br/><br/>“They’re here!”<br/><br/>At this moment, Phantoms appeared one by one on the side!<br/><br/>Four enormous phantoms.<br/><br/>Only four enormous phantoms!<br/><br/>However, when the four enormous phantoms materialized, the elven empress and the others focused their eyes!<br/><br/>Little Blue, Little White, and primal chaos appeared in the line of sight of all the powerful disciples in the nine-origin universe.<br/><br/>On their bodies were the million-strong army of the Dragon Palace.<br/><br/>Over a million disciples of the Dragon Palace. The weakest among them was an army at the first level of the ruler realm.<br/><br/>In addition, in front of Little Blue and the others, bei Shuang and the others were standing there.<br/><br/>They could see the power of the Heavenly Yuan realm at a glance!<br/><br/>“Now, we will fight together with you.”<br/><br/>Bei Shuang looked at the Elven empress and the others and slightly cupped his hands.<br/><br/>“Is this the strength of the Dragon Palace?”<br/><br/>Black Tortoise Patriarch couldn’t help but exclaim as he looked at bei Shuang and the others in shock.<br/><br/>“Nine masters in the Heavenly Yuan blessed realm. It’s really shocking. Congratulations.”<br/><br/>Even the elven empress, who was prepared, was stunned.<br/><br/>She cupped her hands and congratulated!<br/><br/>“We’re lucky to have the Dragon King to teach us.”<br/><br/>Bei Shuang smiled and spoke on behalf of the Dragon Palace.<br/><br/>“The million-strong army of rulers is truly an invincible army.”<br/><br/>The 12 ancestral wizards glanced over and said in shock.<br/><br/>The number of their wizards was relatively small, and only a few hundred thousand of them were at the ruler realm.<br/><br/>Bei Shuang and the others smiled and felt a little proud.<br/><br/>Back then, the Dragon Palace could only look up to the peak races.<br/><br/>But now, they were already standing at the peak of the nine-origin universe.<br/><br/>“Hiss, this… this is the strength of the Dragon Palace? How is this possible? How can there be as many as nine existences in the Heavenly Yuan creation realm? And this is not even counting the Dragon King!”<br/><br/>“My ancestors, thinking back to the battle between Our Angel Race and the Dragon Palace, if we didn’t settle our grudges, wouldn’t we… feel terrifying just thinking about it!”<br/><br/>“The strength of the Dragon Palace is too terrifying, isn’t it? How can they improve so fast? It’s simply heaven-defying.”<br/><br/>“The Dragon Palace is growing too fast. It’s only been a few hundred million years. If it continues to develop like this, wouldn’t the Dragon Palace be Invincible?”<br/><br/>“It’s Invincible Now!”\t\t\t\t\t\t</div>", "images": {}, "success": true}