{"id": 1368, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075198.html", "title": "Chapter 4371 - Chapter 4371: 4370, An All-Out War, A War Of The Universe! 9", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4371 - Chapter 4371: 4370, An All-Out War, A War Of The Universe! 9</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4371: 4370, an all-out war, a war of the universe! 9<br/><br/>“What?”<br/><br/>“Not good, we are no match for the Dragon King and the rest. Run, run, run!”<br/><br/>When Wang Xian made his move and instantly killed four heaven origin creation stage powerhouses.<br/><br/>In the surrounding area, the other seven heaven origin creation stage powerhouses from the Void universe were completely terrified!<br/><br/>Too strong!<br/><br/>Too strong!<br/><br/>It was completely unstoppable!<br/><br/>“Ah! No!”<br/><br/>At this moment, another scream was heard.<br/><br/>A heaven origin manifestation powerhouse at the control level was killed by the Fallen Shadow Demon Emperor.<br/><br/>He wasn’t killed by the Fallen Shadow Demon Emperor alone either.<br/><br/>Instead, Xiao Lan and Jiuli from the demon race attacked the nearest heaven origin manifestation powerhouse after Wang Xian killed their target.<br/><br/>This heaven origin creator from the Void Universe was being suppressed by the Fallen Shadow Demon Emperor!<br/><br/>How could he withstand the sudden sneak attack?<br/><br/>This was completely unethical!<br/><br/>In an instant, the heaven origin creator who was at the control level was killed!<br/><br/>“Let’s finish this battle quickly. After we kill them, let’s go look for the king of Void!”<br/><br/>Wang Xian looked at the fallen Shadow Demon Emperor and said!<br/><br/>“No Problem!”<br/><br/>The Fallen Shadow Demonic Emperor nodded. With a move, it headed straight for the control-level powerhouse who was besieged by the twelve ancestral witches.<br/><br/>This control-level powerhouse was being attacked by the Elf Queen of the twelve ancestral witches and the ancestor of the underworld race.<br/><br/>He was already completely suppressed.<br/><br/>When he sensed that the fallen shadow demonic emperor was attacking him, he could no longer hold back!<br/><br/>He gave up resisting immediately!<br/><br/>Resist?<br/><br/>Was it effective?<br/><br/>It was useless!<br/><br/>The third control-level powerhouse was eliminated!<br/><br/>At this point, only the Devil Emperor was still resisting tenaciously!<br/><br/>He wanted to escape now, but he was locked onto by the Devil Emperor. It was already a huge problem for him to hold on for a few minutes, let alone escape!<br/><br/>Wang Xian waved his arm and a terrifying sword of light attacked him.<br/><br/>This was also the last control-level existence. He had given up completely.<br/><br/>Four control-level experts were all killed.<br/><br/>In addition, there were three beginner-level existences who were still resisting in despair.<br/><br/>As for the disciples at the back, their faces were filled with fear.<br/><br/>The lords of their dynasty were dying rapidly.<br/><br/>The terrifying nine-origin universe army had already charged over.<br/><br/>What welcomed them was destruction!<br/><br/>“Leave this place to the others. Let’s Go and chase after the King of Void!”<br/><br/>Wang Xian saw this scene and did not continue to attack. Instead, he spoke to Devil Fiend, Fallen Shadow Devil Emperor, and the rest!<br/><br/>The two of them nodded.<br/><br/>There were only three control-level existences left. Facing more than 20 heaven-origin creation-level powerhouses in the nine-origin universe?<br/><br/>They would not last more than a few seconds.<br/><br/>Therefore, they didn’t need to make a move in this situation.<br/><br/>Of course, there were heaven origin creator-level powerhouses from the Void dynasty who were killed and were resurrected in the dynasty inside.<br/><br/>However, even if they were resurrected, the strength of the 12 ancestor witch elven empress and the rest was sufficient to finish them off.<br/><br/>Their primary goal was to kill the king of Void once again.<br/><br/>Now, the king of Void’s strength had already fallen to the control-level.<br/><br/>If possible, Wang Xian wanted to get rid of him completely!<br/><br/>“An lie!”<br/><br/>Wang Xian called an lie over. With a wave of his arm, the map of the Void Universe appeared in front of him.<br/><br/>“The king of Void’s location should be around here. Bring us here.”<br/><br/>Wang Xian instructed him.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded and disappeared with them instantly.<br/><br/>The demonic spirit altar was in the Void Universe. It was an altar used to summon spatial demon beasts to battle.<br/><br/>It covered the entire void universe.<br/><br/>An lie now had a detailed understanding of the map in his mind.<br/><br/>He could roughly guess where the map corresponded to the Void Universe!<br/><br/>In the next second, Wang Xian and the rest appeared on a planet!<br/><br/>“I heard that the Army of the nine-origin universe has invaded our void empire. It’s going to be difficult for our void universe to defend against them!”<br/><br/>“I don’t know the exact situation, but how can a tiny nine-origin universe invade the center of Our Universe? According to the information I got from the history books, the previous few catastrophes were all fought by our king to the nine-origin universe. Killing the living beings in the nine-origin universe was like slaughtering a dog!”<br/><br/>“The nine-origin universe seems to have risen up. There is indeed a great war breaking out in the Void dynasty. I hope our king and the rest can eliminate these damn invaders.”<br/><br/>“I heard that our king hasn’t appeared yet. As long as our King returns, we will definitely be able to kill them all.”<br/><br/>When Wang Xian and the rest appeared on this planet.<br/><br/>They were floating in the air.<br/><br/>Some voices entered their ears.<br/><br/>“Hehe!”<br/><br/>When the fallen Shadow Demon Emperor heard that, he smiled gently.<br/><br/>“Over there!”<br/><br/>Wang Xian’s gaze was fixed in a certain direction as he flew over quickly!<br/><br/>The Demonic Fiend and the fallen Shadow Demon Emperor followed quickly.<br/><br/>Buzz Buzz Buzz<br/><br/>Buzz Buzz Buzz<br/><br/>At the same time, in the void in front of them.<br/><br/>The void King was running frantically.<br/><br/>The communication device on his body kept transmitting urgent messages.<br/><br/>He glanced at them and saw the messages. His expression was extremely ugly.<br/><br/>He never thought that one day, the army of the nine-origin universe would attack their void dynasty.<br/><br/>They would attack the Void Universe.<br/><br/>And now, they wanted to attack their entire universe.<br/><br/>“Run, that Dragon King and the others have tracking treasures, you guys run First!”<br/><br/>The void King’s face was gloomy as he ordered his subordinates.<br/><br/>They had already lost.<br/><br/>They couldn’t stay in the Void universe anymore.<br/><br/>They would only dare to return after the calamity ended.<br/><br/>Now, their home had become the most dangerous place.<br/><br/>“Weng Weng!”<br/><br/>“Weng Weng!”<br/><br/>Just as Void King sent out the message.<br/><br/>He suddenly felt the space around him shake.<br/><br/>Three extremely terrifying energies appeared around him.<br/><br/>“How is this possible? How can it be so fast?”<br/><br/>Void King roared!<br/><br/>“Void King, Stray Dog, can you escape?”<br/><br/>Fallen Shadow Demon Emperor stared at Void King and said with a cold and mocking expression.<br/><br/>“You…”<br/><br/>Void King’s expression changed drastically.<br/><br/>“You once attacked our 9-origin universe and massacred the living beings of our 9-origin universe. You Didn’t expect this day to come, did you?”<br/><br/>Falling Shadow Demon Emperor continued to say coldly!<br/><br/>Weng<br/><br/>He instantly arrived in front of void King and grabbed his neck.<br/><br/>“I didn’t expect it!”<br/><br/>The king of Void smiled bitterly. When the fallen Shadow Demon Emperor arrived in front of him, his body trembled.<br/><br/>His life force was immediately dispersed.<br/><br/>He committed suicide!<br/><br/>He didn’t want to be captured and tortured by the fallen Shadow Demon Emperor.<br/><br/>“Dragon King, take the corpse!”<br/><br/>The Fallen Shadow Demon Emperor looked at the king of Void’s corpse and threw it to Wang Xian.<br/><br/>“Alright, I will distribute it in the end!”<br/><br/>Wang Xian nodded and kept the body of the fallen Shadow Demon Emperor. Following that, the lamp of divination continued to perform divination!<br/><br/>“He is still somewhere in the Void Universe. Let’s go and continue the pursuit!”<br/><br/>“His strength is still at the control level!”\t\t\t\t\t\t</div>", "images": {}, "success": true}