{"id": 1369, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075202.html", "title": "Chapter 4372 - Chapter 4372: 4371 Killed, Annihilated, And Occupied The Void Space", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4372 - Chapter 4372: 4371 Killed, Annihilated, And Occupied The Void Space</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4372: 4371 killed, annihilated, and occupied the void space<br/><br/>The King of Void was resurrected in the void space once again.<br/><br/>After Wang Xian divined the king of Void, he immediately launched a second round of pursuit.<br/><br/>It was too difficult for a control-level powerhouse to get rid of the pursuit of Wang Xian and the rest.<br/><br/>Especially with the help of an lie.<br/><br/>In less than two months, Wang Xian and the rest pursued the king of void again.<br/><br/>“Hehe!”<br/><br/>Wang Xian and the rest stared at the king of Void mockingly. Their faces were filled with coldness.<br/><br/>The king of Void looked extremely embarrassed.<br/><br/>Without saying a word, he committed suicide again!<br/><br/>“Huh?”<br/><br/>When Wang Xian put away the corpse, the lamp of divination began to perform divination. He frowned slightly.<br/><br/>“What’s wrong, Dragon King? Is He not in this universe anymore?”<br/><br/>The Fallen Shadow Demon Emperor looked at Wang Xian and asked.<br/><br/>“Yes!”<br/><br/>Wang Xian nodded. “We can’t predict his location. The place where he resurrected this time is either a treasure that can block divination, or his resurrection this time is located in an extremely distant place. Otherwise, we wouldn’t be unable to predict it.”<br/><br/>“HMM? It doesn’t matter if we can’t lock onto it. We’ve already killed him several times.”<br/><br/>The Fallen Shadow Demon Emperor spoke!<br/><br/>“HMM, since we can’t kill the King of Void, Let’s go and hunt down the other powerhouses in the void space.”<br/><br/>Wang Xian nodded and didn’t pay too much attention to it.<br/><br/>If he couldn’t kill the king of Void Space, he could continue to kill the other Heaven’s origin creation powerhouses in the Void Empire.<br/><br/>In addition, after conquering the void space and obtaining the treasures and resources.<br/><br/>The resources exchanged from the Justice Alliance were enough for Wang Xian to achieve a breakthrough.<br/><br/>Once Wang Xian achieved another breakthrough, his strength would reach an extremely terrifying level.<br/><br/>It was also the strongest known realm in the universe!<br/><br/>“You guys can take action on the matter of hunting the powerhouses from the other void dynasties. I Can’t be of much help either. I’ll go handle the matters in the nine-origin universe.”<br/><br/>“For this battle, I’ll gather all the resources first before distributing them!”<br/><br/>The Fallen Shadow Demon Emperor spoke.<br/><br/>“Yes. Currently, we’ve only occupied the palace of the Void dynasty. There are still huge amounts of resources in other places. According to their strength, we’ll allocate them to attack one territory after another and distribute them fairly. How many resources and treasures we get will depend on luck.”<br/><br/>Wang Xian nodded and said, “As for the resources and treasures in the Void Dynasty, we will allocate them in the end.”<br/><br/>“Alright!”<br/><br/>The Shadow Devil Emperor nodded and left!<br/><br/>Wang Xian began to use the lamp of divination to pursue the other disciples of the Heaven’s origin realm in the Void Universe.<br/><br/>“Let’s start one by one. This time, I want to completely cripple the Void Universe!”<br/><br/>Wang Xian thought to himself.<br/><br/>Time passed by little by little. A month later, Wang Xian appeared in the sky above a planet.<br/><br/>He waved his arm and a dragon claw clawed at a spot!<br/><br/>“What!”<br/><br/>“How is this possible? How did I get discovered? That’s the Dragon King. It’s over, it’s over!”<br/><br/>A horrified voice rang out very quickly. A Heaven’s origin creator powerhouse from the Void Universe was killed again.<br/><br/>Wang Xian continued to search with his divination lamp.<br/><br/>Following that, one by one, the Void Universe’s powerhouses were found by Wang Xian and killed again.<br/><br/>As time passed, the entire void universe began to shake.<br/><br/>The Army of the nine-origin universe began to attack from the Void dynasty in all directions!<br/><br/>All the forces and powerhouses in the Void universe, if they didn’t want to die, would take out all their resources.<br/><br/>They would exchange all their resources for their own lives.<br/><br/>In the beginning, there were still some planets in the void space. Some powers resisted, but they were easily killed by the army of the nine-origin universe.<br/><br/>They had no power to resist at all.<br/><br/>When the other powers and planets in the void space saw this scene, they immediately cowered and offered all their resources.<br/><br/>Even if they were valuable, the army of the nine-origin universe wouldn’t let them go.<br/><br/>Even if it was a divine herb divine tree at the divine emperor level.<br/><br/>Keep It?<br/><br/>Keep it for the Void Universe’s disciples to cultivate and then seek revenge?<br/><br/>Hence, as long as it caught their eye, they would take it all away.<br/><br/>Although they didn’t like spatial-attributed treasures, they could sell them.<br/><br/>They could trade with the Justice Union.<br/><br/>With the size of the Justice Union, these treasures could be sold quickly.<br/><br/>The invasion of the nine-origin universe made the powerful disciples of the Void universe powerless.<br/><br/>Occasionally, some of them resisted, but they were quickly suppressed.<br/><br/>In the Void universe, there was often news that the heavenly yuan creation realm experts of their void universe had been killed.<br/><br/>These were the heavenly yuan creation realm experts that the Dragon King had found.<br/><br/>“Run, run, we have to run out of the universe. We Can’t stay in our universe anymore. The Dragon King could easily find us. Duke Jin Ming and Duke Xining have completely fallen!”<br/><br/>“They’re too strong. The Dragon King and the others are too strong. The nine-origin universe is too strong. We have no way to resist at all.”<br/><br/>Some of the Heavenly Yuan creation-level powerhouses contacted each other and ran away frantically.<br/><br/>They fled into the chaos.<br/><br/>There were also some heavenly yuan creation-level powerhouses who were completely killed.<br/><br/>They had fallen completely!<br/><br/>“It’s over, it’s over. Our Void Universe is completely over. We’ve provoked an existence that we can’t afford to provoke.”<br/><br/>“Anyone who resists will be killed. Who Dares to resist? The power of the 9-origin universe army is too powerful. All the armies of our dynasty have been annihilated!”<br/><br/>“I heard that our void King has already escaped, escaping into the vast primal chaos.”<br/><br/>“It’s over, it’s all over. Only by handing over all the treasures and resources can we survive. Even if we don’t hand them over, we have to hand them over. Otherwise, our corpses will be their resources.”<br/><br/>“Why did our void universe provoke such a powerful enemy?”<br/><br/>Within the Void Dynasty, along with the attacks of the 9-origin universe army, countless powerful disciples collapsed.<br/><br/>Their strength was relatively weak. Escaping into the primal chaos?<br/><br/>That was no different from courting death.<br/><br/>Resist?<br/><br/>It was also death!<br/><br/>Only by contributing all their resources would they be able to survive.<br/><br/>And this resource included everything.<br/><br/>Their weapons, their powerful armor, everything.<br/><br/>They were helpless, and in order to survive, they could only do as they were told.<br/><br/>This was considered merciful for the invasion between the universe and the universe.<br/><br/>It became even more cruel, even slaughtering all living beings.<br/><br/>Using their corpses as resources.<br/><br/>However, the 9-origin universe army didn’t do that either.<br/><br/>Of course, all the armies of the Void Empire were completely destroyed.<br/><br/>And the Void Empire’s experts occupied 70% of the entire universe.<br/><br/>Destroying them, the Void universe would need at least tens of billions of years to recover!<br/><br/>The Void Universe was completely defeated.<br/><br/>And the 9-origin universe also obtained a huge amount of resources from the entire universe.<br/><br/>This was a terrifying harvest for the pinnacle races of the nine-origin universe!\t\t\t\t\t\t</div>", "images": {}, "success": true}