{"id": 1364, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075182.html", "title": "Chapter 4367 - Chapter 4367: 4366, An All-Out War, A War Of The Universe! 5", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4367 - Chapter 4367: 4366, An All-Out War, A War Of The Universe! 5</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4367: 4366, an all-out war, a war of the universe! 5<br/><br/>Translator: 549690339<br/><br/>“As long as I can escape to the palace of the Void Dynasty, I’ll be safe there!”<br/><br/>The king of Void could feel that Wang Xian and the rest were chasing after him crazily. He did not dare to stop at all.<br/><br/>He gritted his teeth and roared in his heart.<br/><br/>He did not expect the Dragon King of the Dragon Palace and the rest to be able to travel through the starry skies so far away and arrive here directly.<br/><br/>Now that his heavenly yuan destiny treasure was being suppressed by the Dragon King, he was filled with rage.<br/><br/>However, he had no other choice.<br/><br/>All he could do now was to run for his life.<br/><br/>Once he was caught up, he would be killed again.<br/><br/>If he was resurrected again, his strength would drop to the control level!<br/><br/>As long as he flew to the palace of the dynasty, his subordinates and himself would not be afraid of Wang Xian and the others at all.<br/><br/>In addition, he had already sent a message to his subordinates to rush over quickly!<br/><br/>However, what he did not know was that at this moment, outside the Void Universe, the Army of the nine-origin universe had already rushed in quickly!<br/><br/>“Wu Wu Wu!”<br/><br/>“Wu Wu Wu!”<br/><br/>“Roar Roar Roar!”<br/><br/>Outside the Void Universe, after Wang Immortal’s order was given!<br/><br/>The eyes of all the armies in the nine-origin universe shone with a cold luster.<br/><br/>“In front of us is the Void Universe, the enemy of our nine-origin universe. Today, the disciples of the nine-origin Universe will attack the Void Universe and destroy the Void Dynasty!”<br/><br/>“All the disciples, we have a deep blood feud with the Void Universe. Today, all the disciples, Kill!”<br/><br/>“We will use the blood of the Void Universe to pay tribute to our disciples, seniors, and friends who have died!”<br/><br/>“Kill, Kill, Kill!”<br/><br/>The ancestor of the nether race stared ahead and roared loudly!<br/><br/>A sharp killing intent charged through the entire void!<br/><br/>“Kill, Kill, Kill!”<br/><br/>“Kill, Kill, Kill!”<br/><br/>In the next moment, even the elven empress, the 12 Ancestral Warlocks, and the others raised their hands with killing intent and roared loudly!<br/><br/>The sound of killing shook the sky!<br/><br/>“Let’s Go!”<br/><br/>The Heavenly Yuan creation realm experts shouted at the same time.<br/><br/>They enveloped all their disciples with energy and exploded with energy. They brought all their disciples and charged into the Void universe!<br/><br/>“Front of the Void dynasty, it’s safe!”<br/><br/>“We can teleport!”<br/><br/>At the same time, they were in front of the Legion in the 9-origin universe!<br/><br/>An lie stood there and walked out from a devil spirit altar!<br/><br/>Since he wanted to kill them!<br/><br/>Then he would catch the void space by surprise!<br/><br/>And to catch them by surprise, he naturally went straight to the palace of the Void dynasty!<br/><br/>Under an Lie’s constant inspection, he confirmed a place!<br/><br/>After dozens of minutes, the disciples of the 9-origin universe rushed into the void space!<br/><br/>An lie looked at them. “Teleport!”<br/><br/>“Okay!”<br/><br/>The Heavenly Yuan creation realm experts of the nine-origin universe nodded.<br/><br/>“Hehe, our Dragon Palace will scout the way for You!”<br/><br/>Bei Shuang smiled and Xiao Lan and the others approached an lie. Under an Lie’s lead, they instantly disappeared!<br/><br/>However, in less than a second, an Lie’s figure appeared again.<br/><br/>Legions of the nine-origin universe were teleported one after another!<br/><br/>Legions of the 9-essences universe appeared in front of the palace of the Void dynasty.<br/><br/>They appeared in the void, and from afar, they could see the towering palace of the Void dynasty!<br/><br/>“Is that the palace of the Void Dynasty?”<br/><br/>The Unity Saint asked with a cold and excited look in his eyes.<br/><br/>“Yes, that’s the palace of the Void Dynasty!”<br/><br/>The 12 ancestral warlocks came here and nodded as they looked at the palaces in front of them.<br/><br/>“Then destroy the palace of the Void Dynasty!”<br/><br/>Saint Hetian roared with a fierce killing intent!<br/><br/>“Kill!”<br/><br/>The powerful disciples of the saint’s bloodline were filled with flames of hatred.<br/><br/>Many of their brothers, sisters, and seniors had died at the hands of the Void King.<br/><br/>Now, it was time for them to take revenge!<br/><br/>Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>“Kill!”<br/><br/>The sky-high Aura broke through the clouds of the Void Space!<br/><br/>That terrifying aura could be felt even from the palace of the Void Space Dynasty!<br/><br/>The Army of the 9-origin universe rushed over!<br/><br/>“What’s going on?”<br/><br/>“Where is that? What a powerful aura!”<br/><br/>At the same time, in the palace of the Void dynasty!<br/><br/>Today was a very bad day for the Void Dynasty.<br/><br/>Their void King had been attacked by a great being of the 9-origin universe.<br/><br/>In addition, three great beings of the control level of the Void Universe had just been resurrected in the Void dynasty!<br/><br/>They had received news from the void King and were going to help their king!<br/><br/>However, before they could leave, a terrifying aura came from not far away.<br/><br/>Looking at that monstrous aura, the seven Tianyuan blessed realm experts in the palace of the Void dynasty were instantly stunned!<br/><br/>At the same time, the disciples in the Palace of the Void dynasty also instantly felt the powerful aura coming from the north.<br/><br/>They all looked over with their mouths agape.<br/><br/>That terrifying aura was like a destructive sun that was charging towards them!<br/><br/>“Use the formation to investigate!”<br/><br/>Duke Tian men, who had been guarding the Palace of the Void Empire, saw the terrifying aura coming from the north and his expression changed drastically.<br/><br/>He immediately activated the formation of the entire Palace of the Void Empire to carry out the projection and investigate!<br/><br/>Soon, the projection of the Army of the nine-origin universe in the north appeared in the line of sight of the heavenly yuan destiny realm experts.<br/><br/>When they saw the enormous space beast.<br/><br/>When they saw the terrifying divine dragon!<br/><br/>When they saw the black tortoise, the ELF, the Divine Tiger, the ghost, the skeleton, the wizard… Their faces were filled with shock.<br/><br/>They naturally understood the creatures of the nine-origin universe very well!<br/><br/>Now, when they saw the army of the nine-origin universe rushing over, their faces were filled with disbelief!<br/><br/>“It’s the nine-origin universe, it’s the disciples of the nine-origin universe. How did they suddenly appear in our universe?”<br/><br/>A Heavenly Yuan creation realm powerhouse roared with a solemn expression!<br/><br/>“Weng!”<br/><br/>Duke Tianmen waved his arm and streams of energy poured into the array formation in the palace.<br/><br/>Following that, some information appeared.<br/><br/>When they saw this information, their expressions changed drastically!<br/><br/>“More than 20 heaven origin creation realm experts, how is this possible! ?”<br/><br/>Duke Tian men stared at the information and shouted!<br/><br/>“More than 20 heaven origin creation realm experts, this 9-origin universe has definitely invited experts from other universes. Our king has been attacked, and now the 9-origin universe has invaded. Their 9-origin universe is already prepared to fight us!”<br/><br/>“They came prepared, they came prepared!”<br/><br/>A Heaven origin creation realm expert roared in shock and anger!<br/><br/>“Immediately pass the news to our king. We can’t rush over immediately!”<br/><br/>The golden-armored middle-aged heaven origin creation realm expert said with an ugly expression.<br/><br/>They looked at the 9-origin universe army in front of them, and their expressions kept changing.<br/><br/>The nine-origin universe was coming.<br/><br/>They were coming to their universe.<br/><br/>They had to fight.<br/><br/>Otherwise, everything they had would be over.<br/><br/>Because the great beings of the nine-origin universe had already come, and they could escape. What about the disciples of the Void Dynasty?<br/><br/>What about their descendants?<br/><br/>Escape today?<br/><br/>What about in the future?\t\t\t\t\t\t</div>", "images": {}, "success": true}