{"id": 1367, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075194.html", "title": "Chapter 4370 - Chapter 4370: 4369, An All-Out War, A War Of The Universe! 8", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4370 - Chapter 4370: 4369, An All-Out War, A War Of The Universe! 8</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4370: 4369, an all-out War, a war of the universe! 8<br/><br/>Translator: 549690339<br/><br/>“It’s broken!”<br/><br/>When Wang Xian finished his sentence.<br/><br/>Wang Xian’s huge divine dragon body had already charged forward.<br/><br/>At the same time, the demonic fiend, Fallen Shadow Demon Emperor, also carried a terrifying attack and attacked the defensive barrier of the Void Universe.<br/><br/>When Wang Xian and the rest joined forces, how terrifying was their strength?<br/><br/>It was comparable to the full-force attack of more than 30 beginner-level heaven origin creation stage powerhouses.<br/><br/>Moreover, there were more than 20 heaven origin creation stage powerhouses in the nine-origin universe attacking.<br/><br/>Buzz<br/><br/>Buzz! Buzz<br/><br/>Buzz! Buzz<br/><br/>Wang Xian and the rest appeared in front of the battle instantly.<br/><br/>That extremely terrifying energy instantly landed on the Void dynasty!<br/><br/>It was like an extremely vast energy sweeping across!<br/><br/>A powerful shockwave spread to the energy shield of the Void Empire.<br/><br/>The entire shield began to collapse rapidly and started to tremble violently.<br/><br/>“What!”<br/><br/>“Oh no, it’s the Dragon King and the others from the nine-origin universe. It’s the Fallen Shadow Devil Emperor and the others from the nine-origin Universe!”<br/><br/>At this moment!<br/><br/>At the moment when Wang Xian and the others made their move.<br/><br/>The moment when their protective barrier collapsed from the nine-origin universe.<br/><br/>Inside the nine-origin universe, the expressions of the 11 powerhouses in the Heaven’s origin realm changed drastically.<br/><br/>They looked at everything in horror.<br/><br/>Feeling this terrifying and unrivaled power, their hearts trembled.<br/><br/>Wang Xian and the rest’s attack had broken through the defense.<br/><br/>There was still an extremely terrifying impact force that attacked the hundreds of millions of strong disciples in the Void Universe!<br/><br/>This attack was like a wave that pounced towards them!<br/><br/>“Block it!”<br/><br/>The golden middle-aged man roared loudly when he saw this scene!<br/><br/>They hurriedly tried to block it!<br/><br/>“Our Dragon King Is Here!”<br/><br/>“The fallen Shadow Demon Emperor is here too!”<br/><br/>“Hahaha, it’s broken. The defenses of the Void Empire are broken. Kill them!”<br/><br/>“Who’s the other Lord? Is He also a terrifying existence at the Great Dao Level?”<br/><br/>At the same time, all the powerful disciples in the Army of the nine-origin universe saw the sudden appearance of the Dragon King, Fallen Shadow Demon Emperor, and the others. When they saw that their opponent’s defense was easily broken, their faces were filled with excitement.<br/><br/>They let out an excited roar, full of excitement!<br/><br/>When the twelve ancestors of the dark shaman clan and the rest saw this scene, their eyes also focused.<br/><br/>However, when their eyes landed on Mo Sha, there was a hint of surprise.<br/><br/>Who was this person?<br/><br/>How did he possess such terrifying strength?<br/><br/>“Kill!”<br/><br/>However, this was no longer the time for them to think.<br/><br/>The group of nine-origin Universe’s heaven origin creation stage powerhouses let out a loud roar. They waved their arms and launched an attack horn!<br/><br/>“Huh?”<br/><br/>At this moment, Wang Xian sensed that the king of void had escaped through the divination lamp. He adjusted his brows slightly.<br/><br/>“The king of Void has escaped. Hehe, this guy is really cowardly. He gave up on his dynasty and escaped!”<br/><br/>Wang Xian snorted coldly. He stared at the group of powerhouses from the King of void and shouted, “Let’s kill a few of them first. Then, we will chase after the king of Void!”<br/><br/>“Good. I really didn’t expect that the king of Void would abandon his empire. What a joke!”<br/><br/>When the Fallen Shadow Demon Emperor heard Wang Xian’s words, he mocked him in surprise.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>In the next moment, their figures moved. They locked onto an expert at the control level and charged straight at him!<br/><br/>“Not good. The Dragon King and the rest are all experts at the Great Dao level. We are no match for them at all.”<br/><br/>The Duke of Heaven’s Gate roared in shock and anger!<br/><br/>But at this moment, he saw the Dragon King Lock onto him, and his heart pounded violently.<br/><br/>Escape?<br/><br/>At this moment, there was no room for them to escape!<br/><br/>“What, our King of the Void has escaped?”<br/><br/>“Our king is not here, how can we fight them?”<br/><br/>“Our king can not escape, it’s impossible!”<br/><br/>“It’s impossible. Why hasn’t our King appeared yet? The Dragon King and the rest are three great dao experts. We’re finished. We’re no match for them at all!”<br/><br/>“Run, run, run!”<br/><br/>At this moment, they heard the words of Wang Xian and the rest.<br/><br/>They could feel their terrifying aura.<br/><br/>Some of the Void Dynasty’s disciples were on the verge of collapse!<br/><br/>They were a little terrified!<br/><br/>At this moment, they no longer had the ability to resist!<br/><br/>If they continued, what awaited them was death!<br/><br/>At this moment, not to mention the Void dynasty’s disciples, even some of the Heavenly Yuan creation realm powerhouses’expressions changed!<br/><br/>Their king had escaped?<br/><br/>There was really such a possibility.<br/><br/>Otherwise, why didn’t their king appear when the Dragon King and the others charged over?<br/><br/>However, they could feel the immense pressure from the three great dao level experts. They knew that even if their king didn’t escape, it wouldn’t change the outcome.<br/><br/>Some experts wanted to retreat!<br/><br/>“Kill, Kill, Kill!”<br/><br/>However, at this moment, the experts of the nine-origin universe couldn’t allow them to retreat!<br/><br/>When Wang Xian and the rest locked onto the three control-level experts.<br/><br/>The rest of the nine-origin universe’s Heaven Origin Destinies worked together to lock onto the Void Universe’s experts one by one.<br/><br/>In the entire void dynasty, there were only four control-level experts.<br/><br/>After being locked onto by Wang Xian and the rest, there was only one left.<br/><br/>In the nine-origin universe, the elven empress, the twelve ancestral witches, the ancestor of the Netherworld race, and the ancestor of Xuanwu were all control-level existences.<br/><br/>It was a piece of cake to kill the last one!<br/><br/>As for the remaining seven, they were already surrounded and attacked!<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom<br/><br/>Wang Xian locked onto the Duke of Heaven’s Gate. His eyes were filled with coldness and viciousness.<br/><br/>At that time, he was once hunted down by the Duke of Heaven’s Gate and the others.<br/><br/>In the six-origin universe, he almost died that time!<br/><br/>Now, facing the Duke of Heaven’s Gate, Wang Xian could easily suppress him!<br/><br/>“Hualala!”<br/><br/>A cage formed by a chain instantly appeared around Duke of Heaven’s Gate.<br/><br/>The terrifying chain directly penetrated through him!<br/><br/>When Duke of Heaven’s Gate saw this chain, his expression changed drastically. He immediately used the power of space to slash upwards!<br/><br/>“Bang, Bang, Bang!”<br/><br/>However, his attack didn’t have any effect when it landed on the chain.<br/><br/>The gap between his current control level and Wang Xian was too huge!<br/><br/>Even though Wang Xian had used a portion of his strength to suppress the void disk, he was still comparable to five control level experts.<br/><br/>“Boom!”<br/><br/>A terrifying giant hand grabbed at him directly.<br/><br/>The unrivaled strength made it impossible for him to block it!<br/><br/>“Bang!”<br/><br/>His life force was quickly wiped out!<br/><br/>“Whoosh! Whoosh! Whoosh!”<br/><br/>After Wang Xian had wiped him out, his eyes swept to the side and his body flashed rapidly!<br/><br/>A few seconds later, Wang Xian flew into the void.<br/><br/>In the Void universe, three beginner-level powerhouses were easily wiped out by Wang Xian!<br/><br/>They were already fighting against the heaven-origin creation stage powerhouses in the nine-origin universe. How were they supposed to defend against Wang Xian’s sneak attack?<br/><br/>They couldn’t defend at all!<br/><br/>In an instant, four out of the eleven heaven origin creation powerhouses died.<br/><br/>Only seven were left!\t\t\t\t\t\t</div>", "images": {}, "success": true}