{"id": 1365, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075186.html", "title": "Chapter 4368 - Chapter 4368: 4367 All-Out War, Universe War! 6", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4368 - Chapter 4368: 4367 All-Out War, Universe War! 6</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4368: 4367 all-out War, Universe War! 6<br/><br/>Translator: 549690339<br/><br/>Universe wars were often very cruel.<br/><br/>One side would invade, and the other side wouldn’t give up on the universe and escape until the final decision was made.<br/><br/>Because once they escaped, the entire universe would be dug up.<br/><br/>This was the same principle as killing your entire family and then digging up your ancestor’s grave.<br/><br/>As long as there was some blood, they would definitely fight to the death.<br/><br/>When the Heaven’s Gate Duke saw the army of the nine-origin universe, his expression was abnormally ugly.<br/><br/>“All Disciples of the Void Empire, Get Ready!”<br/><br/>“Get ready for a big battle. Anyone who dares to invade our void universe will become a dead soul under our hands!”<br/><br/>Duke Tian men roared with a face full of killing intent. His expression was filled with Ling ran and fearlessness.<br/><br/>“Yes!”<br/><br/>In the Void Empire, all the powerful disciples immediately responded loudly.<br/><br/>All the legions guarding the palace came to the front of the palace.<br/><br/>They stared at the nine-origin Universe Legion that was charging over.<br/><br/>At the same time, the legions from other places quickly teleported over.<br/><br/>A great battle was about to break out at any moment.<br/><br/>“What? The nine-origin universe has actually invaded the front of the dynasty, there are more than 20 heaven origin creation-level existences?”<br/><br/>At the same time, in the vast starry sky of the Void Universe.<br/><br/>The void King was quickly fleeing forward.<br/><br/>At this moment, when he received the message from his subordinates, his face revealed an extremely shocked expression.<br/><br/>The Army of the nine-origin universe had actually invaded the center of his universe.<br/><br/>To the king of Void, the entire void universe was his personal domain.<br/><br/>Now, it had actually been invaded.<br/><br/>This made him extremely shocked and furious.<br/><br/>“There are more than 20 powerhouses in the Heaven’s origin realm. How can there be so many powerhouses in this nine-origin universe? There must be powerhouses from other universes helping them. Damn it.”<br/><br/>The king of void trembled as he swept his gaze behind him.<br/><br/>He wanted to shake off the pursuit of Wang Xian and the rest. However, after teleporting a few times, he realized that he could not do it.<br/><br/>The Void Pagoda was severely injured by Wang Xian’s Dragon Claw while the void disk was suppressed by Wang Xian.<br/><br/>The king of Void’s current strength was equivalent to a great dao level, an existence at the beginner level.<br/><br/>His strength was the same as the Demonic Fiend Fallen Shadow Demon Emperor!<br/><br/>In addition, Wang Xian’s strength was much stronger than the king of Void’s.<br/><br/>With the three of them combined, even if the king of Void’s spatial attribute was good at escaping, he wouldn’t be able to shake them off.<br/><br/>Most importantly, the king of Void had just revived and didn’t have any treasures in his hands.<br/><br/>Even the treasure that could allow him to escape instantly didn’t have any.<br/><br/>He placed a portion of the resources in the space of the void disk.<br/><br/>The other portion was at the Palace of the dynasty!<br/><br/>“Damn it!”<br/><br/>He was a little shocked and angry, but at this moment, he could only flee!<br/><br/>Wang Xian and the rest were at the back. They were also chasing after the king of void rapidly, not giving him a chance to catch his breath.<br/><br/>“Dragon King, the Army of our nine-origin universe has arrived at the center of the Void Universe.”<br/><br/>At this moment, the fallen Shadow Demon Emperor got the information from his subordinate and said excitedly.<br/><br/>“Yes.”<br/><br/>Wang Xian nodded. He already knew about this news.<br/><br/>“Dragon King, now we only need to hunt down the king of Void. We will be able to completely destroy the Void Universe.”<br/><br/>The Fallen Shadow Demon Emperor stared at the figure of the King of void with a grim gaze.<br/><br/>“Do you have any way to catch up to him or pin him down?”<br/><br/>Wang Xian asked him and Mo Sha.<br/><br/>“Dragon King, I have no way. The distance is too far. I can’t pin him down.”<br/><br/>Mo Sha shook his head.<br/><br/>The Shadow Devil Emperor also shook his head helplessly.<br/><br/>At this moment, unless the king of void paused for a moment, it would be difficult for them to stop him.<br/><br/>“Then let’s wait. We Can’t lose him. Once we lose him, it will be much more difficult to kill him in the future.”<br/><br/>Wang Xian spoke.<br/><br/>He had to wait until the Netherworld Dragon’s pursuit could be used.<br/><br/>Now, he had already forcefully used the Netherworld Dragon’s pursuit once. Once he used it again, he would be heavily injured.<br/><br/>At that time, the three of them working together might not be able to kill the king of Void again.<br/><br/>Therefore, he had to wait for at least a year!<br/><br/>Fortunately, a year was not a long time for them.<br/><br/>Wang Xian and the rest were chasing after him rapidly.<br/><br/>The King of Void was also eager to return to the dynasty palace.<br/><br/>He wanted to see the current situation.<br/><br/>However, it would take at least a few decades to fly from here to the center of the Void Universe.<br/><br/>While Wang Xian and the rest were chasing after them, the war between the nine-origin universe and the Void Universe had already erupted!<br/><br/>All the heaven-origin creation realm powerhouses in the Void universe rushed back immediately after they received the news that their universe had been attacked.<br/><br/>There were a total of eleven heaven-origin creation realm powerhouses. After facing more than twenty heaven-origin creation realm powerhouses in the nine-origin universe, they were not qualified to fight head-on.<br/><br/>They activated a defensive array in the palace of the entire dynasty.<br/><br/>The 11 heaven origin creation realm experts and all the disciples went into defense.<br/><br/>One side attacked while the other defended.<br/><br/>The earth-shattering might was endless!<br/><br/>“HMPH, with their defense, they can only last for a few years at most.”<br/><br/>At this moment, the advantage of the space attribute was revealed.<br/><br/>Cultivators of the space attribute in the Void universe who had just broken through were comparable to old-timers like the Hetian saint.<br/><br/>The Hetian saint was here because he did not have the support of the Heavenly Yuan Destiny Supreme Treasure, which meant that he had the combat strength of an old-timer who had just entered the beginner-level.<br/><br/>Old-timers who had just entered the Heavenly Yuan Destiny Void universe were comparable to those at the control level.<br/><br/>In addition to the defense of the dynasty’s palace array, they were able to hold on for a while.<br/><br/>However, this support was only for a short period of time.<br/><br/>According to the calculations of the 12 ancestral warlocks, they would not be able to hold on for more than two years.<br/><br/>After all, their strength was much, much stronger!<br/><br/>Previously, a large number of void dynasty’s disciples in the ruler realm were killed by Wang Xian and had yet to recover.<br/><br/>“Demonic Fiend, Fallen Shadow Demonic Emperor, I have a move that I can use now. Get Ready!”<br/><br/>A lot of time passed in the past year.<br/><br/>Wang Xian and the rest shuttled through the spatial rift rapidly.<br/><br/>In front of them was the figure of the king of Void.<br/><br/>As time passed, the ability of the Netherworld Dragon to chase could be used again!<br/><br/>Devil Fiend and Fallen Shadow Devil Emperor were beside Wang Yun. They nodded at the same time.<br/><br/>Buzz<br/><br/>In the next instant, Wang Xian opened the black hole that the Netherworld Dragon was chasing after.<br/><br/>A black hole immediately appeared beside the king of Void.<br/><br/>“Not good!”<br/><br/>When the king of Void sensed this black hole, his expression changed drastically.<br/><br/>He had already experienced this black hole.<br/><br/>It was able to appear beside him in an instant.<br/><br/>“Roar Roar!”<br/><br/>“TSK TSK tsk, King of Void, you can’t escape. Be obedient and accept your death!”<br/><br/>Wang Xian and the rest’s roars and cold voices rang out.<br/><br/>This caused the king of the Void’s heart to sink.<br/><br/>The trump cards of three people were much more than the trump cards of him alone.<br/><br/>He was in danger.\t\t\t\t\t\t</div>", "images": {}, "success": true}