{"id": 1363, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075178.html", "title": "Chapter 4366 - Chapter 4366: 4,365 — An All-Out War, A War Of The Universe! 4", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4366 - Chapter 4366: 4,365 — An All-Out War, A War Of The Universe! 4</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4366: 4,365 — an all-out war, a war of the universe! 4<br/><br/>Translator: 549690339<br/><br/>Every treasure had a limit to how much it could withstand.<br/><br/>Even if it was the ultimate treasure of the Heaven’s origin.<br/><br/>Take the ancestral tree as an example. If Wang Xian’s strength had achieved another breakthrough.<br/><br/>It was possible that Wang Xian could not recover from his peak condition by using the mother’s womb fruit to revive.<br/><br/>Perhaps after Wang Xian tried using it to revive, he could only attain the strength of the Great Dao. The rest would require resources to recover.<br/><br/>This was the problem of energy crossing the line.<br/><br/>There was a limit to the treasures that could be revived, as well as treasures like the resurrection flower.<br/><br/>Boom! Boom! Boom<br/><br/>“Ah!”<br/><br/>However, when the king of Void used his powerful innate skill to move Wang Xian to the side.<br/><br/>The attacks of the demonic fiend and the fallen Shadow Demon Emperor had already landed on the body of the king of Void.<br/><br/>Wang Xian’s strength was already stronger than the king of Void.<br/><br/>The king of Void needed to use 100% of his strength to deal with Wang Xian.<br/><br/>After dealing with Wang Xian, how would he have the chance to deal with Wang Xian?<br/><br/>The terrifying energy landed on his body and immediately caused a large number of wounds to appear on his body.<br/><br/>This attack had caused him to be severely injured!<br/><br/>The king of Void’s pale eyes were filled with shock and anger.<br/><br/>He swept his gaze across Wang Xian and the rest and growled, “Mirror Universe!”<br/><br/>A terrifying power burst out from his pupils as a mirror-like space appeared one after another.<br/><br/>In each mirror, there was a king of Void!<br/><br/>Countless mirrors and countless phantoms pounced towards Wang Xian and the rest!<br/><br/>“Leave it to me!”<br/><br/>When Mo Sha saw the king of Void’s move, a solemn expression appeared on his face.<br/><br/>“Hell descends, demons dance wildly!”<br/><br/>With a loud roar, the entire space turned black and red!<br/><br/>The black and red space enveloped all the mirrors and attacked the king of void in the mirror!<br/><br/>“He wants to escape, to the right!”<br/><br/>At this moment, a message was displayed on the divination lamp.<br/><br/>Wang Xian’s eyes focused. He waved his dragon claws and endless chains attacked the figure of the king of Void!<br/><br/>“King of Void, you shall stay here today. Don’t even think about escaping!”<br/><br/>The Fallen Shadow Demon Emperor’s pair of blood-red eyes stared at everything as he waved his arm.<br/><br/>The demon’s arm crossed the void and grabbed at the king of Void!<br/><br/>“Crash!”<br/><br/>All the mirrors in the surroundings were slowly shattered by the demon’s attack.<br/><br/>The king of Void’s surroundings were entangled by the chains.<br/><br/>A demonic hand grabbed his body!<br/><br/>When the king of Void saw this scene, his face was filled with shock, anger, and embarrassment!<br/><br/>The spatial attribute was good at escaping.<br/><br/>However, there was a limit to this.<br/><br/>He already had a lot of escape methods!<br/><br/>However, he had to face Wang Xian and the other two great dao existences.<br/><br/>He had a lot of tricks and trump cards. Wang Xian and the others also had a lot of them!<br/><br/>One against three, he was still lacking by a lot!<br/><br/>“All of you deserve to die!”<br/><br/>The king of Void was in despair. He roared furiously!<br/><br/>“All of you deserve to die!”<br/><br/>He roared with all his might once again. His body trembled and the spot on his chest cracked open.<br/><br/>An illusory image of the universe appeared directly!<br/><br/>The space disc on his staff entered his chest directly!<br/><br/>“Crackle crackle!”<br/><br/>However, at this instant, the chains around him descended into endless lightning and attacked the spatial disc!<br/><br/>The void King stared at everything with a cold expression.<br/><br/>“Destroy him!”<br/><br/>The Fallen Shadow Devil Emperor roared at Mosha!<br/><br/>Mosha moved and spat out a blood-red ball, flying towards the void King.<br/><br/>This time, the king of Void did not stop him!<br/><br/>He knew that he could not escape!<br/><br/>Facing the three top-tier existences like the Dragon King, he could not escape at all!<br/><br/>Now, he used most of the energy in his body to open a passage.<br/><br/>He could be killed.<br/><br/>But the treasures and resources in his hands could not be lost!<br/><br/>Otherwise, the losses this time would be too great!<br/><br/>Especially the void disk, the most precious treasure of the Heaven’s origin creation realm.<br/><br/>He definitely could not throw it away!<br/><br/>Buzz Buzz<br/><br/>The blood-red ball enveloped him and quickly melted the life force in his body.<br/><br/>The king of Void’s eyes were filled with killing intent as he stared at Wang Xian and the other two!<br/><br/>At his chest, the void disk entered his body and entered the illusory universe!<br/><br/>In the end, his life force completely disappeared.<br/><br/>Wang Xian’s body moved and flew over directly. He kept the corpse and opened the space where the Netherworld Dragon was chasing him!<br/><br/>“Let’s get the treasures and resources that he sent away first!”<br/><br/>Wang Xian shouted immediately!<br/><br/>His eyes were sparkling.<br/><br/>He wanted to send the treasures and resources away even though he was facing the three of them?<br/><br/>Wasn’t he looking down on them too much?<br/><br/>Buzz<br/><br/>The passageway opened and Wang Xian and the rest entered in an instant!<br/><br/>The void disk appeared in his line of sight!<br/><br/>Wang Xian waved his dragon claw and clawed at it directly!<br/><br/>Buzz<br/><br/>However, at this instant, the void disk flickered slightly and flew forward rapidly.<br/><br/>In front of him was a planet within the territory of the Void dynasty<br/><br/>This was not the center of the Void Universe.<br/><br/>It was the king of Void, a place for resurrection!<br/><br/>The King of Void, the first place where a life form was resurrected, was not at the palace of the Void dynasty.<br/><br/>This was to prevent a powerful enemy from coming directly to the palace of the Void dynasty after killing him once.<br/><br/>However, the king of Void did not expect Wang Xian to be able to chase him from such a faraway place!<br/><br/>Wang Xian’s body trembled. It was as if the void disk had sunk into a quagmire.<br/><br/>“Let Go!”<br/><br/>At this moment, the King of Void’s furious roar was heard.<br/><br/>“Hehe!”<br/><br/>Wang Xian smiled.<br/><br/>Before he could speak, the fallen Shadow Demon Emperor and the demonic fiend charged towards the direction where the king of Void was resurrected!<br/><br/>Boom Boom<br/><br/>Boom Boom<br/><br/>Two extremely terrifying attacks instantly destroyed the planet in front of them.<br/><br/>The figure of the king of void quickly dodged into the distance.<br/><br/>As for the void disk, he did not dare to retrieve it.<br/><br/>He could only control it from afar!<br/><br/>Buzz<br/><br/>Wang Xian instantly arrived in front of the void disk. With a wave of his arm, a surge of energy suppressed it firmly.<br/><br/>At the same time, with a slight movement of his palm, the Tai Chi Dragon Disk and the Void Dragon Pool appeared.<br/><br/>Three powerful supreme treasures sealed the void disc.<br/><br/>Suppression!<br/><br/>Wang Xian waved his arm and kept it.<br/><br/>Although this would reduce Wang Xian’s strength by one mastery level.<br/><br/>At the same time, even if the king of Void didn’t have the void disc, it would also reduce one mastery level!<br/><br/>“Kill!”<br/><br/>After Wang Xian kept it, he stared at the king of Void and chased after it.<br/><br/>At the same time, a piece of news was also sent to the Elven Empress Dragon Palace.<br/><br/>The Battle of the universe had begun!<br/><br/>“Huff! Huff!”<br/><br/>The king of Void felt that his heaven origin destiny treasure was being suppressed. His breathing was rapid.<br/><br/>However, at this moment, he didn’t dare to fight head-on with Wang Xian and the rest.<br/><br/>In fact, he didn’t even dare to get close to them.<br/><br/>Relying on the huge distance between them, the king of Void tried his best to flee into the distance.<br/><br/>Toward the palace of the Void dynasty!\t\t\t\t\t\t</div>", "images": {}, "success": true}