{"id": 1361, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075170.html", "title": "Chapter 4364 - Chapter 4364: 4363, An All-Out War, The Battle Of The Universe 2", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4364 - Chapter 4364: 4363, An All-Out War, The Battle Of The Universe 2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4364: 4363, an all-out war, the Battle of the Universe 2<br/><br/>Translator: 549690339<br/><br/>The strength of the Dragon Palace made everyone boil with excitement.<br/><br/>The strong disciples of the nine-origin universe had never expected that the Dragon Palace would be so powerful.<br/><br/>It was beyond their imagination.<br/><br/>Even though they were mentally prepared, they were still shocked.<br/><br/>The gap was too big.<br/><br/>Moreover, among the other peak races, many powerhouses in the Heavenly Yuan creation realm respected the Dragon King.<br/><br/>“No wonder the Dragon King and the fallen Shadow Demon Emperor said that they want to invade the Void universe and start a war. With the Dragon King around, we are more than enough to destroy them.”<br/><br/>The twelve ancestral witches spoke. Their eyes were filled with killing intent as they looked at the universe in front of them.<br/><br/>“Let’s wait for the Horn of war between the Dragon King and the fallen Shadow Demon Emperor!”<br/><br/>The Netherworld race’s patriarch moved his hand and a black spear appeared in his hand. He spoke with a cold expression!<br/><br/>“It’s starting!”<br/><br/>After sending the message, Wang Xian concealed himself and flew toward a void pagoda.<br/><br/>At the same time, he sent a message to the Devil Fiend and the Fallen Shadow Devil Emperor.<br/><br/>He wanted them to be prepared.<br/><br/>When Wang Xian approached the Void Pagoda, the surrounding disciples of the Void Empire looked over and sized him up.<br/><br/>Right now, Wang Xian’s body was emitting the power of the space attribute.<br/><br/>In the eyes of the disciples of the Void Empire, Wang Xian might be a companion.<br/><br/>“Attack!”<br/><br/>Buzz<br/><br/>When Wang Xian was not very close to the Void Pagoda, Wang Xian moved his palm and took out the demonic circle given to him by the Fallen Shadow Demon Emperor. He injected a stream of energy into it.<br/><br/>In the next instant, the figures of the fallen Shadow Demon Emperor and the Demonic Fiend immediately appeared in the demonic circle.<br/><br/>Boom! Boom<br/><br/>Boom! Boom<br/><br/>The moment they appeared, Wang Xian also moved.<br/><br/>He moved and attacked a void pagoda on the right.<br/><br/>At the same time, he left the five elements Millstone and the Tai Chi Dragon Plate to Mo Sha.<br/><br/>The moment Wang Xian made his move, Mo Sha also moved.<br/><br/>He took the Five Elements Millstone and the Tai Chi Dragon Plate and flew toward the Void Pagoda on the left.<br/><br/>The Fallen Shadow Demon Emperor dashed towards the Void Pagoda in front of him.<br/><br/>Everything happened in an instant!<br/><br/>Buzz! Buzz! Buzz<br/><br/>At the furthest spot from them.<br/><br/>The Void Pagoda that belonged to the king of Void unleashed its might when Wang Xian appeared.<br/><br/>The moment the demonic fiend and the fallen Shadow Demon Emperor appeared, it emitted a spatial fluctuation!<br/><br/>The entire Void Pagoda was instinctively hidden in the void crack!<br/><br/>“HMM?”<br/><br/>The void King within the Void Pagoda opened his eyes, filled with cold and disdainful killing intent.<br/><br/>“Those reckless things, do they still dare to attack?”<br/><br/>The void King coldly spoke.<br/><br/>But very quickly, he felt that something was wrong.<br/><br/>There were powers outside that were not weaker than him.<br/><br/>There were several such powers.<br/><br/>“They found helpers?”<br/><br/>Void King’s expression changed slightly, and his body immediately appeared in the sky above the Void Pagoda!<br/><br/>The sudden attack seemed like the arrival of a great being from the Thousand Autumn Universe.<br/><br/>Weng<br/><br/>However, the moment he came out, he saw a terrifying scene.<br/><br/>On both sides, the other three void pagodas under him were being attacked!<br/><br/>That destructive energy instantly landed on the void towers.<br/><br/>The three void towers directly collapsed, completely unable to withstand it.<br/><br/>The energy that was filled with death destroyed everything within the void towers.<br/><br/>“Boom! Boom!”<br/><br/>“Not good!”<br/><br/>From within the Void Towers, a terrified voice sounded.<br/><br/>Some control-level experts were instantly killed.<br/><br/>There was also a control-level expert who was instantly resurrected after being killed.<br/><br/>However, the space around them was completely enveloped.<br/><br/>The moment they resurrected, they continued to suffer a destructive attack.<br/><br/>This destructive attack was not something they could withstand.<br/><br/>This was a power that belonged to the Great Dao level.<br/><br/>The area-of-effect energy covered them. As long as they were resurrected with treasures, what awaited them was still death!<br/><br/>Boom! Boom! Boom<br/><br/>The sounds of the explosions were incessant.<br/><br/>The vitality of the three powerhouses from the Void universe vanished.<br/><br/>Among them, there were two existences at the control level. Even after resurrecting once, they still died.<br/><br/>One of them had resurrected twice in total.<br/><br/>However, their resurrections were all resurrected on the spot.<br/><br/>They were all attacks that evaded attacks that were sufficient to kill them.<br/><br/>However, since Wang Xian and the rest had made their move, they had to prevent such a situation.<br/><br/>Therefore, their attacks were all all-encompassing.<br/><br/>It was all-encompassing!<br/><br/>“Damn it, three Great Dao level existences!”<br/><br/>When the king of void saw his subordinates being killed instantly, he revealed a shocked expression.<br/><br/>“It’s the fallen Shadow Demon Emperor. It’s all of you!”<br/><br/>At this moment, he could also sense the aura of the fallen Shadow Demon Emperor!<br/><br/>Buzz<br/><br/>At the moment when the Fallen Shadow Demon Emperor roared furiously, Wang Xian and the rest rushed over.<br/><br/>Without any hesitation, they launched their most vicious attacks.<br/><br/>“Roar!”<br/><br/>Wang Xian let out a low roar and instantly transformed into a divine dragon body.<br/><br/>“Roar!”<br/><br/>The Fallen Shadow Demon Emperor roared wantonly as well. Its entire body transformed into an abyss demon with a pair of demonic horns.<br/><br/>The Demonic Fiend was also the figure of a demon with extremely terrifying demonic wings!<br/><br/>“Nine-origin Dragon Domain!”<br/><br/>“Devil Abyss!”<br/><br/>“Sea of devils!”<br/><br/>Wang Xian and the rest let out a low roar and immediately unleashed their own domains.<br/><br/>Three terrifying domains directly covered the king of Void!<br/><br/>“Nine-origin universe, Dragon King of the Dragon Palace!”<br/><br/>“It’s you guys!”<br/><br/>The King of void stared at Wang Xian and the rest with blood-red eyes and roared.<br/><br/>“King of Void, it’s time to settle our grudges. Let’s start the battle!”<br/><br/>The Fallen Shadow Demon Emperor was the first to rush over. His entire body was bursting with dark flames!<br/><br/>“Damn it, you guys want to surround and kill me? Which Universe are you from? If you guys help the nine-origin universe, you will be making an enemy out of my void universe. You will have to bear the endless vengeance of my void universe!”<br/><br/>The King of void stared at Mo Sha and roared furiously.<br/><br/>“Nine-origin universe, Dragon Palace Mo Sha!”<br/><br/>“TSK TSK, I will take your dog life today. TSK TSK TSK!”<br/><br/>Mo Sha laughed maniacally and rushed over behind the fallen Shadow Demon Emperor.<br/><br/>“Roar Roar!”<br/><br/>Wang Xian’s body trembled. He spat out fireworks and attacked directly.<br/><br/>The king of Void was very powerful.<br/><br/>He was comparable to one great dao level, one control level, and two beginner level experts.<br/><br/>However, on Wang Xian’s side, he was comparable to two dao-level cultivators.<br/><br/>The Demonic Fiend and the fallen shadow demon emperor were both comparable to one dao-level cultivator and one beginner-level cultivator.<br/><br/>Their combined strength was enough to kill the king of Void.<br/><br/>Furthermore, Wang Xian and the rest had more tricks up their sleeves when they joined forces.<br/><br/>They had more trump cards!<br/><br/>“Oh no!”<br/><br/>The king of Void’s expression changed drastically when he saw this scene.<br/><br/>Buzz! Buzz! Buzz<br/><br/>He channeled his energy into the Void Pagoda. The entire void pagoda began to tremble and turn illusory!<br/><br/>He wanted to escape.<br/><br/>Sensing the strength of Wang Xian and the rest, the king of Void knew that he was definitely not their match.<br/><br/>In fact, he was already in an extremely dangerous situation!<br/><br/>He had to escape!\t\t\t\t\t\t</div>", "images": {}, "success": true}