{"id": 1362, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075174.html", "title": "Chapter 4365 - Chapter 4365: 4,364 Started An All-Out War, A Universe War! 3", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4365 - Chapter 4365: 4,364 Started An All-Out War, A Universe War! 3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4365: 4,364 started an all-out War, a universe war! 3<br/><br/>Translator: 549690339<br/><br/>“Keke Keke, you want to escape? Dream On!”<br/><br/>“Hell enshrouds!”<br/><br/>The void tower started to turn illusory, wanting to break through the spatial crack and carry out a long-distance battle!<br/><br/>Mo Sha sensed this scene and laughed loudly.<br/><br/>He spread out his incomparably huge demon wings, and a pitch-black space instantly enveloped the void tower!<br/><br/>The Void Pagoda, which was gradually disappearing, trembled violently. It was unable to escape!<br/><br/>“King of Void, you want to escape without sparing your life. Aren’t you thinking too little of us?”<br/><br/>Wang Xian stared at this scene, his eyes filled with coldness.<br/><br/>He instantly teleported to the side of the king of Void and extended his gigantic Dragon Claw.<br/><br/>Boom<br/><br/>The Gigantic Dragon Claw landed on the top of the Void Pagoda, causing the entire void pagoda to transform!<br/><br/>“Damn it!”<br/><br/>“Dragon King, you deserve to die. The last time you attacked my palace, I didn’t seek revenge from you. This time, you actually dare to come again!”<br/><br/>The king of Void sensed that the Void Pagoda was transforming. He let out a furious roar and kept the Void Pagoda.<br/><br/>Regardless of whether it was the Void Pagoda or a treasure in the Heaven’s origin realm, there was a possibility that it would be destroyed in a battle between Wang Xian and the others.<br/><br/>This was especially so for the Void Pagoda.<br/><br/>Such a powerful treasure was not as sturdy as a treasure in the Heaven’s origin realm. Wang Xian and the others could destroy it!<br/><br/>“King of Void, it’s time to end this once and for all. This time, i, the Fallen Shadow Demon Emperor, have been waiting for a long time!”<br/><br/>Fallen Shadow Demon Emperor’s voice was filled with killing intent.<br/><br/>In the next instant, a terrifying claw attacked from below void King’s body!<br/><br/>“How can your 9-origin universe improve so quickly! ?”<br/><br/>Facing the continuous attacks, void King’s expression was extremely unsightly!<br/><br/>A staff appeared in his hand, and above the staff, a space disc began to condense!<br/><br/>The staff pointed downwards and the space disk released a terrifying power.<br/><br/>Endless space power slashed downwards.<br/><br/>“Mighty Heavenly Dragon!”<br/><br/>“Hellfire!”<br/><br/>When the king of Void blocked the attack of the Fallen Shadow Devil Emperor.<br/><br/>Wang Xian and the demonic fiend immediately moved.<br/><br/>Three against one, this was the huge advantage.<br/><br/>The king of Void had to defend with all his might against the attacks of Wang Xian and the rest!<br/><br/>However, when he was defending, the other two attacks would come at him!<br/><br/>There was nowhere to hide.<br/><br/>In the face of such a situation, he could only take it head-on!<br/><br/>Furthermore, he had to use powerful means to dodge!<br/><br/>Buzz<br/><br/>“Space reversal!”<br/><br/>The king of Void’s expression changed slightly when he sensed Wang Xian’s demonic fiend’s attack.<br/><br/>The space disk above the staff enveloped him.<br/><br/>In the next moment, it was as if yin and Yang had reversed and space had been replaced.<br/><br/>Wang Xian and the Demonic Fiend’s attack went straight through!<br/><br/>It did not cause any damage to him.<br/><br/>“This is the ability of the ultimate treasure of Heaven’s origin!”<br/><br/>When Wang Xian saw this scene, his gaze focused and he shouted in a low voice, “Continue to attack!”<br/><br/>Wang Xian’s dragon horn emitted a terrifying luster.<br/><br/>The colorful energy pillar charged straight towards the king of Void.<br/><br/>The Demonic Fiend and the fallen Shadow Demon Emperor’s attack also went straight for him.<br/><br/>However, what surprised Wang Xian was that their attacks penetrated through the void once again.<br/><br/>The king of Void seemed to be in another void.<br/><br/>“The strongest ability of his heaven origin destiny treasure is to place him in another void. He can’t be attacked at all. He can only wait for this skill to disappear!”<br/><br/>When the fallen Shadow Demon Emperor saw this scene, he immediately shouted loudly!<br/><br/>Wang Xian’s eyes focused. With a move of his arm, the divination lamp appeared at the side!<br/><br/>Buzz<br/><br/>Following that, a stream of information appeared in his mind.<br/><br/>“This ability can be maintained for a total of three minutes. During these three minutes, he can move, escape, or even teleport!”<br/><br/>“He’s going to teleport!”<br/><br/>After Wang Xian received the information, he immediately transmitted his voice to the fallen Shadow Demon Emperor!<br/><br/>“So Powerful?”<br/><br/>A shocked expression appeared on Devil Emperor’s face.<br/><br/>“Dragon King of the Dragon Palace, Devil Emperor of the Fallen Shadow, just you wait.”<br/><br/>At this moment, the King of Void roared with a face full of killing intent. His figure disappeared instantly!<br/><br/>“Teleport? You Underestimate Me!”<br/><br/>Devil Emperor of the Fallen Shadow revealed a cold expression. “Break the realm, soul chasing chains!”<br/><br/>In the next instant, he waved his arm and a chain entered the void.<br/><br/>Following that, the chain went towards Wang Xian and the Devil Emperor!<br/><br/>Wang Xian and the Devil Emperor did not resist it.<br/><br/>In the next instant, the chain disappeared with Wang Xian and the rest.<br/><br/>Following that, they saw the figure of the king of Void once again.<br/><br/>“HMPH!”<br/><br/>When the king of Void saw the fallen Shadow Devil Emperor and the rest chasing after him, his face turned extremely gloomy. He teleported once again!<br/><br/>“This time, he can only teleport one last time!”<br/><br/>Wang Xian used his divination lamp to perform divination. When he realized that his teleportation would consume a huge amount of his heaven origin destiny treasure, he immediately shouted!<br/><br/>“I can still chase after my soul one last time!”<br/><br/>The falling shadow demon emperor shouted at Wang Xian!<br/><br/>The king of Void disappeared, and so did they. They traversed through a long space and chased after him again!<br/><br/>“I want to see how many times you can follow me!”<br/><br/>The king of Void’s face turned gloomy. Blood seeped out from his defeated pupils as he disappeared once again!<br/><br/>“Let me do it!”<br/><br/>Wang Xian shouted in a low voice. The Netherworld Dragon chased after him and a black hole appeared!<br/><br/>They passed through the black hole swiftly!<br/><br/>“Attack him. The ultimate skill of the Heaven’s origin creation treasure has disappeared.”<br/><br/>Wang Xian shouted immediately.<br/><br/>He swayed his gigantic body and charged directly at the king of Void.<br/><br/>This attack had completely given up on defense!<br/><br/>“Damn it!”<br/><br/>When the king of Void saw Wang Xian charging straight at him, he looked extremely embarrassed!<br/><br/>He had used up more than half of his trump cards in an instant, yet he was still unable to get rid of Wang Xian and the rest.<br/><br/>“Slash, Slash, Slash!”<br/><br/>He waved the staff in his hand. The space disk on the staff emitted a glow.<br/><br/>Numerous attacks regardless of the distance landed on Wang Xian’s body.<br/><br/>“Bang! Bang! Bang!”<br/><br/>A large number of attacks landed on his body. Even though Wang Xian was stronger than him, there were still wounds on his body.<br/><br/>However, he did not stop. He risked his injuries and clawed at Wang Xian!<br/><br/>“Dragon King, you are courting death!”<br/><br/>The king of Void did not expect Wang Xian to not defend against his attacks at all. His eyes were slightly red as he continued to unleash powerful attacks at Wang Xian!<br/><br/>A large number of wounds appeared.<br/><br/>A space bubble enveloped Wang Xian, causing his figure to appear in another place strangely.<br/><br/>“HMM? A powerhouse with space attributes is indeed difficult to deal with!”<br/><br/>Wang Xian’s eyes focused.<br/><br/>“Nirvana Reincarnation!”<br/><br/>At the same time, his body trembled and all the injuries on his body disappeared!<br/><br/>Nirvana reincarnation was a powerful ability that came from the fusion of the black and white nirvana flowers.<br/><br/>However, in the past, regardless of how much damage Wang Xian suffered, he would be able to return to his peak within a few seconds.<br/><br/>However, with Wang Xian’s strength, the other-shore reincarnation could no longer achieve the same effect as before.<br/><br/>This was because the energy in Wang Xian’s body was too huge. There was a limit to the recovery of the other shore reincarnation.\t\t\t\t\t\t</div>", "images": {}, "success": true}