{"id": 1366, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075190.html", "title": "Chapter 4369 - Chapter 4369: 4368, An All-Out War, A War Of The Universe! 7", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4369 - Chapter 4369: 4368, An All-Out War, A War Of The Universe! 7</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4369: 4368, an all-out War, a war of the universe! 7<br/><br/>Translator: 549690339<br/><br/>“Kill!”<br/><br/>When Wang Xian came to the side of the king of Void once again through the Netherdragon’s pursuit technique.<br/><br/>His gaze focused, and his dragon tail swept out!<br/><br/>The king of Void saw that Wang Xian and the rest had locked onto him once again.<br/><br/>He was once again within the range of their attacks, and a hint of despair appeared on his face.<br/><br/>“After today, I will definitely take revenge in the future!”<br/><br/>He roared wildly, and his entire body was like a mirror as he frantically fled in all directions.<br/><br/>Densely packed, the entire void was filled with void kings.<br/><br/>Each of them carried a terrifying energy as they frantically fled in all directions.<br/><br/>This move, the void King had burned all of his life force.<br/><br/>This was also his most powerful escape move.<br/><br/>However, this escape move had a huge flaw.<br/><br/>That was, after this energy erupted, the amount of power he had left would be the same as the amount of power he had left.<br/><br/>If he had 1,000 avatars, when 100 of them escaped.<br/><br/>When these 100 avatars gathered together, it would be the power of his main body.<br/><br/>That would be 10% of his strength.<br/><br/>The rest of his strength would have to be cultivated or replenished with resources!<br/><br/>This move would only be used when he was faced with an area that he could not defend against.<br/><br/>Unless it was absolutely necessary, the void King would not use this move.<br/><br/>But now, in order to escape, he had no choice but to use this move!<br/><br/>“Sou Sou Sou!”<br/><br/>“Sou Sou Sou!”<br/><br/>Tens of thousands of figures of the king of Void fled frantically in all directions.<br/><br/>Each of them erupted with powerful abilities in a short period of time.<br/><br/>“Kill them all!”<br/><br/>Wang Xian sensed the avatars one by one and immediately shouted at Mo Sha and the Fallen Shadow Demon Emperor!<br/><br/>Their eyes focused and they immediately unleashed their strongest aoe attacks!<br/><br/>“Ahhhhh!”<br/><br/>“Ahhhhh!”<br/><br/>Endless screams rang out as the avatars of the king of Void were killed one by one.<br/><br/>However, there were still quite a number of the king of Void’s avatars that had escaped the net. They quickly fled into the distance!<br/><br/>“Split up and chase after them. As long as one of them escapes, all of them will be able to escape!”<br/><br/>Wang Xian immediately shouted. Following their movements, he quickly chased after the fishes that had escaped the net.<br/><br/>After chasing for half an hour, Wang Xian used the divination lamp to kill all the fishes that escaped from his side!<br/><br/>He took out his communication device and immediately sent a message to Mo Sha and the Fallen Shadow Demon Emperor.<br/><br/>“Dragon King, two of them escaped from my side. I can’t sense them anymore!”<br/><br/>“Dragon King, one of them escaped from my side. I’m looking for him now!”<br/><br/>Soon, the demonic fiend and the fallen Shadow Demon Emperor sent a message!<br/><br/>“Alright, I’ll look for him too.”<br/><br/>Wang Xian immediately sent them a message. Following that, he used the divination lamp to search for him.<br/><br/>Buzz! Buzz<br/><br/>At the same time, one of the avatars of the king of Void was fleeing rapidly.<br/><br/>His heart was bleeding as he felt the avatars being killed one by one!<br/><br/>This time, he burned his life force, allowing each of his avatars to burst forth with a speed at the control level.<br/><br/>Moreover, he could maintain it for five days.<br/><br/>After five days, if there were fewer avatars escaping, his strength would be reduced to the ruler level.<br/><br/>This was something that the void King found very difficult to accept.<br/><br/>However, having a life was far better than dying.<br/><br/>After dying, he would have to use up a precious resurrection treasure.<br/><br/>Now, all he had to do was escape to the palace of the Void Dynasty, and the resources he had stored would be enough for him to recover to the Great Dao level!<br/><br/>“This time, it’s too miserable!”<br/><br/>He roared in a low voice.<br/><br/>At this moment, he received a message from his subordinates.<br/><br/>When he saw the message, his face sank.<br/><br/>His subordinates had sent him a message saying that they could only hold on for a year at most.<br/><br/>After a year, they wouldn’t be able to hold out against the army of the 9-origin universe.<br/><br/>Once they couldn’t hold out, they would either flee or fight to the death.<br/><br/>They couldn’t do it, and they needed the void King to give them orders!<br/><br/>“Damn the 9-origin universe. When I return to the peak, I’ll Hunt you all day and night. If I can’t kill you, Dragon King, I won’t be able to kill the creatures of your 9-origin universe?”<br/><br/>After the void King saw this news, he said with a face full of killing intent.<br/><br/>“Wait for me to go back first.”<br/><br/>He immediately replied.<br/><br/>“There is a planet in that direction that can be teleported to the palace of the Void Dynasty!”<br/><br/>The void King’s gaze was fixed in one direction, and he flew quickly!<br/><br/>Time passed day by day.<br/><br/>When the void King sensed that his avatars were decreasing one by one, he had a bad premonition in his heart!<br/><br/>The Dragon King and the rest had a way to lock onto his clones.<br/><br/>He was terrified.<br/><br/>However, at this moment, he had no choice but to commit suicide and resurrect himself.<br/><br/>Or he could risk it all.<br/><br/>Of course, he would choose the latter.<br/><br/>“You want to escape?”<br/><br/>However, two days later, the figures of Wang Xian, Mo Sha, and the Fallen Shadow Demon Emperor instantly appeared beside him. “Hehe, King of Void, I would like to see if you can still possess the power of the Great Dao when you resurrect the next time!”<br/><br/>Wang Xian smiled. He waved his arm and restrained the king of Void!<br/><br/>At the same time, he called an lie over.<br/><br/>“Hoo Hoo!”<br/><br/>The King of void stared at Wang Xian with his blood-red eyes. He wanted to commit suicide immediately, but he realized that his body was completely controlled.<br/><br/>He stared at Wang Xian and the rest coldly without saying a word!<br/><br/>“Dragon King!”<br/><br/>After an lie arrived in front of them, he called out respectfully.<br/><br/>Wang Xian moved his palm and completely destroyed the body of the king of Void.<br/><br/>He took out the lamp of divination and immediately divined the location of the king of Void.<br/><br/>“The palace of the Void Dynasty!”<br/><br/>“His strength has been reduced to the level of control!”<br/><br/>Soon, Wang Xian received the news. His eyes shone brightly.<br/><br/>“An lie, come to the main battlefield!”<br/><br/>Wang Xian immediately instructed an lie.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded and a surge of energy enveloped them.<br/><br/>The next moment, they appeared in the battlefield in front of the Void dynasty!<br/><br/>“Damn Dragon King, Ahhhh!”<br/><br/>At this moment, the king of Void walked out from a mirror in the palace of the Void dynasty. He roared furiously!<br/><br/>The mirror behind him slowly collapsed!<br/><br/>He stared ahead and everything in the battlefield appeared in his eyes!<br/><br/>At this moment, his heart was pounding violently.<br/><br/>“No, I have to escape!”<br/><br/>His pupils contracted as he sensed the auras of Wang Xian, the Shadow Devil Emperor, and Mo Sha.<br/><br/>The king of Void didn’t hesitate at all. He brought all his treasures and left through the teleportation formation.<br/><br/>As for his subordinates, he couldn’t care about them at all!<br/><br/>Buzz! Buzz<br/><br/>At the same time, at the side of the battlefield between the 9-origin universe and the Void dynasty, the figures of Wang Xian, Mo Sha, and the Fallen Shadow Demon Emperor appeared!<br/><br/>They stared ahead.<br/><br/>An extremely powerful energy shield was blocking the attacks of the disciples of the 9-origin universe masters.<br/><br/>Inside the energy shield were hundreds of millions of disciples of the Void Dynasty Masters.<br/><br/>Even those at the venerable level were dragged to the battlefield!<br/><br/>“It’s broken!”<br/><br/>Wang Xian stared at it and rushed over instantly!<br/><br/>The Demonic Fiend, Shadow Devil Emperor, followed closely behind!\t\t\t\t\t\t</div>", "images": {}, "success": true}