{"id": 1370, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075206.html", "title": "Chapter 4373 - Chapter 4373: 4372 Killed, Destroyed, And Conquered The Void Universe", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4373 - Chapter 4373: 4372 Killed, Destroyed, And Conquered The Void Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4373: 4372 killed, destroyed, and conquered the Void Universe<br/><br/>Buzz<br/><br/>After killing all the heaven origin creation realm powerhouses in the Void universe, Wang Xian immediately rushed toward the palace of the Void dynasty.<br/><br/>Excluding the king of Void, there were eleven heaven origin creation realm powerhouses.<br/><br/>This time, Wang Xian killed a total of five.<br/><br/>The kind that was completely destroyed.<br/><br/>However, these five heaven origin creation realm powerhouses were also at the beginner level.<br/><br/>After all, most of the resources in the Void universe were occupied by the king of Void.<br/><br/>The group of beginner-level heaven origin manifestation stage powerhouses had fewer treasures to resurrect.<br/><br/>Furthermore, they were all resurrected here in the Void Universe.<br/><br/>They were easily destroyed by Wang Xian.<br/><br/>The loss of five beginner-level heaven origin manifestation stage powerhouses was already a huge blow to the entire void universe!<br/><br/>“Dragon King!”<br/><br/>When Wang Xian arrived at the palace of the Void Dynasty, the fallen Shadow Demon Emperor sensed everything and immediately flew over!<br/><br/>Around him, there were also heaven origin creator-level powerhouses who rushed over.<br/><br/>There were powerhouses from the Dragon Palace and the Hetian saint.<br/><br/>The other peak races, such as the elven empress, Patriarch Xuanwu, and the others, were not present.<br/><br/>Instead, they led an army to search for treasures.<br/><br/>Although most of the treasures in the Void universe were gathered in the Void dynasty.<br/><br/>There were still quite a number of treasures in other places.<br/><br/>It was extremely rare. Even to a group of heaven origin creation stage powerhouses, it was a huge resource!<br/><br/>“Hehe, we killed five of them and the rest escaped. How are things here?”<br/><br/>Wang Xian asked.<br/><br/>“Dragon King, the Void dynasty has been cleaned up. All the treasures and corpses have been put away. When the time comes, we will wait for Dragon King to distribute them.”<br/><br/>The Hetian Saint spoke!<br/><br/>“HMM, alright. There’s no rush to distribute them. Let’s wait for the peak races to plunder the entire void universe.”<br/><br/>Wang Xian nodded.<br/><br/>“Dragon King, the resources we have obtained this time are extremely terrifying. Not to mention other things, just the corpses of the Void Universe’s elite disciples are a huge amount of resources. There are also a large number of treasures.”<br/><br/>“There are more than a dozen important treasure lands in the Void universe that have been occupied by the Void dynasty. The resources within can be said without any exaggeration to be a little more than our nine-origin universe.”<br/><br/>The Fallen Shadow Demon Emperor said.<br/><br/>Before the rise of the Dragon Palace, the Void Universe was stronger than the nine-origin universe.<br/><br/>In addition, the nine-origin universe had many treasure lands, and the Void universe naturally had them too.<br/><br/>These treasure lands were heavily guarded by the Void dynasty.<br/><br/>They were not near the Void dynasty.<br/><br/>After all, some treasure lands could not be moved.<br/><br/>One could imagine the resources there.<br/><br/>Every peak race was envious.<br/><br/>Of course, the peak races also understood that these ten or so treasure lands were not something they could just want.<br/><br/>They had to wait for the Dragon King to come and distribute them.<br/><br/>After all, the main reason why they were able to win the cosmic battle so easily was because of the Dragon King.<br/><br/>In addition, the birth of an existence at the level of the Great Dao in the Dragon Palace had also shocked all the strong disciples in the nine-origin universe.<br/><br/>Two existences at the level of the Great Dao, in addition to the strong experts in the Dragon Palace?<br/><br/>The strength of the Dragon Palace was comparable to their combined strength.<br/><br/>A large portion of the credit for this battle was given to the Dragon Palace.<br/><br/>Wang Xian nodded his head and looked at the Fallen Shadow Devil Emperor. With a move of his palm, two corpses appeared in front of him.<br/><br/>These two corpses were the corpses of the king of Void.<br/><br/>In addition, with a move of Wang Xian’s palm, he took out the plate of void that he had suppressed.<br/><br/>It was located in the plate of void and contained a huge amount of resources.<br/><br/>There were also four corpses inside.<br/><br/>These four corpses were the ones that the king of Void had killed Qian Qiu. The four corpses were all at the control level.<br/><br/>In addition, there were also a large number of resources and treasures inside.<br/><br/>“We will divide the rewards from hunting the king of void equally based on our strength. Since I can use the void disk, the ultimate treasure of Heaven’s origin, I will take it. I can also use the corpse of the Great Dao level fallen Shadow Demon Emperor. Fallen Shadow Demon Emperor, how about these control level corpses and these resources for you?”<br/><br/>Wang Xian said to the fallen Shadow Demon Emperor.<br/><br/>This time, their gains were too great.<br/><br/>In addition, because the king of Void had conquered the Qianqiu universe, some of the treasures he obtained from the Qianqiu universe now belonged to Wang Xian and the others.<br/><br/>Since he could use the void disk, he naturally kept it.<br/><br/>This time, if it wasn’t for the Fallen Shadow Demon Emperor, he might not have been able to kill the king of Void.<br/><br/>Therefore, the Wang immortal who deserved the share would not be stingy.<br/><br/>“Dragon King, there are many more. Although I have contributed a part of my strength, without you, how can I fight against the King of Void? Furthermore, the king of Void has a grudge against me. I am already very satisfied to be able to kill him!”<br/><br/>The Fallen Shadow Demon Emperor looked at the huge amount of resources and his body trembled.<br/><br/>Disregarding everything else, just the five control-level corpses were too huge.<br/><br/>Since the advent of the apocalypse, the Dragon King had already given him two control-level corpses.<br/><br/>Now, there were five?<br/><br/>This was something he didn’t dare to imagine in the past.<br/><br/>“Shadow Devil Emperor, no matter what, you are still a senior. What you should have can’t be lacking. Furthermore, I have the ultimate treasure of Tianyuan. You can have the rest as well!”<br/><br/>“Without you this time, I won’t be able to kill the king of void a few times.”<br/><br/>Wang Xian said with a smile.<br/><br/>This was indeed what the fallen shadow demon Emperor deserved.<br/><br/>“Since the beginning of the calamity, you have given me too many resources.”<br/><br/>The Fallen Shadow Demon Emperor looked at the huge amount of resources in front of him and sighed. He didn’t put up a pretense and directly took it. “We are both from the nine-origin universe. If the Dragon King needs anything in the future, just let me know.”<br/><br/>“No problem.”<br/><br/>Wang Xian smiled.<br/><br/>According to the division of resources, the Fallen Shadow Demon Emperor obtained one-fourth.<br/><br/>Wang Xian still had three-quarters.<br/><br/>Of course, Wang Xian still had a lot of benefits.<br/><br/>The value of the ultimate treasure of Tianyuan was something that even resources could not buy.<br/><br/>“I need to completely refine this disk of nothingness. I’ll be busy now.”<br/><br/>Wang Xian spoke to the fallen Shadow Demon Emperor and the rest. Then, he went to a palace in the Void dynasty and started to refine this ultimate treasure of Tianyuan.<br/><br/>There was still the energy of the king of Void on it. Wang Xian needed to polish it off.<br/><br/>In addition, Wang Xian’s Void Dragon Avatar would refine it.<br/><br/>Once he refined it, the Void Dragon Body and this treasure would be equivalent to two control-level treasures.<br/><br/>Of course, there was another point. He wouldn’t be able to control the void dragon body of the Void Dragon Pool.<br/><br/>That was because he didn’t have any extra energy to control it.<br/><br/>Unless, Wang Xian was able to raise the realm of the Void Dragon body to the control level.<br/><br/>There were still some differences between the realm and strength.<br/><br/>The current realm of the Void Dragon body was equivalent to the old beginner level. Due to the space attribute, it was comparable to the control level.<br/><br/>However, in terms of realm, it was still not achieved.<br/><br/>However, he left behind a corpse of the Void King.<br/><br/>This corpse was a corpse of the void King’s Great Dao level.<br/><br/>It was enough to allow the void dragon body to use this corpse to improve!\t\t\t\t\t\t</div>", "images": {}, "success": true}