{"id": 1373, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075218.html", "title": "Chapter 4376 - Chapter 4376: 4375, Breakthrough", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4376 - Chapter 4376: 4375, Breakthrough</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4376: 4375, Breakthrough<br/><br/>Boom! Boom! Boom<br/><br/>In the Dragon King Palace of the Dragon Palace, Wang Xian’s gigantic body was crouching on the ground.<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>In his body, it was as though there were countless divine dragons roaring at the same time.<br/><br/>It was as though they were about to break through some kind of shackles.<br/><br/>Numerous phantoms rose up slowly and dissipated slowly.<br/><br/>An extremely vast amount of energy surged out from Wang Xian’s body towards his surroundings.<br/><br/>Buzz<br/><br/>At this moment, the primal chaos stone in Wang Xian’s body was also emitting gray energy.<br/><br/>This primal Chaos Stone was becoming more compatible with Wang Xian!<br/><br/>“Ding, congratulations to host for increasing your level. You have broken through to the pinnacle of the Universe Dominator.”<br/><br/>“Ding, congratulations to host for breaking through. The nine origins dragon field has been strengthened.”<br/><br/>Name: Wang Xian<br/><br/>Race: Nine Origins Divine Dragon (man and Dragon as one)<br/><br/>Level: pinnacle of the Universe Overlord (nine transformations as one)<br/><br/>Origin: 1% (99% needed for the next breakthrough)<br/><br/>Supernatural ability: ruling the water tribe (ruling the water tribe below one’s level)<br/><br/>Devouring creatures (devouring creatures to extract the origin)<br/><br/>Control of the five elements<br/><br/>Cultivation Method: Divine Dragon Transformation<br/><br/>Supernatural ability: soul capturing, spirit attaching<br/><br/>Law Divine Ability: Dragon Eye Lock, Five Elements Dragon Claw, Yin and yang breaking realm, eight luminaries dragon scale, Sacred Dragon Shadow, Heavenly Dragon Eight Tribes, Dragon Tomb, Cloud Dragon Rising, True Dragon Body<br/><br/>Law aspect: eight Dragon Pillars, eight dragon clones, towering dragon horns, Mighty Heavenly Dragon, divine tail playing Pearl, Dragon Breath of life, Shadow Dragon Clone, Netherworld Dragon chasing, Netherworld Dragon Transformation, life of wind and Thunder Dragon, Mad Dragon Star Explosion!<br/><br/>Domain: Nine Origins Dragon Domain<br/><br/>Control Law: metal, wood, water, fire, Earth, light, dark wind and thunder<br/><br/>Kingdom of God: Dragon Palace<br/><br/>Dragon Palace owned: innate.<br/><br/>Members of Dragon Palace: 8060450<br/><br/>At this moment, the system’s voice rang out.<br/><br/>Breakthrough!<br/><br/>Finally, a breakthrough!<br/><br/>Wang Xian’s eyes were filled with excitement and excitement.<br/><br/>He had prepared for this breakthrough for too long!<br/><br/>Feeling the powerful energy in his body, Wang Xian’s eyes were filled with excitement.<br/><br/>Cultivating nine attributes at the same time, he had reached the limit of the dominator level.<br/><br/>With the augmentation of nine attributes, he directly possessed the combat strength of the primal chaos level.<br/><br/>Every move of Wang Xian possessed great heavenly might.<br/><br/>With his strength reaching such a level, Wang Xian also realized that a special situation had occurred in his control of energy.<br/><br/>When nine attributes were combined, a mutated attribute could be formed.<br/><br/>For example, Frost.<br/><br/>It was pure frost power, the same frost power as Northern Frost.<br/><br/>There was also the ability of the mutated bone dragon.<br/><br/>The fusion power between wind and fire.<br/><br/>“I’m very strong now. In the past, I couldn’t achieve a perfect fusion between my attributes. Now that all the attributes are compatible, I can fuse them into a brand new special attribute. I’m really strong.”<br/><br/>Wang Xian sighed in his heart.<br/><br/>In addition, Wang Xian could sense that his fusion with the primal chaos stone had achieved a huge improvement after this breakthrough.<br/><br/>It had already reached 10% .<br/><br/>The power of chaos in his body had also increased by a lot.<br/><br/>However, although it had increased by a lot, in terms of total amount, it was still inferior to the nine types of elemental powers in his body.<br/><br/>The nine types of elemental energy, under the primal Chaos Stone, was also being converted into the power of chaos.<br/><br/>Wang Xian’s Dragon Claw moved slightly, and the nine types of elemental energy condensed into a sharp sword.<br/><br/>Following that, with a thought, the power of chaos condensed into a sharp sword.<br/><br/>He could sense that the sharp sword condensed from the power of chaos was much, much stronger.<br/><br/>Under the same amount of energy, the power of chaos was much higher.<br/><br/>“I have already reached a limit. If I want to break through, it will be very difficult. However, converting the nine attributes into the power of chaos can indeed improve my strength. Should I just fuse it with the primal Chaos Stone for my next improvement?”<br/><br/>“In addition, converting the power of chaos requires the power of space. The Void Divine Dragon is also very important for my next improvement.”<br/><br/>Wang Xian guessed in his heart.<br/><br/>He sensed his own power. It was at the level of chaos.<br/><br/>It was equivalent to twenty-seven existences who had just stepped into the Heaven’s origin realm.<br/><br/>This was only the power of Wang Xian’s body.<br/><br/>The Five Elements Millstone, the Tai Chi Dragon Disc, the ancestral tree, the body of the Void Divine Dragon, the Radiant Dragon Sword, and the Void Disc.<br/><br/>These could give Wang Xian an amplification of one great dao level and two beginner levels.<br/><br/>What kind of concept was this?<br/><br/>In other words, if Wang Xian’s main body didn’t make a move, he could rely on other external objects to fight against the fallen Shadow Demon Emperor.<br/><br/>As for the Fallen Shadow Demon Emperor, it was already considered a powerhouse in the universe.<br/><br/>In the Justice Universe Alliance, it was also a top-notch powerhouse.<br/><br/>“I wonder how many places I can rank in the countless universes now.”<br/><br/>Wang Xian thought to himself.<br/><br/>The current him was too strong.<br/><br/>Wang Xian was confident that he could kill a powerful universe like the nine-origin universe by himself.<br/><br/>Of course, he had to eliminate the Dragon Palace in this nine-origin universe.<br/><br/>Although the combined forces of the Fallen Shadow Demon Emperor and the others could also contend against a chaos-level existence.<br/><br/>However, Wang Xian was launching a sneak attack. Under the circumstance of beheading some powerhouses first, they were already killed by Wang Xian before they could join forces.<br/><br/>A single chaos-level existence was extremely terrifying!<br/><br/>Moreover, Wang Xian was not an ordinary chaos-level existence.<br/><br/>Wang Xian was a chaos-level existence, a great dao-level existence, and two beginner-level existences.<br/><br/>In addition, Wang Xian realized that some of his attacking methods were much less restricted.<br/><br/>For example, the Netherworld Dragon’s pursuit ability. Wang Xian needed a year’s cooldown time to use it once.<br/><br/>If he used it again within a year, his body would be damaged.<br/><br/>If he used it four times, he might die completely.<br/><br/>But now, he could use it five times without any pressure.<br/><br/>This was a little terrifying.<br/><br/>An expert at the level of Great Dao was locked onto by Wang Xian. It was almost certain that he would die.<br/><br/>Using it five times without any pressure. As for what the limit was for him to continue using it forcefully, Wang Xian did not know.<br/><br/>However, he was sure that it could exceed ten times!<br/><br/>It was almost invincible when used to pursue and kill!<br/><br/>“Next, if I want to improve, I might have to fuse with the primal Chaos Stone. I feel that it is almost impossible to break through to the Heaven’s origin blessed realm.”<br/><br/>Wang Xian felt something and mumbled.<br/><br/>There was no more path ahead of him now.<br/><br/>Wang Xian didn’t know how to cultivate anymore.<br/><br/>The only way to improve was to fuse the primal Chaos Stone.<br/><br/>“Fusing the primal chaos stone takes time and it’s very slow. Forget it. Next, I’ll improve the strength of my subordinates first.”<br/><br/>Wang Xian thought to himself. He would temporarily improve the strength of the Dragon Palace disciples.<br/><br/>He would first upgrade Guan Shuqing and the other girls to the Heaven’s origin blessed realm.<br/><br/>Currently, the Dragon Palace still had a lot of resources in their hands.<br/><br/>With a hundred times the time given by the primal chaos stones, it shouldn’t be a problem for them to achieve a breakthrough after reaching the shackle!<br/><br/>Wang Xian’s figure moved and transformed into a human form. He instructed an lie to bring him to the Great Dao of heaven.<br/><br/>The energy here was extremely abundant. The disciples of the Dragon Palace would be able to achieve a significant increase in their speed when they cultivated here.<br/><br/>Naturally, the cultivation must be done here.\t\t\t\t\t\t</div>", "images": {}, "success": true}