{"id": 1371, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075210.html", "title": "Chapter 4374 - Chapter 4374: Victory In The 4373 Battle!", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4374 - Chapter 4374: Victory In The 4373 Battle!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4374: Victory in the 4373 battle!<br/><br/>In the palace of the Void dynasty.<br/><br/>Wang Xian was grinding and refining the void disk.<br/><br/>This was definitely a very powerful Heaven’s origin creation treasure.<br/><br/>Offensive type, space attribute.<br/><br/>Space attribute, among all the attributes, held the advantage.<br/><br/>This could be considered as Wang Xian’s second Heaven’s origin creation treasure.<br/><br/>The ancestral tree was a support type while the void disk was an offensive type.<br/><br/>It was extremely powerful.<br/><br/>After refining this treasure, Wang Xian’s strength would receive another upgrade.<br/><br/>Of course, this upgrade was not much.<br/><br/>This was because once the void disk was used, the Void Dragon Pool could no longer be used.<br/><br/>It could be considered as two beginner-level combat powers.<br/><br/>At the side, the Void Dragon body was located in the primal chaos stone. It was trying to comprehend the energy from the void King’s corpse and wanted to upgrade.<br/><br/>After all, the body of the void God dragon was only comparable to the old-fashioned beginner-level heavenly Yuan creation.<br/><br/>If the body of the king of Void was used to improve his cultivation, the speed of improvement was still very fast.<br/><br/>However, even if it was very fast, it would still require at least a billion years of time.<br/><br/>When one reached the Heavenly Yuan creation realm, it was extremely difficult for one to not take a single step forward.<br/><br/>If it was an ordinary heavenly yuan creation powerhouse, 10 billion or 20 billion years might not even be able to improve a small realm.<br/><br/>However, there was one point. Wang Xian had more resources in his hands now. Within the space of the primal Chaos Stone, time was accelerated by 100 times. 10 million years was equivalent to one billion years in the outside world.<br/><br/>Wang Xian was confident that he could make a breakthrough in the body of the Void Dragon within 10 million years.<br/><br/>As he thought of this, a smile appeared on Wang Xian’s face.<br/><br/>Once the body of the Void Dragon was upgraded, both the Void Dragon Pool and the void disk could be used.<br/><br/>This was equivalent to upgrading two levels.<br/><br/>Time passed by little by little. After a few thousand years, the void disk was completely refined by Wang Xian.<br/><br/>On this day, the armies of the nine-origin universe returned to the palace of the Void dynasty.<br/><br/>After a few thousand years, the armies of the nine-origin universe traversed the entire void universe.<br/><br/>They collected all the treasures and resources.<br/><br/>Other than a dozen or so well-known treasure grounds, the treasures in the rest of the places belonged to whoever obtained them.<br/><br/>Every peak race and every expert had reaped great rewards!<br/><br/>“Dragon King, all the experts have returned.”<br/><br/>Mo Sha came to Wang Xian’s side and reported to him.<br/><br/>“Alright, let’s gather everyone and discuss the allocation of resources.”<br/><br/>Wang Xian spoke to them!<br/><br/>“Yes!”<br/><br/>Mo Sha nodded.<br/><br/>Soon, more than a dozen experts from the nine-origin universe, led by the Fallen Shadow Devil Emperor, gathered.<br/><br/>Every expert had a smile on their faces!<br/><br/>“How was the harvest?”<br/><br/>Wang Xian looked at them and asked with a smile.<br/><br/>“Hehe, the harvest was great. It was so great, especially the feeling of sweeping across the Void Universe.”<br/><br/>The Hetian Saint couldn’t help but say!<br/><br/>The saint’s bloodline had finally avenged their grudge.<br/><br/>The other experts were also in a good mood!<br/><br/>“Next, let’s talk about the resources of the Void dynasty, including the corpses of the Heavenly Yuan creation realm and the eleven corpses we killed here. Share Them!”<br/><br/>“Also, you guys will not participate in the distribution of the void King that we killed with the fallen Shadow Demon Emperor.”<br/><br/>Wang Xian said to them.<br/><br/>“Of course. In fact, most of the 11 Heaven’s origin realm powerhouses that were killed in the Void Empire were all thanks to you guys, Dragon King. We are just picking up scraps.”<br/><br/>The Netherworld race’s patriarch said!<br/><br/>Among the 11 heaven origin creation stage powerhouses in the Void dynasty, Wang Xian instantly killed four of them.<br/><br/>The Fallen Shadow Demon Emperor, Mo Sha, and the rest also killed one of them.<br/><br/>It could be said that in terms of merits and achievements, the Dragon Palace had the most, followed by the demon race.<br/><br/>“Our Dragon Palace will take 40% of the resources here.”<br/><br/>Wang Xian nodded and said directly.<br/><br/>“From the King of Void, you have already given me enough resources. I Won’t take too much. Our demon race only wants 0.5% .”<br/><br/>When the Fallen Shadow Demon Emperor heard Wang Xian’s words, he spoke directly!<br/><br/>If it was based on Strength and merit…<br/><br/>The overall strength of the Dragon Palace was comparable to all the other peak races in the nine-origin universe.<br/><br/>Even if the Dragon Palace took half, it was only right for them to take 50% .<br/><br/>Taking 40% was already taking too little.<br/><br/>It was already taking care of the other peak races!<br/><br/>As for the Fallen Shadow Demon Emperor, it was the same.<br/><br/>Based on how he killed a control-level heavenly yuan creator-level powerhouse in the Void dynasty, it shouldn’t be a problem for him to take 10% .<br/><br/>In addition, the demon race also had a heavenly yuan creator-level powerhouse.<br/><br/>Taking 0.5% was considered a small amount.<br/><br/>Don’t look down on this 10% and 50% . This was a huge amount of resources!<br/><br/>A terrifying amount of resources!<br/><br/>“Dragon King, please don’t take too little from the Fallen Shadow Demon Emperor. Speaking of which, although we are not here to fill up the numbers, we have not helped much. You can take more.”<br/><br/>The Elven empress spoke!<br/><br/>“It’s settled then. The distribution of the remaining resources will be based on the strength of each of your peak races. In addition, you will also have to include the disciples who are at least at the seventh level of the Overlord realm. The overall strength will be based on the number of disciples.”<br/><br/>“How is it?”<br/><br/>Wang Xian continued to speak to them.<br/><br/>“Our distribution is very fair. Only Senior Dragon King and Fallen Shadow Demon Emperor, your distribution is unfair.”<br/><br/>The He Tian saint nodded his head.<br/><br/>“Hehe, our harvest is already very huge. You guys can take it and strive to produce more powerhouses who have reached the shackle.”<br/><br/>The Fallen Shadow Demon Emperor shook his head and said with a smile.<br/><br/>This time, the harvest of the demon race was also very terrifying.<br/><br/>The Fallen Shadow Demon Emperor was already very satisfied.<br/><br/>“It’s settled then. Let’s sit down and have a discussion later.”<br/><br/>Wang Xian nodded his head.<br/><br/>Following that, everyone took out all the resources and distributed them.<br/><br/>Putting everything aside, just the corpses of eleven powerhouses in the Heaven’s origin realm were enough to make the celestial nation, Royal Family, Divine Tiger clan, skeleton clan, and the other peak races who were not very strong go crazy.<br/><br/>How could they obtain a heaven origin creation realm corpse on their own?<br/><br/>Don’t even think about it!<br/><br/>Although they could not use the heaven origin creation realm treasures with space attributes, they could go to the Justice Alliance and trade for powerful resources and treasures.<br/><br/>Every heaven origin creation realm expert would be given a corpse.<br/><br/>Apart from the corpse, there were also a huge amount of resources in the void space.<br/><br/>After some distribution, all the powerhouses from the peak races started to store the treasures.<br/><br/>After a few hundred years, all the treasures and resources were taken care of.<br/><br/>Wang Xian and the rest were preparing to return.<br/><br/>All the powerhouses were preparing to return to the nine-origin universe.<br/><br/>Once they returned there, they would celebrate.<br/><br/>They would celebrate!<br/><br/>Wang Xian also agreed. After all, they had conquered the void universe and taken revenge.<br/><br/>With such a huge harvest, every powerhouse was very happy.<br/><br/>Every disciple was very happy.<br/><br/>Furthermore, the current nine-origin universe was very powerful!<br/><br/>They were proud of it!\t\t\t\t\t\t</div>", "images": {}, "success": true}