{"id": 1378, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075238.html", "title": "Chapter 4381 - Chapter 4381: 4,380 Experts", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4381 - Chapter 4381: 4,380 Experts</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4381: 4,380 experts<br/><br/>In front of the six paths universe.<br/><br/>An incomparably huge spaceship was flying in the chaos.<br/><br/>The entire spaceship was 10,000 meters in size and was emitting a metallic luster.<br/><br/>The powerful power of technology made its speed extremely terrifying.<br/><br/>The entire spaceship was filled with dreams.<br/><br/>At the same time, within the spaceship, there were more than ten figures sitting inside. There were fine wine, delicious food, and some small pets in the ruler realm.<br/><br/>“Eh? Haha, Patriarch of the Cangtian sect, I received a message from someone in the six paths universe.”<br/><br/>More than ten experts were sitting in a palace.<br/><br/>An old man was holding a communication device. When he saw the message, he suddenly smiled and said to a middle-aged man in the center.<br/><br/>The middle-aged man in the center was tall and sturdy. His whole body was covered in golden light.<br/><br/>He had a pair of golden pupils.<br/><br/>There was a golden pupil between his brows.<br/><br/>This golden pupil contained a powerful pressure.<br/><br/>This wasn’t an eye, but an extremely powerful heavenly yuan destiny treasure.<br/><br/>There was also a woman in the middle-aged man’s arms.<br/><br/>The woman was mature and beautiful. Her stomach was slightly bulging.<br/><br/>The aura of the woman was also extremely powerful. She was an existence at the control level.<br/><br/>“Oh? The six paths universe sent news? Hehe, What News?”<br/><br/>Ao Cang Tian looked at the old man and asked with a smile.<br/><br/>“The powerhouses of the six paths universe sent news that they want to talk to you at the six paths universe’s Mu Li tribe.”<br/><br/>The old man said.<br/><br/>“Haha, Go and have a talk with them? Alright, Alright, let’s have a talk.”<br/><br/>Ao Cang Tian said with a smile.<br/><br/>“Haha, Patriarch of the Cang Heaven sect, if we can’t have a good talk, then we have a good talk.”<br/><br/>At this moment, four middle-aged elders who were emitting special energy looked at the Patriarch of the Cang Heaven sect and said with a smile.<br/><br/>“Of course. I am determined to get the wood element heavenly fate treasure. When the child in Mulan’s belly is born, I will prepare a big gift for him. hahaha!”<br/><br/>Ao cang heaven laughed and gently stroked his wife’s belly.<br/><br/>“Hehe!”<br/><br/>The woman called Mulan smiled and her face was full of smiles.<br/><br/>“If the six paths universe doesn’t know what’s good for them, then destroy them all. When the time comes, the six paths universe will belong to your belief universe. You can also use your methods to help me lock onto the wood element heavenly fate treasure!”<br/><br/>Ao Cang Tian continued!<br/><br/>“Alright!”<br/><br/>The four control level heavenly creation great beings from the belief universes nodded with smiles on their faces.<br/><br/>They believed in the universe and had a good relationship with the Cang Tian universe to begin with. Their relationship with Ao Cang Tian was good.<br/><br/>This cooperation was also a one-hit deal.<br/><br/>If the six paths universes were willing to obediently hand over the heavenly creation true treasure, then their belief universes didn’t care. They could treat it as a good relationship with Ao Cang Tian.<br/><br/>If they weren’t willing to hand it over, then that would be even better!<br/><br/>“Get Someone to pass a message to the experts of the six paths universes. Tell them to prepare the heavenly yuan destiny true treasure. Otherwise, I will slaughter the entire six paths universe and lead the six paths universe to disappear!”<br/><br/>Ao Cang Tian looked at the old man and ordered.<br/><br/>“It’s the ancestor of the Cang Heaven Sect!”<br/><br/>The old man nodded.<br/><br/>The spaceship continued to fly unscrupulously in the direction of the six paths universe.<br/><br/>Soon, the spaceship entered the six paths universe. The Patriarch of the Cangtian sect and the rest obtained the location of the Mu Li tribe and rushed over.<br/><br/>“Dragon King, Ao Cangtian sent a message to tell us to prepare the ultimate treasure of Tianyuan creation. Otherwise, they will slaughter the living beings in our six paths universe and make the six paths universe disappear completely.”<br/><br/>In the main hall of the Mu Li tribe, the undead received the message and spoke to Wang Xian with an embarrassed expression.<br/><br/>“Now that the experts from the belief universe are involved, if a war really breaks out, the belief universe will definitely participate in the war. They will absorb the power of belief from our six paths universe and make the disciples of our six paths universe become their puppets.”<br/><br/>Tusha city spoke with a gloomy expression!<br/><br/>“Wait for them to come over.”<br/><br/>Wang Xian heard their words and spoke calmly.<br/><br/>Wang Xian really didn’t care about the proud heaven and the experts from the belief universe.<br/><br/>When the time came, if the other party couldn’t give him a satisfactory explanation.<br/><br/>Then, it just so happened that the resources of the Dragon Palace were almost exhausted.<br/><br/>When the time came, he could get some resources!<br/><br/>“Dragon King, this is the communication device from the land of origin. There is some information about the Cang Heaven Universe and the belief universe on it!”<br/><br/>The undead waved his arm and floated a communication device in front of Wang Xian.<br/><br/>Wang Xian nodded and took it over to check it out.<br/><br/>The land of origin was a gathering place for the strong practitioners of the Heaven’s origin.<br/><br/>As time passed and there were more strong practitioners, there would naturally be a communication device.<br/><br/>From the communication device, Wang Xian had a simple understanding of the Cang Heaven Universe.<br/><br/>“Twelve powerhouses in the Heaven’s origin realm. Their strength is similar to the former nine-origin universe. The Strongest One, ao Cang Heaven, has a treasure in the Heaven’s origin realm.”<br/><br/>Wang Xian watched and pondered in his heart.<br/><br/>In addition, he checked some information about the belief universe.<br/><br/>The overall strength of the belief universe was stronger than the Cang Heaven Universe.<br/><br/>This was because there were currently two universes in the belief universe. The Holy Palace in the 24 palaces also had existences on the level of Great Dao.<br/><br/>Of course, the belief universe’s 24 palaces were not united.<br/><br/>Many of them fought for themselves.<br/><br/>Wang Xian looked at the information and did not take it seriously.<br/><br/>In the following period of time, he followed Tianci around the Mu Li tribe.<br/><br/>More than two hundred years later, the spirits of the dead sent news that AO Cangtian and the rest had entered the six paths universe.<br/><br/>It wouldn’t be long before they arrived at the Mu Li tribe!<br/><br/>“When the time comes, give them a good welcome!”<br/><br/>Wang Xian said faintly.<br/><br/>Seeing the Dragon King was so calm, the spirits of the dead sand city’s golden leopard and the rest felt a little more at ease.<br/><br/>Perhaps, the Dragon King had his own trump card.<br/><br/>Furthermore, they also knew that the universe where the Dragon King was located was very powerful.<br/><br/>Perhaps the Dragon King could find a powerful helper.<br/><br/>A few hundred years passed once again.<br/><br/>“Foster father, according to our investigation, the spaceship AO Cangtian and the rest are in the range of the Mu Li tribe. They should be arriving soon!”<br/><br/>On this day, Tianci came to the palace and reported to Wang Xian!<br/><br/>“Alright, we will wait for them from above!”<br/><br/>Wang Xian nodded his head.<br/><br/>At this moment, he also felt something and looked in one direction.<br/><br/>Wang Xian smiled and flew directly to the sky.<br/><br/>Tianci immediately followed behind.<br/><br/>The three of them, who had been staying in the Mu Li tribe, immediately flew to the sky.<br/><br/>They looked to the right.<br/><br/>In their line of sight, a spaceship was flying towards them at a terrifying speed!\t\t\t\t\t\t</div>", "images": {}, "success": true}