{"id": 1377, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075234.html", "title": "Chapter 4380 - Chapter 4380: 4379 Snatching The Heavenly Fate Treasure?", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4380 - Chapter 4380: 4379 Snatching The Heavenly Fate Treasure?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4380: 4379 snatching the Heavenly Fate Treasure?<br/><br/>Tianci was killed.<br/><br/>Now, the six paths universe was also in danger.<br/><br/>What was certain was that the other party’s strength was not weak.<br/><br/>It was not as simple as just a Great Dao warrior.<br/><br/>In the entire six paths universe, with Tianci’s strength, along with the undead, golden leopard, and sand city, they were already able to fight against a Great Dao warrior.<br/><br/>However, now that the six paths universe was in danger, they must have been invaded by a powerful enemy!<br/><br/>Tianci looked at his foster father and nodded.<br/><br/>The undead of the six paths universe had sent him an urgent message. A powerhouse was about to invade the six paths universe.<br/><br/>And the powerhouse that invaded them was the powerhouse that had killed him.<br/><br/>In addition, there was also a powerful force that worked together with that powerhouse.<br/><br/>Facing such an enemy, their six paths universe could not withstand it.<br/><br/>They had no way to do anything about it.<br/><br/>The Golden Leopard of the dead wanted Tianci to call for help from the Dragon King!<br/><br/>In addition, the cause of this incident was also caused by TIANCI.<br/><br/>The reason was that there were powerhouses who wanted to plunder TIANCI’s ultimate treasure of Tianyuan!<br/><br/>“Tell me, what exactly is it?”<br/><br/>Wang Xian brought Tianyuan to the six paths of the universe.<br/><br/>When they arrived at the Mu Li tribe, they asked him.<br/><br/>“Foster father, the reason for this is at the land of origin. Uncle Undead and I were preparing to hunt the chaos behemoth to look for treasures. During the hunt for a Chaos Behemoth, we had a fight with the other powerhouses.”<br/><br/>“The fight was nothing at first, but later, those few experts brought more experts. There was a great dao expert. He said that he wanted the heavenly fate treasure in my body, so I naturally didn’t agree.”<br/><br/>“The other party was very strong. He also had a heavenly fate treasure, and his strength reached the Great Dao level. I couldn’t beat him, so I was killed by him.”<br/><br/>Tianci said. Then, he thought of something and said, “Oh right, foster father, among them, there are some who use the power of faith. They seem to be strong people who believe in the universe.”<br/><br/>“There are also strong people who believe in the Universe? Have you seen them before?”<br/><br/>Wang Xian raised his eyebrows and asked.<br/><br/>“No, they are not the few strong people who believe in the universe who were killed by you, foster father. However, they do use the power of faith.”<br/><br/>Tianci replied.<br/><br/>“HMM, they should be the masters of the universe of faith. The universe of faith is very strong. They have two universes, Hehe!”<br/><br/>Wang Xian smiled coldly. “What’s the situation now?”<br/><br/>“Uncle Undead and the rest told me that the group of people has invaded. With their strength, the six paths universe can not withstand them. They said that if I don’t hand over the ultimate treasure of the Heaven’s origin, they will occupy the entire six paths universe.”<br/><br/>Tianci said.<br/><br/>“Interesting!”<br/><br/>Wang Xian smiled faintly.<br/><br/>Buzz<br/><br/>At this moment, Wang Xian sensed that there were experts appearing not far away.<br/><br/>“I replied to Uncle Undead and the rest. They are rushing over.”<br/><br/>Tianci said.<br/><br/>“Okay!”<br/><br/>Wang Xian nodded his head and came to the main hall of the Mu Li tribe with Tianci.<br/><br/>“Uncle Undead, come in!”<br/><br/>Tianci spoke to the front when they arrived at the main hall.<br/><br/>Buzz! Buzz! Buzz<br/><br/>In the next instant, the golden leopard and the rest of the undead appeared.<br/><br/>The three of them heaved a sigh of relief when they saw Wang Xian. They cupped their hands at Wang Xian and said, “Dragon King!”<br/><br/>“What’s the current situation?”<br/><br/>Wang Xian looked at them and asked.<br/><br/>“Dragon King, the current situation is not optimistic.”<br/><br/>The specter frowned slightly, a grave expression appeared on his face. “Now, the Proud Heaven of the Cang Heaven Universe is leading a group of subordinates of the Heaven’s origin creation realm, as well as four to five Heaven’s origin creation realm powerhouses who believe in the universe. They are preparing to invade our six paths universe.”<br/><br/>“They are rushing towards us now. They are also telling us that if heaven bestows you not to hand over the ultimate treasure of the Heaven’s origin creation, he will make all the living beings in our six paths universe suffer. He will completely destroy our six paths universe.”<br/><br/>As the undead spoke, his expression turned a little ugly.<br/><br/>“The Cang Heaven Universe?”<br/><br/>When Wang Xian heard the undead’s words, he raised his eyebrows slightly. “They are preparing to forcefully snatch the ultimate treasure of the Heaven’s origin creation!”<br/><br/>“Yes, they are already on their way here. It Won’t be long before they arrive at our universe.”<br/><br/>The undead nodded and looked at Wang Xian. His expression was a little ugly. “Dragon King, they are very strong and difficult to deal with. We have to be prepared. How can we hand over the ultimate treasure of the Heaven’s origin creation just because they want it?”<br/><br/>“Can we contact them?”<br/><br/>Wang Xian looked at the undead and continued to ask.<br/><br/>“Yes, they are very confident. Ao Cangtian and the rest are also very famous in the land of origin. The Cang Heaven Universe is also very strong and has many friends from other universes.”<br/><br/>“Even if we don’t inform them, they will still come because their main goal is the ultimate treasure of the Heaven’s origin. They are also afraid that Tianci will hide.”<br/><br/>The undead nodded.<br/><br/>“Alright, let them come to the Mu Li tribe.”<br/><br/>Wang Xian looked at the undead and said faintly.<br/><br/>“Dragon King, do you have a way? They are very, very strong. I heard from a friend from another universe that there are about ten tianyuan-level powerhouses in the Cang Heaven Universe. Ao Cang Heaven is the strongest.”<br/><br/>“In addition, he has some other powerhouses who are cooperating with him. When the time comes, there might be more than ten tianyuan-level powerhouses. I think we can use this time to prepare and hide.”<br/><br/>Jin Bao suggested in a deep voice!<br/><br/>The dead souls and sand city nodded in agreement.<br/><br/>If it were an ordinary enemy, they might still be able to withstand it.<br/><br/>But this time, the opponent was too strong.<br/><br/>Not counting the experts in the Great Dao realm, there might be more than a dozen other experts in the Tianyuan blessed realm.<br/><br/>In their eyes, it would be difficult for the Dragon King to resist such a strong force.<br/><br/>“It’s fine. We’ll wait for them here. Let Me See who is the one who wants to snatch the Heaven’s gift, the ultimate treasure of the Heaven’s origin. Hehe!”<br/><br/>Wang Xian chuckled.<br/><br/>“HMM? Dragon King, are you confident?”<br/><br/>Upon hearing that, the spirits of the dead narrowed their eyes slightly and asked.<br/><br/>“Don’t Worry!”<br/><br/>Wang Xian smiled.<br/><br/>“As long as you’re confident, Dragon King. Heaven’s gift is an expert from our six universes. We are comrades from the same universe. Even if a war breaks out, we will not retreat.”<br/><br/>The spirits expressed their views and spoke solemnly!<br/><br/>If it was really the war, they would lead the experts from their race to escape.<br/><br/>But to surrender without a fight and exchange treasures for safety?<br/><br/>This was something they could not accept.<br/><br/>The first time they wanted the ultimate treasure of Tianyuan, wouldn’t they have to offer it to them in the future?<br/><br/>Wang Xian nodded and swept his gaze across them. “As long as you are at ease, I will settle Tianci’s matter for him.”<br/><br/>“Okay!”<br/><br/>Although the three of them were astonished, they nodded their heads when they saw how confident Wang Xian was.<br/><br/>The undead took out a communication device and sent some messages.\t\t\t\t\t\t</div>", "images": {}, "success": true}