{"id": 1376, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075230.html", "title": "Chapter 4379 - Chapter 4379: 4378 Tianchi’S Death", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4379 - Chapter 4379: 4378 Tianchi’S Death</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4379: 4378 Tianchi’s death<br/><br/>Prime Minister Gui smiled faintly when he saw Tianchi’s refusal.<br/><br/>He didn’t say anything, but he still passed the news to Wang Xian.<br/><br/>No matter what, Tianchi was the first Dragon King in the entire Dragon Palace.<br/><br/>Now that one of them had been killed, how could they not report it to the Dragon King?<br/><br/>“Your Highness, you are not weak. You have the ultimate treasure of Tianyuan. How could you be killed? is the other party a great dao existence?”<br/><br/>Prime Minister Gui asked Tianci.<br/><br/>“Yes!”<br/><br/>Tianci was silent for a moment and did not hide anything. “This time, I met some enemies in the land of origin. The other party is very strong.”<br/><br/>“Oh, really?”<br/><br/>Prime Minister Gui raised his eyebrows. “Don’t Worry, Your Highness. You should stay in the Dragon Palace for a while. It’s been a long time since your highness tianci came to the nine-origin universe. It’s also been a long time since he met the Dragon King. Our Dragon King Misses You!”<br/><br/>“Is foster father in the nine-origin Universe?”<br/><br/>Tianci asked in surprise.<br/><br/>“No, but the Dragon King wants to come back. He can come back immediately.”<br/><br/>Prime Minister Gui smiled as he chatted with Tianci.<br/><br/>Tianci nodded his head.<br/><br/>“Oh?”<br/><br/>At the same time, at the avenue of heavenly arrival.<br/><br/>When Wang Xian received Prime Minister Gui’s urgent message, he was slightly stunned. Then, he narrowed his eyes.<br/><br/>“Interesting. You even dare to kill Tianci.”<br/><br/>Wang Xian said faintly.<br/><br/>Buzz<br/><br/>He waved his arm and the primal chaos stone at the side became illusory.<br/><br/>A real shadow of the primal Chaos Stone entered Wang Xian’s body.<br/><br/>At the side, the shadow of the primal Chaos Stone was still there.<br/><br/>This was an ability of the primal chaos stone after it had fused with 10% of Wang Xian’s strength.<br/><br/>It was able to create an illusory space of the primal chaos stone.<br/><br/>In this space, it was the same as the real space of the primal chaos stone.<br/><br/>It had a hundred times the time.<br/><br/>After Wang Xian finished setting up, he called an lie over.<br/><br/>Buzz<br/><br/>A few seconds later, Wang Xian’s figure appeared in the Dragon Palace!<br/><br/>“Tianci is here!”<br/><br/>Sensing the location of tianci, Wang Xian came to his side in a flash.<br/><br/>“Foster Father!”<br/><br/>When Tianci saw Wang Xian, he immediately shouted happily.<br/><br/>Tianci was now considered a top expert in the universe.<br/><br/>However, in front of Wang Xian and his mother, he was still a child.<br/><br/>“Hehe, tianci, it’s been a long time since we last met. How have you been?”<br/><br/>Wang Xian looked at him and asked with a smile.<br/><br/>Although he knew everything, a child still had his pride.<br/><br/>He didn’t point it out!<br/><br/>“Very good.”<br/><br/>Tianci nodded with a smile, following that, he said, “Now, the Mu Li tribe has a few more powerhouses at the peak of the ruler realm. My mother has also improved very quickly. With the resources given to me by godfather, I might be able to break through soon!”<br/><br/>“Is that so? Not Bad, not bad. Come, come. It’s been a long time since we had a meal together. Let’s have a meal together and let me see how your strength is.”<br/><br/>Wang Xian smiled and said to him.<br/><br/>“Yes, Foster Father!”<br/><br/>Tianci nodded.<br/><br/>Following that, Wang Xian asked Prime Minister Gui to prepare some delicious food. The two of them chatted while eating.<br/><br/>A few hours later, Wang Xian brought Tianci to the dragon field of the Dragon Palace.<br/><br/>“Come, let me see if your strength has improved!”<br/><br/>As Wang Xian spoke, he waved his arm. The body of the Void Dragon flew out from his body and the void dragon pool floated below.<br/><br/>“Yes, foster father.”<br/><br/>Tianci also nodded his head.<br/><br/>Tianci knew the strength of his foster father.<br/><br/>The last time he brought him to fight against the powerhouses of the belief universe, he displayed the strength of the Great Dao.<br/><br/>And within the Great Dao, he should be considered relatively strong.<br/><br/>After such a long period of training and going to the land of origin with the great beings of the six paths universe, he had a clear understanding of his foster father’s power.<br/><br/>He guessed that it was roughly equivalent to one great dao level, one control level, and one or two beginner levels.<br/><br/>This level of strength was already very strong.<br/><br/>At the very least, the powerhouse who killed him this time was stronger.<br/><br/>Buzz<br/><br/>Wang Xian’s void dragon body was stronger than Tianci when he was using the Void Dragon Pool.<br/><br/>Wang Xian wanted to train him, so he naturally had to suppress him.<br/><br/>However, he didn’t take out the void disk to bully tianci too much.<br/><br/>“Tianci, make your move first. My body is of the space attribute and my attacks are very strange. Be careful and use all your strength to attack me!”<br/><br/>The body of the Void Divine Dragon said to him.<br/><br/>“Alright!”<br/><br/>Tianci nodded. He knew his foster father’s strength and didn’t hold back.<br/><br/>He took out the heaven origin blessed grade divine tree and attacked the body of the Void Divine Dragon.<br/><br/>However, under the attack of the divine tree, the body of the Void Divine Dragon disappeared instantly and appeared in front of him.<br/><br/>Following that, continuous attacks were launched at tianci.<br/><br/>The strange teleportation also caused Tianci to continuously defend himself.<br/><br/>Wang Xian watched from the side. Tianci’s combat experience had improved a lot.<br/><br/>However, he was still a little lacking. He needed to train.<br/><br/>After fighting for a few months, it finally stopped.<br/><br/>“Foster father, has your strength increased again?”<br/><br/>Tianci panted heavily and asked Wang Xian.<br/><br/>His clone, TIANCI, knew about it. However, in the past, his foster father’s clone was not this strong.<br/><br/>“It has improved a little!”<br/><br/>Wang Xian smiled and said, “Your experience is still a little lacking. In the next period of time, I will improve your experience.”<br/><br/>“Yes, Foster Father!”<br/><br/>Tianci nodded and didn’t refuse.<br/><br/>In the next few thousand years, Wang Xian continued to train Tianci’s combat experience.<br/><br/>Later on, he even called bei Shuang and the rest over to join forces to attack him.<br/><br/>When Tianci saw that the dragon palace had added a few powerhouses in the Heaven’s origin realm, his face was filled with shock.<br/><br/>Weng Weng<br/><br/>On this day, when Tianci was sparring with bei Shuang and the others.<br/><br/>His heart suddenly jumped.<br/><br/>“Sister bei Shuang, stop for a moment.”<br/><br/>Tianci quickly said and took out a wooden token from his body.<br/><br/>This wooden token was the one he used to communicate with his family and the six universe masters.<br/><br/>This wooden token would not be used unless it was an emergency.<br/><br/>However, when he saw the message on the wooden token, his expression changed drastically. His expression immediately turned ugly.<br/><br/>“Tianci, what happened?”<br/><br/>Bei Shuang looked at Tianci’s expression. She raised her eyebrows and asked.<br/><br/>“Something happened at our six paths universe.”<br/><br/>Tianci could not help but speak.<br/><br/>“Is it related to the incident where you were killed last time?”<br/><br/>Wang Xian, who was standing at the side, asked.<br/><br/>Tianci opened his mouth.<br/><br/>“Hehe, do you think you can hide it from me? How can I not know about the consumption of the maternal fruit?”<br/><br/>Wang Xian smiled at him. “Let’s go. Let’s go to the six paths universe. I want to see what happened. I also want to see who dared to kill my foster son.”\t\t\t\t\t\t</div>", "images": {}, "success": true}