{"id": 1372, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075214.html", "title": "Chapter 4375 - Chapter 4375: 4374 Made A Breakthrough", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4375 - Chapter 4375: 4374 Made A Breakthrough</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4375: 4374 made a breakthrough<br/><br/>After distributing all the resources, the 9-origin universe army returned to the 9-origin universe!<br/><br/>When they returned, the entire 9-origin universe immediately held a huge celebration!<br/><br/>All the races, all the powerful disciples, all participated in this celebration.<br/><br/>And this caused the disciples who didn’t go to be a little dumbfounded. But very quickly, a piece of news was announced on the universe ai!<br/><br/>“Congratulations to the nine-origin universe army. Under the leadership of the Dragon King of the Dragon Palace, the leader of the Dragon Palace’s poisonous Horned Dragon Army, Lord Mo Sha, and the Fallen Shadow Demon Emperor of the demon race, the nine-origin universe army has conquered the Void Universe and avenged their hatred for the past 100 billion years!”<br/><br/>“This battle has wiped out all the Heavenly Yuan creation realm powerhouses and all the Void dynasty powerhouses and armies!”<br/><br/>“Congratulations to the nine-origin Universe!”<br/><br/>This statement could be clearly seen as long as it entered the universe’s AI.<br/><br/>When all the disciples saw this information, their faces revealed an extremely shocked expression.<br/><br/>Before the expedition, even the disciples of some peak races didn’t know about this matter.<br/><br/>And the legions that participated in this battle, each peak race only had a million people!<br/><br/>The other powerful disciples didn’t know about it!<br/><br/>Now, when they saw this news, their faces were filled with shock.<br/><br/>”? ? ? What’s going on? Our Nine-origin universe army actually went out to conquer the void universe during this period of time? They actually completely conquered the Void Universe?”<br/><br/>“Hiss, my God, is this true? This? ? No Way, isn’t the Void Universe very powerful? Our universe completely conquered them?”<br/><br/>“Under the leadership of the Dragon King and the Shadow Demon Emperor, it makes sense. What’s the situation with the leader of the Dragon Palace’s poisonous Horned Dragon Army, Lord Devil Demon?”? “Even the Elven empress and the Abyss clan’s patriarch didn’t emphasize it, but emphasized a leader of the Dragon Palace’s Army?”<br/><br/>“Hahaha, you don’t know. This time, all the powerhouses of our nine-origin universe went out to conquer the void universe and directly swept it away. Who Do you think Lord Devil Demon Is?”? “This person is an existence at the Great Dao level, a terrifying existence that is comparable to Lord Fallen Shadow Demon Emperor!”<br/><br/>“I participated in this great battle. It was simply too awesome. Sweeping through the Void dynasty, eleven Heavenly Yuan creation realm experts from the Void Universe fell. However, what made me feel the most terrifying was that the Dragon Palace’s strength was too strong. The Dragon Palace actually had eleven heavenly Yuan creation realm experts. Eleven, that’s too terrifying. That Lord Mo Sha is comparable to senior fallen Shadow Demon Emperor!”<br/><br/>“Damn, are you serious? How can the Dragon Palace be so powerful? How can there be more than ten experts in the Heavenly Yuan realm? Isn’t it heaven-defying to have so many experts?”<br/><br/>“The Dragon Palace’s strength is heaven-defying now, especially the Dragon King. He instantly killed four experts in the Heavenly Yuan realm. Oh My God, he’s completely invincible.”<br/><br/>The entire nine-origin universe was in an uproar.<br/><br/>Countless disciples were shocked as they asked for all sorts of information.<br/><br/>Soon, the disciples from the various peak races who participated in the battle told them everything that happened.<br/><br/>Especially the Dragon Palace’s strength, it caused the entire nine-origin universe to boil!<br/><br/>All the disciples were dumbstruck!<br/><br/>A Dragon Palace alone had more than ten heaven origin creation realm existences, it was simply incredible.<br/><br/>What shocked them the most was that.<br/><br/>The Dragon Palace actually had an existence that was comparable to the fallen Shadow Demon Emperor.<br/><br/>This? ? ? ?<br/><br/>A subordinate of the Dragon Palace was comparable to the fallen Shadow Demon Emperor. Then, how strong was the Dragon King?<br/><br/>Instantly killing Four Heavenly Yuan creation realm existences?<br/><br/>Later, some experts guessed that the Dragon King’s strength should be comparable to Lord Mo Sha and the Fallen Shadow Demon Emperor.<br/><br/>This guess was recognized by many people.<br/><br/>A group of peak races celebrated and decided to celebrate with the entire universe.<br/><br/>Thus, various competitions were held together,<br/><br/>in order to be fair, they even specially set up competitions for a weak race. The rewards were exciting!<br/><br/>The disciples of all the other races also benefited.<br/><br/>The entire universe was bustling.<br/><br/>This kind of celebration lasted for more than ten thousand years.<br/><br/>Because of the various competitions, it lasted for more than ten thousand years.<br/><br/>This caused the nine-origin universe to be in a very positive state.<br/><br/>The disciples competed and the heaven’s favorites were rampant.<br/><br/>The strong sparred with each other in order to reach a higher level!<br/><br/>The various rewards that were offered were a great opportunity for any strong disciple.<br/><br/>Wang Xian did not cultivate for the past 10,000 years. Instead, he looked at the prosperous nine-origin universe with a smile on his face.<br/><br/>Sometimes, he even watched the sparring matches between the disciples.<br/><br/>However, during the 10,000 years when Wang Xian was relaxing, he also used some time to settle some matters.<br/><br/>For example, he exchanged the treasures in his hands for the resources for his breakthrough.<br/><br/>As the resources in his hands were too huge, he made a trip to the Justice Alliance universe.<br/><br/>He contacted the Sword Elder, Song Ta, and the rest. A large-scale auction was held in the communication device of the Justice Union universe.<br/><br/>The auction was to obtain treasures from the Void Universe.<br/><br/>The disciples of the Dragon Palace did not have any use for space-type treasures.<br/><br/>The corpses were useless to the disciples of the Dragon Palace!<br/><br/>Wang Xian exchanged all of them for resources from the Justice Union universe.<br/><br/>In addition to the corpses of the Great Dao level Space Beasts, the resources in his hands were sufficient for him to achieve a breakthrough in his strength!<br/><br/>However, the breakthrough this time would require more than 100,000 years just to devour these resources and digest them.<br/><br/>Therefore, Wang Xian was not in a hurry!<br/><br/>The body of the void divine dragon was undergoing cultivation in the primal chaos stone.<br/><br/>Ten thousand years meant a million years inside.<br/><br/>However, he was still a little far from breaking through.<br/><br/>After the celebration, Wang Xian was ready to start his breakthrough!<br/><br/>“It’s about to start. It’s the last breakthrough for the ruler of the universe. After this breakthrough, I don’t know if I can make another breakthrough!”<br/><br/>Wang Xian mumbled.<br/><br/>He transformed into a divine dragon and circled around the Dragon King’s Hall in the Dragon Palace!<br/><br/>In front of him was a large amount of resources.<br/><br/>This breakthrough was a significant improvement to his strength.<br/><br/>The chaos level was the strongest known realm in the various universes.<br/><br/>Buzz<br/><br/>He opened his dragon mouth and a large amount of resources entered his mouth. They quickly turned into Dragon Qi.<br/><br/>The energy in Wang Xian’s body was increasing rapidly.<br/><br/>A huge amount of resources entered his body.<br/><br/>This time, Wang Xian had to consume 30% of the resources he obtained from the Void Universe in order to achieve a breakthrough.<br/><br/>Coupled with the resources from before, one could imagine how terrifying it was.<br/><br/>Time passed day by day.<br/><br/>The energy in Wang Xian’s body was getting more and more terrifying!<br/><br/>His aura was also getting stronger!<br/><br/>The nine-colored radiance filled the entire Dragon King Hall.<br/><br/>A powerful pressure spread to the surroundings.<br/><br/>After more than 100,000 years, Wang Xian felt something and devoured all the resources in front of him.<br/><br/>A transformation had completely ended in his body.\t\t\t\t\t\t</div>", "images": {}, "success": true}