{"id": 1379, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075242.html", "title": "Chapter 4382 - Chapter 4382: 4,381 Kills On The Main Road Level", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4382 - Chapter 4382: 4,381 Kills On The Main Road Level</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4382: 4,381 kills on the main road level<br/><br/>The dreamy and technologically advanced spaceship arrived in the sky above the Mu Li tribe.<br/><br/>The gigantic spaceship emitted a terrifying aura.<br/><br/>The front of the spaceship unfolded, revealing part of the space inside.<br/><br/>“Pa! PA! PA! Pa!”<br/><br/>“Pa! PA! Pa!”<br/><br/>The sound of stepping on metal could be heard as figures walked out from the spaceship one after another!<br/><br/>Wang Xian and the rest were floating in the air. They were quietly looking at the figures walking out from the spaceship in front of them.<br/><br/>“13 powerhouses in the Heaven’s origin realm!”<br/><br/>When the figures appeared within their time limit, the expressions of the spirits of the dead and the rest changed slightly as they spoke.<br/><br/>“One dao level, seven control level, and five beginner level. They are very strong.”<br/><br/>Wang Xian looked at the thirteen figures who walked out. He raised his eyebrows slightly and said.<br/><br/>This force was indeed very strong.<br/><br/>Among them, his gaze swept across the four middle-aged elders. Wang Xian could feel the power of faith from their bodies.<br/><br/>These four middle-aged elders were all at the control level.<br/><br/>In addition, the middle-aged man in the lead was holding a woman who was at the control level.<br/><br/>Beside him were two old men who were also at the control level.<br/><br/>It had to be said that this was an extremely powerful force.<br/><br/>It was slightly stronger than the previous 9-origin universe.<br/><br/>“Hong!”<br/><br/>“Hong, Hong, Hong!”<br/><br/>The moment the group of experts led by Ao Cang Tian stepped out of the spaceship.<br/><br/>An extremely terrifying energy swept down from their bodies.<br/><br/>A Suppressive Force swept downwards!<br/><br/>“Eh?”<br/><br/>The spirits of the dead who were bestowed by Heaven felt this terrifying suppressive force and their faces turned pale instantly.<br/><br/>They looked at the 13 powerhouses in front of them and their expressions were abnormally ugly.<br/><br/>“Dragon King, you said that they are very strong. Can We… can we withstand it?”<br/><br/>The spirits of the dead could not help but ask Wang Xian as their expressions changed.<br/><br/>He knew that the other party was very strong, but he didn’t expect that the other party was so strong.<br/><br/>There were seven people at the mastery level.<br/><br/>What kind of concept was this?<br/><br/>If they were to pull out three of them, they would need the six paths universes to go all out.<br/><br/>Not to mention, there were even stronger existences.<br/><br/>These thirteen powerhouses could easily destroy their six paths universes!<br/><br/>“What’s going on?”<br/><br/>“What a terrifying pressure. Look up there. Lord Tianci and Lord Undead are all up there. No, the Dragon King is also up there!”<br/><br/>“Who are the experts that came down from the spaceship? Why are they emitting such a powerful pressure?”<br/><br/>Below, the disciples of the Mu Li tribe felt the sudden pressure and their expressions changed drastically.<br/><br/>They looked up in shock.<br/><br/>“The other party directly used the pressure. I’m afraid some of them are not friendly. I don’t know what they are up to.”<br/><br/>“Those thirteen experts who came down from the spaceship seem to be in the Heavenly Yuan blessed realm. Hiss, what are they up to?”<br/><br/>“Don’t be afraid. Since the Dragon King is here, there shouldn’t be a problem.”<br/><br/>Some of the powerful disciples of the Mu Li tribe discussed below and their expressions changed slightly.<br/><br/>Especially Tianci’s mother and family members, they were even more anxious!<br/><br/>“You should have received the news. Do you guys want to hand over the treasure or do you want to die?”<br/><br/>Ao Cangtian stared at tianci and said condescendingly. He swept his gaze across and looked at Wang Xian. “Hehe, you even found a helper?”<br/><br/>“Ao Cangtian, aren’t you being a little too overbearing by directly asking for Tian Chi’s Heaven’s destiny treasure? Do you really think that we are easy to bully?”<br/><br/>The undead stared at AO Cangtian and said with an embarrassed expression!<br/><br/>“It’s rare for someone like you to directly snatch the Heaven’s Destiny Treasure!”<br/><br/>Wang Xian stared at AO Cangtian and said indifferently!<br/><br/>The current Wang Xian had the power of chaos to conceal his aura. Whatever aura he wanted to reveal would be the same aura.<br/><br/>Even with a powerful investigative treasure, it was impossible to find out Wang Xian’s background.<br/><br/>According to AO Cangtian’s perception, Wang Xian’s strength was only at the control level.<br/><br/>He didn’t take it seriously at all!<br/><br/>“Hehe, a wood-attributed ultimate treasure of the Heaven’s origin just happens to be compatible with the attributes of our future young master. It’s also a perfect gift for our young master when he was born.”<br/><br/>Beside AO Cangtian, a middle-aged man sneered and said, “We have already prepared you in advance. Now, we will give you one minute to consider.”<br/><br/>“In one minute, if you don’t hand over the treasure, all the creatures below will die!”<br/><br/>He said with a sinister face and a smile!<br/><br/>“What? They are here to snatch our Lord Tianci’s Heavenly Fate Treasure?”<br/><br/>“This… This… who are they? Who are they? They want to snatch our Lord Tianci’s treasure and they are still so arrogant!”<br/><br/>Below them, all the strong disciples of the Mu Li tribe could hear their words clearly.<br/><br/>This made them look shocked.<br/><br/>“Hehe, the wood element heavenly fate treasure is more suitable for my future son. Hand it over. I don’t want to kill too much, nor do I want to be stained with too much blood. It’s unlucky!”<br/><br/>The pregnant woman beside Ao Cang Tian said with a smile!<br/><br/>“Hehe, I hope that you can reject it. If that’s the case, the Army of our belief universe will be able to kill their way over and turn the six paths universe into our belief universe. Hehe!”<br/><br/>A palace master from the belief universe beside them said with a chuckle!<br/><br/>They were watching indifferently from the side.<br/><br/>“My patience is limited. It’s your choice whether I choose to die or hand in the treasure.”<br/><br/>Ao Cangtian looked down at them and said coldly!<br/><br/>“Hehe, interesting, really interesting.”<br/><br/>Wang Xian heard their words and laughed. He looked at AO Cangtian and said, “Ao Cangtian from the Cang Heaven Universe, right? Do you know that Mu Litianci is the adopted son of this Dragon King?”<br/><br/>“HMM?”<br/><br/>Ao Cangtian and the rest were slightly stunned when they heard Wang Xian’s words.<br/><br/>They stared at Wang Xian with a look of astonishment in their eyes.<br/><br/>He actually dared to be so unbridled in front of them?<br/><br/>Did he have a powerful trump card or something?<br/><br/>“I don’t care who you are. If you dare to get involved in this mess, you must be prepared to die.”<br/><br/>Ao Cangtian stared at Wang Xian and said coldly!<br/><br/>“Very good. In that case, I, the Dragon King, have decided to destroy your universe!”<br/><br/>Wang Xian said calmly.<br/><br/>He looked at Ao Cangtian above him with a look of disdain!<br/><br/>Boom<br/><br/>He slowly extended his arm.<br/><br/>Before AO Cangtian and the rest could even react, ao Cangtian’s figure disappeared!<br/><br/>He didn’t disappear!<br/><br/>Instead, he came straight to Wang Xian from the sky.<br/><br/>“Let’s start with you. How dare you hit my adopted son? What a joke!”<br/><br/>Wang Xian stared at Ao Cangtian, whose eyes were wide open and his face was filled with disbelief!\t\t\t\t\t\t</div>", "images": {}, "success": true}