{"id": 1375, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075226.html", "title": "Chapter 4378 - Chapter 4378: When The 4377 War Broke Out", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4378 - Chapter 4378: When The 4377 War Broke Out</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4378: When the 4377 war broke out<br/><br/>“Eh? The evil sequence camp and the Justice Alliance are in a war?”<br/><br/>When Wang Xian received the news, his eyes were filled with astonishment.<br/><br/>The calamity had just broken out a few years ago, but the evil sequence camp had already broken out into a war?<br/><br/>There were still billions of years to come.<br/><br/>“Maybe it’s because the Justice Alliance is getting stronger and stronger.”<br/><br/>Wang Xian thought to himself.<br/><br/>In the universe of the evil sequence faction, they were good at invading other universes.<br/><br/>Under such circumstances, those universes that were invaded naturally wanted to hide and seek help.<br/><br/>In the end, they would join the Justice Alliance.<br/><br/>The more universes they invaded, the more universes would feel afraid and sense danger. They had no choice but to join the Justice Alliance.<br/><br/>The power of the Justice Alliance universe was becoming stronger and stronger under the pressure of the evil sequence universe.<br/><br/>If this continued, one day, the power of the Justice Alliance would surpass that of the evil sequence universe.<br/><br/>This was also the reason why the evil sequence universe wanted to invade the Justice Alliance universe.<br/><br/>This was because they could only invade the Justice Alliance now.<br/><br/>Attacking other universes would instead cause more universes to join the Righteous Alliance.<br/><br/>When the strength of the righteous alliance was strong enough, with the hatred the righteous alliance had for the evil sequence faction, they would definitely turn around and attack them.<br/><br/>Therefore, the evil sequence faction had decided to invade the Righteous Alliance now and weaken the strength of the Righteous Alliance.<br/><br/>They even wanted to destroy it.<br/><br/>Wang Xian was not too interested in the war between the two factions.<br/><br/>He brought the disciples of the Dragon Palace and flew towards the sky-absorbing universe.<br/><br/>The disciples of the Dragon Palace who could achieve a breakthrough this time were of the wood element.<br/><br/>The sky-absorbing universe, the sword and the magic universe both had a quota of the wood element. Therefore, Wang Xian did not need to go out and look for this quota.<br/><br/>After arriving at the sky-absorbing universe, the breakthrough of the disciples of the Dragon Palace went very smoothly.<br/><br/>After an easy breakthrough, Wang Xian returned to the Great Dao of Heaven once again.<br/><br/>At this point, the twelfth disciple of the Dragon Palace who was in the Heavenly Kismet Realm was born.<br/><br/>Time passed quickly once again.<br/><br/>Wang Xian was at the Great Dao of Heaven. Occasionally, he would look at the heaven-origin communicator to check on the situation of the battle.<br/><br/>According to the information above, several universes in the righteous universe had been massacred by the evil sequence alliance!<br/><br/>Countless lives had died.<br/><br/>The heaven creation realm experts had fallen.<br/><br/>After the Justice Alliance experts arrived there, a world-shaking battle broke out.<br/><br/>Over a hundred heaven creation realm experts from both sides broke out in battle.<br/><br/>There were casualties on both sides.<br/><br/>This caused the battle to temporarily stabilize.<br/><br/>However, battles broke out everywhere.<br/><br/>There were even a few great dao realm experts from the evil sequence alliance who had joined forces to ambush the Justice Alliance experts.<br/><br/>They had killed seven to eight heaven origin creation level powerhouses from the justice universe.<br/><br/>In short, although the Justice Alliance was stronger now, their overall strength was still inferior to the evil sequence faction.<br/><br/>Although Wang Xian was interested in the war between the two major factions, he did not participate in it.<br/><br/>If he participated in a war at this level, he would be trapped.<br/><br/>Both the Justice Alliance and the evil sequence faction seemed to have chaos-level existences.<br/><br/>There were also a large number of heaven origin blessed realm existences.<br/><br/>Although Wang Xian was strong, he was not invincible.<br/><br/>Furthermore, since his elemental god fragment was stolen this time, Wang Xian suspected that 90% of it was done by the powerhouses in the Justice Alliance.<br/><br/>Therefore, Wang Xian wouldn’t be foolish enough to help the Justice Alliance.<br/><br/>Was it not satisfying to slowly improve his strength first?<br/><br/>Time passed again. More than a million years later, another heaven origin creation was born in the Dragon Palace. It had a metal attribute. There was still no need to look for a spot. It was a direct breakthrough in the heavenly universe.<br/><br/>More than three million years later, another one was born in the Dragon Palace. It had a light attribute.<br/><br/>It was still a breakthrough in the universe.<br/><br/>Five million years later, the Dragon Palace gave birth to another heavenly yuan creation realm expert.<br/><br/>Wind attribute.<br/><br/>Nine million years later, the Dragon Palace gave birth to a heavenly yuan creation realm expert with the wind attribute.<br/><br/>At this point, the Dragon Palace only had wood and light attribute slots.<br/><br/>The other attribute slots were all used up!<br/><br/>At this point, the Dragon Palace had sixteen Heavenly Yuan creation realm experts.<br/><br/>Sixteen Heavenly Yuan creation realm experts was a huge number.<br/><br/>The Dragon Palace was able to produce heavenly yuan creation realm experts so quickly.<br/><br/>One reason was that they obtained resources from the Void Universe. These resources were exchanged for various treasures used by the Justice Alliance to break through.<br/><br/>Another reason was that cultivating in the primal chaos gem for a million years was equivalent to a hundred million years.<br/><br/>Coupled with the majestic energy of the Great Dao of Heaven, it was why the experts of the Dragon Palace were born so quickly.<br/><br/>“HMM? I’m about to break through!”<br/><br/>On this day, Wang Xian had a thought and a smile appeared on his face.<br/><br/>The body of the Void Divine Dragon had been cultivating in the primal chaos stone for more than a billion years. Finally, he had broken through!<br/><br/>His strength had reached the level of control. When he used the Void Dragon Disc, he could also use the Void Dragon Disc!<br/><br/>This allowed Wang Xian to instantly increase the combat strength of two people who had just entered the Heaven’s origin creation stage.<br/><br/>His strength had reached the chaos level, the Great Dao level, the control level, and the beginner level.<br/><br/>A smile appeared on Wang Xian’s face.<br/><br/>He had two ultimate treasures of the Heaven’s origin creation stage!<br/><br/>With all kinds of powerful means, Wang Xian felt that he was abnormally powerful now!<br/><br/>“Next, I will continue to improve.”<br/><br/>Wang Xian thought to himself.<br/><br/>However, what Wang Xian didn’t expect was that not long after, something broke his peaceful cultivation life!<br/><br/>It was located in the Dragon Palace of the nine-origin universe.<br/><br/>On this day, very suddenly, Tianci’s body appeared in front of the ancestral tree.<br/><br/>A maternal fruit slowly disappeared!<br/><br/>Tianci appeared in the Dragon Palace with a trace of cold sweat on his face.<br/><br/>He breathed in the fresh air.<br/><br/>“What?”<br/><br/>Tianci’s sudden appearance caught Prime Minister Gui’s attention.<br/><br/>He immediately came to the Dragon King’s palace and looked at Tianci in surprise.<br/><br/>“Crown Prince Tianci, what are you doing?”<br/><br/>Prime Minister Gui looked at him in confusion and asked.<br/><br/>“Uncle Prime Minister Gui.”<br/><br/>Tianci greeted him politely before saying, “I was killed by someone, so I was resurrected here in the Dragon Palace.”<br/><br/>Yes, Tianci’s sudden appearance here was because he was resurrected here after his death.<br/><br/>Wang Xian gave Tianci a mother’s womb fruit.<br/><br/>This fruit had always been placed here in the Dragon Palace.<br/><br/>When Tianci died, he could be resurrected here immediately.<br/><br/>However, this mother-born fruit was consumed a little quickly.<br/><br/>“What? The Crown Prince was killed? Who Killed You?”<br/><br/>Prime Minister Gui’s eyes narrowed and he immediately said, “I’ll inform the Dragon King about this immediately!”!<br/><br/>“No need.”<br/><br/>Tianci opened his mouth and shook his head in refusal.<br/><br/>Although he was young, he was already very strong.<br/><br/>Moreover, his foster father had already helped him a lot.\t\t\t\t\t\t</div>", "images": {}, "success": true}