{"id": 1374, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075222.html", "title": "Chapter 4377 - Chapter 4377: The 4376 Great War Broke Out", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4377 - Chapter 4377: The 4376 Great War Broke Out</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4377: The 4376 Great War broke out<br/><br/>He arrived at the Great Dao of Heaven once again.<br/><br/>Wang Xian’s figure appeared in the Palace of the Dragon Palace.<br/><br/>However, when he stood there, his entire body was stunned.<br/><br/>He swept his gaze across the surroundings and frowned slightly. His eyes revealed a cold expression.<br/><br/>Over the past 100,000 years in the Dragon Palace, as he needed to make a breakthrough, the disciples of the Dragon Palace were all in the nine-origin universe. In the entire Great Dao of heaven, there were no disciples of the Dragon Palace cultivating here.<br/><br/>He had been free all this while.<br/><br/>However, Wang Xian did not take away the fragments of the god of elements here.<br/><br/>This was because in Wang Xian’s opinion, with his reputation here and his strength, no powerhouse would dare to take away the fragments of the god of elements that he had placed here.<br/><br/>In particular, he had a good relationship with a few higher-ups in the Justice Alliance universe.<br/><br/>Furthermore, Wang Xian had set up layers of defense and warning energy around the fragments of the god of elements.<br/><br/>An expert at the mastery level could not get rid of these fragments of the god of elements.<br/><br/>Once they touched them, they would issue a warning.<br/><br/>However, this fragment of the god of elements was stolen by someone.<br/><br/>This? ? ?<br/><br/>This made Wang Xian feel a little incredulous.<br/><br/>“You are really courting death!”<br/><br/>Wang Xian’s eyes revealed a cold expression. He didn’t expect that there would be an expert who dared to take away his item.<br/><br/>And the one who took away the fragment of the god of elements was at least an existence at the level of the Great Dao.<br/><br/>“I want to see who it is!”<br/><br/>Wang Xian’s eyes revealed a cold expression. With a move of his palm, the divination lamp appeared in his hand.<br/><br/>He immediately used the divination lamp to perform divination.<br/><br/>However, what made him frown was that the lamp of divination was unable to divine any information.<br/><br/>“Now that my strength has improved, why can’t I divine anything? Is it because of the lamp of divination itself?”<br/><br/>Wang Xian mumbled.<br/><br/>He had just made a breakthrough in his strength. Logically speaking, there was almost no powerhouse that he could not divine.<br/><br/>Unless there was a possibility that the other party had a treasure that could shield him from divination.<br/><br/>There was another possibility. The other party was too strong and had reached the chaos level.<br/><br/>A treasure like the lamp of divination did not have no limits.<br/><br/>It was just like a treasure that could resurrect.<br/><br/>If Wang Xian was killed by the mother’s womb fruit now, he would only be able to retain his combat strength at the Great Dao level after resurrecting.<br/><br/>This was because the mother’s womb fruit had a limit.<br/><br/>The lamp of divination also had a limit.<br/><br/>However, Wang Xian was more inclined towards the first type.<br/><br/>If it was a chaos-level powerhouse, there was no need to steal his god of elements fragment.<br/><br/>Although the god of elements fragment that he placed here was extremely precious.<br/><br/>However, it was unnecessary for it to be of the chaos-level.<br/><br/>“This is really unexpected. The one who made the move should be a great dao-level powerhouse. Is it a great dao-level powerhouse from the Righteous Universe?”<br/><br/>Wang Xian mumbled as his eyes sparkled.<br/><br/>He hesitated for a moment before taking out his heaven-origin communicator and telling Old Man Sword Song Ta and the rest about this matter.<br/><br/>He also inquired about it!<br/><br/>“Brother Wang Xian, did you say that the fragment of the god of elements that your Dragon Palace set up here has been stolen?”<br/><br/>Not long after, Old Man Sword Song Ta and Old Man Sword flew over and asked Wang Xian with a surprised look.<br/><br/>“Yes, I have placed a restriction on it. There are some strong disciples of our nine-origin universe cultivating in the surrounding area, but they were still able to steal it without making a sound. They are definitely not ordinary strong practitioners.”<br/><br/>“If I’m not wrong, they should be strong practitioners of the Great Dao.”<br/><br/>Wang Xian guessed, “I wonder if you two brothers know who did it?”<br/><br/>“This?”<br/><br/>Song Ta and old man Jian looked at each other and frowned, they shook their heads as well. “We really don’t know about this. If we were to say that they could take away the elemental god that you set up, I’m afraid they are really existences at the Great Dao level. However, we can’t be sure if they are from the Justice Union universe or other forces.”<br/><br/>“How many existences at the level of the Great Dao are there in the Justice Union?”<br/><br/>Wang Xian hesitated for a moment before asking.<br/><br/>“According to the rules of our Justice Union, we can’t divulge this information. I’m sorry, Dragon King. This is related to the confidential information of our Justice Union.”<br/><br/>Song ta shook his head and said.<br/><br/>“It’s nothing. I’m just a little surprised. Why was the Elemental God stolen by someone who had a breakthrough?”<br/><br/>Wang Xian shook his head.<br/><br/>“There’s no need for the other party to Offend You Dragon King because of these treasures. However, since the other party dared to take them away, I reckon that he was confident that he wouldn’t be discovered. That’s why he did such a despicable thing.”<br/><br/>Old Man Jian said.<br/><br/>Wang Xian nodded. “Indeed. I didn’t find any clues. The other party was confident that he wouldn’t be discovered by me.”<br/><br/>“Forget it. It’s fine if he lost it.”<br/><br/>He could only say so.<br/><br/>Although he was unhappy, there was nothing he could do.<br/><br/>“Let’s help you ask the Dragon King if it’s someone who’s looking for trouble.”<br/><br/>Song ta said.<br/><br/>“Okay, thank you!”<br/><br/>Wang Xian nodded.<br/><br/>After chatting with old man song Ta Jian for a while, they left.<br/><br/>Wang Xian began to redecorate here.<br/><br/>Although the fragments of the Elemental God had been stolen by someone, Wang Xian could now draw on the various elemental energies in the surrounding energy tide by himself after his strength had improved.<br/><br/>Now he, even if the energy around him is out of control, goes berserk.<br/><br/>He can still prop up a security field.<br/><br/>And the power he draws on is no weaker than when he had the elemental god.<br/><br/>“Now, the entire area of the riot, with the exception of the Cross of the Elemental God, is not a danger to itself.”<br/><br/>Wang Xian thought to himself.<br/><br/>As for the cross, it’s still a threat to him.<br/><br/>At least once he’s inside, he’ll still be terrorized. He won’t last long.<br/><br/>After all, there were ten Great Dao level elemental gods there.<br/><br/>At the beginning, it was equivalent to them working together.<br/><br/>After channeling the energy, Wang Xian got an lie to call all the disciples of the Dragon Palace over and began to cultivate.<br/><br/>At the same time, he opened the primal Chaos Stone and instructed all the powerhouses of the Dragon Palace as well as his void dragon body to cultivate inside.<br/><br/>In the past, Wang Xian didn’t dare to let all the disciples of the Dragon Palace cultivate here because he was afraid of accidents.<br/><br/>If this area were to go berserk, he wouldn’t be able to protect all of them.<br/><br/>But now, he could.<br/><br/>Even if there were any accidents, he would be able to withstand them.<br/><br/>All the disciples of the Dragon Palace arrived and began to cultivate.<br/><br/>Time passed day by day.<br/><br/>More than a million years later, a disciple of the dragon palace was about to break through his shackles.<br/><br/>Just as Wang Xian was about to lead him to break through, he suddenly received a piece of news.<br/><br/>The universe of the Evil Sequence Alliance was attacking the universe of the Justice Alliance in a frenzy.<br/><br/>Those universes that had joined the Justice Alliance in the periphery were being slaughtered in a frenzy.<br/><br/>Now, the Army of the Justice Alliance, the strong ones, had already gone over to support them.<br/><br/>When Wang Xian received this news, he was slightly surprised.<br/><br/>Was a great war about to break out?\t\t\t\t\t\t</div>", "images": {}, "success": true}