{"id": 1380, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075246.html", "title": "Chapter 4383 - Chapter 4383: 4,382 Seconds To Kill Anyone Below The Great Dao Level", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4383 - Chapter 4383: 4,382 Seconds To Kill Anyone Below The Great Dao Level</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4383: 4,382 seconds to kill anyone below the Great Dao level<br/><br/>Crack! Crack! Crack<br/><br/>Ao Cangtian’s figure appeared in Wang Xian’s hands instantly.<br/><br/>All the powerhouses didn’t react in time.<br/><br/>Even Ao Cangtian himself.<br/><br/>When he felt his neck being strangled by a palm, when he felt his body being completely restrained…<br/><br/>His face was filled with horror and disbelief.<br/><br/>His heart was beating violently. If his body wasn’t being imprisoned, he would definitely be trembling non-stop.<br/><br/>His eyes were filled with disbelief.<br/><br/>What was going on?<br/><br/>How was this possible! !<br/><br/>He was a great dao expert, and he had a heavenly yuan destiny treasure.<br/><br/>However, he was actually grabbed by a great dao expert in an instant.<br/><br/>What level was it that could make him unable to react in time.<br/><br/>At this moment, he sensed that the young man, who he thought was only at the control level, reached out to grab the heavenly yuan destiny treasure between his brows.<br/><br/>An intense sound rang out.<br/><br/>He wanted to resist, but he couldn’t resist at all.<br/><br/>The terrifying suppressive force made him unable to even speak.<br/><br/>He could feel that the ultimate treasure of Heaven’s origin that was located between his brows was about to be taken away by him.<br/><br/>It was about to be taken away by him!<br/><br/>“A metal-attributed ultimate treasure of Heaven’s origin, not bad.”<br/><br/>Wang Xian stared at the ultimate treasure of Heaven’s origin that was located between his brows and commented indifferently.<br/><br/>The strength of this proud heaven was only at the Great Dao level plus one control level.<br/><br/>However, what about Wang Xian’s current strength?<br/><br/>Chaos level plus one Great Dao level, one control level, and one beginner level!<br/><br/>Wang Xian was much, much stronger than him!<br/><br/>Furthermore, AO Cangtian and the rest were very close to Wang Xian.<br/><br/>In Wang Xian’s opinion, this was undoubtedly an act of courting death.<br/><br/>Since they were so close to him, as long as he made a slight move, he would be able to grab them instantly!<br/><br/>He smiled as he looked at this metal-type ultimate treasure of the Heaven’s origin creation.<br/><br/>This ultimate treasure of the Heaven’s origin creation was indeed not bad. Wang Xian could use it.<br/><br/>Although there was a limit to the number of ultimate treasures of the Heaven’s origin creation that every powerhouse could control.<br/><br/>There was only one attack-type ultimate treasure of the Heaven’s origin creation that could be controlled.<br/><br/>But now, the void disk, this attack-type ultimate treasure of the Heaven’s origin creation, was controlled by the Void Divine Dragon.<br/><br/>It had no effect on Wang Xian’s actual body.<br/><br/>He could still control an attack-type ultimate treasure of the Heaven’s origin creation.<br/><br/>Of course, with this external force, Wang Xian could only control an additional ultimate treasure of the Heaven’s origin creation.<br/><br/>But this was not a small improvement.<br/><br/>After all, an ultimate treasure of the Heaven’s origin creation was equivalent to an increase in the combat strength of a control level!<br/><br/>Wang Xian accepted this treasure with a smile!<br/><br/>“This… This is impossible. This is impossible. husband, husband!”<br/><br/>In the sky, the strong disciples from the Cang Heaven Universe and the belief universe were stunned.<br/><br/>They looked at this scene in disbelief.<br/><br/>The woman next to Ao Cangtian was the first to react. Her eyes were wide open as she stared at this scene in disbelief. She cried out involuntarily!<br/><br/>The four control-level experts from the belief universe also felt a chill in their hearts. A horrified expression appeared on their faces.<br/><br/>How was this possible?<br/><br/>What level of experts could instantly kill a great dao-level existence?<br/><br/>Could it be?<br/><br/>Their pupils constricted slightly as they swallowed a mouthful of saliva. Their eyes were filled with fear.<br/><br/>They knew that they had offended an existence that they could not afford to offend!<br/><br/>Crack<br/><br/>At this moment, Wang Xian removed the Heaven’s origin creation treasure from Ao Cangtian’s glabella. He stared at him and said, “I will accept this Heaven’s origin creation treasure with a smile. You Can Die Now!”<br/><br/>Bang<br/><br/>Wang Xian stared at him and clenched his fist lightly!<br/><br/>An extremely terrifying energy enveloped him instantly.<br/><br/>The life force of AO Cangtian disappeared rapidly.<br/><br/>Wang Xian waved his arm and kept ao Cangtian’s corpse.<br/><br/>“Run!”<br/><br/>At this moment, the four heaven origin creation realm powerhouses from the belief universe were horrified. They shouted in shock!<br/><br/>Run!<br/><br/>They encountered an existence at the chaos level.<br/><br/>An invincible existence.<br/><br/>Even if all of them joined forces, they were still no match for him.<br/><br/>Furthermore, they did not want to provoke the four controlling-level powerhouses of the belief universe!<br/><br/>“If you can escape, you can’t escape from the temple.”<br/><br/>Wang Xian looked at their fleeing figures and said calmly!<br/><br/>He did not stop them because there was no need to stop them.<br/><br/>Right now, he wanted to destroy all the powerhouses of the Cang Heaven Universe.<br/><br/>Since he had decided to destroy the Cang Heaven universe, he could not kill the powerhouses of the belief universe unscrupulously for the time being.<br/><br/>If they were to join forces, it would be a huge problem to destroy them all.<br/><br/>The belief universe was very strong.<br/><br/>Even if they were to join forces with the firmament universe, Wang Xian and the Dragon Palace would not be able to destroy them.<br/><br/>Therefore, he did not stop the powerhouses of the belief universe from escaping.<br/><br/>However, he would not let them off!<br/><br/>When the four control-level powerhouses of the belief universe escaped.<br/><br/>In the Cang Heaven Universe, there were only three control-level powerhouses and five beginner-level powerhouses!<br/><br/>Wang Xian looked at them, his eyes filled with coldness.<br/><br/>“This… this…”<br/><br/>The other eight heaven origin creation-level powerhouses were stunned!<br/><br/>Gulp<br/><br/>At the side, the undead could not help but swallow a mouthful of saliva. Their faces were also filled with astonishment.<br/><br/>What was the Dragon King’s strength?<br/><br/>It was the Great Dao level of Ao ‘Cang ‘Tian. He instantly killed it.<br/><br/>Could it be the legendary chaos level?<br/><br/>They had never even seen such a level before.<br/><br/>Moreover, they had never heard of the existence of the chaos realm in the land of origin.<br/><br/>Now, a living chaos level powerhouse was right in front of them.<br/><br/>Furthermore, this was Mu Litianci’s foster father.<br/><br/>This? ? ?<br/><br/>The true strength of the Dragon King was actually so terrifying?<br/><br/>Not only were the undead and the rest shocked by Wang Xian’s strength, even Tianci was a little dumbfounded.<br/><br/>In the past, he knew that his foster father’s strength was only at the Great Dao level.<br/><br/>Now, he had actually reached the chaos-level?<br/><br/>This? ?<br/><br/>“It’s Your Turn!”<br/><br/>Wang Xian stared at the other group of Heaven’s origin manifestation powerhouses in the Cang Heaven Universe and said indifferently!<br/><br/>Buzz<br/><br/>Upon hearing Wang Xian’s words, the woman’s body trembled violently. Without any hesitation, a red cloth strip appeared in his hand.<br/><br/>The red cloth strip enveloped him.<br/><br/>This was a powerful escape treasure.<br/><br/>Buzz<br/><br/>However, the energy on Wang Xian’s body trembled slightly. The red cloth in his hand collapsed immediately.<br/><br/>“You want to escape in front of me?”<br/><br/>Wang Xian stared at the woman and said faintly, “Didn’t you say that you wanted to snatch the heaven-bestowed heaven-blessed treasure for your child? In my opinion, you should die together with your husband and your child!”<br/><br/>“Resist! Run!”<br/><br/>At the side, an old man at the control level was on the verge of breaking down as he shouted loudly.<br/><br/>They wanted to escape!\t\t\t\t\t\t</div>", "images": {}, "success": true}