{"id": 1385, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075266.html", "title": "Chapter 4388 - Chapter 4388: 4387 Ao Cang Heaven’S Request For Help", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4388 - Chapter 4388: 4387 Ao Cang Heaven’S Request For Help</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4388: 4387 ao Cang Heaven’s request for help<br/><br/>“Continue!”<br/><br/>After Wang Xian had killed all the powerhouses from thousand spirit island, the divination lamp divined the location of their resurrection.<br/><br/>Following that, he immediately charged over.<br/><br/>The corpses of the powerhouses in the Heaven’s origin realm had a huge amount of energy.<br/><br/>Especially the nine types of energy metal, wood, water, fire, Earth, wind, lightning, light, and darkness were extremely useful to the disciples of the Dragon Palace.<br/><br/>The disciples of the Dragon Palace could use the corpses of the heaven origin creation stage powerhouses to cultivate and achieve breakthroughs quickly.<br/><br/>Therefore, the corpses of these heaven origin creation stage powerhouses were extremely precious.<br/><br/>Wang Xian began to search for and kill the powerhouses of the Cang Heaven universe through the divination power of the divination lamp.<br/><br/>Meanwhile, in the land of origin.<br/><br/>Ao Cangtian and that woman were resurrected here.<br/><br/>After being resurrected, the two’s strength had decreased.<br/><br/>Ao Cang Tian’s strength was only at the control level, while the woman’s strength was at the initial stage of the Heavenly Yuan realm.<br/><br/>The two’s expressions were very ugly, and there was a trace of fear in their eyes.<br/><br/>“Huff, husband, what do we do now? What do we do now?”<br/><br/>The woman said anxiously to ao Cang Tian, “I just received information from our Cang Tian universe and my father and the others. Right now, our Cang Tian universe is being invaded and attacked. My father and the others were also killed just now.”<br/><br/>“I’m afraid our universe is doomed this time. The enemy is a chaos-level powerhouse. This is a chaos-level powerhouse.”<br/><br/>Ao cang Tian’s body trembled. He never thought that he would one day provoke such a terrifying enemy.<br/><br/>He had already been killed three times.<br/><br/>Facing such an enemy, he could not resist at all.<br/><br/>“Husband, can we find someone to help? Can We? Don’t you have a better relationship with the belief universe? This time, the belief universe has also provoked that expert. If we have the help of the belief universe, then we can resist a little.”<br/><br/>“Also, isn’t your relationship with the expert who divined the universe very good? The strength of the divination universe is very strong. If they are willing to help, they will definitely be able to resist that expert.”<br/><br/>“Otherwise, our Cang Heaven Universe will be finished. With that master’s methods, my father and the others, as well as the other masters of our Cang Heaven Universe, will very likely be completely killed!”<br/><br/>The woman continued to speak in shock and anger!<br/><br/>“Belief in the universe? It is not certain whether they will be willing to help. The enemies we have provoked this time are too strong. The divination universe will definitely not participate. However, we must find the masters of the divination universe and let them set up an interference array on our bodies.”<br/><br/>Ao Cang Tian replied with an embarrassed expression.<br/><br/>Right now, the first thing they had to solve was their own problems.<br/><br/>The other party had a treasure that could lock onto them. They had to solve this lock.<br/><br/>And if they wanted to solve it, there was only one way. They had to find the divination universe’s experts to help.<br/><br/>The divination universe was the most powerful universe near the land of origin. The entire universe had three Great Dao level experts.<br/><br/>Their divination techniques could predict the past and future. It was extremely terrifying.<br/><br/>The divination universe was the most powerful existence in the nearby region.<br/><br/>Ao Cang Tian had a good relationship with one of the divination universe’s powerhouses.<br/><br/>“Let’s go, Prophet Hong.”<br/><br/>Ao Cang Tian took out his communication stone plate with an ugly expression and sent a message. Then, he brought the woman and flew towards a place quickly.<br/><br/>They were very anxious.<br/><br/>Both of them understood that the chaos-level powerhouse might be rushing towards them.<br/><br/>They had to block the other party’s lock on them.<br/><br/>Otherwise, no matter where they ran to, they would be caught.<br/><br/>As for the situation in the Cang Tian universe, they could only think of a solution after they had solved their physical problems.<br/><br/>The two of them flew quickly and arrived at the surface of the land of origin. Then, they flew towards a certain place.<br/><br/>Divination of the universe. In the land of origin, there was a territory that belonged to them.<br/><br/>As a powerful universe, it was normal for it to occupy a territory here.<br/><br/>Other universes also didn’t dare to provoke such a powerful universe.<br/><br/>Moreover, this universe also had such a special ability.<br/><br/>Ao Cang Tian and the others flew for a year and arrived at a place in the land of origin.<br/><br/>There were many trees here. It was obvious that they were planted here.<br/><br/>These trees were very unique and emitted a special luster.<br/><br/>In this forest, there were many small wooden houses. The entire environment looked very quiet.<br/><br/>Occasionally, there would be experts flying out. They were all existences in the Heavenly Yuan blessed realm.<br/><br/>“Prophet Hong.”<br/><br/>Ao Cang Tian and the others flew to the front of a wooden house. They looked inside and shouted towards the inside.<br/><br/>“Hehe, Patriarch of the Cang Heaven sect, come in!”<br/><br/>A voice soon came from inside.<br/><br/>“Prophet Hong, sorry to disturb you.”<br/><br/>Ao Cang Tian nodded and brought his wife inside.<br/><br/>The wooden house had two doors. Behind it was a courtyard. Inside, an old man was sitting on a small pond.<br/><br/>He was using a bamboo rod to fish.<br/><br/>Beside him, there was a young man standing at the side.<br/><br/>The young man’s Aura had also just entered the Heavenly Yuan realm.<br/><br/>“Eh?”<br/><br/>When prophet Hong saw ao Cangtian and the others arrive, he looked over and immediately revealed a surprised expression.<br/><br/>He placed the fishing rod to the side and looked at Ao Cangtian with a face full of surprise. “Patriarch of the Cangtian cult, what’s going on with you guys?”<br/><br/>“We’ve encountered a powerful enemy. Now, we’re here to ask for your help, Prophet Hong.”<br/><br/>Ao Cangtian cupped his hands toward prophet Hong and said.<br/><br/>“Patriarch of the Cangtian cult, we’ve known each other for many years. If you have something to say, just say it.”<br/><br/>Prophet hong nodded and continued, “I’m very curious. What kind of force is it that can kill Patriarch of the Cangtian cult several times and Lower Your Realm?”<br/><br/>“We’ve provoked a powerful enemy. He should have the ability to track us, so please help us block this tracking.”<br/><br/>Ao Cangtian said.<br/><br/>“Okay.”<br/><br/>Prophet Hong nodded and didn’t refuse.<br/><br/>He owed Ao Cangtian a favor. No matter who the enemy was, he had to return it.<br/><br/>“Thank you, Prophet Hong.”<br/><br/>Ao Cangtian said gratefully.<br/><br/>“Hehe, no need. I owe you a favor, patriarch of the Cangtian Cult.”<br/><br/>Prophet Hong shook his head. With a wave of his arm, streams of special energy entered their bodies.<br/><br/>“This is the strongest defense I can set up. It can interfere with the divination of others. However, this kind of energy will gradually dissipate in your body, but maintaining it for more than a billion years is not a big problem.”<br/><br/>Prophet Hong continued.<br/><br/>“Prophet Hong, our firmament universe is being invaded. If you can help us resist a little, we will remember your kindness.”<br/><br/>Feeling a layer of special defensive power in her body, the woman at the side couldn’t help but say.<br/><br/>“If prophet Hong is willing to help, after today, if prophet Hong needs anything from me, I will not decline.”<br/><br/>Ao Cangtian also continued to say, looking at him.\t\t\t\t\t\t</div>", "images": {}, "success": true}