{"id": 1381, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075250.html", "title": "Chapter 4384 - Chapter 4384: 4383 Killed Ao Cang Heaven One After Another", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4384 - Chapter 4384: 4383 Killed Ao Cang Heaven One After Another</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4384: 4383 killed Ao Cang Heaven one after another<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>The Heaven Origin powerhouses in the universe were on the verge of collapse.<br/><br/>However, their hearts were filled with fear and despair. They still wanted to live.<br/><br/>They unleashed powerful attacks one by one and fled into the distance.<br/><br/>“A mantis trying to stop a chariot!”<br/><br/>Wang Xian looked at them with a look of disdain.<br/><br/>He waved his arm and a wave of energy enveloped everyone within.<br/><br/>Wang Xian’s figure also disappeared in an instant.<br/><br/>“Bang Bang Bang!”<br/><br/>“Bang Bang Bang!”<br/><br/>He instantly teleported to the front of the Heaven’s origin manifestation powerhouses and placed his palm on their heads.<br/><br/>The terrifying power caused their vitality to disappear immediately.<br/><br/>The Heaven’s origin manifestation powerhouses in the prideful universe did not have the ability to resist at all.<br/><br/>Perhaps if they didn’t flee and fought head-on, they might be able to resist for a few seconds.<br/><br/>However, all of this couldn’t change this fact!<br/><br/>“It’s your turn.”<br/><br/>After destroying the group of heaven origin creation realm powerhouses, Wang Xian finally looked at the woman and said faintly.<br/><br/>“You can’t kill me. Please don’t kill me. I beg you, please don’t kill me.”<br/><br/>The woman was on the verge of collapse and begged Wang Xian for mercy.<br/><br/>“Strength comes first. If you are strong, you can kill my foster son. You can force him to hand over the ultimate treasure of Tianyuan. Unfortunately, my strength is stronger than Yours Now!”<br/><br/>Wang Xian stared at her and asked indifferently.<br/><br/>Boom<br/><br/>He didn’t show the slightest mercy and killed her directly.<br/><br/>Her child was also dead in the womb.<br/><br/>This was also karma.<br/><br/>If Tianci was unwilling to hand over the ultimate treasure of Tianyuan, the entire six paths universe would be plunged into misery.<br/><br/>Countless living beings would die because of this.<br/><br/>They deserved to die!<br/><br/>“Foster father, when did you become so strong?”<br/><br/>All the powerhouses in the Cang Heaven universe were killed by Wang Xian in a short period of time.<br/><br/>Tianci widened his eyes and flew over immediately. He asked with a face full of shock.<br/><br/>“Hehe, it was not long ago.”<br/><br/>Wang Xian smiled faintly and patted his shoulder. “Next, get ready for battle. Go to the Cang Heaven Universe and destroy them all!”<br/><br/>“HMM?”<br/><br/>Tianci paused when he heard Wang Xian’s words. His pupils constricted slightly. “Foster father, are we really going to destroy the Cang Heaven Universe?”<br/><br/>“Yes, we have already formed an enmity. Are we still going to let them live?”<br/><br/>Wang Xian nodded. “Besides, the resources of the Dragon Palace are almost used up. Let’s destroy the universe and get some resources!”<br/><br/>“This… this… foster father, do we have to destroy all the living beings?”<br/><br/>Tianci opened his mouth and could not help but ask.<br/><br/>“Hehe, how can that be? Your Foster father is not a murderer who kills Innocents. However, all the resources and those who are above level seven and above must die!”<br/><br/>Wang Xian said.<br/><br/>That’s right. Although Wang Xian would not say that he would massacre all the living beings in the entire universe, those who were at or above level seven would have to die.<br/><br/>This was also to prevent the Cang Heaven universe from taking revenge on them and the six paths universe in the future.<br/><br/>If they did not get rid of the root of the problem, the spring wind would blow again!<br/><br/>In addition, he would do what he did in the Void universe back then and plunder all the resources in the Cang Heaven Universe!<br/><br/>This was the price they had to pay for killing Tianci!<br/><br/>Without Tianci’s death, even if Wang Xian was very powerful now, he would not slaughter an unfamiliar universe master for no reason.<br/><br/>The Dragon Palace did not take the initiative to provoke others. However, if the other party provoked them, they would have to pay a terrible price!<br/><br/>“Yes, Foster Father!”<br/><br/>Tianci nodded his head heavily.<br/><br/>“HMM, let me look for the treasures on their bodies. There should be a treasure that can allow them to return to the Cang Heaven Universe in an instant!”<br/><br/>Wang Xian searched the bodies of AO Cangtian and the rest.<br/><br/>On Ao Cangtian’s body, he found a treasure that could allow them to return to the Cang Heaven Universe in an instant!<br/><br/>Buzz<br/><br/>He sent a message to an lie and waited quietly.<br/><br/>“Hiss, did you guys see that? Did you see that? Oh My God, just now, our Lord Tianci’s foster father killed nine cultivators in the Heavenly Yuan realm in an instant. The other four were so scared that they ran away. Oh My God, how is this possible? !”<br/><br/>“Those thirteen cultivators in the Heavenly Yuan realm are obviously very powerful. Our Lord Tianci and Lord Undead are not their match, but these people were killed in an instant in front of the Dragon King. How powerful is the Dragon King? !”<br/><br/>“It’s too shocking, too shocking. My God, how terrifying is our Lord Tianci’s foster father? Just how powerful is he?”<br/><br/>“Hahaha, awesome, this is too awesome. Those 13 Heavenly Kismet realm powerhouses actually dared to directly charge into our six paths universe and ask our Lord Tianci to hand over the Heavenly Kismet Treasure. They even said that if we didn’t hand it over, they would directly slaughter our entire six paths universe. Aren’t they arrogant now?”? “Our Lord Tianci’s foster father easily killed them!”<br/><br/>“The Dragon King’s thigh is simply too thick. Wuwu, our Lord tianci being able to form an affinity with the Dragon King is simply the greatest honor and opportunity for our Mu Li tribe!”<br/><br/>At this moment, all the experts of the Mu Li tribe below were originally looking at this scene with fear and trepidation.<br/><br/>However, when they saw this result, their faces were filled with disbelief.<br/><br/>The 13 experts charged towards them with an invincible and condescending attitude. They wanted their lord Tianci to hand over the Heavenly Yuan Destiny Treasure.<br/><br/>They wanted to destroy their six paths universe.<br/><br/>What was the result?<br/><br/>Aren’t they arrogant now?<br/><br/>They dared to kill our Lord Tianci. Don’t they know that our Lord Tianci’s foster father is the Dragon King?<br/><br/>The Invincible Dragon King! ! !<br/><br/>They were all shocked and surprised as they discussed.<br/><br/>The experts of the Mu Li tribe were also excited.<br/><br/>They were stronger and knew that there were strong and weak in the Heavenly Yuan blessed realm.<br/><br/>But now, the strength that their lord Tianci’s foster father displayed was invincible!<br/><br/>Yes, Invincible!<br/><br/>This made them extremely excited.<br/><br/>Just what level did their Mu Li tribe obtain?<br/><br/>“Buzz!”<br/><br/>However, while the Mu Li tribe’s experts were discussing animatedly.<br/><br/>In a palace located in the Mu Li tribe, terrifying figures appeared one after another!<br/><br/>Four incomparably huge kun.<br/><br/>A group of Dragon Palace’s Divine Dragons!<br/><br/>Their bodies emitted a powerful aura as they slowly flew to the sky.<br/><br/>“Keke, Dragon King, I heard that someone killed the crown prince of Tianci. Which universe is reckless? Let’s go and kill them!”<br/><br/>Mo Sha’s excited voice was heard.<br/><br/>The group of experts from the Dragon Palace quickly arrived in front of Wang Xian. All of them were excited!<br/><br/>On the side of the experts from the Dragon Palace, Wang Xian had already told them to prepare in advance!<br/><br/>After all, there were experts who had killed tianci. It was impossible for Wang Xian not to kill his way into their universe!<br/><br/>Therefore, when he sent a message to an lie, 15 powerhouses from the Dragon Palace who were in the Heavenly Yuan realm immediately teleported over!\t\t\t\t\t\t</div>", "images": {}, "success": true}