{"id": 1387, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075276.html", "title": "Chapter 4390 - Chapter 4390: 4389 Planned For The Starry Universe And The Belief Universe", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4390 - Chapter 4390: 4389 Planned For The Starry Universe And The Belief Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4390: 4389 planned for the starry universe and the belief universe<br/><br/>“The fifth one.”<br/><br/>In an area of the Cang Heaven Universe, Wang Xian killed a heaven origin creator directly as he muttered.<br/><br/>He had been hunting down the heaven origin creator powerhouses in the Cang Heaven Universe for more than a thousand years!<br/><br/>And up until today, five heaven origin creator powerhouses had been completely killed by Wang Xian.<br/><br/>On the other hand, the Heaven’s origin powerhouses had been resurrected in the land of origin with a resurrection treasure!<br/><br/>“I still have to make a trip to the land of origin. There are seven Heaven’s origin powerhouses in the Cang Heaven Universe who have been resurrected there.”<br/><br/>Wang Xian mumbled.<br/><br/>Five of them had been completely annihilated by him.<br/><br/>There were also ao Cang Heaven and the other seven.<br/><br/>However, after Wang Xian did some divination, he realized that he could no longer lock onto the location of Ao Cang Heaven and that woman.<br/><br/>He must have used some kind of treasure or method to avoid being locked onto by the divination.<br/><br/>“Let’s go over first!”<br/><br/>Wang Xian moved his body and flew rapidly in the direction of the land of origin.<br/><br/>Although his speed was very fast now, he still needed one to two thousand years to reach there.<br/><br/>He flew rapidly in the universe of the Cang Heaven.<br/><br/>He could see that many experts and disciples on the planets in the Cang Heaven Universe had helpless expressions on their faces.<br/><br/>The Dragon Palace had invaded the Cang Heaven universe for thousands of years.<br/><br/>During these thousands of years, the entire Cang Heaven Universe knew that their Cang Heaven sect ancestor had provoked an existence that he could not afford to provoke.<br/><br/>This existence had invaded the Cang Heaven Universe.<br/><br/>In the entire Cang Heaven universe, all the powerful disciples had to hand over their treasures.<br/><br/>If they didn’t hand them over, then they had to hand over their lives.<br/><br/>Under such circumstances, all the powerful disciples in the entire universe knew what to do.<br/><br/>How could some people who wanted to deceive others not be discovered when they lied to the Heavenly Yuan creation realm experts?<br/><br/>Anyone who wanted to deceive others would be killed!<br/><br/>This caused the Dragon Palace to obtain far too many resources from the Cang Heaven Universe!<br/><br/>The resources were so many that even the disciples of the Dragon Palace didn’t dare to imagine it!<br/><br/>Last time, when they attacked the void space, although they had a lot of resources, the Dragon Palace only asked for 40% of them.<br/><br/>In addition, the resources in the void space were all space-related, and the disciples of the Dragon Palace couldn’t use them.<br/><br/>And the disciples of the Dragon Palace could use the resources of the Cang Heaven Universe.<br/><br/>Most importantly, the Cang Heaven universe wasn’t weak either.<br/><br/>The gap between the two wasn’t very big.<br/><br/>The resources in the entire universe were also extremely abundant!<br/><br/>During this invasion process, some disciples of the Dragon Palace, who were at the peak of the ruler realm, directly touched the threshold of a breakthrough.<br/><br/>They directly made a breakthrough in this universe!<br/><br/>Now, this universe had already opened up five spots for a breakthrough. After the disciples of the Dragon Palace used one, there were still four!<br/><br/>This also made the number of Heavenly Yuan creation realm experts in the Dragon Palace reach seventeen.<br/><br/>Time passed day by day.<br/><br/>The entire Cang Heaven Universe was completely conquered by the Dragon Palace.<br/><br/>All the treasures were collected by the Dragon Palace.<br/><br/>All the grotto-heavens and blessed lands in the Cang Heaven Universe were taken away as well.<br/><br/>Two thousand years later, Wang Xian appeared in the land of origin.<br/><br/>The last time he came here was to kill the enemy.<br/><br/>It was the same this time!<br/><br/>The lamp of divination looked through the information one by one, and a smile appeared on his face.<br/><br/>Among the powerhouses in the Cang Heaven Universe, three were still hiding in the land of origin.<br/><br/>Two of them had escaped to a place even further away.<br/><br/>Furthermore, Wang Xian could not predict ao cang heaven and the rest.<br/><br/>Let’s destroy the three of them first<br/><br/>Wang Xian thought to himself as he flew forward quickly.<br/><br/>When he arrived at the land of origin once again, Wang Xian was still filled with shock when he saw the huge space meteorite that was like a beehive.<br/><br/>This land of origin was too huge and magnificent.<br/><br/>It was comparable to a space meteorite of the entire universe.<br/><br/>Occasionally, he could sense the aura of other Heaven’s origin creation stage powerhouses.<br/><br/>Wang Xian entered a cave and flew straight in.<br/><br/>“There’s a reason why many Heaven’s origin creation stage powerhouses set the place where they resurrected here.”<br/><br/>Wang Xian entered the cave and muttered as he looked at the entrance of the countless tunnels.<br/><br/>This starry meteorite that was like a beehive was comparable to the size of a universe.<br/><br/>In a universe, it would take thousands of years for an average powerhouse to fly from the east to the west.<br/><br/>This beehive-like place of origin was filled with meteorites. To break through the meteorites from the east to the west, even for Wang Xian, it would take hundreds of millions of years to open a passageway.<br/><br/>Therefore, it was too difficult to find someone who was hiding inside.<br/><br/>It was even more difficult than finding a needle in a haystack.<br/><br/>If Wang Xian didn’t have the divination lamp, he wouldn’t be able to do anything about it.<br/><br/>At this moment, Wang Xian felt fortunate that he had traded the fragment of the galaxy for the divination lamp!<br/><br/>“Here.”<br/><br/>After a few decades, Wang Xian entered a cave and looked ahead.<br/><br/>The corner of his mouth curled up slightly as he broke through the meteorites.<br/><br/>“Huh?”<br/><br/>At the same time, an old man in the depths of the cave opened his eyes and looked at the commotion.<br/><br/>There was a hint of fear on his face.<br/><br/>“No, no, this is impossible. This is impossible!”<br/><br/>He growled in a low voice and was filled with panic.<br/><br/>“Bang!”<br/><br/>However, Wang Xian’s figure appeared very quickly. He stared at him and waved his arm.<br/><br/>He didn’t say anything and directly extinguished it.<br/><br/>After that, the lamp of divination divined that he wasn’t completely dead.<br/><br/>In the Cang Heaven Universe, he was resurrected again.<br/><br/>However, it was estimated that the number of times he could be resurrected had reached its limit.<br/><br/>“I’ll set up a devil spirit altar here. If I come here again, it’ll be much more convenient.”<br/><br/>Wang Xian then set up a devil spirit altar and flew to another place.<br/><br/>A few decades later, Wang Xian arrived at a cave in the land of origin. He saw two powerhouses in the Heaven’s origin realm inside.<br/><br/>He smiled and killed them easily.<br/><br/>“Continue to chase after them!”<br/><br/>The other two were already flying into the distance. Wang Xian chased after them rapidly.<br/><br/>A few powerhouses in the Cang Heaven universe were killed by Wang Xian several times.<br/><br/>Those who were resurrected here were also existences who had just entered the Heaven’s origin realm.<br/><br/>Their flying speed was more than ten to twenty times slower than Wang Xian’s.<br/><br/>They had been fleeing for ten thousand years, and Wang Xian could catch up to them within one to two thousand years.<br/><br/>Wang Xian was not going to let go of the Heaven’s origin creation level powerhouses in the Cang Heaven Universe.<br/><br/>Such powerhouses were still a threat to the Dragon Palace and the nine origin universe. He would kill them if he could.<br/><br/>In the next few hundred years, Wang Xian easily caught up to the other two heaven’s origin creation level powerhouses.<br/><br/>He destroyed them directly!<br/><br/>When Wang Xian killed the Heaven’s origin powerhouses one by one in the Cang Heaven Universe, ao Cang Heaven and the rest, who were located somewhere in the land of origin, also received messages from their subordinates.<br/><br/>When they saw the messages one by one, their bodies trembled violently.<br/><br/>In their Cang Heaven Universe, the Heaven’s origin powerhouses were quickly killed one by one.<br/><br/>This kind of extermination, but thoroughly exterminated!<br/><br/>Dead, is truly dead!\t\t\t\t\t\t</div>", "images": {}, "success": true}