{"id": 1388, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075281.html", "title": "Chapter 4391 - Chapter 4391: 4390 Planned The Starry Universe And Believed In The Universe", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4391 - Chapter 4391: 4390 Planned The Starry Universe And Believed In The Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4391: 4390 planned the starry universe and believed in the universe<br/><br/>“Husband, my father was killed. He was completely killed.”<br/><br/>The woman looked at the message sent by the communication device and cried out in pain and anger.<br/><br/>Beside him, ao Cang Tian was also sitting at the side with an awkward expression.<br/><br/>He also received messages one after another. Every time he saw these messages, his expression darkened.<br/><br/>Apart from them, almost all the Heavenly Yuan creator realm powerhouses in the Cang Heaven Universe had been killed.<br/><br/>The accumulation of hundreds of billions of years in the Cang Heaven Universe had all disappeared.<br/><br/>Even his strength had decreased.<br/><br/>“I must take revenge for this.”<br/><br/>Ao cangtian growled with a distorted expression.<br/><br/>Time passed, and the process of conquering the Cang Heaven universe gradually came to an end.<br/><br/>The powerful disciples of the Dragon Palace stayed in the Cang Heaven Universe for more than 10,000 years before they emptied out all the resources in the entire Cang Heaven Universe.<br/><br/>Meanwhile, almost all the heaven origin creator powerhouses in the Cang Heaven Universe were hunted down by Wang Xian.<br/><br/>Only Ao Cangtian, his wife, and a heaven origin creator powerhouse escaped.<br/><br/>“Dragon King, we have gained a lot this time.”<br/><br/>Upon returning to the center of the Cang Heaven Universe, Mo Sha and the rest said excitedly when they saw Wang Xian return.<br/><br/>“Has everything in the Cang Heaven Universe been dealt with?”<br/><br/>Wang Xian asked with a smile on his face.<br/><br/>“Dragon King, everything has been dealt with. Now, other than the Heavenly Yuan creator’s quota that can not be taken away, we have taken everything else.”<br/><br/>Mo Sha said with a smile.<br/><br/>“Alright!”<br/><br/>Wang Xian nodded.<br/><br/>This time, the Dragon Palace had added a wood attribute powerhouse during this period.<br/><br/>However, in the Cang Heaven universe, there were still spots for the Heaven’s fate with the six attributes of water, fire, wind, thunder, Light, darkness, and light.<br/><br/>In addition to the wood and light attributes in the sword and Magic Universe.<br/><br/>The Dragon Palace still had eight spots for the Heaven’s fate powerhouses.<br/><br/>These spots would save Wang Xian and the rest a lot of time.<br/><br/>However, if there were any dragon palace disciples who lacked spots in the future, there was no need for Wang Xian to do it himself.<br/><br/>It was enough for Mo Sha and the rest to protect the path of the Dragon Palace Disciples!<br/><br/>“Let’s go back directly. After we return, we will distribute the resources to the disciples for cultivation. We will also consider the next matters of the Dragon Palace.”<br/><br/>Wang Xian spoke to them.<br/><br/>Mo Sha and the rest nodded their heads.<br/><br/>Buzz<br/><br/>Wang Xian looked to the side. With a wave of his arm, an incomparably huge mountain peak was directly condensed in the void.<br/><br/>Creating a huge mountain peak out of thin air. This kind of power was very impressive.<br/><br/>This was the usage of the ten attributes in Wang Xian’s body.<br/><br/>It was also the usage of the power of chaos.<br/><br/>The chaos turned everything into chaos. Everything melted into chaos.<br/><br/>Now, Wang Xian could create things at will.<br/><br/>He could even create a type of living creature.<br/><br/>To him, this was very simple.<br/><br/>After creating a mountain peak, Wang Xian waved his arm and a line of words appeared on the mountain peak.<br/><br/>“The quota of Heaven’s origin in the universe belongs to My Dragon Palace. The possessor shall die!”!<br/><br/>There were more than ten big words, and each of them contained a terrifying pressure and energy.<br/><br/>Even existences who had just entered the realm of Heaven’s origin felt a great pressure when they saw these words.<br/><br/>This was Wang Xian’s declaration of the ownership of the quota of Heaven’s origin in the universe.<br/><br/>If there were any powerhouses from other universes who dared to make a breakthrough here, they would have to consider the revenge they would have to face.<br/><br/>After leaving more than ten words, Wang Xian and all the powerful disciples of the Dragon Palace returned to the Dragon Palace.<br/><br/>Once they returned to the Dragon Palace, the huge amount of resources were piled up in the area beside the Dragon Palace.<br/><br/>There were all kinds of divine trees, divine trees, and divine herbs. They were densely packed.<br/><br/>There was no way to store them in the Dragon Palace.<br/><br/>There were more than a million divine trees in the ruler realm.<br/><br/>This was the accumulation of the entire universe.<br/><br/>These divine trees, divine grass, and the like were all planted around the dragon palace, almost surrounding it.<br/><br/>As for the venerable-level divine trees, divine grass, and divine flowers, there were even more of them.<br/><br/>However, this time, Mo Sha and the others used powerful methods to move several treasured lands in the Cang Heaven universe over.<br/><br/>This made the surroundings of the Dragon Palace look like heaven in the eyes of countless powerhouses.<br/><br/>When they walked, the roadside was filled with spiritual herbs of the venerable realm.<br/><br/>These were all spiritual herbs of the seventh level and above.<br/><br/>Those with lower levels were not qualified to be by the roadside.<br/><br/>Once they got close to the Dragon Palace, they would be surrounded by all kinds of treasures in the ruler realm.<br/><br/>There were also special and powerful mountains and special and powerful islands.<br/><br/>Wait, wait, wait!<br/><br/>Wang Xian had some understanding of the harvest this time around. Therefore, he and Mo sha arranged these resources properly.<br/><br/>The disciples of the Dragon Palace could not digest these resources at all.<br/><br/>They could not use them all.<br/><br/>Moreover, there were many treasures that could be regenerated. Naturally, they could not be used up directly.<br/><br/>Wang Xian and the rest spent a few decades to plan the surroundings of the Dragon Palace.<br/><br/>They divided all the divine trees and herbs that were suitable for survival into different areas to be planted.<br/><br/>In addition, there were a large number of treasures buried in the blessed land around the Dragon Palace.<br/><br/>This allowed the energy density of the entire dragon palace to reach a terrifying level.<br/><br/>It even surpassed the energy level of the Great Dao of heaven.<br/><br/>With such a huge amount of energy and all sorts of precious treasures, even an ordinary dog could be raised to the level of a ruler.<br/><br/>Even if it was just an ordinary dog, it would still be able to reach the ruler realm.<br/><br/>For disciples at the venerable level, there were countless kinds of heaven-defying herbs.<br/><br/>There was a bloodline in the nine origin universe, and there was a high-level race among the peak races.<br/><br/>Now, even if it was a creature from a low-level race in the universe, it could still reach the ruler realm after surviving in the Dragon Palace for hundreds of millions of years.<br/><br/>As for the limitations of the bloodline?<br/><br/>The various resources in the Dragon Palace were enough to allow his bloodline to reach the level of a divine dragon.<br/><br/>Furthermore, for the sake of the environment in the Dragon Palace, Wang Xian buried a corpse of Ao Cangtian below the Dragon Palace as energy.<br/><br/>The energy emitted from the corpse and the law energy of the metal attribute were simply heaven-defying.<br/><br/>It was too beneficial for the cultivation of the disciples of the Dragon Palace!<br/><br/>“Dragon King, the treasures we’ve obtained this time are simply too great. There’s no need for the disciples of the Dragon Palace to go anywhere else to cultivate. In addition, there are several divine trees above the peak of the ruler realm and three treasures that are comparable to those who have just entered the Heavenly Yuan Destiny Realm.”<br/><br/>“The corpses will allow the dragon palace to quickly give birth to heavenly yuan destiny realm experts.”<br/><br/>Prime Minister Gui looked at the Dragon Palace which had undergone a huge change and sighed.<br/><br/>“Hehe, yes. War is the fastest way to improve. The gains this time are too terrifying.”<br/><br/>Wang Xian nodded his head.<br/><br/>He didn’t feel anything when he destroyed the Void universe last time. However, this time, he felt that it was a huge gain.<br/><br/>The gains were too terrifying.<br/><br/>“Hehe, it shouldn’t be too much of a problem for the Dragon Palace to obtain an explosive period of strength and increase the number of powerhouses in the Heaven’s origin realm.”<br/><br/>Prime Minister Gui said.<br/><br/>Wang Xian nodded his head and appeared to be deep in thought.<br/><br/>He was thinking about the future of the Dragon Palace!\t\t\t\t\t\t</div>", "images": {}, "success": true}