{"id": 1386, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075271.html", "title": "Chapter 4389 - Chapter 4389: Prophet 4388’S Rejection", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4389 - Chapter 4389: Prophet 4388’S Rejection</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4389: Prophet 4388’s rejection<br/><br/>“Your Cang Tian universe is being invaded?”<br/><br/>When prophet Hong heard their words, his expression was slightly shocked once again.<br/><br/>He knew the strength of the Cang Tian universe.<br/><br/>But now, the Cang Tian Universe was being invaded?<br/><br/>Looking at Ao Cang Tian and the others who had already lowered their cultivation levels, prophet Hong’s gaze also flickered slightly.<br/><br/>To be able to invade the entire Cang Heaven Universe and kill Ao Cangtian and the others to reduce their strength, the other party’s strength was extremely terrifying.<br/><br/>At the very least, even if it was divining the power of the universe, it wouldn’t be able to do this.<br/><br/>“I’m sorry, Patriarch of the Cang Heaven Sect, our divination universe will not participate in your battle.”<br/><br/>Prophet Hong directly rejected.<br/><br/>“This…”<br/><br/>Ao Cangtian was a little dejected, even though he had already expected this result in his heart.<br/><br/>“Then prophet Hong, we won’t disturb you any further.”<br/><br/>Ao Cang Tian cupped his hands and left with his wife.<br/><br/>Prophet Hong looked at their figures, his gaze flickering.<br/><br/>“Grandfather, this ao Cang Tian cult’s ancestor is a rather arrogant expert. This time, he looks extremely dispirited. I wonder what kind of situation he has provoked to be in such a miserable state. Even the Cang Tian universe has been invaded.”<br/><br/>After the Proud Cang Heaven sect left, the young man standing at the side couldn’t help but ask curiously.<br/><br/>“Even the universe has been occupied. He must have encountered a powerful enemy.”<br/><br/>Prophet Hong pondered and replied.<br/><br/>“Grandfather, if we extend our hands to help him at this time, wouldn’t we be able to make an expert of the Great Dao owe a favor and fight for us? Your relationship with this ancestor of the Proud Cang Heaven sect should be pretty good, right?”<br/><br/>The young man continued to speak.<br/><br/>“An enemy that can make him so miserable and dare to attack an existence of the Cangtian universe, could it be an ordinary force? We can’t just blindly Wade into the Muddy Waters.”<br/><br/>Prophet Hong shook his head. Following that, he moved his palm and took out a compass.<br/><br/>The compass was filled with the stars of the universe. He placed his palm on it and began to perform divination.<br/><br/>The young man at the side saw his grandfather take out a divination compass and looked at it with great interest.<br/><br/>“Pu!”<br/><br/>However, very quickly, prophet Hong’s expression suddenly changed drastically, and his face turned extremely red.<br/><br/>A mouthful of fresh blood could not help but spurt onto the divination compass.<br/><br/>“Grandfather, What’s Wrong?”<br/><br/>The young man’s expression changed greatly, and he hurriedly asked prophet Hong with concern.<br/><br/>“Nothing.”<br/><br/>Prophet Hong waved his hand and wiped the fresh blood from the corner of his mouth. His eyes were also filled with shock. “The divination backlash.”<br/><br/>“What? Divination backlash?”<br/><br/>When the youth heard this, he was shocked as well. “Grandfather, you’re an existence at the Great Dao level. How could you have a divination backlash?”<br/><br/>Prophet Hong shook his head. “No wonder the Proud Heaven is in such a miserable state. Even their universe has been invaded. It turns out that they’ve provoked a terrifying enemy, a chaos-level existence. I really didn’t expect that other than the evil sequence faction and the Justice Alliance, there would actually be a chaos-level existence.”<br/><br/>“Chaos-level?”<br/><br/>When the youth heard this, he was shocked again.<br/><br/>Prophet Hong nodded. After hesitating for a moment, he took the divination compass and continued divining.<br/><br/>With his strength, if he divined a chaos-level existence, he would suffer a backlash.<br/><br/>However, he could not divine this chaos-level expert. He could divine ao Cang Tian and obtain some information from him.<br/><br/>Soon, he shook his head.<br/><br/>“I really didn’t expect there to be such a thing.”<br/><br/>Prophet Hong sighed slightly.<br/><br/>“Grandfather, what is it?”<br/><br/>The young man asked curiously.<br/><br/>“Do you still remember the six paths universe?”<br/><br/>Prophet Hong looked at his grandson. “Back then, old Guo, your grandfather Guo divined that there was a heavenly fate treasure born in the six paths universe. Now, that heavenly fate treasure belongs to a young man in the six paths universe. This young man, who is only a few hundred million years old, is also the chosen one.”<br/><br/>“Not long ago, Ao Cangtian wanted to seize the heavenly fate treasure and give it to his future son. He even killed that young man once. In the end, that young man coincidentally took in a foster father. His foster father was the expert who killed Ao Cangtian.”<br/><br/>“I don’t dare to divinate this expert. He is very powerful and at the primal chaos level. As long as I divined him, I would suffer a strong backlash.”<br/><br/>“This is really karma. Little Fish, you have to remember that all things have karma. Sometimes, the karma that you planted doesn’t have a result because you blocked it. However, not every karma can be blocked by you!”<br/><br/>Prophet Hong reminded his grandson, “The enemy that Ao Cang Tian has provoked this time is very powerful. It is so powerful that he can only run away. I hope that it doesn’t involve me. Sigh!”<br/><br/>As he spoke, he shook his head again, his eyes showing a trace of worry.<br/><br/>He owed ao Cangtian a favor, so he set up a formation to prevent divination in his body.<br/><br/>But at the same time, he also planted a cause.<br/><br/>If that chaos-level powerhouse really blamed him, he couldn’t do anything about it.<br/><br/>He also had to bear the consequences.<br/><br/>If a chaos-level expert really wanted to cause trouble for him, what could they do?<br/><br/>Resist?<br/><br/>It was unrealistic.<br/><br/>They could only take out enough things to make up for it and obtain forgiveness.<br/><br/>Otherwise, being targeted by a chaos-level existence was too terrifying!<br/><br/>Although their divination of the universe was very powerful, there were three great dao-level experts.<br/><br/>But unless the three of them were always together, once they separated, there would be danger.<br/><br/>“There’s actually such a thing? Ao Cang Tian and the others are simply courting death by killing the adopted son of a powerful expert. Grandfather, I feel that that powerful expert shouldn’t blame us. We are only returning a favor. At most, when that powerful expert comes, we will give him enough compensation. Although he is very strong, there’s no need to offend us for divination.”<br/><br/>The young man said.<br/><br/>“Hehe.”<br/><br/>Prophet Hong smiled and nodded his head in agreement.<br/><br/>“The person from the six paths universe is called Mu Li Tianci. If you meet him in the land of origin, make friends with him if you can. In short, don’t make him your enemy. Also, tell the other strong disciples in our universe.”<br/><br/>Prophet Hong continued his divination and said.<br/><br/>“It’s Grandpa!”<br/><br/>The young man nodded.<br/><br/>Wang Xian didn’t know what happened in the land of origin.<br/><br/>However, even if he knew, he wouldn’t care too much about it.<br/><br/>Wang Xian didn’t have the intention to completely destroy ao Cangtian and the rest.<br/><br/>More importantly, it was too difficult to completely kill an existence at this level.<br/><br/>Just like the king of Void back then.<br/><br/>It was extremely difficult to kill him completely.<br/><br/>If he couldn’t kill him, he couldn’t kill him.<br/><br/>Wang Xian didn’t care if they would seek revenge in the future.<br/><br/>With Wang Xian’s current strength, he didn’t care at all.<br/><br/>Moreover, the Dragon Palace would become stronger and stronger in the future. He would also become stronger and stronger.<br/><br/>At this moment, Wang Xian was chasing after and killing many powerhouses in the universe of Heaven origin.<br/><br/>When there were existences of the Great Dao level in a universe, it was impossible for the other treasures of the Heaven’s origin realm in this universe to be too many.<br/><br/>Moreover, most of the places where they were resurrected were in their own universe.<br/><br/>This also resulted in Wang Xian being able to completely destroy them!\t\t\t\t\t\t</div>", "images": {}, "success": true}