{"id": 1384, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075262.html", "title": "Chapter 4387 - Chapter 4387: 4386 Ao Cangtian’S Request For Help", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4387 - Chapter 4387: 4386 Ao Cangtian’S Request For Help</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4387: 4386 ao Cangtian’s request for help<br/><br/>“What!”<br/><br/>When Ao Cangtian and the woman heard Wang Xian’s voice, they looked over with despair on their faces.<br/><br/>It’s over!<br/><br/>Their expressions froze.<br/><br/>“Die!”<br/><br/>Wang Xian didn’t hesitate at all. He waved his arm and two streams of black energy wrapped around them, killing them instantly.<br/><br/>Buzz<br/><br/>After killing them, Wang Xian took out the lamp of divination and continued to divine their location.<br/><br/>This location seems to be in the land of origin. It’s a little far. However, their strength has decreased this time<br/><br/>Wang Xian thought to himself as he obtained their location through the lamp of divination.<br/><br/>He pondered for a while.<br/><br/>The last time, the two powerhouses from the entire Na Tian universe were resurrected in the land of origin.<br/><br/>He had also been to the land of origin once.<br/><br/>From the looks of it now, there were quite a number of powerhouses who were building their own place of resurrection there.<br/><br/>It seemed that he was going to set up a demonic altar there.<br/><br/>If there were more opponents resurrecting there, Wang Xian would be able to kill them directly.<br/><br/>After pondering in his heart, Wang Xian finally decided not to pursue and kill them in the land of origin.<br/><br/>Ao Cang Heaven was a powerhouse of the Great Dao level after all.<br/><br/>He would definitely be able to guess that he could chase after them.<br/><br/>Under such circumstances, they would definitely escape immediately after they resurrected.<br/><br/>Under such circumstances, it would be much more difficult for Wang Xian to chase after them.<br/><br/>It would also waste a lot of time.<br/><br/>Wang Xian decided to settle the matters in the Cang Heaven Universe first before making a decision.<br/><br/>If Ao Cangtian and the rest were still hiding in the land of Origin after settling the Cang Heaven Universe, Wang Xian could kill them directly.<br/><br/>Compared to Ao Cangtian who was killed consecutively, the resources in the Cang Heaven Universe were more important.<br/><br/>The Cang Heaven Universe was different from the Void universe.<br/><br/>The Void universe only had space attributes.<br/><br/>However, the Cang Heaven universe, like the nine-origin universe, had nine attributes.<br/><br/>Under such circumstances, the resources in the Cang Heaven Universe were of great use to the Dragon Palace.<br/><br/>All of them could increase the strength of the disciples of the Dragon Palace.<br/><br/>“Let’s go and kill the other heaven origin creation stage powerhouses first.”<br/><br/>Wang Xian thought to himself.<br/><br/>There were a total of twelve heaven origin creation stage powerhouses who came with Ao Cang Heaven.<br/><br/>Excluding the four who believed in the universe, excluding the woman, there were still seven.<br/><br/>These seven were all powerhouses from the Cang Heaven sect.<br/><br/>They were all subordinates of Ao Cang Heaven.<br/><br/>They were all in the Cang Heaven Universe now.<br/><br/>Wang Xian’s divination lamp began to divine the control level expert.<br/><br/>After finding his position, he moved and immediately charged over.<br/><br/>At the same time, he was located in the Cang Heaven Universe’s thousand Spirit Island area.<br/><br/>The Thousand Spirit Island was a treasure ground in the Cang Heaven Universe.<br/><br/>This was the territory of the Thousand Spirit sect. The Thousand Spirit sect was the sect that the wife of the chief of the Cang Heaven sect used to belong to.<br/><br/>In the Cang Heaven Universe, the Cang Heaven sect was the strongest. The reason why the Thousand Spirits sect and the other two sects could exist was because of the Cang Heaven sect.<br/><br/>The thousand spirits sect was the matriarch of the Cang Heaven sect, which was also the sect founded by the matriarch’s family.<br/><br/>The other two sects were founded by the younger brother of the Cang Heaven sect and a friend of the Cang Heaven sect.<br/><br/>It was also because of this relationship that there were four forces in the Cang Heaven Universe.<br/><br/>Otherwise, with Ao Cangtian’s strength, he could completely unify the Cang Heaven Universe.<br/><br/>Thousand Spirit Island was a region formed by thousands of islands. The islands floated in the void, and each island was extremely beautiful.<br/><br/>And the size of each island was not less than the size of a planet.<br/><br/>However, at this moment, thousand spirit island was filled with killing intent.<br/><br/>The disciples were all wearing armor, and their faces were filled with solemnity.<br/><br/>Three experts were sitting in the hall at the center of Thousand Spirit Island.<br/><br/>Below them, there were more than a thousand rulers.<br/><br/>“What’s the situation now? Have you contacted the ancestor of the Cang Heaven Order and Qian Qian?”<br/><br/>On the stage, an old man asked with an embarrassed expression.<br/><br/>On the side, another old man shook his head with an embarrassed expression and looked at him. “You can’t contact them either?”<br/><br/>“I can’t!”<br/><br/>The old man in the middle shook his head and his expression changed slightly.<br/><br/>“Reporting to the patriarch, according to the information we received, half of the territory of the Cangtian sect has been occupied. Now, the Army of the Dragon Palace is invading the surrounding area at a terrifying speed.”<br/><br/>“It is estimated that they will invade us in about five hundred years.”<br/><br/>At this moment, a disciple came in with an ugly expression and reported, “In addition, the intruders killed all the experts above the seventh level of the sovereign realm and demanded all the experts and disciples to hand over all their resources. Those who disobeyed were all killed.”<br/><br/>“Hu.”<br/><br/>On the stage, the old man in the middle heard it and let out a heavy breath. His face was extremely gloomy.<br/><br/>“We don’t need to worry about the patriarch and Patriarch’s wife’s safety. Prepare to retreat. The patriarch and Patriarch’s wife have provoked an existence that they can not afford to provoke.”<br/><br/>A burly middle-aged man beside him said in a deep voice!<br/><br/>He had followed the patriarch of the Cang Heaven sect to the six paths universe.<br/><br/>He had also personally witnessed their patriarch being killed in one move.<br/><br/>He was also a control-level existence, but he had also been killed in one move.<br/><br/>The opponent’s strength was too terrifying.<br/><br/>It was suspected to be at the legendary realm!<br/><br/>“Escape? Where can we escape to?”<br/><br/>The person in the middle said helplessly.<br/><br/>The ancestor’s wife of the Cang Heaven sect was his daughter.<br/><br/>However, he hadn’t expected that his daughter and the others would find a heavenly yuan destiny treasure for his grandson to live with.<br/><br/>He hadn’t expected to encounter a terrifying enemy.<br/><br/>This made him unwilling.<br/><br/>“Why did something like this happen?”<br/><br/>The old man clenched his fists and couldn’t help but ask.<br/><br/>The entire Cang Heaven Universe had been invaded and would soon invade them.<br/><br/>What should they do?<br/><br/>“Why did something like this happen? Then we’ll have to ask your Cang Heaven sect ancestor. Hehe, you’re courting death, yet you still want to ask why?”<br/><br/>At this moment, a contemptuous voice was heard.<br/><br/>The figure of a young man suddenly appeared in the main hall.<br/><br/>The person who came was naturally Wang Xian.<br/><br/>Boom<br/><br/>“It’s You!”<br/><br/>At the side, the two middle-aged elders revealed a shocked expression when they saw Wang Xian’s figure.<br/><br/>“It’s me.”<br/><br/>Wang Xian nodded his head faintly. “The ancestor of the Cang Heaven sect killed my foster son. He wanted to hide from my Foster Son’s Heaven origin destiny treasure and even threatened the life of the entire six paths universe. Therefore, it is impolite to not reciprocate. I will kill you and Conquer Your Cang Heaven Universe.”<br/><br/>As he spoke calmly, waves of frost energy covered the surroundings.<br/><br/>Wherever the frost passed, everything was frozen.<br/><br/>“Run.”<br/><br/>The middle-aged expert wanted to escape in fear.<br/><br/>However, the moment his body moved, his entire body turned into an ice sculpture.<br/><br/>It was a battle on a completely different level.<br/><br/>“No!”<br/><br/>Around them, the other group of expert disciples felt despair and couldn’t help but roar loudly.<br/><br/>They didn’t want to die.<br/><br/>But the strong preyed on the weak.<br/><br/>All the Karma came from the proud heaven and his wife.\t\t\t\t\t\t</div>", "images": {}, "success": true}