{"id": 1382, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075254.html", "title": "Chapter 4385 - Chapter 4385: 4384 Continued To Kill Ao Cang In The Sky", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4385 - Chapter 4385: 4384 Continued To Kill Ao Cang In The Sky</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4385: 4384 continued to kill Ao Cang in the sky<br/><br/>“Hiss, what is this? Are these the subordinates of the Dragon Palace?”<br/><br/>“Oh my God, is this the power of the Dragon Palace? A total of fifteen terrifying powerhouses flew over, each of them in the Heavenly Yuan realm.”<br/><br/>“The power of the Dragon Palace is so terrifying. This time, the group of people who want to snatch our Lord Tianci’s treasures are going to be unlucky. I’m afraid they would never have thought that our Lord tianci has such a terrifying foster father!”<br/><br/>“Hahaha, it’s so exciting to see the powerhouses of the Dragon Palace coming straight at us. Damn it, they dare to kill our Lord Tianci and steal his treasure. Don’t they know who our Lord Tianci’s foster father is?”<br/><br/>“The strength of the Dragon Palace and the Dragon King is simply Invincible!”<br/><br/>When all the powerhouses of the Dragon Palace arrived, all the powerhouses and disciples of the Mu Li tribe were in an uproar!<br/><br/>They looked at the powerful warriors of the Dragon Palace with shock and excitement.<br/><br/>Although the Dragon Palace was not part of the six paths universe.<br/><br/>It had a lot to do with the Mu Li tribe.<br/><br/>Lord Tianci of the Mu Li tribe was the adopted son of the Dragon King who had watched him grow up!<br/><br/>If there was any problem with the Mu Li tribe, the Dragon King would intervene!<br/><br/>In the future, in the universe, no, even if it was a catastrophe, who would dare to bully their Mu Li tribe?<br/><br/>“This terrifying power?”<br/><br/>The spirits of the dead and the others looked at the fifteen powerhouses of the Dragon Palace, and their pupils constricted slightly.<br/><br/>Their faces were also filled with shock.<br/><br/>Especially the powerhouse who spoke at the front, the spirits of the dead could feel a strong threat from him.<br/><br/>This threat was similar to what they felt from Ao Cangtian.<br/><br/>“This is an existence on the same level as AO Cangtian.”<br/><br/>The undead were slightly shocked.<br/><br/>At the same time, they looked at tianci with envy.<br/><br/>It was too enviable!<br/><br/>“This is the chosen one of our six paths universe!”<br/><br/>Jin Bao could not help but exclaim.<br/><br/>The chosen one!<br/><br/>When he was born, he was accompanied by a heavenly yuan destiny treasure.<br/><br/>He also met the Dragon King of the nine-origin universe. Most importantly, the Dragon King didn’t take away his precious treasure, but instead recognized him as his adopted son.<br/><br/>Now, with this invincible foster father, if he wasn’t the chosen one, then what was he?<br/><br/>“Uncle Mo Sha, leaders.”<br/><br/>Tianci saw Mo Sha and the others and shouted with a smile!<br/><br/>“Hehe, you guys wait here. An lie, wait for my summoning!”<br/><br/>Wang Xian smiled and gestured to them!<br/><br/>Then, he waved his arm and crushed the escape treasure he got from Ao Cangtian.<br/><br/>This treasure could allow him to return to the Cang Heaven Universe in an instant!<br/><br/>As for the exact location of the teleportation to the Cang Heaven universe, Wang Xian could not be sure.<br/><br/>However, no matter where it was, he didn’t have to worry!<br/><br/>Buzz<br/><br/>Wang Xian’s figure started to turn illusory. Very soon, he appeared in a palace in the Cang Heaven Universe!<br/><br/>At the same time, he was located not far from this palace.<br/><br/>After AO Cangtian and the woman were resurrected, there was a hint of fear and anger on their faces.<br/><br/>“Husband, husband, I’ve been killed. I’ve been killed. Our children are gone too. The children that we nurtured with all sorts of resources are also dead!”<br/><br/>The woman was a little frightened and spoke to ao Cang Tian angrily. Her body trembled violently and her eyes were filled with hatred!<br/><br/>“That D * MN Guy, who is that D * MN Guy? How could he have such terrifying strength?”<br/><br/>Ao Cang Tian felt a little angry at this moment, but more than that, he was terrified.<br/><br/>His heavenly fate treasure had been directly taken away by the other party!<br/><br/>Heavenly Fate Treasure!<br/><br/>Furthermore, the other party’s strength was definitely at the primal chaos level.<br/><br/>Primal Chaos Level!<br/><br/>This was the first time he had seen an existence at this level.<br/><br/>In the past, he had only heard of it.<br/><br/>But now, they had actually provoked such a terrifying existence.<br/><br/>He was slightly trembling.<br/><br/>If the other party continued to charge over, then…<br/><br/>He didn’t dare to imagine.<br/><br/>“Madam, let’s go quickly. Let’s hide for a while. That fellow said that he wants to destroy our Cang Tian universe. It’s not safe here. We have to escape. If the child is gone, we can still continue to breed!”<br/><br/>Ao Cangtian’s expression changed drastically as he spoke to the woman!<br/><br/>“Over there!”<br/><br/>However, at this moment, Wang Xian, who had arrived on this planet, had already sensed the aura of AO Cangtian and the rest.<br/><br/>This planet was extremely huge, and it was also very strange and magnificent.<br/><br/>The entire planet was like a building of a planet. There were hollows in it.<br/><br/>This made the entire planet look exceptionally beautiful.<br/><br/>Wang Xian sensed the location of AO Cangtian and the woman. With a wave of his arm, he set up a demonic altar.<br/><br/>At the same time, he teleported to the side of AO Cangtian and the Woman!<br/><br/>The two of them, who were about to escape, immediately sensed a figure appearing not far away from them.<br/><br/>This made their hearts tighten, and their faces revealed a look of horror.<br/><br/>“Not good, run!”<br/><br/>Ao Cangtian saw Wang Xian’s figure, and a look of horror appeared on his face.<br/><br/>He did not hesitate at all and wanted to escape with the woman!<br/><br/>“Can you escape? Aren’t you guys very arrogant in the six paths universe?”<br/><br/>Wang Xian stared at them coldly. A terrifying frost appeared around them instantly.<br/><br/>The frost spread and froze everything.<br/><br/>At the same time, it also enveloped them.<br/><br/>The two of them were covered by the frost. They widened their eyes and wanted to break free.<br/><br/>However, the frost slowly covered their entire bodies and froze them!<br/><br/>Their vitality also disappeared rapidly!<br/><br/>Ao Cangtian, who had lost the ultimate treasure of the Heaven’s origin, was just an ordinary great dao level powerhouse.<br/><br/>However, compared to Wang Xian, the difference was too great.<br/><br/>He could not withstand any of Wang Xian’s attacks!<br/><br/>At this point, Ao Cangtian and the rest were killed by Wang Xian twice in a row.<br/><br/>“Roar Roar Roar!”<br/><br/>“Roar Roar!”<br/><br/>At this moment, in the sky above this planet, Mo Sha and the rest arrived.<br/><br/>Tianci and the undead followed them!<br/><br/>The auras of a total of 20 strong people from Wang Xian and the rest enveloped this planet, causing all the strong disciples on this planet to reveal astonished expressions.<br/><br/>“What’s going on? Why is there such a terrifying aura? What Happened?”<br/><br/>“Is it our friends from the Cangtian Sect?”<br/><br/>“Hiss, what a powerful aura. There are 20 such terrifying auras.”<br/><br/>“What are they trying to do? where is our ancestor?”<br/><br/>The planet was filled with the core experts and disciples of the ancestor.<br/><br/>When they sensed the aura of Mo sha and the others, their expressions changed drastically as they discussed in shock.<br/><br/>“Weng!”<br/><br/>“May I ask if you are friends of our ancestor? What’s the matter?”<br/><br/>Among them, an unknown heavenly yuan manifestation expert immediately flew into the sky.<br/><br/>Their gazes were solemn as they looked at Mo Sha and the rest who had suddenly appeared. There was a hint of vigilance in their eyes.<br/><br/>“Jie Jie Jie? US? We are here to exterminate you all.”<br/><br/>Mo Sha stared at the heavenly yuan manifestation expert and spoke in a dense voice!\t\t\t\t\t\t</div>", "images": {}, "success": true}