{"id": 1389, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075286.html", "title": "Chapter 4392 - Chapter 4392: 4391 Planned The Starry Universe And The Belief Universe", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4392 - Chapter 4392: 4391 Planned The Starry Universe And The Belief Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4392: 4391 planned the starry universe and the belief universe<br/><br/>The current Dragon Palace was already very powerful.<br/><br/>A dragon palace was comparable to a top-tier universe.<br/><br/>Wang Xian was still not satisfied with having such a powerful ability.<br/><br/>Since he could improve his strength quickly, why not continue to improve?<br/><br/>“First, I have to completely conquer the starry universe. Currently, there is only one great dao level starry beast and two control level existences in the starry universe. With the strength of the Dragon Palace, it can completely destroy these three starry beasts. After that, the Dragon Palace will obtain a large amount of resources.”<br/><br/>“After completely conquering the starry universe, we can consider attacking the belief universe, the belief universe, the nine-origin universe, and the Dragon Palace. We can destroy them.”<br/><br/>“There is a huge benefit to destroying the belief universe, and that is the belief heart of those who believe in the universe. For those who believe in the Dragon Palace, there is a huge benefit that can help those who are in the Dragon Palace’s heaven-origin creation realm to improve quickly.”<br/><br/>Wang Xian mumbled to himself as he planned for the future situation of the Dragon Palace!<br/><br/>With a thought, he sensed Lan Qingyue’s location and teleported to his side.<br/><br/>At this moment, the transformation of the Dragon Palace had just been completed after a few decades.<br/><br/>The group of girls had also transformed a very beautiful residence.<br/><br/>Wang Xian teleported to their side and looked at Lan Qingyue. “Qingyue, how much longer do you need before you can make a breakthrough?”<br/><br/>“Eh? Xiao Xian!”<br/><br/>Lan Qingyue looked at him and smiled. “I don’t know how much longer I need. However, I should be able to reach the threshold of a breakthrough within 100 million years!”<br/><br/>“Alright, then you should cultivate in the space of the primal chaos stone. First, raise your strength to the blessed realm of the Heaven’s origin realm. As for Shu Qing and the rest of you, cultivate well and strive to reach the blessed realm of the Heaven’s origin realm as soon as possible!”<br/><br/>Wang Xian said to them with a smile on his face.<br/><br/>“MMM!”<br/><br/>The group of girls nodded with smiles on their faces.<br/><br/>Now that the Dragon Palace was getting stronger, they were naturally happier as well!<br/><br/>After leading the group of girls for a few months, Wang Xian came to the Dragon King Palace once again.<br/><br/>“Prime Minister Gui, call Mo Sha and the rest of the Tianyuan blessed realm disciples over!”<br/><br/>Wang Xian instructed Prime Minister Gui.<br/><br/>Next, they had to conquer the starry universe first!<br/><br/>Although many of the resources in the starry universe were taken away by the nine-origin universe and the belief universe.<br/><br/>However, there were still a large number of resources in the infinite starry space at the center of the starry universe.<br/><br/>In addition, the corpses of the space beasts were the best resources.<br/><br/>“Dragon King!”<br/><br/>Not long after, the experts from the Dragon Palace flew over and greeted him respectfully!<br/><br/>As his gaze swept across them, a smile appeared on Wang Xian’s face!<br/><br/>There were a total of twelve experts in the Tianyuan blessed realm.<br/><br/>As for Xiao Lan Hundun and the other three, they were in the starry universe.<br/><br/>Although most of them had just entered the Tianyuan blessed realm, when they joined forces, they were comparable to an existence at the Great Dao level.<br/><br/>Furthermore, this was not even counting Mo sha and the rest.<br/><br/>Including Mo Sha and the rest, there were more than three existences at the Great Dao level.<br/><br/>“Make some preparations. This time, we will go to the starry universe and finish it off completely!”<br/><br/>Wang Xian looked at them and said!<br/><br/>“It’s the Dragon King!”<br/><br/>Mo Sha and the rest nodded.<br/><br/>“Gather here in an hour.”<br/><br/>Wang Xian nodded at them.<br/><br/>“Yes!”<br/><br/>The group of experts from the Dragon Palace replied and went to prepare immediately.<br/><br/>One hour later, they arrived at the territory where Hun Dun and the rest were under the teleportation of an lie!<br/><br/>“Greetings, Dragon King!”<br/><br/>Hun Dun Xiao Lan and the rest sensed Wang Xian’s arrival and flew over immediately. They greeted him respectfully!<br/><br/>“Hun Dun, I’ve sent you the news. How’s the investigation going?”<br/><br/>Wang Xian looked at Hundun and asked.<br/><br/>“Dragon King, the location of the three space beasts has been locked down. We can take action at any time.”<br/><br/>Hundun nodded. “Among them, the Great Dao Level Beast King is located at the center. Once the battle breaks out, the other two control level beast kings will come over to help. Dragon King, with our strength, we can totally deal with three at the same time and destroy them.”<br/><br/>“Yes, that’s fine.”<br/><br/>Wang Xian nodded, he looked at them and said, “Hun Dun, Little Blue, Little White House, the four of you, along with bei Shuang and five other experts, will be responsible for killing one. Mo Sha, lead the rest of the experts and kill one. Leave the Great Dao Beast to me!”<br/><br/>“It’s the Dragon King!”<br/><br/>Mo Sha and the rest replied immediately!<br/><br/>“Alright, we will rush over immediately. In order to prevent any accidents, we will take action at the same time!”<br/><br/>Wang Xian nodded his head.<br/><br/>“Dragon King, the locations of the three Beast Kings have been sent to everyone.”<br/><br/>Hun Dun spoke at this moment!<br/><br/>Wang Xian and the rest took out their communication devices and looked at the information on them. They nodded their heads.<br/><br/>“Alright, let’s do it. Be careful and don’t let these Beast Kings Kill You!”<br/><br/>Wang Xian reminded him and flew towards the center of the starry universe.<br/><br/>The center of the starry universe was an infinite starry space. The location where Hun Dun and the rest were located was also an infinite starry space.<br/><br/>However, there was still a distance between them and the center.<br/><br/>The closer they were to the center, the more they could feel the power of this universe.<br/><br/>The aura of desolation filled the void.<br/><br/>In the void, there were all kinds of huge planets, meteorites, and very special mountains!<br/><br/>Occasionally, he could see some space beasts flying.<br/><br/>These space beasts were of the same race as the space beasts created by the Heaven’s origin.<br/><br/>More than ten days later, Wang Xian arrived at the center.<br/><br/>There, there was an incomparably huge ocean. The ocean floated in the void and looked very magnificent from afar.<br/><br/>In the ocean, Wang Xian could sense the aura of a cosmic beast of the Great Dao level.<br/><br/>Wang Xian took out the divination lamp and carefully divined the strength of this cosmic beast.<br/><br/>“It can be comparable to a great dao level, a control level, and a beginner level. It’s much stronger than the injured cosmic beast that I killed last time.”<br/><br/>Wang Xian thought to himself.<br/><br/>When they killed the injured heaven-devouring Earth Beast Emperor last time, the strength that Wang Xian and the rest used was comparable to four great dao levels.<br/><br/>However, although this beast emperor was stronger than the heaven-devouring Earth Beast Emperor Now, it was still stronger than the heaven-devouring Earth Beast Emperor.<br/><br/>However, Wang Xian’s own strength was also terrifying enough.<br/><br/>With a move of his palm, an ultimate treasure of Tianyuan, the void disk, floated in the air.<br/><br/>The Five Elements Millstone, the Tai Chi Dragon Disk, the Divine Sword of Light, and the Void Dragon Pool surrounded him.<br/><br/>At the spot between Wang Xian’s eyebrows, there was a golden pupil.<br/><br/>This was also a heavenly fate ultimate treasure. Wang Xian called it the heavenly origin golden pupil!<br/><br/>This treasure was obtained from Ao Cangtian and had been completely refined by him!<br/><br/>“My current strength is comparable to a primal chaos level, a great dao level, two control levels, and a beginner level.”<br/><br/>Wang Xian sensed his strength and smiled.<br/><br/>He waited quietly for the news from the Demonic Chaos!\t\t\t\t\t\t</div>", "images": {}, "success": true}