{"id": 1383, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075258.html", "title": "Chapter 4386 - Chapter 4386: 4385 Took Over The Cang Heaven Universe", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4386 - Chapter 4386: 4385 Took Over The Cang Heaven Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4386: 4385 took over the Cang Heaven Universe<br/><br/>“What? They are here to invade our Cang Heaven Universe?”<br/><br/>“Hiss? What on Earth happened? Why did they invade our Cang Heaven Universe? Where is our Cang Heaven Sect’s ancestor?”<br/><br/>“Not good, their strength is very terrifying. Only when the Cang Heaven Sect’s ancestor and the others arrive will they be able to resist.”<br/><br/>On the planet at the center of the Cang Heaven Universe at this moment.<br/><br/>When all the expert disciples heard Mo Sha’s words, their faces revealed expressions of shock and anger.<br/><br/>“Boom Boom!”<br/><br/>However, in the next moment, an extremely terrifying energy enveloped the entire planet. All the expert disciples were completely covered by this terrifying energy!<br/><br/>All the expert disciples instantly felt as if they were trapped in a cage, unable to move at all.<br/><br/>“Why did you want to invade our Cang Heaven Universe? Our sect ancestor and the rest know, they won’t let you off.”<br/><br/>The unwitting Tian Yuan creation realm expert felt the terrifying energy around him, and his face was filled with fear as he roared out!<br/><br/>“Hehe, your Cang Heaven sect ancestor? Your Cang Heaven sect ancestor has already been destroyed, now it’s Your Turn!”<br/><br/>“Kill them all, leave no one alive!”<br/><br/>Mo Sha’s face revealed a sinister expression. With a loud roar, he locked onto the heavenly yuan manifestation realm expert and directly charged over.<br/><br/>In the sky, streams of energy descended towards this planet. The terrifying energy caused the disciples of the experts in this universe to instantly die!<br/><br/>“If you want to blame someone, then blame your Cang Heaven Sect’s ancestor himself. He invaded our six paths universe and even wanted to seize our universe’s Supreme Treasure. Those who kill will be killed!”<br/><br/>It was the first time the spirits of the dead from the six paths universe had witnessed such a great battle that spanned across the universe. Their eyes were sparkling as they spoke!<br/><br/>The killer, Ren Heng shall be killed!<br/><br/>If they had not invaded their six paths universe and did not want to snatch the Supreme Treasure of the Heaven’s origin creation, how would they have encountered such a disaster?<br/><br/>“It’s over. The foster father of the owner of the Supreme Treasure of the Heaven’s origin creation in our six paths universe is too terrifying. Furthermore, his influence is also very terrifying. Our Cangtian sect is finished. Even the entire Cangtian universe is finished!”<br/><br/>On the planet, there was a strong cultivator in the heaven creation stage who was killed by Wang Xian not long ago. He had just been resurrected. Now that he saw so many strong cultivators in the heaven creation stage, a look of despair appeared on his face.<br/><br/>The Cang Heaven sect was finished.<br/><br/>Even the Cang Heaven Universe was finished!<br/><br/>“An lie, bring the disciples of the Dragon Palace over. Prepare to conquer this universe completely!”<br/><br/>Wang Xian looked at the planet below and spoke with a calm face!<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded his head and his figure disappeared instantly!<br/><br/>“No, no, no. If you dare to kill us, our sect leader will not let you off!”<br/><br/>At this moment, the screams from below continued to ring out.<br/><br/>They did not believe Mo Sha’s words. They did not believe that their invincible sect leader would be killed.<br/><br/>He roared with a face full of shock and anger.<br/><br/>Wang Xian’s expression was calm. With his soul-absorbing power, he checked the information in the minds of more than ten peak-stage rulers. This allowed him to have a detailed understanding of the Cang Heaven Universe!<br/><br/>In the Cang Heaven Universe, the Cang Heaven sect was the strongest force.<br/><br/>Just like the name of the universe, it was named after the Cang Heaven.<br/><br/>However, there were four other forces in the Cang Heaven Universe. These three forces also had powerhouses in the Heavenly Yuan blessed realm.<br/><br/>However, these three forces were much weaker than the Cang Heaven sect.<br/><br/>In the entire Cang Heaven Universe, the Cang Heaven sect took up 70% of the resources.<br/><br/>The rest were taken up by the other three forces and some small families.<br/><br/>Now that the Dragon Palace had invaded the Cang Heaven universe, they killed all the forces regardless of how many forces there were in the Cang Heaven Universe.<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>At this moment, the Army of the Dragon Palace arrived.<br/><br/>“Mo Sha, lead the operation to conquer the Cang Heaven universe this time. I will go and Hunt ao Cang Heaven and the rest.”<br/><br/>Wang Xian gave Mo sha an order. Then, he looked at tianci and said, “Tianci, you guys can follow and take a look.”<br/><br/>“It’s the Dragon King!”<br/><br/>“Yes, Foster Father!”<br/><br/>Mo Sha and the rest replied immediately.<br/><br/>Wang Xian nodded and took out the divination lamp to divine the location of Ao Cangtian.<br/><br/>At the same time, he also divined the location of the woman.<br/><br/>Soon, Wang Xian received the information and flew over immediately.<br/><br/>“Their strength is still at the Great Dao level. It seems that they have many powerful resurrection treasures.”<br/><br/>Wang Xian thought to himself.<br/><br/>He rushed to a location through the teleportation formation on this planet.<br/><br/>Ao Cangtian and that woman were resurrected at the core of another treasure land in the Cang Heaven Universe.<br/><br/>Although this treasure land was very famous in the Cang Heaven Universe, the entire treasure land was like a huge maze.<br/><br/>At the core, only ao Cangtian and the rest could enter.<br/><br/>At the same time, it was located in the interior of this treasure land.<br/><br/>Ao Cangtian and the woman were resurrected again.<br/><br/>There was a trace of fear on their faces.<br/><br/>This time, they were completely terrified.<br/><br/>They were completely terrified.<br/><br/>The other party had already charged over.<br/><br/>And with the other party’s strength, they were completely unable to resist.<br/><br/>“Husband, what should we do now? What should we do now? The other party’s strength is too terrifying, he might chase after us again.”<br/><br/>The woman said to Ao Cang Tian with an extremely pale face.<br/><br/>“Let’s go. Let’s leave the Cang Heaven Universe first. This place is no longer safe.”<br/><br/>Ao Cang Tian’s expression changed drastically as he decided.<br/><br/>He was an existence at the Great Dao level. His own strength was already extremely terrifying.<br/><br/>However, their enemy was at the primal chaos level. How terrifying was that?<br/><br/>No matter what, he was sure that the universe was no longer safe.<br/><br/>They wanted to escape.<br/><br/>“Alright, Alright. I will listen to you, husband.”<br/><br/>The woman nodded her head quickly.<br/><br/>Without any hesitation, they fled outside.<br/><br/>Wang Xian used the divination lamp to check their location from time to time.<br/><br/>When he saw that their location had changed and they were flying towards the north of the universe, his eyes flickered slightly.<br/><br/>“Are they preparing to escape from the Cang Heaven Universe? Hehe!”<br/><br/>Wang Xian chuckled and chased after them quickly.<br/><br/>Now, his speed was extremely terrifying.<br/><br/>When he unleashed his full strength, he was several times faster than before.<br/><br/>Originally, it would take thousands of years for Wang Xian to fly from the east to the West in a universe.<br/><br/>However, now, Wang Xian could fly from one side of a universe to the other side in more than two hundred years.<br/><br/>His speed was so terrifying that it was not something that the Great Dao could compare to.<br/><br/>Ao Cangtian led his wife and fled desperately. However, fifty years later, before they could fly out of the universe.<br/><br/>Wang Xian’s figure appeared behind them.<br/><br/>Sensing the two figures in front of him, Wang Xian’s eyes revealed a mocking expression.<br/><br/>“Your speed is too slow, so die.”<br/><br/>Wang Xian flew over and his voice entered their ears.<br/><br/>At this moment, Ao Cangtian and the rest did not sense Wang Xian’s existence at all.<br/><br/>When they heard this voice, their bodies trembled violently.\t\t\t\t\t\t</div>", "images": {}, "success": true}