{"id": 1396, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075321.html", "title": "Chapter 4399 - Chapter 4399: 4398 Choices", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4399 - Chapter 4399: 4398 Choices</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4399: 4398 choices<br/><br/>Wang Xian did not know the exact situation in the bamboo house.<br/><br/>He stayed outside for some time. Not long after, the king of Void and the rest walked out.<br/><br/>When Wang Xian saw their figures, his gaze froze slightly.<br/><br/>He could sense that there was an additional inexplicable energy in the bodies of the king of Void and the rest.<br/><br/>Wang Xian took out the divination lamp and performed a divination.<br/><br/>“As expected, it’s the doing of an expert who divines the universe.”<br/><br/>Wang Xian thought to himself. His eyes flickered slightly.<br/><br/>Buzz<br/><br/>At this moment, an Lie’s figure appeared beside Wang Xian.<br/><br/>“Dragon King, we have found the fallen Shadow Demon Emperor.”<br/><br/>An lie looked at Wang Xian, “The fallen Shadow Demon Emperor said that he knows a prophet who divines the universe. His name is none. None is one of the three great prophets of divination. The other two prophets are Hong and FA respectively.”<br/><br/>“They can predict the universe. None prophet and Hong are always here in the land of origin. They open their doors to do business. Any powerhouse can look for them to perform divination. Based on the situation of divination, they can charge a fee for divination. The universe of divination is a relatively neutral universe. They are powerful and do not participate in the disputes of other universes.”<br/><br/>“Of course, no other universes would dare to provoke them. The powerhouses of the universe of divination are stronger than their peers because they can predict the future.”<br/><br/>An lie introduced them to Wang Xian one by one.<br/><br/>“A neutral universe?”<br/><br/>When Wang Xian heard this, he smiled coldly and said, “Since ao Cang Tian and the rest are looking for their help, I really don’t believe that they don’t know the specific reason with their divination abilities. They know that helping them would offend me. This is not a neutral universe, but they want to get involved!”<br/><br/>As he spoke, he narrowed his eyes slightly.<br/><br/>He looked to the side. The king of Void and the rest had already left.<br/><br/>Wang Xian did not continue to follow them.<br/><br/>He waited on the spot for an hour before he moved and flew into the bamboo forest in front of him.<br/><br/>Through his energy sensing, he could sense the old man and a young man in the bamboo forest.<br/><br/>His figure moved and in the next moment, he appeared in the courtyard!<br/><br/>In the courtyard, the young man was holding the heart of faith with an excited look on his face.<br/><br/>“Grandpa, with this heart of faith, I have the confidence to raise my strength by a small realm within 100 million years!”<br/><br/>“Hehe, then focus on your cultivation… HMM?”<br/><br/>In the courtyard, prophet Hong was talking with his grandson.<br/><br/>However, as soon as he finished his sentence, his gaze suddenly focused. He immediately looked at Wang Xian who had suddenly appeared at the side.<br/><br/>He sat up straight from the bench and stared at Wang Xian with a grave expression.<br/><br/>“Friend, who are you?”<br/><br/>He stared at Wang Xian and stood in front of his grandson. He stared at Wang Xian vigilantly.<br/><br/>He only sensed it when Wang Xian instantly appeared beside him.<br/><br/>His strength was terrifying to prophet Hong.<br/><br/>If the other party wanted to ambush him, he would have already been injured!<br/><br/>“Prophet Hong, right? Hello, I heard that divination can predict the past and future of the universe. I have something to ask you.”<br/><br/>Wang Xian looked at prophet Hong and asked calmly.<br/><br/>“Oh?”<br/><br/>Prophet Hong stared at Wang Xian with a twinkle in his eyes. He was unsure of Wang Xian’s identity. “May I know what this friend would like to ask?”<br/><br/>Beside him, the young man was also sizing up Wang Xian in astonishment.<br/><br/>“I have a treasure called the divination lamp. It can also be used for divination. However, recently, the divination for some people has failed. I would like to ask how to make him recover!”<br/><br/>Wang Xian moved his palm and the divination lamp appeared in his palm.<br/><br/>He stared at Prophet Hong expressionlessly.<br/><br/>“You are? ?”<br/><br/>When prophet Hong heard Wang Xian’s words and saw the divination lamp in his hand, his pupils constricted slightly. He had a bad premonition in his heart.<br/><br/>He could not help but take a step back.<br/><br/>“Prophet Hong knows about me? Hehe.”<br/><br/>Wang Xian looked at him and his gaze focused. A Heaven’s origin golden pupil on his glabella opened slowly, a wave of energy enveloped prophet Hong and the rest. “Since you have recognized me, how do you propose to solve this? I will kill all of you and then Slaughter Your Universe of Prophets?”<br/><br/>As he spoke, his eyes were filled with killing intent.<br/><br/>He had indeed used his killing intent on this prophet Hong.<br/><br/>The other party was trying to make an enemy out of them!<br/><br/>“You… You’re that Dragon King? My grandfather is just doing normal business.”<br/><br/>The youth at the side felt that he had been completely locked onto. His face also revealed a terrified expression as he hurriedly opened his mouth to speak!<br/><br/>“Phew!”<br/><br/>Prophet Hong took a deep breath and quickly stopped his grandson from speaking. He shook his head and said, “This is karma. Dragon King, I have no intention to interfere in the grudges between the two of you. I owe ao Cangtian a favor and have no choice but to return it.”<br/><br/>“Hehe, since you are involved, you must be involved. Now, give me a solution.”<br/><br/>Wang Xian stared at him coldly and said.<br/><br/>“Dragon King, what do you want me to do?”<br/><br/>Prophet Hong looked at him and asked in a deep voice.<br/><br/>“It’s very simple. Help me destroy the king of Void and the Proud Heaven. In that case, we will write off all our debts. Are you going to do this business?”<br/><br/>Wang Xian looked at him and asked coldly.<br/><br/>“Give me one minute to think about it!”<br/><br/>When prophet Hong heard this, his expression changed drastically as he said.<br/><br/>“Sure.”<br/><br/>Wang Xian nodded his head.<br/><br/>Buzz<br/><br/>Prophet Hong’s face darkened. He took a deep look at Wang Xian and took out a divination compass.<br/><br/>“PFFT!”<br/><br/>The next moment, he spat out a large amount of blood onto the divination compass and proceeded with his divination.<br/><br/>As he was divining, the blood in his mouth flowed out continuously. It looked extremely tragic!<br/><br/>“Huh?”<br/><br/>Wang Xian stood there and suddenly felt something.<br/><br/>He could feel that Prophet Hong was divining his own strength.<br/><br/>“Interesting. I’m standing beside you, but you are divining my strength. It seems like you want to see if I can fight against you?”<br/><br/>Wang Xian looked at him and said with a faint smile.<br/><br/>“Dragon King, you are very strong. I Can’t predict your strength!”<br/><br/>Prophet Hong stared at the divination compass quietly. His face was extremely pale.<br/><br/>When he heard Wang Xian’s words, he raised his head and said miserably.<br/><br/>Yes, he still couldn’t divine it.<br/><br/>He knew what this meant. It meant that the Dragon King in front of him was stronger than he had imagined.<br/><br/>At least, it wasn’t as simple as an ordinary chaos level.<br/><br/>“One minute is almost up.”<br/><br/>Wang Xian looked at him and said quietly, “Make Your Choice!”<br/><br/>“My personal actions have nothing to do with divining the universe. What do you want me to do, Dragon King?”<br/><br/>Prophet Hong wiped the blood from the corner of his mouth and asked helplessly.<br/><br/>“Tell ao Cangtian and the rest to call me. I know you can do it.”<br/><br/>Wang Xian stared at Prophet Hong and instructed.<br/><br/>“Alright!”<br/><br/>Prophet Hong nodded. He took out his communication stone plate and sent a message.<br/><br/>Then, he looked at his grandson behind him and sighed helplessly.<br/><br/>“Xiao Yu, remember, the first thing a fortune-teller should do is to seek luck and avoid danger. You must not get involved in a powerful dispute. Otherwise, the fortune-teller will be the first to die.”<br/><br/>He instructed his grandson.\t\t\t\t\t\t</div>", "images": {}, "success": true}