{"id": 1391, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075296.html", "title": "Chapter 4394 - Chapter 4394: 4393 Attacked And Conquered The Starry Universe", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4394 - Chapter 4394: 4393 Attacked And Conquered The Starry Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4394: 4393 attacked and conquered the starry universe<br/><br/>He hunted and killed the cosmic beasts of the Great Dao level.<br/><br/>This battle was very easy for Wang Xian.<br/><br/>After killing them easily, Wang Xian took a look at the surrounding areas and kept all the valuable treasures.<br/><br/>Following that, he flew toward Mo sha and the rest.<br/><br/>“Dragon King!”<br/><br/>When Wang Xian rushed over, Mo Sha and the rest had also finished their battle.<br/><br/>After all, the Dragon Palace had used all their strength to kill the three space beasts. It was still very easy.<br/><br/>“Dragon King, there are now three more spots for the Heavenly Yuan blessed realm in the starry universe. I reckon that it won’t be long before the space beasts have a breakthrough.”<br/><br/>The group gathered at Hun Dun’s lair again and Hun Dun spoke.<br/><br/>“If there are Space Beasts that have a breakthrough, kill them immediately. Hun Dun, are there any of your subordinates who are about to make a breakthrough?”<br/><br/>Wang Xian asked Hundun.<br/><br/>“Not at the moment, Dragon King. Currently, there are only two at the peak of the ruler realm among my subordinates. It will take a long time for them to make a breakthrough.”<br/><br/>Hundun replied.<br/><br/>When Hundun and his group of Space Beasts came from the nine-origin universe, each of them led a group of subordinates.<br/><br/>Naturally, Hun Dun had more than 1,000 subordinates.<br/><br/>However, out of these 1,000 subordinates, only two had reached the peak of the Overlord realm.<br/><br/>“For this harvest, I’ll give you and Xiao Lan the corpse of the Sea Emperor Beast. Use this corpse to cultivate and see if you can increase your strength. As for the other two control-level corpses, one will be used to cultivate disciples while the other will be taken away by me.”<br/><br/>Wang Xian spoke to Hun Dun and the rest.<br/><br/>“Thank you, Dragon King! Thank you, Dragon King!”<br/><br/>When Hun Dun heard that, he thanked him excitedly.<br/><br/>His eyes were filled with excitement.<br/><br/>The corpse of a great dao-level space beast was used by them to increase his strength?<br/><br/>This was something that Hun Dun didn’t dare to imagine before.<br/><br/>Now, he was very fortunate to be able to join the Dragon Palace.<br/><br/>Otherwise, if he were to rely on himself, he would not even dare to think about obtaining such resources.<br/><br/>They had just entered the level of the starry universe, and it would be extremely beneficial for them to cultivate with the corpse of a Great Dao level starry beast.<br/><br/>Little Blue and the others also thanked him.<br/><br/>However, Little Blue’s small house was different from little white and Hun Dun. In their eyes, Lan Qingyue was their mother.<br/><br/>The Dragon King was also a father-like existence.<br/><br/>Moreover, they were born for their mother.<br/><br/>They were not too excited after receiving so many resources.<br/><br/>However, they were still very happy to be able to improve their abilities.<br/><br/>“Currently, the resources for the Dragon Palace to train their disciples are sufficient. Next, we need to consider improving your abilities.”<br/><br/>Wang Xian spoke indifferently as he swept his gaze across bei Shuang and the rest.<br/><br/>“It’s too difficult for a powerhouse in the Heaven’s origin realm to increase his strength.”<br/><br/>Bei Shuang couldn’t help but comment.<br/><br/>If one were to talk about the ruler realm, it would take hundreds of millions of years to increase one level.<br/><br/>However, when one was in the Heaven’s origin realm, it might not be able to increase one level even after billions of years.<br/><br/>In the nine-origin universe, for example, the Emperor of angels had been popular for 50 to 60 billion years. Now, he had not even reached the control level.<br/><br/>Just take Wang Xian’s void dragon body for example. How many resources had he used to advance to the control level?<br/><br/>The corpses of the spatial-attributed powerhouses in the heaven origin blessed realm were non-stop.<br/><br/>Furthermore, they were all at the control level.<br/><br/>Even when he broke through to the control level this time, it was also in the space of the primal chaos stone along with the corpse of the king of Void.<br/><br/>Although the corpse of the king of Void had not been completely consumed up until now, who would be able to take out such a huge amount of resources?<br/><br/>With the corpse of an expert at the Great Dao level to cultivate, who else would be able to do it?<br/><br/>Almost none.<br/><br/>Under such circumstances, Wang Xian’s body of the Void Divine Dragon could reach the control level. One could imagine how difficult it was to achieve a breakthrough.<br/><br/>“There is a way to increase your strength quickly.”<br/><br/>Wang Xian looked at them and said.<br/><br/>“HMM?”<br/><br/>Mo Sha heard him and his gaze froze. “Dragon King, are you talking about the belief universe?”<br/><br/>“Yes.”<br/><br/>Wang Xian nodded. “There are many disputes between us and the belief universe. Be it here in the starry universe or heaven-sent matters, the belief universe is an enemy.”<br/><br/>As he spoke, he narrowed his eyes slightly.<br/><br/>The heart of belief in the belief universe was a treasure for any powerhouse to cultivate.<br/><br/>Their heart of belief was not a real heart.<br/><br/>Instead, it was the source of belief that they condensed through the power of belief.<br/><br/>It could be said that the heart of belief was their source of energy.<br/><br/>And the power of belief could affect a person’s mind.<br/><br/>But if it could be absorbed, it could make a person’s mind clear. It was extremely beneficial for cultivation and breakthrough.<br/><br/>The cultivation of a heavenly yuan creation realm expert required not only a huge amount of resources, but also a type of comprehension.<br/><br/>The heart of faith could greatly increase a powerhouse’s comprehension ability.<br/><br/>It wasn’t an exaggeration to say that.<br/><br/>The value of a control level heart of faith was several times higher than other control level corpses.<br/><br/>The Heart of faith at the heavenly creation level was even more unimaginable for a master at the peak of the mastery level!<br/><br/>For a master at the peak of the mastery level to obtain a beginner-level heart of faith at the heavenly creation level, the success rate of his breakthrough could reach 30% .<br/><br/>30% was a very high probability.<br/><br/>“Dragon King, the belief universe now occupies two universes and has existences at the Great Dao level. Their overall strength is much stronger than the Cang Heaven Universe. However, with our strength, we still have the confidence to destroy them.”<br/><br/>“I think we can take the long view and destroy the belief universe as well. In that case, our Dragon Palace will be able to obtain a huge improvement.”<br/><br/>Mo Sha’s eyes sparkled as he spoke!<br/><br/>“Yes!”<br/><br/>Wang Xian nodded his head and squinted his eyes. “Mo Sha, I’ll give you a task. In the following time, go and investigate the specific situation of the belief universe and the specific strength.”<br/><br/>“Yes, Dragon King. Leave this to me!”<br/><br/>Mo sha nodded his head heavily.<br/><br/>“Alright. Mo Sha, go and scout for news. Bei Shuang, return to the space of the primal Chaos Stone in the Dragon Palace and cultivate properly.”<br/><br/>Wang Xian continued to give orders. “During the calamity, work hard and cultivate for the time being. When the calamity is over, you can have a good rest.”<br/><br/>“Yes, Dragon King!”<br/><br/>Bei Shuang and the rest of the experts replied immediately.<br/><br/>Currently, the Dragon Palace had sufficient resources to open up the space of the primal chaos stones for the cultivation of the Dragon Palace’s powerhouses.<br/><br/>By cultivating in there, the disciples of the Dragon Palace were improving at a rapid rate.<br/><br/>Currently, the number of disciples at the peak of the Dragon Palace’s overlord realm had already reached 150.<br/><br/>Furthermore, this number was continuously increasing.<br/><br/>“The next step will depend on the belief universe. If we can really destroy the belief universe, the improvement of the Dragon Palace will be truly terrifying!”<br/><br/>Wang Xian thought to himself.\t\t\t\t\t\t</div>", "images": {}, "success": true}