{"id": 1392, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075301.html", "title": "Chapter 4395 - Chapter 4395: 4394 Worshiping The King Of All Gods In The Universe!", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4395 - Chapter 4395: 4394 Worshiping The King Of All Gods In The Universe!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4395: 4394 worshiping the king of all gods in the universe!<br/><br/>After conquering the starry universe, Wang Xian and the rest returned to the Dragon Palace.<br/><br/>Wang Xian and the rest did not take away many of the resources in the starry universe.<br/><br/>Instead, they asked Hun Dun Xiao Lan and the rest to do so.<br/><br/>Regarding the starry universe, in Wang Xian’s plan, he did not plan to simply conquer it and kill its space behemoths.<br/><br/>Instead, he wanted to completely occupy it.<br/><br/>However, this occupation would require a very long time.<br/><br/>He needed the dragon palace to have more powerhouses of the Heaven’s origin manifestation there.<br/><br/>He also needed to kill the local space beasts in the starry universe.<br/><br/>Currently, there were still some space beasts that left the starry universe to hunt and eat in the boundless chaos.<br/><br/>When these space beasts returned, Wang Xian would also kill them.<br/><br/>What he needed now was to nurture more disciples who could achieve a breakthrough in the starry universe.<br/><br/>This would take a long time.<br/><br/>Once he occupied the starry universe, the Dragon Palace would be able to have 15 more powerhouses who were blessed by the Heaven’s origin.<br/><br/>The powerful disciples of the Dragon Palace were cultivating rapidly.<br/><br/>Meanwhile, Mo Sha was also rushing towards the belief universe to search for information about the belief universe.<br/><br/>However, while Mo Sha was searching for information about the belief universe,.<br/><br/>The experts in the belief universe had also searched for information about the Dragon Palace.<br/><br/>Especially after the four control-level experts in the belief universe received the information that the firmament universe had been conquered.<br/><br/>This made the four experts in the belief universe nervous.<br/><br/>According to their investigation over tens of thousands of years, they had a detailed understanding of the Dragon Palace Dragon King!<br/><br/>“I really didn’t expect that the Dragon Palace Dragon King and the others came from the nine-origin universe. When we were in the starry universe, we even fought with the nine-origin Universe!”<br/><br/>“The speed of the Dragon Palace Dragon King’s rise is simply unbelievable. A billion years ago, according to the information we found, the Dragon Palace Dragon King hadn’t reached the Heavenly Yuan creation realm yet. How could he reach the primal chaos realm so quickly?”<br/><br/>“The Cang Heaven Universe has been completely conquered. Ao Cang Heaven has disappeared without a trace. More than half of the powerhouses in the entire universe have been killed. That Dragon King’s strength is too terrifying!”<br/><br/>“Not only that, the Void Universe has also been destroyed by the nine-origin universe. Damn it, could the Dragon Palace Dragon King have set his target on us? After all, we have had many conflicts with the Dragon Palace and the nine-origin Universe!”<br/><br/>In a palace located in the belief universe’s primal universe, four control-level powerhouses sat inside and spoke with gloomy expressions.<br/><br/>Ever since they were in the six paths universe, when they saw the Dragon King Kill Ao Cangtian in one move, they had been terrified ever since they escaped!<br/><br/>The Dragon Palace’s Dragon King’s strength was too terrifying!<br/><br/>It was so terrifying that they couldn’t sleep while playing the game.<br/><br/>Especially after the Cang Heaven Universe was conquered.<br/><br/>They were worried that the Dragon King would come to the belief universe.<br/><br/>If he really came, how could they defend against him?<br/><br/>“If the Dragon King of the Dragon Palace really came, we wouldn’t be able to defend against him with our strength unless all the experts of the belief universe came together to defend!”<br/><br/>One of the experts looked at the three people beside him and said in a deep voice.<br/><br/>“Primal chaos-level existences. If all of us join hands, it’s only possible for us to resist him.”<br/><br/>An old man in the middle said solemnly.<br/><br/>“No, it shouldn’t be a problem for us to resist him. I heard that the Divine One Palace conquered a not weak universe not long ago. The divine one palace is about to give birth to a second great dao-level existence.”<br/><br/>The middle-aged expert on the right said.<br/><br/>“What? The One God Palace is about to give birth to a second great dao existence? The king of all gods, Senior One god, didn’t increase his own strength?”<br/><br/>His words slightly shocked the other three as they asked in shock.<br/><br/>“I heard that without increasing his own strength, it would be difficult for senior one God’s strength to increase rapidly. Therefore, the one God Palace has chosen to give birth to a second great dao existence. Currently, the one God Palace has occupied a cosmos. Next, it will give birth to a few kings of all gods.”<br/><br/>The middle-aged man on the right shook his head and gave an explosive piece of information.<br/><br/>The strength of the belief universe was stronger than what outsiders had imagined.<br/><br/>The belief universe had 24 palaces.<br/><br/>Each palace had an existence of a supreme god.<br/><br/>That was the king of Pantheon, the Heavenly Yuan creation!<br/><br/>These were the 24 heavenly yuan creation level experts.<br/><br/>Of course, most of the Heavenly Yuan creation level experts were at the beginner level.<br/><br/>There were only seven in the mastery level, and there was only one in the Great Dao level before!<br/><br/>Now, another one had been born in the divine one palace.<br/><br/>The Divine One Palace was the most powerful existence in the 24 palaces. The Divine One Palace had played a huge role in occupying the second belief universe.<br/><br/>And now, the Divine One Palace had occupied another universe.<br/><br/>They all knew that occupying a universe would increase the number of believers. This would be a terrifying increase in strength.<br/><br/>“Should we tell the powerhouses of the other palaces about what happened to us and the Dragon Palace? If the Dragon King really comes, we’ll have to be prepared.”<br/><br/>An old man said.<br/><br/>“Tell the powerhouses of the other palaces that if they know that we’ve provoked a chaos-level existence, they won’t help us. Now we’ll see if the Dragon King is arrogant enough to want to deal with our entire belief universe.”<br/><br/>“If he wants to deal with our entire belief universe, then the experts of the other palaces will also fight with us and will not give up on us.”<br/><br/>“But at that time, we will have to pay a price!”<br/><br/>The old man in the middle replied.<br/><br/>“Everything is hard to say. There is still a possibility that they will hand us over to that Dragon King. There is also a possibility that they will ignore us.”<br/><br/>The middle-aged man on the right shook his head. “Don’t expect too much. However, we have to tell our good friends about this first. If the Dragon King really wants to deal with us, as long as we have the support of the experts from the other palaces, we can persuade all the kings of the gods.”<br/><br/>“Of course, there’s another point. We’ve had a conflict with the nine-origin universe. Even the divine one palace has to consider it. If we don’t Unite, will we be defeated by the Dragon King One by one? At that time, we won’t even have the qualifications to join hands to fight back!”<br/><br/>The middle-aged man on the right said, his eyes shining, he continued, “We have to make all the preparations. Oh right, if I’m not wrong, the divine sky, Yang, Jiuhua God, and the others have a huge conflict with the Dragon King of the Dragon Palace. It seems that they’ve suffered a great loss from the Dragon King!”<br/><br/>“No matter what, we have to make preparations first. Although Primal Chaos existences are invincible, they’re not invincible. If we believe that the universe is united, they won’t dare to become mortal enemies with us.”<br/><br/>“Also, let me see if I can contact the AO Cang Heaven and the King of Void!”<br/><br/>The few of them chatted as they prepared for the possible crisis that might happen next!<br/><br/>From their point of view, the Dragon King was very strong.<br/><br/>However, the Dragon King also had enemies.<br/><br/>Moreover, they were powerful enemies.<br/><br/>If they were to join forces, there was nothing to be afraid of!\t\t\t\t\t\t</div>", "images": {}, "success": true}