{"id": 1397, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075326.html", "title": "Chapter 4400 - Chapter 4400: All 4399 Were Exterminated", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4400 - Chapter 4400: All 4399 Were Exterminated</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4400: All 4399 were exterminated<br/><br/>Prophet Hong knew that he was lucky and did something he shouldn’t have done.<br/><br/>A long time ago, there was a rule in the divination universe that forbade people from participating in disputes. Otherwise, it would lead to a fatal disaster.<br/><br/>Because divination was powerful, divination could lock onto the position of a strong person, the weakness of a strong person.<br/><br/>It could even predict the defeat and victory of a big battle.<br/><br/>This also created a situation, that is, if they were to participate in a war.<br/><br/>The opponent’s camp’s first consideration was to kill the diviner.<br/><br/>The Dragon King of the Dragon Palace was too powerful.<br/><br/>A primal chaos level existence.<br/><br/>Their divination of the universe was also very strong, if they could even join forces with the belief of the universe and the King of Void Ao Cangtian and the others.<br/><br/>But once they did that, they would be completely trapped!<br/><br/>Although they were powerful when they joined forces, they could definitely suppress the Dragon Palace and the Dragon King.<br/><br/>However, it was impossible to kill the Dragon King.<br/><br/>With their strength, they could not divine the Dragon Palace.<br/><br/>If the Dragon Palace wanted to fight, they could fight. If they wanted to leave, they could not stop them.<br/><br/>Once they separated, if the Dragon King really attacked, how could they divine the universe to resist?<br/><br/>Therefore, prophet Hong had no choice but to listen to Wang Xian’s orders.<br/><br/>Although he was filled with regret.<br/><br/>However, he had to eat the fruit of the karma he had planted.<br/><br/>“Hehe!”<br/><br/>Wang Xian smiled faintly when he saw this scene.<br/><br/>He didn’t care if prophet Hong would continue to play clever tricks or not.<br/><br/>Wang Xian didn’t care. In the face of decisive strength, everything was in vain.<br/><br/>The reason why Wang Xian came to find this prophet Hong was to let him know the consequences of joining in.<br/><br/>Since you want to join in, then join in completely. There was no way out!<br/><br/>Both sides could only let him choose one side.<br/><br/>Originally, he could have ambushed the king of Void, Ao Cangtian, and the others. After he eliminated them, the array formation that interfered with divination naturally dissipated.<br/><br/>But he didn’t do that.<br/><br/>Everything would be decided after he dealt with this prophet Hong.<br/><br/>“Oh? Prophet Hong sent a message saying that he divined some things and asked us to go over to their place again to inform us and discuss it.”<br/><br/>At the same time, Ao Cangtian and the others who had just left an hour ago received a message from prophet Hong.<br/><br/>After seeing this message, he was slightly stunned and said.<br/><br/>“Oh? It seems that prophet Hong has done some divination on some of our matters. Let’s go, what’s the situation in our past?”<br/><br/>“If prophet Hong is willing to do more divination for us, it will be much simpler for the following matters. Unfortunately, the divination universe has always been neutral and does not participate in any disputes.”<br/><br/>The experts who believed in the universe of the king of Void did not have the slightest doubt.<br/><br/>They immediately returned the way they came!<br/><br/>“They’re here!”<br/><br/>Wang Xian sat in the courtyard of prophet Hong. He sensed the aura of AO Cangtian and the rest and said with a smile.<br/><br/>He changed the aura on his body so that he only had the strength of someone who had just entered the Heavenly Yuan blessed realm.<br/><br/>Then, he smiled and entered the house next to him!<br/><br/>Prophet Hong took a look and sighed silently.<br/><br/>“Grandfather!”<br/><br/>The young man walked over and looked at the old man. He couldn’t help but call out softly.<br/><br/>“Just stand behind me all the time!”<br/><br/>Prophet Hong reminded his grandson.<br/><br/>“Prophet Hong!”<br/><br/>At this moment, the king of the sky and void and the others flew over with smiles on their faces.<br/><br/>“I wonder what you have divined, Prophet Hong. Would you like to inform us?”<br/><br/>Ao Cangtian asked curiously!<br/><br/>More than a dozen people arrived and they stood in the courtyard.<br/><br/>The wooden house at the side was only a dozen meters away from them.<br/><br/>They could sense that there was an expert who had just entered the Heavenly Yuan blessed realm in the wooden house.<br/><br/>However, they didn’t pay attention to it.<br/><br/>Buzz<br/><br/>The distance of more than ten meters was now so close.<br/><br/>At this moment, Wang Xian started to move.<br/><br/>In the courtyard, the King of Heaven and void and the rest could only feel a terrifying figure flashing past in front of him.<br/><br/>Following that, they could sense that their life force was dissipating at a terrifying speed.<br/><br/>“Prophet Hong has divined all of you. All of you are going to die!”<br/><br/>At this moment, a cold voice sounded!<br/><br/>It made the king of the void and the rest of the group instantly become terrified!<br/><br/>“Peng!”<br/><br/>However, in the next second, ao Cang Tian’s corpse fell to the ground.<br/><br/>The king of the Void’s body turned illusory for a moment, as if his entire body was in another piece of void.<br/><br/>He had a supreme treasure on him, which allowed him to avoid this fatal attack.<br/><br/>In addition, the bodies of AO Cangtian’s wife and the three heaven origin creation powerhouses who believed in the universe also fell to the ground in an instant!<br/><br/>There was only one powerhouse who believed in the universe. His body started to dissipate strangely and disappeared without a trace.<br/><br/>This was a powerful treasure that allowed him to die and be resurrected instantly!<br/><br/>Even his body was taken away by some kind of energy.<br/><br/>As for the other five powerhouses in the Void universe, Wang Xian did not make a move.<br/><br/>That was because he only managed to kill them in an instant.<br/><br/>“Dragon King, it’s You!”<br/><br/>The king of Void, who seemed to be in another void space, trembled. His eyes turned blood-red instantly as he roared at Wang Xian.<br/><br/>“It’s me!”<br/><br/>Wang Xian swept his gaze across them. Waves of energy completely surrounded this place.<br/><br/>Ao Cangtian and his wife were dead. Two of the experts in the belief universe died and one escaped.<br/><br/>Wang Xian didn’t care about the rest of the experts.<br/><br/>He didn’t need to launch a sneak attack and could kill them easily!<br/><br/>“Prophet Hong, you tricked us. You helped the Dragon King to Kill Us!”<br/><br/>The last expert in the belief universe revealed an expression of shock and anger.<br/><br/>He looked at prophet Hong and roared furiously.<br/><br/>“I had no choice. I had to make a decision.”<br/><br/>Prophet Hong said helplessly!<br/><br/>“Damn it, divining the universe. You all deserve to die.”<br/><br/>This expert who believed in the universe was shocked and furious.<br/><br/>“You dare to Plot Against Me? Hehe, go to Hell.”<br/><br/>Wang Xian stared coldly at the king of Void and the rest. With a wave of his arm, an invisible giant hand enveloped them completely.<br/><br/>The giant hand broke through the void around the king of Void and grabbed his body directly.<br/><br/>He wanted to escape.<br/><br/>However, under the power of Wang Xian, he couldn’t escape at all.<br/><br/>“Ah Ah, Dragon King of the Dragon Palace, just you wait. Just you wait. One day, I will destroy you!”<br/><br/>The King of Void roared in horror.<br/><br/>“Bang!”<br/><br/>The next moment, his voice stopped abruptly.<br/><br/>The powerful force caused him to die instantly.<br/><br/>At the side, the last expert of the belief universe and the other experts of the Void universe had all died.<br/><br/>In less than a minute, more than ten people of the Heavenly Yuan realm had died.<br/><br/>Two Great Dao realm experts and six control realm experts had all been killed.<br/><br/>All of them had died!<br/><br/>Seeing this scene, prophet Hong’s pupils constricted and he revealed a shocked expression.<br/><br/>The Dragon King of the Dragon Palace was much more powerful than he had expected.\t\t\t\t\t\t</div>", "images": {}, "success": true}