{"id": 1390, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075291.html", "title": "Chapter 4393 - Chapter 4393: 4392 Attacked And Occupied The Starry Universe", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4393 - Chapter 4393: 4392 Attacked And Occupied The Starry Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4393: 4392 attacked and occupied the starry universe<br/><br/>“Dragon King, we are in position!”<br/><br/>“Dragon King, we are in position!”<br/><br/>Wang Xian stood in front of the center of the starry universe and waited for the news quietly.<br/><br/>A few days later, news came one after another from Hun Dun and Mo Sha.<br/><br/>Upon seeing this news, he immediately gave the order!<br/><br/>“Attack!”<br/><br/>Buzz<br/><br/>At the same time, Wang Xian’s body moved. He transformed into his divine dragon form and rushed forward.<br/><br/>Roar! Roar! Roar<br/><br/>Roar! Roar<br/><br/>In the ocean ahead, the Beast Emperor sensed Wang Xian’s aura and revealed an expression of shock and anger.<br/><br/>He let out a series of roars. Following that, an extremely terrifying stream of water rushed towards Wang Xian!<br/><br/>This space beast was called the Sea Emperor Beast by Hun Dun and the rest!<br/><br/>It was a ferocious beast emperor that had huge wings but lived in the ocean!<br/><br/>Its body was like an ancient giant crocodile and it had huge wings!<br/><br/>On its body, it carried a meatball that was like a mountain!<br/><br/>It looked extremely terrifying!<br/><br/>However, this time, after the terrifying Neptune Beast sensed Wang Xian’s aura.<br/><br/>After launching the first attack, it didn’t hesitate at all and fled into the distance.<br/><br/>He could feel the threat of death from Wang Xian!<br/><br/>He could feel the aura that made him despair.<br/><br/>“Hehe, you want to escape? Can you escape?”<br/><br/>Wang Xian smiled. He swayed his huge body and his body shook slightly.<br/><br/>The void disk above was emitting a luster. Wang Xian instantly arrived above the Neptune!<br/><br/>His terrifying dragon claws clawed downwards.<br/><br/>Each of his dragon claws contained a terrifying energy.<br/><br/>Under the mixing of ten types of energy, huge wounds appeared on the Sea Emperor Beast’s body instantly!<br/><br/>One strike had injured this sea emperor beast!<br/><br/>This was Wang Xian’s current strength!<br/><br/>An extremely powerful strength!<br/><br/>There was still a huge gap between the chaotic level of a single entity and the chaotic level unleashed by a group of experts!<br/><br/>For example, one chaos level was equivalent to twenty-seven beginner levels!<br/><br/>However, it was very easy to kill all twenty-seven beginner levels when they were fighting against the chaos level.<br/><br/>Unless they had some secret technique that could make the twenty-seven beginner levels attack and defend as one without any flaws.<br/><br/>However, the possibility of this happening was too small!<br/><br/>This Sea Emperor Beast was only at the Great Dao level. When it faced Wang Xian, it had no ability to resist at all!<br/><br/>“Roar! Roar!”<br/><br/>Being attacked by Wang Xian, the Neptune let out a pained cry.<br/><br/>He widened his blood-red eyes and flapped his wings!<br/><br/>“Boom! Boom! Boom!”<br/><br/>The surrounding ocean started to boil. The seawater started to turn red and began to boil. Finally, it turned into a special water droplet with flames.<br/><br/>Countless flaming water droplet covered Wang Xian!<br/><br/>“Petty tricks!”<br/><br/>Wang Xian released a powerful energy from his body. He completely ignored the attack of the Neptune.<br/><br/>“Bang! Bang! Bang!”<br/><br/>Countless flaming water droplets landed on Wang Xian’s body. They were easily blocked and could not break through his defense.<br/><br/>That’s right. At this moment, this level of damage could not break through Wang Xian’s defense at all.<br/><br/>“Boom! Boom!”<br/><br/>“Let’s try the power of the disk of nothingness and the Heaven’s origin Golden Eyes!”<br/><br/>Wang Xian waved his arm and streams of energy entered the disk of nothingness.<br/><br/>Boom! Boom! Boom<br/><br/>In the next instant, these powerful energies landed directly on the body of the Neptune.<br/><br/>Regardless of distance.<br/><br/>In an instant, a large number of wounds appeared on the body of the Neptune once again!<br/><br/>Buzz<br/><br/>At the spot between Wang Xian’s dragon head and brows, the golden eyes emitted a golden glow.<br/><br/>An extremely terrifying golden ray shot towards the Neptune!<br/><br/>“Roar! Roar! Roar!”<br/><br/>The Neptune let out a fearful roar. When it saw the incoming golden ray, it quickly dodged to the distance.<br/><br/>However, when the Neptune dodged, the Golden Ray followed its movements.<br/><br/>As long as the Neptune was within the sight of Wang Xian’s golden eyes, he would not be able to dodge this attack.<br/><br/>He could only take it head-on.<br/><br/>He could only take it head-on, he couldn’t Dodge it!<br/><br/>Thump! Thump! Thump<br/><br/>Muffled sounds rang out.<br/><br/>The terrifying golden rays penetrated the body of the Neptune.<br/><br/>It pierced through a terrifying wound.<br/><br/>However, these wounds weren’t fatal to the Neptune!<br/><br/>“Roar! Roar! Roar!”<br/><br/>The Neptune was terrified. It raised its head and roared. It flapped its gigantic wings.<br/><br/>With the flapping of its wings, violent rain started to fall from the sky!<br/><br/>However, at this moment, Wang Xian realized that the Neptune had started to disintegrate again. Its body turned into droplets of rain and seawater as it fled in all directions!<br/><br/>“A means of escape?”<br/><br/>Wang Xian chuckled when he saw this scene.<br/><br/>“Freeze Everything!”<br/><br/>Wang Xian opened his dragon mouth. Waves of energy were brewing in his body. Following that, streams of frost power were released downwards.<br/><br/>In an instant, everything in the world, except for the Void, was frozen!<br/><br/>“Crack! Crack! Crack!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>A miserable cry sounded in the void once again.<br/><br/>The Neptune used all its strength to resist the terrifying attack and gathered together again.<br/><br/>However, the Neptune looked extremely miserable at this moment!<br/><br/>“The vitality of the space behemoth is indeed abnormal. If it were an ordinary great dao expert, he would have been easily killed by me!”<br/><br/>Wang Xian mumbled!<br/><br/>However, this was going to happen soon!<br/><br/>Boom! Boom! Boom<br/><br/>Wang Xian’s body trembled. Countless flames descended from the sky. The energy in his body circulated and eventually turned into a flaming divine dragon!<br/><br/>The Flames fell and destroyed everything in the surroundings!<br/><br/>The Sea Emperor Beast rolled around in pain. It struggled violently and wanted to escape!<br/><br/>However, the continuous attacks made it impossible for him to use his innate skills.<br/><br/>The life force in his body was also dissipating rapidly.<br/><br/>Buzz<br/><br/>Wang Xian waved his dragon claws. The surrounding ocean churned and formed a huge sphere that surrounded the Neptune and himself.<br/><br/>When the Neptune saw this scene, it was completely terrified.<br/><br/>It began to fight with all its might!<br/><br/>Powerful innate skills attacked Wang Xian without any regard for its life.<br/><br/>However, they were all easily blocked.<br/><br/>The life force in his body was also dissipating rapidly.<br/><br/>Time passed by minute by minute.<br/><br/>After more than ten minutes, the Neptune was already extremely weak.<br/><br/>The Aura on its body was also extremely weak!<br/><br/>“I can die now!”<br/><br/>Wang Xian shook his head. He waved his dragon claws and destructive energy attacked every part of its body.<br/><br/>“Roar! Roar!”<br/><br/>Finally, the Neptune let out a blood-curdling scream. It was completely dead.<br/><br/>In the surrounding area, this huge battle caused all the space beasts in the boundless starry sky to flee in fear.<br/><br/>“Done. I wonder what is the current situation with Devil Fiend and Hun Dun?”<br/><br/>Wang Xian revealed a smile. He kept the body of the Neptune and scanned his surroundings.<br/><br/>As the lair of a Great Dao level space beast, there were still many treasures here.\t\t\t\t\t\t</div>", "images": {}, "success": true}