{"id": 1398, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075331.html", "title": "Chapter 4401 - Chapter 4401: The Collapse And Submission Of The 4400 Void Kings", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4401 - Chapter 4401: The Collapse And Submission Of The 4400 Void Kings</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4401: The collapse and submission of the 4400 void kings<br/><br/>“This? ?”<br/><br/>The young man looked at the corpses in the courtyard with a terrified expression on his face.<br/><br/>He couldn’t help but take a few steps back.<br/><br/>These experts that he thought were high and mighty were actually killed in an instant.<br/><br/>Two of them were existences on the same level as his grandfather.<br/><br/>In his opinion, his grandfather’s strength was almost invincible.<br/><br/>But now, in front of the Dragon King, those at this level were merely killed in an instant.<br/><br/>Now, he finally understood why his grandfather had called Ao Cangtian and the others over.<br/><br/>If he didn’t listen to the Dragon King and resolve the conflict between them, then such an enemy would be extremely terrifying for divination.<br/><br/>The young man took a deep breath and looked at that terrifying figure!<br/><br/>Wang Xian looked at the corpses on the ground and smiled.<br/><br/>He waved his arm and collected all the corpses.<br/><br/>There were a total of twelve corpses.<br/><br/>Two existences at the level of the Great Dao.<br/><br/>Four powerhouses who believed in the universe. The heart of faith was a huge treasure.<br/><br/>The reason why the Dragon Palace only produced fifteen powerhouses in the past 100 million years was related to the corpses of the powerhouses at the Heaven’s origin realm. Such resources were very important.<br/><br/>Putting everything aside, if these corpses were given to the disciples in the peak of the Dragon Palace’s ruler realm, they could absorb them and at least add 20 disciples who could break through.<br/><br/>Of course, Wang Xian would not only use them to nurture disciples in the peak of the ruler realm.<br/><br/>He also needed to nurture the powerhouses in the Heaven’s origin realm!<br/><br/>“Prophet Hong, I’ll rely on you to help me divine the positions of the King of Void and Ao Cangtian.”<br/><br/>Wang Xian looked at prophet Hong and said with a smile!<br/><br/>“Alright!”<br/><br/>Prophet Hong nodded.<br/><br/>Since he had already made his move, there was no turning back!<br/><br/>Ao Cangtian and the king of Void clearly hated him.<br/><br/>If they died completely, he could save a lot of trouble.<br/><br/>Prophet Hong did not hesitate and immediately began to divine.<br/><br/>“Coincidentally, Ao Cangtian and the King of Void have been resurrected in their universe!”<br/><br/>Very soon, prophet Hong spoke to Wang Xian!<br/><br/>“Oh? Then can you divine how many more resurrection treasures they have?”<br/><br/>Wang Xian raised his eyebrows and asked.<br/><br/>“I can’t divine it, but now I can confirm that the king of Void is only at the beginner level. Ao Cangtian is at the control level!”<br/><br/>Prophet Hong confirmed!<br/><br/>“Alright then.”<br/><br/>Wang Xian nodded and called an lie over!<br/><br/>In both the Void Universe and the Cang Heaven Universe, there were devil spirit altars.<br/><br/>“Dragon King!”<br/><br/>Soon, an lie arrived.<br/><br/>“Bring us to the Cang Heaven Universe!”<br/><br/>Wang Xian nodded at him and looked at prophet Hong.<br/><br/>Prophet Hong nodded and looked at an lie. His eyes were filled with astonishment.<br/><br/>“Alright, Dragon King!”<br/><br/>An lie nodded his head. Following that, their figures moved and disappeared.<br/><br/>The next moment, they appeared in the Cang Heaven Universe!<br/><br/>“Point to a location.”<br/><br/>Wang Xian spoke to prophet Hong.<br/><br/>Prophet Hong’s face was filled with astonishment as he pointed in a direction.<br/><br/>Wang Xian nodded his head. A wave of energy enveloped them. Following that, they quickly chased after Ao Cang Heaven and the rest!<br/><br/>“Damn it, damn it. That prophet Hong actually helped the Dragon King to harm us. We’re done for, we’re done for!”<br/><br/>“Flee immediately. We’ll flee immediately. Now, the Dragon King and the rest can easily lock onto us. Once they catch up to us, we might be completely done for!”<br/><br/>At the same time, in an extremely desolate and remote area of the Cang Heaven Universe, Ao Cangtian and his wife were fleeing frantically towards the outside of the universe.<br/><br/>Their faces were filled with fear.<br/><br/>Over the past 100 million years, they had managed to recover their strength to the Great Dao level with great difficulty.<br/><br/>Their losses were too great when they died.<br/><br/>In addition, if prophet Hong and the Dragon King were to chase after them, they would probably be completely annihilated!<br/><br/>The woman’s face was also filled with fear as she was fleeing desperately.<br/><br/>They did not expect that because they wanted to prepare a heaven origin destiny treasure for their future child.<br/><br/>To think that they had fallen to such a state!<br/><br/>The two of them fled frantically.<br/><br/>On the other hand, Wang Xian was approaching them at a terrifying speed.<br/><br/>Half a year later, Wang Xian saw the figures of the Ao Cang Heaven and the woman in front of him. A cold look appeared in his eyes.<br/><br/>“Both of you, die!”<br/><br/>Wang Xian flew over and his voice entered their ears.<br/><br/>“How can it be so fast?”<br/><br/>When they heard this voice, they shouted in horror!<br/><br/>Boom<br/><br/>However, in the next second, an extremely terrifying energy covered their bodies and killed them instantly.<br/><br/>“Prophet Hong, continue your divination!”<br/><br/>Wang Xian looked at prophet Hong and instructed.<br/><br/>“He’s still resurrected in the Cang Heaven Universe. The Ao Cang Heaven is only at the beginner level. His wife has already reached the ruler realm.”<br/><br/>Prophet Hong quickly said.<br/><br/>“Alright, an lie, bring us to the Void universe first. We can’t let the King of Void escape!”<br/><br/>Wang Xian did not continue to pursue ao Cang Heaven.<br/><br/>He dealt with the king of Void first before returning to continue to kill Ao Cang Heaven.<br/><br/>“Yes!”<br/><br/>An lie nodded.<br/><br/>In the next moment, they arrived at the Void Universe.<br/><br/>Compared to the Cang Heaven universe, there were more teleportation locations in the Void Universe.<br/><br/>Wang Xian used the divination lamp to divine a more accurate location for an lie.<br/><br/>After obtaining this location, an lie immediately teleported over.<br/><br/>It was the same for AO Cangtian and the others.<br/><br/>At this moment, the king of Void was also fleeing frantically.<br/><br/>His face was filled with fear.<br/><br/>The only time he was resurrected was in a distant universe.<br/><br/>Even if he flew there, it would still take him millions of years.<br/><br/>In his opinion, the reason the Dragon King did not chase after him last time was because he was too far away and could not lock onto him.<br/><br/>But now that he was resurrected in the Void Universe, he would definitely be locked onto by the Dragon King.<br/><br/>Not to mention that he had the help of the prophet who had divined the universe.<br/><br/>“If I’m not careful, I might be completely destroyed.”<br/><br/>The void King’s heart trembled.<br/><br/>Because next, all the places where he was resurrected were in the Void Universe!<br/><br/>If he was killed twice more, his strength would be reduced to the ruler realm!<br/><br/>But now, he had no way at all.<br/><br/>“Void King, you can’t escape. I will completely destroy you.”<br/><br/>On this day, the void King heard a body and his body trembled violently.<br/><br/>“No, no, no, don’t kill me. Dragon King, please don’t kill me!”<br/><br/>When he heard this voice, his voice trembled as he shouted loudly.<br/><br/>The next moment, what surprised Wang Xian was that.<br/><br/>The king of Void knelt down in the void.<br/><br/>“I submit, I’m willing to submit to you. Don’t kill me!”<br/><br/>Yes, the king of Void had collapsed.<br/><br/>He didn’t want to die. He really didn’t want to die.<br/><br/>The fact that the Dragon King was able to chase him here proved that he was 100% capable of being killed.<br/><br/>He really didn’t want to die.<br/><br/>Even if he had to surrender, he didn’t want to die!\t\t\t\t\t\t</div>", "images": {}, "success": true}