{"id": 1395, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075316.html", "title": "Chapter 4398 - Chapter 4398: The 4397 Prophet Made His Move Again", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4398 - Chapter 4398: The 4397 Prophet Made His Move Again</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4398: The 4397 Prophet made his move again<br/><br/>“The Dragon Palace Dragon King’s method of locking onto the enemy is similar to divination. We believe in the universe, but we have no way to deal with this. We really need a diviner to make a move!”<br/><br/>The believer looked at the void King. “Go find a diviner to make a move. To show our sincerity, we will help you bear the price!”<br/><br/>“Okay, Alright!”<br/><br/>When the king of Void heard their words, a satisfied look appeared on his face.<br/><br/>At the moment, it was indeed a good thing for him to cooperate with other experts.<br/><br/>“Let’s go. I know an expert.”<br/><br/>Ao Cangtian stood up and the group flew toward a certain direction.<br/><br/>While they were flying toward a certain direction, the Dragon King also flew out of the cave.<br/><br/>“They are moving!”<br/><br/>Wang Xian muttered as he looked at the divination lamp’s instructions.<br/><br/>However, the target was not too far away from him. He unleashed his full speed and chased after them!<br/><br/>A day later, Wang Xian sensed a familiar aura in front of him.<br/><br/>“Huh?”<br/><br/>However, he sensed many familiar auras from his senses.<br/><br/>“The aura of the Proud Heaven. Four of them are the auras of the King of the gods in the Universe!”<br/><br/>Wang Xian’s eyes narrowed slightly.<br/><br/>“Interesting, this is really interesting. They are actually mixed together. Are they preparing to deal with themselves or something?”<br/><br/>Wang Xian mumbled.<br/><br/>He did not dare to get close for fear of being discovered by the other party. Instead, he followed them from afar.<br/><br/>After following them for two days, they arrived at an area of a bamboo forest.<br/><br/>Wang Xian sensed that they had entered a bamboo forest and stopped moving!<br/><br/>He concealed his strength and aura as he slowly approached.<br/><br/>“This bamboo forest?”<br/><br/>Wang Xian sized up the area in front of him.<br/><br/>There were some small wooden houses in the bamboo forest.<br/><br/>To be able to build such an eye-catching area in this place of origin, he must be an expert.<br/><br/>“They have joined forces with other experts?”<br/><br/>Wang Xian frowned slightly.<br/><br/>Through his senses, Ao Cangtian and the king of Void had indeed recovered their strength to the Great Dao level.<br/><br/>In addition, there were four controllers in the belief universe as well as the experts around them.<br/><br/>Their combined powers were no weaker than Wang Xian’s.<br/><br/>Of course, if Wang Xian could take down a controller first in a sneak attack, he would still be able to kill the other party.<br/><br/>In other words, he could not let them join forces.<br/><br/>He could not kill them openly.<br/><br/>However, if they were to unite with other powerhouses, Wang Xian would have to be careful!<br/><br/>He took out his communication stone plate, which was given to him by the spirit of the dead.<br/><br/>There was also a communication device in the land of origin.<br/><br/>Wang Xian searched for information on it and soon found the answer.<br/><br/>Divining the location of the powerhouses of the universe. In this case, they are here to find the powerhouses of the universe? What are they here for? To Unite? or<br/><br/>Wang Xian’s eyes flickered. He took out the lamp of divination and divined the AO cang heaven.<br/><br/>The AO Cang Heaven was right in front of him, but he could not divine it!<br/><br/>“Is it because they are divining the universe? are the masters of the universe helping them?”<br/><br/>Wang Xian guessed and frowned slightly. He immediately thought of the fallen Shadow Demon Emperor.<br/><br/>Back then, the Fallen Shadow Demon Emperor had received news about the king of Void from the Masters of the universe.<br/><br/>The Fallen Shadow Demon Emperor was an existence at the level of divining the Great Dao of the universe.<br/><br/>Buzz<br/><br/>Wang Xian set up a devil altar and called an lie over.<br/><br/>Following that, he ordered an lie to look for the fallen Shadow Demon Emperor to ask about the situation of divination of the universe.<br/><br/>“Prophet Hong, sorry to disturb you.”<br/><br/>Just as an lie was looking for the fallen Shadow Demon Emperor to ask about something…<br/><br/>In the bamboo forest in front of them.<br/><br/>Ao Cang Tian brought them to the area where prophet Hong was.<br/><br/>In the courtyard of the bamboo house, prophet Hong sensed the experts outside and was slightly stunned.<br/><br/>“Come in!”<br/><br/>He said slowly.<br/><br/>In the room, the young man heard the movement and walked out curiously.<br/><br/>“Prophet Hong, I have a friend here who wants you to set up a big formation on him to prevent divination and lock on to him, just like what I have on me.”<br/><br/>Ao Cangtian said to prophet Hong, “If it’s a price, you can name it.”<br/><br/>“HMM?”<br/><br/>When prophet Hong heard his words, his gaze landed on the king of Void’s body.<br/><br/>He pinched his fingers and his expression changed slightly.<br/><br/>“Ancestor of the Cangtian cult, don’t harm this old man!”<br/><br/>Prophet Hong hesitated for a moment, looked at AO Cangtian and slowly said.<br/><br/>When Ao Cangtian heard this, he was also slightly silent. He also knew that Prophet Hong had understood some things.<br/><br/>“Prophet Hong, your divination universe is a business person and also a neutral existence. We took out treasures to ask for your help. This is also a normal business relationship.”<br/><br/>From a position at the side, an expert from the belief universe directly spoke.<br/><br/>“Prophet Hong, you don’t know anything. We can just directly trade.”<br/><br/>The void King also spoke.<br/><br/>Prophet Hong sighed and didn’t reply.<br/><br/>“Prophet Hong, this is the heart of faith that we condensed. It’s at the control level. How’s the reward this time? It’s already very powerful, right?”<br/><br/>The four experts from the belief universe took out a treasure and floated in front of Prophet Hong.<br/><br/>When prophet Hong saw this heart of faith, he was slightly shocked.<br/><br/>“Heart of faith, this is the heart of faith of the belief universe? After absorbing it, it can quickly increase one’s strength?”<br/><br/>The young man at the side cried out in surprise, his gaze burning as he stared at this heart of faith.<br/><br/>“Prophet Hong, you only need to set up some great arrays. To you, it’s very simple, a simple transaction!”<br/><br/>When the Void King saw the control level heart of faith, his gaze froze as he spoke to prophet Hong.<br/><br/>“Grandfather, a control-level heart of faith is very precious.”<br/><br/>The young man couldn’t help but send a voice transmission to prophet Hong. “Furthermore, what they said is right. We are just doing business.”<br/><br/>A control-level heart of faith was indeed very precious.<br/><br/>This type of heart of faith was exceptionally precious in the belief universe.<br/><br/>Putting everything else aside, to obtain this type of heart of faith, one needed to kill a control-level king of the gods.<br/><br/>It was extremely difficult to kill the king of gods who was at the control level.<br/><br/>Moreover, if one wanted to kill the king of gods who was at the belief level, one had to be prepared to be enemies with the belief level.<br/><br/>The belief level was too strong.<br/><br/>“Alright, let’s do business normally!”<br/><br/>When prophet Hong heard his grandson’s words, he thought for a few minutes before nodding his head.<br/><br/>He waved his arm and set up one formation after another in their bodies.<br/><br/>“Thank you, Prophet Hong!”<br/><br/>Ao Cangtian said from the side.<br/><br/>“There won’t be a next time. Don’t come looking for me in the future.”<br/><br/>Prophet Hong shook his head.<br/><br/>Ao Cangtian and the others’enemies were too strong. If they were only at the Great Dao level, prophet Hong would not hesitate at all.<br/><br/>However, the other party was a legendary level powerhouse. He had to be careful.<br/><br/>And this time, if the other party did not take out the heart of faith and if it was not his grandson, he would not agree.<br/><br/>One last time.<br/><br/>He thought to himself!\t\t\t\t\t\t</div>", "images": {}, "success": true}