{"id": 1393, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075306.html", "title": "Chapter 4396 - Chapter 4396: 439.5 Billion Years", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4396 - Chapter 4396: 439.5 Billion Years</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4396: 439.5 billion years<br/><br/>Time passed by quickly.<br/><br/>Although Wang Xian had the intention to make a move on the belief universe, he was not in a hurry.<br/><br/>After all, the belief universe had two universes.<br/><br/>He had to understand their specific strength.<br/><br/>Since he had made a move, he had to be able to kill more than 70% of their powerhouses.<br/><br/>Otherwise, it would only increase their enemies.<br/><br/>Time was the most worthless in the universe.<br/><br/>Even during the calamity, the disciples of the Great Beings in the nine-origin universe could feel the rapid loss of time.<br/><br/>After all, the nine-origin universe was very safe at the moment.<br/><br/>In this safe environment, all the disciples of the Great Beings didn’t feel that their days were like years.<br/><br/>During this time, the Dragon Palace had enough resources.<br/><br/>The strong disciples who were at the peak of the ruler realm and above were all cultivating in the primal chaos stones.<br/><br/>Although it was a huge expenditure, this expenditure was totally worth it for the Dragon Palace.<br/><br/>A few hundred thousand years later, Mo Sha brought some information about the belief universe.<br/><br/>When Wang Xian saw this specific information, he was shocked.<br/><br/>The belief universe was much stronger than he had imagined.<br/><br/>However, Wang Xian did not pay too much attention to it.<br/><br/>The belief universe was indeed strong. There were 27 powerhouses in the Heavenly Yuan blessed realm.<br/><br/>However, nearly 20 of them were at the beginner level.<br/><br/>Two of them were at the Great Dao level.<br/><br/>These two were about the same strength as Mo Sha.<br/><br/>One of them had just broken through.<br/><br/>Wang Xian did not put such an existence in his eyes.<br/><br/>He could kill him alone.<br/><br/>However, Wang Xian didn’t decide to make a move against the belief universe. He decided to wait.<br/><br/>In the blink of an eye, 100 million years passed.<br/><br/>“Dragon King, all the resources have been used up!”<br/><br/>100 million years later, Prime Minister Gui came to the Dragon King’s Hall and reported to Wang Xian.<br/><br/>“Have you used up all the resources?”<br/><br/>Wang Xian raised his eyebrows when he heard Prime Minister Gui’s report.<br/><br/>“Yes, Dragon King. Just the space of the primal chaos stones has used up 50% of the resources in the entire Cang Heaven Universe.”<br/><br/>Prime Minister Gui opened his mouth and said.<br/><br/>At this moment, Prime Minister Gui’s aura had undergone a huge change.<br/><br/>The aura that belonged to the Tianyuan blessed realm was undoubtedly revealed.<br/><br/>Yes, Prime Minister Gui had made a breakthrough!<br/><br/>Prime Minister Gui, Ao Qitian, Ao Jian, Ao Yao, and the other former combat divisions and army leaders of the Dragon Palace had all evolved.<br/><br/>For example, Prime Minister Gui, Ao Qitian, and Ao Yao had all sorts of attributes in their bodies. Wang Xian sorted them out and changed them.<br/><br/>He changed the two attributes into one.<br/><br/>Prime Minister Gui had evolved into the bloodline of the Xuanwu clan and was able to break through.<br/><br/>Ao Qitian and Ao Yao had transformed into the darkness and light attributes.<br/><br/>After all, it was too difficult to break through the two attributes.<br/><br/>It was several times more difficult than breaking through a single attribute.<br/><br/>Since then, the Dragon Palace had mainly focused on the divine dragon.<br/><br/>In 100 million years, the Dragon Palace had added ten heavenly Yuan blessed realm experts.<br/><br/>Eight of them had broken through directly because they had spots in the sword and Magic Universe and the Cang Heaven Universe.<br/><br/>The other two, one of which was a spot that the dragon palace experts had found. Mo Sha had protected them and broken through.<br/><br/>The other one was Lan Qingyue, who had a breakthrough in the starry universe.<br/><br/>Currently, the Dragon Palace and Wang Xian had a total of 27 powerhouses in the Heaven’s origin realm.<br/><br/>“Dragon King, currently, there are five disciples in our Dragon Palace who have reached the shackle and need to break through!”<br/><br/>Prime Minister GUI continued to report!<br/><br/>Yes, there were no more spots for the Dragon Palace to break through.<br/><br/>There were still five disciples who had yet to break through!<br/><br/>After all, 100 million years had passed in reality, but 10 billion years had already passed in the space of the primal chaos stones.<br/><br/>In these 10 billion years, there were still five disciples who had reached the bottleneck of breaking through.<br/><br/>There were no spots for them at the moment.<br/><br/>“In other words, if all of them broke through, there would be a total of 15 disciples. Adding 15 disciples in the space of primal chaos for 10 billion years would be a little too little.”<br/><br/>Wang Xian spoke.<br/><br/>“Dragon King, in the past, the reason why we were able to produce a powerhouse in the Heavenly Yuan blessed realm within a few million years was because you took out the corpses of the Heavenly Yuan blessed realm powerhouses for them to cultivate. This time, these disciples didn’t have too many corpses to cultivate.”<br/><br/>“In addition, for the powerhouses in the Heavenly Yuan blessed realm in the Dragon Palace, the resources required to increase their strength would be even more terrifying. Fortunately, Xiao Shuang, Lin Niu, and the leader of the water god Dragon have all broken through.”<br/><br/>“Xiao Shuang and Lin Niu can be considered to have the strength of the control level.”<br/><br/>Prime Minister Gui said.<br/><br/>“That’s true.”<br/><br/>Wang Xian nodded.<br/><br/>There were 15 powerhouses who could break through the shackles in 10 billion years. This number was already very terrifying.<br/><br/>If this were to be known, it would shake the entire universe.<br/><br/>However, there were also many powerhouses at the peak of the Dragon Palace’s ruler level. Now, there were already 200 of them.<br/><br/>This was an extremely terrifying number.<br/><br/>200 powerhouses at the peak of the Overlord realm would be able to hold on for some time if they joined forces to defend.<br/><br/>Of course, it was impossible for them to resist.<br/><br/>Their speed was on a completely different level.<br/><br/>“Since all the resources have been used up, we should prepare for our next move. If the Dragon Palace wants to improve so quickly, we must start a war.”<br/><br/>Wang Xian said.<br/><br/>Currently, the Dragon Palace’s strength was the same as before. However, they had a treasure that was comparable to a beginner in the Heaven’s origin realm.<br/><br/>Their strength had increased a little.<br/><br/>Xiao Lan, Xiao Bai, and Hun Dun had both improved their strength after absorbing the corpse of the Great Dao Level Space Beast.<br/><br/>They had reached the beginner in the Heaven’s origin realm.<br/><br/>Due to the special characteristics of the space beasts, they were comparable to the control level.<br/><br/>Including bei Shuang and Lin Niu, the Dragon Palace had six control levels.<br/><br/>Nineteen early-stage levels.<br/><br/>Wang Xian was the only one at the primal chaos level.<br/><br/>“Dragon King, are we going to attack the belief universe? The 24 palaces of the belief universe have 27 powerhouses at the Heavenly Yuan blessed realm. If this battle is to start, I’m afraid it won’t end in a short period of time.”<br/><br/>Prime Minister Gui spoke seriously, he continued, “In addition, once we make a move, I reckon that they might join forces with the Void King of the Void Universe, the Proud Heaven of the Cang Heaven Universe. They should have already recovered to the level of the Great Dao. If they join forces, it would be a big problem.”<br/><br/>“We have to fight. As for how we should fight, we can formulate a detailed plan. Now, the initiative is in our hands.”<br/><br/>Wang Xian spoke.<br/><br/>There were three universes in the belief universe. Other than their own universes, the other two universes normally had universes such as metal, wood, water, fire, and earth.<br/><br/>The Dragon Palace needed the quota for these universes.<br/><br/>The belief universe was different from other cultivation methods. As long as they had enough believers, they could directly achieve a breakthrough.<br/><br/>The quota was of no use to them.<br/><br/>They didn’t need it either.<br/><br/>Therefore, the Dragon Palace needed the two universes they occupied.<br/><br/>As for how to fight, they first had to carry out some decapitation operations.\t\t\t\t\t\t</div>", "images": {}, "success": true}