{"id": 1394, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075311.html", "title": "Chapter 4397 - Chapter 4397: 4396 Plans Of The Dragon Palace And The Enemy", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4397 - Chapter 4397: 4396 Plans Of The Dragon Palace And The Enemy</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4397: 4396 plans of the Dragon Palace and the enemy<br/><br/>Just as Prime Minister Gui had said.<br/><br/>The strength of the belief universe was not weak.<br/><br/>In addition, the Dragon Palace still had its own enemies.<br/><br/>The King of Void and Ao Cangtian and the rest.<br/><br/>Ao Cangtian and the rest were still fine.<br/><br/>Almost all the powerhouses in the universe had been wiped out by Wang Xian. Only Ao Cangtian, his wife, and one control-level powerhouse were left.<br/><br/>The rest were completely exterminated.<br/><br/>However, there were still five or six heaven origin powerhouses in the Void Empire who were not completely exterminated.<br/><br/>Furthermore, after such a long time had passed, there was a high possibility that the king of Void’s strength had already recovered to its peak.<br/><br/>Of course, since the void disk was obtained by Wang Xian, it was inevitable that his strength would drop.<br/><br/>If he wanted to kill them, he had to prevent them from joining forces.<br/><br/>Wang Xian was deep in thought.<br/><br/>“The best way is to get rid of the king of Void and Ao Cang Heaven!”<br/><br/>Wang Xian mumbled.<br/><br/>With a move of his palm, the lamp of divination immediately began to perform divination.<br/><br/>“HMM?”<br/><br/>However, another pleasant surprise was that he actually divined the location of the king of Void.<br/><br/>When he saw this information, his eyes sparkled.<br/><br/>The last time he didn’t divine the king of Void, it should be because the place where the king of Void resurrected was too far away.<br/><br/>Now, he had returned to the range that he could divine.<br/><br/>“The current location of the King of Void?”<br/><br/>Wang Xian narrowed his eyes and took out the location. Finally, he landed on a place.<br/><br/>“The land of origin. The King of Void is in the land of origin!”<br/><br/>His eyes narrowed slightly.<br/><br/>It was the land of origin again.<br/><br/>“Looks like the land of origin is a place where a bunch of powerhouses gather!”<br/><br/>Wang Xian mumbled and called an lie over.<br/><br/>A few minutes later, Wang Xian appeared in the land of origin.<br/><br/>The last time, Wang Xian had left a demonic altar in the land of origin.<br/><br/>Following the divination instructions of the divination lamp, Wang Xian immediately flew out.<br/><br/>At the same time, in a cave in the land of origin.<br/><br/>More than ten powerhouses were located in a cave in the land of origin.<br/><br/>Leading them were the king of Void, Ao Cangtian, and the rest.<br/><br/>Apart from them, there were also the powerhouses from the Void universe and the four control-level powerhouses from the belief universe.<br/><br/>“Gathering us here just to form a strategic partnership? Hehe, your belief universe is really good to think about!”<br/><br/>The void King sat there, his gaze sweeping across the belief universe’s four people. He snorted coldly and said with a displeased expression.<br/><br/>“Hehe, we have our own difficulties. After all, that Dragon Palace’s Dragon King is a primal chaos level existence.”<br/><br/>A middle-aged expert from the belief universe smiled faintly and said, “I can gather the two of you together to form a partnership.”<br/><br/>“The Dragon King of the Dragon Palace hasn’t attacked your belief universe for hundreds of millions of years. It’s hard to say whether he will attack in the future. Moreover, the strength of your belief universe is very strong now. Those at the primal chaos level wouldn’t dare to be enemies with you.”<br/><br/>Ao Cangtian looked at the four of them and said coldly.<br/><br/>Ao Cangtian’s strength had just recovered to the Great Dao level, but he hadn’t reached his peak yet.<br/><br/>“The Patriarch of the Cangtian religious sect doesn’t know that the Dragon Palace has added at least six existences at the Heavenly Yuan blessed realm in the past 100 million years. The number of Heavenly Yuan blessed realm existences in the Dragon Palace may be less than ours, but it’s not much less.”<br/><br/>“There’s another point. According to our investigation, the Dragon Palace has another great dao expert. With the current strength of the Dragon Palace, it’s really possible for them to invade our belief universe. We have to be prepared.”<br/><br/>The expert from the belief universe continued.<br/><br/>“So, you called us here. If you encounter any danger, you want us to help?”<br/><br/>The void King coldly continued.<br/><br/>“Everyone, I don’t think you need to worry about whether the Dragon Palace will continue to attack our belief universe. Even if the Dragon Palace doesn’t attack us, we can still cooperate in other aspects.”<br/><br/>“For example, if we attack some powerful universes together, we want people and the resources will belong to you. If we cooperate, you will be able to make up for the huge losses you suffered because of the Dragon Palace. At the very least, in the next five to six billion years, you will be able to return to the peak.”<br/><br/>The four experts from the belief universe said.<br/><br/>His words eased the void King’s cold expression.<br/><br/>It also made Ao Cangtian look pensive.<br/><br/>In the past, they were powerful and did not need to cooperate with other experts.<br/><br/>But now, it was different.<br/><br/>“Also, everyone, if the Dragon King knows that we are working together with you, he will probably attack us too. We are also taking a certain risk.”<br/><br/>An old man from the belief universe continued.<br/><br/>100 million years ago, they told this information to the divine one palace and other experts from the belief universe.<br/><br/>After they received the information, they were naturally filled with blame and anger towards them.<br/><br/>They even threatened that if the other party really attacked, they would have to bear most of the losses.<br/><br/>This made the four of them angry, but they couldn’t say anything.<br/><br/>However, as the days passed, the Dragon King of the Dragon Palace didn’t attack them.<br/><br/>This made them feel relieved, and they began to plan.<br/><br/>Although they hadn’t been attacked yet, they couldn’t guarantee that the Dragon King wouldn’t attack them.<br/><br/>So they decided to gather the king of the void and the Proud Heaven.<br/><br/>If the Dragon King really dared to attack, it would not be difficult to defend with them.<br/><br/>In addition, they also valued one point.<br/><br/>If the Dragon King did not attack, they could cooperate with the Proud Heaven’s King of the Void.<br/><br/>These two were both existences at the Great Dao level. They were once the overlords of a universe.<br/><br/>If they cooperated, wouldn’t it be easy for them to occupy five or six or even more universes in the next few billion years?<br/><br/>If they could really occupy five or six or even more universes, it would also be easy for them to break through to the Great Dao level.<br/><br/>At that time, would they still be afraid of the Dragon King?<br/><br/>“That’s possible.”<br/><br/>The King of Void, Ao Cangtian, and the others nodded.<br/><br/>“I know that you believe in the conditions to improve the universe. I have one condition. If you can all improve to the Great Dao level, you have to help us destroy the Dragon Palace.”<br/><br/>Ao Cangtian looked at the four of them and said with hatred in his eyes.<br/><br/>This time, their universe was simply too miserable.<br/><br/>“Yes. If we can reach the Great Dao level, we can persuade the entire belief universe to destroy the Dragon Palace.”<br/><br/>An expert who believed in the universe replied with a twinkle in his eyes.<br/><br/>“Hehe, all the benefits have been taken by you, but we don’t care. Now that the Dragon King has a treasure that can lock people down, I have returned to the land of origin. He can find me. Now, help me solve the problem on my body.”<br/><br/>The king of Void looked at them and said.<br/><br/>“Masters who can divine the universe can do it.”<br/><br/>Ao Cangtian said.\t\t\t\t\t\t</div>", "images": {}, "success": true}