{"id": 1399, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075336.html", "title": "Chapter 4402 - Chapter 4402: 4401 Subdued And Completely Exterminated", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4402 - Chapter 4402: 4401 Subdued And Completely Exterminated</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4402: 4401 subdued and completely exterminated<br/><br/>When the King of Void kneeled in the Void and was about to surrender.<br/><br/>Wang Xian was stunned!<br/><br/>This? ?<br/><br/>What the F * ck?<br/><br/>How could this work?<br/><br/>After all, he was an existence at the level of the Great Dao.<br/><br/>However, what Wang Xian did not know was that it was precisely because the king of Void was an existence at the level of the Great Dao and the Master of the universe that he did not want to die.<br/><br/>If he submitted, he would at most become the paparazzi of the Dragon King.<br/><br/>However, there was a limit to the time he could be a paparazzi.<br/><br/>Other than when the calamity erupted, other times, the chaos was very peaceful.<br/><br/>At most, he would fight to the death for the Dragon King during the calamity. Once the calamity passed, he would be able to return to the Void universe and become the king of Void.<br/><br/>He would be able to enjoy his life again!<br/><br/>If he died, he would really die!<br/><br/>He would disappear forever!<br/><br/>He couldn’t bear to do so!<br/><br/>At the side, Prophet Hong was also looking at this scene in astonishment.<br/><br/>He didn’t expect that the king of the void would actually submit to the Dragon King.<br/><br/>“Hehe, submit? I’ve killed you so many times and conquered your universe. Will you submit in peace? Will you willingly obey my orders?”<br/><br/>Wang Xian flew to his side and stared at him mockingly. “I don’t believe you.”<br/><br/>“Dragon King, i…”<br/><br/>The king of Void raised his head and looked at Wang Xian disappointedly, then, he looked at Prophet Hong. “I know that there is a treasure in the universe of divination called the karmic contract. As long as I sign this contract, my life is in your hands. I can sign the karmic contract.”<br/><br/>“Dragon King, I am an expert at the Great Dao level. In the next calamity, I can fight for you in every calamity. I can fight for the Dragon Palace.”<br/><br/>“I beg you, Dragon King, to spare my life.”<br/><br/>As the king of Void spoke, his face was full of pleading.<br/><br/>“Hehe!”<br/><br/>Wang Xian looked at him and felt that it was a little funny.<br/><br/>When he was killing him, the king of Void was clamoring that he wanted to kill him and that he must take revenge.<br/><br/>But how long had it been? He had to kneel down and submit?<br/><br/>He looked at Prophet Hong.<br/><br/>“There is indeed such a karmic contract in our divination universe. The conditions for signing such a contract are extremely harsh and complicated. Both parties must agree to it. In addition, the contracted person must condense his own lifeblood<br/><br/>“If this lifeblood is in the hands of the other party, it can directly kill his lifeblood. There is another point. After condensing the lifeblood, he can only be resurrected in the future through the lifeblood<br/><br/>“It can be said that once the contract is signed, the person who signs it will hand over his life to the other party. Even a great dao existence can not change the karmic contract.”<br/><br/>Prophet Hong spoke!<br/><br/>This type of karmic contract was a terrifying method.<br/><br/>In addition, it required the aid of a treasure.<br/><br/>The person who signed the contract needed to cultivate this method to condense his lifeblood.<br/><br/>In short, unless he was forced into a desperate situation, he would not sign these contracts.<br/><br/>Once they were signed, as long as he was still alive, his life would be in the hands of another person.<br/><br/>There was another point. If another person died, the contracted person would also die.<br/><br/>“Oh? There’s really such a contract?”<br/><br/>Wang Xian looked at prophet Hong and asked.<br/><br/>“Yes, Dragon King. This contract is rarely signed. Not only does it require the consumption of a treasure, but it also requires the other party to condense his vital meridian.”<br/><br/>Prophet Hong nodded his head.<br/><br/>“Hehe, if you really want to submit to the king of Void, I will naturally agree.”<br/><br/>Wang Xian narrowed his eyes slightly. “Moreover, this is a very good choice for you. Otherwise, I will exterminate all the other powerhouses in your void universe.”<br/><br/>Wang Xian would naturally agree if a powerhouse of the Great Dao level wanted to submit.<br/><br/>Furthermore, there were still five heaven origin creation realm experts in the Void Universe.<br/><br/>However, if Wang Xian wanted to subdue them, he had to be prepared for any eventualities.<br/><br/>After all, Wang Xian and the rest had killed all the experts above level seven who were the masters of the entire void universe.<br/><br/>He still had to prevent them from taking revenge.<br/><br/>If not for the contract mentioned by Prophet Hong, Wang Xian would definitely not accept the submission of the King of Void.<br/><br/>“Yes, yes, I am willing to submit. Thank you, Dragon King. Thank you, Dragon King.”<br/><br/>The king of Void thanked Wang Xian excitedly when he heard his agreement.<br/><br/>Finally, he did not have to die.<br/><br/>Although the entire void universe had been conquered by the Dragon Palace.<br/><br/>Most of his subordinates and descendants had also been killed.<br/><br/>However, the king of Void was an old fellow who had lived for a hundred billion years. His affection for his family had weakened.<br/><br/>The royal family of the Void Dynasty had been his descendants for countless generations.<br/><br/>In addition, his beloved son and grandson, who were in the Heavenly Yuan destiny level, were not killed.<br/><br/>“Prophet Hong, I’ll have to trouble you to sign the contract!”<br/><br/>Wang Xian looked at prophet Hong and said.<br/><br/>“Alright, Dragon King. I have the treasure to sign the contract now. As long as the king of Void forms his lifeblood, we can start the contract.”<br/><br/>Prophet Hong nodded.<br/><br/>“Hehe, alright then. Let’s go to the Cang Heaven Universe and kill Ao Cang Heaven!”<br/><br/>Wang Xian smiled and brought them to the Cang Heaven Universe.<br/><br/>After divining ao Cang Heaven’s location, Wang Xian immediately launched the next round of attacks.<br/><br/>In the next few decades, Wang Xian pursued ao cang heaven crazily.<br/><br/>“He’s dead. Ao Cangtian was completely destroyed by you, Dragon King. From then on, Ao Cangtian will no longer exist.”<br/><br/>After killing Ao Cangtian for the fifteenth time, prophet Hong confirmed.<br/><br/>Wang Xian took out the divination lamp and divined for a while before nodding slightly.<br/><br/>He had indeed completely destroyed Ao Cangtian.<br/><br/>After pursuing him for 70 to 80 years, Ao Cangtian and the rest had been resurrected 15 times.<br/><br/>However, when he resurrected later, he could only retain the strength of a universe knight.<br/><br/>With such strength, Wang Xian could easily track and kill him.<br/><br/>At this point, AO Cangtian was completely dead.<br/><br/>During these 70 to 80 years, the king of Void had also condensed his own lifeblood.<br/><br/>Wang Xian sensed his lifeblood and felt that it was very magical.<br/><br/>Holding this lifeblood, he could sense the king of Void’s thoughts and what he was doing.<br/><br/>In other words, even if Wang Xian was very far away from the king of Void, he could still sense what he was doing.<br/><br/>What was he thinking.<br/><br/>He could even destroy his lifeblood with just a thought, causing the king of Void to die instantly.<br/><br/>This was an extremely terrifying contract.<br/><br/>It was a type of 100% control over a person.<br/><br/>Of course, this kind of contract was completely impossible to spread.<br/><br/>Firstly, not only would it require powerful contract treasures, it would also require a contestant to spend several decades to condense a lifeblood.<br/><br/>Who would be foolish enough to condense a lifeblood and hand it over to others?<br/><br/>Even the patriarch of a large sect wouldn’t be able to control his subordinates one by one.<br/><br/>“I’ll leave these corpses of your void universe to you. Recover your strength to the Great Dao level as soon as possible so that you can prepare to attack the belief universe.”<br/><br/>Wang Xian gave him all the corpses of the king of Void and the others. “Also, don’t let the belief universe know that you’ve submitted to me.”<br/><br/>“Yes, yes, it’s the Dragon King!”<br/><br/>The king of Void replied immediately. Looking at his own corpses, he heaved a heavy sigh of relief.\t\t\t\t\t\t</div>", "images": {}, "success": true}