{"id": 1408, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075381.html", "title": "Chapter 4411 - Chapter 4411: 4410 Belief As One", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4411 - Chapter 4411: 4410 Belief As One</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4411: 4410 belief as one<br/><br/>“PFFT!”<br/><br/>“It’s Too Late!”<br/><br/>When Palace Master Shen Yi reminded him.<br/><br/>Wang Xian had already teleported to a certain location.<br/><br/>His gaze was locked onto a control-level powerhouse.<br/><br/>When the king of all gods of the belief universe was fighting, layers of barriers enveloped them.<br/><br/>The power of belief was used to defend.<br/><br/>Furthermore, this layer of defense was superimposed by all the powerhouses.<br/><br/>It was to prevent them from being broken one by one.<br/><br/>However, it was obvious that they had underestimated Wang Xian’s strength.<br/><br/>Wang Xian appeared in front of a control-level expert who worshipped the gods. His heaven’s origin golden eye erupted with a terrifying energy.<br/><br/>It directly penetrated the defense in front of him.<br/><br/>Following that, the void disk ignored the attack of space and instantly landed on his body.<br/><br/>“No, no!”<br/><br/>In just an instant, the control-level powerhouse was killed by the terrifying power of space.<br/><br/>Before he died, he let out a miserable scream.<br/><br/>“What?”<br/><br/>“Come closer together. Don’t scatter. Come closer!”<br/><br/>“Not good. The defense we spread around can be penetrated by the Dragon King. Be careful. The Dragon King is very powerful!”<br/><br/>“Senior Palace Master Shen Yi, what should we do? The Dragon King has made his move!”<br/><br/>Wang Xian made his move and instantly killed a king of Pantheon who was at the control level.<br/><br/>This caused the pupils of the other kings of Pantheon to constrict slightly. Their faces were filled with astonishment.<br/><br/>Although they were fighting against the powerhouses of the Dragon Palace just now,.<br/><br/>There was an energy defense between them.<br/><br/>It was to prevent the Dragon King from attacking them.<br/><br/>They were not stupid. Naturally, they would take the Dragon King’s combat strength into consideration.<br/><br/>However, Wang Xian’s instant attack still caused them to lose a control-level existence.<br/><br/>This was a little terrifying!<br/><br/>“Defend! Don’t attack! Defend with all your might!”<br/><br/>The Master of the first God Palace roared loudly!<br/><br/>Buzz! Buzz! Buzz<br/><br/>At the next moment, they did not hesitate at all and went all out to defend.<br/><br/>“Boom! Boom! Boom! Boom!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>All the attacks from the experts of the Dragon Palace landed on their defenses but did not break through them.<br/><br/>Although the strength of the king of the gods who worshipped the universe was slightly weaker than Wang Xian and the rest.<br/><br/>However, if they went all out to defend, it would still be extremely difficult to break through them.<br/><br/>When they broke through one layer of their defense, the other experts would set up another layer.<br/><br/>With such an endless defense, even if Wang Xian was added in, he wouldn’t be able to break through it directly.<br/><br/>“Do they only know how to cower? This is not a good choice!”<br/><br/>Wang Xian stared at their defense with a cold look in his eyes.<br/><br/>He channeled his energy into his golden eyes and a terrifying golden ray shot toward them!<br/><br/>“Let me do it!”<br/><br/>The expression of palace master Shenyi changed slightly when he saw the Golden Ray.<br/><br/>He roared and channeled all the power of faith into the pagoda of light in his hand.<br/><br/>The pagoda of light formed a powerful defense.<br/><br/>Wang Xian’s attack penetrated the defense of the king of the Gods of faith.<br/><br/>However, when it landed on the defense of the ultimate treasure of Heaven’s origin, it failed to break it.<br/><br/>“Attack one point. Let’s see how long they can defend!”<br/><br/>When Wang Xian saw that his attack was blocked, his expression did not change!<br/><br/>After all, the strength of the king of the gods was much weaker than Wang Xian and the rest.<br/><br/>They could defend for a year, two years, or even 10 to 100 years. However, could they defend for thousands of years?<br/><br/>They could not defend!<br/><br/>There would be times when their energy would be depleted.<br/><br/>If they didn’t defend, it would be easier for Wang Xian to chase after them and kill them one by one if they escaped.<br/><br/>“Yes!”<br/><br/>The experts from the Dragon Palace replied.<br/><br/>They followed Wang Xian and launched a terrifying attack at the same time!<br/><br/>Boom! Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>The sound of tremors rang out continuously.<br/><br/>The King of the Gods of faith was enveloped by the power of faith. Each and every one of them looked extremely embarrassed.<br/><br/>“I’ll cast a defense, and all of you will inject the power of belief into my body. All of us cultivate the power of belief, so we can make our defense stronger and more terrifying!”<br/><br/>“This is our advantage!”<br/><br/>The attacks caused the bodies of the first God Palace Master and the others to tremble violently.<br/><br/>At this moment, his gaze focused as he roared loudly!<br/><br/>“Protection of the gods!”<br/><br/>“Absorb the faith!”<br/><br/>Palace master Shen Yi roared furiously. He slowly pressed his palms together.<br/><br/>A huge shadow formed from the power of faith slowly enveloped them.<br/><br/>When all the kings of the gods saw this scene, their gazes focused. All the power of faith was injected into palace master Shen Yi’s body.<br/><br/>The huge shadow began to materialize.<br/><br/>It formed an incomparably vast defense!<br/><br/>“Huh?”<br/><br/>When Wang Xian saw this defense, his eyes focused slightly!<br/><br/>He waved his dragon claws.<br/><br/>“Bang, Bang, Bang!”<br/><br/>Numerous huge claw marks appeared on the body of the shadow, but they were quickly restored.<br/><br/>“This defense is very strong!”<br/><br/>Wang Xian looked at this defense and his eyes focused slightly. “The greatest advantage of the belief universe is that their energy is the power of faith. Furthermore, this kind of power has a fusion and stacking effect.”<br/><br/>This was the huge advantage of the kings of the belief universe!<br/><br/>They were able to better merge the powers of all the powerhouses together!<br/><br/>Under such circumstances, it was extremely difficult to hunt alone.<br/><br/>Even if Wang Xian joined forces with all the powerhouses of the Dragon Palace, they would still be able to break through with great strength.<br/><br/>“Prime Minister Gui, get an lie to bring the disciples of the Dragon Palace over. Then, go to the belief universe to hunt down the gods and weaken their strength!”<br/><br/>Wang Xian immediately transmitted his voice to Prime Minister Gui!<br/><br/>Since they were going to fight a protracted war, Wang Xian would fight a protracted war with them.<br/><br/>The power of faith had their strengths.<br/><br/>However, it also had a fatal weakness.<br/><br/>That was, as long as their believers were killed, their strength would naturally be reduced.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui replied immediately and followed him out of the battlefield!<br/><br/>Wang Xian stared at the giant formed from the power of faith in front of him and opened his dragon mouth.<br/><br/>Boom! Boom<br/><br/>A terrifying dragon breath attacked the giant formed from the power of faith.<br/><br/>The giant trembled violently, but he still managed to withstand his attack.<br/><br/>“Alright, our power of faith has a strong fusion ability. We can totally retaliate.”<br/><br/>Sacred Palace Master’s gaze focused as he roared loudly!<br/><br/>“If we want to fuse all of our powers into one to attack, the difficulty will increase by a hundred times.”<br/><br/>Divine one palace master spoke.<br/><br/>If they could really stack their powers together, then their belief universe would be invincible.<br/><br/>After all, an individual’s power was an individual’s. If they wanted to perfectly fuse them together, it would be difficult.<br/><br/>It was fine to defend, as long as energy was injected into it.<br/><br/>As for attacking, it required everyone to perform the exact same actions at the same time.<br/><br/>There couldn’t be the slightest difference.<br/><br/>This was very difficult. After all, there was still a gap in strength between them.<br/><br/>“However, even if we can’t perfectly fuse them together, we can still launch a counterattack!”<br/><br/>God one palace master said loudly, “Next, listen to my orders!”\t\t\t\t\t\t</div>", "images": {}, "success": true}