{"id": 1402, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075351.html", "title": "Chapter 4405 - Chapter 4405: During The 4404 Attack", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4405 - Chapter 4405: During The 4404 Attack</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4405: During the 4404 attack<br/><br/>The two women looked at Wang Xian in shock.<br/><br/>They did not even dare to think of attacking the belief universe!<br/><br/>“Since the Dragon King wants to attack the belief universe, he naturally has the ability.”<br/><br/>At the side, Prophet Hong saw the shock and disbelief on the two women’s faces. He spoke slowly!<br/><br/>“He has the ability?”<br/><br/>The two women were slightly shocked.<br/><br/>Although they could not see clearly the depth of Wang Xian, they had no choice but to believe the words of prophet Hong.<br/><br/>One had to know that as one of the three great prophets who divined the universe.<br/><br/>The things he knew far exceeded their imagination.<br/><br/>Moreover, prophet Hong did not have to lie to them!<br/><br/>“Since I am prepared to make a move against the belief universe, I have this ability and confidence.”<br/><br/>Wang Xian said, “Follow me back to the Dragon Palace first. When the time comes, I will bring you straight to the belief universe.”<br/><br/>The strength of these two women was in the initial stage of the Heaven’s origin blessed realm.<br/><br/>However, they were comparable to veteran experts who had just entered the blessed realm.<br/><br/>Although they were not very strong, having two more existences in the Heaven’s origin blessed realm was still a considerable strength.<br/><br/>“Alright!”<br/><br/>The two women looked at each other and nodded.<br/><br/>There was no need for the Dragon King to lie to them.<br/><br/>There was also no need for prophet Hong to lie to them.<br/><br/>After all, with their strength, prophet Hong could kill them if he wanted to do anything to them.<br/><br/>“Let’s Go!”<br/><br/>Wang Xian called an lie over and enveloped them before disappearing instantly.<br/><br/>“The universe around the land of origin will not be peaceful anymore.”<br/><br/>Prophet Hong muttered as he watched Wang Xian and the rest leave.<br/><br/>He knew that a true king might be born in their area.<br/><br/>A powerhouse with terrifying strength.<br/><br/>“Dragon King, is this the universe you’re in?”<br/><br/>When the two women arrived at the Dragon Palace, they looked around in shock.<br/><br/>The current Dragon Palace had too many powerful treasures and resources.<br/><br/>All these treasures were gathered here in the Dragon Palace, causing the energy in the surroundings to be abnormally majestic and terrifying.<br/><br/>Even though they were in the Tianyuan blessed realm, they were still extremely shocked.<br/><br/>These resources, even if they were to gather all the resources in their universe, weren’t they just so-so?<br/><br/>“Yes!”<br/><br/>Wang Xian nodded and called Prime Minister Gui over.<br/><br/>“Prime Minister Gui, prepare a residence for the two of them later.”<br/><br/>Wang Xian instructed Prime Minister gui before asking, “Where are the king of Void and the others?”<br/><br/>“Dragon King, according to your instructions, the king of Void has entered the space of the primal chaos stone to recover his strength. His five subordinates have been arranged to recover at the side.”<br/><br/>“We have taken out some resources so that their strength is almost restored to its peak.”<br/><br/>Prime Minister GUI reported.<br/><br/>Wang Xian nodded.<br/><br/>The king of Void was completely subdued by him and allowed him to enter the space of the primal chaos stone to cultivate.<br/><br/>As for his subordinates, Wang Xian did not allow them to enter the space to cultivate.<br/><br/>After all, the primal chaos stone was such a precious treasure. Wang Xian would not let him know about someone whom he could not trust 100% .<br/><br/>“An lie, go to the six paths universe and call Tianci over. Tell him to prepare for a big battle.”<br/><br/>Wang Xian looked at an lie who was beside him and instructed him. Then, he continued to look at Prime Minister Gui. “Call all the experts of the Dragon Palace over. Tell the other disciples to prepare for the battle as well.”<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded. His eyes were glowing with a fiery glow.<br/><br/>The experts and disciples of the Dragon Palace had been preparing for the big battle in the belief universe.<br/><br/>“All of you wait here.”<br/><br/>Wang Xian instructed the two women from the Gaza universe before teleporting to the Primal Chaos Stone.<br/><br/>In the space of the primal chaos stone, he could sense that the king of Void was recovering his strength.<br/><br/>At the moment, his strength had yet to recover to the level of the Great Dao.<br/><br/>After all, he had been killed by Wang Xian consecutively and suffered a lot of damage.<br/><br/>Although Wang Xian had already given him his corpse, it would still take some time for him to fully recover.<br/><br/>However, he was about to recover to his peak.<br/><br/>After all, in the space of the primal Chaos Stone, the time ratio was different!<br/><br/>“King of Void, bring your subordinates to the Dragon King’s Palace.”<br/><br/>Wang Xian spoke to the king of Void inside!<br/><br/>“HMM?”<br/><br/>The King of Void opened his eyes immediately when he heard Wang Xian’s voice. Then, he replied respectfully, “It’s the Dragon King!”<br/><br/>“How long will it take for you to return to Your Peak?”<br/><br/>Wang Xian looked at him and asked.<br/><br/>“Dragon King, you should be able to return to your peak after cultivating in this space for about a million years!”<br/><br/>The King of Void spoke!<br/><br/>“Alright!”<br/><br/>Wang Xian nodded.<br/><br/>“Dragon King, all the experts from the Dragon Palace have arrived!”<br/><br/>At this moment, Prime Minister Gui’s report came over.<br/><br/>Wang Xian gestured to the king of Void and then came to the Dragon King’s Hall!<br/><br/>The king of void immediately brought his subordinates to the Dragon King’s Hall!<br/><br/>Sitting on the dragon throne in the Dragon King’s Hall, Wang Xian swept his gaze down.<br/><br/>“Greetings, Dragon King!”<br/><br/>In the Dragon King’s palace, Lan Qingyue, Xiao Lan, and the rest of the twenty-one experts from the Dragon Palace had arrived.<br/><br/>At the side, the king of Void led his five subordinates and bowed respectfully.<br/><br/>At this moment, the five subordinates of the King of Void had mixed feelings in their hearts.<br/><br/>Back then, they could even suppress the entire nine-origin universe.<br/><br/>But now, they had submitted to the Dragon King’s underlings.<br/><br/>However, their boss had submitted, and with the Dragon King’s terrifying strength, he had the ability to kill them completely.<br/><br/>So Be it.<br/><br/>At least, it would be safer to follow a chaos-level powerhouse in the future, right?<br/><br/>They comforted themselves in their hearts.<br/><br/>The five of them were very loyal to the void King. If their king submitted, they would submit as well.<br/><br/>At this moment, the two women from the Gaza universe were the most shocked.<br/><br/>They sensed the powerful existences around them, and their faces were filled with shock.<br/><br/>The powerhouses from the Dragon Palace did not hide their strength.<br/><br/>They could sense that there were at least one or two great dao-level existences present.<br/><br/>However, a great dao-level powerhouse was also worshipping the Dragon King?<br/><br/>This? ? ?<br/><br/>What realm was this Dragon King at?<br/><br/>Sensing the surrounding powerhouses, perhaps they really had the strength to fight against the belief universe.<br/><br/>“HMM, other than Qing Yue and Xiao Lan, they are all here.”<br/><br/>Wang Xian nodded his head in satisfaction and looked at them. “You all know what happened this time. The next target of our Dragon Palace, the belief universe, will take action ten thousand years later.”<br/><br/>“I have investigated the strength of the belief universe. There are a total of 27 heaven origin creation stage powerhouses and three Great Dao level existences. On our side, including the two helpers from the Gaza universe, the king of Void and the rest have a total of 36 heaven origin creation stage powerhouses.”<br/><br/>“This is a huge battle!”\t\t\t\t\t\t</div>", "images": {}, "success": true}