{"id": 1409, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075386.html", "title": "Chapter 4412 - Chapter 4412: 4411 Combined Faith", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4412 - Chapter 4412: 4411 Combined Faith</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4412: 4411 combined faith<br/><br/>“Follow my heart and spirit and infuse the power of faith!”<br/><br/>The palace master of Shenyi stared at the experts of the Dragon Palace in front of him with a cold expression. He stared at Wang Xian and the rest.<br/><br/>He roared loudly.<br/><br/>Following that, the huge shadow that was surrounding them slowly raised its arm.<br/><br/>A long spear appeared on the palm of the shadow.<br/><br/>The long spear stabbed directly at Wang Xian’s location.<br/><br/>“Dong!”<br/><br/>A muffled sound was heard.<br/><br/>The long spear carried a terrifying energy as it pointed towards Wang Xian.<br/><br/>The entire space emitted a muffled sound.<br/><br/>Wang Xian raised his eyebrows slightly when he saw that they had started to counterattack.<br/><br/>“Be careful!”<br/><br/>He reminded them. Following that, his golden pupils emitted a golden glow as he charged towards them.<br/><br/>“Boom!”<br/><br/>The sound of collision rang out.<br/><br/>However, what surprised Wang Xian was that the Golden Ray was directly devoured by their attack.<br/><br/>That powerful energy was still attacking him!<br/><br/>When Wang Xian saw this scene, his eyes narrowed slightly and he immediately dodged to the side!<br/><br/>The terrifying energy spear pierced through the void and disappeared into the starry sky.<br/><br/>This move was extremely powerful.<br/><br/>It was extremely terrifying.<br/><br/>The destructive power far surpassed Wang Xian’s full-strength attack!<br/><br/>Even Wang Xian couldn’t withstand this attack.<br/><br/>However, their attacks had a huge flaw.<br/><br/>That was, their attacks were very clumsy.<br/><br/>It was very easy to dodge.<br/><br/>Even those at the control level could dodge their attacks.<br/><br/>“What they are cultivating is the power of faith. It’s easy for them to fuse all their powers together. The power that they can unleash is very powerful!”<br/><br/>“I still need to pay attention to it. As they continue to fuse, their proficiency will increase by a lot. On the other hand, the Dragon Palace can’t do what they are doing.”<br/><br/>Wang Xian looked at the attacks of the kings of the Gods of faith and thought to himself!<br/><br/>Buzz<br/><br/>His body trembled slightly as the body of the Void Dragon flew out from his body.<br/><br/>Following that, the body of the Void Dragon took the void disk and the Void Dragon Pool and flew into the distance.<br/><br/>The Void Dragon, the ultimate treasure of Tianyuan, and the Void Dragon Pool.<br/><br/>Their combat strength was already close to the level of Great Dao.<br/><br/>Two mastery levels and two beginner levels!<br/><br/>Now that the king of all gods who believed in the universe had merged his belief into one, it was extremely difficult for him to break through the defense and attacks unleashed by him.<br/><br/>In that case, he had to destroy their people quickly in order to reduce their strength.<br/><br/>Wang Xian separated the body of the Void Divine Dragon and went to hunt down the gods who believed in the 24 temples of the universe.<br/><br/>Buzz<br/><br/>He took out the communication stone plate and contacted an lie with the body of the Void Divine Dragon, asking him to teleport over.<br/><br/>During these tens of thousands of years, Wang Xian had a comprehensive understanding of the belief universe.<br/><br/>The location of the twenty-four palaces and the teleportation formation there were all in Wang Xian’s mind.<br/><br/>Furthermore, Wang Xian had set up a large number of devil spirit altars in the belief universe.<br/><br/>There were hundreds of devil spirit altars.<br/><br/>Now, Prime Minister Gui had led the disciples of the Dragon Palace to hunt down the gods in the belief universe.<br/><br/>However, their speed might be too slow.<br/><br/>Wang Xian was prepared to take action personally.<br/><br/>Buzz<br/><br/>Under the lead of an lie, Wang Xian arrived in front of a palace very quickly.<br/><br/>He looked in front of him.<br/><br/>This was the Foshan Palace. It was one of the more powerful palaces among the 24 palaces in the belief universe.<br/><br/>The head of the Foshan Palace was one of the four powerhouses who had mingled with Ao Cangtian and the rest.<br/><br/>At this moment, all the gods in the Buddha Mountain Palace were quickly gathering.<br/><br/>The Buddha Mountain Palace was very far away from the one God Palace.<br/><br/>However, even from such a great distance, one could still see the terrifying might coming from the one God Palace.<br/><br/>That’s right!<br/><br/>Even if they were here, they could clearly sense the battle between more than 60 heaven origin creation realm experts.<br/><br/>That destructive energy caused all the gods and disciples in the belief universe to be filled with shock!<br/><br/>“Quick, quick, gather all the gods and head to the Divine One Palace!”<br/><br/>“A powerful enemy has invaded our belief universe. Right now, our supreme gods are desperately resisting. Our Lord has ordered us to head to the Divine One Palace!”<br/><br/>“Just what kind of enemy dares to invade our belief universe? My God, the power coming from the divine one palace is so terrifying. If we go there, won’t we be instantly killed?”<br/><br/>“We will go to a secret realm of the first God Palace. The supreme gods will naturally have plans for us there!”<br/><br/>The gods spoke one after another, their faces filled with shock.<br/><br/>They believed that the universe was so strong that they had always been the ones invading other universes.<br/><br/>Now, they were actually attacked.<br/><br/>This made them feel incredulous.<br/><br/>How strong were the enemies exactly?<br/><br/>“Are they all gathering together? Perfect Timing!”<br/><br/>Wang Xian looked at the gods in the Foshan Palace and smiled.<br/><br/>He teleported continuously and arrived at the center of the gods!<br/><br/>Buzz<br/><br/>The disk of nothingness floated directly in the sky. Numerous spatial blades attacked the hundreds of thousands of gods!<br/><br/>“PFFT! PFFT! PFFT!”<br/><br/>“PFFT PFFT PFFT PFFT PFFT!”<br/><br/>The sudden attack made the gods unable to react in time.<br/><br/>The space blades killed all the gods one by one.<br/><br/>Under the terrifying speed, they didn’t even have time to scream!<br/><br/>“Buzz!”<br/><br/>Wang Xian looked at the large number of corpses around him. With a wave of his arm, he kept all of them.<br/><br/>“Go to an Lie’s palace.”<br/><br/>Wang Xian teleported to an Lie’s side and instructed.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded immediately.<br/><br/>At the same time, on the battlefield beside the god’s palace.<br/><br/>Twenty-six kings of the gods gathered together.<br/><br/>An extremely huge giant formed from the power of faith enveloped them.<br/><br/>The huge giant of faith was fighting against Wang Xian and the rest.<br/><br/>They were not at a disadvantage when facing the experts from the Dragon Palace who were far stronger than them.<br/><br/>However, at this moment, the expression of a king of the gods suddenly changed.<br/><br/>“This is bad. The believers of our Foshan Palace have been killed. Hundreds of thousands of believers of the gods have been killed!”<br/><br/>He cried out involuntarily.<br/><br/>The power of faith in his body was draining rapidly.<br/><br/>Their strength relied on the support of a large number of believers. If the believers died, their strength would naturally drop!<br/><br/>In just a few seconds, his strength at the control level had dropped to the beginner level.<br/><br/>The reason why he was able to remain at the beginner level was because of the heart of faith.<br/><br/>The heart of faith was equivalent to a refined treasure. If their realm dropped, the quality of the heart of faith would not drop.<br/><br/>Without the heart of faith, his current realm would be reduced to below the Heaven’s origin realm.<br/><br/>This initial entry was equivalent to the weakest one.<br/><br/>There was some fear on his face.<br/><br/>Too many believers had been killed.<br/><br/>It was impossible to recover from such a decrease in realm<br/><br/>“What?”<br/><br/>The kings of the gods around them were shocked.<br/><br/>There were powerhouses from the dragon palace slaughtering their disciples.\t\t\t\t\t\t</div>", "images": {}, "success": true}