{"id": 1400, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075341.html", "title": "Chapter 4403 - Chapter 4403: Before The Battle Of 4402", "volume": 14, "volume_title": "Volume 14", "body": "<h1>Chapter 4403 - Chapter 4403: Before The Battle Of 4402</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4403: Before the Battle of 4402<br/><br/>The complete death of Ao Cangtian caused the last bit of arrogance in the king of Void to completely dissipate.<br/><br/>Ao Cangtian’s strength was about the same as his, but now it had completely dissipated.<br/><br/>At least he was still alive.<br/><br/>Moreover, the Dragon King gave the corpse to him, so that he could quickly recover to the Great Dao level.<br/><br/>Not to mention other things, he would still be the king of the Void Universe in the future.<br/><br/>He was just below one person and above tens of thousands of others.<br/><br/>It was acceptable.<br/><br/>“Dragon King, Can I go back now?”<br/><br/>Prophet Hong looked at Wang Xian and asked.<br/><br/>“Sure. I hope that the next time we meet, it won’t be like this.”<br/><br/>Wang Xian nodded his head faintly and said to prophet Hong.<br/><br/>“I Will!”<br/><br/>Prophet Hong cupped his hands and left with his grandson.<br/><br/>“You should go back too. Gather your subordinates first. Then, come to the nine-origin universe to look for me alone.”<br/><br/>Wang Xian instructed the king of Void.<br/><br/>“It’s the Dragon King!”<br/><br/>The king of void nodded and left.<br/><br/>“Next, it’s time to believe in the universe.”<br/><br/>Wang Xian mumbled. After getting rid of the problem of Ao Cangtian and the king of Void, especially after subduing the king of Void, everything became much simpler.<br/><br/>After the king of Void dealt with the matters under him, Wang Xian would allow him to recover his strength to the Great Dao level within the primal chaos stone.<br/><br/>At that time, he could start a war!<br/><br/>With Mo Sha and the King of Void, the two of them would be able to fight against the two Great Dao level kings of the gods in the belief universe.<br/><br/>He would be able to kill them with ease.<br/><br/>“Before I make my move, I should make a trip to the belief universe in person. I need to understand everything first.”<br/><br/>Wang Xian thought to himself.<br/><br/>After all, the belief universe occupied three powerful universes.<br/><br/>Since he wanted to destroy them, he had to be fully prepared.<br/><br/>With this thought in mind, he moved and flew rapidly towards the direction of the belief universe.<br/><br/>While Wang Xian was heading towards the belief universe.<br/><br/>He was located in the main universe of the belief universe.<br/><br/>In an extremely huge temple in the sky.<br/><br/>There were 27 seats in this temple. On each seat, there was a vast figure.<br/><br/>As they sat on it, the illusory image of hundreds of millions of believers appeared behind them, making them look holy and majestic.<br/><br/>“It’s settled then. The four palaces of Foshan Palace’s New World Palace have provoked the Dragon King. Take out a portion of the believers and raise the sacred king of all gods of the sacred sacred palace to the Great Dao level.”<br/><br/>“The king of all gods of the sacred palace will have to fulfill some of his foster father’s duties. If the Dragon King comes to invade us, the two seniors from the God Palace and the king of all gods of the sacred palace will be enough to resist him.”<br/><br/>In the palace, an old man opened his mouth and said faintly!<br/><br/>“Yes, the current situation of the Dragon Palace is that there are at most twenty heaven origin blessed realm existences. With our strength, we can resist him. It’s very likely that the Dragon King will not invade us.”<br/><br/>“Invading us is an irrational act, and it will also bring disaster to them.”<br/><br/>The two kings of the gods also spoke faintly.<br/><br/>“No matter what, once there is a special situation, all the experts will gather on the main universe’s side.”<br/><br/>The kings of the gods discussed and discussed.<br/><br/>There was not much panic on their faces.<br/><br/>They were not in the Cang Heaven universe, nor were they in the Void Universe. They were powerful enough.<br/><br/>“If the Dragon King of the Dragon Palace dares to invade our belief universe, we will make him pay the price.”<br/><br/>The king of the gods, Shengtianyang, said with a face full of killing intent.<br/><br/>Shengtianyang, they had several disputes with the Dragon King in the starry universe.<br/><br/>In the end, they suffered a great loss at the hands of the Dragon King.<br/><br/>“This is a universe occupied by the belief universe. It used to be called the Gaza universe.”<br/><br/>A few hundred years later, Wang Xian came to the front of a universe and looked inside.<br/><br/>The Gaza universe was a universe that had just been occupied by the belief universe God Palace.<br/><br/>Wang Xian entered this universe and flew towards the interior of the universe.<br/><br/>A few years later, he came to a planet.<br/><br/>When he saw this planet, he was shocked by the scenes on the planet!<br/><br/>On the planet, all the living beings were dressed in white. They were kneeling in front of the idols and praying continuously.<br/><br/>There were also some living beings who were sitting cross-legged in front of the idols.<br/><br/>Waves of power of faith entered their bodies into the idols!<br/><br/>When Wang Xian saw this scene, he was filled with astonishment.<br/><br/>He hovered there and watched quietly.<br/><br/>For a few months, apart from their basic life, these creatures spent the rest of their time cultivating and praying.<br/><br/>Waves of power of faith were transmitted into the idol!<br/><br/>Their expressions were numb like machines.<br/><br/>When Wang Xian found a relatively strong creature on this planet, he immediately used his soul-absorbing power.<br/><br/>Following that, all the information about this creature appeared in his mind.<br/><br/>“These people have all been brainwashed. They have given everything they have to that so-called god.”<br/><br/>“They have lost all the rest of their family ties. God is everything to them.”<br/><br/>Wang Xian mumbled.<br/><br/>This kind of control was a little terrifying.<br/><br/>It was comparable to a massacre.<br/><br/>He took a deep look at this planet and continued flying towards the interior of the universe.<br/><br/>When he arrived at the other planets, it was still the same situation.<br/><br/>“This kind of mind control is also very terrifying.”<br/><br/>Wang Xian thought to himself. It was comparable to the actions of some powerhouses in the evil sequence universe.<br/><br/>Buzz Buzz<br/><br/>Just as Wang Xian was surveying this planet and heading towards another universe occupied by the belief universe, he suddenly received a message.<br/><br/>The message was sent by prophet Hong.<br/><br/>When he received this message, he raised his eyebrows slightly.<br/><br/>The message sent by prophet Hong was that there was a heavenly Yuan creator from the Gaza universe who came to ask him to divine the future of the Gaza universe.<br/><br/>Divination, how to save the Gaza universe.<br/><br/>This was a very interesting thing.<br/><br/>After prophet Hong received this message, he immediately sent it to Wang Xian.<br/><br/>This was because the Gaza universe was currently occupied by the belief universe, and the Dragon King was currently planning to use the belief universe.<br/><br/>Prophet Hong felt that he could inform the Dragon King.<br/><br/>After witnessing the terrifying strength of the Dragon King, Prophet Hong felt that it was beneficial to befriend him.<br/><br/>“Let them wait for my information in the land of origin!”<br/><br/>Wang Xian replied to prophet Hong.<br/><br/>“Prophet Hong, please inform us if there is still hope for our Gaza Universe!”<br/><br/>At the same time, in the land of origin, two women who looked almost identical stood in prophet Hong’s courtyard. They looked at prophet Hong with a sorrowful expression and couldn’t help but ask again.<br/><br/>“Let me tell you a piece of good news. Coincidentally, your Gaza universe has a chance of survival. However, I can’t tell you about this. I told that person and he told you to wait in the land of origin.”<br/><br/>Prophet Hong looked at them and said.<br/><br/>“HM?”<br/><br/>The two women were slightly stunned, and their faces were full of astonishment.\t\t\t\t\t\t</div>", "images": {}, "success": true}