{"id": 1401, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075346.html", "title": "Chapter 4404 - Chapter 4404: 4403 Believed In The Specific Strength Of The Universe", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4404 - Chapter 4404: 4403 Believed In The Specific Strength Of The Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4404: 4403 believed in the specific strength of the universe<br/><br/>“Prophet Hong, what is it? What Chance Does Our Gaza universe have to survive?”<br/><br/>The two women looked at prophet Hong with surprise and surprise, their eyes filled with anticipation.<br/><br/>“I can’t tell you the details.”<br/><br/>Prophet Hong shook his head. “You can wait in the land of origin for now, that person has already replied to my message!”<br/><br/>“Prophet Hong, this…”<br/><br/>The two women opened their mouths, wanting to ask more questions.<br/><br/>“As long as you discuss with that person, you can save your people.”<br/><br/>Prophet Hong said, “I can’t say anything else!”<br/><br/>“It’s prophet Hong. Thank you, Prophet Hong.”<br/><br/>The two women nodded and looked at each other. After taking out the reward, they left.<br/><br/>Wang Xian came to the second universe of the belief universe and took a stroll there.<br/><br/>“There are no powerhouses in the Heaven’s origin manifestation in the entire universe. It’s possible that they are all in the main universe and gathered in the main universe. What are they doing? Is it to prevent me from invading?”<br/><br/>Wang Xian smiled.<br/><br/>Then, he flew towards the main universe of the belief universe.<br/><br/>A thousand years later, Wang Xian arrived at the main universe of the belief universe.<br/><br/>After entering the main universe, Wang Xian concealed his aura.<br/><br/>“The power of chaos turns everything into chaos. Can the power of chaos imitate the power of belief? No, it’s not an imitation. Can it be converted into the power of belief?”<br/><br/>Wang Xian mumbled and used the power of chaos to analyze the power of belief.<br/><br/>However, after his research, he was able to convert it.<br/><br/>The power of faith was a very special type of energy.<br/><br/>It was different from metal, wood, water, fire, and so on. They had a strong power of faith and a strong soul power.<br/><br/>The soul essence of all living beings in the universe was the same. There were very few universes that specialized in cultivating the soul.<br/><br/>Even for the Netherworld race, they mainly used the darkness attribute and the soul as support.<br/><br/>This was because the attack power of the soul was much weaker.<br/><br/>On the other hand, the power of faith could be understood as a special type of soul power.<br/><br/>The power of chaos contained all the energy, so it naturally contained the power of the soul.<br/><br/>Under the cover of the power of Chaos, the power of faith emanated from Wang Xian’s body.<br/><br/>“It really works. Can it be converted into the power of divination? If I were to completely fuse with the primal Chaos Stone, would I be able to control the power of chaos and convert it into any kind of power?”<br/><br/>“Or could it be that my attacks contain all kinds of energy? Life, death, mystery, and other effects?”<br/><br/>Wang Xian’s eyes were sparkling.<br/><br/>He sensed the fusion between himself and the primal chaos stone. 13% and 77% needed to be fused.<br/><br/>The speed of the fusion was too fast!<br/><br/>The last time, he only managed to fuse 10% rapidly due to his breakthrough.<br/><br/>If he could not achieve another breakthrough, it would take him at least tens of billions of years to fuse with it!<br/><br/>He thought to himself.<br/><br/>However, there was nothing he could do about it.<br/><br/>It was too difficult for Wang Xian to achieve a breakthrough now.<br/><br/>This was equivalent to his main body of nine attributes breaking through to the Heaven’s origin blessed realm.<br/><br/>“Perhaps I don’t need to use nine attributes to achieve a breakthrough. If I can fuse the spatial attribute into my main body, I might be able to achieve a breakthrough as well.”<br/><br/>Wang Xian was thinking. He could no longer achieve a breakthrough after devouring the resources.<br/><br/>The next breakthrough required him to think, comprehend and find his own path.<br/><br/>The difficulty had undoubtedly increased by a lot.<br/><br/>However, Wang Xian did not think too much at this moment.<br/><br/>He flew towards the center rapidly with the strength of the gods in the universe.<br/><br/>In the next ten thousand years, Wang Xian was searching for all kinds of information.<br/><br/>After ten thousand years, Wang Xian went through the entire belief universe.<br/><br/>He also went through all the 24 palaces.<br/><br/>He had a comprehensive understanding of the strength of the belief universe.<br/><br/>It was stronger than he had imagined.<br/><br/>Because according to his investigation, there were not two but three great dao existences in the belief universe.<br/><br/>This was something he didn’t know before.<br/><br/>Even the gods in the belief universe didn’t know that there were three Great Dao existences in their universe.<br/><br/>On the surface, there were only two.<br/><br/>In addition, there were eight Great Dao experts in the belief universe.<br/><br/>This wasn’t a small number.<br/><br/>Because the Dragon Palace only had six combat strength in the control level.<br/><br/>The belief universe had two more than the Dragon Palace!<br/><br/>As for the number of beginner-level fighters in the belief universe, it was sixteen.<br/><br/>There were twenty-seven heavenly yuan creator-level fighters in total.<br/><br/>This number was right.<br/><br/>“They are very powerful, but the good thing is that after the king of Void submitted, two of his five subordinates are still alive, which can make up for the gap between the master-level fighters<br/><br/>“In addition, I can behead them before they have time to react. This battle can be fought!”<br/><br/>Wang Xian assessed the strength of both parties.<br/><br/>In terms of the number of Heaven’s origin blessed realm, the Dragon Palace could reach 33.<br/><br/>When the time came, he could call for Tianci and reach 34.<br/><br/>34 versus 27.<br/><br/>They had the advantage in numbers.<br/><br/>The most important thing was that he was there.<br/><br/>Wang Xian pondered in his heart. Soon after, he recalled what prophet Hong had mentioned.<br/><br/>He summoned an lie over and instantly arrived at the land of origin.<br/><br/>After sending a message to prophet Hong, he received a reply from prophet Hong very quickly.<br/><br/>Not long after, when he arrived at Prophet Hong’s residence, he sensed that there were two powerhouses inside.<br/><br/>However, he was slightly disappointed after sensing a little!<br/><br/>“Dragon King!”<br/><br/>Seeing that Wang Xian had arrived, prophet Hong cupped his hands at Wang Xian.<br/><br/>“Okay.”<br/><br/>Wang Xian nodded his head and looked at the two women.<br/><br/>At this moment, the two women were sizing up Wang Xian as well.<br/><br/>The two women were existences at the Heaven’s origin creation level. Naturally, their looks were impeccable. There was also an air of superiority about them.<br/><br/>In addition, their looks were similar. They should be sisters, which added to their charm.<br/><br/>At this moment, the two of them were also filled with curiosity.<br/><br/>“You are the powerhouses of the Gaza Universe? Your strength is a little weak. Is there only the two of you in the Gaza universe now?”<br/><br/>Wang Xian asked the two women.<br/><br/>“Our father and elders were completely wiped out by the powerhouses who believed in the universe. We only managed to escape with the help of our father and elders. I heard from prophet Hong that you can help us return to the Gaza universe and help us save the Disciples of our Universe?”<br/><br/>A woman said with a sorrowful and expectant look on her face.<br/><br/>“I am prepared to make a move against the belief universe. Although you are not strong, you can join us. However, after I destroy the Gaza universe, I will take away all the treasures and resources of the Gaza universe. In addition, I will also take the quota for the Gaza universe. You have to understand this.”<br/><br/>Wang Xian looked at them and said directly.<br/><br/>“What? You want to take action against the belief universe?”<br/><br/>When the two women heard Wang Xian’s words, they were shocked.<br/><br/>The Gaza universe had a deep understanding of the strength of the belief universe.<br/><br/>Just the power of a palace had destroyed them.\t\t\t\t\t\t</div>", "images": {}, "success": true}