{"id": 1406, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075371.html", "title": "Chapter 4409 - Chapter 4409: Under 4408’S Full-Scale Invasion", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4409 - Chapter 4409: Under 4408’S Full-Scale Invasion</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4409: Under 4408’s full-scale invasion<br/><br/>“Senior God one, what’s the current situation?”<br/><br/>When the kings of the gods who believed in the universe saw the arrival of two Great Dao existences from God One Palace, they hurriedly asked.<br/><br/>The gods who believed in the universe also had solemn expressions.<br/><br/>“That Dragon King is very powerful. We were all ambushed by him and couldn’t resist at all. I had a true treasure to escape, but Hong Tian was killed. Fortunately, I had a true treasure to recover!”<br/><br/>The Great Dao realm expert who was called Senior God one replied with a dark face.<br/><br/>“Senior God One, you were also ambushed by that Dragon King? You couldn’t fight back?”<br/><br/>His words shocked the surrounding kings of all gods.<br/><br/>“His strength is very terrifying. In a one-on-one situation, I didn’t have the strength to fight back at all. I was also killed instantly.”<br/><br/>The Sacred Palace’s sacred king of all gods said from the side.<br/><br/>“What? Sacred Palace Master was also killed by that Dragon King? This? ?”<br/><br/>“This Dragon Palace’s attack was definitely premeditated. It was definitely planned. He directly attacked more than a dozen of our palaces and wantonly ambushed us. How did they do it?”<br/><br/>“That Dragon Palace’s Dragon King is a primal chaos level existence. He might have powerful treasures that we don’t know about and could bring his subordinates here.”<br/><br/>Around them, the 24 palace masters and the Kings of the gods in the belief universe said in shock and anger!<br/><br/>“What we need to do now is to fight back.”<br/><br/>The Sacred Palace master said with a cold face!<br/><br/>However, just as he finished speaking, his expression suddenly changed.<br/><br/>“Not good!”<br/><br/>He suddenly cried out in surprise, and a trace of panic appeared on his face. “My strength is going to decrease. My strength is going to decrease. That Dragon Palace Dragon King is crazily slaughtering the gods of my sacred palace.”<br/><br/>There was a trace of fear in the Sacred Palace Master’s voice.<br/><br/>Their strength came from the beliefs of their believers. However, once a large number of believers died, their strength would naturally decrease.<br/><br/>Now, the Sacred Palace Master felt that his realm was loosening.<br/><br/>He felt that his strength was going to fall to the control level?<br/><br/>“What?”<br/><br/>His words caused all the kings of the gods to be slightly shocked.<br/><br/>“Not good, my strength has decreased. My strength has also decreased. The Gods of our decree palace have been massacred. I have now fallen from the control level to the beginner level. If I let them continue to kill like this, my strength will become lower and lower!”<br/><br/>At this moment, the decree palace master at the side suddenly cried out involuntarily.<br/><br/>His face was filled with fear.<br/><br/>“No, we must retaliate. Our strength comes from our believers. If our believers are killed, our realm will drop. We must stop the Dragon Palace and the others.”<br/><br/>A palace master who believed in the universe said with a grave expression.<br/><br/>The expressions of God One Palace master and the others changed slightly.<br/><br/>“Retaliate. Immediately retaliate.”<br/><br/>The Divine One Palace master waved his arm, and a picture appeared in front of everyone.<br/><br/>In the picture was the position of more than 30 experts of the Dragon Palace.<br/><br/>“We’ll use the teleportation array to rush over one by one and destroy them!”<br/><br/>At this moment, the divine one palace master sensed that his realm had decreased, and he said with a ferocious expression.<br/><br/>He had just broken through to the Great Dao realm not long ago, and now his realm had decreased.<br/><br/>This made him extremely angry, and his heart was filled with a fierce killing intent.<br/><br/>“Wait, look, they are rushing toward us.”<br/><br/>At this moment, the light spots representing the heavenly yuan creation realm experts were rapidly gathering in the picture.<br/><br/>Finally, they appeared not far away from them!<br/><br/>“All the experts of the Dragon Palace are coming. They can lock onto our position.”<br/><br/>One of the kings of the gods narrowed his eyes and said!<br/><br/>“Damn it, they dare to attack us?”<br/><br/>One of the Kings of the gods roared angrily!<br/><br/>“I was killed by the king of the Void. That king of the Void is now on the same side as the Dragon King!”<br/><br/>At this time, a control-level king of the gods said with a solemn face.<br/><br/>“What? Isn’t the Void universe the mortal enemy of the nine-origin Universe? Moreover, the nine-origin universe has invaded the Void Universe, and the Void King has been killed by the Dragon King and the others several times. How can they be in cahoots now?”<br/><br/>“It should be that the void King has been subdued by the Dragon King. Oh No, there are two great dao existences in the Dragon Palace now, and the strength of the sacred palace master has decreased again.”<br/><br/>“It’s over. Our strength has fallen to the peak of the Pantheon realm. Oh No!”<br/><br/>“My strength has also decreased. I used to be comparable to the old king of Pantheon, but now I’m almost the same as when I just broke through!”<br/><br/>“What should we do now? Are We still their match?”<br/><br/>In the Hall of the void crack, the scene instantly became chaotic.<br/><br/>The gods who believed in the universe showed a hint of panic on their faces.<br/><br/>The Void King of the Void Universe and the Dragon King were in cahoots.<br/><br/>Now, the strength of the palace masters of the 24 palaces had decreased.<br/><br/>One of them had even fallen to the realm of the gods.<br/><br/>This? ? ?<br/><br/>Under this situation, they were at a disadvantage.<br/><br/>“Everyone shut up and get ready to fight. We still have 26 kings of the gods here. If we join hands to defend, we can still hold them off.”<br/><br/>“In addition, have all your subordinates gather at the one God Palace’s side. It shouldn’t be a problem for us to hold them off with all our strength.”<br/><br/>When the one God Palace master saw this situation, his gaze focused as he shouted loudly!<br/><br/>“Yes!”<br/><br/>All the kings of the gods were slightly stunned before they immediately nodded.<br/><br/>This wasn’t the time to panic.<br/><br/>They were still very powerful.<br/><br/>Even if the Dragon Palace was very powerful, as long as they joined forces, it wasn’t impossible for them to resist!<br/><br/>“They’re almost here. Go Out and face the enemy!”<br/><br/>Palace Master Shenyi looked at the information on the array and waved his arm.<br/><br/>Their enormous palace appeared in reality!<br/><br/>“Fight! So what if they’re at the Primal Chaos Realm? We have so many experts and we can totally resist them!”<br/><br/>“That’s right. If you want to kill us, you need at least five to six experts at the primal chaos level to attack together.”<br/><br/>The kings of the Pantheon clenched their fists tightly and looked forward!<br/><br/>Boom! Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>At this moment, at the position in front of them.<br/><br/>A group of Dragon Palace’s experts’disciples, led by Wang Xian, flew over quickly.<br/><br/>“Kekekekekeke, this is going to be a tough battle. We can have a good battle now!”<br/><br/>Mo Sha stared ahead.<br/><br/>Now, they could already see the position of the king of all gods in the universe.<br/><br/>They could already sense their existence!<br/><br/>“There are twenty-six heaven origin powerhouses. One of them is lacking in the aura of the Great Dao level and two of them are lacking in the aura of the control level. Hehe, it seems that killing their subordinates has a huge impact on their strength.”<br/><br/>Wang Xian stared ahead as he sensed their strength. His eyes flashed with a cold glint!\t\t\t\t\t\t</div>", "images": {}, "success": true}