{"id": 1404, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075361.html", "title": "Chapter 4407 - Chapter 4407: 4406 Invaded The Entire Area", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4407 - Chapter 4407: 4406 Invaded The Entire Area</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4407: 4406 invaded the entire area<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>The terrifying energy instantly covered the entire space of the God Palace.<br/><br/>The entire space was in a state of purgatory under the attack of Wang Xian.<br/><br/>Everything that had life was wiped out.<br/><br/>Under the charge of all kinds of energy, the gods died instantly.<br/><br/>The two dao level experts from the god one palace in the left and right great hall felt this destructive energy and revealed a trace of fear and despair on their faces!<br/><br/>A primal chaos level attack.<br/><br/>The Dragon King had really attacked!<br/><br/>This was something that they did not wish to see!<br/><br/>The energy landed on his defence and it quickly collapsed!<br/><br/>“He’s going to die!”<br/><br/>One of the Great Dao experts from the one God Palace roared in a low voice with an embarrassed expression!<br/><br/>The defense in front of him was easily broken!<br/><br/>His life force was rapidly increasing.<br/><br/>“Buzz!”<br/><br/>However, in another part of the one God Palace, another great dao expert’s body flickered slightly.<br/><br/>A door condensed from the power of faith appeared in front of him and blocked in front of him.<br/><br/>He immediately entered the door and dodged this fatal attack!<br/><br/>“One died, and the other dodged his own attack.”<br/><br/>Wang Xian sensed this scene and was not surprised at all.<br/><br/>Although he was attacking at close range now, it was very difficult for the other party to escape.<br/><br/>However, as a powerful force that occupied three universes, they would always have some powerful trump cards.<br/><br/>For example, they would be able to avoid treasures that were almost invincible.<br/><br/>They would be able to resist all attacks.<br/><br/>They would also have treasures that could revive them in an instant.<br/><br/>It was possible for such an expert to possess such treasures.<br/><br/>Buzz<br/><br/>Wang Xian’s body moved and flew in instantly.<br/><br/>He flew out immediately after collecting the Great Dao level corpse.<br/><br/>“Dragon King!”<br/><br/>At this moment, an lie rushed over.<br/><br/>Wang Xian nodded his head. They teleported and disappeared!<br/><br/>When they reappeared, they were on the planet where the Holy Palace was located!<br/><br/>The Holy Palace was not too far away from their location.<br/><br/>Wang Xian sensed the aura of the powerhouse in the Holy Palace. His body moved and he flew over immediately!<br/><br/>He didn’t chase after the powerhouse from the one God Palace.<br/><br/>He didn’t massacre anyone in the one God Palace either!<br/><br/>He immediately came to the Holy Palace.<br/><br/>He locked onto the aura and charged straight at it!<br/><br/>Beep! Beep! Beep<br/><br/>Beep! Beep! Beep<br/><br/>At the same time, a rapid and ear-piercing sound suddenly sounded in the Holy Palace!<br/><br/>It was the sound of an alarm.<br/><br/>This alarm would only sound when the Holy Palace was under a huge attack!<br/><br/>“That Dragon King has really invaded, damn it!”<br/><br/>Below the Sacred Palace, the king of Holy Pantheon looked at the light screen in front of him with an extremely ugly expression!<br/><br/>On this light screen, there were more than 30 black light spots.<br/><br/>“How did they suddenly attack the center of the belief universe? More than 30 heaven origin creation level powerhouses, we’re in Big Trouble, damn it, damn it!”<br/><br/>The king of Holy Pantheon was a little shocked and angry.<br/><br/>Because of the Dragon King of the Dragon Palace, the 24 palaces had made a lot of arrangements at the center of the belief universe.<br/><br/>Once a heaven origin creation level powerhouse got close to these arrangements, they would be able to detect it.<br/><br/>But now, more than 30 heaven origin creation level existences had suddenly appeared and entered their interior.<br/><br/>Only then did they realize it!<br/><br/>This made them both shocked and angry!<br/><br/>“Not good!”<br/><br/>However, at this moment, he felt a terrifying aura locking onto him!<br/><br/>This made his pupils slightly shrink.<br/><br/>“This is?”<br/><br/>A trace of cold sweat appeared on his forehead.<br/><br/>Ever since he broke through to the heaven origin blessed realm, this was the first time he felt an aura that made him tremble.<br/><br/>“Dragon King of the Dragon Palace!”<br/><br/>“Chaos Level!”<br/><br/>His pupils contracted slightly as he growled in a low voice!<br/><br/>“Roar!”<br/><br/>At this moment, Wang Xian rushed over.<br/><br/>When the king of the Holy Pantheon sensed Wang Xian rushing over, his expression changed drastically.<br/><br/>Without any hesitation, he immediately took out a treasure and wanted to escape.<br/><br/>Crack! Crack<br/><br/>However, in the next moment, a stream of energy landed on it and directly destroyed the treasure in front of him!<br/><br/>“Ignore the attack of space!”<br/><br/>The king of the Holy Pantheon’s heart sank as he growled in a low voice.<br/><br/>“Bang!”<br/><br/>At this moment, he saw a terrifying dragon claw heading towards him!<br/><br/>“All beings are invincible, transcending!”<br/><br/>The king of the Holy Pantheon waved his arm and a circle appeared above his head.<br/><br/>The Dragon Claw carried a terrifying energy as it passed through his body.<br/><br/>However, he wasn’t injured at all!<br/><br/>“Pierce!”<br/><br/>Between Wang Xian’s brows, the heaven’s origin golden eye emitted a blazing golden light as it attacked the king of the Holy Pantheon!<br/><br/>“What?”<br/><br/>The king of the Holy Pantheon sensed a terrifying energy coming in front of him and his expression changed drastically.<br/><br/>He was currently in a state of transcendence and was able to avoid all attacks.<br/><br/>Why were there still attacks that could lock onto him?<br/><br/>“The Ultimate Treasure of the Heaven’s origin!”<br/><br/>Looking at the golden eye between Wang Xian’s brows, the king of the Holy Pantheon looked extremely embarrassed.<br/><br/>Out of all the treasures, the ultimate treasure of the Heaven’s origin was the strongest.<br/><br/>With his powerful treasures and skills, he could be in the state of transcendence.<br/><br/>However, there were also powerful treasures that could restrain him.<br/><br/>Bam<br/><br/>The Heaven’s origin golden eyes penetrated his body and caused the king of all gods to die instantly!<br/><br/>Buzz<br/><br/>When Wang Xian saw that he was killed, he took out the divination lamp and began to perform divination immediately.<br/><br/>Wang Xian would not pursue the two great dao experts from the divine one palace.<br/><br/>However, he wanted to pursue and kill the experts from the Divine Sacred Palace!<br/><br/>“He’s revived. He’s not far away!”<br/><br/>Through the information obtained from the divination lamp, Wang Xian immediately charged towards a direction!<br/><br/>“D * mn it, this Dragon King’s strength is too terrifying. We have to gather together to be able to fight him!”<br/><br/>At this moment, the resurrected King of the Holy Pantheon roared with a face full of shock and anger.<br/><br/>The first thing he did was to take out a treasure and crush it instantly!<br/><br/>The next moment, his body disappeared!<br/><br/>“Huh?”<br/><br/>When Wang Xian rushed over, he raised his eyebrows slightly.<br/><br/>It seemed that they were prepared to escape.<br/><br/>“Are they gathered together? I wonder how many heaven origin creation realm powerhouses Mo Sha and the rest have killed.”<br/><br/>Wang Xian thought to himself.<br/><br/>When he made his move, all the powerhouses of the Dragon Palace were sent to the palaces of the 20 palaces in the belief universe by an lie and the rest.<br/><br/>The demonic void King and the others were sent to the two powerful palaces.<br/><br/>They chased after the control-level experts.<br/><br/>The other experts of the Dragon Palace were also sent to the palaces in groups of three or four.<br/><br/>They wanted to kill them.<br/><br/>The 35 Heavenly Yuan creation realm experts were divided into ten small teams and attacked the ten palaces.<br/><br/>What the Dragon Palace wanted to do was to quickly reduce the number of its members and believe in the strength of the universe.<br/><br/>At least half of their powerhouses of the Heaven’s origin realm would be killed.\t\t\t\t\t\t</div>", "images": {}, "success": true}