{"id": 1407, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075376.html", "title": "Chapter 4410 - Chapter 4410: 4409 Battle", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4410 - Chapter 4410: 4409 Battle</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4410: 4409 battle<br/><br/>“Buzz, Buzz, Buzz!”<br/><br/>In the void beside the god Palace.<br/><br/>Wang Xian led 35 heaven origin creator powerhouses to the front.<br/><br/>They floated there and stared at the kings of the gods who believed in the universe.<br/><br/>26 kings of the gods.<br/><br/>At this moment, they came out of the palace led by the God Palace’s God Palace Master and the rest.<br/><br/>They stared at Wang Xian and the rest. Their expressions were unsightly and filled with anger and hatred.<br/><br/>When Wang Xian saw them coming out, his face revealed a mocking expression.<br/><br/>Although the strength of the belief universe was very powerful, they had a fatal flaw.<br/><br/>That was, the improvement of their strength depended on the power of their belief. They relied on countless believers to increase their strength.<br/><br/>They could not be like the powerhouses of the Heaven’s origin manifestation in other universes. If they encountered a strong enemy, they could escape immediately.<br/><br/>Once they escaped, they had to bring their believers and their subordinates.<br/><br/>Otherwise, once their subordinates were killed, their realms would naturally decrease.<br/><br/>This was also the reason why Wang Xian and the rest did not escape when they chased after them.<br/><br/>That was because they could not escape.<br/><br/>Once they escaped, it would mean a crushing defeat.<br/><br/>“Dragon King of the Dragon Palace, I believe in the universe and have nothing against you. I asked you to lead your subordinates to kill our way here and slaughter our gods.”<br/><br/>Palace master Shen Yi stared at Wang Xian and said with a gloomy expression.<br/><br/>“Hehe, you should be clear about the grudges between us.”<br/><br/>Wang Xian looked at him and said with a smile.<br/><br/>“Just a little bit of grudges and you are allowed to invade our belief universe? Do you really think that our belief universe is so easy to bully?”<br/><br/>“Dragon King, if you guys leave now, we can pretend that nothing has happened in our belief universe.”<br/><br/>The Shen Yi Palace master said as he sized up Wang Xian and the rest with a sullen face!<br/><br/>He could sense the strength of the experts from the Dragon Palace and the Dragon King’s forceful killing of them.<br/><br/>This made the divine one palace master and the others very fearful.<br/><br/>They didn’t want to fight this battle if it wasn’t necessary.<br/><br/>“If you believe in the universe, how could our Gaza universe provoke you? You invaded our Gaza universe, massacred our family members, and killed our disciples. Now the Dragon Palace invaded you, and you say such words? You are really despicable and Shameless!”<br/><br/>The two women from the Gaza universe retorted angrily when they heard the words of the divine one palace master.<br/><br/>They had witnessed the powerful strength of the Dragon Palace.<br/><br/>Naturally, they hoped that the Dragon Palace would completely destroy them.<br/><br/>If that was the case, they would be able to return to the Gaza universe and save their people!<br/><br/>The words of the two women from the Gaza universe caused the faces of the kings of gods who believed in the universe to sink.<br/><br/>“If we really want to fight, we believe in the universe. We are not afraid of You!”<br/><br/>The Holy Palace master glanced at Wang Xian and the rest with a cold expression and growled in a low voice!<br/><br/>“Then let’s fight.”<br/><br/>Wang Xian stared at them and said indifferently!<br/><br/>“Hehehe, Kill, kill them all!”<br/><br/>Upon hearing Wang Xian’s order, Mo Sha roared with laughter.<br/><br/>Without any hesitation, he took the lead and charged at the kings of the gods who believed in the universe!<br/><br/>“Buzz!”<br/><br/>The void King followed closely behind!<br/><br/>“Kill, destroy them!”<br/><br/>“Kill!”<br/><br/>All the experts from the Dragon Palace had powerful killing intent in their eyes as they charged towards them!<br/><br/>“Fight, Defend!”<br/><br/>The expression of the first God Palace master changed drastically as he immediately roared loudly!<br/><br/>“Attack together, be careful of that Dragon King!”<br/><br/>The Great Dao elder beside the first God Palace Master also roared loudly with a solemn expression!<br/><br/>Buzz! Buzz! Buzz<br/><br/>They waved their arms and waves of powerful energy engulfed mo sha and the rest.<br/><br/>The twenty-six kings of the gods mobilized the power of faith in their bodies to form a terrifying attack.<br/><br/>Wang Xian stood there quietly as he watched the battle that had already erupted. His eyes flickered.<br/><br/>Currently, there were two dao-level existences in the belief universe.<br/><br/>There were eight people at the control level.<br/><br/>The rest were all at the beginner level.<br/><br/>On the Dragon Palace’s side, there were two people at the Great Dao level and nine people at the control level.<br/><br/>However, in the belief universe, the powerhouse at the control level was a powerhouse whose realm had fallen from the Great Dao level.<br/><br/>His current strength was equivalent to two existences at the control level.<br/><br/>Other than that, the Dragon Palace had ten more powerhouses at the Heavenly Yuan blessed realm than them.<br/><br/>Even though Wang Xian didn’t make a move, he still had nine more powerhouses.<br/><br/>Since he didn’t make a move, the Dragon Palace’s strength was slightly stronger than theirs.<br/><br/>In this battle, the Dragon Palace was already in an advantageous position.<br/><br/>Boom! Boom! Boom<br/><br/>At this moment, the sounds of collision could be heard from the front.<br/><br/>Wang Xian looked over.<br/><br/>The attacks of the powerhouses of the Dragon Palace and the attacks of the kings of the gods of the universe collided with each other in a terrifying manner.<br/><br/>The entire void shook violently.<br/><br/>This was the collision of more than 50 powerhouses of the Heaven’s origin realm.<br/><br/>Space was torn apart.<br/><br/>The energy fluctuations here even caused the nearby planets to be destroyed instantly.<br/><br/>This collision did not determine the victor!<br/><br/>“Lock onto your opponent and Attack!”<br/><br/>Mo Sha Stared at God One Palace Master and roared as he charged over!<br/><br/>The King of Void and the others also locked onto the kings of the gods and attacked.<br/><br/>“You’re courting death.”<br/><br/>God One Palace Master’s eyes were filled with killing intent. He waved his arm and a pagoda that was emitting light appeared in front of him.<br/><br/>The pagoda emitted light, and Light Phantoms and Faith Phantoms attacked Mo Sha!<br/><br/>The rest of the kings of the gods also went to meet the experts of the Dragon Palace.<br/><br/>However, although they were meeting the attacks of the experts of the Dragon Palace, they didn’t scatter. They remained in the same formation.<br/><br/>“Bang! Bang! Bang!”<br/><br/>Violent collisions sounded.<br/><br/>All kinds of energies were wreaking havoc!<br/><br/>Wang Xian swept his gaze across them one by one.<br/><br/>The palace master of the Shenyi Palace possessed a light-attributed ultimate treasure of the Heaven’s origin.<br/><br/>It was normal for a powerful universe like the belief universe to possess a ultimate treasure of the Heaven’s origin.<br/><br/>After all, the strength of this universe was too strong.<br/><br/>“HMM? There’s more than one.”<br/><br/>At this moment, Wang Xian sensed a king of belief who was at the control level. He also took out a heaven’s origin creation treasure.<br/><br/>This Heaven’s origin creation treasure was of the water attribute.<br/><br/>“Two Heaven’s origin creation treasures. Not Bad, not bad. The Heaven’s origin creation treasure that I can control now is already at its limit. However, it can bring great improvement to the powerhouses of the Dragon Palace.”<br/><br/>Wang Xian mumbled.<br/><br/>He took out the lamp of divination and immediately began to divine the weaknesses of the kings of the gods.<br/><br/>He divined the best timing and target of his attack!<br/><br/>Very soon, information was transmitted from the lamp of divination.<br/><br/>Wang Xian smiled and disappeared into the shadows!<br/><br/>“That Dragon King has disappeared. Be careful.”<br/><br/>Wang Xian, who had been on high alert since the beginning, immediately warned loudly when he saw Wang Xian disappearing!\t\t\t\t\t\t</div>", "images": {}, "success": true}