{"id": 1405, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075366.html", "title": "Chapter 4408 - Chapter 4408: 4407 Was In The Midst Of An All-Out Invasion", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4408 - Chapter 4408: 4407 Was In The Midst Of An All-Out Invasion</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4408: 4407 was in the midst of an all-out invasion<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>At this moment, at the center of the belief universe, a sudden war broke out!<br/><br/>Heavenly Palace, Heavenly Palace, Heavenly Palace, Decree Palace, nine stars Palace, Nether Heavenly Palace, Radiant Sun Palace, Amie Mountain Palace, and the rest of the palaces were suddenly subjected to a terrifying attack!<br/><br/>Not far away from the 24 palaces of the belief universe.<br/><br/>Suddenly, Heavenly Yuan creation realm powerhouses appeared.<br/><br/>After they appeared, they quickly attacked the Heavenly Yuan creation realm powerhouses in the palace.<br/><br/>Every initial heavenly yuan creation realm powerhouse would be attacked by at least four people of the same level.<br/><br/>A sudden attack.<br/><br/>A sudden attack.<br/><br/>The Heavenly Yuan creation realm powerhouses in the palace had no time to react!<br/><br/>A terrifying power covered them.<br/><br/>Apart from these heaven origin creation realm experts,.<br/><br/>Ten of the palaces were also attacked by the ruler realm experts.<br/><br/>In front of each palace, at least 20 peak ruler realm experts suddenly appeared.<br/><br/>Along with hundreds of thousands of other ruler realm experts.<br/><br/>They quickly killed the gods.<br/><br/>It was three or four times more powerful than a palace.<br/><br/>This sudden attack caught the gods and the king of gods, who believed in the universe, completely unprepared!<br/><br/>“Oh no, we can’t resist it at all. We’re doomed!”<br/><br/>“Oh no, this is a space-elemental expert. Isn’t this the King of Void? Why did he suddenly attack? Why are they together with the Dragon King?”<br/><br/>“Oh no, run, gather at the divine one palace immediately!”<br/><br/>In an instant, when the ten palace’s expert disciples saw the sudden attack of the Dragon Palace’s expert disciples, their faces were filled with shock and anger.<br/><br/>They wanted to escape!<br/><br/>Before this, they had already made a plan.<br/><br/>If the Dragon Palace’s Dragon King launched a sneak attack, they would immediately gather together and deal with or even kill the Dragon King!<br/><br/>However, even though they were prepared, when the sudden attack arrived, it was still somewhat difficult for them to resist.<br/><br/>Most importantly, it was too sudden!<br/><br/>It directly appeared in their nest and directly charged towards them, not giving them any time to react!<br/><br/>One King of the gods was quickly killed.<br/><br/>However, each king of the gods had their own means of resurrection.<br/><br/>After they were resurrected, they immediately teleported to the God Palace!<br/><br/>“Kill, kill all the gods in the belief universe and kill them. The power of the king of the gods will naturally decrease, Keke!”<br/><br/>At the Nine Star Palace, Mo Sha roared with a gloomy face after killing the king of the gods in the control level of the nine star palace.<br/><br/>He stared at the gods in the nine star palace and immediately killed them.<br/><br/>The disciples of the Dragon Palace didn’t have a good impression of the belief universe.<br/><br/>Not only did the two sides fight and kill each other in the starry universe back then,.<br/><br/>During the calamity, the belief universe crazily occupied one universe after another and enslaved the souls of the living beings in other universes, which made the powerhouses of the Dragon Palace not have a good impression at all.<br/><br/>This kind of behavior was no different from the evil sequence camp.<br/><br/>In addition, the belief universe, their cultivation method was to use the power of belief.<br/><br/>It was to gather the power of countless believers.<br/><br/>The gods in each palace all worshipped the king of the gods in their own palaces.<br/><br/>Killing these gods was equivalent to weakening the power of the king of the gods.<br/><br/>If all the believers of the king of the gods were killed, then the king of the gods’realm would fall to a terrifying level.<br/><br/>It would drop to a level where anyone could easily kill him.<br/><br/>Therefore, killing the gods who believed in the universe was an important part of the plan!<br/><br/>The king of Pantheon could be resurrected. After they were resurrected, it was very likely that they would retain their realm.<br/><br/>However, if they were to kill their believers wantonly, their strength would definitely drop.<br/><br/>In the Divine Sacred Palace, after Wang Xian had killed the king of Pantheon in the Divine Sacred Palace, he began to slaughter the gods in the Divine Sacred Palace.<br/><br/>Under his telepathic perception.<br/><br/>There were more than 300,000 gods in the Holy Palace.<br/><br/>The Holy Palace was an existence second only to the one palace of gods.<br/><br/>Their number of gods was also second only to the one palace of gods!<br/><br/>More than 300,000 gods were located around the Holy Palace of gods.<br/><br/>Wang Xian’s body churned as waves of energy filled with deathly stillness swept towards them.<br/><br/>As the energy swept past, all the gods were instantly killed!<br/><br/>“Run, run, run!”<br/><br/>“There’s an enemy invasion, there’s an enemy invasion. Where’s the King of the Gods?”<br/><br/>“Oh my God, what happened? Run quickly!”<br/><br/>“What a terrifying energy. It’s not something we can withstand. Run, run, run!”<br/><br/>Countless gods roared in despair as they fled in all directions.<br/><br/>However, with their speed, how could they escape Wang Xian’s attack.<br/><br/>On the planet where the divine palace was located, the hundreds of planets around were all destroyed by Wang Xian easily.<br/><br/>All the gods were wiped out.<br/><br/>Now, it was too easy for Wang Xian to wipe out an expert in the ruler realm with his strength.<br/><br/>It was as easy as squashing an ant.<br/><br/>“Hehe!”<br/><br/>Wang Xian’s cold dragon eyes swept across and revealed a faint smile.<br/><br/>These corpses of the gods of the universe were the most precious treasures for the disciples of the Dragon Palace to cultivate!<br/><br/>Just these corpses were a terrifying amount of resources!<br/><br/>The corpses of the king of gods of the Great Dao level were a rare cultivation treasure for Wang Xian’s Void Dragon Body!<br/><br/>After Wang Xian had killed all the gods around the divine sacred palace, the divination lamp appeared in front of him.<br/><br/>“Are they all gathered together? At the Divine Palace!”<br/><br/>Wang Xian looked at the information displayed on the divination lamp. His eyes sparkled.<br/><br/>He took out the communication stone plate and sent a message.<br/><br/>“The Dragon King and the rest have invaded. Our heavenly imperial palace has suffered a terrifying attack. I was surrounded and killed by four heaven origin creation realm powerhouses. D * mn it, they have invaded our belief universe.”<br/><br/>“I’ve been killed too. D * MN it, how did they suddenly appear in our palace? How did they do it? Could it be that we have spies from the Dragon Palace Here?”<br/><br/>“What exactly happened? According to the information from the formation we set up, more than thirty Heavenly Kismet realm experts have invaded. Have you been attacked?”<br/><br/>“Didn’t you guys suffer an attack? We have suffered an attack here. The strength of the other party is extremely terrifying. The gods in my palace are being massacred by them. Quickly go and help!”<br/><br/>At the same time, in the void crack beside the god Palace.<br/><br/>The kings of the gods who believed in the universe quickly arrived here.<br/><br/>Some of the kings of the gods had expressions of shock.<br/><br/>Some of the kings of the gods were terrified and angry.<br/><br/>Some of them were pale and had just been resurrected.<br/><br/>In the 24 palaces, 10 palaces had been attacked.<br/><br/>They had been attacked!<br/><br/>This caused them to suffer heavy losses.<br/><br/>“Buzz Buzz!”<br/><br/>At this moment, two great dao experts from the one God Palace, the Great Dao existences from the Sacred Palace, also appeared.<br/><br/>Their expressions were also abnormally awkward!\t\t\t\t\t\t</div>", "images": {}, "success": true}