{"id": 1403, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075356.html", "title": "Chapter 4406 - Chapter 4406: Under The 4405 Attack", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4406 - Chapter 4406: Under The 4405 Attack</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4406: Under the 4405 attack<br/><br/>“The belief universe is the strongest target our dragon palace is facing. It is an enemy. Since we are going to make a move, we have to destroy it completely.”<br/><br/>“At that time, we will launch a surprise attack. I will try my best to kill as many of their heaven origin destiny realm powerhouses as possible…”<br/><br/>Wang Xian sat on the dragon throne and shared some information about the belief universe to all the powerhouses of the Dragon Palace.<br/><br/>Then, he told them about the plan again.<br/><br/>Following that, he showed the map of the belief universe and the location of the 24 palaces.<br/><br/>The belief universe was not weak. The Dragon Palace could not be careless in their actions this time.<br/><br/>They had to fight with all their might.<br/><br/>They had to fight with all their might.<br/><br/>Wang Xian naturally had to discuss these aspects with the powerhouses of the Dragon Palace.<br/><br/>The greatest advantage of the Dragon Palace was the existence of an lie.<br/><br/>It could allow them to launch a sneak attack in an instant.<br/><br/>This was very important.<br/><br/>Otherwise, if all the experts of the belief universe were to gather together, the Dragon Palace would not be able to break through them at all!<br/><br/>Therefore, the first attack was very important.<br/><br/>One had to kill at least two existences at the Great Dao level. Of course, it was also possible to kill five or six existences at the control level!<br/><br/>“Foster father.”<br/><br/>Just as Wang Xian and the rest started their discussion, Tian Ci was brought over by an lie.<br/><br/>He shouted in excitement. His gaze swept across the powerhouses in the Dragon King’s Hall and he was also shocked!<br/><br/>“Yes, there’s a big battle this time. Tian Ci, you should train well!”<br/><br/>Wang Xian smiled and nodded at Tian Ci. Then, they continued their discussion on the battle plan!<br/><br/>“Next, I will continue to investigate the situation in the belief universe. Shadowless, inform me when your strength has recovered to the Great Dao level. Once you have recovered, we will take action immediately.”<br/><br/>Finally, Wang Xian spoke!<br/><br/>“It’s the Dragon King!”<br/><br/>The king of the Void was called Shadowless. He replied respectfully!<br/><br/>Wang Xian nodded and ordered the group of Dragon Palace powerhouses to get ready.<br/><br/>The two heaven origin creation realm experts from the Gaza universe ended the meeting after a period of shock.<br/><br/>“The Dragon King and the rest might really be able to completely destroy the belief universe. At that time, we will be able to deal with our people. Now that their minds are completely controlled, they are like walking corpses. They finally have a chance to be freed!”<br/><br/>The two women were talking excitedly.<br/><br/>Time passed day by day.<br/><br/>During this period of time, Wang Xian often went to the belief universe to investigate some situations.<br/><br/>He set up a devil spirit altar not far away from each palace in the belief universe.<br/><br/>This could make the powerhouses of the Dragon Palace attack directly.<br/><br/>“Dragon King, we found some sneaky guys around the Dragon Palace. After investigation, they were sent by the belief universe.”<br/><br/>However, on this day, Wang Xian received a message from Prime Minister Gui.<br/><br/>When he saw this message, he raised his eyebrows slightly.<br/><br/>“It seems that the last time I killed ao Cangtian and the rest, I Killed Four Masters of the belief universe. This made them even more cautious!”<br/><br/>Wang Xian mumbled.<br/><br/>“The Void Shadow will only need about a thousand years to return to the Great Dao level. At that time, we can take action. We can’t make too many preparations for the belief universe!”<br/><br/>Wang Xian pondered in his heart.<br/><br/>That’s right!<br/><br/>Ever since Wang Xian exterminated the king of the Void and the rest of the Proud Heaven once again.<br/><br/>The four control-level powerhouses from the belief universe had a bad premonition in their hearts!<br/><br/>They had a feeling that the Dragon King would take action against their belief universe.<br/><br/>They immediately passed this news to the powerhouses from the Shen Yi Palace and the other palaces.<br/><br/>This made the belief universe on high alert.<br/><br/>One by one, the powerhouses of the Heaven’s origin manifestation were stationed in the universe.<br/><br/>Even the powerhouses who had left did not leave too far away. They could return in an instant.<br/><br/>In addition, they had also made a series of preparations.<br/><br/>They had set up defensive formations at the center of the entire belief universe.<br/><br/>Once a powerhouse of the Heaven’s origin manifestation appeared at the center of their belief universe, they would be able to sense it instantly.<br/><br/>However, what they did not know was that.<br/><br/>Wang Xian had seen all these defenses and arrangements of the belief universe.<br/><br/>During this period of time, he had been in the belief universe.<br/><br/>The array formation and defenses of the belief universe could not sense Wang Xian’s existence at all.<br/><br/>This made him have some plans in his heart.<br/><br/>“Dragon King, the king of Void’s strength has recovered!”<br/><br/>A thousand years had passed. On this day, Prime Minister Gui’s message was sent!<br/><br/>When Wang Xian heard it, he raised his eyebrows slightly.<br/><br/>“Then, we can make our move now!”<br/><br/>He mumbled and confirmed all the plans again.<br/><br/>Then, he came to the position of the one God Palace.<br/><br/>Currently, he believed in the twenty-four palaces of the universe. Other than the Holy Palace which had an existence at the level of Great Dao,.<br/><br/>The other two existences at the level of Great Dao were all in the Holy Palace.<br/><br/>Furthermore, according to Wang Xian’s senses, these two existences at the level of Great Dao were all in the Holy Palace!<br/><br/>Since Wang Xian had chosen to launch a sneak attack, he would first attack with their strongest expert.<br/><br/>He would first attack the Holy Palace!<br/><br/>Then, he would kill his way to the Holy Palace!<br/><br/>“I have to finish the battle as soon as possible. I can’t let them react in time. Regardless of whether they can be resurrected or not, I have to kill them once!”<br/><br/>Wang Xian’s eyes focused. At this moment, he contacted Prime Minister Gui.<br/><br/>After receiving the reply, Wang Xian gave the order to attack!<br/><br/>At the same time, he instantly unleashed all of his strength. His dragon eyes locked onto the two great dao level powerhouses in the divine one palace.<br/><br/>“Roar!”<br/><br/>Wang Xian instantly transformed into his divine dragon body.<br/><br/>At the spot between his brows, the heaven’s origin golden pupil emitted a golden glow.<br/><br/>The void disk emitted a terrifying aura as it headed straight for the two powerhouses!<br/><br/>“The Strongest Attack!”<br/><br/>“Die!”<br/><br/>Wang Xian roared furiously and opened his dragon mouth. All kinds of terrifying energies were mixed together.<br/><br/>Metal, wood, water, fire, Earth, wind, lightning, light, and darkness.<br/><br/>Not only that, there were also mutated Frost, corroded darkness, and pale light.<br/><br/>All kinds of fusion and mutated energy were directed towards that direction!<br/><br/>This attack could be said to be Wang Xian using all of his strength!<br/><br/>In the Divine One Palace, two great dao level powerhouses were cultivating in the two halls on the left and right respectively.<br/><br/>This calamity had just arrived and they had already occupied an entire universe.<br/><br/>Now, they were also digesting the additional power of faith.<br/><br/>They were cultivating!<br/><br/>However, the moment Wang Xian made his move, the two great dao level powerhouses opened their eyes and revealed a shocked expression.<br/><br/>“What? How is this possible? The entire center of the universe of faith has been completely sealed off. Why are there heaven origin level powerhouses appearing?”<br/><br/>Their eyes widened instantly as they felt this terrifying energy. Their faces revealed a look of astonishment.<br/><br/>Chaos level!<br/><br/>This was definitely the power of chaos level!<br/><br/>They didn’t have time to think about anything else. The two of them immediately released their strongest defense!\t\t\t\t\t\t</div>", "images": {}, "success": true}