{"id": 1417, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075426.html", "title": "Chapter 4420 - Chapter 4420: 4419, Beneath The Trembling Land Of Origin", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4420 - Chapter 4420: 4419, Beneath The Trembling Land Of Origin</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4420: 4419, beneath the trembling land of origin<br/><br/>The Deputy Palace Master of the God Palace was fleeing in the land of origin with a face full of shock and anger.<br/><br/>He was preparing to escape into the boundless chaos from the place of resurrection.<br/><br/>The further the better.<br/><br/>He would run as far as he could.<br/><br/>He came out from a cave in the land of origin and flew in a direction far away.<br/><br/>When he didn’t fly for long, he saw a powerful energy fluctuation ahead.<br/><br/>This caused his gaze to freeze. He didn’t pay too much attention to it and continued flying forward.<br/><br/>In front of him, there were more than ten heavenly yuan blessed realm experts surrounding and attacking a Chaos Behemoth.<br/><br/>This group of experts was extremely powerful.<br/><br/>There was even an existence at the Great Dao realm amongst them.<br/><br/>That Chaos Behemoth was completely unable to resist against such a group of people.<br/><br/>Even if it wanted to escape, it would find it hard to do so.<br/><br/>This also made their attacks very easy.<br/><br/>The Vice Palace Master of the Cosmos God Palace quickly flew over, attracting the attention of those experts.<br/><br/>“Yi?”<br/><br/>One of the control-level experts felt that the Vice Palace Master of the Cosmos God Palace was familiar.<br/><br/>“The Vice Palace Master of the Cosmos God Palace?”<br/><br/>He recognized him and raised his brows before shouting.<br/><br/>“Belief in the Deputy Palace Master of the Cosmos God Palace? Hong Ying, do you know him?”<br/><br/>The Great Dao realm expert in the middle asked with a face full of astonishment.<br/><br/>The belief universe was a famous existence around the land of origin.<br/><br/>There were 24 powerful palaces in the universe, and the number of heaven origin creation realm experts was terrifying.<br/><br/>Furthermore, they occupied two universes. Furthermore, the moment this calamity erupted, the belief universe’s deity Palace occupied another universe.<br/><br/>Their strength made all the powerful beings in the surrounding universes tremble in fear!<br/><br/>Facing the powerful beings that believed in the universe, the powerful beings in the other universes had to be careful too!<br/><br/>“Eh?”<br/><br/>The Deputy Palace Master of God looked over when he heard someone calling him.<br/><br/>However, at this moment, he was trying to escape, so he didn’t care about it at all.<br/><br/>“Can you escape?”<br/><br/>However, at this moment, a voice that terrified him entered his ears.<br/><br/>When he heard this voice, his body trembled violently.<br/><br/>“No, save me!”<br/><br/>With a face full of fear, he roared and flew toward the group of experts.<br/><br/>Wang Xian’s figure appeared and looked at him indifferently.<br/><br/>“What?”<br/><br/>In front of him, the more than ten experts were stunned when they saw this sudden scene.<br/><br/>“My friend, what grudge do you have with the Deputy Palace Master of the God of Light?”<br/><br/>Among the more than ten people, the middle-aged man who was at the control level had a thoughtful look on his face before he asked.<br/><br/>Wang Xian ignored him when he heard his words. With a flash, he arrived in front of the Deputy Palace Master of the god of light.<br/><br/>“Bang!”<br/><br/>He waved his arm and an extremely terrifying energy engulfed him.<br/><br/>“No!”<br/><br/>The Deputy Palace Master of the deity let out a final roar in despair.<br/><br/>“This? ? ?”<br/><br/>When the dozen of people saw that the deputy palace master of the deity was instantly killed, they were stunned.<br/><br/>Their pupils contracted slightly. They knew that Wang Xian was an existence at the Great Dao level.<br/><br/>“My Friend, the one you killed was the son of the strongest force in the universe, the palace master of the Deity Palace.”<br/><br/>The control-level powerhouse opened his mouth and couldn’t help but continue.<br/><br/>“And then?”<br/><br/>Wang Xian kept the corpse of the Deputy Palace Master of the God Palace and looked at the middle-aged man who was talking.<br/><br/>“It’s nothing. I’m just saying.”<br/><br/>The powerhouse was slightly stunned and shook his head.<br/><br/>“You talk too much nonsense. Do You Know Him?”<br/><br/>Wang Xian raised his eyebrows and looked at him as he asked.<br/><br/>The middle-aged man frowned slightly when he heard Wang Xian’s words. He didn’t say anything else.<br/><br/>Wang Xian noticed that the middle-aged man didn’t say anything. His eyes flickered and a hint of coldness flashed across his eyes. “I’m asking you a question!”<br/><br/>“You said that I talk too much nonsense, so I won’t say it anymore.”<br/><br/>The middle-aged man frowned and said faintly!<br/><br/>“Ha, alright, then disappear from my sight!”<br/><br/>Wang Xian smiled coldly and his figure disappeared instantly!<br/><br/>When they reacted, he arrived in front of the middle-aged man and placed his palm on his head!<br/><br/>“What?”<br/><br/>At the side, the Great Dao expert only sensed it when Wang Xian appeared in front of them.<br/><br/>His pupils contracted slightly and a look of astonishment appeared on his face.<br/><br/>How could he be so fast?<br/><br/>How could he appear in front of them before he could even sense himself?<br/><br/>“Bang!”<br/><br/>Wang Xian pressed his palm down and killed him directly.<br/><br/>Wang Xian wiped his palm casually and kept the corpse.<br/><br/>“Uncle Hao!”<br/><br/>At the side, a young man exclaimed loudly.<br/><br/>He stared at Wang Xian with anger on his face.<br/><br/>Wang Xian looked at the young man and flicked his finger.<br/><br/>“Bam!”<br/><br/>A wave of energy penetrated the young man directly.<br/><br/>It was still an instant kill!<br/><br/>Wang Xian waved his arm and grabbed the young man’s corpse and kept it.<br/><br/>This group of Heaven origin creation realm powerhouses all had several lives. Therefore, Wang Xian had taken their lives as an offense to him.<br/><br/>“This…”<br/><br/>Wang Xian had killed two of them in an instant. This caused the breathing of the other Heaven’s origin powerhouses to stop for a moment. A look of fear appeared on their faces.<br/><br/>“This… senior, we didn’t mean to offend you.”<br/><br/>The pupils of the Great Dao level powerhouse contracted slightly. He cupped his hands and said to Wang Xian.<br/><br/>He couldn’t help but swallow a mouthful of saliva.<br/><br/>The strength that Wang Xian displayed made him feel a little shocked.<br/><br/>A beginner-level expert at the snap of a finger level.<br/><br/>An existence at the control level was instantly killed.<br/><br/>Although he was an existence at the Great Dao level, he couldn’t do it at all.<br/><br/>What made him even more shocked was that he couldn’t sense the opponent’s presence in front of him in advance.<br/><br/>What realm was this expert at to be so terrifying?<br/><br/>Wang Xian took a glance at him, moved his body and left instantly!<br/><br/>Wang Xian wouldn’t show mercy if someone was courting death.<br/><br/>If someone wasn’t courting death, he had no interest in killing them.<br/><br/>Even though Wang Xian could do it casually, even though their corpses were huge resources.<br/><br/>This was a matter of principle.<br/><br/>Wang Xian’s silent departure shocked the powerhouse at the Great Dao realm again.<br/><br/>Beads of cold sweat appeared on his forehead!<br/><br/>“Senior Tian Quan, what… What kind of existence is this powerhouse? He… He…”<br/><br/>At the side, more than ten other powerhouses widened their eyes when they saw Wang Xian leaving. They asked in shock.<br/><br/>“I don’t know. The other party’s strength is extremely terrifying. I can’t even sense his every move.”<br/><br/>“If he wants to attack me, I might not be able to react in time.”<br/><br/>The Great Dao expert called Tian Quan wiped the sweat off his forehead and said.<br/><br/>“How is this possible?”<br/><br/>His words caused the surrounding experts to be extremely shocked.<br/><br/>Senior Tian Quan was an existence at the Great Dao level.<br/><br/>However, when they thought of their two companions who had been killed, they also became slightly silent.<br/><br/>They knew that senior Tianquan couldn’t do it so casually!\t\t\t\t\t\t</div>", "images": {}, "success": true}