{"id": 1414, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075411.html", "title": "Chapter 4417 - Chapter 4417: 4416", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4417 - Chapter 4417: 4416</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4417: 4416<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>A terrifying collision sound rang out in the void.<br/><br/>Wang Xian’s body resisted the giant’s attack head-on.<br/><br/>Similarly, Wang Xian’s attack landed on the giant’s body.<br/><br/>“Bang!”<br/><br/>The powerful attack force caused Wang Xian’s body to fly backward. A large amount of blood oozed out from his body.<br/><br/>There was also a large amount of dragon blood oozing out from the dragon’s mouth.<br/><br/>Wang Xian was injured after receiving this attack.<br/><br/>The ancestral tree in his body emitted a powerful energy glow to heal his injuries.<br/><br/>“Boom!”<br/><br/>In front of him, the huge giant of faith suffered a powerful attack from Wang Xian and was directly penetrated through a huge hole.<br/><br/>The powerful energy impact caused the faces of the kings of the gods to turn pale. They were filled with fear.<br/><br/>“Attack!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>At this moment, Mo Sha’s and the others’voices sounded. Then, they exploded with all their strength and attacked the giant’s cave entrance.<br/><br/>“Block, Block!”<br/><br/>The expression of the first God Palace master changed drastically when he saw this scene and he shouted sternly.<br/><br/>He didn’t expect that the Dragon King would risk getting injured to stop them.<br/><br/>This was to prevent him from breaking through!<br/><br/>Boom! Boom<br/><br/>Before he could think, a huge amount of energy charged at him again.<br/><br/>The kings of the gods turned pale and revealed terrified expressions.<br/><br/>Their faces were pale as they poured in powerful energy to resist the attacks of the experts from the Dragon Palace.<br/><br/>However, the belief giants who had already broken through a hole couldn’t perfectly help them resist this attack.<br/><br/>Under the powerful energy impact, the expressions of all the kings of gods changed dramatically.<br/><br/>Pu<br/><br/>Instantly, more than ten kings of gods spat out blood.<br/><br/>“No, Lord God One Palace Master, we have to escape. Otherwise, we’re finished!”<br/><br/>One of the kings of gods said in fear!<br/><br/>“Find a chance to escape!”<br/><br/>God One Palace master immediately replied.<br/><br/>They had to escape immediately.<br/><br/>Otherwise, if they continued to be entangled like this, they wouldn’t be a match for the other party at all.<br/><br/>“You want to escape? It Won’t be so easy. Let’s decide the outcome here!”<br/><br/>Wang Xian wiped the blood from the corner of his mouth and stared coldly at the first God Palace Master and the rest.<br/><br/>“Roar Roar!”<br/><br/>He growled in a low voice and instantly unleashed all his strength. He attacked the giant of faith once again.<br/><br/>“Assist the Dragon King.”<br/><br/>Mo Sha and the rest, who were at the back, immediately shouted when they saw him.<br/><br/>Following that, they surrounded Wang Xian with streams of defensive power.<br/><br/>They reinforced Wang Xian’s defense.<br/><br/>“That Dragon King is attacking again!”<br/><br/>“Defend!”<br/><br/>Seeing Wang Xian attacking again, the kings of the gods roared loudly!<br/><br/>This time, they chose to defend instead of attacking.<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>However, their defense was in the face of Wang Xian’s continuous violent attacks.<br/><br/>Cracks appeared once again at the hole that had just been mended!<br/><br/>“Attack! We will attack with our full strength when the other party is defending. We will assist the Dragon King when the other party is attacking!”<br/><br/>Mo Sha also ordered loudly at this moment.<br/><br/>“Boom Boom Boom!”<br/><br/>“Boom Boom Boom!”<br/><br/>All sorts of terrifying attacks smashed towards the faith giant. The entire space seemed to be a terrifying apocalypse.<br/><br/>Within a few million light years, everything was deathly silent.<br/><br/>Any living being that approached would be killed by the terrifying energy shockwaves.<br/><br/>“Palace head Qian Yuan, can you use your area-of-effect escape treasure and bring us away!”<br/><br/>Upon seeing such a violent attack, the expression of palace master Shenyi changed drastically as he shouted.<br/><br/>“No, Palace Master Shenyi. The area-of-effect escape treasure needs to envelop all of you. However, you can not resist and can not use any attacks during the period of being enveloped.”<br/><br/>Palace Master Qianyuan replied with an embarrassed expression.<br/><br/>This kind of escape treasure that could lead everyone to escape required some conditions.<br/><br/>Just like how an lie led Wang Xian and the rest to teleport, they could not put up any resistance first.<br/><br/>When they released their attacks, it represented a form of resistance.<br/><br/>Under such circumstances, an area-of-effect attack would not be successful.<br/><br/>“Damn it!”<br/><br/>“We have to stop the Dragon King’s violent attack. Otherwise, we will be finished!”<br/><br/>The Sacred Palace master roared with his eyes wide open!<br/><br/>“You Want to kill us? If you want to kill us, even if you are at the level of chaos, you will have to pay a terrible price!”<br/><br/>The Holy Palace Master roared with a face full of killing intent, “Attack the Dragon King!”<br/><br/>He controlled the giant of faith.<br/><br/>The giant of faith emitted a terrifying energy from its mouth and shot toward Wang Xian!<br/><br/>“Assist the Dragon King!”<br/><br/>Mo Sha and the others at the back saw this scene. Immediately, streams of energy covered Wang Xian’s surroundings.<br/><br/>“Roar!”<br/><br/>When Wang Xian saw this attack, he didn’t resist at all. He also opened his dragon mouth and prepared a terrifying attack.<br/><br/>“Roar! Roar!”<br/><br/>An attack that contained all kinds of energy attacked the body of the giant of faith.<br/><br/>His attack missed the opponent’s attack.<br/><br/>Similarly, he exchanged injuries for injuries!<br/><br/>However, this time, Mo Sha and the rest set up layers of defense in front of Wang Xian.<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>The sound of collision rang out once again.<br/><br/>Wang Xian’s dragon breath penetrated the giant of faith once again.<br/><br/>The kings of the gods trembled violently and spat out a large amount of blood again.<br/><br/>Their power of faith was channeled crazily into the giant of faith.<br/><br/>“Boom!”<br/><br/>In front of Wang Xian, the blow from the giant of faith shattered the layers of defense in front of Wang Xian.<br/><br/>Once again, his body couldn’t help but fly backward.<br/><br/>However, this time, it didn’t cause too much damage to Wang Xian.<br/><br/>The defense of Mo Sha and the rest was of great use!<br/><br/>“Attack!”<br/><br/>The group of experts from the Dragon Palace quickly launched the second round of attacks.<br/><br/>All kinds of powerful Heaven’s origin force attacked the entrance of the giant of Faith’s Cave.<br/><br/>The faces of the kings of gods turned pale. Some of them started bleeding from their eyes, ears, and noses.<br/><br/>The believers behind them started to collapse and dissipate.<br/><br/>“Kill!”<br/><br/>Wang Xian flew over again and attacked the giant continuously!<br/><br/>Fight!<br/><br/>It was a complete fight!<br/><br/>Wang Xian’s attacks caused the kings of gods to have no time to rest.<br/><br/>Next, it was a competition of endurance.<br/><br/>It was a competition of vitality.<br/><br/>Wang Xian did not allow them to escape.<br/><br/>And if the kings of the gods wanted to escape, they had to exhaust Wang Xian’s energy!<br/><br/>“Kill, Let’s fight it out with them. Our belief universe is invincible!”<br/><br/>Palace Master Shenyi and the rest had obviously realized this as well. They roared with murderous intent.<br/><br/>They were all old monsters who had lived for countless years.<br/><br/>Although they cherished their lives, they did not hesitate when it was time to fight.<br/><br/>Kill!<br/><br/>Only by killing could they kill their way out!<br/><br/>So what if they were existences at the chaos level?<br/><br/>“Alright!”<br/><br/>Wang Xian could feel their murderous intent. A strong desire to fight shot out from his eyes!\t\t\t\t\t\t</div>", "images": {}, "success": true}