{"id": 1413, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075406.html", "title": "Chapter 4416 - Chapter 4416: The Kings Of The Gods Were Shocked And Furious", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4416 - Chapter 4416: The Kings Of The Gods Were Shocked And Furious</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4416: The kings of the gods were shocked and furious<br/><br/>“Ah Ah Ah!”<br/><br/>“Ah Ah Ah!”<br/><br/>In the void of the belief universe.<br/><br/>God One Palace master hovered high in the air, his face filled with excitement, anticipation, and excitement.<br/><br/>From his point of view, he was about to break through to the primal Chaos Realm!<br/><br/>He was about to step into a powerful realm!<br/><br/>However, at this moment, a sudden crisis enveloped his heart.<br/><br/>Soon after, he saw a terrifying energy attack.<br/><br/>The five kings of the gods who were kneeling in front of him didn’t have time to react before they were killed by the terrifying energy.<br/><br/>At the side, the other kings of the gods had a drastic change in expression and hurriedly hid to the side.<br/><br/>“How is this possible? How did they rush over so quickly? How could they be so fast?”<br/><br/>One of the kings of the gods shouted in horror.<br/><br/>They had been teleported here far away from their previous location.<br/><br/>It would take a year or two for even primal chaos existences to get here.<br/><br/>And it wouldn’t take a year or two. They should be able to complete their faith within a few days.<br/><br/>They would be able to raise the first God Palace master to the primal chaos level.<br/><br/>But now, the Dragon King and the others had actually killed their way over so quickly. This caused the kings of the gods who believed in the universe to be extremely shocked and furious.<br/><br/>“Damned Dragon King.”<br/><br/>The first God Palace Master looked at his five future subordinates being killed in an instant.<br/><br/>His side’s strength had been reduced once again, and he was also extremely shocked and furious.<br/><br/>But at the same time, his heart was filled with anger.<br/><br/>He was about to break through to the chaos level. Now, the Dragon King had ruined his plan.<br/><br/>“Roar!”<br/><br/>“HMPH, are you trying to create a chaos level existence? I will not let you succeed!”<br/><br/>Wang Xian stared at them coldly and flew over at a terrifying speed.<br/><br/>The disk of nothingness on his body condensed a huge amount of energy again.<br/><br/>An incomparably sharp disk was formed and slashed towards them.<br/><br/>“Defend!”<br/><br/>When Palace Master Shenyi saw this, he immediately roared angrily and stared at Wang Xian with blood-red eyes.<br/><br/>Buzz<br/><br/>His body shook and condensed a huge phantom again. Under the power of faith, the Phantom slowly began to materialize.<br/><br/>Numerous kings of gods came to his surroundings and injected a huge amount of power of faith into him.<br/><br/>The powerful faith giants gathered again and blocked Wang Xian’s attack!<br/><br/>“Kill them! Don’t let them escape!”<br/><br/>Mo Sha and the rest who were at the back also charged over and roared loudly!<br/><br/>Wang Xian stared at the giant formed by the faith power. He waved his huge dragon tail and swept it out!<br/><br/>“You’re courting death. We are united. We are not afraid of you.”<br/><br/>Palace master Shen Yi shouted sternly. He controlled the giant of faith and waved his huge fist to meet Wang Xian’s dragon tail.<br/><br/>Boom<br/><br/>A terrifying collision caused Wang Xian’s body to be sent flying. Some blood oozed out from his dragon scales.<br/><br/>The giant of faith was only slightly dimmer.<br/><br/>When the king of the gods of faith infused his power of faith again, he recovered immediately!<br/><br/>“Attack them! We can’t let them escape!”<br/><br/>Wang Xian also shouted loudly.<br/><br/>This time, his dragon horn emitted light. Two streams of terrifying energy attacked the king of all gods once again.<br/><br/>“Kill!”<br/><br/>Mo Sha and the rest who had arrived also released powerful attacks that landed on the giant of faith.<br/><br/>“Think of a way to leave this place. When my strength breaks through, I will be able to deal with them and fight against them!”<br/><br/>Seeing that this attack was even fiercer than before, the divine one palace master ordered with an embarrassed expression.<br/><br/>“It’s Lord Divine One Palace Master!”<br/><br/>The kings of the gods immediately responded.<br/><br/>Now, if they wanted to fight against the Dragon King and the others, they had to give birth to an existence at the primal chaos level.<br/><br/>Otherwise, they would be finished.<br/><br/>However, they couldn’t run too far away from this place in an instant.<br/><br/>For example, they could use treasures to escape to the origin energy and then make the first God Palace master make a complete breakthrough.<br/><br/>This was not feasible.<br/><br/>Because once they were far away from the belief universe, the Dragon Palace could completely slaughter their believers.<br/><br/>After wiping out all their believers, their strength would immediately decrease.<br/><br/>At that time, even if the first God Palace master broke through to the primal chaos level, it would be temporary.<br/><br/>Before long, he would fall down.<br/><br/>“This time, it won’t be so easy for you to escape!”<br/><br/>Wang Xian’s gaze was locked on them as he circulated the energy of the ten attributes in his body. He charged at the giant of faith once again.<br/><br/>He extended his Dragon Claw. The Dragon Claw enlarged as the energy gathered. He grabbed at the giant!<br/><br/>“Defend!”<br/><br/>Palace Master Shenyi’s expression changed drastically. A shield condensed on the giant’s arm as he tried to defend against the Dragon Claw.<br/><br/>“Bang, Bang, Bang!”<br/><br/>“Bang, Bang, Bang!”<br/><br/>Wang Xian’s Dragon Claw landed on the shield and was completely blocked.<br/><br/>However, even though he was blocked, Wang Xian continued to bombard the shield.<br/><br/>He unleashed all his firepower and unleashed all his strength.<br/><br/>“Boom, Boom, Boom!”<br/><br/>“Boom, Boom!”<br/><br/>At the back, Mo Sha and the rest were bombarding the giant of faith with all their might.<br/><br/>This attack was ten times more violent than before.<br/><br/>“Palace Master Shenyi, this won’t do. We have to keep infusing the power of faith. Once we stop, we’ll be attacked by an earth-shattering attack. At that time, even if we can escape, more than half of us will die.”<br/><br/>Sacred Palace Master looked at this violent attack with an ugly expression.<br/><br/>Under the continuous attacks, cracks gradually appeared on the belief giant that was formed.<br/><br/>“Not good.”<br/><br/>When the divine one palace master saw this scene, his expression changed drastically.<br/><br/>The five kings of the gods were killed by Wang Xian, causing the belief giant formed by them to be slightly weaker.<br/><br/>Coupled with the violent attacks from Wang Xian and the rest, cracks appeared on the belief giant!<br/><br/>Boom! Boom! Boom<br/><br/>Roar! Roar<br/><br/>When Wang Xian saw cracks appearing on the giant of faith, his attacks became even more violent.<br/><br/>All Kinds of energy landed on it — Dragon Claws, Dragon Might, and Dragon Breath!<br/><br/>All kinds of attacks continued to bombard the giant of faith.<br/><br/>“Let’s break out and escape immediately!”<br/><br/>“Who has an area-of-effect escape treasure?”<br/><br/>Faced with such violent attacks, the expression of the palace master of the first God was a little solemn.<br/><br/>Some of the kings of the gods had turned pale due to the continuous infusion of the power of faith!<br/><br/>“I have it!”<br/><br/>One of the kings of the gods responded immediately.<br/><br/>“Alright, listen to my orders.”<br/><br/>“I’ll unleash my power first, then I’ll escape immediately!”<br/><br/>Palace Master Shenyi transmitted his voice and focused his gaze!<br/><br/>“The fury of faith, the eye of divine might!”<br/><br/>He roared wildly and the giant of Faith’s closed eyes slowly opened.<br/><br/>Inside, waves of power of faith began to gather and attacked Wang Xian, Mo Sha, and the rest.<br/><br/>That terrifying attack made Wang Xian a little fearful.<br/><br/>“Take it head-on!”<br/><br/>When Wang Xian saw the attack, his eyes were filled with a cold expression.<br/><br/>His golden eyes were also infused with a terrifying energy. He attacked Shen Yi and the rest who were at the center of the giant of faith.<br/><br/>As for the Celestial Giant’s attack, Wang Xian was prepared to take it head-on.<br/><br/>“What?”<br/><br/>The celestial giant’s expression changed completely when he saw Wang Xian’s desperate exchange of injuries!\t\t\t\t\t\t</div>", "images": {}, "success": true}