{"id": 1416, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075421.html", "title": "Chapter 4419 - Chapter 4419: On The Land Of Origin Where 4418 Was Trembling", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4419 - Chapter 4419: On The Land Of Origin Where 4418 Was Trembling</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4419: On the land of origin where 4418 was trembling<br/><br/>“Ah! Ah! Ah! Ah! Ah!”<br/><br/>“Ah! Ah! Ah! Ah! Ah! Ah!”<br/><br/>Screams could be heard, but this time, the ones who were screaming were the godly monarchs from the belief universe!<br/><br/>The 20 godly monarchs, after losing the protection of the belief giants, were facing death.<br/><br/>In less than a minute, they were killed.<br/><br/>“We finally killed them. These guys are too difficult to deal with!”<br/><br/>Seeing the kings of the gods killed, Mo sha and the others heaved a sigh of relief and said.<br/><br/>In the Dragon Palace, the experts who had just made a breakthrough looked extremely weak at this moment.<br/><br/>Although they could relax and recover during the battle for tens of thousands of years, the energy in their bodies was almost exhausted after such a long time.<br/><br/>“Hehe, this is only the beginning. Next, we will start to hunt them down.”<br/><br/>Wang Xian smiled faintly.<br/><br/>Although it was inevitable to destroy a group of kings of the gods.<br/><br/>However, Wang Xian heaved a heavy sigh of relief when he saw this scene.<br/><br/>However, what followed was also a very troublesome matter.<br/><br/>That was to hunt down the kings of the gods who believed in the universe.<br/><br/>More than twenty kings of the gods wanted to kill them completely!<br/><br/>“You guys go and hunt down the gods who believed in the universe. Leave the hunting to Mo Sha and me.”<br/><br/>Wang Xian instructed the group of Dragon Palace experts.<br/><br/>Mo Sha had a way to lock onto the kings of the gods.<br/><br/>However, he could only lock onto those who were weak and those who were close.<br/><br/>If they were too far away, there was nothing he could do.<br/><br/>Wang Xian took out the lamp of divination and immediately divined the position of the first God Palace Master.<br/><br/>The first God Palace Master was the one whom Wang Xian wanted to kill first.<br/><br/>After all, he had almost broken through to the chaos level.<br/><br/>“It’s the Dragon King!”<br/><br/>The group of powerhouses from the Dragon Palace replied immediately.<br/><br/>Buzz<br/><br/>The kings of the gods who believed in the gods would not be able to escape the lock of the lamp of divination if they did not gather together and use the method of faith shield together.<br/><br/>Through the corpse of the Shen Yi Palace master, the location of his resurrection was quickly locked.<br/><br/>“An lie, follow me next.”<br/><br/>Wang Xian called an lie over and instructed him.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded.<br/><br/>“Go to this location.”<br/><br/>Wang Xian took out a map and instructed him.<br/><br/>An lie nodded and teleported away immediately with him!<br/><br/>The next moment, Wang Xian appeared in another piece of starry sky.<br/><br/>Following the instructions of the divination lamp, he quickly chased after palace master Shen Yi!<br/><br/>At the same time, palace master Shen Yi, who had just been resurrected, was covered in cold sweat.<br/><br/>In this body, he still possessed the strength of a Great Dao.<br/><br/>However, his face was still extremely pale.<br/><br/>“I should have been locked onto by the Dragon King by now. I have to escape, far away!”<br/><br/>“Where can I escape from his pursuit? A chaos-level existence?”<br/><br/>The first God Palace Master’s heart was beating violently as he kept thinking.<br/><br/>I have to escape from the Dragon King’s pursuit.<br/><br/>I have to escape.<br/><br/>“The evil sequence camp is extremely chaotic and far away from here. Only by escaping there can I hide.”<br/><br/>The eyes of the first God Palace Master were slightly red. He did not hesitate and directly fled into the distance.<br/><br/>“Weng!”<br/><br/>However, when he flew for less than ten days, a terrifying aura enveloped him.<br/><br/>Sensing this familiar aura, the expression of the first God Palace master changed drastically.<br/><br/>“Not good. There is a secret teleportation array set up by the Dragon King in the belief universe. Otherwise, even with his primal chaos level strength, he would not be able to capture me so quickly!”<br/><br/>The Divine One Palace Master was shocked and furious.<br/><br/>“Die!”<br/><br/>However, at this moment, a voice entered his mind.<br/><br/>Following that, a terrifying spatial power enveloped his entire body in an instant and wiped him out.<br/><br/>After wiping him out, Wang Xian took out the lamp of divination and performed another divination.<br/><br/>“HMM? Has My strength decreased? The place of resurrection this time is actually in the land of origin. Hehe!”<br/><br/>Wang Xian looked at this piece of information and smiled.<br/><br/>Wang Xian could also rush over to the land of origin in an instant.<br/><br/>Moreover, the strength of the Palace Master Shenyi had been reduced to the level of control!<br/><br/>Buzz<br/><br/>Under the lead of an lie, Wang Xian arrived at the land of origin in an instant.<br/><br/>According to the divination lamp, Wang Xian rushed over quickly.<br/><br/>“Damn it, damn it, I was killed again. Is it safe to hide here now? It shouldn’t be safe. I have to escape, escape!”<br/><br/>At this moment, the newly resurrected palace master Shen Yi immediately began his escape!<br/><br/>However, half a month later, Wang Xian’s figure appeared in front of him in the chaotic void.<br/><br/>When Palace Master Shen Yi saw Wang Xian’s figure, his body trembled violently.<br/><br/>His face was filled with despair.<br/><br/>Wang Xian did not say anything and destroyed it!<br/><br/>After that, he took out the lamp of divination and continued his divination.<br/><br/>However, according to his divination, the place where Palace Master Shenyi was resurrected was in another universe that was occupied by the belief universe.<br/><br/>“Let’s go, an lie. Let’s go.”<br/><br/>Wang Xian had made arrangements for the other two universes that were occupied by the belief universe.<br/><br/>Since a war had broken out, it was impossible for him not to make these arrangements.<br/><br/>Wang Xian had made a lot of arrangements for the places where they might be resurrected.<br/><br/>He arrived at the universe where Shen Yi Palace master was resurrected in an instant. Wang Xian went over to kill him.<br/><br/>A month later, he destroyed it again with ease.<br/><br/>This time, the place where he resurrected was a piece of void in the chaos.<br/><br/>This time, the place where he was resurrected was very far away.<br/><br/>As a result, it would take Wang Xian tens of thousands of years to hunt him down.<br/><br/>“Forget it. There’s no need to kill him. After killing all the gods in the belief universe, the realm of the first God Palace master will fall below the Heaven’s origin realm. At that time, he won’t be able to survive in the chaos.”<br/><br/>Wang Xian mumbled.<br/><br/>He returned to the belief universe and began to hunt down the Second Great Dao expert of the first God Palace.<br/><br/>A year later, Wang Xian found the Second Great Dao expert of the first God Palace who was hiding in a very secret place and killed him easily.<br/><br/>The main reason was that when this great dao expert worshipped the first God Palace master, his realm had already dropped!<br/><br/>“He was resurrected in the land of origin and his realm is still at the control level. It seems that all these powerhouses like to set up a resurrection point in the land of origin!”<br/><br/>Wang Xian thought to himself. He asked an lie to bring him to the land of origin again.<br/><br/>At the same time, the Vice Palace Master of the First Palace of God in the land of origin was filled with fear after he was resurrected in the land of origin.<br/><br/>“Run! It’s not safe here. We have to run. I wonder how father is now. Damn Dragon King! Damn Dragon King!”<br/><br/>He was the biological son of the Divine One Palace Master. Otherwise, he would not have become the Second Great Dao existence in the divine one palace.\t\t\t\t\t\t</div>", "images": {}, "success": true}