{"id": 1410, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075391.html", "title": "Chapter 4413 - Chapter 4413: 4412’S Faith Created Chaos", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4413 - Chapter 4413: 4412’S Faith Created Chaos</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4413: 4412’s faith created chaos<br/><br/>“Not good, there are experts from the Dragon Palace slaughtering the gods we believe in.”<br/><br/>“Contact the disciples immediately and let them escape. Be careful of the experts from the Dragon Palace.”<br/><br/>“No, our disciples from the Buddha Mountain Palace were killed by a terrifying expert. They killed all the disciples in an instant. They didn’t have the ability to resist at all. No one even noticed when they attacked.”<br/><br/>An angry voice sounded on the battlefield.<br/><br/>The Foshan Palace Master looked at the resurrected gods with an ugly expression and sent him a message.<br/><br/>This made his face carry a trace of fear.<br/><br/>The current situation was very bad for them.<br/><br/>If it wasn’t good, they believed that the universe would be slowly devoured and destroyed.<br/><br/>“Let all the disciples escape. Let all the disciples hide.”<br/><br/>God One Palace Master’s expression changed greatly as he ordered all the kings of the gods.<br/><br/>“If there are powerful existences chasing after us, how can our disciples escape? It’s too difficult.”<br/><br/>One of the kings of the gods couldn’t help but say!<br/><br/>They had suddenly fallen into an unsolvable situation.<br/><br/>In front of them, a large number of experts from the Dragon Palace were besieging them.<br/><br/>They couldn’t escape.<br/><br/>If they tried to escape, it would be the same as death. It would be the same as giving up on their belief in the universe.<br/><br/>With the Dragon King’s strength and ability, he could lock onto them and kill them one by one.<br/><br/>However, if they continued to fight here, they wouldn’t have any good results.<br/><br/>Once their believers were killed in large numbers, their strength would also decrease.<br/><br/>This situation was extremely disadvantageous to them!<br/><br/>“Not good, our eight lives palace has been attacked. A large number of powerful disciples of the Dragon Palace are slaughtering the gods of our eight lives palace.”<br/><br/>Not long after, another terrified voice sounded.<br/><br/>The king of Gods of the eight lives palace’s face was filled with fear.<br/><br/>They had also been attacked.<br/><br/>A powerful attack.<br/><br/>He could sense that his followers were being killed in a frenzy.<br/><br/>The number of believers was decreasing at a terrifying rate.<br/><br/>Moreover, the number of believers was only decreasing at the Pantheon level.<br/><br/>With the large number of believers dying, the power of faith in his body was also decreasing at a crazy rate.<br/><br/>When the surrounding gods heard his words, their expressions sank.<br/><br/>“No, we have to think of a way. Otherwise, we’ll be finished.”<br/><br/>The Palace Master of the Sacred Palace roared with blood-red eyes!<br/><br/>“If this continues, we’ll all die.”<br/><br/>Palace Master God one’s expression changed as he gritted his teeth. “I have a way, but I don’t know if you’ll agree.”<br/><br/>“Senior Palace Master God One, at this point, if you still have a way, just say it. We’ll definitely agree.”<br/><br/>A king who worshipped the gods shouted loudly!<br/><br/>“If you all believe in me, I will be able to reach the chaos level. At that time, I will also possess the strength of the chaos level. After this crisis, I will remove your faith.”<br/><br/>Palace master Shen Yi pursed his lips and said.<br/><br/>“What?”<br/><br/>His words caused all the kings of the gods to be slightly stunned. Their expressions started to change drastically.<br/><br/>Everyone fell silent and did not reply.<br/><br/>They were doing their best to deal with Wang Xian and the rest’s siege.<br/><br/>When the first God Palace master saw this result, he was not surprised at all.<br/><br/>It was difficult for them to accept the fact that all the other kings of the gods believed in them.<br/><br/>Once they believed in them, their lives would be in their hands.<br/><br/>With just a thought, they could take away the lives of their believers.<br/><br/>In addition, none of the kings of the gods were 100% sure that the first God Palace master would remove their faith.<br/><br/>They even felt that the first God Palace master would not remove their faith 80% of the time.<br/><br/>This was because it was impossible for the first God Palace master to recover to the Great Dao level after coming into contact with faith after possessing the power of chaos.<br/><br/>Therefore, the king of the gods did not agree to this suggestion.<br/><br/>When the Palace Master of the first God saw this result, he was not surprised. He focused on fighting against Wang Xian and the rest.<br/><br/>Time passed by minute by minute.<br/><br/>“Oh no, my believers have been attacked.”<br/><br/>Not long after, a king of all gods who believed in the faith had a drastic change in expression. He shouted out involuntarily.<br/><br/>Everyone’s heart sank. They were somewhat helpless.<br/><br/>Faced with this situation, they had no other way!<br/><br/>“My realm has dropped.”<br/><br/>Not long after, the king of Pantheon opened his mouth and said, “I’ve dropped to the ruler realm!”<br/><br/>As soon as he finished his sentence, there was no reply.<br/><br/>Time passed again.<br/><br/>Not long after, the realm of the king of Pantheon had dropped again.<br/><br/>His believers had been killed!<br/><br/>With the teleportation from an lie, Wang Xian hunted down the Pantheon one by one. It was too fast.<br/><br/>A large number of gods died at his hands.<br/><br/>In just a few short hours, he killed millions of gods.<br/><br/>One had to know that these gods were all existences at the ruler realm.<br/><br/>Prime Minister Gui and the disciples of the Dragon Palace were also hunting down the gods who believed in them.<br/><br/>The entire belief universe was in chaos.<br/><br/>In their communication devices, all of them were filled with tragic messages.<br/><br/>“Everyone, believe in me and I will take revenge. Also, I will definitely come into contact with your beliefs. I swear on my life!”<br/><br/>“This is our only chance. Otherwise, our belief universe will be destroyed and disappear completely. Believe in me, this is the only way!”<br/><br/>“Everyone, believe in me!”<br/><br/>God One Palace master roared loudly at this moment, his eyes filled with a cold expression.<br/><br/>He swept his gaze across all the kings of the gods who believed in him and roared loudly.<br/><br/>“Alright, I’m willing to believe in Lord God One Palace Master.”<br/><br/>Another great dao existence from God one palace gritted his teeth and spoke first.<br/><br/>“I also agree. Even if it’s to help senior God one palace master, it’s better than letting the enemy destroy us. God One Palace master, after I believe in You, I hope that you can ruthlessly kill those fellows from the Dragon Palace and make them pay the price!”<br/><br/>A king of gods gritted his teeth and shouted!<br/><br/>He agreed.<br/><br/>Rather than being destroyed by the Dragon Palace, it was better for them to believe in one God Palace Master and make him reach the primal chaos realm, making the Dragon Palace pay the price!<br/><br/>“Okay, if I accept your belief, I will protect you and make the Dragon Palace pay the price!”<br/><br/>The first God Palace Master responded loudly, his eyes slowly shining.<br/><br/>“Okay, I’m Willing!”<br/><br/>“I’m willing too.”<br/><br/>“First God Palace master, we can believe in you, but the other party has been besieging us. We need some time to prepare, and you also need some time to prepare.”<br/><br/>The kings who believed in the gods were helpless.<br/><br/>They gritted their teeth and agreed.<br/><br/>“I have treasures. Let’s go and escape from here!”<br/><br/>When Palace Master Shen Yi saw that all the kings of the gods agreed, his gaze focused. He immediately took out an escape treasure.<br/><br/>A scroll appeared in front of him. The scroll emitted light and enveloped all the kings of the gods.<br/><br/>Buzz<br/><br/>In the next moment, their figures disappeared immediately!<br/><br/>“They escaped?”<br/><br/>Wang Xian did not hear the conversation of the kings of the gods.<br/><br/>When he saw their sudden escape, Wang Xian raised his eyebrows slightly.<br/><br/>“Netherdragon’s pursuit!”<br/><br/>With a wave of his arm, he immediately began his pursuit!\t\t\t\t\t\t</div>", "images": {}, "success": true}