{"id": 1412, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075401.html", "title": "Chapter 4415 - Chapter 4415: 4414 Interrupted", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4415 - Chapter 4415: 4414 Interrupted</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4415: 4414 interrupted<br/><br/>“What’s going on? What’s going on in that direction? How could there be such a huge amount of energy?”<br/><br/>“What a powerful power of faith. This is the energy released by the Kings of the gods. No one can do it except for them. What are they doing there? Are they trying to attract us?”<br/><br/>“I don’t know. It’s a bit strange. They just escaped. How could they release such a huge amount of energy?”<br/><br/>The powerful aura that suddenly erupted from the belief universe made the experts of the Dragon Palace look surprised.<br/><br/>They looked over and began to discuss.<br/><br/>“Dragon King, something’s not right. The kings of the gods seem to be attracting us over, but the distance is a little far. It’ll take us at least a few years to get there.”<br/><br/>Mo Sha looked in that direction. His eyes were sparkling.<br/><br/>“It’s a little strange. There’s no need for them to attract us over.”<br/><br/>Wang Xian looked into the distance and said, “Furthermore, this force of faith is a little strange.”<br/><br/>There was a hint of pressure in the force of faith.<br/><br/>This pressure did not originate from the force of faith itself.<br/><br/>Instead, it was a kind of pressure on the realm.<br/><br/>This was somewhat similar to when Wang Xian had his breakthrough.<br/><br/>“According to my understanding, the advancement of the realm of faith in the universe requires a sufficient amount of power of faith and a sufficient number of believers. Of course, this is also related to the level of the believers. A strong believer will contribute a stronger power of faith.”<br/><br/>“After they have a sufficient amount of power of faith, they only need to temper their heart of faith. This will allow their heart of faith to perfectly control all the energy and believers.”<br/><br/>“The tempering of the heart of faith mainly requires the power of faith.”<br/><br/>“What if the kings of the gods who believe in the universe concentrated all the power of faith on a Great Dao level powerhouse?”<br/><br/>Wang Xian looked at the powerful energy in that direction and pondered in his heart.<br/><br/>He had a guess.<br/><br/>This guess was not a good thing for them.<br/><br/>If that was the case, it would be a huge problem for the Dragon Palace.<br/><br/>If the belief in the universe really gave birth to a chaos-level existence, it would be impossible for the Dragon Palace to kill a chaos-level existence.<br/><br/>Even if Wang Xian was powerful now, it would be difficult to kill him together with the experts of the Dragon Palace.<br/><br/>“Let’s rush over immediately.”<br/><br/>Wang Xian said decisively.<br/><br/>He looked in that direction, took out the map, and checked it.<br/><br/>He was near the location where a demonic altar was teleported to.<br/><br/>It wouldn’t take long to get there.<br/><br/>“An lie, let’s go.”<br/><br/>Wang Xian called an lie over and transmitted all the information into his mind.<br/><br/>“It’s the Dragon King!”<br/><br/>An lie nodded.<br/><br/>At the next moment, he led Wang Xian and the rest and teleported in that direction!<br/><br/>“Let’s Go!”<br/><br/>After being teleported to a certain location, Wang Xian looked in that direction and ordered all the powerhouses of the Dragon Palace.<br/><br/>“Dragon King, should we investigate it carefully to prevent them from laying a trap there?”<br/><br/>The King of Void looked at Wang Xian and said.<br/><br/>“No, we have to rush over as soon as possible. If I’m not wrong, the king of all gods who believes in the universe wants to create a chaos-level existence.”<br/><br/>Wang Xian shook his head solemnly. With a wave of his arm, energy enveloped all the powerhouses of the Dragon Palace and brought them away quickly.<br/><br/>“What? They want to create a chaos-level existence?”<br/><br/>When the king of Void heard that, he was slightly shocked. “Is it so easy to create a chaos-level existence?”<br/><br/>“If they focus all their faith on one great dao-level existence, it might not be possible.”<br/><br/>Wang Xian replied.<br/><br/>“This? “It seems that we have really forced them into a desperate situation. If the king of Pantheon believes in a powerhouse, it is equivalent to them becoming the slave and follower of that powerhouse. They have to obey the orders of the people they believe in.”<br/><br/>“Moreover, they need to contribute their own strength. Once they believe in other experts, their own strength will be greatly reduced.”<br/><br/>Mo Sha knew more about the cultivation methods of the belief universe.<br/><br/>After he heard it, he was a little shocked and continued, “However, the current situation is indeed the best choice for them. Dragon King, we can not let them break through!”<br/><br/>“Yes, we can’t let him break through. Once he breaks through, it will be a huge problem.”<br/><br/>Wang Xian nodded his head.<br/><br/>He stared at the energy in front of him as his eyes sparkled.<br/><br/>The energy there was extremely huge. In addition, the pressure was getting stronger and stronger.<br/><br/>“It won’t be that fast if I want to break through to the realm of chaos. I only need a day to get there. I can make it in time!”<br/><br/>Wang Xian thought to himself as he flew over quickly.<br/><br/>A day later, Wang Xian and the rest arrived in front of the massive energy.<br/><br/>Wang Xian stared ahead with his dragon eyes. He could vaguely see the palace master of the first God Palace floating in the void.<br/><br/>In front of him, a group of kings who believed in the gods knelt below him and offered their strength!<br/><br/>“Attack. This time, even if we are injured, we have to kill them. Let’s not waste time with them. Kill them!”<br/><br/>Wang Xian stared at them and ordered the experts of the Dragon Palace.<br/><br/>The strength of the belief universe was too strong.<br/><br/>Now, they actually wanted to create chaos with belief.<br/><br/>This was something that Wang Xian did not expect.<br/><br/>In order to prevent any unforeseen circumstances, he decided to launch a fierce attack.<br/><br/>Even if it was a serious injury, he would not hesitate.<br/><br/>“It’s the Dragon King!”<br/><br/>The experts of the Dragon Palace also realized the seriousness of the situation and nodded their heads heavily.<br/><br/>“Kill!”<br/><br/>Wang Xian had already recalled the body of the Void Divine Dragon.<br/><br/>He stared at the Divine One Palace Master in front of him and flew over quickly.<br/><br/>Buzz<br/><br/>The void disk was suspended in the air and emitted a terrifying energy.<br/><br/>Boom<br/><br/>Following that, before the divine one palace master and the rest could react.<br/><br/>An extremely terrifying energy attacked the king of all gods who was kneeling in the air.<br/><br/>He did not attack the divine one palace master who was floating there.<br/><br/>Currently, the strength of this divine one palace master had increased.<br/><br/>Wang Xian might not be able to kill him if he attacked him from such a long distance.<br/><br/>As long as the other kings of all gods were killed first, it would also greatly weaken their strength.<br/><br/>The void disk ignored the attacks from space and landed on the bodies of the kings of all gods who were kneeling.<br/><br/>With Wang Xian’s strength, he could sense them from such a long distance. They could not sense him.<br/><br/>Furthermore, the disk of nothingness ignored the attacks of space, causing the kings of the gods to have no time to react.<br/><br/>This was especially so for the kings of the gods. Due to their belief in the first palace master of the gods, their strength had been reduced.<br/><br/>Under such circumstances, there were five kings who had just entered the Heavenly Yuan realm of creation who believed in the gods, but they did not have time to react!\t\t\t\t\t\t</div>", "images": {}, "success": true}