{"id": 1411, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075396.html", "title": "Chapter 4414 - Chapter 4414: 4413 Faith Created Chaos", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4414 - Chapter 4414: 4413 Faith Created Chaos</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4414: 4413 faith created chaos<br/><br/>“Weng!”<br/><br/>The more than 20 kings of the gods in the belief universe instantly left.<br/><br/>They appeared in a secret realm in the belief universe!<br/><br/>The kings of the gods looked at God One Palace Master with a hint of determination on their faces.<br/><br/>“God one palace master, Let’s start quickly. The Dragon King and the others should be coming soon!”<br/><br/>One of the kings of the gods said in a deep voice.<br/><br/>“Huh?”<br/><br/>Palace Master Shenyi was about to nod when he sensed the sudden appearance of the black hole at the side. His expression changed drastically.<br/><br/>“Oh no, they are chasing us. Run!”<br/><br/>Palace Master Shenyi roared loudly. The scroll in his hand emitted light again.<br/><br/>The light enveloped all the kings of the gods once again.<br/><br/>Buzz<br/><br/>When Wang Xian and the rest came out of the black hole, they saw that the kings of the gods who believed in the universe had disappeared again.<br/><br/>“Can we escape?”<br/><br/>Wang Xian said faintly and used the netherworld dragon to pursue them again.<br/><br/>They had the remnant power of wind and thunder left behind by Wang Xian, so they could not escape!<br/><br/>Buzz<br/><br/>More than twenty kings of the gods who believed in the universe were teleported to a faraway place once again.<br/><br/>However, what made them nervous was that the black hole appeared once again.<br/><br/>This caused their expressions to change drastically.<br/><br/>“Palace Master Shenyi, this won’t do. What method does the other party have to lock onto us? We must first remove this lock.”<br/><br/>Sacred Palace Master roared loudly!<br/><br/>“Continue to escape. After escaping to another place, immediately use the unsullied faith to block your own Karma!”<br/><br/>Palace Master Shenyi said in a deep voice.<br/><br/>He activated the scroll once again.<br/><br/>The scroll emitted light and slowly began to collapse.<br/><br/>He was only going to use it one last time.<br/><br/>“Weng.”<br/><br/>“Everyone, use it together.”<br/><br/>When they escaped again, Palace Master Shenyi roared loudly.<br/><br/>They immediately used the secret technique of the power of faith, unsullied faith, and did not touch karma.<br/><br/>This technique could block all tracking and locking.<br/><br/>Even if the three diviners who divined the universe worked together, they would not be able to divine their information.<br/><br/>“Which one of you still has a treasure for escaping? Hurry up and take it out. I only have a treasure for escaping alone!”<br/><br/>After performing the secret technique, the divine one palace master asked loudly.<br/><br/>“I have it. Don’t resist!”<br/><br/>The divine divine palace master took out a treasure for escaping. Light enveloped everyone before he left once again.<br/><br/>At the same time, Wang Xian was in pursuit.<br/><br/>He didn’t quite understand what the plan was for the kings of the gods who believed in the universe to escape.<br/><br/>However, every time they left together, he frowned slightly.<br/><br/>It should not be as simple as escaping.<br/><br/>“Eh? I can’t lock onto them anymore? The wind and thunder powers that were attached to them have also disappeared.”<br/><br/>When he activated the Netherworld Dragon’s pursuit for the third time, Wang Xian frowned slightly.<br/><br/>He could not lock onto them anymore!<br/><br/>“Mosha, shadowless void, can you lock onto their location?”<br/><br/>Wang Xian asked Mosha and shadowless void and took out the divination lamp.<br/><br/>“I can’t sense them. They must have used some kind of method to block their own aura.”<br/><br/>The King of void shook his head and frowned.<br/><br/>Mosha also shook his head.<br/><br/>Wang Xian used the divination lamp to check but didn’t get any information.<br/><br/>The divination lamp also lost its effect.<br/><br/>“It seems like it’s not that easy to destroy the universe of faith.”<br/><br/>Wang Xian mumbled as he swept his gaze across all his subordinates. “Since they have escaped, let’s Go and slaughter their believers. With their believers dead, their strength will naturally be reduced. By then, we will be able to lock onto them.”<br/><br/>“It’s the Dragon King!”<br/><br/>“We will listen to your orders, Dragon King!”<br/><br/>The group of experts from the Dragon Palace immediately responded.<br/><br/>“There’s no more pursuit. This place is extremely remote. As long as the Dragon King can not teleport to us, it will take at least a few months, or even a few years, or even more than ten years for him to arrive here!”<br/><br/>“There’s plenty of time. It’s enough to allow the Lord of the first God Palace to achieve a breakthrough.”<br/><br/>At this moment, in a corner of the belief universe, the group of kings of the gods heaved a heavy sigh of relief when they saw that the Dragon King did not pursue them.<br/><br/>At this moment, the power of their belief was still fused together.<br/><br/>Because only in this way could their secret techniques block the detection and lock-on of the chaos level.<br/><br/>“Then let’s begin.”<br/><br/>The first God Palace Master took a deep breath and said.<br/><br/>At this moment, he was a little excited.<br/><br/>Although the Dragon Palace had invaded his belief universe.<br/><br/>But for him, this might be the opportunity to step into the chaos level.<br/><br/>The Primal Chaos Realm, this realm, was once a realm that he did not dare to imagine.<br/><br/>Now, he had great hopes of stepping into it.<br/><br/>“Alright!”<br/><br/>“Let’s begin!”<br/><br/>“Senior God One Palace Master, I hope that you will do as you say. From now on, we will trust you unconditionally.”<br/><br/>The kings of the gods looked at God one palace master and said solemnly.<br/><br/>Palace Master Shenyi nodded.<br/><br/>The kings of the gods looked at each other and slowly walked to the front of Palace Master Shenyi.<br/><br/>They knelt on the ground and prostrated.<br/><br/>There was a circle of light behind Palace Master Shenyi.<br/><br/>In the circle of light, there were the shadows of countless believers.<br/><br/>These believers prostrated, knelt, and prayed.<br/><br/>Holy Voices came from the circle of light, making people want to worship.<br/><br/>“Lord God One Palace Master, I, the Palace Master of the Sacred Palace, will worship you as my master. I am willing to give up my life, my strength, and my faith to become your most devout believer. I will remember your name and praise your name.”<br/><br/>“Lord God One Palace Master, I, the Palace Master of the Sun Glory Palace, Saint Tianyang, will worship you as my master. I am willing to give up my life, my strength, and my faith to become your most devout believer. I will remember your name and praise your name.”<br/><br/>“Lord Shenyi Palace Master, I…”<br/><br/>The Kings of the gods prostrated in front of Shenyi Palace master and swore.<br/><br/>At the same time, the power of faith and the power of life were injected into Shenyi Palace master’s body.<br/><br/>Shenyi Palace master stood there, his eyes full of excitement and excitement.<br/><br/>He could feel the unparalleled power of faith surging into his body.<br/><br/>He could feel that his strength was increasing at a terrifying speed.<br/><br/>“Boom!”<br/><br/>The power of faith rushed into the starry sky, forming terrifying heaven and earth phenomena.<br/><br/>The Phantom of the first God Palace master slowly stood in the universe, incomparably huge.<br/><br/>The kings of the gods believed in the first God Palace Master and would offer up their power of faith.<br/><br/>The amount offered would be half of their own power of faith.<br/><br/>The aura of the first palace master of the gods was rising.<br/><br/>The aura of the other kings of the gods was indeed decreasing.<br/><br/>This process of worship would last for a few days.<br/><br/>After a few days, the first palace master of the gods would definitely step into the chaos level.<br/><br/>“HMM?”<br/><br/>At the same time, in the belief universe.<br/><br/>Wang Xian suddenly looked in a direction and revealed a surprised expression.<br/><br/>He could clearly sense that there was a terrifying energy fluctuation of faith.<br/><br/>This energy fluctuation was different from the gathering of the kings of the gods.<br/><br/>It carried an inexplicable pressure.\t\t\t\t\t\t</div>", "images": {}, "success": true}