{"id": 1419, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075436.html", "title": "Chapter 4422 - Chapter 4422: 4421 Shook The Underground Of The Land Of Origin", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4422 - Chapter 4422: 4421 Shook The Underground Of The Land Of Origin</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4422: 4421 shook the underground of the land of origin<br/><br/>When more and more information was dug out.<br/><br/>The other universe masters around the land of origin were even more shocked.<br/><br/>It was fine that the Dragon King of the Dragon Palace had the strength of the chaos level.<br/><br/>He actually led more than 30 heavenly Yuan creator powerhouses.<br/><br/>That was more than 30 of them.<br/><br/>Which universe could resist such an invincible force?<br/><br/>Which universe could resist it?<br/><br/>This power was so powerful that the Dragon King could destroy whichever universe he wanted to destroy.<br/><br/>It was so powerful that it made people’s hair stand on end.<br/><br/>It was so powerful that they couldn’t even think of resisting it.<br/><br/>Now, the power of the Dragon Palace was invincible.<br/><br/>In the land of origin, it divined the bamboo forest that the universe occupied.<br/><br/>On this day, the powerful diviners of the universe were in a courtyard in front of a small wooden house.<br/><br/>In front of a table in the middle, three old men were sitting there.<br/><br/>They were the three great prophets of the divination universe.<br/><br/>Prophet Hong, Prophet FA, and no prophet!<br/><br/>There were also five heaven origin creation existences of the prophetic universe around them.<br/><br/>“The sky has changed, completely changed. Such a powerful existence has been born around our land of origin. I don’t know if it’s a good thing or a bad thing.”<br/><br/>The prophet sighed and looked at prophet Hong. “Old Hong, you’ve dealt with the Dragon King before. What do you think of Him?”<br/><br/>“He’s very strong. He’s really strong. It’s not a problem for him to kill me in an instant. He gives me a feeling that he hasn’t just stepped into the chaos level. He shouldn’t be very weak among the chaos levels.”<br/><br/>“In addition, the Dragon King can not be provoked. It’s not just his strength. After some conflicts and negotiations with the Dragon King the last time, I can see that this dragon king is someone who will take revenge.”<br/><br/>“However, I have investigated the situation of the Void Universe and the firmament universe, and I can also conclude that these two universes were the first to offend the Dragon King before they were destroyed.”<br/><br/>“However, in the Void Universe and the Cang Heaven Universe, the Dragon Palace did not carry out a massacre. Instead, they took away the resources and killed the disciples of the top experts. They did not kill the ordinary creatures.”<br/><br/>“I also knew that the Dragon King wanted to destroy the belief universe in advance. However, I did not expect that they would destroy the belief universe in such a short time!”<br/><br/>Prophet Hong spoke one by one.<br/><br/>His face was full of emotion and shock.<br/><br/>Thinking back, he had almost walked to the opposite side of the Dragon King.<br/><br/>Once he really walked to the opposite side, what awaited him might be a disaster.<br/><br/>Although the divination universe was strong, the belief universe was stronger.<br/><br/>They couldn’t divine the strength of the Dragon Palace, but they could divine the strength of the belief universe.<br/><br/>Just now, the three prophets had divined the strength of the belief universe at its peak.<br/><br/>The result was that when the belief universe faced the Dragon Palace, there were three existences at the level of Great Dao.<br/><br/>This shocked them again.<br/><br/>Three existences at the level of Great Dao, and more than twenty people at the Heavenly Yuan realm of creation.<br/><br/>This strength was much, much stronger than their divination of the universe.<br/><br/>“From the looks of it, the Dragon King’s attack on the universe is at least much better than his belief in the universe.”<br/><br/>The Prophet said lightly.<br/><br/>“That depends on whether the dragon king is ambitious or not. After they destroy the belief universe, their strength will receive a huge increase. Besides, according to my investigation, the strength of the dragon palace experts has increased very quickly. They must have other powerful heaven and Earth Fortunes!”<br/><br/>Prophet Hong said.<br/><br/>They didn’t know what the future would be like.<br/><br/>“No matter what, he is the king of our region. It’s better for us to show our goodwill by divining the universe. After the Dragon Palace completely destroys the universe of faith, we will go to the nine-origin universe to visit the Dragon King of the Dragon Palace.”<br/><br/>“Let’s go and make friends with those treasures.”<br/><br/>The Prophet suggested.<br/><br/>His words were agreed by the Prophets Hong and FA.<br/><br/>Now that it was the calamity, they had to curry favor with such a powerful force.<br/><br/>Make friends with them.<br/><br/>This way, if they accidentally offended the dragon palace in the future, they could also say a few words.<br/><br/>In fact, it wasn’t just divining the universe at this time.<br/><br/>The powerhouses of the Heavenly Yuan creation in the other universes were also thinking about this matter.<br/><br/>That was, they had to visit the Dragon Palace in the nine-origin universe in the future.<br/><br/>They had to take the treasures and curry favor with the Dragon Palace.<br/><br/>They had to prevent the Dragon Palace from being ambitious enough to directly destroy their universe.<br/><br/>If they really wanted to attack them, then without the Dragon King’s help, the powerhouses of the Dragon Palace alone would be able to destroy their universe.<br/><br/>They had to curry favor with them.<br/><br/>It could also be said that it was a form of offering and paying protection fees.<br/><br/>I paid the protection fees and hoped that the Dragon King would not attack our universe.<br/><br/>At this moment, Wang Xian did not know that the news of them destroying the belief universe had spread to the land of origin.<br/><br/>At this moment, he was still pursuing the kings of the gods who believed in the universe.<br/><br/>However, the pursuit had come to an end.<br/><br/>Basically, all the kings of the gods had been killed.<br/><br/>Even those who had escaped had their strength reduced to that of a ruler due to the death of a large number of believers.<br/><br/>They were in the boundless chaos and could not survive at all.<br/><br/>Another five thousand years passed.<br/><br/>On this day, Wang Xian killed all the experts in the belief universe.<br/><br/>When he arrived at the center of the belief universe, a temporary palace built by the Dragon Palace was suspended in the sky.<br/><br/>“Dragon King!”<br/><br/>Sensing Wang Xian’s arrival, Prime Minister Gui immediately flew over.<br/><br/>“How is it? Have you dealt with the situation in the three universes?”<br/><br/>Wang Xian asked Prime Minister Gui with a smile.<br/><br/>The harvest of the Dragon Palace this time could be said to be unprecedented.<br/><br/>The resources of the three universes.<br/><br/>A large number of faith hearts.<br/><br/>“Dragon King, it will probably take a few thousand years before we can collect all the resources of the three universes.”<br/><br/>Prime Minister Gui smiled. “However, we have already collected all the resources of the Faith Universe.”<br/><br/>“Alright, there’s no rush.”<br/><br/>Wang Xian nodded with a smile.<br/><br/>He came to the position in the palace and took out two treasures with a flick of his palm.<br/><br/>Two Ultimate Treasures of Tianyuan!<br/><br/>These two treasures belonged to the Divine One Palace Master and the Divine Sacred Palace Master.<br/><br/>In the entire universe, there were two ultimate treasures of Tianyuan.<br/><br/>Now, they belonged to the Dragon Palace.<br/><br/>One was of the water attribute while the other was of the light attribute.<br/><br/>They were both attack-type.<br/><br/>With Wang Xian’s current strength, he couldn’t control so many ultimate treasures.<br/><br/>Naturally, these two supreme treasures were given to the powerhouses of the Dragon Palace.<br/><br/>Just these two supreme treasures were equivalent to adding six powerhouses of the Heaven’s origin creation who had just entered the beginner stage to the Dragon Palace.<br/><br/>There were also a few treasures that were comparable to the void Dragon Pool.<br/><br/>It had to be said that the belief universe was really rich.<br/><br/>There were really many treasures.<br/><br/>“The only pity is that my strength can not be improved.”<br/><br/>Wang Xian mumbled.<br/><br/>After this, the Dragon Palace would have a qualitative leap!\t\t\t\t\t\t</div>", "images": {}, "success": true}