{"id": 1415, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075416.html", "title": "Chapter 4418 - Chapter 4418: 44.17 Million Years Of Battle, Killing Them One By One", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4418 - Chapter 4418: 44.17 Million Years Of Battle, Killing Them One By One</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4418: 44.17 million years of battle, killing them one by one<br/><br/>“Kill!”<br/><br/>A terrifying battle broke out.<br/><br/>The kings of the gods who believed in the universe saw that they had no way to escape.<br/><br/>They saw that the Dragon King of the Dragon Palace was going to fight them to the death.<br/><br/>Their faces were filled with determination.<br/><br/>Kill!<br/><br/>There was no way to escape!<br/><br/>The battle between the kings of the gods was exactly what Wang Xian wanted.<br/><br/>After breaking through to the primal chaos realm, this was the first time he was able to have such a satisfying battle.<br/><br/>A great battle broke out!<br/><br/>The great battle continued!<br/><br/>The only advantage of the kings of the gods who believed in the universe was that they had the power of faith, allowing them to fuse and battle more.<br/><br/>On the other hand, Wang Xian and the rest had the advantage.<br/><br/>They had a strong advantage.<br/><br/>The intense collision continued in the belief universe.<br/><br/>All the experts were giving it their all.<br/><br/>Wang Xian also unleashed all his strength.<br/><br/>The great battle continued day by day.<br/><br/>“Not good, my strength has dropped. The Gods of our Qianyuan Palace are being hunted crazily. My realm has dropped!”<br/><br/>A few years later, on the side of the king of the gods, the Qianyuan Palace master shouted in horror.<br/><br/>His words made all the kings of the gods’expressions sink.<br/><br/>But they couldn’t do anything about it.<br/><br/>The Dragon Palace and the others were completely suppressing them.<br/><br/>They had to maintain their peak combat strength at all times.<br/><br/>“Order all the gods to escape immediately. Don’t gather together and don’t be killed by the disciples of the Dragon Palace!”<br/><br/>Palace master Shen Yi ordered with an ugly expression.<br/><br/>“Yes!”<br/><br/>The kings of the gods immediately replied.<br/><br/>The battle continued.<br/><br/>However, in the belief universe, Prime Minister Gui led the disciples of the Dragon Palace and chased after the gods one by one.<br/><br/>With the power of the Dragon Palace, the gods couldn’t resist at all.<br/><br/>“Our king of the gods is completely restrained by the experts of the Dragon Palace. A terrible battle is happening in the center. The Dragon Palace is too powerful. We have to escape separately.”<br/><br/>“Hiss, how can a force in the universe be so powerful? How is this possible? The power of the battle coming from the center is too terrifying!”<br/><br/>“Believe in our king of the gods. They will definitely expel the Dragon Palace.”<br/><br/>The entire belief universe was boiling.<br/><br/>Countless gods began to flee frantically.<br/><br/>The terrifying battle coming from the center shocked everyone!<br/><br/>Even though they were very far away, they could still feel the aura that made them almost despair.<br/><br/>It was too terrifying!<br/><br/>The gods of the belief universe were fleeing in different directions, which indeed reduced the hunting speed of the disciples of the Dragon Palace.<br/><br/>However, they continued to hunt down the gods one by one.<br/><br/>Every year, many gods died at the hands of the disciples of the Dragon Palace.<br/><br/>The belief universe was engulfed by war.<br/><br/>One thousand years, two thousand years, three thousand years…<br/><br/>At the center of the battlefield, the war continued.<br/><br/>The endurance of a powerhouse in the Heaven’s origin realm was extremely terrifying.<br/><br/>The intensity of this war was at its maximum.<br/><br/>The attack power was at its maximum.<br/><br/>The violent attacks continued without any reduction.<br/><br/>The injuries on Wang Xian’s body gradually increased.<br/><br/>However, these injuries were not fatal or serious.<br/><br/>Compared to Wang Xian, the kings of Pantheon were much more miserable.<br/><br/>Out of the twenty kings of pantheon, less than half of them had their strength reduced during this period of time.<br/><br/>Now, all of their faces were extremely pale. They felt like they were at the end of their rope.<br/><br/>The battle had been going on for more than 9,000 years!<br/><br/>The continuous battle for nearly 10,000 years had weakened their power of faith by a lot.<br/><br/>Their bodies were trembling and there was a hint of despair on their faces.<br/><br/>At this moment, the experts from the Dragon Palace surrounded them.<br/><br/>Every attack caused their bodies to tremble violently.<br/><br/>From time to time, some kings of the gods spat out blood.<br/><br/>After fighting for nearly 10,000 years, Wang Xian and the rest did not give the kings of gods any chance to escape.<br/><br/>There was only one possibility for them to escape, and that was to escape one by one.<br/><br/>It was impossible for them to escape as a whole.<br/><br/>They could not attack at all times!<br/><br/>“PFFT!”<br/><br/>At this moment, the first God Palace master suddenly spat out a large amount of fresh blood.<br/><br/>“Not good, my realm has dropped. Many of the Gods of my first God Palace are being massacred!”<br/><br/>The first God Palace master roared in fear.<br/><br/>At this moment, he was truly panicking.<br/><br/>Previously, he had already absorbed the power of faith of the kings of the gods, and his strength had reached two great dao realms.<br/><br/>But now, his strength had once again returned to a Great Dao realm.<br/><br/>His strength had decreased rapidly.<br/><br/>Furthermore, he had a bad premonition about the current situation.<br/><br/>He was probably done for.<br/><br/>“Lord God One Palace Master, I can’t hold on any longer. The power of faith in my body has been exhausted!”<br/><br/>At this moment, another piece of bad news came.<br/><br/>“Lord God One Palace Master, I can’t hold on any longer either. The energy in my body can only hold on for a few more hours at most!”<br/><br/>“I’m also running out of energy!”<br/><br/>The early-stage kings of the gods couldn’t hold on any longer.<br/><br/>After fighting for close to 10,000 years, their energy was running out.<br/><br/>“Die!”A total of 10 early-stage kings of the gods roared in fear!<br/><br/>Their words made everyone’s hearts sink.<br/><br/>A few hours passed in the blink of an eye. The massive belief giant started to shrink and its energy started to thin out.<br/><br/>“Their strength is decreasing rapidly. Let’s kill them all in one go!”<br/><br/>Wang Xian sensed the change in the giant of faith and shouted loudly!<br/><br/>Boom<br/><br/>He waved his dragon claw. This time, he easily broke through the giant of Faith’s defense.<br/><br/>Following the depletion of the energy of the nearly ten newly-entered king of Pantheon, the giant of faith could no longer resist Wang Xian.<br/><br/>“Hehehe, kill them, kill them!”<br/><br/>Mo Sha and the rest had excited looks in their eyes as they charged forward.<br/><br/>Cracks appeared on the belief giants’bodies as cracks appeared one after another.<br/><br/>Mo Sha and the kings of the void charged forward and approached the kings of the gods.<br/><br/>“Boom!”<br/><br/>Wang Xian opened his huge dragon mouth and spat out a mouthful of dragon breath, directly crushing the head of the belief giants!<br/><br/>The giant of faith had collapsed!<br/><br/>“It’s over!”<br/><br/>When the kings of gods saw the experts of the Dragon Palace attacking, their faces were filled with despair.<br/><br/>Wang Xian’s golden eyes locked onto the king of gods. A terrifying ray of light shot towards him.<br/><br/>Thump<br/><br/>The king of gods sensed the attack and wanted to order the kings of gods to join hands to block it.<br/><br/>However, at this moment, every king of the gods suffered a terrifying attack.<br/><br/>They couldn’t care about anything else.<br/><br/>Faced with the terrifying golden rays, the first God Palace Master couldn’t resist at all!<br/><br/>His body was directly penetrated and his life force dissipated!<br/><br/>At this point, the first God Palace Master, who believed in the universe supreme master, was completely destroyed.<br/><br/>What awaited them next was the pursuit of Wang Xian!\t\t\t\t\t\t</div>", "images": {}, "success": true}