{"id": 1418, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075431.html", "title": "Chapter 4421 - Chapter 4421: 4420 Within The Land Of Origins", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4421 - Chapter 4421: 4420 Within The Land Of Origins</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4421: 4420 within the land of origins<br/><br/>“The strength of the other party is at least comparable to two great dao realm experts, or even stronger.”<br/><br/>Senior Tian Quan said slowly.<br/><br/>He saw that two of his companions were missing and sighed helplessly.<br/><br/>The other party’s strength was too strong, causing them to not dare to act rashly.<br/><br/>“That’s right, that expert should know that he killed the Vice Palace Master of the belief Cosmos God Palace. It seems that this expert also came from a powerful cosmos.”<br/><br/>A heaven origin manifestation expert sighed, “However, the Vice Palace Master of the belief Cosmos God Palace is the biological son of the god Cosmos God Palace Master. His strength is very strong. I wonder if there will be a huge battle.”<br/><br/>“It’s possible. It has been quite some time since the calamity arrived. All sorts of chaos will erupt one by one. Even though we are strong, we still have to be careful.”<br/><br/>An old man said solemnly!<br/><br/>What happened just now shocked them greatly.<br/><br/>Time passed day by day. Wang Xian was crazily hunting down the kings of the gods in the belief universe.<br/><br/>The powerhouses of the Dragon Palace were also hunting down the gods in the belief universe and collecting the treasures in the belief universe.<br/><br/>Many treasures in the belief universe could assist the disciples of the powerhouses of the dragon palace in their cultivation.<br/><br/>Furthermore, there was no requirement for attributes.<br/><br/>In addition, the belief universe was a powerful existence that occupied three universes. They had too many treasures.<br/><br/>It was completely incomparable to the Void Universe and the Cang Heaven Universe.<br/><br/>Under the pursuit of Wang Xian, under the death of the gods one by one.<br/><br/>The number of kings of the gods in the belief universe was rapidly decreasing.<br/><br/>In five thousand years, out of the more than twenty kings of the gods who believed in the universe, ten of them were completely destroyed by Wang Xian.<br/><br/>The rest were still on the run.<br/><br/>Wang Xian was still pursuing them.<br/><br/>Since he wanted to destroy the belief universe, he would completely destroy it.<br/><br/>In the other five thousand years, the five disciples of the Dragon Palace who had already reached the breakthrough stage had also completed the breakthrough in the other two universes that were occupied by the belief universe.<br/><br/>This instantly increased the number of heavenly Yuan blessed realm experts in the Dragon Palace to five.<br/><br/>This increased the number of experts in the Dragon Palace to 32.<br/><br/>This was even before the Dragon Palace absorbed the resources of the belief universe.<br/><br/>At the same time, a piece of news from the land of origin suddenly caused all the experts in the universe to boil.<br/><br/>The belief universe had been destroyed!<br/><br/>When this news spread out, it immediately caused a huge sensation and uproar.<br/><br/>In the vicinity of the land of origin, there were over 100 Great Beings of the universe active here.<br/><br/>And out of these over 100 universes, the strength of the belief universe could be ranked in the top three.<br/><br/>However, it was such a powerful universe that had been destroyed.<br/><br/>This made all the experts feel incredulous.<br/><br/>“Is this for real? Is this a joke? The belief universe was actually destroyed? Didn’t they occupy another universe not long ago? How could it be destroyed? who could do it?”<br/><br/>“Yeah, the belief universe has more than 20 heaven origin creation realm experts. To destroy the belief universe is as difficult as ascending to the heavens. All the major universes around the land of origin don’t have the strength to do so, right?”<br/><br/>“That’s right. Is this true or false?”<br/><br/>All the powerhouses who saw this information asked in shock.<br/><br/>They didn’t believe it.<br/><br/>“It can be 100% confirmed. When I passed by the belief universe, I could feel that the power of belief in the belief universe was decreasing crazily.”<br/><br/>“It was indeed destroyed. I know a palace master of the belief universe. I got a crazy piece of information from him. The one who destroyed them was the Dragon Palace of the nine-origin universe. That Dragon Palace’s strength is extremely terrifying. There’s also another piece of shocking news. According to that palace master, that Dragon King of the Dragon Palace has the strength of Primal Chaos Realm!”<br/><br/>“What? The nine-origin universe’s Dragon Palace destroyed the belief universe? Was it just a power in a single universe? Combat Power at the primal chaos level? How is this possible? There has never been a primal chaos level existence near our land of origin.”<br/><br/>“I am 100% sure that if you have the guts, you can go to the belief universe to take a look. The war should not have completely ended, but it is already at the end stage. The kings of the gods of the belief universe are rapidly dying!”<br/><br/>“Chaos-level combat strength? Is this real or fake? It is simply unbelievable. However, if the belief universe is really destroyed, perhaps only chaos-level existences can do it!”<br/><br/>When the news spread one by one, all the experts near the land of origin were stunned.<br/><br/>Chaos-level existences.<br/><br/>There were actually experts near the land of origin who had reached this realm.<br/><br/>This was too unbelievable.<br/><br/>“This…”<br/><br/>At the same time, in a luxurious cave in the land of origin.<br/><br/>More than ten experts were sitting inside.<br/><br/>These experts were the ones who had met Wang Xian previously.<br/><br/>At this moment, they were looking at the information in their communication devices. All of them opened their mouths and their faces were filled with shock.<br/><br/>There was also a hint of lingering fear!<br/><br/>They didn’t have much doubt about this information.<br/><br/>Because they had seen the strength of the Dragon King of the Dragon Palace.<br/><br/>He was instantly killed.<br/><br/>His strength was unfathomable.<br/><br/>Two of their experts were instantly killed!<br/><br/>At this moment, the faces of the two experts who had been killed turned pale again.<br/><br/>“This… this… that Dragon King, he, he won’t continue to pursue us, right?”<br/><br/>One of the youths was tongue-tied as he spoke, his face deathly pale.<br/><br/>He was somewhat terrified.<br/><br/>They never would have thought that the expert they encountered last time, the expert they clashed with, was actually an existence at the primal chaos level.<br/><br/>He was actually the leader of the destruction of the belief universe.<br/><br/>If they were to be held responsible, they would be completely finished.<br/><br/>Even if their universe wasn’t weak, if they were to clash with a force that could destroy the belief universe, they would still end up dead.<br/><br/>“It shouldn’t be. We didn’t clash with him too much back then.”<br/><br/>The middle-aged man shook his head, his expression somewhat absent-minded.<br/><br/>Time passed once again.<br/><br/>During this period of time, the belief universe became the focus of attention around the land of origin.<br/><br/>As time passed, more and more information about the destruction of the belief universe became available.<br/><br/>“The belief universe was indeed destroyed, and the one who attacked was indeed the nine-origin universe’s Dragon Palace. The Dragon Palace’s Dragon King has the power of primal chaos, so it can be 100% confirmed.”<br/><br/>“The Dragon Palace’s Dragon King led more than 30 Heavenly Yuan creation realm powerhouses to destroy the belief universe, including the Void King of the Void Universe. Not long ago, the Void Universe was destroyed by the nine-origin universe, and the Void King of the Great Dao realm was suspected to have submitted to the Dragon King!”<br/><br/>“The strength of the Dragon Palace is extremely terrifying. They have the power to easily destroy a powerful universe. In addition, the firmament universe was destroyed not long ago by the Dragon King of the Dragon Palace. The firmament universe is also a powerful universe with a great dao level existence.”\t\t\t\t\t\t</div>", "images": {}, "success": true}