{"id": 1428, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075481.html", "title": "Chapter 4431 - Chapter 4431: 4430 Evil Sequences Came To Commit The Crime", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4431 - Chapter 4431: 4430 Evil Sequences Came To Commit The Crime</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4431: 4430 evil sequences came to commit the crime<br/><br/>“Who are you people? How dare you come to our carefree universe to wreak havoc? You’re courting death!”<br/><br/>Wan Xiaoyao and the rest stared at the demon with blood-red wings in the sky. Their eyes revealed a cold killing intent.<br/><br/>“HMM?”<br/><br/>The demon with blood-red wings looked at Wang Xian and the rest. His eyes were filled with coldness and bloodlust.<br/><br/>“The Heaven’s origin of this universe?”<br/><br/>He stared at them. His blood-red eyes slowly emitted a glow. “Are you inviting helpers? Let me experience your strength. hehehe!”<br/><br/>“Huala!”<br/><br/>The eyes of the demon with blood-red wings emitted a bloodthirsty glow. He flapped his wings and slashed a bloody scar. Then, he charged toward Wang Xian and the rest.<br/><br/>The terrifying aura and the overwhelming bloody smell assaulted them.<br/><br/>All kinds of negative energy surged over.<br/><br/>Even an ordinary heaven’s origin powerhouse would probably feel dizzy under this negative energy.<br/><br/>“Control level, you’re courting death!”<br/><br/>Wang Xian’s eyes were filled with a cold expression as he watched the demonic god charging at them.<br/><br/>Buzz<br/><br/>He waved his arm and a surge of energy directly restrained his body.<br/><br/>“What?”<br/><br/>The Demon God was instantly restrained by the terrifying energy.<br/><br/>Feeling that his entire body could not move, his blood-red eyes looked at Wang Xian who was reaching out his hand to grab at him. His face revealed a look of horror and shock.<br/><br/>“This is impossible!”<br/><br/>He roared loudly and wanted to break free!<br/><br/>“Bang!”<br/><br/>However, in the next moment, his body arrived in front of Wang Xian.<br/><br/>Wang Xian’s arm turned into a dragon claw and grabbed his body. He stared at him coldly.<br/><br/>“What universe are you guys from?”<br/><br/>As he spoke, he gestured to Wan Xiaoyao and the rest.<br/><br/>“All of you, die!”<br/><br/>“You killed the disciples of our universe. Die, die, die!”<br/><br/>Wan Xiaoyao and the rest moved their bodies and attacked all the demons in front of them.<br/><br/>These demons were at the level of the weak ones and the strong ones had already reached the Overlord realm.<br/><br/>However, they were still not enough to face the existence of the heaven origin blessed realm!<br/><br/>“You… You Can’t kill me. Don’t kill me. I’m from the evil sequence faction. If you kill me, our evil sequence faction will not let you off.”<br/><br/>The demonic god with blood-red wings stared at Wang Xian. He could feel the terrifying aura coming from Wang Xian’s body and shouted out involuntarily!<br/><br/>“Evil sequence faction?”<br/><br/>Wang Xian was slightly stunned when he heard his words. A look of astonishment appeared on his face.<br/><br/>How did the guy from the evil sequence faction end up here?<br/><br/>“Isn’t the evil sequence faction having a big battle with the Justice Alliance? I think you are an imposter, right?”<br/><br/>Wang Xian exerted force with his palm, causing his body to begin to transform!<br/><br/>“Ah!”<br/><br/>The blood-red winged demon god let out a blood-curdling scream, “I am an expert from the evil sequence faction. Our battle with the Justice Alliance has ended.”<br/><br/>“You have just ended and you want to invade our Universe?”<br/><br/>Wang Xian’s gaze turned cold as he stared at him coldly.<br/><br/>The deathly silent energy began to surge into his body.<br/><br/>“AH, if you dare to kill me, I will definitely not let you off. Definitely!”<br/><br/>The blood-red winged demon God let out a miserable cry. Wang Xian ignored him and slowly extinguished his life force!<br/><br/>Whoosh<br/><br/>He waved his arm and grabbed at a demon who was at the peak of the Dominator realm.<br/><br/>That Demon was instantly caught by Wang Xian.<br/><br/>“Soul Catcher!”<br/><br/>The Soul Catcher’s power was unleashed and streams of information entered Wang Xian’s mind.<br/><br/>“Huh?”<br/><br/>From the information obtained from this demon, they were indeed the universe of the evil sequence faction.<br/><br/>The war between the evil sequence faction and the Justice Alliance had indeed ended.<br/><br/>It could also be said that both sides had temporarily stopped fighting.<br/><br/>Both sides had been fighting for more than 100 million years.<br/><br/>There were 100 to 200 deaths and injuries among the heaven creation-level powerhouses.<br/><br/>There were even more deaths and injuries among disciples of their level.<br/><br/>Overall, the evil sequence faction had the upper hand.<br/><br/>As for the Justice Alliance, they had suffered heavy losses.<br/><br/>During the period of the truce, both sides had stopped fighting.<br/><br/>And now, the powerhouses of the evil sequence faction had decided to invade other universes to recover their strength.<br/><br/>Yes, the evil sequence faction had decided to attack other universes while the Justice Alliance was recuperating.<br/><br/>During this period, the Justice Alliance would not make a move against them.<br/><br/>In addition, this war between the evil sequence faction and the Justice Alliance had let all the universes know that joining the Justice Alliance did not mean safety.<br/><br/>There was still the risk of death, and there was still the risk of being invaded.<br/><br/>Now, many universe masters from the evil sequence alignment camp had set their sights on the space in the land of origin.<br/><br/>They were not the only ones who had invaded the carefree universe.<br/><br/>In another place, there was a demon God at the control level leading his disciples to slaughter and devour living beings.<br/><br/>Their race’s cultivation method.<br/><br/>As long as they devoured a large number of living beings, their strength would be enhanced.<br/><br/>It was a cruel race that fed on other living beings.<br/><br/>“Prime Minister Gui, I’ll leave this side to you. I’ll go to the other side. There are two experts at the control level who have invaded the carefree universe. There’s another one in that direction. I’ll go and kill it!”<br/><br/>Wang Xian said to Prime Minister Gui. His body moved and he flew in that direction quickly.<br/><br/>Three days later, Wang Xian arrived in another void.<br/><br/>However, when he arrived, all that was left was a broken planet. All the demons had escaped.<br/><br/>“They must have received a message from another place. However, can you guys escape?”<br/><br/>Wang Xian took out the lamp of divination and divined the auras of these demons.<br/><br/>He realized that these demons had yet to escape from the carefree universe.<br/><br/>Wang Xian flew over quickly and pursued them at a terrifying speed.<br/><br/>Ten days later, Wang Xian arrived at a piece of void space and saw a large number of demons flying out of the carefree universe.<br/><br/>There were hundreds of thousands of demons and they were exuding a terrifying aura.<br/><br/>The leader was a powerful demon god with a pair of demon horns and a mouth that occupied half of its head.<br/><br/>Bright red blood was flowing from his body. His triangular pupils were filled with a cold aura!<br/><br/>He had a long snake tail!<br/><br/>“Since you are here, you should stay here forever. You Dare to invade the universe of the Dragon Palace Alliance? Die!”<br/><br/>Wang Xian’s cold voice that was filled with killing intent enveloped all the demons.<br/><br/>Following that, the space around them began to tremble.<br/><br/>Waves of terrifying spatial energy sliced through their bodies!<br/><br/>“Oh no, they are chasing us?”<br/><br/>When the demon god with the snake tail heard Wang Xian’s voice and sensed the changes in the surrounding space, his expression changed drastically.<br/><br/>Not long after his companion died, he received a message.<br/><br/>Without hesitation, he led his subordinates and prepared to leave.<br/><br/>However, he did not expect to be caught and locked onto so quickly.<br/><br/>He moved his hand and took out a treasure. Without any hesitation, he crushed it.<br/><br/>He wanted to escape.\t\t\t\t\t\t</div>", "images": {}, "success": true}