{"id": 1420, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075441.html", "title": "Chapter 4423 - Chapter 4423: 4422, A Visit From The Other Universe Masters", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4423 - Chapter 4423: 4422, A Visit From The Other Universe Masters</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4423: 4422, a visit from the other universe masters<br/><br/>“Dragon King, all the resources have been collected.”<br/><br/>Time passed day by day, and all the resources of the three universes had been collected by the Dragon Palace.<br/><br/>Prime Minister GUI reported this news excitedly.<br/><br/>“Alright, since all the resources have been collected, let’s return to the Dragon Palace. Next, we will digest these resources.”<br/><br/>Wang Xian said with a smile.<br/><br/>“Okay!”<br/><br/>Prime Minister Gui nodded.<br/><br/>Following that, the Army of the Dragon Palace quickly returned to the nine-origin universe under the lead of an lie.<br/><br/>“Roar!”<br/><br/>“Roar!”<br/><br/>A large amount of resources and treasures were transported over. This made all the strong disciples of the Dragon Palace extremely excited.<br/><br/>That huge amount of resources was much more than the previous harvest!<br/><br/>“Dragon King, these are the more precious resources that we obtained this time. Please take a look.”<br/><br/>Prime Minister Gui walked over, took out a list, and handed it to Wang Xian.<br/><br/>Wang Xian took it and looked at it carefully.<br/><br/>The resources of the three universes, especially the resources obtained from the belief universe, some powerful treasures, and even possessed the ability to defy the heavens and change one’s fate.<br/><br/>Even the powerhouses in the Heaven’s origin realm would be envious of the treasures.<br/><br/>Among them, there were many resources that were of great benefit to the powerhouses in the Heaven’s origin realm.<br/><br/>As for the treasures that were more precious to those in the ruler realm, there were simply too many of them!<br/><br/>“Not bad, not bad. However, currently, the most precious thing is still a large number of faith hearts. These faith powers are the most precious treasures to the disciples of the powerhouses in the Dragon Palace.”<br/><br/>Wang Xian smiled as he looked at the information about these resources.<br/><br/>This time, the most precious thing was naturally a large number of faith hearts.<br/><br/>There were more than 60 Faith Hearts in the Heaven’s origin blessed realm.<br/><br/>They ranged from the initial stage to the Great Dao stage.<br/><br/>As for the Faith Hearts in the Pantheon stage, there were around two million of them.<br/><br/>This was a huge resource for the disciples of the Dragon Palace.<br/><br/>Following that, with these resources, the strength of the disciples of the Dragon Palace would increase tremendously.<br/><br/>“Distribute all the resources. Next, let the disciples of the Dragon Palace cultivate and improve.”<br/><br/>Wang Xian said, “In addition, let’s plant some renewable resources. It seems that we have to plan for the surroundings of the Dragon Palace.”<br/><br/>After obtaining the resources from the prideful universe, the Dragon Palace underwent a major transformation.<br/><br/>This time, the Dragon Palace needed to undergo another transformation.<br/><br/>This was because the divine trees, herbs, and flowers were not one-time items.<br/><br/>They were all treasures that could produce divine fruits.<br/><br/>The number of divine trees and the like that they harvested this time was also terrifying.<br/><br/>Now, the Dragon Palace had a large area and was filled with treasures of the ruler realm.<br/><br/>Now, the area had to be expanded by at least twice.<br/><br/>In the future, he could easily smash a divine item of the ruler realm with a rock in the Dragon Palace.<br/><br/>The treasures and resources that were being fought over outside were everywhere in the Dragon Palace.<br/><br/>“It’s the Dragon King.”<br/><br/>Prime Minister Gui nodded.<br/><br/>In the following period of time, Wang Xian began to transform the Dragon Palace with great interest!<br/><br/>“The nine-origin universe is up ahead. I’ll contact the Fallen Shadow Devil Emperor in the nine-origin universe first. Since I know him, there will be some benefits. Now that the Dragon Palace is so powerful, the status of the nine-origin universe will naturally be greatly enhanced.”<br/><br/>At the same time, not far from the nine-origin universe, seven figures were floating in the void.<br/><br/>These were the experts who divined the universe.<br/><br/>The three great prophets led the experts of their universe to the nine-origin universe.<br/><br/>They wanted to come and visit the Dragon Palace and befriend the Dragon Palace!<br/><br/>“That’s fine. I still have the Dragon King’s contact information here. I’ll inform the Dragon King in advance.”<br/><br/>Prophet Hong also said.<br/><br/>They didn’t enter the nine-origin universe rashly, but sent messages one after another.<br/><br/>“Huh?”<br/><br/>However, the fallen Shadow Demon Emperor, who was located at the heavenly path, was slightly stunned when he saw the message sent through a special method.<br/><br/>He knew the prophet of law who believed in the universe.<br/><br/>He was stunned when he saw the message sent by the prophet of law.<br/><br/>What was going on?<br/><br/>Their divination experts had come to the side of the nine-origin universe and were going to visit the Dragon King of the Dragon Palace?<br/><br/>The Shadow Demon Emperor was puzzled.<br/><br/>The Shadow Demon Emperor didn’t know the current situation of the Dragon Palace.<br/><br/>He didn’t even know the strength of the Dragon Palace.<br/><br/>He had been staying at the heavenly path all this time.<br/><br/>However, now that the war between the Justice Alliance and the evil sequence camp was getting more and more intense, he was ready to leave.<br/><br/>He was worried that there would be experts from the evil sequence faction ambushing this place.<br/><br/>However, why would an expert from the divination universe pay a visit to the Dragon Palace?<br/><br/>He immediately replied to the message and voiced his doubts.<br/><br/>However, he was stunned when he received another reply from the prophet.<br/><br/>His face was filled with disbelief.<br/><br/>How was this possible?<br/><br/>Buzz! Buzz! Buzz<br/><br/>In the domain of the Dragon Palace, Wang Xian was modifying it bit by bit.<br/><br/>The communication device vibrated. He took a look and revealed a surprised expression.<br/><br/>“Oh? An expert who divines the universe actually came to visit?”<br/><br/>Wang Xian raised his eyebrows and revealed a surprised expression.<br/><br/>After he replied with a welcome, he immediately sent a route over.<br/><br/>“Prime Minister Gui, a guest has arrived in our universe. Send someone to welcome him and show him some respect!”<br/><br/>Wang Xian transmitted his voice to Prime Minister Gui and sent him the location of the universe’s powerhouses.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded and immediately summoned five divine dragons in the Heavenly Yuan blessed realm to welcome him.<br/><br/>“The Dragon King has sent us a message. He wants us to go over directly. There are disciples from the Dragon Palace to welcome us.”<br/><br/>Outside the nine-origin universe, Prophet Hong said!<br/><br/>“Okay, let’s go there directly.”<br/><br/>The Masters of the universe-divination nodded and entered the nine-origin universe with the three prophets as the leaders.<br/><br/>In order to deal with the catastrophe, many teleportation arrays were set up at the edge of the nine-origin universe.<br/><br/>Prime Minister Gui and the others arrived at the edge of the nine-origin universe through the teleportation arrays.<br/><br/>It didn’t take long for them to meet the masters of the divination universe.<br/><br/>“Masters of the divination universe, right? Welcome, Welcome!”<br/><br/>Prime Minister Gui went up to them and said to the three prophets with a smile.<br/><br/>“Prime Minister Gui of the Dragon Palace, nice to meet you, nice to meet you!”<br/><br/>The three prophets instantly divined the information of Prime Minister Gui, smiled and cupped their hands, “We have long heard of the name of the Dragon Palace in the divination universe. We have long heard of the name of the Dragon King. Today, we are here to pay you a visit and offer some compliments. Sorry to disturb you!”<br/><br/>“Oh? No, no. Everyone, come with us!”<br/><br/>Prime Minister Gui raised his eyebrows and gestured to them with his hand!<br/><br/>The three prophets nodded and followed Prime Minister Gui and the others to the territory of the Dragon Palace through the teleportation array!<br/><br/>As soon as they walked out of the teleportation array, they were shocked by the magnificent energy and various resources around them!\t\t\t\t\t\t</div>", "images": {}, "success": true}