{"id": 1421, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075446.html", "title": "Chapter 4424 - Chapter 4424: 4423 Was Visited By The Other Universe Masters", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4424 - Chapter 4424: 4423 Was Visited By The Other Universe Masters</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4424: 4423 was visited by the other universe masters<br/><br/>“This… so many treasures, so many godly tree godly grass and godly flowers. They are everywhere.”<br/><br/>“Is this the headquarters of the Dragon Palace? Godly tree godly grass at the ruler level can be seen everywhere. The energy contained in the surroundings is too powerful.”<br/><br/>“This is simply a holy land for treasures. An ordinary cultivator can easily reach the ruler level here.”<br/><br/>The masters of divination came to the territory of the Dragon Palace. They looked around with shock on their faces.<br/><br/>There were treasures everywhere.<br/><br/>At the very least, they were at the ruler realm.<br/><br/>Moreover, as they got closer to the depths of the Dragon Palace, they encountered more and more treasures.<br/><br/>There were countless resources and treasures that could break through shackles and bloodlines.<br/><br/>In this place, even if one did not cultivate, just by devouring these resources, one could bring a disciple to the peak of the ruler realm.<br/><br/>There were too many good things!<br/><br/>There were even many rare treasures.<br/><br/>“Dragon King, a group of experts from the divination universe have come to pay a visit.”<br/><br/>When he arrived at a spot in front of the Dragon Palace, Prime Minister Gui reported respectfully to Wang Xian who was setting up the Dragon Palace not far away.<br/><br/>“Yes, let them come over.”<br/><br/>Wang Xian nodded his head and looked in the direction of Prime Minister Gui and the rest.<br/><br/>“Dragon King, sorry to bother you.”<br/><br/>Prophet Hong and the rest walked over to Wang Xian and bowed respectfully.<br/><br/>“Hehe, it’s always a pleasure to have friends from afar.”<br/><br/>Wang Xian smiled faintly and swept his gaze across the group. “May I know why you are all here?”<br/><br/>“Dragon King, we are here purely to pay a visit and send you some congratulatory gifts to congratulate you on destroying the universe of belief.”<br/><br/>Prophet Hong smiled as he spoke and moved his palm, he took out some treasures and said, “This is just a small gift. I hope that you will accept it. This is also our intention to divine the universe. In the future, if the Dragon Palace has any matters, you can invite us to divine the universe.”<br/><br/>“Oh?”<br/><br/>Wang Xian raised his eyebrows. He could sense the treasures sent by the divination universe.<br/><br/>There were two treasures that were comparable to the void Dragon Pool.<br/><br/>One of them was a wood-elemental treasure while the other was a round ball that was filled with divination power.<br/><br/>“I will accept it then. Everyone, follow me to the Dragon King’s Palace to have a seat!”<br/><br/>Wang Xian said faintly.<br/><br/>Prime Minister Gui was smiling as he received the treasure from the divination universe.<br/><br/>“It’s the Dragon King!”<br/><br/>The experts from the divination universe replied immediately.<br/><br/>“The nine-origin universe is right in front of us. Let’s go and visit it.”<br/><br/>At the same time, more than ten experts outside the nine-origin universe looked at the nine-origin universe as they spoke.<br/><br/>As soon as they finished speaking, they flew into the nine-origin universe.<br/><br/>At present, all the information about the dragon palace had been thoroughly spread around the land of origin.<br/><br/>After seeing the powerful strength of the Dragon Palace, many powerhouses from the universe had begun to pay a visit.<br/><br/>Divining the universe was just the first!<br/><br/>“Dragon King, now that your deeds and the deeds of the Dragon Palace have been spread around the land of origin, many powerhouses from the universe are talking about it. I reckon that it won’t be long before more universes come to pay a visit to the Dragon Palace.”<br/><br/>In the Dragon King Hall, Prophet Hong and the rest said to Wang Xian.<br/><br/>“Is that so? Then I’m honored!”<br/><br/>Wang Xian smiled and nodded his head.<br/><br/>“Dragon King, your deeds can be said to have amazed many experts.”<br/><br/>Prophet Hong and the rest nodded their heads and continued to speak.<br/><br/>Wang Xian also chatted casually with them and hosted a banquet to entertain them.<br/><br/>“This is the nine-origin universe? I didn’t expect that this universe would give birth to an existence like the Dragon King of the Dragon Palace. I really don’t know what kind of heaven and earth fortune that Dragon King obtained to rise so quickly!”<br/><br/>In the nine-origin universe, more than ten experts from the lattice object universe glanced at this universe and said faintly.<br/><br/>“An existence at the primal chaos level. We must be respectful when we face the Dragon King next.”<br/><br/>The old man in the lead reminded them. They took out a treasure and flew toward the place with the strongest energy in the nine-origin universe.<br/><br/>The place with the strongest energy would naturally be the place where the Dragon Palace was located.<br/><br/>There was no doubt.<br/><br/>“HMM? Another powerhouse in the Heavenly Yuan creation realm has stepped into our nine-origin universe? Report the news and go there immediately to take a look.”<br/><br/>At this moment, when the group of Heaven origin creation realm experts stepped into the nine-origin universe, the alert of the nine-origin universe issued a reminder.<br/><br/>From the beginning of the calamity, the Army formed by a group of peak races immediately received the news, reported it, and rushed over.<br/><br/>“Not long ago, seven heaven origin creation realm experts entered our nine-origin universe, but they are guests of the Dragon Palace. Are they still guests of the Dragon Palace this time?”<br/><br/>An expert at the peak of the ruler realm from the demon race asked an expert from the Dragon Palace.<br/><br/>“I don’t know, let me ask.”<br/><br/>The expert from the Dragon Palace shook his head and reported the news.<br/><br/>“Buzz!”<br/><br/>As they reported, they also teleported to the location of the dozen heaven origin creation realm experts.<br/><br/>“Halt, who are you from? What are you doing in our nine-origin universe?”<br/><br/>Not long after, the nine-origin universe’s guardian Legion rushed over.<br/><br/>They saw more than a dozen figures in front of them, and their eyes focused as they asked.<br/><br/>“We are from the lattice object universe. We are here to visit the Dragon Palace and the Dragon King. We have no ill intentions.”<br/><br/>The Heavenly Yuan creation realm powerhouses from the lattice object universe were slightly stunned when they saw the nine-origin universe’s guardian legion, and they said politely.<br/><br/>“Eh? Visiting Our Dragon King?”<br/><br/>The powerhouses of the Dragon Palace focused their eyes and then nodded. “Since you are visiting our Dragon Palace and our Dragon King, please follow us!”<br/><br/>“Eh? Thank you for leading the way!”<br/><br/>The more than ten Tianyuan creation realm powerhouses of the lattice object universe immediately thanked them and followed the powerhouses of the Dragon Palace toward the direction of the Dragon Palace.<br/><br/>“Eh? Why are there so many powerhouses here to visit the Dragon King?”<br/><br/>The powerhouses from other races looked surprised when they saw this scene.<br/><br/>However, they soon received a message from the Dragon Palace.<br/><br/>Many powerhouses from other universes would enter the nine-origin universe next, and they could just bring them directly to the Dragon Palace.<br/><br/>After the nine-origin Universe Guardian Army received this information, they were even more surprised.<br/><br/>At the moment, the disciples of the powerful beings from the other peak races in the nine-origin universe didn’t know about the Dragon Palace’s Battle Records.<br/><br/>They didn’t know about the Dragon King’s strength.<br/><br/>But this news couldn’t be hidden for long.<br/><br/>After the Shadow Devil Emperor received this information, he had already rushed back to the nine-origin universe.<br/><br/>In the nine-origin universe, many experts from other universes came to visit.<br/><br/>The Dragon Palace received experts from four universes in just a thousand years.<br/><br/>The experts from each universe sent precious treasures.\t\t\t\t\t\t</div>", "images": {}, "success": true}