{"id": 1429, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075486.html", "title": "Chapter 4432 - Chapter 4432: The Plan Of The 4431 Evil Sequence Faction", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4432 - Chapter 4432: The Plan Of The 4431 Evil Sequence Faction</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4432: The plan of the 4431 evil sequence faction<br/><br/>Boom! Boom<br/><br/>The expert with the snake tail had yet to crush the escape treasure in his hand. An extremely terrifying aura landed on his body, causing his expression to change drastically. He revealed a terrified expression.<br/><br/>“What level of expert is this? I Can’t even escape?”<br/><br/>His eyes were filled with fear.<br/><br/>“The next time we invade the universe, let’s see who is guarding it. Die!”<br/><br/>Wang Xian’s figure flashed and appeared above his head. His heaven’s origin golden eyes shone directly at him.<br/><br/>The terrifying energy landed directly on his body and penetrated through his body.<br/><br/>In the surrounding area, all the demons and devils saw their demon god being killed. Fear and despair appeared on their faces.<br/><br/>Boom<br/><br/>Wang Xian’s body shook and a wave of energy swept across the surroundings.<br/><br/>The powerful energy killed all the demons.<br/><br/>Wang Xian watched this scene calmly and collected all the corpses.<br/><br/>Following that, his body moved and flew towards Prime Minister Gui and the rest.<br/><br/>Ten days later, Wang Xian met Prime Minister Gui and the rest.<br/><br/>“Dragon King, thank you for your help.”<br/><br/>Wan Xiaoyao and the rest looked at Wang Xian and thanked him respectfully.<br/><br/>This time, there were two control-level existences among the invading demons. If there was no dragon king and if they did not join the Dragon Palace Alliance, they would be doomed.<br/><br/>Their carefree universe would be completely destroyed.<br/><br/>Completely destroyed!<br/><br/>Now, they were glad that they had joined the Dragon Palace Alliance!<br/><br/>“You are welcome. You are part of the Dragon Palace Alliance. The Dragon Palace will naturally protect you!”<br/><br/>Wang Xian shook his head lightly and said.<br/><br/>“We still have to thank the Dragon King. It’s our fortune to be able to join the Dragon Palace Alliance!”<br/><br/>Wan Xiaoyao and the rest were sincerely grateful.<br/><br/>Wang Xian waved his hand and said, “All of you can handle the matters here. If there’s anything else, contact Prime Minister Gui.”<br/><br/>“It’s the Dragon King!”<br/><br/>Wan Xiaoyao and the rest nodded.<br/><br/>“Let’s go.”<br/><br/>Wang Xian gestured to Prime Minister Gui before calling an lie over.<br/><br/>“Prime Minister Gui, adjust the war situation between the evil alignment camp and the Justice Alliance. Let’s see what the situation is like now.”<br/><br/>After returning to the Dragon Palace, Wang Xian pondered for a moment before speaking to Prime Minister Gui.<br/><br/>Now that there were experts from the evil alignment camp coming over, it was obvious that something had happened.<br/><br/>Wang Xian needed to know more about it.<br/><br/>He also needed to know more about the Dragon Palace Alliance.<br/><br/>After all, the Dragon Palace was no longer a single faction. Instead, it had a large number of members.<br/><br/>He needed to know more about the powerful forces in the outside world.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded. “I’ll send the powerhouses to the Justice Alliance and the evil sequence faction now.”<br/><br/>“Yes, from the Justice Alliance, you just need to understand the situation through the Justice Alliance’s Tianyuan Communicator. The evil sequence camp should have a corresponding communicator too. Let me get some for you when the time comes.”<br/><br/>Wang Xian instructed them one by one.<br/><br/>Prime Minister Gui nodded his head.<br/><br/>“The experts from the evil sequence camp have come to the land of origin. I hope they don’t have any ulterior motives. Otherwise, I’m afraid a war will break out.”<br/><br/>Wang Xian muttered to himself when he saw Prime Minister Gui leaving.<br/><br/>However, if the evil sequence faction really had ulterior motives, Wang Xian wouldn’t be worried.<br/><br/>At worst, a war would break out.<br/><br/>If he was forced into a corner, Wang Xian would form an alliance with the Justice Alliance.<br/><br/>He believed that the evil sequence faction wouldn’t dare to rashly provoke the Dragon Palace Alliance.<br/><br/>However, at the same time, it was located in a dark and chaotic void.<br/><br/>An enormous mountain range was floating in the chaos domain.<br/><br/>It was a magical mountain range with endless peaks. The entire mountain range exuded a violent and chaotic aura.<br/><br/>Within the endless mountain range, there were large amounts of living beings roaring and cultivating.<br/><br/>This was the base camp of the evil sequence faction.<br/><br/>It was also a special region of chaos like the land of origin and the Berserk region.<br/><br/>Compared to the land of origin and the berserk region, this place was almost completely occupied by the powerhouses of the evil sequence faction.<br/><br/>Above a mountain peak, two newly resurrected demon gods gathered together, their expressions unsightly.<br/><br/>They had just experienced a great battle with the Justice Alliance over a hundred million years ago, and now they wanted to recover some of their vitality and see if they could increase the strength of their disciples.<br/><br/>In the end, they came to a weak universe, but were killed by an unknown expert.<br/><br/>They had already known about the carefree universe in advance. There were only two existences that had just entered the Tianyuan blessed realm in the entire universe.<br/><br/>But in the end, such a terrifying existence suddenly appeared.<br/><br/>An existence that could instantly kill them.<br/><br/>They believed that even an ordinary great dao existence wouldn’t be able to do so.<br/><br/>Even in the evil sequence faction, there were not many who could kill them in an instant.<br/><br/>“Damn it, we got off on the wrong foot. Send this information to the communicator and ask about the situation.”<br/><br/>Most of the evil sequence faction fought for themselves.<br/><br/>Even in the Great War against the Justice Alliance, with chaos-level existences supervising the battle, the evil sequence faction champions could not be as united as the Justice Alliance.<br/><br/>Fortunately, their evil sequence faction was strong enough.<br/><br/>Now, they were in a truce with the Justice Alliance.<br/><br/>And their war against the Justice Alliance this time had a special meaning.<br/><br/>The war was to tell all the universes that joining the Justice Alliance might not necessarily be safe.<br/><br/>It was to prevent the Justice Alliance from becoming stronger and stronger.<br/><br/>And that was indeed the case in this battle.<br/><br/>As for the losses of the evil sequence faction and their disciples…<br/><br/>They didn’t care.<br/><br/>Because within the evil sequence faction, as long as they had enough blood food, they could quickly increase their strength.<br/><br/>“Eh? Greedy Snake? You were hunted down by the strong in the land of origin? You provoked the powerful universe there?”<br/><br/>When greedy snake and the others sent the message to the group chat of the evil sequence faction, a powerhouse immediately asked in surprise.<br/><br/>“Yes, an unknown powerhouse instantly killed us.”<br/><br/>Greedy snake immediately replied.<br/><br/>“I’ve received a piece of news. A powerful alliance called the Dragon Palace Alliance has been born in the land of origin. It’s said that the leader of the Dragon Palace Alliance has the power of Chaos. The members of the Dragon Palace Alliance are all weak universes in the land of origin. This Dragon Palace Alliance has more than a hundred heavenly fate powerhouses.”<br/><br/>“That’s not important. What’s important is the existence at the primal chaos level. It’s hard to imagine that such a powerful existence has been born in the land of origin. I wonder what kind of fortune it has obtained.”<br/><br/>Soon, a message appeared in the group.<br/><br/>This message caused quite a stir.<br/><br/>“A primal chaos existence has been born in a small land of origin? How is this possible? I’m going to lead my subordinates to invade the land of origin.”<br/><br/>“Dragon Palace Alliance? A chaos-level being? That’s troublesome!”<br/><br/>“Then shouldn’t we pay attention to the universes around the land of origin? Those weak universes can’t be invaded?”<br/><br/>In the group, some experts from the evil sequence faction couldn’t help but discuss.\t\t\t\t\t\t</div>", "images": {}, "success": true}