{"id": 1422, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075451.html", "title": "Chapter 4425 - Chapter 4425: At The 4424 Dragon Palace Alliance", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4425 - Chapter 4425: At The 4424 Dragon Palace Alliance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4425: At the 4424 Dragon Palace Alliance<br/><br/>“Have you heard?”? “The Dragon Palace has undergone earth-shaking changes. Oh My God, have you gone to the Dragon Palace’s territory?”? “It’s full of divine trees and divine herbs in the ruler realm. Treasures in the ruler realm can be found everywhere.”<br/><br/>“Recently, there have been many powerhouses in the Heavenly Yuan creation realm from other universes visiting the Dragon Palace. Each time, there are more than five powerhouses in the Heavenly Yuan creation realm. Each of them is very powerful. What’s going on?”<br/><br/>“That’s true. My grandfather is a powerhouse of the Guardian Legion. According to my grandfather, there are dozens of heavenly yuan creation realm powerhouses visiting the Dragon King. Oh My God, is the Dragon King of the Dragon Palace so powerful now?”? “The powerhouses from other universes are all visiting.”<br/><br/>“The Dragon King of the Dragon Palace is undoubtedly powerful. However, to be able to make so many powerhouses from other universes visit, isn’t this too powerful? What exactly happened?”<br/><br/>As time passed, a large number of heavenly yuan blessed realm powerhouses came to visit the Dragon King of the Dragon Palace in their nine-origin universe, which caused quite a stir in the mind of the nine-origin universe.<br/><br/>Some of the powerhouses’disciples who passed by the Dragon Palace also sensed the changes in the Dragon Palace.<br/><br/>Especially when they saw the treasures everywhere, they were dumbfounded and couldn’t believe their eyes.<br/><br/>This information caused countless disciples to talk about it.<br/><br/>Even later on, the Heaven’s origin destinies in the nine-origin universe also knew about this information.<br/><br/>They had many channels to understand the information, and when they got some information, they were immediately stunned.<br/><br/>The Dragon Palace actually destroyed a powerful universe in a short period of time, and also destroyed a powerful belief universe?<br/><br/>The Dragon King of the Dragon Palace had the power of Chaos?<br/><br/>The Elven empress and the others were shocked by the news.<br/><br/>Chaos?<br/><br/>The Dragon King of the Dragon Palace had reached the chaos level?<br/><br/>This was unbelievable.<br/><br/>The increase of the Dragon King’s power was too terrifying?<br/><br/>“This is still the Dragon Palace? This? ?”<br/><br/>Thousands of years later, the experts of the nine-origin universe came to the Dragon Palace.<br/><br/>They looked at the huge amount of resources around the Dragon Palace, and their faces were filled with shock.<br/><br/>These resources were too awesome!<br/><br/>Even their breathing quickened as they looked at them.<br/><br/>“Hehe, the fallen Shadow Demon Emperor, the Elven empress, and everyone else. Welcome, welcome, Welcome.”<br/><br/>In a garden in front, Wang Xian was chatting with a group of experts.<br/><br/>Wang Xian sensed the arrival of the fallen Shadow Devil Emperor and the rest and greeted them with a smile.<br/><br/>“Dragon King, do you have any guests? Sorry to Bother You!”<br/><br/>The Fallen Shadow Devil Emperor and the rest looked at Wang Xian and flew over immediately. They cupped their hands and looked at Wang Xian.<br/><br/>Beside Wang Xian, there were Tianci, Shu Qing and a few other girls, as well as other powerhouses with the aura of the universe.<br/><br/>There were a total of seven to eight powerhouses from the other universes.<br/><br/>“I Won’t disturb you.”<br/><br/>Wang Xian smiled and shook his head.<br/><br/>The powerhouses from the other universes beside him were all brought over by TIANCI.<br/><br/>Some powerhouses from the other universes knew about the relationship between tianci from the six paths universe and the Dragon King of the Dragon Palace. Hence, they used him to come to the nine-origin universe to pay a visit.<br/><br/>“Dragon King, we have already disturbed you for many days. We will go back first. We will meet again if we are fated to.”<br/><br/>A few powerhouses of the Heaven’s origin realm cupped their hands at Wang Xian and left respectfully.<br/><br/>Wang Xian exchanged a few pleasantries with them and watched them leave.<br/><br/>“Dragon King, I really didn’t expect you to be able to grow to such a stage.”<br/><br/>Seeing the group of powerhouses of the Heaven’s origin realm leaving, the elven empress sighed emotionally at Wang Xian.<br/><br/>“I was just lucky.”<br/><br/>Wang Xian smiled humbly.<br/><br/>“This isn’t just luck. If I’m lucky, I can become the king around the land of Origin?”<br/><br/>The Fallen Shadow Demon Emperor shook his head.<br/><br/>They had witnessed the rise of the Dragon King.<br/><br/>Although the rise of the Dragon King was very fast, they also understood that the Dragon King had come all the way here.<br/><br/>It was a tough journey, killing enemies and charging all the way here.<br/><br/>“I’m afraid there won’t be any other universes that dare to bully our nine-origin universe in the future. Haha!”<br/><br/>The He Tian Saint said with a smile.<br/><br/>The rest of the experts also nodded with a smile.<br/><br/>“If you need any help in the future, just let me know directly. After all, we are from the same universe.”<br/><br/>Wang Xian also smiled at them and continued, “It just so happens that we can get some delicious food from other universes. Let’s go and enjoy it together.”<br/><br/>“Haha, That’s Great!”<br/><br/>The Fallen Shadow Demon Emperor and the rest laughed and replied immediately.<br/><br/>In the next few days, Wang Xian hosted the powerhouses from the nine-origin universe.<br/><br/>“Dragon King, from the communication device in the land of origin, our Dragon Palace is completely famous. Hehe, there are still many powerhouses who want to visit our nine-origin universe.”<br/><br/>Five days later, Prime Minister Gui said to Wang Xian with a smile on his face.<br/><br/>“Okay.”<br/><br/>Wang Xian nodded his head and appeared to be deep in thought.<br/><br/>Currently, the Dragon Palace was no longer short of resources.<br/><br/>However, for a long period of time, the Dragon Palace would be short of one thing.<br/><br/>That was the quota for a breakthrough.<br/><br/>The quota was extremely scarce for the Dragon Palace.<br/><br/>In the next 100 million years, with the resources in the Dragon Palace, at least 30 to 40 disciples who could make the breakthrough would be born.<br/><br/>However, this required 30 to 40 slots for the Heaven’s origin creation.<br/><br/>A few slots might be easy to find, but 30 to 40 would be a problem.<br/><br/>Unless one went to check the universe one by one. Once there were slots, they would occupy them directly.<br/><br/>However, this would easily incur the wrath of the public.<br/><br/>It would cause the hostility of the many universes.<br/><br/>This was not what Wang Xian wanted to see.<br/><br/>Although the Dragon Palace was powerful enough.<br/><br/>“Next, we have to consider the spot for the disciples of the Dragon Palace to break through.”<br/><br/>Wang Xian said to Prime Minister Gui Lightly.<br/><br/>“Dragon King, I have been thinking about this issue recently. I have an idea.”<br/><br/>Prime Minister Gui looked at Wang Xian and said, “Now that our Dragon Palace is powerful enough, can we form a force that belongs to our Dragon Palace like the evil sequence faction and the Justice Alliance?”<br/><br/>“We don’t need to be like them. We can use the powerful strength of our Dragon Palace to form a Dragon Palace Alliance. Anyone who joins the Dragon Palace Alliance will have to pay a quota of Heaven’s origin creation in the universe.”<br/><br/>“If they pay the quota, our dragon palace will protect them. When the Apocalypse breaks out, as long as someone invades their universe, we will help them<br/><br/>“In addition, we can build a base camp in the land of origin. Members of the Dragon Palace Alliance can search for treasures and resources in the chaos together<br/><br/>“In this way, in the long run, although they pay the quota for a breakthrough in the universe, they will be protected by us. In addition, they will be able to raise their strength in the universe and their own strength in peace.”<br/><br/>Prime Minister Turtle spoke of his own plan!\t\t\t\t\t\t</div>", "images": {}, "success": true}