{"id": 1425, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075466.html", "title": "Chapter 4428 - Chapter 4428: 442,737 Members", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4428 - Chapter 4428: 442,737 Members</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4428: 442,737 members<br/><br/>The Dragon Palace Alliance base in the land of origin had been built for a thousand years.<br/><br/>This was mainly because it took a longer time to set up the array.<br/><br/>It was easy for the twelve ancestral warlocks to set up an ordinary array, but it would be difficult to set up an array that could resist a control-level array.<br/><br/>Especially when one array was connected to another.<br/><br/>This caused the entire Dragon Palace Alliance base to take thousands of years to set up.<br/><br/>“Dragon King, the setup is complete. There are too many resources in Your Dragon Palace. The defense in this base is dozens of times stronger than our Magus lineage!”<br/><br/>On this day, the 12 ancestral wizards set up the last array formation and spoke to Wang Xian with a smile.<br/><br/>There were enough powerful materials in the Dragon Palace.<br/><br/>This allowed the 12 ancestral warlocks to set up 12 large formations.<br/><br/>When these 12 large formations were activated, they were able to fight against five to six control-level existences.<br/><br/>The 12 large formations were interconnected and there were other small-scale formations as well.<br/><br/>There were other kinds of spirit gathering formations.<br/><br/>The level of spiritual energy inside was comparable to some powerful paradises!<br/><br/>“Sorry to trouble everyone!”<br/><br/>Wang Xian smiled and said, “The remaining materials will be your gifts. Haha!”<br/><br/>“It’s our honor.”<br/><br/>The twelve ancestral witches shook their heads politely with a happy expression on their faces.<br/><br/>The remaining materials were a huge treasure to them.<br/><br/>They could raise the defense of the twelve ancestral witches by two levels!<br/><br/>After the construction of the Dragon Palace Alliance base was completed, Wang Xian hovered in the air and scanned the area.<br/><br/>The entire Dragon Palace Alliance base didn’t take up a large area. Of course, it wasn’t small either.<br/><br/>It had a circumference of more than ten thousand kilometers.<br/><br/>In the center was the main hall of the Dragon Palace Alliance. Behind the main hall was the palace where Wang Xian lived.<br/><br/>In the front was the trading hall.<br/><br/>There was also a sparring ground built with spatial attributes.<br/><br/>This sparring ground was sufficient to support the masters of the control level to spar in it.<br/><br/>The interior of the entire hall of the Dragon Palace Alliance was very beautiful and exquisite.<br/><br/>At the back and on the left and right were the palaces where the masters lived.<br/><br/>There were a total of fifty palaces for the masters of the members of the Dragon Palace Alliance to live in.<br/><br/>“Prime Minister Gui, come to the Dragon Palace Alliance first. After a thousand years, gather all the members of the Dragon Palace Alliance here and announce the official establishment. In addition, the Dragon Palace Alliance will hold its first trade conference.”<br/><br/>“Therefore, the members can take out their unused treasures and trade!”<br/><br/>Wang Xian took out his communicator and sent a message to Prime Minister Gui.<br/><br/>“It’s the Dragon King!”<br/><br/>Soon, Prime Minister Gui replied.<br/><br/>“Hehe!”<br/><br/>Wang Xian smiled as he watched.<br/><br/>In the past thousand years, some of the powerhouses in the Dragon Palace had not been idle either.<br/><br/>There was a universe that wanted to join the Dragon Palace Alliance. Mo Sha was also carrying out some exchanges and investigations.<br/><br/>They would go to their universe to investigate how many spots in their universe for the creation of the Heaven’s origin.<br/><br/>Find out the basic situation of this universe and whether there are powerful enemies.<br/><br/>All of these need to be understood.<br/><br/>After all, although the Dragon Palace was powerful, it was impossible to say that all the universes were protected.<br/><br/>Some who had powerful enemies would have to pay a higher price if they wanted the protection of the Dragon Palace.<br/><br/>A thousand years passed quickly again.<br/><br/>Recently, the land of origin was much more lively.<br/><br/>A large number of experts from other universes had come here.<br/><br/>Because of what they learned from the communicators, the Dragon Palace alliance was about to be officially established.<br/><br/>The members of the Dragon Palace Alliance, the Dragon Palace, were about to be announced!<br/><br/>In front of the Dragon Palace Alliance base, it was even more lively at this moment.<br/><br/>Nearly a hundred heavenly yuan creation realm experts gathered together. They were all talking and discussing excitedly.<br/><br/>Although there were only a few control-level powerhouses among these hundred powerhouses, the gathering of a hundred heavenly Yuan creation realm powerhouses was still very impressive.<br/><br/>“Everyone, come in. Our Dragon King has arrived!”<br/><br/>Prime Minister Gui flew out of the base of the Dragon Palace Alliance and said to them with a smile.<br/><br/>“The Dragon King is here?”<br/><br/>“It’s Prime Minister Gui!”<br/><br/>The eyes of nearly a hundred heavenly yuan creator-level powerhouses lit up, and they immediately followed Prime Minister Gui into the Dragon Palace Alliance base.<br/><br/>“Hehe, everyone, this will be the Dragon Palace Alliance base in the future. All members can come and go as they please.”<br/><br/>“It’s safe inside. Under the condition of self-defense, it can withstand the simultaneous attack of six control-level powerhouses. At that time, everyone will have a separate palace, and you can modify the interior of the palace yourself.”<br/><br/>“After you join the Dragon Palace Alliance, we will protect you to a certain extent. Of course, that is if you don’t provoke others.”<br/><br/>Prime Minister Gui led the way and said to them one by one!<br/><br/>“Prime Minister Gui, we will definitely abide by the rules of the Alliance.”<br/><br/>A powerhouse said immediately.<br/><br/>Prime Minister Gui nodded and led them to the main hall.<br/><br/>At this moment, in the main hall of the Dragon Palace Alliance, more than 20 experts from the Dragon Palace had arrived.<br/><br/>Among them, the king of Void was also called over by Wang Xian.<br/><br/>Currently, there were not many experts at the beginner-level or above in the Dragon Palace. Hence, the king of Void was here to support them.<br/><br/>After all, the king of Void was also under Wang Xian’s control.<br/><br/>The king of Void and Mo Sha sat on the left and right.<br/><br/>The rest of the experts from the Dragon Palace, as well as Tianci and the rest who came to join in the fun, sat at the back.<br/><br/>Wang Xian sat at the front and looked at the group of Heaven Origin creator powerhouses with a smile on his face.<br/><br/>Ninety-five.<br/><br/>Thirty-seven universes, ninety-five heaven origin creator powerhouses.<br/><br/>On average, there were less than three heaven origin creator powerhouses in one universe.<br/><br/>Among the various universes, their strength was considered relatively weak.<br/><br/>It was normal for such a weak universe to be in a group of universes.<br/><br/>There were more than 100 universes around the land of origin, and there were 37 universes of such level. It was very reasonable.<br/><br/>“Greetings, Dragon King!”<br/><br/>The 95 powerhouses of Tianyuan looked at Wang Xian in front of them with respect in their eyes.<br/><br/>They immediately bowed respectfully and shouted.<br/><br/>An existence at the level of Chaos!<br/><br/>Such an existence could instantly kill them.<br/><br/>“Everyone, please take a seat. You’re welcome.”<br/><br/>Wang Xian waved his hand at them. “Hehe, I’m very happy that all of you are able to join the Dragon Palace Alliance. I’m very happy that all of you can trust me.”<br/><br/>“It’s our honor to be able to join the Dragon Palace Alliance and receive your protection, Dragon King.”<br/><br/>An old man said with a smile.<br/><br/>“Hehe, it’s mutually beneficial. Since all of you have paid the quota of the Heaven’s origin, our Dragon Palace will have to fulfill the corresponding responsibilities. Everyone, don’t worry. All the universes and members who join the Dragon Palace Alliance will enjoy the protection of the Dragon Palace Forever!”<br/><br/>“I also hope that in the future, all of you will become stronger and stronger. Our Dragon Palace Alliance will become stronger and stronger.”<br/><br/>“However, I also believe that with the establishment of our Dragon Palace Alliance, more than a Hundred Heaven’s origin creation powerhouses will spar, help each other, and exchange ideas. All of you will become stronger and stronger as well. The future of the Dragon Palace Alliance will not be inferior to the other alliances!”<br/><br/>Wang Xian looked at them with his eyes gleaming.\t\t\t\t\t\t</div>", "images": {}, "success": true}