{"id": 1427, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075476.html", "title": "Chapter 4430 - Chapter 4430: The Evil Sequence 4429 Came To Attack Them", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4430 - Chapter 4430: The Evil Sequence 4429 Came To Attack Them</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4430: The evil sequence 4429 came to attack them<br/><br/>“Xiao Xian, I want a girl. I want a Little Dragon Girl.”<br/><br/>“I want a boy. I want a little prince. Hehe.”<br/><br/>When Wang Xian said he wanted a child, the group of girls became excited.<br/><br/>They had been following Wang Xian for hundreds of millions of years. Now, their strength had already reached the Heaven’s origin realm.<br/><br/>In addition, the Dragon Palace’s current strength was already strong enough.<br/><br/>Naturally, wanting children had become one of their thoughts.<br/><br/>Wang Xian also felt that he could have some small babies.<br/><br/>However, at their level, the birth of a child was not that simple.<br/><br/>In order to have a child with higher potential and a better body, it would require a long time of nurturing.<br/><br/>Wang Xian began his child-making operation.<br/><br/>Buzz Buzz<br/><br/>Buzz Buzz<br/><br/>However, a sudden message came a million years later!<br/><br/>“Dragon King, Dragon King!”<br/><br/>In the back garden of the Dragon Palace, Wang Xian was accompanying a group of girls.<br/><br/>Prime Minister Gui suddenly rushed over and shouted at Wang Xian. His voice sounded anxious!<br/><br/>“Huh?”<br/><br/>Wang Xian was slightly stunned when he saw the anxious Prime Minister Gui. He looked at him in surprise and asked, “What’s the matter, Prime Minister Gui?”<br/><br/>“Dragon Palace, a member of the Dragon Palace Alliance has encountered an incident and was invaded!”<br/><br/>Prime Minister Gui said.<br/><br/>“Oh, is that so? There are actually experts from other universes who dared to invade a member of the Dragon Palace Alliance?”<br/><br/>Wang Xian had a look of surprise on his face as well. He was extremely astonished.<br/><br/>This was not a small matter to the Dragon Palace Alliance.<br/><br/>This was the first universe to be invaded.<br/><br/>It would have a big impact on the Dragon Palace Alliance.<br/><br/>If it was not handled properly, it would affect the reputation of the Dragon Palace Alliance.<br/><br/>“There are devil altars in every universe. I’ll make a trip there myself!”<br/><br/>Wang Xian said to Prime Minister Gui.<br/><br/>“Dragon King, I’ll go with you.”<br/><br/>Prime Minister GUI said, “The powerhouse who was invaded by the universe is not in his universe but in the land of origin. We can bring them there. This is the first time something like this has happened. Our Dragon Palace has to handle it properly!”<br/><br/>“Alright, call an lie over. We’ll make a trip to the Dragon Palace Alliance before heading to that universe.”<br/><br/>Wang Xian nodded his head.<br/><br/>Prime Minister Gui replied immediately and retreated.<br/><br/>“Xiao Xian, we are so powerful yet the other party dares to provoke us. Did the other party come prepared?”<br/><br/>Lan Qingyue spoke from the side.<br/><br/>“I don’t think so.”<br/><br/>Wang Xian shook his head. “The universe in the chaos is as numerous as the stars. Other than the surroundings of the land of origin, the powerhouses from other places are unaware of the existence of the Dragon Palace Alliance. It is very likely that they are powerhouses from the distant universe.”<br/><br/>“Yes, be careful.”<br/><br/>Lan Qingyue and the rest nodded.<br/><br/>“Hehe, don’t worry. Do you still need to worry about your husband’s strength?”<br/><br/>Wang Xian smiled.<br/><br/>It had been so long since Wang Xian had fused with the primal chaos stone. It had already reached 20% .<br/><br/>However, it would take at least a few billion years for the complete fusion to be completed.<br/><br/>Wang Xian had no idea what would happen after the complete fusion.<br/><br/>However, he believed that he would be able to achieve a significant increase in his strength when that time came.<br/><br/>“Dragon King!”<br/><br/>Not long after, Prime Minister Gui and an lie rushed over.<br/><br/>“Alright, let’s go.”<br/><br/>Wang Xian nodded.<br/><br/>Buzz<br/><br/>An lie moved and brought them to the main hall of the Dragon Palace Alliance in the land of origin.<br/><br/>“Carefree universe, carefree universe, Carefree Universe!”<br/><br/>Prime minister turtle shouted as they flew out of the main hall of the Dragon Palace Alliance!<br/><br/>At the same time, in the palaces around the Dragon Palace Alliance.<br/><br/>Almost all the experts here flew over.<br/><br/>The news that a universe had been invaded had spread throughout the Dragon Palace Alliance!<br/><br/>This was the first time something had happened to the members of the Dragon Palace Alliance.<br/><br/>All the members hoped that the Dragon Palace could help them resolve this matter.<br/><br/>“Prime Minister Gui!”<br/><br/>Two middle-aged men flew over quickly from the front.<br/><br/>When they saw Wang Xian’s figure, their faces lit up again. “Sir Dragon King, you’re here too!”<br/><br/>“HMM, I’ll settle this matter for you guys personally. I’d like to see which reckless person dares to provoke our Dragon Palace Alliance!”<br/><br/>Wang Xian nodded at them and said!<br/><br/>“Thank you, Dragon King!”<br/><br/>The two of them thanked him immediately!<br/><br/>“Let’s go, we will go there directly!”<br/><br/>Prime Minister Gui said to them.<br/><br/>“Yes!”<br/><br/>The two of them nodded and came to the front.<br/><br/>Buzz<br/><br/>The next moment, they moved and disappeared.<br/><br/>When they reappeared, they were already in the carefree universe.<br/><br/>The Xiaoyao universe was a relatively weak universe.<br/><br/>There were not many powerful disciples in the universe.<br/><br/>The place where they teleported was the center of the Xiaoyao Universe!<br/><br/>“Dragon King, the intruders are in the north of our universe. A large number of intruders are slaughtering the living beings in our universe.”<br/><br/>Wan Xiaoyao pointed in a direction and reported to Wang Xian with a gloomy face.<br/><br/>“Hurry over through the teleportation formation.”<br/><br/>Wang Xian nodded. He couldn’t sense the location of the intruders due to the distance.<br/><br/>“Yes,”Wan Xiaoyao and the rest responded immediately. They came to the teleportation formation and rushed over with Wang Xian and the rest!<br/><br/>After more than a dozen transmissions, they arrived in front of a planet in the Xiaoyao universe!<br/><br/>“Dragon King, it’s ahead. That’s the Northern Kingdom of our Xiaoyao universe. We can’t continue to teleport. If we do, we might enter the center of the enemy!”<br/><br/>Wan Xiaoyao pointed to the north and continued to report!<br/><br/>“I can sense it. Let’s go and take a look. I want to see which universe it is!”<br/><br/>Wang Xian’s gaze froze.<br/><br/>He could sense the thick bloody scent coming from the north!<br/><br/>It was not just the scent of blood. There was also an evil scent.<br/><br/>“Let’s Go!”<br/><br/>His body moved and energy enveloped Prime Minister Gui and the rest.<br/><br/>Following that, he flew over at a terrifying speed.<br/><br/>Buzz Buzz<br/><br/>Buzz Buzz<br/><br/>With their continuous teleportation, Wang Xian appeared in front of the universes after more than ten hours.<br/><br/>“Roar Roar Roar!”<br/><br/>“CHIRP CHIRP CHIRP!”<br/><br/>“Roar!”<br/><br/>As soon as they arrived at this area, a series of roars could be heard.<br/><br/>All kinds of voices filled the entire space.<br/><br/>“Damn this guy.”<br/><br/>Wan Xiaoyao and the others looked ahead, their eyes red and filled with anger.<br/><br/>In front of them was a large area of life planets, and at this moment, on the life planets, a large number of demons were crazily devouring the living beings.<br/><br/>All the living beings had faces full of fear and despair.<br/><br/>However, facing these demons, they didn’t have the ability to resist.<br/><br/>This group of demons were all huge and incomparably ferocious.<br/><br/>Their entire bodies were dark and blood-red, emitting a bloodthirsty aura!<br/><br/>“Kekekekekekekekekekekekekekekekekekekekekekekekekeke<br/><br/>At this moment, in the air, there was a figure with blood-red wings.<br/><br/>The figure with a bat-like head was floating in the air.<br/><br/>His blood-red eyes were staring at the surroundings, and he was laughing with his mouth wide open.\t\t\t\t\t\t</div>", "images": {}, "success": true}