{"id": 1424, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075461.html", "title": "Chapter 4427 - Chapter 4427: Under The 4426 Dragon Palace Alliance", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4427 - Chapter 4427: Under The 4426 Dragon Palace Alliance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4427: Under the 4426 Dragon Palace Alliance<br/><br/>When Wang Xian started to build the base of the Dragon Palace Alliance.<br/><br/>On the communication device of the powerhouses in the land of origin, Wang Xian’s message caused a huge sensation.<br/><br/>Currently, the most famous and sensational news around the land of origin was about the Dragon Palace.<br/><br/>It was about the Dragon King.<br/><br/>Now, the Dragon King of the Dragon Palace suddenly sent such a message through the communication device, which shocked countless masters!<br/><br/>At present, many masters of the universe were preparing to go to the nine-origin universe.<br/><br/>But they received this message?<br/><br/>”? ? ? en? Is this really the message that the Dragon King sent? The Dragon Palace wants to establish a Dragon Palace Alliance, this? ? ?”<br/><br/>“No Way, joining the Dragon Palace Alliance requires one-third of the breakthrough quota in the universe, and the price is so high?”<br/><br/>“For a powerful universe, the price may seem high, but for a weak universe, this is completely acceptable. You have to know that as long as you join the Dragon Palace, you will be protected by the Dragon Palace during the cataclysm, and not just once, but also during the next cataclysm. This is definitely a good thing for the weak universe.”<br/><br/>“The Dragon King wants to establish a Dragon Palace Alliance?”? “It’s a good thing for our universe. There’s nothing we can’t accept. If we join the Dragon Palace Alliance, we won’t have to worry about the safety of the universe. Who Dares to bully us if we join the Dragon Palace Alliance?”<br/><br/>“That’s right. Not only will we not have to worry about it every day, but we’ll also be able to do business in the Alliance after we join the Dragon Palace. We’ll be able to cultivate in peace and communicate with each other. This will bring great benefits to our strength. The price we have to pay is worth it!”<br/><br/>“It’s worth it, it’s worth it. We want to join the Dragon Palace, and I want to join the Dragon Palace!”<br/><br/>All the experts’eyes lit up when they saw this message.<br/><br/>For some weak universes, joining the Dragon Palace Alliance in exchange for protection was a huge gain!<br/><br/>Many universe experts were scared during the calamity.<br/><br/>They were afraid that other universes would invade.<br/><br/>Now, as long as they joined the Dragon Palace, everything would be settled.<br/><br/>With the current strength and prestige of the Dragon Palace and the strength of the Dragon King, who would dare to bully them?<br/><br/>Join, join immediately!<br/><br/>Some powerhouses immediately contacted the message left by Wang Xian.<br/><br/>They contacted Prime Minister Gui who was in charge of this matter!<br/><br/>“Dragon King, in just a few hours, there are already four universes that are willing to join our Dragon Palace Alliance. They are willing to give up one-third of their universe’s quota!”<br/><br/>After a few hours, Prime Minister Gui suddenly sent a message to Wang Xian and reported to him.<br/><br/>“Huh?”<br/><br/>When Wang Xian, who was building the base of the Dragon Palace, received this message, he was pleasantly surprised.<br/><br/>“In such a short period of time, there are already four universes that have agreed?”<br/><br/>A smile appeared on his face.<br/><br/>In one universe, there were at least six or more powerhouses in the Heaven’s origin realm that could be born.<br/><br/>If there were more, there would be ten.<br/><br/>In other words, a universe could provide two to three slots for the Dragon Palace.<br/><br/>Four universes were willing to join the Dragon Palace Alliance, which meant there would be around ten slots!<br/><br/>Moreover, this was just the beginning.<br/><br/>If there were twenty to thirty universes willing to join the Dragon Palace Alliance, the Dragon Palace could increase the number of slots by nearly a hundred.<br/><br/>This was enough for the disciples of the Dragon Palace to use.<br/><br/>“Prime Minister Gui, you are sending a message saying that the universes that are willing to join the Dragon Palace Alliance can come to the base of the Dragon Palace Alliance in the land of origin. All the universes that are willing to join can have a palace here.”<br/><br/>Wang Xian sent a message to Prime Minister Gui.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui replied.<br/><br/>Soon, there was another message about the Dragon Palace in the communication device of the land of origin.<br/><br/>“All the universe masters who have joined the Dragon Palace Alliance can head to the base of the Dragon Palace Alliance in the land of origin. The Dragon King is building a base. Members of the Dragon Palace Alliance can have a safe palace in the base!”<br/><br/>After this message was sent, some of the Masters in the land of origin flew toward the base of the Dragon Palace Alliance according to the addresses on the communication device.<br/><br/>Regardless of whether they were interested in joining the Dragon Palace Alliance or not.<br/><br/>They were all filled with curiosity.<br/><br/>“That Dragon King really wants to establish the Dragon Palace Alliance here. This is an imitation of the righteous alliance and the evil sequence faction. However, this dragon king really has the ability to establish a Dragon Palace Alliance. After all, he is a chaos-level existence!”<br/><br/>Not long after, a few figures not far away from the Dragon Palace Alliance base looked over and said.<br/><br/>“This is not good news for us. Once those weak universes join the Dragon Palace Alliance, if we want to attack those weak universes again, we have to consider the Dragon Palace!”<br/><br/>“There’s nothing we can do about it. The situation here has been changed. The birth of primal chaos existences will definitely have a huge impact on our region.”<br/><br/>A few experts shook their heads and discussed in low voices.<br/><br/>The establishment of the Dragon Palace Alliance was a good thing for those weak universes.<br/><br/>But for those powerful universes, it wasn’t a good thing.<br/><br/>Because those powerful universes still wanted to obtain some benefits from those weak universes during the calamity.<br/><br/>Now that the Dragon Palace alliance had been established, they had no choice but to dismiss this idea.<br/><br/>They could already imagine that in the future, a large number of weak universes would join the Dragon Palace Alliance. With the Dragon Palace Dragon King leading them, they would be a powerful force.<br/><br/>“No matter what, we can’t provoke the Dragon Palace Alliance in the future.”<br/><br/>A powerhouse said slowly.<br/><br/>Their universe wasn’t weak, and there were many powerhouses. Naturally, they wouldn’t take out one-third of the quota to join the Dragon Palace Alliance.<br/><br/>Furthermore, their universe didn’t have so many slots.<br/><br/>The rise of the Dragon Palace Alliance was already without a doubt.<br/><br/>As time passed, more and more universe warriors knew about the establishment of the Dragon Palace Alliance.<br/><br/>And more and more warriors wanted to join the Dragon Palace Alliance!<br/><br/>1,000 years later, a large number of warriors from other universes came to the front of the Dragon Palace Alliance base.<br/><br/>“Is this the base of the Dragon Palace Alliance? The Dragon Palace Dragon King personally built it, and there’s even a 9-origin universe array master that can be compared to a control level array master? The power contained within the Palace of the Alliance is extremely powerful!”<br/><br/>“In the future, there will be warriors of the Dragon Palace here, and even the Dragon King himself will oversee this place. In the future, we will also be very safe here.”<br/><br/>“Do you know how many universes have joined the Dragon Palace Alliance? A few decades ago, there were already more than 30 universes, right?”<br/><br/>“I don’t know, but the Dragon Palace Alliance base will be completed soon. When the time comes, the Dragon King will let everyone gather together.”<br/><br/>“Just ask Prime Minister Gui of the Dragon Palace. Prime Minister Gui is very easy to talk to, but I heard from Prime Minister Gui that soon, Prime Minister Gui will announce it in the communication device in the land of origin.”\t\t\t\t\t\t</div>", "images": {}, "success": true}