{"id": 1423, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075456.html", "title": "Chapter 4426 - Chapter 4426: In The 4425 Dragon Palace Alliance", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4426 - Chapter 4426: In The 4425 Dragon Palace Alliance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4426: In the 4425 Dragon Palace Alliance<br/><br/>“Dragon Palace Alliance?”<br/><br/>Wang Xian listened to Prime Minister Gui’s suggestion and raised his eyebrows slightly.<br/><br/>He felt that this was feasible!<br/><br/>There were more than a hundred universes around the land of origin. There were powerful universes with universes on the level of the Great Dao. However, there were more than a dozen of them.<br/><br/>The rest were ordinary universes.<br/><br/>There were even existences like the sword and magic universes.<br/><br/>If they were to offer two or three universe slots in such a universe in exchange for the Calamity’s safety, would they be willing to exchange?<br/><br/>Of course they would!<br/><br/>They were not even sure of their own safety, so the slots were not important to them.<br/><br/>On the contrary, if the Dragon Palace could protect their safety, then they could at least guarantee their own safety.<br/><br/>Only when they were safe could they become stronger.<br/><br/>If they paid two or three spots in the Heavenly Yuan blessed realm in exchange for enough time to be safe.<br/><br/>During this time, they could completely rise from the beginner level to the control level.<br/><br/>Then it wouldn’t be a loss at all.<br/><br/>Moreover, some weak universes didn’t know if they would be destroyed.<br/><br/>Once he was destroyed, the quota for his own universe would be taken away.<br/><br/>Therefore, once this alliance was established, there would definitely be many weak universes willing to join the Dragon Palace.<br/><br/>At that time, the Dragon Palace would be able to obtain a large number of quotas.<br/><br/>The quota for the breakthrough of the disciples of the Dragon Palace would be sufficient.<br/><br/>“Alright, then let’s Make a detailed plan. Since we are going to do it, it won’t be a simple game. Prepare the detailed rules, the location of the exchange, and some other benefits!”<br/><br/>Wang Xian nodded and looked at Prime Minister Gui. “Just like the Justice Alliance, establish a complete system and rules.”<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded. “I will plan the rules and rules in detail as soon as possible.”<br/><br/>Wang Xian nodded.<br/><br/>Although the Dragon Palace was slightly different from the Justice Alliance, there were many things that could be used as a reference.<br/><br/>Communication devices were the most basic.<br/><br/>Next was the communication platform.<br/><br/>The experts of the universe within the Dragon Palace Alliance could communicate and trade, and the Dragon Palace would be the guarantor.<br/><br/>The experts of the Dragon Palace Alliance were forbidden from fighting, and they could explore treasures together.<br/><br/>The experts of the Dragon Palace Alliance could enjoy the base in the land of origin, and the Dragon Palace would guarantee their safety.<br/><br/>Wait, wait, wait, wait!<br/><br/>The establishment of the Dragon Palace would bring great benefits to the Dragon Palace.<br/><br/>“Oh right, more than 100 million years have passed. I wonder how the war between the Justice Alliance and the evil sequence faction is going. Is there a winner or a loser? I hope the Justice Alliance can hold on!”<br/><br/>Prime Minister Gui went to plan the matters of the Dragon Palace Alliance. Wang Xian sat there and muttered.<br/><br/>However, he didn’t have any information on the Justice Alliance at the moment.<br/><br/>Wang Xian pondered for a moment and gave up on the idea of going there to take a look.<br/><br/>Although it was said that it would be quick if he went there to take a look since there was an lie.<br/><br/>He came to the front of the space of the primal chaos stone and looked inside.<br/><br/>Now that he had a large amount of resources, he naturally had to nurture the disciples of the Dragon Palace well.<br/><br/>With a lot of resources, they could open the primal Chaos Stone space and let the disciples of the Dragon Palace cultivate in it.<br/><br/>With the support of the heart of faith, the disciples of the Dragon Palace would improve at a terrifying speed.<br/><br/>After a hundred times of time and a lot of resources, the strength of the Dragon Palace would be greatly changed in 100 million years.<br/><br/>Of course, there was a prerequisite that the dragon palace had enough spots to break through.<br/><br/>“Dragon King, the basic plan has been taken care of. Please take a look.”<br/><br/>An hour later, Prime Minister Gui walked over and spoke to Wang Xian.<br/><br/>“Alright!”<br/><br/>Wang Xian nodded, he took over Prime Minister Gui’s plan and read it in detail. “HMM, very good. Next, we will build a base in the land of origin. Also, we will release this information on the communication device in the land of origin.”<br/><br/>“Yes. Also, Dragon King, I suggest that we can build a large base in the land of origin. A solid base. This will also show the strength of our Dragon Palace Alliance.”<br/><br/>“The land of origin is relatively more stable. It shouldn’t be a problem to build a base there!”<br/><br/>Prime Minister Gui nodded and continued his suggestion.<br/><br/>“Alright.”<br/><br/>Wang Xian nodded and replied. He pondered for a moment and said, “Go and invite the 12 ancestral witches over. We have enough resources here. When the time comes, let the 12 ancestral witches set up more formations there.”<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui replied one by one!<br/><br/>“Greetings, Dragon King!”<br/><br/>Not long after, the 12 ancestral witches came to the Dragon Palace and greeted Wang Xian respectfully.<br/><br/>Although Wang Xian was a junior, with his current strength, the 12 ancestral warlocks had no choice but to be respectful!<br/><br/>“There’s no need to be polite. Prime Minister GUI has already informed you of the situation, right? Are You Free?”<br/><br/>Wang Xian waved his hand at them with a smile and asked.<br/><br/>“Dragon King, it’s just a small matter. Of course, it’s not a problem.”<br/><br/>The 12 ancestral warlocks said with a smile.<br/><br/>“Alright, since that’s the case, let’s begin immediately. I’ll explain the base that I’m going to build to all of you. After that, I’ll choose the materials and resources that I Need!”<br/><br/>Wang Xian said to the 12 ancestral witches.<br/><br/>He explained the basic situation of the base that he was going to build.<br/><br/>When the 12 ancestral witches heard that, they were astonished.<br/><br/>The base that the Dragon King needed to build was not small.<br/><br/>After the twelve ancestral witches had set up some formations, Wang Xian got an lie to bring them to the land of origin.<br/><br/>In the following period of time, Wang Xian picked a good location in the land of origin.<br/><br/>After everything was confirmed, his eyes flickered slightly.<br/><br/>“Next, I have to announce this news.”<br/><br/>Wang Xian thought to himself.<br/><br/>Currently, there was only one way to announce this news. It was through the communication device in the land of origin.<br/><br/>As long as it was sent out, all the powerhouses would be able to receive it!<br/><br/>Wang Xian took out the communication device and immediately edited a message.<br/><br/>“Today, I, the Dragon King of the Dragon Palace, have established the Dragon Palace Alliance in the land of origin. All the universes can join. The condition for joining is one-third of the quota for the Heaven’s origin creation in the universe.”<br/><br/>“Joining the Dragon Palace Alliance will allow you to enjoy the permanent protection of the Dragon Palace during the cataclysm. If you are invaded during the Cataclysm, the Dragon Palace will take action to resolve it.”<br/><br/>“If you become a member of the Dragon Palace Alliance, you will have the right to reside in the base of the Dragon Palace Alliance in the land of origins. You will also have the right to trade and the right to trade under the protection of the Dragon Palace.”<br/><br/>“Joining the Dragon Palace will allow you to better communicate with other powerhouses and improve your strength. Those who are interested can contact the powerhouses of the Dragon Palace.”<br/><br/>After editing the information, Wang Xian showed a satisfied expression on his face and sent it out.<br/><br/>Looking to the side, Wang Xian started to build the base of the Dragon Palace Alliance.<br/><br/>It was easy to build the base. The most difficult part was to set up powerful formations.<br/><br/>It was enough to get the help of the 12 ancestral witches.<br/><br/>With the strength of the 12 ancestral witches’control level, it was enough to set up a control level formation here.<br/><br/>The main source of deterrence came from the Dragon Palace itself!\t\t\t\t\t\t</div>", "images": {}, "success": true}