{"id": 1426, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075471.html", "title": "Chapter 4429 - Chapter 4429: There Were 4428 To 84 People From The Heaven’S Origin", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4429 - Chapter 4429: There Were 4428 To 84 People From The Heaven’S Origin</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4429: There were 4428 to 84 people from the Heaven’s origin<br/><br/>“It’s the Dragon King!”<br/><br/>When the powerhouses from the 37 universes heard Wang Xian’s words, a hint of excitement appeared in their eyes.<br/><br/>They had considered carefully before joining the Dragon Palace Alliance.<br/><br/>Joining the Dragon Palace Alliance would bring them more benefits than just protecting them.<br/><br/>Just as the Dragon King had said, they could spar and interact with the other members of the Dragon Palace Alliance after joining the Dragon Palace Alliance. This would bring great benefits to their own strength.<br/><br/>In addition, this would allow them to have enough strength to train and search for treasures.<br/><br/>They didn’t have to stay in the universe and be afraid of the invasion of other universes.<br/><br/>As long as their strength increased, the number of slots they would lose wouldn’t matter anymore.<br/><br/>“Since everyone is a member of the Dragon Palace Alliance, let’s Get to know each other.”<br/><br/>Wang Xian smiled and said to them.<br/><br/>“It’s the Dragon King. Let Me Go First!”<br/><br/>An old man nodded with a smile and began to introduce himself.<br/><br/>Following that, the powerhouses from the 37 universes introduced themselves one by one.<br/><br/>Following that, Wang Xian held the first trade fair of the Dragon Palace Alliance.<br/><br/>After the trade fair, another banquet was held. It could be considered as a celebration banquet for the establishment of the Dragon Palace Alliance.<br/><br/>This made all the masters of the universe smile.<br/><br/>It made them feel that it was worth it to join the Dragon Palace Alliance!<br/><br/>The Dragon Palace Alliance was officially established.<br/><br/>At the same time, the Dragon Palace also released this information on the communication device in the land of origin.<br/><br/>It announced the establishment of the Dragon Palace Alliance.<br/><br/>It also announced all the universes that had joined the Dragon Palace Alliance!<br/><br/>This was also to tell all the powerhouses in the other universes.<br/><br/>These universes were under the protection of the Dragon Palace. If they dared to invade them, they would be going against the Dragon Palace.<br/><br/>“There are actually 37 universes that have joined the Dragon Palace Alliance. Doesn’t that mean that more than a hundred heavenly yuan creator realm powerhouses have joined them?”<br/><br/>“It’s about the same. The conditions for joining the Dragon Palace Alliance are very attractive to the weaker universes. With the protection of the Dragon Palace during the catastrophe, who would dare to invade them with the protection of the Dragon Palace Dragon King?”<br/><br/>“Now that they have formed an alliance, even without the Dragon King’s help, if anyone invades the universes of the members of the Dragon Palace Alliance, wouldn’t the Dragon King be able to send dozens of heavenly yuan creation realm powerhouses to destroy the invading universes with just a Word?”<br/><br/>“This is not a good thing for those powerful universes. Some of the stronger universes have disciples who want to break through to these weaker universes. Now that they have joined the Dragon Palace Alliance, it will be difficult for them to get a spot to break through again.”<br/><br/>“The birth of a king level expert will definitely change the situation here. The birth of the Dragon Palace Alliance is equivalent to the establishment of a behemoth. I hope the Dragon Palace Alliance won’t invade other universes.”<br/><br/>In the communication device, the experts of the other universes were discussing.<br/><br/>Some of the experts couldn’t help but feel worried.<br/><br/>Right now, the Dragon Palace and the members of the Dragon Palace alliance had more than a hundred heavenly yuan creation realm experts.<br/><br/>This power was too terrifying in the land of origin.<br/><br/>It could easily sweep through any universe.<br/><br/>However, no matter how worried these universe powerhouses were, the Dragon Palace alliance had been completely established.<br/><br/>No Powerhouse dared to provoke the Dragon Palace Alliance.<br/><br/>Time passed day by day.<br/><br/>After the Dragon Palace established the Dragon Palace Alliance, it had completely stabilized.<br/><br/>This time, the Dragon Palace had obtained 92 spots in the Heavenly Yuan realm from the Dragon Palace Alliance.<br/><br/>This allowed the Dragon Palace to not have to worry about the spots for a long time.<br/><br/>Time passed bit by bit.<br/><br/>With large amounts of resources and faith, the Dragon Palace could produce one or two experts in the Heavenly Yuan realm every few million years.<br/><br/>This made the Dragon Palace’s strength continuously increase.<br/><br/>Hundreds of millions of years passed smoothly once again.<br/><br/>During these hundreds of millions of years, the Dragon Palace added 42 Heavenly Yuan blessed realm experts.<br/><br/>But this time, hundreds of millions of years had passed, and the resources in the Dragon Palace weren’t completely used up.<br/><br/>There was still about a quarter left.<br/><br/>This also made the number of experts in the Dragon Palace Reach 74.<br/><br/>One force had more than 70 heaven origin creation realm experts. This was a terrifying number.<br/><br/>One had to know that there were only 95 heaven origin creation realm experts in the 37 universes of the Dragon Palace Alliance.<br/><br/>It was terrifying to think that one dragon palace had 74 heaven origin creation realm experts.<br/><br/>Time passed again and 20 million years passed in a flash.<br/><br/>A total of 120 million years had passed, and all the resources of the Dragon Palace had been used up again.<br/><br/>Of course, these resources didn’t include the divine trees and divine trees that could be regenerated.<br/><br/>At this point, the Dragon Palace had another 10 heaven origin creation realm experts.<br/><br/>The Dragon Palace had a total of 52 heaven origin creation realm experts.<br/><br/>Apart from these 52 heaven origin creation realm experts who had just broken through.<br/><br/>During this period, the Dragon Palace also added five masters of the control level.<br/><br/>You know, this time the heart of faith, but there is the level of the road.<br/><br/>The heart of faith at the level of the Great Dao, plus more than 10 billion years of practice.<br/><br/>Let the Dragon Palace North Frost they completely reach the control level.<br/><br/>In addition, the Dragon Palace of the two Tianyuan realm of the treasure, the North Frost holds the water attribute of the treasure.<br/><br/>There was also a light-type supreme treasure that belonged to the leader of the Dragon Palace’s Light Divine Dragon.<br/><br/>At the moment, their supreme treasures were comparable to two control-level existences.<br/><br/>Their strength was not weak even in the various universes.<br/><br/>The Dragon Palace’s strength had undergone an earth-shaking change. There were eighty-four heavenly Yuan realm powerhouses.<br/><br/>If this force were to deal with the former belief universe, it would sweep away everything.<br/><br/>In a few years, it would be able to completely eliminate the belief universe.<br/><br/>In addition, among the powerhouses of the Dragon Palace who had a breakthrough this time, Guan Shuqing and the other girls were included.<br/><br/>The Dragon Queens of the Dragon Palace had all reached the Heaven’s origin realm.<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>In a new dragon field of the Dragon Palace.<br/><br/>Wang Xian looked at the combat strength of the dragon field with a smile on his face.<br/><br/>In the front, more than a dozen experts of the Dragon Palace were engaged in a chaotic battle.<br/><br/>They were sparring.<br/><br/>The experts of the Dragon Palace were improving very quickly.<br/><br/>One of the most important points was that the experts of the Dragon Palace could spar and fight together.<br/><br/>This allowed their experience to improve rapidly.<br/><br/>“Little Xian, the strength of our Dragon Palace is getting stronger and stronger. With so many heaven origin creation realm experts, can we be considered invincible?”<br/><br/>At this moment, Guan Shuqing and the other girls flew over and looked at him with a smile. “You said that the Dragon Palace is almost invincible. Are we also pregnant with some babies?”<br/><br/>“Huh? Invincible? Hehe, there’s still some distance to be made.”<br/><br/>Wang Xian looked at them and chuckled. “However, if you want babies, it’s not impossible. After all, we have already stabilized.”\t\t\t\t\t\t</div>", "images": {}, "success": true}