{"id": 1437, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075526.html", "title": "Chapter 4440 - Chapter 4440: 4439 Chaos Behemoth, Death Mark", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4440 - Chapter 4440: 4439 Chaos Behemoth, Death Mark</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4440: 4439 Chaos Behemoth, death mark<br/><br/>Whoosh<br/><br/>Looking at a cave entrance, Wang Xian moved his body and flew straight upwards.<br/><br/>Unlike the top of the land of origin, the cave entrance was facing downwards.<br/><br/>This place was facing upwards.<br/><br/>Furthermore, these cave entrances could lead to an exit above.<br/><br/>This was similar to the entire universe being a meteorite. The interior was filled with various tunnels that had been dug.<br/><br/>Wang Xian entered a cave entrance and proceeded to go deeper into the cave entrance. He scanned his surroundings.<br/><br/>He sensed the location of the origin stone.<br/><br/>“HMM? There are a few more forks in the cave entrance. This is going to be troublesome. I’ll have to waste a long time!”<br/><br/>After flying for a few hours, a fork appeared at the entrance of the cave.<br/><br/>With the appearance of the fork, there were more places to look for.<br/><br/>However, Wang Xian had no other choice. He could only search bit by bit.<br/><br/>After going deep into a fork, Wang Xian searched and sensed.<br/><br/>After a few hours, another fork appeared.<br/><br/>He could only search one by one.<br/><br/>According to the scope of the divination by prophet Hong and the rest, Wang Xian had searched for half a year for just one hole.<br/><br/>“Wouldn’t it take five to six hundred years to find these thousands of holes? Furthermore, the stone of origin might not be in the hole, but it might be in the rock. One would need to dig to find it.”<br/><br/>“In this case, the probability of obtaining the stone of origin is too low. Let alone 100,000 years, one wouldn’t be able to obtain one even if one was unlucky.”<br/><br/>Wang Xian frowned slightly and mumbled.<br/><br/>This was indeed a huge problem.<br/><br/>However, it made sense after thinking about it. It would be problematic if it was easy to obtain such a powerful treasure like the stone of origin.<br/><br/>“I’ll search for it bit by bit. It’s fine if I can find the gigantic beasts of chaos. This is also an extremely huge resource.”<br/><br/>Wang Xian thought to himself as he continued to search through the holes one by one!<br/><br/>Time passed day by day.<br/><br/>There were many gigantic beasts of chaos in the land of origin. However, due to the huge area, it was not easy to find them.<br/><br/>This was similar to how there were thousands of small fish in the sea.<br/><br/>It was extremely difficult to catch these thousands of small fish.<br/><br/>After more than a hundred years, Wang Xian entered another cave entrance and continued to go deeper.<br/><br/>“Eh?”<br/><br/>However, when he entered this cave entrance again, he sensed a special aura.<br/><br/>The Aura that was left behind in this tunnel was different from the other caves.<br/><br/>“There is an obvious aura left behind by creatures. There might be giant beasts of primordial chaos in this cave entrance.”<br/><br/>Wang Xian’s eyes focused as he thought to himself.<br/><br/>He followed this aura and continued to go deeper into the cave.<br/><br/>After passing through dozens of forks, Wang Xian could feel that the aura in front of him was even more intense!<br/><br/>I’m getting closer. It should be not far ahead<br/><br/>Wang Xian’s eyes flickered.<br/><br/>An hour later, Wang Xian arrived at a relatively vast area.<br/><br/>In front of him, there were over a thousand forks.<br/><br/>The aura of the creature remained at each fork.<br/><br/>Wang Xian took out the divination lamp and divined the exact location of the creature.<br/><br/>This time, the divination was successful.<br/><br/>Wang Xian flew towards the entrance of a cave. After flying for more than ten minutes, a gigantic beast of chaos appeared in his line of sight.<br/><br/>It was a gigantic beast of chaos that looked like a pangolin.<br/><br/>It was about 10,000 meters in size and its color was exactly the same as the surrounding rocks.<br/><br/>It lay there motionlessly and was resting.<br/><br/>Based on its aura, it could be detected that this giant beast of chaos was equivalent to an experienced beginner-level beast.<br/><br/>Wang Xian swept his gaze around and made sure that there were no other giant beasts of chaos moving. In an instant, he arrived above this space beast.<br/><br/>The huge difference in strength caused this giant beast of chaos to not have the time to react.<br/><br/>When Wang Xian arrived above him, the giant beast of Chaos was alarmed and a violent aura erupted from its body.<br/><br/>Similar to the Space Beast, the Giant Beast of chaos could only hunt and eat instinctively.<br/><br/>When it encountered any living beings that contained energy, it would devour them.<br/><br/>Some of the more violent giant beasts of chaos would attack directly regardless of their strength.<br/><br/>Boom<br/><br/>Wang Xian moved his palm and a terrifying dragon claw struck the body of the chaotic beast. The terrifying force caused his vitality to disappear quickly.<br/><br/>“Squeak Squeak!”<br/><br/>It let out a terrified expression and its entire body emitted a luster. It wanted to use its powerful innate talent to escape.<br/><br/>However, Wang Xian did not give it any chance. Chaotic energy surged into its body and caused it to stop moving slowly. It was completely exterminated.<br/><br/>However, after Wang Xian killed this giant beast of chaos, a wave of energy attached itself to Wang Xian’s body.<br/><br/>This wave of energy carried a trace of hatred.<br/><br/>“Is this the mark of death that Prophet Hong and the others mentioned?”<br/><br/>After the Giant Beast of chaos in the land of origin died, the attacker would leave a mark of death on his body.<br/><br/>This mark of death could easily absorb the attacks of other giant beasts of chaos.<br/><br/>This was similar to how Wang Xian was marked when he killed the gigantic beasts of chaos.<br/><br/>This mark would attract the attacks of other gigantic beasts of chaos.<br/><br/>The mark of luring monsters.<br/><br/>After the death mark appeared, most powerhouses would leave this place immediately for safety’s sake. Then, they would completely eliminate this mark.<br/><br/>Otherwise, if they were to be attacked by more than ten gigantic beasts of chaos, people would die.<br/><br/>Every Chaos Behemoth possessed a powerful innate skill.<br/><br/>Once they were surrounded by more than a dozen chaos behemoths, those of the same level would definitely die.<br/><br/>Even if they were surrounded by four or five chaos behemoths, they would still die.<br/><br/>“I can get rid of this death mark on my own. However, it will still take tens of thousands of years.”<br/><br/>Wang Xian muttered as he sensed the death mark on his body.<br/><br/>He did not get rid of this death mark, nor did he have any intention of leaving this place.<br/><br/>Wang Xian was prepared to use this death mark to attract some giant beasts of primordial chaos over and then destroy them.<br/><br/>He had only been here for over 100 years, but he had already destroyed a giant beast of primordial chaos in over 100 years. It was a bloody profit.<br/><br/>Even if he did not find the stone of origin, it was still a bloody profit.<br/><br/>“Continue to search!”<br/><br/>After killing a giant beast of chaos, Wang Xian continued to search.<br/><br/>He searched for another 300 years.<br/><br/>He did not find the stone of origin, nor did he find the giant beast of chaos.<br/><br/>Wang Xian did not find anything in the first divination area.<br/><br/>“Divination can only predict a huge area. It is still too difficult to find the stone of origin accurately.”<br/><br/>Wang Xian shook his head helplessly.<br/><br/>This stone of origin might be among the rocks. It was impossible for Wang Xian to dig out every single rock.<br/><br/>Helpless, he could only go to the next area and continue his search.<br/><br/>Whoosh<br/><br/>His body moved and Wang Xian flew towards the next area.<br/><br/>According to the information on the map, it would take half a year to fly to the next area.<br/><br/>The distance was not far, but it was not close either.<br/><br/>However, when Wang Xian was flying forward, he suddenly felt a wave of aura flying toward him.\t\t\t\t\t\t</div>", "images": {}, "success": true}