{"id": 1434, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075511.html", "title": "Chapter 4437 - Chapter 4437: 4436 Joined The Divination Universe", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4437 - Chapter 4437: 4436 Joined The Divination Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4437: 4436 joined the divination universe<br/><br/>“Yes, Prophet Hong has no divination universe. As long as your divination universe is willing to make a move, with your strength and prestige, together with us, you can definitely build a powerful alliance. At that time, our overall strength will be even stronger than the Dragon Palace Alliance.”<br/><br/>The burly middle-aged man looked at prophet Hong and the others and continued to persuade them.<br/><br/>“I’m sorry, everyone.”<br/><br/>Prophet Hong and the prophet both shook their heads and directly refused.<br/><br/>“This… Sigh!”<br/><br/>The surrounding experts were helpless.<br/><br/>“We don’t have the idea to form any force, but we do have the idea to join the Dragon Palace Alliance. Please go ahead.”<br/><br/>Prophet Hong and the prophet directly sent them off.<br/><br/>“Join the Dragon Palace Alliance?”<br/><br/>Hearing their words, the experts were stunned. They slightly frowned, bowed, and left.<br/><br/>After the experts left, prophet Hong’s grandson put away his tea set and couldn’t help but look at his Grandpa and the others.<br/><br/>“Grandpa, why don’t we agree with them? Why do we still want to join the Dragon Palace Alliance?”<br/><br/>He was a little puzzled and couldn’t help but ask.<br/><br/>“Kid, you’ve suffered a loss once. Haven’t you learned your lesson?”<br/><br/>Prophet Hong looked at his grandson and lectured him!<br/><br/>The young man was slightly stunned. He pondered for a moment, and a look of realization appeared on his face.<br/><br/>“I get it. Because we divine the universe and have a special divination power, if we agree to form an alliance with them, then there will really be a great war with the evil sequence camp. The Evil Sequence Camp’s champions, the first to be killed will be our divination champions.”<br/><br/>“In addition, the evil sequence camp has chaos-level existences. We are not afraid of anything. If we are targeted, we will be their first target.”<br/><br/>“And if we join the Dragon Palace Alliance, that Dragon King is a chaos-level existence and can protect us. If there is a war with the evil sequence camp, there will be a dragon king in front of us.”<br/><br/>The young man said.<br/><br/>“Hehe, that’s right.”<br/><br/>Prophet Hong smiled and nodded.<br/><br/>“A gentleman doesn’t stand under a dangerous wall.”<br/><br/>The prophet also nodded. “We only want to protect ourselves and nothing else. The current Dragon Palace Alliance only wants to protect themselves and nothing else. I heard that the Dragon King is here in the land of origin. Let’s go visit that Dragon King later.”<br/><br/>“Okay, prepare the treasures. If the Dragon King doesn’t have any other ideas, we’ll join the Dragon Palace Alliance. There are too many experts from the evil sequence camp this time, so we have to be prepared.”<br/><br/>Prophet Hong nodded.<br/><br/>The prophet nodded.<br/><br/>Not long after, the two flew into the Dragon Palace Alliance.<br/><br/>“Dragon King, Prophet Hong and the prophet who have divined the universe have come to pay their respects.”<br/><br/>In the main hall, Prime Minister Gui came in and reported once again.<br/><br/>“Oh? Why are they here?”<br/><br/>Wang Xian raised his eyebrows and gestured to Prime Minister Gui. “Let them in.”<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded his head.<br/><br/>“Greetings, Dragon King. Sorry for disturbing you!”<br/><br/>Soon, prophet Hong and prophet Hong arrived and greeted Wang Xian respectfully.<br/><br/>“Hehe, what a rare guest. May I know why the two prophets are here?”<br/><br/>Wang Xian smiled and gestured for them to move to the side.<br/><br/>“Dragon King, I’m sure you are aware of the situation outside. Our divination universe is also a little restless and wants to find a place to settle down. If the Dragon Palace Alliance is only for security, our divination universe also wants to seek protection.”<br/><br/>Prophet Hong looked at Wang Xian and made it clear.<br/><br/>“Oh? You guys are interested in the Dragon Palace Alliance? With the strength of the divination universe, there’s no need to seek shelter, right? Prophet Hong, you three divination prophets are in charge. Even the evil sequence camp has to respect you.”<br/><br/>Wang Xian looked at them in surprise.<br/><br/>“To be honest, dragon king, according to our divination, the land of origin is not peaceful. We can’t guarantee that we can be alone. Joining the Dragon Palace Alliance is also a result of our careful consideration.”<br/><br/>The prophet said, “Of course, we join the Dragon Palace Alliance because we hope that the Dragon Palace Alliance will be like us. It is for the sake of self-preservation. If we take the initiative to start a war, we will not participate.”<br/><br/>“There is still a huge gap between the strength of our Dragon Palace Alliance and that of the evil sequence camp. Naturally, we will not take the initiative to provoke them. However, if the evil sequence camp invades the universe of the Alliance members, then we will be prepared for a great war. This is the principle of our Dragon Palace Alliance.”<br/><br/>“The Dragon Palace Alliance will not invade and will not start any war. However, if they are invaded, they will definitely retaliate.”<br/><br/>Wang Xian looked at them and said.<br/><br/>Prophet Hong looked at each other and nodded. He then looked at Wang Xian and said, “Dragon King, we do not have any spots for breakthrough in the divination universe. We have a few powerful treasures here.”<br/><br/>“In addition, if you need divination, we can help you with your divination for free. I wonder if you can join the Dragon Palace Alliance?”<br/><br/>As prophet Hong and the rest spoke, they moved their palms and a few treasures floated in the air.<br/><br/>Two weapons that were comparable to the Void Dragon Pool’s Tai Chi Dragon Plate.<br/><br/>There were also two special gemstones.<br/><br/>Each gemstone contained a terrifying amount of energy. Its power was not inferior to the two heaven origin creation level treasures.<br/><br/>Four treasures and free divination in the future.<br/><br/>This was a huge benefit to the Dragon Palace Alliance and even to the Dragon Palace.<br/><br/>In addition, divining the universe and joining the Dragon Palace Alliance was a huge benefit to the strength of the Dragon Palace Alliance.<br/><br/>Wang Xian’s eyes sparkled as he revealed a smile, he said seriously, “It’s the Dragon Palace Alliance’s honor for the divination universe to be willing to join the Dragon Palace Alliance. Welcome. In the future, all of you will be members of the Dragon Palace Alliance. As long as I am around, I will stand in front of you if any members of the alliance are invaded.”<br/><br/>“Then, we will need you to take care of us in the future, Dragon King.”<br/><br/>Prophet Hong and the rest also smiled as they stood up and cupped their hands.<br/><br/>“I will announce the matter of the divination universe joining the Dragon Palace Alliance. In addition, I will also announce the basic rules of the Dragon Palace Alliance. It is only for self-preservation!”<br/><br/>Wang Xian nodded and spoke to them.<br/><br/>“It’s the Dragon King.”<br/><br/>Prophet Hong and the rest nodded.<br/><br/>“Regarding the invasion of the evil sequence camp, did the universe divination predict something?”<br/><br/>Wang Xian looked at them and asked curiously.<br/><br/>Wang Xian didn’t expect the universe divination to join the Dragon Palace Alliance.<br/><br/>From the looks of it, they might have divined something dangerous. Otherwise, they wouldn’t have joined the Dragon Palace Alliance.<br/><br/>Their strength wasn’t weak.<br/><br/>“There are too many experts involved and the universe is involved. We can’t divine too many things.”<br/><br/>“It’ll be very chaotic here if we can only divine the origin. In this chaotic world, our ability to divine the universe isn’t a good thing.”<br/><br/>Prophet Hong answered truthfully.\t\t\t\t\t\t</div>", "images": {}, "success": true}