{"id": 1438, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075531.html", "title": "Chapter 4441 - Chapter 4441: 4440 Giant Beasts Of Primordial Chaos", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4441 - Chapter 4441: 4440 Giant Beasts Of Primordial Chaos</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4441: 4440 giant beasts of primordial chaos<br/><br/>“HMM?”<br/><br/>When Wang Xian sensed the waves of aura, his gaze froze slightly.<br/><br/>The Aura came from all directions. It was obvious that the waves of aura were heading towards him.<br/><br/>Every single aura was not weak.<br/><br/>“Four waves of Aura. Six giant beasts of primordial chaos are heading towards me. Is it because of the death Mark?”<br/><br/>Wang Xian squinted his eyes, which were sparkling.<br/><br/>According to his senses, among the six beasts of primordial chaos, three of them had reached the level of control.<br/><br/>The other three were existences at the beginner level.<br/><br/>“You can deal with them easily. They really came knocking on my door.”<br/><br/>Wang Xian revealed a smile.<br/><br/>He stared at the position on the right.<br/><br/>There were two beasts of primordial chaos there. Both of them were at the level of control.<br/><br/>“Buzz!”<br/><br/>Wang Xian went straight up to meet them.<br/><br/>His speed was very fast. Soon, two gigantic beasts of primordial chaos appeared in his sight.<br/><br/>These were two gigantic beasts of primordial chaos that were like giant rats.<br/><br/>Each of them was exuding a violent aura.<br/><br/>These two gigantic beasts of primordial chaos did not continue flying towards Wang Xian at this moment.<br/><br/>They could sense the location of the death mark.<br/><br/>When the difference was so great that Wang Xian, who possessed the death mark, was flying towards them at a terrifying speed.<br/><br/>The two gigantic beasts of chaos were clearly stunned.<br/><br/>Buzz Buzz<br/><br/>Buzz Buzz<br/><br/>Wang Xian teleported and arrived directly above them!<br/><br/>“Ji Ji!”<br/><br/>“Ji Ji!”<br/><br/>The two gigantic beasts of chaos immediately raised their heads and emitted ear-piercing sound waves from their mouths.<br/><br/>The sound waves caused the surrounding space to fluctuate and fold.<br/><br/>“Dong Dong!”<br/><br/>At the spot between Wang Xian’s brows, the heaven’s origin golden eyes appeared. Two golden rays shot towards them directly.<br/><br/>The two golden rays penetrated their bodies directly.<br/><br/>The two chaos beasts sensed the terrifying danger and their bodies began to shrink.<br/><br/>From the size of 10,000 meters, they instantly became half a meter in size.<br/><br/>Even though their bodies had shrunk, they still contained a terrifying aura.<br/><br/>“Eh? Their bodies have shrunk and the injuries on their bodies have also shrunk by a lot.”<br/><br/>Wang Xian raised his eyebrows. With a move of his palms, two large hands directly wrapped around them.<br/><br/>Boom<br/><br/>A powerful attack completely wrapped around the two giant beasts of chaos and killed them completely.<br/><br/>Two chaos behemoths at the control level could be easily dealt with by Wang Xian!<br/><br/>“Roar!”<br/><br/>“Roar! Roar!”<br/><br/>The moment he killed the two chaos behemoths, a roar came from behind.<br/><br/>The figures of the four chaos behemoths appeared in Wang Xian’s line of sight.<br/><br/>Wang Xian stared at the four chaos behemoths and instantly moved.<br/><br/>The body of the Void Divine Dragon flew out from his body and teleported to the front of the gigantic beasts of chaos.<br/><br/>The powerful spatial force directly killed them.<br/><br/>The third gigantic beast of chaos at the control level was also easily killed by Wang Xian.<br/><br/>“Buzz Buzz Buzz!”<br/><br/>“Buzz Buzz Buzz!”<br/><br/>When Wang Xian easily killed all six gigantic beasts of chaos.<br/><br/>Wang Xian could clearly feel that the death marks in his body had increased by a lot.<br/><br/>His body was filled with a special energy of hatred.<br/><br/>“The density of these death marks in my body has increased by more than ten times. The area of attraction will also increase by a lot.”<br/><br/>“According to prophet Hong and the rest’s reminder, if there are too many death marks, I will be attacked by a large number of beasts of primordial chaos.”<br/><br/>Wang Xian mumbled.<br/><br/>He waved his arm and collected all the corpses.<br/><br/>“Eh?”<br/><br/>However, when he collected the two giant beasts of chaos that looked like giant rats, he sensed a familiar aura in their bodies.<br/><br/>He waved his arm and sliced open the bodies of the two giant beasts of chaos. He saw two pieces of origin stones in their bodies.<br/><br/>These two pieces of origin stones were about the same size as the ones given by prophet Hong and the rest.<br/><br/>This made Wang Xian look pleasantly surprised.<br/><br/>“These two pieces of origin stones are obviously stored in the bodies of these two beasts of primordial chaos. TSK TSK, the corpses of six beasts of primordial chaos, plus the previous seven, plus the two pieces of origin stones, this is a huge harvest!”<br/><br/>Wang Xian’s face was full of smiles.<br/><br/>“The place I’m currently at is not considered the deep end of the land of origin. I can continue to go deeper.”<br/><br/>“Let’s see if I can attract more giant beasts of chaos and kill them!”<br/><br/>Wang Xian thought to himself.<br/><br/>He moved his body and continued to fly towards the area that Prophet Hong and the rest had predicted.<br/><br/>Following Wang Xian’s deep journey, Wang Xian arrived at the second area after flying for a few months.<br/><br/>During this few months of flight, he did not encounter any giant beasts of chaos that attacked him.<br/><br/>“Let’s continue to search this region.”<br/><br/>Wang Xian looked at a cave entrance and flew straight in. He continued to search.<br/><br/>It was indeed troublesome to search for the Stone of origin.<br/><br/>It was much more difficult than finding the giant beasts of chaos.<br/><br/>The stone of origin did not emit any special aura. It could only sense a little bit of it.<br/><br/>This caused Wang Xian to not touch the stone of origin for the next few hundred years.<br/><br/>He searched the entire second region but still could not find it.<br/><br/>“It’s indeed a little difficult. It’s better to hunt down those giant beasts of chaos. Perhaps some of them have the stone of origin stored in their bodies.”<br/><br/>Wang Xian said.<br/><br/>This time, Wang Xian did not head to the third region. Instead, he flew straight ahead.<br/><br/>“Eh? This cave entrance is huge. It’s dozens of times bigger than the other caves. Let’s go in and take a look!”<br/><br/>Wang Xian saw a huge cave entrance and entered it out of curiosity!<br/><br/>He went all the way in.<br/><br/>“There’s a special aura.”<br/><br/>Very soon, Wang Xian sensed some special aura.<br/><br/>This aura did not seem like a giant beast of chaos or a stone of origin.<br/><br/>“It should be some kind of treasure.”<br/><br/>Wang Xian was deep in thought as he followed this aura and ventured deeper into the cave.<br/><br/>Boom! Boom! Boom<br/><br/>However, when Wang Xian ventured deeper into the cave, he sensed waves of savage aura rushing towards him from behind.<br/><br/>This savage aura caused his expression to change slightly.<br/><br/>He actually felt some threat from this barbaric aura.<br/><br/>“Woo Woo Woo!”<br/><br/>“Woo Woo Woo Woo!”<br/><br/>Wang Xian stared at the spot where he had retreated to. At this moment, roars were heard.<br/><br/>The roars contained a tremendous pressure.<br/><br/>Wang Xian’s gaze focused as he stood there and continued to watch.<br/><br/>After dozens of minutes, Wang Xian saw numerous gigantic beasts of primordial chaos flying toward him.<br/><br/>One by one, the giant beasts of primordial chaos locked onto him. Their blood-red pupils were staring at him.<br/><br/>This was a giant beast of primordial chaos that looked like a bat.<br/><br/>This was not the most important part.<br/><br/>The most important part was that there were a total of 40 to 50 of them.<br/><br/>The weakest among them had just entered the Heaven’s origin realm.<br/><br/>The one in the middle even had the aura of a Great Dao.<br/><br/>“A group of Chaos Behemoths?”<br/><br/>Upon seeing so many chaos behemoths, Wang Xian’s expression changed!<br/><br/>Without any hesitation, he turned around and flew deeper into the cave!<br/><br/>He could not fight them head-on!\t\t\t\t\t\t</div>", "images": {}, "success": true}