{"id": 1433, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075506.html", "title": "Chapter 4436 - Chapter 4436: Under The Expansion Of The 4435 Dragon Palace Alliance", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4436 - Chapter 4436: Under The Expansion Of The 4435 Dragon Palace Alliance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4436: Under the expansion of the 4435 Dragon Palace Alliance<br/><br/>Wang Xian chatted with the experts of the Dragon Palace Alliance for a while before he started to cultivate in the base of the Dragon Palace Alliance.<br/><br/>Currently, Wang Xian could only wait for the fusion of the primal chaos stones to improve his strength.<br/><br/>This would take a long time!<br/><br/>Wang Xian didn’t have any good ideas either.<br/><br/>He had been cultivating in the base of the Dragon Palace Alliance and had been paying attention to the situation in the outside world.<br/><br/>As time passed, more and more universes around the land of origin were being attacked by the powerhouses of the evil sequence faction.<br/><br/>There were even powerhouses of the great dao-level evil sequence faction who appeared and invaded one universe.<br/><br/>In less than ten million years, there had been more than thirty universes that had been invaded.<br/><br/>There were more than 100 universes around the land of origin. Now, a third of the universes had been attacked.<br/><br/>Once the universes were attacked, all lives were destroyed and countless lives were massacred.<br/><br/>Flesh and blood were devoured and souls were absorbed.<br/><br/>It was extremely cruel.<br/><br/>Wang Xian even saw that there were other universe masters who had escaped to the land of origin.<br/><br/>Looking at the information one by one, he frowned slightly.<br/><br/>The aggressiveness of the powerhouses from the evil sequence faction was much stronger than what Wang Xian had imagined.<br/><br/>“Damn the evil sequence faction. Our universe has been invaded by more than a dozen powerhouses in the Heaven’s origin realm. We are no match for them at all. Now, the living beings in our universe are being massacred by them. Why aren’t there any powerful existences who have completely destroyed them?”<br/><br/>“Our universe has also been invaded. I’ve already fought them twice. I’ve already died twice, but there’s still nothing I can do. I can only bring my core disciples to my storage space.”<br/><br/>“They’re too cruel and bloody. Right now, there are more than thirty universes in our land of origin that have been massacred by them. There are countless living beings here.”<br/><br/>“The experts of the evil sequence faction are too strong. This time, they have at least 100 to 200 heaven origin blessed realm existences around our land of origin. It’s impossible to resist them!”<br/><br/>“Now, apart from the universes that have joined the Dragon Palace Alliance, about half of the universes have been invaded. The mid-level universes are basically doomed. It’s hard to say whether the stronger universes will be invaded.”<br/><br/>“Those that have joined the Dragon Palace alliance haven’t been attacked. The evil sequence faction must be afraid of the Dragon King’s strength and the threat of chaos. I wonder if the Dragon Palace Alliance will help us now that we have joined the Dragon Palace Alliance?”<br/><br/>“Let’s try joining the Dragon Palace Alliance. Let’s Go and ask the Dragon Palace Alliance.”<br/><br/>As more and more universes were invaded, some powerhouses were terrified.<br/><br/>Some of those who were invaded wanted to be rescued.<br/><br/>They immediately thought of the Dragon Palace Alliance.<br/><br/>This was because all those who joined the Dragon Palace Alliance were weak universes. But now, none of these weak universes were attacked.<br/><br/>The evil sequence camp was obviously worried about the Dragon King’s strength.<br/><br/>So now, they also wanted to join the Dragon Palace Alliance and pray for the Dragon King’s protection.<br/><br/>And those universes that had not been invaded were also feeling apprehensive.<br/><br/>The evil sequence camp’s offensive was too fierce now.<br/><br/>There were too many experts who came here.<br/><br/>Once the other universes were destroyed, would they join forces and invade them?<br/><br/>Even if their universe was very strong, the other side was stronger.<br/><br/>They had to be prepared.<br/><br/>And if they wanted to resist the invasion, there were two ways — to join the Dragon Palace Alliance.<br/><br/>But to join the Dragon Palace Alliance, they had to pay a price.<br/><br/>The second was to find other universe masters and form an alliance together to resist the possible invasion.<br/><br/>But to form an alliance, it wasn’t that easy. There were too many things and benefits involved.<br/><br/>Regardless, there were already experts taking action!<br/><br/>“Dragon King, there are experts from other universes who are here. They want to join our Dragon Palace Alliance and receive our protection. However, they are currently being attacked by the evil sequence faction. I rejected them directly.”<br/><br/>Prime Minister Gui came to Wang Xian and reported a situation to him.<br/><br/>“Okay.”<br/><br/>Wang Xian nodded and agreed with Prime Minister Gui’s action.<br/><br/>He didn’t join the Dragon Palace Alliance at that time. Now that he was invaded, Wang Xian wouldn’t agree to join the Dragon Palace Alliance.<br/><br/>This was because once he agreed, it would mean that he was provoking the evil sequence faction. This meant that he was going to start a war against the evil sequence faction.<br/><br/>The Dragon Palace alliance was not stupid enough to do such a thing.<br/><br/>“Dragon King, I think that there might be unattacked universes joining the Dragon Palace Alliance. We can agree to their joining.”<br/><br/>“In addition, I suggest that the threshold for joining the Dragon Palace Alliance should be raised. After all, if we agree to their joining now, we will have to take a certain risk.”<br/><br/>Prime Minister Gui continued his suggestion.<br/><br/>“Alright. The following universes that want to join should be quite strong. There might not be any spots in their universe. If there aren’t any spots, we will ask them to provide sufficient resources.”<br/><br/>Wang Xian pondered for a moment, he then said, “In addition, we have to tell them that once they join the Dragon Palace Alliance, the universes of the members of the Dragon Palace Alliance will be invaded. If there is a war with the evil sequence alignment camp, they will have to take action.”<br/><br/>“It’s the Dragon King.”<br/><br/>Prime Minister Gui nodded.<br/><br/>“Prophet Hong, now that the experts of the evil sequence alignment are wreaking havoc here, we have to stick together. Otherwise, we might be attacked by them.”<br/><br/>“The divination universe has great prestige around our land of origin. Let’s form an alliance. What do the two prophets think?”<br/><br/>At the same time, in the bamboo forest where the universe divination was located in the land of origin.<br/><br/>More than twenty figures emitting powerful auras stood in the courtyard. They looked at the two prophets in front of them and spoke.<br/><br/>“Everyone, I’m afraid that our divination of the universe will be difficult.”<br/><br/>Prophet Hong and the Prophet looked at each other and shook their heads bitterly.<br/><br/>“If the two of you say that it will be difficult, who else can shoulder this responsibility?”<br/><br/>The burly middle-aged man in front said.<br/><br/>He was also a great dao existence.<br/><br/>Although he was very strong and the universe he lived in was also very strong, the current situation forced him to make preparations.<br/><br/>A powerful alliance was necessary.<br/><br/>“Establishing an alliance isn’t that simple, especially one that fights against the evil sequence faction.”<br/><br/>Prophet Hong shook his head and said.<br/><br/>“We don’t need to fight against the evil sequence faction to build an alliance. We only need to protect ourselves.”<br/><br/>An expert beside him said, “As long as the divination universe is willing to build an alliance, we can definitely gather a large number of experts. Not to mention anything else, there will be at least 20 to 30 universes willing to join. Furthermore, these universes aren’t weak. By then, we can gather more than 100 Tianyuan blessed realm experts.”\t\t\t\t\t\t</div>", "images": {}, "success": true}