{"id": 1439, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075536.html", "title": "Chapter 4442 - Chapter 4442: 4441’S Strength Increased", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4442 - Chapter 4442: 4441’S Strength Increased</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4442: 4441’s strength increased<br/><br/>“The death mark on my body has attracted so many giant beasts of Primordial Chaos?”<br/><br/>“The moment I killed one giant beast of primordial chaos, I attracted six giant beasts of primordial chaos. I killed a total of seven giant beasts of primordial chaos and attracted dozens of giant beasts of primordial chaos.”<br/><br/>Wang Xian quickly flew into the black hole.<br/><br/>He couldn’t afford to offend these dozens of giant beasts of primordial chaos.<br/><br/>“Roar! Roar! Roar!”<br/><br/>The dozens of giant beasts of chaos roared when they saw Wang Xian escaping.<br/><br/>They chased after him rapidly from behind.<br/><br/>However, Wang Xian’s speed was much faster than theirs.<br/><br/>With his full strength, he quickly shook off the group of giant beasts of chaos.<br/><br/>“Although the cave entrance is complicated, it’s best for me to leave this place. Otherwise, it would be a huge problem if I’m blocked.”<br/><br/>Wang Xian thought to himself.<br/><br/>He moved his palm and took out the divination lamp to divine the location of the exit.<br/><br/>Soon, he found a route and flew out quickly.<br/><br/>Five days later, Wang Xian flew out from the cave entrance.<br/><br/>It was pitch-black outside. He had already left the area of the Black Sandstorm.<br/><br/>“Looks like I have to get rid of the death mark on my body first.”<br/><br/>According to Wang Xian’s guess.<br/><br/>The more death marks on his body, the more giant beasts of primordial chaos he would attract.<br/><br/>The giant beasts of primordial chaos here were not fools.<br/><br/>The aura of the death mark on Wang Xian’s body was so dense that it was impossible for the giant beasts of primordial chaos to come and seek his death.<br/><br/>If that was the case, all the giant beasts of primordial chaos here would have been killed long ago.<br/><br/>When a person had enough death marks on his body, a large number of giant beasts of primordial chaos would come and kill him.<br/><br/>At that time, he would die if he did not escape.<br/><br/>“It will take a long time to remove the death imprints in his body. Moreover, it’s best that he doesn’t stay in the land of origin during this period of time.”<br/><br/>Wang Xian mumbled.<br/><br/>He hesitated for a moment before calling an lie over. After that, he returned to the Dragon Palace.<br/><br/>When he arrived at the Dragon Palace, Wang Xian immediately contacted Prime Minister Gui and asked him to send a message to the land of origin.<br/><br/>It was about the acquisition of the Stone of origin.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui received Wang Xian’s message and replied immediately. He continued, “Dragon King, ever since the universe divination joined our Dragon Palace Alliance, there are eight other universes that are not weak and want to join our Dragon Palace Alliance.”<br/><br/>“They are willing to provide sufficient resources. I have agreed to all of them.”<br/><br/>“Oh?”<br/><br/>When Wang Xian heard Prime Minister Gui’s words, he raised his eyebrows slightly.<br/><br/>There were eight more universes that were willing to join the Dragon Palace Alliance.<br/><br/>One had to know that joining the Dragon Palace Alliance required a lot of resources.<br/><br/>For example, divining the universe required a lot of valuable resources and treasures.<br/><br/>Now, there were eight more universes that were willing to join. This was a huge amount of resources.<br/><br/>“HMM, investigate. As long as the rules are met, all of them will agree. Announce the matter of the Stone of origin as soon as possible.”<br/><br/>Wang Xian replied to Prime Minister Gui.<br/><br/>“It’s Dragon King!”<br/><br/>Prime Minister Gui replied.<br/><br/>Soon, a message was announced at the land of origin.<br/><br/>The message was about purchasing the Stone of origin at a high price.<br/><br/>There were two stones of origin in the divination universe.<br/><br/>Then the other universe masters might have origin stones too.<br/><br/>The Dragon Palace took them back at a high price. As long as they had origin stones, they would be willing to trade.<br/><br/>Because the price the dragon palace paid far exceeded the value of one origin stone.<br/><br/>“Four origin stones can increase my fusion rate by 8% . The fusion rate of primal chaos stones has reached over 20% .”<br/><br/>“It will take about 100,000 years to remove the death mark.”<br/><br/>Wang Xian thought to himself.<br/><br/>He took out the stones of origin and began to absorb them bit by bit.<br/><br/>Time passed bit by bit. The four stones of origin were absorbed by Wang Xian bit by bit.<br/><br/>However, when he had just finished absorbing them, Prime Minister Gui sent a piece of good news.<br/><br/>“Dragon King, I have collected four origin stones here.”<br/><br/>Prime Minister Gui sent a message.<br/><br/>“Get an lie to send them over immediately.”<br/><br/>Wang Xian smiled when he saw the news.<br/><br/>After finding four origin stones and adding these four stones, his fusion rate would reach about 36% .<br/><br/>“The strength of the power of Chaos is extremely terrifying. Its mass far exceeds the mass of my current energy. I feel that the power of chaos that I have absorbed is only slightly weaker than my entire strength.”<br/><br/>“If I reach 36% , my strength should be able to increase by quite a lot.”<br/><br/>Wang Xian moved his palm and condensed a gray ball in it.<br/><br/>The process of fusing with the primal chaos stone was the process of converting one’s own energy into the power of chaos.<br/><br/>With a fusion rate of 28% , the conversion rate of his own power of chaos was 28% .<br/><br/>The converted power of chaos was only slightly weaker than his own strength.<br/><br/>When the explosive power of the power of chaos was stronger than the energy in his body, he could only use the power of chaos when he fought.<br/><br/>Wang Xian pondered in his heart.<br/><br/>Not long after, an lie came over with four origin stones.<br/><br/>One of the origin stones contained more than twice the amount of energy that Wang Xian had obtained.<br/><br/>This was another pleasant surprise for Wang Xian.<br/><br/>“After absorbing all of it, the energy of the power of chaos will surpass my previous strength.”<br/><br/>Wang Xian’s eyes shone brightly.<br/><br/>It had been a long time since his strength had experienced any improvement.<br/><br/>Now, his strength would finally experience some improvement.<br/><br/>Placing the stone of origin in front of him, Wang Xian absorbed it bit by bit.<br/><br/>Time passed once again.<br/><br/>Soon, a few hundred years passed in the blink of an eye.<br/><br/>Boom<br/><br/>The Stone of origin in front of Wang Xian was completely absorbed.<br/><br/>His body shook, and a greyish energy burst out from his body.<br/><br/>The greyish energy was exactly the same as the deathly stillness energy in the chaos.<br/><br/>In the deathly stillness, there was also a hint of life force.<br/><br/>Chaos turned into all things.<br/><br/>All things, into chaos!<br/><br/>Wang Xian waved his hand casually and a wave of chaotic energy exploded in front of him.<br/><br/>Sensing the strength of this force, he smiled.<br/><br/>Without the help of any treasures, the fusion rate was 38% .<br/><br/>Without including the Void Dragon body, his strength was equivalent to one chaos level and six beginner levels.<br/><br/>With the body of the Void Dragon and all the treasures.<br/><br/>Wang Xian’s current strength was one primal chaos level, two great dao level, and one beginner level.<br/><br/>He was much stronger than before.<br/><br/>“My strength has increased a little. If I have more origin stones, I will be able to match two primal chaos level existences in no time. This is very terrifying.”<br/><br/>Wang Xian’s eyes flashed with excitement.<br/><br/>However, it would not be so easy to obtain more origin stones.<br/><br/>“I hope I can purchase more. In addition, I can go to the underground of the land of origin to take a look.”<br/><br/>Wang Xian thought to himself.\t\t\t\t\t\t</div>", "images": {}, "success": true}