{"id": 1432, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075501.html", "title": "Chapter 4435 - Chapter 4435: 4434. The Expansion Of The Dragon Palace Alliance", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4435 - Chapter 4435: 4434. The Expansion Of The Dragon Palace Alliance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4435: 4434. The expansion of the Dragon Palace Alliance<br/><br/>“The evil sequence faction is still too powerful. I heard that they just had a huge war with the Justice Alliance, and they’re currently in a truce period. The evil sequence faction likes to invade weak universes, but this time, other than the carefree universe being invaded, none of our other universes have been invaded.”<br/><br/>“According to the style of the evil sequence faction, they would first slaughter the weaker universes. We were not invaded because we are members of the Dragon Palace Alliance. After all, the Dragon King is a chaos-level existence. Even the evil sequence faction does not want to provoke a chaos-level existence!”<br/><br/>“Indeed. It is all thanks to the Dragon King that so many universes of ours were not invaded. The evil sequence faction definitely knows about our situation here. Haha, it is all thanks to us joining the Dragon Palace Alliance!”<br/><br/>“Damn you, Dragon King. The last time the carefree universe was invaded, the Dragon King personally took action and took care of them in less than a month. The experts of the evil sequence faction also have to consider the consequences of going against us, Dragon King.”<br/><br/>“Indeed. This time, the Dragon King summoned us to talk about the evil sequence faction.”<br/><br/>“Haha, I’m glad we joined the Dragon Palace Alliance. If we didn’t, I’m sure that at least half of our universes have been invaded by the evil sequence faction.”<br/><br/>In the base of the Dragon Palace Alliance, the members gathered together and chatted with each other with smiles.<br/><br/>Now, they had experienced the benefits of joining the Dragon Palace Alliance.<br/><br/>Now, they had witnessed the situation in the universe around the land of origin.<br/><br/>In this situation, they hadn’t been invaded because of the Dragon King.<br/><br/>It was their wisest choice to join the Dragon Palace Alliance.<br/><br/>“Everyone, let’s gather.”<br/><br/>At this moment, Prime Minister Turtle’s voice echoed in everyone’s ears.<br/><br/>When the members of the Dragon Palace Alliance heard it, they immediately flew towards the main hall.<br/><br/>“Greetings, Dragon King!”<br/><br/>When they saw Wang Xian in front of them, more than 90 experts bowed respectfully.<br/><br/>“You’re welcome. Take a seat. This time, I’m gathering everyone to have a simple chat!”<br/><br/>Wang Xian looked at all the experts and extended his hand with a smile on his face.<br/><br/>“Please speak, Dragon King. We will definitely cooperate with all of you!”<br/><br/>An elder said with a smile on his face.<br/><br/>“Hehe, that’s good. If there’s anything, I’ll just say it.”<br/><br/>Wang Xian nodded. “Everyone should understand the current situation of the universe around the land of origin. The evil sequence faction is very strong. Fortunately, they didn’t invade the universe of the members of the Dragon Palace Alliance. However, we have to be prepared just in case.”<br/><br/>“Everyone is now a member of the Dragon Palace Alliance. In my opinion, since we are members of the same alliance, we are friends with each other. If any members of the Alliance were attacked by the evil sequence faction, we should be prepared to fight them. No matter what universe is attacked, we will do our best.”<br/><br/>Wang Xian looked at them and spoke solemnly.<br/><br/>“It’s the Dragon King. I agree with your point of view. Our members are all weak universes. If we were to be attacked by the evil sequence camp, we should be united.”<br/><br/>As soon as Wang Xian finished his sentence, there were experts who agreed and nodded heavily.<br/><br/>“I agree as well. We are weaker, so we should form a team to keep them warm. If the evil sequence camp were to invade us, we will let them know how powerful we are!”<br/><br/>The experts beside him also echoed.<br/><br/>“Everyone, don’t worry. Since you have joined the Dragon Palace Alliance, unless you start an all-out war with the evil sequence faction, you don’t have to take action. I will settle it myself!”<br/><br/>Wang Xian looked at them and said!<br/><br/>“Dragon King, we understand the current situation. If it weren’t for you, I’m afraid that our weak universes would have been invaded by the evil sequence faction long ago.”<br/><br/>“If they really invade any of our universes, we are willing to fight them. We also understand that only unity can make us stronger and prevent us from being invaded.”<br/><br/>A universe master said with a serious face.<br/><br/>The surrounding masters also nodded.<br/><br/>They also understood that if they fell behind, they would be beaten.<br/><br/>After the Dragon Palace Alliance was established, a group of like-minded universe experts often gathered together.<br/><br/>The Dragon Palace alliance was like a bond, allowing many experts to get to know each other and become close friends.<br/><br/>If the experts from the evil sequence camp really invaded one of their universes, they wouldn’t be afraid at all under the leadership of the Dragon King.<br/><br/>After all, the Dragon King was a primal chaos level existence.<br/><br/>“Alright, as long as everyone has this idea. There’s nothing to be afraid of from the evil sequence faction. If they dare to invade our universe, our Dragon Palace will take action to settle it. If they want to start an all-out war, our entire Dragon Palace Alliance will accompany them to the end.”<br/><br/>Wang Xian’s eyes sparkled as he spoke.<br/><br/>“Dragon King, with you around, we will not retreat. If they really invade any of our universes, we are willing to lend a hand.”<br/><br/>The group of powerhouses said seriously.<br/><br/>“Alright, don’t worry. If there is a war, the Dragon Palace will be in front of you.”<br/><br/>Wang Xian said seriously.<br/><br/>If they took out quotas to join the Dragon Palace, the Dragon Palace would not treat them as pawns.<br/><br/>They would treat them as pawns that could be discarded.<br/><br/>If there was really a war, the Dragon Palace would stand in front of them.<br/><br/>This was a matter of principle.<br/><br/>“Dragon King, don’t worry. We’ve become acquainted with each other because of you. If there’s really a war with the evil sequence camp, we’ll fight to the death. So what if we die once? Haha, because of you, Dragon King, we’ll have a much easier time in this calamity.”<br/><br/>An old man laughed and said.<br/><br/>“That’s true. If the evil sequence camp dares to invade us, we’ll dare to stand with them. Our Dragon Palace Alliance isn’t weak, especially with the Dragon King around.”<br/><br/>The surrounding experts echoed. All of them were filled with fighting spirit.<br/><br/>“Hehe, everyone, don’t worry. The evil sequence faction will not deliberately provoke us.”<br/><br/>Wang Xian smiled and said to them, “However, everyone should be mentally prepared. We are not afraid of ten thousand, but we are afraid of just a single possibility.”<br/><br/>“Dragon King, as long as you say the word, we can fight at any time.”<br/><br/>An old man waved his hand and said.<br/><br/>“Alright, everyone, continue to train hard. Hopefully, more control-level powerhouses will be born. Hehe!”<br/><br/>Wang Xian smiled and said.<br/><br/>“Alright, Dragon King. Now, we don’t have to worry about the situation in the universe. We can exchange pointers with everyone frequently and our strength will improve much faster than before. Haha.”<br/><br/>A powerhouse laughed.\t\t\t\t\t\t</div>", "images": {}, "success": true}