{"id": 1435, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075516.html", "title": "Chapter 4438 - Chapter 4438: 4437 Stone Of Origin", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4438 - Chapter 4438: 4437 Stone Of Origin</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4438: 4437 stone of origin<br/><br/>There was a limit to the divination ability of the universe.<br/><br/>Divination was related to one’s own strength and the events they divined.<br/><br/>It was very difficult for them to divine the situation of an area.<br/><br/>Divining one’s own future was not accurate at all.<br/><br/>Wang Xian had a long conversation with prophet Hong and the rest.<br/><br/>It was mainly about their views on the current situation and the future direction and decisions of the Dragon Palace Alliance.<br/><br/>Prophet Hong and the prophet also made some suggestions.<br/><br/>Wang Xian humbly accepted the suggestions of these two prophets.<br/><br/>Divination of the universe. The three great prophets were all existences at the level of Great Dao.<br/><br/>Their divination ability, coupled with their own strength, could be said that the divination of the universe was indeed very powerful around the land of origin.<br/><br/>In the past, when there was no nine-origin universe and no Dragon Palace, the power of the divination universe here in the land of origin could be ranked first.<br/><br/>Otherwise, the great beings of other powerful universes wouldn’t have thought of inviting the three great prophets of the divination universe to establish an alliance.<br/><br/>Because they indeed had this prestige.<br/><br/>But unfortunately, they didn’t know the scruples of the divination universe.<br/><br/>This could not be said to be a scruple of divining the universe. Instead, it was because the three great prophets understood that if they really established an alliance and a war really broke out, there would definitely be disasters when they divined the universe.<br/><br/>After all, they did not have the power of the chaos level.<br/><br/>In the absence of absolute power, they were also the initiators of the alliance. When the war came, coupled with the uniqueness of their divination, who would die if they did not die?<br/><br/>Even if they were very powerful.<br/><br/>Wang Xian was very polite to them. After all, the Dragon Palace alliance was indeed lacking the power of the Great Dao.<br/><br/>However, when the Dragon Palace Alliance announced the joining of the universe divination, this news caused a huge sensation in the land of origin.<br/><br/>“What’s going on? The universe divination has joined the Dragon Palace Alliance? No Way. With the strength of the three great prophets, is there a need for them to join the Dragon Palace Alliance?”<br/><br/>“No Way? Could it be that the three great prophets of the divination universe predicted something and joined the Dragon Palace Alliance? Did they join the Dragon Palace Alliance because of some special signal?”<br/><br/>“Is it possible that the divination universe predicted that there would be a disaster and joined the Dragon Palace Alliance so that they could get rid of this disaster?”? “Just like now, dozens of universes have been invaded by the evil sequence faction, but none of the members of the Dragon Palace Alliance have any problems. Should we join the Dragon Palace Alliance as well?”<br/><br/>“F * ck, the divination universe has joined the Dragon Palace Alliance, so I want to join too. In this situation, the terrifying powerhouses of the evil sequence faction could invade our universe at any time. If we join the Dragon Palace Alliance, the powerhouses of the evil sequence faction wouldn’t dare to invade us.”<br/><br/>In the land of origin, the powerhouses from the universe were discussing.<br/><br/>Some powerhouses headed straight for the Dragon Palace Alliance, wanting to join the Dragon Palace Alliance.<br/><br/>At this moment, Wang Xian did not care about the situation in the outside world.<br/><br/>When Prime Minister Gui led the two great prophets of the universe divination to the palace that was giving the universe divination.<br/><br/>Wang Xian sized up the four treasures that the universe divination had sent over.<br/><br/>Wang Xian did not pay much attention to two of the weapons.<br/><br/>If this weapon was given to the powerhouses of the Dragon Palace, it could increase the strength of the powerhouses of the Dragon Palace by a lot.<br/><br/>It was almost at the level of an old-timer who had just entered the beginner level. With the addition of one treasure, it could reach the level of control.<br/><br/>It was equivalent to the Dragon Palace adding two of the weakest powerhouses of the Heaven’s origin.<br/><br/>The amount of money spent on divination was not small.<br/><br/>However, the two weapons did not surprise Wang Xian. What surprised and surprised him was the two gemstones.<br/><br/>The two gemstones were very strange, yet they contained terrifying energy.<br/><br/>“This gemstone is very strange. It contains extremely terrifying energy. The energy in it can be absorbed. Regardless of the attribute, it can be directly absorbed to increase one’s strength.”<br/><br/>“The energy contained in this gemstone is comparable to that of the weakest beginner level powerhouse. It’s strange. What attribute is this gemstone? It doesn’t seem to be able to sense any attribute. However, if it is absorbed, it can enhance any attribute.”<br/><br/>“It can be converted into metal, wood, water, fire, and other attributes.”<br/><br/>Wang Xian mumbled.<br/><br/>That wasn’t the most important thing.<br/><br/>The most important thing was that Wang Xian realized that by absorbing the energy here, he could increase his fusion with the primal chaos gem.<br/><br/>That’s right. By absorbing the energy within, he could clearly feel that his fusion with the primal chaos gem had increased his experience bar.<br/><br/>This was the first time Wang Xian discovered a treasure that could increase his fusion with the primal chaos stone.<br/><br/>“What a pleasant surprise. I feel that absorbing a gemstone can increase my fusion rate by 2% . If I have a large number of gemstones, I can completely fuse with the primal Chaos Stone.”<br/><br/>“At that time, I might experience a metamorphosis, a true metamorphosis. This gemstone is very important.”<br/><br/>Wang Xian’s mind stirred as he sensed prophet Hong and the others not far away.<br/><br/>He moved and teleported to the front of their palace instantly.<br/><br/>“Prophet Hong, prophet Fa!”<br/><br/>He came to the front and shouted.<br/><br/>“HMM? Dragon King, please come in!”<br/><br/>Their voices came from inside.<br/><br/>“Prophet Hong, I’m sorry to bother you. Where did you get these two gems that you just delivered?”<br/><br/>Wang Xian looked at them and asked.<br/><br/>“Dragon King, are you talking about the Stone of origin?”<br/><br/>The two prophets looked at Wang Xian and asked.<br/><br/>“Are they called the Stones of origin?”<br/><br/>Wang Xian took out the two gemstones.<br/><br/>“Yes, we call this gemstone the stone of origin. In addition, we call it the stone of karma. This is a very powerful and special gemstone. Any cultivator can absorb the energy in it to increase their strength.”<br/><br/>“This gem was born in the land of origin. It is the food of a giant beast of chaos. It is very difficult to obtain it. Even for us, we only have two pieces. We have used the rest.”<br/><br/>Prophet Hong spoke.<br/><br/>“The Stone of origin and the stone of karma can be converted into any energy.”<br/><br/>Wang Xian mumbled.<br/><br/>This characteristic was somewhat similar to the primal chaos gem.<br/><br/>It could transform into anything.<br/><br/>“If you want to obtain it, is it Easy?”<br/><br/>Wang Xian looked at them and asked.<br/><br/>“It’s very difficult. Of course, with your strength, it might be easier. This stone of origin is located on the other side of the land of origin. There are two sides to the land of origin. The one we are in now is called the top. This place is relatively safer and is occupied by a group of powerhouses.”<br/><br/>“The one below is pitch-black and filled with all kinds of energy. There are also a lot of black holes. There are a lot of chaos behemoths there. There are many chaos behemoths at the Great Dao level. As for whether there are any at the chaos level, it is possible.”<br/><br/>“The Stone of origin was born there and is the food of the chaos behemoths. Of course, for the chaos behemoths, such powerful and precious food is rarely seen. Some of the chaos behemoths even fight for it.”\t\t\t\t\t\t</div>", "images": {}, "success": true}