{"id": 1436, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075521.html", "title": "Chapter 4439 - Chapter 4439: 4438 Below The Land Of Origin", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4439 - Chapter 4439: 4438 Below The Land Of Origin</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4439: 4438 below the land of origin<br/><br/>From the two prophets, Wang Xian had a detailed understanding of the land of origin.<br/><br/>He also had an understanding of the stone of origin.<br/><br/>Below the land of origin was the paradise of the Giant Beasts of chaos. There were a large number of giant beasts of chaos gathered there.<br/><br/>These giant beasts of Chaos spent most of their time living in the land of origin.<br/><br/>Of course, there were also some who entered the boundless chaos to search for food, Hunt, and so on.<br/><br/>The Stone of origin was born at the location below the land of origin.<br/><br/>To the group of giant beasts of chaos, it was also an extremely precious food.<br/><br/>“Looks like I have to go down and take a look. Coincidentally, the resources of the Dragon Palace have been depleted. Hunting some giant beasts of Chaos is an extremely huge resource.”<br/><br/>Wang Xian thought to himself. He was prepared to go and take a look.<br/><br/>However, before he took action, he could let the two prophets who were divining the universe to perform a divination.<br/><br/>He could see where the stone of origin was.<br/><br/>The Stone of origin was very important to Wang Xian.<br/><br/>As long as he could fuse with the primal chaos stone, he would be able to mobilize more chaos energy.<br/><br/>The power of chaos was much stronger than the energy in his body.<br/><br/>When the power of chaos in his body was converted into sufficient strength, his strength would be enhanced.<br/><br/>As for how much of an improvement, it would depend on the degree of fusion with the primal chaos stone.<br/><br/>“Prophets, can you perform divination on the Stone of origin? Where can you divine a treasure like the Stone of origin?”<br/><br/>Wang Xian asked prophets Hong and the rest.<br/><br/>“HMM? Dragon King, you wish to search for the Stone of origin? We can perform some divinations, but we can’t divine the exact location. We can only divine an area. We need to search within an area.”<br/><br/>“We have nothing to do now. We can go with you, Dragon King.”<br/><br/>Prophets Hong and the rest said.<br/><br/>“Alright, then I’ll Have to trouble you two prophets.”<br/><br/>Wang Xian nodded and said.<br/><br/>“It’s no trouble!”<br/><br/>The two of them shook their heads and looked at Wang Xian. “Dragon King, come with us. The land of origin is still very far from here. If we fly there, we’ll need a few hundred years.”<br/><br/>“Show us the way. I’ll lead you.”<br/><br/>Wang Xian nodded.<br/><br/>The area of the land of origin was not smaller than a universe.<br/><br/>In a universe, it would take thousands of years for an expert of the Great Dao level to fly from one side to the other.<br/><br/>Wang Xian’s speed was several times faster than theirs. It was much faster to bring them there.<br/><br/>Even so, they only arrived at the bottom of the land of origin after a hundred years.<br/><br/>“Huff Huff Huff!”<br/><br/>“Huff Huff Huff!”<br/><br/>Just as they arrived at the bottom, the terrifying sound of a storm could be heard.<br/><br/>The entire area in front of him was a terrifying storm. It was a storm with some gravel and emitted a dark glow.<br/><br/>“Dragon King, this place is called the Black Sandstorm.”<br/><br/>The prophet spoke to Wang Xian, “We can perform a divination here.”<br/><br/>“Okay!”<br/><br/>Wang Xian nodded his head and looked at the entire black sandstorm.<br/><br/>The Black Sandstorm was located below the huge meteorite in the place of origin.<br/><br/>The location below was the same as the location above. There were many holes.<br/><br/>In this black sandstorm, there were some black holes that formed naturally.<br/><br/>Once one entered these black holes, one would be transported to an unknown region.<br/><br/>No one dared to attempt the teleportation of the distance from the black hole.<br/><br/>One could not sense the existence of the gigantic beasts of chaos here.<br/><br/>If the experts in the land of origin wanted to hunt the giant beast of chaos, most of them would be below.<br/><br/>Of course, the Giant Beast of chaos would occasionally appear above the land of origin.<br/><br/>“Buzz Buzz!”<br/><br/>“Buzz Buzz!”<br/><br/>At the side, Prophet Hong and the prophet did a divination to search for the whereabouts of the Stone of origin.<br/><br/>“Dragon King, we have divined the existence of the stone of origin in a few locations.”<br/><br/>Soon, prophet Hong’s palm moved and a map appeared in front of him.<br/><br/>“This is a map under the land of origin. The map is not complete. According to our prediction, the stone of origin exists in this location, this location, and these few locations.”<br/><br/>“We can’t divine the exact location. In addition, the location of the Stone of origin may have the existence of giant beasts of chaos. We must be careful.”<br/><br/>Prophet Hong spoke one by one.<br/><br/>“Alright, I Won’t trouble you, Prophet Hong. I’ll go check it out myself.”<br/><br/>Wang Xian spoke to them.<br/><br/>The two prophets nodded.<br/><br/>It was easier for a chaos-level existence to act alone than to lead them.<br/><br/>Wang Xian took the map given to him by prophet Hong and looked at a few locations. Then, he moved and entered the black sandstorm ahead.<br/><br/>When he entered the black sandstorm, the power of the sandstorm surged toward his body.<br/><br/>Even for those who had just entered the Heaven’s origin blessed realm, they had to use all their strength to resist the sandstorm.<br/><br/>However, it was nothing to Wang Xian.<br/><br/>When he arrived at the location inside, Wang Xian raised his head and looked at the black holes above him.<br/><br/>Powerful chaotic beasts could appear at any time in these holes.<br/><br/>One had to be exceptionally careful when moving around here.<br/><br/>It would be dangerous if he was attacked by the beasts of chaos.<br/><br/>Wang Xian scanned his surroundings with his pair of dragon eyes.<br/><br/>The surroundings were pitch-black. Coupled with the influence of the black sand, his vision was greatly affected.<br/><br/>Wang Xian hesitated for a moment and felt the power of the black sand.<br/><br/>He mobilized the power of chaos in his body and simulated the power of the black sand.<br/><br/>Very soon, Wang Xian’s body was surrounded by the black sand. It was as if he had become the black sand here and had become one with this place.<br/><br/>“If I fuse perfectly with the primal chaos stone, I can transform my body into any material and can mobilize any energy.”<br/><br/>Wang Xian muttered to himself as he looked forward to the arrival of this day.<br/><br/>He flew forward quickly. The cave entrance above him was like a terrifying abyss above his head.<br/><br/>Wang Xian did not enter recklessly. After flying for a day, he arrived at a location that Prophet Hong and the rest had divined.<br/><br/>“According to the divination of prophet Hong and the rest, there are origin stones in this area. However, this area is huge. In particular, these origin stones are most likely located in the black hole above. There are at least a thousand black holes in this area.”<br/><br/>Wang Xian looked at the map and swept his gaze across this area.<br/><br/>He needed to check over a thousand holes.<br/><br/>It was completely unknown if there were any giant beasts of primordial chaos in these holes.<br/><br/>The giant beasts of primordial chaos in the land of origin lived in groups.<br/><br/>Under normal circumstances, even if they were experts of the Great Dao, they would not dare to venture deep into the holes.<br/><br/>It would be dangerous if he encountered a species of chaotic behemoths that lived in groups.<br/><br/>Wang Xian took out the divination lamp and performed a divination. However, he did not obtain any information.<br/><br/>The divination he performed with the divination lamp could not be compared to the divination of the three great prophets of the universe.<br/><br/>“Looks like I will have to search through the caves one by one!”<br/><br/>Wang Xian mumbled.\t\t\t\t\t\t</div>", "images": {}, "success": true}