{"id": 1431, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075496.html", "title": "Chapter 4434 - Chapter 4434: The Expansion Of The 4433 Dragon Palace Alliance", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4434 - Chapter 4434: The Expansion Of The 4433 Dragon Palace Alliance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4434: The expansion of the 4433 Dragon Palace Alliance<br/><br/>Time passed day by day.<br/><br/>It had been a million years since the carefree universe was invaded.<br/><br/>During these million years, the surroundings of the land of origin were calm and peaceful.<br/><br/>“Dragon King, according to our investigation in the evil sequence camp, they are preparing to target some neutral universes. The land of origin is one of their targets.”<br/><br/>“According to the investigation, there are about 170 to 180 universes in the evil sequence faction. The powerhouses of the evil sequence faction are all stronger than them. Every universe has at least a master level existence. Their overall strength is much stronger than the Justice Alliance.”<br/><br/>“According to our speculation, there will be victories around the land of origin, and many universes will be invaded.”<br/><br/>A million years later, the Dragon Palace conducted a survey on the evil sequence faction.<br/><br/>They obtained a piece of information.<br/><br/>When Wang Xian received this information, he was a little surprised.<br/><br/>There were 170 to 80 universes in the evil sequence faction. Each universe had a control-level power.<br/><br/>This was a very powerful power.<br/><br/>One had to know that each universe had a control-level existence. There were 170 to 80 universes. This was 170 to 80 control-level existences.<br/><br/>And a chaos-level existence was only equivalent to nine control-level existences.<br/><br/>Overall, the experts of the evil sequence faction were still very powerful.<br/><br/>However, there was one point. Chaos-level existences were more mobile and stronger individually.<br/><br/>The Evil Sequence Faction’s champions lacked unity, and they wouldn’t rashly provoke a chaos-level existence.<br/><br/>That was because once they provoked a chaos-level existence…<br/><br/>A champion of this level could fight if they wanted to.<br/><br/>If they wanted to escape, they couldn’t stop them.<br/><br/>They could advance and retreat at will.<br/><br/>A champion of this level, even a top-tier champion of the evil sequence faction, didn’t want to provoke them.<br/><br/>Especially when they had an enemy like the Justice Alliance.<br/><br/>“The experts of the evil sequence faction are indeed stronger.”<br/><br/>Wang Xian mumbled as he listened to the information reported by his subordinate.<br/><br/>They were indeed very strong. If the experts of the evil sequence faction were to join forces, even if Wang Xian were to meet them, he wouldn’t be able to withstand their attacks.<br/><br/>Fortunately, the powerhouses of the evil sequence camp were not united.<br/><br/>After the Dragon Palace obtained the information on the strength of the evil sequence camp, in less than 100,000 years, a universe in the land of origin was attacked by the powerhouses of the evil sequence camp.<br/><br/>“Dragon King, the Azure Universe was attacked by the powerhouses of the evil sequence camp. There are six powerhouses in the Heavenly Yuan blessed realm in the Azure Universe. However, there are more than a dozen powerhouses of the evil sequence camp who invaded the Azure Universe. The azure universe is no match for them.”<br/><br/>“Now, the living beings in the azure universe have been massacred by the powerhouses from the evil sequence faction. There are countless casualties.”<br/><br/>Due to the invasion of the evil sequence faction, the Dragon Palace paid special attention to the evil sequence faction.<br/><br/>100,000 years later, Prime Minister Gui received a message and reported it to Wang Xian.<br/><br/>Wang Xian received the message and nodded slightly.<br/><br/>Wang Xian wasn’t surprised by this situation.<br/><br/>According to the information obtained by the Dragon Palace, the powerhouses of the evil sequence alliance had set their target at the place of origin.<br/><br/>“As long as they don’t invade the Dragon Palace Alliance, the Dragon Palace Alliance will not participate in it!”<br/><br/>Wang Xian said.<br/><br/>The Evil Sequence Alliance was too powerful. Moreover, there were chaos-level existences in the evil sequence alliance.<br/><br/>Although the Dragon Palace alliance was not weak, there was still a considerable gap between them and the evil sequence alignment camp.<br/><br/>As long as the evil sequence alignment camp did not provoke the Dragon Palace Alliance, Wang Xian would not provoke the evil sequence alignment camp either.<br/><br/>Time continued to pass.<br/><br/>It had been 500 to 600 million years since the cataclysm outbreak.<br/><br/>Currently, it was still in the early stages of the cataclysm outbreak.<br/><br/>However, as time passed, more and more universes around the land of origin were being attacked by the powerhouses from the evil sequence faction!<br/><br/>More than a dozen universes were being attacked.<br/><br/>Countless lives were being slaughtered.<br/><br/>“Dragon King, there are already 14 universes that have been attacked by the evil sequence faction. Fortunately, the universes in the Dragon Palace Alliance have not been attacked!”<br/><br/>Prime Minister GUI reported the information about the evil sequence faction in real time.<br/><br/>Wang Xian nodded slightly when he received the information. “The experts from the evil sequence faction did not invade the universe of the Dragon Palace Alliance. They must have investigated and deliberately did not attack the members of the Dragon Palace Alliance.”<br/><br/>“It should be. After all, you are in charge of the Dragon Palace Alliance. Even the powerful evil sequence faction has to consider your strength!”<br/><br/>Prime Minister Gui said with a smile on his face.<br/><br/>“Yes. No matter what, we have to be prepared. Tell all the members of the Dragon Palace Alliance to come to the Dragon Palace Alliance for a discussion.”<br/><br/>Wang Xian pondered for a moment and said!<br/><br/>Wang Xian had to be fully prepared to fight against the evil sequence faction.<br/><br/>If the evil sequence faction really dared to invade the universe of the members of the Dragon Palace Alliance, then the entire Dragon Palace Alliance would have to move.<br/><br/>At the moment, the Dragon Palace Alliance wasn’t weak.<br/><br/>There were more than 90 Heavenly Yuan blessed realm experts in the entire Dragon Palace Alliance, and with the strength of the Dragon Palace, there were around 190 of them.<br/><br/>190 heavenly Yuan blessed realm experts were much weaker than the evil sequence faction.<br/><br/>However, they had to consider the consequences of becoming enemies with the Dragon Palace Alliance.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded. “I’ll inform all the members of the Dragon Palace Alliance now.”<br/><br/>Wang Xian nodded.<br/><br/>Very soon, every member of the Dragon Palace Alliance received Prime Minister Gui’s message.<br/><br/>When they received the message, they immediately rushed towards the Dragon Palace Alliance.<br/><br/>They had some understanding of the recent situation of the universe around the land of origin.<br/><br/>After all, more than a dozen universes had been invaded, so it was impossible for them not to have received this information.<br/><br/>Moreover, the universes that had been invaded weren’t very weak!<br/><br/>After a few decades, all the members of the Dragon Palace Alliance had arrived at the base of the Dragon Palace Alliance!<br/><br/>“Recently, the area around the land of origin hasn’t been peaceful. Many powerful universes have been invaded, and the powerful warriors of the evil sequence camp haven’t been able to resist at all. Countless creatures have been killed, and it’s extremely miserable!”<br/><br/>“Yes, I know that. Many universes that are stronger than us have been attacked. Almost all the creatures of more than a dozen universes have been killed. It’s too miserable!”<br/><br/>“Those guys from the evil sequence camp are too cruel. They feed on ordinary creatures and strengthen themselves by eating them. It’s too detestable!”\t\t\t\t\t\t</div>", "images": {}, "success": true}