{"id": 1430, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075491.html", "title": "Chapter 4433 - Chapter 4433: 4432", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4433 - Chapter 4433: 4432</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4433: 4432<br/><br/>The powerhouses of the evil sequence faction had their own plans.<br/><br/>Now, their plan was to invade the universe in the land of origin.<br/><br/>To increase their strength with the food of the universe in the land of origin.<br/><br/>But now, a Dragon Palace Alliance and a chaos-level existence suddenly appeared in the land of origin. This had a huge impact on their plans.<br/><br/>Provoking a chaos-level existence was definitely not a wise choice.<br/><br/>Even if their evil sequence faction was powerful enough.<br/><br/>In the group chat of the evil sequence faction, a large number of powerhouses were discussing.<br/><br/>However, a few months later, in the group chat, an important powerhouse of the Evil Sequence Alliance issued an order.<br/><br/>“Search for blood food in the land of origin, avoid the power of the Dragon Palace Alliance, and do not provoke the leader of the Dragon Palace Alliance, the Dragon Palace Dragon King. Do not provoke the powerful universe power of the nine-origin universe.”<br/><br/>When this news was released, it shocked many experts of the evil sequence alliance.<br/><br/>“So, this Dragon Palace Alliance Dragon King really has the power of Chaos? Has It been completely verified?”<br/><br/>“An existence of the primal chaos level. It’s too difficult to advance in this realm. I really don’t know what kind of powerful serendipity the Dragon King of the Dragon Palace obtained to be so powerful.”<br/><br/>“The members of the Dragon Palace Alliance are all those weak universes. Doesn’t this mean that if we want to invade next, we have to face those powerful universes?”<br/><br/>“There are also some weak universes that have not joined the Dragon Palace Alliance. This requires us to search for them ourselves. In addition, the divination universe in the land of origin seems to be very powerful. There are three existences at the level of Great Dao and they also possess divination powers. They should not be provoked.”<br/><br/>In the group chat, some powerhouses from the evil sequence camp were discussing and sharing information one by one.<br/><br/>Wang Xian didn’t know about the information from the evil sequence camp.<br/><br/>With the appearance of the evil sequence camp, the carefree universe was invaded.<br/><br/>In less than a month, the news of the Dragon King killing all the intruders had caused quite a stir in the Dragon Palace Alliance and the land of origin.<br/><br/>Especially in the Dragon Palace Alliance, all the members were very excited when they received the news.<br/><br/>The situation in the carefree universe had shown all the members the great benefits of joining the Dragon Palace Alliance.<br/><br/>All the members of the Dragon Palace Alliance knew that without the protection of the Dragon Palace and the help of the Dragon Palace, the carefree universe would be completely doomed.<br/><br/>With the strength of the carefree universe, it was impossible for it to resist this disaster.<br/><br/>“It seems that joining the Dragon Palace Alliance is a wise choice.”<br/><br/>“It’s good to have the dragon palace as our backer. At least in the future, we won’t have to worry about the safety of the universe. We can cultivate properly.”<br/><br/>“That’s right, joining the dragon palace is indeed much easier now. In the past, we were always on Edge during the calamity, but now it’s much better. Hehe.”<br/><br/>The members of the Dragon Palace Alliance couldn’t help but laugh as they chatted.<br/><br/>“Was it the invasion of the evil sequence camp? Joining the Dragon Palace Alliance is indeed a great benefit to the weak universe.”<br/><br/>At the land of origin, some experts muttered when they heard the news.<br/><br/>“This Dragon King is a man of his word. It’s a blessing for the weak universe.”<br/><br/>In the land of origin, in the bamboo forest occupied by the divination universe, the two divination prophets were playing chess and talking with smiles on their faces.<br/><br/>“Are the invaders from the evil sequence camp? is the war between them and the Justice Alliance over?”<br/><br/>Prophet Hong said with a smile.<br/><br/>“It’s over. Those guys from the evil sequence camp are like vermin. Wherever they go, there will be blood. Sigh, it would be great if we could destroy them.”<br/><br/>The Prophet on the other side sighed.<br/><br/>“It’s already considered good if they don’t invade other universes. Destroying them? That’s impossible.”<br/><br/>Prophet Hong shook his head.<br/><br/>Weng<br/><br/>At this moment, the two prophets suddenly felt something.<br/><br/>They were slightly stunned and looked at each other.<br/><br/>At the same time, they closed their eyes slightly and began to divine.<br/><br/>“We’re in big trouble. There’s going to be a bloodbath in the land of origin.”<br/><br/>After a long time, they opened their eyes, and their expressions were solemn.<br/><br/>They had divined that the many universes in the land of origin would face a disaster.<br/><br/>“It’s caused by the evil sequence alignment.”<br/><br/>Prophet Hong was slightly silent.<br/><br/>“It’s already good enough that we can protect ourselves.”<br/><br/>The prophet shook his head helplessly.<br/><br/>Such a huge entity like the evil sequence faction was not something that they could stop.<br/><br/>It was not something that they could interfere with.<br/><br/>They could only watch.<br/><br/>Time passed day by day.<br/><br/>Wang Xian did not bring him to the Dragon Palace during this period of time. Instead, he came to the land of origin, the Dragon Palace Alliance.<br/><br/>“Dragon King, I have obtained some information from the Justice Alliance.”<br/><br/>Not long after, Prime Minister Gui rushed over and reported to Wang Xian.<br/><br/>“HMM? What information? Tell me.”<br/><br/>Wang Xian nodded.<br/><br/>“Dragon King, according to the information obtained by the disciples of the Dragon Palace, the war between the Justice Alliance and the evil sequence faction has ended. This time, the Justice Alliance has suffered a lot of damage. Dozens of universes have been attacked by the evil sequence experts. Countless disciples have been killed or injured.”<br/><br/>Prime Minister GUI reported, “In addition, the Justice Alliance is currently taking a truce and rest. I estimate that they will recuperate for a period of time.”<br/><br/>“In addition, the Justice Alliance has always been on the passive side. The evil sequence faction has not invaded them, and they have always been on the defensive.”<br/><br/>“According to my understanding, the evil sequence faction is much stronger than the Justice Alliance, but the Justice Alliance is more United.”<br/><br/>Prime Minister GUI reported one by one, he also shared his analysis. “Over at the evil sequence camp, they are waging war. It feels like they are using war to nourish themselves. As long as the outcome of the war is not too tragic, they will become stronger and stronger.”<br/><br/>Wang Xian nodded slightly when he heard Prime Minister Gui’s words.<br/><br/>This was because most of the universe in the evil sequence camp used blood and souls to increase their strength. This also resulted in them becoming stronger and stronger as they fought.<br/><br/>The stronger they were, the more they fought.<br/><br/>It was somewhat similar to the Dragon Palace.<br/><br/>But the Dragon Palace could directly convert resources into strength in the past.<br/><br/>But now, it couldn’t.<br/><br/>However, the Dragon Palace also had a supreme treasure like the primal chaos, which could also quickly convert resources into strength.<br/><br/>“The Justice Alliance is resting and reorganizing. The evil sequence faction might start a war here in the land of origin because they can fight to nourish the war, but the Justice Alliance can’t do that.”<br/><br/>“I hope the evil sequence camp doesn’t provoke us. Otherwise, we will play with them. We can support the war with war. The Dragon Palace can do that too.”<br/><br/>Wang Xian mumbled.\t\t\t\t\t\t</div>", "images": {}, "success": true}