{"id": 1447, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075576.html", "title": "Chapter 4450 - Chapter 4450: The Start Of The 4449 War", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4450 - Chapter 4450: The Start Of The 4449 War</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4450: The start of the 4449 war<br/><br/>The news of the birth of the ultimate treasure of Tianyuan in the star universe caused a huge sensation.<br/><br/>Wang Xian even received a message from Prime Minister Gui.<br/><br/>“Ultimate Treasure of Tianyuan?”<br/><br/>Wang Xian sat in the Dragon King’s Hall and listened to Prime Minister Gui’s report. He raised his eyebrows.<br/><br/>Ultimate Treasure of Tianyuan.<br/><br/>This could be said to be an absolute treasure.<br/><br/>The Dragon Palace and Wang Xian had a total of four ultimate treasures of Tianyuan.<br/><br/>He had two of them.<br/><br/>Four Ultimate Treasures of Tianyuan were equivalent to adding 11 or 12 powerhouses who had just entered Tianyuan.<br/><br/>It was an absolute treasure.<br/><br/>Even though Wang Xian was faced with such an ultimate treasure, he was still tempted and would make a move.<br/><br/>“Is this news reliable?”<br/><br/>Wang Xian asked.<br/><br/>“Dragon King, the authenticity of the news is not confirmed yet. Should we ask the three great prophets? With their abilities, they can totally divine it!”<br/><br/>Prime Minister Gui asked.<br/><br/>“There’s no need. Let me do the divination!”<br/><br/>Wang Xian shook his head. He took out the lamp of divination and infused it with the power of divination.<br/><br/>The success rate of a directed divination would be much higher.<br/><br/>Soon, the results of the divination were out. He raised his eyebrows and continued to perform the divination.<br/><br/>“HMM?”<br/><br/>When he went deep into the divination, the results were revealed.<br/><br/>“Without the birth of the ultimate treasure of Heaven’s origin, this is a conspiracy of the evil sequence camp. The evil sequence camp is going to make a move against the Guardian Alliance. Tell the members of the Dragon Palace Alliance not to get involved.”<br/><br/>Wang Xian looked at Prime Minister Gui and said!<br/><br/>“HMM?”<br/><br/>Prime Minister Gui was slightly surprised and nodded.<br/><br/>Very soon, Wang Xian’s order was sent to all the members of the Dragon Palace Alliance.<br/><br/>Of course, Prime Minister Gui did not reveal all the information. He merely reminded all the members not to get involved in this mess.<br/><br/>The members of the Dragon Palace Alliance were naturally not fools.<br/><br/>After they heard the news, they immediately stopped the agitation in their hearts.<br/><br/>…<br/><br/>“A Heavenly Fate Supreme Treasure? Our Star Universe did not find any signs of the birth of a heavenly fate supreme treasure. How could there suddenly be news of the birth of a heavenly fate Supreme Treasure in Our Star Universe?”<br/><br/>At the same time, in the Palace of the Guardian Alliance in the land of origin.<br/><br/>A group of Great Beings from the Guardian Alliance gathered together, and a few great beings from the star universe stood there and said, dumbfounded!<br/><br/>In front of them, four great dao beings from the Guardian Alliance were also sitting there, frowning slightly.<br/><br/>“Recently, we have been paying attention to the situation in the evil sequence camp. According to the information we have received, all the Great Beings from the evil sequence camp have left the universe they occupied. We don’t know why or where they are going. We also don’t know if it has anything to do with the Star Universe.”<br/><br/>One of the Great Dao level masters said with a frown and a worried expression on his face.<br/><br/>“Is the star universe really going to give birth to a Heavenly Yuan Destiny Supreme Treasure?”? “You have to know that some heavenly yuan destiny supreme treasures are very secretive. For example, in the six paths universe, the birth of the Dragon King’s foster son, the Heavenly Yuan Destiny Supreme Treasure in his body, is very secretive.”<br/><br/>A powerhouse beside him could not help but say.<br/><br/>“I’m not sure.”<br/><br/>A great dao-level powerhouse shook his head. “The information about the Heavenly Yuan Destiny Supreme Treasure is not important for the time being. The movement of the evil sequence camp is very important. We must pay attention to whether they are going back or there are other actions.”<br/><br/>“That’s right. We must pay attention at all times.”<br/><br/>The heavenly fate powerhouses nodded.<br/><br/>Right now, every move of the evil sequence camp was affecting their hearts.<br/><br/>This matter was more important than the heavenly fate treasure.<br/><br/>Time passed year by year.<br/><br/>However, more than ten years later, The Guardian Alliance received bad news.<br/><br/>“Bad news. According to our investigations, a large number of powerhouses and legions from the evil sequence camp are flying toward the star universe. They’re suspected to be heading toward the Star Universe.”<br/><br/>An old man from the Guardian Alliance said to all the champions with an unsightly expression.<br/><br/>In the past few years, they had been paying attention to the movements of the evil sequence faction.<br/><br/>Because of this, most of the champions of the Guardian alliance had gathered in the land of origin, in the base of the Guardian Alliance.<br/><br/>Now that they had received this information, they had a bad premonition.<br/><br/>“HM? The powerhouses who underestimated the evil sequence camp are heading to the Star Universe? Why are they there?”<br/><br/>The old man’s words startled everyone, and they asked.<br/><br/>“I don’t know, but our alliance leader he has decided to directly send powerhouses to interrogate them and make everything clear.”<br/><br/>The old man shook his head and said.<br/><br/>“Their target is our star universe? This evil sequence camp must be targeting our star universe, Alliance leader He!”<br/><br/>Below, an old man’s expression was abnormally ugly as he looked at a burly middle-aged man in the center.<br/><br/>The burly middle-aged man had his eyes closed.<br/><br/>The Guardian alliance had four Great Dao level existences, and he was the strongest one.<br/><br/>He was the alliance master, and there were three Vice Alliance Masters in the Guardian Alliance.<br/><br/>“I’ve sent people to inquire, and the results are in.”<br/><br/>The Burly Alliance master he opened his eyes and received a piece of information. There was a hint of solemnity in his eyes. “I’ve sent people to inquire directly, and the great being from the evil sequence camp replied that they’re looking for a heavenly fate Supreme Treasure.”<br/><br/>“What?”<br/><br/>Below, when the six great beings from the star universe heard this, their expressions changed again.<br/><br/>“Going to our star universe to look for the heavenly fate true treasure? Isn’t this too much of a coincidence? How could there be such a coincidence? Our Star Universe had just announced the birth of the heavenly fate true treasure, and all the Great Beings from the evil sequence camp rushed over? “Isn’t this too much of a coincidence?”<br/><br/>“One more thing. There are rumors of the birth of a heavenly fate treasure in our star universe. Where did this rumor come from? I think this is definitely a plot by the evil sequence camp. They want to start a war with our Guardian Alliance!”<br/><br/>“That’s right. We should get ready immediately and take action against them.”<br/><br/>The Great Beings from the star universe said, their faces filled with anger.<br/><br/>Their words made all the great beings around frown.<br/><br/>“How many great beings and legions from the evil sequence camp are going to the star universe this time?”<br/><br/>A great being couldn’t help but ask.<br/><br/>The situation in the star universe was indeed very strange, and it was too coincidental.<br/><br/>This made them have no choice but to suspect the evil sequence faction’s goal.<br/><br/>All the powerhouses knew it clearly in their hearts.<br/><br/>However, when they really wanted to start a war with the evil sequence faction, they had no choice but to hesitate.<br/><br/>“All the powerhouses from the evil sequence faction have rushed over. There are a total of more than 200 Tianyuan blessed realm powerhouses. As for the evil sequence army, there are more than 50 of them. Each army has at least 100,000 or more ruler realm disciples.”<br/><br/>A Deputy League Master of the Guardian League spoke up from the side.\t\t\t\t\t\t</div>", "images": {}, "success": true}