{"id": 1443, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075556.html", "title": "Chapter 4446 - Chapter 4446: 444513 Origin Stones", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4446 - Chapter 4446: 444513 Origin Stones</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4446: 444513 origin stones<br/><br/>Buzz! Buzz! Buzz<br/><br/>Wang Xian flew carefully in the direction of the chaotic behemoths.<br/><br/>He tried his best to conceal his figure. Coupled with the concealment of his aura with his divination ability, it was only possible for someone at the level of chaos to sense him in advance.<br/><br/>Otherwise, it would be extremely difficult to discover Wang Xian before he discovered him.<br/><br/>After flying for a few hours, Wang Xian sensed that the group of Chaos Beasts was not far away.<br/><br/>It’s the same as the information I divined<br/><br/>Wang Xian thought to himself. He continued to move forward carefully and tried his best to conceal his figure.<br/><br/>After more than ten minutes, Wang Xian saw the nest of the Chaos Beasts.<br/><br/>This was a huge space.<br/><br/>There were dozens of caves in this space. In each cave, there was one or two chaos beasts.<br/><br/>In the middle, there were a few chaos beasts flying there.<br/><br/>Wang Xian hid behind a rock. His dragon eyes could see through the rock and observed it carefully.<br/><br/>He took out the divination lamp and continued to determine the exact location of the Stone of origin.<br/><br/>“It’s in the largest cave in the center. This cave should be the location of the great dao-level Chaos Behemoth. This fellow is still inside!”<br/><br/>Wang Xian’s eyes sparkled as he looked at it.<br/><br/>He used his divination ability to pinpoint the exact location of the three stones of origin.<br/><br/>“All the chaos behemoths are here. If I were to charge through, I would have to charge through within 0.1 seconds and leave!”<br/><br/>“I have to escape from here before all the beasts of primordial chaos can react!”<br/><br/>Wang Xian calculated in his heart.<br/><br/>Since he was here, Wang Xian naturally had to take a risk.<br/><br/>He had to make a move on the three origin stones.<br/><br/>Moreover, with his current strength and with his current ability to control an lie, it wasn’t considered a risk.<br/><br/>As long as he was in danger, he could leave this place in an instant!<br/><br/>There was enough time for him to escape.<br/><br/>“F * ck!”<br/><br/>Wang Xian thought to himself. His body moved and he dashed forward instantly.<br/><br/>At this moment, Wang Xian pushed his speed to the limit.<br/><br/>The power of chaos was converted into the power of space.<br/><br/>The moment he flew despite the resistance of space, he teleported again.<br/><br/>In an instant, he arrived at the entrance of the largest chaos beast.<br/><br/>His pair of dragon eyes stared into the cave as he stared at the location of the Stone of origin.<br/><br/>At the entrance of the cave, the Great Dao level chaos behemoth had already sensed Wang Xian’s existence.<br/><br/>It instantly stared at Wang Xian.<br/><br/>Buzz<br/><br/>The power of chaos in Wang Xian’s body circulated and gathered in his golden eyes. A Ray of light shot straight at it.<br/><br/>The chaos Behemoth felt the terrifying attack and quickly stretched its wings.<br/><br/>Its body became illusory.<br/><br/>“Boom!”<br/><br/>The golden rays shot into it and caused a terrifying explosion.<br/><br/>The illusory giant beast of chaos dodged the fatal attack.<br/><br/>“Roar!”<br/><br/>It let out a sharp and angry roar.<br/><br/>The roar spread throughout the entire space.<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>In an instant, all the giant beasts of chaos in the surroundings immediately let out roars and flew over in unison.<br/><br/>An overwhelming and terrifying aura surged over in this direction.<br/><br/>When Wang Xian saw this chaos beast dodging his attack, his gaze froze slightly.<br/><br/>His gaze quickly turned towards the stone of origin.<br/><br/>His body moved, and in an instant, he charged over with a terrifying aura.<br/><br/>The powerful aura made the Great Dao level Chaos Beast not dare to stop him.<br/><br/>It looked at Wang Xian in shock and anger as he grabbed at the Stone of origin.<br/><br/>However, there was nothing it could do.<br/><br/>Wang Xian rushed over and extended his hand to wrap around the energy. He grabbed the stone of origin in his hand.<br/><br/>“Buzz Buzz Buzz!”<br/><br/>“Buzz Buzz Buzz!”<br/><br/>The Great Dao Level Chaos Beast was extremely furious. It emitted special sound waves from its mouth.<br/><br/>At the back, all the chaos beasts also emitted sound waves at the same time.<br/><br/>The terrifying sound waves caused the entire space to distort.<br/><br/>A wave of death energy surged towards Wang Xian.<br/><br/>Buzz! Buzz<br/><br/>Wang Xian sensed this attack and his expression changed slightly.<br/><br/>Without any hesitation, he teleported away instantly.<br/><br/>“Roar! Roar! Roar!”<br/><br/>“Roar! Roar! Roar!”<br/><br/>Leaving behind a group of extremely furious beasts of primordial chaos, they let out unresigned roars.<br/><br/>“Hehe, I succeeded.”<br/><br/>Wang Xian teleported to the location of a demonic spirit altar. When he saw that he had obtained three origin stones, his eyes were filled with excitement.<br/><br/>In a short period of time, he had obtained a total of six origin stones.<br/><br/>This was already sufficient to increase his strength significantly.<br/><br/>“Continue!”<br/><br/>Wang Xian did not stop and continued to fly out.<br/><br/>As time passed, Wang Xian went deeper and deeper into the underground of the land of origin.<br/><br/>“There’s a giant beast of chaos here. It’s an existence at the control level.”<br/><br/>A few decades later, Wang Xian found a giant beast of chaos inside a cave entrance.<br/><br/>He flew straight over.<br/><br/>After seeing this giant beast of chaos, he flew straight over and killed it easily.<br/><br/>The chaos Behemoth was also a valuable resource to Wang Xian.<br/><br/>A Chaos Behemoth at the control level. If he was lucky enough, he would be able to produce two powerhouses at the Heaven’s origin realm in the Dragon Palace.<br/><br/>The Stone of origin and the chaos behemoth were among the targets that Wang Xian was hunting for.<br/><br/>With the ability of divination to block the death mark, Wang Xian did not have to worry about being besieged when he hunted the chaos behemoth.<br/><br/>In the following period of time, Wang Xian hunted the chaos behemoths while searching for the stones of origin.<br/><br/>He kept the stones of origin one by one.<br/><br/>Time passed day by day.<br/><br/>“The deeper I go, the harder it is to find. I have encountered five to six groups of Chaos Behemoths.”<br/><br/>After 10,000 years, the number of stones of origin in Wang Xian’s hands had reached 13.<br/><br/>Along the way, he encountered a few groups of chaos behemoths.<br/><br/>Among them, three of the groups of chaos behemoths were very powerful.<br/><br/>He even saw a group of five Great Dao level chaos behemoths.<br/><br/>In the depths, he also saw black holes.<br/><br/>As for where the black holes led to, Wang Xian had no idea.<br/><br/>“Let’s continue in.”<br/><br/>Wang Xian continued to fly in.<br/><br/>It had only been ten thousand years since he arrived here.<br/><br/>It was still a short period of time.<br/><br/>Wang Xian hoped to obtain a few dozen origin stones so that he could completely fuse with the primal Chaos Stone.<br/><br/>Buzz Buzz<br/><br/>When he arrived at a spot to continue his divination.<br/><br/>When he saw the information on the divination lamp, he was slightly stunned. A look of astonishment appeared on his face.<br/><br/>The information on the divination lamp showed that there were more than a dozen origin stones located at a spot in front of him.<br/><br/>“Twelve. There are actually twelve origin stones located at the same spot? This? ?”<br/><br/>Wang Xian’s eyes were burning with excitement.<br/><br/>He proceeded with his divination again.<br/><br/>During the ten thousand years of searching, he had encountered a situation where several origin stones were located at the same spot.<br/><br/>The most common one was that the Five Great Dao Chaos Behemoths had six pieces of origin stones.<br/><br/>And this time, there were actually twelve! ! !\t\t\t\t\t\t</div>", "images": {}, "success": true}