{"id": 1442, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075551.html", "title": "Chapter 4445 - Chapter 4445: 4444 Was Extremely Lucky", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4445 - Chapter 4445: 4444 Was Extremely Lucky</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4445: 4444 was extremely lucky<br/><br/>“I found a stone of origin when I just arrived here. If I can get four or five of them, my strength would be comparable to two existences of the chaos level.”<br/><br/>Wang Xian’s eyes shone brightly.<br/><br/>He quickly flew towards the location of the Stone of origin.<br/><br/>After flying for half a month, he looked ahead.<br/><br/>There was no more road ahead. He needed to clear the rock in front of him by himself.<br/><br/>In other words, this stone of origin was located within the rock.<br/><br/>Under such circumstances, without knowing where the stone of origin was, finding it would be like looking for a needle in a haystack.<br/><br/>“My Luck is pretty good.”<br/><br/>Wang Xian revealed a smile. After digging for half a year, he finally found a stone of origin.<br/><br/>“It’s not big, but it’s not bad!”<br/><br/>Wang Xian put it away.<br/><br/>To be able to obtain such a harvest in a month’s time, he must have been extremely lucky.<br/><br/>It was completely a random treasure hunt.<br/><br/>After obtaining the first stone of origin, Wang Xian continued his divination.<br/><br/>However, this time, he did not manage to find it.<br/><br/>This also proved that there was no stone of origin in this area.<br/><br/>Wang Xian continued to go deeper into the area. He was prepared to take a look at the location where he was hunted down the last time.<br/><br/>The distance of ten billion kilometers was not very far.<br/><br/>However, the underground of the land of origin was complicated. It would take a lot of time to reach the straight line position.<br/><br/>When he came to another location, Wang Xian continued to perform divination.<br/><br/>The powerful force of chaos was converted into divination power, which made it very easy for him to perform divination.<br/><br/>More than a hundred years later, Wang Xian discovered the second stone of origin.<br/><br/>This made Wang Xian look excited as he continued to search for it with great motivation.<br/><br/>…<br/><br/>While Wang Xian was searching for the Stone of origin…<br/><br/>It was located in the land of origin. Due to the establishment of the Guardian League, it had caused quite a number of incidents in the dark.<br/><br/>“Now, another force has been established here. It’s called The Guardian League. The strength of this guardian league isn’t weak either!”<br/><br/>“That Dragon Palace Alliance has led us into a bad situation. However, that Dragon Palace Alliance is even stronger, and the Guardian Alliance is also a problem. Now that most of the universes have joined this Guardian Alliance, are we going to give up just like that?”<br/><br/>“Let’s not talk about anything else. We’ve made a huge profit here this time, Haha. We’ve gained a lot. I heard that there are only four Great Dao existences in that Guardian Alliance. Should we do something about it?”<br/><br/>“I think we can. Since they’ve formed an alliance, then we’ll form an alliance as well. Let’s distribute the benefits first. If we can get rid of this guardian alliance, my strength will probably reach the Great Dao level.”<br/><br/>“We’ll see when the time comes. Let’s take care of these universes first.”<br/><br/>Within the various universes around the land of origin.<br/><br/>Figures filled with blood and terror floated in the void.<br/><br/>They looked down at the surrounding starry skies, their faces filled with smiles.<br/><br/>There were also experts, surrounded by a sea of blood. Countless amounts of blood surged into their bodies.<br/><br/>There were also countless vengeful souls surging into the treasures in their hands.<br/><br/>They were all experts from the evil sequence camp who had participated in the invasion of the land of origin.<br/><br/>This time, 60% of the evil sequence camp had participated in the invasion of the land of origin.<br/><br/>And this time, they had gained a lot.<br/><br/>Countless lives had been slaughtered by them.<br/><br/>Countless vengeful souls had been absorbed by them.<br/><br/>This allowed many great beings to achieve breakthroughs.<br/><br/>Every time a calamity arrived, it was a feast for them.<br/><br/>And now, it was only the beginning.<br/><br/>In the following period of time, the land of origin, except for those universes that had been invaded, stabilized.<br/><br/>This caused all the universe masters to heave a sigh of relief.<br/><br/>It also caused the universes of the Guardian Alliance to heave a sigh of relief.<br/><br/>“It seems like the evil sequence faction is also afraid of our strength.”<br/><br/>“After all, we have four great dao existences and dozens of control-level existences. With all of them added together, we have over a hundred heaven origin creation realm experts. If that bunch of damnable fellows really provoke us, we’ll let them know how powerful we are!”<br/><br/>“We’ll form an alliance that’s enough to resist the invasion of the evil sequence faction.”<br/><br/>In the land of origin, The Guardian Alliance had also established a base camp here.<br/><br/>At this moment, in the Guardian Alliance’s Base Camp, a group of powerhouses had gathered together.<br/><br/>The Guardian Alliance’s member universes were all quite powerful.<br/><br/>They could be said to be the most powerful existences in the surrounding universe other than the divination universe.<br/><br/>They didn’t want to join the Dragon Palace Alliance.<br/><br/>This was because in their opinion, it wasn’t worth it to hand over a large amount of valuable resources to the Dragon Palace in order to join the Dragon Palace Alliance.<br/><br/>They could also form an alliance.<br/><br/>…<br/><br/>Wang Xian didn’t know about the situation in the land of origin.<br/><br/>At this moment, he used his divination ability to divine the location of the third stone of origin.<br/><br/>“I’m still in the middle of the rocks here. TSK TSK, the speed of my harvest is too great. I’ve made a huge profit!”<br/><br/>Wang Xian’s face was filled with excitement as he continued to dig ahead.<br/><br/>He transformed into the mining dragon and continued to dig towards his target.<br/><br/>More than a month later, the third origin stone was in his pocket.<br/><br/>After lamenting the power of his divination ability once again, Wang Xian continued to fly forward.<br/><br/>Unknowingly, he arrived at the spot where he was attacked by the chaotic beasts previously.<br/><br/>He continued his divination.<br/><br/>“Eh? Three Stones?”<br/><br/>This time, he divined the location of the three origin stones. This caused him to be stunned.<br/><br/>Three origin stones!<br/><br/>“Let’s Go!”<br/><br/>He was excited. At this speed, it wouldn’t be long before he could obtain more than ten stones, or even more.<br/><br/>At that time, wouldn’t his strength increase by leaps and bounds?<br/><br/>Was there a realm above the realm of Chaos?<br/><br/>Were there any experts above the realm of Chaos?<br/><br/>However, Wang Xian was confident that he could reach this realm.<br/><br/>He flew rapidly towards the location of the three origin stones. Half a year later, Wang Xian arrived at a cave entrance.<br/><br/>However, when he sensed the special aura coming from ahead, he frowned slightly.<br/><br/>This aura was somewhat familiar.<br/><br/>It was the aura of the group of chaos behemoths that were like bats the last time.<br/><br/>“There are three pieces of origin stones in that group of Chaos Behemoths? Are these treasures that belong to their race?”<br/><br/>Wang Xian frowned slightly and performed a divination<br/><br/>As expected, his guess was right.<br/><br/>There were more than 40 chaos behemoths guarding around the three pieces of origin stones.<br/><br/>These 40 Chaos Beasts were much stronger than Wang Xian in terms of overall strength.<br/><br/>Currently, Wang Xian’s strength was equivalent to 46 beginner-level existences.<br/><br/>Although he was still very strong, this tribe had a great dao level and many control levels.<br/><br/>“However, although I’m not their match, if I wanted to escape, the other party wouldn’t be able to stop me at all. Last time, they chased after me. This time, I’ll go and take a look.”<br/><br/>After possessing an lie’s ability, Wang Xian decided to take a look at this tribe’s lair.\t\t\t\t\t\t</div>", "images": {}, "success": true}