{"id": 1449, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075586.html", "title": "Chapter 4452 - Chapter 4452: 4451 Erupted", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4452 - Chapter 4452: 4451 Erupted</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4452: 4451 erupted<br/><br/>“Are they all here?”<br/><br/>The Last Heavenly Fate Realm Expert led an army and arrived.<br/><br/>Spirit kneader and the others scanned their surroundings and asked.<br/><br/>“Lord Spirit kneader, all of them have arrived!”<br/><br/>An expert from the evil sequence faction replied.<br/><br/>“Mm.”<br/><br/>Spirit kneader nodded. “According to the information we gathered, the experts of the Guardian alliance have all gathered at the asterisk universe. It seems like we’ll have to clash with them.”<br/><br/>“The fact that the Guardian Alliance didn’t attack US immediately shows that they don’t dare to make an enemy out of us.”<br/><br/>A Great Dao expert beside him said faintly.<br/><br/>“However, we have to be prepared. Let’s go. Since those guys have chosen to make an enemy out of us, let’s play with them. Coincidentally, we lack the corpses of some heaven origin creation realm experts. hehehe.”<br/><br/>Another great dao-level elder had an excited and gloomy expression.<br/><br/>After they finished speaking, they flew straight into the star system universe.<br/><br/>“They’re here.”<br/><br/>At the same time, in the star system universe, when all the powerhouses of the evil sequence faction arrived.<br/><br/>All the powerhouses of the Guardian Alliance had already received this information.<br/><br/>During the time they had arrived the day before yesterday, they had set up a large number of arrays and all sorts of scouting treasures.<br/><br/>Once the evil sequence faction’s champions arrived, they would immediately be able to sense them.<br/><br/>Looking at the Mighty Army of the evil sequence faction, all the champions had solemn expressions on their faces.<br/><br/>Some of the champions of the Guardian Alliance even took a deep breath.<br/><br/>“There are scouting items around.”<br/><br/>And when all the champions of the evil sequence faction entered the starship universe, duty’s gaze swept the surroundings.<br/><br/>The antennae on top of their heads shone with a luster as they attacked the scouting items one by one.<br/><br/>Spirit kneader and the other Great Dao experts nodded indifferently and didn’t say anything.<br/><br/>However, the scouting items were destroyed, causing the experts from the Guardian Alliance to have ugly expressions on their faces.<br/><br/>“Directly push them over. Don’t be too scattered. The resources obtained will be distributed according to the ratio we agreed on.”<br/><br/>The illusory realm glanced at all the surrounding experts and said.<br/><br/>“It’s lord illusory realm.”<br/><br/>The experts from the evil sequence faction immediately replied.<br/><br/>“If the Guardian Alliance resists, then we’ll have to waste a lot of time if we want to occupy one universe after another.”<br/><br/>The surrounding experts couldn’t help but say.<br/><br/>“There’s no other way. We Can’t split up. Otherwise, with the strength of the Guardian Alliance, if they attack US separately, it’ll be hard for us to resist.”<br/><br/>Some champions responded.<br/><br/>This question was naturally known to all the champions of the evil sequence camp.<br/><br/>They quickly flew towards the center of the Star Universe, destroying all the scouting items along the way.<br/><br/>All the champions of the Guardian League paid close attention to the champions of the evil sequence faction.<br/><br/>However, when they saw the champions and Legion of the evil sequence faction arrive at a life planet, all their luck vanished.<br/><br/>A life planet was instantly killed by countless demons under their scouting.<br/><br/>In less than ten seconds, not a single life was left in the entire universe.<br/><br/>The Great Beings of the Guardian Alliance were livid when they saw this scene.<br/><br/>“I knew they weren’t here to search for treasures. They’re here to slaughter all the life forms in our star universe. Damn them!”<br/><br/>The Great Beings of the star universe roared with bloodshot eyes and ferocious expressions.<br/><br/>“Alliance Master He, Three Alliance Masters, Shall We start the war?”<br/><br/>All the Great Beings of the remaining star universe looked coldly at Alliance master he and the others in the center.<br/><br/>Alliance leader he and the other three deputy alliance leaders also looked cold, and they nodded heavily.<br/><br/>“Today, they will invade the star universe, and tomorrow, they will invade our other universes. We must completely kill the evil sequence alignment within the Star Universe.”<br/><br/>Alliance leader he looked at all the Great Beings and said.<br/><br/>“Good. Let’s make a move immediately. Let them know how tragic the price they have to pay to destroy us is.”<br/><br/>“Kill them. They are indeed powerful, but I don’t believe that they will always gather together. Even if they gather together, we can still attack them.”<br/><br/>“That’s right. Let them know the strength and determination of our Guardian Alliance. We absolutely can not let the evil sequence faction succeed.”<br/><br/>All the powerhouses growled softly.<br/><br/>They all understood that the asterisk universe was just the beginning. Once the asterisk universe was destroyed, the next one would definitely be one of their Guardian Alliance’s universes.<br/><br/>As for which universe it was, no one could say for sure.<br/><br/>Therefore, they had to act now.<br/><br/>They had to suppress the evil sequence faction’s thoughts in the asterisk universe.<br/><br/>They had to let them know that if they made any moves against the Guardian Alliance, they would have to pay an even more tragic price.<br/><br/>Let them know that they were in trouble and retreat.<br/><br/>“Alright, let’s Do It!”<br/><br/>Alliance master he and the others immediately gave the order.<br/><br/>A group of people filled with killing intent flew towards the evil sequence faction’s champions and legion.<br/><br/>Five hundred years later, the champions of the Guardian Alliance appeared on the right side of the evil sequence faction’s champions and legion.<br/><br/>Now, the asterisk universe was filled with the scouts and scouting items of the Guardian Alliance.<br/><br/>The champions of the Guardian alliance had the geographical advantage.<br/><br/>“I have a bad premonition. Everyone be careful.”<br/><br/>At this moment, back in the evil sequence faction, vocation suddenly spoke with a frown.<br/><br/>He had been using divination the entire time.<br/><br/>Now, he suddenly received a big result.<br/><br/>However, he couldn’t predict the exact situation.<br/><br/>Because the divination involved was beyond his ability.<br/><br/>However, he could completely guess the current situation.<br/><br/>“Oh?”<br/><br/>When all the experts heard this information, they raised their eyebrows slightly.<br/><br/>“All disciples, gather together. Be careful.”<br/><br/>An expert instructed the disciples.<br/><br/>When all the army’s disciples heard this, they immediately became vigilant.<br/><br/>“Everyone, use your concealment techniques. Everything that can be overlapped will be overlapped.”<br/><br/>“In addition, enter the coverage of my heavenly fate treasure. Prepare to launch a surprise attack!”<br/><br/>On the right, a huge wing appeared behind alliance leader He. The wing emitted a powerful might.<br/><br/>The reason he was able to become the Alliance leader of the Guardian Alliance was because he possessed a heavenly fate treasure.<br/><br/>“Hum!”<br/><br/>All the powerhouses stood on both sides of the wings, staring at all the powerhouses of the evil sequence faction with killing intent.<br/><br/>“Boom!”<br/><br/>In an instant, the wings of the heavenly fate level enveloped them.<br/><br/>Like a terrifying hurricane, they attacked the evil sequence faction’s flank and the Legion.<br/><br/>They didn’t attack the heavenly fate powerhouses.<br/><br/>They attacked the disciples of the evil order.\t\t\t\t\t\t</div>", "images": {}, "success": true}