{"id": 1441, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075546.html", "title": "Chapter 4444 - Chapter 4444: 4443 Powerful Divination", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4444 - Chapter 4444: 4443 Powerful Divination</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4444: 4443 powerful divination<br/><br/>Currently, an Lie’s strength was still at the peak of the Dominator realm.<br/><br/>An lie belonged to the mutated space attribute. It would be dozens of times more difficult for him to achieve a breakthrough compared to the other attributes.<br/><br/>In fact, he even felt that there was no hope for him to achieve a breakthrough.<br/><br/>However, this stone of origin had a huge effect on an lie.<br/><br/>It could allow him to increase his strength.<br/><br/>Although Wang Xian had already simulated an lie’s ability, an Lie’s status and importance in the Dragon Palace was still far greater than the other Heaven’s origin powerhouses.<br/><br/>Buzz<br/><br/>After obtaining an Lie’s ability, Wang Xian’s figure flashed and instantly returned to the Palace of the Dragon Palace Alliance in the land of origin!<br/><br/>This time, thirteen powerful universes had joined the Dragon Palace, allowing the Dragon Palace to obtain a lot of resources.<br/><br/>It also allowed the strength of the Dragon Palace Alliance to increase significantly.<br/><br/>Regarding these newly joined universes, Wang Xian naturally had to meet them.<br/><br/>“Greetings, Dragon King!”<br/><br/>The three great prophets who had divined the universe had all arrived.<br/><br/>There were also some members who had joined the Dragon Palace Alliance in the past.<br/><br/>They were in the Palace of the Dragon Palace Alliance, so they naturally wanted to come and take a look.<br/><br/>In addition, there were no weak universes among the newly joined universes.<br/><br/>These weak universes naturally wanted to befriend the powerhouses from the powerful universes.<br/><br/>“Hehe, Welcome to the Dragon Palace Alliance.”<br/><br/>Wang Xian looked at the powerhouses in front of him and smiled.<br/><br/>Apart from the powerful divination universe, there was another universe that was on the level of the Great Dao.<br/><br/>This universe had a good relationship with the divination universe. Not long after the divination universe joined, it also joined the Dragon Palace Alliance!<br/><br/>“It’s our honor to be able to join the Dragon Palace Alliance. It’s extremely chaotic outside now. With you here, Dragon King, we can feel more at ease.”<br/><br/>An expert said with a smile.<br/><br/>“Anyone who joins the Dragon Palace Alliance will be a member of the Dragon Palace Alliance. If we don’t take the initiative to provoke other universes and are invaded, we will be protected by the Dragon Palace and the Alliance!”<br/><br/>Wang Xian assured them.<br/><br/>“We will naturally trust the Dragon King!”<br/><br/>The group of powerhouses replied immediately.<br/><br/>Currently, a large number of universes around the land of origin had been invaded by the evil sequence camp.<br/><br/>The Dragon Palace Alliance was a Pure Land.<br/><br/>To them, it was totally worth it to take out some resources to join the Dragon Palace Alliance.<br/><br/>Especially after the universe divination joined the Dragon Palace Alliance, many powerhouses in the universe could not sit still.<br/><br/>The divination universe was very special and powerful in the land of origin.<br/><br/>The divination universe joining the Dragon Palace Alliance made many masters of the universe think that the divination universe might have divined some future situations.<br/><br/>That was why there were twelve other powerful universes joining the Dragon Palace Alliance.<br/><br/>Wang Xian chatted with the Masters of the universe for a while and held a celebratory banquet.<br/><br/>Following that, Wang Xian went to the divination universe and asked about the divination situation.<br/><br/>Silently, Wang Xian used the power of chaos to completely convert it into divination power.<br/><br/>He also mastered the divination method.<br/><br/>Divination power was of great use to Wang Xian.<br/><br/>Especially for the following situation.<br/><br/>“Dragon King, another force has been established in the land of origin.”<br/><br/>After Wang Xian had finished consulting all the powerful diviners in the universe, Prime Minister Gui suddenly walked over and reported to him.<br/><br/>“HMM? What’s the situation?”<br/><br/>Wang Xian looked at Prime Minister Gui Curiously and asked.<br/><br/>“Not long after our Dragon Palace Alliance announced the new members, a Guardian Alliance was established. There are a total of 18 universes in this alliance. The strength of these 18 universes are all the stronger ones in the land of origin. There are four existences at the Great Dao level in this alliance, and there are many at the control level.”<br/><br/>“The Guardian Alliance announced in the communication device today that they will not provoke anyone. However, if any universe is invaded, they will attack together.”<br/><br/>Prime Minister GUI said, “The establishment of the Guardian Alliance is obviously to fight against the invasion of the evil sequence faction.”<br/><br/>Wang Xian nodded slightly when he heard that. “It seems that the evil sequence faction has already made everyone in the universe in the land of origin feel insecure.”<br/><br/>“Yes!”<br/><br/>Prime Minister Gui replied.<br/><br/>“This has nothing to do with us. You can continue to take care of things here. I will make another trip to the location below the land of origin.”<br/><br/>Wang Xian said to Prime Minister Gui.<br/><br/>Not long after that, he teleported to the land of origin once again.<br/><br/>The last time he went to the bottom of the land of origin, Wang Xian had set up some devil spirit altars.<br/><br/>This was to save him hundreds of years of flying time the next time he went.<br/><br/>Now, Wang Xian was used to setting up devil spirit altars in some places.<br/><br/>Just like all the member universes in the Dragon Palace Alliance, there were Devil Spirit Altars.<br/><br/>It was convenient for Wang Xian to rush over immediately.<br/><br/>Buzz<br/><br/>When he came to the land of origin again, Wang Xian waved his arm and the divination lamp appeared in front of him.<br/><br/>Wang Xian immediately set up a formation that interfered with karma.<br/><br/>This formation was called karmic protection.<br/><br/>It was a formation that could only be set up by divination.<br/><br/>It was also this formation that allowed ao Cangtian to avoid Wang Xian’s divination.<br/><br/>“I’ve set up this karmic protection myself. Its power completely surpasses that of the three great prophets of the universe.”<br/><br/>“Although the divination power isn’t too strong in terms of combat strength, it’s a little abnormal in terms of support!”<br/><br/>“I can totally use the power of divination to divine the weakness of the enemy and then launch an attack!”<br/><br/>Wang Xian mumbled as his eyes sparkled.<br/><br/>If the lamp of divination had a huge flaw and had an online connection, then the online connection was at the level of the Great Dao.<br/><br/>Then, Wang Xian’s current divination power was at the level of chaos.<br/><br/>However, Wang Xian had not done much divination at the moment.<br/><br/>Divining the general situation of a region would require a long period of preparation.<br/><br/>Wang Xian hoped to obtain more origin stones now so that his strength could be improved once again.<br/><br/>“Divine if there are any origin stones in this region!”<br/><br/>Wang Xian came to a cave entrance under the land of origin through the demonic spirit altar.<br/><br/>He immediately took out the divination lamp to perform divination.<br/><br/>Of course, the divination lamp was just a support for the current situation.<br/><br/>It was just like the divination compass used to divine the universe.<br/><br/>Buzz<br/><br/>Waves of divination power entered the divination lamp. Soon, information emerged under the light.<br/><br/>“HMM? The divination area is ten billion kilometers in radius. Within this ten billion kilometers radius, there is really the existence of the Stone of origin!”<br/><br/>Wang Xian looked at the lamp of divination. Under the light, the information in his eyes was glowing.<br/><br/>When prophet Hong and the rest were doing divination, they could not achieve the level of Wang Xian at all.<br/><br/>But now, Wang Xian could accurately predict whether there was a stone of origin within a 10 billion kilometers radius.<br/><br/>Furthermore, the specific location of this stone of origin.\t\t\t\t\t\t</div>", "images": {}, "success": true}