{"id": 1445, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075566.html", "title": "Chapter 4448 - Chapter 4448: 4,447, Two Chaos-Level Combat Strength", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4448 - Chapter 4448: 4,447, Two Chaos-Level Combat Strength</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4448: 4,447, two chaos-level combat strength<br/><br/>Now that he could come and go freely from the underground of origin, Wang Xian was not in a hurry.<br/><br/>He had to increase his strength first.<br/><br/>He returned to the Dragon Palace in the blink of an eye.<br/><br/>“2.5 points of fusion can increase my strength by one beginner-level.”<br/><br/>“I’m still lacking eight beginner-level combat strength, which is equivalent to two chaos-level combat strength. The ability of the stone of origin that I obtained this time is about eleven stones of origin. It can increase my strength to two chaos-level existences.”<br/><br/>“I’ll give the other two stones of origin to an lie to use for cultivation for the time being!”<br/><br/>Wang Xian pondered in his heart and called an lie over.<br/><br/>“Dragon King!”<br/><br/>An lie rushed over and called out respectfully.<br/><br/>“Take these two stones of origin and use them for cultivation.”<br/><br/>Wang Xian gave him the stones of origin and instructed him.<br/><br/>“It’s the Dragon King!”<br/><br/>An Lie’s eyes lit up when he saw this and he immediately received it excitedly.<br/><br/>Wang Xian smiled and waved his hand at him. Then, he began to cultivate.<br/><br/>It would take about ten thousand years to absorb one piece of the origin stone.<br/><br/>If he absorbed all eleven pieces, it would take 110,000 years.<br/><br/>That was not a long time!<br/><br/>…<br/><br/>When Wang Xian absorbed the origin stone, the entire land of origin was quiet for a long time.<br/><br/>After the evil sequence camp invaded one universe after another, when the universe joined the Dragon Palace Alliance and the Guardian Alliance was established.<br/><br/>It entered a period of peace.<br/><br/>During this period, no universe was attacked by the evil sequence faction again.<br/><br/>It was as if the invasion of the evil sequence faction would end here.<br/><br/>“It has been 80,000 years. Now, all the universes that we invaded have been eliminated. What should be absorbed has been absorbed, and almost everything that should be broken through has been broken through. Should we go in and take action?”<br/><br/>“If we move again, we’ll have to move together. We Can’t split up anymore. Otherwise, we’ll suffer heavy losses if we encounter a counterattack.”<br/><br/>At the same time, a message was suddenly sent from the evil sequence faction through a communication device.<br/><br/>“For now, it’s best not to provoke the Dragon Palace Alliance. According to my understanding of the Guardian Alliance, there are four great dao levels, 21 mastery levels, and 73 beginner levels in this faction.”<br/><br/>“A total of ninety-eight heavenly yuan creation level cultivators are not easy to deal with.”<br/><br/>“We have more than two hundred and sixty heavenly Yuan creation level cultivators and eight Great Dao level cultivators. According to what I said, with our strength, even the Dragon Palace Alliance can deal with them.”<br/><br/>“The Dragon King of the Dragon Palace Alliance is a primal chaos level cultivator after all. Forget it for now. Primal Chaos level cultivators can fight and retreat as they wish. There’s no need for us to provoke such a powerful enemy for our camp. The Guardian Alliance can deal with them.”<br/><br/>“If we join hands and attack a universe together, I don’t believe that the Guardian Alliance can be united<br/><br/>“Hehehe, I think that we can design some scenarios. Let’s say that a heavenly yuan destiny-level treasure was born in a universe. Let’s go find the heavenly yuan destiny-level treasure and see if the Guardian Alliance can be united<br/><br/>“If we want to take action, we need the agreement of the eight lords in our camp, with the eight lords taking the lead. Otherwise, those four great dao level powerhouses would indeed be a huge problem for us.”<br/><br/>Within the evil sequence camp, a large number of powerhouses began to discuss.<br/><br/>After destroying 20 to 30 universes.<br/><br/>They were not satisfied.<br/><br/>This time, the evil sequence faction had sent out too many experts and universes.<br/><br/>Although their gains were huge, they weren’t completely satisfied after being split up.<br/><br/>They were still filled with greed for the land of origin.<br/><br/>But now, the remaining universes in the land of origin were divided into two alliances.<br/><br/>One was the Dragon Palace Alliance, and the other was the Guardian Alliance.<br/><br/>Of course, they would choose the soft persimmon!<br/><br/>“I think we can make a move. What do you guys think?”<br/><br/>“One of my soul refining flags is only one step away from being refined into a heavenly yuan blessed realm corpse. Hehe.”<br/><br/>“If that’s the case, let’s have a discussion!”<br/><br/>While the experts of the evil sequence faction were discussing.<br/><br/>At this moment, a few great dao existences began to make their decision.<br/><br/>Although their strength wasn’t enough to completely destroy the Guardian Alliance, if the Guardian Alliance really dared to confront them head-on and fight them head-on, then the Guardian Alliance would be completely destroyed.<br/><br/>In theory, three could destroy one.<br/><br/>The evil sequence faction’s strength wasn’t even three times that of the Guardian Alliance.<br/><br/>However, the war was a little different.<br/><br/>For example, if six Great Dao existences restrained four Great Dao existences.<br/><br/>The remaining two great dao existences could easily slaughter those at the beginner level or even the control level.<br/><br/>Under such circumstances, they could gradually annihilate their opponents.<br/><br/>However, this would take a long time.<br/><br/>The evil sequence faction still had a huge advantage.<br/><br/>They felt that they could make a move.<br/><br/>Some experts of the evil sequence faction felt that their power could even touch the Dragon Palace Alliance.<br/><br/>So what if they were at the chaos level?<br/><br/>Their power was extremely terrifying.<br/><br/>According to their investigations, the Dragon Palace Alliance only had around 150 heaven origin creation level existences!<br/><br/>Of course, they didn’t find out how many heaven origin creation realm experts the Dragon Palace had.<br/><br/>From the outside world’s point of view.<br/><br/>The entire strength of the Dragon Palace was the same as when they destroyed the belief universe.<br/><br/>Ten thousand years later.<br/><br/>At the edge of a universe.<br/><br/>Dozens of heaven origin creation realm experts flew over from all directions.<br/><br/>From Afar, one could sense the terrifying bloody aura coming from their bodies.<br/><br/>Dozens of heavenly yuan creation realm experts gathered together and looked at each other.<br/><br/>The leaders were eight Great Dao realm experts.<br/><br/>Eight Great Dao realm experts, three human figures, and five other demon figures.<br/><br/>“When do we attack? Which universe are we targeting?”<br/><br/>One of the Eight Great Dao realm experts spoke and said faintly.<br/><br/>He had two antennae and seemed to exude an ethereal aura.<br/><br/>If Wang Xian was here, he would definitely be able to recognize him.<br/><br/>“Spirit kneader, I have received news that the leader of the Dragon Palace Alliance, the Dragon King of the Dragon Palace, is the Dragon King whom we joined forces to kill back then. If he were to know about us, there might be some trouble.”<br/><br/>At this moment, an expert of the Great Dao realm with a special body looked at an old man on the left and said.<br/><br/>“I didn’t expect that guy to break through to the primal chaos realm either. However, he must have relied on treasures to reach the primal Chaos Realm.”<br/><br/>Spirit kneader said with a gloomy expression.\t\t\t\t\t\t</div>", "images": {}, "success": true}