{"id": 1440, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075541.html", "title": "Chapter 4443 - Chapter 4443: 4442 The Heaven-Defying Ability Of The Power Of Chaos!", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4443 - Chapter 4443: 4442 The Heaven-Defying Ability Of The Power Of Chaos!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4443: 4442 the heaven-defying ability of the power of Chaos!<br/><br/>In the following period of time, Wang Xian had been removing the death mark in his body.<br/><br/>Prime Minister Gui received another stone of origin.<br/><br/>However, the energy in this stone of origin was average. It only increased the fusion rate by 2% .<br/><br/>Although Wang Xian’s strength had increased a little, it was still not at the level of a beginner in the Heaven’s origin realm.<br/><br/>According to Wang Xian’s calculations, every increase in his fusion rate of around 2.5 points would allow him to increase his combat strength of a beginner in the Heaven’s origin realm.<br/><br/>This increase was very terrifying.<br/><br/>“Dragon King, there are already thirteen universes that have joined our Dragon Palace Alliance. When will you meet the new members?”<br/><br/>Thousands of years passed quickly.<br/><br/>Prime Minister GUI reported the current situation of the Dragon Palace Alliance.<br/><br/>In just a few thousand years, the Dragon Palace alliance had thirteen new members.<br/><br/>The universes that joined the Dragon Palace Alliance were not weak.<br/><br/>They had at least two control-level existences.<br/><br/>This made the Dragon Palace Alliance’s strength increase greatly.<br/><br/>“I’ll head over now. Tell these powerhouses in the universe.”<br/><br/>Wang Xian hesitated for a moment and said to Prime Minister Gui.<br/><br/>Now that his strength had increased, the speed of removing the death mark was much faster.<br/><br/>Although it had not been completely removed, about 30% of it had already been removed.<br/><br/>Wang Xian summoned an lie over.<br/><br/>“Dragon King, let’s Go!”<br/><br/>An lie reminded him and said!<br/><br/>“Wait a minute!”<br/><br/>At this moment, Wang Xian suddenly had a thought. He stared at an lie.<br/><br/>He suddenly thought of something.<br/><br/>Currently, the power of chaos in his body was extremely huge and terrifying.<br/><br/>The power of chaos turned everything into chaos.<br/><br/>The power of chaos could be converted into any kind of power.<br/><br/>In the past, the power of chaos in his body was less. Wang Xian only converted the power of chaos into some mutated attributes.<br/><br/>He didn’t do much research on it.<br/><br/>Now that the chaotic energy had surpassed his own strength, he felt that he could do some research on it.<br/><br/>Could he imitate an Lie’s ability?<br/><br/>It was easy to understand an lie’s attribute. It was a mutated spatial attribute!<br/><br/>Mutated spatial attributes were extremely rare.<br/><br/>It could even be said to be unique.<br/><br/>However, even if it was a mutation, this attribute could be fused into the chaos.<br/><br/>The chaos could also be divided into this attribute.<br/><br/>“An lie, release the energy in your body. Let Me Sense It!”<br/><br/>Wang Xian spoke to an lie.<br/><br/>“HMM? Alright, Dragon King!”<br/><br/>An lie nodded and released all his energy.<br/><br/>Wang Xian moved his palm and the power of chaos enveloped the energy released by an lie.<br/><br/>Following that, the power of chaos began to simulate and sense.<br/><br/>It began to transform bit by bit.<br/><br/>“HMM? It’s indeed possible. Compared to the ordinary space attribute, an Lie’s space attribute has an additional special substance. The reason for this special substance is that it’s much stronger than the space attribute!”<br/><br/>“The power of chaos can simulate this substance. It can simulate an Lie’s mutated space attribute!”<br/><br/>Wang Xian’s eyes flickered slightly.<br/><br/>With a wave of his arm, a barrier appeared in front of him.<br/><br/>Wang Xian converted the energy in his body into the mutated space power. With a flash, he entered the barrier directly.<br/><br/>A space defense that could ignore any defense.<br/><br/>This was an ability of an lie.<br/><br/>Another ability was long-distance teleportation.<br/><br/>“It is impossible to use the power of chaos to simulate this mutated space power. This teleportation requires the coordinates of the demonic spirit altar.”<br/><br/>“In an Lie’s mind, the coordinates of the demonic spirit altar will be stored. If I want to reach the demonic spirit altar directly, I will need the coordinates in an Lie’s mind. Can this coordinate be simulated?”<br/><br/>“There shouldn’t be a problem. Chaos can be converted into everything.”<br/><br/>Wang Xian thought to himself.<br/><br/>“An lie, stand still!”<br/><br/>Wang Xian looked at an lie. With a move of his palm, he infused the power of chaos into an Lie’s mind.<br/><br/>He did not harm an lie. Instead, he used the power of chaos to explore the abnormalities in an Lie’s mind.<br/><br/>Then, he simulated this abnormality.<br/><br/>Very soon, the power of chaos captured the differences in his mind.<br/><br/>He captured the coordinates one by one.<br/><br/>Wang Xian used the power of chaos to sense them.<br/><br/>He discovered something strange. Wang Xian could now use the power of mutated space to directly arrive at the coordinates in his mind.<br/><br/>This was very magical.<br/><br/>“This coordinate should be able to be simulated and connected.”<br/><br/>Wang Xian thought to himself. With the power of chaos, he could replicate the coordinates of an Lie’s brain.<br/><br/>Yes, it was very troublesome to replicate the coordinates one by one.<br/><br/>However, he could replicate the entire peculiar place in an Lie’s mind.<br/><br/>As long as the replication was completed, he could completely transform the peculiar place in his head into a compass.<br/><br/>The compass was equivalent to a teleportation map. By then, Wang Xian would be able to teleport directly.<br/><br/>This was a powerful life-saving method.<br/><br/>An Lie’s ability was very important to the entire Dragon Palace.<br/><br/>If Wang Xian could control it, it would be too easy for him to escape when he encountered a strong enemy.<br/><br/>With a thought, he could teleport directly to the locations of the demon spirit altars.<br/><br/>It was extremely convenient!<br/><br/>By then, no one would be able to kill him.<br/><br/>An Lie’s ability was extremely heaven-defying.<br/><br/>Buzz Buzz<br/><br/>Buzz Buzz<br/><br/>Very soon, an Lie’s head was duplicated by Wang Xian one by one.<br/><br/>Wang Xian checked the coordinates of the duplicated head. There was no problem.<br/><br/>He could directly teleport through the coordinates inside!<br/><br/>“Impressive. With this ability, I don’t need to call an lie over every time!”<br/><br/>Wang Xian’s eyes emitted a fiery glow.<br/><br/>Using the power of chaos to transform into an intense energy was merely an experiment.<br/><br/>Now that he had succeeded, there were too many abilities that he could do and convert.<br/><br/>Putting everything aside, the power of divination.<br/><br/>This was the ability of Wang Xian’s mind.<br/><br/>He could predict the past and the future.<br/><br/>It was simply invincible.<br/><br/>Wang Xian could completely transform the power of chaos into the power of divination.<br/><br/>As long as he mastered the methods and techniques of divination, he could totally perform his own divination.<br/><br/>Most importantly, the three great prophets were divination prophets of the Great Dao level.<br/><br/>If Wang Xian fully simulated it, he could convert all the power of chaos in his body into the power of divination.<br/><br/>At that time, he would be a prophet comparable to the power of chaos.<br/><br/>His ability was completely incomparable to the three great prophets.<br/><br/>At that time, he would go to the underground of the land of origin to search for the Stone of origin. With the power of divination at the level of chaos, he could reduce the size of the stone of origin to a very small area.<br/><br/>At that time, it would be easier to search for it.<br/><br/>At that time, he would become stronger and stronger.<br/><br/>At the thought of this, Wang Xian was a little excited.<br/><br/>“Dragon King, what are you doing?”<br/><br/>An lie couldn’t help but ask when he saw Wang Xian materialize a head that looked exactly like his.<br/><br/>“Nothing much. It’s a good thing.”<br/><br/>Wang Xian smiled and looked at an lie. “The origin stones from the land of origin can increase your strength. I’ll see if I can get more origin stones in the future so that your strength can also increase.”\t\t\t\t\t\t</div>", "images": {}, "success": true}