{"id": 1446, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075571.html", "title": "Chapter 4449 - Chapter 4449: 4448 Spirit Kneader, Illusion Realm, And Heaven Occupation", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4449 - Chapter 4449: 4448 Spirit Kneader, Illusion Realm, And Heaven Occupation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4449: 4448 spirit kneader, illusion realm, and heaven occupation<br/><br/>The Spirit Kneader was the expert from the evil sequence faction that Wang Xian and the Justice Alliance’s Song Ta Jian had joined forces to kill.<br/><br/>At the same time, in order to take revenge, the spirit kneader called for Heaven Occupation Illusion Realm and pushed Wang Xian into the cross-shaped primordial spirit region.<br/><br/>It was also because of that incident that Wang Xian almost died.<br/><br/>Of course, it was a blessing in disguise and he had obtained the primal chaos stone completely.<br/><br/>However, Wang Xian had a grudge with the spirit kneader and the rest.<br/><br/>This time, the three of them came to invade the land of origin.<br/><br/>Not long after, when the spirit kneader was searching for information about the Dragon Palace Alliance, he was sure that the leader of the Dragon Palace Alliance, the Dragon King of the Dragon Palace, was the one who killed him.<br/><br/>What he didn’t expect was that the other party’s strength had actually risen to the primal chaos level.<br/><br/>This made him feel incredulous.<br/><br/>In such a long time, his strength had only risen by one initial level.<br/><br/>In his opinion, he was already very satisfied and very happy.<br/><br/>However, that Dragon King had only been able to match two great dao levels back then.<br/><br/>Now, he had directly reached the primal chaos level?<br/><br/>The speed of the increase was too terrifying.<br/><br/>This also made him look extremely embarrassed.<br/><br/>“Eh? Spirit kneader, you have provoked such a powerful enemy?”<br/><br/>A powerful existence with 12 blood-red wings looked at them from the side. He frowned slightly and said.<br/><br/>“That guy and the experts of the Justice Alliance ganged up on me and killed me once!”<br/><br/>Spirit kneader looked at him with a gloomy face. “Don’t worry. That Dragon King must have relied on treasures to have the combat strength of the primal chaos level. With our strength, he wouldn’t dare to provoke us.”<br/><br/>“Lord Spirit kneader, with our strength, so what if it’s the Dragon Palace Alliance? If we really fight, they’re definitely not our match.”<br/><br/>Behind the spirit kneader, a master-level powerhouse said.<br/><br/>He didn’t put the Dragon Palace Alliance in his eyes at all.<br/><br/>In their opinion, the Dragon Palace Alliance was far inferior to the Justice Alliance.<br/><br/>It was even worse than them.<br/><br/>They had lost hundreds of Heaven’s fate realm cultivators in the fight against the Justice Alliance. Why would they be afraid of a small Dragon Palace Alliance?<br/><br/>They believed that they could completely suppress the Dragon Palace alliance with their own strength.<br/><br/>After all, the universe that had just joined the Dragon Palace Alliance was a bunch of weaklings.<br/><br/>“Let’s not worry about the Dragon Palace Alliance for now. After all, there are six Great Dao existences in the Dragon Palace Alliance besides the Dragon King. Let’s take care of the Guardian Alliance first.”<br/><br/>A Great Dao expert said.<br/><br/>“Okay, then our first target will be the star universe. Let’s say that the star universe has a heavenly fate treasure. Let’s see if the Guardian Alliance can work together.”<br/><br/>“If they work together, then we’ll kill them. If they can’t work together, then it’ll be even easier, and the entire Guardian Alliance will collapse!”<br/><br/>Vocation said directly.<br/><br/>“Alright, Vocation, you’re good at prediction. If you want to attack the Star Universe first, then we’ll attack the Star Universe first. We’ll spread the information about the Heavenly Yuan Destiny Treasure. We’ll also be prepared to prevent the alliance from defending.”<br/><br/>On the right, the fantasy realm said.<br/><br/>“The possibility of the Alliance joining forces with the Dragon Palace Alliance is low. The Dragon Palace Alliance won’t join forces with them. Joining the Dragon Palace Alliance requires treasures. If the Dragon Palace Alliance joins forces with the Dragon Palace Alliance, the Dragon Palace Alliance will lose the hearts of its members.”<br/><br/>“Therefore, the possibility of them working together is very, very low. Let’s make a move directly.”<br/><br/>The spirit kneader said.<br/><br/>“Then let’s make a move as soon as possible. This time, I want to get the body of a heavenly yuan creator.”<br/><br/>A skeleton-headed old man who was wearing a black robe and looked like the spirit kneader laughed mechanically with flames in his eyes.<br/><br/>“Alright, release the news first, then gather in the eastern void space of the star Origin Universe!”<br/><br/>Tian Gong nodded and said.<br/><br/>“No problem.”<br/><br/>The group of experts nodded.<br/><br/>Then, they quickly left and returned to the universe they had conquered. They led their disciples and gathered in the direction of the star origin universe.<br/><br/>At the same time, a piece of news spread out from the land of origin.<br/><br/>“A heavenly creation true treasure has been born in the Star Universe.”<br/><br/>The news caused quite a stir in the land of origin.<br/><br/>A heavenly creation true treasure was the most powerful true treasure for any great being.<br/><br/>A heavenly creation true treasure was the most powerful treasure known in the chaos of the universe.<br/><br/>Even Great Dao existences would make a move when they heard the news.<br/><br/>When this news came out, many experts became restless.<br/><br/>However, the land of origin had been divided into two camps.<br/><br/>One was the Dragon Palace Alliance, and the other was the Guardian Alliance.<br/><br/>When the experts conversed, it was very interesting.<br/><br/>A large number of experts discussed.<br/><br/>“Huh?”<br/><br/>In a palace of the Dragon Palace Alliance.<br/><br/>An expert’s heart was moved, and his eyes revealed a burning expression.<br/><br/>He was the only Great Dao level great being in the Dragon Palace Alliance, apart from the Three Great Prophets, the demonic void King.<br/><br/>However, he didn’t have the Heavenly Yuan Destiny Supreme Treasure in his hands.<br/><br/>He was also extremely concerned about the Heavenly Yuan Destiny Supreme Treasure.<br/><br/>However, he didn’t act rashly. After he received this news, he immediately flew towards the location of the prophetic universe palace.<br/><br/>More than a billion years ago, the only Heavenly Yuan Destiny Supreme Treasure that was born in this universe was divined by the prophets who divined the universe.<br/><br/>If the Star Alliance gave birth to a heavenly fate treasure, the three prophets would be able to perform a divination to confirm the news.<br/><br/>“Are the three brothers here?”<br/><br/>When he knocked on the door and entered the palace of the Prophet universe, he was surprised to see the three prophets here.<br/><br/>“Hehe, Jiu Yuan, we are all here.”<br/><br/>The three prophets smiled and nodded at him.<br/><br/>Their relationship was quite good.<br/><br/>“Brothers, have you received the information from the Star Universe? Is there really a heavenly yuan creation treasure there?”<br/><br/>Jiu Yuan did not stand on ceremony. He directly entered and asked.<br/><br/>“I know!”<br/><br/>The three prophets looked at each other and nodded. “The three of US gathered here and all of us just did a divination.”<br/><br/>“It was really born?”<br/><br/>Jiu Yuan’s eyes lit up and he asked expectantly.<br/><br/>“We didn’t divine that the Star Universe was born with a heavenly fate treasure.”<br/><br/>The prophet shook his head and pondered for a moment. “Instead, we divined that there would be a disaster in the star universe. As for what kind of disaster, we don’t know. Brother Jiu Yuan, you’d better not be rash.”<br/><br/>“HMM? You guys didn’t divine it? Then where did this news come from?”<br/><br/>“There will be a disaster in the Star Universe?”<br/><br/>When Jiu Yuan heard this, he was slightly shocked.<br/><br/>He had a lot of trust in the divination of the three great prophets.<br/><br/>Especially when the three of them divined at the same time, they all divined that there would be a disaster instead of the birth of the Heavenly Yuan Destiny Treasure in the Star Universe.<br/><br/>This was strange.\t\t\t\t\t\t</div>", "images": {}, "success": true}