{"id": 1444, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075561.html", "title": "Chapter 4447 - Chapter 4447: 4,446 Chaos-Level Behemoths", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4447 - Chapter 4447: 4,446 Chaos-Level Behemoths</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4447: 4,446 chaos-level behemoths<br/><br/>“If the twelve origin stones are gathered together, is it within a tribe or is it ownerless? If it is within a tribe of chaos-level behemoths, it should be a very powerful tribe.”<br/><br/>“However, hope is ownerless.”<br/><br/>Wang Xian thought to himself, but his hands did not stop moving.<br/><br/>He held the divination lamp and continued divination.<br/><br/>Buzz! Buzz<br/><br/>However, this time, when he was doing his divination, the entire divination lamp started to sway.<br/><br/>The light under the lamp gradually began to turn illusory.<br/><br/>Wang Xian was slightly stunned when he saw this scene. A look of astonishment appeared on his face.<br/><br/>“This is?”<br/><br/>A solemn expression appeared on his face as he channeled his powerful divination power into it.<br/><br/>Very soon, the illusory image of a gigantic beast of chaos appeared under the divination lamp.<br/><br/>It was a gigantic beast of chaos with a terrifying pair of eyes.<br/><br/>Its gigantic pupils took up four-fifths of its head.<br/><br/>Its gigantic pupils were filled with all kinds of terrifying energy.<br/><br/>The body behind it was like a snake’s tail, swaying in the void.<br/><br/>“Chaos Level!”<br/><br/>Wang Xian’s eyes narrowed, and there was a hint of shock on his face.<br/><br/>Prophet Hong and the rest told him that there might be existences of the level of chaos at the bottom of the land of origin.<br/><br/>Now, he had really encountered one.<br/><br/>This was the first existence of the level of chaos that Wang Xian had encountered.<br/><br/>Buzz<br/><br/>Buzz! Buzz<br/><br/>At this moment, Wang Xian suddenly noticed that there was a slight change in the illusion of the gigantic beast of chaos under the divination lamp.<br/><br/>The illusion of the Chaos Beast seemed to have come to life as it looked at him with slight sensing.<br/><br/>When Wang Xian saw this scene, his heart trembled.<br/><br/>He quickly cut off the divination lamp.<br/><br/>“Has he been discovered?”<br/><br/>Wang Xian’s eyes flickered.<br/><br/>A top-notch expert might have a premonition when he was divined.<br/><br/>Now, he had also been sensed by the chaos beast when he was divining.<br/><br/>“This hundun-level existence is probably not weak. It should be stronger than the ordinary hundun-level existences.”<br/><br/>Wang Xian thought to himself with a hesitant look on his face.<br/><br/>Although Wang Xian’s current strength was comparable to two hundun-level existences.<br/><br/>However, it was too difficult to snatch something from a hundun-level existence.<br/><br/>“Why don’t I give it a try and use my divination power to try? Besides, I can experience the powers of other hundun-level existences.”<br/><br/>Wang Xian pondered in his heart and quickly made up his mind.<br/><br/>I should go and experience it.<br/><br/>I will act as I say.<br/><br/>He immediately flew towards the area where the Giant Beast of Primal Chaos was located.<br/><br/>“I’m almost there!”<br/><br/>He flew all the way in.<br/><br/>When he sensed the existence of the giant beast of primal chaos level, he thought to himself.<br/><br/>Buzz<br/><br/>When he flew forward for a distance again, Wang Xian suddenly sensed that he seemed to have entered a special domain.<br/><br/>Buzz Buzz<br/><br/>At this moment, Wang Xian felt that he was being spied on.<br/><br/>This made his heart skip a beat!<br/><br/>He had been discovered!<br/><br/>Boom Boom<br/><br/>In the next moment, the chaos-level existence with a huge single eye appeared in front of Wang Xian instantly.<br/><br/>Wang Xian could feel the surrounding void starting to fluctuate.<br/><br/>Waves of pressure were coming from his surroundings.<br/><br/>At the same time, a special energy was attacking him.<br/><br/>The power of this attack was extremely terrifying!<br/><br/>Buzz<br/><br/>Wang Xian’s body trembled. The power of space enveloped him, forming a safe spatial domain around him.<br/><br/>Wang Xian did not take the initiative to attack. He was still looking at this chaos-level existence curiously.<br/><br/>Dong! Dong<br/><br/>At this moment, the chaos-level existence opposite him started to move.<br/><br/>His terrifying pupils emitted a thick energy.<br/><br/>This was a very special energy.<br/><br/>The energy contained space, flames, and other strange energies.<br/><br/>The terrifying energy rays came directly in front of Wang Xian.<br/><br/>It almost ignored the attack of space.<br/><br/>It was completely comparable to the ultimate treasure of the Wheel of nothingness, the Heaven’s origin creation.<br/><br/>Wang Xian saw it and transformed into the body of a divine dragon.<br/><br/>The Dragon Claw stretched out.<br/><br/>The Dragon Claw formed by the power of Chaos went straight for the energy ray.<br/><br/>“Bang!”<br/><br/>A huge collision sound was heard.<br/><br/>“Buzz Buzz Buzz!”<br/><br/>At this moment, that chaos-level existence turned into multiple clones.<br/><br/>More than ten clones surrounded Wang Xian in an instant.<br/><br/>Even Wang Xian couldn’t see the ability clearly in that instant.<br/><br/>“This should be the domain of this chaos-level existence. Within its domain, its strength can be greatly enhanced.”<br/><br/>Wang Xian thought to himself.<br/><br/>“Dong Dong Dong!”<br/><br/>“Dong Dong Dong!”<br/><br/>More than ten shadows that surrounded Wang Xian shot out more than ten terrifying energies.<br/><br/>The energy swept out and covered the entire space around Wang Xian!<br/><br/>Under his senses, the surrounding area had been locked down.<br/><br/>If it was just ordinary space power, it would be impossible to teleport even if he had the time.<br/><br/>Fortunately, Wang Xian was in control of the dark and violent mutated space power.<br/><br/>With a move of his body, the divination lamp appeared in front of him.<br/><br/>He immediately divined the real body and weaknesses of this chaos-level existence.<br/><br/>“All of them are real bodies.”<br/><br/>“There are no weaknesses!”<br/><br/>Soon, Wang Xian received a piece of information that surprised him.<br/><br/>Each of these more than ten clones were real bodies.<br/><br/>There were no weaknesses on their bodies.<br/><br/>“To be able to become a chaos-level existence, he is really not simple!”<br/><br/>Wang Xian used the mutated space energy to teleport behind a real body. His dragon horn bloomed with the mutated space energy.<br/><br/>The chaotic power of space slashed towards an actual body.<br/><br/>“PFFT! PFFT! PFFT! PFFT!”<br/><br/>“PFFT! PFFT! PFFT!”<br/><br/>The body of this chaotic behemoth suddenly emitted a luster.<br/><br/>All the real bodies in the surroundings dimmed down.<br/><br/>It was as if they were augmented with energy, increasing the defensive power of this real body.<br/><br/>“Bang! Bang!”<br/><br/>However, Wang Xian’s powerful strength still broke through its defense, leaving numerous wounds on its body.<br/><br/>Although the wounds were not serious, they had broken through his defense.<br/><br/>This was very important for the battle between the strong.<br/><br/>“Dong Dong!”<br/><br/>“Dong Dong!”<br/><br/>At this moment, numerous pupils that were filled with violence and chaos gathered around Wang Xian.<br/><br/>Each pupil seemed to have a life of its own as they attacked him.<br/><br/>Wang Xian saw that he did not dodge. The power of chaos transformed into endless earth attributes and condensed into numerous defenses.<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>The sounds of collisions and explosions rang out. However, Wang Xian’s defense was able to withstand its attack.<br/><br/>“My strength is above his. However, this place seems to be the domain of this chaos-level existence. It’s impossible for me to kill it.”<br/><br/>“I can leave now!”<br/><br/>Wang Xian didn’t hesitate any longer. He moved and left immediately.<br/><br/>“I didn’t expect to meet a chaos-level existence so quickly. How many chaos-level existences are there in the entire land of origin?”<br/><br/>Wang Xian mumbled. He hesitated for a moment and decided to return first.<br/><br/>He wasn’t in a hurry anyway. He would go back and absorb these stones of origin first.\t\t\t\t\t\t</div>", "images": {}, "success": true}