{"id": 1448, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075581.html", "title": "Chapter 4451 - Chapter 4451: 4,450", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4451 - Chapter 4451: 4,450</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4451: 4,450<br/><br/>“There’s one more important point. The enemy has eight Great Dao existences.”<br/><br/>The Vice Alliance leader of the Guardian Alliance continued, his face expressionless.<br/><br/>This time, they had already investigated the power of the evil sequence faction around the land of origin.<br/><br/>This power was extremely terrifying!<br/><br/>“Alliance leader He, the three Vice Alliance leaders, what should we do now? “The situation in our star universe is obviously a conspiracy of the evil sequence camp. If we don’t stop them, won’t the evil sequence camp be able to enter the universe of the members of Our Guardian alliance with just a piece of information?”<br/><br/>A great being from the star universe said with an unsightly expression.<br/><br/>His words made the four alliance leaders look thoughtful and solemn.<br/><br/>They scanned their surroundings.<br/><br/>All the powerhouses were silent.<br/><br/>“Our Guardian Alliance was formed to deal with the evil sequence faction. What do you all think of the current situation?”<br/><br/>Alliance leader he glanced at all the powerhouses and asked.<br/><br/>“This… why don’t we take another look?”<br/><br/>Everyone was silent for a long time before one of the powerhouses spoke.<br/><br/>“Everyone, we are an alliance. If we take another look at this situation, then what’s the point of our alliance? It’s obvious that the evil sequence faction wants to deal with our star universe.”<br/><br/>The strongest powerhouse from the star universe looked coldly at the powerhouse who spoke and said in a deep voice.<br/><br/>“Also, our star universe has the birth of a heavenly fate treasure. Why hasn’t the Dragon Palace Alliance made any moves after all these years? “Why hasn’t any powerhouse from the Dragon Palace Alliance gone to Our Star Universe to search for treasures<br/><br/>“The Dragon Palace Alliance has three Great Prophets. They won’t be able to divine whether our universe has a heavenly yuan destiny treasure or not. Why aren’t they moving, and only the evil sequence faction is moving?”<br/><br/>The only female heavenly yuan destiny powerhouse in the Star Universe said in a deep voice.<br/><br/>She asked one question after another.<br/><br/>“I think we can’t just sit back and do nothing. If we retreat this time, then our alliance won’t have the support of the people. This time, it’s the asterisk universe. That time, it might really be our universe.”<br/><br/>A white-bearded old man pondered for a moment and gave an opinion.<br/><br/>“Then do we really want to start a war with the evil sequence faction? With our strength, even if we fight them head-on, we’re still not their match.”<br/><br/>A middle-aged man frowned and said.<br/><br/>“The other side wants to gather together now. If we really fight them head-on, we really won’t be their match.”<br/><br/>Another powerhouse chimed in.<br/><br/>“Everyone, let me say a few words, and then everyone will make a discussion.”<br/><br/>Alliance master he, who was sitting at the very front, reached out to suppress his voice and said.<br/><br/>His words attracted the attention of all the Great Beings, and they all looked at him.<br/><br/>“The purpose of Our Guardian Alliance is to protect every single one of our homes. The goal of the evil sequence camp is indeed suspicious, and we can’t just sit back and do nothing<br/><br/>“But if we act directly, we’ll definitely be at a 100% disadvantage, so we won’t act until the end. My suggestion is that we all head to the star universe as well. Once they really start a massacre in the star universe, we’ll immediately launch an attack on them<br/><br/>“All the Great Beings of the evil sequence camp aren’t united. As long as they dare to attack, we’ll engage in guerilla warfare, ambush and kill them, and make them retreat. What do you all think? Everyone in the Star Universe, what do you all think?”<br/><br/>Alliance leader he looked at them and voiced his opinion.<br/><br/>“Alliance leader he’s suggestion is indeed good. We don’t have the capital to initiate a war with the evil sequence camp, but if they really attack the star universe, we’ll immediately retaliate and attack them.”<br/><br/>A great being nodded and agreed.<br/><br/>The Great Beings of the star universe looked at each other and transmitted their voices.<br/><br/>“Our Star Universe has no objections.”<br/><br/>The greatest being of the Star Universe also nodded.<br/><br/>At this time, their star universe was helpless.<br/><br/>Right now, they could only pray to the great beings of the evil sequence faction. Their goal wasn’t to really attack their star universe.<br/><br/>If they were to attack, their star universe would most likely be doomed!<br/><br/>“Alright, we’ll head to the Star Universe immediately!”<br/><br/>Alliance master he nodded.<br/><br/>The heavenly fate realm experts immediately got up and quickly teleported to the star universe.<br/><br/>Since they had formed an alliance, they naturally had their own special means to quickly head to a universe.<br/><br/>When they went into the star universe, the powerhouses of the evil sequence faction had not arrived yet.<br/><br/>All the powerhouses of the Guardian Alliance gathered at the center of the universe, quietly waiting for news.<br/><br/>Time passed day by day.<br/><br/>Not long after, the powerhouses of the Dragon Palace Alliance also received information about the evil sequence faction.<br/><br/>This made them slightly surprised.<br/><br/>“All the experts of the evil sequence faction have gone to the Star Universe? What are they doing?”<br/><br/>“All the experts of the Guardian Alliance seem to have gone to the star universe as well. Is there going to be a big battle?”<br/><br/>“It’s possible. Our Lord Dragon King said that he wouldn’t let us get involved in this mess. Does he know the inside story?”<br/><br/>“Is there really going to be a fight?”? Although the evil sequence camp was very strong, the powerhouses of the Guardian Alliance would still do their best for their own universe. Even if the evil sequence camp could gain the upper hand, they would still pay a terrible price.”<br/><br/>“If there really is a fight, it will definitely be a world-shaking battle. Hundreds of heavenly fate powerhouses are participating.”<br/><br/>In the Dragon Palace Alliance, the powerhouses kept discussing through some information they knew.<br/><br/>This made them feel lucky that they had joined the Dragon Palace Alliance.<br/><br/>They didn’t need to be scared at all.<br/><br/>At present, the disciples of the powerhouses in the Dragon Palace Alliance knew how many powerhouses there were in the evil sequence camp.<br/><br/>But now, there were four in the Dragon Palace Alliance, including the three prophets and the nine Elemental Great Dao powerhouses.<br/><br/>There were two more in the Dragon Palace.<br/><br/>Not to mention, there was also the Dragon King who was at the chaos level.<br/><br/>It was obvious that the Dragon Palace alliance had the upper hand in terms of strength. They were in a situation of suppression.<br/><br/>The evil sequence faction didn’t dare to invade them.<br/><br/>Wang Xian didn’t pay too much attention to the information from the Guardian Alliance and the evil sequence faction.<br/><br/>That was because, through his divination, he had already known the outcome of the matter.<br/><br/>With the eleven origin stones, the degree of fusion between Wang Xian and the primal chaos was getting higher and higher.<br/><br/>His strength was also getting stronger and stronger.<br/><br/>After his advancement this time around, Wang Xian was fearless even when faced with the entire evil sequence faction.<br/><br/>…<br/><br/>Several thousand years passed very quickly.<br/><br/>At the edge of the asterisk universe, numerous powerful figures brought a large number of disciples as they rushed over quickly.<br/><br/>As time passed, more and more powerful disciples gathered, forming a terrifying force.\t\t\t\t\t\t</div>", "images": {}, "success": true}