{"id": 1455, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075616.html", "title": "Chapter 4458 - Chapter 4458: One Of The 4457 Experts Took The Enemy’S Head", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4458 - Chapter 4458: One Of The 4457 Experts Took The Enemy’S Head</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4458: One of the 4457 experts took the enemy’s head<br/><br/>“It’s the members of the Dragon Palace Alliance.”<br/><br/>“It’s them. Our competitors are very strong this time. I wonder if the Dragon King will come.”<br/><br/>“It’s very likely that he will come. It’s a big competition for us.”<br/><br/>“There’s nothing we can do. If we rashly come directly, we’ll definitely attract the hostility of the Dragon Palace Alliance. Our strength is still not something the Dragon Palace alliance can compare to.”<br/><br/>“There’s another problem. Those guys from the Guardian Alliance are following US. One day, we’ll make them pay a terrible price!”<br/><br/>Over at the evil sequence camp, the eight Great Dao experts had also noticed the arrival of the Dragon Palace Alliance.<br/><br/>They looked over as well and spoke indifferently.<br/><br/>Neither side disturbed them as they continued to fly towards the deep frost universe.<br/><br/>“Dragon King, we have encountered the experts from the evil sequence faction. The experts from the Guardian Alliance are also at the rear. It Won’t be long before we arrive at the Deep Freeze Universe.”<br/><br/>Prime Minister Gui contacted Wang Xian as he flew.<br/><br/>In the Deep Freeze universe, Wang Xian raised his eyebrows slightly when he received Prime Minister Gui’s message.<br/><br/>“Set up a demonic altar when we reach the edge of the Deep Freeze universe. I’ll go over.”<br/><br/>Wang Xian instructed Prime Minister Gui.<br/><br/>Although the evil sequence faction had promised not to kill any living beings in the deep cold universe.<br/><br/>However, Wang Xian had to show his face to give them some deterrence.<br/><br/>In addition, he wanted to see the strength of this evil sequence faction.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui replied very quickly.<br/><br/>At the center of the Deep Cold Universe, Wang Xian was on a planet. He was strolling leisurely inside.<br/><br/>For thousands of years, he has arranged everything.<br/><br/>Waiting for the birth of the ultimate treasure of Tianyuan.<br/><br/>Time ticked by.<br/><br/>The powerhouses of the Dragon Palace Alliance, as well as the powerhouses of the evil sequence camp, also slowly came to the edge of the deep cold universe.<br/><br/>Prime Minister Oogway took a look at the evil array camp there, then sent a message to Wang Xian.<br/><br/>He waved his hand and stopped the experts from the Dragon Palace Alliance. Then, he set up a devil spirit altar!<br/><br/>“Our Dragon King is coming!”<br/><br/>Prime Minister Gui opened his mouth and said!<br/><br/>“Yes, the evil sequence alignment camp is very powerful. The arrival of the Dragon King will be able to give them some deterrence.”<br/><br/>The three great prophets nodded and said, “In addition, they have a huge advantage in searching for the ultimate treasure of Tianyuan.”<br/><br/>Buzz! Buzz<br/><br/>The moment they finished speaking, Wang Xian’s figure slowly appeared in the demonic spirit altar.<br/><br/>“Greetings, Dragon King!”<br/><br/>The group of powerhouses from the Dragon Palace Alliance immediately greeted Wang Xian respectfully when they saw him appearing!<br/><br/>“Yes!”<br/><br/>Wang Xian looked at them and nodded. Then, he looked to the right and saw the group of powerhouses from the evil sequence camp.<br/><br/>Sensing the bloody aura from them, Wang Xian couldn’t help but frown.<br/><br/>He could clearly sense that every living creature from the evil sequence camp was stained with the blood of countless living creatures.<br/><br/>In the land of origin, there were 20 to 30 universes that had been destroyed by them.<br/><br/>Countless living creatures had died in their hands.<br/><br/>“Huh?”<br/><br/>At this moment, his gaze suddenly focused on three figures.<br/><br/>Looking at these three figures, Wang Xian’s gaze flickered slightly.<br/><br/>They were acquaintances!<br/><br/>However, this acquaintance was not a friend, but an enemy.<br/><br/>“Let’s go over and take a look.”<br/><br/>Wang Xian said faintly and flew toward the front of the evil sequence camp.<br/><br/>“Huh?”<br/><br/>When the powerhouses of the Dragon Palace Alliance saw this, they were slightly stunned and immediately followed behind.<br/><br/>“The Dragon Palace Alliance is heading towards us!”<br/><br/>“There’s a figure who appeared out of nowhere. I can’t sense his actual strength. Is it that Dragon King?”<br/><br/>“Yes, it’s that Dragon King. He’s blurry in my sight. Only experts of the primal chaos level can make me unable to see him clearly!”<br/><br/>“He’s just an existence who has just stepped into the primal chaos level. Even if we include the other experts of the Dragon Palace Alliance, we still have the upper hand in terms of strength!”<br/><br/>At the evil sequence camp, the eight Great Dao level existences saw Wang Xian and the rest arriving. Their eyes narrowed slightly as they spoke.<br/><br/>The other experts and disciples from the evil sequence camp also looked at the legendary level existence curiously.<br/><br/>They sized up the Dragon King from top to bottom.<br/><br/>Among them, heaven occupation spirit kneader and illusory realm frowned slightly.<br/><br/>After all, they had joined hands to attack the Dragon King back then. Furthermore, it was suspected that they had killed him once!<br/><br/>“Evil sequence faction!”<br/><br/>Wang Xian flew to a spot in front of them and looked at them indifferently. He glanced around and said.<br/><br/>“I believe this should be the leader of the Dragon Palace Alliance, Lord Dragon King, right? We are members of the Holy Faction.”<br/><br/>Among the eight Great Dao level powerhouses, the elder wearing a black bamboo hat looked at Wang Xian and said.<br/><br/>The powerhouses from the evil faction would naturally not call themselves evil.<br/><br/>In fact, they all claimed to be members of the Holy Faction.<br/><br/>“Yes, Hehe. I didn’t expect to meet an acquaintance here.”<br/><br/>Wang Xian smiled faintly. His gaze landed on the spiritual man, the illusory realm, and the heavenly vocation.<br/><br/>“Dragon King, it was just a small misunderstanding back then. Congratulations to Dragon King for breaking through to the chaos level!”<br/><br/>The spirit kneader’s expression changed slightly. He clenched his fists slightly and squeezed out a smile as he congratulated Wang Xian.<br/><br/>“The last time was also a blessing in disguise!”<br/><br/>Wang Xian nodded his head faintly and narrowed his eyes slightly. “Regardless, the three of you attacked me last time. We need an explanation for this matter.”<br/><br/>“HMM?”<br/><br/>When the spiritual kneader and the others heard Wang Xian’s words, their eyes narrowed and their expressions turned ugly.<br/><br/>However, they were not too fearful.<br/><br/>They had enough experts around them. Moreover, even if the three of them joined forces, they could still withstand a primal chaos level existence.<br/><br/>Moreover, this was a problem between two camps.<br/><br/>“This Dragon King wants to show us his might. Spirit kneader, this is your problem. You guys settle it.”<br/><br/>An expert at the Great Dao level looked at spirit kneader and the rest and said faintly.<br/><br/>“Dragon King.”<br/><br/>Spirit kneader nodded his head with a dark expression. He looked at Wang Xian and said, “It was you and the other experts who joined forces to kill me back then. Furthermore, Dragon King, you said that it’s a blessing in disguise. We will apologize to you.”<br/><br/>As the spirit kneader spoke, he bowed to the heaven occupation illusory realm beside him.<br/><br/>“Eh?”<br/><br/>At the back, the experts from the Dragon Palace Alliance saw that the three Great Dao level existences from the evil sequence faction actually had a conflict with the Dragon King. They were astonished.<br/><br/>However, when they saw the three Great Dao level existences from the evil sequence faction cupping their hands in apology, they were also astonished.<br/><br/>This was the might of a chaos-level force!<br/><br/>Even if the other party had more than 200 Tianyuan blessed realm existences, the Dragon King still had the absolute advantage in terms of momentum!\t\t\t\t\t\t</div>", "images": {}, "success": true}