{"id": 1456, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075621.html", "title": "Chapter 4459 - Chapter 4459: Out Of The 4,458 Champions, The Enemy’S Head Was Taken! Bingo", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4459 - Chapter 4459: Out Of The 4,458 Champions, The Enemy’S Head Was Taken! Bingo</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4459: Out of the 4,458 champions, the enemy’s head was taken! Bingo<br/><br/>“The evil sequence faction has met with the Dragon Palace Alliance. What are they trying to do? Can they start a fight?”<br/><br/>“The Dragon Palace Alliance has contacted the evil sequence faction. I wonder what they are trying to do? But the possibility of a fight is almost zero.”<br/><br/>“They should be negotiating in advance to remind the evil sequence faction.”<br/><br/>When the Dragon Palace Alliance meets with the evil alignment camp,.<br/><br/>The rear of the Guardian Alliance through the treasure to detect the situation in front, one by one open their mouths to discuss.<br/><br/>They stopped, too, and looked ahead.<br/><br/>“Isn’t it enough just to pay one?”<br/><br/>Wang Xian looked at the three of them, with their eyes shining with a cold luster, and asked coldly.<br/><br/>“Then…”<br/><br/>The expressions of Tian Ji and the rest of them changed slightly.<br/><br/>“Then what does the Dragon King want us to do?”<br/><br/>Tian Ji looked at Wang Xian. The antennae on his head were flickering continuously as he looked at Wang Xian in a deep voice.<br/><br/>“The Dragon King wants to show us his might.”<br/><br/>“It’s fine if he wants to show us his might, but it’s a little too much now. He’s actually being so aggressive towards the three of us.”<br/><br/>“This Dragon King is really arrogant. Does he really think that we are afraid of Him?”<br/><br/>Some of the Heavenly Yuan creator powerhouses behind the spiritual pinch man and the others stared at Wang Xian with displeasure and whispered.<br/><br/>They were the subordinates of the spiritual pinch man and the heavenly occupation realm. Naturally, they were displeased with such a powerful Dragon King.<br/><br/>“Dragon King, our brothers have apologized to you. We hope that you won’t mind this small misunderstanding. This time, we will enter the Deep Freeze universe and will definitely not harm any living beings in the deep freeze universe.”<br/><br/>“We, the holy faction, can guarantee this.”<br/><br/>Beside them, a great dao-level existence in the form of a demon spoke on behalf of the illusionary realm of the spiritual man.<br/><br/>“I have a solution!”<br/><br/>Wang Xian looked at them without any change in his expression.<br/><br/>However, in the next moment, Wang Xian’s figure disappeared.<br/><br/>He appeared directly at the side of the spiritual man.<br/><br/>Wang Xian stretched out his palm and pressed it directly on the spiritual kneader’s head.<br/><br/>The sudden attack surprised all the experts around.<br/><br/>Even the experts from the evil sequence faction or the Dragon Palace Alliance didn’t have any reaction.<br/><br/>“That’s death!”<br/><br/>“Bang!”<br/><br/>At this moment, Wang Xian’s palm pressed heavily on the spiritual kneader’s head.<br/><br/>An unparalleled strength surged directly into his body.<br/><br/>The spirit kneader’s eyes widened instantly. His pupils were filled with shock and disbelief.<br/><br/>He didn’t expect Wang Xian to dare to make a move.<br/><br/>He didn’t expect that he didn’t even have the time to react.<br/><br/>Boom<br/><br/>A terrifying force instantly extinguished his life force.<br/><br/>Wang Xian waved his arm and kept his corpse.<br/><br/>Wang Xian had already determined the death of the spirit kneader and the rest before he arrived.<br/><br/>When he stopped here, this distance was the distance he could attack from.<br/><br/>This was the instant he killed the spirit kneader.<br/><br/>“Dragon King of the Dragon Palace, you are making an enemy out of our holy faction!”<br/><br/>When the illusory realm saw this scene, his expression changed drastically. A terrifying position burst out from his body as he roared at Wang Xian!<br/><br/>“Boom! Boom! Boom! Boom!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>At the same time, the other six Great Dao experts also burst out with an extremely terrifying bloody aura.<br/><br/>“What? He actually dared to kill Lord Spirit Kneader?”<br/><br/>“Is this dragon king trying to make an enemy out of our holy faction?”<br/><br/>“Damn it, this dragon king is too arrogant!”<br/><br/>Behind them, a group of experts from the evil sequence faction also reacted. A powerful killing intent immediately burst out from their bodies!<br/><br/>“The price of attacking me back then was death. In the future, I will kill them every time I see them. Since your evil sequence faction is willing to stand up for them, they are your enemies!”<br/><br/>Wang Xian smiled coldly.<br/><br/>Buzz<br/><br/>In the next moment, Wang Xian moved again.<br/><br/>“Defense!”<br/><br/>This time, all the experts from the evil sequence faction were ready.<br/><br/>They let out a loud roar and covered themselves with layers of defense. At the same time, the defense also covered the bodies of the surrounding experts.<br/><br/>The defense stacked up!<br/><br/>All the experts instantly put up their defenses.<br/><br/>At the moment, Wang Xian was too close to them. They could only attack by defending first!<br/><br/>“This… Lord Dragon King actually attacked directly?”<br/><br/>“That evil sequence faction, an existence at the Great Dao level was actually killed by Lord Dragon King in an instant!”<br/><br/>At this moment, the experts from the Dragon Palace Alliance were also stunned.<br/><br/>It was too ferocious!<br/><br/>The Dragon King had just made his move and killed an existence at the Great Dao level in the evil sequence faction.<br/><br/>This was simply… too ferocious!<br/><br/>It was unbelievably ferocious!<br/><br/>“Huff! Huff!”<br/><br/>All the experts from the Dragon Palace Alliance were breathing rapidly.<br/><br/>The Dragon King was about to start a fight with all the experts from the evil sequence faction! Bang!<br/><br/>Bang<br/><br/>At this moment, they saw Wang Xian’s figure appearing in front of another great dao powerhouse from the evil sequence faction!<br/><br/>This time, the Great Dao powerhouse was prepared and had set up a strong defense around him.<br/><br/>However, they saw Wang Xian’s palm penetrating through their stacked defense.<br/><br/>This time, the defense was like thin glass that was easily shattered.<br/><br/>The Dragon King’s palm had penetrated his chest directly!<br/><br/>“How is this possible?”<br/><br/>The illusory realm widened its eyes and stared at Wang Xian in shock.<br/><br/>It looked at Wang Xian’s palm that had penetrated his body.<br/><br/>Just now, the Seven Great Dao level experts had attacked in an instant and stacked their defenses.<br/><br/>This momentary defense, though not their strongest defense.<br/><br/>But it’s still a seven-way defense!<br/><br/>And yet, it’s penetrated!<br/><br/>If it is a just stepped into the level of chaos of existence, absolutely can not break their defense!<br/><br/>This Dragon King is much more powerful than they ever imagined!<br/><br/>“Boom!”<br/><br/>“Nothing is impossible!”<br/><br/>The powerful chaotic force confined the illusory realm and obliterated its vitality!<br/><br/>“Buzz!”<br/><br/>With a move of his palm, he kept the corpse into the space.<br/><br/>“All of you, Scram. None of you can stop the person I want to kill!”<br/><br/>After Wang Xian kept the corpse of the illusory realm.<br/><br/>Wang Xian’s entire body trembled. An extremely terrifying aura surged out in all directions.<br/><br/>The terrifying pressure caused the faces of the other six Great Dao realm experts who were closest to him to turn pale instantly.<br/><br/>“This aura?”<br/><br/>Their pupils contracted slightly as they were filled with disbelief.<br/><br/>“How is this possible? How can this Dragon King be so strong? Didn’t he just step into the Chaos Realm?”<br/><br/>The blood-red pupils of the elder wearing the bamboo hat emitted a radiance as he exclaimed in shock!<br/><br/>“Retreat, block with all your might!”<br/><br/>“All experts, Attack! Stack your defenses, pull apart the distance, kill!”<br/><br/>The expression of a great dao expert changed drastically as he roared!<br/><br/>“Boom! Boom!”<br/><br/>“Boom! Boom!”<br/><br/>At this moment, over 200 heaven origin creation realm experts from the evil sequence faction all moved!\t\t\t\t\t\t</div>", "images": {}, "success": true}