{"id": 1450, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075591.html", "title": "Chapter 4453 - Chapter 4453: 4452 Asked For Help From The Dragon Palace Alliance", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4453 - Chapter 4453: 4452 Asked For Help From The Dragon Palace Alliance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4453: 4452 asked for help from the Dragon Palace Alliance<br/><br/>The powerhouses of the Guardian Alliance knew that it would be difficult for them to kill a group of heavenly fate realm powerhouses.<br/><br/>Therefore, their target was a group of Legion disciples.<br/><br/>As long as they killed their legion disciples, the powerhouses of the evil sequence faction would naturally retreat.<br/><br/>And this move was indeed effective.<br/><br/>When the powerhouses of the Guardian Alliance attacked,.<br/><br/>The experts of the evil sequence faction immediately sensed it.<br/><br/>Especially the eight Great Dao existences.<br/><br/>“There’s an attack on the right!”<br/><br/>They immediately shouted.<br/><br/>All the experts immediately attacked the right.<br/><br/>“Boom!”<br/><br/>However, in that instant, an overwhelming attack attacked the disciples of the evil sequence faction.<br/><br/>The terrifying attack caused the faces of the disciples on the right to instantly turn pale.<br/><br/>Some of the powerhouses even trembled. They didn’t even have the will to fight back and were trembling.<br/><br/>“Defend!”<br/><br/>Tian dui shouted in a low voice, and a surge of energy enveloped the area in front of all the disciples on the right.<br/><br/>A few other Great Dao powerhouses also immediately reacted.<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>However, facing the sudden attack of the Guardian League, some of the evil sequence experts didn’t react in time.<br/><br/>They didn’t defend the Legion’s Disciples in time.<br/><br/>In fact, some of the evil sequence experts didn’t care about the lives of the Legion’s disciples at all.<br/><br/>This was especially so for the Legion’s disciples, who weren’t even their own legions.<br/><br/>The terrifying attacks broke through the defenses of the experts from the heavenly vocation faction.<br/><br/>Some of the attacks landed on some of the disciples of the evil sequence faction.<br/><br/>“Ahhhh!”<br/><br/>“Ahhhh!”<br/><br/>Miserable screams instantly sounded out. In an instant, hundreds of thousands of evil sequence faction disciples at the ruler realm were killed.<br/><br/>“Kill them, you reckless bastards! How dare you attack our disciples? You’re courting death!”<br/><br/>A Great Dao warrior glared at all the Great Beings of the Guardian Alliance and roared with killing intent.<br/><br/>“Kill!”<br/><br/>“Kill!”<br/><br/>All the other great beings of the evil sequence faction immediately charged toward the Great Beings of the Guardian Alliance.<br/><br/>“You Bunch of shameless bastards, using such a despicable excuse to attack our star universe, I’ll make you pay!”<br/><br/>“Evil sequence faction, you’re going to make an enemy out of our Guardian Alliance.”<br/><br/>The Great Beings of the Star Universe, the Alliance Master of the Guardian Alliance, and the others shouted angrily.<br/><br/>They looked at the more than 200 heaven origin creation great beings charging at them, and without the slightest hesitation, they directly dodged into the distance.<br/><br/>Avoiding battle.<br/><br/>They knew that they were completely no match for the other party.<br/><br/>Therefore, when their opponents charged at them, they immediately dodged.<br/><br/>They immediately fled.<br/><br/>They wanted to engage in guerrilla warfare with their opponents.<br/><br/>“Huh? These guys actually fled?”<br/><br/>“Are they planning to ambush us from time to time?”<br/><br/>The evil sequence faction powerhouses frowned slightly when they saw the Guardian Alliance’s powerhouses fleeing.<br/><br/>The other party wasn’t fighting them, instead, it was guerrilla warfare. This wasn’t good news for them.<br/><br/>However, if the Guardian Alliance ran away, it would be hard for them to catch up.<br/><br/>A simple collision. Although there wasn’t an earth-shattering battle, this also meant that the battle between the Guardian Alliance and the evil sequence faction had officially begun.<br/><br/>“Have you heard? The Guardian Alliance and the evil sequence faction are fighting.”<br/><br/>“They are indeed fighting. There’s no information about the Tianyuan Destiny Treasure in the star system universe. This is a conspiracy of the evil sequence faction.”<br/><br/>“They are really fighting. The evil sequence faction’s ambition is too great!”<br/><br/>“We are shivering. Fortunately, we joined the Dragon Palace Alliance. Our Dragon Palace Alliance’s faction is still very powerful.”<br/><br/>The battle between the Guardian Alliance and the evil sequence faction had officially begun.<br/><br/>As time passed, the news also spread to the Dragon Palace Alliance.<br/><br/>This shocked many experts.<br/><br/>For the next ten thousand years, The Guardian Alliance and the evil sequence faction engaged in guerrilla warfare.<br/><br/>The Guardian Alliance took advantage of the terrain and constantly launched sneak attacks.<br/><br/>However, with the first attack, the evil sequence faction was also prepared.<br/><br/>In the next few sneak attacks, the Guardian Alliance didn’t achieve much.<br/><br/>However, they also killed many disciples of the evil sequence faction.<br/><br/>While the Guardian Alliance continued to attack, the champions and legions of the evil sequence faction were also slaughtering the creatures of the asterisk universe.<br/><br/>This caused the entire asterisk universe to be in chaos.<br/><br/>It was also because of the Guardian Alliance’s continuous attacks that the evil sequence faction’s champions and legions were inseparable.<br/><br/>This also caused the evil sequence faction’s invasion of the asterisk universe to be very slow.<br/><br/>It was ten times longer than the previous invasion of the universe.<br/><br/>However, the evil sequence faction did not give up.<br/><br/>Time passed day by day, and in the blink of an eye, 50,000 years had passed.<br/><br/>When the Guardian Alliance launched their ninth attack, an accident happened, and they were ambushed by the experts of the evil sequence faction.<br/><br/>A great battle broke out.<br/><br/>In this battle, The Guardian Alliance killed 13 heaven origin blessed realm experts.<br/><br/>In the end, some of the other heaven origin blessed realm experts managed to escape.<br/><br/>“The continuous attacks made the evil sequence faction prepare and set up a trap. Damn it, we lost 13 heaven origin blessed realm experts this time. Even if we can revive, it’s still a huge loss for us!”<br/><br/>After all the Great Beings of the Guardian Alliance escaped, they came to a starry sky in the star system universe.<br/><br/>Alliance master he glanced at all the great beings with an embarrassed expression and said, “It’s a trap!”.<br/><br/>All the other great beings had ugly expressions.<br/><br/>There was no such thing as walking by the river without getting wet.<br/><br/>They had continuously attacked the evil sequence camp’s legion, but the Great Beings of the evil sequence camp were not fools.<br/><br/>While they attacked, the other side was also hunting them.<br/><br/>And this time, they fell into the other side’s trap.<br/><br/>The other side could make many mistakes, but if they made one mistake, they would have to pay with the lives of thirteen heaven origin creation realm powerhouses.<br/><br/>This was a huge loss for them.<br/><br/>“Alliance leader, what can we do? We Can’t give up. Once we stop, what awaits our universe will be a catastrophe.”<br/><br/>A powerhouse said with an ugly expression.<br/><br/>They couldn’t stop.<br/><br/>However, during the attack, there was a huge danger.<br/><br/>It was a dilemma!<br/><br/>Alliance leader he was silent when he heard the members’words.<br/><br/>“To be honest, with our strength, unless the powerhouses of the evil sequence camp make a mistake, we can only delay their time to destroy us.”<br/><br/>One of the experts said in a pessimistic tone.<br/><br/>“Then what can we do now?”<br/><br/>“It’s very difficult for us to stop them. Can we find other helpers? Can we find help? Can the Justice Alliance do it?”<br/><br/>“The Justice Alliance is too far away from us. It’ll take us hundreds of thousands of years just to fly there. Moreover, Will the Justice Alliance come to help us?”<br/><br/>“What about the Dragon Palace League?”\t\t\t\t\t\t</div>", "images": {}, "success": true}