{"id": 1451, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075596.html", "title": "Chapter 4454 - Chapter 4454: 4,453 Chaos-Level Experts", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4454 - Chapter 4454: 4,453 Chaos-Level Experts</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4454: 4,453 chaos-level experts<br/><br/>“Dragon Palace Alliance?”<br/><br/>When one expert mentioned the Dragon Palace Alliance, many people fell silent.<br/><br/>Their eyes twinkled or they frowned.<br/><br/>“Alliance leader, can we ask the Dragon Palace Alliance for help?”<br/><br/>That expert looked at the four alliance leaders and couldn’t help but ask again.<br/><br/>At this moment, only the Dragon Palace Alliance could help them.<br/><br/>At this moment, some universe experts even felt regretful.<br/><br/>They regretted not joining the Dragon Palace Alliance back then?<br/><br/>With the strength of the Dragon Palace Alliance, how could the evil sequence alignment dare to attack them?<br/><br/>“Dragon Palace Alliance? I’m afraid we’ll have to pay a huge price to get their support.”<br/><br/>Alliance master he said.<br/><br/>Since the Dragon Palace Alliance was founded, they had to pay a price to join the Dragon Palace Alliance.<br/><br/>This price was not small.<br/><br/>It might not be so easy to get the Dragon Palace’s support now.<br/><br/>“If Our Guardian Alliance is really defeated, it won’t be of much benefit to the Dragon Palace Alliance. Let’s ask that Dragon King and see if they agree.”<br/><br/>A Deputy Alliance master hesitated for a moment and said.<br/><br/>The evil sequence camp’s ambition was too great.<br/><br/>“I think we can ask. If an existence as strong as the Justice Alliance dares to invade the evil sequence faction, the Dragon Palace Alliance is far inferior to the Justice Alliance. That Dragon King should know that once our guardian alliance is destroyed, the evil sequence faction really might invade the Dragon Palace Alliance.”<br/><br/>Another vice alliance leader nodded.<br/><br/>“Alright, I’ll contact the Dragon Palace Alliance to see if they are willing to provide assistance.”<br/><br/>Chief he nodded his head as well.<br/><br/>At the moment, seeking help from the Dragon Palace alliance was their only choice.<br/><br/>“HMM? The Guardian Alliance wants to seek our assistance?”<br/><br/>Not long after, Prime Minister Gui arrived in the Dragon Palace.<br/><br/>Wang Xian was astonished when he heard Prime Minister Gui’s report.<br/><br/>The Guardian Alliance was actually asking for their help and support.<br/><br/>“Yes, Dragon King. However, once we lend a hand, it would be equivalent to making an enemy out of the evil sequence faction.”<br/><br/>Prime Minister Gui reminded him.<br/><br/>“Okay.”<br/><br/>Wang Xian nodded. Naturally, he knew about it. He hesitated for a moment, “Tell them that if they want our support, a universe would need to take out a large amount of resources. The amount of resources would be 1.5 times the price of joining the Dragon Palace Alliance.”<br/><br/>“Alright, Dragon King.”<br/><br/>Prime Minister Gui nodded slightly when he heard that.<br/><br/>If he wanted the Dragon Palace Alliance to help, he could pay the price.<br/><br/>This price was much higher than the price of joining the Dragon Palace Alliance.<br/><br/>After all, once he made a move, it would be equivalent to making an enemy out of the evil sequence alignment camp.<br/><br/>Wang Xian had almost absorbed all of the origin stones.<br/><br/>If the Guardian Alliance really took out enough treasures and resources, Wang Xian wouldn’t be afraid of offending the evil sequence alignment camp.<br/><br/>After Prime Minister Gui left, he immediately passed this message to Alliance leader he and the rest.<br/><br/>In a corner of the star universe, the powerhouses of the Guardian Alliance gathered together.<br/><br/>At this moment, Alliance Leader he received Prime Minister Gui’s message. After reading the contents, his expression turned ugly.<br/><br/>“This Dragon King is really asking for too much.”<br/><br/>Alliance master he couldn’t help but say.<br/><br/>“Huh? What? That Dragon King replied?”<br/><br/>All the experts in the surrounding area heard alliance master he’s words, and their expressions changed slightly. They immediately looked over.<br/><br/>“He wants us to take out a large amount of resources before he agrees, and these resources are equivalent to 1.5 times the resources of the Dragon Palace Alliance.”<br/><br/>Alliance master he looked at them and said with a dark expression.<br/><br/>The price was too high.<br/><br/>They didn’t join the Dragon Palace Alliance because they wanted to give the dragon palace a lot of resources.<br/><br/>These resources were extremely precious to them.<br/><br/>However, the price they had to pay to ask for the Dragon Palace Alliance’s support was even higher.<br/><br/>“1.5 times the amount of resources is indeed too much.”<br/><br/>A few Vice Alliance Masters said with an embarrassed expression.<br/><br/>This was hard for them to accept.<br/><br/>“Why don’t we take out so many resources to fight against the evil sequence faction? We are willing to sacrifice so many resources. The evil sequence faction is about to be injured by us.”<br/><br/>“In my opinion, if we take out so many resources to the Dragon Palace Alliance, we might as well kill our way out of the Guardian Alliance and let all the forces see our boldness and strength.”<br/><br/>A powerhouse said with a cold face.<br/><br/>“This Dragon King is taking advantage of the situation. Brother Hao is right. We have given so many resources, which is enough to make the evil sequence faction pay a huge price. At that time, they will also retreat.”<br/><br/>Another powerhouse echoed.<br/><br/>“In that case, we will continue to fight against the evil sequence faction. This time, I hope that everyone will show no mercy and show some of their trump cards.”<br/><br/>Alliance master he’s gaze focused as he spoke heavily.<br/><br/>The rest of the experts immediately agreed.<br/><br/>Since their request for reinforcements had failed, they began to continue their battle with the evil sequence faction.<br/><br/>Following that, the battle between the Guardian Alliance and the evil sequence faction escalated.<br/><br/>This also greatly hindered the speed of the evil sequence faction’s attack.<br/><br/>Both sides gradually began to fight furiously.<br/><br/>There were also powerhouses in the evil sequence faction who were in the Heaven’s origin realm. After being successfully attacked by the Guardian Alliance, they were killed immediately.<br/><br/>Tens of thousands of years passed once again.<br/><br/>Wang Xian did not pay attention to the war between them. Instead, he focused on absorbing the stone of origin.<br/><br/>On this day, after the last stone of origin was absorbed, the fusion rate between Wang Xian and the primal chaos stone reached 52% .<br/><br/>The fusion rate of 52% allowed his strength to reach the level of two primal chaos levels.<br/><br/>Of course, this included all external forces.<br/><br/>However, with the power of primal chaos, he could transform it into divination and dark energy. Wang Xian’s combat strength and escape ability were definitely stronger than the two ordinary primal chaos level existences.<br/><br/>The power of primal chaos that could transform into various attributes was too strong.<br/><br/>“Phew!”<br/><br/>Feeling his own strength, Wang Xian revealed a faint smile.<br/><br/>The current him was already very powerful and terrifying.<br/><br/>When he encountered that chaos-level chaos behemoth, the eye of the Void, Wang Xian was confident that he could suppress it in all aspects, even if it was within its domain.<br/><br/>“Let’s do a divination and see the current situation of the Guardian Alliance and the evil sequence faction!”<br/><br/>Wang Xian mumbled to himself. He took out the lamp of divination and tried to divine the current situation.<br/><br/>It was extremely difficult for Wang Xian to divine the battle between two powerful forces.<br/><br/>In fact, he could only divine some bits and pieces of information.<br/><br/>“It’s a 70-30 split. It’s still in a stalemate. The Guardian Alliance is very determined. It Won’t be easy for the evil sequence camp to take down the Guardian Alliance.”<br/><br/>Wang Xian thought to himself based on the information he divined.<br/><br/>I should continue to head down to the land of origin and continue to search for the Stone of origin<br/><br/>Wang Xian took a brief look at the situation before teleporting down to the land of origin.\t\t\t\t\t\t</div>", "images": {}, "success": true}