{"id": 1458, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075631.html", "title": "Chapter 4461 - Chapter 4461: With 4460’S Words, The Evil Sequence Faction Retreated", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4461 - Chapter 4461: With 4460’S Words, The Evil Sequence Faction Retreated</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4461: With 4460’s words, the evil sequence faction retreated<br/><br/>“Damn it, what should we do now?”<br/><br/>At this moment, the experts of the evil sequence faction were also a little dumbfounded.<br/><br/>The spirit kneader, the illusionary realm, and the heavenly vocation were all killed by the Dragon King.<br/><br/>Now that the Dragon King had flown to the side, what should they do now?<br/><br/>Fight directly?<br/><br/>With the strength that the Dragon King had just displayed and the subordinates behind him, if they really fought,.<br/><br/>They’re definitely at a 100% disadvantage.<br/><br/>Even with the Dragon King’s strength, it would not be a problem to wipe out the remaining five dao-level existences.<br/><br/>As for their legions, they’re 100% dead.<br/><br/>The strength of the Dragon King is too strong!<br/><br/>Strong enough to make them wonder.<br/><br/>It would be a shame if we just let it go!<br/><br/>But so be it…<br/><br/>“We can’t fight with the Dragon King. Not to mention his terrifying strength, the Dragon Palace Alliance is not weak. In addition, we still have those guys from the Guardian alliance behind us.”<br/><br/>The old man with the bamboo hat said with a gloomy face, “The illusionary realm of the spiritual man and the heaven’s duty have a grudge against the Dragon King. The Dragon King is too strong. We have no grudge with the Dragon King, so there’s no need to fight!”<br/><br/>“His strength is definitely not at the ordinary level of chaos. Although we haven’t seen the Lords of our camp fight with their full strength, from the attack of a Lord not long ago, he should not be as powerful as the Dragon King.”<br/><br/>Another powerhouse at the level of Great Dao said.<br/><br/>“Damn it. I don’t know why the spirit kneader and the others provoked the Dragon King. Now, the heavenly vocation of the illusionary realm of the spirit kneader and the others absolutely can not come to this universe. We have five powerhouses at the level of Great Dao now, but there are four at the rear of the Guardian Alliance. If they sneak attack us again, I’m afraid we will suffer losses. It Won’t be as easy as before.”<br/><br/>Several experts of the Great Dao level discussed telepathically.<br/><br/>They had the same idea and could not possibly fight with the Dragon King.<br/><br/>Fighting was simply asking for a fight.<br/><br/>Although the number of Heavenly Yuan creation realm experts on their side was twice that of the Dragon King’s side.<br/><br/>But the strength that the Dragon King had just displayed made their hearts palpitate.<br/><br/>If they really fought, the Dragon King could easily attack them one by one.<br/><br/>It wouldn’t be a problem to kill dozens of them.<br/><br/>“Dragon King, our holy camp doesn’t want to be enemies with you. Don’t force us, Dragon King!”<br/><br/>The cloaked elder took a deep breath and said in a deep voice!<br/><br/>“Hehe, I don’t want to be enemies with your camp either, but the three of them have a grudge against me. If you have no grudge against me, I won’t do anything.”<br/><br/>“All of you can leave now. As long as you don’t step into the universe of the Dragon Palace Alliance, we won’t interfere with each other!”<br/><br/>Wang Xian said faintly to them.<br/><br/>However, his words were still full of force.<br/><br/>He wanted them to leave this place directly.<br/><br/>This also meant that they were prohibited from stepping into the deep cold universe.<br/><br/>Powerful.<br/><br/>Very powerful.<br/><br/>When all the powerhouses from the evil sequence camp heard this, a hint of anger appeared on their faces.<br/><br/>“Let’s go back. There’s no need to fight for this Tianyuan destiny-level treasure anymore. The opponent has a prophet at the level of the three Great Dao in the universe and a dragon king at the level of chaos. Our chances of success are very, very low if we don’t have a vocation.”<br/><br/>“In addition, we have to be on guard against the powerhouses of the Guardian Alliance at all times. It will be more troublesome if we face The Guardian Alliance after losing three Great Dao powerhouses.”<br/><br/>A Great Dao level powerhouse made a decision through voice transmission.<br/><br/>The other four great dao level powerhouses could only nod their heads with an awkward expression.<br/><br/>There was nothing they could do.<br/><br/>The Dragon King would be courting death if he did not allow them to enter.<br/><br/>Moreover, even if they were allowed to enter now, they would have to think twice about it!<br/><br/>“Dragon King, my holy camp does not interfere with your matters. I hope that you can do the same. Goodbye!”<br/><br/>The Five Great Dao level powerhouses looked at Wang Xian and said solemnly.<br/><br/>“Hehe, don’t worry!”<br/><br/>Wang Xian looked at them and smiled faintly.<br/><br/>“Let’s go.”<br/><br/>The Five Great Dao level powerhouses had a gloomy look on their faces as they spoke to all the powerhouses. Then, they turned around and left.<br/><br/>The rest of the powerhouses from the evil sequence faction followed behind them with unpleasant expressions.<br/><br/>They took a deep look at the Dragon King and imprinted it into their minds.<br/><br/>This was an existence that could not be provoked.<br/><br/>“The evil sequence faction actually left. Just because of a single word from the Dragon King, they did not dare to enter the Deep Freeze Universe to search for the Heavenly Fate Supreme Treasure!”<br/><br/>At the back, all the experts from the Guardian Alliance saw this scene and were somewhat shocked!<br/><br/>“This Dragon King’s deterrence is too terrifying!”<br/><br/>One of the experts said with his mouth wide open.<br/><br/>“It’s because the strength that the Dragon King displayed just now was too strong. He killed three Great Dao existences among more than two hundred experts. The Dragon King’s strength is much, much stronger than ordinary chaos-level experts!”<br/><br/>They were shocked as they looked at the experts of the evil sequence faction who had left.<br/><br/>Then, they looked at the Handsome Dragon King who was floating in the air with respect in their eyes.<br/><br/>This was respect for experts!<br/><br/>“The Dragon King is so strong. Why don’t… Why don’t we just join the Dragon Palace Alliance? It’s totally worth it to pay a price!”<br/><br/>One of the experts couldn’t help but say.<br/><br/>His words made the surrounding experts silent.<br/><br/>Even the four alliance masters at the front opened their mouths but didn’t say anything.<br/><br/>The main thing was that the Dragon King was really too strong.<br/><br/>They were sure that the Dragon King could easily kill the four of them.<br/><br/>Just now, even seven or eight great dao experts hadn’t been able to stop the Dragon King.<br/><br/>If the Dragon King wanted to kill the four of them, he could definitely do it easily!<br/><br/>Joining the Dragon King might be a good idea.<br/><br/>“Divining the universe and joining the Dragon Palace Alliance might have their reasons!”<br/><br/>Another powerhouse spoke again.<br/><br/>A seed of joining the Dragon Palace Alliance was growing in their hearts.<br/><br/>“Dragon King, you are simply too strong!”<br/><br/>Over at the Dragon Palace Alliance, the three Great Prophets, Jiu Yuan, and the other four great dao level powerhouses were also looking at Wang Xian in shock. Their eyes were filled with respect.<br/><br/>The Dragon King was even stronger than they had imagined!<br/><br/>He was unafraid of the evil sequence’s 200 plus heaven origin creation level powerhouses alone.<br/><br/>He even made the evil sequence’s camp not dare to step into the deep cold universe with a single sentence.<br/><br/>This? ?<br/><br/>“Dragon King is awesome. The Dragon King is invincible. Awesome, too awesome!”<br/><br/>“Hahaha, with the Dragon King around, who would dare to Bully Our Dragon Palace Alliance?”<br/><br/>“That’s right, the Dragon King’s words just now almost scared the experts of the evil sequence faction to death. Now, he just left like that. It’s so awesome!”<br/><br/>The other experts of the Dragon Palace Alliance were all excited!<br/><br/>They felt proud and safe to join the Dragon Palace Alliance.<br/><br/>With such a powerful leader here, who would dare to bully them?<br/><br/>No one!<br/><br/>Dragon King Leader, Oh my God! !\t\t\t\t\t\t</div>", "images": {}, "success": true}