{"id": 1454, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075611.html", "title": "Chapter 4457 - Chapter 4457: 4,456, The Three Major Factions Had Gathered", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4457 - Chapter 4457: 4,456, The Three Major Factions Had Gathered</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4457: 4,456, the three major factions had gathered<br/><br/>“HMM? is the announcement from the evil sequence faction true? Is there a heavenly fate treasure in the Deep Frost Universe?”<br/><br/>“What? is the Deep Frost Universe Our Universe? I didn’t even know that our universe had a heavenly fate treasure?”<br/><br/>“It should be true. Otherwise, the powerhouses from the evil sequence faction wouldn’t have declared that they wouldn’t slaughter any living beings. They are currently fighting against the Guardian Alliance. At this time, provoking the Dragon Palace Alliance isn’t a wise choice. The deep frost universe might really have a heavenly fate treasure!”<br/><br/>In the Dragon Palace Alliance, when the experts heard the news, their faces were filled with shock.<br/><br/>It was the ultimate treasure of Tianyuan!<br/><br/>“Huh?”<br/><br/>Soon, Prime Minister Gui received the news as well.<br/><br/>He even received confirmation from prophet Hong.<br/><br/>“The birth of the ultimate treasure of Tianyuan must be reported to the Dragon King immediately!”<br/><br/>The Ultimate Treasure of Tianyuan was an extremely precious treasure.<br/><br/>Prime Minister Gui did not hesitate and sent the news to Wang Xian.<br/><br/>When Wang Xian received the news, he revealed a surprised expression.<br/><br/>He was currently at the bottom of the land of origin. This time around, his luck was not very good. He only managed to obtain two pieces of origin stones.<br/><br/>Now that he received Prime Minister Gui’s message, he immediately took out his communication stone plate to check.<br/><br/>When he saw the evil sequence faction’s announcement, his eyes flickered slightly.<br/><br/>Following that, Wang Xian took out his lamp of divination and immediately began to perform divination.<br/><br/>“This? The deep frost universe is really about to give birth to a heaven origin Destiny Treasure!”<br/><br/>Wang Xian’s gaze focused slightly as his eyes shone brightly.<br/><br/>It was the ultimate treasure of the Heaven’s origin creation!<br/><br/>It was definitely an ultimate treasure.<br/><br/>In the past, the Divine Dragon Clan and the insect clan of the nine-origin universe had perished together for the ultimate treasure of the Heaven’s origin creation!<br/><br/>Now that it was an ultimate treasure of the Heaven’s origin creation, Wang Xian was naturally filled with interest.<br/><br/>“Once I obtain it and give it to the powerhouses of the Dragon Palace, it will be able to give a control-level powerhouse an existence that is equivalent to two control-level existences. It is definitely an ultimate strategic treasure!”<br/><br/>Wang Xian spoke.<br/><br/>His body moved. Using dark intense’s ability, he instantly arrived in the deep frost universe.<br/><br/>It could be said that Wang Xian was the first expert to arrive in the deep frost universe.<br/><br/>Even the two heaven origin creator-level experts in the deep frost universe only flew over after they received the news.<br/><br/>With their speed, they would only need a few thousand years!<br/><br/>Wang Xian hovered above the deep frost universe. He took out the divination lamp and continued his divination.<br/><br/>Buzz Buzz<br/><br/>Buzz Buzz<br/><br/>One by one, information appeared under the light of the divination lamp.<br/><br/>“It hasn’t been completely born yet. This ultimate treasure of the Heaven’s origin creation belongs to concealment. Currently, it can only be divined and will appear at the center of the Deep Frost Universe.”<br/><br/>“The area of the center is very large. Before this ultimate treasure of Tianyuan is completely born, it will be difficult for me to divine it accurately!”<br/><br/>Wang Xian mumbled.<br/><br/>Although it hadn’t been completely born yet, Wang Xian could make some preparations.<br/><br/>For example, there was a large number of devil spirit altars in the center of the Deep Frost Universe.<br/><br/>When the ultimate treasure of Tianyuan was born, Wang Xian would be able to rush over immediately.<br/><br/>With this thought in mind, he immediately made up his mind and flew toward the center of the Deep Frost Universe.<br/><br/>Stepping into the center, Wang Xian began to set up devil spirit altars.<br/><br/>He set up devil spirit altars one after another in various regions.<br/><br/>“Dragon King, most of the powerhouses of our Dragon Palace Alliance are rushing to the deep frost universe. The three great prophets are also heading there.”<br/><br/>“According to the information we have received, the powerhouses and legions of the evil sequence camp will be able to reach the Deep Freeze universe in two thousand years. Should we make some preparations? Although the evil sequence camp has already made a statement in advance, they can’t be trusted.”<br/><br/>While Wang Xian was setting up the Devil Spirit Altar, Prime Minister Gui sent messages one after another and reported to him.<br/><br/>“The Ultimate Treasure of the Heaven’s origin is for those who are fated to obtain it. As for the evil sequence camp, you don’t have to worry about it.”<br/><br/>Wang Xian pondered for a moment and instructed Prime Minister Gui.<br/><br/>He was confident that he would be able to locate and obtain the ultimate treasure of the Heaven’s origin as soon as it was born.<br/><br/>As for the evil sequence camp, Wang Xian didn’t say anything.<br/><br/>Taking advantage of this opportunity, he could take a look at the power of the evil sequence camp in the land of origin.<br/><br/>In addition, the evil sequence faction had stated in advance that they would not harm any living beings.<br/><br/>There was no need for the Dragon Palace alliance to shed all pretense of cordiality with them.<br/><br/>Of course, if they really dared to harm the living beings in the Deep Freeze universe, it would be hard to say!<br/><br/>Time passed day by day. Wang Xian was making preparations in the Deep Freeze universe.<br/><br/>In the land of origin, experts from all directions were rushing toward the Deep Freeze universe.<br/><br/>“I heard from Prime Minister Gui that the Deep Freeze universe is a heavenly fate treasure. The Dragon King said that those who are fated will stay there.”<br/><br/>“The heavenly fate treasure, we must try our luck. What if it’s Mine?”<br/><br/>“The Deep Freeze universe is a member of our Dragon Palace Alliance. We are looking for the heavenly fate treasure in the Deep Freeze universe. The experts from other universes and even the evil sequence alignment camps don’t dare to hurt us. We must try our luck!”<br/><br/>“Indeed, the fated ones live there. Mu Litianci, the foster son of the Dragon King, is like the son of the Heavenly Yuan Destiny Treasure in the universe. This is a great opportunity!”<br/><br/>In a place in the chaos, the powerhouses of the Dragon Palace Alliance were talking expectantly as they flew.<br/><br/>The powerhouses of the Dragon Palace alliance had come here together.<br/><br/>They included Prime Minister Gui, the three prophets, the experts of the nine Elemental Great Dao, and the other members.<br/><br/>As time passed, they were getting closer and closer to the Deep Freeze universe.<br/><br/>At the same time, the experts of the evil sequence faction, the Legion, and the experts of the Guardian Alliance were also getting closer to the Deep Freeze universe.<br/><br/>Several hundred heavenly fate realm experts had gathered.<br/><br/>The Guardian Alliance was located on the side of the evil sequence faction, in a relatively close and relatively safe place.<br/><br/>They would launch a sneak attack on the evil sequence faction at any time.<br/><br/>The powerhouses of the three major factions had gathered in the deep frost universe due to the birth of a heavenly fate treasure!<br/><br/>“Eh?”<br/><br/>However, Prime Minister Turtle and the others, as well as the powerhouses of the evil sequence faction, felt that it was a coincidence.<br/><br/>Before they got close to the deep frost universe, the two sides had sensed each other’s existence in the chaos.<br/><br/>“What a coincidence!”<br/><br/>Prime Minister Turtle looked to the right, where the experts and legions of the evil sequence faction were.<br/><br/>“It’s a coincidence!”<br/><br/>The three prophets looked over, divined, and said!<br/><br/>“The evil sequence faction is really powerful. With such terrifying power, even from such a far distance, we can feel the thick aura of death on their bodies.”<br/><br/>“This evil sequence army is also very powerful. The bloody aura on their bodies is too thick. These bloodthirsty fellows have killed countless creatures!”<br/><br/>Some experts from the Dragon Palace Alliance looked over and whispered.\t\t\t\t\t\t</div>", "images": {}, "success": true}