{"id": 1459, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075636.html", "title": "Chapter 4462 - Chapter 4462: The 4461 Guardian Alliance Was About To Join The Dragon Palace Alliance", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4462 - Chapter 4462: The 4461 Guardian Alliance Was About To Join The Dragon Palace Alliance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4462: The 4461 Guardian Alliance was about to join the Dragon Palace Alliance<br/><br/>Wang Xian looked at the group of experts from the Dragon Palace Alliance who were looking at him with fervent eyes and smiled faintly.<br/><br/>“Go in. The Ultimate Treasure of Tianyuan is about to be born soon.”<br/><br/>He spoke to all the experts indifferently!<br/><br/>“Yes!”<br/><br/>The group of experts from the Dragon Palace Alliance replied immediately.<br/><br/>Wang Xian moved his body and disappeared instantly!<br/><br/>The Ultimate Treasure of the Heaven’s origin was indeed about to be born.<br/><br/>According to his divination, it would be born completely in another three hundred years.<br/><br/>Wang Xian left and came directly to the center of the Deep Cold Universe.<br/><br/>“The Dragon King is so powerful. If the Dragon King is also here to look for the ultimate treasure of the Heaven’s origin, how are we going to compete with him?”<br/><br/>“That’s true. Prime Minister Gui, how powerful is our Lord Dragon King Now? The Dragon King is definitely not an ordinary chaos-level powerhouse, right?”<br/><br/>“Logically speaking, six to seven great dao-level powerhouses are defending against the evil sequence faction at the same time. Even if it’s not their strongest defense, an ordinary chaos-level powerhouse shouldn’t be able to break through it so easily, right?”<br/><br/>When the powerhouses saw Wang Xian leave, they couldn’t help but ask Prime Minister Gui.<br/><br/>“I don’t know how strong the Dragon King is now!”<br/><br/>Prime Minister Gui looked at them and shook his head. “With our Dragon King’s character, if you guys join our Dragon Palace Alliance, our Dragon King will protect you. Don’t worry.”<br/><br/>“We will naturally believe you, Dragon King. But this time, I’m afraid this Tianyuan Destiny Treasure will belong to you, Dragon King!”<br/><br/>“You just said that the Tianyuan Destiny Treasure is about to be born. I guess you already know the place where the Tianyuan Destiny Treasure is born. We are probably just here to join in the fun!”<br/><br/>The group of experts said.<br/><br/>After witnessing the Dragon King’s strength, they had no confidence in the fight for the Heavenly Yuan Destiny Supreme Treasure.<br/><br/>Even the three great prophets felt that the Dragon King was somewhat unfathomable!<br/><br/>“This Dragon King of the Dragon Palace doesn’t put us in his eyes at all.”<br/><br/>At the same time, in the chaos in front of the Deep Cold Universe, a group of experts from the evil array faction flew into the distance with extremely ugly expressions.<br/><br/>A few great dao level experts said unwillingly.<br/><br/>“Which one of you detected the Dragon King’s strength just now?”<br/><br/>The Great Dao level elder wearing a bamboo hat looked at the other experts and asked.<br/><br/>“We couldn’t detect it. My Supreme Treasure has no reaction to the Dragon King. Didn’t the Dragon King just break through to the Tianyuan Destiny Supreme Treasure?”<br/><br/>A Great Dao expert in the shape of a demon shook his head in confusion.<br/><br/>“It’s definitely not a simple primal chaos level. He should be very experienced among the primal chaos levels. I really didn’t expect such a powerful existence to be born here.”<br/><br/>“The birth of a primal chaos level expert requires abnormally powerful resources. The Dragon King said that when he was attacked by the spirit kneader, it was a blessing in disguise. This may be the reason why he broke through to the primal chaos level and now has such powerful strength. I wonder where the spirit kneader attacked the Dragon King.”<br/><br/>Several Great Dao realm experts were discussing the Dragon King’s strength.<br/><br/>“What should we do now?”<br/><br/>Finally, a great dao realm expert frowned and asked, “Continue to invade the Guardian Alliance? The spirit kneader and the others have been killed. Do they still dare to come?”<br/><br/>“If the spirit kneader and the others can’t rush over and the Guardian Alliance continues to harass and attack us, I’m afraid we will suffer a lot of losses, especially since our duty is not here. It will be very troublesome for us.”<br/><br/>The group of Great Dao experts was caught in a dilemma.<br/><br/>Soon, their faces were filled with helplessness.<br/><br/>Not only did they fail to obtain the Heavenly Yuan Destiny Treasure during their trip to the deep cold universe this time, but they also failed to obtain the Heavenly Yuan Destiny Treasure.<br/><br/>The three Great Dao experts were also killed by the Dragon King.<br/><br/>Most importantly, the Dragon King said that he would kill the spirit kneader and the others every time he saw them.<br/><br/>The three of them would definitely not dare to step into this place again.<br/><br/>“Let’s retreat for now. The Guardian Alliance knows our current situation. Let’s retreat for now. We’ll talk about everything in the future.”<br/><br/>An expert at the Great Dao level thought for a moment and said.<br/><br/>Everyone nodded.<br/><br/>There was no other choice. In the current situation, they could only leave.<br/><br/>Even though they were unwilling to do so!<br/><br/>…<br/><br/>Wang Xian did not know that the evil Xu Lei camp wanted to retreat from the land of origin.<br/><br/>Time passed day by day.<br/><br/>However, a few hundred years later, The Guardian Alliance received news that the evil sequence camp had retreated.<br/><br/>This was because they realized that after the evil sequence camp had left, they did not return to the starship universe.<br/><br/>Instead, they flew in the opposite direction, towards the universe of the evil sequence camp.<br/><br/>Now, after more than 400 years, they had already left a great distance!<br/><br/>“The evil sequence faction has retreated, they have left!”<br/><br/>“Three Great Dao experts have been killed by the Dragon King. They don’t dare to waste their time with us. That’s Great!”<br/><br/>Over at the Guardian Alliance, the experts revealed excited expressions when they heard the news.<br/><br/>The retreat of the evil sequence faction caused all the experts of the Guardian alliance to heave a heavy sigh of relief.<br/><br/>If the war really continued, the Guardian Alliance would not be able to hold on.<br/><br/>“The Dragon King has indirectly helped our Guardian Alliance A GREAT FAVOR!”<br/><br/>A deputy alliance master sighed slightly.<br/><br/>The surrounding champions nodded silently.<br/><br/>After witnessing the power of the evil sequence faction, they finally understood the Dragon King’s power even more deeply.<br/><br/>He had single-handedly prevented the entire evil sequence faction from making a move.<br/><br/>“Everyone, our safety is temporarily over. Next, I’m preparing to leave the Guardian Alliance and join the Dragon Palace Alliance. We will never change!”<br/><br/>The Vice Alliance Master who had just spoken suddenly cupped his hands and said.<br/><br/>Yes, he had decided to leave the Guardian Alliance!<br/><br/>Join the Dragon Palace Alliance.<br/><br/>Although joining the Dragon Palace Alliance required a lot of resources, their universe could afford such resources.<br/><br/>Compared to the resources, joining the Dragon Palace Alliance brought more benefits.<br/><br/>Especially the protection of the Dragon King.<br/><br/>This protection was not the protection of this calamity, but was permanent.<br/><br/>Although his strength was at the Great Dao level, it was still not enough compared to the evil sequence faction.<br/><br/>It was worth it to exchange a sum of resources for the Eternal Peace of the universe.<br/><br/>Not to mention that there were other invisible benefits to joining the Dragon Palace Alliance.<br/><br/>His words caused all the surrounding experts to be slightly stunned.<br/><br/>Immediately after, everyone fell silent.<br/><br/>They were silent not because they felt that the vice alliance leader had suddenly withdrawn.<br/><br/>Instead, they thought that they should join the Dragon Palace Alliance as well.<br/><br/>They also needed to prepare resources.<br/><br/>Seeing the expressions of the experts around him, Alliance leader he opened his mouth slightly.<br/><br/>“The Dragon King is indeed very strong. He alone can cause the collapse of our Guardian Alliance. Compared to the Dragon Palace Alliance and the Justice Alliance’s Evil Sequence Alliance, our Guardian Alliance is indeed too weak.”<br/><br/>“I also have the idea of joining the Dragon Palace Alliance!”<br/><br/>Alliance master he said.\t\t\t\t\t\t</div>", "images": {}, "success": true}