{"id": 1452, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075601.html", "title": "Chapter 4455 - Chapter 4455: 4454, The Birth Of The True Heavenly Fate Treasure", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4455 - Chapter 4455: 4454, The Birth Of The True Heavenly Fate Treasure</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4455: 4454, the birth of the true heavenly fate treasure<br/><br/>“What’s the current situation of the Guardian Alliance and the evil sequence faction?”<br/><br/>“I’m not too sure. The Guardian Alliance seems to be at a disadvantage. They Can’t stop the invasion of the evil sequence faction at all. They can only delay it for a while.”<br/><br/>“The Guardian Alliance is still a little weak. Unlike Our Dragon Palace Alliance, not only do we have six great dao-level lords, we also have the Dragon King, a chaos-level Lord!”<br/><br/>“However, we can’t be careless. This isn’t all the power of the evil sequence camp.”<br/><br/>“I heard from Prime Minister Gui that the Guardian Alliance has come to Our Dragon Palace Alliance for help. Our Dragon King has set extremely harsh conditions.”<br/><br/>“Asking for help at this time is to make our Dragon Palace Alliance fight against the evil sequence camp. Naturally, we can’t just agree to it.”<br/><br/>Wang Xian didn’t care about the war between the two forces.<br/><br/>However, in the land of origin, all the other powerhouses were paying special attention to this war.<br/><br/>All the powerhouses were discussing.<br/><br/>However, they didn’t know the exact situation of the war.<br/><br/>In the asterisk universe, the evil sequence camp was met with a strong resistance.<br/><br/>The powerhouses of the Guardian Alliance went all out. Indeed, it brought a lot of trouble to the evil sequence camp.<br/><br/>However, the evil sequence faction didn’t give up and continued to attack.<br/><br/>The stalemate between the two sides lasted for tens of thousands of years.<br/><br/>However, on this day, a message suddenly interrupted them.<br/><br/>“HMM?”<br/><br/>Dragon Palace Alliance base, Divination Palace where the universe was located.<br/><br/>Prophet Hong and the prophet were inside. On this day, one of their compasses lit up at the same time.<br/><br/>This compass was called treasure hunting.<br/><br/>It was a very simple name, and the name was also useful.<br/><br/>This treasure hunting compass was created by the combined efforts of the three great prophets after a long time.<br/><br/>It could predict the location of treasures.<br/><br/>In addition, when an extremely powerful Heavenly Yuan Destiny Treasure was born, it would emit light.<br/><br/>Back then, the six paths universe’s Heavenly Yuan Destiny Treasure was found out by prophet Hong and the others using the treasure hunting compass.<br/><br/>Now, the treasure-seeking compass lit up again.<br/><br/>This also meant that within the surrounding universe, a heavenly creation true treasure was born.<br/><br/>The birth of a heavenly creation true treasure might not even be one in every universe.<br/><br/>However, there were many universes around, so the birth of a heavenly creation true treasure was not too rare.<br/><br/>However, it would be difficult to obtain this heavenly creation true treasure.<br/><br/>However, it was the time of the Great Calamity, and there was a Heavenly Yuan Destiny Treasure born in the universe. This was different!<br/><br/>“Old Hong, a heavenly yuan destiny treasure is about to be born!”<br/><br/>Their treasure-hunting compass emitted light, and they immediately gathered together and said with sparkling eyes.<br/><br/>“Yes, in the Deep Freeze Universe, the Deep Freeze Universe is a member of our Dragon Palace Alliance.”<br/><br/>Prophet Hong nodded, looked at the information on the compass, and said!<br/><br/>“At that time, the six paths universe gave birth to a heavenly origin creation treasure. Because it wasn’t during the calamity period and was protected by the universe, we didn’t go there. Instead, we spread the news. Now that the Deep Freeze Universe has a heavenly origin creation treasure, we can go there and find it.”<br/><br/>The prophet continued.<br/><br/>“Yes, a heavenly fate treasure. It has a great increase in strength.”<br/><br/>Prophet Hong nodded, and his eyes revealed a trace of fervor.<br/><br/>“However, the heavenly fate treasure that was born this time is also concealed. It’s somewhat difficult to find. With our divination ability, we still can’t accurately locate it.”<br/><br/>As the Prophet spoke, he wanted to divine the probability of them finding the treasure.<br/><br/>But very quickly, the prophet frowned and looked at prophet Hong. “We will have many competitors, and they are also very powerful!”<br/><br/>“I have also divined a bit of information. Who are the competitors?”<br/><br/>The two were astonished.<br/><br/>However, at the same time, in the Star Universe, at the evil sequence camp, a group of experts and legions gathered together.<br/><br/>Over a hundred thousand years, they had swept through more than half of the star universe.<br/><br/>Compared to before, this process was already very slow for them.<br/><br/>However, they all understood.<br/><br/>As long as they took care of the star universe, the next step might be a little smoother.<br/><br/>“HMM?”<br/><br/>However, at this time, the antenna above the head of Tian Ren, who was in the center, suddenly trembled.<br/><br/>He felt something and sent waves of energy into the antennae.<br/><br/>The antennae started to emit light, and soon, a message was sent into his mind.<br/><br/>When he received this message, his eyes shone.<br/><br/>“A heavenly origin creation treasure. I didn’t expect that there would be a heavenly origin creation treasure in this area!”<br/><br/>Tian Ji was surprised and his mind was active.<br/><br/>He continued to predict and make accurate predictions.<br/><br/>Soon, he took out his communication device and opened the information of the Dragon Palace Alliance. He saw a name.<br/><br/>“Deep Freeze Universe, a member universe of the Dragon Palace Alliance. This is a bit troublesome. Once I enter the Deep Freeze universe, I will be attacked by the Dragon Palace Alliance.”<br/><br/>“Also, if I leave now, the surrounding experts will definitely suspect me.”<br/><br/>Tian Ji’s eyes flickered slightly.<br/><br/>He naturally didn’t want to share the information of the Heavenly Yuan Destiny Treasure with others.<br/><br/>But now, there were two huge problems in front of him.<br/><br/>The Dragon Palace Alliance and the experts from his own camp.<br/><br/>Now, they had been fighting against the Guardian Alliance, and The Guardian Alliance was constantly attacking them.<br/><br/>The reason why they were able to deal with and even kill many of the Guardian Alliance’s experts was largely because of Tian Ji.<br/><br/>It was because he had the ability of divination.<br/><br/>If he suddenly left now, the spirit kneader and the others would naturally be suspicious.<br/><br/>“Neither the Dragon Palace Alliance nor this side will work. I have to tell them this news.”<br/><br/>After thinking for a while, vocation finally gave up the idea of searching alone.<br/><br/>“Everyone, I just predicted something, something very important.”<br/><br/>Tian Ji looked at the spirit kneader and the others and said.<br/><br/>“Oh?”<br/><br/>All the Great Dao existences looked at him with curiosity and surprise.<br/><br/>“I predicted that a heavenly yuan creation treasure was born in this area.”<br/><br/>Tian Ji continued.<br/><br/>His words caused all the heavenly yuan creation experts to be slightly shocked, and their faces instantly revealed a fiery expression.<br/><br/>“Heavenly Yuan Creation Supreme Treasure?”<br/><br/>Spirit kneader’s eyes revealed a fiery expression as he stared at Tian Dui. “Tian Dui, are you sure?”<br/><br/>“Of course I’m sure.”<br/><br/>Tian dui nodded.<br/><br/>“Where is it?”<br/><br/>A Great Dao realm expert immediately asked, “As long as we obtain this heavenly Yuan creation supreme treasure, we will definitely not lose you, brother Tian Dui. Don’t worry about this!”<br/><br/>“The place where the heavenly fate treasure is born is a huge problem for us. In addition, if any of you really obtain it, I will need 20% of the heavenly fate treasure’s value.”<br/><br/>Tianji said.\t\t\t\t\t\t</div>", "images": {}, "success": true}