{"id": 1453, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075606.html", "title": "Chapter 4456 - Chapter 4456: The 4455 Evil Sequence Faction’S Declaration", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4456 - Chapter 4456: The 4455 Evil Sequence Faction’S Declaration</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4456: The 4455 evil sequence faction’s declaration<br/><br/>“No Problem!”<br/><br/>They didn’t have any objections to the conditions that Tian Gong had proposed.<br/><br/>It was only 20% of a heavenly fate treasure.<br/><br/>Compared to a heavenly fate treasure, it was nothing.<br/><br/>Out of the Eight Great Dao existences, only two had a heavenly fate treasure.<br/><br/>One could imagine how precious a heavenly Yuan Destiny Supreme Treasure was.<br/><br/>“That’s good. But now there’s another problem, and that’s the universe where the Heavenly Yuan Destiny Supreme Treasure was born. It’s the universe of the Dragon Palace Alliance. If we enter it directly, we might be considered as an invasion. When that happens, it’ll be a huge problem.”<br/><br/>Tian Ji looked at them and said.<br/><br/>“Huh?”<br/><br/>His words made the spirit kneader and the others frown slightly.<br/><br/>They were currently invading the Guardian Alliance. If they offended the Dragon Palace Alliance again, it would definitely not be the right choice.<br/><br/>In fact, if the other party joined hands, it would create a big crisis for the Guardian Alliance.<br/><br/>“This is indeed a problem.”<br/><br/>An expert at the Great Dao level frowned slightly.<br/><br/>“There is a way, and that is for us to make a statement here in the land of origin in advance in order to find treasures. We will absolutely not harm any living beings in this universe.”<br/><br/>Tian Dui looked at them, he said, “But there is also a flaw in this. Once the announcement is made, all the experts will know that a heavenly Yuan Destiny Supreme Treasure has been born in this universe. At that time, that Dragon King may even come and look for it.”<br/><br/>“We have to make it clear. Otherwise, if we offend the Dragon Palace Alliance again, they might really join forces.”<br/><br/>A Great Dao expert said heavily.<br/><br/>“Yes, we can’t hide such things from the Dragon Palace Alliance. In addition, the members of the Dragon Palace Alliance have divined the universe. I’m afraid that the divination of the universe has already learned the news of the birth of the heavenly fate treasure.”<br/><br/>“We might as well go there openly and search for it. Even if the Dragon King goes there as well, we won’t be afraid even if we join hands. The Dragon King has just stepped into the primal chaos realm. With our strength, we won’t be afraid at all.”<br/><br/>The Spirit Kneader said with a twinkle in his eyes.<br/><br/>“Hehe, Spirit kneader, didn’t you say that you have a grudge against the Dragon King? If the Dragon King wants to kill you, don’t drag us into it!”<br/><br/>“If we are dragged into it by you, you will have to pay a price.”<br/><br/>Another old man dressed in a black cloak, who was similar to the spirit kneader, said faintly.<br/><br/>“Don’t worry. Although the Dragon King is strong, he doesn’t dare to offend us.”<br/><br/>The spirit kneader looked at him and said in a deep voice.<br/><br/>“Hehe, in the end, you still borrowed our power.”<br/><br/>The cloaked elder said with a chuckle.<br/><br/>“Since that’s the case, then let’s go to the place where the Heavenly Yuan Creation Treasure was born. Hehe, I don’t know what kind of Heavenly Yuan creation treasure it is, but it doesn’t matter. The Heavenly Yuan creation treasure can be used with any kind of attribute.”<br/><br/>An expert said with excitement in his eyes.<br/><br/>The other heavenly yuan creation experts around were also excited. They were also full of interest.<br/><br/>Although their strength wasn’t as strong as the eight Great Dao existences, what if they were lucky?<br/><br/>Although the evil sequence faction was somewhat loose and didn’t unite.<br/><br/>However, there were restrictions.<br/><br/>For example, the experts of the evil sequence faction couldn’t fight for no reason.<br/><br/>If there was enmity between the two sides, they could fight to the death fairly.<br/><br/>In addition, snatching treasures wasn’t allowed to happen in the evil sequence faction.<br/><br/>In other words, they also had a chance to obtain the heavenly fate treasure.<br/><br/>Soon, the evil sequence faction’s champions and legions changed their direction and flew out of the asterisk universe.<br/><br/>The Guardian Alliance received the news immediately.<br/><br/>When they saw the evil sequence faction flying out of the asterisk universe, their faces were filled with astonishment.<br/><br/>“What’s going on? The Great Beings and legions of the evil sequence camp suddenly left? What are they scheming?”<br/><br/>“I don’t know. The direction they’re leaving now is obviously outside of the star universe. Could it be that they’ve given up and aren’t prepared to fight us?”<br/><br/>In a palace in the star universe, all the Great Beings of the Guardian Alliance gathered together and looked at the news in astonishment.<br/><br/>“Four Alliance Masters, look at the information in the communication device of the land of origin. The evil sequence faction actually made a statement on it. They are going to the deep frost universe. They said that there is a heavenly fate treasure born in the Deep Frost Universe.”<br/><br/>At this moment, an expert suddenly cried out in surprise.<br/><br/>“What?”<br/><br/>His words caused everyone to be slightly startled, and they immediately took out their communication devices.<br/><br/>When they saw the contents of the communicators, their eyes froze.<br/><br/>It was just as the expert had said. The evil sequence faction had discovered that the Deep Freeze universe had a heavenly fate treasure, so they wanted to look for it.<br/><br/>This made them think back to when the evil sequence faction had spread the news that the heavenly fate treasure had been born in the starry universe.<br/><br/>But it was completely different this time. The evil sequence faction had personally issued a statement.<br/><br/>In addition, what made them feel even more conflicted was that the evil sequence faction had announced at the back that they were only looking for treasures and would not slaughter any living beings in the universe, which reassured the Dragon Palace Alliance.<br/><br/>This? ? ?<br/><br/>In comparison, it was obvious that they had looked down on the Guardian Alliance at that time.<br/><br/>They were completely polite to the Dragon Palace Alliance.<br/><br/>The gap was huge!<br/><br/>“There’s a heavenly yuan creation treasure in the Deep Frost Universe? The evil sequence faction suddenly rushed over from the star universe. This information should be true. It’s impossible for them to invade the Dragon Palace Alliance again.”<br/><br/>“It should be true. I didn’t expect that a heavenly Yuan creation treasure would be born.”<br/><br/>The experts of the Dragon Palace Alliance said.<br/><br/>“I don’t know how the Dragon Palace Alliance will react, but we have to keep attacking. They want to find a heavenly fate treasure, so we’ll go too.”<br/><br/>“Even if we can’t get it, we can’t let the evil sequence faction succeed.”<br/><br/>Alliance master he said coldly.<br/><br/>“Let’s go.”<br/><br/>The experts of the Guardian Alliance also flew out.<br/><br/>…<br/><br/>“HM?”<br/><br/>However, when the evil sequence faction sent out a statement through the communication device in the land of origin.<br/><br/>It quickly caused a huge sensation in the land of origin.<br/><br/>Especially at the Dragon Palace Alliance.<br/><br/>In the palace where the Dragon Palace Alliance divined the universe.<br/><br/>When prophet Hong and the others saw this message from the evil sequence faction, they looked helpless.<br/><br/>“I didn’t expect the evil sequence faction to receive this message as well. It seems like the evil sequence faction has a powerful prophet.”<br/><br/>“It seems like the evil sequence faction has always had powerful divination race experts. We have to give up on the idea of secretly searching for them. Let’s give this message as well.”<br/><br/>“Alright, all the experts and legions from the evil sequence faction should be there. We’re not their match. Let’s tell Prime Minister Turtle and the others.”<br/><br/>Prophet Hong and prophet Wu helplessly decided.\t\t\t\t\t\t</div>", "images": {}, "success": true}