{"id": 1457, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075626.html", "title": "Chapter 4460 - Chapter 4460: Among The 4,459 Powerhouses, Take The Enemy’S Head! Down", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4460 - Chapter 4460: Among The 4,459 Powerhouses, Take The Enemy’S Head! Down</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4460: Among the 4,459 powerhouses, take the enemy’s head! Down<br/><br/>Wang Xian was too close to them, causing the hearts of all the powerhouses in the evil sequence camp to tremble.<br/><br/>This was especially so for the spiritual kneader and the illusory realm who were instantly killed.<br/><br/>More than 200 powerhouses in the Heaven’s origin realm retreated backward. A terrifying defense wrapped around their bodies.<br/><br/>This was especially so for Tian Gong, who revealed a hint of fear on his face.<br/><br/>Buzz! Buzz! Buzz<br/><br/>At the moment when they were defending themselves, the divination lamp appeared at his side.<br/><br/>The divination power was injected into it, divining the method to kill the heavenly occupation.<br/><br/>Buzz<br/><br/>Very soon, a message appeared in Wang Xian’s mind.<br/><br/>The next moment, Wang Xian moved and disappeared!<br/><br/>“Be careful!”<br/><br/>The Great Dao realm elder with the bamboo hat roared angrily when he saw Wang Xian disappear.<br/><br/>“Not good, this dragon king wants to kill our disciples!”<br/><br/>Suddenly, an expert of the Great Dao level sensed something and looked towards the back.<br/><br/>He saw the Dragon King appear in the middle of the group of army disciples!<br/><br/>His terrifying speed did not allow them to react in time.<br/><br/>In addition, all their defenses did not cover all the army disciples.<br/><br/>Most of the army’s disciples were outside of the defenses.<br/><br/>With the Dragon King’s strength, he could kill all the army’s disciples in an instant.<br/><br/>A few great dao level powerhouses looked anxious.<br/><br/>That was because the army’s disciple was theirs.<br/><br/>The three Great Dao level powerhouses moved their bodies and flew directly toward their subordinates.<br/><br/>Waves of energy spread out and formed a powerful defense!<br/><br/>“Attack!”<br/><br/>Tian Ji stared at Wang Xian’s figure with a ferocious look on his face as he roared furiously!<br/><br/>“Dragon King, are you really going to make an enemy out of our evil sequence faction? You better think it through!”<br/><br/>A Great Dao level powerhouse roared!<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>At this moment, the attacks of more than 200 heaven origin creator level powerhouses were locked onto Wang Xian!<br/><br/>“Dong Dong!”<br/><br/>“Dong Dong!”<br/><br/>Endless energy collided with each other, producing a special sound.<br/><br/>Wang Xian, who was charging toward the army of the evil sequence, was instantly enveloped by endless energy.<br/><br/>When the energy destroyed Wang Xian, Wang Xian’s figure also dissipated under the energy.<br/><br/>“You can’t Stop the people I Want to kill.”<br/><br/>At this moment, a voice was transmitted into the ears of all the strong cultivators.<br/><br/>When Tian Gong heard this voice, his pupils constricted slightly and a horrified expression appeared on his face.<br/><br/>He felt the threat of death.<br/><br/>“Save me!”<br/><br/>He shouted hurriedly.<br/><br/>However, at this moment, three powerhouses at the Great Dao level were attracted by Wang Xian’s clone and flew towards his disciples.<br/><br/>At this moment, even if they sensed something, it was already too late.<br/><br/>“Divination? HMPH, did you foresee your death?”<br/><br/>Wang Xian’s figure came to the side of Tian An.<br/><br/>The antennae on Tian An’s head emitted a luster as they attacked Wang Xian.<br/><br/>However, Wang Xian moved his palm and easily suppressed his attack.<br/><br/>Wang Xian stretched out his hand and grabbed two of Tian An’s antennae. His eyes were filled with intense killing intent.<br/><br/>Boom<br/><br/>The thick chaotic energy surged into Tian Ji’s body and easily killed him.<br/><br/>“Dragon King, are you really going to make an enemy out of our holy faction?”<br/><br/>The other five heaven origin creator powerhouses were horrified when they saw this scene. They questioned him with anxiety and anger on their faces.<br/><br/>“These three people have a grudge against me, Dragon King. I must kill them. If I kill them and your evil sequence faction is going to make an enemy out of me, then I shall accept it!”<br/><br/>After killing Tian Shi, Wang Xian moved and teleported to the front of the powerhouses from the Dragon Palace Alliance.<br/><br/>There were no traces on his body and his expression was extremely calm.<br/><br/>It was as if he didn’t even kill the three Great Dao existences just now.<br/><br/>“Whoosh! Whoosh!”<br/><br/>All the powerhouses from the evil sequence faction saw that Wang Xian had easily escaped from their attack range.<br/><br/>They saw him standing in front of the powerhouses from the Dragon Palace Alliance calmly.<br/><br/>Their expressions were abnormally ugly.<br/><br/>Strong!<br/><br/>Too strong!<br/><br/>From the beginning of the attack to the end, it took less than ten seconds.<br/><br/>Within ten seconds, three Great Dao level powerhouses were killed by him.<br/><br/>The first spirit kneader was fine, but he was ambushed.<br/><br/>However, from the second illusion world, they had been defending with all their strength.<br/><br/>However, when the Dragon King approached, the more than 200 of them couldn’t protect the heavenly occupation and the others in the illusion world?<br/><br/>This? ?<br/><br/>How could a chaos-level powerhouse be so strong?<br/><br/>There were chaos-level existences in their evil sequence faction.<br/><br/>However, they didn’t feel that they were this terrifying!<br/><br/>This Dragon King was definitely not an ordinary chaos-level existence.<br/><br/>He was much, much stronger than they had imagined!<br/><br/>One had to know that existences like the spirit kneader, the illusionary realm, and the heavenly occupation all had life-saving treasures.<br/><br/>For example, they could instantly avoid a fatal attack.<br/><br/>For example, they could instantly resurrect at a nearby location.<br/><br/>But they weren’t able to use it.<br/><br/>This was obviously because this Dragon King’s strength was too terrifying!<br/><br/>Looking at the Calm Dragon King in front of them.<br/><br/>The experts of the evil sequence faction felt their hearts palpitate.<br/><br/>F * ck, the entire Guardian Alliance didn’t give them such great pressure.<br/><br/>However, the Dragon King alone gave them a feeling of fear.<br/><br/>“How is this possible?”<br/><br/>At the same time, at the back.<br/><br/>The experts of the Guardian alliance had been paying attention to the situation here.<br/><br/>In their opinion, the Dragon Palace Alliance and the evil sequence faction would at most meet and talk about some things.<br/><br/>But what they didn’t expect was that the Dragon King directly attacked the evil sequence faction.<br/><br/>And he even directly killed three Great Dao existences.<br/><br/>This..?<br/><br/>This..?<br/><br/>They had fought with the evil sequence faction for so long, but they knew how powerful the evil sequence faction was.<br/><br/>However, that Dragon King had easily taken the heads of three Great Dao experts among all the experts.<br/><br/>How terrifying!<br/><br/>“Isn’t this Dragon King’s strength too terrifying?”<br/><br/>“He’s too powerful. I thought that the Dragon Palace Alliance would be afraid of the evil sequence faction, but now it seems like… This? ? ?”<br/><br/>“He’s too powerful. This Dragon King is too powerful. He didn’t give the evil sequence faction any face and directly killed them. Most importantly, they couldn’t do anything to that Dragon King!”<br/><br/>“What will the evil sequence faction do next?”<br/><br/>All the experts from the Dragon Palace Alliance stared at the scene with their eyes wide open.<br/><br/>The scene in front of them was unbelievable.<br/><br/>That Dragon King’s strength and temper were too fierce.<br/><br/>He killed them just like that!<br/><br/>Gulp<br/><br/>The experts from the Dragon Palace Alliance couldn’t help but swallow their saliva at this moment.<br/><br/>They stared blankly at the Dragon King in front of them with awe and shock on their faces.<br/><br/>Was this the leader of the Dragon Palace Alliance?<br/><br/>This was too ruthless!<br/><br/>Simply Invincible!\t\t\t\t\t\t</div>", "images": {}, "success": true}