{"id": 1469, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075686.html", "title": "Chapter 4472 - Chapter 4472: 4471 Cooperation", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4472 - Chapter 4472: 4471 Cooperation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4472: 4471 cooperation<br/><br/>“Brother Wang Xian, Your Dragon Palace really has a lot of treasures here.”<br/><br/>Song Ta and the rest looked at the treasures and resources around the Dragon Palace and exclaimed in surprise.<br/><br/>“Not much.”<br/><br/>Wang Xian smiled faintly.<br/><br/>“I’ve seen three divine trees of the Heaven’s origin creation level, and this is not much?”<br/><br/>The old man with the sword teased in a rare manner.<br/><br/>The old man with the demon sword was the strongest person in the sword sect.<br/><br/>Song Ta also had his own forces. He was not a powerhouse in the justice universe.<br/><br/>As for Saint Shan Tian, he was also the leader of a large sect.<br/><br/>They were envious when they saw these treasures and resources. They could not compare to the dragon palace at all.<br/><br/>“Haha, everyone, see if there are any resources that you need. I can give you some.”<br/><br/>Wang Xian smiled and said generously.<br/><br/>The Dragon Palace indeed had a lot of treasures.<br/><br/>Especially the various divine trees and herbs.<br/><br/>As for the divine trees in the Heaven’s origin manifestation level, there were three of them.<br/><br/>However, the divine trees in the Heaven’s origin manifestation level were not as powerful as he had imagined.<br/><br/>To be able to call them divine trees in the Heaven’s origin manifestation level, they were called divine trees that could produce a large number of fruits at the peak of the Dominator level.<br/><br/>For example, the three divine trees in the Dragon Palace could produce more than 30 fruits at the peak of the Dominator level within 10 billion years.<br/><br/>Such a divine tree could be called the heaven origin creation level.<br/><br/>Its effects were indeed extremely precious to a faction.<br/><br/>“Oh? When the time comes, we won’t be courteous to brother Wang Xian?”<br/><br/>Song ta smiled and said.<br/><br/>These resources were indeed a lot, but they were not precious to experts at their level.<br/><br/>It was just that there were some special resources and treasures that their universe did not have. However, they were extremely useful to their disciples.<br/><br/>“You don’t have to be polite to me.”<br/><br/>Wang Xian shook his head nonchalantly.<br/><br/>“Oh right, brother Wang Xian, I heard that you have established an alliance called the Dragon Palace Alliance. It is very powerful.”<br/><br/>Saint Shan Tian looked at Wang Xian and asked despite knowing the answer.<br/><br/>“Yes. Some time ago, the army of the evil sequence faction came to the land of origin. I also happened to have established an alliance, and the universe from the land of Origin joined in.”<br/><br/>Wang Xian nodded.<br/><br/>“Brother Wang Xian, your alliance is not simple. With you overseeing it, it is extremely powerful.”<br/><br/>Song ta said, “Speaking of which, the distance between the Dragon Palace Alliance and the Justice Alliance isn’t too far.”<br/><br/>“It’s a journey of tens of thousands of years for an ordinary powerhouse. It’s not too far.”<br/><br/>Wang Xian nodded his head.<br/><br/>“Dragon King, you guys established the Dragon Palace Alliance because of the evil sequence faction. The same goes for our Justice Alliance. I feel that we can have a more in-depth exchange.”<br/><br/>King Jin Xiu, who was at the side, suddenly spoke.<br/><br/>“Oh?”<br/><br/>Wang Xian raised his eyebrows. “Currently, the main purpose of our Dragon Palace Alliance is that if other forces do not provoke us, we will not provoke others.”<br/><br/>King Jin Xiu’s intention was very obvious. She wanted to form an alliance with the Dragon Palace Alliance and the Justice Alliance to jointly deal with the evil sequence alignment camp.<br/><br/>However, Wang Xian did not have such thoughts at the moment.<br/><br/>Wang Xian was dissatisfied with the evil sequence faction and wanted to destroy them.<br/><br/>However, they were too strong. He didn’t want to take the risk before he was confident.<br/><br/>After all, he had to consider more since he had a big business now.<br/><br/>“We Understand.”<br/><br/>King Jin Xiu nodded with a smile.<br/><br/>“Communication is a very good way to improve. Dragon King, I think we can have some communication. For example, the special items in the Justice Alliance or the items left unused by the strong ones to trade with the Dragon Palace Alliance. What do you think?”<br/><br/>Song ta said from the side, “This will benefit both the Justice Alliance and the members of the Dragon Palace Alliance.”<br/><br/>“Of course, there’s no problem with that.”<br/><br/>Wang Xian was happy to see such communication succeed.<br/><br/>To put it bluntly, it was to open up a channel for both parties to trade. The Dragon Palace Alliance could buy the treasures from the Justice Alliance.<br/><br/>The Justice Alliance could also buy the treasures from the Dragon Palace Alliance.<br/><br/>“We can set up an ultra-long-distance teleportation array at the center of the Justice Alliance and the Dragon Palace Alliance. This way, we can shorten the travel time. What do you think, Dragon King?”<br/><br/>Old Man Jian continued.<br/><br/>“That’s not a problem. We can discuss this matter properly.”<br/><br/>Wang Xian agreed.<br/><br/>In the following days, Wang Xian brought song ta and the rest around the Dragon Palace and the land of origin.<br/><br/>Soon after, they had a discussion about how to communicate.<br/><br/>This was a good thing for both parties.<br/><br/>However, it would require a lot of resources to build the teleportation formation.<br/><br/>However, this was not a big problem. In the future, all the experts would have to pay for the resources when they used the teleportation formation.<br/><br/>It could also make up for it.<br/><br/>Song Ta and the rest only left after talking for decades.<br/><br/>After Wang Xian handed this matter over to Prime Minister Gui, he headed to the underground of the land of origin again.<br/><br/>However, the cooperation between the Justice Alliance and the Dragon Palace Alliance caused quite a stir in the land of origin.<br/><br/>”? ? ? Holy Shit, what’s going on? Not long ago, our Lord Dragon King killed the son of the leader of the Justice Alliance. Now, Our Dragon Palace Alliance is cooperating with the Justice Alliance? No Way!”<br/><br/>“666, we can communicate over a long distance. In the future, we can quickly go to the Justice Alliance, and the Justice Alliance can also quickly come to Our Dragon Palace Alliance? The two sides can trade?”<br/><br/>“Holy shit, not only did our Dragon Palace Alliance not clash with the Justice Alliance, but we even cooperated. This? ? Our Lord Dragon King is too fierce, isn’t he?”<br/><br/>“Our Dragon Palace Alliance isn’t weak at the moment, especially since our Lord Dragon King’s strength is heaven-defying. How could the Justice Alliance Offend Us, let alone start a war with us? Only by working together can we achieve a win-win situation!”<br/><br/>“That’s true, but I wonder if our Dragon Palace Alliance will cooperate with the Justice Alliance to fight against the evil sequence faction in the future.”<br/><br/>“I’m willing to fight against the evil sequence faction together, but it would be best if we could break into the evil sequence faction and plunder their treasures.”<br/><br/>The members of the Dragon Palace Alliance discussed excitedly.<br/><br/>The members of the Dragon Palace Alliance were the first to benefit from the cooperation this time.<br/><br/>Apart from giving the dragon palace a large amount of resources in the beginning, they had also gained a lot of benefits now.<br/><br/>At least in the future, they would be much stronger than before in terms of communicating and improving their strength.<br/><br/>…<br/><br/>Wang Xian didn’t pay attention to the matters of the Dragon Palace Alliance anymore.<br/><br/>This time, he planned to get more origin stones from the land of origin.<br/><br/>It would be best if he could completely fuse the primal chaos stones with his body.<br/><br/>It would allow his strength to reach a terrifying level.<br/><br/>“I still need more than ten pieces of the origin stone to fuse with the primal Chaos Stone 100% .”<br/><br/>Wang Xian was in a cave below the land of origin. His eyes were sparkling.\t\t\t\t\t\t</div>", "images": {}, "success": true}