{"id": 1468, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075681.html", "title": "Chapter 4471 - Chapter 4471: 4470 Justice Alliance Came To Express Their Goodwill", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4471 - Chapter 4471: 4470 Justice Alliance Came To Express Their Goodwill</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4471: 4470 Justice Alliance came to express their goodwill<br/><br/>“Our Dragon King is simply too fierce. No matter which force you are from or which universe you are from, as long as you dare to cause trouble here in our land of origin, you will die!”<br/><br/>“The son of the leader of the Justice Alliance is a Great Dao level existence, and he has a great dao level powerhouse beside him. Our Dragon King has killed another two great dao level experts. This is simply slaughtering the great dao like slaughtering dogs. It’s too ruthless!”<br/><br/>“The son of the leader of the Justice Alliance still wants to use the Justice Alliance to threaten our Lord Dragon King, but our Lord Dragon King killed him without any fear!”<br/><br/>“Haha, isn’t this too safe? Who cares what force you are, don’t be arrogant in the territory of the Dragon Palace Alliance!”<br/><br/>“Our Dragon Palace Alliance is not weak at the moment, and the Lord Dragon King knows that even if we kill them, the Justice Alliance wouldn’t dare to come and take revenge. After all, the Justice Alliance was established for the evil sequence camp, so it can’t launch a large-scale battle just because of private actions. Besides, the evil sequence camp is their true enemy.”<br/><br/>After a few experts from the Mandrill universe revealed what had happened in their universe, the experts from the Dragon Palace Alliance were shocked.<br/><br/>They worshiped the Dragon King even more.<br/><br/>What they needed was a strong and protective leader like the Dragon King.<br/><br/>This time, the Mandrill universe was in danger.<br/><br/>Next time, it might be their own universe.<br/><br/>If they were to put themselves in Wang Xian’s shoes, they also hoped that the Dragon King would protect them and directly kill their opponents.<br/><br/>This also brought the cohesion of the Dragon Palace Alliance to a new level.<br/><br/>…<br/><br/>Wang Xian did not know that his action this time had brought the cohesion of the Dragon Palace Alliance to a higher level.<br/><br/>Time passed day by day.<br/><br/>On this day, more than ten figures slowly appeared in front of the nine-origin universe.<br/><br/>They were led by Song Ta, Demon Sword Saint Shan Tian, and King Jin Xiu.<br/><br/>“In front of us is the nine-origin universe, the universe where the Dragon King of the Dragon Palace is.”<br/><br/>Song ta said, “We haven’t been able to contact the Dragon King at the moment. Let’s go there directly.”<br/><br/>“Okay.”<br/><br/>Demon Sword and the others nodded and entered the nine-origin universe directly.<br/><br/>Not long after they flew, experts from the Dragon Palace rushed over.<br/><br/>“Who are you?”<br/><br/>Now, as long as a heavenly yuan creation realm expert entered the nine-origin universe, they could be detected.<br/><br/>Some heavenly yuan creation realm experts immediately rushed over from the Dragon Palace.<br/><br/>The two heavenly Yuan creation realm experts from the Dragon Palace stared at them and asked.<br/><br/>“We are from the Justice Alliance and want to visit the Dragon King of the Dragon Palace. Also, please tell the Dragon King that song Ta and old man Jian are here to visit.”<br/><br/>Song ta cupped his hands at the two experts of the dragon palace and said politely.<br/><br/>“HMM? The Justice Alliance?”<br/><br/>The two experts of the Dragon Palace nodded and immediately sent the message to Prime Minister Gui.<br/><br/>“Please follow me.”<br/><br/>Prime Minister Gui soon sent the message that the two experts of the Dragon Palace had brought them to the Dragon Palace.<br/><br/>“There are many auras of the experts. The Dragon Palace is not simple!”<br/><br/>When they arrived at the front of the Dragon Palace, they could faintly sense waves of powerful auras coming from the Dragon Palace.<br/><br/>This made song TA and the others look solemn.<br/><br/>Because the number of these auras was no less than fifty.<br/><br/>“Welcome to the Justice Alliance. I am Prime Minister Gui of the Dragon Palace. I have told the Dragon King about your arrival. The Dragon King should be here soon.”<br/><br/>Prime Minister Gui came to welcome them. He glanced at song Ta and the others and learned about their strength.<br/><br/>There were treasures of investigation here in the Dragon Palace.<br/><br/>The strength of the Four Great Dao Masters was directly detected.<br/><br/>Prime Minister Gui had to take seriously the experts of the Justice Alliance who came.<br/><br/>In addition, he also knew that song Ta and the Demon Sword knew the Dragon King.<br/><br/>“Hehe, sorry to bother you. I haven’t seen the Dragon King for a long time. I heard that the Dragon King has established a powerful alliance and his own strength has improved. I’m here to pay you a visit and also to clear up the misunderstanding.”<br/><br/>Song ta said with a smile.<br/><br/>“Song Ta, Brother Old Man Jian, and Saint Shantian. Long time no see!”<br/><br/>As soon as they finished speaking, Wang Xian flew over and said with a smile.<br/><br/>When Prime Minister Gui sent a message to him, Wang Xian had rushed over from the land of origin.<br/><br/>With an Lie’s ability, Wang Xian’s return journey was very smooth.<br/><br/>However, what he didn’t expect was that King Jin Xiu, who was killed by him, had also followed him.<br/><br/>Furthermore, he was here to resolve the misunderstanding.<br/><br/>It seemed that the leader of the Justice Alliance was very farsighted.<br/><br/>“Brother Wang Xian, it has been hundreds of millions of years since we last met. I didn’t expect you to reach a height that we can only look up to. Congratulations, Congratulations!”<br/><br/>Song Ta and the rest congratulated him with a smile.<br/><br/>“I’m just lucky!”<br/><br/>Wang Xian smiled modestly. “Let’s chat inside. It’s the first time that everyone is here. I have to entertain them properly!”<br/><br/>“Hehe, then I’ll have to trouble you, brother Wang Xian!”<br/><br/>Song Ta and the rest smiled, then, they continued, “Dragon King, this is King Jin Xiu of our Justice Alliance. He is also a powerful junior of ours. Jin Xiu might have had some conflicts with you, so please don’t mind it, Dragon King.”<br/><br/>“Dragon King, it’s my fault for what happened in the Demon Mountain Universe. I hope that you won’t hold a grudge against me!”<br/><br/>King Jin Xiu immediately bowed and lowered his attitude.<br/><br/>He had no choice. After understanding the overall strength of the Dragon Palace Alliance and his father’s evaluation of the Dragon King, all the dissatisfaction in King Jin Xiu’s heart disappeared.<br/><br/>Although he was very strong and had a deep background, the other party was a chaos-level existence.<br/><br/>Even his father had to treat this existence seriously, so how could he be arrogant?<br/><br/>“It’s just a small matter. I’ve been staying at the Justice League for some time and I have a good impression of the Justice League.”<br/><br/>Wang Xian waved his hand. He didn’t care about the embroidered king at all.<br/><br/>After all, he had made a huge profit by killing him last time.<br/><br/>Wang Xian wouldn’t mind if the other party came to apologize.<br/><br/>Most importantly, there was no need for him to shed all pretense of cordiality with the Justice League.<br/><br/>Befriending the justice alliance would be beneficial to the Dragon Palace Alliance.<br/><br/>“Thank you for your generosity, Dragon King!”<br/><br/>King Jin Xiu heaved a sigh of relief and said!<br/><br/>The group arrived at the Dragon King’s Palace.<br/><br/>Song Ta and the others were also shocked as they looked at the treasures and resources around the Dragon Palace.<br/><br/>The energy and resources here in the Dragon Palace were not something they could compare to.<br/><br/>They couldn’t even compare to their alliance leader.<br/><br/>The Justice Alliance and the Dragon Palace Alliance were different.<br/><br/>Although they were elders in the Justice Alliance, they couldn’t make the weak universe hand over treasures or resources.<br/><br/>The Alliance leader of the Justice Alliance was the same.<br/><br/>They had to find their own resources and treasures.<br/><br/>But the Dragon Palace was different. All who joined the Dragon Palace Alliance had to pay tribute.<br/><br/>It could be understood that the dragon palace was the king and the other members were the vassals.\t\t\t\t\t\t</div>", "images": {}, "success": true}