{"id": 1466, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075671.html", "title": "Chapter 4469 - Chapter 4469: 4468 Alliance Leader Of The Justice Alliance", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4469 - Chapter 4469: 4468 Alliance Leader Of The Justice Alliance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4469: 4468 alliance leader of the Justice Alliance<br/><br/>An ultimate treasure of Tianyuan.<br/><br/>This was definitely a huge opportunity.<br/><br/>However, Wang Xian had obtained it easily.<br/><br/>In addition, the storage space of King Jin Xiu and the storage space of the old man also contained a lot of treasures and resources.<br/><br/>Not to mention this bunch of corpses.<br/><br/>Two Great Dao level corpses. This was considered an extremely powerful opportunity for an ordinary universe.<br/><br/>For a universe, the value of these corpses far exceeded that of a heavenly fate treasure!<br/><br/>It could at least increase the number of heavenly fate experts in a universe.<br/><br/>“This… this group of experts was killed by the Dragon King?”<br/><br/>“Experts from the Justice Alliance? They’re from the Justice Alliance? That Brocade King is the son of the leader of the Justice Alliance. Doesn’t that mean that he’s the son of a chaos-level expert?”<br/><br/>“That King Jinxiu and that old man seem to be at the level of the Great Dao. However, they don’t even have the chance to resist when facing our Dragon King. They’re too strong. Every time our Dragon King makes a move, we feel extremely shocked.”<br/><br/>“The Dragon King has killed the experts of the Justice Alliance. The Justice Alliance won’t become enemies with our Dragon Palace Alliance, right? That King Jinxiu’s father is the leader of the Justice Alliance. Will he come to take revenge?”<br/><br/>“What are you afraid of? The Dragon King doesn’t care. What do we have to worry about? You should know that the Dragon King is also a chaos-level existence, and not an ordinary one at that.”<br/><br/>“That’s right, the Dragon King is invincible!”<br/><br/>At the back, the experts of the Demon Mountain universe watched this scene with their mouths Agape.<br/><br/>Whether it was the identity of that group of people or the Dragon King’s strength, they were all shocked!<br/><br/>“Alright, the matter here has been settled. Next, I will get Prime Minister Gui and the others to come over and make some arrangements. If another expert comes over, they will be able to react immediately.”<br/><br/>“Of course, if the Justice Alliance were to investigate a little, they wouldn’t come to your universe anymore. They would probably go to the land of origin. Hehe, don’t worry about it!”<br/><br/>Wang Xian looked at the experts from the Demon Mountain Universe and said with a smile.<br/><br/>“Thank you for your help, Dragon King. If the Justice Alliance really dares to attack our Dragon Palace Alliance, Our Demon Mountain Universe will never retreat.”<br/><br/>The experts from the Demon Mountain universe immediately replied respectfully to Wang Xian.<br/><br/>As soon as they informed the Dragon Palace about the incident in the Demon Mountain Universe, the Dragon King immediately rushed over.<br/><br/>This made them very touched.<br/><br/>Their sense of belonging to the Dragon Palace alliance had increased by a lot.<br/><br/>Now, they and the Dragon Palace Alliance were in the same boat.<br/><br/>They were in the same boat.<br/><br/>“Hehe, don’t worry, nothing will happen!”<br/><br/>Wang Xian smiled and shook his head.<br/><br/>He understood the Justice Alliance. The Justice Alliance was established to fight against the evil sequence camp.<br/><br/>The Justice Alliance didn’t dare to be enemies with the Dragon Palace Alliance, nor would they be enemies with the Dragon Palace Alliance.<br/><br/>Furthermore, this was an individual action of King Jin Xiu and the rest.<br/><br/>If their individual actions involved the entire Justice Alliance, the other powerhouses of the Justice Alliance would not agree either.<br/><br/>Not to mention making an enemy of such a powerful force like the Dragon Palace Alliance.<br/><br/>What if they really dared to make an enemy of the Dragon Palace Alliance? What if the Dragon Palace Alliance stabbed them in the back when the evil sequence camp invaded the Justice Alliance again?<br/><br/>If that was the case, the Justice Alliance would be finished.<br/><br/>Therefore, even if he knew that King Jin Xiu was the son of the leader of the Justice Alliance, Wang Xian did not care.<br/><br/>He would just kill them.<br/><br/>Even if there were no other factors, with Wang Xian’s strength, he would still dare to kill them directly.<br/><br/>Wang Xian did not stay in the Demon Mountain Universe for long. He returned to the Dragon Palace in a flash.<br/><br/>Buzz! Buzz<br/><br/>When he arrived at the Dragon Palace, he took out the Heaven’s origin creation treasure from King Jin Xiu’s body.<br/><br/>This was a water attribute Heaven’s origin creation treasure.<br/><br/>However, when he took it out, the entire Heaven’s origin creation treasure wanted to escape.<br/><br/>There was a powerful energy fluctuation and a special restriction on this treasure.<br/><br/>“It should be the restriction set up by King Jin Xiu’s father to prevent it from being taken away.”<br/><br/>Wang Xian mumbled.<br/><br/>This powerful restriction could not be broken if it was not at the chaos level.<br/><br/>This ultimate treasure of the Heaven’s origin creation would also leave in an instant.<br/><br/>However, Wang Xian was able to break this restriction.<br/><br/>Once the restriction was broken, he kept the ultimate treasure of the Heaven’s origin creation.<br/><br/>…<br/><br/>Buzz Buzz<br/><br/>Buzz Buzz<br/><br/>At the same time, in a mystical realm in the universe of justice.<br/><br/>A white-haired old man sat cross-legged in the middle of a pond, shrouded by a hazy mist.<br/><br/>The white-haired old man suddenly opened his eyes, and the surrounding mist immediately dispersed.<br/><br/>He frowned, and his expression was somewhat solemn. “Jin Xiu was actually killed? Even the heavenly creation true treasure has disappeared.”<br/><br/>He was somewhat surprised, and with a wave of his arm, a water curtain appeared in front of him, and he directly stepped into the water curtain!<br/><br/>The scene changed, and the old man came to an underground palace.<br/><br/>The sound of water flowing could be heard continuously.<br/><br/>In the center of the pool in front of him, there was a huge water lotus.<br/><br/>The water lotus slowly bloomed, revealing the figure of a middle-aged man.<br/><br/>The middle-aged man opened his eyes, and an angry expression immediately appeared on his face.<br/><br/>“Jin Xiu, how did you die?”<br/><br/>The Old Man’s voice reached Jin Xiu king’s ears, and he immediately looked up.<br/><br/>“Father!”<br/><br/>Jin Xiu king saw his father and immediately flew over respectfully. “Father, I was killed in a universe by an expert called the Dragon Palace Alliance. I couldn’t even sense my supreme treasure, and it was taken away by him.”<br/><br/>“Killed by an expert? The Dragon Palace Alliance? A primal chaos level existence?”<br/><br/>The white-haired old man looked at Jin Xiu king and looked at him.<br/><br/>“Yes, father. I didn’t have the slightest ability to resist him. He instantly killed me. Father, my heavenly Yuan Destiny Treasure…”<br/><br/>King Jin Xiu continued to speak.<br/><br/>But before he could finish, the white-haired old man waved his hand and interrupted him.<br/><br/>“A primal chaos level existence, Dragon Palace Alliance? Such an expert is too rare. Your weapon has been taken away by the other party. It will be very difficult to get it back.”<br/><br/>The white-haired old man frowned and said.<br/><br/>“Father, let’s just forget about it. The place I went to was the land of origin. There was no alliance there before, and the power of this alliance shouldn’t be very strong. Our Justice Alliance is definitely much stronger than theirs…”<br/><br/>“Stupid!”<br/><br/>As the Brocade King spoke, she was once again interrupted by the white-haired old man.<br/><br/>“An alliance that suddenly appeared, a primal chaos level existence that suddenly appeared. It is not something that can be casually provoked. Tell me why you were killed this time.”<br/><br/>The white-haired old man looked at his son and asked with a stern gaze.<br/><br/>“It’s father!”<br/><br/>The Brocade King shrunk her head and told him everything that had happened. She did not dare to hide it from her father.<br/><br/>“This time, it’s your own misfortune. I’ve been to the land of origin before. There was no alliance in the past, so it should have been established not long ago. The other expert said that he knew someone from the Justice Alliance?”<br/><br/>The white-haired old man muttered as he spoke.\t\t\t\t\t\t</div>", "images": {}, "success": true}