{"id": 1461, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075646.html", "title": "Chapter 4464 - Chapter 4464: Below The Land Of Origin", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4464 - Chapter 4464: Below The Land Of Origin</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4464: Below the land of origin<br/><br/>“The Dragon King Is Here!”<br/><br/>When the group of experts sat together and conversed.<br/><br/>Not long after, an expert sensed something and said in a low voice.<br/><br/>The voices in the hall suddenly stopped, and all the experts looked outside.<br/><br/>They looked respectfully at the young man who was walking towards them.<br/><br/>“Greetings, Dragon King!”<br/><br/>In the next moment, all the experts shouted from the bottom of their hearts!<br/><br/>“Everyone, please take a seat. This time, The Guardian Alliance joining Our Dragon Palace Alliance is a great event and a joyous occasion!”<br/><br/>Wang Xian came to the seat at the front and swept his gaze across all the experts’disciples with a smile.<br/><br/>“After witnessing your strength, Dragon King, we regret not joining the Dragon Palace Alliance earlier!”<br/><br/>Alliance master he cupped his hands and said regretfully.<br/><br/>“Yes, yes. If we had joined the Dragon Palace Alliance earlier, we wouldn’t have to worry so much!”<br/><br/>The experts of the Guardian Alliance immediately echoed!<br/><br/>“Hehe, it’s not too late. After you join the Dragon Palace Alliance, you will be a member of the Dragon Palace Alliance. The Dragon Palace Alliance is the only force in the land of origin.”<br/><br/>“As members of the same alliance, we will help each other and improve together.”<br/><br/>Wang Xian said with a smile.<br/><br/>“That’s for sure!”<br/><br/>The experts replied.<br/><br/>“Alright, Let’s return to the Palace of the Dragon Palace Alliance first. We officially welcome all of you to join us!”<br/><br/>As Wang Xian spoke, he waved his arm and a wave of energy enveloped them.<br/><br/>In the next moment, everyone could sense the changes in the surroundings.<br/><br/>They arrived at the Palace of the Dragon Palace Alliance in the land of origin.<br/><br/>The sudden change made everyone slightly shocked.<br/><br/>“They came directly to the Palace of the Dragon Palace Alliance in the land of Origin?”<br/><br/>All the experts were slightly shocked and revealed a shocked expression.<br/><br/>Wang Xian didn’t bring them here like an lie, who didn’t need the other party to resist.<br/><br/>With Wang Xian’s own strength, he could bring them here forcefully before they could react!<br/><br/>“He brought so many of us here directly. The Dragon King’s strength is really unfathomable!”<br/><br/>Prophet Hong could not help but comment!<br/><br/>“It’s just some small tricks!”<br/><br/>Wang Xian smiled slightly when he heard that.<br/><br/>Following that, the group of experts began to chat.<br/><br/>Firstly, the joining of the Universe Guardians Alliance required resources.<br/><br/>These resources were also enormous for the Dragon Palace.<br/><br/>They were no worse than when they destroyed the belief universe.<br/><br/>After the disciples of the Dragon Palace digested these resources, they would have no problem adding 20 to 30 heavenly Yuan blessed realm experts.<br/><br/>In addition, there was a powerful weapon similar to the Void Dragon Pool among these resources.<br/><br/>It also greatly improved the experts of the Dragon Palace.<br/><br/>“Dragon King, our land of origin is now the territory of the Dragon Palace Alliance. We are relatively safe during the calamity. Dragon King, should we explore other areas and look for resources?”<br/><br/>The ceremony of the Guardians joining the Dragon Palace Alliance ended, and The Guardian Alliance disappeared.<br/><br/>Jiu Yuan, a great dao expert, couldn’t help but ask!<br/><br/>“I don’t think we need to explore other places for now. Although all the universes around the land of origin have joined the Dragon Palace Alliance, we haven’t finished exploring the land of origin. There are still a lot of treasures and resources in the land of origin.”<br/><br/>Before Wang Xian could reply, an expert at the level of Great Dao replied from the side.<br/><br/>“You mean below the land of origin? That’s possible. I think we can join hands to explore the area below the land of origin. It’s said that there are thousands of chaos beasts below. This is a terrifying amount of resources!”<br/><br/>Prophet Hong and the rest couldn’t help but chime in.<br/><br/>Wang Xian nodded slightly when he heard their words.<br/><br/>The land of origin was basically the territory of the Dragon Palace Alliance.<br/><br/>Naturally, it was impossible for the members of the Dragon Palace Alliance to kill each other and plunder treasures.<br/><br/>In that case, it would be much more difficult for some powerhouses to obtain resources.<br/><br/>However, there was one place that had a huge amount of resources.<br/><br/>That was below the land of origin.<br/><br/>The area below the land of origin was like an extremely powerful universe.<br/><br/>There were no ordinary creatures there. All of them were heaven origin creation level existences.<br/><br/>Several thousand heaven origin creation level existences were much more powerful than the entire Dragon Palace Alliance.<br/><br/>However, although the chaos behemoths in the land of origin were powerful, they wouldn’t join forces.<br/><br/>To the experts of the Dragon Palace alliance, they were prey.<br/><br/>If they could kill a large number of giant beasts of chaos in the land of origin, the benefits would be unimaginable!<br/><br/>“By eliminating the giant beasts of chaos in the land of origin, we can indeed obtain a large number of resources quickly.”<br/><br/>Wang Xian said, “However, it won’t be that easy. There are indeed giant beasts of chaos in the land of origin. We can’t be sure how many of them there are.”<br/><br/>“HMM? Dragon King, did you encounter a chaos-level existence below you?”<br/><br/>Prophet Hong and the rest were slightly shocked as they asked.<br/><br/>“Yes, I encountered a chaos-level existence. Its strength is not bad. At least four to five great dao-level experts can barely contend with it. This is under the condition that four to five great dao-level experts have to work together.”<br/><br/>Wang Xian nodded. “Other than chaos-level existences, there is also the chaos Behemoth tribe. I have also encountered a tribe with 30 to 40 chaos behemoths. There are two great dao-level existences in this tribe. If we work together to deal with this tribe, we can destroy it.”<br/><br/>“Is it that strong? However, if we have you, Dragon King, with our strength, chaos-level existences can surround and kill. is hunting chaos-level alright?”<br/><br/>Jiu Yuan spoke with a burning gaze!<br/><br/>“We can hunt and kill them!”<br/><br/>Wang Xian smiled and said, “Everyone should know about the death mark under the land of origin. This death mark is a little strange. Furthermore, we are still unable to determine how many chaos-level existences there are in the land of origin. If the others come over when we surround and kill one of them, we will be in big trouble.”<br/><br/>“Let’s not fully invade the location below the land of origin for the time being. I will check it out. If there are only one or two chaos-level existences below the entire land of origin, we can take action.”<br/><br/>“Also, if you guys are interested, you can form a team to hunt some individual chaos behemoths.”<br/><br/>Wang Xian spoke to them one by one.<br/><br/>Currently, the entire area around the land of origin had joined the Dragon Palace Alliance.<br/><br/>It would not be so easy to obtain a large amount of resources.<br/><br/>However, there was a resource vault beneath the land of origin.<br/><br/>Although it was a little dangerous, it was not impossible to conquer it.<br/><br/>If they could completely conquer the area beneath the land of origin, it would be extremely terrifying for the improvement of the Dragon Palace.<br/><br/>They could plan it out.<br/><br/>The Stone of origin was also very important to Wang Xian.\t\t\t\t\t\t</div>", "images": {}, "success": true}