{"id": 1467, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075676.html", "title": "Chapter 4470 - Chapter 4470: 4469 Justice Alliance Came To Express Their Goodwill", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4470 - Chapter 4470: 4469 Justice Alliance Came To Express Their Goodwill</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4470: 4469 Justice Alliance came to express their goodwill<br/><br/>The Justice Alliance could not underestimate the birth of a chaos-level powerhouse.<br/><br/>They could not easily offend him.<br/><br/>Even if his son was killed by him, even if he took away his son’s Heavenly Yuan Destiny Treasure.<br/><br/>As a chaos-level powerhouse, he knew how terrifying this level was.<br/><br/>“Send someone to investigate this Dragon Palace Alliance. Remember, don’t rashly offend them.”<br/><br/>The Alliance Master of the Justice Alliance instructed his son.<br/><br/>“It’s father!”<br/><br/>Although the Brocade King was unwilling, he didn’t dare to disobey.<br/><br/>He also knew how powerful primal chaos experts were.<br/><br/>He also knew that he couldn’t rashly provoke them.<br/><br/>He just felt a little unwilling.<br/><br/>The Justice Alliance began to investigate some problems with the Dragon Palace Alliance.<br/><br/>With the current development of the Justice Alliance, all the information about the Dragon Palace alliance, including some information about the land of origin, was quickly transmitted to the Alliance Master of the Justice Alliance.<br/><br/>“The entire land of origin has been unified by the Dragon Palace? To join the Dragon Palace Alliance, we need to give the Dragon Palace a lot of resources and treasures?”<br/><br/>The leader of the Justice Alliance looked at the information sent by his subordinates and was a little shocked.<br/><br/>If there was a universe that wanted to join the Justice Alliance, they could join it at will.<br/><br/>Even if a powerful universe joined the Justice Alliance, it would give them some benefits.<br/><br/>However, the Dragon Palace Alliance needed to give them a lot of resources and treasures if they joined.<br/><br/>That wasn’t the most important thing. The most important thing was that the Dragon Palace alliance had unified the land of origin.<br/><br/>The entire land of origin!<br/><br/>Even Six Great Dao existences had joined the Dragon Palace Alliance.<br/><br/>“The Dragon Palace Alliance is much stronger than I imagined.”<br/><br/>“This Dragon Palace Dragon King’s battle record? His strength is definitely not at the level of the Primal Chaos Realm!”<br/><br/>The Justice Alliance murmured as he continued to read the information.<br/><br/>When he saw some information about the Dragon Palace Dragon King, his face showed a hint of solemnity.<br/><br/>“I really didn’t expect that he really knew the experts of the Justice Alliance. Moreover, they stayed in the chaotic area for quite a long time. This Dragon King broke through to the primal chaos realm so quickly. Did he get treasures in the chaotic area?”<br/><br/>The leader of the Justice Alliance murmured and kept guessing.<br/><br/>“Go and call song ta, the Demon Sword, and Saint Shantian over.”<br/><br/>The leader of the Justice Alliance looked at his subordinates and ordered.<br/><br/>“It’s the leader.”<br/><br/>His subordinates immediately left and began to contact song ta, the Demon Sword, and Saint Shantian.<br/><br/>The position of the leader of the Justice Alliance in the Justice Alliance was unquestionable. Song Ta and the others quickly rushed over after they received the information.<br/><br/>“Leader, May I know why you summoned the three of us?”<br/><br/>Song Ta and the others cupped their hands toward the leader of the Justice Alliance and asked curiously.<br/><br/>“Hehe, there’s a file here about the Dragon Palace alliance in the land of origin. Take a look and see if you know the leader of the Dragon Palace Alliance, the Dragon King of the Dragon Palace!”<br/><br/>The leader of the Justice Alliance smiled and gestured for them to sit down. Then, the files flew to them one by one.<br/><br/>“Huh?”<br/><br/>When they saw the information on the documents, they were astonished.<br/><br/>“This… is brother Wang Xian, the Dragon King of the nine-origin universe. It’s him. Brother Wang Xian has actually broken through to the Heavenly Yuan blessed realm?”<br/><br/>Song Ta looked at the information on the documents with a look of shock on his face.<br/><br/>“It’s indeed brother Wang Xian. He has actually established a powerful alliance. The speed of his growth is too terrifying!”<br/><br/>Mo Jian’s eyes also focused as he exclaimed in astonishment.<br/><br/>“Good fellow. It has been a while since we last met, but the Dragon King has actually reached such a level.”<br/><br/>Saint Shan Tian was also shocked.<br/><br/>They had crossed paths with Wang Xian many times. Saint Shan Tian had even crossed paths with Wang Xian before.<br/><br/>However, he did not expect the other party to reach such a terrifying level after not seeing him for hundreds of millions of years!<br/><br/>“Jin Xiu went to the land of origin to look for opportunities. She had a conflict with the members of the Dragon Palace Alliance, and the Dragon King killed them easily.”<br/><br/>“According to the search information, the Dragon King of the Dragon Palace is not a simple chaos-level powerhouse.”<br/><br/>“Of course, although this happened, we can’t have a conflict with the Dragon Palace Alliance.”<br/><br/>The Alliance Master of the Justice Alliance said, “Since you know the Dragon King, I want you to pay him a visit and make friends with more powerful people. It’s also good for the Justice Alliance. Also, let Jinxiu go with you and apologize.”<br/><br/>“HMM?”<br/><br/>Song Ta and the others nodded slightly.<br/><br/>“According to the information on the data, the Dragon King killed three Great Dao experts from the evil sequence camp among the eight Great Dao experts. Is this true? Alliance master, can you guess how powerful the Dragon King Is?”<br/><br/>Saint Shan Tian looked at the information on the data and couldn’t help but ask the Alliance master.<br/><br/>“I might not be able to do it.”<br/><br/>The Alliance Master of the Justice Alliance said after a moment of silence.<br/><br/>He was also shocked when he saw the information.<br/><br/>The Dragon King of the Dragon Palace dared to directly attack and kill three Great Dao experts while facing more than 200 heaven origin creation realm experts from the evil sequence faction.<br/><br/>He might not be able to achieve such strength.<br/><br/>This was also why the Alliance leader of the Justice Alliance didn’t have any intention of making an enemy out of the Dragon Palace Alliance.<br/><br/>The Dragon King of the Dragon Palace was stronger than expected.<br/><br/>“Hiss, this…”<br/><br/>The Demon Sword Saint Shan Tian and the others were slightly surprised.<br/><br/>Although the Alliance leader of the Justice Alliance wasn’t the strongest person in the Justice Alliance, he was still the only chaos-level existence.<br/><br/>He had been at the chaos level for more than 50 billion years.<br/><br/>He actually knew that there might be a gap between him and the Dragon King?<br/><br/>Was the Dragon King that he knew and the Wang Xian brother too strong?<br/><br/>“I really didn’t expect that.”<br/><br/>Demon sword sighed slightly.<br/><br/>“Alliance leader, then let’s go to the Dragon Palace alliance with Jin Xiu. Our relationship with the Dragon King is quite good and we have many dealings with him. The Dragon King is also a good person.”<br/><br/>Song Ta looked at the Alliance Master of the Justice Alliance and said.<br/><br/>“Okay, invite him. If you have nothing to do, you can come to the Justice Alliance as a guest. In addition, you can carry out some more in-depth cooperation, such as resource transactions.”<br/><br/>The Alliance Master of the Justice Alliance Thought for a moment and said, “You’re also elders of the Justice Alliance. You can discuss some things on your own.”<br/><br/>“Yes, leader.”<br/><br/>Song Ta and the rest nodded.<br/><br/>Not long after, song ta and the rest rushed toward the land of origin.<br/><br/>…<br/><br/>At the same time, after Wang Xian settled the matter of the Demon Mountain universe, it caused quite a stir in the Dragon Palace Alliance.<br/><br/>Especially after they learned that the Dragon King had killed the son of the leader of the Justice Alliance.<br/><br/>However, the members of the Dragon Palace League were not afraid at all. Instead, they were even more excited.\t\t\t\t\t\t</div>", "images": {}, "success": true}