{"id": 1465, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075666.html", "title": "Chapter 4468 - Chapter 4468: 4467, The Son Of The Alliance Leader Of The Justice Alliance? Kill!", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4468 - Chapter 4468: 4467, The Son Of The Alliance Leader Of The Justice Alliance? Kill!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4468: 4467, the son of the Alliance leader of the Justice Alliance? Kill!<br/><br/>“You came to the territory of our Dragon Palace Alliance and didn’t even know about our existence, HMPH!”<br/><br/>“You have to pay a price for killing the experts of our Dragon Palace Alliance!”<br/><br/>The control-level expert from the Mandrill universe had a cold expression on his face when he heard their words.<br/><br/>With the Dragon King by his side, he wasn’t afraid of the experts in front of him at all!<br/><br/>“We are just wandering in the universe. They are courting death and offending us. It’s already good enough that we didn’t start a massacre!”<br/><br/>The eyes of the great dao-level elder flickered slightly when he heard their words.<br/><br/>The name of the Dragon Palace Alliance also made him take it seriously.<br/><br/>After all, this was an area that they had yet to touch. If there really was an alliance here, he had to be vigilant!<br/><br/>“Are you guys from the Justice Alliance?”<br/><br/>In the time it took for them to speak, Wang Xian had already used his divination technique to divine where they came from.<br/><br/>As his gaze swept past them, Wang Xian raised his eyebrows.<br/><br/>“Oh? You recognize us?”<br/><br/>Jin Xiu Wang looked at Wang Xian with a surprised expression.<br/><br/>“I know some powerhouses from the Justice Alliance.”<br/><br/>Wang Xian said faintly.<br/><br/>At this moment, he suddenly thought of something.<br/><br/>The relationship between Wang Xian and the Justice Alliance should be pretty good.<br/><br/>In particular, he got to know a few of the higher-ups of the Justice Alliance. He had also sold many treasures and resources to the Justice Alliance.<br/><br/>The only thing that made Wang Xian a little unhappy was that the fragment of the god of elements that he had set up in the chaotic region had been stolen inexplicably.<br/><br/>At that time, Wang Xian was unable to find out who the thief was even with his divination lamp.<br/><br/>Although he didn’t care too much about these elemental gods, the value of these elemental gods was comparable to a complete corpse of a control-level space beast!<br/><br/>After all, he had only obtained the fragment of the Elemental God from the center of the chaotic region.<br/><br/>At the thought of this, Wang Xian was prepared to investigate to see which reckless fellow dared to steal his things!<br/><br/>“Oh? Who Do you know?”<br/><br/>When the king of Brocade heard Wang Xian’s words, the corners of her mouth curled up slightly as she asked.<br/><br/>“Seeing that we know each other, whoever killed a member of the Dragon Palace Alliance will come out and commit suicide. After that, they will compensate some of the items. This will be the end of it!”<br/><br/>Wang Xian did not answer his question. Instead, he continued to speak indifferently!<br/><br/>“HMM?”<br/><br/>However, his words stunned King Jin Xiu and the rest. They were stunned.<br/><br/>“Haha, interesting, really interesting!”<br/><br/>King Jin Xiu could not help but laugh when he heard Wang Xian’s words.<br/><br/>His position in the Justice Alliance was very high.<br/><br/>Now that he was here, someone actually said that he wanted them to kill themselves just because they knew each other?<br/><br/>This was simply hilarious!<br/><br/>“I don’t know what kind of Bullsh * T alliance you guys are, but let me tell you. I Am the King of Jin Xiu of the Justice Alliance. Get out of our sight immediately. Otherwise, you guys can stay here.”<br/><br/>The King of Jin Xiu put away the smile on his face and stared coldly at Wang Xian and the rest.<br/><br/>“Hehe!”<br/><br/>When Wang Xian heard his words, he smiled faintly instead.<br/><br/>In the next instant, he started to move.<br/><br/>“Cough Cough!”<br/><br/>Before anyone could react, Wang Xian’s palm was already pressed on King Jin Xiu’s neck.<br/><br/>A powerful force restrained his body and slowly grabbed him up.<br/><br/>This made King Jin Xiu’s face turn red. His eyes were wide open and filled with disbelief.<br/><br/>His face was filled with shock!<br/><br/>“What?”<br/><br/>At the side, the old man’s expression changed drastically. His body trembled and he wanted to help.<br/><br/>Boom<br/><br/>However, at the next moment, an extremely vast energy enveloped him.<br/><br/>It was as if he was trapped in a swamp and couldn’t move.<br/><br/>He could only tremble and stare at Wang Xian in disbelief.<br/><br/>“How is this possible?”<br/><br/>He couldn’t believe the scene in front of him.<br/><br/>They were actually instantly imprisoned by this youth in front of them.<br/><br/>They were existences at the Great Dao level.<br/><br/>The other party’s strength? ?<br/><br/>Primal Chaos Level!<br/><br/>Damnit, they had just arrived in a universe when they actually encountered a primal chaos level existence.<br/><br/>“Stop, let go of our Lord King Jin Xiu!”<br/><br/>In the surrounding area, the heavenly fate realm experts were all stunned!<br/><br/>They roared in shock and anger, but soon after, they felt shadows attacking them one by one.<br/><br/>The speed of the shadows was too fast.<br/><br/>It was so fast that it reached a terrifying level.<br/><br/>Before they could react, the shadows had already penetrated their bodies.<br/><br/>They didn’t even have the chance to scream. They didn’t even have the chance to use their true treasures to escape before they were killed!<br/><br/>“Sir, please don’t Kill Us. There is a misunderstanding between us!”<br/><br/>The expression of the great dao-level elder changed drastically as he shouted in horror!<br/><br/>This was definitely a primal chaos-level existence.<br/><br/>They had somehow offended a primal chaos-level powerhouse!<br/><br/>“There is no misunderstanding. You dared to kill members of my Dragon Palace Alliance at the cost of your lives. I gave you a chance just now, but you didn’t cherish it.”<br/><br/>Wang Xian stared at them coldly and said indifferently.<br/><br/>When this king Jin Xiu spoke to him so arrogantly, the outcome was already determined!<br/><br/>“No, if you dare to kill me, my father will not let you off. My father is the leader of the Justice Alliance. Even if you are strong, my father and the rest will not let you off!”<br/><br/>“Let us off, let us off and let’s just forget about it now!”<br/><br/>King Jin Xiu’s face was flushed red as she growled at Wang Xian!<br/><br/>“The Alliance leader of the Justice Alliance is your father? No wonder he is so arrogant. It’s a pity that this is not your Justice Alliance but the Dragon Palace Alliance!”<br/><br/>“Die!”<br/><br/>Wang Xian waved his arm and a powerful force surged into King Jin Xiu’s body!<br/><br/>Buzz! Buzz! Buzz<br/><br/>At this moment, King Jin Xiu’s body erupted with a kind of resistance. This resistance was extremely strong.<br/><br/>The strength that erupted was also close to the chaos level!<br/><br/>It was obvious that it was the defense that his father had set up in his body.<br/><br/>In addition, the escape treasure in his body automatically activated!<br/><br/>Crack Crack<br/><br/>However, before he could escape, Wang Xian exerted force with his palm. An even more terrifying force instantly destroyed the defense in King Jin Xiu’s body.<br/><br/>Furthermore, it restrained the escape treasure that was about to be activated!<br/><br/>At the same time, blood flowed out of King Jin Xiu’s seven orifices. She died instantly!<br/><br/>“You killed King Jin Xiu. You will provoke a huge alliance, a powerful faction!”<br/><br/>The old man at the side saw that Wang Xian had killed King Jin Xiu directly. His expression changed drastically as he roared in shock and anger!<br/><br/>“Since you have come here, you must abide by the rules of our Dragon Palace Alliance. Die!”<br/><br/>Wang Xian waved his arm and killed the old man.<br/><br/>King Jin Xiu’s strength was on one great dao and two mastery levels.<br/><br/>This old man was much weaker!<br/><br/>With Wang Xian’s current strength, killing them was a piece of cake.<br/><br/>“I have quite a good harvest!”<br/><br/>Wang Xian kept the corpses one by one. When he sensed the ultimate treasure of Tianyuan in King Jin Xiu’s body, he smiled.\t\t\t\t\t\t</div>", "images": {}, "success": true}