{"id": 1464, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075661.html", "title": "Chapter 4467 - Chapter 4467: Under The Powerhouses Of The Justice Alliance", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4467 - Chapter 4467: Under The Powerhouses Of The Justice Alliance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4467: Under the powerhouses of the Justice Alliance<br/><br/>“The powerhouses from the universe further away have entered the Mandrill Universe?”<br/><br/>“They didn’t invade wantonly?”<br/><br/>Wang Xian raised his eyebrows slightly when he heard Prime Minister Gui’s words.<br/><br/>Naturally, the other party wasn’t a powerhouse from the Dragon Palace Alliance.<br/><br/>In that case, there were only powerhouses from the universe further away.<br/><br/>Regardless, the Dragon Palace alliance had to take care of the matter of the powerhouses of the Dragon Palace Alliance being killed.<br/><br/>According to the rules of the Dragon Palace Alliance, if the experts of the Dragon Palace Alliance were attacked in the area of the land of origin, the Dragon Palace would protect them.<br/><br/>If the experts of the Dragon Palace Alliance were killed in the area of the land of origin, the Dragon Palace wouldn’t make a move.<br/><br/>In the end, the experts of the Dragon Palace Alliance wouldn’t make a move even if they were attacked and killed in the area of the land of origin.<br/><br/>The members of the Dragon Palace Alliance naturally had no objections to this.<br/><br/>Now that there were experts from other universes killing the experts of the Dragon Palace Alliance, the Dragon Palace naturally had to take care of it.<br/><br/>In addition, Wang Xian was also curious about which universe the experts were from.<br/><br/>“I’ll go over and take a look. Ask the experts of the Mandrill Universe to contact me!”<br/><br/>Wang Xian spoke to Prime Minister Gui.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui immediately nodded and replied.<br/><br/>Wang Xian moved his body and disappeared immediately. He appeared at the center of the Mandrill Universe.<br/><br/>Every universe in the Dragon Palace Alliance had a demon spirit altar set up. It was very easy for him to reach any universe.<br/><br/>Buzz Buzz<br/><br/>Not long after Wang Xian arrived at the Mandrill universe, his communication device rang.<br/><br/>He took a look and saw that it was a message from the expert of the mountain demon universe.<br/><br/>The mountain demon universe was not weak. It was someone who later joined the Dragon Palace Alliance.<br/><br/>There was one control-level expert and three beginner-level experts in the entire universe.<br/><br/>Now, all the experts of the mountain demon universe had rushed over.<br/><br/>This was because the expert of the mountain demon universe who was killed had informed him that there were more than a dozen people on the other side.<br/><br/>Under normal circumstances, only an expert in the Tianyuan blessed realm would travel such a long distance to another universe.<br/><br/>Therefore, it was very likely that all of them were in the Tianyuan blessed realm.<br/><br/>When Wang Xian saw the information of the expert from the Mandrill Universe, he immediately teleported in a direction.<br/><br/>Over there, it was the lair of the experts from the Mandrill universe.<br/><br/>The experts who had killed the Mandrill universe had yet to leave the Mandrill universe and were located on a planet in the Mandrill universe.<br/><br/>Wang Xian teleported quickly.<br/><br/>The mutated space energy allowed his teleportation to reach a terrifying level.<br/><br/>With a thought, he appeared countless light years away.<br/><br/>With his powerful strength and the mutated space energy, it would only take him a hundred years to travel from one side of the universe to the other.<br/><br/>A few days later, Wang Xian arrived at the planet where the experts from the Demon Mountain universe were located.<br/><br/>Sensing four auras, he teleported to a palace where the four auras were located.<br/><br/>A faint aura was emitted.<br/><br/>“Dragon King!”<br/><br/>The four experts from the demon mountain universe who sensed something immediately flew over.<br/><br/>They looked at Wang Xian and walked over excitedly.<br/><br/>“Where is he? Bring me there.”<br/><br/>Wang Xian looked at them and instructed.<br/><br/>“It’s the Dragon King!”<br/><br/>The old man in the middle replied immediately. Then, he pointed to the void in the distance and said, “Sir Dragon King, they are in a life planet in front of us. They are not very far away from us.”<br/><br/>Wang Xian nodded his head. A wave of energy enveloped them and brought them to teleport away quickly.<br/><br/>“Dragon King, the opponent is not weak. There are a total of 14 of them. A middle-aged man attacked me and killed me directly. He should have the strength of a controller.”<br/><br/>“That middle-aged man is not their central figure. Their central figure is a middle-aged man and an old man. These two people should be stronger, but I can’t guess their bottom line.”<br/><br/>When Wang Xian brought them there, a middle-aged man reminded them.<br/><br/>He was the expert from the Mandrill universe who had been killed.<br/><br/>Facing the 14 experts from other universes, he was a little frightened.<br/><br/>Fortunately, they were no longer members of the Dragon Palace Alliance like before.<br/><br/>This time, the Dragon King had come personally.<br/><br/>This made them feel much more at ease.<br/><br/>Otherwise, even if all the powerhouses in the mountain demon universe gathered together, they wouldn’t have any good ideas against that group of people.<br/><br/>“What exactly did the other party come to the mountain demon universe for?”<br/><br/>Wang Xian asked him.<br/><br/>“We don’t know. We don’t know the exact details either.”<br/><br/>The only control-level powerhouse in the mountain demon universe shook his head.<br/><br/>“Then we can only go over and ask.”<br/><br/>Wang Xian nodded his head.<br/><br/>He did not ask more about why these more than ten heaven origin creator-level powerhouses killed the powerhouses in the Mandrill universe.<br/><br/>No matter what, the other party had crossed the line.<br/><br/>Crossing the line was wrong!<br/><br/>“Is it the universe in front?”<br/><br/>Wang Xian looked at the planet in front before asking.<br/><br/>“Yes, Dragon King!”<br/><br/>The experts from the Mandrill universe nodded their heads.<br/><br/>Wang Xian looked over and sensed it carefully.<br/><br/>As they got closer, he could feel it completely.<br/><br/>There were indeed 14 heaven origin blessed realm experts. Two of them had even reached the Great Dao level.<br/><br/>With such a high realm, they were terrifying existences no matter where they were.<br/><br/>Now, there were two of them at once.<br/><br/>This made Wang Xian even more curious about which universe they came from.<br/><br/>“There are indeed 14 powerhouses.”<br/><br/>Wang Xian spoke.<br/><br/>These 14 powerhouses were eating delicacies and chatting in an aerial restaurant.<br/><br/>They had yet to sense Wang Xian’s arrival.<br/><br/>With a flash, Wang Xian arrived at the interior of this aerial garden.<br/><br/>When he appeared, the auras of a few powerhouses from the demon mountain universe were sensed by the other party.<br/><br/>“Powerhouses in the Saint Realm.”<br/><br/>The 14 powerhouses in the Heaven’s origin realm sensed the aura of the powerhouses from the Demon Mountain Universe. They focused their gaze slightly and immediately looked in the direction of Wang Xian and the rest.<br/><br/>When they saw Wang Xian and the rest, they narrowed their eyes slightly.<br/><br/>“It’s that guy who was killed by us. He actually brought people here.”<br/><br/>One of the powerhouses looked at the powerhouse in the Heaven’s origin realm who was killed by them and said with a cold gaze.<br/><br/>“Five? Isn’t that enough?”<br/><br/>A middle-aged man also looked over. There was a hint of disdain in his tone!<br/><br/>While they were sizing up Wang Xian, Wang Xian was also sizing them up.<br/><br/>“Which universe are you guys from? How dare you come to Our Dragon Palace Alliance’s territory to cause trouble?”<br/><br/>Wang Xian landed on the two great dao level powerhouses and questioned them expressionlessly.<br/><br/>“Oh? What is the Dragon Palace Alliance? You guys are all powerhouses from the Demon Mountain Universe? Why? Are you here to court death?”<br/><br/>King Jin Xiu sensed the aura of Wang Xian and the rest. Although they could not sense Wang Xian’s aura, he was probably at most at the Great Dao level.<br/><br/>He could not even reach the level of the Great Dao.<br/><br/>After all, a powerhouse at this level was not some cabbage!\t\t\t\t\t\t</div>", "images": {}, "success": true}