{"id": 1463, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075656.html", "title": "Chapter 4466 - Chapter 4466: 4,465 Experts From The Justice Alliance", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4466 - Chapter 4466: 4,465 Experts From The Justice Alliance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4466: 4,465 experts from the Justice Alliance<br/><br/>Time passed day by day.<br/><br/>Wang Xian’s strength was also improving steadily.<br/><br/>The degree of fusion with the primal chaos stone was also improving rapidly.<br/><br/>After more than 100,000 years, the last piece of the origin stone was completely absorbed by Wang Xian.<br/><br/>“Phew!”<br/><br/>Feeling the strength in his body, a smile appeared on Wang Xian’s face.<br/><br/>Now, his strength had reached two levels of chaos. One was at the Great Dao level, and the other was at the control level!<br/><br/>He had directly increased his strength by twelve beginner levels.<br/><br/>This speed of improvement was too terrifying!<br/><br/>“I’ll continue to go to the land of origin later.”<br/><br/>Wang Xian stretched his body and made a decision in his heart.<br/><br/>He decided to increase the fusion rate of the primal chaos stone to 100% in the land of origin. At that time, he would see what changes he could make!<br/><br/>“However, before that, I’ll accompany Shu Qing and the other girls and watch the cultivation of the disciples of the Dragon Palace!”<br/><br/>Wang Xian moved and arrived at the group of girls.<br/><br/>The group of girls were preparing to give birth to dragon children.<br/><br/>It was not easy to give birth to a child when one’s strength had reached their level.<br/><br/>Furthermore, giving birth to a child was different from normal reproduction.<br/><br/>The girls’strength had all reached the Heavenly Yuan blessed realm. It would take a long time for the children to have strong talent and heritage.<br/><br/>After spending some time with the girls, they would take a look at the cultivation of the strong disciples of the Dragon Palace.<br/><br/>Now, the strength of the eight million disciples of the Dragon Palace were all above level five universe masters!<br/><br/>There was nothing they could do. The Dragon Palace had too many resources!<br/><br/>After destroying the universe of faith, the disciples of the Dragon Palace rapidly improved.<br/><br/>In addition, the resources of the Dragon Palace hadn’t been cut off for hundreds of millions of years.<br/><br/>There were many corpses of Heavenly Yuan blessed realm experts buried below the Dragon Palace. The energy and radiation from these corpses made the disciples of the Dragon Palace improve at a terrifying speed!<br/><br/>In addition, the treasures around the Dragon Palace, such as the Divine Tree and divine grass, were countless.<br/><br/>These were resources obtained from several universes.<br/><br/>The resources of several universes were only used to nurture a few million disciples. One could imagine!<br/><br/>Any servant or soldier in the Dragon Palace would be a powerhouse in the nine-origin universe.<br/><br/>The number of disciples at the peak of the ruler realm had reached 700, which was not a small number.<br/><br/>However, it would be more difficult for them to improve.<br/><br/>Usually, the powerful disciples of the Dragon Palace were sparring.<br/><br/>Prime Minister Gui also set up a list in the Dragon Palace.<br/><br/>One was the list of disciples.<br/><br/>The list of disciples was divided into two. One was the list of disciples at the peak of the ruler realm.<br/><br/>The other was the list of disciples below the peak of the ruler realm.<br/><br/>There was also a list of disciples at the Heavenly Yuan blessed realm who were extremely powerful!<br/><br/>The distribution of resources in the Dragon Palace was based on this list.<br/><br/>The strongest person in the Heavenly Yuan blessed realm of the Dragon Palace was undoubtedly Mo Sha.<br/><br/>The second was bei Shuang.<br/><br/>The third was the leader of the Light Dragon God.<br/><br/>The fourth-ranked person was the leader of the Fire Dragon God.<br/><br/>He was one of the top four experts of the Dragon Palace.<br/><br/>Both the leader of the Light Dragon God and the Fire Dragon God possessed a heavenly yuan destiny treasure.<br/><br/>The higher the ranking, the more nurturing resources one would receive.<br/><br/>Some powerful treasures would also be distributed according to the ranking.<br/><br/>Of course, apart from the ranking, the Dragon Palace also set up some points.<br/><br/>Prime Minister Turtle would arrange the various management methods.<br/><br/>He would ensure the fairness and competition of the Dragon Palace.<br/><br/>Currently, the environment and atmosphere of the entire Dragon Palace were very good.<br/><br/>…<br/><br/>“King Jin Xiu, the primal chaos void in front can be considered the periphery of our Justice Alliance’s domain. This place is already a very remote place for us!”<br/><br/>“However, this region is also known as the region of origin. The region of origin is similar to the chaotic region. The Cosmos ahead is considered the outermost region of the region of origin.”<br/><br/>At the same time, in the primal chaos void at the edge of the region of origin.<br/><br/>Over a dozen figures were floating in the air and flying rapidly.<br/><br/>In the middle, an old man was introducing to the middle-aged man beside him!<br/><br/>“Oh? Right now, our Justice Alliance has already radiated a large area. Although the chaos region isn’t bad, we can’t find any treasures there.”<br/><br/>The middle-aged man called Jin Xiu Emperor said.<br/><br/>“We can go to some of the universes here to see if there are any treasures or opportunities. We can also go to the land of origin to take a look.”<br/><br/>The old man spoke.<br/><br/>“Yes, I wonder if the universe here is strong!”<br/><br/>Brocade emperor nodded indifferently.<br/><br/>As they spoke, they quickly flew into a universe ahead.<br/><br/>“Isn’t this universe very strong?”<br/><br/>The group of experts entered and began to tour.<br/><br/>They were experts from the Justice Alliance.<br/><br/>Two Great Dao level existences, and over a dozen new and control level existences.<br/><br/>This group of people was very strong.<br/><br/>And they had come here to look for opportunities and treasures.<br/><br/>The Apocalypse had begun. After experiencing the great war with the evil sequence faction, the Justice Alliance’s experts had also entered the stage of recuperation.<br/><br/>After recuperating for hundreds of millions of years, they wanted to look for opportunities and treasures.<br/><br/>Basically, all the treasures and opportunities in the Justice Union had already been taken.<br/><br/>Therefore, they flew for a long time and arrived at this area.<br/><br/>This was the closest area to the Justice Union.<br/><br/>…<br/><br/>Time passed by slowly.<br/><br/>After Wang Xian stayed in the Dragon Palace for a few thousand years, he was ready to continue to the land of origin.<br/><br/>However, at this moment, a piece of information was suddenly transmitted to him, causing Wang Xian to be slightly stunned.<br/><br/>“Dragon King, there are experts in the Mandrill universe. A Heaven origin creator in the Mandrill Universe was killed. Now, the experts in the Mandrill universe are requesting for help from the Alliance!”<br/><br/>Prime Minister Gui stood in front of Wang Xian and reported.<br/><br/>“Huh?”<br/><br/>When Wang Xian heard this piece of information, he was also slightly stunned.<br/><br/>Right now, the land of origin belonged to the territory of the Dragon Palace Alliance.<br/><br/>There was actually a universe that dared to invade the Demon Mountain Universe?<br/><br/>“What’s the specific situation? Has the Demon Mountain Universe been invaded?”<br/><br/>Wang Xian raised his eyebrows and asked.<br/><br/>“Dragon King, the Demon Mountain Universe has not been invaded wantonly. However, there are experts in the Demon Mountain Universe. Some creatures in the demon mountain universe provoked them and were directly exterminated by them.”<br/><br/>“And the ones who were exterminated happened to be the descendants of several powerful beings in the demon mountain universe. Therefore, a powerful being who had just entered the Demon Mountain Universe returned to the universe and wanted to kill the other party. However, he did not expect that their strength was so terrifying that they killed the other party in an instant!”<br/><br/>“They are powerful beings from other universes. As for which universe they are from, we do not know.”<br/><br/>“In addition, the Demon Mountain Universe is located in the region of origin. It is considered a relatively remote location. They should be powerful beings from a universe further away.”<br/><br/>Prime Minister GUI reported.\t\t\t\t\t\t</div>", "images": {}, "success": true}