{"id": 1460, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075641.html", "title": "Chapter 4463 - Chapter 4463: 4462 Heavenly Fate Supreme Treasure", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4463 - Chapter 4463: 4462 Heavenly Fate Supreme Treasure</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4463: 4462 heavenly fate Supreme Treasure<br/><br/>…<br/><br/>…<br/><br/>Hearing Alliance master he’s words, the experts of the Guardian Alliance opened their mouths and smiled.<br/><br/>If they joined the Dragon Palace Alliance, there would be nearly 60 universes in the Dragon Palace Alliance.<br/><br/>All 60 universes belonged to the Dragon Palace Alliance, which was a very powerful force.<br/><br/>Although it was still inferior to the Justice Alliance’s evil faction, it was still powerful enough.<br/><br/>Most importantly, the Dragon Palace Alliance had experts from the Guardian Alliance.<br/><br/>The Dragon King of the Dragon Palace!<br/><br/>If they were to become enemies with such experts, they would have to be careful of revenge.<br/><br/>The experts from the Guardian alliance had already figured it out!<br/><br/>Joining the Dragon Palace was the best choice.<br/><br/>Buzz Buzz<br/><br/>Buzz Buzz<br/><br/>Following that, the experts of the Guardian Alliance started to contact Prime Minister Gui!<br/><br/>…<br/><br/>“It’s about to be born!”<br/><br/>At the same time, in the deep cold universe, Wang Xian was in a restaurant on a planet.<br/><br/>Next to him was a divination lamp.<br/><br/>The divination lamp emitted a luster. Upon seeing the information on it, Wang Xian revealed a smile.<br/><br/>“This is the location of the birth of the fire-attributed Heaven’s origin treasure!”<br/><br/>Under the light of the divination lamp, a map was displayed.<br/><br/>During these few days, Wang Xian had a very clear understanding of the center of the Deep Cold Universe.<br/><br/>In the center, he had also left behind a large number of demon spirit altars.<br/><br/>Looking at the location that he had divined, Wang Xian instantly disappeared.<br/><br/>The next moment, he appeared in the void that was filled with meteorites.<br/><br/>He flew straight ahead.<br/><br/>A day later, Wang Xian arrived in front of a meteorite.<br/><br/>It was a meteorite that was emitting terrifying flames. The newly born Ultimate Treasure of Heaven’s origin creation was inside this meteorite.<br/><br/>“Peng!”<br/><br/>Wang Xian broke the outer shell of the meteorite and took out the ultimate treasure of Heaven’s origin creation inside.<br/><br/>It was a flaming bead.<br/><br/>There were special patterns on it.<br/><br/>“The newly born Ultimate Treasure of Heaven’s origin creation still needs to absorb some energy before it can reach maturity. If it is placed in a powerful treasure land, it will mature in hundreds of millions of years.”<br/><br/>Wang Xian looked at the flaming bead and smiled.<br/><br/>He did not lack ultimate treasures of Heaven’s origin creation at the moment.<br/><br/>He couldn’t control too many ultimate treasures of the Heaven’s origin creation either.<br/><br/>He decided to give the treasure in his hand to the powerhouses of the Dragon Palace.<br/><br/>At present, the Dragon Palace had three ultimate treasures of the Heaven’s origin creation, not including the one in Wang Xian’s hand.<br/><br/>Three Ultimate Treasures of the Heaven’s origin creation could allow the three existences of the Dragon Palace to reach the level of control. Each of them was equivalent to two existences at the level of control.<br/><br/>It could also be considered as making up for the lack of high-end combat strength of the Dragon Palace.<br/><br/>“Huh?”<br/><br/>Just when Wang Xian had just obtained the ultimate treasure of the Heaven’s origin, Prime Minister Gui suddenly sent him a message.<br/><br/>When he saw the message, he revealed an astonished expression.<br/><br/>“The universe guardians of the Alliance want to join the Dragon Palace Alliance?”<br/><br/>Wang Xian raised his eyebrows and was full of surprise.<br/><br/>It was unheard of for an alliance to join another alliance directly.<br/><br/>However, according to Prime Minister Gui’s information, the universes of the Alliance of Guardians were willing to take out the resources they mentioned last time.<br/><br/>In other words, these more than ten universes would pay a huge amount of resources to the Dragon Palace.<br/><br/>If it was a single universe, Wang Xian might not care too much about this amount of resources.<br/><br/>However, with so many resources from nearly twenty universes, even Wang Xian was a little excited.<br/><br/>One had to know that the amount of resources he mentioned last time was much more than before.<br/><br/>“Why did they join the Dragon Palace Alliance? Did the evil sequence camp send more powerhouses to invade them?”<br/><br/>Wang Xian’s eyes flickered as he sent a message to Prime Minister Gui.<br/><br/>“No. According to Alliance leader he of the Guardian Alliance, the evil sequence faction has retreated because a powerhouse was killed by you, Dragon King.”<br/><br/>Prime Minister Gui replied quickly.<br/><br/>Wang Xian nodded slightly when he received the message.<br/><br/>When he was killing the spirit kneader and the rest, Wang Xian could sense that the powerhouses of the Guardian Alliance were spying on them.<br/><br/>He didn’t pay much attention to it at that time.<br/><br/>Now, it seemed that they were convinced by his strength.<br/><br/>They also realized the gap between him and the Dragon Palace Alliance.<br/><br/>Hence, they wanted to join the Dragon Palace Alliance.<br/><br/>“Sure. Where are they now? Also, tell the powerhouses of the Guardian Alliance not to look for the ultimate treasure of Tianyuan. I have already obtained this treasure.”<br/><br/>“Also, give the powerhouses of the deep frost universe a control-level corpse as compensation!”<br/><br/>Wang Xian said to Prime Minister Gui.<br/><br/>“It’s the Dragon King!”<br/><br/>“The powerhouses of the Guardian Alliance are not far from the deep frost universe.”<br/><br/>Prime Minister Gui was not surprised that Wang Xian had obtained the ultimate treasure of the Heaven’s origin.<br/><br/>“Tell all the powerhouses of the deep frost universe to come over.”<br/><br/>Wang Xian read the message and continued.<br/><br/>A few hundred years later, the powerhouses from the universe of the Guardian Alliance gathered at the center of the Deep Frost Universe.<br/><br/>This included the powerhouses from the Dragon Palace Alliance.<br/><br/>When the powerhouses from the Dragon Palace Alliance learned that all the members of the Guardian Alliance had joined the Dragon Palace Alliance, they were also extremely shocked.<br/><br/>One had to know that the strength of the Guardian alliance was really not weak.<br/><br/>There were four great dao experts.<br/><br/>They had fought against the evil sequence faction for tens of thousands of years.<br/><br/>Although they didn’t have the upper hand, they were able to withstand the pressure temporarily.<br/><br/>Now, all of them had joined the Dragon Palace Alliance.<br/><br/>Once they joined, it also meant that all the universes around the land of origin belonged to the Dragon Palace Alliance.<br/><br/>The Dragon Palace Alliance was the overlord of this region!<br/><br/>“Come, come, this is the humble abode of our three brothers in the deep frost universe. Please come in and try the delicacies of our deep frost universe!”<br/><br/>In the center of the Deep Frost Universe, in the palace built by the three powerhouses of the deep frost universe.<br/><br/>At this moment, the three of them were greeting the powerhouses.<br/><br/>The three of them had smiles on their faces.<br/><br/>This time, the deep frost universe had given birth to a heavenly yuan destiny treasure.<br/><br/>For the Heavenly Yuan Destiny Treasure to be born during the calamity, the three of them, who were at the beginner level, would not be able to keep it.<br/><br/>Now, although the Heavenly Yuan Destiny Treasure could not be kept, the Dragon King gave them a control-level corpse.<br/><br/>This was a very huge resource for them.<br/><br/>After all, with their strength, how could they get such a high-level corpse?<br/><br/>They couldn’t get it!<br/><br/>This also made them sigh. The Dragon King was very generous and didn’t mistreat them.<br/><br/>The three people were the hosts here and warmly welcomed the experts of the Guardian Alliance.<br/><br/>“Thank you, thank you!”<br/><br/>The experts were polite.<br/><br/>“Please Wait a moment. The Dragon King will be here soon. Please take a seat inside.”<br/><br/>Prime Minister Gui came up and greeted them.<br/><br/>Everyone nodded.<br/><br/>When they entered, the experts of the Dragon Palace Alliance were also there.<br/><br/>Some of them who knew each other also went to greet them.<br/><br/>Alliance master he knew the three prophets who had divined the universe. At that time, he was the one who invited the three prophets to establish an alliance.<br/><br/>However, he was rejected at that time.<br/><br/>Now, Alliance master he and the others sighed slightly. If they had known earlier, they would have joined the Dragon Palace Alliance in advance.\t\t\t\t\t\t</div>", "images": {}, "success": true}