{"id": 1462, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075651.html", "title": "Chapter 4465 - Chapter 4465: 4,464,000 Powerhouses Of The Heaven’S Origin", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4465 - Chapter 4465: 4,464,000 Powerhouses Of The Heaven’S Origin</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4465: 4,464,000 powerhouses of the Heaven’s origin<br/><br/>The next plan of the Dragon Palace was to attack the entire land of origin.<br/><br/>However, they could not attack recklessly now.<br/><br/>They had yet to find out the specific situation under the land of origin.<br/><br/>For example, how many chaos-level existences were there under the land of origin?<br/><br/>They had to find out.<br/><br/>Due to the uniqueness of the death mark, Wang Xian had to be on guard. If they were to attack the underground of the land of origin wantonly and were attacked by the combined attacks of the chaos behemoths, they would be in big trouble.<br/><br/>Especially when they were facing the chaos-level chaos behemoths, there was no way for them to escape when they were at the Great Dao level.<br/><br/>Just like the chaos behemoth with the eye of the void, its strength and abilities were very strange and powerful.<br/><br/>Once trapped by it, even if a great dao expert had a treasure, it would be difficult for them to escape.<br/><br/>Therefore, when they really swept through the land of origin, they had to be prepared.<br/><br/>“It’s the Dragon King!”<br/><br/>The experts of the Dragon Palace Alliance were very interested in the land of origin.<br/><br/>Now, as they were all members of the same alliance, they could shout in the group and team up to hunt together.<br/><br/>In that case, they didn’t have to worry about being cheated.<br/><br/>This was because the strong ones of the same alliance couldn’t bully the weak ones either.<br/><br/>They couldn’t kill the weak ones either.<br/><br/>In that case, they would be punished by the Dragon Palace Alliance.<br/><br/>In such a trustworthy situation, it was a good choice to hunt the giant beasts of chaos together.<br/><br/>The group of strong ones of the Dragon Palace Alliance started to talk.<br/><br/>After Wang Xian stayed in the Palace of the Dragon Palace Alliance for a while, he went straight to the Dragon Palace.<br/><br/>Firstly, he gave the fire-attributed Heaven’s origin creation treasure to the leader of the Fire Divine Dragon of the Dragon Palace.<br/><br/>Secondly, he distributed the resources he obtained this time.<br/><br/>This time, apart from the resources that the powerhouses from the Guardian alliance had to join the Dragon Palace Alliance.<br/><br/>There was a sum of resources that exceeded Wang Xian’s expectations.<br/><br/>These were the resources obtained from the spirit kneader, Heaven’s duty, and the illusory realm.<br/><br/>The corpses of the three of them were of the Great Dao level. It was a very generous amount of resources.<br/><br/>In addition, they were carrying a spatial treasure.<br/><br/>There were a large number of corpses and treasures in this spatial treasure.<br/><br/>These corpses and treasures were obtained from the universe they had slaughtered previously.<br/><br/>It could be said that the most precious and powerful treasures of the universe they had destroyed were all in the hands of the three of them.<br/><br/>The abundance of these resources was so great that even Wang Xian was speechless.<br/><br/>After the spirit kneader and the other two were resurrected, they would definitely be heartbroken.<br/><br/>After all, this was the hard work they had put in all these years.<br/><br/>Now, all of them had become Wang Xian’s wedding dress.<br/><br/>“Next, I can undergo another round of improvement.”<br/><br/>Wang Xian smiled.<br/><br/>The powerful resources, coupled with the increase in the space and time of the primal chaos stones, were the reason why the Dragon Palace was able to produce more powerhouses in the Heaven’s origin realm.<br/><br/>Just like now, there were more than 400 disciples in the peak of the Dragon Palace.<br/><br/>Wang Xian did not stay in the Dragon Palace. Instead, he went directly to the bottom of the land of origin and continued to search for the stones of origin.<br/><br/>If he encountered a giant beast of chaos, he could also kill it.<br/><br/>Time passed day by day.<br/><br/>A hundred million years passed in the blink of an eye.<br/><br/>Now, eight hundred million years had passed since the beginning of the cataclysm.<br/><br/>“Phew!”<br/><br/>Wang Xian was located at a spot below the land of origin. He looked ahead.<br/><br/>In his line of sight, there was an extremely terrifying giant beast of chaos.<br/><br/>“The third existence at the level of chaos. Currently, I have only explored one-third of the area of the land of origin.”<br/><br/>Wang Xian did not approach the chaos-level existence as he mumbled.<br/><br/>The number of chaos-level behemoths had exceeded Wang Xian’s expectations.<br/><br/>50 million years ago, Wang Xian encountered the second chaos-level existence here.<br/><br/>Now, it was the third one.<br/><br/>He had only explored one-third of the area below the land of origin.<br/><br/>One-third meant that there were three chaos-level existences.<br/><br/>There were at least six existences of the chaos level at the bottom of the entire land of origin.<br/><br/>This was a very high number!<br/><br/>“These beasts of the chaos level have never been to the top of the land of origin. They would be teleported out directly through the black hole nearby. What is the other end of the black hole?”<br/><br/>Wang Xian mumbled.<br/><br/>He looked at the harvest this time. Fifteen origin stones.<br/><br/>It was a little more than the first harvest, but the time taken was many times longer.<br/><br/>However, Wang Xian had killed more than 20 Chaos Beasts in the past 100 million years.<br/><br/>This was equivalent to more than 20 carcasses of the Heaven’s origin realm.<br/><br/>It was definitely a great harvest!<br/><br/>“Let’s go back. After we return to the Dragon Palace and absorb all these origin stones, our strength will be greatly enhanced. At least, we will be able to increase our combat strength by one or two mastery levels.”<br/><br/>“I wonder how the improvement of the disciples of the Dragon Palace is going. Now, I have some resources in my hands.”<br/><br/>Wang Xian was deep in thought. With a flash, he returned to the Dragon Palace!<br/><br/>“Prime Minister Gui!”<br/><br/>Upon arriving at the Dragon Palace, Wang Xian transmitted his voice to Prime Minister Gui.<br/><br/>When Prime Minister Gui heard that, he rushed over immediately.<br/><br/>“Greetings, Dragon King!”<br/><br/>“You’re back, Dragon King!”<br/><br/>Prime Minister Gui greeted.<br/><br/>“How’s the situation in the Dragon Palace over the past 100 million years? Report back.”<br/><br/>Wang Xian asked.<br/><br/>“Dragon King, the number of powerhouses in the Heavenly Yuan blessed realm in the Dragon Palace has already reached 100. The number of those in the control level has also reached eight.”<br/><br/>Prime Minister GUI smiled and said, “However, there aren’t many spots for the breakthrough of the Heavenly Yuan blessed realm in the Dragon Palace now. If we want to breakthrough again, we’ll have to look for other universes!”<br/><br/>“There are more than a hundred of them?”<br/><br/>Wang Xian revealed a satisfied expression when he heard Prime Minister Gui’s words.<br/><br/>If the other peak races in the nine-origin universe knew that there were more than a hundred people in the Heaven’s origin realm, they would definitely jump in fright.<br/><br/>It was considered pretty good that there were eight of them in the control level.<br/><br/>However, there were no more spots for the breakthrough of the Heaven’s origin realm. It was impossible to increase the number of spots quickly.<br/><br/>“I have more than twenty corpses in my hands. I can use them to increase the strength of the powerhouses of the Heaven’s origin ability in the Dragon Palace.”<br/><br/>Wang Xian made up his mind and gave all the corpses to Prime Minister Gui.<br/><br/>“Is there any problem with the Dragon Palace Alliance?”<br/><br/>He asked again.<br/><br/>“Dragon King, the Dragon Palace Alliance is very peaceful at the moment. The entire land of origin is in a very peaceful period.”<br/><br/>Prime Minister Gui replied.<br/><br/>Wang Xian nodded. “Alright, let me know if there’s anything else. I’ll be in seclusion for a period of time!”<br/><br/>Prime Minister Gui bowed and left.<br/><br/>Wang Xian took out the stone of origin and began to absorb it.<br/><br/>The situation in the Dragon Palace was very stable at the moment. There was nothing for him to worry about.<br/><br/>The entire land of origin was also very stable.<br/><br/>He took out the stone of origin and began a new round of improvement.<br/><br/>After absorbing all 15 pieces of the Stone of origin, Wang Xian’s fusion rate would also be enhanced.<br/><br/>It wouldn’t be long before he was 100% compatible with the primal Chaos Stone!\t\t\t\t\t\t</div>", "images": {}, "success": true}