{"id": 1471, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075696.html", "title": "Chapter 4474 - Chapter 4474: On The Other Side Of The Black Hole, In The 4473 Strong Tribe", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4474 - Chapter 4474: On The Other Side Of The Black Hole, In The 4473 Strong Tribe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4474: On the other side of the black hole, in the 4473 strong tribe<br/><br/>“Buzz Buzz Buzz!”<br/><br/>“Buzz Buzz Buzz!”<br/><br/>Wang Xian teleported with all his might and managed to pass through this powerful sealed space.<br/><br/>“Crack Crack!”<br/><br/>“Crack Crack!”<br/><br/>The sealed space at the back seemed to emit the sound of glass shattering.<br/><br/>However, when Wang Xian thought that he could escape, a shocking scene appeared on his face.<br/><br/>The powerful sealed space collapsed instantly.<br/><br/>It turned into space mirrors and attacked Wang Xian.<br/><br/>Each space mirror carried a terrifying destructive power.<br/><br/>It was as though it had cut the entire space into countless pieces.<br/><br/>When Wang Xian saw this scene, his expression changed again.<br/><br/>The powerful space power had cut the surrounding space.<br/><br/>Even the mutated space power that Wang Xian had transformed from his chaotic power had received a huge disturbance.<br/><br/>“No, let’s escape quickly!”<br/><br/>Wang Xian’s eyes narrowed as he spoke.<br/><br/>This group of Chaos Beasts was too terrifying.<br/><br/>Most importantly, their strength was too strong.<br/><br/>The powerful space force was sufficient to interfere with the mutated force in Wang Xian’s body.<br/><br/>It could pose a huge threat to Wang Xian.<br/><br/>“Boom Boom!”<br/><br/>“Boom Boom!”<br/><br/>Wang Xian’s body trembled as the divination lamp continued to predict the escape route.<br/><br/>The moment he found a route, he immediately teleported.<br/><br/>His body flickered continuously!<br/><br/>“Bang Bang!”<br/><br/>“Bang Bang!”<br/><br/>He waved his arm and destroyed pieces of space fragments before teleporting forward.<br/><br/>“Squeak Squeak!”<br/><br/>“Squeak Squeak!”<br/><br/>At this moment, a stiff and crisp chirp of a cicada could be heard from the back.<br/><br/>It was as though it was about to pierce through space.<br/><br/>When Wang Xian heard the chirping, he had a bad feeling.<br/><br/>He swept his gaze around and vaguely saw wings as thin as cicadas’wings appearing around him.<br/><br/>The densely packed cicadas’wings were emitting spatial fluctuations.<br/><br/>It was as though they were preparing for a terrifying attack.<br/><br/>Wang Xian focused his gaze and quickly fled into the distance.<br/><br/>“A black hole!”<br/><br/>Suddenly, he saw a deep and direct black hole in the front right.<br/><br/>This black hole was a little blurry under the influence of the spatial force.<br/><br/>However, this blurriness was not because it was about to disappear. Instead, it was because the powerful chaotic Behemoth tribe wanted to block the space where Wang Xian was.<br/><br/>Wang Xian’s mind stirred and he flew rapidly towards the black hole.<br/><br/>Similarly, the chaotic force was converted into a powerful spatial force and blasted towards the location of the black hole.<br/><br/>“Boom!”<br/><br/>“Boom Boom!”<br/><br/>After three rounds of attacks, the black hole became much clearer.<br/><br/>Without any hesitation, Wang Xian flew straight into the black hole!<br/><br/>In the next moment, he disappeared!<br/><br/>“Squeak!”<br/><br/>“Squeak!”<br/><br/>Crisp sounds continued to be heard. One Chaos Beast after another teleported to the black hole.<br/><br/>In the middle of the black hole, the chaos-level existence stared at the black hole.<br/><br/>It hesitated for a moment, but didn’t continue chasing.<br/><br/>“Zhi Zhi!”<br/><br/>It let out a cry and flapped its wings, causing all the chaos behemoths of the entire race to disappear.<br/><br/>Space recovered, as if there wasn’t any battle here.<br/><br/>…<br/><br/>The black hole, be it in the universe or in the chaos, was a special teleportation formation formed naturally.<br/><br/>Entering a black hole would allow one to enter an unfamiliar place.<br/><br/>Similarly, a black hole was much more dangerous than a teleportation formation.<br/><br/>Many black holes contained unsafe factors. Some chaotic energy would tear apart the living beings that entered them.<br/><br/>This was especially so for a black hole formed in the chaos. Even a powerhouse who had just entered the Heaven’s origin realm would not dare to enter it rashly.<br/><br/>When Wang Xian entered the black hole, he sensed a powerful spatial force that was transporting him.<br/><br/>This place seemed to be a special spatial domain.<br/><br/>The internal space was bombarded by an extremely chaotic energy.<br/><br/>Fortunately, with Wang Xian’s strength, he could easily withstand it.<br/><br/>This chaotic energy could also pose a threat to those who had just entered the Heaven’s origin realm.<br/><br/>Wang Xian sensed for a moment and realized that he could not teleport here.<br/><br/>This was the first time that the mutated space energy had completely lost its effect.<br/><br/>However, this was also within Wang Xian’s expectations.<br/><br/>This was because he was already in the midst of teleportation.<br/><br/>The teleportation of the black hole was not as fast as Wang Xian had imagined. After a full month, other energies and glows appeared in front of him.<br/><br/>Buzz<br/><br/>Very soon, his body emerged from the black hole and floated in an unfamiliar space.<br/><br/>When Wang Xian scanned his surroundings, he revealed an astonished expression.<br/><br/>“It’s a huge meteorite that’s almost the same size as the land of origin.”<br/><br/>Wang Xian looked back in astonishment.<br/><br/>Yes, there was also a huge meteorite that was as huge as the universe.<br/><br/>There were also countless holes on the meteorite.<br/><br/>Wang Xian even suspected that he had not left the land of origin at all.<br/><br/>He was merely teleported from one black hole to another.<br/><br/>However, Wang Xian used his divination ability to perform a divination and realized that this was indeed not the land of origin.<br/><br/>“In other words, the land of origin is not unique. There are many places like this in the Chaos?”<br/><br/>“Similar huge losses, the lair of the chaos behemoths? Is it possible that this kind of place is equivalent to the universe of the chaos behemoths? However, they belong to the chaotic creatures?”<br/><br/>Wang Xian guessed.<br/><br/>It was possible that all the chaos behemoths were born in this huge meteorite lair.<br/><br/>He thought to himself and continued to perform divination to divine a safe principle.<br/><br/>Before he understood this place, Wang Xian did not dare to act rashly.<br/><br/>At the land of origin, that powerful chaotic Behemoth tribe had indeed taught Wang Xian a lesson.<br/><br/>If that chaotic Behemoth tribe had two existences at the level of chaos, then Wang Xian would really feel cold.<br/><br/>He flew quickly in this unfamiliar territory.<br/><br/>Wang Xian sensed for a moment. He could return to the Dragon Palace in an instant.<br/><br/>However, he was filled with curiosity about this place and was prepared to take a good look at it.<br/><br/>In addition, there were such terrifying tribes in the land of origin. Wang Xian temporarily gave up on the idea of exploring it in the short term.<br/><br/>“I’ll take a look here first.”<br/><br/>Wang Xian thought to himself and flew away quickly.<br/><br/>He was prepared to fly further away and take a look from the perspective of God.<br/><br/>A year later, Wang Xian arrived at the sky above the huge loss.<br/><br/>“The place where I came out from the black hole should be at the bottom. The place where my vision is parallel is at the top. What is completely different from the place of origin is that there is a special kind of tree growing above this place.”<br/><br/>“This kind of tree is very special. You can check it yourself. Also, there is a huge chaos meteorite that is emitting a fiery glow at the top.”<br/><br/>Wang Xian looked at the environment and muttered.<br/><br/>This place was just like Earth in the past. There was a sun illuminating the place.<br/><br/>Wang Xian could vaguely sense that there were giant chaos beasts living inside.<br/><br/>He did not rashly hunt these giant chaos beasts. Instead, he flew towards the location above.\t\t\t\t\t\t</div>", "images": {}, "success": true}