{"id": 1470, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075691.html", "title": "Chapter 4473 - Chapter 4473: 4472 Strong Race, On The Other Side Of The Black Hole", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4473 - Chapter 4473: 4472 Strong Race, On The Other Side Of The Black Hole</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4473: 4472 strong race, on the other side of the black hole<br/><br/>Wang Xian had explored about a third of the entire land of origin.<br/><br/>The deeper he went, the more he realized a problem.<br/><br/>The Stones of origin inside were all taken away by some chaos behemoths.<br/><br/>It seemed that there were chaos behemoths that could sense the location of the stones of origin.<br/><br/>Those who could divine that more than a dozen stones of origin were gathered together were mostly at the powerful chaos behemoths.<br/><br/>Or they were from the few existences at the chaos level.<br/><br/>Speaking of which, those few existences at the chaos level each had more than a dozen origin stones on them.<br/><br/>However, Wang Xian couldn’t snatch them away from them.<br/><br/>At the moment, he wasn’t able to kill those existences at the chaos level.<br/><br/>Even though he was already very powerful now.<br/><br/>He could suppress those existences at the chaos level, but he could still escape easily.<br/><br/>Therefore, Wang Xian was very straightforward and did not provoke such existences.<br/><br/>He flew quickly in the land of origin and used his divination ability to divine the location of the Stone of origin.<br/><br/>“I found one!”<br/><br/>After a few decades, Wang Xian’s eyes lit up when he saw the result of his divination. He quickly flew inside.<br/><br/>He shuttled through the caves. The entire land of origin was like a huge maze. If he did not know the exit, he could even get lost inside.<br/><br/>After all, the space inside was too big!<br/><br/>Wang Xian followed the divination information and searched bit by bit.<br/><br/>A year later, he came to the front of the land of divination!<br/><br/>“There is a gigantic beast of chaos ahead. This piece of the Stone of origin is inside the body of this gigantic beast of Chaos!”<br/><br/>Wang Xian sensed the presence of a gigantic beast of chaos ahead.<br/><br/>It was not a big problem for a gigantic beast of chaos at the control level.<br/><br/>Buzz<br/><br/>Wang Xian rushed over and immediately saw the gigantic beast of chaos inside.<br/><br/>Due to its powerful strength, the gigantic beast of chaos did not even notice Wang Xian’s appearance.<br/><br/>Wang Xian rushed over and killed it before it could react.<br/><br/>“Not bad.”<br/><br/>Wang Xian found the stone of origin and kept the corpse. He smiled.<br/><br/>The corpse of this chaotic behemoth was a huge resource.<br/><br/>In the Dragon Palace, some of the bones of the chaotic behemoth were even placed somewhere in the Dragon Palace by Prime Minister Gui.<br/><br/>This also represented the strength of the Dragon Palace.<br/><br/>“Continue.”<br/><br/>Wang Xian moved his body and continued to search.<br/><br/>“Eh?”<br/><br/>After a few hundred years, Wang Xian once again divined the location of a stone of origin.<br/><br/>This caused a smile to appear on his face.<br/><br/>Based on the information he divined, he quickly flew towards a certain direction.<br/><br/>“The location of this stone of origin is actually moving. It seems to be on the body of another giant beast of Chaos.”<br/><br/>Wang Xian was pleasantly surprised.<br/><br/>The Stone of origin was on the body of a giant beast of chaos. This was equivalent to not only harvesting the stone of origin, but also harvesting a space beast.<br/><br/>This was a huge harvest.<br/><br/>With this thought in mind, Wang Xian quickly locked onto his target and chased after it.<br/><br/>It took more than ten years for Wang Xian to come out of a cave. Only then did he see the space beast.<br/><br/>This was a giant beast of chaos that was emitting powerful spatial fluctuations. It had a pair of wings that were as thin as cicada wings.<br/><br/>It was flying forward.<br/><br/>Wang Xian looked over and his eyes were glowing.<br/><br/>The Great Dao level!<br/><br/>This was a gigantic beast of chaos that was on the Great Dao level.<br/><br/>Based on the energy fluctuations emitted from its body, it was comparable to two great dao level beasts. In addition, it had an additional control level beast.<br/><br/>This was an existence that was at the very top of the Great Dao.<br/><br/>Buzz Buzz<br/><br/>Buzz Buzz<br/><br/>Without any hesitation, Wang Xian instantly teleported towards the giant beast of chaos.<br/><br/>Bang Bang<br/><br/>Bang Bang<br/><br/>However, when Wang Xian rushed over, an invisible spatial barrier appeared around him.<br/><br/>These spatial barriers had been floating around the giant beast of chaos.<br/><br/>This was its natural barrier. Any creature that entered a certain range would definitely be discovered!<br/><br/>“Huh?”<br/><br/>Wang Xian had already sensed the existence of this natural barrier in advance. However, what surprised him was that when he broke through it with his body.<br/><br/>The body of the chaos behemoth instantly disappeared.<br/><br/>In just an instant, it disappeared from Wang Xian’s line of sight.<br/><br/>Even he couldn’t sense it.<br/><br/>This made him look surprised.<br/><br/>“This method is so strong.”<br/><br/>His face was full of surprise.<br/><br/>This barrier was connected to a certain escape skill of his main body.<br/><br/>When a creature broke through this barrier, the escape skill was instantly activated.<br/><br/>It left immediately.<br/><br/>Then, it could be confirmed that being able to break through the barrier also meant that it could threaten this space beast.<br/><br/>Therefore, this space behemoth immediately activated its escape ability and escaped.<br/><br/>Wang Xian was astonished.<br/><br/>This was the first space behemoth he had encountered that was so alert.<br/><br/>Such a space behemoth could escape from the pursuit of a primal chaos level!<br/><br/>Buzz Buzz<br/><br/>Buzz Buzz<br/><br/>However, just as Wang Xian was astonished, the surrounding space suddenly trembled.<br/><br/>A powerful spatial force enveloped the surrounding void.<br/><br/>The sudden spatial force caused him to reveal a stunned expression.<br/><br/>“What’s going on?”<br/><br/>Wang Xian actually didn’t sense it.<br/><br/>The sudden change caused his expression to change slightly.<br/><br/>Following that, he sensed waves of powerful auras appearing in front of him.<br/><br/>An aura at the chaos level.<br/><br/>Seven auras of the Great Dao level.<br/><br/>More than fifteen auras of the control level.<br/><br/>And no less than fifty auras of the beginner level.<br/><br/>The space was trembling.<br/><br/>One after another, illusory wings as thin as cicada wings enveloped the surrounding space!<br/><br/>This scene caused Wang Xian’s expression to change drastically.<br/><br/>“D * mn, a tribe of giant beasts of the chaos level. A tribe of the chaos level!”<br/><br/>His expression changed drastically.<br/><br/>This was the first tribe that Wang Xian had encountered that had a chaos level existence.<br/><br/>Most importantly, there were seven Great Dao levels.<br/><br/>This terrifying spatial power seemed to have sealed off the entire space!<br/><br/>Under such circumstances, even a chaos level powerhouse would die!<br/><br/>Buzz<br/><br/>Wang Xian did not hesitate at all. He instantly unleashed the mutated spatial power.<br/><br/>Flee!<br/><br/>This extremely powerful race was not something he could fight against Ade.<br/><br/>In fact, if he were to be trapped, there was a high chance that he would be killed by the other party.<br/><br/>The same race, the same attribute, the same innate skill.<br/><br/>When this race worked together, it was too terrifying!<br/><br/>Most importantly, they were the existences of the space attribute.<br/><br/>The top ten attributes, space was King!<br/><br/>Buzz! Buzz<br/><br/>When Wang Xian was teleporting away, a distorted force was applied to his body.<br/><br/>This caused Wang Xian’s expression to change again.<br/><br/>The mutated space force was actually disrupted!<br/><br/>“It’s because the space force of this race is too strong. They can even create an indestructible space domain to isolate everything in the world.”<br/><br/>Wang Xian’s expression changed slightly.<br/><br/>Wang Xian’s escape was interrupted. However, even so, the powerful ability that belonged to an lie allowed him to teleport to a location.<br/><br/>However, this distance was a little shorter!\t\t\t\t\t\t</div>", "images": {}, "success": true}