{"id": 1474, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075711.html", "title": "Chapter 4477 - Chapter 4477: 447610-Day Federation", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4477 - Chapter 4477: 447610-Day Federation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4477: 447610-day federation<br/><br/>The leader of the Federation of the dimensional universe appeared.<br/><br/>Wang Xian looked over and realized that he was just a genetic clone.<br/><br/>His original body did not come here.<br/><br/>There was one thing about technological civilizations that was extremely powerful. Therefore, it was very difficult for them to be killed.<br/><br/>This was because even if the main body was killed, he would be able to resurrect through his clones.<br/><br/>There were probably tens of thousands of powerful people from the technological civilization, or even more clones of themselves.<br/><br/>As long as they died, the cloned self could be resurrected.<br/><br/>Of course, this kind of resurrection had some flaws.<br/><br/>In the universe, there was no perfect way to resurrect indefinitely.<br/><br/>“There’s nothing much to do. I want to understand the situation in the nearby universe, the Alliance of time and the Behemoth Alliance, and so on.”<br/><br/>Wang Xian said indifferently. With a wave of his arm, the seal on the surrounding space disappeared.<br/><br/>All the weapons returned to their normal state.<br/><br/>His figure also arrived in front of the leader of the Dimensional Universe Federation.<br/><br/>“Since you want to understand, I naturally don’t dare to hide anything.”<br/><br/>When the leader of the Dimensional Universe Federation saw this scene, he heaved a sigh of relief and opened his mouth to speak!<br/><br/>When he appeared, he used the strongest combat detection device in their dimensional universe to investigate Wang Xian.<br/><br/>The result of their combat detection device was a series of question marks.<br/><br/>This meant that their detection device was unable to detect the strength of this mysterious person.<br/><br/>One must know that their combat detection device was able to analyze the combat strength of an existence at the control level.<br/><br/>An existence at the control level and above!<br/><br/>He felt a chill in his heart. An expert at this level was not someone they could afford to offend.<br/><br/>“Sir, please take a seat inside.”<br/><br/>The leader of the Dimensional Universe Federation respectfully brought Wang Xian inside.<br/><br/>Wang Xian nodded his head and came to a luxurious study room.<br/><br/>“Sir, what questions do you want to ask?”<br/><br/>The leader of the Dimensional Universe Federation asked.<br/><br/>“Give me a detailed description of the situation in your universe.”<br/><br/>Wang Xian replied straightforwardly.<br/><br/>“Yes, sir. Sir, let me give you a technological ai first. This technological AI was created by the 10-day federation. Through the technological AI, you will be able to understand most of the matters.”<br/><br/>The leader of the Federation of the Dimensional Universe gave him a technological ai. “Our Dimensional Universe is a member of the 10-day federation. The 10-day federation is an extremely powerful alliance. The entire federation has gathered most of its strength and is divided into three camps. Although these three camps will not erupt into big battles, they will occasionally engage in some arena battles.”<br/><br/>“Generally speaking, the 10-day federation was still one entity. In the past, the source of the Beast was a threat to the 10-day federation. Powerful Primal Chaos Beasts would often fly out from there to wreak havoc in the various universes.”<br/><br/>“Later, in a universe not far from the source of the beast, it was called the Beast Universe. There were powerful beings who found special treasures and used them to lure the primal Chaos Beasts and control them. From then on, the strength of this universe developed rapidly.”<br/><br/>“They destroyed dozens of universes, and their power increased tremendously.”<br/><br/>“After that, many universes were worried about the attack of the Beast Universe, and they worked together to persuade the 10-day Federation to encircle the Beast Universe. Hundreds of universes attacked at the same time and killed many powerful beings and beasts of the Beast Universe.”<br/><br/>“But after that, because the beast universe occupied many universes and used the blood of the beast to nurture a large number of beasts, they went to the primal chaos of the 10-day federation and found hundreds of universes and formed an alliance.”<br/><br/>“The Behemoth Alliance was formed today. From then on, the Behemoth Alliance and the ten-day federation became sworn enemies. However, because the Behemoth Alliance has the ability to control the Behemoth, our ten-day federation has always been at a disadvantage.”<br/><br/>The leader of the Federation of the dimensional universe introduced Wang Xian in detail.<br/><br/>This made Wang Xian reveal a surprised expression.<br/><br/>Which Behemoth Universe was so ferocious?<br/><br/>To destroy dozens of universes and occupy them, the strength was a little terrifying.<br/><br/>Even the Dragon Palace didn’t destroy many universes.<br/><br/>Back then, the belief universe only destroyed two or three universes.<br/><br/>“Is that giant beast universe so powerful?”<br/><br/>Wang Xian asked.<br/><br/>“Yes, my Lord. The Giant Beast Universe is very powerful. The cultivation method of the giant beast universe is very special. They are born with accompanying giant beasts. They can merge with the giant beasts and transform into giant beasts, bursting out with terrifying strength.”<br/><br/>“At their peak, the Giant Beast Alliance had nearly 200 heavenly yuan creation-level giant beasts, and they were invincible. No universe was a match for them.”<br/><br/>“However, the Great Beings of the giant beast universe also have a flaw. Once they are killed, the giant beasts will die completely, and the host will also be heavily injured, making it very difficult for them to recover. During the battle that encircled the giant beast universe, they killed more than 100 of their great beings.”<br/><br/>The leader of the Federation of the dimensional universe continued to speak.<br/><br/>“Merging with the Behemoth?”<br/><br/>Wang Xian was curious. This was another special training method!<br/><br/>Speaking of which, this chaotic domain was completely different from the place of origin.<br/><br/>Besides that, this behemoth universe was very ferocious.<br/><br/>At its peak, there were 200 powerhouses in the Heavenly Yuan blessed realm. It was not easy to obtain so many spots.<br/><br/>Under the siege of hundreds of universes, they were not completely annihilated. There were definitely existences at the chaos level.<br/><br/>Wang Xian could not help but exclaim in admiration.<br/><br/>This was the first universe he had encountered that was so strong.<br/><br/>He was suddenly confused.<br/><br/>“What’s the situation now?”<br/><br/>Wang Xian asked curiously.<br/><br/>“Full-scale wars have not erupted yet. However, there are many local wars. Battles at the Heaven’s origin realm often occur.”<br/><br/>The leader of the dimensional universe federation said, “However, our 10-day federation has researched black hole teleportation in the mechanical ascension universe and found many distant universes. These universe masters can come to us.”<br/><br/>“We will also take out our rewards and issue various federation missions.”<br/><br/>Black Hole teleportation?<br/><br/>“How far is the distance of the black hole teleportation?”<br/><br/>Wang Xian continued to ask.<br/><br/>“Although the black hole teleportation is not as far away as the black hole teleportation from the origin of giant beasts, it is still very far away. According to the calculations of the federation, the limit of the black hole teleportation distance is a beginner in the Heaven’s origin realm with a flying time of 200,000 years.”<br/><br/>The Federation leader of the Dimensional Universe replied.<br/><br/>When Wang Xian heard it, he was slightly surprised.<br/><br/>This distance was too terrifying.<br/><br/>It could be said that if there was this black hole teleportation, the living beings of the nine-origin universe could easily be teleported to the righteous universe in an instant.<br/><br/>It could be said to be extremely convenient.<br/><br/>“The cost of black hole teleportation is very high. Our Federation has only established a few dozen of them. There is one at the edge of our dimensional universe. Sir, you can directly teleport to the ten-day federation.”<br/><br/>“You will be able to learn more things there.”<br/><br/>The Federation leader of the dimensional universe continued to speak.<br/><br/>Wang Xian nodded his head. Naturally, he had to go to the 10-day federation to take a look.<br/><br/>He wanted to see if he could obtain or trade for some treasures.\t\t\t\t\t\t</div>", "images": {}, "success": true}