{"id": 1478, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075731.html", "title": "Chapter 4481 - Chapter 4481: 4480 Came From The Interrogation Of The 10-Day Federation", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4481 - Chapter 4481: 4480 Came From The Interrogation Of The 10-Day Federation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4481: 4480 came from the interrogation of the 10-day federation<br/><br/>Wang Xian wanted to go to the 10-day federation to take a look.<br/><br/>Powerful technological abilities.<br/><br/>There was also the universe that was very close. He wanted to go there to take a look at the situation there.<br/><br/>There were many strange places in this region. Perhaps he could find powerful and special abilities from this strange place.<br/><br/>For example, the ability of the cursed demonic spirit.<br/><br/>In addition, the origin stone was the food of the giant beasts of chaos in the land of origin.<br/><br/>There was also a giant Beast’s origin similar to the land of origin. Therefore, there should be a stone of origin here as well.<br/><br/>He went to the Federation of ten days to see if he could obtain some origin stones.<br/><br/>Now, it wouldn’t be long before he was able to fuse perfectly with the primal chaos stone.<br/><br/>With a move, Wang Xian took out some resources and placed them in the energy pool at the side. Then, he began to teleport.<br/><br/>The black hole teleportation formation required quite a lot of resources.<br/><br/>After all, building a powerful black hole teleportation formation would cost a lot. Naturally, they had to earn some back.<br/><br/>Wang Xian stepped into the formation and began to teleport.<br/><br/>This teleportation channel led directly to the interior of the 10-day federation.<br/><br/>It was also the center of the 10 universes.<br/><br/>That was also the headquarters of the 10-day federation.<br/><br/>After entering the black hole, the teleportation continued.<br/><br/>At the same time, what Wang Xian didn’t know was that.<br/><br/>They were located at the 10-day federation. At this moment, they had already learned about the problem with the black hole teleportation formation and the attack by the powerhouses of the Behemoth Alliance.<br/><br/>Their powerful technology allowed them to transmit information far better than ordinary alliance universes.<br/><br/>When they learned about the ancient god universe’s situation, they immediately responded.<br/><br/>The group of experts headed toward the ancient God universe.<br/><br/>They didn’t rush over from the black hole teleportation array, but instead used other methods.<br/><br/>Right now, the black hole teleportation array was most likely sealed, and even occupied by the Monster Alliance universe.<br/><br/>If they dared to come over, they might be attacked.<br/><br/>That was why they couldn’t use the black hole teleportation array for the time being.<br/><br/>Apart from that, the exit of the ancient God Universe to the Ten Suns Union’s black hole was also immediately sealed.<br/><br/>It was sealed by one of the three major forces of the Ten Suns Union, the technological force, and they had set up a terrifying defense.<br/><br/>Mechanical ascension to the universe, they were able to develop a powerful technology like black hole teleportation.<br/><br/>Naturally, they had also broken through one of the biggest shackles of technological weapons, which was the heaven’s fate.<br/><br/>Mechanical ascension to the universe, through the ability of technology, created a heaven’s fate level biological powerhouse, a biological warship.<br/><br/>They had even developed a weapon that could threaten a heaven’s fate level powerhouse.<br/><br/>Yes, to a certain extent, it was terrifying.<br/><br/>The convenience of technology and immortality in disguise allowed the machine to ascend to the universe and occupy one of the three seats in the ten-day federation.<br/><br/>Hundreds of billions of years ago, the ten-day federation had not been born yet.<br/><br/>Because the ten universes were too close to each other, every time a calamity erupted, even before the calamity arrived, a terrifying battle would erupt.<br/><br/>In the end, the ten universes were occupied by the three forces.<br/><br/>Finally, the three forces reached an alliance and became the current ten-day federation.<br/><br/>A black hole teleportation array was attacked. As the creator of the black hole teleportation array, they naturally immediately sealed off the black hole teleportation array.<br/><br/>“This damn Behemoth Alliance actually ambushed our black hole teleportation array. Damn it, after we develop the technology to enslave the behemoths, we will definitely annihilate you!”<br/><br/>“We don’t have to worry at all. The black hole teleportation array can not be broken even by primal chaos level experts. After all, our black hole teleportation uses real black hole materials.”<br/><br/>“It is still very difficult to destroy the Beast Alliance. The other party’s current strength is stronger than our alliance, especially their Beast Alliance. They have a cursed devil spirit universe, which is too much of a restraint on us.”<br/><br/>“We haven’t been able to find an anti-curse material yet. That cursed demon spirit is indeed the only counter to our technology.”<br/><br/>At a location within the 10 days alliance’s Black Hole teleportation formation, this black hole teleportation formation was already surrounded by a large amount of weapon energy.<br/><br/>In the commander’s base at the front, a few middle-aged men were talking.<br/><br/>Currently, in the conflict between the 10 Days Alliance and the Giant Beast Alliance, the Giant Beast Alliance was in an advantageous position.<br/><br/>If not, the powerful warriors of the Beast Alliance wouldn’t dare to barge into the universe of the ten-day alliance so easily.<br/><br/>“We need more allies. If more universes join us, we might be able to resist the Beast Alliance and even gain the upper hand.”<br/><br/>A commander frowned and said.<br/><br/>“These people from the distant universe, they won’t let go until they see a rabbit. They won’t take the risk without benefits. Let me say, we should completely kill them and collect the resources of their universe!”<br/><br/>In the center, a middle-aged man said with a cold expression, “With our power, destroying those universes will be easy.”<br/><br/>“It’s easy to occupy their universe, but they have the heavenly yuan creation stage powerhouses after all. It’s not easy to kill such an existence. If they really offend so many powerhouses and join the Behemoth Alliance after they understand our situation, we’ll be in trouble.”<br/><br/>The middle-aged man beside him shook his head.<br/><br/>“HMPH, let me see. We should let them make a choice. Either join or be destroyed. This way, our strength will increase even faster.”<br/><br/>The middle-aged man continued to speak coldly.<br/><br/>They used the black hole teleportation array to expand greatly.<br/><br/>They discovered even more universes.<br/><br/>However, these universes weren’t willing to directly join them and fight against the unfamiliar Behemoth Alliance.<br/><br/>Hence, the 10 days alliance could only use hiring or missions to attract their help.<br/><br/>This caused the 10 days alliance to have internal disagreements.<br/><br/>Some people felt that if they weren’t willing to join, then they could directly destroy them and collect the origins.<br/><br/>However, the other two sides felt that with the external enemy Behemoth Alliance, it was best not to make too many enemies.<br/><br/>The one who proposed to use ruthless methods to destroy the other party was the robotic Ascension Space Camp.<br/><br/>In fact, in the dark, they had already destroyed a few universes.<br/><br/>The Robotic Ascension Space Camp developed technology. The technology was very powerful and abnormal.<br/><br/>As long as they had enough resources, they could mass produce powerful battleships, mechs, and spaceships.<br/><br/>Resources were very important to them.<br/><br/>This was also the reason why they advocated an invasion.<br/><br/>However, they were stopped by two to one.<br/><br/>Although they were dissatisfied, they gave up on the idea.<br/><br/>However, some of the powerhouses who had ascended to the universe were just a little unhappy.<br/><br/>Just as they were talking.<br/><br/>Suddenly, on the screen in front of them, notifications rang one after another.<br/><br/>The commanders looked over, their faces filled with astonishment.<br/><br/>“Someone is teleporting over!”<br/><br/>They immediately said!\t\t\t\t\t\t</div>", "images": {}, "success": true}