{"id": 1479, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075736.html", "title": "Chapter 4482 - Chapter 4482: 4481 Came From The 10-Day Federation", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4482 - Chapter 4482: 4481 Came From The 10-Day Federation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4482: 4481 came from the 10-day federation<br/><br/>“Someone teleported here? Could it be a powerhouse from the Behemoth Alliance?”<br/><br/>“Is it possible?”? “How stupid is it to come directly from the teleportation black hole? With the strength of our defenses here, even a chaos-level powerhouse could be a threat, not to mention that most of the powerhouses of our federation are gathered here.”<br/><br/>“Let’s suppress them first.”<br/><br/>In the command room in front of a black hole teleportation formation of the 10-day federation, a group of commanders looked towards the direction of the black hole and said.<br/><br/>“Weng Weng!”<br/><br/>At the same time, at the exit of the black hole, an extremely powerful lightning enveloped it slowly.<br/><br/>In the surrounding area, terrifying cannon holes appeared one after another, emitting a power that caused one’s heart to palpitate.<br/><br/>The Ascension of machines to the universe represented the pinnacle of technology.<br/><br/>Using the power of technology to fight against the fate of the heaven.<br/><br/>Even existences at the level of chaos.<br/><br/>“HMM?”<br/><br/>At the same time, Wang Yun, who was in the black hole teleportation formation, looked at the exit in front of him.<br/><br/>Sensing the energy at the exit, he frowned slightly.<br/><br/>“What’s going on? There’s a powerful energy gathering at the exit. What is it doing?”<br/><br/>Wang Xian’s face was filled with astonishment.<br/><br/>Following that, his eyes flickered as he thought of some possibilities.<br/><br/>The black hole teleportation formation in the ancient God universe had been sealed off.<br/><br/>The ten-day federation would definitely make some preparations to prevent any accidents from happening.<br/><br/>“It seems like I might be attacked again!”<br/><br/>Wang Xian thought to himself.<br/><br/>The next moment, the exit was right in front of him. His body flew out directly.<br/><br/>Following that, he sensed that he was in a lightning cage. The powerful force of the Lightning sealed his surroundings. As long as he took any action, he would be attacked.<br/><br/>“He’s Out!”<br/><br/>“It’s a human?”<br/><br/>“Eh? Who Is this guy?”<br/><br/>In the command room, all the commanders looked at Wang Xian in surprise.<br/><br/>Wang Xian was also scanning his surroundings at this moment. His gaze landed on the direction of the command room. He looked at the commanders and said, “Everyone, don’t misunderstand. I’m not a powerhouse of the Behemoth Alliance.”<br/><br/>He immediately revealed his identity.<br/><br/>Since Wang Xian had decided to take a look at the ten-day federation, he didn’t want to have any conflict with them.<br/><br/>If there was a conflict, it wouldn’t be beneficial to Wang Xian.<br/><br/>“HMM? How did you get here from the Black Hole teleportation formation? Also, you said that you’re not a member of the Behemoth Alliance, so you’re not?”<br/><br/>A commander’s body flew out from the huge glass in front of him. He stared at Wang Xian coldly and questioned.<br/><br/>“I am indeed not a member of the Behemoth Alliance. When I arrived at the ancient God universe, I saw that it was a mess. However, there was no one else there. Therefore, I entered the black hole teleportation formation directly and came here.”<br/><br/>Wang Xian said faintly.<br/><br/>“If you say you’re not, then you’re not. Do you have the identity of the Ten Days Federation?”<br/><br/>The commander stared at him from above and said coldly.<br/><br/>“No, but I really don’t have any ill intentions.”<br/><br/>Wang Xian shook his head.<br/><br/>“I can’t detect your combat strength at all. It seems that you have a powerful treasure that can conceal your energy. Remove that treasure. We want to test you.”<br/><br/>In the command room, another commander flew out. He held a mechanical disc in his hand and ordered Wang Xian while staring at him!<br/><br/>Wang Xian shook his head. “I’m very sincere. I’m not from the Behemoth Alliance. I flew here from the distant universe. I have no ill intentions towards you guys. I just want to take a look here.”<br/><br/>“This is not up to you. It seems like I have to give you some power before you will cooperate obediently. HMPH!”<br/><br/>The commander who came out first stared at Wang Xian with a cold expression. He moved his palm.<br/><br/>The Lightning in the cage around Wang Xian started to explode instantly!<br/><br/>Wang Xian looked at this scene and felt a little helpless. He moved his body and teleported away immediately.<br/><br/>He wasn’t going to play with them anymore.<br/><br/>“What?”<br/><br/>“How is this possible?”<br/><br/>Wang Xian left the lightning cage instantly, causing the commanders’expressions to change drastically.<br/><br/>“Scan the surroundings and lock onto that guy’s position!”<br/><br/>One of the commanders immediately ordered loudly.<br/><br/>Rays of red light enveloped the entire space and began to scan.<br/><br/>“How is this possible? In our thunderbolt prison, even experts at the level of the Great Dao wouldn’t be able to escape after being activated. How did that Guy do it?”<br/><br/>“Also, where is he now? Why did he suddenly disappear?”<br/><br/>The commanders were a little shocked and furious.<br/><br/>They knew better than anyone else how powerful the lightning prison was. Now, a stranger was actually able to escape so easily.<br/><br/>This made them feel shocked.<br/><br/>“We can’t scan the other party’s figure. The place has already left this place. I don’t know if it’s his own ability or the ability of a powerful treasure!”<br/><br/>At this moment, the sound of a machine came from the entire space.<br/><br/>When the commanders heard this, their eyes narrowed slightly.<br/><br/>Disappeared?<br/><br/>If the other party used treasures to escape, that would be fine. But if the other party used his own strength to escape, that would be a little terrifying.<br/><br/>“Is there a possibility that we didn’t detect the other party’s combat strength because the other party’s strength has exceeded our detection range?”<br/><br/>One of the commanders frowned and said.<br/><br/>“That’s impossible. With our detection ability, we can detect anyone below the level of chaos. It’s not easy to find someone at the level of Chaos.”<br/><br/>A commander immediately refuted.<br/><br/>…<br/><br/>“This is troublesome!”<br/><br/>At the same time, Wang Xian didn’t know what the commanders were guessing. He teleported to the location outside.<br/><br/>His facial expression changed immediately and his body emitted a metallic luster. The power of chaos circulated and his aura was only at the initial stage of the Heaven’s origin realm.<br/><br/>In addition, the divination power spread throughout his body, blocking the detection of the surrounding technology.<br/><br/>After everything was settled, Wang Xian scanned his surroundings.<br/><br/>He realized that he was in a void.<br/><br/>In this piece of void space, there were many battleships, floating islands, Void Lakes, and huge void buildings.<br/><br/>There were a large number of strong disciples flying around here.<br/><br/>It wasn’t just the strong disciples. Wang Xian even discovered that there were many creatures with the strength of a supremacy or even lower.<br/><br/>As he circled around, he could see ten incomparably huge universes. They were like the sun, illuminating this piece of chaotic void space!<br/><br/>Wang Xian’s gaze swept across the area and he revealed a look of amazement.<br/><br/>Bustling. Everything here was simply too bustling!<br/><br/>Countless strong disciples were shuttling back and forth here.<br/><br/>All kinds of spaceships were traveling at a rapid speed.<br/><br/>Similarly, there were also a large number of flying swords, flying ships, flying ships, and special flying treasures that were traveling at a rapid speed.<br/><br/>Technology and fantasy coexisted.<br/><br/>It was an extremely bustling scene!<br/><br/>This place looked much more prosperous than the justice union.<br/><br/>“The reason why the 10-day federation is so powerful and the reason why the other two factions are so powerful seems to be related to a treasure land.”<br/><br/>Wang Xian was also flying in the chaos, heading towards the center.\t\t\t\t\t\t</div>", "images": {}, "success": true}