{"id": 1475, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075716.html", "title": "Chapter 4478 - Chapter 4478: The Sudden Attack On 4477", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4478 - Chapter 4478: The Sudden Attack On 4477</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4478: The sudden attack on 4477<br/><br/>“Sorry to disturb you.”<br/><br/>After chatting with the leader of the Federation of the Dimensional Universe for a while, Wang Xian arrived at the black hole teleportation formation.<br/><br/>He cupped his hands at the leader of the Federation of the dimensional universe and prepared to leave.<br/><br/>“I Won’t disturb you, I Won’t Disturb You!”<br/><br/>The leader of the Federation of the dimensional universe hurriedly waved his hand. “Sir, you can enter the black hole teleportation formation directly. If you want to reach the 10-day federation from here, you will need to make a transit.”<br/><br/>“Alright!”<br/><br/>Wang Xian nodded his head and entered the black hole teleportation formation directly.<br/><br/>When the leader of the Federation of the dimensional universe saw Wang Xian leaving, he heaved a heavy sigh of relief.<br/><br/>Facing such a powerful existence, he had to be careful.<br/><br/>“I wonder where this powerhouse comes from. He doesn’t seem to know anything.”<br/><br/>The leader of the Federation of the dimensional universe muttered.<br/><br/>When Wang Xian entered the black hole, a similar situation occurred as when he entered the black hole in the land of origin.<br/><br/>“This kind of black hole teleportation formation, how did this Mechanical Ascension Universe research it out? It’s really amazing.”<br/><br/>Wang Xian exclaimed in his heart as he quickly teleported.<br/><br/>Even though he possessed the power of chaos, he was still unable to create such a unique black hole.<br/><br/>“This black hole probably requires not only energy, but also treasures to set it up. There are many black holes in the origin of the giant beast. The mechanical ascension must have studied the black hole in the origin of the giant beast before creating the black hole teleportation formation.”<br/><br/>Wang Xian mumbled.<br/><br/>Time passed by little by little. Light spots gradually appeared in front of him.<br/><br/>Wang Xian knew that he was about to reach the end.<br/><br/>This time, the teleportation took a month.<br/><br/>In the black hole teleportation formation, it was relatively safe.<br/><br/>The universe that was being transferred this time was called the ancient God universe. This universe was the universe of the normal cultivation system.<br/><br/>According to the information that he obtained from the artificial intelligence of the 10-day federation, Wang Xian had obtained a lot of information.<br/><br/>For example, the entire federation had a total of over 300 universes.<br/><br/>In addition, because of the black hole teleportation, they found a few hundred more universes.<br/><br/>Through the black hole teleportation, the distance between the two sides was shortened.<br/><br/>To a certain extent, these universes, if the Federation Alliance encountered a crisis in the 10th day, could be of some help.<br/><br/>As for whether there was an alliance between them, it was unknown.<br/><br/>In addition, the strength of the Beast Alliance was even stronger.<br/><br/>A single beast universe had terrifying power.<br/><br/>In addition, the Beast Universe had gathered several hundred universes, and they were very powerful.<br/><br/>Both sides often clashed and fought over the source of the beasts.<br/><br/>The Beast Alliance used a special method to control the primal chaos beasts of the source of the beasts.<br/><br/>The 10-day federation would naturally stop them from using this method to quickly increase their power, and they also madly hunted the primal Chaos Beasts.<br/><br/>However, the gigantic Beast Alliance seemed to have a special method that could attract the gigantic beasts of chaos. Hence, they did not reduce the number of gigantic beasts of chaos.<br/><br/>In short, both parties were similar to the evil sequence faction of the Justice Alliance.<br/><br/>Buzz<br/><br/>“Someone is teleporting over. Hehe, let’s kill them directly.”<br/><br/>“Ever since this black hole teleporting formation appeared, it has brought us quite a lot of trouble. We must make them pay a price.”<br/><br/>Just as Wang Xian was about to be teleported out…<br/><br/>He, who was in the black hole teleportation formation, suddenly heard a voice coming from outside.<br/><br/>This made him slightly stunned. A look of astonishment appeared on his face.<br/><br/>“What’s the situation?”<br/><br/>His gaze focused slightly. His entire body was wrapped in energy.<br/><br/>Buzz<br/><br/>Following that, Wang Xian came out from the black hole teleportation formation.<br/><br/>In the next instant, a surge of terrifying energy attacked him.<br/><br/>This wave of energy covered his entire body. As it was a prearranged attack, even Wang Xian couldn’t react in time.<br/><br/>“Three attacks at the control level!”<br/><br/>However, when Wang Xian sensed the waves of attack, he wasn’t worried at all.<br/><br/>The energy enveloped his body and formed a powerful defense.<br/><br/>The terrifying attack landed on Wang Xian’s body. The defense on his body didn’t even ripple.<br/><br/>“What?”<br/><br/>“How is this possible?”<br/><br/>“Soul Curse, wipe out everything. Let’s attack together.”<br/><br/>Around them, an extremely shocked voice sounded.<br/><br/>Wang Xian raised his head and looked around.<br/><br/>Three powerhouses were located in the surrounding area.<br/><br/>One of them was a gigantic beast. This gigantic beast was tens of thousands of meters in size and looked like a special dragon snake.<br/><br/>The entire gigantic beast exuded an aura of the Great Dao level.<br/><br/>On the right was a living being that looked like a soul. It was surrounded by all kinds of ferocious and terrifying ghosts.<br/><br/>The Aura was equally terrifying.<br/><br/>A stream of energy was suspended in front of him. This energy was condensed into the form of Wang Xian. He was attacking the energy.<br/><br/>It was an extremely strange attack.<br/><br/>As for the position on the right, he was not an ordinary human either. He had two heads. One of the heads looked like a female while the other looked like a male.<br/><br/>One was black and the other was white.<br/><br/>The energy of light and darkness intertwined together and gave off a terrifying aura.<br/><br/>The giant beast and the expert with black and white heads were gathering energy in front of him. It was obvious that he was about to make his move.<br/><br/>Their eyes were locked onto Wang Xian and they were filled with shock.<br/><br/>“This is a little strange. I was attacked just after I was teleported here.”<br/><br/>Wang Xian shook his head. He was speechless.<br/><br/>However, at this moment, he also started to move.<br/><br/>Since the other party wanted to attack him, he would definitely not show mercy.<br/><br/>Boom<br/><br/>Wang Xian’s body shook. A terrifying energy enveloped the entire space.<br/><br/>Whoosh<br/><br/>Wang Xian’s figure disappeared instantly and appeared directly behind the gigantic beast.<br/><br/>“Oh no, he has disappeared!”<br/><br/>“This is an existence at the level of chaos. How is this possible? Why did a chaos-level existence suddenly appear in the Federation of ten days!”<br/><br/>When the gigantic beast saw that Wang Xian had disappeared, it looked around in panic and roared with a face full of fear.<br/><br/>Their gigantic Beast Alliance had attacked the ancient God universe this time in order to destroy the black hole teleportation formation in the ancient God universe.<br/><br/>However, the result surprised them. They were actually unable to destroy the teleportation array.<br/><br/>Thus, the three of them prepared to seal this place and find a way to interfere with the black hole teleportation array.<br/><br/>Before they could find a way, they sensed that someone was teleporting over from the Black Hole teleportation array.<br/><br/>The one using the black hole was definitely an expert from the Ten Suns Federation.<br/><br/>They naturally had to kill the enemy.<br/><br/>However, what shocked them was that the enemy was an extremely terrifying existence.<br/><br/>An unknown expert.<br/><br/>“Immediately lean together, don’t let him kill them one by one.”<br/><br/>The black and white expert immediately roared loudly and approached the giant beast.<br/><br/>“Dong!”<br/><br/>However, at this moment, a terrifying explosive energy came from the body of the giant beast.<br/><br/>The entire body of the giant beast started to split into pieces!<br/><br/>“Ah!”<br/><br/>From the inside of the Giant Beast, a human’s scream could be heard.<br/><br/>“Not good!”<br/><br/>“Break for me!”<br/><br/>The soul-like powerhouse held the energy-like figure of Wang Xian and crushed it with a loud roar.<br/><br/>At this moment, Wang Xian, who appeared behind the giant beast and killed it instantly, immediately felt a killing curse.<br/><br/>This power was not weak.<br/><br/>The strange attack surprised him!\t\t\t\t\t\t</div>", "images": {}, "success": true}