{"id": 1476, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075721.html", "title": "Chapter 4479 - Chapter 4479: 4478 Cursed Demonic Spirit", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4479 - Chapter 4479: 4478 Cursed Demonic Spirit</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4479: 4478 cursed demonic spirit<br/><br/>However, this strange attack was not of much use to Wang Xian.<br/><br/>His strength was only a little more than the Great Dao level.<br/><br/>Compared to the current Wang Xian, the gap was still too big.<br/><br/>The power of the curse could be easily withstood by Wang Xian.<br/><br/>“His strength is too strong. It’s not something we can fight against. Run!”<br/><br/>When the soul-like powerhouse saw that his all-out attack had no effect on Wang Xian, his expression changed and he roared in shock and anger!<br/><br/>“It won’t be so easy to escape.”<br/><br/>Wang Xian looked at this special life form powerhouse curiously.<br/><br/>His attack was very strange. It was completely impossible to defend against.<br/><br/>It was as if it was a special curse.<br/><br/>His figure flashed and grabbed towards him.<br/><br/>When this expert saw that Wang Xian had locked onto him, his expression changed drastically. His body began to turn illusory rapidly.<br/><br/>It was as though he was about to disappear from this world.<br/><br/>Buzz<br/><br/>However, a powerful spatial force forced his body out.<br/><br/>“How is this possible? This is my life-saving escape ability.”<br/><br/>The expert was jolted out. His eyes were wide open as he roared in astonishment.<br/><br/>Buzz<br/><br/>Wang Xian moved his palm and a dragon claw formed from chaotic force covered him completely.<br/><br/>It was completely confined.<br/><br/>Wang Xian did not kill him directly.<br/><br/>He looked at the last expert.<br/><br/>It was a creature with two heads of black and white.<br/><br/>It was an expert who was a combination of darkness and light. This expert’s strength was considered the strongest among the three of them.<br/><br/>His strength was comparable to two existences at the Great Dao level.<br/><br/>This creature was currently fleeing in the distance.<br/><br/>However, the surrounding space was suppressing him, causing his flying speed to slow down to an extremely terrifying boundary.<br/><br/>“How could this be? How could such a powerful existence appear? I’ve encountered experts at the primal chaos level before, but they are definitely not this powerful.”<br/><br/>“Too powerful. Even the Beast Gods of the Behemoth Universe didn’t have such a great suppression. Two great dao-level experts were instantly killed by him.”<br/><br/>The black-and-white two-headed creature was somewhat fearful.<br/><br/>He didn’t understand. When did the ten days Federation Alliance actually give birth to such a powerful existence?<br/><br/>He desperately wanted to escape. The light and dark energy all over his body collided, wanting to open up a path.<br/><br/>However, at this moment, he felt as though he was locked on.<br/><br/>This made his entire body tense up.<br/><br/>“Oh no, I’m locked on!”<br/><br/>He was a little terrified!<br/><br/>Buzz<br/><br/>“Your speed is too slow. Die!”<br/><br/>Wang Xian easily teleported in front of him and grabbed their bodies with his dragon claws.<br/><br/>The irresistible power made them extremely fearful.<br/><br/>Facing Wang Xian, they couldn’t even use their ultimate treasures to escape.<br/><br/>“Eh, no wonder I felt that you guys were a little strange. It turns out that there is a special ultimate treasure of Heaven’s origin creation in your body!”<br/><br/>When Wang Xian grabbed this black-and-white dual-headed powerhouse, he revealed an astonished expression.<br/><br/>There was a ultimate treasure of Heaven’s origin creation in his body.<br/><br/>It was a very strange ultimate treasure.<br/><br/>It was not an offensive type but a support type.<br/><br/>The Ultimate Treasure of the Heaven’s origin was a combination of light and darkness attributes.<br/><br/>It was very special.<br/><br/>“No, no, don’t take away our ultimate treasure, no!”<br/><br/>The black and white dual-headed Great Dao master sensed that Wang Xian wanted to take away the ultimate treasure of the Heaven’s origin in his body. He revealed an expression of shock and anger.<br/><br/>He possessed the light and darkness attributes and was able to achieve a perfect fusion. It was all because of the existence of this ultimate treasure.<br/><br/>Once they lost this supreme treasure, their strength would be greatly reduced.<br/><br/>They would even drop from the strength of two Great Dao to one Great Dao.<br/><br/>This unique treasure of Heaven’s origin was too important to them.<br/><br/>It was the key to balancing the power of darkness and light in their bodies.<br/><br/>“You guys should be from the Behemoth Alliance, right? I don’t have any enmity with you guys and I’m not from the ten days federation. However, since you guys attacked me, I won’t stand on ceremony. I want this Supreme Treasure of Heaven’s origin and your corpses.”<br/><br/>Wang Xian said with a smile. A wave of deathly silent energy surged into his body, causing his vitality to disappear.<br/><br/>The three Great Dao level powerhouses were completely dead before they could even use their escape treasure skills.<br/><br/>This was Wang Xian’s current formidable strength.<br/><br/>In front of Wang Xian, a great dao level powerhouse wouldn’t be able to escape even if he wanted to.<br/><br/>After killing them easily, Wang Xian kept the corpses and treasures.<br/><br/>He checked the black-and-white dual-headed powerhouse’s ultimate treasure of Heaven’s fate.<br/><br/>It was a little special. It could perfectly merge light and darkness.<br/><br/>At the same time, it could enhance light and darkness.<br/><br/>This was a powerful supplementary treasure. It was especially suitable for powerhouses who cultivated both light and darkness.<br/><br/>Using this ultimate treasure of Heaven’s fate, one could reach the level of ultimate treasure of Heaven’s fate with light and darkness.<br/><br/>Overall, this heavenly creation supreme treasure could only give a great being an increase of two beginner-level powers.<br/><br/>However, if one broke through with light and darkness, they would be stronger than space.<br/><br/>Overall, this heavenly creation supreme treasure could give a great being an increase of one control level and one beginner-level.<br/><br/>It would depend on the user.<br/><br/>However, this ultimate treasure of the Heaven’s origin also had a huge flaw. Once the ultimate treasure of the Heaven’s origin was taken away,.<br/><br/>Its original owner would cause irreparable damage.<br/><br/>It could be used by the disciples of the Dragon Palace. However, he had to set up a restriction on this ultimate treasure of the Heaven’s origin. He couldn’t let it be taken away.<br/><br/>Wang Xian was deep in thought.<br/><br/>Regardless, although Wang Xian was displeased by the attack, he had reaped great rewards this time.<br/><br/>Wang Xian moved and flew to the special soul expert.<br/><br/>Wang Xian was still filled with curiosity towards this expert.<br/><br/>“No, no. Sir, please don’t kill me. Please don’t kill me.”<br/><br/>The expert in soul form was completely confined. When he saw Wang Xian staring at him, he revealed a terrified expression and begged for mercy loudly.<br/><br/>Since he wasn’t killed now, it meant that there was still a chance for him to survive.<br/><br/>Wang Xian sized him up and sensed the energy in his body.<br/><br/>It was indeed a special soul power, the fusion of darkness and soul power.<br/><br/>It was an extremely strange energy. Wang Xian used the power of chaos to simulate it and realized that it could also be simulated.<br/><br/>However, he didn’t know how to use this energy for the time being.<br/><br/>“Interesting energy. What race are you from?”<br/><br/>Wang Xian spoke to the soul-like powerhouse, “If you perform well, I won’t kill you.”<br/><br/>“Yes, Yes, my Lord!”<br/><br/>The cursed demonic spirit nodded his head vigorously. In the face of such a terrifying existence, even if he was a top-notch powerhouse in the cursed universe, he had to lower his head.<br/><br/>This existence was too strong.<br/><br/>“My lord, I am the cursed demonic spirit of the cursed universe. I specialize in the power of curses. As long as we see, smell, or touch any living being, we can cast curses.”<br/><br/>The cursed demonic spirit obediently replied.<br/><br/>He wanted to seek a chance of survival.<br/><br/>As for what he said, it wasn’t a secret!\t\t\t\t\t\t</div>", "images": {}, "success": true}