{"id": 1477, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075726.html", "title": "Chapter 4480 - Chapter 4480: 4479 Strong Race", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4480 - Chapter 4480: 4479 Strong Race</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4480: 4479 strong race<br/><br/>We can smell and curse any living being that we touch.<br/><br/>Wang Xian was astonished when he heard the words of the cursed demonic spirit.<br/><br/>This was equivalent to me being able to curse all the living beings that I see, hear, and touch.<br/><br/>Wang Xian sensed the energy from the cursed demonic spirit himself.<br/><br/>Their energy seemed to carry a special energy in the darkness. This energy was somewhat similar to the power of divination.<br/><br/>Divination, the power of karma.<br/><br/>The special power of the dark soul and karma.<br/><br/>It was very strange, but it had a very powerful energy.<br/><br/>What Wang Xian didn’t know was that the cursed demonic spirit was an extremely powerful universe in the entire Behemoth Alliance.<br/><br/>Their strange abilities made them the strongest partner in the entire Behemoth Alliance.<br/><br/>Their status in the entire Behemoth Alliance was also very high.<br/><br/>For example, the black-and-white two-headed powerhouse just now belonged to another universe. However, he was the only special powerhouse in his universe.<br/><br/>Therefore, in terms of importance, he couldn’t be compared to the cursed devil spirit at all.<br/><br/>The one who was suppressed by Wang Xian was also the most powerful existence of the cursed demonic spirit.<br/><br/>Although they were powerful, it was difficult for them to level up.<br/><br/>This was because the energy and treasures required for them to level up were too demanding.<br/><br/>Powerful races all had their own restrictions.<br/><br/>However, this did not hinder their strength.<br/><br/>“Tell me in detail how you use the energy in your body.”<br/><br/>Wang Xian spoke to the cursed devil spirit!<br/><br/>“HMM?”<br/><br/>The cursed devil spirit was slightly stunned when it heard Wang Xian’s words.<br/><br/>“Yes, Sir!”<br/><br/>The cursed devil spirit hesitated for a moment before nodding.<br/><br/>In fact, he could tell that Wang Xian was definitely not an expert of the ten days federation.<br/><br/>This was because the abilities of the cursed Devil Spirit were analyzed by the ten days Federation’s Most Powerful Technological Universe, the Mechanical Ascension Universe.<br/><br/>The curse spirit was the biggest nemesis of the Mechanical Ascension Universe.<br/><br/>This was because their curses could ignore the mechanical armor and battleships.<br/><br/>As long as he looked over, he could directly curse and kill the scientists of the Mechanical Ascension Universe.<br/><br/>The Mechanical Ascension Universe naturally analyzed his ability and resisted it.<br/><br/>“The usage of our curse spirit’s energy has something to do with our race’s special talent. We can see the life aura of a living being and clearly smell the life aura of a living being<br/><br/>“Therefore, we capture this aura of life and carry out a curse. The curse will enter a living creature’s body based on its aura of life and carry out a curse to kill it<br/><br/>“Let’s not talk about anything else. The power of our cursed demonic spirit’s curse is definitely the most terrifying existence in all of the universes.”<br/><br/>As the cursed demonic spirit spoke, a proud expression appeared on its face.<br/><br/>Everything I saw, touched, and heard could be cursed.<br/><br/>Most importantly, the power of the curse was hard to defend against.<br/><br/>It was exceptionally difficult to defend against.<br/><br/>Its power of the curse could kill existences stronger than itself.<br/><br/>At the beginning stages of their cultivation, it could kill control level experts.<br/><br/>It could curse by two small levels.<br/><br/>In other words, if it had just stepped into the Great Dao level, it could kill two great dao level experts at the beginning stages of their cultivation.<br/><br/>It was even more powerful and strange than the space of the King of the ten great attributes in the universe.<br/><br/>“It is indeed very powerful.”<br/><br/>Wang Xian nodded his head and used the power of chaos to simulate the body of the cursed demonic spirit.<br/><br/>However, because the energy in his body had yet to be completely converted into the power of chaos, the simulation failed.<br/><br/>He pondered for a moment and directly extracted all the power of chaos in his body.<br/><br/>After removing it, he used it to simulate the cursed demonic spirit.<br/><br/>As expected, the simulation was successful.<br/><br/>After the conversion was successful, Wang Xian focused his attention on it. He realized that he could indeed see the life force of a living creature.<br/><br/>He could easily capture this life force.<br/><br/>“After you capture the life force of the enemy, how do you perform the curse?”<br/><br/>Wang Xian asked him.<br/><br/>“HMM?”<br/><br/>The cursed demonic spirit was a little surprised when he heard Wang Xian’s question. “It’s very simple to cast a curse. You condense the life force into a doll and then attack it. Any attack that falls on the doll will be equivalent to the person being cursed.”<br/><br/>“Alright!”<br/><br/>Wang Xian nodded and understood a little.<br/><br/>“You can go. I Won’t kill you!”<br/><br/>Wang Xian was a man of his word. He waved his hand at the cursed demonic spirit.<br/><br/>“Thank you, sir. Thank you, Sir!”<br/><br/>Upon hearing this, the cursed demonic spirit was extremely excited.<br/><br/>One had to know that if he were to be killed, he would have to pay a huge price to recover.<br/><br/>Being able to preserve his life was equivalent to preserving a lot of resources.<br/><br/>The cursed demonic spirit escaped in an instant.<br/><br/>After the cursed demonic spirit escaped, Wang Xian moved his palm and took out a huge corpse once again.<br/><br/>The body of the giant beast.<br/><br/>Originally, there was an expert who was parasitized in the body of the giant beast.<br/><br/>However, when he saw that there was no hope of escaping, he killed himself to prevent himself from being abused.<br/><br/>Wang Xian sized up the body of the giant beast and discovered that there was a special energy in the body of the giant beast.<br/><br/>However, he did not know how to operate this energy.<br/><br/>The energy was of the wood attribute and had a parasitical effect.<br/><br/>“The parasitical method of the Giant Beast Universe. It seems that I need to capture the powerhouses of the giant beast universe before I can study it.”<br/><br/>Wang Xian mumbled.<br/><br/>This ability of the giant beast universe was also very special and powerful.<br/><br/>“Although I was attacked, the harvest was really good.”<br/><br/>Wang Xian smiled and scanned his surroundings.<br/><br/>The surrounding area was in a mess and was covered by an energy shield.<br/><br/>All the living beings within the energy shield were killed.<br/><br/>“It seems that the situation here is similar to the justice universe. There are also frequent outbreaks of wars.”<br/><br/>Wang Xian thought to himself.<br/><br/>However, this had nothing to do with him. He just wanted to see if he could get any good things or treasures here.<br/><br/>Putting everything else aside, he had just obtained the Heaven’s origin creation treasure.<br/><br/>Coupled with the ability of the cursed demonic spirit, it was extremely powerful.<br/><br/>Especially the latter, it was of great use to Wang Xian.<br/><br/>“What a perverse ability.”<br/><br/>Wang Xian’s eyes flickered.<br/><br/>This ability, especially when dealing with existences weaker than him, was completely impossible to guard against.<br/><br/>If the other party wanted to win by outnumbering him, it would be impossible.<br/><br/>For example, 50 experts at the level of Great Dao could easily destroy Wang Xian together.<br/><br/>However, if Wang Xian were to use this curse power, he could easily kill them one by one.<br/><br/>This was because his curses ignored the defense of energy. He could only rely on his physical body and the energy in his body to resist.<br/><br/>It would be difficult for others to help.<br/><br/>Of course, if they could find a special way to help, it would be another story.<br/><br/>At the very least, Wang Xian could be killed easily without knowing the specific situation.<br/><br/>“Continue to the 10-day federation!”<br/><br/>He scanned his surroundings and looked at another black hole teleportation formation. Then, he walked straight over.\t\t\t\t\t\t</div>", "images": {}, "success": true}