{"id": 1472, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075701.html", "title": "Chapter 4475 - Chapter 4475: 4474 Destroyed Universe, Technological Universe", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4475 - Chapter 4475: 4474 Destroyed Universe, Technological Universe</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4475: 4474 destroyed universe, technological universe<br/><br/>Wang Xian came to the position above the lair of the chaos Behemoth and took a look at the trees here.<br/><br/>The trees contained a special energy that was very similar to the rocks here.<br/><br/>It was more like a rock than a tree.<br/><br/>After flying one round, Wang Xian flew toward the huge flaming meteorite in the sky.<br/><br/>The flaming meteorite that could burn in the chaos was basically the god of elements.<br/><br/>However, this flaming meteorite was not the god of elements.<br/><br/>Wang Xian came to the front of the flaming meteorite.<br/><br/>This flaming meteorite was very huge. It was equivalent to a sun that could illuminate the entire universe.<br/><br/>One could imagine its size.<br/><br/>The Flames on it were burning continuously. The boiling hot lava flowed like a river!<br/><br/>The power of the flames here was extremely dense. The fire attribute experts who were cultivating in this place were completely different from those in the Dragon Palace.<br/><br/>“The energy of this flaming meteorite is really huge. However, its energy is also gradually decreasing. Just like the Sun, it also has its own lifespan!”<br/><br/>“Now that it is the duration of the cataclysm, the decrease in its lifespan is relatively slow. If the cataclysm ends and there is no other energy in the chaos, then this gigantic flaming meteorite would probably only be able to burn for about ten billion years.”<br/><br/>Wang Xian calculated in his heart.<br/><br/>He even suspected that this was a dead god of fire elements that had turned into a huge meteorite in the chaos.<br/><br/>“Huh?”<br/><br/>At this moment, Wang Xian sensed signs of life activity in this flaming meteorite.<br/><br/>“Are there huge beasts of chaos living here?”<br/><br/>Wang Xian thought to himself.<br/><br/>He hesitated for a moment before moving his body and entering the flaming meteorite.<br/><br/>The surface of the flaming meteorite was lava.<br/><br/>When Wang Xian entered it, it was as though he had entered a river.<br/><br/>He moved his body and dived down.<br/><br/>After a few days of diving, he encountered an extremely hard rock.<br/><br/>It would take a long time to go deep into it.<br/><br/>Wang Xian used his divination ability to search for the giant beasts of chaos here but he did not succeed.<br/><br/>This was because his divination was too vague.<br/><br/>Those who could survive here were also existences at the Heaven’s origin level.<br/><br/>There might even be a group of giant beasts of chaos here.<br/><br/>Forget it, I should just slip away. I should go somewhere else to take a look. There are too many uncertainties here<br/><br/>Wang Xian thought to himself.<br/><br/>His body moved and he flew out from the flaming meteorite. He flew towards the boundless chaos in the distance.<br/><br/>“This place is very far away from the land of origin and the Justice Union. It’s even a place that the powerhouses of the land of origin and the Justice Union have yet to touch.”<br/><br/>Wang Xian thought to himself. He estimated that it would take at least tens of millions of years for even a heaven origin creator to fly over here.<br/><br/>Otherwise, this place wouldn’t be unrecorded in the records of the Justice Union and the land of origin.<br/><br/>It was an unfamiliar domain of chaotic space.<br/><br/>I should go and see if there’s a universe here<br/><br/>Wang Xian thought to himself as he flew rapidly in a certain direction.<br/><br/>He flew for thousands of years in the boundless chaos, yet he didn’t even touch the universe.<br/><br/>The chaos was too vast. Without a map to fly, it would make one feel extremely lonely.<br/><br/>That was because it was dark here.<br/><br/>After flying for thousands of years, Wang Xian finally came across a bright universe.<br/><br/>When he saw that universe, a smile appeared on his face as he rushed over quickly.<br/><br/>After entering the universe, he teleported towards the center of the universe.<br/><br/>However, after teleporting for a short while, he realized that this universe was a little desolate.<br/><br/>Yes, it was a little desolate.<br/><br/>After flying for more than ten years, he did not encounter a single life planet.<br/><br/>All of them were bare and there were no signs of life.<br/><br/>This made Wang Xian raise his eyebrows slightly and continue flying in.<br/><br/>When he reached the center, Wang Xian discovered some life planets.<br/><br/>However, what made him frown was that these life planets seemed to have just given birth to life not too long ago.<br/><br/>The level of civilization was very low.<br/><br/>This universe should be suffering from destruction. I can sense that this universe has a slot for the Heaven’s origin creation realm. However, it has already been occupied. This proves that there were Heaven’s origin creation powerhouses here<br/><br/>Wang Xian thought to himself.<br/><br/>He did not stay in this destroyed universe for long. After that, he continued flying forward.<br/><br/>On the way, Wang Xian did not forget to set up demon spirit altars for backup.<br/><br/>He continued flying forward. In the next few hundred thousand years, Wang Xian encountered more than ten universes one after another.<br/><br/>However, each universe was very wild.<br/><br/>They were all subjected to destructive attacks.<br/><br/>Obviously, they were under attack.<br/><br/>“All the universes that I discovered have been destroyed. How many universes are there that I haven’t discovered? I reckon there are dozens or even hundreds of universes that have been destroyed, right?”<br/><br/>Wang Xian thought to himself, “Were they destroyed by those giant beasts of Chaos? It’s possible.”<br/><br/>The strength of the giant beasts of chaos in the land of origin had exceeded Wang Xian’s expectations.<br/><br/>If the giant beasts of chaos there had invaded other universes as well, then all the universes would have been slaughtered by the giant beasts of chaos.<br/><br/>However, the giant beasts of Chaos did not attack the other universes.<br/><br/>Unlike the space beasts, the giant beasts of chaos would not devour everything.<br/><br/>He continued flying forward.<br/><br/>A few thousand years later, Wang Xian encountered another universe again.<br/><br/>However, what surprised Wang Xian this time was that this universe was thriving and was not attacked.<br/><br/>“Finally, I have encountered a normal universe. Moreover, this universe actually has two slots for the Heaven’s origin realm of creation. I can go inside and see if I can find any news.”<br/><br/>Wang Xian smiled and flew quickly toward the center of the universe.<br/><br/>When he got closer to the center of the universe, he realized that it was much livelier here.<br/><br/>In the void, all kinds of flying machines were flying rapidly.<br/><br/>This was a universe that developed technology.<br/><br/>In the Justice Union, there was a technological universe. The name of the universe was also called the technological universe.<br/><br/>The technological universe of the Justice Union was not weak.<br/><br/>They could mass-produce powerhouses at the peak of the ruler realm.<br/><br/>According to rumors, there were more than ten thousand powerhouses at the peak of the ruler realm in the technological universe.<br/><br/>However, there was one regret. They didn’t have a heavenly creation realm master.<br/><br/>This was because the heavenly creation realm master was on a different level. They still needed a heavenly creation realm master.<br/><br/>The technological universe hadn’t been able to break through this limit.<br/><br/>However, the technological universe could still fight and kill a heavenly creation realm master with a mech, battleship, or something like that.<br/><br/>They could be said to be an exception among the universe.<br/><br/>There were many technological abilities in the technological universe that possessed great special effects.<br/><br/>“The technology of this technological universe doesn’t seem to be weak either.”<br/><br/>Wang Xian sensed some of the technological spaceships around him. Some of the technological spaceships contained energy that could threaten a venerable.<br/><br/>This was also the reason why he didn’t enter the center.\t\t\t\t\t\t</div>", "images": {}, "success": true}