{"id": 1473, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075706.html", "title": "Chapter 4476 - Chapter 4476: 4475 Dimensional Universe Federation Headquarters", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4476 - Chapter 4476: 4475 Dimensional Universe Federation Headquarters</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4476: 4475 Dimensional Universe Federation headquarters<br/><br/>Wang Xian was flying rapidly in this technological universe.<br/><br/>In the middle, he entered the interior of a spaceship and found the living beings inside!<br/><br/>The spaceship was piloted by robots, but there were also human living beings inside.<br/><br/>These living beings were similar to humans. Their bodies were modified and strengthened by genes. Their bodies were filled with all kinds of powerful treasure particles and could erupt with the strength of a venerable.<br/><br/>The cultivation methods of the technological civilization were very unique.<br/><br/>They were different from other civilizations.<br/><br/>Their cultivation was to constantly improve themselves.<br/><br/>For example, the technological civilization in the origin universe analyzed powerful metals and natural treasures, transferring the energy of natural treasures into their own bodies.<br/><br/>With the energy of natural treasures and the addition of technological weapons, they allowed themselves to burst forth with great power.<br/><br/>The strong ones who were at the peak of the Dominator realm would fuse powerful metals into their bodies. They would either wrap the metals around their bodies or plant the divine tree and divine grass that were at the peak of the Dominator realm into their bodies.<br/><br/>They would then unleash the might of the peak of the Dominator realm.<br/><br/>This was the cultivation method of the technological civilization.<br/><br/>The cultivation method of this technological universe was the same.<br/><br/>Wang Xian obtained some information from the minds of the living beings in this spaceship.<br/><br/>This universe was called the dimensional universe, and it mainly focused on technological civilizations.<br/><br/>The strength of their technological universe could be considered decent. They had the ability to resist and even kill those who had just entered the Heavenly Yuan blessed realm.<br/><br/>In addition, there was one point that surprised Wang Xian.<br/><br/>That was, the living beings in this universe knew about the existence of other universes. They had even visited other universes during the calamity.<br/><br/>Furthermore, their dimensional universe belonged to a member of an alliance.<br/><br/>The members of this alliance were called the Ten Days Alliance.<br/><br/>The ten days alliance seemed to have been established to fight against the Chaos Behemoths and the Behemoth Alliance.<br/><br/>From the dimensional universe, there was a way to quickly reach the ten days alliance.<br/><br/>Furthermore, in the ten days alliance, there was a technological civilization that was even more powerful than the dimensional universe.<br/><br/>This technological civilization had even developed a powerful black hole teleportation technique.<br/><br/>In the dimensional universe, there was this black hole teleportation technique.<br/><br/>“Ten-day Alliance, Behemoth Alliance.”<br/><br/>Wang Xian looked at the information that he received, and his eyes sparkled.<br/><br/>After he set up some devil spirit altars in this universe, he quickly teleported to the center.<br/><br/>A few hundred years later, Wang Xian arrived at the center of the dimensional universe.<br/><br/>In the middle, he received a lot of information.<br/><br/>The headquarters of the ten-day alliance was wrapped in a very unique package.<br/><br/>And the Behemoth Alliance used a special method to control the giant beasts of chaos.<br/><br/>All of these surprised Wang Xian.<br/><br/>Take the headquarters of the ten-day Alliance for example.<br/><br/>In the chaos, there were ten universes that were very close to each other.<br/><br/>It could even be said that it only took a year or so for a great being in the Heavenly Yuan blessed realm to fly from one universe to another.<br/><br/>The ten universes that were gathered together, after experiencing battles and killing, gradually completed their unification.<br/><br/>In addition, the appearance of the primal chaos behemoths also allowed them to form an alliance.<br/><br/>Other than that, in the ten days alliance, which was not a very distant place, there were some universe great beings who grasped the ability to control the primal chaos behemoths, leading the primal chaos behemoths to invade other universes.<br/><br/>Hence, the Giant Beasts Alliance and the Ten Days Alliance were born.<br/><br/>“These two alliances are very powerful.”<br/><br/>Wang Xian mumbled to himself based on some information.<br/><br/>“This is the center of the Dimensional Universe!”<br/><br/>Wang Xian looked ahead.<br/><br/>At the center of the vast universe, which was made up of many planets, there was an extremely huge battleship floating in the center.<br/><br/>In the middle of the universe, there were all kinds of flying machines shuttling back and forth continuously. It was extremely prosperous.<br/><br/>Wang Xian flew straight into the universe.<br/><br/>He concealed his body so that the flying machines around him could not detect his existence at all.<br/><br/>All the technological surveillance could not detect his body at all.<br/><br/>This was the karma ability of divination.<br/><br/>The power of divination involved the power of karma. With the power of divination, it could completely block the technological surveillance.<br/><br/>The entire dimensional universe is controlled by a federation. The leader of the federation has a terrifying weapon in his hands. I can just go and find him myself<br/><br/>Wang Xian thought to himself and quickly arrived at the headquarters of the federation in the dimensional universe.<br/><br/>He swept his mind and did not notice the position of the leader of the Federation.<br/><br/>Buzz<br/><br/>Wang Xian flew to the headquarters of the Federation and revealed himself!<br/><br/>Beep! Beep! Beep<br/><br/>Beep! Beep! Beep<br/><br/>When Wang Xian suddenly appeared, an urgent sound rang out.<br/><br/>One by one, the spaceships flew rapidly toward Wang Xian.<br/><br/>A bolt of lightning descended from the sky and headed toward Wang Xian.<br/><br/>In the Federation headquarters, many experts in mecha rushed over quickly.<br/><br/>Buzz<br/><br/>Wang Xian’s body trembled. The surrounding space froze.<br/><br/>All the spaceships and weapons stopped moving.<br/><br/>When the group of guardians in mecha saw the sudden change, their pupils contracted slightly and their faces revealed a look of astonishment.<br/><br/>They could actually sense that the main weapon protecting the federation headquarters had lost contact.<br/><br/>“Who are you? Why are you here at the Federation headquarters of the Dimensional Universe?”<br/><br/>A huge mech flew over.<br/><br/>Wang Xian swept his gaze across the mech. There were 50 powerhouses who were at the peak of the ruler realm in this mech.<br/><br/>They formed a large mech that could erupt with terrifying strength.<br/><br/>However, this little bit of strength was not enough for Wang Xian to see.<br/><br/>“I got lost in the chaos and accidentally came to your universe. I want to meet your federation’s leader. Don’t even think about resisting. With a single thought of mine, all of you will die!”<br/><br/>Wang Xian said faintly.<br/><br/>“You want to meet our federation leader?”<br/><br/>A voice came from the mech. “Why do you want to Meet Our Federation leader?”<br/><br/>“I told you to call him over, so you called him over.”<br/><br/>Wang Xian looked at the mech. With a flick of his finger, a surge of energy landed directly on the mech.<br/><br/>The metal-attributed fingernails separated immediately. The metal-attributed energy suppressed everything about them.<br/><br/>The 50 powerhouses who were at the peak of the Dominator realm revealed their figures and looked at Wang Xian in astonishment.<br/><br/>“Sir, please calm down. We will inform the leader of the federation right away.”<br/><br/>The 50 powerhouses were extremely shocked. They knew that Wang Xian was an extremely terrifying existence.<br/><br/>He was able to enter the center of their universe without making a sound.<br/><br/>He was able to directly disintegrate their mecha combination.<br/><br/>He was definitely not an ordinary heaven origin creator.<br/><br/>Their dimensional universe could not afford to offend such an enemy.<br/><br/>“Yes, don’t worry, I have no ill intentions!”<br/><br/>Wang Xian nodded and said.<br/><br/>When the fifty powerhouses heard his words, they were still a little nervous and sent out messages one after another.<br/><br/>Buzz Buzz<br/><br/>Buzz Buzz<br/><br/>Not long after, a middle-aged man flew out slowly from the Federation headquarters.<br/><br/>He looked at Wang Xian with a solemn expression.<br/><br/>“May I know why this sir is looking for me?”<br/><br/>The leader of the Dimensional Universe Federation asked with a hint of respect.\t\t\t\t\t\t</div>", "images": {}, "success": true}