{"id": 1480, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075741.html", "title": "Chapter 4483 - Chapter 4483: 4482 Origin Stone, Origin Stone", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4483 - Chapter 4483: 4482 Origin Stone, Origin Stone</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4483: 4482 origin stone, origin stone<br/><br/>10 days in the federation, 10 universes were very close.<br/><br/>And because of this special reason, at the center of the 10 universes, a treasure land was born.<br/><br/>It was similar to the chaotic region, the land of origin.<br/><br/>But this place, compared to the chaotic region of the land of origin, was safer.<br/><br/>This also caused the ten universes to fight for treasures and resources. They fought for a very long time.<br/><br/>In the end, only three out of the ten universes remained.<br/><br/>The mechanical ascension to the universe was also due to the treasures here. It broke through the shackles of the Heaven’s origin and reached its current level.<br/><br/>Wang Xian was very curious about this place and was prepared to take a look.<br/><br/>He took out the ten-day alliance AI that the leader of the Dimensional Universe Federation had given him. Following the route, Wang Xian flew over quickly.<br/><br/>As he flew, he scanned his surroundings.<br/><br/>“The elite level of the strong and the disciples are also much stronger than the Justice Alliance.”<br/><br/>Wang Xian compared in his heart.<br/><br/>Overall, the overall strength of this ten-day alliance should be above that of the Justice Alliance!<br/><br/>It was very strong!<br/><br/>Wang Xian flew straight in. His speed wasn’t very fast.<br/><br/>Half a month later, he arrived at the center.<br/><br/>This was a huge sea of stars.<br/><br/>Yes, it was a special chaotic sea.<br/><br/>The blue sea was emitting a luster and looked very beautiful.<br/><br/>The entire sea was incomparably huge. Its area was equivalent to one-tenth of the entire universe.<br/><br/>Even so, it was still an extremely huge domain!<br/><br/>The Blue Ocean was made up of water energy. The endless water energy formed an ocean region.<br/><br/>Ignoring everything else, just cultivating in this ocean was equivalent to a powerful cultivation treasure ground for water-elemental experts.<br/><br/>“Cultivating in this ocean is no worse than cultivating in the domain formed by the god of elements. There is a saying that water is the source of life. With the ocean, other creatures and treasures can be born in the ocean naturally.”<br/><br/>Wang Xian mumbled.<br/><br/>The chaos was so huge that there were all kinds of strange domains.<br/><br/>Wang Xian was not too curious about this.<br/><br/>However, Wang Xian saw that there were a large number of spaceships and surveillance cameras flying around in this ocean.<br/><br/>According to the information that Wang Xian obtained from the AI, one would have to pay some treasures to enter and cultivate.<br/><br/>This sea was firmly controlled by the 10-day federation.<br/><br/>It was also because of the existence of this sea that many universes were attracted to join the 10-day federation.<br/><br/>Due to the addition of the New Universe, the 10-day federation would allow some of their powerhouses to cultivate here for free for a period of time.<br/><br/>The sea was called the Sea of life. As for whether the 10-day federation had searched the entire sea, it was still uncertain.<br/><br/>Such important information would naturally not be announced by the ten-day federation.<br/><br/>Wang Xian stared at the ocean of life curiously. With a move of his body, he disappeared instantly.<br/><br/>In the next moment, he had already entered the interior of the ocean of life.<br/><br/>Scanning his surroundings, he realized that there were some strong disciples cultivating inside.<br/><br/>He could also sense the aura of the strong ones in the Heaven’s origin realm.<br/><br/>Clearly, this place had attracted many strong ones.<br/><br/>Wang Xian moved his body and flew in quickly.<br/><br/>When he entered the depths, he realized that there were many powerful battleships in the Sea of life.<br/><br/>There were also gigantic mechas.<br/><br/>These battleships and mechas were floating in the Sea of life. They were completely silent and did not activate.<br/><br/>It was obvious that they were storing energy here.<br/><br/>There were numerous scouting aircrafts around these mecha battleships.<br/><br/>Wang Xian scanned the area and his eyes flickered slightly.<br/><br/>This should be a mecha battleship of the water attribute that was created by the mechanical ascension to the universe. It is either absorbing energy or storing energy here<br/><br/>Wang Xian thought to himself. He changed his position and continued to head deeper into the space.<br/><br/>After flying for another month, Wang Xian realized that there were many palaces in the deepest part of the land. There were some strong people entering and leaving.<br/><br/>“It seems that this place has been completely occupied. The treasures should have been searched as well.”<br/><br/>Wang Xian mumbled.<br/><br/>He didn’t stay here any longer and left quickly.<br/><br/>Next, he wanted to search for information about the stone of origin.<br/><br/>There was no information about the stone of origin on the universe’s AI.<br/><br/>The energy of the Stone of origin was at the Heaven’s origin level.<br/><br/>It was difficult for the weak to obtain it.<br/><br/>Furthermore, the stone of origin might not be called the stone of origin in this place.<br/><br/>Therefore, Wang Xian did not manage to find it.<br/><br/>“Let’s go to some shops and take a look.”<br/><br/>Wang Xian thought to himself.<br/><br/>The federation was extremely prosperous in the past ten days. There were all sorts of shops around the Sea of life.<br/><br/>Some of the shops were of a very high level. Occasionally, there would be heaven-grade items.<br/><br/>Wang Xian checked the AI and locked onto the next auction house.<br/><br/>Ascending appraisal auction house.<br/><br/>This was an auction house set up by the Mechanical Ascension Universe. It was also the largest auction house in the 10-day federation.<br/><br/>Wang Xian teleported out of the Sea of life and headed straight for the auction house of the 10-day federation.<br/><br/>The entire auction house was huge. There were intelligent beautiful robots at the entrance to welcome him.<br/><br/>Every robot had a strong combat ability.<br/><br/>“Welcome, sir, to the Ascension appraisal auction house. Would you like to appraise the treasure or auction it? Or do you need other services?”<br/><br/>Wang Xian arrived at the entrance of the Ascension appraisal auction house. The robot attendant walked over and greeted him respectfully.<br/><br/>“I’m here to appraise some items.”<br/><br/>Wang Xian said, “Also, let’s see if we can buy any items.”<br/><br/>“Yes, my Lord. Please follow me.”<br/><br/>The intelligent robot brought Wang Xian into the auction house.<br/><br/>Although the entire auction house was very luxurious, it wasn’t the kind of luxurious technology.<br/><br/>Instead, it was extremely antiques luxurious.<br/><br/>It had a style of green tiles and tiles that made people feel very comfortable.<br/><br/>“Sir, this way please. This is our intelligent appraiser.”<br/><br/>When they came to the appraisal table, the robot service staff said to Wang Xian.<br/><br/>Wang Xian looked over and saw an old man sitting there.<br/><br/>The appraisal of the ascending auction house was one-on-one.<br/><br/>The appraiser was an intelligent robot.<br/><br/>Of course, if there was something that they could not appraise, there would be experts who would appraise it.<br/><br/>“May I know what kind of gemstone this is? Do We have such a treasure here?”<br/><br/>Wang Xian still had two pieces of origin stones that he had yet to absorb. He took out one and handed it to the intelligent appraiser before asking.<br/><br/>“Yes, sir.”<br/><br/>The appraisal robot nodded and immediately started to scan.<br/><br/>Buzz<br/><br/>Following that, a golden glow bloomed in front of him.<br/><br/>“Sir, this is a source stone. It’s an extremely precious source stone.”<br/><br/>Very soon, the appraisal robot said to Wang Xian, “The source stone is extremely precious in our 10-day federation. Currently, there are many experts who are purchasing it at a high price. Sir, you can sell it in exchange for a large number of resources and treasures.”\t\t\t\t\t\t</div>", "images": {}, "success": true}