{"id": 1484, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075761.html", "title": "Chapter 4487 - Chapter 4487: Act 4486", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4487 - Chapter 4487: Act 4486</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4487: Act 4486<br/><br/>Wang Xian moved his body and disappeared immediately.<br/><br/>The densely packed spaceships and battleships and mechs that were flying over instantly disappeared from their targets.<br/><br/>At this moment, Wang Xian had already arrived at a place far away.<br/><br/>He transformed with a shake of his body. His body contained a powerful fire attribute aura.<br/><br/>His facial expression had also changed.<br/><br/>Such a change was something that could not be sensed by any other powerhouses, even if they were to ascend to the universe using machinery.<br/><br/>Neither could they detect it.<br/><br/>The powerful force of chaos could be converted into any kind of energy.<br/><br/>Even Wang Xian’s life force had changed.<br/><br/>He did not care about the eight powerhouses who had destroyed the machinery ascending to the universe.<br/><br/>The other party’s greed was the source of their disaster.<br/><br/>However, the importance they placed on the origin stone had exceeded Wang Xian’s imagination.<br/><br/>They did not hesitate to offend a heaven’s origin creator to get a stone of origin.<br/><br/>It was obviously not worth it, but they did it anyway.<br/><br/>“What use is the stone of origin here?”<br/><br/>Wang Xian mumbled.<br/><br/>After changing into a new outfit, he continued to stroll around the 10-day federation.<br/><br/>In the surrounding area, spaceships, scouting vessels and battleships were whizzing around.<br/><br/>Wang Xian looked ahead.<br/><br/>The style there was a little different from the previous one.<br/><br/>Around the ascending auction house, most of the buildings were built in a technological style.<br/><br/>This place, on the other hand, had a more mystical style.<br/><br/>In front of him, there was a huge island in the sky.<br/><br/>The entire island in the sky looked exceptionally beautiful. The sky above the island was simply flying.<br/><br/>There were all kinds of buildings, entertainment arenas, and so on on the island.<br/><br/>Wang Xian came to this island and scanned his surroundings.<br/><br/>There were more normal cultivators here.<br/><br/>He sensed the strength of some of the disciples around him.<br/><br/>Sensing the existence of a peak-stage ruler, he walked over and brushed past them.<br/><br/>“Soul Catcher!”<br/><br/>At the same time, the soul catcher power was instantly unleashed.<br/><br/>The disciple who was at the peak of the Dominator realm next to him paused for a moment before a confused expression appeared on his face.<br/><br/>Wang Xian walked over and waves of information entered his mind.<br/><br/>“There is no information regarding the origin stone.”<br/><br/>Wang Xian thought to himself, “It would be best if I can find a heaven’s origin creator to investigate the situation.”<br/><br/>As he thought to himself, he looked around and saw a teahouse that was relatively lively. He entered the teahouse directly.<br/><br/>When he reached the top floor, Wang Xian ordered a cup of tea and sat there quietly.<br/><br/>Buzz! Buzz! Buzz<br/><br/>Buzz! Buzz! Buzz<br/><br/>At this moment, a rumbling sound came from outside.<br/><br/>Wang Xian looked over and saw an extremely huge battleship floating not far away.<br/><br/>It was emitting a heart-palpitating energy.<br/><br/>Beep! Beep! Beep<br/><br/>Beep! Beep! Beep<br/><br/>At this moment, some urgent voices were heard in the surrounding void.<br/><br/>“Eh? What’s going on? Why is there an alarm? What Happened?”<br/><br/>“Look at the sky outside. Ascension No. 1 from the Robotic Ascension Universe has actually arrived here. What exactly happened? He actually used Ascension No. 1 from the Robotic Ascension Universe? No Way! Did Something Big Happen?”<br/><br/>“This is a level 1 alarm. It means that an extremely terrifying existence has entered the 10-day federation, and a powerful being has been attacked by him.”<br/><br/>“Hiss, no way? Could it be that a powerful being from the Giant Beast Alliance has infiltrated Our Place?”<br/><br/>“I don’t know what happened. It has been tens of billions of years since such an alarm has occurred within our 10-day federation.”<br/><br/>In the teahouse, the disciples were in an uproar as they looked outside in shock.<br/><br/>Some of the disciples were even more curious as they took out their artificial intelligence and looked through all sorts of information.<br/><br/>“This machine’s reaction to ascending to the universe is so fast.”<br/><br/>Wang Xian was a little surprised by their reaction.<br/><br/>He took out his universe artificial intelligence and looked at it.<br/><br/>“HMM?”<br/><br/>The entire 10-day federation was going to be on alert?<br/><br/>Were all the people without identities going to be investigated?<br/><br/>Wang Xian frowned slightly. Once a large-scale search was conducted, it would be troublesome if he didn’t have an identity.<br/><br/>At this moment, Wang Xian saw a young man sitting in front of him.<br/><br/>The young man had an imposing bearing and his vitality was extremely majestic.<br/><br/>The age cycle wasn’t big, but he had the strength of a ruler at the peak of the realm.<br/><br/>He had a wood attribute cultivation base and a powerful protective imprint on his body.<br/><br/>He also had a powerful treasure that was comparable to the Void Dragon Pool in his body.<br/><br/>“Eh? This is a young man with a deep background and good talent.”<br/><br/>Wang Xian mumbled as he had a plan in his mind.<br/><br/>Buzz<br/><br/>His body moved and he used the soul-absorbing power. All the information about the young man appeared in his mind.<br/><br/>Following that, he raised his eyebrows.<br/><br/>The youth was from the ten days federation. Other than the mechanical ascension, he was one of the other two major forces, a disciple of the Spirit Ascension Universe.<br/><br/>This youth did indeed have quite a background.<br/><br/>In particular, his grandfather was an existence at the Great Dao level.<br/><br/>His parents were both existences at the control level.<br/><br/>Also, his elder sister was also an existence at the beginner level.<br/><br/>Almost all of them were powerhouses in the Heaven’s origin realm.<br/><br/>As for him, as the youngest, he could be said to be the richest second generation.<br/><br/>With his extraordinary talent, he had a high chance of reaching the Heaven’s origin realm in the future.<br/><br/>However, this young man was not in a good mood at the moment. He was rejected because of his confession.<br/><br/>This made him drink tea alone to relieve his boredom.<br/><br/>“I’ll leave it to you.”<br/><br/>A smile appeared on Wang Xian’s face. With a thought, the surrounding influence changed instantly.<br/><br/>“Huh?”<br/><br/>The young man named Wu Tongming in front of him was suddenly shocked. He quickly scanned his surroundings.<br/><br/>He realized that the surrounding scene had changed immediately.<br/><br/>It was as if he was in a separate space.<br/><br/>He quickly looked ahead and saw Wang Xian looking at him with a smile.<br/><br/>“Who… Who Are You?”<br/><br/>Wu Tongming’s expression changed and he revealed a vigilant look.<br/><br/>“Hehe, a fated person. I need to borrow your body and identity for a while.”<br/><br/>Wang Xian said to him with a smile.<br/><br/>“What?”<br/><br/>Wu Tongming was slightly shocked. His expression changed drastically as he stared at Wang Xian. “Let me tell you, if you dare to deal with me, my family will not let you off!”<br/><br/>Buzz<br/><br/>The moment he said that, he instantly moved.<br/><br/>A flower was heading straight for Wang Xian.<br/><br/>The terrifying flower had a strength that was far beyond the peak of the Dominator realm.<br/><br/>This was the weapon that Wu Tongming had on him that was comparable to the fate of the Heaven’s origin.<br/><br/>“Hehe, don’t worry. I Won’t hurt you anymore. I just need to use your body and identity. If you cooperate well, I will give you some benefits.”<br/><br/>Wang Xian waved his arm gently and the flower returned to Wu Tongming’s side.<br/><br/>At the next moment, Wang Xian’s body moved and appeared in front of Wu Tongming. He grabbed at his body.<br/><br/>“This is a life-saving method set up by a Great Dao expert, right? It’s indeed not bad.”<br/><br/>A seed appeared in Wang Xian’s palm and he looked at him with a smile.\t\t\t\t\t\t</div>", "images": {}, "success": true}