{"id": 1481, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075746.html", "title": "Chapter 4484 - Chapter 4484: 4483 Forced The Purchase", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4484 - Chapter 4484: 4483 Forced The Purchase</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4484: 4483 forced the purchase<br/><br/>“Origin Stone?”<br/><br/>Wang Xian’s eyes sparkled when he received the appraisal result.<br/><br/>It turned out that the origin stone was called an origin stone here.<br/><br/>“Are there any origin stones for sale in the auction?”<br/><br/>Wang Xian took out his artificial intelligence and searched through it. He realized that there wasn’t much information about origin stones. He asked the appraiser.<br/><br/>“I’m sorry, sir. Origin stones are a very rare and precious resource here. There’s no information about them being sold. Even in the entire alliance, there’s no information about them being sold. May I ask, sir, do you wish to sell them?”<br/><br/>“Our ascending auction house will definitely be able to give you a satisfactory price.”<br/><br/>The appraiser spoke to Wang Xian.<br/><br/>Wang Xian shook his head. Naturally, he wouldn’t sell the origin stone.<br/><br/>If he wanted to buy it, he wouldn’t be able to.<br/><br/>“No!”<br/><br/>He said and paid some appraisal fees before walking out.<br/><br/>“Sir, you are welcome to visit us next time!”<br/><br/>As the appraiser watched Wang Xian leave, his eyes sparkled.<br/><br/>He immediately sent a message to the upper level.<br/><br/>“We have found the origin stone. It is in the hands of an expert who has just entered the Heaven’s origin realm with a metal attribute. The identity of this person has yet to be scanned. UPLOAD THE MESSAGE!”<br/><br/>Words flashed across the eyes of the appraiser.<br/><br/>At the same time, it was located on the rooftop of the ascending auction house.<br/><br/>A mechanical lifeform was sitting in an office. It was expressionless and had its eyes closed.<br/><br/>At this moment, the mechanical lifeform’s body moved. It opened its eyes and a surprised expression appeared on its face.<br/><br/>This mechanical lifeform seemed to have come to life.<br/><br/>“Information on origin stones.”<br/><br/>At this moment, a voice sounded from the side. Following which, figures walked over.<br/><br/>Seven or eight figures had lustrous eyes.<br/><br/>“Yes, source stones. Currently, almost all the source stones on the market have disappeared.”<br/><br/>Someone said.<br/><br/>“Ever since the news of the Nine Heavens Divine Roc being reborn and resurrected came out, the source stones have been fought over by all the Great Beings. The Nine Heavens Divine Roc is comparable to the strongest giant beast in the Giant Beast Universe. Who wouldn’t want to obtain it!”<br/><br/>“Currently, I only have one origin stone in my possession. One is probably not enough!”<br/><br/>Another person spoke up.<br/><br/>“Let’s go and look for the person who has the origin stones. Let’s see if we can buy them over!”<br/><br/>Everyone spoke up.<br/><br/>Their figures moved and quickly disappeared!<br/><br/>At the same time, Wang Xian had just flown out of the ascending auction house not long ago.<br/><br/>He scanned his surroundings and was prepared to take a look around.<br/><br/>However, at this moment, he sensed many figures flying towards him.<br/><br/>“HMM?”<br/><br/>Wang Xian was slightly stunned and looked over in surprise.<br/><br/>“Hello, my friend!”<br/><br/>The eight of them greeted Wang Yun with a smile.<br/><br/>“Who are you?”<br/><br/>Wang Xian looked at them and asked.<br/><br/>“We won’t hide anything. We want to buy the origin stones from you at a high price. You can name a price.”<br/><br/>The other party didn’t hide anything and said directly.<br/><br/>“HMM? The Ascension auction house is supposed to keep the identity of the customers a secret and would never reveal it?”<br/><br/>Wang Xian narrowed his eyes slightly and said to them.<br/><br/>As an auction house, it was necessary to protect the privacy of the customers.<br/><br/>However, someone actually came over to buy the Stone of origin.<br/><br/>What was his plan?<br/><br/>“My friend, don’t misunderstand. We have no ill intentions.”<br/><br/>The eight of them said immediately.<br/><br/>“I’m not selling it!”<br/><br/>Wang Xian shook his head. “No matter how high the price is, I’m not selling it.”<br/><br/>“My Friend, aren’t you going to consider it?”<br/><br/>The eight of them frowned slightly and asked.<br/><br/>“I’ve already said that I won’t sell it at your auction house. If you guys have it, I can buy it.”<br/><br/>Wang Xian said.<br/><br/>“That’s such a pity!”<br/><br/>The eight of them shook their heads.<br/><br/>Wang Xian glanced at them and left.<br/><br/>“These guys were investigating me just now.”<br/><br/>“They don’t seem to be friendly!”<br/><br/>Wang Xian mumbled to himself.<br/><br/>However, he didn’t take it to heart. Water comes to Earth.<br/><br/>Wang Xian continued to fly forward and started to wander around the surroundings.<br/><br/>“I didn’t manage to find out the identity of this guy. Is he a powerhouse in the Heaven’s origin realm without an identity? Get Someone to register him and find out which universe he belongs to.”<br/><br/>“A beginner-level guy. If he didn’t have some scruples, I would have made him disappear.”<br/><br/>“Don’t act rashly now. Let’s investigate first.”<br/><br/>The eight of them looked at Wang Xian’s disappearing figure and said.<br/><br/>Whoosh! Whoosh<br/><br/>While they were talking, at a location not far behind them, powerful robots and reconnaissance aircraft were flying towards Wang Xian.<br/><br/>Before Wang Xian could enter the next location, he felt a robot flying towards him.<br/><br/>This caused him to frown slightly. An impatient look appeared on his face.<br/><br/>“The target has no identity detected. This powerhouse, please state your identity and record it on the record!”<br/><br/>“In our 10-day federation, any powerhouse who poses a threat to us will have to undergo identity verification if they enter our territory. Please cooperate!”<br/><br/>A few robots flew in front of Wang Xian and spoke.<br/><br/>“Please cooperate!”<br/><br/>The rest of the robots also spoke in a robotic voice.<br/><br/>“Wang Xian, from the nine-origin Universe!”<br/><br/>Wang Xian looked at these robots and spoke directly.<br/><br/>“Wang Xian, the nine-origin universe? There’s no record of the nine-origin universe? There’s no information about the nine-origin Universe!”<br/><br/>A few robots spoke!<br/><br/>“Please verify your real universe and identity. Otherwise, we will list you as a suspicious target.”<br/><br/>The robot continued to stare at Wang Xian and warned him.<br/><br/>“Hehe!”<br/><br/>Wang Xian stared at the robot and smiled coldly.<br/><br/>“Oh?”<br/><br/>At this moment, at a place not too far away, the eight experts from the mechanical ascension universe looked at each other.<br/><br/>They were the higher-ups of the Mechanical Ascension Universe.<br/><br/>They were in charge of the Ascension auction house.<br/><br/>To be able to take charge of such a huge auction house, their strength and status were without a doubt.<br/><br/>After the eight of them obtained the results of the robotic verification, their eyes flickered.<br/><br/>“Let’s go and take a look!”<br/><br/>The corners of their mouths curled up slightly. Their bodies moved and they immediately flew over.<br/><br/>“Sou Sou!”<br/><br/>The eight of them were very fast. Their bodies contained powerful energy.<br/><br/>Each of them was below the level of the Heaven’s origin realm.<br/><br/>Buzz! Buzz! Buzz! Buzz<br/><br/>Buzz! Buzz! Buzz<br/><br/>“My friend, you possess the strength of the Heaven’s origin realm. You need to have an identity to be able to move around within our ten-day federation. You need to reveal your identity now!”<br/><br/>The eight of them flew in front of Wang Xian and stared at him as they spoke indifferently.<br/><br/>“I told you, I’m from the nine-origin Universe!”<br/><br/>Wang Xian stared at them and replied indifferently.<br/><br/>“Hehe, is that so?”? “Our ten-day federation has been exploring the surrounding universe for tens of billions of years. Our black hole teleportation formation is connected to many distant universes. We have never heard of the nine-origin Universe!”<br/><br/>“Therefore, if you are unable to make it clear, we have reason to suspect that you are an expert from the Behemoth Alliance.”<br/><br/>“In that case…”<br/><br/>The middle-aged man who spoke narrowed his eyes slightly. His meaning was very obvious.\t\t\t\t\t\t</div>", "images": {}, "success": true}