{"id": 1486, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075771.html", "title": "Chapter 4489 - Chapter 4489: 4,488 Chaos Level Of The Divine Roc Of The Nine Heavens", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4489 - Chapter 4489: 4,488 Chaos Level Of The Divine Roc Of The Nine Heavens</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4489: 4,488 chaos level of the Divine Roc of the Nine Heavens<br/><br/>I still need to get all the information about the Divine Roc of the Nine Heavens. It would be best if I could understand how to control this divine Roc of the Nine Heavens<br/><br/>Wang Xian kept pondering in his heart.<br/><br/>The value of an existence at the chaos level was too high.<br/><br/>If the Dragon Palace could increase the number of existences at the chaos level, the strength of the Dragon Palace would be invincible.<br/><br/>If they could rely on the dragon palace, they would be able to intimidate the major factions such as the Justice Alliance and the evil sequence faction.<br/><br/>I still need to get information from Wu Tongying, Wu Tongming’s sister<br/><br/>Wang Xian recalled Wu Tongming’s memories and familiarized himself with his habits.<br/><br/>He then sat there and waited quietly.<br/><br/>At this moment, outside the teahouse, battleships were flying by from time to time.<br/><br/>Beams of energy shot towards them, carrying out undifferentiated investigations.<br/><br/>It was obvious that the complete death of the eight scientists had caused the experts who had ascended to the universe to panic.<br/><br/>This killing move was too counter to their robotic ascension to the universe.<br/><br/>Furthermore, the other party was able to instantly kill the eight of them, including those at the control level.<br/><br/>If the other party was targeting them, wouldn’t they be able to easily destroy them.<br/><br/>Would such powerful strength be able to destroy the scientists at the Great Dao Level?<br/><br/>One had to know that the strength of these eight scientists was already comparable to Great Dao level existences.<br/><br/>And the only ones who could kill Great Dao level existences were chaos level existences.<br/><br/>Which powerhouse was a chaos-level existence?<br/><br/>At the same time, at the Black Hole teleportation formation, a group of commanders and scientists at the Heaven’s origin level were also looking at an image.<br/><br/>This image was of Wang Xian who had just rushed over from the black hole teleportation formation. He was sealed by the Thunder Cage and escaped.<br/><br/>“Is it the same person? He can seal the Thunder Cage at the dao-level, but he can’t be sealed?”<br/><br/>“It can detect the Great Dao level scouting device, but it can’t detect his strength.”<br/><br/>“Outside the ascending auction house, he easily killed eight of our scientists. Although their faces are completely different, I don’t believe that there’s no connection between them!”<br/><br/>A scientist looked at the information and frowned.<br/><br/>“Those who can do all this are probably not great dao level existences. They should be primal chaos level experts.”<br/><br/>A commander said with a grave expression.<br/><br/>“80% . Is there such a primal chaos expert in the Behemoth Alliance?”<br/><br/>An expert could not help but ask.<br/><br/>“Even if it’s not an expert from the Behemoth Alliance, it’s probably related to the Behemoth Alliance. He appeared right after the black hole teleportation array was attacked. It’s too suspicious.”<br/><br/>“That’s troublesome for us. Is it because of the Divine Roc of the Nine Heavens?”<br/><br/>“Inform the godly power universe and the three-three universe and inform them of the news.”<br/><br/>An existence at the primal chaos level was suspected to be in their headquarters, causing them to be extremely worried.<br/><br/>An existence at such a level was terrifying!<br/><br/>…<br/><br/>“Xiao Ming, you even asked me to come over personally? Don’t you know to come over yourself?”<br/><br/>At the same time, at the Teahouse, a woman suddenly appeared beside Wang Xian. She grabbed his clothes and spoke.<br/><br/>Wang Xian felt a little helpless in his heart. He imitated Wu Tongming’s previous actions and lowered his head. “I don’t want to go.”<br/><br/>“You have to go even if you don’t want to. Don’t Hang Yourself on a tree, understand? Let me introduce you to a beautiful girl. That girl, Qing Tian, has her heart set on breaking through to the Heaven’s origin realm. She doesn’t like to date.”<br/><br/>Wu Tongying said to Wang Xian.<br/><br/>Following that, he brought him away from the island immediately.<br/><br/>“I don’t want to date either. I want to break through now and increase my strength as soon as possible. where is the Divine Roc of the Nine Heavens? Can I go there when the time comes?”<br/><br/>Wang Xian said.<br/><br/>“It’s not up to me whether you can go or not. You have to go and look for Grandpa. When the time comes, there might be some powerhouses who are at the peak of the ruler realm. I’m not sure. If you can break through to the Heaven’s origin realm, there’s a 100% chance that you can go there.”<br/><br/>Wu Tongying said to him and looked at him. “Kid, why are you so interested in this?”<br/><br/>“I’m obviously interested in existences at the chaos level. If I can get my hands on them, wouldn’t I Be Invincible?”<br/><br/>Wang Xian said.<br/><br/>“Stop daydreaming!”<br/><br/>Wu Tongying rolled his eyes at him and flew off with him.<br/><br/>Not long after, they arrived at the location of a teleportation formation.<br/><br/>“Alright, let’s go. Let’s return to our imminent deity universe. Don’t run here for the time being. In the Mechanical Ascension Universe, eight heaven origin creation level existences have been completely exterminated. It is suspected that chaos level existences have entered our universe.”<br/><br/>Wu Tongying brought him into the teleportation formation. In the next moment, they were teleported directly to the interior of the imminent deity universe!<br/><br/>“Oh!”<br/><br/>Wang Xian nodded his head when he heard his words.<br/><br/>“Eh? Aren’t you curious about how they died?”<br/><br/>Wu Tongying looked at him in astonishment.<br/><br/>“I don’t have to tell you. You will tell me too!”<br/><br/>Wang Xian replied.<br/><br/>“Pa!”<br/><br/>“You are a little weird today. You Don’t even call me sister anymore!”<br/><br/>Wu Tongying patted his head, leaving Wang Xian speechless.<br/><br/>“They were killed by a mysterious powerhouse. Among them, there were a few control-level existences who were completely exterminated. They died immediately after being resurrected. Therefore, the federation is now on lockdown for the next ten days.”<br/><br/>Wu Tongying continued.<br/><br/>“Is it that terrifying?”<br/><br/>Wang Xian pretended to be surprised.<br/><br/>“What the F * ck! Did you kill those powerhouses who ascended to the universe? Did you do it?”<br/><br/>At this moment, Wu Tongming, who could hear everything outside, widened his eyes and shouted at Wang Xian!<br/><br/>“Yes, those guys wanted to take the treasures on me. What a joke. I killed them completely. So you’d better behave yourself!”<br/><br/>Wang Xian heard his roar and transmitted his voice to him.<br/><br/>“You… you are an existence at the chaos level. Why did you transform into my body? Why did you come to bully a nobody like me?”<br/><br/>Wu Tongming’s body trembled in fear.<br/><br/>“For the sake of the Divine Roc of the Nine Heavens, I came to your area by chance and received this news. Naturally, I am interested in the Divine Roc of the Nine Heavens. Don’t worry, I will not kill you or your family. be honest and cooperate with me. Everything will be fine.”<br/><br/>Wang Xian said to him.<br/><br/>Wang Xian didn’t plan to knock him out or confine him.<br/><br/>He still needed Wu Tongming later.<br/><br/>“In addition, we will only let powerhouses of the Heaven’s origin creation level go over now. If you perform well, I will help you complete your breakthrough as soon as possible!”<br/><br/>Wang Xian said to Wu Tongming.<br/><br/>If Wu Tongming made a breakthrough, Wang Xian would be able to obtain more information.<br/><br/>After all, a strong person in the Heaven’s origin realm could not use the soul-absorbing power.<br/><br/>He could only obtain more information from Wu Tongming.\t\t\t\t\t\t</div>", "images": {}, "success": true}