{"id": 1482, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075751.html", "title": "Chapter 4485 - Chapter 4485: 4484 Curse Kill, Completely Obliterated", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4485 - Chapter 4485: 4484 Curse Kill, Completely Obliterated</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4485: 4484 curse kill, completely obliterated<br/><br/>The eight powerhouses who ascended to the universe mechanically threatened Wang Xian without any concealment.<br/><br/>Their faces were filled with mockery and coldness.<br/><br/>In their opinion, they had completely taken Wang Xian down.<br/><br/>According to their examination, Wang Xian was merely a powerhouse who had just entered the Heaven’s origin creation stage.<br/><br/>Among the eight of them, three of them were at the control level.<br/><br/>It was very easy to suppress Wang Xian.<br/><br/>However, they did not make a move directly.<br/><br/>This was because even though this was their territory, all their actions had to comply with the regulations of the ten days federation.<br/><br/>They could not make a move at will.<br/><br/>If they made a move at will, even if it was them, they would be punished.<br/><br/>However, they could make a move against a person who had no identity and whose identity was suspicious.<br/><br/>“If I were to sell the origin stones to you, can you give up now?”<br/><br/>When Wang Xian heard their words, he wanted to laugh and asked them.<br/><br/>“You can try.”<br/><br/>A middle-aged man looked at Wang Xian and said with a smile.<br/><br/>Wang Xian looked at them and laughed as well. “To put it bluntly, you guys want the origin stones in my hands.”<br/><br/>Wang Xian felt that he had been unlucky ever since he entered this area.<br/><br/>Not only was he attacked by the powerhouses of the Behemoth Alliance, but he was also sealed off by the Mechanical Ascension Force of the Federation.<br/><br/>So Be it.<br/><br/>After all, this was someone else’s territory. If they suspected him, he wouldn’t hold it against them.<br/><br/>He didn’t make a move to kill those guys.<br/><br/>Instead, he left immediately.<br/><br/>He left that place and came here. In the end, he was targeted by someone. It was obvious that he wanted to get the origin stone in his hands.<br/><br/>Along the way, there were troubles everywhere.<br/><br/>Wang Xian only wanted to take a simple stroll and see if he could get some treasures.<br/><br/>Why was it so difficult?<br/><br/>He moved his hand and the chaotic energy in his body transformed into the power of the cursed demonic spirit.<br/><br/>The eight illusory auras of life directly condensed into the appearance of the eight people in front of him!<br/><br/>“Huh?”<br/><br/>When the eight people saw that Wang Xian had pointed it out directly, their eyes turned cold instantly.<br/><br/>Waves of mechanical force gathered around them.<br/><br/>A hint of killing intent appeared in the eyes of the leader’s hand. He slowly raised his arm.<br/><br/>A black hole appeared in the center of his palm.<br/><br/>“It seems like you don’t know what’s good for you?”<br/><br/>He stared at Wang Xian and asked!<br/><br/>“Huh? What happened there?”<br/><br/>“I don’t know. It seems like the identity of that young man is rather suspicious. I haven’t found out his identity.”<br/><br/>“He seems to be a powerhouse at the Heaven’s fate level. If the identity of such a powerhouse is suspicious, we really can’t let him in.”<br/><br/>“Those are the eight scientists from our mechanical ascension. Eight of them are here. That person with a suspicious identity won’t be able to cause any trouble.”<br/><br/>In the surrounding area, some spaceships and flying disciples looked at this scene and discussed in low voices.<br/><br/>A powerful attack had happened here in the ten days federation.<br/><br/>The powerhouses of the Behemoth Alliance had infiltrated their territory and carried out a massacre.<br/><br/>At that time, many of their disciples were killed by the powerhouses of the Behemoth Alliance.<br/><br/>Now that they saw this scene, they naturally supported the actions of the federal union.<br/><br/>“Since you are courting death, I will grant you your wish!”<br/><br/>Wang Xian stared at them with a cold look in his eyes.<br/><br/>He extended his palm and a surge of energy entered the eight people’s Phantoms that were formed from the eight life auras in front of him.<br/><br/>A surge of metal force surged into the Phantoms directly.<br/><br/>“You’re looking for death. How dare you act so impudently towards us? Suppress him!”<br/><br/>The eight powerhouses were thoroughly enraged when they heard Wang Xian’s words.<br/><br/>They were taunted by Wang Xian time and time again. They were also prepared to make their move.<br/><br/>The middle-aged man with a black hole in his palm shook his arm and a wave of energy vibrated slightly.<br/><br/>A terrifying aura was emitted from the black hole in his palm.<br/><br/>“Ah!”<br/><br/>However, in the next instant, his expression changed drastically. Rays of golden light shot out from his body.<br/><br/>His expression changed drastically as he screamed in horror.<br/><br/>“Ah Ah Ah Ah!”<br/><br/>“Ahhh!”<br/><br/>“What’s going on? Why did my body suddenly suffer a terrifying attack? !”<br/><br/>In the next moment, the seven people beside him also screamed in terror and horror!<br/><br/>The sudden attack came from within their bodies, causing them to despair.<br/><br/>There was a terrifying golden light in their bodies, destroying their vitality.<br/><br/>“PFFT! PFFT!”<br/><br/>“PFFT! PFFT!”<br/><br/>At the next moment, streams of metal emerged from their bodies.<br/><br/>The middle-aged man with a black hole in his palm widened his eyes and stared at Wang Xian.<br/><br/>His vitality slowly disappeared.<br/><br/>The other seven experts who had ascended to the universe with machines did the same.<br/><br/>Faced with such a terrifying and bizarre attack, they had no way of resisting at all.<br/><br/>Beep! Beep! Beep<br/><br/>The eight powerhouses were killed. The scouting machines and robots around them immediately let out an ear-piercing warning sound.<br/><br/>“Bang!”<br/><br/>However, in the next second, Wang Xian waved his arm and destroyed them immediately before putting them away.<br/><br/>At the same time, the eight corpses were put away as well.<br/><br/>“What? The eight of us have been killed!”<br/><br/>“Oh no, how is this possible? How could the eight of us who have undergone the mechanical ascension be killed in an instant? That young man clearly didn’t do anything. Furthermore, among the eight of us, a few of us are top-notch scientists. We are extremely powerful!”<br/><br/>“Hurry up and run. The other party might be an expert from the Behemoth Alliance. Immediately report this to the Lords of the Alliance!”<br/><br/>“A powerful enemy has invaded. Hurry up and run!”<br/><br/>In the surrounding area, some of the disciples who were paying attention to this side instantly revealed terrified expressions.<br/><br/>The eight of them, experts from the ten days federation, had been mysteriously killed. This caused all the surrounding disciples to be extremely shocked.<br/><br/>It must be known that among the eight of them, a few of them frequently appeared in high-level meetings. They were top-notch scientists.<br/><br/>They were existences at the control level.<br/><br/>However, such experts actually died in a strange manner in an instant!<br/><br/>This made them extremely terrified. They fled frantically into the distance.<br/><br/>Wang Xian swept his gaze across his surroundings and didn’t pay much attention to them.<br/><br/>He moved his palm and the eight illusory figures formed from the aura of life in front of him still existed.<br/><br/>With a move of Wang Xian’s palm, terrifying flames entered.<br/><br/>At the same time, in a battleship located in the depths of the ocean of life.<br/><br/>At the command center of this battleship, there was a huge energy pool. In the middle of the pool lay the body of a middle-aged powerhouse.<br/><br/>This was one of the powerhouses who had just been killed.<br/><br/>As powerhouses who focused on technology, they possessed a large number of bodies and clones.<br/><br/>Once they died, they could be resurrected!<br/><br/>This was one of the places where he could be resurrected.<br/><br/>“Cough Cough!”<br/><br/>The middle-aged man sat up from the energy pool. His face was filled with anger and fear.<br/><br/>“Damn it, who is the other party? How can he be so terrifying? How dare he kill us? You’re courting death!”<br/><br/>His expression was ferocious.<br/><br/>“Boom!”<br/><br/>But the next moment, a burst of flame shot out from his body!\t\t\t\t\t\t</div>", "images": {}, "success": true}