{"id": 1488, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075781.html", "title": "Chapter 4491 - Chapter 4491: 4490. More Information", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4491 - Chapter 4491: 4490. More Information</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4491: 4490. More information<br/><br/>“You can break through now. Go and break through.”<br/><br/>Wang Xian looked at Wu Tongming’s condition and spoke to him.<br/><br/>After obtaining Wu Tongming’s memories, he also knew that his family had already prepared a spot for him to break through to the Heaven’s origin blessed realm.<br/><br/>This was the benefit of having a good background.<br/><br/>The spot for him to break through was reserved for him early on.<br/><br/>“Alright, I’ll inform my sister and parents to bring me there.”<br/><br/>Wu Tongming nodded excitedly as well.<br/><br/>“Alright, I’ll be by your side when the time comes. Remember, after the breakthrough, ask your sister, parents, and the rest for specific information about the Divine Roc of the Nine Heavens. Also, ask them for the method to control the Divine Roc of the Nine Heavens.”<br/><br/>Wang Xian instructed him.<br/><br/>“Okay, okay.”<br/><br/>Wu Tongming nodded his head heavily. His eyes were sparkling as he said, “I will definitely complete the mission. By the way, senior, you have taught me for 100,000 years. In the future, I will address you as my master.”<br/><br/>“You are not worthy!”<br/><br/>Wang Xian said plainly to him.<br/><br/>This made Wu Tongming’s face turn black. He could not help but say, “I am a famous heaven’s favorite in the god-connecting universe. In the ten days federation, I am also the top heaven’s favorite. I have unlimited potential in the future. How can I not be worthy?”<br/><br/>“Let’s see your performance. If I can get my hands on the Divine Roc of the Nine Heavens, I’ll take you in as my disciple.”<br/><br/>Wang Xian smiled and said to him.<br/><br/>After absorbing Wu Tongming’s memories, he knew that this fellow was not a bad person.<br/><br/>However, Wang Xian had no interest in taking him in as a disciple.<br/><br/>The reason why he improved Wu Tongming was for the information about the Divine Roc of the Nine Heavens.<br/><br/>In addition, if he could help him obtain the Divine Roc of the Nine Heavens, Wang Xian could take him in as his disciple as a reward.<br/><br/>He would protect him in the future.<br/><br/>After all, a divine Roc of the Nine Heavens was an existence at the primal chaos level.<br/><br/>If he could increase the Dragon Palace’s existence at the primal chaos level, the Dragon Palace’s strength would receive a qualitative improvement.<br/><br/>Wang Xian didn’t mind taking him in as a disciple and being his backer!<br/><br/>“Alright, Alright.”<br/><br/>Wu Tongming’s eyes lit up and he nodded. “Senior, you are now in the dark. When the battle between the Federation Alliance and the Behemoth Alliance starts in ten days, you might really be able to succeed.”<br/><br/>“Hehe!”<br/><br/>Wang Xian smiled. He had the same thought.<br/><br/>With his strength, the chances of him succeeding in hiding were really high.<br/><br/>“Alright, let’s Make a breakthrough.”<br/><br/>Wang Xian instructed him.<br/><br/>Wu Tongming smiled and nodded. He took out his communication device to inform his sister and parents.<br/><br/>“Xiao Ming, you can make a breakthrough now? How is that possible?”<br/><br/>Not long after, three figures rushed over.<br/><br/>A middle-aged couple and Wu Tongying whom Wang Xian had met before!<br/><br/>The middle-aged couple stared at Wu Tongming in shock and used their energy to sense him.<br/><br/>“No Way, Xiao Ming. Are you finally enlightened after being rejected by your confession?”<br/><br/>Wu Tongying was also looking at him in shock and pinched his arm.<br/><br/>“Mom, Dad, sister, I am a genius, not a genius. I just broke through hundreds of millions of years earlier, what’s The Big Deal!”<br/><br/>Wu Tongming said and glanced at the side.<br/><br/>He found that the senior was indeed awesome. He was invisible next to his parents, and his parents did not sense the presence of outsiders.<br/><br/>“Good, good, good. As expected of my son, I will take you to break through now!”<br/><br/>Wu Tongming’s father patted his arm happily. “Let’s go. Let’s go to the Moon Dust Universe!”<br/><br/>Following that, everyone rushed toward the large-scale teleportation formation in the godly power universe.<br/><br/>At this moment, Wang Xian was also possessing Wu Tongming.<br/><br/>“Grandpa, you’re here too!”<br/><br/>When they came to the front of the large-scale teleportation formation, they saw an old man, Wu Tongming, who had a surprised expression on his face. He shouted.<br/><br/>“Hehe, my precious grandson has broken through. I naturally came to take a look. Good Kid, not bad, not bad!”<br/><br/>The old man smiled as he came in front of Wu Tongming. He patted Wu Tongming’s shoulder and used his energy to sense, he was slightly surprised. “Eh? His foundation is much deeper than the last time I saw you, Kid. What kind of treasure did he obtain? Or has his brain been enlightened?”<br/><br/>“Grandpa, you must have been provoked by the rejection of my confession!”<br/><br/>Wu Tongying said with a smile.<br/><br/>“Can you shut up? I’ll see how you bully me after I break through!”<br/><br/>Wu Tongming’s face darkened as he said to his sister.<br/><br/>“Haha, Good, good. Let’s go. Recently, our ten days federation isn’t very peaceful here. I’ll go with you.”<br/><br/>The old man smiled and the family stepped into the teleportation formation.<br/><br/>“The old man’s strength has already reached two great dao levels and two control levels. His strength is indeed extraordinary.”<br/><br/>Wang Xian was in Wu Tongming’s body. He sensed the old man’s strength and thought to himself.<br/><br/>At this moment, Wu Tongming was equally shocked.<br/><br/>The senior in his body was not even inferior to his grandfather.<br/><br/>One had to know that his grandfather had used his energy to sense the density of the energy in his body just now.<br/><br/>He didn’t even notice it.<br/><br/>“Senior, how strong are you now? Even my grandfather can’t Sense You?”<br/><br/>Wu Tongming couldn’t help but ask.<br/><br/>“It’s no problem to kill your grandfather.”<br/><br/>Wang Xian said faintly.<br/><br/>It was indeed no problem.<br/><br/>After all, Wu Tongming’s grandfather had yet to reach the chaos level. Furthermore, with Wang Xian’s current control of divination power, cursed demonic spirit power, and mutated space power, he was able to kill all sorts of strange energies.<br/><br/>Wu Tongming’s grandfather was able to kill him instantly.<br/><br/>“Are you serious? My grandfather is close to the chaos level.”<br/><br/>Wu Tongming transmitted his voice in disbelief.<br/><br/>“I’m not an ordinary chaos level either!”<br/><br/>Wang Xian replied indifferently.<br/><br/>This sentence made Wu Tongming gape.<br/><br/>Before he could communicate with Wang Xian, they were teleported to the ocean of life of the ten-day federation.<br/><br/>Then, they stepped into the teleportation formation not far away.<br/><br/>Soon, they arrived in another universe.<br/><br/>“Xiao Ming, break through!”<br/><br/>After arriving in this universe, the old man said to Wu Tongming directly.<br/><br/>“Yes, Grandpa!”<br/><br/>Wu Tongming nodded. He flew to the position in the air and began his own breakthrough.<br/><br/>Wang Xian left his body and waited quietly at the side.<br/><br/>The process of the breakthrough was very smooth without any interference.<br/><br/>Wu Tongming had successfully reached the Heaven’s origin blessed realm. This made him look excited.<br/><br/>“Hahaha, Grandpa, Dad, Mom, I have also made a breakthrough!”<br/><br/>After the breakthrough, Wu Tongming flew over excitedly.<br/><br/>“Hehe, not bad, not bad. This way, the weapon in your hand can be used to the fullest. You can be considered to have stepped into the core of our Tongshen Universe.”<br/><br/>Wu Tong Ming’s father smiled and patted his head.<br/><br/>“Hehe, then in the future, if you have any matters, can you bring me along?”<br/><br/>Wu Tong Ming opened his mouth and said.<br/><br/>“Sure. Since you’ve already broken through, you can understand more things and obtain more secrets. Walk home.”<br/><br/>The old man also smiled and said to Wu Tong Ming.<br/><br/>Following closely, the group left this universe.\t\t\t\t\t\t</div>", "images": {}, "success": true}