{"id": 1489, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075786.html", "title": "Chapter 4492 - Chapter 4492: 4491 Forbidden Area Of Life, A Heavenly Yuan Creation Treasure!", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4492 - Chapter 4492: 4491 Forbidden Area Of Life, A Heavenly Yuan Creation Treasure!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4492: 4491 forbidden area of life, a Heavenly Yuan creation treasure!<br/><br/>“It’s Grandpa!”<br/><br/>Wu Tongming followed his parents and Grandpa back to the Spirit Path Cosmos.<br/><br/>Then, they came to the study room where Wu Tongming’s grandpa was!<br/><br/>His grandson had completely grown up, becoming an existence at the Heavenly Yuan creation level.<br/><br/>He was very gratified, but also very happy.<br/><br/>He could also tell his grandson some things about the godly universe.<br/><br/>The situation of the ten-day federation, the situation of the Behemoth Alliance.<br/><br/>Wait, wait!<br/><br/>This time, Wu Tongming had a very detailed understanding of the ten-day federation and their godly universe camp. At the same time, he also had some understanding of some secrets.<br/><br/>This included how to control the Nine Heavens Divine Roc.<br/><br/>Wang Xian also stopped at the side. He had a detailed understanding of the 10-day Federation Alliance and the Tongshen Universe!<br/><br/>The 10-day Federation alliance was not as united as he had imagined.<br/><br/>The Tongshen universe and the three-three universe were very different from the concept of mechanical ascension to the universe.<br/><br/>Mechanical Ascension to the universe was more inclined towards war, using war to nourish war.<br/><br/>However, the spirit universes and the three-three universes were more gentle, leaning towards accommodating all rivers.<br/><br/>However, in the past few hundred billion years, the strength of the mechanical ascension universe had increased tremendously.<br/><br/>Other aspects were growing rapidly beyond its peak combat strength.<br/><br/>It had already far surpassed the spirit universes.<br/><br/>However, because the spirit universes and the three-three universes each had a primal chaos level person overseeing them.<br/><br/>There was only one mechanical ascension universe, so even though the idea of the Mechanical Ascension Universe was radical, there was nothing they could do.<br/><br/>Of course, this was only on the surface. As for what was going on in the dark, that was unknown.<br/><br/>Apart from the ten days federation, they also learned some information about the behemoth universe.<br/><br/>The Behemoth Universe also had three primal chaos level existences.<br/><br/>However, they controlled a primal chaos behemoth race.<br/><br/>A group of more than 20 Primal Chaos Behemoths in the Heaven’s fate realm.<br/><br/>The strength of these 20 plus primal chaos behemoths when they joined forces was extremely terrifying.<br/><br/>Even a primal chaos level existence could be suppressed by them.<br/><br/>Other than that, it was about some other confidential information!<br/><br/>Some treasured lands that Wu Tongming didn’t know about.<br/><br/>Some mysterious places.<br/><br/>In short, Wang Xian had obtained most of the information regarding the ten-day federation.<br/><br/>“Hey, senior, you know all the secrets of our family. If my grandfather knew about it, I’m afraid he would lock me up for billions of years!”<br/><br/>After returning to Wu Tongming’s residence, he looked at Wang Xian, who was invisible at the side, and couldn’t help but speak up!<br/><br/>“Don’t worry, I’m not the enemy of your supernatural universe.”<br/><br/>Wang Xian said with a smile.<br/><br/>“But you killed eight scientists from our ten-day federation. Furthermore, you killed them completely. If the machine ascends to the universe were to find out, my life would be in danger!”<br/><br/>Wu Tongming continued to speak with a frown on his face.<br/><br/>He was indeed more worried about such matters.<br/><br/>Compared to Wang Xian’s strength, he didn’t know if his words were true or false.<br/><br/>If he was exposed in the end, he would be finished.<br/><br/>Wang Xian looked at him, he shook his head and said, “There are still more than three million years before the birth of the Divine Roc of the Nine Heavens. Next, I will help you to increase your strength. In addition, seeing how cooperative you are, I will see if I can help you obtain a treasure.”<br/><br/>As Wang Xian spoke, he patted his head.<br/><br/>“Treasure?”<br/><br/>Wu Tongming was slightly stunned. He looked at Wang Xian with a stunned expression.<br/><br/>“Didn’t your grandfather say that your ten-day federation has discovered a secret land? Is there a mature Heaven’s origin creation treasure there? Let’s go over and see if we can get it for you.”<br/><br/>Wang Xian spoke to him.<br/><br/>This news was mentioned by Wu Tongming’s grandfather just now.<br/><br/>The ten-day federation had discovered a secret land. There was a heaven’s origin creation treasure there.<br/><br/>However, that Heavenly Yuan Destiny Treasure hadn’t been obtained by them.<br/><br/>The surroundings of the Heavenly Yuan Destiny Treasure contained a terrifying amount of energy, and even those at the primal chaos level couldn’t go deep into it.<br/><br/>“What?”<br/><br/>Wu Tongming was slightly shocked when he heard this. “Senior, you’re saying that you’re bringing me to obtain that Heavenly Yuan Destiny Treasure?”<br/><br/>“This… my grandfather said that for that Heavenly Yuan Destiny Treasure, our ten-day Federation’s Three Primal Chaos Level lords weren’t able to obtain it!”<br/><br/>Wu Tongming opened his eyes wide and said!<br/><br/>“I’m not sure if I can obtain it 100% , but we can take a look. If we can obtain it, I’ll give it to you.”<br/><br/>Wang Xian said.<br/><br/>“Then, senior, when are we going over?”<br/><br/>Wu Tongming was a little excited.<br/><br/>It was the ultimate treasure of the Heaven’s origin. There were only four or five of them in the entire supernatural universe.<br/><br/>His grandfather had one.<br/><br/>His parents were not qualified to have one.<br/><br/>If he could get one, his strength would be comparable to his parents.<br/><br/>He could crush his sister directly!<br/><br/>“You can go anytime!”<br/><br/>Wang Xian said.<br/><br/>“Then why are we waiting for Big Brother? We’ll go there immediately!”<br/><br/>Wu Tongming said excitedly.<br/><br/>“Sure!”<br/><br/>Wang Xian nodded and hid in Wu Tongming’s body.<br/><br/>Following that, they headed towards that secret location.<br/><br/>That secret location required a special teleportation formation to get there.<br/><br/>In the past, Wu Tongming didn’t know about this place and wasn’t qualified to use this teleportation formation.<br/><br/>But now, they could.<br/><br/>They teleported to the 10-day federation and arrived at the large teleportation formation of the 10-day federation.<br/><br/>Wu Tongming took out the token he had just obtained and used a teleportation formation to teleport over a long distance!<br/><br/>The next moment, they appeared on a meteorite in the chaos.<br/><br/>Wang Xian sensed his surroundings and revealed himself.<br/><br/>He looked ahead. There was a sea of blood that was emitting a blood-red glow.<br/><br/>The Sea of blood churned continuously and waves of terrifying aura were emitted.<br/><br/>“Senior, it should be ahead. I can sense a terrifying and evil energy even though I’m so far away. It’s so terrifying.”<br/><br/>Wu Tongming looked over and revealed a shocked expression.<br/><br/>He felt that he would be corroded by the terrifying sea of blood as soon as he entered!<br/><br/>“Yes, that’s the place. The Forbidden Zone of Life!”<br/><br/>Wang Xian nodded.<br/><br/>This was the name given to this place by the 10-day federation.<br/><br/>The Forbidden Zone of life!<br/><br/>Once a powerhouse who had just entered the Heaven’s origin realm entered this place, there was only a dead end.<br/><br/>The three powerhouses of the 10-day federation were unable to take away the ultimate treasure of the Heaven’s origin realm here.<br/><br/>In the past, there were still powerhouses of the 10-day federation guarding this place.<br/><br/>However, as time passed, they gave up on this place.<br/><br/>Although there were ultimate treasures of Tianyuan in this place, it was not something that they could obtain.<br/><br/>It was also difficult for other experts to obtain them.<br/><br/>Additionally, if there were really experts who could obtain the ultimate treasures in this place, it would be useless even if they were to guard it.<br/><br/>Therefore, there was a teleportation formation left here. There was nothing else.<br/><br/>“Let’s go.”<br/><br/>Wang Xian waved his arm and brought Wu Tongming to the edge of the forbidden area of life.\t\t\t\t\t\t</div>", "images": {}, "success": true}