{"id": 1483, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075756.html", "title": "Chapter 4486 - Chapter 4486: 4485 Was Shocked", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4486 - Chapter 4486: 4485 Was Shocked</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4486: 4485 was shocked<br/><br/>“Boom! Boom! Boom!”<br/><br/>Lying in the energy pool, the middle-aged man who had just woken up roared with a ferocious expression.<br/><br/>However, at this moment, a terrifying flame power came out from his body, making him look extremely terrified.<br/><br/>“No, no, no, this is impossible!”<br/><br/>“No!”<br/><br/>He screamed miserably, but the terrifying flame slowly burned his body to ashes.<br/><br/>This body of his died instantly.<br/><br/>At the same time, in another base.<br/><br/>In various powerful battle fortresses.<br/><br/>In the core of the Mechanical Ascension Universe!<br/><br/>The scientists who had just been revived and wanted to take revenge, the terrifying flames also burned their bodies.<br/><br/>This caused their bodies to die completely.<br/><br/>“Damn it!”<br/><br/>“Damn it!”<br/><br/>However, the scientists who had just been revived didn’t have many other things, but they had a lot of lives.<br/><br/>After their two bodies were killed, their other bodies started to revive!<br/><br/>The middle-aged man was revived again, and there was a hint of fear in his eyes.<br/><br/>“How did I Die Just Now? How did he attack me?”<br/><br/>“This terrifying attack is somewhat like… somewhat like a cursed devil spirit.”<br/><br/>“No, no, unless the strongest cursed devil spirit attacked us, otherwise, it wouldn’t be possible to kill us one after another. That young man is clearly not an expert of the cursed devil spirit race.”<br/><br/>He kept on saying.<br/><br/>But at this moment, he suddenly felt a terrifying flame appear in his body again.<br/><br/>This made him lower his head, his face filled with shock.<br/><br/>“No, I don’t want to Die!”<br/><br/>“Help!”<br/><br/>He immediately sent out a distress signal.<br/><br/>However, as soon as he sent out the distress signal, he died.<br/><br/>The same thing happened to the other seven heavenly fate realm experts.<br/><br/>They died again.<br/><br/>“Beep! Beep! Beep!”<br/><br/>“Beep! Beep! Beep!”<br/><br/>At the same time, machines ascended to all parts of the universe.<br/><br/>All the powerful scientists received eight distress signals at the same time.<br/><br/>When they saw these eight distress signals, they were slightly shocked.<br/><br/>The strength of the mechanical ascension universe was extremely strong.<br/><br/>In fact, there were more than 50 heaven origin creation realm existences.<br/><br/>However, even so, when the eight heaven origin creation realm experts sent a life and death distress signal at the same time, all the scientists were shocked.<br/><br/>“What’s going on? Under normal circumstances, even if they were killed once, this level of distress signal wouldn’t be sent out. What happened to them?”<br/><br/>“Also, aren’t the Okola scientists at the core of the Federation? How did they encounter a life-and-death crisis?”<br/><br/>“The ones who sent the distress signal are all the directors of the Ascension Auction House. What exactly happened to them?”<br/><br/>At the black hole teleportation array not far away, a group of powerful commanders received the distress signal, and their expressions changed drastically.<br/><br/>“If something like this suddenly happens at this time, let’s not move for the time being. Let the others go over and investigate first!”<br/><br/>A commander said.<br/><br/>The black hole teleportation array had suddenly been attacked, and they were currently locking down this place.<br/><br/>There was a sudden call for help from an expert outside.<br/><br/>In order to not be a distraction, they did not leave. Instead, they left it to the other scientists to handle.<br/><br/>Buzz Buzz<br/><br/>Buzz Buzz<br/><br/>However, they soon received another message.<br/><br/>These were the messages sent by the eight scientists who were killed by Wang Xian’s curse after they were resurrected.<br/><br/>“We have suffered from a terrifying curse. Once we are resurrected, we will be killed immediately. We are doomed.”<br/><br/>“The target who attacked us has been sent to the information vault!”<br/><br/>“Be careful of him. He is very strange, very similar to the attack of the cursed demon spirit.”<br/><br/>“You must avenge us!”<br/><br/>The eight scientists sent them information one after another.<br/><br/>When they saw the information, their expressions changed drastically.<br/><br/>The eight scientists that had ascended into the universe were suffering from complete destruction?<br/><br/>This was complete destruction!<br/><br/>The universe that they had developed with technology could achieve extraordinary immortality.<br/><br/>It had a large number of cloned bodies.<br/><br/>But now, the eight scientists were facing complete destruction.<br/><br/>No, they were heading towards destruction.<br/><br/>This made them a little afraid.<br/><br/>What kind of enemy could do this.<br/><br/>In the Behemoth Alliance, they had a nemesis, and that was the cursed devil spirit race.<br/><br/>The cursed devil spirit race was very powerful and could carry out terrifying curses.<br/><br/>They could ignore their mechanical defense, which greatly restrained them.<br/><br/>However, in the cursed devil spirit race, the strongest was only at the Great Dao level.<br/><br/>Although they could easily kill control level existences.<br/><br/>However, they would never be able to kill eight clones with such a direct curse. Furthermore, they would be able to kill the clones continuously.<br/><br/>If they were able to do so, their robotic ascension to the universe would have declined a long time ago.<br/><br/>“What kind of enemy is it? Contact the leader immediately. This matter is of great importance.”<br/><br/>“Also, lock onto that enemy.”<br/><br/>Within a short period of time, all the powerhouses in the robotic ascension camp started to make their moves.<br/><br/>This news even reached the strongest expert in the mechanical ascension faction.<br/><br/>…<br/><br/>Wang Xian did not know how much panic and shock his one move had brought to the entire mechanical ascension faction.<br/><br/>However, Wang Xian did not mind.<br/><br/>He had been using the power of the cursed demonic spirit to kill the eight scientists.<br/><br/>In a short period of time, he had done it more than a hundred times.<br/><br/>At the beginning, he still needed to inject a large amount of energy. Later on, with a move of his palm, he completed the curses.<br/><br/>Buzz<br/><br/>Buzz! Buzz<br/><br/>After Wang Xian had executed the curses in large numbers, the life force in front of him began to collapse.<br/><br/>This meant that the powerhouse who possessed this life force had been completely wiped out.<br/><br/>He had completely disappeared into the chaos of the universe.<br/><br/>“This ability is indeed powerful.”<br/><br/>Wang Xian sensed all of this and was slightly surprised.<br/><br/>However, this was also related to their resurrection characteristics.<br/><br/>Their resurrection was done directly to their clones.<br/><br/>The life aura of the clones was the same as theirs.<br/><br/>If it were other powerhouses, their resurrection would usually be done with supreme treasures. Some supreme treasures might not have changed their life aura after resurrection.<br/><br/>However, some supreme treasures would change their life force after being resurrected.<br/><br/>In that case, the effect of the curse would be greatly reduced. It might not even be effective anymore.<br/><br/>The energy of the cursed demonic spirit was purely used to counter technological powerhouses.<br/><br/>Of course, there was another point. Wang Xian’s current strength was too strong.<br/><br/>His combat strength was equivalent to two more chaos-level powerhouses. How could they withstand it?<br/><br/>They couldn’t defend against them at all!<br/><br/>“Let’s Go!”<br/><br/>Wang Xian saw the dense number of flying machines flying towards him. He smiled faintly and left immediately!\t\t\t\t\t\t</div>", "images": {}, "success": true}