{"id": 1487, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075776.html", "title": "Chapter 4490 - Chapter 4490: 4489 To Help Him Break Through", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4490 - Chapter 4490: 4489 To Help Him Break Through</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4490: 4489 to help him break through<br/><br/>“Help me break through to the destiny realm of the Heaven’s origin realm?”<br/><br/>Wu Tongming was slightly stunned when he heard Wang Xian’s words.<br/><br/>His eyes shone brightly. However, when he thought of Wang Xian’s ferocious strength, he was worried that Wang Xian was up to something.<br/><br/>“That’s not right. There shouldn’t be any conspiracy. He has the strength of the chaos realm and stole my memories. With my identity, he can do whatever he wants. There’s no need for him to plot against a nobody like me.”<br/><br/>“He might really be doing it for the Divine Roc of the Nine Heavens. After all, he’s an existence of the primal chaos level.”<br/><br/>Wu Tongming thought to himself, “But our spirit universe also wants to obtain the Divine Roc of the Nine Heavens.”<br/><br/>Wu Tongming’s expression changed drastically.<br/><br/>“That senior, according to the estimation of my parents and grandfather, I still need to cultivate for hundreds of millions of years before I can complete my breakthrough.”<br/><br/>Wu Tongming hesitated for a moment before he spoke to Wang Xian.<br/><br/>It was 100% certain that he could achieve a breakthrough to the destiny realm of the Heaven’s origin.<br/><br/>However, it would still take another 100 million years or so.<br/><br/>“It’s alright. Let me help you. It will greatly shorten this period of time.”<br/><br/>Wang Xian spoke.<br/><br/>“When will the Divine Roc of the Nine Heavens be born? Can it wait until my strength breaks through?”<br/><br/>Wang Xian spoke with Wu Tongming’s body.<br/><br/>“Stop daydreaming. The Divine Roc of the Nine Heavens will be born in a few million years. If you want to break through, it will still take hundreds of millions of years.”<br/><br/>Wu Tongying said faintly.<br/><br/>“That might not be the case. Maybe I will be able to break through very soon. I am preparing to enter closed-door cultivation for a period of time.”<br/><br/>Wang Xian said to her.<br/><br/>“Hehe, alright. Let’s meet this little sister first. Let me tell you, the little sister that I introduced to you is very beautiful and very talented. Moreover, you have met her once.”<br/><br/>Wu Tongying said with a smile.<br/><br/>Wang Xian was helpless. He said to Wu Tongming who was imprisoned in his body, “I will release you later. I will enter your body and behave. Otherwise, I will be able to kill all of you completely.”<br/><br/>“Yes, Senior.”<br/><br/>When Wu Tongming heard Wang Xian’s words, he nodded his head bitterly.<br/><br/>After learning that Wang Xian was able to kill the eight scientists who had ascended mechanically, Wu Tongming also behaved himself.<br/><br/>This was because he was worried that if he angered Wang Xian completely, he would kill him and his sister completely.<br/><br/>He didn’t want to die. He also didn’t want his sister to die.<br/><br/>After arriving at a planet in the Tongshen universe, Wu Tongying prepared a banquet with some friends.<br/><br/>Unknowingly, Wang Xian and Wu Tongming switched bodies and watched everything from within his body.<br/><br/>When Wu Tongying learned that his disciple’s confession had been rejected, he arranged for a girl to be introduced to him.<br/><br/>However, it was obvious that Wu Tongming wasn’t in the mood. He was still thinking about his own white lotus flower.<br/><br/>“SIS, I’m going to start my seclusion. I Won’t leave the mountain until I reach the Heavenly Yuan blessed realm.”<br/><br/>After the banquet ended, Wu Tongming said to Wu Tongying.<br/><br/>“Oh? Hehe, Great. How is this little sister today? Don’t you like her?”<br/><br/>Wu Tongying looked at him with a smile and asked.<br/><br/>“SIS, you don’t have to introduce her to me. Qingtian didn’t completely reject me either. She said that she wants to advance to the Heavenly Yuan blessed realm first.”<br/><br/>Wu Tongming said with a bitter face.<br/><br/>“Hehe, Alright, Alright. It’s up to you. Anyway, Mom and Dad don’t have the intention of having a grandchild.”<br/><br/>Wu Tongying said to him with a smile.<br/><br/>“HMPH, sister, you don’t even have a boyfriend yet. Why are you meddling in my affairs? You’re meddling too much.”<br/><br/>Wu Tongming said with a dark face before flying away.<br/><br/>“Go to the place where you cultivate.”<br/><br/>Wang Xian was in Wu Tongming’s body as he instructed him.<br/><br/>“Senior, you can really help me to advance to the Heaven’s origin blessed realm quickly. My grandfather and the rest have said that I will need hundreds of millions of years of experience to advance.”<br/><br/>Wu Tongming said again.<br/><br/>“Nonsense. If I say that I can help you to achieve a breakthrough, you will be able to do so!”<br/><br/>Wang Xian said to him.<br/><br/>Without mentioning anything else, just by using the space of the primal Chaos Stone, he would be able to achieve a breakthrough.<br/><br/>After all, cultivating in the space of the primal chaos stone for hundreds of millions of years was equivalent to millions of years.<br/><br/>Of course, Wang Xian was not allowed to use this method. The time and space of the space of the primal Chaos Stone was a little overkill for him.<br/><br/>With Wang Xian’s current strength, there was a way to increase his strength rapidly.<br/><br/>Of course, the most important thing was that Wu Tongming’s foundation was too strong.<br/><br/>This fellow had eaten countless treasures.<br/><br/>“Thank you, senior. Thank you, Senior.”<br/><br/>Wu Tongming was also very excited to be able to improve to the Heaven’s origin blessed realm as soon as possible.<br/><br/>After he flew back to a universe that belonged to him in the supernatural realm, he entered a treasure land and began his cultivation.<br/><br/>Wang Xian came out of his body and looked at him with a twinkle in his eyes.<br/><br/>“Come, I’ll Be Your Sparring partner. I’ll let you stimulate your potential and increase your strength as soon as possible!”<br/><br/>Wang Xian spoke to Wu Tongming.<br/><br/>“Yes, yes!”<br/><br/>Wu Tongming was a little excited. Sparring partner. A chaos-level powerhouse was his sparring partner.<br/><br/>To him, this was a huge opportunity.<br/><br/>However, Wu Tongming soon couldn’t be happy anymore.<br/><br/>Wang Xian’s sparring partner was exceptionally cruel. He was completely torturing Wu Tongming.<br/><br/>After he was severely injured, he was healed instantly.<br/><br/>The power of chaos combed his body, causing him to feel so much pain that he wished he was dead!<br/><br/>However, Wang Xian wasn’t going to let him off. He had been torturing Wu Tongming for tens of thousands of years.<br/><br/>During these tens of thousands of years, Wu Tongming felt that he had died tens of thousands of times.<br/><br/>He entered and exited the gates of Hell.<br/><br/>In the later stages, Wang Xian had even caused him to enter an illusion, causing him to be unable to differentiate between reality and illusion.<br/><br/>“Alright, properly comprehend and digest the results of these 10,000 years. After 10,000 years, we will enter until you have achieved a breakthrough.”<br/><br/>Wang Xian said to him.<br/><br/>Wang Xian’s ability to train was not something that other experts could possess.<br/><br/>Firstly, he had a strong healing ability. After that, he sealed his memories and allowed him to enter an illusion.<br/><br/>He also had to simulate the various attacking methods in the illusory realm.<br/><br/>He had to be proficient in all kinds of abilities.<br/><br/>Other experts at the primal chaos level could not do what Wang Xian did.<br/><br/>“AH, senior, do you still want to continue?”<br/><br/>Wu Tongming was on the verge of collapse as he said in pain.<br/><br/>“You will be able to do it in a maximum of 100,000 years. After you break through, I will give you some treasures to allow you to improve further. Together with the treasures in your hands, you will be able to unleash the combat strength of a control level.”<br/><br/>Wang Xian said to him, giving him some benefits!<br/><br/>“Alright then!”<br/><br/>Wu Tongming heard it. He gritted his teeth and nodded his head.<br/><br/>Although the process was very painful, this senior was able to allow him to take another step forward quickly.<br/><br/>This was an extremely difficult thing for any Heaven’s origin creator.<br/><br/>So Be it!<br/><br/>In the next 100,000 years, Wu Tongming suffered from Wang Xian’s torture. He was getting closer and closer to breaking through.<br/><br/>After more than 100,000 years, he could indeed break through!<br/><br/>“Ah, I can finally break through. I can finally stop being tortured!”<br/><br/>Wu Tongming shouted in pain!<br/><br/>Wang Xian looked at him and smiled.\t\t\t\t\t\t</div>", "images": {}, "success": true}