{"id": 1485, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075766.html", "title": "Chapter 4488 - Chapter 4488: 4487 Was Trying To Gather Information", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4488 - Chapter 4488: 4487 Was Trying To Gather Information</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4488: 4487 was trying to gather information<br/><br/>“Who… Who Are You?”<br/><br/>Wu Tongming stared at Wang Xian with a look of shock on his face.<br/><br/>The sudden change in the surrounding scenery and Wang Xian’s sudden appearance.<br/><br/>Furthermore, he easily broke through his strongest attack.<br/><br/>Even the powerful defense that his grandfather had placed in his body was blocked.<br/><br/>This made him feel a little incredulous!<br/><br/>What kind of existence was the other party?<br/><br/>He was actually able to remove the defense that his grandfather had placed in his body.<br/><br/>One had to know that his grandfather was an existence at the level of the Great Dao. Furthermore, he was not an ordinary existence at the level of the Great Dao.<br/><br/>He was an existence that could be compared to two existences at the level of the Great Dao.<br/><br/>“I’m just a passerby. Don’t worry. As long as you cooperate, I Won’t hurt you. On the contrary, I can give you some benefits.”<br/><br/>Wang Xian said faintly to him.<br/><br/>“I’m warning you. Don’t think of using me to do anything bad. Even if I die, I can be resurrected. However, if you want to use me to do something bad, I will never agree to it!”<br/><br/>Wu Tongming said with a determined expression.<br/><br/>“Hehe, you have a good temperament. Don’t worry. However, I don’t want you to die. You Won’t die either. I’ve read your memories and know that you have a good background. However, that’s all.”<br/><br/>“I’ll cooperate well from now on. Don’t Worry!”<br/><br/>Wang Xian smiled as he spoke. His figure slowly turned into Wu Tongming’s face.<br/><br/>With a wave of his arm, he injected the defensive barrier on Wu Tongming’s body directly into his own body.<br/><br/>Then, he took out Wu Tongming’s flower from his body.<br/><br/>“You stay in the space inside my body. I’ll live for you for some time first. You can see some things outside. If you have any needs, let me know. If I have any needs, I’ll ask you.”<br/><br/>“Don’t think of playing tricks. You Won’t be able to play any tricks either.”<br/><br/>Wang Xian said faintly.<br/><br/>He took everything from him.<br/><br/>“What do you want to Do? Why do you want to change into my appearance? What exactly do you want to do?”<br/><br/>Wu Tongming saw that Wang Xian had changed into his appearance. His eyes were slightly red as he questioned loudly.<br/><br/>Wang Xian ignored him. The scene around him changed.<br/><br/>In the next moment, they appeared in the teahouse again.<br/><br/>The difference was that Wang Xian had replaced Wu Tongming and was sitting there.<br/><br/>After quietly absorbing Wu Tongming’s information, he took out his AI and sent a message to his sister.<br/><br/>Wu Tongming’s identity was indeed very strong. His grandfather was an expert close to the level of chaos. He was ranked in the top three in the entire camp of the godly power universe.<br/><br/>The ten days union was divided into three camps: the Spirit Universe Camp, the Mechanical Ascension Universe Camp, and the final three universe camps.<br/><br/>The disciples of the three three universe experts were special creatures.<br/><br/>They had three faces.<br/><br/>They were also a special and powerful universe race.<br/><br/>The three great union camps each had primal chaos level combat strength.<br/><br/>This was also the reason why the three alliances stood at the same position.<br/><br/>As the core disciple of the Tongshen universe, Wu Tongming had a lot of information in his mind.<br/><br/>However, there were still some things that he had yet to touch upon.<br/><br/>The message that Wang Xian sent to his sister was to ask about the information regarding the origin stone.<br/><br/>With Wu Tongming’s sister’s identity, she was 100% aware of it.<br/><br/>“HMM? Xiao Ming, why are you asking this question? The origin stone is a treasure that was born from the origin of the giant beasts. It is more precious. Especially recently, the Giant Beast Alliance and our side have detected something.”<br/><br/>“The place where the Nine Heavens Divine Roc died for an unknown reason back then has the aura of life now. According to my guess, another Nine Heavens Divine Roc was born in the place where the Nine Heavens Divine Roc died.”<br/><br/>“The nine Sky Godly Peng that has yet to be born can be directly parasitized by the beast universe with their abilities and become their companion Battle Beast!”<br/><br/>“At present, our ten days federation has been studying the abilities of the Beast universe all these years. Now that we have made some progress, we might not be able to control primal Chaos Beasts like the beast universe, but this kind of nine Sky Godly Peng that has just been born can also be parasitized and controlled!”<br/><br/>“To control it by parasitism requires origin stones. Therefore, all the powerful forces are now doing their best to search for the origin stones. I reckon that when the time comes, there will be a fierce battle with the Divine Roc of the Nine Heavens.”<br/><br/>Very soon, Wang Xian received a message from Wu Tongming’s sister.<br/><br/>When he saw this message, he revealed an astonished expression.<br/><br/>Divine Roc of the Nine Heavens.<br/><br/>Using origin stones and using a special method to control it?<br/><br/>Wang Xian’s eyes flickered slightly.<br/><br/>An existence on the level of chaos.<br/><br/>This? ? ?<br/><br/>To any powerhouse or force, this was an existence that could not be resisted.<br/><br/>An existence on the level of chaos. Even Wang Xian’s eyes were burning with passion.<br/><br/>“No wonder the machine ascended to the universe. For the sake of an origin stone, it would not hesitate to offend a heaven’s origin creator. I see.”<br/><br/>Wang Xian’s eyes sparkled as he continued to ask his sister, “Then, how can I control the Divine Roc of the Nine Heavens?”<br/><br/>“Why are you asking so many questions? It has nothing to do with you. It is not something that a little fellow like you can participate in. At that time, there will be the biggest war between our ten-day federation and the Giant Beast Alliance in History.”<br/><br/>“With your strength, you are not qualified to participate. Cultivate well and strive to enter the Heaven’s origin creator realm as soon as possible!”<br/><br/>Wu Tongming’s sister replied.<br/><br/>Wang Xian frowned slightly when he saw this reply.<br/><br/>“Oh Right, let me introduce you to a little sister. It’s fine if you haven’t caught up with Qingtian. My Brother is the most handsome man in the entire supernatural realm. Come and meet my little sister one day later!”<br/><br/>Soon, a message was sent back.<br/><br/>Wang Xian frowned slightly when he received this message and replied directly, “I’m not going!”<br/><br/>“I have to go even if I don’t want to. Anyway, I’ll capture you when the time comes.”<br/><br/>Wu Tongming’s sister replied directly.<br/><br/>Wang Xian? ? ?<br/><br/>“What exactly are you trying to do? Why are you looking for my sister?”<br/><br/>In Wang Xian’s body, Wu Tongming, who had witnessed everything, could not help but ask when he saw Wang Xian chatting with his sister.<br/><br/>“Didn’t you see it yourself? Ask some questions.”<br/><br/>Wang Xian said faintly, “Oh right, will your sister really come to capture you?”<br/><br/>“My sister always keeps her word. He will come over. You will be seen through by him!”<br/><br/>“Let me go and let everything go. Otherwise, our supernatural universe will chase you to the end of the world. Even if you are an expert from the Behemoth Alliance, we will kill you!”<br/><br/>Wu Tongming continued to roar.<br/><br/>“Hehe, even if your grandfather came, he wouldn’t be able to see through me. Furthermore, I’m not from the Behemoth Alliance.”<br/><br/>Wang Xian smiled and said.<br/><br/>He took out Wu Tongming’s artificial brain and checked some information.<br/><br/>When Wu Tongming, who was in Wang Xian’s body, heard his words, his expression changed drastically.<br/><br/>He knew that this mysterious person was definitely not simple since he could take out the restriction that his grandfather had placed in his body.<br/><br/>It was at least on the same level as his grandfather.<br/><br/>But this existence had transformed into his own appearance.<br/><br/>What exactly was he trying to do?\t\t\t\t\t\t</div>", "images": {}, "success": true}