{"id": 1492, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075801.html", "title": "Chapter 4495 - Chapter 4495: 4494 Headed To The Source Of The Giant Beasts. The Battle Was About To Begin!", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4495 - Chapter 4495: 4494 Headed To The Source Of The Giant Beasts. The Battle Was About To Begin!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4495: 4494 headed to the source of the giant beasts. The battle was about to begin!<br/><br/>“There are quite a number of powerhouses from the 10-day federation!”<br/><br/>Wang Xian sat in the conference hall of the 10-day federation. He looked at the meeting and spoke to Wu Tongming who was in his body.<br/><br/>The meeting had already begun.<br/><br/>Three existences of the primal chaos level had arrived.<br/><br/>In addition, there were more than 30 powerhouses of the Great Dao level!<br/><br/>This was a huge number.<br/><br/>At the very least, this number wasn’t something the Dragon Palace Alliance could compare to!<br/><br/>Overall, the Mechanical Ascension universe was stronger.<br/><br/>“Senior, our ten days alliance isn’t weak, but it’s still weaker than the Behemoth Alliance. The Behemoth Alliance has more than forty Great Dao level experts.”<br/><br/>“Furthermore, the Behemoth Alliance has informed the universe that is close to them about their method of controlling the chaos Behemoth. The entire Behemoth Alliance is more United Than Us!”<br/><br/>Wu Tongming said to Wang Xian!<br/><br/>Wang Xian nodded his head slightly.<br/><br/>According to his estimation, the Behemoth Alliance’s strength was definitely not weaker than the evil sequence faction.<br/><br/>It was even possible that they were stronger than the evil sequence faction.<br/><br/>“By the way, senior, how strong are you?”<br/><br/>Wu Tongming could not help but ask curiously.<br/><br/>“The Alliance that I have established is much weaker than all of you!”<br/><br/>Wang Xian did not hide anything and spoke directly.<br/><br/>“Senior, your strength alone is already very terrifying!”<br/><br/>Wu Tongming said sincerely.<br/><br/>During this period of contact with Wang Xian, he felt that he was unfathomable.<br/><br/>Just like now, the three chaos-level powerhouses were all here and didn’t realize that he was a fake.<br/><br/>“Hehe!”<br/><br/>Wang Xian smiled and didn’t say anything.<br/><br/>He looked at the three chaos-level powerhouses in the center.<br/><br/>The strongest one among them was merely a primal chaos level powerhouse with the power of two control level powerhouses.<br/><br/>This powerhouse was from the god-like universe.<br/><br/>However, the primal chaos level powerhouse who ascended to the universe through machinery had already transformed himself into a machine. Furthermore, he had two ultimate treasures of the Heaven’s origin creation in his body. Wang Xian could not be sure if he could use technological means.., he could also unleash an even stronger power.<br/><br/>The meeting did not have much to do with powerhouses who had just entered the Heaven’s origin creation.<br/><br/>It was mainly the powerhouses at the Great Dao level who were discussing and discussing.<br/><br/>They were discussing how to deal with the powerhouses from the Behemoth Alliance.<br/><br/>If they could get their hands on the Divine Roc of the Nine Heavens.<br/><br/>“In short, no matter what, we can’t let the Behemoth Alliance get their hands on the Divine Roc of the Nine Heavens. This concerns the safety of our ten-day federation. When the time comes, we, the powerhouses, will try our best to pin down all the powerhouses from the Behemoth Alliance.”<br/><br/>“The powerhouses who have just entered the Heavenly Yuan Destiny Realm, as well as your avatars, try your best to get the Divine Roc of the Nine Heavens.”<br/><br/>At this moment, the primal chaos-level existence from the three three universes, who was in the center, suddenly spoke.<br/><br/>When Wang Xian heard this, he raised his eyebrows slightly.<br/><br/>It seemed that he had a great chance this time!<br/><br/>He thought to himself.<br/><br/>The experts of the ten days federation wanted to pin down the experts of the Behemoth Alliance.<br/><br/>Only then would they have a chance to obtain the Nine Heavens Divine Roc.<br/><br/>Under such circumstances, it also gave some chances to the experts who had just entered the Heavenly Yuan creation realm.<br/><br/>If they were lucky, the experts who had just entered the heavenly yuan creation realm might really be able to obtain the Nine Heavens Divine Roc!<br/><br/>Of course, this possibility wasn’t very big.<br/><br/>This was because those powerhouses at the Great Dao level and those at the primal chaos level could make some clones to fight for the Divine Roc of the Nine Heavens!<br/><br/>However, Wang Xian, who was hiding in the dark, was undoubtedly the biggest boss!<br/><br/>“After a thousand years, head to the place of origin of the giant beasts and make arrangements.”<br/><br/>At the last moment, the primal chaos-level existence who had ascended mechanically to the universe said a time.<br/><br/>The other two chaos-level experts nodded their heads.<br/><br/>Following that, the three chaos-level existences disappeared!<br/><br/>“Godly power universe, return to our Universe’s Parliament Hall!”<br/><br/>At this moment, a voice rang out in Wang Xian’s mind.<br/><br/>“Let’s go back to our universe!”<br/><br/>Wu Tongying, who was at the side, said to Wang Xian.<br/><br/>Wang Xian nodded his head and followed them to the godly power universe once again.<br/><br/>After listening to a group of Great Dao experts exhorting him about many things, Wang Xian returned his body to Wu Tongming.<br/><br/>Wu Tongming was taken away by his parents and instructed about the Divine Roc of the Nine Heavens.<br/><br/>A Thousand Years’time would soon arrive for experts like them.<br/><br/>“Let’s Go!”<br/><br/>On this day, ten days hurriedly allied with all the experts and flew towards the source of the giant beast.<br/><br/>Through the black hole teleportation formation, they quickly arrived in a universe!<br/><br/>Following that, more than 400 powerhouses of the Heaven’s origin realm from the Federation flew into the chaos.<br/><br/>Wang Xian was still scanning his surroundings with Wu Tongming’s body.<br/><br/>The amount of strength that came from the mechanical ascension to the universe was the most.<br/><br/>That was because the densely packed mecha battleships were not only at the Heaven’s origin realm but also at the ruler’s realm.<br/><br/>The technological civilization had an advantage that other systems did not have.<br/><br/>Especially when it came to scouting and the situation.<br/><br/>The powerhouses who had flown into the universe could control tens of millions of battleships and mechs by themselves.<br/><br/>They kept flying towards the source of the giant beast, and the large number of scouting devices around them were on alert.<br/><br/>After flying for more than a thousand years, they arrived in front of the source of the giant beast.<br/><br/>A place similar to the place of origin appeared before everyone’s eyes.<br/><br/>“Xiao Ming, do you see that? That fireball that looks like the scarlet sun is the place where the Divine Roc of the Nine Heavens was born.”<br/><br/>Wu Tongying pointed at the eye-catching flaming chaos meteorite above the origin of the giant beast and said.<br/><br/>“Huh?”<br/><br/>Wang Xian looked at the flaming meteorite with a surprised expression.<br/><br/>He knew about this flaming meteorite.<br/><br/>When he was teleported here, he noticed this meteorite.<br/><br/>He thought it was the transformation of an extremely powerful elemental god.<br/><br/>He didn’t expect it to be the transformation of the Divine Roc of the Nine Heavens.<br/><br/>Furthermore, Wang Xian sensed the aura of a giant beast of chaos living within this flaming meteorite.<br/><br/>What was the reason?<br/><br/>Was it the Divine Roc of the Nine Heavens that he sensed?<br/><br/>It shouldn’t be.<br/><br/>Wang Xian was a little puzzled!<br/><br/>“HMM?”<br/><br/>At this moment, Wang Xian felt a jolt in his heart. He could sense an immense power from the source of the giant beasts.<br/><br/>This power was no weaker than the gathering of the experts of the federation in the past ten days.<br/><br/>It was even stronger.<br/><br/>Wang Xian focused his gaze.<br/><br/>The powerhouses of the Behemoth Alliance had arrived. They were at the source of the Behemoth!<br/><br/>Wang Xian looked in that direction.<br/><br/>“The powerhouses of the Behemoth Alliance have arrived. The Divine Roc of the Nine Heavens will be born in 10,000 years. All the powerhouses, prepare for battle and prepare to make sacrifices!”<br/><br/>At this moment, the chaos-level powerhouse who was flying mechanically in front of them reminded them.<br/><br/>“Yes!”<br/><br/>The experts of the ten-day federation alliance immediately replied.\t\t\t\t\t\t</div>", "images": {}, "success": true}