{"id": 1494, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075811.html", "title": "Chapter 4497 - Chapter 4497: 4496 Was Born", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4497 - Chapter 4497: 4496 Was Born</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4497: 4496 was born<br/><br/>Time passed by little by little.<br/><br/>The entire flaming meteorite shrank smaller and smaller.<br/><br/>The thumping sound that sounded like the beating of a heart became stronger and stronger.<br/><br/>The Divine Roc of the Nine Heavens was being reborn.<br/><br/>It was being born!<br/><br/>Gradually, when the flaming meteorite was about 10,000 meters away, Wang Xian sensed that the experts around him were starting to get restless!<br/><br/>The seven experts at the primal chaos level were accumulating their own powerful energy and could erupt at any time!<br/><br/>Boom<br/><br/>However, not long after, a burst of flames suddenly burst out from the flaming meteorite that was about 10,000 meters in size.<br/><br/>The flames spread to the surroundings and formed a terrifying sea of flames!<br/><br/>The area of the Sea of flames was extremely huge!<br/><br/>“Chirp!”<br/><br/>Soon after, a weak cry sounded from within!<br/><br/>“Boom Boom Boom!”<br/><br/>“Boom Boom Boom!”<br/><br/>When this cry sounded out, it was like a signal for a great battle!<br/><br/>All the experts instantly moved.<br/><br/>Especially the primal chaos experts of the Giant Beast Alliance and the Ten Suns Alliance, they instantly charged forward.<br/><br/>However, they didn’t charge towards the Nine Heavens Divine Roc, but towards each other!<br/><br/>The three primal chaos realm experts of the ten days federation instantly arrived in front of the four primal chaos realm experts of the Behemoth Alliance.<br/><br/>Their terrifying energy directly covered the area.<br/><br/>They took the initiative to attack, wanting to use the strength of three people to temporarily block the strength of the other four.<br/><br/>Only under such circumstances could they obtain the Nine Heavens Divine Roc.<br/><br/>Otherwise, with their strength, it would be very difficult to obtain it!<br/><br/>“HMPH, three people trying to stop the four of us? Wishful Thinking!”<br/><br/>“Roar Roar Roar!”<br/><br/>The Primal Chaos Experts of the Beast Alliance harrumphed coldly.<br/><br/>They immediately activated their terrifying energy and swept towards the three primal chaos experts of the Ten Sun Alliance.<br/><br/>“Hmph, I can still hold you back for more than ten minutes. Don’t hold back and unleash all of your power!”<br/><br/>The primal chaos experts of the Spirit Universe roared loudly!<br/><br/>“Dong Dong Dong!”<br/><br/>“Dong Dong Dong!”<br/><br/>Endless energy erupted from their bodies and met the four primal Chaos Beasts of the Giant Beast Alliance!<br/><br/>“Today, I will let your giant Beast Alliance witness the power of this mechanical God!”<br/><br/>The chaos-level powerhouse from the Mechanical Ascension Universe let out a low roar.<br/><br/>A terrifying black hole appeared in his palm. The endless energy in the black hole covered the area in front of him.<br/><br/>It was abnormally terrifying!<br/><br/>“HMM? This chaos-level existence from the mechanical ascension universe is indeed not simple. When he explodes, he is even stronger than those from the supernatural universe!”<br/><br/>Wang Xian looked over and his eyes revealed a look of astonishment.<br/><br/>With the power of technology, it was already very terrifying to be able to reach this stage!<br/><br/>“Kill!”<br/><br/>“Kill!”<br/><br/>“Charge, charge towards the Divine Roc of the Nine Heavens!”<br/><br/>At the back, all the great dao-level, control-level, and beginner-level powerhouses started to move.<br/><br/>They flew towards the Divine Roc of the nine heavens in a frenzy.<br/><br/>Chaotic-level existences had a battlefield. They could charge over with peace of mind!<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>However, when both parties were close to the area covered by the firepower, a terrifying energy directly covered them!<br/><br/>“Xiao Ming, follow me. Don’t die. Dying once will consume a powerful resurrection treasure.”<br/><br/>Wu Tongying and Wang Xian rushed forward together and said to him!<br/><br/>“Don’t worry, my strength is much stronger than yours!”<br/><br/>Wang Xian glanced at him and said indifferently.<br/><br/>Be It Wang Xian’s strength or Wu Tongming’s current strength, both of them were much stronger than Wu Tongying.<br/><br/>Even Wu Tongming’s parents were not as strong as Wu Tongming.<br/><br/>After all, he had an ultimate treasure of the Heaven’s origin!<br/><br/>“HMPH, you’ve just broken through. You’re getting a little cocky!”<br/><br/>“Charge! Dad, Mom, Grandpa, and the rest can’t take care of us. We have to rely on ourselves!”<br/><br/>Wu Tongying snorted coldly. He gathered his energy and charged towards the attack of the Behemoth Alliance!<br/><br/>Wang Xian didn’t take action immediately this time.<br/><br/>Although with his current strength, he only needed two teleportations to arrive in front of the Divine Roc of the Nine Heavens.<br/><br/>However, Wang Xian had a feeling that it wasn’t as easy as he imagined to control this divine Roc of the Nine Heavens!<br/><br/>Of course, Wang Xian could also sense the weakness of the Divine Roc of the Nine Heavens.<br/><br/>Perhaps, there was a slight possibility.<br/><br/>After all, if there was no possibility, the Behemoth Alliance and the Ten Suns Federation would mobilize so much power for this!<br/><br/>“Boom Boom Boom!”<br/><br/>“Boom Boom Boom!”<br/><br/>The collision began.<br/><br/>“Gather energy and suppress the other side!”<br/><br/>“Fire cannons, cover!”<br/><br/>From the front, the roars of the Great Dao experts could be heard.<br/><br/>If the ten-day federation wanted to snatch the Divine Roc of the Nine Heavens, they had to first fend off the attacks of the Behemoth Alliance.<br/><br/>This way, they would have a chance to take advantage of the chaos.<br/><br/>Otherwise, they would not be able to compete with the Behemoth Alliance.<br/><br/>They could only take the lead and use all their strength.<br/><br/>Wang Xian controlled the energy in Wu Tongming’s body. He did not use the ultimate treasure of Heaven’s origin as he charged forward with all his strength.<br/><br/>At the side, Wu Tongying widened his eyes and looked at him in disbelief.<br/><br/>“How is this possible? Xiao Ming, you have stepped into another minor realm during this period of time? How is this possible?”<br/><br/>Wu Tongying felt Wang Xian’s strength and could not believe it!<br/><br/>It had been hundreds of millions of years since he broke through to the Heaven’s origin blessed realm, and he was still at the weakest level!<br/><br/>However, his younger brother was now stronger than him?<br/><br/>“Follow me. I will protect you. I have already said that I am much stronger than you!”<br/><br/>Wang Xian said to her faintly.<br/><br/>This made Wu Tongying Gape and was filled with questions.<br/><br/>However, this was not the time to get to the bottom of it!<br/><br/>Wang Xian sensed the entire battlefield.<br/><br/>At the chaos level, the three chaos level existences of the ten-day federation unleashed all their strength in an instant, restraining the four chaos level existences with great difficulty.<br/><br/>The position here was under the joint efforts of the experts of the ten-day federation.<br/><br/>In addition to the numerous battleships and mechs surrounding them, they were barely able to fend off the experts of the Behemoth Alliance.<br/><br/>However, Wang Xian knew that this was only temporary and would not last for long.<br/><br/>The strength of the Behemoth Alliance was much stronger than the ten-day federation!<br/><br/>Buzz! Buzz<br/><br/>At this moment, Wang Xian saw the clones of the powerhouses in front of him rushing toward the nine-heavens Divine Roc.<br/><br/>Clearly, the powerhouses of the ten-day federation had their own plans.<br/><br/>As for this plan, as a beginner-level powerhouse in the Heaven’s origin realm, he wasn’t qualified to know about it.<br/><br/>Wu Tongming’s parents didn’t inform him either.<br/><br/>In their opinion, a beginner-level powerhouse wouldn’t be of much use in this huge battle.<br/><br/>Wang Xian looked over and saw that he was still unmoving.<br/><br/>He was still following the powerhouses of the ten-day federation and fighting against the powerhouses of the Behemoth Alliance.<br/><br/>He knew that this kind of confrontation would not last long.<br/><br/>A chaotic battle, a chaotic battle, was about to begin!\t\t\t\t\t\t</div>", "images": {}, "success": true}