{"id": 1498, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075831.html", "title": "Chapter 4501 - Chapter 4501: 4,500 Intelligent Divine Rocs Of The Nine Heavens!", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4501 - Chapter 4501: 4,500 Intelligent Divine Rocs Of The Nine Heavens!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4501: 4,500 intelligent divine Rocs of the nine heavens!<br/><br/>“Let’s Go!”<br/><br/>Wang Xian controlled Wu Tongming’s body and quickly approached the Divine Rocs of the nine heavens.<br/><br/>The closer he got, the more intense the battle became!<br/><br/>A terrifying energy covered the surroundings.<br/><br/>Once an expert got close to the position of the Divine Rocs of the nine heavens, he would definitely suffer the most powerful attack from the other party!<br/><br/>At present, both parties had already started to fight.<br/><br/>At least 50 to 60 experts from both parties had already perished.<br/><br/>Among them, more experts from the 10-day federation had perished.<br/><br/>There was still a gap between the strength of both parties!<br/><br/>“Senior, I can’t get close anymore. Once I Get Close, my body will be torn apart!”<br/><br/>Wu Tongming looked at the energy in front of him and said to Wang Xian!<br/><br/>“Don’t worry, I Won’t Die!”<br/><br/>Wang Xian stared at the position of the Divine Roc of the Nine Heavens. He controlled the energy in his body to look for any flaws in the surrounding energy.<br/><br/>Boom<br/><br/>Wang Xian moved his body and dashed forward!<br/><br/>In the next moment, Wang Xian sensed several attacks that could kill Wu Tongming were coming at him!<br/><br/>Wang Xian focused his gaze and summoned the ultimate treasure of the Heaven’s origin.<br/><br/>Following that, the ultimate treasure of the Heaven’s origin emitted a powerful luster.<br/><br/>In the next moment, Wang Xian used his own energy and brought Wu Tongming’s body to the front of the Divine Roc of the Nine Heavens.<br/><br/>“There are experts from the ten-day federation approaching the Divine Roc of the Nine Heavens. Kill him!”<br/><br/>On the opposite side, they could only see a special energy wrapping Wu Tongming’s body. Following that, they arrived at the Divine Roc of the Nine Heavens.<br/><br/>This caused their gazes to freeze, and a powerful energy crushed towards Wu Tongming.<br/><br/>Wu Tongming sensed it, and his face instantly turned incomparably pale!<br/><br/>However, at this moment, he sensed a terrifying tearing force behind him, and his figure instantly returned to his previous position.<br/><br/>And he also possessed the control of this body.<br/><br/>“Senior left my body?”<br/><br/>Wu Tongming thought to himself.<br/><br/>“Dad, Mom, I failed!”<br/><br/>Wu Tongming shouted loudly. He was afraid that he would be locked onto by the opponent and would join the battle between the control-level powerhouses again.<br/><br/>At the same time, Wang Xian had already attached himself to the surface of the Divine Roc of the Nine Heavens.<br/><br/>He simulated his energy into the energy of the Divine Roc of the Nine Heavens. Following that, he went straight into it.<br/><br/>The sturdy outer shell of the Divine Roc of the nine heavens made Wang Xian look surprised.<br/><br/>One had to know that he had used almost all his strength.<br/><br/>However, he could still sense that the outer shell of the Divine Roc of the nine heavens was very sturdy!<br/><br/>He used the power of chaos to simulate the aura and energy of the Divine Roc of the Nine Heavens.<br/><br/>“Dong Dong!”<br/><br/>“Dong Dong!”<br/><br/>The next moment, the entire egg of the Divine Roc of the Nine Heavens suddenly let out a violent roar.<br/><br/>It was as though the Nine Heavens Divine Roc was about to break out of its shell in the next moment!<br/><br/>The sudden change in the Nine Heavens Divine Roc caused the surrounding battlefield to pause slightly. All the experts hurriedly looked in this direction!<br/><br/>Buzz<br/><br/>At this moment, Wang Xian also realized that he had successfully entered the interior of the Nine Heavens Divine Roc Egg!<br/><br/>The moment he entered, an extremely powerful fire force was transmitted over.<br/><br/>Looking over, there was a divine bird that was a few hundred meters in size in the center. It was constantly absorbing the energy in the surroundings. It was visible to the naked eye and was growing bit by bit.<br/><br/>When Wang Xian saw this scene, his eyes revealed a burning look.<br/><br/>He immediately flew towards the Nine Heavens Divine Roc.<br/><br/>Just as he flew over, the closed eyes of the Nine Heavens Divine Roc suddenly opened!<br/><br/>“Eh?”<br/><br/>It stared at Wang Xian in shock. “How did you get into My Place?”<br/><br/>“Eh?”<br/><br/>Seeing the language fluctuation emitted by the Divine Roc of the Nine Heavens, Wang Xian was also astonished.<br/><br/>“Aren’t you a giant beast of chaos with your own intelligence?”<br/><br/>Wang Xian looked at it in astonishment and asked.<br/><br/>He could now sense the powerful force emitted from the body of the Divine Roc of the Nine Heavens.<br/><br/>However, the current strength of the Divine Roc of the Nine Heavens was only at the control level!<br/><br/>He could easily suppress it!<br/><br/>However, what surprised him was that the Divine Roc of the Nine Heavens possessed its own intelligence.<br/><br/>“I am a giant beast of chaos, but the giant beast of chaos can also give birth to its own intelligence!”<br/><br/>The Divine Roc of the nine heavens stared at Wang Xian. His eyes were filled with vigilance as he continued, “My external defense is able to withstand the presence of a being at the level of chaos. How did you get in without breaking through my defense?”<br/><br/>“You are the Divine Roc of the Nine Heavens? Why are you in such a State?”<br/><br/>Wang Xian didn’t answer his question and asked instead!<br/><br/>“I wanted to complete my breakthrough and use another method to achieve nirvana. However, I failed. You haven’t answered my question yet.”<br/><br/>The Divine Roc of the Nine Heavens spoke!<br/><br/>“Because I’m stronger than you!”<br/><br/>Wang Xian looked at him and spoke!<br/><br/>“Your strength is comparable to the strength of more than two experts of the primal chaos level. Your strength is indeed strong, but you are still a little lacking when I was at my peak!”<br/><br/>The Divine Roc of the nine heavens stared at Wang Xian and spoke coldly!<br/><br/>“Hehe, does that mean that when you were at your peak, you were close to the strength of three experts of the primal chaos level? Do you want to break through above the primal chaos level?”<br/><br/>Wang Xian smiled and asked him.<br/><br/>“That’s right. However, I didn’t expect that there would be a bunch of reckless people disturbing me when I was undergoing Nirvana!”<br/><br/>The Divine Roc of the Nine Heavens said coldly!<br/><br/>“Hehe, Divine Roc of the Nine Heavens, don’t be so arrogant. Your current strength is very weak. Even if you had absorbed all the energy in the surroundings, you wouldn’t be able to reach the chaos-level. It wouldn’t be a big problem for a chaos-level person to kill you!”<br/><br/>Wang Xian looked at his domineering manner and reminded him lightly!<br/><br/>“What are you doing here? I have many backup plans before my nirvana. Do you think that I’m weak and can be killed easily?”<br/><br/>The Divine Roc of the Nine Heavens said coldly.<br/><br/>“I’m here to see if I can control you.”<br/><br/>Wang Xian looked at him and spoke truthfully!<br/><br/>“With just you?”<br/><br/>The Divine Roc of the Nine Heavens’expression turned cold as he stared at Wang Xian.<br/><br/>Buzz<br/><br/>Wang Xian’s body trembled as he simulated the same energy as the Divine Roc of the Nine Heavens.<br/><br/>The surrounding energy that was surging into his body immediately stopped.<br/><br/>“Yes, with just me!”<br/><br/>Wang Xian nodded his head faintly.<br/><br/>“How is this possible? Why do you have the same energy as me in your body?”<br/><br/>The Divine Roc of the nine heavens stared at Wang Xian in disbelief and questioned him!<br/><br/>“Hehe, there are still many things that you don’t know!”<br/><br/>Wang Xian smiled faintly. With a wave of his arm, waves of energy surged towards the Divine Roc of the Nine Heavens!<br/><br/>“What are you going to do?”<br/><br/>Faced with Wang Xian’s terrifying strength, the Divine Roc of the Nine Heavens’expression changed drastically. It was a little frightened and fearful!<br/><br/>“Submit to me or Die!”<br/><br/>Wang Xian stared at him and said!<br/><br/>The Divine Roc of the Nine Heavens possessed intelligence. This was something that Wang Xian didn’t expect.<br/><br/>The Behemoth Alliance and the Ten Days Federation didn’t expect it to possess intelligence either.<br/><br/>If they knew, they wouldn’t have used the stone of origin to induce and control it!<br/><br/>This method was completely unworkable now!<br/><br/>Therefore, if they wanted to subdue it, they needed to suppress it with a powerful force!<br/><br/>If it was like what the Nine Heavens Divine Roc said, he was once a peak primal chaos realm existence, then subjugating him would increase the strength of the Dragon Palace greatly!\t\t\t\t\t\t</div>", "images": {}, "success": true}