{"id": 1496, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075821.html", "title": "Chapter 4499 - Chapter 4499: 4498 Took Advantage Of The Situation", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4499 - Chapter 4499: 4498 Took Advantage Of The Situation</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4499: 4498 took advantage of the situation<br/><br/>“I’ve got it!”<br/><br/>Wang Xian possessed a mech and kept the two origin stones into his body.<br/><br/>This made him look pleasantly surprised.<br/><br/>He scanned his surroundings. Wang Xian followed the surrounding of the mech battleships and launched an attack forward.<br/><br/>A strong man who had ascended into the Heaven’s origin realm controlled a large number of mech weapons.<br/><br/>Wang Xian blended in and thought that these were the mecha of his own people!<br/><br/>Therefore, no one doubted Wang Xian.<br/><br/>The battle continued.<br/><br/>As the experts from the Behemoth Alliance and the Ten Days Federation approached,.<br/><br/>More and more experts began to fall!<br/><br/>Wang Xian sensed carefully.<br/><br/>With his powerful strength, he could sense which of the fallen experts had the origin stones in their bodies.<br/><br/>If Wang Xian didn’t want to get his hands on the Divine Roc of the Nine Heavens.<br/><br/>He could get his hands on dozens of origin stones in an instant and leave this place.<br/><br/>However, the allure of the Divine Roc of the Nine Heavens still made Wang Xian give up.<br/><br/>He wasn’t in a hurry. He had to take it slow!<br/><br/>“Kill, Kill, Kill!”<br/><br/>“Target this bunch of trash from the Ten Days Alliance one-on-one. Kill them!”<br/><br/>At this moment, some powerhouses from the Behemoth Alliance issued an order.<br/><br/>They began to lock onto the experts of the ten-day alliance one-on-one.<br/><br/>The Giant Beast Alliance had more experts than the ten-day alliance to begin with.<br/><br/>As long as they could lock onto the ten-day alliance one-on-one, they would have the advantage.<br/><br/>They would be able to obtain the Nine Heavens Divine Roc!<br/><br/>“Boom!”<br/><br/>“Boom!”<br/><br/>Numerous great dao experts began to lock onto the Great Dao experts of the ten-day alliance.<br/><br/>This caused the expressions of the experts of the Ten Suns Federation to change slightly!<br/><br/>“Form a battle formation. We can’t let the other side pin them down one by one!”<br/><br/>A Great Dao realm expert who had ascended mechanically transformed into a 10,000 meter long robot. His entire body was filled with extremely terrifying weapons.<br/><br/>His body also had the aura of a heavenly fate treasure.<br/><br/>His eyes flashed with all sorts of data as he roared loudly!<br/><br/>“Ka Ka Ka!”<br/><br/>“Ka Ka Ka!”<br/><br/>Just as he started to speak, a dense cluster of miniature robots appeared around the Nine Heavens Divine Roc Egg!<br/><br/>These nanobots drilled into the Nine Heavens Divine Roc Egg!<br/><br/>“Roar Roar Roar!”<br/><br/>“Ocean, Cleanse!”<br/><br/>Over at the Behemoth Alliance, there were experts who had been paying attention to the Nine Heavens Divine Roc egg. When they saw this scene, their huge mouths spat out special seawater.<br/><br/>This seawater was burning with blue flames as it charged towards the Nine Heavens Godly Roc.<br/><br/>The nanobots were instantly destroyed!<br/><br/>“Kill!”<br/><br/>As the intense battle continued, the distance between the two sides grew closer and closer!<br/><br/>One by one, the experts of the Giant Beast Alliance began to lock onto the experts of the ten-day federation!<br/><br/>This was especially so for the experts of the Great Dao level ahead. All of them were locked onto.<br/><br/>Locked tightly, the control-level powerhouses were also entangled by the powerhouses of the Behemoth Alliance in a one-on-one Fight!<br/><br/>In the end, even the beginner-level powerhouses were entangled in a one-on-one fight!<br/><br/>The battlefield began to divide bit by bit.<br/><br/>The dao-level powerhouses were in one place while the control-level powerhouses were in one place.<br/><br/>The beginner-level powerhouses were in one place!<br/><br/>Wang Xian possessed the body of the mech and followed the surrounding mechs, releasing laser attacks continuously!<br/><br/>At this moment, Wang Xian saw that a ten-day federation and a control level expert had been killed in front of him!<br/><br/>There were two origin stones on his body!<br/><br/>This caused Wang Xian’s eyes to glow instantly!<br/><br/>His body moved and flew out from the body of the mech, entering Wu Tongming’s body once again.<br/><br/>“Wu Tongming, let me borrow your body for a while.”<br/><br/>Wang Xian spoke to him!<br/><br/>“Senior, I was planning to kill everyone!”<br/><br/>Wu Tongming said helplessly when he saw Wang Xian returning!<br/><br/>“I’ll help you. It’s the same!”<br/><br/>Wang Xian stared at the spot in front of him.<br/><br/>Two powerhouses from the Behemoth Alliance were locked onto Wu Tongming and Wu Tongying.<br/><br/>The two of them were attacking continuously!<br/><br/>“That’s good too. Senior, kill them and let my sister see my strength. hahaha!”<br/><br/>Wu Tongming’s eyes glowed as he shouted at Wang Xian!<br/><br/>“No problem. I will unleash all the power in your body and the ultimate treasure of the Heaven’s origin!”<br/><br/>Wang Xian replied to him immediately!<br/><br/>“Senior, wait for me to speak. You just need to control my body. Don’t control your mouth!”<br/><br/>Wu Tongming spoke!<br/><br/>Wang Xian was slightly speechless. He didn’t have any objections!<br/><br/>“Hahaha, good, good, good. Behemoth Alliance, you bunch of animals. Today, I will kill you all!”<br/><br/>“Sister, today, I will show you how powerful your brother is. Tremble!”<br/><br/>Wu Tongming was extremely excited. Suddenly, he shouted at Wu Tongying who was beside him!<br/><br/>“Huh?”<br/><br/>Wu Tongying looked over speechlessly and said sternly, “Cut the crap. This is a life and death battle!”<br/><br/>“Hahaha, let me show you my true strength!”<br/><br/>Wu Tongming laughed out loud.<br/><br/>At this moment, Wang Xian made his move. He controlled all the energy in Wu Tongming’s body!<br/><br/>The Ultimate Treasure of Heaven’s origin was floating above his head!<br/><br/>Boom<br/><br/>In an instant, Wu Tongming’s speed increased by five to six times. He directly attacked the powerhouse from the Behemoth Alliance!<br/><br/>Wang Xian could sense that there was a origin stone in this powerhouse’s body.<br/><br/>Kill him!<br/><br/>“Huh? What?”<br/><br/>The expression of the powerhouse who had just entered the Heaven’s origin realm changed drastically when he saw Wu Tongming’s sudden outburst of such powerful strength.<br/><br/>“Oh no, this despicable fellow is hiding his strength!”<br/><br/>He roared loudly and wanted to dodge.<br/><br/>However, Wang Xian was controlling the ultimate treasure of the Heaven’s origin realm. A surge of energy entered his body directly!<br/><br/>“Roar!”<br/><br/>The unique and strange energy that belonged to the ultimate treasure of the Heaven’s origin realm entered his body directly and destroyed his vitality.<br/><br/>Wang Xian controlled Wu Tongming’s body and entered his body directly.<br/><br/>Then, he kept the origin stone into his bag.<br/><br/>“What?”<br/><br/>“How is this possible?”<br/><br/>At the back, Wu Tongying looked at his younger brother who had suddenly erupted. His younger brother had suddenly displayed a terrifying strength, and a look of disbelief appeared on his face!<br/><br/>How was this possible?<br/><br/>To instantly kill an opponent whose strength was on par with his?<br/><br/>This? ? ?<br/><br/>And this was her younger brother?<br/><br/>One had to know that her younger brother had only broken through to the Heavenly Yuan blessed realm a few million years ago.<br/><br/>Also, what was that extremely powerful aura on his body?<br/><br/>“Hahaha, sister, aren’t you very shocked, right?”<br/><br/>“I’ll see if you dare to bully me in the future, Hahaha!”<br/><br/>Wu Tongming laughed maniacally. At this moment, he was incomparably excited!<br/><br/>He could sense the shocked and incredulous gazes of the surrounding experts of the ten days federation!<br/><br/>These gazes made him feel extremely good!<br/><br/>He had hidden his strength for so long. It was so great to unleash it now!<br/><br/>Boom<br/><br/>Wang Xian didn’t mind the excited Wu Tongming. He controlled his body and flew towards the battlefield where the control level was.<br/><br/>There was a stone of origin there!\t\t\t\t\t\t</div>", "images": {}, "success": true}