{"id": 1495, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075816.html", "title": "Chapter 4498 - Chapter 4498: 4497 Was Fishing In Troubled Waters", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4498 - Chapter 4498: 4497 Was Fishing In Troubled Waters</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4498: 4497 was fishing in troubled waters<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>The terrifying confrontation shook the entire chaotic domain!<br/><br/>The extremely powerful energy whirlpool.<br/><br/>The vast energy of various attributes.<br/><br/>If it was a heaven’s origin creator, he would be annihilated instantly if he was in the middle of this energy.<br/><br/>Regardless of whether it was the battlefield where the chaos-level powerhouse was, or the battlefield over here, they were all extremely terrifying!<br/><br/>With such energy, even if Wang Xian were to enter, he would be dealt a fatal blow!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>However, after a few dozen seconds of confrontation, dozens of clones rushed towards the direction of the Nine Heavens Divine Roc.<br/><br/>Over at the Behemoth Alliance and the ten-day federation, there were powerhouses who couldn’t hold it in and rushed over quickly.<br/><br/>Boom! Boom! Boom! Boom<br/><br/>“Hong Hong Hong!”<br/><br/>At this moment, a few great beings from the three three universes split into two and flew towards the Nine Heavens Godly Peng.<br/><br/>“Charge into the Nine Heavens Godly Peng, Kill!”<br/><br/>Over at the Giant Beast Alliance, the extremely powerful giant beasts saw the great beings from the ten days federation splitting into multiple bodies, and their eyes revealed a look of fury.<br/><br/>The Great Beings of the Beast universe were living in the bodies of the beasts.<br/><br/>They couldn’t split up their bodies and enter nine Sky Godly Peng.<br/><br/>Therefore, the Great Beings of the Beast Alliance changed their target and rushed toward nine Sky Godly Peng!<br/><br/>In an instant, the situation of the collision changed.<br/><br/>“Stop them!”<br/><br/>The Great Beings of the ten days alliance changed their expressions and shouted loudly!<br/><br/>“Dong Dong Dong!”<br/><br/>“Dong Dong Dong!”<br/><br/>At this moment, countless battleships behind them launched terrifying attacks, blocking the experts of the Giant Beast Alliance.<br/><br/>However, the Giant Beast Alliance was slightly stronger than them.<br/><br/>A portion of the experts blocked the attacks of the ten-day alliance, while a portion of the experts continued flying towards the Nine Heavens Divine Roc.<br/><br/>Not only did the experts of the ten day alliance dare to fight, but so did they!<br/><br/>“The other side has many more experts than us. We’ll charge over as well. We can’t let them get their hands on it!”<br/><br/>At the front, a group of Great Dao experts from the Ten Day Alliance roared loudly!<br/><br/>The Nine Heavens Divine Roc definitely couldn’t let the Giant Beast Alliance get their hands on it.<br/><br/>Otherwise, the ten-day federation would be in great danger.<br/><br/>Even if they were to destroy it, they could not let the other party obtain it.<br/><br/>At this moment, all the powerhouses of the ten-day federation rushed towards the Divine Roc of the Nine Heavens.<br/><br/>They gave up on stopping the powerhouses of the Behemoth Alliance.<br/><br/>“Let’s go, we’ll go too!”<br/><br/>Wu Tongying shouted loudly at Wang Xian. They also flew towards the Divine Roc of the Nine Heavens.<br/><br/>In an instant, they entered the range of the Nine Heavens Divine Roc’s flame domain.<br/><br/>At this moment, all the experts flew towards the Nine Heavens Divine Roc Egg in the center!<br/><br/>Wang Xian looked over and realized that there were already experts who wanted to obtain the egg in front of the Nine Heavens Divine Roc egg.<br/><br/>However, the Nine Heavens Divine Roc Egg didn’t Budge at all!<br/><br/>Wang Xian relied on the information that he got from Wu Tongming’s grandfather and father.<br/><br/>To control the Nine Heavens Divine Roc, he needed to feed it with the stone of origin and communicate with it telepathically!<br/><br/>In the end, he entered the head of the Nine Heavens Divine Roc without being on guard.<br/><br/>He used his consciousness to guide the consciousness of the Nine Heavens Divine Roc.<br/><br/>This process required some time!<br/><br/>The experts who had arrived at the Nine Heavens Divine Roc’s place in advance wanted to directly take the Nine Heavens Divine Roc into their spatial storage, but in the end, they failed!<br/><br/>At this time, the experts of the Giant Beast Alliance and the Ten Sun Federation alliance simultaneously attacked the avatars that had arrived earlier!<br/><br/>“Peng Peng!”<br/><br/>“Peng Peng!”<br/><br/>The avatars were directly killed by the many experts who had locked onto them!<br/><br/>Some of the energy rippled onto the Nine Heavens Divine Roc, but it didn’t leave any traces.<br/><br/>In fact, the Ten Thousand Meter Long Nine Heavens Divine Roc egg didn’t move at all!<br/><br/>“Kill!”<br/><br/>On both sides, be it the Behemoth Alliance or the Ten Sun Alliance, their eyes were all red as they flew towards the Nine Heavens Divine Roc egg.<br/><br/>When they got closer again, the battle erupted once again.<br/><br/>“Weng Weng!”<br/><br/>At this moment, Wu Tongming’s grandfather turned into a shadow and instantly appeared beside the beginner-level heavenly Yuan creation realm experts of the Behemoth Alliance.<br/><br/>Numerous thorns instantly shot towards the beginner-level heavenly Yuan creation realm experts.<br/><br/>“Ahhhhh!”<br/><br/>At this instant, three Heavenly Yuan creation realm experts were instantly killed!<br/><br/>“Courting Death!”<br/><br/>The experts from the Beast Alliance locked onto this figure and crushed it with a huge claw!<br/><br/>“Hehehe, die!”<br/><br/>At this moment, in the center of the experts from the Beast Alliance.<br/><br/>More than ten soul-like experts stood there and stared coldly in front of them.<br/><br/>Figures started to gather in front of them.<br/><br/>Soon after, they grabbed the figure in front of them and crushed it.<br/><br/>“Ah!”<br/><br/>“Ah!”<br/><br/>“Ah!”<br/><br/>On the side of the Giant Beast Alliance, the seven or eight experts of the mechanical ascension let out miserable cries and died.<br/><br/>This was the strength of the cursed Devil Spirit.<br/><br/>“Two warps, Kill!”<br/><br/>At the Mechanical Ascension, a powerful chaos-level existence’s eyes were filled with killing intent.<br/><br/>With a wave of his arm, a piece of paper as thin as a Cicada’s wings flew forward.<br/><br/>The paper instantly disappeared, and in the next moment, it appeared in front of a group of cursed demonic spirits.<br/><br/>The paper wrapped around a cursed demonic spirit.<br/><br/>The strange paper rolled up the cursed demonic spirit, and in the next moment, it disappeared!<br/><br/>It was also an extremely strange and terrifying attack!<br/><br/>“Huh?”<br/><br/>This move caused the expressions of the cursed demonic spirits to change drastically. They were filled with fear.<br/><br/>“Protect us!”<br/><br/>The leader of the cursed demonic spirits, who Wang Xian had met before, shouted loudly.<br/><br/>“Alright!”<br/><br/>Immediately, two great dao-level powerhouses from the Behemoth Alliance stood in front of them and helped them to defend against everything!<br/><br/>The battle began to become intense.<br/><br/>Some powerhouses from both sides were attacking some existences who had just entered the Heaven’s origin realm.<br/><br/>“HMM?”<br/><br/>At this moment, Wang Xian was sensing his surroundings.<br/><br/>He sensed the aura of the origin stone from the few mechanical ascenders who had just died.<br/><br/>“Wu Tongming, I’ll return your body to you.”<br/><br/>Wang Xian said to Wu Tongming. In the next moment, he instantly entered a mech.<br/><br/>This mech was one that had just been destroyed.<br/><br/>Wang Xian entered the mech and instantly, the power of chaos simulated everything in the mech.<br/><br/>In the surrounding void, there were tens of millions of mech warships.<br/><br/>At this moment, Wang Xian had turned into a mech. Even if it was an expert who had ascended to the universe, he wouldn’t be able to notice it at this moment!<br/><br/>Wang Xian quickly came to the side of the fallen expert who had ascended to the universe in the form of a mech.<br/><br/>With a thought, a surge of energy wrapped around the origin stone in the bodies of these powerhouses and stole it directly!\t\t\t\t\t\t</div>", "images": {}, "success": true}