{"id": 1497, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075826.html", "title": "Chapter 4500 - Chapter 4500: 449918 Origin Stones!", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4500 - Chapter 4500: 449918 Origin Stones!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4500: 449918 origin stones!<br/><br/>“What?”<br/><br/>“How is this possible? How Can Wu Tongming be so powerful?”<br/><br/>“He has a heavenly fate treasure on him. This? Could it be that his grandfather gave him a heavenly fate treasure?”<br/><br/>“No, that’s impossible. Even Wu Tongming’s father doesn’t have a heavenly fate treasure. Why would he give him a heavenly fate treasure?”<br/><br/>In the surrounding area, a group of experts who knew Wu Tongming from the 10 suns federation revealed an incredulous expression when they saw his terrifying strength.<br/><br/>How long had Wu Tongming broken through?<br/><br/>It had only been a few million years!<br/><br/>How could he have such powerful strength now?<br/><br/>He was even stronger than an ordinary control-level expert!<br/><br/>This made them feel incredulous.<br/><br/>In addition, where did he get his heavenly fate treasure?<br/><br/>It was impossible for such a treasure to be on a beginner-level heavenly fate powerhouse!<br/><br/>It wasn’t just the ten days alliance’s powerhouses who were shocked.<br/><br/>Wu Tongying couldn’t figure it out either.<br/><br/>If it wasn’t for his brother’s arrogant words, he would have thought that this wasn’t his brother!<br/><br/>“Little Ming he? ?”<br/><br/>At the same time, Wu Tongming’s parents were fighting with their opponents on the control level battlefield.<br/><br/>However, they were also paying attention to their children.<br/><br/>When they saw their son’s strength that was even stronger than theirs, they were also extremely shocked!<br/><br/>“That Heavenly Yuan Destiny Supreme Treasure is from the forbidden area of life. How could this kid obtain the treasure there?”<br/><br/>Soon, Wu Tongming’s father sensed the arrival of the ultimate treasure of Tianyuan in his body. He growled in disbelief!<br/><br/>Whoosh! Whoosh<br/><br/>However, while they were still in shock, Wang Xian had already rushed to the front of the control-level powerhouse.<br/><br/>He flew directly to the side of the corpse. With a thought, Wang Xian kept the two origin stones.<br/><br/>He was so powerful that none of the experts around him could sense it!<br/><br/>“Senior, go help my parents!”<br/><br/>Wu Tongming, who was in Wang Xian’s body, immediately said when he saw that he had succeeded!<br/><br/>“Alright!”<br/><br/>Wang Xian nodded and didn’t refuse!<br/><br/>He flew directly to Wu Tongming’s parents.<br/><br/>“Dad, Mom, let me help you!”<br/><br/>Wu Tongming shouted and said!<br/><br/>“Xiao Ming, how did your strength improve so quickly?”<br/><br/>Wu Tongming’s mother couldn’t help but ask.<br/><br/>“It’s a long story. I’ll tell you all after the battle!”<br/><br/>Wu Tongming replied!<br/><br/>“Alright!”<br/><br/>Wu Tongming’s parents still believed in their son. They thought that he had obtained a powerful opportunity.<br/><br/>Boom<br/><br/>Wang Xian controlled the ultimate treasure of Heaven’s origin and attacked the powerhouses of the Behemoth Alliance.<br/><br/>The powerful might of the ultimate treasure of the Heaven’s origin and the strange energy caused his expression to change drastically!<br/><br/>The battle continued, and the fight continued!<br/><br/>Wang Xian controlled Wu Tongming’s body and merely maintained the fight.<br/><br/>He did not reveal his strength!<br/><br/>As time passed, more powerhouses were killed in the surroundings.<br/><br/>Furthermore, there were two powerhouses who had just entered the Heaven’s origin realm.<br/><br/>“One of them has a stone of origin on him!”<br/><br/>Wang Xian sensed it and his mind moved!<br/><br/>At this moment, a powerful energy flew over from the front.<br/><br/>Wang Xian waved his arm and pretended to be unable to block it in time. He was hit by the energy directly.<br/><br/>Boom<br/><br/>The powerful energy caused him to be injured instantly and he flew backward.<br/><br/>Under Wang Xian’s control, the place where he flew to was the corpse with the Stone of origin!<br/><br/>“Xiao Ming!”<br/><br/>“Son!”<br/><br/>Wu Tongming’s parents’faces changed drastically when they saw this scene.<br/><br/>They didn’t have any doubts about Wu Tongming being sent flying.<br/><br/>That was because from their point of view, although their son was very strong now, his combat experience wasn’t enough!<br/><br/>“Dad, Mom, I’m Fine!”<br/><br/>Wu Tongming shouted at his parents hurriedly to prevent them from worrying.<br/><br/>Buzz<br/><br/>When Wang Xian was close to a certain distance, he easily took the origin stone away again!<br/><br/>Following that, he controlled Wu Tongming’s body and dashed forward again!<br/><br/>Taking advantage of the situation, Wang Xian was able to display his abilities to the fullest.<br/><br/>In a short period of time, he had four origin stones in his hands. Including the ones in his hands, he had a total of five!<br/><br/>“I just need to get more than ten more!”<br/><br/>Wang Xian’s eyes sparkled.<br/><br/>Following that, the battle continued.<br/><br/>More and more experts around him died.<br/><br/>In fact, there were even experts of the Great Dao level who died in front of him.<br/><br/>There were also a large number of experts who rushed towards the Divine Roc of the Nine Heavens in an attempt to control it!<br/><br/>For the time being, Wang Xian did not focus his attention on the Divine Roc of the Nine Heavens. Instead, he continued to fish in troubled waters.<br/><br/>There were experts who had died. As long as they had the stone of origin, Wang Xian would immediately approach them and take it away.<br/><br/>This was because after Wang Xian took it away, he would use the power of chaos to simulate a stone of origin and inject it into his body. There were no experts around him and he realized that there was something wrong.<br/><br/>After all, the five existences at the level of chaos were all in the midst of a battle. There was no time for them to come over!<br/><br/>This caused the number of origin stones in Wang Xian’s hands to increase!<br/><br/>“I have 15. I’ll get a few more just in case!”<br/><br/>After a few minutes, the number of origin stones in Wang Xian’s hands had reached 15. His eyes were filled with excitement.<br/><br/>He decided to get a few more and then snatch the Divine Roc of the Nine Heavens!<br/><br/>Boom<br/><br/>He didn’t know if Wang Xian was lucky or something else!<br/><br/>At this moment, the body of an expert of the Great Dao level suddenly flew toward them.<br/><br/>This expert was on the verge of death. There were flames burning on his body.<br/><br/>His life force was disappearing at a terrifying speed.<br/><br/>He died before he reached Wang Xian!<br/><br/>“Red Ancestor.”<br/><br/>Wu Tongming recognized this figure when he saw him and shouted!<br/><br/>Wang Xian sensed the origin stone in the body of this powerhouse and flew over.<br/><br/>Buzz! Buzz<br/><br/>He waved his arm and kept the three origin stones.<br/><br/>“Son, keep the body of red ancestor!”<br/><br/>Not far away, Wu Tongming’s father immediately shouted at him!<br/><br/>This dead Great Dao level powerhouse was an expert from their supernatural universe.<br/><br/>Keeping the corpse would reduce the losses after resurrection!<br/><br/>“Alright!”<br/><br/>Wu Tongming immediately agreed. Wang Xian waved his arm and kept the corpse.<br/><br/>“Send a voice transmission to your parents. Tell them that you are going to use the powerful powers of the Heaven’s origin destiny treasure to go to the Nine Heavens Divine Roc!”<br/><br/>Wang Xian kept the three origin stones. The origin stones in his hands were enough for him to completely fuse the primal chaos stones with himself!<br/><br/>He stared at the Divine Roc of the Nine Heavens and instructed Wu Tongming!<br/><br/>“Yes, Senior!”<br/><br/>Wu Tongming nodded immediately and transmitted his voice to his parents!<br/><br/>“Son, are you confident? Be careful!”<br/><br/>Although Wu Tongming’s parents hesitated, they still agreed.<br/><br/>Their son was stronger than them now. Furthermore, he had the ultimate treasure of the Heaven’s origin.<br/><br/>Maybe this heavenly creation treasure has a special skill.\t\t\t\t\t\t</div>", "images": {}, "success": true}