{"id": 1491, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075796.html", "title": "Chapter 4494 - Chapter 4494: 4493 Tenth Day Federation Conference", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4494 - Chapter 4494: 4493 Tenth Day Federation Conference</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4494: 4493 Tenth Day Federation Conference<br/><br/>Buzz<br/><br/>Buzz<br/><br/>Wu Tongming was sitting cross-legged in the space domain of the primal Chaos Stone, cultivating.<br/><br/>Wang Xian was sitting at the side, using the power of space to interfere with his perception.<br/><br/>He didn’t know how long he had been here.<br/><br/>In addition, Wang Xian would torture Wu Tongming every once in a while.<br/><br/>In the space of the primal Chaos Stone, Wang Xian helped Wu Tongming refine the ultimate treasure of Tianyuan.<br/><br/>This gave Wu Tongming a huge boost in his strength.<br/><br/>In the space of the primal chaos stone, there were sufficient resources. With Wang Xian’s personal guidance, Wu Tongming’s strength had improved significantly in the span of 100 million years.<br/><br/>However, there was still some distance to go before he could step into another minor realm.<br/><br/>“There are still more than two million years before the birth of the Divine Roc of the Nine Heavens. Two million years later, Wu Tongming’s strength will be able to advance one step further. This can be considered as a fruitful harvest for him.”<br/><br/>Wang Xian mumbled. He had helped him to improve so much and even helped him to obtain a heaven’s origin destiny treasure. He had already done his best for him!<br/><br/>If he could obtain the Divine Roc of the nine heavens this time, it wouldn’t be a big deal to take him in as a disciple if he had the intention.<br/><br/>If he couldn’t obtain it, Wang Xian was prepared to return.<br/><br/>In addition, Wang Xian’s purpose of going to the Divine Roc of the Nine Heavens this time wasn’t just for the Divine Roc of the Nine Heavens.<br/><br/>There was also the origin stone.<br/><br/>From Wu Tongming, he learned that the origin stone was necessary if he wanted to control the Divine Roc of the Nine Heavens.<br/><br/>Therefore, many of the experts who went there before had the origin stone in their hands.<br/><br/>Some of them might even have a few pieces.<br/><br/>Wang Xian was only about ten origin stones away from completely fusing with the primal chaos stone.<br/><br/>When he completely fused with the primal chaos stone, his strength would reach a terrifying level!<br/><br/>Whether he was above the primal chaos realm, Wang Xian could not be 100% sure!<br/><br/>However, his strength would definitely be enhanced significantly.<br/><br/>Time passed day by day.<br/><br/>Boom<br/><br/>On this day, Wu Tongming’s body trembled. An even more powerful aura burst out from his body.<br/><br/>He opened his eyes and revealed an excited expression.<br/><br/>“Senior, I’ve broken through! I’ve broken through!”<br/><br/>He shouted excitedly!<br/><br/>“HMM, it’s not bad. Your intelligence and comprehension ability are indeed stronger!”<br/><br/>Wang Xian nodded at him.<br/><br/>Perhaps it was because his family’s genes were too good, Wu Tongming was indeed a rare prodigy.<br/><br/>One might not be able to find a single prodigy in a universe.<br/><br/>“Big Brother, how long has it been?”<br/><br/>Wu Tongming asked excitedly.<br/><br/>“More than 1.8 million years. Alright, I’ve just broken through. Let me help you stabilize your realm!”<br/><br/>Wang Xian said to him with a smile on his face.<br/><br/>Upon hearing this, Wu Tongming’s expression froze.<br/><br/>Next, Wang Xian would help him to temper himself and completely stabilize his strength!<br/><br/>“In order to cause unnecessary trouble, don’t announce your strength for the time being.”<br/><br/>Wang Xian said to Wu Tongming.<br/><br/>“Senior, I understand. When the Divine Roc of the Nine Heavens is born, there will probably be a huge battle. At that time, I will make a move and amaze everyone. Haha!”<br/><br/>Wu Tongming said with a smile and started to fantasize.<br/><br/>He was imagining the scene where he would shock everyone and sweep through everything!<br/><br/>“Hehe!”<br/><br/>Wang Xian smiled.<br/><br/>“There should be more than 100,000 years left. During this period of time, I will go into seclusion and wait for the time to come!”<br/><br/>Wang Xian instructed him.<br/><br/>Wu Tongming had no objections.<br/><br/>Buzz Buzz<br/><br/>On this day, Wu Tongming’s artificial brain, which was cultivating, started to tremble.<br/><br/>He opened his eyes and upon seeing the information on it, his eyes instantly lit up.<br/><br/>“Senior, my sister sent me a message, asking me to gather at the inner area of the ten-day federation. At that time, there will be a few hundred heavenly fate realm experts from the federation. It is possible that three chaos-level masters from the ten-day federation are there as well.”<br/><br/>“Senior, are you going?”<br/><br/>Wu Tongming asked Wu Tongming.<br/><br/>“I’ll go. However, I’ll keep you away when the time comes.”<br/><br/>Wang Xian pondered for a moment and said.<br/><br/>This time, he might encounter three chaos-level existences.<br/><br/>To be on the safe side, Wang Xian decided to let Wu Tongming hide in his body. He would not possess Wu Tongming.<br/><br/>As long as he used the power of chaos to simulate everything about Wu Tongming, he believed that other existences at the level of chaos would not be able to discover anything.<br/><br/>“Alright!”<br/><br/>Wu Tongming nodded. “Senior, you must not be discovered. Otherwise, I will be done for!”<br/><br/>“Don’t Worry!”<br/><br/>Wang Xian shook his head.<br/><br/>His body moved and transformed into Wu Tongming’s body. He flew directly toward his destination.<br/><br/>“Xiao Ming, over here!”<br/><br/>When he arrived at the teleportation formation, Wu Tongying appeared at the side and shouted at him.<br/><br/>“Let’s go and take a look.”<br/><br/>Wang Xian urged her.<br/><br/>“You’re in such a hurry. However, this is your first time participating in such a gathering. After this gathering, we will be heading to the Divine Roc of the Nine Heavens.”<br/><br/>“Our ten-day federation will be setting up some arrangements there. A treasure of this level can almost change the current situation.”<br/><br/>“The battle at that time will definitely be extremely tragic. I estimate that more than a hundred powerhouses of the Heaven’s origin manifestation will perish. It will be a brutal and bloody battle.”<br/><br/>Wu Tongying spoke with a slightly solemn tone.<br/><br/>Wang Xian nodded.<br/><br/>A treasure of this level was too powerful.<br/><br/>Even if the powerhouses of the Justice Alliance and the evil sequence faction knew about it, they would probably fly hundreds of millions of miles to snatch it.<br/><br/>While they were conversing, the two of them entered the teleportation formation.<br/><br/>Then, they flew towards the center of the 10-day federation.<br/><br/>The center of the 10-day federation was located in the Sea of life.<br/><br/>In the Sea of life, there were all kinds of powerful mech battleships.<br/><br/>There were countless powerhouses living in seclusion.<br/><br/>Wang Xian and the rest came to a palace.<br/><br/>The entire palace was filled with rows and rows of seats.<br/><br/>In the center, there was a round table with three chairs placed in front of it.<br/><br/>When they arrived, there were already powerhouses of the Heaven’s origin.<br/><br/>At the core, there were three powerhouses in the primal chaos realm.<br/><br/>At the center of the core, there was a circle where the powerhouses in the Great Dao realm were seated.<br/><br/>As for the outer circle, it was based on one’s strength, control level, and beginner level!<br/><br/>“Let’s sit at the outermost circle. We’re just listening in anyway. We just need to obey the orders!”<br/><br/>Wu Tongying spoke to him.<br/><br/>Wang Xian nodded.<br/><br/>“Tongying, let’s do it over here. Yo, Little Ming, I heard that you had a breakthrough. impressive. When are you going to celebrate?”<br/><br/>After entering, someone greeted Wu Tongying and Wu Tongming.<br/><br/>“Let’s wait until this matter is over. Hehe!”<br/><br/>Wang Xian smiled and imitated Wu Tongming’s every move!<br/><br/>“Come and sit!”<br/><br/>The woman waved at them.<br/><br/>Wang Xian and Wu Tongying sat down and had a simple conversation.<br/><br/>As time passed, more and more experts arrived.<br/><br/>…<br/><br/>PS: the author has something to do for the next month. For the time being, one copy a day. The update will resume next month!\t\t\t\t\t\t</div>", "images": {}, "success": true}