{"id": 1490, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075791.html", "title": "Chapter 4493 - Chapter 4493: 4492 Strange Energy, Obtaining A Treasure", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4493 - Chapter 4493: 4492 Strange Energy, Obtaining A Treasure</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4493: 4492 strange energy, obtaining a treasure<br/><br/>“Senior, what kind of energy is this? Why is it so Strange?”<br/><br/>Wang Xian and the rest came to the front of the Forbidden Zone of life. Wu Tongming looked over and his face revealed a fearful expression.<br/><br/>Even though his strength had broken through to the Heaven’s origin blessed realm.<br/><br/>However, he still felt fearful when faced with such a terrifying energy.<br/><br/>He could feel that he would definitely die if he entered!<br/><br/>“It must be a special energy. It contains the darkness attribute and a peculiar attribute energy.”<br/><br/>Wang Xian stretched out his hand and probed into the forbidden area of life.<br/><br/>Following that, the Sea of blood in the forbidden area of life and the substantial energy around it that was like blood gushed into Wang Xian’s body.<br/><br/>When this energy entered his body, it would melt any life force and everything.<br/><br/>Corrosion, assimilation!<br/><br/>This energy was very strong. Once it entered his body, it would be very difficult to force it out!<br/><br/>“Darkness, water.”<br/><br/>Wang Xian analyzed the energy here. It contained the darkness and water attributes.<br/><br/>When the darkness and water fused together, it formed other strange and powerful energy.<br/><br/>However, this energy was not a great threat to Wang Xian!<br/><br/>He moved his palm slightly and the power of chaos was completely converted to simulate this energy.<br/><br/>Very soon, Wang Xian possessed this special energy as well.<br/><br/>This made Wang Xian’s offensive skills a little more powerful.<br/><br/>This dark water energy had an extremely terrifying restraining effect on the fire and Earth attributes.<br/><br/>“Let’s go, I’ll bring you in!”<br/><br/>As Wang Xian spoke, the energy enveloped Wu Tongming and flew straight in.<br/><br/>Buzz<br/><br/>The energy enveloped Wu Tongming. In his shock, he entered the inner area.<br/><br/>Wang Xian looked around calmly and went deeper in.<br/><br/>The deeper he went, the more terrifying it would be.<br/><br/>Furthermore, the deeper he went, the greater the fluctuation of the Sea of blood.<br/><br/>However, everything was within Wang Xian’s tolerance range!<br/><br/>After flying for five minutes, Wang Xian sensed the aura of the ultimate treasure of Tianyuan in front of him.<br/><br/>“The energy here is very strong. Even ordinary experts of the chaos level can’t withstand the energy here!”<br/><br/>Wang Xian spoke as he sensed the energy around him!<br/><br/>Just as Wu Tongming was about to speak, Wang Xian brought him in once again.<br/><br/>They flew closer to the ultimate treasure of the Heaven’s origin.<br/><br/>Buzz! Buzz! Buzz<br/><br/>As they got closer, the defense around Wang Xian’s body let out sizzling sounds of corrosion.<br/><br/>This almost scared Wu Tongming to death!<br/><br/>“Senior, can you withstand it?”<br/><br/>Wu Tongming was shocked and asked in fear.<br/><br/>“It’s a pity that I haven’t completely fused with the primal chaos stone. As long as I completely fuse with it, my body should be able to transform into the body of chaos. Then, as long as I enter this place and transform into the energy here, I won’t suffer any Impact!”<br/><br/>“After all, the energy here is an unintentional fluctuation.”<br/><br/>Wang Xian ignored Wu Tongming and thought to himself.<br/><br/>At the moment, it wasn’t a complete power of chaos. If his body could transform into a body of chaos, then Wang Xian would be powerful.<br/><br/>When the time came, he could approach the elemental god directly. He could even enter the battlefield of the Elemental God without suffering any attacks!<br/><br/>Buzz<br/><br/>Wang Xian moved his body and continued to fly forward.<br/><br/>The closer he got, the faster the defense around him was corroded.<br/><br/>“Senior, this… this…”<br/><br/>Wu Tongming sensed the energy around him. As long as the defense that enveloped him collapsed, he would be reduced to ashes instantly.<br/><br/>There was no room for defense at all.<br/><br/>Even the defense that his grandfather had set up in his body would be dissolved.<br/><br/>He was really worried that Wang Xian’s defense would be shattered!<br/><br/>“This place is indeed not simple. It’s no wonder that the Federation didn’t manage to obtain this ultimate treasure of the Heaven’s origin!”<br/><br/>Wang Xian spoke and used all his strength.<br/><br/>Heaven’s origin golden eyes.<br/><br/>Void disk.<br/><br/>The energy of the two ultimate treasures of the Heaven’s origin spread out and enveloped them.<br/><br/>Buzz<br/><br/>Wang Xian moved and arrived in front of the ultimate treasure of the Heaven’s origin. Then, he stretched out his arm!<br/><br/>Buzz<br/><br/>The moment he grabbed it, Wang Xian disappeared instantly!<br/><br/>In the next moment, he brought Wu Tongming to a spot outside.<br/><br/>“Damn it, damn it. Senior is awesome, senior is invincible!”<br/><br/>Wu Tongming saw that the ultimate treasure of the Heaven’s origin that his grandfather said that the entire federation was powerless to do anything about was easily obtained by this mysterious senior.<br/><br/>A look of shock appeared on his face once again.<br/><br/>In his heart, Wang Xian’s status and strength had increased by another level!<br/><br/>He was too strong!<br/><br/>“The Ultimate Treasure of the Heaven’s origin with the darkness and water attributes. Although it doesn’t match your wood attributes and can not help you increase your cultivation speed, it can help you increase your strength by three small stages.”<br/><br/>“It allows you to have a control level and an initial level of combat strength.”<br/><br/>Wang Xian looked at this ultimate treasure of the Heaven’s origin creation and commented, “It has an offensive attribute and is quite powerful. Its offensive methods are also very strange.”<br/><br/>“It’s an ultimate treasure of the Heaven’s origin creation.”<br/><br/>Wu Tongming’s eyes were burning with excitement.<br/><br/>This ultimate treasure of the Heaven’s origin creation was his?<br/><br/>“This is a mature ultimate treasure of the Heaven’s origin creation. I’ll help you refine it. Also, give me the treasure in your hands. I’ll give it to my subordinate.”<br/><br/>Wang Xian said to Wu Tongming.<br/><br/>The news of this ultimate treasure of Tianyuan was obtained from Wu Tongming. In addition, this kid was very cooperative. Wang Xian had a good impression of him.<br/><br/>Therefore, he gave this treasure to him.<br/><br/>However, he had a treasure in his hand that could increase the combat strength of a beginner in the Tianyuan stage. He was prepared to give it to this kid and give it to the disciples of the Dragon Palace.<br/><br/>After all, with his strength, he could only control one heaven’s origin realm treasure!<br/><br/>“Senior, you want my treasure too?”<br/><br/>Wu Tongming was stunned when he heard his words. He said helplessly, “That was my grandfather’s birthday gift to me.”<br/><br/>“I have many subordinates. You Don’t need this treasure. Give it to me.”<br/><br/>Wang Xian stretched out his hand and said with a smile.<br/><br/>“Hehe, sure. Senior has already given me the ultimate treasure of Tianyuan. What does that treasure of mine count as?”<br/><br/>Wu Tongming didn’t mind it and took it out cheerfully.<br/><br/>Furthermore, he knew that if Wang Xian wanted his treasure, he could easily snatch it away.<br/><br/>“By the way, senior, do you have your own forces as well?”<br/><br/>Wu Tongming asked curiously.<br/><br/>“Yes.”<br/><br/>Wang Xian nodded his head and kept his treasures. “Let’s go back. Next, we need to increase our strength and refine the ultimate treasure!”<br/><br/>“Yes, yes!”<br/><br/>Wu Tongming’s heart was filled with fighting spirit at this moment.<br/><br/>He could already imagine how his grandparents and sister would be shocked when he displayed his formidable strength in the future.<br/><br/>At the thought of this, he couldn’t help but reveal an excited look on his face.<br/><br/>He, Wu Tongming, was about to take off completely.<br/><br/>He was even about to surpass his father!<br/><br/>At that time, with his own strength, would Qingtian still reject him?<br/><br/>Probably not. After all, he was so strong.<br/><br/>He thought in his heart.\t\t\t\t\t\t</div>", "images": {}, "success": true}