{"id": 1493, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075806.html", "title": "Chapter 4496 - Chapter 4496: 4495 Was Born", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4496 - Chapter 4496: 4495 Was Born</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4496: 4495 was born<br/><br/>The powerhouses of the Behemoth Alliance were located within the Behemoth Source!<br/><br/>The powerhouses of the ten-day federation were located within the chaos.<br/><br/>They could sense each other’s existence.<br/><br/>However, no battle had erupted between the two sides.<br/><br/>There were still tens of thousands of years before the birth of the Nine Heavens Divine Roc.<br/><br/>Both sides were obviously dominated by the Nine Heavens Divine Roc.<br/><br/>They wanted to obtain this extremely powerful primal chaos behemoth.<br/><br/>Time passed by little by little.<br/><br/>The surrounding void was filled with many flying devices.<br/><br/>Both sides tacitly agreed and did not make any arrangements.<br/><br/>That was because both sides knew that if they made any arrangements, both sides might start fighting.<br/><br/>At that time, it would probably be an extremely tragic battle that would last for a very long time.<br/><br/>Even though the Behemoth Alliance had a slight advantage in terms of strength, they did not start the battle in advance.<br/><br/>As time passed, the atmosphere around them became more and more tense.<br/><br/>Waves of killing intent permeated the chaos.<br/><br/>Five thousand years passed slowly.<br/><br/>“Chirp, chirp, Chirp!”<br/><br/>“Chirp, chirp, Chirp!”<br/><br/>On this day, suddenly, a roar was heard from within the huge flaming meteorite!<br/><br/>Upon hearing the roar, everyone’s gaze froze slightly!<br/><br/>Wang Xian looked over and revealed a surprised expression.<br/><br/>“When the Divine Roc of the Nine Heavens died, it turned into a flaming meteorite. Its bloodline gave birth to a race of primal chaos behemoths. There were more than twenty primal chaos behemoths at the heaven origin creation level.”<br/><br/>“Now, these more than twenty primal chaos behemoths will turn into energy and fuse into the eggs of the Divine Roc of the Nine Heavens. Once again, they will give birth to the extremely powerful Divine Roc of the Nine Heavens!”<br/><br/>At this moment, an expert at the Great Dao level in front spoke!<br/><br/>“Then isn’t the newly born Nine Heavens Divine Roc extremely powerful?”<br/><br/>An expert at the Heavenly Yuan creation level couldn’t help but ask.<br/><br/>“No, this will be when he is at his weakest. His strength will at most enter the Heavenly Yuan creation level.”<br/><br/>The Great Dao expert shook his head. “In theory, every expert has a chance to control this nine Heavens Divine Roc!”<br/><br/>“Of course, there is another possibility. It is not impossible for the Nine Heavens Divine Roc to escape. However, there are too many experts here, so the chances of it escaping are very small!”<br/><br/>When all the experts heard this, they nodded slightly.<br/><br/>The eyes of some experts who had origin stones in their hands and control techniques flickered.<br/><br/>Once they were able to obtain the Nine Heavens Divine Roc, they would soar into the sky!<br/><br/>They would stand at the top of the alliance and be on equal footing with the three existences of the primal chaos level.<br/><br/>Wang Xian stood there with a glint in his eyes.<br/><br/>During this period of time, he carefully sensed his surroundings.<br/><br/>He sensed that there should be more than 200 origin stones in the Federation’s Alliance in just ten days.<br/><br/>Wang Xian didn’t dare to investigate how many origin stones there were among the three existences of the primal chaos level!<br/><br/>“This time, even if I don’t get my hands on the Divine Roc of the Nine Heavens, I have to get my hands on the origin stone for my breakthrough.”<br/><br/>Wang Xian thought to himself.<br/><br/>“Chirp! Chirp! Chirp!”<br/><br/>“Chirp! Chirp! Chirp!”<br/><br/>As time trickled by, the roars from the interior of the flaming meteorite became more and more frequent!<br/><br/>“Boom! Boom! Boom!”<br/><br/>When thousands of years had passed, all the experts from the Behemoth Alliance started to move and flew towards the flaming meteorite.<br/><br/>The gigantic beasts and the chaotic behemoths were exceptionally eye-catching.<br/><br/>Wang Xian looked at the gigantic beasts and the chaotic behemoths, his eyes shining.<br/><br/>He was not curious about the powerhouses in the Behemoth universe merging with the gigantic beasts.<br/><br/>What made him curious was how those chaotic behemoths were controlled?<br/><br/>It was simply too difficult to control existences at such a level!<br/><br/>Over at the Behemoth Alliance, there were more than 300 giant beasts and giant beasts of primordial chaos.<br/><br/>Each of them was exuding an extremely powerful strength.<br/><br/>Wang Xian could vaguely sense four powerhouses at the level of primordial chaos.<br/><br/>There were more existences at the level of Great Dao than the ten-day federation.<br/><br/>Furthermore, this was not all the strength of the two alliances.<br/><br/>There was a group of Heaven’s origin destiny realm powerhouses guarding the nest of the ten-day federation and the Behemoth Alliance.<br/><br/>Both parties were worried that their hometowns would be attacked when they made their moves.<br/><br/>“Eh?”<br/><br/>At this moment, Wang Xian looked at the position in front of him and found some clues.<br/><br/>The Behemoth Alliance was able to control the chaotic behemoths because of the four chaotic behemoths.<br/><br/>Primal Chaos level beasts were equivalent to the powerhouses of the Beast Universe.<br/><br/>They were one entity.<br/><br/>They used primal Chaos Level Beasts to suppress the primal Chaos Beasts and used other special methods to control them.<br/><br/>In short, they couldn’t do without primal chaos level existences.<br/><br/>The Beast Alliance started to move.<br/><br/>The ten days federation was obviously much more nervous.<br/><br/>Three primal chaos existences faced off against four primal chaos experts.<br/><br/>Soon, they separated and looked in the direction of the flaming meteorite.<br/><br/>“Dong Dong!”<br/><br/>“Dong Dong!”<br/><br/>As the Nine Heavens Divine Roc neared, the cries within the flaming meteorite disappeared.<br/><br/>Instead, there was the sound of a beating heart.<br/><br/>Even if it was far away, one could still hear it clearly!<br/><br/>Buzz<br/><br/>The flaming meteorite in front of them was emitting a high temperature. The fiery red flames were slowly converging!<br/><br/>The entire gigantic flaming meteorite began to shrink at a speed visible to the naked eye!<br/><br/>It was as if all the energy was converging towards the center!<br/><br/>“This flaming meteorite is so huge. To think that it’s starting to harvest now. This divine Roc of the nine heavens was definitely not as simple as I imagined when he was alive.”<br/><br/>Wang Xian had a solemn expression on his face.<br/><br/>Even the current him could not create such a huge force.<br/><br/>Wang Xian even guessed that the Divine Roc of the Nine Heavens had reached the limit of the primal chaos realm?<br/><br/>Did he use an alternative method to undergo nirvana in order to improve to a higher level?<br/><br/>The more Wang Xian guessed, the more he felt that the possibility was very high.<br/><br/>That was because the energy of this flaming meteorite was too huge!<br/><br/>The huge flaming meteorite kept shrinking.<br/><br/>After a thousand years, the entire flaming meteorite had turned into the size of a planet.<br/><br/>However, this was not the end.<br/><br/>“If there aren’t too many experts around, I can perform a divination myself!”<br/><br/>Wang Xian felt a little regretful and could only wait for the unknown.<br/><br/>“When the Divine Roc of the nine heavens turns into the size of 10,000 meters, it will break out of its shell!”<br/><br/>In front of him, the chaos-level powerhouse from the three-three universe mumbled.<br/><br/>“It has become smaller. Instead, it is more convenient for me to succeed when I make my move.”<br/><br/>“At the moment, I am the strongest here. Furthermore, I have so many tricks up my sleeve. My chances of success are at 80% !”<br/><br/>Wang Xian’s eyes sparkled with confidence.<br/><br/>There were four existences at the chaos level in the Behemoth Alliance. The strongest one was only at the chaos level and the Great Dao level!\t\t\t\t\t\t</div>", "images": {}, "success": true}