{"id": 1499, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075836.html", "title": "Chapter 4502 - Chapter 4502: The 4501 Primal Chaos Original Stone Was 100% Fused", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4502 - Chapter 4502: The 4501 Primal Chaos Original Stone Was 100% Fused</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4502: The 4501 Primal Chaos original stone was 100% fused<br/><br/>“You want me to submit? is that possible?”<br/><br/>“I, the Mighty Divine Roc of the Nine Heavens, have roamed the primal chaos for countless years. Will I submit to you?”<br/><br/>“Wishful thinking. Even if you kill me, I will not submit to you!”<br/><br/>When the Divine Roc of the Nine Heavens heard Wang Xian’s words, his face turned cold and embarrassed.<br/><br/>He had once cultivated to the peak of the primal chaos realm.<br/><br/>In order to find a way to break through, he ignored the huge crisis and went straight to Nirvana.<br/><br/>Now that he had just recovered, there was actually a living being who wanted him to submit?<br/><br/>How could he agree to that!<br/><br/>Even if he were to kill him, he wouldn’t agree to it!<br/><br/>“Oh Really? Do you really think that I don’t dare to destroy you? If I were to destroy you, I would still be able to obtain a lot of resources.”<br/><br/>Wang Xian looked at his determined expression and raised his eyebrows slightly!<br/><br/>However, the Divine Roc of the Nine Heavens didn’t say anything and continued to stare at him coldly!<br/><br/>This made Wang Xian frown.<br/><br/>Buzz<br/><br/>He waved his arm and a wave of energy wrapped around the Divine Roc of the Nine Heavens, completely sealing him off.<br/><br/>The surrounding energy was also switched by him, causing his birth to completely stop.<br/><br/>“This fellow’s willpower is very strong. It Won’t be so easy to make him submit.”<br/><br/>Wang Xian thought to himself. Since that was the case, he would first fuse with the primal Chaos Stone.<br/><br/>He wanted to see what level his strength would increase to after fusing with the primal chaos stone 100% .<br/><br/>Whether he had the means to completely subdue this divine roc of the Nine Heavens.<br/><br/>Or, if he could increase his strength, he could take it away and use the method he used to control the king of Void back then to control it.<br/><br/>In short, he was definitely going to take the Nine Heavens Divine Roc!<br/><br/>“I have lived through countless lonely years. It is impossible for me to submit to any living being. Even if you kill me, I will not submit!”<br/><br/>When the Nine Heavens Divine Roc saw that he was sealed, he roared angrily!<br/><br/>Wang Xian ignored him. With a thought, the primal chaos stone appeared in front of him.<br/><br/>The primal chaos stone slowly wrapped around Wang Xian and changed the flow of time around him!<br/><br/>One Hour in the outside world was equivalent to one hundred hours here.<br/><br/>He took out the stone of origin and began to absorb it rapidly.<br/><br/>As for the situation in the outside world, Wang Xian was not worried.<br/><br/>The outer shell of the Divine Roc of the nine heavens was indeed extremely tough. It was not something that an ordinary expert of the primal chaos level could break.<br/><br/>Unless there were two or three experts of the chaos level joining forces to attack one part of the outer shell.<br/><br/>However, it was clear that the seven experts of the chaos level outside would not attack the outer shell of the Divine Roc of the Nine Heavens directly.<br/><br/>What they wanted was a complete divine roc of the Nine Heavens.<br/><br/>It would not be broken by them!<br/><br/>However, at this moment, after Wang Xian sealed the Divine Roc of the Nine Heavens.<br/><br/>The absorption of energy by the Divine Roc of the Nine Heavens also stopped.<br/><br/>This also caused the birth of the Divine Roc to completely stop.<br/><br/>The thumping sounds and the energy that was constantly increasing disappeared!<br/><br/>This change quickly attracted the attention of all the experts in the outside world!<br/><br/>When they saw the Divine Roc of the nine heavens quieting down, the expressions of the experts from the ten-day federation and the Behemoth Alliance changed slightly!<br/><br/>“Stop attacking!”<br/><br/>The eyes of the four primal chaos existences from the Behemoth Alliance narrowed slightly as they stopped attacking.<br/><br/>At the same time, they shouted and ordered.<br/><br/>“Don’t Attack!”<br/><br/>The three primal chaos experts from the ten-day federation who had been struggling all this while exhaled heavily.<br/><br/>When the other party stopped, they immediately stopped as well.<br/><br/>If they continued to fight, they would lose miserably!<br/><br/>The decisive battle was not their goal.<br/><br/>Their goal was the Nine Heavens Divine Roc.<br/><br/>Now that the Nine Heavens Divine Roc had suddenly stopped giving birth, it gave them a slight shock as they looked over.<br/><br/>With the Order of a primal chaos expert, both parties immediately pulled apart and looked at the Nine Heavens Divine Roc!<br/><br/>“The birth of the Nine Heavens Divine Roc seems to have stopped!”<br/><br/>“What happened? Why did the Nine Heavens Divine Roc, which was still in the process of being born, suddenly stop?”<br/><br/>“Did he sense the danger in the outside world? Is that why he stopped?”<br/><br/>“I don’t know. It’s a little strange. It’s possible that he’s continuing his power.”<br/><br/>All the experts’gazes were focused on the Nine Heavens Divine Roc, and they were all filled with astonishment.<br/><br/>The five primal chaos experts also frowned as they sized him up.<br/><br/>Both sides temporarily stopped fighting and stared at the Nine Heavens Divine Roc. They quietly sensed and waited.<br/><br/>“The Nine Heavens Divine Roc is indeed still inside, but why did he suddenly stop absorbing energy? Why did he stop giving birth?”<br/><br/>A primal chaos expert from the Giant Beast Alliance muttered.<br/><br/>He was also puzzled!<br/><br/>“This is?”<br/><br/>“Is it because of senior?”<br/><br/>Wu Tongming, who was the only one who knew the truth, looked at the Nine Heavens Divine Roc with curiosity and thought to himself!<br/><br/>Time passed by minute by minute. The powerhouses from both sides did not lose their patience. They pulled apart a distance and waited again.<br/><br/>“Little Ming, how did your strength increase so quickly? Also, why do you have a Heavenly Yuan Destiny Treasure on You? This is the Heavenly Yuan Destiny Treasure in the Forbidden Zone? How did you get it?”<br/><br/>The killing stopped temporarily. Wu Tongming’s parents flew directly to their son’s side and couldn’t help but ask a series of questions.<br/><br/>A heavenly fate treasure, a veteran beginner level strength.<br/><br/>This speed of increase in strength was too fast.<br/><br/>And that heavenly fate treasure!<br/><br/>“This… Dad and mom, you might not believe it, but I met a senior. That senior saw that I wasn’t bad and said that he wanted to take me in as a disciple. The reason why my strength increased so quickly was because of his teachings.”<br/><br/>“Also, he took me to the Life Forbidden Zone to take out this heavenly creation true treasure!”<br/><br/>Wu Tongming answered!<br/><br/>That was the only answer he could give!<br/><br/>However, he didn’t dare to say that the senior was controlling the Nine Heavens Godly Peng.<br/><br/>He also didn’t dare to say that the senior was the one who killed the automaton universe great being.<br/><br/>If he said it out loud, his life would be over!<br/><br/>“What? How is this possible? It really is the heaven origin creation true treasure in the Life Forbidden Zone. You have to know that even the three primal chaos level great beings of our 10 Sun Union couldn’t take out this heaven origin creation true treasure!”<br/><br/>Wu Tongming’s father was shocked and said with a shocked face.<br/><br/>“Father, I feel that my senior’s power is much stronger than the three great beings of our 10 Sun Union.”<br/><br/>Wu Tong Ming opened his mouth and said!<br/><br/>“Where is that senior now? What is his name? Have you really taken him as your master?”<br/><br/>Wu Tong Ming’s parents were slightly startled and hurriedly asked!<br/><br/>“He hasn’t taken me as his disciple yet. As for where he is, I don’t know. It seems that he has returned to his universe. He said that he would come over to test me for a period of time and that he would only take me as his disciple after he succeeded in the test!”<br/><br/>Wu Tong Ming was lying through his teeth.<br/><br/>There was nothing he could do. He couldn’t tell the truth.<br/><br/>Right now, all the experts of the 10-day federation could hear his words.<br/><br/>These experts were extremely shocked by the strength he had displayed!\t\t\t\t\t\t</div>", "images": {}, "success": true}