{"id": 1502, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075851.html", "title": "Chapter 4505 - Chapter 4505: 4504 Divine Roc Of The Nine Heavens Submitted", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4505 - Chapter 4505: 4504 Divine Roc Of The Nine Heavens Submitted</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4505: 4504 divine Roc of the Nine Heavens submitted<br/><br/>Just as Wang Xian was sensing the changes in his body.<br/><br/>While he was sensing the changes in his strength, the Divine Roc of the Nine Heavens was completely stunned.<br/><br/>He stared at Wang Xian with his eyes wide open. His heart was in turmoil!<br/><br/>He could sense how powerful and terrifying Wang Xian was at this moment.<br/><br/>He was far beyond his peak.<br/><br/>In fact, when he was at his peak, there was a 100% chance that he would be killed directly when facing him!<br/><br/>“Above chaos? How did he do it?”<br/><br/>“What do I have to do to reach above Chaos?”<br/><br/>“Now that his strength is so terrifying, I can’t even put up any resistance when facing him. Is there any use for me? Will he destroy me?”<br/><br/>The expression of the Divine Roc of the Nine Heavens kept changing.<br/><br/>Finally, he made a decision in his heart!<br/><br/>“Phew!”<br/><br/>Wang Xian took a deep breath and smiled!<br/><br/>The transformation was complete.<br/><br/>The evolution was complete!<br/><br/>He looked at the Divine Roc of the Nine Heavens at the side with a cold look in his eyes.<br/><br/>“Now, make your choice. Surrender or perish. Choose One!”<br/><br/>Wang Xian stared at him and said.<br/><br/>At this moment, he was no longer able to completely make the Divine Roc of the Nine Heavens Surrender.<br/><br/>If he was not too far away, Wang Xian would kill it directly.<br/><br/>He would use the power of chaos to devour it directly!<br/><br/>Wang Xian could slowly cultivate his own combat strength at the level of Chaos!<br/><br/>“Sir… Sir, I submit, I submit!”<br/><br/>The Divine Roc of the Nine Heavens also felt the change in Wang Xian at this moment. He did not hesitate at all and spoke respectfully immediately.<br/><br/>Now, he understood that if he didn’t submit, he would really be dead!<br/><br/>“This is a wise choice.”<br/><br/>Wang Xian smiled and looked at him. “After absorbing the surrounding energy, how strong will you be?”<br/><br/>“Sir, I will absorb all the energy in the surroundings. I will be able to reach the level of two great daos. However, my cultivation will be much faster in the future. As long as I have sufficient energy, I can quickly recover to the level of Chaos!”<br/><br/>The Divine Roc of the Nine Heavens didn’t dare to be arrogant anymore and answered honestly!<br/><br/>“Alright, continue to absorb and continue to improve!”<br/><br/>Wang Xian nodded his head. Following that, his body shook and a force of time enveloped the Divine Roc of the Nine Heavens.<br/><br/>In an instant, the Divine Roc of the Nine Heavens felt that the space around him seemed to have changed.<br/><br/>However, he couldn’t describe this change.<br/><br/>That was because he couldn’t sense the flow of time.<br/><br/>Unless, Wang Xian only enveloped half of his body.<br/><br/>The Divine Roc of the nine heavens sensed that his seal was unsealed. Without any hesitation, he began to absorb the energy.<br/><br/>Wang Xian watched quietly from the side.<br/><br/>Being able to subdue the Divine Roc of the Nine Heavens was also a benefit to the Dragon Palace!<br/><br/>As for whether he would betray them, he wasn’t worried at all.<br/><br/>After returning to the Dragon Palace, he would use the method of controlling the king of Void to completely control the Divine Roc of the Nine Heavens!<br/><br/>Of course, even if he were to recover to his peak, Wang Xian could easily destroy it with his own strength!<br/><br/>Buzz! Buzz<br/><br/>Buzz! Buzz<br/><br/>When the Divine Roc of the Nine Heavens began to absorb energy again.<br/><br/>In the outside world, the expressions of all the experts from the ten-day federation and the Behemoth Alliance changed slightly!<br/><br/>“The Nine Heavens Divine Roc is continuing to be born. Moreover, the changes this time are even greater than before!”<br/><br/>“Is this a complete nirvana?”<br/><br/>“Hiss, the energy emitted by the Nine Heavens Divine Roc egg is much, much more powerful than before. is the Nine Heavens Divine Roc really about to be born?”<br/><br/>All the experts were slightly startled as they stared at it with blazing eyes!<br/><br/>The atmosphere between the two camps immediately changed!<br/><br/>Boom<br/><br/>Boom<br/><br/>All of a sudden, without any warning, the experts from the two camps flew towards the Nine Heavens Divine Roc.<br/><br/>The battle erupted once again!<br/><br/>This time, the battle was even more chaotic than the previous one!<br/><br/>Wang Xian, who was within the energy of the Nine Heavens Divine Roc, looked outside with a smile on his face!<br/><br/>“They are really willing to pay any price in order to obtain this divine Roc of the Nine Heavens!”<br/><br/>He mumbled.<br/><br/>Unfortunately, even without him, the Behemoth Alliance and the ten-day federation wouldn’t be able to obtain the Divine Roc of the Nine Heavens!<br/><br/>This was because the Divine Roc of the Nine Heavens wouldn’t submit to them.<br/><br/>They wouldn’t be able to enter either!<br/><br/>“Let’s fight. When we get out later, we will collect all the corpses!”<br/><br/>Wang Xian spoke.<br/><br/>He wasn’t prepared to get involved in this war.<br/><br/>Of course, if there were benefits, he wouldn’t just stand by and watch.<br/><br/>When it was time to take some benefits, he had to take some too.<br/><br/>His gaze swept across and landed on Wu Tongming.<br/><br/>He had said that if he obtained the Divine Roc of the Nine Heavens, he would consider taking him in as a disciple.<br/><br/>Now, he wanted to see how this kid’s combat experience was.<br/><br/>“Not bad. It’s not a waste of the training I gave him previously.”<br/><br/>His gaze swept across the surroundings. As time passed, Wang Xian nodded his head slightly.<br/><br/>The battle outside was getting more and more intense and chaotic.<br/><br/>As time passed, a large number of powerhouses in the Heaven’s origin realm died.<br/><br/>In the previous battle, only a few dozen powerhouses in the Heaven’s origin realm died.<br/><br/>But this time, there were already more than a hundred!<br/><br/>Both sides were obviously killing with bloodshot eyes!<br/><br/>At the primal chaos realm experts’side, the imminent deity universe’s primal chaos realm experts were coughing up blood!<br/><br/>He was injured.<br/><br/>The three of them were doing their best to resist.<br/><br/>One by one, the heaven origin creation realm experts approached the Nine Heaven Divine Roc, but they were quickly attacked by the other party’s experts.<br/><br/>However, as time passed, experts from both sides stuck close to the nine Heaven Divine Roc and prepared to control it.<br/><br/>“Damn it, what’s the situation now?”<br/><br/>“What’s the situation with senior? What’s the situation with the Nine Heaven Divine Roc?”<br/><br/>“Did senior succeed?”<br/><br/>Wu Tongming relied on the Heavenly Yuan creation supreme treasure to hold on for a short period of time.<br/><br/>However, his father was not so lucky. He was killed!<br/><br/>Fortunately, his father could still be resurrected!<br/><br/>Wu Tongming looked at the Nine Heavens Divine Roc not far ahead. He hesitated for a moment before charging forward.<br/><br/>“Boom! Boom! Boom! Boom!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>Streams of energy attacked him, but he used the heavenly Yuan creation true treasure to dodge them.<br/><br/>In the next instant, he arrived in front of the Nine Heavens Divine Roc.<br/><br/>Without any hesitation, he took out the stone of origin and tried to control it as well!<br/><br/>“Eh, this guy’s luck is pretty good.”<br/><br/>When Wang Xian saw that Wu Tongming was actually in front of the Divine Roc of the Nine Heavens, he raised his eyebrows slightly. He was prepared to give him an unexpected surprise!<br/><br/>With a wave of his arm, ripples slowly formed in front of Wu Tongming.<br/><br/>“Oh?”<br/><br/>“What’s going on? I’m the only one who reacted to all the experts who were close to the Nine Heavens Divine Roc?”<br/><br/>When Wu Tongming saw this scene, he was instantly stunned. His eyes were filled with surprise and joy.<br/><br/>His body paused for a moment before he prepared to enter.<br/><br/>“Oh?”<br/><br/>“What?”<br/><br/>“Not good. An expert from the Ten Sun Alliance is controlling the Nine Heavens Divine Roc to attack him!”<br/><br/>“Wu Tongming he…”<br/><br/>The experts from the Giant Beast Alliance and the Ten Days Alliance sensed the changes on this side.<br/><br/>The expressions of the experts from the Giant Beast Alliance changed drastically!\t\t\t\t\t\t</div>", "images": {}, "success": true}