{"id": 1508, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075881.html", "title": "Chapter 4511 - Chapter 4511: All The 4,510 Powerhouses Were Shocked!", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4511 - Chapter 4511: All The 4,510 Powerhouses Were Shocked!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4511: All the 4,510 powerhouses were shocked!<br/><br/>“Ahhhhh!”<br/><br/>“Ahhhhh!”<br/><br/>With the Mechanical God dying time and time again, his current strength had already fallen to the Heaven’s origin realm.<br/><br/>Wang Xian could kill him easily!<br/><br/>At this moment, he had the extra strength to kill the surrounding powerhouses who had ascended to the universe.<br/><br/>Since he had decided to make a move, he had to completely destroy the entire mechanical ascension universe.<br/><br/>It was a good opportunity to use all the resources of the Mechanical Ascension universe to increase his own strength and the strength of the Dragon Palace!<br/><br/>When Wang Xian started his large-scale attack.<br/><br/>All the experts of the mechanical ascension universe in the surrounding area were filled with fear!<br/><br/>Their god of machinery was now facing complete destruction.<br/><br/>Now, it was their turn!<br/><br/>At this moment, apart from fear, despair, there was also unwillingness.<br/><br/>They were unwilling!<br/><br/>Why did they encounter such a powerful opponent when they ascended to the universe?<br/><br/>Why did their god of machinery provoke such an existence?<br/><br/>Why was this mysterious person so powerful!<br/><br/>The experts who had ascended to the universe were defending with all their might.<br/><br/>However, those who had just entered the beginner level and were at the control level had no way of defending against Wang Xian’s attack.<br/><br/>This was especially so for the strange curse ability of the cursed demonic spirit. It was a natural counter to them.<br/><br/>“No!”<br/><br/>“No, no!”<br/><br/>“Don’t kill me! Don’t kill me! I’m willing to submit!”<br/><br/>The Great Beings of the automaton universe were all terrified.<br/><br/>They didn’t want to die.<br/><br/>Because this time, they were truly destroyed!<br/><br/>They were completely dead!<br/><br/>In the surrounding areas, there was the godly spring of the godly universe and the three gods of the three three universes.<br/><br/>They all sucked in a breath of cold air at the same time!<br/><br/>Even the four primal chaos beings of the Giant Beast Alliance were shocked by this scene.<br/><br/>They watched the death of the expert who ascended to the universe.<br/><br/>They watched the death of the god of machinery!<br/><br/>“We must not provoke this expert!”<br/><br/>“He should be above the primal chaos level, right? Above the primal chaos level, what level is this? The gap between US and above the primal chaos level is huge. In fact, we will never be able to reach this level!”<br/><br/>The powerhouses of the Behemoth Alliance transmitted their voices in secret.<br/><br/>They looked at Wang Xian with a hint of respect!<br/><br/>An existence that transcended!<br/><br/>“This… this… master, are you going to destroy this machine and ascend to the Universe?”<br/><br/>At this moment, Wu Tongming looked at his heroic and invincible master with his eyes wide open. His eyes were filled with shock and disbelief.<br/><br/>He knew that his master was very strong.<br/><br/>But the strength he displayed now was too terrifying, right?<br/><br/>A primal chaos level existence was easily killed.<br/><br/>In the entire mechanical ascension universe, more than a hundred heaven origin creation realm experts were completely unable to resist.<br/><br/>This was his master?<br/><br/>His future master?<br/><br/>“Yes, when I first came here, this mechanical ascension universe wanted to kill me and even wanted to snatch the source stones from me. I killed more than ten heaven origin creation realm experts.”<br/><br/>“Now, the god of machinery has possessed you and wants to snatch your body and obtain the Divine Roc of the Nine Heavens. Such a force is basically from the top to the bottom. There’s no need for it to exist anymore!”<br/><br/>“Just nice. Do you want the technology for the Mechanical Ascension Universe? I’ll give it to you!”<br/><br/>Wang Xian looked at Wu Tongming and asked with a smile!<br/><br/>“This? ? ? This? ?”<br/><br/>When Wu Tongming heard his master’s words, he was dumbfounded!<br/><br/>Giving him the technology for the mechanical ascension to the Universe?<br/><br/>The most powerful thing about the mechanical ascension to the universe was the power of technology.<br/><br/>As long as one could grasp their knowledge, they could also mass-produce powerhouses of the Heaven’s origin.<br/><br/>The technology for the mechanical ascension to the universe was the source of their strength.<br/><br/>If he could obtain it, he could create a powerful force like the mechanical ascension to the universe as long as he was given time!<br/><br/>“This? Master, don’t you want it?”<br/><br/>Wu Tongming opened his mouth and couldn’t help but ask.<br/><br/>“I only want some information about the mechanical ascension to the universe and the quota for the Heaven’s origin realm. This knowledge can be shared in the first place. Other than the black hole teleportation technology, the rest is just so-so!”<br/><br/>Wang Xian said.<br/><br/>The current him and his own energy seemed to have transcended a little!<br/><br/>In other words, he could use the power of chaos to simulate any treasure and transform any treasure.<br/><br/>This included directly creating the Heaven’s origin creation treasure.<br/><br/>Of course, the consumption of this kind of creation was permanent.<br/><br/>Whether it was worth creating or not depended on the situation.<br/><br/>Other than the black hole teleportation technology, he was not interested in the technology of mechanical ascension to the universe!<br/><br/>“Let’s do it. Our supernatural universe has been unhappy with the mechanical ascension to the universe for a long time. Oh right, master, you have to protect our supernatural universe in the future, especially after our ten days federation lost a chaos-level existence.”<br/><br/>Wu Tongming said quickly!<br/><br/>“Hehe, it’s nothing!”<br/><br/>Wang Xian patted his head and looked at a great dao level expert who had ascended to the universe.<br/><br/>That Great Dao level expert was still struggling to resist the power of the curse.<br/><br/>A strong energy of the water attribute bloomed in his body.<br/><br/>The water energy was repairing his body.<br/><br/>Wang Xian waved his arm and grabbed him.<br/><br/>“No!”<br/><br/>This made the existence at the level of Great Dao despair.<br/><br/>“Peng!”<br/><br/>Wang Xian took out one of the Heaven’s origin creation treasure from his body!<br/><br/>It was a water-attribute Heaven’s origin creation treasure with a supporting nature.<br/><br/>“I’ll give it to you. If you work hard, you’ll be able to possess the combat strength of the Great Dao!”<br/><br/>Wang Xian used the power of chaos to wash the imprint on it and spoke to him!<br/><br/>“Thank you, Master!”<br/><br/>Wu Tongming was stunned when he saw this scene. Then, he became excited.<br/><br/>What the F * ck!<br/><br/>Was this the benefit of having a huge background?<br/><br/>Wu Tongming thought that he was already powerful enough in the 10-day federation!<br/><br/>His background was already powerful enough!<br/><br/>In the end, he now had a heaven-defying strength.<br/><br/>He was given two ultimate treasures of the Heaven’s origin!<br/><br/>In just a short period of time, he had gained two mastery-level and one beginner-level combat strength!<br/><br/>This? ? ?<br/><br/>Didn’t others envy him to death?<br/><br/>In the surrounding area, Wu Tongming’s grandfather, mother, and his sister, Wu Tongying, were indeed looking at this scene with faces full of disbelief and shock.<br/><br/>They knew that their grandson, son, and younger brother were going to be heaven-defying!<br/><br/>With such a powerful master, wouldn’t he be able to do whatever he wanted in the chaos?<br/><br/>Crack! Crack! Crack<br/><br/>Just when all the experts around were shocked by Wang Xian’s terrifying strength.<br/><br/>At the side, the outer shell of the Divine Roc of the Nine Heavens began to collapse rapidly!<br/><br/>The outer shell turned into lava and surged toward the center rapidly!<br/><br/>“The Divine Roc of the Nine Heavens is about to be born. This is an existence that was once powerful in the chaos realm. He tried to break through to the chaos realm through Nirvana but failed.”<br/><br/>Wang Xian looked at the position of the Divine Roc of the Nine Heavens and spoke to Wu Tongming!\t\t\t\t\t\t</div>", "images": {}, "success": true}