{"id": 1509, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075886.html", "title": "Chapter 4512 - Chapter 4512: 4511 Nine Heavens Divine Roc Was Born", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4512 - Chapter 4512: 4511 Nine Heavens Divine Roc Was Born</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4512: 4511 Nine Heavens Divine Roc was born<br/><br/>“What?”<br/><br/>“This nine Heavens Divine Roc is undergoing nirvana in order to break through above the primal chaos realm. Doesn’t that mean that the strength of the Nine Heavens Divine Roc back then has reached the peak of the primal Chaos Realm?”<br/><br/>“Just now, that Wu Tongming’s mysterious master came out from the Nine Heavens Divine Roc. He should already know everything. It is even possible that he has already subdued the Nine Heavens Divine Roc!”<br/><br/>“Just now, we tested it. The outer shell of the Nine Heavens Divine Roc is extremely tough. Even the power of the primal chaos realm would find it difficult to break it. No wonder this nine Heavens Divine Roc was once an existence at the peak of Primal Chaos!”<br/><br/>In the surrounding area, all the experts revealed shocked expressions when they heard Wang Xian’s words.<br/><br/>They looked at the Nine Heavens Divine Roc with sparkling eyes.<br/><br/>Now, the Nine Heavens Divine Roc was about to be born completely.<br/><br/>However, they took a look at that mysterious existence.<br/><br/>It was likely that the Nine Heavens Divine Roc had already found a home!<br/><br/>“Chirp, chirp, Chirp!”<br/><br/>“Chirp, chirp, Chirp!”<br/><br/>Not long after, the chirping of the Nine Heavens Divine Roc came from within.<br/><br/>All the power of the flames in his outer shell surged towards the center.<br/><br/>An enormous divine Roc phantom appeared in everyone’s line of sight.<br/><br/>An incomparably powerful aura came from his body and surged towards the surroundings!<br/><br/>“A power comparable to two great dao levels, possessing such terrifying strength right after being born?”<br/><br/>The four primal chaos level existences of the Giant Beast Alliance spoke as they sensed this aura!<br/><br/>Their gazes towards the Nine Heavens Divine Roc were burning!<br/><br/>“Forget it. That mysterious existence said that the Nine Heavens Divine Roc was once a peak primal chaos existence. We probably can’t control such an existence. Furthermore, the Nine Heavens Divine Roc should have been subdued by now!”<br/><br/>An expert of the Behemoth Alliance said in a deep voice.<br/><br/>Even though they wanted to obtain the Nine Heavens Divine Roc.<br/><br/>They had even lost close to a hundred heavenly Yuan blessed realm experts.<br/><br/>But at this moment, there was no need to fight!<br/><br/>That mysterious existence was too powerful!<br/><br/>So powerful that he could easily kill a primal chaos realm existence.<br/><br/>Even if the four of them joined forces, they didn’t have the slightest confidence!<br/><br/>“CHIRP CHIRP CHIRP!”<br/><br/>“CHIRP CHIRP CHIRP!”<br/><br/>The cries of the Divine Roc of the nine heavens could still be heard.<br/><br/>His figure became clearer and clearer.<br/><br/>Finally, a Divine Roc with powerful flames appeared in the sight of all the experts!<br/><br/>“Although I have undergone Nirvana and my strength is no longer comparable to the peak, it’s still wishful thinking for you to control me!”<br/><br/>The Divine Roc of the nine heavens scanned the experts from the two camps with his pair of majestic eyes and spoke coldly!<br/><br/>He swayed his body and flew towards Wang Xian!<br/><br/>When he arrived in front of Wang Xian, he lowered his head slightly.<br/><br/>“Divine Roc of the Nine Heavens, greetings, Dragon King!”<br/><br/>The Divine Roc of the Nine Heavens spoke respectfully!<br/><br/>“Okay!”<br/><br/>Wang Xian nodded his head and caressed the Divine Roc of the Nine Heavens’head gently!<br/><br/>When all the experts around saw this scene, they weren’t too surprised!<br/><br/>He swept his gaze across the surroundings.<br/><br/>Buzz<br/><br/>He waved his arm and waves of energy flew towards the surrounding areas.<br/><br/>“I want all the corpses in the surroundings.”<br/><br/>Wang Xian spoke to all the experts in an irresistible voice.<br/><br/>“Senior, we have no objections if you want to leave the corpses. Our Behemoth Alliance doesn’t have any grudges with you and we hope that you won’t attack us!”<br/><br/>At the Behemoth Alliance, a chaos-level powerhouse hesitated for a moment.<br/><br/>His body flew out from the Behemoth and cupped his hands at Wang Xian!<br/><br/>“Don’t worry. If you don’t provoke me, I won’t kill you.”<br/><br/>Wang Xian said faintly.<br/><br/>This was also the principle that he had always followed!<br/><br/>“Thank you, senior. Senior, may I take the liberty to ask what realm is above chaos? How can one reach such a realm?”<br/><br/>He could not help but continue asking.<br/><br/>His words caused the eyes of the surrounding experts to flicker.<br/><br/>What was above chaos?<br/><br/>No matter if it was the Behemoth Alliance or the Ten Days Federation alliance, they had never seen an existence above chaos.<br/><br/>This person who was called the Dragon King by the Nine Heavens Divine Roc was the first!<br/><br/>Furthermore, the strength he displayed was definitely not something that the chaos realm could compare to!<br/><br/>It was definitely above the chaos realm!<br/><br/>“I don’t know what realm is above the chaos realm. I have only just stepped into it. As for how to achieve it, I’m afraid that I’ll need luck!”<br/><br/>Wang Xian did not hide anything as he spoke!<br/><br/>“Don’t think about it. You guys still have a long way to go before you reach the top of the chaos realm. After I reached the peak of the chaos realm, I’ve experienced hundreds of aeons and countless methods. I’ve searched for countless places but I still haven’t been able to break through!”<br/><br/>“This time’s nirvana has completely failed!”<br/><br/>The Nine Heavens Divine Roc swept over and said indifferently.<br/><br/>“What?”<br/><br/>“After merely reaching the peak of primal chaos, I have experienced over a hundred aeons?”<br/><br/>“This? ? How long has this nine Heavens Divine Roc survived?”<br/><br/>In the surrounding area, all the experts were slightly startled when they heard the words of the Nine Heavens Divine Roc.<br/><br/>“Is that so?”<br/><br/>The expressions of the four primal chaos realm existences from the Behemoth Alliance, as well as the primal chaos experts from the godly power universe and the three-three universe, changed!<br/><br/>However, they quickly adjusted themselves.<br/><br/>If Wang Xian had not appeared today, they would have thought that the primal chaos realm was the highest realm!<br/><br/>“Let’s go. Next, I’m going to destroy the machinery to ascend to the universe and destroy all of their heaven origin creation realm experts!”<br/><br/>Wang Xian looked at Wu Tongming beside him and said.<br/><br/>Following that, he waved his arm and a wave of energy enveloped the Divine Roc of the nine heavens and Wu Tongming.<br/><br/>Using the demonic spirit altar’s ability, he instantly arrived in the godly spirit universe.<br/><br/>In the godly spirit universe, he had set up the demonic spirit altar!<br/><br/>He had already collected the corpses of the Divine Roc of the Nine Heavens. There were about 200 of them.<br/><br/>All of them were at the level of Heaven’s origin creation.<br/><br/>To Wang Xian, this was an extremely huge amount of resources!<br/><br/>However, Next, Wang Xian was going to destroy the Mechanical Ascension Universe.<br/><br/>There were about 200 of them, as well as the Heaven’s origin creation realm powerhouses in their camp.<br/><br/>After killing these 200 Heaven’s origin creation realm powerhouses, the most important thing was that the Dragon Palace would have 200 more slots for the Heaven’s origin creation realm.<br/><br/>Now, the Dragon Palace had already obtained a spot in the Heaven’s origin realm.<br/><br/>This was also one of the reasons why he wanted to destroy the machine to ascend to the universe!<br/><br/>Of course, Wang Xian was not prepared to exterminate the weak cultivators in the machine to ascend to the universe!<br/><br/>“This… This mysterious senior actually wants to destroy the machine to ascend to the Universe!”<br/><br/>“The machine to ascend to the universe is finished. A strong cultivator at this level is unstoppable!”<br/><br/>“The god of machinery will be completely destroyed this time as well. His strength is too terrifying!”<br/><br/>Seeing Wang Xian leave, the experts of the 10-day federation said in a Daze!<br/><br/>“Let’s leave too!”<br/><br/>Over at the Behemoth Alliance, when the experts saw that terrifying existence leaving, they left as well.<br/><br/>Furthermore, they decided that they could no longer be enemies with the 10-day federation in the future!\t\t\t\t\t\t</div>", "images": {}, "success": true}