{"id": 1503, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075856.html", "title": "Chapter 4506 - Chapter 4506: This Was The First Time He Made A Move After Breaking Through To 4505!", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4506 - Chapter 4506: This Was The First Time He Made A Move After Breaking Through To 4505!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4506: This was the first time he made a move after breaking through to 4505!<br/><br/>Currently, around the Nine Heavens Divine Roc, there were many experts who were trying to control it.<br/><br/>There was even a great dao expert from the Behemoth Alliance.<br/><br/>However, no one was able to control it successfully.<br/><br/>However, at this moment, Wu Tongming suddenly had a change in front of him.<br/><br/>The Nine Heavens Divine Roc egg emitted a brilliant light.<br/><br/>This caused all the surrounding experts to be stunned!<br/><br/>This was especially so for the experts from the Behemoth Alliance. Their expressions changed drastically as they attacked Wu Tongming together.<br/><br/>However, they were quite far away from Wu Tongming.<br/><br/>Beside Wu Tongming, there was also a group of experts from the Ten Suns Federation. When they saw this scene, they were shocked and immediately began to protect Wu Tongming.<br/><br/>Wu Tongming revealed a pleasantly surprised expression as he directly entered the interior of the Nine Heavens Divine Roc.<br/><br/>“Hualala!”<br/><br/>However, at the instant he entered the interior of the Nine Heavens Divine Roc!<br/><br/>Some extremely minute particles suddenly surged into Wu Tongming’s body.<br/><br/>He didn’t even have the time to react!<br/><br/>In fact, he didn’t even notice it.<br/><br/>Wu Tongming entered the interior of the Nine Heavens Divine Roc with a pleasantly surprised expression on his face.<br/><br/>He immediately scanned his surroundings.<br/><br/>Now, he had a guess that the reason he could enter so easily wasn’t because of his own uniqueness.<br/><br/>It should have something to do with that senior.<br/><br/>That senior had long entered the Nine Heavens Divine Roc’s body!<br/><br/>“Front…”<br/><br/>Just as he opened his mouth to shout, his expression suddenly changed drastically.<br/><br/>He sensed that his palm was covered in layers of metal.<br/><br/>He felt that he was losing control of his body!<br/><br/>This sudden change caused Wu Tongming’s expression to change drastically.<br/><br/>What was going on?<br/><br/>What was going on?<br/><br/>“Get Out!”<br/><br/>His body shook and a wave of energy rushed towards the energy in his body.<br/><br/>“Shut up and hand your body over to this god. Don’t resist.”<br/><br/>A cold shout came from Wu Tongming’s body.<br/><br/>The sudden voice caused Wu Tongming’s expression to change drastically.<br/><br/>“You… You Are the god of machinery? You…”<br/><br/>Wu Tongming’s expression changed drastically as he roared in disbelief.<br/><br/>“Eh?”<br/><br/>At this moment, Wang Xian, who was in the depths of the cave, raised his eyebrows slightly when he saw this scene.<br/><br/>His body gradually merged with the surrounding energy as he watched quietly.<br/><br/>“What do you want to Do? Why do you want to occupy my body? Lord Mechanical God, what do you want to do to me?”<br/><br/>Wu Tongming’s expression changed drastically, and his face was filled with shock as he continued to ask.<br/><br/>“You don’t have the qualifications to control this nine Heavens Divine Roc. Only existences like us have the qualifications.”<br/><br/>“Don’t resist in any way.”<br/><br/>The Mechanical God’s voice continued to come from within Wu Tongming’s body.<br/><br/>One after another, machines began to wrap around Wu Tongming.<br/><br/>Once it was wrapped, the mechanical God would be able to completely control Wu Tongming’s body.<br/><br/>“You… Why are you doing this? I am also a disciple of the Ten Suns Federation. There are primal chaos existences in our spirit cosmos. If you do this, the Lords of our spirit Cosmos will not let you off.”<br/><br/>“If you do this, it will cause a battle between our spirit universe and the Mechanical Ascension Universe.”<br/><br/>Wu Tongming was somewhat terrifying, but he still roared in disbelief.<br/><br/>He never would have thought that the moment he entered this place, the most powerful being of the Mechanical Ascension universe would attack him.<br/><br/>The Lord Mechanical God would attack him.<br/><br/>He would control his body.<br/><br/>“As long as I change your memories, who knows? This kind of treasure isn’t something you can covet.”<br/><br/>The god of machinery said slowly.<br/><br/>Half of Wu Tongming’s body was covered in metal.<br/><br/>This was one of the god of machinery’s avatars.<br/><br/>And this avatar of his had been waiting for this scene.<br/><br/>Once there was an expert who could control the Nine Heavens Divine Roc, he would instantly control it and replace it.<br/><br/>This included the Great Beings from the Ten Suns Federation.<br/><br/>Only by controlling the Nine Heavens Godly Peng would his own power and the power of the Mechanical Ascension universe become even more powerful.<br/><br/>Only then would he be able to completely suppress the Spirit Path universe and the three three universes.<br/><br/>“You… you…”<br/><br/>Wu Tongming was both shocked and furious when he heard the Mechanical God’s words.<br/><br/>He had never thought that such a scene would happen!<br/><br/>“Senior, are you here?”<br/><br/>“Senior, have you obtained the Nine Heavens Divine Roc? Senior, can you take me in as a disciple?”<br/><br/>“Senior, this mechanical body wants to control me and obtain the Nine Heavens Divine Roc.”<br/><br/>At this moment, facing the clone of a primal chaos level existence, the powerless Wu Tongming could only stare ahead and shout loudly!<br/><br/>Because he guessed that senior was inside.<br/><br/>“Huh?”<br/><br/>The god of machinery was slightly stunned when he heard Wu Tongming’s Shout!<br/><br/>“Alright, stop shouting.”<br/><br/>Wang Xian looked at Wu Tongming’s current state and shook his head. He then appeared in front of him.<br/><br/>“I really didn’t expect that the chaos-level powerhouse of the ten-day federation would actually attack the powerhouse of their own faction. How interesting!”<br/><br/>Wang Xian sized up the mechanical energy that was covering Wu Tongming’s body and said faintly.<br/><br/>“Who… Who Are You?”<br/><br/>The god of machinery was filled with shock when he saw Wang Xian who suddenly appeared in front of him.<br/><br/>He suddenly had a bad feeling.<br/><br/>He knew about Wu Tongming’s fortuitous encounter.<br/><br/>Could it be…<br/><br/>“Senior, I knew you were here. I knew it.”<br/><br/>Wu Tongming looked excited when he saw Wang Xian’s figure. He shouted excitedly!<br/><br/>“Hehe!”<br/><br/>Wang Xian smiled and waved his hand at Wu Tongming’s body.<br/><br/>Numerous quicksand-like metals flew toward Wang Xian from within his body.<br/><br/>All the quicksand metals condensed into a ball and Wang Xian grabbed it in his hand.<br/><br/>At the same time, a surge of energy completely enveloped it, completely restricting it and isolating it from the main body!<br/><br/>“You’re courting death. You actually want to harm my disciple. You’re really unlucky. This time, I’ll use you to test my strength!”<br/><br/>Wang Xian stared at the god of machinery and said indifferently!<br/><br/>“Huh?”<br/><br/>Wu Tongming, who had recovered his body, was slightly stunned when he heard Wang Xian’s words.<br/><br/>“Wow, master, Master, you’re willing to take me in as your disciple?”<br/><br/>“The Divine Roc of the nine heavens has been subdued by you?”<br/><br/>Wu Tongming asked excitedly.<br/><br/>“Yes.”<br/><br/>Wang Xian nodded his head faintly and looked at him. “The Divine Roc of the Nine Heavens is still some time away from being completely born. Now, let’s move around for a while.”<br/><br/>As he spoke, he waved his arm and grabbed the metal ball in his hand. He brought Wu Tongming along and appeared in the outside world.<br/><br/>Above the Divine Roc of the Nine Heavens!<br/><br/>“Eh? Master, what are you doing?”<br/><br/>Wu Tongming asked in astonishment when he saw Wang Xian flying out with him.<br/><br/>“As my disciple, if someone wants to kill you, I will naturally help you kill him!”<br/><br/>Wang Xian said faintly as he looked in the direction where the seven powerhouses were fighting!<br/><br/>At this moment, the god of machinery, who was struggling to fend off the Behemoth Alliance, obviously sensed something.\t\t\t\t\t\t</div>", "images": {}, "success": true}