{"id": 1505, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075866.html", "title": "Chapter 4508 - Chapter 4508: 4507 The Death Of The God Of Machinery!", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4508 - Chapter 4508: 4507 The Death Of The God Of Machinery!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4508: 4507 the death of the god of machinery!<br/><br/>Wang Xian made a sudden move.<br/><br/>The terrifying and strange attack caused one of the god of Machinery’s arms to collapse.<br/><br/>It caused cracks to appear on the god of Machinery’s body.<br/><br/>The god of machinery widened his eyes and was filled with disbelief and shock.<br/><br/>What kind of terrifying attack was this?<br/><br/>What kind of attack was this?<br/><br/>The god of machinery’s expression changed drastically. His body shook and an enormous mechanical wing appeared behind him.<br/><br/>The next moment, he charged straight at Wang Xian!<br/><br/>The power that belonged to the chaos level erupted!<br/><br/>“This…”<br/><br/>“How… How did this happen?”<br/><br/>“Oh my God, that chaos level existence that just appeared, Wu Tongming’s master, actually wanted to kill the god of machinery. His most terrifying strength, the god of machinery, had cracks appearing on his body. How is this possible!”<br/><br/>“Hiss, what kind of attack is this? For such a thing to happen at this time, this…”<br/><br/>In the surrounding area, all the experts from the 10-day federation were also stunned.<br/><br/>They looked at this scene in shock.<br/><br/>The sudden change caught everyone off guard.<br/><br/>Even the experts from the Behemoth Alliance were looking at this scene in shock.<br/><br/>The two primal chaos level experts from the godly power universe and the 3rd universe were also looking at this scene with furrowed brows!<br/><br/>This was especially so for the primal chaos level powerhouses from the godly power universe. They looked at Wang Xian and then looked at their own universe’s disciples.<br/><br/>He could sense that Wu Tongming was not lying just now!<br/><br/>In other words, the moment Wu Tongming entered the Nine Heavens Divine Roc, he was attacked by the mechanical god?<br/><br/>“Master, be careful!”<br/><br/>At this moment, Wu Tongming’s expression changed slightly when he saw the mechanical god attacking them.<br/><br/>The Shadow of a man’s famous tree.<br/><br/>He was filled with fear towards the mechanical God who had ascended to the universe!<br/><br/>After all, this was an existence on the same level as his ancestor in the supernatural realm.<br/><br/>His strength was extremely terrifying!<br/><br/>“You’re courting death!”<br/><br/>Wang Xian’s expression turned cold when he saw that the mechanical god still dared to resist!<br/><br/>Crack Crack Crack<br/><br/>He clenched his palm forcefully at the virtual image of the mechanical god in front of him.<br/><br/>In the next moment, the entire virtual image collapsed and was completely divided into pieces!<br/><br/>“No, no, no!”<br/><br/>“Divine spring, three gods, help me, help me!”<br/><br/>At this moment, cracks started to appear all over the body of the mechanical god that was charging at Wang Xian.<br/><br/>His body started to disintegrate into pieces!<br/><br/>The God of machinery released a terrifying power. The powerful heaven origin destiny-level treasure in his body tried to block it.<br/><br/>However, it was completely useless.<br/><br/>At this moment, the voice of machinery was terrified!<br/><br/>He was completely terrified!<br/><br/>How was this possible?<br/><br/>He was a chaos-level powerhouse, an existence at the chaos level.<br/><br/>He was actually heavily injured by the other party in an instant.<br/><br/>And the other party was merely standing there and simply making a move!<br/><br/>Just what kind of existence was the other party?<br/><br/>“What?”<br/><br/>Seeing the mechanical God’s body suddenly collapse and suddenly suffer a fatal injury.<br/><br/>The expressions of the primal chaos experts from the spirit universe and the three three universes also changed greatly!<br/><br/>Facing this scene, they were similarly shocked.<br/><br/>They were overwhelmed with shock!<br/><br/>They were extremely clear about the strength of the mechanical god.<br/><br/>He had completely unleashed his power, and he was definitely the strongest amongst the three of them.<br/><br/>But now, facing Wu Tongming’s mysterious master, he actually didn’t have the slightest ability to resist.<br/><br/>He was actually heavily injured within a short few dozen seconds!<br/><br/>This was simply inconceivable!<br/><br/>“Hiss, this… what a terrifying attack, what a strange attack!”<br/><br/>Over at the Behemoth Alliance, the expressions of the four primal chaos existences changed drastically when they saw this scene!<br/><br/>They were filled with shock and solemnity.<br/><br/>A primal chaos existence was actually heavily injured in an instant?<br/><br/>And they had just experienced the strength of the mechanical God!<br/><br/>The four of them took a deep breath and watched vigilantly.<br/><br/>As for the surrounding areas, the other heaven origin creation realm experts were even more shocked!<br/><br/>“This friend, let’s talk things over properly. Tong Ming is a disciple of our ten suns federation. We are all friends!”<br/><br/>The three three universes, the primal chaos realm experts known as the three gods, couldn’t help but speak up when they saw this scene!<br/><br/>The Mechanical God was, after all, an expert of their alliance.<br/><br/>If they really suffered heavy losses, it would be a considerable loss to the ten-day federation.<br/><br/>Most importantly, he was afraid that the Behemoth Alliance would take advantage of this.<br/><br/>The existence of chaos in the godly universe, Shen Quan also frowned slightly and considered whether he should speak up or not!<br/><br/>“Today, this god of machinery must die. No one can stop him!”<br/><br/>Wang Xian spoke indifferently.<br/><br/>He grabbed the body of the god of machinery forcefully once again!<br/><br/>“Bang Bang Bang!”<br/><br/>“Bang Bang Bang!”<br/><br/>In the next instant, the body of the god of machinery collapsed completely!<br/><br/>Even the ultimate treasure of Tianyuan in his body began to tremble and showed signs of collapsing!<br/><br/>“It would be a pity if the ultimate treasure of Tianyuan collapsed!”<br/><br/>Wang Xian said calmly.<br/><br/>As soon as he finished his sentence, no one saw the three ultimate treasures of the Heaven’s origin in the god of machinery’s body fly directly to Wang Xian!<br/><br/>It was as if they had arrived in an instant!<br/><br/>“Ahhhh!”<br/><br/>Following that, everyone saw that the soul of the god of machinery was wrapped in a lump of flesh and blood. It was exposed in everyone’s sight!<br/><br/>That soul was wrapped in flesh and blood. It looked extremely weak and could be easily killed!<br/><br/>“How… How is this possible? Our Lord is an existence at the level of Chaos!”<br/><br/>“Let go of our Lord! Let Go!”<br/><br/>“All Powerhouses, make your move and save our Lord God of Machinery!”<br/><br/>At this moment, all the powerhouses who had ascended to the universe saw their lord god of Machinery’s flesh and blood exposed.<br/><br/>When they saw that their lord god of machinery was about to be killed, they were horrified.<br/><br/>However, they immediately roared and attacked Wang Xian.<br/><br/>More than a hundred experts who had ascended to the universe erupted with terrifying energy and attacked Wang Xian!<br/><br/>The divine spring of the chaotic existence in the godly spirit universe and the three gods in the three-three universe saw the experts from the ascended to the universe attacking at the same time, and their expressions changed slightly.<br/><br/>With so many experts attacking at the same time, even they wouldn’t be able to withstand it!<br/><br/>“You mechanical beings are really damned. I’ve decided to destroy all of you!”<br/><br/>Wang Xian looked at their attacks and said coldly.<br/><br/>The next moment, he moved and easily dodged all of their attacks!<br/><br/>Following that, he clenched his fist with his last strength!<br/><br/>“Ah!”<br/><br/>“Just you wait, just you wait!”<br/><br/>The god of machinery let out a miserable cry and his soul let out a roar of hatred!<br/><br/>“Your death this time is just the beginning!”<br/><br/>Wang Xian heard the roar of his soul and smiled faintly.<br/><br/>In front of him, the virtual image of the god of machinery continued to appear.<br/><br/>He wanted to completely destroy it!\t\t\t\t\t\t</div>", "images": {}, "success": true}