{"id": 1506, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075871.html", "title": "Chapter 4509 - Chapter 4509: 4508 Was Completely Annihilated", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4509 - Chapter 4509: 4508 Was Completely Annihilated</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4509: 4508 was completely annihilated<br/><br/>“Damn that guy, he actually destroyed one of my bodies.”<br/><br/>At the center of the Mechanical Ascension Universe.<br/><br/>The entire center of the Mechanical Ascension Universe was transformed by powerful machines.<br/><br/>At the center, in an energy pool, the mechanical God’s body slowly sat up.<br/><br/>At this moment, his expression was abnormally ugly!<br/><br/>His death also meant that his powerful body had been completely destroyed.<br/><br/>The machine ascended to the universe. After their experts died, their cultivation system was different from the others.<br/><br/>Their bodies were made of powerful treasures and powerful metals.<br/><br/>Just like his previous body, there were three heavenly fate treasures in his body.<br/><br/>This loss was too great for him!<br/><br/>He sat up, and the surrounding metal slowly surrounded him.<br/><br/>Slowly, it began to strengthen.<br/><br/>His pupils were filled with hatred.<br/><br/>Even though that mysterious chaos expert was very mysterious.<br/><br/>However, he was still filled with hatred towards him.<br/><br/>If he had the chance, he would definitely make him pay a terrible price!<br/><br/>“Ka Ka Ka!”<br/><br/>“Ka Ka Ka!”<br/><br/>However, at this moment, he suddenly felt a terrifying and strange power attacking him.<br/><br/>This terrifying power caused him to tremble and feel shocked!<br/><br/>He felt his soul begin to crumble once again.<br/><br/>He felt that death was about to arrive.<br/><br/>“No, no, no!”<br/><br/>“How is this possible? How can I be attacked while I’m here?”<br/><br/>The mechanical god was completely terrified at this moment.<br/><br/>He was completely terrified!<br/><br/>He was currently in the center of the mechanical universe.<br/><br/>He was in an absolutely safe place?<br/><br/>How could he possibly be attacked?<br/><br/>How was this possible?<br/><br/>“How can this power be so similar to the cursed demonic spirit’s death curse? He clearly isn’t a cursed demonic spirit!”<br/><br/>“Oh no, this body is about to die too!”<br/><br/>The God of machinery roared with a face full of fear!<br/><br/>His life force was dissipating rapidly.<br/><br/>At the same time, at the side of the Divine Roc of the Nine Heavens.<br/><br/>Wang Xian crushed the virtual image of the god of machinery once again.<br/><br/>However, the virtual image of the next god of machinery began to condense once again!<br/><br/>At this moment, he stretched out his hand once again to pinch it.<br/><br/>He wanted to completely destroy this automaton God.<br/><br/>He also wanted to test how strong this cursed Devil Spirit’s power was!<br/><br/>…<br/><br/>At this moment, it was also at the center of the automaton universe.<br/><br/>Another body of the automaton God started to resurrect.<br/><br/>He had many bodies, but with each resurrection, the automaton power around his body would be greatly reduced.<br/><br/>Hua La<br/><br/>When his body walked out of the energy pool, the mechanical God’s face was full of panic.<br/><br/>He had a bad premonition!<br/><br/>At this moment, he didn’t hesitate at all. With a wave of his arm, a communication device appeared in his hand.<br/><br/>He immediately gave an order to all the Great Beings in the mechanical ascension universe.<br/><br/>At the same time, he sent a distress signal to the divine spring of the Spirit Ascension Universe and the three gods of the three-three universe!<br/><br/>He was completely panicking.<br/><br/>Now, he could already guess why the dozen or so heaven origin creation realm experts in the mechanical ascension universe were completely annihilated.<br/><br/>It was this mysterious expert who did it.<br/><br/>He had the energy of a cursed devil spirit and could completely kill them.<br/><br/>This ability was extremely effective against their mechanical ascension to the universe!<br/><br/>If he were to continue being cursed…<br/><br/>He might die as well!<br/><br/>He was one of the top three powerhouses of the ten-day federation.<br/><br/>However, he had a few hundred heaven origin creation-level subordinates!<br/><br/>He didn’t want to die!<br/><br/>…<br/><br/>“What?”<br/><br/>At this moment, all the powerhouses beside Jiu Tian were still shocked by Wang Xian’s ability.<br/><br/>The machine flew into the universe. It was a full-strength attack from more than a hundred powerhouses of the Heaven’s origin realm.<br/><br/>Such an attack was easily evaded by that mysterious powerhouse.<br/><br/>The god of machinery died at his hands.<br/><br/>He did not have the slightest ability to resist.<br/><br/>An existence at the level of chaos actually did not have the slightest ability to resist. It could be said that he was killed in an instant!<br/><br/>This made all the powerhouses, even the six powerhouses at the level of chaos, a little dazed.<br/><br/>All of them looked at Wang Xian with shock and fear!<br/><br/>This? ? ? ?<br/><br/>What kind of realm was he at to be able to do this?<br/><br/>“Our god of machinery was actually killed!”<br/><br/>“This is impossible, this…”<br/><br/>“What kind of strength does he have? He was able to easily dodge our all-out attack. How is this possible?”<br/><br/>“Oh no, that mysterious powerhouse, Wu Tongming’s master, is too terrifying!”<br/><br/>All the experts in the mechanical ascension universe were even more shocked!<br/><br/>The mechanical god almost instantly killed them.<br/><br/>Facing their attacks, they could easily dodge!<br/><br/>The strength he displayed made them tremble.<br/><br/>It made them feel suffocated!<br/><br/>“Not good, the mechanical God sent us a message. After he resurrected, he is still suffering from the destructive curse attack.”<br/><br/>At this moment, the Mechanical God flew into the universe. All the heaven origin creation powerhouses received this message at the same time.<br/><br/>When they saw this message, their scalps exploded!<br/><br/>After the mechanical God died, he was still facing the attack of death.<br/><br/>He was still being wiped out.<br/><br/>This? ?<br/><br/>How was this possible?<br/><br/>“What?”<br/><br/>“I also received this message.”<br/><br/>At this moment, the three primal chaos existences of the three three universes, the three gods, had received this message.<br/><br/>The godly spring of the Spirit Universe had also received this message.<br/><br/>Looking at the Mechanical God’s cry for help, they were somewhat shocked.<br/><br/>The mechanical god that had been killed once had been destroyed once again?<br/><br/>Could the other party cause the mechanical God to die completely?<br/><br/>This method made them think of the cursed demonic spirit.<br/><br/>They looked at the mysterious expert and the Mechanical God’s Phantom in front of him.<br/><br/>The next moment, they saw the mechanical god’s phantom being crushed.<br/><br/>After that, another one condensed!<br/><br/>And at this moment, they received the mechanical God’s distress signal once again.<br/><br/>The Mechanical God had been killed once again.<br/><br/>The other party had the power to completely destroy the automaton God!<br/><br/>This left them extremely shocked!<br/><br/>This was the first time they had met a great being that could completely destroy a primal chaos level existence.<br/><br/>It was too terrifying!<br/><br/>“Not good, the automaton God has once again called for help. Attack him, attack him!”<br/><br/>“Stop him, he is cursing us, the automaton God, to stop him!”<br/><br/>At this moment, the eyes of more than a hundred experts who had ascended into the universe were about to pop out of their sockets.<br/><br/>They unleashed terrifying attacks at the same time and attacked Wang Xian once again!<br/><br/>Boom<br/><br/>Boom<br/><br/>An area-of-effect attack was launched towards Wang Xian.<br/><br/>With this attack, even existences at the chaos realm would die if they were hit head-on!<br/><br/>Wang Xian glanced at their attack with an extremely calm expression!\t\t\t\t\t\t</div>", "images": {}, "success": true}