{"id": 1500, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075841.html", "title": "Chapter 4503 - Chapter 4503: The 4502 Primal Chaos Original Stone Was 100% Fused", "volume": 15, "volume_title": "Volume 15", "body": "<h1>Chapter 4503 - Chapter 4503: The 4502 Primal Chaos Original Stone Was 100% Fused</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4503: The 4502 Primal Chaos original stone was 100% fused<br/><br/>“What? Wu Tongming actually had such a fortuitous encounter? He met such a powerful senior?”<br/><br/>“No Way? He was able to take out the heavenly fate treasure from the Forbidden Life Zone and gave it to Wu Tongming? This? This guy’s luck is too heaven-defying, right?”<br/><br/>“Is this a primal chaos existence? If it wasn’t a primal chaos existence, it would be impossible for him to take out the heavenly fate treasure from the Forbidden Life Zone!”<br/><br/>“It’s definitely a primal chaos level existence. Otherwise, how could Wu Tongming break through so quickly? His current strength is comparable to an old beginner level existence. This speed of improvement is simply heaven-defying!”<br/><br/>In the surrounding area, the experts of the 10-day federation were discussing in shock when they heard Wu Tongming’s words.<br/><br/>Although many experts of the 10-day federation had died in today’s battle.<br/><br/>There were even experts at the Great Dao level that had fallen.<br/><br/>However, what shocked them the most was the strength that Wu Tongming had displayed.<br/><br/>The experts that had died could be revived.<br/><br/>However, the strength that Wu Tongming had displayed was terrifying!<br/><br/>Especially now, when they heard his words, their faces were filled with shock.<br/><br/>He had actually met a primal chaos level expert?<br/><br/>Furthermore, this expert even had the intention of taking him in as a disciple?<br/><br/>This? ?<br/><br/>This was a chaos-level existence?<br/><br/>“Do you know where that chaos-level senior comes from, Tongming?”<br/><br/>At this moment, a group of great dao-level experts arrived in front of Wu Tongming and couldn’t help but ask.<br/><br/>Wu Tongming’s grandfather also flew over in shock.<br/><br/>He also didn’t expect that his grandson would have such good fortune!<br/><br/>“I don’t know!”<br/><br/>Wu Tongming saw a group of experts surrounding him and hurriedly replied, “Senior only said that he came from an extremely distant place.”<br/><br/>“Could this primal chaos level expert be related to the expert who killed our mechanical ascension?”<br/><br/>Over at the Mechanical Ascension Universe, a great dao level expert frowned slightly as he transmitted his voice to the expert beside him!<br/><br/>That expert also revealed a thoughtful expression.<br/><br/>“There is an extremely high possibility that Wu Tongming can instantly kill over a dozen of our Tian Yuan creation stage experts. Only those at the primal chaos level can do so. The time that Wu Tongming rose is close to the time that expert appeared!”<br/><br/>Another great dao expert replied.<br/><br/>However, this was only their guess.<br/><br/>Additionally, they also knew that the probability of this guess was 90% .<br/><br/>However, even if there was a 90% chance that it was the expert Wu Tongming mentioned, they didn’t have any thoughts of taking revenge.<br/><br/>They also didn’t say that they wanted to question Wu Tongming.<br/><br/>Because the other party was a primal chaos level existence.<br/><br/>Such an existence, even if they mechanically ascended to the universe, they didn’t dare to rashly provoke.<br/><br/>“What happened to the Nine Heavens Divine Roc? Did he sense the danger outside and not continue to be born?”<br/><br/>After the experts of the ten days federation were shocked by Wu Tongming’s strength and his words.<br/><br/>The experts once again looked towards the Nine Heavens Divine Roc.<br/><br/>This sudden change could be said to have caught the two camps unprepared!<br/><br/>However, they did not act rashly. Instead, they waited quietly!<br/><br/>Time passed day by day. They did not lose their patience and continued to wait.<br/><br/>This was because they could sense that half of the Divine Roc of the Nine Heavens had been born.<br/><br/>It was impossible for him not to complete his birth.<br/><br/>This was only a matter of time!<br/><br/>While the experts from the two camps were waiting in the outside world.<br/><br/>Inside the Divine Roc of the Nine Heavens, Wang Xian began to absorb the stone of origin rapidly.<br/><br/>His fusion rate with the primal chaos stone was increasing rapidly!<br/><br/>At the same time, Wang Xian could feel that his strength was also increasing rapidly!<br/><br/>One year in the outside world was equivalent to one hundred years in the primal chaos stones.<br/><br/>It would take Wang Xian over ten thousand years to absorb all the origin stones.<br/><br/>To the outside world, it was equivalent to one hundred years!<br/><br/>The origin stones were absorbed one by one.<br/><br/>The fusion rate with the primal Chaos Stones had gradually reached over 90% .<br/><br/>When the fusion rate reached here, Wang Xian realized that his body was undergoing changes.<br/><br/>His void dragon body was dissipating and was completely fusing into his host body.<br/><br/>His heart of Light and darkness was also undergoing a transformation, turning into a grayish heart!<br/><br/>Even Wang Xian’s body was turning grey.<br/><br/>This grey color was the same as the color of chaos.<br/><br/>It was filled with deathly stillness and was filled with terror!<br/><br/>“What is this?”<br/><br/>“How is this possible? He is transforming into chaos. What cultivation technique is he cultivating? No, it seems like he is fusing with a treasure!”<br/><br/>At this moment, the Nine Heavens Divine Roc was watching everything from the side.<br/><br/>He had an incredulous expression on his face.<br/><br/>Although he was sealed, this was his domain. It was just that the core of his body was sealed.<br/><br/>His mind and the surrounding energy that belonged to him could still sense it.<br/><br/>The Nine Heavens Divine Roc could clearly sense that the body of the person who had sealed him had undergone a huge change.<br/><br/>It was as if he was about to return to the primal chaos.<br/><br/>“No, that’s not right. It’s as if he is about to transform into a creature condensed from the primal chaos. How is this possible? How can such a transformation be completed?”<br/><br/>The Divine Roc of the Nine Heavens felt that it was somewhat unbelievable. He stared at Wang Xian with his eyes wide open.<br/><br/>“His strength is continuing to increase. The energy contained in his body now feels like it has already surpassed my peak.”<br/><br/>“He seems to be undergoing some kind of transformation. He has such terrifying strength without completing the transformation? How is this possible?”<br/><br/>“What is this?”<br/><br/>The Divine Roc of the Nine Heavens Roared in his heart.<br/><br/>He had lived for countless years and this was the first time he had seen such a strange and terrifying existence!<br/><br/>At the same time, Wang Xian could also sense the changes in his body.<br/><br/>He could feel that his body was undergoing a transformation in the direction of Chaos!<br/><br/>His bloodline was also undergoing a transformation.<br/><br/>However, this transformation did not make Wang Xian feel uncomfortable.<br/><br/>Although the color of his transformed body had changed, he could return to his original appearance with just a thought.<br/><br/>No, he could even transform into any form with just a thought.<br/><br/>This included the transformation of his internal bloodline.<br/><br/>“Is this what it means to transform everything into chaos? As long as I fuse with the primal Chaos Stone 100% , I can become a chaotic life form? I can transform into any form of energy!”<br/><br/>Wang Xian’s eyes sparkled.<br/><br/>At this moment, he could already feel the power of the chaotic life form!<br/><br/>Looking at the origin stone in front of him, Wang Xian continued to absorb.<br/><br/>He was very, very close to his final transformation!<br/><br/>As time passed, Wang Xian was 99% close to fusing with the primal chaos stone!<br/><br/>There was only 1% left!\t\t\t\t\t\t</div>", "images": {}, "success": true}