{"id": 1507, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075876.html", "title": "Chapter 4510 - Chapter 4510: 4509 Was Completely Annihilated", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4510 - Chapter 4510: 4509 Was Completely Annihilated</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4510: 4509 was completely annihilated<br/><br/>The attacks of experts below the chaos level.<br/><br/>Even the attacks of experts at the chaos level.<br/><br/>It wasn’t of much use to Wang Xian.<br/><br/>This was especially so for those at the beginner, mastery, and Great Dao level.<br/><br/>Experts at this level were very strong, and their abilities were also very powerful.<br/><br/>They could even join forces and make existences at the chaos level avoid their attacks and even severely injure them!<br/><br/>However, this was completely useless to Wang Xian.<br/><br/>Wang Xian’s time domain could cover a huge area of space around him.<br/><br/>What was the concept of this area?<br/><br/>His time could be a hundred times slower than the outside world!<br/><br/>This was equivalent to Wang Xian being a hundred times faster than them!<br/><br/>This was a terrifying figure!<br/><br/>Looking at the attacks that were coming at him, Wang Xian moved.<br/><br/>The next moment, he arrived at the center of the group of robotically ascending universe masters!<br/><br/>Wang Xian moved his palm and crushed the Phantom in front of him again. Then, he looked around.<br/><br/>“Oh no, he’s beside us!”<br/><br/>“Hiss, how is this possible? How can he be so fast? Oh My God!”<br/><br/>“This… this…”<br/><br/>At this moment, all the experts in the mechanically ascended universe finally reacted.<br/><br/>Only then did they sense that Wang Xian had already arrived at the center of them.<br/><br/>This made them extremely shocked!<br/><br/>Their attacks were completely useless against this terrifying existence!<br/><br/>“A bunch of people who are courting death. It seems that there’s no need for your mechanically ascended universe to exist anymore!”<br/><br/>Wang Xian swept his gaze across them and waved his arm!<br/><br/>Following that, a wave of chaotic energy that was filled with destruction attacked the surrounding experts who had ascended to the universe.<br/><br/>At the same time, he extended his hand and grabbed. More than 100 Phantoms slowly condensed in front of him!<br/><br/>Boom<br/><br/>“Ahhhh!”<br/><br/>“No, no, no!”<br/><br/>At this moment, screams of pain could be heard.<br/><br/>Wang Xian’s attack was like a silent force of chaos, washing over everyone’s bodies.<br/><br/>Faced with such a terrifying attack, their faces were filled with horror and despair!<br/><br/>More than 100 strong people in the Heaven’s origin blessed realm started to die in large numbers in the face of this attack!<br/><br/>“Let’s work together to block it!”<br/><br/>“Run, run, run!”<br/><br/>Among them, the Great Dao realm experts were defending themselves in horror.<br/><br/>They quickly flew together to form a defensive barrier!<br/><br/>Even so, the metal on their bodies started to crumble.<br/><br/>Fortunately, they were able to block this terrifying attack.<br/><br/>However, at this moment, these strong cultivators who had ascended to the universe saw many illusory figures floating in front of Wang Xian.<br/><br/>Among these phantoms, there were them!<br/><br/>“This… this is clearly the ability of our cursed demonic spirits.”<br/><br/>“This is clearly the cursed ability of our cursed demonic spirits. Could it be that this lord is a powerhouse of our cursed demonic spirits?”<br/><br/>At this moment, suddenly, at a location in the distance.<br/><br/>At the cursed demonic spirits’location, some of the cursed demonic spirits looked at Wang Xian’s familiar attack method and saw the phantoms. They felt that it was very familiar.<br/><br/>“No, no, it’s not that.”<br/><br/>In the middle, the leader of the cursed spirits widened his eyes. He looked at the powerhouse beside him and said, “It’s this lord. He was the one who destroyed all of you back then. I was lucky back then and wasn’t killed by such a Lord!”<br/><br/>The leader of the cursed spirits had already recognized Wang Xian.<br/><br/>He clearly remembered that this mysterious existence at that time had even asked him what kind of energy was in his body.<br/><br/>He had even asked about the attack methods of this race!<br/><br/>At that time, he did not hide anything and directly said it out.<br/><br/>The result?<br/><br/>In the end, this lord actually controlled the exclusive ability of the cursed demonic spirit race?<br/><br/>Moreover, it seemed to be even more powerful and terrifying than them!<br/><br/>At the side, that person had a bitter expression on his face.<br/><br/>He naturally recognized Wang Xian.<br/><br/>His ultimate treasure of Tianyuan was snatched away by this lord!<br/><br/>The current him was only at the control level and was extremely miserable!<br/><br/>“What?”<br/><br/>“No Wonder I felt that this lord’s attack was very familiar. So it’s the ability of the cursed demonic spirit clan?”<br/><br/>“If it’s not a creature of the cursed demonic spirit clan, why would it use such a terrifying ability!”<br/><br/>“He’s too powerful. This mysterious expert is simply too powerful. More than a hundred heaven origin creation realm experts surrounded him and killed half of them. is such an existence at the primal Chaos Realm?”<br/><br/>All the heaven origin creation realm experts from the Giant Beast Alliance were stunned!<br/><br/>Even the four primal chaos realm experts felt a chill run down their spines!<br/><br/>This mysterious expert that suddenly appeared was too powerful.<br/><br/>They even suspected that the four of them weren’t his match.<br/><br/>“Is this an existence above the primal chaos level?”<br/><br/>A Primal Chaos Expert from the Beast Alliance universe couldn’t help but ask!<br/><br/>The other three didn’t answer!<br/><br/>Because they were still a long way from reaching the primal chaos level!<br/><br/>“We’ve been cursed by them as well. Not Good, not good!”<br/><br/>The group of experts saw their phantoms appear in front of that terrifying figure.<br/><br/>They were extremely shocked!<br/><br/>What should they do?<br/><br/>What should they do?<br/><br/>“Lord Divine Spring, Lord Three Gods, Save Us, Save Our Lord Mechanical God!”<br/><br/>A Great Dao expert looked at the two primal chaos realm experts from the Spirit Path universe and the three-three universe.<br/><br/>This was their last lifeline!<br/><br/>“No one can save you. If anyone saves you, I will destroy them!”<br/><br/>When Wang Xian heard his words, his gaze swept across the surroundings!<br/><br/>Faced with Wang Xian’s gaze, even the two chaos-level masters, Shen Quan and the three gods, were shocked.<br/><br/>The strength that Wang Xian displayed was too powerful and terrifying!<br/><br/>Even if they were to join forces, they didn’t have the slightest confidence!<br/><br/>They looked at each other and didn’t say a word!<br/><br/>“Bang!”<br/><br/>At this moment, Wang Xian crushed the Phantom in front of him again!<br/><br/>In less than a second, the phantom condensed again and he crushed it again!<br/><br/>Every time he crushed it, the mechanical ascension to the universe, the divine spring and the three gods would receive the signal of the Mechanical God for help.<br/><br/>In the end, he would even pray for them to save him!<br/><br/>However, the powerhouses of the Mechanical God’s ascension to the universe could not protect themselves now.<br/><br/>How would the two chaos powerhouses from the godly power universe and the three-three universe dare to make a move after Wang Xian said that?<br/><br/>Furthermore, even if they made a move, the ones who would die would be themselves!<br/><br/>“Bang!”<br/><br/>“Bang!”<br/><br/>The Mechanical God’s Phantoms were crushed one by one.<br/><br/>In a short period of time, there were already more than a hundred of them!<br/><br/>“I’ve already killed 152 of them and they can still be resurrected.”<br/><br/>Wang Xian shook his head. “However, let me see how many times you can be resurrected.”<br/><br/>As he spoke, he waved his arm this time and all the Phantoms in front of him started to crumble.<br/><br/>All the powerful beings in the surrounding area who had ascended into the universe felt a great terror descend!\t\t\t\t\t\t</div>", "images": {}, "success": true}