{"id": 1504, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075861.html", "title": "Chapter 4507 - Chapter 4507: 4506 Seconds Of Chaos!", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4507 - Chapter 4507: 4506 Seconds Of Chaos!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4507: 4506 seconds of Chaos!<br/><br/>Wang Xian suddenly appeared above the Nine Heavens Divine Roc with Wu Tongming.<br/><br/>This shocked everyone.<br/><br/>Just now, Wu Tongming entered the Nine Heavens Divine Roc and shocked many people.<br/><br/>Now, he suddenly appeared with a young man beside him. This shocked many powerhouses!<br/><br/>“Tongming, what happened?”<br/><br/>Wu Tongming’s grandfather immediately asked when he sensed him!<br/><br/>Just a moment ago, when he saw his grandson enter the inner area of the Nine Heavens Divine Roc, he was extremely excited.<br/><br/>Now, he had suddenly appeared again, and his face was filled with astonishment.<br/><br/>What exactly was going on?<br/><br/>“What’s going on? Wu Tongming just entered the inner area of the Nine Heavens Divine Roc. Why did he come out now?”<br/><br/>“What on Earth happened? Also, who is that expert beside Wu Tongming? Why is he together with Wu Tongming?”<br/><br/>“I don’t know. Strange, it’s really strange. This Wu Tongming’s body is full of mystery!”<br/><br/>In the surrounding area, all the experts were filled with surprise and couldn’t help but talk.<br/><br/>“Boom!”<br/><br/>At this moment, over at the Behemoth Alliance.<br/><br/>The few powerhouses didn’t care so much.<br/><br/>Wu Tongming was a powerhouse from the ten-day federation, so he was their enemy.<br/><br/>The two dao-level powerhouses who were closest to him instantly attacked Wang Xian and Wu Tongming.<br/><br/>The terrifying energy completely covered them!<br/><br/>Wang Xian didn’t even look at the energy that was attacking them.<br/><br/>With a thought, he used his time domain to envelop the surroundings.<br/><br/>He waved his arm!<br/><br/>Boom<br/><br/>Boom<br/><br/>In the next instant, the two great dao level powerhouses who were attacking them were instantly sent flying backward!<br/><br/>Their life force was instantly wiped out.<br/><br/>They did not even let out a scream!<br/><br/>“What?”<br/><br/>“How is this possible?”<br/><br/>“This? This? This? This is a powerhouse at the chaos level. This is a powerhouse at the chaos level!”<br/><br/>Wang Xian made his move with ease. The two powerhouses at the level of Great Dao in the Behemoth Alliance were instantly killed.<br/><br/>At this moment, the powerhouses at the Behemoth Alliance were stunned.<br/><br/>They looked at everything in front of them in disbelief. They were filled with astonishment!<br/><br/>He killed two powerhouses at the level of Great Dao with a casual attack?<br/><br/>Most importantly, there was an existence at the level of Great Dao. He was not an ordinary existence at the level of Great Dao.<br/><br/>It was comparable to two experts at the Great Dao level!<br/><br/>An existence at the primal chaos level.<br/><br/>That youth was 100% a primal chaos level existence.<br/><br/>“The Ten Day Federation Alliance still has an existence at the primal chaos level!”<br/><br/>In the surrounding area, a group of experts from the Giant Beast Alliance cried out involuntarily. Their faces were filled with shock.<br/><br/>“Shit!”<br/><br/>“Damn it, when did your ten day Federation alliance have another existence at the primal chaos level?”<br/><br/>In the sky, the four chaos-level existences from the Behemoth Alliance sensed this scene. Their expressions changed drastically and they couldn’t help but shout out loud!<br/><br/>“Eh? It’s him, it’s him, it’s him!”<br/><br/>At this moment, at the Behemoth Alliance, the leader of the cursed devil spirit stared at Wang Xian with his eyes wide open. His face was filled with fear.<br/><br/>He recognized Wang Xian.<br/><br/>“What?”<br/><br/>At the ten-day federation, when the experts saw this scene, their pupils constricted slightly.<br/><br/>Their faces were also filled with shock.<br/><br/>Their 10-day Federation Federation was hiding a primal chaos existence?<br/><br/>This? ? ?<br/><br/>The experts of the 10-day federation were also dumbfounded!<br/><br/>Not only them, even the automaton God, the primal chaos existence from the Spirit Cosmos, and the primal chaos experts from the 33 universes were also dumbfounded!<br/><br/>What was going on?<br/><br/>However, at this moment, the automaton God had a bad premonition.<br/><br/>Just now, one of his avatars had disappeared.<br/><br/>And now, he saw that the expert standing beside Wu Tongming was staring at him!<br/><br/>“Grandfather, this… This is my master. Just now, when I entered the Nine Heavens Divine Roc, I was attacked by the Mechanical God.”<br/><br/>“If not for my master taking action and helping me get rid of him, I would be finished now!”<br/><br/>Wu Tongming looked at his grandfather and hesitated for a moment. He gritted his teeth and said.<br/><br/>In any case, he had already repaid his master’s favor.<br/><br/>Furthermore, that damned mechanical God really wanted to kill him!<br/><br/>He had his master as a backer, and their spirit universe had primal chaos existences. who was afraid of Who?<br/><br/>“Wu Tongming, don’t speak nonsense!”<br/><br/>Before the god of machinery could speak, the machine flew into the universe. A great dao-level powerhouse shouted at him with a cold face!<br/><br/>“God of machinery, you want to kill my disciple, Hehe!”<br/><br/>Wang Xian glanced at the great dao-level powerhouse and looked at the god of machinery. He raised the metal ball in his hand!<br/><br/>“My friend, Don’t talk nonsense. Why would I kill a powerhouse from the Ten Suns Federation?”<br/><br/>The god of Machinery’s gigantic mechanical body spoke as his eyes sparkled!<br/><br/>“I don’t need to explain anything to a dead person. You should know whether you have made a move or not.”<br/><br/>“If you want to kill my disciple, you will have to die!”<br/><br/>Wang Xian stared at him calmly. With a slight movement of his palm, the virtual image of the god of machinery appeared in front of him!<br/><br/>“Huh?”<br/><br/>When the god of machinery heard Wang Xian’s extremely powerful words, his eyes narrowed slightly. His expression was a little unsightly.<br/><br/>“What? What’s going on?”<br/><br/>“I don’t know either. is that Lord of Chaos Level Wu Tongming’s master? Did Wu Tongming just say that the god of machinery attacked him? And now, Wu Tongming’s master wants to kill the god of Machinery?”<br/><br/>“Oh my God, what… What is going on? What is going on?”<br/><br/>Around them, a group of experts from the Ten Suns Federation watched this scene in shock.<br/><br/>This chaotic existence had suddenly appeared.<br/><br/>Not only did he not help them, he even said that he wanted to kill the god of machinery?<br/><br/>What was going on?<br/><br/>The Giant Beast Alliance was also watching this scene in astonishment. They stopped their attacks.<br/><br/>Everyone’s gaze was focused on Wang Xian!<br/><br/>“My friend, although you are also an existence at the chaos level, your tone is too arrogant, right?”<br/><br/>The god of machinery said coldly in displeasure!<br/><br/>Crack<br/><br/>Wang Xian ignored him. He stretched out his hand and pinched the virtual image of the god of machinery in front of him!<br/><br/>The virtual image of the god of machinery immediately made cracking sounds.<br/><br/>“Hiss!”<br/><br/>At this moment, terrifying cracks suddenly appeared on the mechanical god’s huge, sturdy, and terrifying body!<br/><br/>His expression changed drastically as he stared at Wang Xian in disbelief!<br/><br/>“Bang!”<br/><br/>In the next moment, Wang Xian continued to exert force with his palm. The Mechanical God’s phantom arm directly collapsed!<br/><br/>“Bang!”<br/><br/>At the same time, the mechanical God’s arm in front of him also collapsed!<br/><br/>“No, what kind of attack is this? Stop!”<br/><br/>At that moment, the mechanical god’s expression changed drastically, filled with shock!<br/><br/>This attack was somewhat familiar.<br/><br/>However, as a chaos-level existence, how could he sense destruction?<br/><br/>Why was there a danger of annihilation?<br/><br/>Why couldn’t he block it?\t\t\t\t\t\t</div>", "images": {}, "success": true}