{"id": 1511, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075896.html", "title": "Chapter 4514 - Chapter 4514: 4513 Harvest! In", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4514 - Chapter 4514: 4513 Harvest! In</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4514: 4513 harvest! In<br/><br/>10 days in the Federation!<br/><br/>In the Mechanical Ascension Universe!<br/><br/>All the powerful disciples of the Mechanical Ascension Universe had their faith completely collapsed when they received this news.<br/><br/>They were completely terrified!<br/><br/>The Mechanical God was the strongest scientist in their mechanical ascension universe.<br/><br/>It was the faith in the hearts of all the disciples of the Mechanical Ascension Universe.<br/><br/>It was an invincible existence.<br/><br/>But now, their Machine Ascension Universe, the Machine God, had been completely killed.<br/><br/>More than 100 Great Beings were suffering from a terrifying curse and were dying.<br/><br/>This made them panic.<br/><br/>They were terrified!<br/><br/>Countless great beings in the Machine Ascension universe looked at all kinds of information in a daze.<br/><br/>What kind of enemy could actually destroy their entire machine Ascension Universe?<br/><br/>“How did this happen? How did this happen?”<br/><br/>“No, no, no, I don’t believe it. Our Mechanical Ascension Universe is an invincible existence. Our God of machinery will not die, he won’t!”<br/><br/>They were at the center of the Mechanical Ascension Universe!<br/><br/>Wang Xian was at the location of their teleportation formation. All of a sudden, crazy voices came from around them!<br/><br/>They didn’t want to believe everything!<br/><br/>They didn’t want to accept everything!<br/><br/>“Buzz Buzz Buzz!”<br/><br/>“Buzz Buzz Buzz!”<br/><br/>At this moment, there were mechanical ascenders of the heaven origin destiny level flying toward the location of the teleportation formation.<br/><br/>After receiving more information, they wanted to escape as fast as possible.<br/><br/>Yes, escape!<br/><br/>Their mechanical ascendance to the universe had offended an invincible powerhouse.<br/><br/>They had offended a powerhouse above the chaos.<br/><br/>And this powerhouse was prepared to completely destroy them!<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom<br/><br/>However, when they had just flown over, an extremely terrifying force attacked them!<br/><br/>“Not good, that powerhouse is already here!”<br/><br/>“We’re done for, we’re done for!”<br/><br/>In an instant, the few powerhouses who were preparing to escape the mechanical ascension to the universe looked ahead in horror. Their faces were filled with despair.<br/><br/>How were they supposed to fight against existences above chaos?<br/><br/>Death was coming!<br/><br/>After killing these experts who were trying to escape, Wang Xian turned around and headed to the Dragon Palace.<br/><br/>With a wave of his arm, he set up a demonic altar in front of him!<br/><br/>Following that, he left a clone here. In the next moment, he returned to the Dragon Palace!<br/><br/>“All the experts in the heaven origin blessed realm of the Dragon Palace, come here!”<br/><br/>After returning to the Dragon Palace, Wang Xian shouted softly.<br/><br/>“It’s the Dragon King!”<br/><br/>“It’s the Dragon King!”<br/><br/>In the next moment, all kinds of responses were heard!<br/><br/>One by one, the powerhouses in the Heavenly Yuan Kismet Realm from the Dragon Palace teleported over!<br/><br/>Currently, the number of powerhouses in the Heavenly Yuan Kismet Realm in the Dragon Palace was 100.<br/><br/>In the past few million years, due to the fact that all the slots for the Heavenly Yuan Kismet Realm in the Dragon Palace had been used up, no disciples had made any breakthroughs.<br/><br/>“Dragon King, what are your orders?”<br/><br/>Prime Minister Gui also rushed over quickly! ”…”he cupped his hands and asked!<br/><br/>“Hehe, it’s nothing serious. We destroyed a powerful universe and went there to receive their resources!”<br/><br/>Wang Xian looked at them and said!<br/><br/>“I won’t wait for the other powerhouses. I’ll Bring You There First!”<br/><br/>As he spoke, a wave of energy enveloped them.<br/><br/>The next moment, they arrived at the center of the Mechanical Ascension Universe!<br/><br/>Wu Tongming, who was at the side, was astonished when he saw his master bringing more than 80 heaven origin powerhouses over.<br/><br/>He also knew that his master had his own power!<br/><br/>“This universe is called the Mechanical Ascension Universe. It’s a universe dominated by technology. It receives all the treasures here, including powerful battleships and weapons!”<br/><br/>Wang Xian ordered Prime Minister Gui and the rest, “In addition, there should be some powerhouses in the Heaven’s origin realm in this universe. Inform me immediately after you discover them!”<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui and the rest replied immediately!<br/><br/>“Okay!”<br/><br/>Wang Xian nodded. “Spread out!”<br/><br/>As he spoke, he flew forward!<br/><br/>This was the center of the Robotic Ascension Universe. It was also the place where their defense and weapons were the strongest.<br/><br/>He could sense that there were many powerful and terrifying weapons here. They were sufficient to kill ordinary great dao experts.<br/><br/>Wang Xian needed to destroy all these weapons and take over!<br/><br/>Wang Xian flew over and continued to curse the experts of the robotic ascension universe while taking over these powerful weapons!<br/><br/>“Move out!”<br/><br/>At this moment, Prime Minister Gui looked at the experts of the Dragon Palace and immediately took action!<br/><br/>“Roar Roar Roar!”<br/><br/>“Roar Roar Roar!”<br/><br/>The roars of dragons sounded in the mechanical ascension universe.<br/><br/>On this day, all the experts of the Mechanical Ascension universe saw terrifying divine dragons heading towards the armory and treasure grounds of their Mechanical Ascension Universe!<br/><br/>These disciples that had ascended to the universe had no way of resisting the experts from the Dragon Palace.<br/><br/>As for the experts that were still alive in the universe, they fled in fear.<br/><br/>They wanted to escape as far as possible.<br/><br/>If they continued to stay in their universe, only death awaited them!<br/><br/>“That mysterious senior is taking over the entire Mechanical Ascension Universe!”<br/><br/>At this moment, the powerhouses from the godly power universe and the three-three universe rushed over. They muttered to themselves as they watched the scene of the mechanical ascension universe from afar.<br/><br/>They did not go over.<br/><br/>This was not something they could participate in!<br/><br/>Next, they had to make preparations. The 10-day Federation alliance had one less important force to deal with!<br/><br/>The mechanical ascension universe was extremely prosperous. The treasures and resources inside were completely beyond Wang Xian’s imagination!<br/><br/>There were all kinds of large battleships and powerful weapons. There were countless of them.<br/><br/>In addition, there were also all kinds of metals that were unbelievably abundant!<br/><br/>Wang Xian did not completely destroy these weapons. Instead, he made them ineffective!<br/><br/>Furthermore, he used his divination ability to start searching for the Heaven’s origin destiny realm powerhouses who had the Mechanical Ascension Universe.<br/><br/>He began to obtain the technological power of the mechanical ascension to the universe.<br/><br/>At present, with Wang Xian’s strength, he could easily divine the powers of divination, be it those at the control level or those at the Great Dao level.<br/><br/>Even for those at the chaos level, Wang Xian could perform divination without much of a problem!<br/><br/>In addition, with the extremely powerful teleportation ability of an lie.<br/><br/>This made it very easy for him to hunt down the experts who could ascend to the universe.<br/><br/>Wang Xian even did a simulation. If he wanted to travel from one side of the universe to the other side, he would need less than a year!<br/><br/>One year was already a very short period of time!<br/><br/>Along with time, a large number of treasures and resources were kept by Wang Xian.<br/><br/>At this moment, he also made a statement at the AI of the mechanical ascension to the universe!<br/><br/>All the powerhouses in the mechanical ascension to the universe who were in the heaven origin blessed realm were eliminated!<br/><br/>Those who were below the heaven origin blessed realm could survive if they handed over all their treasures and resources!\t\t\t\t\t\t</div>", "images": {}, "success": true}