{"id": 1513, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075906.html", "title": "Chapter 4516 - Chapter 4516: 4515 Chaos Metal Life Form!", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4516 - Chapter 4516: 4515 Chaos Metal Life Form!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4516: 4515 chaos metal life form!<br/><br/>What shocked Wang Xian was that the metal in this storage space possessed life!<br/><br/>At this moment, this life form was contained in a specially made box!<br/><br/>However, Wang Xian could sense that the metal in this box possessed vitality.<br/><br/>Furthermore, it possessed the strength of a ruler at the peak of the realm.<br/><br/>Wang Xian took it out, opened the box, and sized it up carefully!<br/><br/>He was certain that this was a type of metal. However, he was also certain that this metal possessed life!<br/><br/>It was a very special life form!<br/><br/>At this moment, the box was opened. This life form was emitting a wave of fear.<br/><br/>The metal life form didn’t have eyes. It looked like an ordinary piece of metal, but it possessed a special perception!<br/><br/>Wang Xian placed his palm on it and analyzed the characteristics of this piece of life metal!<br/><br/>Soon, he noticed the uniqueness of this piece of life metal.<br/><br/>The hardness of this piece of life metal was extremely terrifying.<br/><br/>It was so terrifying that it was comparable to an ultimate treasure of the Heaven’s origin.<br/><br/>In other words, to destroy it, one needed the strength of a Great Dao.<br/><br/>On the other hand, this piece of metal possessed the ability to evolve.<br/><br/>As for how far it could evolve, Wang Xian didn’t know!<br/><br/>“This life metal is very special. It shouldn’t be born in the universe, but in the Chaos!”<br/><br/>Wang Xian looked at this metal life form and said!<br/><br/>“It should be. It’s very difficult for such a special life form to be born in the universe. Dragon King, this metal life form is somewhat similar to the giant BEAST OF CHAOS!”<br/><br/>Prime Minister Gui said!<br/><br/>“It’s similar. Is this the only metallic life form?”<br/><br/>Wang Xian asked them.<br/><br/>“Dragon King, this is the only one. This metallic life form was placed in the most secret place by the god of machinery. It was placed together with other precious treasures!”<br/><br/>Prime Minister Gui replied!<br/><br/>“Yes!”<br/><br/>Wang Xian nodded. As he looked at this metallic life form, his eyes flickered.<br/><br/>For this metallic lifeform, Wang Xian could activate his intelligence and activate his intelligence.<br/><br/>In addition, he could use the power of chaos to try and create this metallic lifeform!<br/><br/>Chaos creates everything.<br/><br/>Wang Xian could now create any bloodline or any living being!<br/><br/>This included creating a gigantic beast of chaos.<br/><br/>However, a gigantic beast of chaos was born with the strength of someone who had just entered the Heaven’s origin realm. If Wang Xian created one, the power of chaos in his body would be much less!<br/><br/>His own strength would also be reduced by a lot.<br/><br/>However, this metal life form was different.<br/><br/>A hundred metal life forms at the peak of the ruler realm would consume about the same amount of resources as one who had just entered the Heaven’s origin realm!<br/><br/>Wang Xian could create a hundred of these metal life forms and allow them to devour metal to evolve!<br/><br/>Chaotic life forms such as giant beasts of chaos.<br/><br/>Their sudden actions did not require a quota for the Heaven’s origin creation realm!<br/><br/>Just like the disciples of the Dragon Palace, if they wanted to break through to the Heaven’s origin creation realm, they needed a quota for their breakthrough!<br/><br/>This time, Wang Xian managed to obtain 230 quotas from the mechanical ascension to the universe. However, this quota would eventually be used up.<br/><br/>The metallic lifeforms were different. They did not need a quota for their breakthrough.<br/><br/>In addition, their breakthrough would be much easier than the disciples of the Dragon Palace.<br/><br/>The only thing was that Wang Xian didn’t know how much metal they would need to devour for their breakthrough!<br/><br/>However, Wang Xian could conduct an experiment.<br/><br/>Right now, he didn’t have much. He just had a lot of different types of metal!<br/><br/>There were all kinds of powerful battleships, spaceships, mechs, and the like.<br/><br/>Although these technological weapons could be used directly, the cost-effectiveness ratio of technological weapons wasn’t high!<br/><br/>Just like a battleship that could unleash the power of the Heaven’s origin creation realm, it was naturally not as good as a heaven’s origin creation realm powerhouse.<br/><br/>Especially when it came to mobility!<br/><br/>“Let’s give it a try!”<br/><br/>Wang Xian thought to himself as he kept the metallic lifeform.<br/><br/>“I still have nine Heaven’s origin creation treasures here. When the time comes, I will distribute them to the disciples of the Dragon Palace!”<br/><br/>He took out all the ultimate treasures of the Heaven’s origin that he had obtained in this area and gave them to Prime Minister Gui so that he could distribute them!<br/><br/>Wang Xian was not interested in such ultimate treasures of the Heaven’s origin!<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui replied immediately.<br/><br/>“Master!”<br/><br/>At this moment, Wu Tongming flew over and shouted at Wang Xian!<br/><br/>“HMM?”<br/><br/>Wang Xian looked at him, he smiled and said, “Tongming, you’re here. It’s perfect. I was just about to look for you. This is all the scientific and technological information regarding the mechanical ascension universe. I’ll leave it to you. I’ll take the quota for the Heaven’s origin blessed realm in this universe. The rest will be taken over by your supernatural universe. Leave some space for me in the Sea of Life!”<br/><br/>In the Sea of life of the ten-day federation, the water element disciples were cultivating in it. It was comparable to the best grotto-heaven paradise.<br/><br/>This Dragon Palace could be used.<br/><br/>As for the rest, he only wanted the quota of the Tianyuan blessed land. He didn’t need anything else!<br/><br/>“Thank you, Master!”<br/><br/>Wu Tongming’s eyes lit up. He quickly thanked him, “Oh right, master, the ancestors of our spirit path universe and the three three universes would like to pay you a visit. Also, we would like to give you some gifts!”<br/><br/>“Sure.”<br/><br/>Wang Xian nodded. As Wu Tongming’s master, it was normal for him to greet his family and the experts from his faction.<br/><br/>Furthermore, the other party was not weak. In the future, he might be able to get the experts from the Dragon Palace to communicate with the experts here.<br/><br/>This was not impossible.<br/><br/>Now, Wang Xian had mastered the technology of black hole teleportation!<br/><br/>He could also create ultra-long-distance teleportation!<br/><br/>Now, black hole teleportation could be done from the Dragon Palace to the Justice Alliance. All it needed was a transit!<br/><br/>It was much faster and more convenient than what they had agreed on previously!<br/><br/>“Master, when are you free?”<br/><br/>Wu Tongming asked, “Our ancestor can do it anytime!”<br/><br/>“Then let’s do it now.”<br/><br/>Wang Xian said.<br/><br/>The situation in the mechanical ascension universe had been taken care of!<br/><br/>“Yes, Master. I’ll inform our ancestor immediately!”<br/><br/>Wu Tongming nodded.<br/><br/>“Master, follow me. Let’s go to the palace in the Sea of life of our ten-day federation.”<br/><br/>Not long after, Wu Tongming said to him.<br/><br/>Wang Xian nodded. They came to the teleportation formation and entered the Sea of life.<br/><br/>Following that, they flew towards the center.<br/><br/>At the very center, there was a palace that was emitting light!<br/><br/>Wang Xian swept his gaze over and was a little surprised. The entire palace was an ultimate treasure of the Heaven’s origin!<br/><br/>This was an extremely special ultimate treasure of the Heaven’s origin!<br/><br/>“Welcome, Dragon King!”<br/><br/>“Welcome, Dragon King!”<br/><br/>When Wang Xian arrived at the front of the palace, the chaos-level powerhouses from the divine universe and the three three universes led a group of great dao-level existences and greeted him respectfully.<br/><br/>“Hehe, you are too polite.”<br/><br/>Wang Xian smiled and nodded at them.<br/><br/>“Please come in, Dragon King!”<br/><br/>The chaos-level powerhouse from the Divine Universe, divine spring, greeted him respectfully!\t\t\t\t\t\t</div>", "images": {}, "success": true}