{"id": 1516, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075921.html", "title": "Chapter 4519 - Chapter 4519: 4518 Black Hole Teleportation Array Technology", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4519 - Chapter 4519: 4518 Black Hole Teleportation Array Technology</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4519: 4518 black hole teleportation array technology<br/><br/>“This? ? Our Lord Dragon King has reconstructed the Dragon Palace. Why do I feel that every palace contains an extremely terrifying power and energy?”<br/><br/>“Why do I feel that every palace is comparable to a Heavenly Yuan Destiny Supreme Treasure? My God, Our Lord Dragon King, how powerful are we now? What Treasure has the Lord Dragon King obtained?”<br/><br/>“These palaces are so big and terrifying. Are we going to live in these palaces in the future?”<br/><br/>In the sky above the Dragon Palace, more than eight million disciples of the Dragon Palace looked at this extremely powerful palace and looked at the completely new palace that was emitting a terrifying energy. Their faces were filled with shock.<br/><br/>This was especially so for the Heavenly Yuan creation powerhouses of the Dragon Palace.<br/><br/>They knew that the Dragon King was very strong and had even destroyed a force that had a primal chaos realm existence.<br/><br/>But they had never thought that the Dragon King would actually create such a powerful palace.<br/><br/>That’s right!<br/><br/>These palaces had dragon patterns on them and a divine dragon statue.<br/><br/>And they were divided into nine attributes!<br/><br/>This was obviously something that their Lord Dragon King had created himself.<br/><br/>Each one of them was comparable to a heavenly yuan destiny supreme treasure, and this made them extremely shocked.<br/><br/>Their Lord Dragon King’s strength was even stronger than they had imagined.<br/><br/>He was even more powerful!<br/><br/>This also made them respect and respect the Dragon King even more!<br/><br/>“Little Xian, did you create all these?”<br/><br/>At this moment, Guan Shuqing and the other Dragon Queens looked at the drastically changed Dragon Palace and flew to Wang Xian. Their eyes sparkled as they asked.<br/><br/>“How is it? Not Bad, right?”<br/><br/>Wang Xian looked at them. The group of girls were already giving birth to dragon children.<br/><br/>Of course, this was because they had already broken through to the Heaven’s origin realm. Although they had been pregnant for a long time, their actions and bellies did not show that they were pregnant.<br/><br/>After all, they had already reached this realm. Being pregnant was nothing!<br/><br/>“I have specially built a bunch of sleeping chambers for you guys and a place for our future children to rest and Play!”<br/><br/>Wang Xian smiled at them and continued, “Let’s go, I’ll bring all of you to take a look!”<br/><br/>“Alright!”<br/><br/>The group of girls were also filled with joy as they flew towards the new Dragon Palace!<br/><br/>“Prime Minister Gui, let the disciples take a look at the new Dragon Palace!”<br/><br/>Wang Xian said to Prime Minister Gui.<br/><br/>All the members of the Dragon Palace flew down excitedly.<br/><br/>Wang Xian accompanied a group of excited girls to look at their ‘new home’before spending some time with them.<br/><br/>Following that, he continued to absorb the battleship mechs.<br/><br/>The cost of upgrading the Dragon Palace was equivalent to his absorption of 20 million years.<br/><br/>Currently, half of the resources obtained from the mechanical ascension to the universe had been used up.<br/><br/>In addition to the resources left for the disciples of the Dragon Palace to cultivate and the 50 chaotic metallic lifeforms, there was still about two-tenths left.<br/><br/>After absorbing the two-tenths of it, Wang Xian’s realm was equivalent to seven existences of the chaotic realm.<br/><br/>His actual combat strength was much stronger.<br/><br/>However, when Wang Xian was about to absorb it, something interrupted his plan.<br/><br/>“Dragon King, the Justice Union has already prepared the resources. They are asking if we can immediately set up a long-distance teleportation formation here.”<br/><br/>Prime Minister Gui came to the Dragon King’s palace and reported to Wang Xian!<br/><br/>“About the long-distance teleportation formation? Where are the people from the Justice Union?”<br/><br/>Wang Xian raised his eyebrows and asked.<br/><br/>“Dragon King, the person in charge of the Justice Union is Elder Song Ta. He is currently at the land of origin.”<br/><br/>Prime Minister Gui replied!<br/><br/>“Let me make a trip there.”<br/><br/>Wang Xian said.<br/><br/>The matter of the Justice Union and the Dragon Palace Alliance building a teleportation formation had already been discussed!<br/><br/>However, there was no longer a need to build a long-distance teleportation formation now.<br/><br/>To connect the Justice Union and the land of origin, a few hundred long-distance teleportation formations were required.<br/><br/>Wang Xian only needed to create two black hole teleportation formations to connect the Justice Union and the land of origin.<br/><br/>The resources required to create two black hole teleportation formations were much less than building a long-distance teleportation formation!<br/><br/>Most importantly, Wang Xian was able to complete it quickly.<br/><br/>“Dragon King, I’m coming with you!”<br/><br/>Prime Minister Gui followed Wang Xian to the land of origin.<br/><br/>As all the universes around the land of Origin had joined the Dragon Palace Alliance, the land of Origin became more and more bustling.<br/><br/>In the past, there were only powerhouses in the Heaven’s origin realm. Now, there were many disciples in the ruler realm!<br/><br/>Wang Xian came out from the Dragon Palace Alliance’s Lair and immediately sensed song Ta’s location.<br/><br/>With a thought, he teleported over with Prime Minister Gui!<br/><br/>“HMM?”<br/><br/>When Wang Xian arrived at the front of Song Ta’s palace.<br/><br/>Wang Xian did not hide his aura. Song ta also sensed it immediately!<br/><br/>“Brother Dragon King, please come in!”<br/><br/>Song ta immediately came out and greeted him with a smile!<br/><br/>“Brother Song Ta.”<br/><br/>Wang Xian smiled and entered the palace!<br/><br/>“Dragon King, the long-distance teleportation formation has been prepared by the Justice Alliance!”<br/><br/>Song ta said with a smile.<br/><br/>“I’m here for this matter as well. Not long ago, due to an unexpected situation, I passed through a black hole to another chaotic world. That place is very far away from our side, but there is a powerful teleportation formation called the black hole teleportation!”<br/><br/>“If we build a black hole teleportation formation, we only need to build two black hole teleportation formations from the land of origin to the Justice Union. As for the cost, it’s about the same as the long-distance teleportation formation we built!”<br/><br/>“However, in terms of convenience, a black hole teleportation formation is much more convenient!”<br/><br/>Wang Xian spoke to him.<br/><br/>“There’s such a Thing?”<br/><br/>Song Ta was slightly taken aback as a look of shock appeared on his face.<br/><br/>“Yes, I have obtained the method of the black hole teleportation formation. Next, I will build this black hole teleportation formation.”<br/><br/>Wang Xian spoke.<br/><br/>“Dragon King, that would be great. I didn’t expect you to have such a fortuitous encounter. Can you help us build this teleportation formation? Of course, we are willing to pay a sufficient amount!”<br/><br/>Song Ta couldn’t help but ask.<br/><br/>No one knew how big the chaotic world was.<br/><br/>Even the powerful Justice Alliance could only explore the surrounding thousands of universes.<br/><br/>As for any place further away, there would be no experts to explore.<br/><br/>The main reason was that it was too far away.<br/><br/>Even a heaven origin creation realm expert would take hundreds of millions of years to fly over the area that was known to be explored.<br/><br/>If it was too far away, it would be a problem for them to return.<br/><br/>Although there was a treasure that could make them return to a certain place in an instant, if the distance was really too far away, such a treasure might lose its effectiveness.<br/><br/>The direction of the nine-origin universe was considered the latest exploration direction of the Justice Alliance, and it was not too far away.<br/><br/>If there really was such a black hole teleportation array, it would be of great significance to the Justice Alliance!<br/><br/>Song Ta knew that in the opposite direction from the Dragon Palace, there were many universes in a place where Great Dao experts had to fly for tens of millions of years.<br/><br/>They had always wanted to find these universes and bring them to the Justice Alliance.<br/><br/>If there was a black hole teleportation array, there would be hope!\t\t\t\t\t\t</div>", "images": {}, "success": true}