{"id": 1515, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075916.html", "title": "Chapter 4518 - Chapter 4518: 4517 Was Absorbed And Improved", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4518 - Chapter 4518: 4517 Was Absorbed And Improved</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4518: 4517 was absorbed and improved<br/><br/>“Very strong, very strong!”<br/><br/>“Let’s continue!”<br/><br/>Wang Xian smiled as he felt the strength in his body.<br/><br/>Although they were currently in the calamity stage, with the power of the nine-origin universe and the strength of the Dragon Palace, no one dared to be presumptuous in the nine-origin universe even during the calamity stage.<br/><br/>Who Didn’t know the strength of the Dragon Palace Now?<br/><br/>Furthermore, because of the existence of the Dragon Palace, the other peak races in the nine-origin universe had improved a lot.<br/><br/>Right now, the Fallen Shadow Demon Emperor, the Elven empress, and the others all led some disciples to the land of origin to cultivate!<br/><br/>Because of the prestige of the Dragon Palace, no force dared to provoke them.<br/><br/>In addition, after the peak races learned of the strength of the Dragon Palace, they were shocked and joined the Dragon Palace Alliance.<br/><br/>Of course, since they were all creatures from the nine-origin universe, the Dragon Palace naturally did not take their treasures.<br/><br/>The nine-origin universe was very safe. Therefore, the cataclysm did not matter to Wang Xian and the rest!<br/><br/>He was prepared to continue absorbing and improving!<br/><br/>Putting everything aside, his strength had improved. However, he still had to expend a wave of energy.<br/><br/>A round of permanent consumption.<br/><br/>He would use it to upgrade the Dragon Palace.<br/><br/>After all, the Dragon Palace was his base and the place where he would rise up.<br/><br/>As his base, Wang Xian was prepared to strengthen it!<br/><br/>Time passed quickly once again. Thirty million years passed very quickly.<br/><br/>This caused the chaotic energy in the sphere in Wang Xian’s body to be comparable to the area of seventy life planets!<br/><br/>The resources obtained from the Mechanical Ascension universe had also been consumed by 40% .<br/><br/>Wang Xian’s current strength was basically invincible!<br/><br/>At the very least, he had yet to encounter an existence whose strength was stronger than his.<br/><br/>He just didn’t know if there were existences above the chaotic realm in the chaotic realm.<br/><br/>“Next, Let’s upgrade the Dragon Palace.”<br/><br/>After 40 million years, the power of chaos in Wang Xian’s body was terrifying enough. Next, he began to strengthen the Dragon Palace!<br/><br/>Firstly, Wang Xian wanted to modify the entire building of the Dragon Palace.<br/><br/>Although the Dragon Palace was powerful now, it was only limited to defending against ordinary powerhouses in the Heaven’s origin realm.<br/><br/>When powerhouses cultivated to the Heaven’s origin realm, their cultivation method would be the same!<br/><br/>Things like the Kingdom of God were useless.<br/><br/>The Dragon Palace was equivalent to Wang Xian’s Kingdom of God, but it was no longer useful.<br/><br/>Now, Wang Xian was going through a major transformation!<br/><br/>The disciples of the powerhouses in the Dragon Palace had nine attributes. Wang Xian was prepared to build nine palaces.<br/><br/>They were the Golden Dragon Palace, Green Dragon Palace, Water Dragon Palace, and the like.<br/><br/>Each palace was a treasure of the Heaven’s origin blessed realm!<br/><br/>The nine palaces were a combination of offense and defense. When combined, they could unleash a terrifying might.<br/><br/>Other than the nine palaces, there was naturally the Dragon King Palace and the Dragon Empress Palace.<br/><br/>The Dragon King Palace and the Dragon Empress Palace. Wang Xian was prepared to create six ultimate treasures of the Heaven’s origin creation.<br/><br/>One for offense, one for support, and one for defense. The three ultimate treasures of the Heaven’s origin creation were a combination.<br/><br/>This was Wang Xian’s plan and the foundation of the Dragon Palace in the future!<br/><br/>How Strong was the Dragon Palace, which was formed from a total of 15 Ultimate Treasures of the Heaven’s origin creation?<br/><br/>Even if any one of the three gods from the godly spirit universe, spring of God, three universes came over, they would be helpless against the defense and attacks of the Dragon Palace!<br/><br/>After all, 15 Ultimate Treasures of the Heaven’s origin creation was too terrifying!<br/><br/>With this thought in mind, Wang Xian began to create.<br/><br/>It was not that easy to create one ultimate treasure of the Heaven’s origin.<br/><br/>The best way was to imitate it one by one according to the existing ultimate treasures of the Heaven’s origin!<br/><br/>However, Wang Xian did not have any ultimate treasures of the Heaven’s origin that were similar to palaces in his hands.<br/><br/>Fortunately, at the 10-day federation, Wang Xian sensed the ultimate treasure of the Heaven’s origin that was similar to palaces in the federation.<br/><br/>With the technological power that Wang Xian obtained from his mechanical ascension to the universe as the prototype, he began to create.<br/><br/>It took a long time to create a ultimate treasure of the Heaven’s origin creation!<br/><br/>It would take millions of years to complete one properly!<br/><br/>However, with this time domain, it would only take 10,000 years. It was still alright!<br/><br/>After 180,000 years, 15 Ultimate Treasures of the Heaven’s origin creation were created by him.<br/><br/>Apart from these 15 ultimate treasures of the Heaven’s origin, Wang Xian had also created a lot of Dao Enlightenment soil.<br/><br/>The dao enlightenment soil was indeed heaven-defying.<br/><br/>It was not only of great use to cultivators of the Earth attribute.<br/><br/>It was of great use to cultivators of all attributes.<br/><br/>Most importantly, The dao enlightenment soil targeted the existence of the Heaven’s origin realm.<br/><br/>This was a heaven-defying opportunity for the disciples below the Heaven’s origin realm.<br/><br/>It could be predicted that with this dao enlightenment soil, the number of disciples in the Dragon Palace who could break through their shackles would reach an extremely terrifying level!<br/><br/>Just these dao enlightenment soil alone could be compared to the consumption of three treasures of Heaven’s origin realm!<br/><br/>Using the Dao Enlightenment soil to pave the ground beneath the buildings in the Dragon Palace could be said to be extremely extravagant!<br/><br/>After everything was settled, Wang Xian looked at a construction compass in front of him and smiled.<br/><br/>This construction compass contained an extremely terrifying aura.<br/><br/>In fact, once it erupted, it could instantly kill an existence at the level of Great Dao!<br/><br/>“There’s no rush. I’ll create some chaotic metal life forms!”<br/><br/>Wang Xian looked at this construction compass with satisfaction and thought to himself.<br/><br/>Creating chaotic metal life forms was much easier for Wang Xian.<br/><br/>After all, he only created chaotic metal life forms at the ruler realm. The energy consumption was very small!<br/><br/>He casually created 50 of them. Using humans as the prototype, he helped them to gain sentience.<br/><br/>“Prime Minister Gui!”<br/><br/>Wang Xian shouted softly and summoned Prime Minister Gui over!<br/><br/>“Dragon King!”<br/><br/>Soon, Prime Minister Gui arrived and bowed respectfully!<br/><br/>“Send someone to teach these chaotic metal life-forms. Let them begin to devour the metal obtained from the mechanical ascension to the universe.”<br/><br/>Wang Xian instructed, “Also, get all the members of the Dragon Palace to take their belongings and fly to the sky. I want to make some modifications to the Dragon Palace!”<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui replied immediately.<br/><br/>Soon, the strong disciples of the Dragon Palace flew to the Sky One by one.<br/><br/>Their eyes were filled with respect as they looked at where Wang Xian was.<br/><br/>Wang Xian took out the construction compass and waved his arm.<br/><br/>The entire construction compass began to expand. Slowly, it was as big as a planet.<br/><br/>The current core area of the Dragon Palace was almost as big as a Living Planet!<br/><br/>When the compass expanded and covered the building of the Dragon Palace, an extremely vast energy gushed out from the new Dragon Palace!<br/><br/>Majestic!<br/><br/>Majestic!<br/><br/>Terrifying!<br/><br/>In such a sacred building, there was a special energy that made people feel majestic.<br/><br/>The Palace-type Tianyuan creation treasure created by Wang Xian had perfectly replaced the previous Dragon Palace!<br/><br/>One by one, the palaces did not unleash their powers. However, once they encountered a crisis, they would be able to unleash an unparalleled power!<br/><br/>At the same time, all the powerful disciples of the Dragon Palace looked at the Dragon Palace that had undergone a huge change. Each and every one of them had a look of disbelief on their faces.\t\t\t\t\t\t</div>", "images": {}, "success": true}