{"id": 1519, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075936.html", "title": "Chapter 4522 - Chapter 4522: 4521, Annihilate The Dragon Palace Alliance First", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4522 - Chapter 4522: 4521, Annihilate The Dragon Palace Alliance First</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4522: 4521, annihilate the Dragon Palace Alliance first<br/><br/>There were chaos-level powerhouses born in the evil sequence faction. The Justice Alliance did not receive any news.<br/><br/>They did not know anything about the evil sequence faction either.<br/><br/>Time passed slowly.<br/><br/>Wang Xian was still absorbing the resources in the Dragon Palace and converting them into the power of Chaos!<br/><br/>However, the rate of absorption was still a little slow.<br/><br/>At the Justice Union, the construction of the black hole teleportation formation technology had already begun.<br/><br/>Tens of thousands of years later, the first black hole teleportation formation technology had been completed.<br/><br/>From the justice universe to the land of origin, a transit was required.<br/><br/>At present, the first one had been completed, and the last one was next!<br/><br/>“Lord of disaster, we have already investigated the situation at the Dragon Palace Alliance. They are not very strong. Other than the three prophets who have the ability to predict, the rest are not worth worrying about.”<br/><br/>“However, when we were investigating, we discovered something. Currently, the Justice Alliance and the Dragon Palace Alliance are building a teleportation array to better communicate<br/><br/>“According to our investigation, they are currently building a special black hole teleportation array. The teleportation distance is very far, and the strategic value is very high!”<br/><br/>Fifty thousand years later, they were in a universe that was shrouded in darkness.<br/><br/>Four figures sat high on the mountain peaks.<br/><br/>In the huge domain in front of them stood more than ten Great Dao level experts. They bowed their heads respectfully.<br/><br/>One of the figures reported the news!<br/><br/>“Black Hole teleportation array technique? What is this? It can teleport very far away? How far is it exactly?”<br/><br/>The Lord of disaster was located on the mountain peak in the center. He was like a poisonous fog, and he condensed an incomparably huge and ferocious face as he asked.<br/><br/>“My lord, according to our investigation, they only need to build two black hole teleportation arrays to be able to reach the land of origin from the Justice Universe.”<br/><br/>The figure who reported continued to speak!<br/><br/>“What? There’s such a powerful teleportation array?”<br/><br/>“Is the information true?”<br/><br/>The moment he finished speaking, the gaze of the chaos-level expert wearing a bamboo hat and countless tentacles connected to his head focused as he asked!<br/><br/>Now, their evil sequence faction’s expansion had reached a bottleneck.<br/><br/>The nearby universes had gathered together and formed an alliance.<br/><br/>Justice Alliance, Dragon Palace Alliance!<br/><br/>They had originally planned to destroy the universes in the land of Origin during this calamity.<br/><br/>But because of the rise of the Dragon Palace and the birth of a chaos-level powerhouse, they had no choice but to give up this idea.<br/><br/>They could only allow their disciples to fly for millions or even tens of millions of years to search for a new universe and invade it.<br/><br/>However, this was too much of a waste of time.<br/><br/>Spending tens of millions of years to search for a universe, going back and forth, it would be over in a few hundred million years!<br/><br/>And the calamity would only last for around five to eight billion years.<br/><br/>They could not obtain much resources in total.<br/><br/>If they had such a powerful teleportation array, it would be very beneficial to their future plans!<br/><br/>“SIRS, we have confirmed it.”<br/><br/>The subordinate in front answered respectfully!<br/><br/>“We must get the black hole teleportation array technology. We Can’t Let the Justice Alliance and the Dragon Palace Alliance complete their alliance!”<br/><br/>The Lord of Disaster’s eyes were shining as he ordered!<br/><br/>“Lord of disaster, I suggest that we attack the Dragon Palace Alliance. According to the information we have, the Justice Alliance and the Dragon Palace Alliance will only need 50,000 to 60,000 years to open the teleportation array. When that time comes, the Justice Alliance might come to our aid!”<br/><br/>“I suggest that we destroy the Dragon Palace Alliance in a short period of time!”<br/><br/>At this moment, an old man in front of them suggested with a cold expression!<br/><br/>If Wang Xian was here, he would definitely be able to recognize him.<br/><br/>He was from the evil sequence faction, an expert of the Great Dao level, and a spirit kneader.<br/><br/>Ever since they were destroyed by Wang Xian last time, they were filled with hatred towards the Dragon Palace and the entire Dragon Palace Alliance.<br/><br/>However, the Dragon King of the Dragon Palace was so powerful that it was hopeless for them to seek revenge.<br/><br/>Now that they saw that the four lords wanted to take action, they immediately suggested it!<br/><br/>“If the Dragon Palace Alliance wants to be destroyed, the Justice Alliance also needs to be destroyed. After destroying them, we will be able to obtain a huge increase in our strength!”<br/><br/>The Lord of disaster replied faintly.<br/><br/>They had been eyeing the Justice Alliance for a very, very long time.<br/><br/>They knew that once the Justice Alliance was destroyed, their strength would increase greatly, not to mention other things.<br/><br/>Even if they didn’t give their subordinates the chance to break through to the primal chaos realm, they could still add a dozen Great Dao experts!<br/><br/>The three Great Dao experts could barely fight against a primal chaos realm expert.<br/><br/>Of course, they could only survive against primal chaos realm experts!<br/><br/>“Indeed, we can’t Let the Justice Alliance and the Dragon Palace Alliance open the teleportation array. Otherwise, it’ll be troublesome if we want to destroy them. Let’s destroy the Dragon Palace Alliance first. Hehe, we haven’t killed a primal chaos realm expert yet.”<br/><br/>The chaos expert wearing the bamboo hat said with a sinister smile!<br/><br/>“Since we are going to attack, let’s attack with lightning speed. Don’t drag it out.”<br/><br/>Sword Demon Axe also chimed in!<br/><br/>“Lock onto the position of the Dragon King of the Dragon Palace Alliance first. We will destroy him a few times. Then, our next action will be simple!”<br/><br/>The eyes of the countless chaos experts whose tentacles were connected to their heads were shining.<br/><br/>They had helped axe sword demon break through to prepare for the upcoming battle.<br/><br/>And axe sword demon would not get any of the profits this time. All the profits would still be split equally between the three of them.<br/><br/>They would make a huge profit by destroying the Dragon Palace Alliance and the Justice Alliance during this period.<br/><br/>At that time, even if they had one more chaos-level existence, their status would not be shaken!<br/><br/>“Sirs, leave the matters of the Dragon Palace Alliance to your subordinates. I’ll lock onto the position of the Dragon Palace Dragon King as soon as possible.”<br/><br/>When the spirit kneader heard the words of the four chaos-level existences from the evil sequence faction, his eyes lit up.<br/><br/>As long as the four sirs took action, the Dragon Palace Dragon King’s death wouldn’t be far away!<br/><br/>So what if he was a chaos-level existence?<br/><br/>Primal Chaos existences could still be killed.<br/><br/>In a four versus one situation, the dragon king might be completely destroyed!<br/><br/>“Okay, we need to investigate everything before they open the teleportation array. Also, tell the other disciples to prepare for battle.”<br/><br/>“Also, find out more information about the black hole teleportation array.”<br/><br/>The Lord of Disaster said faintly!<br/><br/>They didn’t need to do this personally.<br/><br/>However, they wanted to obtain the black hole teleportation array.<br/><br/>In the future, if they destroyed the Dragon Palace Alliance and the Justice Alliance to unify this area, they would have to prepare for the plunder and slaughter.<br/><br/>The black hole teleportation array was very important to their future!\t\t\t\t\t\t</div>", "images": {}, "success": true}