{"id": 1517, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075926.html", "title": "Chapter 4520 - Chapter 4520: 4519 Justice Alliance’S Thoughts", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4520 - Chapter 4520: 4519 Justice Alliance’S Thoughts</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4520: 4519 Justice Alliance’s thoughts<br/><br/>No one knew how big the chaos realm was.<br/><br/>No one knew how many universes there were in the chaos.<br/><br/>Wang Xian had asked the Divine Roc of the Nine Heavens. The Divine Roc of the nine heavens who had experienced a large number of calamities did not know how big the entire chaotic world was.<br/><br/>And how many universes there were.<br/><br/>If a faction wanted to expand rapidly and recruit more experts to join them, there was one important point, and that was the problem of the teleportation formation!<br/><br/>It couldn’t be that it would take hundreds of millions of years to fly to the center of the entire faction after joining a faction, right?<br/><br/>This round trip would take two to three hundred million years. It was a very long time for the powerhouses in the Heaven’s origin blessed realm!<br/><br/>If there was a powerful teleportation formation to carry out the transfer, it would be of great significance to any faction!<br/><br/>Upon hearing that Wang Xian had this technology, song Ta didn’t need to report to the Alliance leader. He decided to ask Wang Xian directly!<br/><br/>“How about this? I will speed up the black hole teleportation formation technology to Your Justice Alliance. The resources needed to build the black hole teleportation formation this time will be provided by Your Justice Alliance. In addition, our Dragon Palace can use the black hole teleportation formation that you build in the future for free!”<br/><br/>Wang Xian said to Song Ta!<br/><br/>Wang Xian did not plan to keep the technology of the black hole teleportation formation for himself.<br/><br/>At this moment, with his current strength, he hoped that there would be more black hole teleportation formations that could connect to the universe in a more distant region.<br/><br/>In that case, he could bring Guan Shuqing and the other girls to explore other universes when he had nothing to do!<br/><br/>After all, according to the Divine Roc of the Nine Heavens, he had wandered very far in the chaos and did not encounter any existences above the chaos.<br/><br/>The current Wang Xian, even if he was not invincible, had few opponents!<br/><br/>By discovering more universes, it would be better for him to obtain a spot in the Heaven’s origin blessed realm!<br/><br/>“Oh? Brother Wang Xian is willing to hand over this technology to us?”<br/><br/>Song Ta was slightly shocked when he heard Wang Xian’s words. His eyes shone and he could not help but ask!<br/><br/>“Sure.”<br/><br/>Wang Xian nodded his head.<br/><br/>“Brother Wang Xian, I can agree to your conditions on behalf of the Justice Alliance immediately!”<br/><br/>Song Ta was an expert at the level of the Great Dao. His position in the Justice Alliance was also very high.<br/><br/>He could make decisions on certain matters directly!<br/><br/>“Alright, this is about the technology of the black hole teleportation formation. You can take a look at it.”<br/><br/>Wang Xian took out a memory crystal and handed it to him.<br/><br/>He wasn’t worried that the Justice Alliance would go back on their word.<br/><br/>If they dared to do so, they could only say that the Justice Alliance was unlucky!<br/><br/>“Thank you, brother Wang Xian!”<br/><br/>Song Ta thanked him immediately.<br/><br/>Wang Xian waved his hand and didn’t pay too much attention to it. “I’ll leave the matter of the black hole teleportation formation to you guys. If there’s anything, you can contact me again!”<br/><br/>“Alright, brother Wang Xian!”<br/><br/>Song ta replied immediately, “We will use the fastest speed to open up the teleportation between the Justice Alliance and the land of origin.”<br/><br/>After chatting with song Ta for a while, Wang Xian returned to the Dragon Palace and continued to convert the resources he obtained from the Mechanical Ascension universe into the power of chaos.<br/><br/>After song ta brought the black hole teleportation technique back to the Justice Alliance, he immediately came to the center of the Justice Universe!<br/><br/>“Little song, quickly bring that black hole teleportation technique over for us to take a look!”<br/><br/>When Song Ta entered a large hall, the justice union leader immediately asked him from the front.<br/><br/>There were more than ten figures in the entire hall.<br/><br/>In the center were two old men.<br/><br/>One of them was the justice union leader.<br/><br/>The other was also a primal chaos realm existence of the Justice Union.<br/><br/>In the entire Justice Alliance, only great dao-level powerhouses knew of this existence.<br/><br/>It was the hidden chaos-level existence of the Justice Alliance.<br/><br/>On the surface, the Justice Alliance had one chaos-level existence, while the evil sequence faction had two.<br/><br/>However, the Justice Alliance’s great dao-level existences also knew that the evil sequence faction had three chaos-level existences!<br/><br/>The black hole teleportation array technology was extremely important to the Justice Alliance.<br/><br/>Because with such a teleportation array, they could shorten the distance between them and the universe further away, allowing the universe further away to join their Justice Alliance!<br/><br/>This would greatly benefit the power of the Justice Alliance as well as the power of the Justice Universe.<br/><br/>The Justice Union was united against the evil sequence faction.<br/><br/>However, as the founder of the Justice Union, the Justice universe would still benefit greatly.<br/><br/>“It’s the Union Master!”<br/><br/>Song ta nodded and immediately handed the memory crystal to the Union Master.<br/><br/>The Justice Union master took it and immediately checked it.<br/><br/>Time passed by minute by minute. He looked at the time for more than ten days.<br/><br/>However, the people around him did not leave. They waited quietly.<br/><br/>“Although I only looked at the first part, the black hole teleportation array technology should be real. I didn’t expect that the Dragon King of the Dragon Palace Alliance would be willing to take out such technology!”<br/><br/>The leader of the Justice Alliance was a little confused. “However, it will be very beneficial for us. We will evolve to open the teleportation array with the Dragon Palace Alliance and then prepare to connect to other places!”<br/><br/>“Yes, leader!”<br/><br/>The Justice Alliance’s dao-level powerhouses immediately replied.<br/><br/>Just like the evil sequence faction universe, the Justice Alliance’s development here had reached a bottleneck.<br/><br/>It was basically impossible for them to advance any further!<br/><br/>And according to their understanding, the power of the evil sequence faction had been constantly increasing.<br/><br/>Even when the Dragon King of the Dragon Palace Alliance had killed a few great dao existences back in the land of origin, the evil sequence faction had still received a significant increase in power in the land of origin.<br/><br/>Now, the evil sequence faction was still constantly searching for the universe, hunting and upgrading.<br/><br/>The evil sequence faction was constantly improving. If the Justice Alliance were to remain stagnant, they would definitely be devoured one day!<br/><br/>Therefore, the Justice Alliance was always looking for ways to increase their strength!<br/><br/>The construction of the black hole teleportation array was progressing quickly in the Justice Alliance.<br/><br/>The land of origin, the Dragon Palace Alliance, had entered a period of peace!<br/><br/>Some of the powerhouses of the Dragon Palace didn’t have anything important to do.<br/><br/>After tens of thousands of years, some of the powerhouses of the Dragon Palace formed teams and headed to the land of origin to train and hunt the space behemoths.<br/><br/>At this time, the Justice Alliance also began to build the first black hole teleportation portal.<br/><br/>When the first black hole teleportation portal was successfully built, the powerhouses of the Justice Alliance were very excited.<br/><br/>They continued to build. As long as they built another one, they would be able to quickly reach the land of origin from the Justice Alliance.<br/><br/>For the Justice Alliance, as long as they opened it up, if they clashed with the evil sequence faction in the future, a battle would break out.<br/><br/>The Dragon Palace Alliance might stand on their side.<br/><br/>After all, from the Justice Alliance’s Point of view, the land of origin had been attacked by the evil sequence faction.<br/><br/>If the Dragon Palace Alliance and the evil sequence faction experts fought, they would be enemies!<br/><br/>Only by cooperating with them could the Dragon Palace Alliance not be threatened by the evil sequence faction!\t\t\t\t\t\t</div>", "images": {}, "success": true}