{"id": 1512, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075901.html", "title": "Chapter 4515 - Chapter 4515: 4514 Received The Goods! Next", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4515 - Chapter 4515: 4514 Received The Goods! Next</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4515: 4514 received the goods! Next<br/><br/>“All powerhouses below the Heavenly Yuan creation realm in the Mechanical Ascension universe are to be eliminated. Those below the Heavenly Yuan creation realm can survive by handing over all their treasures and resources!”<br/><br/>When this announcement was made in the 10-day federation, it didn’t cause too much of a shock.<br/><br/>Because now, all the disciples of the 10-day federation knew that the Mechanical Ascension Universe had offended an invincible existence.<br/><br/>Now, the Mechanical Ascension Universe was facing death.<br/><br/>On the contrary, this statement made some of the disciples of the Mechanical Ascension universe heave a sigh of relief!<br/><br/>During this period of time, they all understood.<br/><br/>Wu Tongming had an extremely powerful master, and their mechanical God had possessed Wu Tongming’s body in order to obtain the Nine Heavens Divine Roc.<br/><br/>He wanted to possess his body.<br/><br/>As a result, he had attracted a calamity!<br/><br/>All of this was caused by their god of machinery.<br/><br/>What else could they say?<br/><br/>Furthermore, they knew that Wu Tongming’s master’s strength was above the primal chaos realm. Not to mention destroying a single machine to ascend to the cosmos, even destroying their entire ten suns federation union wouldn’t be too big of a problem!<br/><br/>Therefore, all the strong disciples in the Spirit Path Universe and the three-three universe couldn’t be said to be adding insult to injury, but they were also shouting that they deserved it!<br/><br/>If you were strong, you could take over Wu Tongming’s body.<br/><br/>However, Wu Tongming had an invincible master. Then, don’t blame him for destroying you!<br/><br/>The law of the universe was that the strong preyed on the weak!<br/><br/>After losing the existence of the strong in the Heaven’s origin manifestation realm, all the disciples in the mechanical ascension universe were helpless.<br/><br/>Resisting was just death!<br/><br/>How could they resist?<br/><br/>They couldn’t!<br/><br/>Next, Wang Xian began to hunt down the powerhouses in the Heaven’s origin realm who were in the Mechanical Ascension universe.<br/><br/>The powerhouses in the Dragon Palace began to collect a large amount of treasures and resources.<br/><br/>The strength of the Mechanical Ascension universe was much stronger than their Dragon Palace.<br/><br/>Their resources were equally terrifying.<br/><br/>Especially the various types of powerful metals.<br/><br/>In addition, there were five of them, even if they were the ultimate treasures of the Heaven’s origin realm.<br/><br/>All these treasures were kept away.<br/><br/>When Wang Xian killed the mechanical ascension universe, he also kept all the technology that they possessed.<br/><br/>As long as the technology of the Mechanical Ascension universe was up to par, as long as there were sufficient resources, it would be able to give birth to powerhouses in the Heaven’s origin realm. It could be said to be extremely abnormal.<br/><br/>Of course, they also had a disadvantage. If a normal cultivator could succeed by consuming one portion of resources, it would require dozens of portions of resources to create a powerhouse in the Heaven’s origin realm with technology.<br/><br/>The amount of resources needed to upgrade in the future was also much more than the amount needed for normal cultivation!<br/><br/>Of course, the method of upgrading technology might not be inferior to other cultivation systems!<br/><br/>Time passed day by day. With his divination ability, Wang Xian’s hunting speed was very fast.<br/><br/>A few hundred years later, he came to the center of the Mechanical Ascension Universe and sent a message to Prime Minister Gui!<br/><br/>“Dragon King!”<br/><br/>Soon, Prime Minister Gui rushed over with a red face and a smile on his face!<br/><br/>“How is it going?”<br/><br/>Wang Xian asked him.<br/><br/>“Dragon King, it will probably take a few more decades. There are too many treasures and resources in the Mechanical Ascension Universe. It is several times more than our resources!”<br/><br/>Prime Minister Gui said.<br/><br/>The resources in the Dragon Palace were already a lot. However, it was still far from being comparable to the mechanical ascension.<br/><br/>“Alright, you guys can continue. Inform me when you are done storing them!”<br/><br/>Wang Xian nodded his head. As he spoke, he went straight to the ocean of life of the 10-day federation.<br/><br/>This was the biggest treasure land of the 10-day federation.<br/><br/>It was also because of this treasure land that three powerful universes were born.<br/><br/>There were a large number of battleships, spaceships, mechs, and so on that could fly mechanically to the universe.<br/><br/>The number was huge.<br/><br/>Wang Xian looked at these battleships and spaceships. He came to the position in front of him.<br/><br/>Buzz<br/><br/>He waved his arm and enveloped them with energy. Then, he began to devour them!<br/><br/>Wang Xian wanted to give them a line of sight.<br/><br/>Now, he could devour any resources and treasures and convert them into the power of chaos in his body!<br/><br/>He wanted to convert them into his own power.<br/><br/>He wanted to see how much he could improve by absorbing these battleships that were priceless and possessed terrifying energy.<br/><br/>After all the battleships were stored away, Wang Xian sat cross-legged and began to transform quietly!<br/><br/>Time passed little by little. The power of chaos in Wang Xian’s body was improving at every moment.<br/><br/>No, it couldn’t be said that the power of chaos in Wang Xian’s body was increasing.<br/><br/>At this moment, Wang Xian realized that he was like a ball. This ball was filled with the power of chaos.<br/><br/>By absorbing the power of chaos, he could make this ball bigger!<br/><br/>Right now, this ball was about the size of thirty life planets!<br/><br/>With the absorption, the ball expanded!<br/><br/>Wang Xian sensed it and his eyes sparkled.<br/><br/>The size of this ball was equivalent to the area that the time domain could cover.<br/><br/>“The absorption speed is too slow. If I were to absorb all the battleships and mechs, I would need tens of millions of years!”<br/><br/>Wang Xian had absorbed for dozens of years. He opened his eyes and muttered to himself!<br/><br/>This might be because these were all battleships and mechs. They were all metal.<br/><br/>For example, the Stone of origin contained a huge amount of energy. Now, Wang Xian could absorb one of them every few days!<br/><br/>Absorbing resources could make the sphere bigger.<br/><br/>If he were to use the power of chaos to fix his phone and create a treasure, the sphere would shrink.<br/><br/>If he were to only use it for battle, the consumed ball would not shrink. The energy in it would decrease and it would need to be filled up!<br/><br/>Wang Xian tried to create a heaven-grade five elements grinding machine.<br/><br/>In the end, the amount of resources consumed was at least equivalent to the amount of time Wang Xian took to absorb the brightness of these battleships and mechs!<br/><br/>Buzz Buzz<br/><br/>Buzz Buzz<br/><br/>At this moment, a message came from his communication stone plate.<br/><br/>Wang Xian opened it and saw Prime Minister Gui’s message. He immediately flew over!<br/><br/>All the resources and treasures in the Mechanical Ascension Universe had been collected!<br/><br/>“Dragon King!”<br/><br/>When Wang Xian arrived, Prime Minister Gui and the rest shouted happily as they handed over the storage space items one by one!<br/><br/>Wang Xian took them over and took a look. When he saw the various powerful battleships’treasures and resources, his eyes lit up!<br/><br/>The treasures and resources in the Mechanical Ascension universe were mainly made up of various large battleships.<br/><br/>Next was a large number of metals. The amount of various metals was extremely huge.<br/><br/>There were also many metals of the Heaven’s origin level.<br/><br/>There weren’t many divine herbs and divine trees like these, but they were comparable to the divine trees and divine herbs in the Dragon Palace!<br/><br/>“Dragon King, we found a very special treasure in the Mechanical God’s lair. You can take a look inside this storage space. It’s a type of life metal!”<br/><br/>At this moment, Prime Minister GUI pointed at a storage space and said!<br/><br/>“Okay!”<br/><br/>Wang Xian nodded his head. After opening it and taking a look, a hint of shock appeared on his face!\t\t\t\t\t\t</div>", "images": {}, "success": true}