{"id": 1514, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075911.html", "title": "Chapter 4517 - Chapter 4517: 4516 Was Absorbed And Upgraded", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4517 - Chapter 4517: 4516 Was Absorbed And Upgraded</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4517: 4516 was absorbed and upgraded<br/><br/>“Please take your seat, Dragon King!”<br/><br/>The two Primal Chaos Masters from the third and third universes of the Godly Power Universe.<br/><br/>Along with a group of Great Dao Masters, they greeted Wang Xian respectfully!<br/><br/>Wang Xian nodded with a smile and sat on the seat above.<br/><br/>“Dragon King, it is our great fortune to have Xiao Ming as your disciple. Thank you, Dragon King, for your nurturing of Xiao Ming. Our godly power universe has nothing to repay you with. This is just a small gift, no need to be so polite!”<br/><br/>The Spirit Path Universe God spring smiled as he took out a treasure. “This is the sky reaching tree branch. It is a treasure that grows in the sea of life. Speaking of which, the three gods and the god of machinery and I were able to break through because we obtained great opportunities and good fortune in the Sea of Life!”<br/><br/>“I was able to break through to the primal chaos realm by relying on a tree. I call it the sky reaching tree of God. The Tree of God contains powerful energy and has a heaven-defying effect on wood attribute cultivators!”<br/><br/>“This is the last branch in my hand. It can allow a control-level expert to break through to the Great Dao level!”<br/><br/>The Divine Spring said.<br/><br/>This time, his spirit path universe had invested a lot.<br/><br/>This heavenly divine tree branch was indeed the last one in his hand.<br/><br/>For their spirit path universe, it was something that could only be found by chance!<br/><br/>However, the Dragon King in front of him could casually give Wu Tongming two heavenly yuan creation treasures.<br/><br/>If they wanted to be on good terms with the Spirit Path universe and climb up to their feet, the things they took out couldn’t be worse than Heavenly Yuan Destiny Treasures, right?<br/><br/>However, they really didn’t have many treasures that were more precious than Heavenly Yuan Destiny Treasures!<br/><br/>“Congratulations, Dragon King, for obtaining the Nine Heavens Divine Roc. In the future, please take care of our ten days federation.”<br/><br/>As the three gods of the three three universes spoke, they took out a spatial storage item. “Dragon King, there’s a piece of soil in here that I obtained from the Sea of life. With the help of the soil, I broke through to my current State!”<br/><br/>“This is a part of the soil. It can suddenly emit a special energy that can help people break through. I call it the Enlightenment soil. The area of the Enlightenment soil that I obtained back then is about 100 kilometers. Now, there is only about 10 kilometers left!”<br/><br/>The three gods of the three universes also took out extremely precious treasures.<br/><br/>They had no choice. Ordinary treasures could not be taken out at all!<br/><br/>“Oh?”<br/><br/>“Thank you both. I appreciate your kindness.”<br/><br/>Wang Xian raised his eyebrows slightly. He took their treasures and said!<br/><br/>These treasures were even more valuable than the ultimate treasures of the Heaven’s origin.<br/><br/>They were extremely rare items in the universe.<br/><br/>Wang Xian sensed for a moment and could sense the special energy contained in these two items.<br/><br/>Wang Xian really needed such treasures.<br/><br/>That was because he could use the power of chaos to transform such treasures!<br/><br/>“You are welcome, Dragon King. You are the Master of Bright Light. Furthermore, you have given us the technology for the mechanical ascension to the universe. These treasures are nothing!”<br/><br/>As Shen Quan spoke, he began to build a relationship with them!<br/><br/>Wang Xian was also chatting with them with a smile.<br/><br/>After chatting for half an hour and having a sumptuous meal here, Wang Xian left!<br/><br/>After leaving this time, he brought Wu Tongming back with him!<br/><br/>As his disciple, he had to at least go to the Dragon Palace to take a look and recognize the place!<br/><br/>“Prime Minister Gui, Bring Tongming around. I still have something to take care of!”<br/><br/>Wang Xian returned to the Dragon Palace and called Prime Minister Gui over!<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui replied immediately.<br/><br/>Prime Minister Gui already knew Wu Tongming’s identity and brought him around politely.<br/><br/>Wu Tongming was also curious about his master’s universe.<br/><br/>In the next few days, Wang Xian accompanied Guan Shuqing and the other girls.<br/><br/>Now, the girls had already broken through to the Heaven’s origin realm and were ready to have children!<br/><br/>Wang Xian felt that the time was ripe for his breakthrough this time!<br/><br/>He was already strong enough now<br/><br/>He could have children without worries!<br/><br/>After all, the girls had been looking forward to this day for a very, very long time!<br/><br/>The only thing that made Wang Xian feel regretful was that he wanted to have children of chaotic creatures and create a chaotic race.<br/><br/>In the end, he realized that he could not do it at all!<br/><br/>Chaos could be transformed, but chaos could not be transformed into chaotic life!<br/><br/>He could only give up on this idea.<br/><br/>However, the children that Guan Shuqing was going to give birth to could choose the attributes of the child.<br/><br/>Two attributes, five elements, yin-yang, or mutated attributes could be used!<br/><br/>It could improve the foundation of the child!<br/><br/>Of course, if Wang Xian and the rest wanted to have a child, it would take a long time for the child to be born!<br/><br/>It would take a few hundreds of millions of years.<br/><br/>However, after the child was born, the child would immediately possess the strength of a ruler.<br/><br/>“There are plenty of resources now. There’s plenty of time. There’s no rush!”<br/><br/>Wang Xian thought to himself.<br/><br/>After paying the price for a period of time, Guan Shuqing and the rest had completely started to get down to business!<br/><br/>It was time to start digesting the harvest this time!<br/><br/>The harvest this time was the Divine Roc of the Nine Heavens, which could be cultivated to the peak of the chaos realm in the Heaven’s origin creation, as well as a large amount of resources for the mechanical ascension to the universe.<br/><br/>There were many types of divine trees and fruits.<br/><br/>However, most of them were battleships.<br/><br/>Powerful battleships, weapons, mechas, and spaceships could be used directly.<br/><br/>They could unleash terrifying power!<br/><br/>However, Wang Xian decided to absorb all of them!<br/><br/>He wanted to increase his own strength and convert his chaotic energy into various treasures.<br/><br/>First, Wang Xian wanted to transform the entire Dragon Palace!<br/><br/>As their base, the entire Dragon Palace should at least have a strong defensive and combat strength, right?<br/><br/>Wang Xian was prepared to create an extremely powerful heaven origin destiny treasure in the Dragon Palace.<br/><br/>In addition, he would convert some resources.<br/><br/>Especially The dao enlightenment soil. Wang Xian examined it carefully and found that it was indeed very powerful.<br/><br/>Even if the dao enlightenment soil did not absorb the energy, the energy it emitted could increase the comprehension ability of the disciples.<br/><br/>This kind of comprehension ability was to increase their comprehension ability to break through the heaven origin destiny realm.<br/><br/>It was extremely powerful!<br/><br/>In addition, there was also the life metal. He could create a batch of chaos metal life forms in the ruler realm and make them devour the metal.<br/><br/>“Let’s absorb it first!”<br/><br/>Wang Xian didn’t think too much. He was in the Dragon King’s palace. Looking at the metal weapons in the thousands of storage spaces, a smile appeared on his face!<br/><br/>With a thought, his time domain covered it. The power of chaos enveloped the battleships and mechs one by one.<br/><br/>He began to absorb it!<br/><br/>Time passed bit by bit. The one million years in Ling Yun was equivalent to one hundred million years in the outside world!<br/><br/>Wang Xian had absorbed a total of ten million years, but he had only absorbed one-tenth of it!<br/><br/>This was equivalent to one billion years in the outside world!<br/><br/>This made him shake his head slightly!<br/><br/>With a thought, he sensed his own power. His eyes sparkled.<br/><br/>He could feel that if he was a round ball, the primal chaos energy in the ball before was comparable to thirty life planets.<br/><br/>Now, the primal chaos energy in his body was equivalent to forty life planets.<br/><br/>Did this mean that theoretically, he was comparable to four primal chaos existences?<br/><br/>Of course, in terms of combat power, dealing with five or six should not be a problem!\t\t\t\t\t\t</div>", "images": {}, "success": true}