{"id": 1510, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075891.html", "title": "Chapter 4513 - Chapter 4513: 4512 Harvest! Go", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4513 - Chapter 4513: 4512 Harvest! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4513: 4512 harvest! Go<br/><br/>“The Mechanical Ascension universe is going to be completely destroyed this time. That Dragon King’s strength is enough to completely exterminate the Mechanical Ascension Universe!”<br/><br/>“Let’s not talk about the mechanical ascension universe. I feel that he alone can destroy our entire 10 suns federation. Just now, when the more than 100 heaven origin creation realm powerhouses in the Mechanical Ascension Universe launched an attack, he actually dodged it very casually. Did you see how he dodged it?”? That speed is simply too terrifying!”<br/><br/>“An existence above chaos. The Mechanical Ascension universe is about to completely disappear. However, Wu Tongming, that brat, has really made a huge profit. With such a master, won’t he be invincible in the future?”<br/><br/>“I’m so envious that I’m crying. Wu Tongming’s strength should be at the Old Heavenly Yuan Destiny Realm Right now, right? However, he currently has two Heavenly Yuan Destiny Realm Treasures. One is for support, and the other is for Attack!”<br/><br/>Seeing the experts of the Giant Beast Alliance leave, the other experts of the ten days federation were also discussing with shocked faces.<br/><br/>The two primal chaos existences from the Spirit Path universe and the three-three universe moved and immediately arrived in front of Wu Tongming’s grandfather, mother, and Wu Tongying!<br/><br/>“Forefather, I don’t know the specific situation. That Kid didn’t tell us!”<br/><br/>Wu Tongming’s grandfather saw elder ancestor and the others flying to his side. He smiled bitterly and said!<br/><br/>He really didn’t know about his grandson’s changes!<br/><br/>“Xiao Ying, you see your younger brother more often. Do you know?”<br/><br/>Wu Tongming’s grandfather saw his granddaughter and asked.<br/><br/>“No… I don’t know.”<br/><br/>Wu Tongying also shook his head, soon after, he thought of something. “Oh right, grandfather, ancestor, Lord three gods, I remember now. Back then, when my younger brother’s confession was rejected and he broke up with her, he was a little strange. There was something wrong with his expression. At that time, I didn’t take it to heart.”<br/><br/>“Also, on that day, there was a mysterious powerhouse who killed more than ten heaven origin creation realm powerhouses in the Mechanical Ascension Universe. It was on that day, and from that day onwards, that fellow’s strength began to advance by leaps and bounds!”<br/><br/>As she spoke, her eyes flickered.<br/><br/>She had never expected that her younger brother would have such a fortuitous encounter!<br/><br/>“It might have been that day. Little Ming’s master might have already had a conflict with the mechanical ascension universe on that day. However, that senior did not intend to destroy the Mechanical Ascension Universe.”<br/><br/>“Today, Little Ming was able to enter the Nine Heavens Divine Roc. It should have been this senior who led him in. The Mechanical God secretly seized the opportunity to possess little Ming’s body, thoroughly angering that senior and causing him to decide to destroy the Mechanical Ascension Universe.”<br/><br/>“I don’t know why Xiao Ming was chosen by this senior. No matter what, this is a good thing for Xiao Ming and for us!”<br/><br/>The Eyes of the Spirit Ascension Universe’s Patriarch Divine Spring flickered. “Although the mechanical ascension universe has been destroyed, that senior will give him all the technology. We can completely continue to develop the technology. In addition, Xiao Ming has this backer. No one in our ten days union would dare to bully him.”<br/><br/>“Let’s go back and take a look at the situation.”<br/><br/>Patriarch Divine Spring continued to speak to them!<br/><br/>“En!”<br/><br/>Everyone immediately responded. They didn’t hesitate to take out their treasures and instantly returned to the Spirit Ascension Cosmos!<br/><br/>…<br/><br/>“Master, you are simply too strong. You are too invincible. Even primal chaos existences can be instantly killed by you.”<br/><br/>At the same time, Wu Tongming, who was in the Spirit Ascension Cosmos, had a shocked and excited expression on his face.<br/><br/>“Let’s Go!”He said excitedly!<br/><br/>“Alright, cut the crap. Let’s go to the Mechanical Ascension Universe.”<br/><br/>Wang Xian smiled and quickly came to the front of a teleportation formation to carry out the teleportation!<br/><br/>After a short transit, Wang Xian arrived at the center of the Mechanical Ascension Universe!<br/><br/>He looked at the entire mechanical ascension universe and did not make a move immediately.<br/><br/>In front of him, there were many phantoms of the powerhouses of the Mechanical Ascension Universe.<br/><br/>These phantoms needed to be completely destroyed.<br/><br/>In addition, there were at least 50 heavenly fate powerhouses in the mechanical ascenders’lair.<br/><br/>Some of these were mechanical ascenders’powerhouses.<br/><br/>Some belonged to the mechanical ascenders’camp!<br/><br/>The Mechanical Ascenders’universe didn’t only have one universe.<br/><br/>They also occupied and had many subsidiary universes.<br/><br/>These subsidiary universes were loyal to the Mechanical Ascension Universe, and they were also able to obtain the technology of the Mechanical Ascension Universe!<br/><br/>But now, their doomsday was coming!<br/><br/>Wang Xian did not have a good impression of the mechanical ascension universe.<br/><br/>Whether it was the mechanical ascension universe that wanted to trap him when he first arrived here.<br/><br/>Or the mechanical ascension universe that wanted to snatch his origin stone.<br/><br/>Or if the mechanical God wanted to take over Wu Tongming’s body in the end.<br/><br/>All of these made Wang Xian destroy the mechanical ascension universe without the slightest bit of guilt.<br/><br/>With a wave of his hand, the Phantom in front of him began to collapse!<br/><br/>“Ah Ah!”<br/><br/>“No, no, no!”<br/><br/>In one go, more than 100 heaven origin creator powerhouses were killed one by one, one by one.<br/><br/>Wang Xian stood at the center of the Mechanical Ascension Universe. He could even hear the terrified sounds coming from his surroundings.<br/><br/>The experts from the mechanical ascension universe were killed. Most of their first resurrection points were located at the center of their universe.<br/><br/>Now, their doomsday had arrived completely!<br/><br/>The virtual image appeared once again. Wang Xian destroyed them one by one!<br/><br/>One after another.<br/><br/>It was very easy for the experts from the science and technology department to leave behind the seeds of their lives. Therefore, Wang Xian needed to kill them at least a few hundred times!<br/><br/>However, it would be much easier to exterminate him later on.<br/><br/>As long as he waved his arm, he would be able to use the ability to curse the demonic spirit to kill it!<br/><br/>Following that, the powerhouses in the Mechanical Ascension Universe died one after another.<br/><br/>In the Mechanical Ascension Universe, the news about the situation in the Divine Roc of the Nine Heavens and the news about them being exterminated quickly spread in the Mechanical Ascension Universe.<br/><br/>At the same time, it also spread throughout the entire ten days federation!<br/><br/>With the technology of the mechanically ascending universe, they could quickly spread all the news to all the disciples!<br/><br/>As for the powerhouses and disciples in the mechanically ascending universe who did not participate in the battle with the Nine Heavens Godly Peng.<br/><br/>After seeing this news, their faces were filled with disbelief and shock!<br/><br/>“What? Our Machine God has provoked an extremely terrifying enemy, an existence above chaos, and our machine God has been completely annihilated?”<br/><br/>“Our Machine Ascension Universe is about to face destruction? Our Machine Ascension Universe, over a hundred lords are suffering from the curse of annihilation? This? How could this be? How could this be?”<br/><br/>“No, no, this is impossible. Our Lord Mechanical God is a primal chaos level existence, how could he be killed? I don’t believe it, I don’t believe it. Our Lord Mechanical God is the greatest existence!”\t\t\t\t\t\t</div>", "images": {}, "success": true}