{"id": 1518, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075931.html", "title": "Chapter 4521 - Chapter 4521: 4,520 Chaos-Level Evildoer!", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4521 - Chapter 4521: 4,520 Chaos-Level Evildoer!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4521: 4,520 chaos-level evildoer!<br/><br/>The Justice faction had their own plans!<br/><br/>Of course, all of this was because the EVILDOER faction was too powerful.<br/><br/>Just as the Apocalypse broke out, a huge battle broke out between them and the EVILDOER faction.<br/><br/>And this battle was triggered by the EVILDOER faction.<br/><br/>It was also the elites of the evil sequence faction who attacked them first.<br/><br/>The battle lasted for a long time, and in the end, both sides suffered losses.<br/><br/>However, the Justice Alliance suffered even more losses.<br/><br/>In addition, the Justice Alliance also understood one thing. The reason why the evil sequence faction attacked them right after the Apocalypse broke out.<br/><br/>It was to refine the disciples of their own faction.<br/><br/>That’s right!<br/><br/>After more than 30 billion years of peace, the universe of the evil sequence faction had given birth to a large number of strong disciples.<br/><br/>And these disciples were completely useless in the eyes of the heaven origin creation realm powerhouses of the evil sequence faction.<br/><br/>They might as well let their elites directly devour and upgrade themselves.<br/><br/>But directly devouring and upgrading, how could it be better than dying in battle?<br/><br/>Therefore, when they invaded the justice alliance, their subordinates who died in battle became their rations.<br/><br/>Although their subordinates died in battle, many of them were able to kill their enemies before they died.<br/><br/>The corpses of their enemies were also their rations.<br/><br/>Under such circumstances, it was a huge upgrade for them.<br/><br/>In the universe of the evil sequence faction, a group of Heaven origin creation realm powerhouses was extremely cruel.<br/><br/>Even their own subordinates had to fight to survive!<br/><br/>If the evil sequence faction continued to grow, the Justice Alliance was worried that one day, they might be destroyed!<br/><br/>The birth of the Dragon Palace Alliance was a good thing for them.<br/><br/>As long as they joined forces with the Dragon Palace Alliance, they would have no fear of the evil sequence faction.<br/><br/>…<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>Just as the Justice Alliance began to plan and build the black hole teleportation array…<br/><br/>It was in the middle of Chaos!<br/><br/>This was a strange place in the Chaos!<br/><br/>Black Lightning covered the enormous domain!<br/><br/>To be able to create a special domain in the chaos, it had to be a special treasure ground!<br/><br/>Located at the center of the Lightning, booming sounds could be heard endlessly.<br/><br/>A hundred meter tall creature with a triangular head was bathing in the lightning!<br/><br/>Numerous terrifyingly thick lightning bolts landed on his body and were quickly absorbed!<br/><br/>The power of these lightning bolts could be directly destroyed by an ordinary Great Dao expert!<br/><br/>However, the aura of this creature was constantly increasing!<br/><br/>“Blood sacrifice!”<br/><br/>At this moment, two figures stood at the side!<br/><br/>One of them was wearing a red cloak, and the entire red cloak seemed to be flowing with blood!<br/><br/>His exposed skin was also blood red!<br/><br/>The other figure had countless tentacles that were connected to a head!<br/><br/>They stood at the side and waved their energy. Large amounts of pure blood splattered towards the figure in the center!<br/><br/>The endless blood was quickly absorbed by him.<br/><br/>The wound that was torn by the Lightning quickly healed!<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Ah! Ah! Ah!”<br/><br/>At this moment, along with the rumbling sound, the creature’s eyes shone.<br/><br/>He let out an excited roar!<br/><br/>Along with it, an extremely powerful energy spread out from his body!<br/><br/>“Good!”<br/><br/>“Jie Jie Jie, you’ve broken through, Axe Sword Demon, you’ve finally broken through!”<br/><br/>The figure wearing the bamboo hat emitted light as he said with a Jie Jie!<br/><br/>“Thank you seniors for your help.”<br/><br/>The expert called axe sword demon revealed an excited expression.<br/><br/>“For your breakthrough, we took out the blood of ten universe beings.”<br/><br/>The expert with countless tentacles attached to the head looked at him and said!<br/><br/>“I know that in the next two aeons, all the treasures I obtained will belong to you.”<br/><br/>Axe sword demon said!<br/><br/>His breakthrough couldn’t be achieved without the help of these two people.<br/><br/>In fact, if it wasn’t for the fact that there was another chaos-level existence hidden in the Justice Alliance, he wouldn’t have broken through to the chaos realm!<br/><br/>That was because the other three chaos-level existences in the evil sequence faction wouldn’t allow their faction to give birth to another existence on the same level as them!<br/><br/>“Well, it’s good that you know!”<br/><br/>The expert with countless tentacles connected to his head nodded indifferently.<br/><br/>They were the strongest experts of the evil sequence faction!<br/><br/>“Bzzz!”<br/><br/>“Axe has broken through, right?”<br/><br/>At this moment, another figure suddenly appeared and looked at axe sword demon.<br/><br/>“Senior, I’ve broken through!”<br/><br/>Axe sword demon respectfully replied when he saw the experts that had appeared again.<br/><br/>The three people in front of him were once the controllers of their evil sequence faction.<br/><br/>Although he had already broken through, his heart was still filled with fear.<br/><br/>“Very good. This calamity has erupted, and most of the nearby universes have been cleared out. If we want to find the universe again, it’ll be more troublesome and a waste of time. Axe sword demon has broken through, so let’s completely destroy the people around us!”<br/><br/>The later said.<br/><br/>It was a creature shrouded in black fog.<br/><br/>No, it could also be said that this great being was a mass of black fog.<br/><br/>Above the black fog, a somewhat ferocious face condensed!<br/><br/>And he was one of the supreme beings of the evil sequence camp, an existence that all the great beings of the evil sequence camp feared and feared.<br/><br/>The Great Beings of the evil sequence camp called him the great Lord of Disaster!<br/><br/>“Axe Sword Demon has made a breakthrough. With our strength, it shouldn’t be a big problem for us to destroy the Justice Alliance!”<br/><br/>The figure wearing the bamboo hat said!<br/><br/>“According to the information I’ve received recently, a powerful alliance has been born in the land of origin. Chaos-level experts have been born!”<br/><br/>“In addition, the Justice Alliance is currently in contact with that alliance. It seems like they’re going to build a special teleportation array.”<br/><br/>The Lord of Disaster said!<br/><br/>“We have also heard about it. This is indeed a problem. If the power of the land of origin and the Justice Union were to form an alliance, it would be quite troublesome for us!”<br/><br/>The figure wearing the bamboo hat nodded slightly.<br/><br/>There was a primal chaos realm being born in the land of origin. Naturally, they were the first to know about this news!<br/><br/>Furthermore, according to what they knew, this newly born chaos-level existence was stronger than they had imagined!<br/><br/>It wasn’t simple at all!<br/><br/>It must have been a great opportunity!<br/><br/>The sudden birth of an alliance and a powerful faction was indeed a big problem for the evil sequence faction.<br/><br/>This was also one of the reasons why they allowed their faction to have another chaos-level existence!<br/><br/>“Send someone to investigate. We can’t let them join forces.”<br/><br/>The expert whose head was connected to countless tentacles said indifferently!\t\t\t\t\t\t</div>", "images": {}, "success": true}