{"id": 1529, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075986.html", "title": "Chapter 4532 - Chapter 4532: 4531 Counterattacked The Evil Sequence Camp", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4532 - Chapter 4532: 4531 Counterattacked The Evil Sequence Camp</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4532: 4531 counterattacked the evil sequence camp<br/><br/>“Hiss, how… How is this possible? This is impossible!”<br/><br/>“Another two great dao experts were killed in an instant. It was the Dragon King who did it. It was the Dragon King. Also, those two great dao experts were also killed silently by him just now!”<br/><br/>“This? ? How did we two Great Dao experts get killed in an instant? How did he do it?”<br/><br/>“What the Dragon King said, hiss…”<br/><br/>More than 400 experts from the evil sequence camp saw two great dao experts killed by the Dragon King.<br/><br/>They were completely dumbfounded.<br/><br/>The appearance of the Dragon King and another chaos expert had already shocked them.<br/><br/>However, since they were extremely shocked, they didn’t panic too much.<br/><br/>Speaking of which, a chaos-level existence was comparable to three great dao-level experts and nine control-level experts.<br/><br/>Even though they couldn’t do anything to a chaos-level existence when more than four hundred experts from the evil sequence faction joined forces.<br/><br/>However, it was impossible for a chaos-level existence to kill them.<br/><br/>However, the Dragon King had killed four great dao-level existences in an extremely strange way.<br/><br/>Furthermore, what the Dragon King said had shocked them as well.<br/><br/>The Dragon King said that the four good-for-nothings from the evil sequence faction? ?<br/><br/>The four good-for-nothings from the evil sequence faction were obviously referring to the chaos level existences from their evil sequence faction.<br/><br/>“All of you, defend and prepare to retreat!”<br/><br/>“I’ll contact the Lords!”<br/><br/>One of the evil sequence faction’s Great Dao level experts stared at Wang Xian with an extremely embarrassed and terrified expression as he ordered loudly.<br/><br/>The rest of the experts from the evil sequence faction were clearly frightened by Wang Xian’s means as well.<br/><br/>They released their energy one by one and enveloped their surroundings.<br/><br/>The defense formed by more than 400 heaven origin creator-level experts was extremely terrifying.<br/><br/>Even if ten primal chaos-level existences attacked together, it would be very difficult to break through it!<br/><br/>However, the attack of the cursed demonic spirit came from within the body.<br/><br/>This external defense was useless!<br/><br/>Wang Xian stared at them and smiled faintly.<br/><br/>With a move of his palm, countless phantoms appeared in front of him.<br/><br/>If one were to take a closer look, one would be able to see that these phantoms were the appearance of the four hundred plus experts from the evil sequence camp.<br/><br/>When the Phantoms appeared in front of Wang Xian, the expressions of all the experts from the evil sequence camp changed slightly!<br/><br/>Buzz Buzz<br/><br/>At this moment, they saw that the Dragon King was grabbing at the two virtual images again!<br/><br/>These were the virtual images of two Great Dao level powerhouses!<br/><br/>The virtual images were instantly shattered in his hands!<br/><br/>Buzz Buzz<br/><br/>The bodies of the two virtual images that were grabbed, as well as the two great dao level powerhouses, trembled violently.<br/><br/>They did not even have the time to react before they lost their life force.<br/><br/>Even if they had life-saving treasures on them.<br/><br/>However, when faced with a terrifying attack of Wang Xian’s level, the treasures on them did not even have the time to react!<br/><br/>They were instantly killed!<br/><br/>“Hiss!”<br/><br/>At the evil sequence camp, all the powerhouses were stunned.<br/><br/>They looked at this scene in astonishment.<br/><br/>They had already set up an extremely powerful defense in front of them!<br/><br/>How could they be instantly killed.<br/><br/>Furthermore, there were two great dao existences.<br/><br/>Was this something a chaos-level powerhouse could do?<br/><br/>They had seen the strength of a chaos-level powerhouse before.<br/><br/>It was very strong, but it was definitely not as terrifying as this.<br/><br/>It was so terrifying!<br/><br/>“This? ? How Strong is our Dragon King Now?”<br/><br/>“My God, how is this possible?”<br/><br/>Not only the evil sequence faction, but the members of the Dragon Palace Alliance were also stunned by this scene!<br/><br/>Their Dragon King had been floating there ever since the Dragon King arrived.<br/><br/>In just a few minutes, he had casually killed six great dao existences.<br/><br/>There were six of them!<br/><br/>Moreover, he couldn’t even block them!<br/><br/>How could their Dragon King be so strong?<br/><br/>“Four trash?”<br/><br/>On the other side, the expressions of the remaining Great Dao realm experts completely changed!<br/><br/>Their expressions were filled with fear and horror!<br/><br/>At this moment, they also thought of what the Dragon King had said.<br/><br/>This Dragon King dared to call their Chaos Realm Lord Trash.<br/><br/>In addition, he said that their chaos-level Lord had escaped!<br/><br/>At first, they didn’t believe it, but now, they had no choice but to believe it!<br/><br/>“Run! Run!”<br/><br/>This Dragon King’s strength was even more terrifying than a chaos-level existence!<br/><br/>No, they suspected that this Dragon King could kill a chaos-level existence!<br/><br/>“Run!”<br/><br/>A great dao-level powerhouse roared!<br/><br/>Without any hesitation, they frantically took out their escape treasures and prepared to leave this place!<br/><br/>More than 400 heaven origin creator-level powerhouses had completely lost their fighting spirit.<br/><br/>This dragon king in front of them was too terrifying!<br/><br/>Too terrifying!<br/><br/>Buzz Buzz<br/><br/>Buzz Buzz<br/><br/>Wang Xian’s expression didn’t change as he watched them trying to escape one by one.<br/><br/>He extended his palm and continued to grab at the Phantoms in front of him!<br/><br/>His target was still an existence at the Great Dao level.<br/><br/>Buzz! Buzz! Buzz<br/><br/>Buzz! Buzz! Buzz<br/><br/>Soon, four experts at the Great Dao level were killed by Wang Xian before they could escape!<br/><br/>When the other experts from the evil sequence camp saw this scene, they went even crazier!<br/><br/>Out of the fifteen experts at the Great Dao level, ten of them had already been killed!<br/><br/>Madness!<br/><br/>The experts of the evil sequence faction began to flee like madmen.<br/><br/>F * ck, this was the first time they had seen such a terrifying existence!<br/><br/>“Stop them!”<br/><br/>“Kill, kill them!”<br/><br/>The members of the Dragon Palace Alliance reacted at this moment and immediately roared loudly.<br/><br/>They took action and prepared to intercept!<br/><br/>However, the evil array formation was fleeing even faster than when they first arrived!<br/><br/>They all used their escape treasures!<br/><br/>Apart from the Nine Heavens Divine Roc that had sealed off more than ten heaven origin creation realm experts, the rest had all escaped!<br/><br/>They all used their treasures to escape!<br/><br/>This caused the members of the Dragon Palace Alliance who wanted to stop and attack to be slightly stunned!<br/><br/>They pursed their lips and looked at the Dragon King in unison.<br/><br/>Their faces were filled with reverence.<br/><br/>They looked at the figure that was still standing in the sky.<br/><br/>Just now, the Dragon King alone had completely intimidated the evil array formation’s 400 Plus Heavenly Yuan creation realm experts!<br/><br/>This caused the 400 plus heavenly yuan creation realm experts to flee in fear!<br/><br/>“Get ready to counterattack the evil array formation.”<br/><br/>“The Dragon Palace will annihilate the heaven origin blessed realm experts. I’ll leave the rest to you guys. You guys will get 10% of the profits!”<br/><br/>Wang Xian’s expression didn’t change as he watched the experts from the evil sequence camp flee.<br/><br/>Anyway, he had already recorded their auras and could kill them at any time!<br/><br/>Now, he could go and annihilate the evil sequence camp!\t\t\t\t\t\t</div>", "images": {}, "success": true}