{"id": 1521, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075946.html", "title": "Chapter 4524 - Chapter 4524: 4523 Had Seen Through The Conspiracy. Wang Xian Was Looking Forward To It!", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4524 - Chapter 4524: 4523 Had Seen Through The Conspiracy. Wang Xian Was Looking Forward To It!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4524: 4523 had seen through the conspiracy. Wang Xian was looking forward to it!<br/><br/>“Interesting. If they dare to target the Dragon Palace, they are definitely not a small force!”<br/><br/>Wang Xian narrowed his eyes slightly, but a smile appeared on his face!<br/><br/>The current Wang Xian was not afraid of any force!<br/><br/>He sensed this powerhouse from the Dragon Palace and did not make any move.<br/><br/>With a move of his palm, Wang Xian began to perform divination.<br/><br/>Who was the one controlling the powerhouse from the Dragon Palace.<br/><br/>The one behind the scenes!<br/><br/>“Soul Guide? The powerhouse from the evil sequence faction? There are three guys beside Soul Guide? Hehe, they actually dared to come to the land of origin!”<br/><br/>“Eh?”? The power of divination started to blur. Was it because there were stronger powerhouses involved? Currently, there were at least two to three existences at the primal chaos level that could interfere with his divination, or a large number of powerhouses at the Heaven’s origin realm<br/><br/>“From the looks of it, their mastermind is the evil sequence alignment camp. Has the evil sequence alignment camp shifted their attention to the Dragon Palace?”<br/><br/>Soon, Wang Xian received all the information, and his eyes sparkled.<br/><br/>Wang Xian did not have a favorable impression of the evil sequence alignment camp.<br/><br/>In fact, he had already decided that as long as he absorbed all the resources and allowed the powerful disciples of the Dragon Palace to absorb all the resources, he would prepare to destroy the evil sequence alignment camp after the number of powerhouses in the Heaven’s origin realm increased.<br/><br/>Now, he did not expect that the other party would take the initiative to attack the Dragon Palace!<br/><br/>How interesting!<br/><br/>Wang Xian moved and appeared in the base of the Dragon Palace Alliance in the land of origin at the next moment!<br/><br/>After performing another divination, Wang Xian flew toward a direction!<br/><br/>He used the power of chaos to conceal his figure and used the time domain to envelop himself!<br/><br/>Half an hour later, Wang Xian arrived at a location in the land of origin!<br/><br/>He looked down and his gaze landed on the six figures.<br/><br/>“There are six Great Dao level powerhouses. One of them is comparable to two great dao level powerhouses.”<br/><br/>Wang Xian looked at the purple-colored powerhouse.<br/><br/>This powerhouse was also the one who controlled the powerhouses of the Dragon Palace.<br/><br/>Wang Xian did not make a move rashly. He wanted to know the purpose of the evil sequence faction sending six Great Dao level powerhouses to the land of origin!<br/><br/>Wang Xian could divine some information, but he could not divine their specific purpose.<br/><br/>There were too many powerhouses involved!<br/><br/>Hovering in the distance from the spirit kneader and the rest, Wang Xian waited quietly.<br/><br/>A few years later, the powerhouse from the Dragon Palace arrived!<br/><br/>“Greetings, sir!”<br/><br/>The powerhouse from the Dragon Palace bowed to soul pull.<br/><br/>“Is the Dragon King in the Dragon Palace?”<br/><br/>Lead soul immediately asked.<br/><br/>“Yes, the Dragon King is in the Dragon King Palace.”<br/><br/>The controlled experts from the Dragon Palace answered truthfully.<br/><br/>“Okay!”<br/><br/>Lead soul nodded.<br/><br/>“Okay, okay. As long as the Dragon King is in the Dragon Palace, everything will be much easier. When the four of us deal with the Dragon King, we can easily destroy him.”<br/><br/>“Once the Dragon King is dead, the rest of the useless people won’t be able to withstand a single blow from our evil array camp. When that time comes, we will destroy all the disciples of the experts from the Dragon Palace and even their entire universe!”<br/><br/>The illusory realm said with a smile filled with hatred!<br/><br/>“Okay!”<br/><br/>The spirit kneader nodded heavily. “In that case, immediately inform the four lords that we can prepare. In addition, we will investigate the matter of the black hole teleportation array. The Lord of disaster also attaches great importance to the black hole teleportation array!”<br/><br/>“Alright, I will order the four of them to recover. Unfortunately, we will not be able to kill the four resource corpses this time!”<br/><br/>Soul-pulling looked at the four experts of the Dragon Palace and said regretfully.<br/><br/>“Hehe, brother soul-pulling, don’t worry. We’ll get more when we go to the nine-origin universe and the Dragon Palace. After we destroy the Dragon Palace Alliance, we’ll destroy the Justice Alliance. We’ll definitely gain a lot from this calamity, Haha!”<br/><br/>The spirit kneader laughed sinisterly!<br/><br/>“Hehe, that’s true!”<br/><br/>Soul kneader smiled faintly and began to restore the consciousness of the four experts of the Dragon Palace.<br/><br/>The difference in their realms was so great that the four experts of the Dragon Palace could not sense that they had been unconscious and controlled for a period of time!<br/><br/>After the four experts of the Dragon Palace recovered, they continued to fly down to the land of origin without knowing anything.<br/><br/>Wang Xian hovered in the distant chaotic void and watched everything!<br/><br/>“Hehe, I originally wanted to exterminate all of you after a period of time. I didn’t expect that all of you are courting death!”<br/><br/>Wang Xian thought to himself.<br/><br/>That’s good. In this case, it would save Wang Xian a lot of time!<br/><br/>However, the strength of the evil sequence faction was somewhat beyond his expectations.<br/><br/>The only ones who could be addressed as “Sir”by the Great Dao level powerhouses were only existences at the chaos level.<br/><br/>Based on their conversation, it was obvious that there were four existences at the chaos level in the evil sequence faction.<br/><br/>Wang Xian had thought that there were only two existences at the chaos level in the evil sequence faction. Now, there were actually four of them.<br/><br/>From the looks of it, it was impossible for the Justice Alliance to only have one existence at the chaos level.<br/><br/>There should be two of them!<br/><br/>“I thought that they would be weaker than the Behemoth Alliance and the Ten Days Federation. Now, it seems that they are not much weaker!”<br/><br/>Wang Xian mumbled.<br/><br/>At the lower position, after the spirit kneader and the rest released the four experts from the Dragon Palace, they continued to search for other information.<br/><br/>Wang Xian had been following them all this while, wanting to obtain more information!<br/><br/>There were four chaos-level existences in the evil sequence faction. Although Wang Xian was not afraid of them now, he still had to pay attention to them.<br/><br/>The resources had not been completely converted yet. Wang Xian’s realm was comparable to five chaos-level existences.<br/><br/>His combat strength was comparable to seven to eight existences at the chaos realm.<br/><br/>If the four experts at the chaos realm from the evil sequence faction were to join forces cautiously, it would be difficult for Wang Xian to kill them.<br/><br/>However, it was not a big problem.<br/><br/>After the other party had obtained the full strength of the Dragon Palace, it was impossible for him to be extremely cautious even when it was four against one.<br/><br/>Furthermore, he had obtained the other party’s plan in advance. He could totally take one of them out by surprise.<br/><br/>As for the remaining three, Wang Xian was confident that he could take them out one by one!<br/><br/>Another point was that the current Dragon Palace was made up of 15 Ultimate Treasures of the Heaven’s origin.<br/><br/>What kind of concept was this?<br/><br/>He could unleash all of them and easily suppress those who had just broken through to the realm of chaos.<br/><br/>The combined strength was equivalent to one chaos level and two great dao level.<br/><br/>“Oh right, there’s also the Nine Heavens Divine Roc. I wonder if he can regain his combat strength at the chaos level by then!”<br/><br/>Wang Xian spoke.<br/><br/>After the Nine Heavens Divine Roc was reborn, he possessed the strength of two great dao levels.<br/><br/>This was because his previous realm was at the peak of the chaos level. As long as he had the resources, he would be able to improve rapidly.<br/><br/>Wang Xian gave him enough resources to recover to the chaos level. However, he didn’t know if he had absorbed all of them!<br/><br/>If he absorbed them, the Dragon Palace would have one more chaos-level combat strength!\t\t\t\t\t\t</div>", "images": {}, "success": true}