{"id": 1528, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075981.html", "title": "Chapter 4531 - Chapter 4531: 4530 Destruction Had Just Arrived", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4531 - Chapter 4531: 4530 Destruction Had Just Arrived</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4531: 4530 destruction had just arrived<br/><br/>“Hold them off. As long as we hold them off for a while, our Dragon King will be able to come and destroy them all!”<br/><br/>In the sky above the land of origin, Prime Minister Gui led the experts of the Dragon Palace Alliance to defend against the attacks of the evil sequence alignment camp.<br/><br/>At this moment, all the experts of the Dragon Palace Alliance understood that they had to hold them off.<br/><br/>They had to trust Prime Minister Gui and the Dragon King.<br/><br/>This was because the evil sequence faction had launched a full-scale attack on them.<br/><br/>If they retreated this time, their universe would be massacred one by one!<br/><br/>Therefore, they had to resist now!<br/><br/>Even now, the enemy was twice as strong as them.<br/><br/>But as long as they resisted with all their strength, they could still hold on for more than ten days.<br/><br/>As for how long it would take, they would be in danger.<br/><br/>“Hehehe!”<br/><br/>“You still want to wait for Your Dragon King to come over? I think we should send your souls to meet him together!”<br/><br/>There were great dao experts in the evil sequence camp, and they roared with grim expressions.<br/><br/>On their side, demonic flames were surging into the sky. A bloody aura permeated the entire area.<br/><br/>The suffocating aura made the experts of the Dragon Palace Alliance look a little embarrassed and solemn.<br/><br/>They tried their best to resist.<br/><br/>When Wang Xian saw this scene, a smile appeared on his face!<br/><br/>“Fire feather piercing!”<br/><br/>The Divine Roc of the Nine Heavens looked over. Without Wang Xian’s order, he charged over instantly.<br/><br/>His entire body turned into a flaming feather and charged directly towards the evil sequence camp.<br/><br/>His speed was so terrifying that it was not something a great dao expert could match!<br/><br/>“Huh?”<br/><br/>The Divine Roc of the Nine Heavens suddenly charged into the battlefield.<br/><br/>It made the Great Dao experts from the Dragon Palace Alliance and the evil sequence camp sense it first.<br/><br/>They looked over immediately.<br/><br/>“There’s an attack, attack, attack now!”<br/><br/>The Great Dao realm experts of the evil array faction focused their eyes and immediately roared!<br/><br/>Boom<br/><br/>However, the attack of the Nine Heavens Divine Roc was too sudden and terrifying.<br/><br/>The experts of the evil array faction didn’t react in time!<br/><br/>“Oh no, what’s This?”<br/><br/>“Save me!”<br/><br/>The dozen or so heaven origin creation realm experts that were attacked by the Nine Heavens Divine Roc felt the sudden arrival of death, and they shouted out in fear!<br/><br/>“Attack!”<br/><br/>Five Great Dao realm experts from the evil sequence camp instantly reacted.<br/><br/>The moment the Nine Heavens Divine Roc’s attack landed on the dozen or so heaven origin creation realm experts, they also launched an attack at the same time.<br/><br/>If the Divine Roc of the Nine Heavens were to take the full force attack of the Five Great Dao level powerhouses, he would still be injured!<br/><br/>However, the moment the Five Great Dao level powerhouses made their move…<br/><br/>In front of Wang Xian, the phantoms of two Great Dao level powerhouses appeared in front of him.<br/><br/>Crack Crack Crack Crack<br/><br/>Crack Crack<br/><br/>Wang Xian held onto the two phantoms in front of him. The Phantoms collapsed instantly.<br/><br/>Among the five evil sequence experts who attacked the Divine Roc, two of them lost their lives instantly.<br/><br/>They didn’t even have the time to resist.<br/><br/>They didn’t even have the time to use the life-saving treasure in their hands!<br/><br/>Instant Kill!<br/><br/>Instant Kill!<br/><br/>The other three Great Dao level experts were attacked by the Divine Roc.<br/><br/>However, their attacks could already be dodged by the Divine Roc.<br/><br/>When the Nine Heavens Divine Roc pierced through the bodies of more than ten heaven origin creation realm experts, it used its defense to directly block the attacks of the three Great Dao experts.<br/><br/>“Choo-choo!”<br/><br/>“Choo-choo!”<br/><br/>The Nine Heavens Divine Roc let out a cry and immediately retreated to the rear.<br/><br/>“Not good, more than ten of our experts have been killed!”<br/><br/>“Lord Yan Mo and Lord Austin have died. They suddenly died. How is this possible! ?”<br/><br/>The appearance of the Nine Heavens Divine Roc caused the bodies of more than ten heavenly fate realm experts to suddenly be pierced and die.<br/><br/>Coupled with the sudden death of two great dao experts, the expressions of all the evil sequence faction experts changed drastically!<br/><br/>What was going on?<br/><br/>“Not good, there’s an unknown enemy!”<br/><br/>The group of Great Dao experts revealed expressions of extreme shock when they saw the two great dao experts on their side suddenly die.<br/><br/>The two great dao experts on their side hadn’t suffered any attacks at all!<br/><br/>They hadn’t sensed anything at all!<br/><br/>How could they suddenly die?<br/><br/>One had to know that this was a great dao expert.<br/><br/>“A primal chaos expert of the fire attribute, is that the Dragon King?”<br/><br/>However, they didn’t have time to guess. At this time, some experts clearly saw the appearance of the Nine Heavens Divine Roc.<br/><br/>They felt the power coming from the Nine Heavens Divine Roc, and their pupils contracted slightly, revealing a shocked expression.<br/><br/>An existence at the primal chaos level.<br/><br/>Only an existence at the primal chaos level could rush over and kill more than ten heaven origin creation realm experts in an instant and release such power!<br/><br/>“This is? If It’s not the Dragon King, who is this?”<br/><br/>“An existence at the primal Chaos Realm. Is He here to help us?”<br/><br/>The expressions of the powerhouses from the Dragon Palace Alliance changed slightly when they saw this sudden scene. They looked at the Divine Roc of the Nine Heavens.<br/><br/>“Senior Divine Roc of the Nine Heavens!”<br/><br/>Prime Minister Gui smiled and shouted when he saw this!<br/><br/>“Hehe, more than 400 existences at the heaven origin blessed realm. Not Bad, not bad. This must be all the powers of the evil sequence faction!”<br/><br/>At this moment, Wang Xian flew over and arrived in front of the experts from the Dragon Palace Alliance!<br/><br/>“Dragon King!”<br/><br/>“Lord Dragon King!”<br/><br/>Seeing Wang Xian’s arrival, the experts from the Dragon Palace Alliance were delighted again.<br/><br/>They looked at the Divine Roc of the Nine Heavens before their eyes landed on Wang Xian again!<br/><br/>“Dragon King of the Dragon Palace? How is that possible? Hasn’t our Lord from the evil sequence faction already locked onto you?”<br/><br/>Upon seeing Wang Xian’s appearance, the expressions of the experts from the evil sequence faction changed drastically again as they growled in a low voice!<br/><br/>“With just those four trash from your evil sequence faction?”<br/><br/>Wang Xian spoke with slight disdain, “They came very quickly, but they fled very quickly as well. However, they won’t be able to escape from my palm. Naturally, your evil sequence faction wants to be destroyed. In that case, I’ll Grant Your Wish!”<br/><br/>As Wang Xian spoke, the shadows of two Great Dao level powerhouses gathered in front of him again.<br/><br/>Buzz Buzz<br/><br/>He stretched out his hand and grabbed at the two shadows again!<br/><br/>When the group of powerhouses from the evil sequence camp didn’t have any reaction or sense.<br/><br/>Among them, the corpses of two great dao level powerhouses fell directly downwards.<br/><br/>There were no signs.<br/><br/>There were no energy fluctuations.<br/><br/>The two great dao experts didn’t even have time to resist before they died instantly.<br/><br/>This strange scene, this sudden scene, reappeared once again.<br/><br/>This caused the more than 400 experts of the evil sequence camp to be stunned.<br/><br/>They looked at this scene in disbelief and shock.<br/><br/>Two more Great Dao existences had been silently and instantly killed!<br/><br/>How was this possible?\t\t\t\t\t\t</div>", "images": {}, "success": true}