{"id": 1523, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075956.html", "title": "Chapter 4526 - Chapter 4526: Stand By, 4525", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4526 - Chapter 4526: Stand By, 4525</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4526: Stand by, 4525<br/><br/>“Land of origin? Where’s the Dragon Palace Alliance?”<br/><br/>The Alliance leader of the Justice Alliance murmured and frowned!<br/><br/>“Alliance leader, Will the evil array faction attack the Dragon Palace Alliance? With their strength, the Dragon Palace Alliance won’t be able to stop them!”<br/><br/>An expert at the Great Dao realm couldn’t help but say!<br/><br/>“Nothing good will happen if they go to the Dragon Palace Alliance.”<br/><br/>The Alliance Master Thought for a while and said, “Contact the Dragon Palace Alliance and tell them about this. Also, tell them that we’re willing to help if the Dragon Palace Alliance is invaded!”<br/><br/>“Yes, Alliance Master!”<br/><br/>The experts of the Justice Alliance nodded slightly.<br/><br/>They understood what the alliance master meant.<br/><br/>The appearance of the Dragon Palace Alliance was beneficial to the Justice Alliance.<br/><br/>The Justice Alliance had always wanted to form an alliance with the Dragon Palace Alliance.<br/><br/>Once they formed an alliance, they would be completely unafraid of the evil sequence faction.<br/><br/>However, the last alliance was rejected by the Dragon Palace Alliance!<br/><br/>This time, they first passed the news to the Dragon Palace Alliance.<br/><br/>If the Dragon Palace Alliance was really invaded, the Justice Alliance would be willing to help.<br/><br/>This was because the evil sequence faction was stronger. If the Dragon Palace Alliance was really destroyed, then the evil sequence faction would receive a huge increase in strength.<br/><br/>At that time, they would face the evil sequence faction alone.<br/><br/>Therefore, the Dragon Palace Alliance could not be destroyed!<br/><br/>“Keep an eye on the evil sequence faction. If they really attack, wait for the Dragon Palace to speak First!”<br/><br/>“Isn’t little song in the land of origin? Keep in touch with him!”<br/><br/>The leader of the Justice Alliance continued to instruct.<br/><br/>Even if the evil sequence faction really wanted to destroy the Dragon Palace Alliance, the Dragon Palace Alliance’s strength was enough to hold on until their reinforcements arrived.<br/><br/>Therefore, they wouldn’t take the initiative to help. They would wait for the Dragon Palace to send out a request for help!<br/><br/>This way, the Dragon Palace Alliance would be even more grateful!<br/><br/>“HMM?”<br/><br/>At the same time, in the Dragon Palace of the nine-origin universe.<br/><br/>Not long after, Wang Xian received a message from Prime Minister Gui and a reminder from the Justice Alliance!<br/><br/>“Reply and thank the Justice Alliance for their reminder. Our Dragon Palace Alliance will be prepared.”<br/><br/>Wang Xian instructed Prime Minister Gui.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui nodded.<br/><br/>Wang Xian remembered the goodwill of the Justice Alliance.<br/><br/>He moved his palm and converted the power of chaos into divination power.<br/><br/>“1,500 years!”<br/><br/>Very soon, he obtained a vague time.<br/><br/>1,500 years later, the powerhouses from the evil sequence faction would rush over!<br/><br/>“I can’t absorb the resources either. However, the impact isn’t too great. It shouldn’t be too much of a problem for the Divine Roc of the Nine Heavens to recover to the primal Chaos Realm!”<br/><br/>Wang Xian mumbled.<br/><br/>Although the realm of the experts from the Dragon Palace was a little low, the dragon palace had more than enough treasures in the Tianyuan blessed realm.<br/><br/>There were more than ten of them.<br/><br/>With more than ten treasures in the Tianyuan blessed realm, the strength of the experts from the Dragon Palace would increase by a lot.<br/><br/>Over a thousand years passed quickly as they continued to absorb resources.<br/><br/>Meanwhile, the Justice Alliance had confirmed that the goal of the powerhouses from the evil sequence camp was the land of origin.<br/><br/>“We are only a few more decades away!”<br/><br/>In the Dragon Palace, Wang Xian opened his eyes and muttered.<br/><br/>He looked to the side. The Divine Roc of the Nine Heavens had recovered a portion of its strength.<br/><br/>It was enough to resist a chaos-level existence.<br/><br/>At this moment, Prime Minister Gui sent an urgent message through the communication device of the Dragon Palace Alliance!<br/><br/>“All the experts of the Dragon Palace Alliance, gather in the Dragon Palace base and come here immediately!”<br/><br/>The urgent message was sent to every expert.<br/><br/>The land of origin had been unified by the Dragon Palace. Besides the experts of the Dragon Palace, the Dragon Palace Alliance now had eight Heavenly Yuan realm experts.<br/><br/>The number of the remaining experts was around 180.<br/><br/>This was all the strength of the Dragon Palace Alliance.<br/><br/>Of course, if the strength of the Dragon Palace was added in, there would be more than 280.<br/><br/>This number of Heavenly Yuan blessed realm experts was already very high.<br/><br/>The Justice Alliance only had more than 300 heavenly yuan blessed realm experts.<br/><br/>The reason why there were so many Dragon Palace alliances was because of the Dragon Palace.<br/><br/>After all, the Dragon Palace alone had hundreds of heavenly yuan blessed realm powerhouses.<br/><br/>“What happened?”<br/><br/>“I don’t know. Prime Minister Gui sent an urgent message and asked all the powerhouses to come here. Something big must have happened. Otherwise, he wouldn’t be in such a hurry for us to come here.”<br/><br/>“Is Our Dragon Palace Alliance in Trouble?”<br/><br/>All the powerhouses flew toward the base of the Dragon Palace Alliance. They couldn’t help but ask when they saw the members who were rushing over.<br/><br/>Their faces were filled with astonishment.<br/><br/>This was the first time such an emergency gathering had happened!<br/><br/>Not long after, more than a hundred experts and most of the experts from the surrounding universes had arrived.<br/><br/>There were still some who hadn’t arrived. They were either in seclusion or in distant places.<br/><br/>When almost everyone had arrived, Prime Minister Gui walked in.<br/><br/>“Prime Minister Gui, is something wrong?”<br/><br/>The three great prophets of the divination universe had all arrived.<br/><br/>After arriving, they did divination, but they were unable to divine any information.<br/><br/>However, they had a vague feeling that something bad had happened!<br/><br/>“According to the information we received, all the experts from the evil sequence camp are rushing towards us. They don’t come with good intentions!”<br/><br/>Prime Minister Gui said!<br/><br/>“What?”<br/><br/>“How dare those experts from the evil sequence faction come to us? Damn them!”<br/><br/>“With our strength and the Dragon King’s presence, we might be able to resist the evil sequence faction.”<br/><br/>“These damn beasts want to attack the Dragon Palace Alliance?”<br/><br/>The experts from the Dragon Palace Alliance were full of anger.<br/><br/>“Don’t worry. All the experts can gather here. The Dragon King is free to make the arrangements!”<br/><br/>Prime Minister Gui said to them with a smile.<br/><br/>He wasn’t worried at all.<br/><br/>“HMM? is the Dragon King prepared?”<br/><br/>“With the Dragon King here, it won’t be easy for the evil array camp to deal with us!”<br/><br/>“That’s right. The Dragon King is at the primal chaos realm, and he’s not an ordinary primal chaos realm expert.”<br/><br/>“If the evil sequence faction dares to invade us, we will let them know the strength of our Dragon Palace Alliance!”<br/><br/>Seeing Prime Minister Gui’s smile and not the slightest bit of nervousness, everyone heaved a sigh of relief in their hearts.<br/><br/>The name of a man, the shadow of a tree.<br/><br/>The evil sequence faction, they were still very fearful!<br/><br/>Towards the evil sequence faction, every expert was filled with killing intent and hatred.<br/><br/>Even among the current champions of the Dragon Palace Alliance, there were those who had been wiped out by the evil sequence faction!\t\t\t\t\t\t</div>", "images": {}, "success": true}