{"id": 1525, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075966.html", "title": "Chapter 4528 - Chapter 4528: 4,527", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4528 - Chapter 4528: 4,527</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4528: 4,527<br/><br/>In the land of origin.<br/><br/>At this moment, in front of the Dragon Palace Alliance base.<br/><br/>More than 400 experts of the evil sequence faction, led by 15 great dao-level existences, flew over at a high speed, emitting monstrous flames!<br/><br/>“They’re coming! It’s the experts of the evil sequence faction! It’s them!”<br/><br/>“Hiss! More than 400 heaven creation-level existences! are all the experts from the evil sequence faction here?”<br/><br/>“I think so, Sirs. How many great dao-level existences and control-level existences are there among them?”<br/><br/>“Damn them! How dare they invade Our Dragon Palace Alliance? Our Dragon King won’t let them go!”<br/><br/>In the base of the Dragon Palace Alliance, a group of experts stared at the four hundred or so experts of the evil sequence faction, their expressions somewhat ugly.<br/><br/>The enemy’s power was too terrifying.<br/><br/>The enemy’s strength was too strong!<br/><br/>They were much stronger than their side!<br/><br/>“There are fifteen Great Dao experts in total, and more than two hundred control experts.”<br/><br/>The three prophets who had divined the universe stared at all the experts of the evil sequence faction who were rapidly flying over, their faces filled with a solemn expression. “This is almost all the power of the evil sequence faction, right?”<br/><br/>“What? The other party is so strong?”<br/><br/>The expressions of the experts from the Dragon Palace Alliance changed slightly when they heard the three prophets.<br/><br/>“Prime Minister Gui, with our strength, we are no match for the other party. Even if it’s defense, we can only hold on for a dozen days. Does the Dragon King have any other plans?”<br/><br/>The three prophets looked at Prime Minister Gui and asked solemnly!<br/><br/>“Hehe, don’t worry, we can hold out for a dozen days. That’s Enough!”<br/><br/>Prime Minister Gui smiled faintly. He hovered in the air and stared coldly at the experts of the evil sequence faction who had arrived in front of them.<br/><br/>“May I know why the experts of the evil sequence faction have come to the territory of the Dragon Palace Alliance?”<br/><br/>Prime Minister Gui stared at them and asked the obvious question!<br/><br/>“Hehehe!”<br/><br/>“What do you think we are doing here in the Dragon Palace Alliance?”<br/><br/>More than 400 heavenly yuan creator realm experts stopped in the void in front of them and glanced at all the experts of the Dragon Palace Alliance. Their faces were filled with coldness and mockery!<br/><br/>“Are you here to die? Aren’t you afraid that our Dragon King will attack your evil sequence alignment camp and target you?”<br/><br/>Prime Minister Gui stared at them and continued to speak indifferently!<br/><br/>“Hahaha, Your Dragon King? Kill his way into our evil sequence camp? Now That Your Dragon King can’t even protect himself, hahaha, you still want to kill your way into our evil sequence camp?”<br/><br/>“I’m afraid that they still don’t know that their doomsday is coming. As for the Dragon King of the Dragon Palace, so what if he’s a chaos-level existence? He’s still going to be killed by our Lord Soon, Haha!”<br/><br/>A few great dao-level existences in the evil sequence faction laughed maniacally.<br/><br/>“HMM? What? A chaos-level existence in the evil sequence faction has gone to the nine-origin universe? To deal with our Lord Dragon King?”<br/><br/>“How can the powerhouses of the evil sequence faction be so confident? Prime Minister Gui, will our Lord Dragon King Be Okay?”<br/><br/>The members of the Dragon Palace Alliance also changed their expressions slightly when they heard Prime Minister Gui’s words.<br/><br/>“Hehe!”<br/><br/>Prime Minister Gui smiled faintly, his face full of calmness.<br/><br/>“Hold on for a few days. The Dragon King will rush over.”<br/><br/>He glanced at the members of the Dragon Palace Alliance around him and said with a smile!<br/><br/>When the members saw Prime Minister Gui’s casual look, their eyes flickered slightly.<br/><br/>Obviously, the current situation was still under the Dragon King’s control.<br/><br/>…<br/><br/>“Ahhhhh!”<br/><br/>When the experts of the evil sequence faction arrived in front of the base of the Dragon Palace Alliance.<br/><br/>In front of the Dragon Palace, the Lord of Disaster’s scream suddenly sounded.<br/><br/>His body, which was like Black Fog, was twisted there.<br/><br/>The malevolent face that was formed was also constantly cracking.<br/><br/>It was as if he had suffered an extremely terrifying attack.<br/><br/>The Lord of disaster suddenly let out a blood-curdling scream, causing the other three chaos-level experts from the evil sequence faction to be completely stunned.<br/><br/>The Lord of Disaster’s strength was the strongest amongst them.<br/><br/>He was also the first existence amongst them to break through to the chaos level.<br/><br/>However, now, he seemed to have suffered an incomparably tragic attack.<br/><br/>“What’s the situation? What Happened?”<br/><br/>The expression of the chaos-level elder in the bamboo hat changed drastically. He scanned his surroundings warily and asked the Lord of disaster.<br/><br/>“Lord of Disaster!”<br/><br/>When the spirit kneader and the other six Great Dao experts saw this scene, their expressions also changed drastically.<br/><br/>“Sirs, the bird-type expert below isn’t the Dragon King of the Dragon Palace!”<br/><br/>The spirit kneader’s expression changed, and he hurriedly warned them!<br/><br/>“Hehe, evil sequence faction. I wonder who gave you the courage to come to my Dragon Palace. Since you are courting death, there is no need for you to exist anymore!”<br/><br/>Wang Xian flew out from the dragon palace at this moment.<br/><br/>He held the Phantom of the Lord of disaster in his palm and continuously cursed and killed him.<br/><br/>However, it was impossible for a chaos-level existence to kill him instantly.<br/><br/>Even if Wang Xian’s current strength had improved, it would still take him more than ten minutes to kill the curse!<br/><br/>“Ah, save me. Help me quickly. I can feel an extremely terrifying and strange energy consuming my life. Quick, save me!”<br/><br/>At this moment, the Lord of disaster let out a terrified cry for help. His body flew towards a distant location in a hurry.<br/><br/>He felt that the terrifying attack he suffered had something to do with the Dragon Palace!<br/><br/>“Can you escape?”<br/><br/>Wang Xian looked at them mockingly. Waves of terrifying energy were destroying the shadow of the Lord of Disaster!<br/><br/>“Damn it, it’s the Dragon King’s Trick!”<br/><br/>“What kind of attack is this? Let’s Go Save the Lord of Disaster First!”<br/><br/>The other three primal chaos level existences saw the Lord of disaster flying to a distant location.<br/><br/>They swept their gaze across Wang Xian and the Divine Roc of the Nine Heavens before flying towards the Lord of calamity hurriedly.<br/><br/>The expressions of the spirit kneader and the other six Great Dao level existences changed drastically as they flew over hurriedly.<br/><br/>They couldn’t understand why such a scene would happen!<br/><br/>Wang Xian looked at their figures indifferently with a mocking expression on his face.<br/><br/>At this moment, Wang Xian had already captured all of their auras.<br/><br/>It was useless for them to hide or leave.<br/><br/>Unless he killed them, it would be easier for them to be killed by Wang Xian if they left!<br/><br/>“Lord of Calamity, what happened? What attack did you suffer from?”<br/><br/>The chaos-level elder wearing a bamboo hat flew to the front of the Lord of Calamity and asked with an embarrassed expression.<br/><br/>The four chaos-level existences had come with great confidence to kill the Dragon King of the Dragon Palace.<br/><br/>Now, they had just arrived and were attacked for no reason.\t\t\t\t\t\t</div>", "images": {}, "success": true}