{"id": 1522, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075951.html", "title": "Chapter 4525 - Chapter 4525: 4524 Evil Sequence Faction, All Of You, Move Out!", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4525 - Chapter 4525: 4524 Evil Sequence Faction, All Of You, Move Out!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4525: 4524 evil sequence faction, all of you, move out!<br/><br/>Wang Xian had been monitoring the six powerhouses behind the evil sequence faction’s spirit kneader for thousands of years!<br/><br/>For the past thousands of years, they had been investigating the situation of the black hole teleportation formation.<br/><br/>Indeed, they had obtained some information.<br/><br/>The existence of the black hole teleportation formation could not be hidden. After all, all the powerhouses would have to use the black hole teleportation formation to teleport in the future.<br/><br/>Therefore, they also knew that the Justice Alliance had obtained a powerful teleportation formation from the Dragon King of the Dragon Palace.<br/><br/>“Let’s go back. We have to destroy the Dragon Palace alliance before this black hole teleportation formation is completed!”<br/><br/>After getting all the information they wanted, the people from the spirit kneader and the rest took out their treasures with smiles on their faces and disappeared in an instant.<br/><br/>Through the treasures, they returned to the evil sequence camp.<br/><br/>After they disappeared, Wang Xian appeared slowly. He looked at the direction where they disappeared with a smile on his face.<br/><br/>“Hehe!”<br/><br/>He smiled and returned to the Dragon Palace in a flash!<br/><br/>Wang Xian didn’t need to worry too much about the upcoming invasion of the evil sequence camp. He didn’t even need to prepare too much.<br/><br/>He only informed Prime Minister Gui about the news and asked him to make some preparations before continuing to absorb the resources!<br/><br/>In addition, he sensed the Divine Roc of the Nine Heavens who was recovering its strength.<br/><br/>The Divine Roc of the Nine Heavens was absorbing the resources, but it had yet to recover to the primal chaos level.<br/><br/>After all, it was not so easy to recover the strength of a Great Dao!<br/><br/>Fortunately, it would be soon!<br/><br/>Wang Xian’s time domain covered it and accelerated his recovery!<br/><br/>After Prime Minister Gui received Wang Xian’s information, he immediately gave an order.<br/><br/>The powerhouses of the Dragon Palace should not leave the nine-origin universe or the Dragon Palace Alliance base for the time being!<br/><br/>Be prepared for battle!<br/><br/>Prime Minister Gui was aware of the Dragon King’s strength, so he did not make too many preparations!<br/><br/>The more preparations they made, the more likely it would alert the evil sequence camp.<br/><br/>If that was the case, it would be difficult to wipe them out in one fell swoop!<br/><br/>Wang Xian arrived at the Dragon Palace. At the same time, the six great dao-level powerhouses from the illusionary realm of the spiritual kneader had arrived at the central universe of the evil sequence faction!<br/><br/>In the evil sequence faction, chaos-level existences were high and mighty.<br/><br/>They ruled over all the powerhouses and all the universes.<br/><br/>Every time there was a big battle, the powerhouses under them would provide them with sufficient treasures and resources.<br/><br/>They even set a rule for their subordinates that they had to hand over as many resources as possible over the years.<br/><br/>They had absolute dominance.<br/><br/>When the six Great Dao level great beings arrived, they immediately reported all the information they had received.<br/><br/>“Get up immediately!”<br/><br/>Disaster master glanced at the other three primal chaos level beings and said!<br/><br/>“Take action immediately. We’ll take the six of them to the nine-origin Universe Dragon Palace. We’ll leave the Dragon Palace Alliance in the land of origin to them!”<br/><br/>The old man wearing a blood-red bamboo hat said.<br/><br/>“Okay.”<br/><br/>The other chaos-level existences nodded.<br/><br/>Their faces slowly revealed a grim expression.<br/><br/>This time, they were prepared to use all the power of the evil sequence faction to deal with the Dragon Palace Alliance.<br/><br/>They brought six great dao-level experts to destroy the nine-origin Universe Dragon Palace.<br/><br/>The Dragon Palace wasn’t weak. There were hundreds of heaven origin creation-level powerhouses.<br/><br/>These hundreds of heaven origin creation-level powerhouses could also fight against two chaos-level powerhouses.<br/><br/>Therefore, they needed six great dao-level powerhouses to deal with the powerhouses of the Dragon Palace.<br/><br/>As for the four of them, they mainly wanted to destroy the Dragon King of the Dragon Palace.<br/><br/>As long as they destroyed the Dragon King of the Dragon Palace, the entire Dragon Palace Alliance would completely collapse!<br/><br/>The four chaos-level existences of the evil sequence faction immediately gave the order.<br/><br/>Attack!<br/><br/>They led the spirit kneader and the other six great dao-level powerhouses and immediately flew toward the origin universe.<br/><br/>At the evil sequence faction, all the Heavenly Yuan creation-level powerhouses immediately moved.<br/><br/>This time, there were no lower-level heavenly yuan creation-level powerhouses taking action.<br/><br/>They were all powerhouses.<br/><br/>More than 400 heavenly yuan creation realm powerhouses flew toward the land of origin.<br/><br/>The 400 Heavenly Yuan creation realm powerhouses were led by 15 Great Dao realm powerhouses.<br/><br/>Their bodies were emitting monstrous demonic flames as they sped through the chaotic space.<br/><br/>“Hehehe, we can get a lot of resources by destroying the Dragon Palace Alliance this time.”<br/><br/>“There are fifty to sixty universes in the land of origin. The resources there are extremely rich, and there are countless amounts of blood and food. hahaha!”<br/><br/>“We’ll first destroy the Dragon Palace Alliance and then the Justice Alliance. Our strength will increase dramatically!”<br/><br/>The eyes of the 400 or so heaven origin creation realm experts from the evil array faction were filled with excitement.<br/><br/>As long as they killed and invaded, they would be able to improve quickly.<br/><br/>The entire evil sequence faction’s powerhouses started to move.<br/><br/>And with so many heaven creation realm powerhouses moving at the same time, they didn’t hide it from the Justice Alliance.<br/><br/>The Justice Alliance and the evil sequence faction had been fighting for countless years. Both sides had infiltrated and planted spies.<br/><br/>However, the spies that the Justice Alliance planted did not have the existence of the Heavenly Kismet Realm.<br/><br/>“Eh? Alliance master, according to the information we have, almost all the Heavenly Kismet realm powerhouses in the evil sequence faction have gathered together. They seem to be making a big move!”<br/><br/>In a hall in the justice universe.<br/><br/>Such a big move by the evil sequence faction had immediately attracted the attention of the Justice Alliance.<br/><br/>They immediately reported the information to the Alliance leader.<br/><br/>They had to be careful when it involved the actions of hundreds of heaven creation realm powerhouses!<br/><br/>“HMM? Can we confirm the movements of the evil sequence faction’s powerhouses?”<br/><br/>The Justice Alliance leader also asked with a solemn expression.<br/><br/>“We haven’t received any specific information yet. This time, there are no disciples below Heaven Creation realm participating. Currently, we know that at least two hundred heaven creation realm powerhouses are on the move.”<br/><br/>His subordinate reported.<br/><br/>“Keep a close eye on them. Determine their location and determine their direction.”<br/><br/>Justice Universe Alliance Master ordered with a frown.<br/><br/>“It’s Alliance Master!”<br/><br/>His subordinate immediately replied.<br/><br/>Time passed bit by bit. The Justice Alliance had increased their investigation of the Great Beings from the evil sequence camp.<br/><br/>After 2,000 years, they finally received another important piece of information!<br/><br/>“Alliance master, something big has happened. According to the reliable information we received, all the Heaven’s fate realm powerhouses from the evil sequence faction have been mobilized. They are suspected to be heading toward the land of origin.”<br/><br/>The Justice Alliance powerhouses reported to the Justice Alliance Master in Shock!<br/><br/>They had never expected that all the Heaven’s fate realm powerhouses from the evil sequence faction had been mobilized.<br/><br/>With so many champions on the move, what were they going to do?\t\t\t\t\t\t</div>", "images": {}, "success": true}