{"id": 1527, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075976.html", "title": "Chapter 4530 - Chapter 4530: Under The Fear Of The Four Mighty Ones", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4530 - Chapter 4530: Under The Fear Of The Four Mighty Ones</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4530: Under the fear of the four mighty ones<br/><br/>“Boom! Boom! Boom!”<br/><br/>The three great dao-level mighty ones from the evil sequence faction locked their eyes on Wang Xian.<br/><br/>They waved their arms and waves of extremely powerful energy attacked Wang Xian.<br/><br/>“Hehe, are you looking down on me? Although I haven’t recovered to my peak, it shouldn’t be a problem for me to crush all of you one-on-one.”<br/><br/>When the Divine Roc of the Nine Heavens saw the evil sequence faction and the three primal chaos level existences attacking Wang Xian, his face was filled with a cold expression.<br/><br/>He flapped his enormous wings and went straight for the powerhouse whose head was connected by countless tentacles.<br/><br/>The towering flames turned into Firebirds that possessed the power to destroy the world.<br/><br/>Buzz! Buzz<br/><br/>The moment the Divine Roc of the Nine Heavens rushed out.<br/><br/>All the buildings in the entire Dragon Palace were emitting a wave of energy.<br/><br/>All the energy connected together to form a huge net that covered the sky.<br/><br/>The buildings in the Dragon Palace were comparable to fifteen ultimate treasures of the Heaven’s origin!<br/><br/>What was the concept of fifteen ultimate treasures of the Heaven’s origin?<br/><br/>This was a power that could suppress existences who had just stepped into the chaos realm.<br/><br/>In particular, these 15 heaven origin destiny-level treasures were personally forged by Wang Xian. Their energy could resonate.<br/><br/>They could release a huge net together.<br/><br/>This huge net covered the surroundings of the Dragon Palace. All enemies could trap it instantly.<br/><br/>Even existences who had just stepped into the chaos level could be trapped instantly.<br/><br/>The Nine Heavens Divine Roc locked onto an expert from the evil sequence camp.<br/><br/>The Dragon Palace’s net was heading toward a chaos-level existence!<br/><br/>At this moment, the three chaos-level existences from the evil sequence faction were stunned.<br/><br/>Whether it was the Nine Heavens Divine Roc or the sky-shrouding net, these waves of energy weren’t weaker than their own.<br/><br/>In fact, they were even stronger.<br/><br/>The sky-shrouding net was heading toward sword demon axe!<br/><br/>“What?”<br/><br/>Sensing the power coming from the Dragon Palace, the four chaos-level existences in the evil sequence faction were completely stunned!<br/><br/>They were all shocked!<br/><br/>They dared to attack the Dragon Palace and destroy the Dragon Palace Alliance.<br/><br/>It was because according to the information they had received, the Dragon Palace only had one chaos-level existence.<br/><br/>As long as they destroyed it, the entire land of origin would be theirs.<br/><br/>However, the strength displayed by the Dragon Palace had shocked them.<br/><br/>The strength displayed by the Dragon Palace alone was not weaker than theirs.<br/><br/>“How is this possible? How can the Dragon Palace be so strong?”<br/><br/>The six great dao-level existences from the evil sequence faction, the spirit kneader, and the rest looked at the Dragon Palace in shock.<br/><br/>“Hehe, leave the two of you to me!”<br/><br/>Wang Xian locked his gaze on the old man with the bamboo hat and moved.<br/><br/>Under the coverage of the time domain, he instantly arrived in front of the old man with the bamboo hat.<br/><br/>At this moment, the powerhouse with the bamboo hat had the same fear as the Lord of disaster.<br/><br/>His speed was too fast.<br/><br/>It was so fast that even chaos-level existences like them couldn’t react in time.<br/><br/>This was terrifying!<br/><br/>His bamboo hat formed a sea of blood and swept towards Wang Xian.<br/><br/>It completely enveloped the surrounding area and launched a large-scale attack.<br/><br/>Thump<br/><br/>Wang Xian condensed the power of chaos into a long spear and pierced forward.<br/><br/>The terrifying power penetrated the sea of blood and landed in front of the old man in the bamboo hat.<br/><br/>When the old man with the bamboo hat saw this scene, his pupils constricted slightly and a look of astonishment appeared on his face.<br/><br/>His body instantly distorted, and the long spear that was supposed to pierce through his head directly pierced through one of his arms.<br/><br/>Even so, his entire arm instantly dissipated!<br/><br/>“Help me, I’m not his match. This Dragon King’s strength is too terrifying!”<br/><br/>The old man with the bamboo hat was terrified at this moment.<br/><br/>They felt that this wasn’t the power of chaos at all.<br/><br/>It was too easy for the other party to injure them.<br/><br/>They couldn’t defend against it at all.<br/><br/>They weren’t on the same level at all.<br/><br/>This made him terrified.<br/><br/>How could there be such a terrifying existence?<br/><br/>“The Dragon Palace’s strength is seven or eight times stronger than we thought!”<br/><br/>“We’re not their match at all!”<br/><br/>At this moment, sword demon axe roared from the side with blood-red eyes.<br/><br/>He held a heaven creation-level greatsword and kept slashing the sky-covering net.<br/><br/>At this moment, he was also terrified!<br/><br/>Below him, the building of the Dragon Palace was emitting an unparalleled radiance.<br/><br/>The net formed by the radiance completely covered him.<br/><br/>He realized that he could not dodge it at all.<br/><br/>Streams of energy kept covering him.<br/><br/>His attacks couldn’t break through the defense of the net.<br/><br/>He thought that once he broke through to the primal chaos level, he would be able to stand at the peak of the primal chaos.<br/><br/>He would be able to become a peak existence.<br/><br/>However, the scene in front of him made him a little dazed.<br/><br/>This feeling only existed when he was weak.<br/><br/>“Retreat, retreat immediately!”<br/><br/>The chaos-level powerhouse who was locked onto by the Divine Roc of the nine heavens shouted sternly when he saw the situation in front of him.<br/><br/>The Dragon Palace was invincible!<br/><br/>The strength of the Dragon Palace had exceeded their expectations!<br/><br/>“Retreat!”<br/><br/>The elder in the bamboo hat and the others immediately agreed.<br/><br/>Retreat!<br/><br/>Escape!<br/><br/>They were no match for the Dragon Palace at all!<br/><br/>A few chaos-level existences from the evil array faction immediately took out their escape treasures!<br/><br/>“Can we escape?”<br/><br/>Wang Xian looked at them and asked calmly.<br/><br/>At this moment, his palm grabbed forward once again.<br/><br/>The dark figure of the Lord of disaster started to crumble slowly!<br/><br/>He was already severely injured. Now, his body was facing death!<br/><br/>“No!”<br/><br/>The Lord of disaster screamed in pain. All the life force in his body was completely gone!<br/><br/>“What! ?”<br/><br/>“Our Lord of Disaster Is Dead!”<br/><br/>“This… is the dragon palace even stronger than the evil sequence alignment camp?”<br/><br/>At this moment, not far away, the four great dao experts from the spirit kneader and the others looked on in shock.<br/><br/>The Lord of Disaster’s body fell down.<br/><br/>The other three lords used powerful treasures and prepared to instantly retreat!<br/><br/>The expressions of the six of them changed drastically. They also took out their escape treasures and began to flee without any hesitation!<br/><br/>Buzz Buzz Buzz<br/><br/>Buzz Buzz Buzz<br/><br/>They used their treasures and began to teleport away one by one.<br/><br/>Wang Xian did not stop them.<br/><br/>All he needed to do was to remember the auras of these guys.<br/><br/>In addition, there were more than 400 strong cultivators from the evil sequence faction in the land of origin. They were waiting for him to slaughter them!<br/><br/>Buzz<br/><br/>With a wave of his arm, he kept the corpse of the Lord of disaster away.<br/><br/>Following that, a surge of energy enveloped the Divine Roc of the Nine Heavens!<br/><br/>“Let’s go to the land of origin!”<br/><br/>Wang Xian instructed the Divine Roc of the Nine Heavens!<br/><br/>The next moment, Wang Xian brought him to the base of the Dragon Palace Alliance in an instant.<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>When they arrived at the base of the Dragon Palace, they could sense a terrifying energy fluctuation in the sky in front of them!<br/><br/>A great war broke out here!\t\t\t\t\t\t</div>", "images": {}, "success": true}