{"id": 1520, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075941.html", "title": "Chapter 4523 - Chapter 4523: 4522 Controlled Dragon Palace Powerhouses", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4523 - Chapter 4523: 4522 Controlled Dragon Palace Powerhouses</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4523: 4522 controlled Dragon Palace powerhouses<br/><br/>“Damn Dragon Palace Dragon King, this time, your death is coming.”<br/><br/>“Not only do you have to die, I will also destroy all the powerhouses and disciples of Your Dragon Palace. I will imprison their souls and torture them ruthlessly.”<br/><br/>“This is the result of you going against our evil sequence camp. This is the result of you daring to kill me!”<br/><br/>The spirit kneader flew out from the central universe of the evil sequence faction. His face was filled with malevolence and excitement.<br/><br/>The Four Masters of the evil sequence faction were going to make a move against the Dragon Palace Alliance.<br/><br/>In his opinion, the Dragon Palace Alliance would definitely die!<br/><br/>He took out his communication device and immediately passed this news to the illusion world and heaven’s occupation.<br/><br/>When Heaven’s occupation in the illusion world received the news, they immediately rushed over to his side!<br/><br/>Back then, the people who were killed by Wang Xian were not only the spirit kneader, but also the heavenly occupation in the illusory realm.<br/><br/>In the nine-origin universe, they slaughtered a large number of creatures in the universe and obtained a large number of treasures.<br/><br/>But in the end, all their treasures and resources were snatched away by the Dragon King.<br/><br/>Now that the opportunity for revenge had come, they naturally would not let it go.<br/><br/>They wanted to make the Dragon Palace and the Dragon King pay a hundred times, a thousand times the price!<br/><br/>The three Great Dao experts quickly gathered and gathered a few great dao experts. They quickly headed toward the land of origin.<br/><br/>They wanted to obtain all the information about the Dragon Palace Alliance within 10,000 to 20,000 years.<br/><br/>They wanted to launch an attack before the teleportation array between the Justice Alliance and the Dragon Palace Alliance opened!<br/><br/>Time passed day by day.<br/><br/>Using special treasures, the six figures arrived at the land of origin several thousand years later, and they quickly received some information.<br/><br/>“Tian Chen, do a divination and find an expert who has just entered the Heavenly Yuan creation realm from the Dragon Palace. Then, Brother Soul Guide, control him!”<br/><br/>The six people arrived at a place in the land of origin, and the soul kneader looked at Tian Chen and another great dao expert.<br/><br/>This expert’s strength was even stronger than the spirit kneader’s aura.<br/><br/>Even the spirit kneader had to treat him with respect!<br/><br/>This mission to find information about the Dragon Palace Alliance was given to the spirit kneader by the four chaos-level existences from the evil sequence faction.<br/><br/>The other great dao-level experts from the evil sequence faction had to cooperate!<br/><br/>In addition, the spirit kneader had a very strong background in the evil sequence faction.<br/><br/>That chaos level existence wearing a bamboo hat was the spirit kneader’s grandfather!<br/><br/>Because of this, the position of the Spirit Kneader in the evil sequence faction was very high!<br/><br/>“No Problem!”<br/><br/>The figure called Soul Guide nodded.<br/><br/>This expert’s entire body was purple. Although he had the shape of a human, he didn’t have a physical body.<br/><br/>His body was constantly swaying, and sharp spikes were constantly stabbing out!<br/><br/>This was an expert from a special race.<br/><br/>Heaven’s duty had the power of divination, so divining an expert who had just entered the Heavenly Yuan blessed realm wasn’t a big problem.<br/><br/>Soon, he locked onto a position.<br/><br/>“Let’s Go!”<br/><br/>The six concealed their figures and quickly approached the base of the Dragon Palace Alliance in the land of origin!<br/><br/>Not long after, they saw four figures in front of them.<br/><br/>“Four powerhouses who have just entered the Heavenly Yuan realm. Humph, if I wasn’t afraid of alerting them, I would have killed them all right now!”<br/><br/>The Spirit kneader stared at the four powerhouses of the Dragon Palace alliance with hatred.<br/><br/>“Leave it to me.”<br/><br/>The powerhouse called Soul Guide looked at the four powerhouses of the Dragon Palace in front of him and stretched out a thin purple energy from his arm.<br/><br/>The purple energy was like a string, and it quickly attacked the four experts of the Dragon Palace!<br/><br/>The four experts of the Dragon Palace who were flying toward the land of origin didn’t sense anyone attacking them.<br/><br/>Suddenly, the bodies of the four experts of the dragon palace trembled, and their pupils turned purple!<br/><br/>“Sleep!”<br/><br/>Soul-pulling shouted, and the three experts of the Dragon Palace fell to the ground. Only one of them stood there in a daze.<br/><br/>“Listen to me!”<br/><br/>Staring at the last powerhouse of the Dragon Palace who was standing, soul lead ordered.<br/><br/>“Yes, Sir!”<br/><br/>The controlled powerhouse of the Dragon Palace turned around to look at him and replied in a daze.<br/><br/>“Is the Dragon King of Your Dragon Palace in the Dragon Palace? Also, how many powerhouses in the Heavenly Yuan blessed realm and how many Great Dao powerhouses are there in Your Dragon Palace?”<br/><br/>Staring at the last powerhouse of the Dragon Palace, soul lead asked.<br/><br/>“I don’t know if the Dragon King is in the Dragon Palace either. There are hundreds of heavenly Yuan realm experts and only one great dao realm expert in our Dragon Palace.”<br/><br/>The expert of the Dragon Palace replied in a Daze!<br/><br/>“HMM? The number of heavenly Yuan realm experts far exceeds our expectations. However, the more heavenly Yuan realm experts there are, the greater our gains will be!”<br/><br/>A Great Dao realm expert beside him said in surprise and joy when he heard this!<br/><br/>“There’s only one Great Dao realm expert, Hehe!”<br/><br/>The spirit kneader also laughed when he heard this. He looked at lead soul and said, “Brother lead soul, it will be troublesome to determine if the Dragon King is in the Dragon Palace. If he isn’t, it will be troublesome!”<br/><br/>“There won’t be any trouble. As long as we start to invade them, the Dragon King of the Dragon Palace will definitely come back immediately. However, we still have to investigate. Next, I will control his body to investigate.”<br/><br/>As he said that, he waved his arm and countless purple strings entered the body of the Dragon Palace’s powerhouse.<br/><br/>Soon, the purple light in the hole of the Dragon Palace’s powerhouse disappeared and he completely recovered.<br/><br/>“My Lord!”<br/><br/>He looked at lead soul and bowed respectfully!<br/><br/>“Go to the Dragon Palace and check if the Dragon King is inside!”<br/><br/>Lead Soul ordered him.<br/><br/>“Yes, my Lord!”<br/><br/>This powerhouse of the Dragon Palace was under a deeper control.<br/><br/>He moved and immediately flew toward the headquarters of the Dragon Palace Alliance in the land of origin!<br/><br/>“Let’s wait here for the news!”<br/><br/>Soul Guide said to Spirit KNEADER and the others.<br/><br/>Spirit kneader and the others nodded and waited quietly.<br/><br/>This powerhouse of the Dragon Palace quickly came to the Palace of the Dragon Palace Alliance base.<br/><br/>Then, he arrived at the location of the teleportation array.<br/><br/>The teleportation array of the land of origin and the Dragon Palace had been built tens of millions of years ago!<br/><br/>However, it would take more than ten transfers to teleport back to the Dragon Palace!<br/><br/>A few years later, he appeared in the teleportation array of the Dragon Palace through more than ten transfers.<br/><br/>When he arrived at the Dragon Palace, he flew directly toward the Dragon King Palace.<br/><br/>When he arrived at the front of the Dragon King Palace, he did not go deep into it. Instead, he sensed it.<br/><br/>After confirming it, he flew toward the teleportation formation again.<br/><br/>“HMM?”<br/><br/>However, at the same time, Wang Xian was absorbing the resources in the Dragon King Palace and converting them into the power of chaos.<br/><br/>At this moment, he suddenly sensed something. An invisible power of chaos swept over.<br/><br/>Following that, a look of astonishment appeared on his face.<br/><br/>“He’s being controlled?”<br/><br/>Wang Xian’s gaze focused as he mumbled, “To be able to control a powerhouse who has just entered the Heaven’s origin realm, he must be at least at the control level or even higher.”<br/><br/>“Is this… is this to deal with the Dragon Palace? or?”\t\t\t\t\t\t</div>", "images": {}, "success": true}