{"id": 1526, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075971.html", "title": "Chapter 4529 - Chapter 4529: In The Fear Of The Four Great Experts", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4529 - Chapter 4529: In The Fear Of The Four Great Experts</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4529: In the fear of the four great experts<br/><br/>“I don’t know what kind of attack I have suffered. The life force in my body is rapidly disappearing. An extremely terrifying energy is continuously corroding my body!”<br/><br/>“Quick, inject the energy into my body and help me get rid of this strange energy!”<br/><br/>There was a trace of fear on the disaster Lord’s face as he hurriedly shouted at the other three primal chaos existences.<br/><br/>This strange attack caused him to be unable to react in time.<br/><br/>Ever since he broke through to the primal chaos realm, this was the first time he had encountered such a terrifying attack.<br/><br/>“Alright.”<br/><br/>The other three primal chaos existences from the evil sequence faction didn’t hesitate at all as they immediately injected waves of energy into his body!<br/><br/>“I can sense it! !”<br/><br/>The three powerhouses immediately sensed the strange energy in his body and wrapped it with energy to stop it!<br/><br/>“Huh?”<br/><br/>At the same time, in the sky above the Dragon Palace, Wang Xian sensed that his curse was being resisted. A smile appeared on his face.<br/><br/>“It’s just delaying the time of death by an hour!”<br/><br/>Wang Xian did not mind. A smile appeared on his face.<br/><br/>At this moment, even if they were to join forces, they weren’t his match. Furthermore, Wang Xian was going all out to deal with one of them.<br/><br/>Even if they were to help him defend, they wouldn’t be able to withstand it.<br/><br/>This was because the terrifying attack of the cursed demon spirit was indeed strange!<br/><br/>“How is this possible? We can’t get rid of this energy at all. Even if the four of US join forces, we can’t Stop It!”<br/><br/>At this moment, sword demon axe and the others revealed terrified expressions.<br/><br/>They injected all of their energy into the Lord of Disaster’s body.<br/><br/>They could sense that strange energy.<br/><br/>However, they couldn’t get rid of it.<br/><br/>They could only delay the attack of this cursed power, but they couldn’t completely get rid of this cursed power.<br/><br/>“Impossible, how is this possible? Even with your help, it would only prolong the time of death of my body for an hour. What kind of curse is this?”<br/><br/>The Lord of disaster could not help but roar in horror!<br/><br/>“It must be that Dragon King who obtained a powerful treasure and used it to curse you, Lord of Disaster!”<br/><br/>The old man wearing the bamboo hat roared in a low voice with a solemn expression!<br/><br/>“Damn it!”<br/><br/>A cold expression appeared on the Lord of Disaster’s face.<br/><br/>His body shook, and his incomparably savage face broke free from his black mist-like body!<br/><br/>It was as if he was giving up on stripping off his body!<br/><br/>After his face was stripped off, the black mist-like body quickly lost its vitality.<br/><br/>“Damn Dragon King of the Dragon Palace, he made me suffer such heavy losses. I want to drink his blood and eat his flesh!”<br/><br/>The Lord of disaster roared with killing intent.<br/><br/>“The Dragon Palace is stronger than we thought. They have more than one chaos-level existence.”<br/><br/>Axe sword demon said solemnly!<br/><br/>“Ah!”<br/><br/>“What? The power of the curse has been transferred to my current body. Not Good!”<br/><br/>However, at this moment, the Lord of Disaster’s scream sounded once again.<br/><br/>This caused the expressions of the other three primal chaos experts to change slightly.<br/><br/>“How is this possible? Lord of Disaster, your great life fog transfer technique can transfer all injuries. How can it be attacked again?”<br/><br/>The expressions of the others changed drastically as they spoke!<br/><br/>“I can only hold on for five minutes. Kill that Dragon King. Kill him. Only by killing him can I stop this curse.”<br/><br/>The Lord of Disaster Roared in fear!<br/><br/>“Do it, do it, do it now!”<br/><br/>He gritted his teeth and immediately flew toward the Dragon Palace!<br/><br/>The expressions of axe sword demon and the other chaos-level experts changed, and they immediately followed behind.<br/><br/>Do It!<br/><br/>Do It Now!<br/><br/>The Lord of disaster was currently under a terrifying attack, and he could only hold on for five minutes.<br/><br/>They had to inflict heavy losses on the Dragon Palace within these five minutes. They had to even destroy the Dragon King!<br/><br/>Boom! Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>The Lord of disaster took the lead and flew over. His body carried an extremely terrifying aura.<br/><br/>His extremely hideous face stared at Wang Xian.<br/><br/>“Die!”<br/><br/>The monstrous demonic aura and the suffocating bloody aura condensed into countless hideous faces. They opened their mouths wide and attacked Wang Xian like devils from hell!<br/><br/>“Accelerating death?”<br/><br/>Wang Xian looked at him with a mocking and disdainful expression.<br/><br/>If the four of them were to join forces, it would take him some time to kill them.<br/><br/>However, if one of them were to attack him alone, he would be courting death!<br/><br/>Buzz<br/><br/>Wang Xian’s body trembled and his time domain spread out in all directions.<br/><br/>Before the Lord of Calamity’s attack could reach him…<br/><br/>Wang Xian had already arrived in front of him.<br/><br/>Boom<br/><br/>The power of chaos transformed into pure light power and headed straight for the Lord of Calamity!<br/><br/>“What?”<br/><br/>The Lord of Calamity’s expression changed drastically when he saw Wang Xian instantly appearing in front of him and seeing such a terrifying attack!<br/><br/>“Ahhhh!”<br/><br/>His extremely ferocious face seemed to have been torn apart.<br/><br/>A wisp of black fog teleported to the side.<br/><br/>The ferocious face that he had left behind was instantly erased by Wang Xian!<br/><br/>“What?”<br/><br/>Behind him, axe sword demon and the rest who were following closely behind saw this scene and their expressions changed drastically!<br/><br/>The Lord of Calamity, who had escaped with his powerful talent, had a face full of horror!<br/><br/>Although he was not in his peak condition, it was impossible for him to be so powerless to retaliate!<br/><br/>How was this possible?<br/><br/>“Buzz!”<br/><br/>However, before he could think too much, he saw the extremely terrifying dragon king in front of him, holding his own shadow in his hand.<br/><br/>He grabbed with all his might!<br/><br/>In the next instant, his body trembled violently. The feeling of impending death had descended!<br/><br/>“Weng!”<br/><br/>Purple energy bloomed on his body.<br/><br/>It formed the shape of a flower.<br/><br/>However, the moment the flower bloomed, it quickly withered.<br/><br/>This was the life-saving treasure of the Master of disaster.<br/><br/>Furthermore, it had been nurtured with powerful energy.<br/><br/>After being nurtured for countless years, it was sufficient for him to withstand the attacks of primal chaos realm experts.<br/><br/>However, the life-saving treasure that had been nurtured for countless years had dissipated in an instant.<br/><br/>Even though it had helped him to withstand the terrifying attack, it still made him extremely fearful!<br/><br/>“You have many tricks up your sleeve!”<br/><br/>Wang Xian looked at this scene and spoke indifferently.<br/><br/>However, the Phantom of the Lord of Calamity was still in front of him.<br/><br/>He grabbed at the Phantom once again!<br/><br/>When the Lord of calamity saw this scene, he was stunned!<br/><br/>At this moment, how could he not understand that the Phantom in front of the Dragon King was him.<br/><br/>He was under the control of the other party and could be easily crushed to death!<br/><br/>“Stop him!”<br/><br/>The Lord of Calamity roared at the other three chaos-level experts in the evil faction!<br/><br/>“Attack!”<br/><br/>The other three chaos-level existences in the evil faction also knew that the Lord of Calamity’s current situation wasn’t good, and the vast energy in their bodies boiled.\t\t\t\t\t\t</div>", "images": {}, "success": true}