{"id": 1538, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15076031.html", "title": "Chapter 4541 - Chapter 4541: 3540 Destroyed The Evil Sequence Faction 6", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4541 - Chapter 4541: 3540 Destroyed The Evil Sequence Faction 6</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4541: 3540 destroyed the evil sequence faction 6<br/><br/>“Weng Weng Weng Weng!”<br/><br/>“Weng Weng Weng Weng!”<br/><br/>At the center of the evil sequence universe, bright red energy connected the powerhouses together.<br/><br/>The red energy wrapped around them, making their power extremely terrifying!<br/><br/>The scattered red energy wrapped around more than 200 heaven origin creation realm powerhouses.<br/><br/>At the thousand tentacles area, another 70 to 80 heaven origin creation realm powerhouses appeared in his tentacles.<br/><br/>“My strength here can be compared to two more primal chaos realm existences. It’s about two primal chaos realm existences and one Great Dao realm existence.”<br/><br/>Thousand Tentacles felt his strength increase once again as he spoke!<br/><br/>“This thread of life is indeed extremely strange and powerful. Although its strength will drop drastically after being connected, its life force is extremely terrifying. Basically, it’s very difficult to kill it. My side is connected to more than 80 experts. If I’m in charge of everything, I probably have the combat strength of two primal chaos realm existences!”<br/><br/>The old man wearing the bamboo hat sensed the aura on his side and spoke.<br/><br/>The thread of life could connect many experts, but what it connected was more life force.<br/><br/>If it was strength, although it had an increase, it was not that exaggerated.<br/><br/>Moreover, energy was one aspect, and using it was another aspect.<br/><br/>But even so, the combat strength of two primal chaos ranks was already very terrifying.<br/><br/>“My side also has the combat power of two chaos ranks!”<br/><br/>“Mine Too!”<br/><br/>The Lord of disaster and axe sword demon also echoed.<br/><br/>“In that case, the power we can display is more than eight chaos ranks. In addition, we still have that Great Dao and control-level expert that was killed. Immediately inform them to come over. There is still one thread of life that has not been used. It should still be able to improve quite a bit.”<br/><br/>“At least nine primal chaos ranks. There is no problem.”<br/><br/>The Lord of Disaster’s eyes flickered as he continued speaking!<br/><br/>“Three great dao ranks working together can protect themselves in the hands of primal chaos rank experts. According to the division of the realm of primal chaos, the strength that we work together is much stronger than the realm above Primal Chaos.”<br/><br/>The elder wearing the bamboo hat analyzed.<br/><br/>“HMM? We have experts who are under attack. Help us!”<br/><br/>At this moment, sword demon axe suddenly said.<br/><br/>Behind Sword Demon Axe, a ten-thousand-meter-tall evil sequence faction expert in the form of a fiendish demon slowly collapsed.<br/><br/>However, when his body collapsed, a large amount of red energy surged out of their bodies to heal his injuries.<br/><br/>At the same time, the injuries on his body began to spread to the other experts!<br/><br/>“Alright!”<br/><br/>The gaze of the Lord of disaster and the others focused. They mobilized at least two primal chaos level energies and poured them into axe sword demon’s body.<br/><br/>The energy followed axe sword demon’s body and poured into the body of the expert who was attacked.<br/><br/>In just an instant, the cracks on the body of the expert who was attacked completely disappeared.<br/><br/>“We have blocked it, we have blocked it!”<br/><br/>The expert who had been attacked also cried out in excitement!<br/><br/>“Good, this proves that our strength is stronger than that of the Dragon King!”<br/><br/>The Lord of disaster also cried out in excitement!<br/><br/>“Get rid of that Troublesome Dragon King of the Dragon Palace!”<br/><br/>“With our combined strength, we will definitely be able to suppress or even kill that Dragon King. Immediately lock onto the position of the Dragon King.”<br/><br/>Thousand Tentacles and the old man in the bamboo hat had eyes filled with hatred!<br/><br/>With the addition of thousand tentacles, there were a total of four terrifying and vast energy fluctuations.<br/><br/>“Inject your energy into my body. I’ll track down the Dragon King’s location.”<br/><br/>The Lord of disaster immediately ordered.<br/><br/>He was once killed by Wang Xian.<br/><br/>He had an ability that could track down the enemy’s location.<br/><br/>The Dragon King was too powerful, so he needed to borrow the strength of other experts.<br/><br/>“Alright!”<br/><br/>Thousand Tentacles, the old man with the bamboo hat, as well as sword demon axe and the rest, immediately began to use their energy.<br/><br/>“HMM?”<br/><br/>At the same time, he had already sensed it when his curse was ineffective outside the evil sequence universe.<br/><br/>“They have found a way to resist my curse?”<br/><br/>Wang Xian mumbled. He wasn’t too surprised.<br/><br/>After all, there were too many experts in the evil sequence camp. It was normal for them to have some powerful abilities and treasures!<br/><br/>“Someone is locking onto me!”<br/><br/>At this moment, he suddenly sensed something in his heart.<br/><br/>After controlling his divination power, he could sense the malice towards him and the enemy’s lock onto him from afar.<br/><br/>Buzz Buzz<br/><br/>Wang Xian immediately used the power of divination to perform divination.<br/><br/>He received a vague message.<br/><br/>However, based on this vague message, he could confirm that the enemy that locked on to him was in the evil sequence universe.<br/><br/>All of that was self-evident!<br/><br/>“Are you going to attack me?”<br/><br/>Wang Xian’s eyes sparkled as well as his strong fighting spirit.<br/><br/>Ever since his strength had improved, he had yet to show his full strength.<br/><br/>He didn’t know how strong he was now!<br/><br/>He wasn’t sure if he could be compared to seven chaos-level existences or eight.<br/><br/>This time, he could give it a try.<br/><br/>Furthermore, the most important thing was that he was 100% confident that he could escape easily even if he couldn’t defeat the combined forces of the evil sequence faction’s powerhouses.<br/><br/>Buzz Buzz<br/><br/>Buzz Buzz<br/><br/>“That Dragon King is very close to us. He is just outside our universe. He is performing a curse not far away from us!”<br/><br/>At this moment, in the evil sequence universe, the Lord of disaster had also confirmed Wang Xian’s location.<br/><br/>When he sensed this information, he roared loudly!<br/><br/>“Is there a distance limit to his curse?”<br/><br/>Sword Demon Axe asked.<br/><br/>“Whether there is a distance limit or not, let’s go and kill him.”<br/><br/>The old man wearing the bamboo hat slowly took off his bamboo hat, revealing a terrifying face.<br/><br/>His entire face was filled with blood-red eyes, which were abnormally eerie and frightening.<br/><br/>His entire body was also filled with killing intent.<br/><br/>“In the battle later, everyone must go all out. Everyone must go all out. Don’t hold back any trump cards, and don’t worry about losses.”<br/><br/>Thousand Tentacles looked at them and reminded them.<br/><br/>“Of course. If we hold back from the Dragon King, then we must be prepared to die!”<br/><br/>The Lord of disaster nodded. His gaze swept over the experts who were connected to him by the thread of life and ordered, “From now on, all you need to do is follow behind me.”<br/><br/>“It’s the Lord of Disaster!”<br/><br/>The experts immediately replied.<br/><br/>The Lord of Disaster’s body trembled slightly, and the black fog enveloped all the experts within.<br/><br/>“Go, we’ll rush over immediately!”<br/><br/>Thousand Tentacles said darkly.<br/><br/>Now that his strength had increased explosively, he no longer had the slightest fear when facing the Dragon King above chaos.<br/><br/>This time, it could be said that they had gathered all the power of the evil sequence faction.\t\t\t\t\t\t</div>", "images": {}, "success": true}