{"id": 1533, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15076006.html", "title": "Chapter 4536 - Chapter 4536: 4535 Annihilating The Evil Sequence Faction 1", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4536 - Chapter 4536: 4535 Annihilating The Evil Sequence Faction 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4536: 4535 annihilating the evil sequence faction 1<br/><br/>Before the experts of the evil sequence faction arrived.<br/><br/>The Lord of disaster and the others had made an estimate of the Dragon Palace Dragon King’s strength!<br/><br/>He could easily kill the Lord of disaster and a chaos-level existence.<br/><br/>The terrifying speed and strength he displayed convinced them that the Dragon Palace Dragon King was definitely not a chaos-level existence.<br/><br/>He was above the chaos level!<br/><br/>Above the chaos level was a realm they had never heard of.<br/><br/>Especially for sword demon axe, who had just broken through to the chaos level!<br/><br/>Apart from the invincible strength displayed by the Dragon King of the Dragon Palace, even the heaven creation level buildings and the fire element chaos level beings in the dragon palace were not weaker than them.<br/><br/>Such strength had completely exceeded their expectations!<br/><br/>“Sir, are we here to prepare to fight the Dragon Palace Alliance or to take the initiative to attack?”<br/><br/>A great dao-level powerhouse couldn’t help but ask when he heard the words of the Lord of disaster and the others.<br/><br/>They still had a lot of things they didn’t understand.<br/><br/>They didn’t understand how strong the Dragon Palace alliance was or how strong the Dragon King was!<br/><br/>“Wait here for the news from the Dragon Palace Alliance.”<br/><br/>The Lord of Disaster said coldly!<br/><br/>At this time, the Lord of disaster and the others didn’t know what to do.<br/><br/>Escape?<br/><br/>Obviously, it was impossible.<br/><br/>Although the Dragon Palace Dragon King was very strong, couldn’t all the experts of the evil sequence camp put together to suppress him?<br/><br/>They didn’t believe it.<br/><br/>Even if that strange curse was very powerful, as long as there were enough great beings, they could still resist that strange curse attack!<br/><br/>As for taking the initiative to attack, disaster master and the others didn’t have the slightest confidence.<br/><br/>Especially now, they couldn’t scatter.<br/><br/>Once they scattered, it would be even more dangerous.<br/><br/>“Yes!”<br/><br/>When the Great Beings from the evil sequence camp heard the Order of Disaster Master and the others, their hearts trembled, and they immediately responded!<br/><br/>Now, they could also guess that the four of them didn’t gain any advantage in the nine-origin universe.<br/><br/>In fact, they even suffered a huge loss!<br/><br/>That was why they were so passive in their current situation!<br/><br/>…<br/><br/>While the evil sequence faction was gathering, Wang Xian was floating in the air and doing his divination.<br/><br/>“There are no more experts from the evil sequence faction around. It seems that they have already killed all of them. The rest of the experts from the evil sequence faction can’t be divined anymore. They are being interfered with by a powerful energy!”<br/><br/>“It seems that they have gathered together. Hehe, Perfect Timing!”<br/><br/>Wang Xian looked at the divination information and smiled.<br/><br/>He had already killed more than 280 experts from the evil sequence camp!<br/><br/>The rest had escaped back to their nest through the treasures!<br/><br/>“It will take about 100 years to fly there by myself!”<br/><br/>After calculating the distance from here to the evil sequence camp, Wang Xian muttered.<br/><br/>Without hesitation, he moved his body and immediately flew towards the evil sequence camp.<br/><br/>With the time domain and a hundred times acceleration, Wang Xian’s speed was extremely terrifying!<br/><br/>For a heaven origin creator, it would take him tens of thousands of years to travel. He only needed a hundred years or so.<br/><br/>A hundred years passed very quickly.<br/><br/>Wang Xian came to an area with more universes!<br/><br/>He looked at a universe in front of him, and his eyes were sparkling.<br/><br/>He flew straight over. When he arrived, he tried to sense the situation of this universe.<br/><br/>There were no powerhouses in the Heavenly Yuan blessed realm.<br/><br/>There were very few living beings in the entire universe, but the strength of the living beings were relatively strong!<br/><br/>Such a situation was very common in the universe of the evil sequence faction.<br/><br/>The competition between these universes was extremely fierce.<br/><br/>The strong devoured the weak to evolve.<br/><br/>And the weak could only defeat the weak of their own level and devour them to complete their evolution!<br/><br/>Under such circumstances, all the living beings in the universe were in a state of frenzied slaughter and devouring!<br/><br/>Extremely fierce!<br/><br/>Of course, this also had a huge advantage.<br/><br/>That was that there were more strong beings.<br/><br/>The more cruel the environment, the more strong people could be born.<br/><br/>A comfortable environment was not conducive to cultivation!<br/><br/>“The center of the evil sequence camp is in the evil sequence universe. That is their base camp. There is still a long way to go from here to the evil sequence universe. It would take decades to fly!”<br/><br/>Wang Xian mumbled. He had set up a demonic altar in this universe.<br/><br/>Following that, Wang Xian informed an lie of the news. He brought the Divine Roc of the Nine Heavens and continued to fly forward.<br/><br/>After an lie received the news, he immediately brought the powerhouses of the Dragon Palace and the members of the Dragon Palace Alliance over!<br/><br/>“Is this the universe of the evil sequence camp?”<br/><br/>“I know this universe. It’s called the Yin Demon Universe. The strongest people in this universe are three existences at the control level.”<br/><br/>“Starting from this universe? Starting to destroy the evil sequence faction?”<br/><br/>“The day has finally arrived. When our universe is destroyed by the evil sequence faction, when countless of our citizens are massacred by the evil sequence faction’s powerhouses, I’ve always dreamed that one day, I’ll be able to kill my way to the evil sequence faction. Hahaha, the day has finally arrived!”<br/><br/>Soon, a group of powerhouses appeared in this universe.<br/><br/>The members of the Dragon Palace Alliance were extremely excited.<br/><br/>Some members were laughing crazily.<br/><br/>Back then, many universes in the land of origin had been destroyed by the evil sequence faction.<br/><br/>Now, when the powerhouses of these universes saw the universe where the evil sequence faction was located, they were filled with hatred!<br/><br/>“Everyone, let’s move together. After the Dragon King exterminates all the Heaven’s origin creation realm powerhouses of the evil array formation, we’ll split up. Now, let’s exterminate this universe!”<br/><br/>Prime Minister Gui said to them with a smile!<br/><br/>“It’s Prime Minister Gui!”<br/><br/>“Hahaha, kill all the beasts of the evil array formation!”<br/><br/>The powerhouses said with grim expressions.<br/><br/>The counterattack of the Dragon Palace Alliance had officially begun!<br/><br/>The first was the Yin Demon Universe!<br/><br/>None of the experts and disciples of the evil sequence faction were kind.<br/><br/>They were born to kill and kill!<br/><br/>Therefore, the members of the Dragon Palace Alliance didn’t show any mercy!<br/><br/>When the Yin Demon Universe was slaughtered by the experts of the Dragon Palace Alliance, the news soon reached the three controlling-level experts of the Yin Demon Universe.<br/><br/>“Oh no, the Dragon Palace Alliance has entered our evil sequence faction. Our Yin demon universe is being massacred by a large number of heavenly fate realm experts. Our disciples are being massacred!”<br/><br/>The three control-level experts in the evil sequence universe couldn’t help but growl!<br/><br/>His words caused the expressions of the experts of the evil sequence faction to change slightly!<br/><br/>“How is this possible? The Dragon Palace Alliance has counterattacked so quickly?”<br/><br/>“Damn it, the Dragon Palace Alliance is Courting Death!”<br/><br/>The expressions of the experts from the evil sequence faction changed drastically as they spoke with killing intent.<br/><br/>Up ahead, the Lord of disaster and the others frowned slightly when they heard this news!\t\t\t\t\t\t</div>", "images": {}, "success": true}