{"id": 1536, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15076021.html", "title": "Chapter 4539 - Chapter 4539: 3538 Annihilating The Evil Sequence Faction 4", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4539 - Chapter 4539: 3538 Annihilating The Evil Sequence Faction 4</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4539: 3538 annihilating the evil sequence faction 4<br/><br/>“Everyone, at this point, if you have a good idea, you can do it too!”<br/><br/>The chaos-level existence of the evil sequence faction with countless tentacles on his head glanced at the Lord of Calamity and the others as he spoke indifferently!<br/><br/>At this moment, his eyes were filled with excitement and fervor!<br/><br/>This might be an opportunity for him, an extremely terrifying opportunity!<br/><br/>He had countless tentacles and an innate skill.<br/><br/>In the past, this skill was of little value to him.<br/><br/>It was only effective for those below the Heavenly Yuan blessed realm.<br/><br/>This was because Heavenly Yuan blessed realm experts couldn’t hand over their lives to him.<br/><br/>But today was an opportunity!<br/><br/>“Buzz Buzz!”<br/><br/>“Buzz Buzz!”<br/><br/>However, just as the Lord of disaster and the others were considering, two great dao existences in front of them were silently killed once again!<br/><br/>Two Great Dao level corpses fell down.<br/><br/>“Oh my God, two more great dao level experts were killed by the curse. What should we do? If this continues, all of us will be killed!”<br/><br/>“That Dragon King’s strength is extremely terrifying and he has such a strange ability. How are we going to fight him?”<br/><br/>“My four lords, what should we do now?”<br/><br/>The group of Great Dao level experts panicked and could not help but roar.<br/><br/>Some of the Great Dao level experts had already died once. If they were killed again, they might lose their strength.<br/><br/>At that time, they would not even be able to reach the Great Dao level strength!<br/><br/>As for the position behind them, the group of Heavenly Yuan creation level experts were filled with shock.<br/><br/>Would it be their turn next?<br/><br/>When the Lord of disaster, Sword Demon Axe, and the old man with the bamboo hat saw this scene, their expressions changed drastically.<br/><br/>They looked at each other and their gazes landed on thousand tentacles who were connected to their heads.<br/><br/>“Thousand tentacles, if you were to connect to all the other experts, how strong would you be?”<br/><br/>The Lord of disaster asked.<br/><br/>“You don’t Know?”<br/><br/>Thousand tentacles shook his head, “I used my tentacles to connect to all the other experts except you. My strength probably won’t surpass the primal chaos. After all, my talent isn’t that heaven-defying!”<br/><br/>“Is that so?”<br/><br/>The old man wearing the bamboo hat didn’t believe his words.<br/><br/>One had to know that the four primal chaos existences were in a balance.<br/><br/>If they were to connect with a large number of heavenly fate realm experts, their strength would definitely increase explosively!<br/><br/>At that time, the balance between them might be broken!<br/><br/>This wasn’t a good thing for them!<br/><br/>“Buzz Buzz!”<br/><br/>“Buzz Buzz!”<br/><br/>However, just as they were discussing and thinking, at this moment, two more great dao existences’corpses suddenly fell downwards!<br/><br/>Another two great dao level experts were killed in an instant!<br/><br/>They had already lost four great dao level experts!<br/><br/>The consecutive deaths made all the Great Dao level experts nervous.<br/><br/>They stared at the four lords. They knew that the four lords were discussing and preparing to discuss.<br/><br/>“We can’t wait any longer!”<br/><br/>Thousand Tentacles swept his gaze across the two corpses and reminded them!<br/><br/>“Send a hundred heavenly fate realm experts. Let lord thousand tentacles’tentacles enter your bodies and don’t resist. This is one of our methods to deal with the Dragon King.”<br/><br/>The Lord of Disaster’s gaze was solemn as he looked at the surrounding experts and ordered!<br/><br/>“Give up. In the end, we will let Lord Thousand Tentacles release your control!”<br/><br/>The old man with the bamboo hat continued speaking!<br/><br/>Regardless of whether it was the Lord of disaster or the old man with the bamboo hat, it was impossible for their bodies to be controlled by thousand tentacles.<br/><br/>This way, it was possible for them to be completely controlled by him.<br/><br/>However, they could let the other experts let thousand tentacles control them and connect them.<br/><br/>Although it would also increase thousand tentacles’strength and threaten them, they had no other way now!<br/><br/>In addition, with the three of them working together, even if thousand tentacles’strength increased, everything was under control!<br/><br/>“This? ? Yes, my Lord!”<br/><br/>The Heaven origin creation realm experts also had some understanding of thousand tentacles’innate skill.<br/><br/>Although they were somewhat unwilling, but now, they could only do so!<br/><br/>A few great dao level powerhouses did not hesitate at all and immediately arrived in front of thousand tentacles!<br/><br/>There was still a chance of survival if they were controlled by Lord thousand tentacles, but if they were cursed by the Dragon King, they would definitely die!<br/><br/>“Don’t worry, after this crisis is over, I will let you regain your freedom. Moreover, the Lord of disaster and the others are in charge of all of this.”<br/><br/>Thousand tentacles suppressed the excitement in his eyes and said.<br/><br/>“Sou Sou Sou!”<br/><br/>“Sou Sou Sou!”<br/><br/>Following that, the tentacles landed in front of the heavenly fate realm experts and entered his body.<br/><br/>“Don’t resist!”<br/><br/>Thousand Tentacles warned.<br/><br/>The expression of the heavenly fate realm experts who were pierced by hundreds of tentacles changed slightly, but they still resisted.<br/><br/>Following that, a strange scene appeared.<br/><br/>After the hundreds of tentacles entered the bodies of the Heavenly Kismet realm powerhouses, they slowly wrapped around the hundreds of Heavenly Kismet realm powerhouses.<br/><br/>The hundreds of powerhouses seemed to have lost their consciousness. They closed their eyes and merged with the tentacles!<br/><br/>The tentacles that were originally thousands of meters in size emitted extremely powerful energy.<br/><br/>The hundreds of tentacles exploded with a power that was ten times more terrifying than before!<br/><br/>Sensing the changes in his body, thousand tentacles waved his tentacles excitedly.<br/><br/>Beside him, the Lord of disaster and the others were also quietly feeling thousand tentacles’strength!<br/><br/>“How strong are you now?”<br/><br/>Axe sword demon could not help but ask.<br/><br/>“I’m only twice as strong as before. Although I can take over the power of more than a hundred heaven origin creation realm powerhouses, this is not something I cultivated, so I can’t use it 100% !”<br/><br/>Thousand Tentacles said.<br/><br/>The current him felt much stronger than before!<br/><br/>Now, facing the Lord of disaster, he also felt that he could completely crush him!<br/><br/>“Oh?”<br/><br/>But at this moment, thousand tentacles’expression changed slightly.<br/><br/>He stared at the Lord of disaster and said with a solemn face, “Some experts in my body have been attacked.”<br/><br/>“Can they withstand it?”<br/><br/>The Disaster Lord and the others focused their eyes and asked.<br/><br/>“Weng Weng!”<br/><br/>Thousand Tentacles didn’t answer. Countless tentacles emitted a luster and surged toward the tentacles of the attacked expert.<br/><br/>All the experts were under his control. He could gather the energy of 100 experts and fuse them together.<br/><br/>Although he couldn’t do a 100% fusion, even if it was 50% , it was still very terrifying!<br/><br/>However, what shocked thousand touch was that he found that he still couldn’t resist this terrifying curse.<br/><br/>He could only hold on for a few thousand years!\t\t\t\t\t\t</div>", "images": {}, "success": true}