{"id": 1539, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15076036.html", "title": "Chapter 4542 - Chapter 4542: 4541 Annihilating The Evil Sequence Faction 7", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4542 - Chapter 4542: 4541 Annihilating The Evil Sequence Faction 7</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4542: 4541 annihilating the evil sequence faction 7<br/><br/>All the experts of the evil sequence faction started to move.<br/><br/>The Lord of disaster and the others used powerful treasures to connect the lifeforce of all the experts together.<br/><br/>Although the overall destructive power had decreased, facing a chaos-level existence and the Dragon Palace Dragon King’s Curse, there was no way they would be instantly killed!<br/><br/>At the same time, they sent a message to the great dao-level experts and control-level experts who had been massacred, telling them to gather immediately!<br/><br/>They mobilized all their strength to fight against the Dragon Palace Dragon King.<br/><br/>They fought against the invasion of the Dragon Palace Alliance.<br/><br/>This result was something they had never expected.<br/><br/>They went to destroy the Dragon Palace Alliance, but they were forced into a desperate situation by the Dragon Palace Dragon King!<br/><br/>A group of experts from the evil sequence faction flew out of the evil sequence universe.<br/><br/>At the same time, the expert who was killed by Wang Xian rushed over quickly.<br/><br/>They were going to surround and annihilate the Dragon King of the Dragon Palace!<br/><br/>“Huh?”<br/><br/>At the same time, when the experts from the evil sequence faction rushed over, Wang Xian had already sensed something.<br/><br/>Such a majestic energy fluctuation was attacking him. It was impossible to avoid his detection.<br/><br/>“Is the decisive battle about to begin?”<br/><br/>Wang Xian sensed the waves of terrifying energy and a smile appeared on his face.<br/><br/>Let’s have a decisive battle then!<br/><br/>With a thought, he continued to curse.<br/><br/>This time, the curse was targeted at the group of powerhouses that he had killed.<br/><br/>There were six Great Dao level powerhouses and more than 20 control level powerhouses.<br/><br/>This was an extremely powerful force.<br/><br/>It was so powerful that when they joined forces, they could easily fend off the divine roc of the Nine Heavens.<br/><br/>Wang Xian wanted to kill it.<br/><br/>This way, the subsequent battles would be smoother!<br/><br/>Buzz Buzz<br/><br/>Buzz Buzz<br/><br/>The curse force was activated once again.<br/><br/>At this moment, in the surrounding chaotic domain.<br/><br/>In the various universes, after receiving the information, the powerhouses immediately rushed into the evil sequence universe.<br/><br/>As the center of the evil sequence universe, many universes had long-distance teleportation arrays.<br/><br/>They only needed a few teleportation arrays to arrive at the evil sequence universe.<br/><br/>“That Damned Dragon King, now Lord Disaster Master and the others have found a way to deal with you. This time, we will kill you and completely destroy you!”<br/><br/>At a long-distance teleportation array located in the primal chaos.<br/><br/>Spirit kneader walked out from inside and growled with a face full of killing intent.<br/><br/>Hatred had already filled his entire soul.<br/><br/>“Weng Weng!”<br/><br/>“Weng Weng!”<br/><br/>However, at this moment, his eyes were wide open, filled with disbelief and shock.<br/><br/>In order to wait for him to have any more reactions, he directly collapsed there.<br/><br/>In the next moment, his mind recovered in a universe.<br/><br/>This universe was the universe he controlled.<br/><br/>He was the universe master of this universe.<br/><br/>And the center of this planet was the place where he was resurrected.<br/><br/>The Spirit KNEADER’s body sat up from the bed with a trace of fear on his face.<br/><br/>“I was cursed by the Dragon King. I was killed by the Dragon King’s curse again. How did he do it? Will I be killed by the curse again?”<br/><br/>The spirit kneader said in horror.<br/><br/>It wasn’t just him. In the other universes, the Great Dao experts in the illusory realm and other evil sequence universes, as well as the experts in control, were all dying rapidly.<br/><br/>They were all experts who had been cursed to death once.<br/><br/>Now that they were dying again, they all had the same thought.<br/><br/>Would they be cursed to death forever?<br/><br/>If that was the case, they would die completely!<br/><br/>Even so, their losses were still huge!<br/><br/>However, soon, an answer that made them feel extremely terrifying came out!<br/><br/>Not long after they were cursed to death again, death came again!<br/><br/>“That Dragon King can keep cursing us, they can kill us completely!”<br/><br/>The spirit kneader said with a pale face.<br/><br/>He quickly spread the news to the Lord of disaster and the others!<br/><br/>They were masters of the Great Dao.<br/><br/>Even if they were killed once, twice, or thrice, they could be resurrected.<br/><br/>Moreover, the place where they were resurrected was very secretive.<br/><br/>In other words, it was very difficult for them to be killed two or three times by the enemy.<br/><br/>However, the Dragon King could ignore space, distance, and location, and directly kill them with a curse.<br/><br/>This shocked them.<br/><br/>As long as they didn’t curse the Dragon King, they would disappear completely!<br/><br/>“What?”<br/><br/>“A group of Great Dao and control level experts from the illusionary realm sent a message for help. They are being killed by the Dragon King’s curse. They have already been killed twice!”<br/><br/>In the evil sequence universe, a group of experts led by the Lord of disaster were rapidly flying out of the universe.<br/><br/>At this moment, a few primal chaos level existences and a group of Great Dao level experts all received the message from the spirit kneader and his group.<br/><br/>When they saw this message, they felt a chill in their hearts.<br/><br/>“Only by destroying the Dragon King can we save them!”<br/><br/>“We must destroy the Dragon King. Otherwise, we can’t continue to move in this manner forever!”<br/><br/>The Lord of Calamity and the old man with the bamboo hat said with determination.<br/><br/>“There’s no need to wait for the spirit kneader and the rest. They have been killed by the Dragon King’s curse a few times and are now completely crippled. Let’s make our move first!”<br/><br/>Thousand tentacles growled in a low voice that was filled with killing intent!<br/><br/>“Charge!”<br/><br/>“Kill the Dragon King. We must kill the Dragon King!”<br/><br/>The Lord of Calamity and the rest roared. They immediately increased their speed and charged towards the position of Wang Xian.<br/><br/>With their abilities, if they wanted to travel from the center of the universe to the outside of the universe, coupled with the fact that there was a teleportation array in the middle.<br/><br/>They only needed two to three years.<br/><br/>These two to three years were already very short.<br/><br/>However, the spirit kneader and the rest could not wait for another two to three years!<br/><br/>Wang Xian wanted to curse and kill the experts of the Great Dao and control level at an extremely fast speed.<br/><br/>In less than half an hour, all the experts had already been killed by his curse three times!<br/><br/>At this moment, the experts of the spirit kneader’s illusory realm and the rest had already begun to collapse!<br/><br/>“Sir, Save Us, save us. We have already died three times. Our realms have already fallen. If this goes on, we will be completely annihilated!”<br/><br/>“Lord Thousand Tentacles, save me! I’m willing to be under your control for the time being. Save Us!”<br/><br/>“My Lord, you must save us! You must curse na Dragon King!”<br/><br/>Every time they were cursed to death, they would frantically send out messages, requesting disaster master and the others to save them.<br/><br/>However, when disaster master and the others saw these messages, there was nothing they could do.<br/><br/>They were in the evil sequence universe, and there was nothing they could do to stop it.<br/><br/>They could only look at the distress signal of the spirit kneader and the other experts!<br/><br/>“Damn it!”<br/><br/>Their eyes were blood-red, and their auras were boiling. Everywhere they passed, a terrifying ocean of energy was raised!<br/><br/>With the passage of time, the group of experts was cursed to death dozens of times, up to a hundred times.<br/><br/>Began to have strong, completely disappeared in the world!\t\t\t\t\t\t</div>", "images": {}, "success": true}