{"id": 1535, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15076016.html", "title": "Chapter 4538 - Chapter 4538: 3537 Annihilated The Evil Sequence Faction 3", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4538 - Chapter 4538: 3537 Annihilated The Evil Sequence Faction 3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4538: 3537 annihilated the evil sequence faction 3<br/><br/>“My Lord!”<br/><br/>“My Lord!”<br/><br/>One by one, great dao-level experts came before axe sword demon and the others and called out respectfully.<br/><br/>At this moment, their expressions were filled with fear.<br/><br/>They had completely experienced the terror of the Dragon King!<br/><br/>Instantly killing two great dao-level existences, and most importantly, they had no way of resisting at all.<br/><br/>Now, even their primal Chaos Lords had suffered such an attack.<br/><br/>Even if the four of them joined forces, they wouldn’t be able to stop it!<br/><br/>They now understood why the four of them had been defeated when they went to the nine-origin universe!<br/><br/>That Dragon King’s strength had already surpassed the primal chaos level.<br/><br/>“Release the energy. Do not contain any offensive nature in the energy. Accept my guidance!”<br/><br/>The Lord of disaster looked at the twenty-one Great Dao level experts and ordered!<br/><br/>“Yes, my Lord!”<br/><br/>The group of experts immediately responded and released a vast amount of energy.<br/><br/>Under the guidance of the Lord of disaster, the vast amount of energy entered the body of axe sword demon.<br/><br/>This vast amount of energy entered the body of axe sword demon and wrapped around the strange curse power!<br/><br/>Four chaos-level existences, together with the power of twenty-one great dao-level experts, immediately suppressed the strange curse power with all their strength!<br/><br/>“Phew!”<br/><br/>Axe sword demon also heaved a heavy sigh when he saw this scene.<br/><br/>“He blocked it. I don’t understand. How did the Dragon King Attack Me? We are already far away from him. How could he still curse? And what method did he use to curse me?”<br/><br/>Sword Demon Axe still spoke in a grave tone.<br/><br/>They were deeply fearful of the Dragon King’s attack.<br/><br/>One had to know that they had to unite many forces to stop the attack of the curse.<br/><br/>However, they could not always gather together!<br/><br/>Once they separated, wouldn’t the Dragon King be able to kill them one by one?<br/><br/>“I don’t know, but we have to kill the Dragon King completely. Otherwise, we will be in trouble!”<br/><br/>The old man wearing the bamboo hat said with a gloomy expression!<br/><br/>“Our combined strength is much stronger than the Dragon Palace Alliance. If we all join hands, we can even touch the Dragon King, even if he is an existence above Chaos!”<br/><br/>The ferocious face of the Lord of disaster kept changing as he growled in a low voice.<br/><br/>“The Dragon Palace Alliance and the Dragon King are already charging over. We have to retaliate!”<br/><br/>Axe sword demon echoed.<br/><br/>“Huh?”<br/><br/>However, just as they were discussing, Wang Xian, who was located outside the evil sequence universe, raised his eyebrows slightly when he saw that the power of the curse was being blocked.<br/><br/>A smile appeared on his face.<br/><br/>Following that, the phantom image of the axe sword demon in front of him disappeared and two other phantoms appeared.<br/><br/>These two phantoms were the phantoms of two Great Dao experts from the evil sequence camp.<br/><br/>He extended his palm and clenched it forcefully towards these two phantoms!<br/><br/>Crack Crack<br/><br/>Crack Crack<br/><br/>In an instant, the two phantoms collapsed and dissipated!<br/><br/>When the two phantoms collapsed and dissipated, two more phantoms appeared in front of Wang Xian!<br/><br/>At the same time, they were located at the center of the evil sequence universe.<br/><br/>In front of the Lord of disaster and the rest, 21 Great Dao level powerhouses were suspended in the air.<br/><br/>However, a terrifying scene appeared before everyone’s eyes.<br/><br/>The Spirit Kneader and the two great dao level powerhouses from the illusory realm were instantly wiped out of their life force. Their bodies fell to the ground.<br/><br/>This sudden scene shocked and terrified everyone.<br/><br/>Especially the experts of the Great Dao level.<br/><br/>“What? What’s going on? The spirit kneader and the illusory realm? How did they lose their life force in an instant?”<br/><br/>“Hiss, they also suffered from the Dragon King’s terrifying curse. It’s definitely the Dragon King’s attack. Oh My God, how did the Dragon King Attack?”<br/><br/>“Oh no, the Dragon King can’t possibly kill us directly from a very far place, right? How are we supposed to defend against this? Aren’t we going to be killed one by one by the Dragon King’s Curse?”<br/><br/>“My lord, what should we do?”<br/><br/>At this time, all the Heavenly Yuan creation realm powerhouses in the evil sequence camp panicked.<br/><br/>Was that strange and terrifying curse going to start?<br/><br/>This curse couldn’t even be resisted by a chaos-level lord, and two great dao-level experts were instantly killed.<br/><br/>Would it be their turn next?<br/><br/>“Damn it, I still don’t believe that the Dragon King can kill all of us.”<br/><br/>The eyes of the elder wearing the bamboo hat narrowed slightly when he saw this scene, and he couldn’t help but roar.<br/><br/>“Buzz Buzz!”<br/><br/>“Buzz Buzz!”<br/><br/>As soon as he finished speaking, the two great dao experts in front of him instantly lost their vitality and fell down.<br/><br/>Two Great Dao experts were once again killed by the curse. At this moment, even the old man in the bamboo hat had a shocked expression on his face.<br/><br/>“It’s possible that the Dragon King has locked onto all of our experts.”<br/><br/>Sword Demon Axe said with a trace of fear.<br/><br/>“Ao Keming, who was killed by the curse just now, was already killed by the Dragon King’s curse once. How could he still be locked onto him? could he be killed by the curse without any restrictions?”<br/><br/>A Great Dao expert who had also been killed by the curse couldn’t help but exclaim.<br/><br/>If that was really the case, wouldn’t they be completely destroyed?<br/><br/>Thinking of this, they felt extremely terrified.<br/><br/>The Lord of disaster and the others’expressions also changed drastically.<br/><br/>Once all the Great Dao level powerhouses were killed by the Dragon King’s curse, even the ordinary heavenly yuan creation level powerhouses would be killed.<br/><br/>Then wouldn’t it be their turn in the end?<br/><br/>“We have to deal with the Dragon King’s Curse.”<br/><br/>The Lord of Disaster’s gaze focused as he spoke.<br/><br/>“I have a way.”<br/><br/>The chaos-level powerhouse with countless tentacles connected to his head shouted.<br/><br/>His name was thousand tentacles, and he was the second existence in the evil sequence camp to break through to the chaos-level.<br/><br/>His eyes flickered slightly as he swept his gaze across all the surrounding powerhouses.<br/><br/>“HMM?”<br/><br/>The Lord of disaster looked at thousand tentacles and frowned slightly.<br/><br/>The expression of the elder wearing the bamboo hat changed even more.<br/><br/>They knew of an ability of thousand tentacles.<br/><br/>This ability was able to connect all their experts’energies together.<br/><br/>It shouldn’t be too much of a problem to deal with that strange curse.<br/><br/>However, this ability wasn’t beneficial to them.<br/><br/>“If you have a better idea, then that’s fine too.”<br/><br/>Thousand Tentacles looked at them and said indifferently, not wanting to agree.<br/><br/>His idea was to send his tentacles into the bodies of other experts.<br/><br/>These experts couldn’t resist at all.<br/><br/>Receive his tentacles.<br/><br/>Receive his control.<br/><br/>This was equivalent to giving his life to him.<br/><br/>This was extremely beneficial to thousand tentacles.<br/><br/>However, it might not be the case for the Lord of disaster and the others.<br/><br/>Their relationship had not reached such a level of trust.<br/><br/>It was all about benefits!\t\t\t\t\t\t</div>", "images": {}, "success": true}