{"id": 1530, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075991.html", "title": "Chapter 4533 - Chapter 4533: 4532 Pursuing", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4533 - Chapter 4533: 4532 Pursuing</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4533: 4532 pursuing<br/><br/>Counter-attacking the evil sequence faction!<br/><br/>When Wang Xian’s words rang out, all the powerhouses from the Dragon Palace alliance behind him were slightly stunned.<br/><br/>Their tender faces were filled with astonishment.<br/><br/>Counter-attacking the evil sequence faction?<br/><br/>The powerhouses in the Heaven’s origin blessed realm would be handed over to the Dragon Palace. They would be able to kill the disciples from the other evil sequence faction.<br/><br/>They would get 10% of the profits!<br/><br/>This? ?<br/><br/>The Dragon King’s words shocked them!<br/><br/>The Dragon King was going to attack the evil sequence faction!<br/><br/>This was the evil sequence faction, the most terrifying faction in this domain!<br/><br/>Even the Justice Alliance could only retreat and defend passively against the evil sequence faction!<br/><br/>Now, the Dragon King actually said that he was going to destroy the evil sequence faction.<br/><br/>However, when they thought of the Dragon King’s terrifying strength, they became excited.<br/><br/>With the strength that the Dragon King had displayed, and with the Dragon King’s disdain towards the four chaos-level champions of the evil sequence faction.<br/><br/>It was really possible for the Dragon King to destroy all of the enemy’s champions.<br/><br/>If that was the case, even though they could only get 10% of the profits, but this was the evil sequence faction.<br/><br/>The evil sequence faction occupied a total of three to four hundred universes.<br/><br/>10% of the profits was extremely terrifying for them!<br/><br/>“Sir Dragon King, you… you have the confidence?”<br/><br/>The three great prophets who had divined the universe widened their eyes and asked in disbelief!<br/><br/>“Hehe, since I’ve said it, I can do it. There are too many universes in the evil sequence faction. It’s too troublesome for our Dragon Palace to sweep through them. Is it okay if I give you 10% ?”<br/><br/>Wang Xian looked at them and said confidently!<br/><br/>There were many universes in the evil sequence faction. If they were to sweep through them by relying on the Dragon Palace, it might take them billions of years!<br/><br/>In addition, during these billions of years, the disciples of the evil sequence faction who might receive information would immediately flee!<br/><br/>Therefore, Wang Xian called for the rest of the members of the Dragon Palace Alliance to deal with them.<br/><br/>Of course, giving them 10% of the profits was already a huge amount!<br/><br/>To them, it was already an incredible opportunity!<br/><br/>“Dragon King, of course there’s no problem. There’s no problem!”<br/><br/>The three great prophets and a few other experts at the Great Dao level looked excited as they quickly agreed.<br/><br/>The Dragon King and the others would deal with the Heavenly Yuan creation level powerhouses while the other evil sequence camp disciples would be handed over to them.<br/><br/>There was absolutely no danger.<br/><br/>Moreover, the harvest was also very terrifying.<br/><br/>The corpses of the evil sequence camp disciples and all sorts of huge resources.<br/><br/>Three to four hundred universes. Even if they could only harvest one-tenth of it, it would still be the resources of thirty to forty universes!<br/><br/>“Alright, Prime Minister Gui, gather your men and prepare to go!”<br/><br/>Wang Xian looked at Prime Minister Gui and instructed!<br/><br/>Following that, he looked at the Divine Roc of the Nine Heavens. “Let’s go and hunt down the powerhouses from the evil sequence camp!”<br/><br/>“It’s the Dragon King!”<br/><br/>The Divine Roc of the Nine Heavens replied respectfully immediately!<br/><br/>In the next moment, a wave of energy enveloped the Divine Roc of the nine heavens and their figures disappeared immediately!<br/><br/>When the members of the Dragon Palace Alliance saw that unfamiliar primal chaos level existence being so respectful to the Dragon King, they were shocked again!<br/><br/>“Just how strong is the current Dragon King?”<br/><br/>They thought to themselves!<br/><br/>…<br/><br/>“How can this Dragon King’s strength be so terrifying? How can he be so strong? What exactly happened in the nine-origin universe? What exactly happened to the four of us?”<br/><br/>“I don’t know. It was too terrifying. The Dragon King was too terrifying. Two Great Dao lords were instantly killed in front of him. They didn’t even have time to react. Oh My God!”<br/><br/>“The Dragon King said that the four of us escaped. Is that true? The Four Chaos Lords from the evil sequence faction are no match for the Dragon King?”<br/><br/>At the same time, they were not too far away from the land of origin!<br/><br/>Just now, more than 400 heaven origin creation-level masters had used treasures to escape.<br/><br/>Most of the escaping treasures of the evil sequence faction masters had instantly arrived at an extremely far location.<br/><br/>They did not return directly to the nest of the evil sequence faction!<br/><br/>Some of the more familiar evil sequence faction masters gathered together again and began to return.<br/><br/>All of them could not help but discuss in shock!<br/><br/>Everything that had happened today had given them a huge impact!<br/><br/>Buzz Buzz<br/><br/>However, just as the seven of them were discussing.<br/><br/>Wang Xian brought along the Nine Heavens Divine Roc and their figures rushed over silently!<br/><br/>To the current Wang Xian, the speed of an expert in the Heaven’s origin blessed realm was too slow!<br/><br/>With the help of the Void Pursuit, the Netherworld Dragon’s pursuit, and the time domain, his speed was extremely terrifying.<br/><br/>The moment Wang Xian arrived here, a surge of energy swept across the seven experts from the evil sequence faction.<br/><br/>In an instant, he killed them all!<br/><br/>After collecting the corpses easily, Wang Xian waved his arm and opened the pathway for the Netherworld Dragon’s pursuit.<br/><br/>With the huge increase in his current strength, he could execute the Netherworld Dragon’s pursuit hundreds of times consecutively!<br/><br/>After opening it, Wang Xian appeared in another place once again!<br/><br/>In this place, there was a powerhouse from the evil sequence faction who was at the Heaven’s origin creation level.<br/><br/>Before he could react, Wang Xian made his move and easily killed him!<br/><br/>Using this method, Wang Xian quickly hunted down and massacred the powerhouses from the evil sequence faction.<br/><br/>In less than a few hours, there were already 50 to 60 powerhouses from the evil sequence faction who died at his hands!<br/><br/>Soon, the news of the evil sequence experts being hunted and massacred began to spread among them.<br/><br/>One by one, the evil sequence experts also received this news!<br/><br/>This news was an urgent notification from the evil sequence experts who had been resurrected after being massacred.<br/><br/>The evil sequence experts who had escaped from the land of origin all received the message.<br/><br/>“What? More than 50 of our comrades have been killed by the Dragon King? This? ? Damn it, run!”<br/><br/>“Run, run quickly, use the treasures to return to our nest. The Dragon King is chasing us!”<br/><br/>“How is this possible? In such a short time, more than 50 experts have been killed by the Dragon King. Oh My God!”<br/><br/>The fleeing experts of the evil sequence faction felt their hair stand on end, and their faces were filled with terror.<br/><br/>Those who had escape treasures and those who could directly return to their nest did not hesitate to use them!<br/><br/>The Dragon King’s strength was not something they could contend against.<br/><br/>They would not take any chances!<br/><br/>They would use whatever escape treasures they had.<br/><br/>However, the matters in the land of origin.<br/><br/>As well as the information of the various Great Dao champions seeking help, as well as all sorts of questions, had also been transmitted to the four chaos champions of the evil sequence faction.\t\t\t\t\t\t</div>", "images": {}, "success": true}