{"id": 1532, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15076001.html", "title": "Chapter 4535 - Chapter 4535: Under The Horror Of The 4534 Evil Sequence Alignment Camp", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4535 - Chapter 4535: Under The Horror Of The 4534 Evil Sequence Alignment Camp</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4535: Under the horror of the 4534 evil sequence alignment camp<br/><br/>Wang Xian was hunting in the Chaos!<br/><br/>His terrifying speed and powerful divination ability caused the deaths of the Heaven’s origin creation realm powerhouses who could not return to the nest of the evil sequence alignment camp in an instant!<br/><br/>From the initial hundreds to 200.<br/><br/>As more and more Heaven’s origin creation realm powerhouses were killed, the entire communication device of the evil sequence alignment camp was in an uproar.<br/><br/>“I’ve been killed. I didn’t even have time to react. I didn’t even have the strength to resist. That Dragon King is still chasing us!”<br/><br/>“I’ve been killed too. That Dragon King’s strength is too terrifying. He’s chasing us.”<br/><br/>“Currently, two hundred Heavenly Kismet realm experts have been killed by that Dragon King. There are two hundred of them. Those experts who didn’t instantly return to our own universe will most likely be chased by the Dragon King!”<br/><br/>“That Dragon King definitely has extremely powerful tracking techniques. We are not their match at all. I reckon that as long as they don’t instantly return to their nest with treasures, they will all be killed.”<br/><br/>“Damn it, how could this be? Our Chaos-level lords asked us to gather in the evil sequence universe. Let’s hurry over. The Lords should have orders and countermeasures!”<br/><br/>The entire evil faction was in chaos.<br/><br/>Those powerhouses who had returned to the evil sequence universe through treasures immediately flew towards the evil sequence universe.<br/><br/>As for those powerhouses who were still frantically fleeing in the chaos, some of them wanted to cry but had no tears.<br/><br/>Right now, they were being chased by each and every one of them.<br/><br/>News of their comrades’deaths came one after another.<br/><br/>It was likely that they would be next.<br/><br/>This made the powerhouses from the evil sequence faction feel extremely aggrieved!<br/><br/>When had they ever been hunted down like this.<br/><br/>However, they couldn’t do anything about it!<br/><br/>Wang Xian’s pursuit continued. One by one, the powerhouses turned into resources and were taken by him!<br/><br/>…<br/><br/>“What?”<br/><br/>“How is this possible? The evil sequence faction was defeated by the Dragon Palace Alliance? Are they fleeing frantically? is the Dragon King of the Dragon Palace chasing after the powerhouses from the evil sequence faction?”<br/><br/>“Furthermore, the Dragon Palace Dragon King wants to order all the members of the Dragon Palace Alliance to attack the evil sequence faction!”<br/><br/>At the same time, far away in the Justice Alliance.<br/><br/>The Justice Alliance had been monitoring the movements of the evil sequence faction and the situation in the Dragon Palace Alliance in the land of origin.<br/><br/>The Justice Alliance had predicted that the evil sequence faction would attack the Dragon Palace Alliance.<br/><br/>The Justice League was ready to provide reinforcements whenever the Dragon Palace Alliance came.<br/><br/>However, they didn’t expect such an outcome!<br/><br/>The leader of the Justice League was sitting in front of the hall, looking at the information reported by his subordinate in disbelief!<br/><br/>“Leader, the information is true. According to the information from the land of origin, the Dragon King’s strength is extremely terrifying. The evil sequence faction suspected that four chaos-level beings had entered the nine-origin universe, but they were defeated and fled by the Dragon King!”<br/><br/>“Now that the Dragon King has given the order to attack the evil sequence faction, all the powerhouses of the Dragon Palace alliance have moved out!”<br/><br/>At the bottom, an old man reported with a shocked expression!<br/><br/>None of them had expected such an outcome.<br/><br/>The Dragon Palace Alliance wanted to kill the evil sequence faction?<br/><br/>“Four chaos-level existences? Isn’t there only three chaos-level existences in the evil sequence faction? Why is there one more?”<br/><br/>An old man with a solemn expression muttered beside the Justice Alliance leader.<br/><br/>“The power of the Dragon Palace is able to defeat four chaos-level existences and even counterattack the evil sequence faction. This… how strong is that Dragon King?”<br/><br/>The Justice Alliance leader muttered in shock as well.<br/><br/>He looked at the old man beside him and the two of them looked at each other.<br/><br/>“Let’s go and take a look!”<br/><br/>Whether it was the strength displayed by the Dragon King of the Dragon Palace Alliance or whether there were four chaos-level existences in the evil sequence camp.<br/><br/>Now that the Dragon Palace Alliance was going to counterattack the evil sequence camp, they were prepared to go and take a look for themselves.<br/><br/>They were going to check out the specific situation.<br/><br/>This was also a very important matter for the Dragon Palace Alliance.<br/><br/>…<br/><br/>“Sir, What’s the situation now?”<br/><br/>“We were killed instantly by the Dragon King in the land of origin without any reaction. What level is the Dragon King at? How could his attacks be so terrifying and powerful?”<br/><br/>In the evil sequence universe, a few experts of the Great Dao level rushed over first.<br/><br/>These few existences of the Great Dao level had all been killed by Wang Xian once.<br/><br/>They floated in the air and looked at the four masters in front of them. Their expressions were extremely unsightly as they asked.<br/><br/>Not far from them, six existences of the Great Dao level, such as the illusionary realm’s heaven-grade spirit kneader, were also floating by the side.<br/><br/>At this moment, their expressions were somewhat absent-minded.<br/><br/>They followed the Lord of calamity and the other four experts of the primal chaos level to the nine-origin universe.<br/><br/>In the end, they saw with their own eyes that their lord disaster master was killed by Dragon King.<br/><br/>The other three great beings immediately fled!<br/><br/>That scene made them feel extremely terrified!<br/><br/>Disaster Master and the other four primal chaos-level great beings glanced at their subordinates who had arrived, but didn’t answer them!<br/><br/>As time passed, more and more great beings from the evil sequence camp rushed over.<br/><br/>Some were killed once.<br/><br/>Some returned to their own universes in an instant through treasures.<br/><br/>All the experts from the evil sequence faction had ugly expressions on their faces!<br/><br/>They all looked at the Lord of disaster and waited quietly.<br/><br/>More than a hundred years later, all the experts from the evil sequence faction gathered together again.<br/><br/>“How many people were killed by the Dragon King of the Dragon Palace?”<br/><br/>The elder wearing the bamboo hat asked in a deep voice when he saw all the members arrive!<br/><br/>“Reporting, sir, there are two hundred and eighty-five!”<br/><br/>A Great Dao expert bowed and reported.<br/><br/>“Illusory realm, can you guys divine the situation of the Dragon King?”<br/><br/>The elder wearing the bamboo hat looked at the illusory realm and the experts.<br/><br/>“Reporting, sir. We did a joint divination, but we couldn’t divine any information about the Dragon King. He’s much stronger than us.”<br/><br/>The illusory realm immediately replied!<br/><br/>“My lord, according to the information from the land of origin, all the experts of the Dragon Palace alliance have rushed over to our side. They want to counterattack us.”<br/><br/>Another great dao expert stood out and said with an embarrassed expression!<br/><br/>The Dragon Palace Alliance’s counterattack against their evil sequence camp made them furious, but at the same time, they were also somewhat terrified!<br/><br/>They were truly afraid of the Dragon Palace Dragon King’s strength!<br/><br/>“Damn it, do you really think that we’re so easy to destroy if you want to destroy our evil sequence camp?”<br/><br/>The expert with countless tentacles connected to his head growled with a face full of killing intent!<br/><br/>“Get Ready!”<br/><br/>The Lord of disaster condensed an incomparably malevolent face and roared!\t\t\t\t\t\t</div>", "images": {}, "success": true}