{"id": 1537, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15076026.html", "title": "Chapter 4540 - Chapter 4540: 3539 Exterminating The Evil Sequence Faction 5", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4540 - Chapter 4540: 3539 Exterminating The Evil Sequence Faction 5</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4540: 3539 exterminating the evil sequence faction 5<br/><br/>“Even with my current strength, I can’t withstand the Dragon King’s attack.”<br/><br/>Thousand Tentacles’expression changed as he looked at the Lord of disaster and the others with a solemn expression. “Although I won’t be killed now, I can only hold on for a few years.”<br/><br/>“How is this possible?”<br/><br/>The Lord of disaster and the others’expressions changed even more. They all understood thousand tentacles’innate skill.<br/><br/>However, they did not expect that even after hundreds of tentacles connected to hundreds of Heaven’s origin destiny realm powerhouses, they still could not withstand it. This was a little scary.<br/><br/>“That Dragon King touched another domain, another domain that we don’t know about.”<br/><br/>Sword Demon Axe spoke with a little fear in his heart.<br/><br/>Just a curse had forced them into a desperate situation. This was a little scary.<br/><br/>“Huh?”<br/><br/>At the same time, outside the evil sequence universe, Wang Xian sensed that his curse power had been largely blocked. He raised his eyebrows slightly.<br/><br/>“Is there a way to block the curse? I think the many powerhouses in the evil sequence camp should have some powerful means and abilities.”<br/><br/>He mumbled.<br/><br/>In addition, his curses were not completely ineffective. However, it would take some time to kill them.<br/><br/>Wang Xian’s mind stirred and he started to change the target of the curses.<br/><br/>This time, he targeted the control-level powerhouses.<br/><br/>It was even easier to kill the control-level powerhouses with curses.<br/><br/>He could kill six of them at once. Each curses would only take one minute!<br/><br/>With this thought in mind, Wang Xian continued his attack.<br/><br/>This attack caused him to raise his eyebrows slightly. He could sense that there were two control-level powerhouses whose curses had failed.<br/><br/>It could not be said that they had failed. Instead, they were blocked by a powerful energy.<br/><br/>It would take a long time for the curses to kill them.<br/><br/>Wang Xian did not stubbornly deal with the two control-level powerhouses. Instead, he continued to shift his target.<br/><br/>Now, he controlled the aura of more than 400 powerhouses from the evil sequence faction. He could easily shift the target of the curse.<br/><br/>After the target was shifted, he could easily kill five control-level powerhouses once again.<br/><br/>However, at the same time, in the interior of the evil sequence universe, the group of Heaven Origin creation powerhouses panicked again.<br/><br/>“That Dragon King is shifting his target. He can curse all of US powerhouses. Lord thousand tentacles, save us!”<br/><br/>“Damn it, what should we do now? Can We just wait for death to come?”<br/><br/>“Sirs, you must think of a way. Otherwise, we will be finished!”<br/><br/>They said in fear, their eyes focused on the four primal chaos level experts.<br/><br/>The expressions of the disaster lord and the others kept changing.<br/><br/>“Let all the experts connect with me. I will deal with that Dragon King!”<br/><br/>Thousand Tentacles looked at the Lord of disaster and the others and said, “This is the only way!”<br/><br/>“Okay!”<br/><br/>The Lord of disaster and the old man in the bamboo hat looked at each other and nodded.<br/><br/>At this time, this was the only way!<br/><br/>“If you don’t want to die, accept thousand tentacles’control. After we deal with the Dragon King, we will release you!”<br/><br/>The Lord of disaster looked at all the experts and said!<br/><br/>When the remaining 300 experts heard this, their expressions changed slightly.<br/><br/>All of them were somewhat hesitant.<br/><br/>They were all existences that had killed countless people. They knew everything clearly and understood everything.<br/><br/>At first, they had let thousand tentacles control 100 heaven origin creation realm experts, but those experts weren’t worried at all.<br/><br/>This was because they knew that the other three lords would control thousand tentacles and release them in the end.<br/><br/>However, that might not be the case now.<br/><br/>If they were all controlled by thousand tentacles, then the Lord of disaster and the others wouldn’t be able to suppress thousand tentacles.<br/><br/>They might be controlled forever.<br/><br/>They might become puppets forever and become items that provided energy!<br/><br/>“Sir, is there any other way?”<br/><br/>A control-level powerhouse couldn’t help but ask.<br/><br/>“No. If you don’t want to die, then accept my control!”<br/><br/>Thousand Tentacles said coldly!<br/><br/>“That Dragon King can’t keep killing us with curses, right? He can’t keep killing us without limits, right? If he kills US once or twice, can he kill us eight or ten times?”<br/><br/>A control-level powerhouse said again.<br/><br/>Obviously, they didn’t want to be controlled by thousand tentacles.<br/><br/>Even if it was a chaos-level lord from their evil sequence camp.<br/><br/>All the powerhouses from the evil sequence camp were selfish.<br/><br/>They were also worried that they would be completely controlled by thousand tentacles and be completely destroyed.<br/><br/>Although the Dragon King’s curses were terrifying, if they died once, twice, or even three or four times, they could be resurrected.<br/><br/>They bet that the Dragon King wouldn’t be able to carry out the curse indefinitely.<br/><br/>If they were controlled by thousand tentacles, then it might be permanent!<br/><br/>Thousand tentacles saw the reactions of the experts and his expression turned ugly.<br/><br/>“Don’t worry, in the end, I will remove your control!”<br/><br/>Thousand Tentacles promised.<br/><br/>“Sirs, I have an idea.”<br/><br/>At this moment, an expert who had just entered the heavenly fate realm flew over and said!<br/><br/>“20 billion years ago, I accidentally came to a region through a black hole in the primal chaos. In that region, I obtained a few threads of life. These threads of life are very special and can connect the lives of a group of experts together.”<br/><br/>That expert said!<br/><br/>“HM? What threads of life? Take them out and let me have a look?”<br/><br/>The eyes of the disaster lord and the others focused as they asked.<br/><br/>“Sir, I risked my life to obtain these four threads of life.”<br/><br/>That expert took out four threads of life that were emitting blood-red light and handed them over.<br/><br/>The Disaster Lord and the others immediately grabbed one and carefully sensed it.<br/><br/>“Indeed, it can connect a group of experts’lifelines. It can bind the lives of a group of experts together. It’s a rare treasure!”<br/><br/>The Lord of disaster sensed it, and his eyes shone.<br/><br/>“There’s a flaw. This type of lifelines can only connect experts of the same attribute. Also, after connecting, the circulation of energy isn’t smooth, and it will affect one’s strength!”<br/><br/>The elder wearing the bamboo hat said, a smile appeared on his face. “However, this is not bad. The four threads of life can allow us to connect to other experts and resist that curse. As for the rest that can not be connected, let thousand tentacles control them!”<br/><br/>“Alright!”<br/><br/>Sword Demon Axe immediately replied.<br/><br/>This kind of special item could indeed solve their biggest problem.<br/><br/>“After the thread of life connects to us, we have to get rid of the Dragon King as soon as possible.”<br/><br/>The Lord of Disaster Said and immediately took out a thread of life to connect.<br/><br/>While they were talking, more than twenty control-level powerhouses had been killed by the curse.<br/><br/>They had to act as soon as possible!\t\t\t\t\t\t</div>", "images": {}, "success": true}