{"id": 1531, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15075996.html", "title": "Chapter 4534 - Chapter 4534: 4533. On The Terror Of The Evil Sequence Faction", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4534 - Chapter 4534: 4533. On The Terror Of The Evil Sequence Faction</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4534: 4533. On the terror of the evil sequence faction<br/><br/>At the center nest of the evil sequence faction.<br/><br/>This center nest was the universe of the Lord of disaster.<br/><br/>The Lord of disaster was the first chaos-level existence born in the evil sequence faction. He had great authority.<br/><br/>Similarly, he also had the best resources.<br/><br/>This time, after the Lord of disaster was killed by Wang Xian, he was resurrected here!<br/><br/>Similarly, the other three chaos-level existences who had escaped immediately rushed over!<br/><br/>At this moment, four chaos-level existences from the evil sequence faction were floating in the void.<br/><br/>Their expressions were abnormally ugly!<br/><br/>To them, it was an extremely easy task to send troops to destroy the Dragon Palace Alliance.<br/><br/>By destroying the Dragon Palace Alliance, they would be able to obtain a huge amount of resources. Following that, they would be able to directly destroy the Justice Alliance.<br/><br/>Everything was within their plans.<br/><br/>They also thought that this would develop according to their plans.<br/><br/>However, they didn’t think that it would turn out like this!<br/><br/>“Lord of disaster, the experts of our evil sequence camp are being chased by the Dragon King. According to the information from his subordinates, the Dragon King’s strength and attack methods are extremely strange. He can instantly kill two great dao existences, and even if more than 400 heaven origin creation realm experts defend, they won’t be able to stop this attack!”<br/><br/>The old man with the bamboo hat said with an extremely grave tone!<br/><br/>The Dragon King’s strength shocked him!<br/><br/>“His attack is very strange, like a powerful curse. This kind of curse power comes from the inside. It’s impossible to resist the curse from the outside. Unless more than 400 experts inject their energy into the cursed person’s body, otherwise, they will die!”<br/><br/>The Lord of Disaster’s eyes flashed with shock.<br/><br/>“What realm is this Dragon King at? How can he be so terrifying?”<br/><br/>Sword Demon Axe’s face was full of fear, and he could not help but ask!<br/><br/>He originally thought that the chaos realm was invincible, but he did not expect that a powerful existence that could easily slaughter the chaos realm had appeared.<br/><br/>“Above the primal chaos realm, does this realm really exist?”<br/><br/>The existence with countless tentacles connected to the head couldn’t help but Mutter!<br/><br/>“No matter what, we’ve already become enemies with the Dragon King of the Dragon Palace. Next, we’re afraid that they’ll come to our evil sequence universe and attack us!”<br/><br/>The elder wearing the bamboo hat couldn’t help but say!<br/><br/>“We must think of a way to get rid of that terrifying curse. Otherwise, we’ll be exterminated one by one by him!”<br/><br/>The figure with countless tentacles connected to the head growled in a low voice.<br/><br/>“Yes!”<br/><br/>The Lord of disaster also nodded with lingering fear. “Previously, when you injected energy into my body, it was able to slow down the power of the curse, but it wasn’t able to completely resist the curse. It might require more power to do so.”<br/><br/>“Doesn’t that mean that the Dragon King of the Dragon Palace is stronger than the four of US combined?”<br/><br/>Sword Demon Axe said with a shocked expression!<br/><br/>His words made the Lord of disaster and the other three become solemn.<br/><br/>They had also thought of this.<br/><br/>Moreover, the Dragon King of the Dragon Palace alone might be stronger than the four of them combined.<br/><br/>This was the first time they had seen such a terrifying existence in their lives.<br/><br/>“Order all the experts to come over.”<br/><br/>The Lord of disaster said in a deep voice, “We have to make all the preparations and be fully prepared!”<br/><br/>“Mm!”<br/><br/>The other three primal chaos existences nodded.<br/><br/>This was the first time the evil sequence faction, which had always invaded others, had encountered such a thing!<br/><br/>…<br/><br/>“Eh? Our Lord of disaster and the others ordered us all to return to the evil sequence universe.”<br/><br/>“Hurry, Hurry, Hurry. The Dragon Palace Dragon King is still chasing us!”<br/><br/>“Damn it, what happened to our chaos-level Lord? Could it be that the Dragon Palace Dragon King really defeated our chaos-level Lord?”<br/><br/>“It’s really possible. You have to know that our chaos-level Lord led the spirit kneader and the other six great dao-level existences to the nine-origin universe in order to destroy the Dragon King of the Dragon Palace. In the end, we didn’t succeed. Instead, the Dragon King of the Dragon Palace attacked us. Our Lords definitely failed!”<br/><br/>“To be able to instantly kill two great dao-level existences and kill ten Great Dao experts in a row, is this something that a chaos-level existence can do? What level is the Dragon King of the Dragon Palace at now?”<br/><br/>Over four hundred experts from the evil sequence faction.<br/><br/>Not every expert had treasures that could allow them to instantly return to the nest of the evil sequence faction.<br/><br/>Most of them only had escape treasures that could allow them to instantly flee an extremely long distance.<br/><br/>If that was the case, after fleeing an extremely long distance, they would still have to fly towards the nest of the evil sequence faction.<br/><br/>Furthermore, there were quite a number of them, around 280 of them!<br/><br/>However, at this moment, more and more of these 280 experts were being killed!<br/><br/>Bad news was constantly being transmitted through their communicators!<br/><br/>This caused these 280 experts to panic as they flew with all their might.<br/><br/>Even though they could be revived after being killed.<br/><br/>However, at their level, the price of every resurrection was too high!<br/><br/>“Hehe, just these corpses alone are a huge amount of resources. It’s much, much more than the resources obtained from the Ten Days Federation!”<br/><br/>At the same time, Wang Xian was still chasing after them rapidly.<br/><br/>Although he had obtained a lot of resources from the ten days federation, he had only destroyed the robotic ascension universe.<br/><br/>Overall, the Mechanical Ascension universe was only a quarter of the entire evil sequence faction.<br/><br/>If he could destroy the evil sequence faction this time around, the amount of resources he would obtain would be too huge!<br/><br/>Just the corpses of these heaven origin creation stage powerhouses were several times more than the total amount of resources he had obtained from the Mechanical Ascension Universe!<br/><br/>Buzz! Buzz<br/><br/>With more than a hundred netherworld dragons chasing him, Wang Xian quickly arrived beside the powerhouses from the evil sequence faction.<br/><br/>He killed them easily!<br/><br/>After killing them, he continued on to the next one!<br/><br/>When he had used the netherworld dragons chasing him more than a hundred times, the number of corpses in his hands had reached more than a hundred!<br/><br/>“Divination!”<br/><br/>Following that, he used his divination ability to continue to lock onto the positions of the powerhouses from the other evil sequence factions.<br/><br/>With Wang Xian’s current strength, he could accurately lock onto the position of an existence at the chaos level.<br/><br/>If there was a realm above the chaos realm, Wang Xian’s current strength was not an existence that had just entered this realm.<br/><br/>Buzz Buzz Buzz<br/><br/>When his divination power locked onto an expert from the evil sequence faction, Wang Xian flashed and instantly flew far away!\t\t\t\t\t\t</div>", "images": {}, "success": true}