{"id": 1534, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15076011.html", "title": "Chapter 4537 - Chapter 4537: 3536 Annihilating The Evil Sequence Faction 2", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4537 - Chapter 4537: 3536 Annihilating The Evil Sequence Faction 2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4537: 3536 annihilating the evil sequence faction 2<br/><br/>In just 100 years, none of the Great Beings of the evil sequence faction had expected that the Dragon Palace alliance had already arrived in their territory.<br/><br/>They had already invaded their universe!<br/><br/>This made them extremely shocked and furious!<br/><br/>“There are still over 100 universes between the Yin Demon Universe and us. We can’t just watch them invade!”<br/><br/>The Lord of disaster looked at the other three primal chaos existences and said in a deep voice!<br/><br/>“We have to clash with them anyway. Why don’t we just go up and welcome them!”<br/><br/>The old man with the bamboo hat said in a deep voice!<br/><br/>They were waiting here to clash with the Dragon King of the Dragon Palace.<br/><br/>Why don’t they just go up and welcome him.<br/><br/>The other party had already entered their territory, so they were more passive while waiting here!<br/><br/>“Alright, let’s clash with the Dragon King. I want to see how the Dragon King will fight us!”<br/><br/>The experts with countless tentacles connected to their heads also coldly spoke!<br/><br/>“Find the location of all the experts from the Dragon Palace Alliance. We will directly charge over!”<br/><br/>The Lord of disaster looked at his subordinates in front and coldly ordered!<br/><br/>“Yes, Sir!”<br/><br/>The group of dao-level powerhouses responded immediately!<br/><br/>They went to search for information immediately.<br/><br/>They didn’t act rashly because they had some misgivings.<br/><br/>They hadn’t figured out the trump card of the Dragon Palace yet!<br/><br/>The powerhouses from the evil sequence faction sent people to investigate.<br/><br/>This was their territory, so they were able to investigate very quickly!<br/><br/>While they were investigating, Wang Xian continued to fly in the direction of the evil sequence universe.<br/><br/>When he passed by some universes on the way, Wang Xian entered them and started to search for some information. He also obtained more information about the evil sequence universe.<br/><br/>For example, the evil sequence universe. Some universes were directly connected to the evil sequence universe.<br/><br/>Some universes were connected to universes that were closer to the evil sequence universe.<br/><br/>This brought great convenience to Wang Xian!<br/><br/>It was much faster to teleport through the teleportation array.<br/><br/>Buzz Buzz<br/><br/>Buzz Buzz<br/><br/>Wang Xian rushed over through the teleportation array and quickly arrived at a universe that was closer to the evil sequence universe!<br/><br/>He flew out of the universe and continued flying forward.<br/><br/>Not long after, he arrived at the front of the evil sequence universe!<br/><br/>Standing in front of the evil sequence universe from afar, Wang Xian could sense the powerful energy aura in the universe in front of him.<br/><br/>“Are they all gathered here?”<br/><br/>Wang Xian mumbled as a smile appeared on his face!<br/><br/>He did not enter the evil sequence universe rashly.<br/><br/>There were more than 400 heaven origin creation realm powerhouses in the evil sequence universe.<br/><br/>There were four Primal Chaos Realm powerhouses!<br/><br/>There were 21 dao-level powerhouses!<br/><br/>There were more than 200 control-level powerhouses!<br/><br/>The rest were all beginner-level powerhouses!<br/><br/>The quality of the heaven origin creator-level powerhouses in the evil sequence faction was very high.<br/><br/>For example, in the Justice Alliance, they had more than 300 heaven origin creator-level powerhouses, but there were only about 100 control-level powerhouses.<br/><br/>The rest were all beginner-level powerhouses.<br/><br/>In terms of the number of control level powerhouses, they were far inferior to the evil sequence faction.<br/><br/>With so many powerhouses, even if Wang Xian were to fight them head-on, he wouldn’t be their match.<br/><br/>Although the other party couldn’t kill him, he was also safe and couldn’t do anything to the other party.<br/><br/>Therefore, there was only one way — curse!<br/><br/>Through the demon spirit’s curse, he could kill them bit by bit!<br/><br/>In addition, he also wanted to see the limit of his curse!<br/><br/>Buzz<br/><br/>With a move of his palm, a virtual image appeared in front of him.<br/><br/>This was the virtual image of the axe sword demon.<br/><br/>Wang Xian now controlled the aura of all the experts from the evil sequence faction and could curse all of them!<br/><br/>Buzz<br/><br/>The moment Wang Xian’s curse started, he clenched his fist toward the virtual image of the axe sword demon.<br/><br/>Cracks started to appear on the Phantom and it started to collapse!<br/><br/>Axe Sword Demon was the weakest existence at the chaos level. It was easier to kill him with a curse than the Lord of Calamity!<br/><br/>Of course, there was a limit to how easy it was!<br/><br/>“Eh? What’s going on? My Body!”<br/><br/>At the same time, when Wang Xian’s attack started.<br/><br/>At the center of the evil sequence universe, axe sword demon, who was floating in the air, suddenly felt that he had suffered a terrifying attack.<br/><br/>Cracks instantly appeared on his body!<br/><br/>After seeing the sudden change in his body, sword demon axe’s expression changed drastically, and he couldn’t help but Roar in a low voice!<br/><br/>His words instantly attracted the attention of all the experts around him.<br/><br/>The eyes of the Lord of disaster and the others focused, and they immediately locked onto Sword Demon Axe’s body!<br/><br/>“What’s the situation?”<br/><br/>The chaos-level elder wearing a bamboo hat looked at sword demon axe, and a shocked expression appeared on his face.<br/><br/>As far as his eyes could see, axe sword demon’s body was rapidly cracking!<br/><br/>It was rapidly collapsing!<br/><br/>This was very inconceivable for a primal chaos level expert.<br/><br/>“This kind of attack?”<br/><br/>The Lord of Disaster’s expression changed drastically when he saw this scene, and his pupils constricted slightly.<br/><br/>He was very familiar with this kind of attack!<br/><br/>“Weng!”<br/><br/>His body moved, and he immediately arrived in front of axe sword demon.<br/><br/>“It’s a curse, a curse from that Dragon King!”<br/><br/>The Lord of disaster growled with a grave expression!<br/><br/>“Save me!”<br/><br/>When Axe sword demon heard the Lord of Disaster’s words, his expression changed greatly and he immediately asked for help!<br/><br/>“Damn it, how is this possible? is that Dragon King around? How did he do such a curse?”<br/><br/>Countless chaos-level experts connected to the head immediately extended their tentacles and connected to his body.<br/><br/>Energy surged into axe sword demon’s body.<br/><br/>The old man with the bamboo hat and the Lord of disaster also came to help!<br/><br/>“How is it?”<br/><br/>The three people’s energy entered his body, and the Lord of disaster asked Axe Sword Demon.<br/><br/>“No, it’s impossible. The life force in my body is still draining rapidly. I can only hold on for a few hours at most!”<br/><br/>Sword Demon Axe roared, a trace of fear on his face!<br/><br/>After all, he had just completed his breakthrough and did not have a powerful resurrection treasure in his hands.<br/><br/>Once he died, his strength would fall to the Great Dao level.<br/><br/>At that time, he would need a large amount of resources to recover!<br/><br/>“What’s going on? What happened to our sword demon axe?”<br/><br/>“Our Lord Axe Sword Demon seems to have been attacked and cursed. Oh My God, this? ? ?”<br/><br/>“Is it the Dragon King’s Curse? That Dragon King’s curse can instantly kill two great dao existences. It’s extremely terrifying!”<br/><br/>At the same time, all the experts from the evil sequence camp were stunned.<br/><br/>One of their chaos-level lords had actually suffered an inexplicable attack.<br/><br/>This left them extremely shocked!<br/><br/>That Dragon King was actually able to curse from such a far distance?<br/><br/>“All great dao-level experts, come over!”<br/><br/>When the Lord of Disaster Heard Axe Sword Demon’s words, he ordered with a gloomy expression! ! !\t\t\t\t\t\t</div>", "images": {}, "success": true}