{"id": 1540, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15076041.html", "title": "Chapter 4543 - Chapter 4543: 4542 Annihilated The Evil Sequence Faction 8", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4543 - Chapter 4543: 4542 Annihilated The Evil Sequence Faction 8</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4543: 4542 annihilated the evil sequence faction 8<br/><br/>“I’m going to die, I’m going to die completely. Lord, Avenge Me! Avenge me!”<br/><br/>The Spirit Kneader was located on a planet. At this moment, he looked like a child.<br/><br/>After being killed hundreds of times in a row, his strength had been reduced to an extremely low level.<br/><br/>He had used up all the resurrected treasures.<br/><br/>At this moment, he was already numb.<br/><br/>Despair had already passed.<br/><br/>Now, his only hope was that Lord Disaster Master and the others could kill the Dragon King!<br/><br/>Other than that, he had no other thoughts.<br/><br/>“All the great beings have fallen.”<br/><br/>“The outside of the universe is ahead, and the Dragon King Is There!”<br/><br/>When the Great Beings of the evil sequence universe began to die completely, disaster master and the others spoke with grave expressions.<br/><br/>Although they were very strong now, they were still extremely cautious when facing the Dragon King above the chaos.<br/><br/>This would be a great battle.<br/><br/>“We will definitely win this battle!”<br/><br/>“We will definitely kill that Dragon King!”<br/><br/>Some experts of the evil sequence universe roared.<br/><br/>The group of experts stared ahead and flew away quickly.<br/><br/>At the same time, Wang Xian was floating quietly in front of the evil sequence universe.<br/><br/>The Divine Roc of the Nine Heavens was beside him, staring at the universe in front of him.<br/><br/>The people of the spirit kneader and the rest had been completely destroyed by him.<br/><br/>Now, it was the remaining 400 or so experts of the evil sequence camp.<br/><br/>Time passed day by day.<br/><br/>As the distance between the two parties got closer, Wang Xian could sense the power of the four forces in front of him even more clearly.<br/><br/>“About eight primal chaos level combat strength, plus one great dao level.”<br/><br/>Wang Xian mumbled.<br/><br/>His eyes flickered slightly. With a move of his palm, a black hole appeared in front of him.<br/><br/>Within the black hole, the buildings of the Dragon Palace flew out one by one.<br/><br/>Wang Xian looked at the Divine Roc of the nine heavens and passed the buildings to him.<br/><br/>“Wait a moment. I’ll pass one of the four forces to you.”<br/><br/>Wang Xian said to the Divine Roc of the Nine Heavens.<br/><br/>With Wang Xian’s individual strength, he was still not a match for the evil sequence faction.<br/><br/>He needed the Divine Roc of the Nine Heavens to help him restrain some of the opponent’s powers.<br/><br/>He wanted to see how strong his current combat strength was!<br/><br/>“Alright, Dragon King. Leave it to me!”<br/><br/>The Divine Roc of the Nine Heavens’eyes sparkled as he nodded his head heavily.<br/><br/>The combat strength of the Divine Roc of the Nine Heavens was unquestionable.<br/><br/>“It’s Here!”<br/><br/>Not long after, Wang Xian stared at the spot in front of him. In his line of sight, three blood-red rays of light shot straight into the clouds.<br/><br/>Among them, there were terrifying creatures with countless tentacles.<br/><br/>“It’s Here!”<br/><br/>The Divine Roc of the Nine Heavens Stared at the spot in front of him. His eyes were filled with fighting spirit.<br/><br/>Around him, there were Dragon Palace buildings of the heaven origin creation level surrounding him!<br/><br/>“Kill that Dragon King!”<br/><br/>“That Dragon King actually dared to wait for us there. Kill him!”<br/><br/>“Kill him!”<br/><br/>When the group of powerhouses from the evil sequence faction saw Wang Xian’s figure, their eyes were filled with intense killing intent.<br/><br/>This time, it was either you or me who would die!<br/><br/>“Hehe, you bunch of Damn Fellows. You actually have the courage to come over!”<br/><br/>Wang Xian stared at them and said with a face full of mockery.<br/><br/>The fact that the other party was able to join forces was actually an opportunity for them.<br/><br/>Otherwise, they would not be able to escape.<br/><br/>Wang Xian could hunt them down one by one!<br/><br/>“Dragon King of the Dragon Palace, this is the time for you to die.”<br/><br/>“So what if we are above chaos? This time, we are going to kill above Chaos!”<br/><br/>The Lord of disaster, thousand tentacles, and the rest roared with murderous intent.<br/><br/>“Hehe!”<br/><br/>Wang Xian smiled contemptuously as he looked at the Divine Rocs of the nine heavens.<br/><br/>“Attack!”<br/><br/>Wang Xian shouted loudly as his time domain covered the divine rocs of the nine heavens.<br/><br/>At the same time, he moved his body and attacked the Lord of disaster and the rest.<br/><br/>“Don’t hold back at all. Unleash your energy!”<br/><br/>When the Lord of disaster saw Wang Xian and the rest, he started to move.<br/><br/>They could only feel the terrifying phantom image and could not lock onto the phantom image at all. They shouted in a stern voice!<br/><br/>“Boom Boom Boom!”<br/><br/>“Boom Boom Boom!”<br/><br/>Following that, the energy boiled.<br/><br/>The Lord of Disaster, the old man with the bamboo hat, and the axe sword demon formed an energy ocean with the three of them as the center.<br/><br/>The blood-red energy ocean merged with each other, and its power was overwhelming!<br/><br/>However, Wang Xian had unleashed all his strength this time!<br/><br/>He locked onto the Lord of disaster and arrived before him before he could react.<br/><br/>His arm turned into a dragon claw and clawed at the face of the Lord of disaster.<br/><br/>The terrifying speed and powerful energy caused the ferocious face of the Lord of disaster to bleed instantly.<br/><br/>The entire ferocious face was torn apart instantly, revealing the black body inside.<br/><br/>The entire body of the Lord of calamity was like a pool of mud in hell, filled with filthy energy.<br/><br/>Wang Xian’s move caused the lord of calamity to be severely injured instantly!<br/><br/>“Ahhhhh!”<br/><br/>“Ahhhhh!”<br/><br/>A miserable scream came from the mouth of the Lord of calamity.<br/><br/>The group of powerhouses behind him also let out a miserable scream.<br/><br/>At the same time, wounds started to appear on the bodies of the Heavenly Genesis powerhouses from the evil array faction.<br/><br/>The damage was transferred!<br/><br/>The damage was evenly distributed!<br/><br/>In less than a second, the injuries on the Lord of calamity and the rest began to recover rapidly!<br/><br/>“Attack the Dragon King!”<br/><br/>The Lord of calamity endured the intense pain. From his extremely hideous face, a blood-red pupil appeared.<br/><br/>This pupil shot towards Wang Xian.<br/><br/>“Attack!”<br/><br/>From the side, thousand-tentacle axe sword demon and the rest roared and attacked Wang Xian’s figure.<br/><br/>They had witnessed Wang Xian’s terrifying speed. However, they could launch a large-scale attack.<br/><br/>Their current energy could cover an extremely terrifying area.<br/><br/>Their combined strength could easily destroy an entire universe.<br/><br/>At the side, the elder with the bamboo hat was locked onto by the Divine Roc of the Nine Heavens.<br/><br/>The Divine Roc of the Nine Heavens, who was carrying a group of buildings of the Heaven’s origin level in the Dragon Palace, was no weaker than the elder with the bamboo hat.<br/><br/>“Huh?”<br/><br/>After Wang Xian had severely injured the Lord of calamity, he raised his eyebrows slightly when he saw that the Lord of calamity was recovering rapidly.<br/><br/>He felt the energy that the lord of calamity and the rest were attacking him.<br/><br/>Wang Xian used the power of chaos to form a protective shield.<br/><br/>He carefully observed the state of the Lord of Calamity and the rest.<br/><br/>“Using a special treasure to connect with dozens of Heaven’s origin powerhouses. Although the overall strength has decreased, the overall vitality has not decreased.”<br/><br/>Wang Xian frowned slightly.<br/><br/>At the same time, he continued to dodge under the opponent’s attack tide!<br/><br/>The opponent’s three forces, take the Lord of Calamity as an example. If they were not connected together, the destructive power that they could unleash would be comparable to five to six existences of the chaos level.<br/><br/>However, because they were connected together, the destructive power had decreased drastically. Only two existences of the chaos level were left.<br/><br/>However, their vitality did not decrease.<br/><br/>In other words, it was very difficult for Wang Xian to kill them.\t\t\t\t\t\t</div>", "images": {}, "success": true}