{"id": 1548, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15090460.html", "title": "Chapter 4551 - Chapter 4551: 4550 Exterminating The Evil Sequence Camp 16", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4551 - Chapter 4551: 4550 Exterminating The Evil Sequence Camp 16</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4551: 4550 exterminating the evil sequence camp 16<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>The sounds of explosions rang out continuously.<br/><br/>The terrifying ocean of energy continued to impact in the chaos.<br/><br/>Wang Xian brought along the Divine Roc of the Nine Heavens and launched a fierce attack on the Lord of Calamity and the others.<br/><br/>The Lord of Calamity and the others were no longer a match for Wang Xian and the others. They resisted and fled in the face of the attacks from Wang Xian and the others.<br/><br/>Their strong vitality made it difficult for them to be killed.<br/><br/>Even if the powerful attacks landed on them, they were not that serious after being split up.<br/><br/>In addition to their strong regenerative abilities, Wang Xian had only injured them a little after attacking them for a few months.<br/><br/>The eyes of the Lord of calamity, axe sword demon, and the old man in the bamboo hat were blood-red. They had completely disregarded everything else and turned their defenses to the maximum. They were desperately fleeing in one direction.<br/><br/>Faced with Wang Xian’s attack, they did not resist.<br/><br/>This was because they knew that resisting would no longer cause any harm to the Dragon King.<br/><br/>Instead, they were just wasting their time!<br/><br/>“Dragon King, it will take a very long time to completely kill these guys.”<br/><br/>After attacking for a few months, the Divine Roc of the nine heavens frowned slightly and said!<br/><br/>“Focus on attacking the guy with the huge sword. If we can’t kill them in a few months, I don’t believe that we can’t kill them in decades, centuries, or even a thousand years!”<br/><br/>Wang Xian’s eyes flashed with a cold glint.<br/><br/>Now, the three of them had gathered their energy together to form a defense.<br/><br/>Although Wang Xian could break it, the energy consumption was huge.<br/><br/>Ultimately, it would only cause light injuries to them.<br/><br/>However, as time passed, they would still be able to kill them.<br/><br/>This was especially so for the weakest axe sword demon.<br/><br/>As long as one of them was killed, the rest would be much easier!<br/><br/>“Charge, Charge!”<br/><br/>“Ignore this dragon king. Run!”<br/><br/>At this moment, the Lord of calamity and the rest were roaring. The energy of the three of them was enveloping them as they desperately advanced and fled.<br/><br/>They were seeking for a chance to survive.<br/><br/>“Kill!”<br/><br/>“Even if I have to chase after you for tens of millions of years, hundreds of millions of years, I will still destroy you!”<br/><br/>Wang Xian’s eyes were cold as he stared at the Lord of Calamity and roared.<br/><br/>Numerous attacks were attacking them continuously.<br/><br/>Wang Xian relied on his speed and time domain.<br/><br/>One day of chasing was equivalent to one hundred days of attacking.<br/><br/>The attacks were extremely violent.<br/><br/>At the same time, he absorbed the surrounding chaotic energy to recover the energy he had consumed.<br/><br/>Time passed little by little. This time, Wang Xian focused on attacking axe sword demon!<br/><br/>Gradually, more and more wounds appeared on his body.<br/><br/>Axe sword demon also knew that the Dragon King wanted to get rid of the weakest one first.<br/><br/>However, they had no other choice. They could only hold on and resist.<br/><br/>While Wang Xian was pursuing and fighting against them.<br/><br/>They were located at the evil sequence alignment camp.<br/><br/>Along with Wang Xian restraining their heaven origin creation level powers.<br/><br/>The powerhouses of the Dragon Palace and the Dragon Palace Alliance began to kill the disciples of the evil sequence alignment camp wantonly.<br/><br/>The growth of this group of disciples was filled with blood. The Dragon Palace Alliance showed no mercy to them!<br/><br/>There was no mercy at all.<br/><br/>The Dragon Palace Alliance, which consisted of hundreds of heaven origin creation realm powerhouses, quickly finished off the universes of the evil sequence alignment camp.<br/><br/>A large number of treasures and corpses were put away.<br/><br/>The harvest was extremely terrifying.<br/><br/>One had to know that the evil sequence alignment camp controlled and occupied three to four hundred universes.<br/><br/>This was an unimaginable amount of resources!<br/><br/>“HMM?”<br/><br/>Two figures appeared in front of a universe in the evil sequence faction.<br/><br/>They looked at the situation in the universe in front of them, their faces filled with astonishment.<br/><br/>“The powerhouses of the Dragon Palace Alliance are slaughtering the universe of the evil sequence faction. Hundreds of heaven origin creation realm powerhouses didn’t resist the evil sequence faction!”<br/><br/>“That Dragon King single-handedly restrained all the powerhouses of the evil sequence faction? How is that possible? How did he do it?”<br/><br/>The newcomers were two chaos-level existences from the Justice Alliance.<br/><br/>They were extremely shocked when they received the news that the Dragon Palace Alliance was attacking the evil sequence faction.<br/><br/>They immediately rushed over.<br/><br/>They were also extremely shocked when they saw the situation in the evil sequence faction.<br/><br/>The two of them looked at each other and quickly flew towards the evil sequence universe.<br/><br/>They knew that the evil sequence universe was the center of the evil sequence faction.<br/><br/>It was impossible for the evil sequence faction to give up there.<br/><br/>However, when they arrived at the evil sequence universe more than ten years later, they were shocked when they saw the universe that didn’t have the aura of a powerhouse at all!<br/><br/>“What happened? There are no powerhouses from the evil sequence universe? Could it be that they have given up on the path of confrontation with the Dragon Palace Alliance?”<br/><br/>“In that place in the universe, there are remnants of terrifying and vast energy. There are all kinds of energy. There must have been an unparalleled battle here. Based on the current situation, the Dragon King should have won the battle. Otherwise, the evil sequence camp would not be in such a situation!”<br/><br/>The two chaos-level powerhouses from the Justice Alliance came to the place where Wang Xian and the rest had fought not long ago with a face full of shock. They were feeling a little shocked.<br/><br/>The remnant energy aura here gave them a suffocating feeling.<br/><br/>They felt that even if they were here, they could be crushed.<br/><br/>“What exactly happened? How did the Dragon King fight against so many powerhouses from the evil sequence faction? You must know that the powerhouses from the Dragon Palace Alliance and the Dragon Palace did not make a move. They were occupying the universes behind them!”<br/><br/>The Alliance Master of the Justice Alliance said solemnly.<br/><br/>“Let’s enter the evil sequence universe and take a look. Let’s not act Rashly!”<br/><br/>The old man at the side said.<br/><br/>They moved and entered the evil sequence universe again.<br/><br/>This time, they searched for some information.<br/><br/>In the end, they obtained a few high-level communicators.<br/><br/>This communicator belonged to the evil sequence faction, the communication device used by the heaven origin creation realm powerhouses.<br/><br/>When they cracked it open and saw the contents, their faces were filled with shock.<br/><br/>On it, there was a lot of information that made them feel terrified.<br/><br/>The Great Dao realm powerhouses were asking for help. They had suffered terrifying curses, and they were dying time and time again.<br/><br/>They were going to be completely destroyed!<br/><br/>In the back, they even saw thousand tentacles’distress signal.<br/><br/>Thousand Tentacles, they knew.<br/><br/>The evil sequence faction, a chaos-level existence.<br/><br/>He was also asking for help, and he was also wailing.<br/><br/>He was also terrified!<br/><br/>In the end, he said that he was going to die, and he had completely dissipated!<br/><br/>The evil sequence faction, a chaos-level existence, was an invincible existence like them.<br/><br/>But now, he was dead!<br/><br/>And the murderer was the Dragon King.<br/><br/>No, it couldn’t be said that he was the murderer, it should be said that he was the attacker.<br/><br/>“It seems that the Dragon King is still chasing after the Lord of disaster and the others.”<br/><br/>The leader of the Justice Alliance said in shock.<br/><br/>Killing a chaos-level existence!\t\t\t\t\t\t</div>", "images": {}, "success": true}