{"id": 1549, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15090463.html", "title": "Chapter 4552 - Chapter 4552: 4551 Exterminating The Evil Sequence Camp 17", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4552 - Chapter 4552: 4551 Exterminating The Evil Sequence Camp 17</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4552: 4551 exterminating the evil sequence camp 17<br/><br/>Time was passing by quickly.<br/><br/>A few hundred years of time passed by in a blink of an eye.<br/><br/>However, these few hundred years were the darkest few hundred years for Axe Sword Demon.<br/><br/>He was constantly suffering from extremely powerful attacks.<br/><br/>A few hundred years was equivalent to Wang Xian. With the time domain, he had been attacking for tens of thousands of years.<br/><br/>For tens of thousands of years, the Lord of Calamity, axe sword demon, and the old man with the bamboo hat formed a defense and kept on escaping.<br/><br/>Wang Xian also kept on attacking.<br/><br/>With Wang Xian and the Nine Heavens Divine Roc, his strength was only two times stronger than theirs.<br/><br/>On the other hand, axe sword demon and the rest had a thread of life. Their vitality was extremely strong.<br/><br/>If they didn’t have an extremely strong vitality, Wang Xian’s continuous attacks on the axe sword demon for tens of thousands of years would have been enough to grind him to death.<br/><br/>But now, the axe sword demon was only injured.<br/><br/>Moreover, these injuries were not fatal.<br/><br/>However, it was so in time. Every attack made the axe sword demon shudder in fear!<br/><br/>“Based on the current situation, it will take more than 800 years to completely destroy it!”<br/><br/>Wang Xian looked at the injuries on axe sword demon’s body and calculated everything.<br/><br/>“It will take more than a thousand years for us to reach that area. There are many black holes that lead to very far away places. As long as we enter one of the black holes, the Dragon King will not be able to pursue us!”<br/><br/>“Let’s endure it for now. When we are about to reach the black hole, we will erupt!”<br/><br/>The Lord of Calamity kept transmitting his voice to axe sword demon and the rest!<br/><br/>It was supposed to be a journey of a thousand years, but Wang Xian’s continuous attacks had hindered their speed.<br/><br/>Now, they still needed more than a thousand years to reach that place.<br/><br/>Time continued to pass, but Wang Xian continued to attack.<br/><br/>With his divination ability, Wang Xian really didn’t believe that they could escape from his palm.<br/><br/>A few hundred years passed once again. Gradually, the injuries on axe sword demon’s body grew more and more.<br/><br/>They were getting more and more serious.<br/><br/>The Heaven’s origin creator, who was connected by the thread of life, began to vomit blood. His face was extremely pale and there were also severe injuries on his body.<br/><br/>“I can’t hold on much longer!”<br/><br/>“If I continue to be attacked like this, my strength will be reduced. At that time, I will be killed!”<br/><br/>500 years later, axe sword demon couldn’t help but shout.<br/><br/>His injuries were very serious, and he couldn’t recover.<br/><br/>Soon, his power would decrease.<br/><br/>Once he couldn’t use the power he had at his peak, he would be more vulnerable and more miserable!<br/><br/>“We have treasures here. Hold on for another 500 years!”<br/><br/>The expressions of disaster master and the others changed slightly. They took out true treasures to recover and gave them to him!<br/><br/>Axe sword demon took their treasures and heaved a sigh of relief.<br/><br/>Continue to hold on!<br/><br/>However, after a hundred years, all the treasures had been used up, and axe sword demon’s injuries continued to worsen!<br/><br/>“I can only hold on for a dozen years. After a dozen years, my power will be reduced to a primal chaos level!”<br/><br/>Axe sword demon roared in shock!<br/><br/>“All the treasures have been used up. We’ll help you heal!”<br/><br/>There was no other way. The Lord of disaster and the old man wearing the bamboo hat could only use up their own strength to heal the injuries in his body.<br/><br/>Sword Demon Axe continued to hold on.<br/><br/>But fifty years later, he could no longer hold on!<br/><br/>“My current injuries can only be equivalent to that of a chaos-level expert!”<br/><br/>Sword Demon Axe said weakly!<br/><br/>He had been holding on for too long.<br/><br/>It had numbed his mind!<br/><br/>“Dragon King, we are willing to give up all our resources and let us off.”<br/><br/>The Lord of Calamity’s expression changed as he spoke to Wang Xian!<br/><br/>“Hehe!”<br/><br/>Wang Xian sneered and ignored them!<br/><br/>“Dragon King, what do you want us to do to make you willing to let you off? As long as you say it, we will definitely agree!”<br/><br/>After a long while, the old man with the bamboo hat also spoke up!<br/><br/>They had completely admitted defeat!<br/><br/>They were completely convinced!<br/><br/>If this continued, they might not be able to escape to that area!<br/><br/>“I will not forgive the enemy who wants to destroy my Dragon Palace. I will kill him completely!”<br/><br/>Wang Xian spoke coldly!<br/><br/>He continued to attack the axe sword demon.<br/><br/>This made the Lord of disaster and the old man with the bamboo hat roar in anger.<br/><br/>He kept roaring.<br/><br/>He kept threatening.<br/><br/>However, Wang Xian smiled and ignored him. He continued to attack!<br/><br/>“I’m going to die, I’m going to die!”<br/><br/>A hundred years later, the Axe Sword Demon roared in fear. At this moment, there was nothing good on his body.<br/><br/>His entire body was decaying and there was not much vitality left!<br/><br/>Boom! Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>Accompanied by Wang Xian’s continuous attacks, the axe sword demon collapsed completely and was completely annihilated.<br/><br/>At the same time, there was also the group of Heaven’s origin powerhouses behind him.<br/><br/>After being annihilated, the Lord of calamity and the old man with the bamboo hat were in extreme despair!<br/><br/>Wang Xian was not in a hurry to attack them. Instead, he killed the axe sword demon spell a few more times.<br/><br/>This caused his strength to drop to the level of the Great Dao!<br/><br/>“Next, it’s Your Turn!”<br/><br/>Wang Xian said to the Lord of Calamity and the rest with a grim expression!<br/><br/>Axe Sword Demon was killed by Wang Xian. There were only two of them left. The rest would be much easier!<br/><br/>As time passed, the chaos shook.<br/><br/>There were no other powerhouses in this area that belonged to the evil sequence faction.<br/><br/>Otherwise, if there were any powerhouses in the Heaven’s origin realm who saw this scene, they would definitely be extremely shocked!<br/><br/>After all, they were extremely terrified.<br/><br/>Five hundred years later, the old man with the bamboo hat was completely killed by Wang Xian.<br/><br/>Following that, a year later, the Lord of Calamity was also killed by Wang Xian.<br/><br/>They had also used all their trump cards.<br/><br/>However, they were unable to avoid Wang Xian’s pursuit.<br/><br/>From then on, the four chaos-level existences in the evil sequence faction were all killed by Wang Xian.<br/><br/>Of course, Wang Xian would still need to waste some time to completely kill the Lord of calamity, axe sword demon, and the old man with the bamboo hat.<br/><br/>“Hehe, it’s simple now. After destroying the evil sequence faction, I won’t let myself down this time.”<br/><br/>Wang Xian put away the corpses of the Lord of calamity and the others and smiled.<br/><br/>Following that, he began to curse and kill the evil sequence faction, the group of Heaven origin creation powerhouses who were still alive.<br/><br/>In fact, most of the heaven origin creation realm powerhouses in the evil sequence faction had not died completely.<br/><br/>They were all expressing their confidence in their communicators in fear.<br/><br/>The powerhouses were contacting each other, wanting to escape!<br/><br/>At the same time, somewhere in the chaos of the evil sequence faction.<br/><br/>The Alliance Master of the Justice Alliance and the others looked at the messages that suddenly appeared in their communicators, their faces filled with shock!<br/><br/>They were filled with disbelief!<br/><br/>From the words of these experts.<br/><br/>They knew that the Dragon King of the Dragon Palace had destroyed four chaos-level existences in their evil sequence faction.\t\t\t\t\t\t</div>", "images": {}, "success": true}