{"id": 1542, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15076051.html", "title": "Chapter 4545 - Chapter 4545: 4544 Annihilating The Evil Sequence Universe 10", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4545 - Chapter 4545: 4544 Annihilating The Evil Sequence Universe 10</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4545: 4544 annihilating the evil sequence universe 10<br/><br/>The Lord of disaster and the others were pleasantly surprised at the same time that the Dragon King was injured.<br/><br/>They were equally shocked by the Dragon King’s strength.<br/><br/>Right now, each of them had a combat strength that was no weaker than two chaos levels.<br/><br/>However, even when they joined forces and launched a sneak attack, they still only managed to injure the Dragon King a little, which shocked them.<br/><br/>What was going to happen next was going to be a fierce battle for them.<br/><br/>“Sure!”<br/><br/>Wang Xian narrowed his eyes slightly and looked at the Lord of disaster and the rest.<br/><br/>He didn’t give the other party too much time and charged straight at them.<br/><br/>Wang Xian wasn’t afraid of a one-on-three battle.<br/><br/>Just now, he was only slightly injured after receiving the full force attack from the other three.<br/><br/>This was not his limit yet.<br/><br/>He wanted to see where his limit lay.<br/><br/>“You’re courting death. Kill!”<br/><br/>“Kill!”<br/><br/>Seeing Wang Xian charging toward them, the Lord of calamity and the rest were filled with killing intent.<br/><br/>“Get rid of him as soon as possible. Don’t hold anything back. This special space of mine can’t hold on for too long. Use your ultimate move directly!”<br/><br/>“In this space, the Dragon King’s speed will be suppressed by me. The opponent’s figure will also be locked onto!”<br/><br/>The Lord of disaster reminded loudly.<br/><br/>At the same time, his extremely ferocious face began to change.<br/><br/>It split into countless small faces with dense fangs as it attacked Wang Xian.<br/><br/>Thousand Tentacles and axe sword demon also knew that they had to end the battle as soon as possible. Otherwise, with the Dragon King’s speed, they wouldn’t be able to stop him at all.<br/><br/>“Apocalypse, sword container!”<br/><br/>Axe Sword Demon let out a furious roar as he waved the ultimate treasure of Tianyuan in his hand.<br/><br/>A Ray of sword light covered the entire space and pierced towards Wang Xian.<br/><br/>“Strange, tentacles!”<br/><br/>Thousand Tentacles focused his gaze. Countless tentacles split apart from his body and disappeared.<br/><br/>The next moment, the entire space was covered by these tentacles.<br/><br/>Large-scale attacks were all large-scale attacks.<br/><br/>Apart from large-scale attacks, Wang Xian’s figure was severely restricted in this space.<br/><br/>His figure was being stared at and locked onto by countless eyes.<br/><br/>It was restricting his speed.<br/><br/>Even so, Wang Xian’s speed was still extremely terrifying!<br/><br/>Faced with the opponent’s large-scale attack, Wang Xian’s palm moved slightly. The divination power on it continued to perform divination.<br/><br/>Looking for flaws.<br/><br/>Looking for the best attack method.<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Wang Xian used his divination power to look for the weakest point of the attack.<br/><br/>His entire body was enveloped by the shield of Chaos for defense.<br/><br/>At the same time, he attacked thousand tentacles.<br/><br/>“He’s attacking me!”<br/><br/>Thousand Tentacles had just released his attack when he saw Wang Xian attacking him. His expression changed slightly as he shouted!<br/><br/>He controlled a large number of tentacles to pierce towards Wang Xian!<br/><br/>“Dong Dong!”<br/><br/>Wang Xian’s eyes focused as a mutated spatial energy circulated within his body.<br/><br/>It was a unique spatial energy that was hidden in the dark. It caused Wang Xian to start teleporting.<br/><br/>A short distance teleportation was even more terrifying than Wang Xian’s maximum speed!<br/><br/>“Buzz!”<br/><br/>In the next instant, Wang Xian appeared in front of thousand tentacles. His arms were like dragon claws as he clawed towards thousand tentacles’head.<br/><br/>“PFFT!”<br/><br/>With a swipe of his claw, thousand tentacles’head exploded instantly!<br/><br/>“Ahhhh!”<br/><br/>A miserable shriek came from some of thousand tentacles’tentacles. Countless tentacles attacked Wang Xian.<br/><br/>“Kill!”<br/><br/>At the side, the Lord of Calamity and axe sword demon’s expressions changed slightly. They immediately came to Wang Xian’s rescue.<br/><br/>When Wang Xian saw this scene, he moved his body and disappeared instantly. He began to dodge.<br/><br/>“You Want to kill me? Am I that easy to kill?”<br/><br/>The moment he left, thousand tentacles’head that was blown off instantly recovered.<br/><br/>He stared at Wang Xian with hatred and roared.<br/><br/>When Wang Xian saw this scene, there was no change at all.<br/><br/>He moved his palm and started to perform divination while staring at thousand tentacles.<br/><br/>Divination of his weakness.<br/><br/>Very soon, he received a piece of information.<br/><br/>“We can not attack in a large area. He has very strong combat talent. Our attacks must be concentrated.”<br/><br/>At this moment, the Lord of disaster transmitted his voice to thousand tentacles axe sword demon.<br/><br/>A large area attack would definitely disperse the attack power. This was unquestionable.<br/><br/>“Not only does he have powerful speed, but he also has a powerful teleportation power. Even his recovery power is very terrifying.”<br/><br/>Axe sword demon spoke with a solemn expression.<br/><br/>“Kill! It’s not certain who will win!”<br/><br/>Thousand Tentacles continued to speak with a face full of killing intent.<br/><br/>His countless tentacles condensed into one and attacked Wang Xian directly.<br/><br/>Wang Xian stared at the countless tentacles and raised his eyebrows slightly. With a move of his body, his figure disappeared once again.<br/><br/>Whoosh<br/><br/>Wang Xian’s figure came to the huge tentacles of thousand tentacles. A sharp sword appeared in his palm and exploded towards one of the tentacles.<br/><br/>The destructive sword of chaos pierced through the tentacle directly.<br/><br/>“Eh?”<br/><br/>The thousand tentacles was shocked when he saw the location where the sword of chaos pierced.<br/><br/>Was it a coincidence?<br/><br/>His mind changed as the Tentacle split apart and charged towards Wang Xian.<br/><br/>At the side, the Lord of Calamity and the axe sword demon charged towards him once again.<br/><br/>“This thousand tentacles has a weakness. This weakness is connected to the Heaven’s origin creator in his tentacle. As long as we destroy it, it will be easy to kill him.”<br/><br/>“However, this weakness of his can be shifted at any time. In other words, he can shift his weakness with just a thought.”<br/><br/>“If I want to destroy him, I need to take advantage of his unprepared state and destroy his weakness!”<br/><br/>Wang Xian thought to himself!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>While he was thinking, countless attacks came at him once again.<br/><br/>When Wang Xian saw these attacks, he used teleportation to dodge them easily!<br/><br/>“D * mn it, this won’t do. He has a special teleportation ability. We have to launch an area-of-effect attack.”<br/><br/>When the Lord of calamity saw Wang Xian dodging their attacks easily, his expression changed again.<br/><br/>He couldn’t focus his attacks or it would be difficult to focus them on him.<br/><br/>“Senior Lord of Calamity, we can fight him to the death. Our strongest strength now is our vitality. We can exchange our injuries with him!”<br/><br/>Axe sword demon transmitted his voice.<br/><br/>“Alright!”<br/><br/>The Lord of disaster nodded silently and exchanged a glance with axe sword demon!<br/><br/>“Kill!”<br/><br/>They roared in unison once again. Their might enveloped the entire space.<br/><br/>They were prepared to launch a large-scale attack at Wang Xian.<br/><br/>Thousand Tentacles was positioned at the back. His eyes flickered as he assisted Wang Xian.<br/><br/>“Huh?”<br/><br/>Wang Xian saw their attacks and raised his eyebrows slightly.<br/><br/>Numerous chaos spears condensed in front of him and pierced directly at the Lord of Disaster.<br/><br/>The terrifying Spears forced the Lord of disaster and the others to face and resist with all their might.<br/><br/>However, with their strength, they were able to resist.<br/><br/>Buzz! Buzz! Buzz<br/><br/>At the moment when they were resisting, Wang Xian turned around and attacked this space.<br/><br/>This space did have some restrictions on him.<br/><br/>If he wanted to drag this on, he had to break this space first!\t\t\t\t\t\t</div>", "images": {}, "success": true}