{"id": 1544, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15076066.html", "title": "Chapter 4547 - Chapter 4547: 4546 Exterminating The Evil Sequence Camp 12", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4547 - Chapter 4547: 4546 Exterminating The Evil Sequence Camp 12</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4547: 4546 exterminating the evil sequence camp 12<br/><br/>“How is this possible?”<br/><br/>“How is this possible?”<br/><br/>Thousand Tentacles was completely stunned by the sudden change.<br/><br/>His tentacle attack had actually been attacked by the Dragon King to the inside, attacking the Heavenly Yuan creation realm powerhouses.<br/><br/>In his opinion, this was simply impossible.<br/><br/>However, the death of thirty to forty Heavenly Yuan creation realm powerhouses had caused the energy in thousand tentacles’body to plummet.<br/><br/>His combat strength, which was originally comparable to two chaos realm experts, was instantly reduced to only being comparable to one chaos realm expert and two Great Dao realm experts.<br/><br/>This reduction was extremely huge for him!<br/><br/>However, what frightened him the most was that the Dragon King was able to penetrate his tentacles and attack the experts within.<br/><br/>“What happened?”<br/><br/>The Lord of disaster and Axe Sword Demon did not know what was happening inside thousand tentacles’body.<br/><br/>When they heard thousand tentacles’exclamation, they widened their eyes and roared!<br/><br/>“Some of the powerhouses in my body were killed. They were killed by the Dragon King!”<br/><br/>Thousand Tentacles roared loudly!<br/><br/>“This is only the beginning!”<br/><br/>Wang Xian stared at thousand tentacles and did not give them any time to attack.<br/><br/>“Attack him on a large scale.”<br/><br/>“Kill him!”<br/><br/>The Lord of Calamity and Axe Sword Demon’s expressions changed slightly.<br/><br/>They suddenly enlarged their bodies by a few hundred times and attacked Wang Xian!<br/><br/>Wang Xian was surrounded by the power of chaos. He withstood their attacks and attacked thousand tentacles.<br/><br/>Over a million years, he had already understood everything about thousand tentacles.<br/><br/>The energy within his body.<br/><br/>The energy composition within his body.<br/><br/>He had also used divination to gain insight into his innate skill.<br/><br/>It was a skill that could store other experts within his tentacles as his own energy.<br/><br/>Wang Xian had already gained insight into all of it.<br/><br/>“Die!”<br/><br/>When the thousand tentacles saw Wang Xian charging towards him, countless tentacles charged towards him.<br/><br/>The attack of the Lord of Calamity, the attack of Axe Sword Demon, and the attack of thousand tentacles.<br/><br/>In the past, Wang Xian would always dodge.<br/><br/>However, this time, he didn’t Dodge at all.<br/><br/>Thousand Tentacles’strength was reduced, causing his attack power to drop drastically.<br/><br/>Wang Xian had a recovery speed that was a hundred times faster than his time domain. He could totally withstand their attacks.<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>Streams of energy landed on his body and broke through his defense, causing a large amount of blood to flow out from his body.<br/><br/>The energy tentacles of thousand tentacles also struck the void in front of Wang Xian.<br/><br/>The suffocating energy cracked the void and spread toward Wang Xian’s body.<br/><br/>Buzz<br/><br/>PFFT<br/><br/>Wang Xian withstood the attacks and arrived in front of thousand tentacles once again.<br/><br/>“You are courting death. He actually wants to exchange injuries for injuries and replace me!”<br/><br/>Thousand Tentacles roared loudly, filled with anger!<br/><br/>Boom<br/><br/>However, faced with Wang Xian’s desperate attacks, thousand tentacles had no way to dodge.<br/><br/>Streams of energy entered his body again.<br/><br/>Twenty to thirty of the Heaven origin creation stage powerhouses in his body died instantly.<br/><br/>The energy in his body decreased again.<br/><br/>After two attacks, there weren’t many heavenly yuan creation realm experts left.<br/><br/>The sudden decrease in strength caused his expression to change again.<br/><br/>“More than half of the Heavenly Yuan creation realm experts in my body have been killed by the Dragon King. His target is me. He wants to kill the experts in my body and then kill me!”<br/><br/>Thousand Tentacles roared in fear!<br/><br/>“Thousand tentacles, you are in the middle of us. That Dragon King is fighting with his life on the line. He is also injured now. Kill!”<br/><br/>When the Lord of Calamity and axe sword demon heard thousand tentacles’words, although they were shocked, they felt that there was still a chance of victory when they looked at the Dragon King who was covered in fresh blood!<br/><br/>They charged directly at Wang Xian with terrifying might.<br/><br/>Their attacks were very primitive, but they were also very brutal.<br/><br/>They used their bodies to collide with each other.<br/><br/>This kind of attack was equivalent to losing 800 to 1,000 enemies.<br/><br/>However, this was something the Lord of calamity and the rest could do nothing about.<br/><br/>With their strong vitality, they could afford to waste time.<br/><br/>Buzz! Buzz<br/><br/>Wang Xian was in the time domain and his recovery speed was a hundred times faster.<br/><br/>In this space, it would suppress his speed and allow the Lord of disaster and the others to lock onto him.<br/><br/>However, his recovery ability was not suppressed.<br/><br/>The injuries in his body healed quickly, and Wang Xian’s face was filled with fighting spirit.<br/><br/>Currently, thousand tentacles’strength was only a little more than one chaos level.<br/><br/>Even without the time domain, Wang Xian was not much weaker in terms of destructive power when facing them.<br/><br/>The Lord of Calamity, the axe sword demon, had a strong vitality.<br/><br/>His recovery ability was also very strong.<br/><br/>The opponent’s weakness was still the thousand tentacles.<br/><br/>“Since you guys want to fight, let’s Fight!”<br/><br/>Wang Xian growled in a low voice and his body shook.<br/><br/>One Qi to turn into three pure ones!<br/><br/>Of course, the so-called one Qi to turn into three pure ones was just one of his current methods.<br/><br/>He divided his body into three parts.<br/><br/>Two of them possessed the combat strength of two primal chaos level experts.<br/><br/>The last one possessed the combat strength of one primal chaos level expert.<br/><br/>Whoosh! Whoosh! Whoosh! Whoosh<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>Three Wang Xian went up against the Lord of Calamity, axe sword demon, and thousand tentacles respectively!<br/><br/>“This Dragon King is going to fight us to the death. He’s getting anxious. Fight!”<br/><br/>“Fight!”<br/><br/>Seeing that Wang Xian was going to fight them to the death, the Lord of Calamity and axe sword demon became even more excited.<br/><br/>Their vitality was extremely terrifying now.<br/><br/>It was impossible to kill them!<br/><br/>“Thousand tentacles, hold on. Let’s kill the two bodies of the Dragon King!”<br/><br/>The Lord of Calamity instructed thousand tentacles and went straight for Wang Xian’s body.<br/><br/>Boom! Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>In the next second, an extremely brutal battle began.<br/><br/>It was a close-combat physical confrontation!<br/><br/>The impact and confrontation of the energy in his body!<br/><br/>Every time they collided, Wang Xian’s body would be riddled with numerous wounds.<br/><br/>The 100 times recovery rate allowed him to hold on.<br/><br/>As for the Lord of Calamity and the rest, every time they collided, the group of experts connected by the lifeline of life would spit out fresh blood.<br/><br/>However, their vitality was too strong. Under the situation where the injuries were evenly distributed, they could hold on for a long time.<br/><br/>Overall, the Lord of Calamity and the rest had the upper hand!<br/><br/>Boom! Boom! Boom<br/><br/>However, on the other side, Wang Xian had the complete upper hand when facing thousand tentacles.<br/><br/>He charged forward at a speed that thousand tentacles could not dodge at all.<br/><br/>Although thousand tentacles could not dodge Wang Xian’s speed, it was still useful for an area-of-effect attack.<br/><br/>Faced with Wang Xian’s desperate fighting style, he gritted his teeth and began to fight with all his might. He used all his life-saving trump cards.<br/><br/>One by one, the extremely powerful divine fruits were swallowed into his mouth as if they were free.<br/><br/>Boom! Boom<br/><br/>Wang Xian charged forward again. His entire body turned into a chaos spear and pierced through him.<br/><br/>Thousand Tentacles immediately went into defense and displayed his strongest defense.<br/><br/>Crack! Crack! Crack<br/><br/>Thousand Tentacles’defense was broken. He used countless tentacles to counterattack.<br/><br/>The tentacles collided with the chaos spear.<br/><br/>The body of Wang Xian, who had transformed into the chaos spear, began to crack.<br/><br/>Similarly, large holes appeared on the thousand tentacles’body. They began to bleed!<br/><br/>Their vitality began to dissipate rapidly!\t\t\t\t\t\t</div>", "images": {}, "success": true}