{"id": 1541, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15076046.html", "title": "Chapter 4544 - Chapter 4544: 4543 Exterminating The Evil Sequence Faction 9", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4544 - Chapter 4544: 4543 Exterminating The Evil Sequence Faction 9</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4544: 4543 exterminating the evil sequence faction 9<br/><br/>I have to find their weakness. Otherwise, it will be difficult to kill them<br/><br/>Wang Xian could feel their strong vitality. His eyes sparkled.<br/><br/>With such strong vitality, even if Wang Xian went all out, he could only kill one of them.<br/><br/>Not to mention that there were two other experts interfering with him.<br/><br/>“However, they have a weakness now!”<br/><br/>Wang Xian shifted his gaze to thousand tentacles.<br/><br/>Although thousand tentacles was the strongest among them, Wang Xian did not sense the terrifying vitality from him.<br/><br/>In other words, as long as he was injured, he would not be able to recover quickly!<br/><br/>“Such strong strength!”<br/><br/>“This… he actually dodged our all-out Attack!”<br/><br/>Thousand Tentacles and axe sword demon looked at Wang Xian in shock and could not help but roar.<br/><br/>“I was severely injured by the Dragon King. However, I can recover quickly from the damage that the Dragon King caused me. It will be very difficult for him to kill me!”<br/><br/>However, at this moment, the eyes of the Lord of calamity were glowing as he shouted loudly.<br/><br/>As long as he could withstand the Dragon King’s attack, he would have a chance!<br/><br/>“Kill!”<br/><br/>The eyes of axe sword demon also shone brightly.<br/><br/>His current strength was about the same as the Lord of calamity. If the Dragon King could not kill the Lord of calamity, then he could not kill him either.<br/><br/>“Kill!”<br/><br/>Thousand Tentacles did not think too much and followed closely by the side. Countless tentacles attacked Wang Xian.<br/><br/>Faced with the attacks of the three of them, Wang Xian did not take them head-on.<br/><br/>If he took them head-on, he would not be able to withstand their attacks.<br/><br/>The amount of attack power that Wang Xian had now was only equivalent to five chaos levels.<br/><br/>This was because the existence of the time domain had a huge boost to his strength.<br/><br/>The time domain was his greatest reliance.<br/><br/>And the most powerful boost to the time domain was naturally his speed.<br/><br/>Faced with their attacks, Wang Xian moved his body and disappeared!<br/><br/>In the next moment, he shuttled through the tentacles of thousand tentacles and arrived in front of him.<br/><br/>“Oh no! That Dragon King is too fast! He’s on my side!”<br/><br/>Thousand tentacles could only sense a blurry figure. His expression changed drastically!<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>However, it was too late. Wang Xian waved his hand and countless chaos swords slashed at thousand tentacles.<br/><br/>Under the suppression of his powerful strength, the chaos swords cut off thousand tentacles’tentacles.<br/><br/>“The door of rebirth!”<br/><br/>Thousand Tentacles’expression changed drastically. The head that was connected to the countless tentacles spat out a door.<br/><br/>There was an inexplicable power in the black door.<br/><br/>The tentacles that were cut off by Wang Xian disappeared immediately!<br/><br/>The door of rebirth entered thousand tentacles’mouth once again. His head and the countless tentacles instantly recovered.<br/><br/>“His speed is too fast. We must restrict his speed. Otherwise, he is an invincible existence to us!”<br/><br/>Thousand Tentacles recovered, but he still shouted loudly with lingering fear!<br/><br/>“It is very difficult to restrict his speed. Senior Disaster Lord, do you have any idea?”<br/><br/>Axe Sword Demon’s expression changed. He had no idea what to do.<br/><br/>The Lord of Calamity’s expression changed slightly. He gritted his teeth and said, “I have a method. I wouldn’t use it unless I’m in a desperate situation. This time, I have a strong life force as my backing. I can use it!”<br/><br/>“Dong Dong Dong!”<br/><br/>“Dong Dong Dong!”<br/><br/>As soon as he finished his sentence, a ferocious look appeared on his face.<br/><br/>Blood-red eyeballs flew out one by one. Every pupil contained a strange energy.<br/><br/>Each pupil was locked onto Wang Xian’s position.<br/><br/>Buzz! Buzz! Buzz<br/><br/>Buzz! Buzz! Buzz<br/><br/>When he executed this move, the faces of the evil sequence experts who were connected to the thread of life behind him instantly turned pale.<br/><br/>They couldn’t help but spit out mouthfuls of blood.<br/><br/>This move was a move that consumed life force.<br/><br/>The amount of life force consumed was extremely huge.<br/><br/>In the past, the Lord of disaster didn’t dare to use it.<br/><br/>This time, he could barely use it.<br/><br/>“HMM?”<br/><br/>When Wang Xian sensed that the pupils were staring at him, he raised his eyebrows slightly.<br/><br/>He felt a strange energy locking onto him!<br/><br/>Thousands of pupils were staring at him. Furthermore, each of these pupils seemed to have a world!<br/><br/>At this moment, Wang Xian realized that the scene around him seemed to have changed!<br/><br/>“I’ve been pulled into a special space!”<br/><br/>Wang Xian scanned his surroundings and realized that he could no longer sense the existence of the Divine Roc of the Nine Heavens!<br/><br/>“A normal special space can’t lock onto me. It seems that the Lord of calamity has paid a heavy price for this move!”<br/><br/>Wang Xian scanned his surroundings.<br/><br/>Boom! Boom! Boom<br/><br/>The next moment, he swung his fist and attacked forward.<br/><br/>A fist with powerful spatial power charged forward.<br/><br/>Cracks appeared in the entire space!<br/><br/>If he continued to attack, he would break through this special space very soon.<br/><br/>“That Dragon King will be able to break through this special space of mine very soon. We will attack immediately and use our strongest techniques. Once we attack, we will enter that space as well!”<br/><br/>Outside, the Lord of calamity wiped the blood from his mouth and spoke to thousand contacts and axe sword demon.<br/><br/>“Alright, use your strongest strength!”<br/><br/>Thousand contacts and the rest nodded heavily as they looked ahead.<br/><br/>In front of them, there was a space illuminated by the blood-red pupils. Wang Xian was attacking the space outside from the inside.<br/><br/>There were cracks in this space!<br/><br/>“Boom! Boom!”<br/><br/>“Boom! Boom!”<br/><br/>The Lord of calamity and the rest were filled with killing intent as they condensed their powerful techniques.<br/><br/>The terrifying arms of the skeleton were accompanied by a huge sword that was imbued with lightning.<br/><br/>Along with countless tentacles, they attacked Wang Xian, who was trapped in another space.<br/><br/>“Huh?”<br/><br/>Wang Xian, who was in this special space, felt something.<br/><br/>He sensed that an extremely powerful force was attacking him. His expression changed slightly and he hurriedly retreated backward.<br/><br/>However, after he retreated for a distance, he realized that he was at the edge of the space.<br/><br/>With his strength, he could not break through this special space with one move.<br/><br/>Without any hesitation, he gathered the strongest defense in front of him!<br/><br/>Boom! Boom! Boom<br/><br/>In the next moment, the attacks from the Lord of calamity, axe sword demon, and thousand tentacles landed in front of Wang Xian.<br/><br/>The terrifying energy caused the defense in front of Wang Xian to collapse rapidly.<br/><br/>Wang Xian was in the time domain and was quickly replenishing the defense in front of him.<br/><br/>Even so, he could not hold on much longer.<br/><br/>The defense in front of him collapsed completely and some wounds appeared on his body!<br/><br/>However, to Wang Xian, such injuries were not a big problem.<br/><br/>When the Lord of calamity, thousand tentacles, and the rest launched their attacks, they had also arrived in this special space!<br/><br/>When they saw Wang Xian’s injuries, the three of them were overjoyed and shocked at the same time!\t\t\t\t\t\t</div>", "images": {}, "success": true}