{"id": 1543, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15076059.html", "title": "Chapter 4546 - Chapter 4546: 4545 Exterminating Evil Sequence Camp 11", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4546 - Chapter 4546: 4545 Exterminating Evil Sequence Camp 11</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4546: 4545 exterminating evil sequence camp 11<br/><br/>“He wants to break this space. We Can’t let him succeed!”<br/><br/>“Take his attack head-on and tie him down!”<br/><br/>When the Lord of Calamity and the rest saw Wang Xian heading towards the space behind them, they revealed a cold expression.<br/><br/>Facing the Chaos Spear, they formed a defense in front of them to defend themselves.<br/><br/>“Boom!”<br/><br/>“Boom Boom Boom!”<br/><br/>A terrifying power landed on their bodies, and the destructive energy on the spear pierced through their defenses.<br/><br/>However, the Lord of calamity and Axe Sword Demon weren’t afraid at all!<br/><br/>“Pu Pu!”<br/><br/>“Pu Pu!”<br/><br/>A powerful force pierced through their bodies, and the chaos energy corroded them.<br/><br/>Their expressions changed drastically, and they were heavily injured.<br/><br/>However, a wound appeared on the bodies of a group of Heaven’s origin creation powerhouses from the evil sequence faction behind them.<br/><br/>The effect of the lifeline of life was displayed once again.<br/><br/>Their wounds were healing at a terrifying speed.<br/><br/>“Attack!”<br/><br/>“Attack!”<br/><br/>Axe sword demon and the Lord of disaster roared furiously and attacked Wang Xian once again.<br/><br/>“Huh?”<br/><br/>Wang Xian sensed the situation behind him and frowned slightly.<br/><br/>Before he could launch an attack on this space, the attacks of the Lord of Calamity and the others had already arrived.<br/><br/>Taking his attacks head-on?<br/><br/>Wang Xian’s eyes flickered. He could only turn around and receive the attacks of the Lord of Calamity and the others.<br/><br/>The attacks of the Lord of calamity were inclined towards the darkness attribute.<br/><br/>The attacks of the axe sword demon were of the Lightning attribute.<br/><br/>As for the thousand tentacles, it was of the water attribute.<br/><br/>Buzz! Buzz<br/><br/>Faced with the Lord of disaster and the axe sword demon who were exchanging injuries for injuries, Wang Xian immediately dodged.<br/><br/>The opponent’s attack power and recovery ability were very strong.<br/><br/>If Wang Xian were to take it head-on, although he had a time domain and his recovery ability was a hundred times stronger than before, there was no need for him to take it head-on.<br/><br/>Speed was still his greatest advantage.<br/><br/>Boom! Boom! Boom<br/><br/>Whoosh! Whoosh! Whoosh<br/><br/>The Lord of Calamity, axe sword demon, and the rest wanted to attack in close combat. They wanted to exchange injuries for injuries while Wang Xian was dodging.<br/><br/>However, this space was very small. It was impossible for him to dodge all the attacks.<br/><br/>Gradually, Wang Xian was suppressed by their fighting style.<br/><br/>“Maintaining this special space consumes a lot of energy. However, with the life force of the Lord of Calamity and the rest, it shouldn’t be a problem for them to maintain it for tens of millions of years.”<br/><br/>“I can exchange my injuries for injuries and get rid of the thousand tentacles first. However, there’s no need for that now. I have to wait for all their trump cards to be unleashed. Otherwise, the losses might outweigh the gains.”<br/><br/>Wang Xian kept calculating in his heart.<br/><br/>It was still very difficult to completely destroy the other party.<br/><br/>Although he was currently trapped in this space, Wang Xian still had the confidence to suppress the Lord of Calamity and the others.<br/><br/>He could still exchange injuries with the other party.<br/><br/>However, he had to wait!<br/><br/>After the other party’s trump cards were unleashed one by one.<br/><br/>After the Lord of Calamity had reached the limit of this space.<br/><br/>Although it would waste tens of millions of years of time, this was the safest plan.<br/><br/>Hence, in the following period of time, the Lord of Calamity and axe sword demon continued to pursue Wang Xian, wanting to exchange injuries for injuries.<br/><br/>They wanted to engage in close combat.<br/><br/>At the rear, thousand tentacles was providing support and attacking continuously.<br/><br/>Wang Xian was in this space, constantly dodging.<br/><br/>He was constantly probing.<br/><br/>He was probing their trump cards.<br/><br/>He was probing their moves.<br/><br/>He was constantly using his divination power to perform divination.<br/><br/>After millions of years, their great battle was still erupting.<br/><br/>Some injuries had appeared on Wang Xian’s body.<br/><br/>These injuries were intentional.<br/><br/>Although the life force of the Lord of Calamity and the rest was extremely terrifying,.<br/><br/>Wang Xian’s recovery ability was even more terrifying than theirs.<br/><br/>The Lord of Calamity and the rest could share the damage.<br/><br/>It was extremely difficult to kill them.<br/><br/>However, Wang Xian’s recovery ability could be increased by a hundred times in the time domain.<br/><br/>For over a million years, they fought and fought.<br/><br/>The Lord of Calamity and the rest had also revealed almost all their trump cards and all their innate skills.<br/><br/>“It’s about time. My strength is stronger than I imagined. Furthermore, I have figured out everything about the other party. There’s no need to waste time.”<br/><br/>Wang Xian kept dodging the attacks of the Lord of disaster and the others. His eyes shone brightly.<br/><br/>He now had a clear understanding of his own strength.<br/><br/>With the enhancement of the time domain, his destructive power was only equivalent to five chaos levels.<br/><br/>However, with the enhancement of the time domain, his speed of recovery was a hundred times faster. This allowed him to fight against eight chaos level existences.<br/><br/>As for the Lord of Calamity and the others, their combined strength was only equivalent to six of them!<br/><br/>The most important point was that the power of chaos could be converted into any kind of power.<br/><br/>Especially the power of divination. In these millions of years, Wang Xian had a clear understanding of the other party.<br/><br/>He was stronger than he had imagined.<br/><br/>“There’s no need to wait for tens of millions of years. Their time of death is Here!”<br/><br/>Wang Xian’s eyes were filled with killing intent!<br/><br/>“Dragon King of the Dragon Palace, do you only know how to Dodge?”<br/><br/>Thousand Tentacles, the Lord of Calamity, and the rest roared with killing intent when they saw Wang Xian continuously dodging.<br/><br/>At this moment, they were filled with a strong desire to fight. They stared at Wang Xian, who was covered in blood stains.<br/><br/>They were now filled with confidence.<br/><br/>They believed that the Dragon King could be killed!<br/><br/>“Hehe!”<br/><br/>When Wang Xian heard their words, he laughed mockingly in a soft voice.<br/><br/>If he wanted to escape, would this space be able to stop him?<br/><br/>Although this space was very strong and formed its own domain.<br/><br/>However, as long as Wang Xian had a thought, he would be able to arrive at the demonic spirit altar.<br/><br/>However, there was no demonic spirit altar nearby.<br/><br/>“You have invaded our evil sequence camp. This time, we will make you pay a terrible price!”<br/><br/>Thousand tentacles roared loudly as countless tentacles emitted light.<br/><br/>Carrying an invincible might, they swept towards Wang Xian!<br/><br/>The Lord of Calamity and the rest moved their bodies. The black fog condensed into countless claws, wanting to trap Wang Xian!<br/><br/>Axe sword demon waved his huge sword and slashed out a terrifying figure. Similarly, he attacked Wang Xian!<br/><br/>Wang Xian saw this scene and smiled sinisterly.<br/><br/>With a wave of his arm, he welcomed the countless tentacles of the thousand tentacles directly!<br/><br/>The moment he came into contact with the tentacles.<br/><br/>Wang Xian’s arm also transformed into tentacles that were identical to the thousand tentacles!<br/><br/>The tentacles entered the body of the thousand tentacles directly!<br/><br/>The same source of energy was surging into the body!<br/><br/>This sudden situation stunned the thousand tentacles slightly.<br/><br/>“Ahhhhh!”<br/><br/>“Ahhhhh!”<br/><br/>In the next moment, within his body, within his tentacles, the Heavenly Yuan creation realm experts from the evil array faction suddenly let out miserable cries!<br/><br/>The 30-40 Heavenly Yuan creation realm experts within his tentacles were instantly wiped out of their life force!<br/><br/>Instantly, there was dead silence.<br/><br/>The death of the 30-40 Heavenly Yuan creation realm experts caused thousand tentacles’strength to suddenly decrease.<br/><br/>This sudden scene caught him completely off guard!\t\t\t\t\t\t</div>", "images": {}, "success": true}