{"id": 1547, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15076096.html", "title": "Chapter 4550 - Chapter 4550: 4549 Exterminating The Evil Sequence Camp 15", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4550 - Chapter 4550: 4549 Exterminating The Evil Sequence Camp 15</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4550: 4549 exterminating the evil sequence camp 15<br/><br/>They were defeated, completely defeated!<br/><br/>The Lord of Disaster, the Axe Sword Demon, and the old man in the bamboo hat had already given up on the idea of killing the Dragon King.<br/><br/>Now, the only way to escape was to escape!<br/><br/>They looked at each other and moved. Without any hesitation, they took out an escape treasure and instantly disappeared from the starry sky!<br/><br/>When Wang Xian saw that they were fleeing, he was stunned for a moment before a smile appeared on his face.<br/><br/>“Now that you want to escape, can you escape?”<br/><br/>Wang Xian moved and locked onto them. He then opened the Netherdragon’s Pursuit Channel.<br/><br/>Buzz! Buzz! Buzz<br/><br/>At the same time, in an area extremely far away from the evil sequence universe.<br/><br/>The Lord of disaster and the rest appeared.<br/><br/>“Keep running. We can’t separate yet. If we do, we’ll be killed by his curses one by one!”<br/><br/>The old man wearing the bamboo hat said to disaster master and the others with an ugly expression.<br/><br/>Disaster Master and the others nodded.<br/><br/>In the current situation, they could only run away together.<br/><br/>If one of them was cursed, they could help each other.<br/><br/>The three of them fled into the distance with unsightly expressions.<br/><br/>However, at this moment, a black hole appeared not far away from them.<br/><br/>The figures of Wang Xian and the Divine Roc of the Nine Heavens appeared.<br/><br/>“Hehe!”<br/><br/>Looking at the Lord of Calamity and the other two, a mocking expression appeared on Wang Xian’s face.<br/><br/>He moved and chased after them easily.<br/><br/>Moreover, the thousand tentacles curse was still going on.<br/><br/>“Not good. The Dragon King is chasing after us.”<br/><br/>At this moment, the Lord of calamity also sensed the presence of Wang Xian and the rest. His expression changed slightly as he growled in a low voice.<br/><br/>“I have a treasure that can instantly distance us from a great distance. I can bring all of you along!”<br/><br/>Sword Demon Axe’s gaze focused as he spoke loudly!<br/><br/>As he spoke, he took out a scroll and opened it. A Ray of light enveloped them.<br/><br/>The figures of the three of them continued to disappear!<br/><br/>Wang Xian looked over and continued to open a passageway.<br/><br/>Buzz! Buzz! Buzz<br/><br/>Buzz! Buzz<br/><br/>This time, axe sword demon led the Lord of Calamity and the rest to a very distant location.<br/><br/>However, two seconds after they appeared, Wang Xian’s figure appeared once again at the side!<br/><br/>“Dragon King, are you going to fight us to the death?”<br/><br/>Seeing Wang Xian chasing after them again, sword demon axe roared with bloodshot eyes!<br/><br/>“I’m going to destroy all of you!”<br/><br/>Wang Xian replied calmly and replied indifferently!<br/><br/>“We have treasures to escape, and he has a way to chase after us. However, I don’t believe that he can keep chasing after us!”<br/><br/>The old man with the bamboo hat roared in disbelief.<br/><br/>He took out a treasure and led the Lord of disaster and the others away once again!<br/><br/>However, a few seconds later, they saw that Wang Xian was still following behind them. He was looking at them with a smile on his face.<br/><br/>“Huff! Huff!”<br/><br/>This caused the lord of disaster and the others to breathe slightly faster.<br/><br/>“Continue!”<br/><br/>They roared loudly.<br/><br/>As the strongest existences in the evil sequence faction, they had all sorts of powerful trump cards and treasures.<br/><br/>There were many kinds of escaping treasures.<br/><br/>He took out another treasure and continued to escape.<br/><br/>However, Wang Xian still followed them easily and gave chase at a steady pace.<br/><br/>After more than ten consecutive attempts, Wang Xian was able to follow behind them.<br/><br/>“I’ve used up all the treasures on me.”<br/><br/>“I’ve used up mine as well!”<br/><br/>After more than ten consecutive attempts to escape, all the escaping treasures in the hands of the Lord of Calamity and the others had been used up.<br/><br/>Although they still had many escape treasures, those treasures could only allow one of them to escape.<br/><br/>They had used up all the escape treasures in an area.<br/><br/>As for escaping alone?<br/><br/>Escaping alone would only speed up their deaths.<br/><br/>They had to escape together.<br/><br/>“I know a place that has a long-distance chaotic black hole. Let’s see if we can get rid of this Dragon King There!”<br/><br/>The old man wearing the bamboo hat roared with his blood-red eyes!<br/><br/>“Is the distance far? How long will it take us to get there?”<br/><br/>Sword Demon Axe asked.<br/><br/>“A thousand years of distance. With our strength, we can hold on until then!”<br/><br/>The old man wearing the bamboo hat replied!<br/><br/>“Alright, let’s Go!”<br/><br/>The Lord of disaster and the others had no other choice but to answer.<br/><br/>They flew into the distance.<br/><br/>With the existence of a strong vitality, they immediately used up their vitality and fled quickly.<br/><br/>Wang Xian followed behind them calmly.<br/><br/>It was impossible for the other party to get rid of his pursuit.<br/><br/>He was neither too fast nor too slow. He wanted to kill thousand tentacles first!<br/><br/>At the same time, thousand tentacles was suffering from a terrifying curse.<br/><br/>He wanted to get rid of it, but no matter what method he used, the curse would enter his main body.<br/><br/>He couldn’t get rid of it at all.<br/><br/>He frantically sent a message to the Lord of disaster and the others.<br/><br/>But now, the message he sent didn’t receive any response!<br/><br/>“I’ve been abandoned by them. Am I going to be completely destroyed? I can’t accept this. I don’t want to Die!”<br/><br/>Thousand Tentacles roared in despair.<br/><br/>His body was filled with cracks as he desperately resisted.<br/><br/>However, the difference in strength allowed him to clearly feel that his doomsday was coming!<br/><br/>Twenty minutes quickly passed.<br/><br/>Thousand Tentacles smiled miserably. This body was dead.<br/><br/>A few seconds later, he resurrected in another place.<br/><br/>After resurrecting, he felt his body with great anxiety.<br/><br/>He prayed that he would not be cursed again.<br/><br/>However, when the curse came, he was completely in despair.<br/><br/>“I didn’t expect that I would die after cultivating to the primal Chaos Realm!”<br/><br/>“Dragon King, Dragon King!”<br/><br/>Thousand Tentacles went mad and roared crazily.<br/><br/>He had already fallen into the primal chaos realm. Facing the curse again, he could not even last a few minutes!<br/><br/>In the following time, thousand tentacles resurrected and died!<br/><br/>Endless curses and endless deaths began.<br/><br/>Half an hour later, thousand tentacles’last corpse died.<br/><br/>From then on, the most terrifying top-tier expert of the evil sequence camp, thousand tentacles, the demon whose hands were stained with countless fresh blood, died completely!<br/><br/>He died completely!<br/><br/>“Thousand tentacles is dead, completely dead!”<br/><br/>The Lord of disaster and the rest felt something in their hearts and roared in grief and indignation.<br/><br/>They felt like a fox mourning the death of a rabbit!<br/><br/>“Yes, thousand tentacles is dead. It’s your turn now.”<br/><br/>Wang Xian completely killed thousand tentacles.<br/><br/>He stretched his body and accelerated his speed abruptly. He arrived in front of the Lord of disaster and spoke with a cold expression!<br/><br/>Next, it was their turn!<br/><br/>“Go All Out, Charge!”<br/><br/>The Lord of Disaster and the rest roared crazily. The three of them gathered together and condensed a terrifying energy to attack in front of them.<br/><br/>They gave up on their defense and attacked with all their might!<br/><br/>They wanted to break through all the obstacles in their way.<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom<br/><br/>Wang Xian attacked immediately. The Divine Roc of the Nine Heavens also attacked them!\t\t\t\t\t\t</div>", "images": {}, "success": true}