{"id": 1545, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15076076.html", "title": "Chapter 4548 - Chapter 4548: 4547 Annihilating The Evil Sequence Camp 13", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4548 - Chapter 4548: 4547 Annihilating The Evil Sequence Camp 13</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4548: 4547 annihilating the evil sequence camp 13<br/><br/>Wang Xian, the axe sword demon, and the Lord of disaster were all hardened steel.<br/><br/>He would deal with the opponent’s strong vitality.<br/><br/>However, if he were to fight thousand tentacles with hardened steel, thousand tentacles would not be his opponent at all.<br/><br/>They were not even on the same level.<br/><br/>The injuries on Wang Xian’s body were healing rapidly.<br/><br/>The vitality in thousand tentacles’body was disappearing rapidly.<br/><br/>Thousand tentacles sensed his condition and his expression changed drastically.<br/><br/>“My life force is disappearing rapidly. I’m not a match for this Dragon King. Support Me!”<br/><br/>Thousand tentacles shouted in horror!<br/><br/>At the side, the Lord of Calamity and Axe Sword Demon were suppressing the other two bodies of Wang Xian.<br/><br/>Hearing Thousand Tentacles’cry for help, their expressions changed drastically.<br/><br/>They looked at thousand tentacles and sensed his condition. Then, they looked at Wang Xian in front of them unwillingly.<br/><br/>“Thousand tentacles, hide behind us!”<br/><br/>The Lord of calamity immediately flew toward thousand tentacles and shouted at him!<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>However, the moment they flew over, Wang Xian’s two bodies also moved.<br/><br/>One by one, they covered the sky and flew toward the Lord of Calamity and the others to stop them.<br/><br/>Under the same level of strength, it was still very easy for Wang Xian to stop them.<br/><br/>Even if the other party was exchanging injuries for injuries, he could still stop them for more than ten seconds.<br/><br/>And these ten seconds were enough!<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom<br/><br/>Wang Xian quickly attacked the thousand tentacles again.<br/><br/>His unparalleled speed made it impossible for the thousand tentacles to dodge.<br/><br/>“Ah, Dragon King, if you want to kill me, you will have to pay a terrible price too!”<br/><br/>When thousand tentacles saw Wang Xian rushing over, his entire head started to turn blood red. Countless tentacles went up to meet him.<br/><br/>Boom! Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>Wang Xian continued to bombard him. Sensing the position of his weakness, he threw a punch.<br/><br/>“Huh?”<br/><br/>When thousand tentacles saw that his weakness was being attacked, his mind moved and he immediately shifted his weakness.<br/><br/>“PFFT! PFFT! PFFT!”<br/><br/>Puff! Puff! Puff<br/><br/>However, just as he was dodging, a large number of tentacles were crushed by Wang Xian and turned into flesh and blood. Wang Xian kept them away.<br/><br/>“Save me!”<br/><br/>A part of thousand tentacles’body was crushed again. Feeling that his strength was reduced again, he felt suffocated.<br/><br/>“I can’t hold on anymore!”<br/><br/>Thousand tentacles shouted loudly at the Lord of Calamity, axe sword demon.<br/><br/>“Eight seconds!”<br/><br/>The Lord of Disaster responded loudly. He didn’t attack Wang Xian’s other body, causing his body to bleed continuously.<br/><br/>Cracks started to appear!<br/><br/>However, he couldn’t achieve a breakthrough in an instant!<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>Wang Xian’s figure changed as his body continued to attack thousand tentacles.<br/><br/>Eight seconds was enough for Wang Xian to kill thousand tentacles!<br/><br/>Wang Xian was engaged in close combat with thousand tentacles, and fresh blood splattered everywhere.<br/><br/>Relying on his speed, he was able to exchange thousand tentacles for a great deal of damage at the smallest cost.<br/><br/>One by one, the tentacles were cut off and turned into flesh and blood before Wang Xian kept them.<br/><br/>Under the continuous attacks, thousand tentacles, who was already severely injured, had a weaker and weaker life force!<br/><br/>However, under his full-strength defense, he had indeed caused quite a lot of trouble for Wang Xian. The injuries on his body were not weak either!<br/><br/>“Great Escape Art!”<br/><br/>When thousand contacts was severely injured one after another and his vitality and strength were decreasing, he let out a loud roar.<br/><br/>His entire body suddenly turned illusory.<br/><br/>His illusory body was burning continuously.<br/><br/>“Huh?”<br/><br/>When Wang Xian saw this scene, he raised his eyebrows slightly.<br/><br/>He was burning his life and placed himself in a special domain space.<br/><br/>This domain space was similar to the one that Wang Xian was currently in.<br/><br/>It wouldn’t be so easy to break it.<br/><br/>Wang Xian divined the situation of the thousand tentacles and smiled faintly.<br/><br/>The price he had to pay for using this great escape art was too high!<br/><br/>His body moved and the other two bodies disappeared immediately. The three bodies merged into one.<br/><br/>Feeling the injuries on his body, Wang Xian was quickly recovering.<br/><br/>“Hahaha, Dragon King, it won’t be that easy to kill me!”<br/><br/>At the front, thousand tentacles, who had managed to dodge the attack, immediately stopped using the escape art. He spoke in an extremely miserable manner!<br/><br/>“Stupid!”<br/><br/>Wang Xian shook his head. The figure of thousand tentacles appeared in front of him and grabbed with his palm.<br/><br/>“PFFT!”<br/><br/>In an instant, thousand tentacles’body collapsed and dissipated!<br/><br/>Thousand Tentacles, whose strength had been reduced to the level of the Great Dao, was unable to withstand his curse.<br/><br/>Furthermore, the Lord of calamity and the axe sword demon didn’t have the time to help him withstand it.<br/><br/>That was because Wang Xian could kill him instantly!<br/><br/>Thousand Tentacles’life force had completely dissipated. His aura was completely gone.<br/><br/>His body fell to the ground.<br/><br/>“Phew!”<br/><br/>Wang Xian exhaled. He looked at the axe sword demon and the Lord of calamity with a smile on his face.<br/><br/>“With one thousand tentacles dead, it’s Your Turn Now!”<br/><br/>He spoke with a smile on his face!<br/><br/>When the Lord of Calamity and the rest saw Wang Xian’s smile, their hearts turned cold!<br/><br/>Their eyes swept across the corpse of thousand tentacles. Their hearts pounded violently and they were a little frightened.<br/><br/>“You… you set your target on thousand tentacles from the very beginning. Are you planning to kill him from the very beginning?”<br/><br/>Axe sword demon growled in a low voice!<br/><br/>“Yes, I can only kill all of you by killing him first!”<br/><br/>Wang Xian nodded and replied with a smile.<br/><br/>Upon hearing Wang Xian’s words, the Lord of calamity and Axe Sword Demon’s hearts sank.<br/><br/>They had been fighting the Dragon King for millions of years.<br/><br/>During these millions of years, the Dragon King had figured them out, and they had also figured out the Dragon King.<br/><br/>With the Dragon King’s strength, he was able to fight against them for a million years while they were working together and using all of their trump cards.<br/><br/>Now that thousand tentacles was dead, they lacked an important fighting force, and they were no longer a match for the Dragon King.<br/><br/>“Send a message to thousand tentacles immediately and tell him to come over. Only with the three of us working together can we fight against the Dragon King!”<br/><br/>“Let’s stall the Dragon King first. With our life force, we should be able to last for a few million years or even more. There shouldn’t be any problems!”<br/><br/>The Lord of disaster transmitted his voice to sword demon axe!<br/><br/>“Alright!”<br/><br/>Sword demon axe nodded and immediately replied.<br/><br/>“Boom!”<br/><br/>However, at this moment, they saw the Dragon King directly attack the barrier of this space.<br/><br/>The intense attack caused the barrier of this space to tremble again, and a crack appeared.<br/><br/>After a dozen more attacks, this special space formed by the Lord of Calamity was about to collapse!<br/><br/>“Stop him. Without this space to defend, we are no match for him!”<br/><br/>The Lord of Calamity’s expression changed again as he shouted loudly!<br/><br/>Boom! Boom<br/><br/>They immediately launched their attacks and attacked Wang Xian.<br/><br/>Wang Xian’s figure flashed as he dodged the important attacks and continued to attack the barrier.<br/><br/>Facing the Lord of Calamity and the others, coupled with the thousand-tentacle attacks, Wang Xian might have to defend with all his might.<br/><br/>However, there was no need for the Lord of calamity and the axe sword demon to do so!<br/><br/>He could totally defend while attacking this space.<br/><br/>“Damn it, we can’t Stop It!”<br/><br/>The attacks on Wang Xian were blocked more than a dozen times.<br/><br/>The Lord of calamity and the rest understood that they couldn’t stop it with just the two of them.<br/><br/>The space that restricted the Dragon King started to dissipate!\t\t\t\t\t\t</div>", "images": {}, "success": true}