{"id": 1546, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15076086.html", "title": "Chapter 4549 - Chapter 4549: 4548 Exterminating The Evil Sequence Camp 14", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4549 - Chapter 4549: 4548 Exterminating The Evil Sequence Camp 14</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4549: 4548 exterminating the evil sequence camp 14<br/><br/>Crack! Crack! Crack<br/><br/>The special space created by the Lord of disaster using his life force began to collapse!<br/><br/>The death of thousand tentacles made it impossible for them to stop Wang Xian’s attack.<br/><br/>Boom<br/><br/>Wang Xian flew out from this special space. The rumbling sound from outside was transmitted in.<br/><br/>At the side, the Divine Roc of the Nine Heavens was controlling the heaven creation-level building of the Dragon Palace to fight against the old man wearing a bamboo hat.<br/><br/>The old man was using his life thread to connect with many powerhouses. His life force was extremely terrifying.<br/><br/>However, his strength was weaker than the Divine Roc of the Nine Heavens who was carrying a large number of heaven-origin creation-level treasures.<br/><br/>However, the Divine Roc of the Nine Heavens had no other choice but to restrain him.<br/><br/>Wang Xian’s sudden appearance attracted the attention of the old man in the bamboo hat.<br/><br/>“It has been a million years, and we still haven’t been able to take down this Dragon King?”<br/><br/>He questioned loudly!<br/><br/>When the Lord of calamity, Sword Demon Axe, heard the words of the old man in the bamboo hat, his expression turned ugly.<br/><br/>Not only were they unable to destroy the Dragon King, even thousand tentacles was killed by him.<br/><br/>“Senior thousand tentacles was killed!”<br/><br/>Sword Demon Axe couldn’t help but reply.<br/><br/>His words caused the old man in the bamboo hat to be a little stunned.<br/><br/>A split-second avatar, so that nine divine Peng seize the flaw, in his body, a terrible blast wound.<br/><br/>But the wound healed quickly!<br/><br/>Buzz<br/><br/>At this time, Wang Xian flew out of that space and did not attack the Lord of disaster and axe sword demon.<br/><br/>With a flick of his hand, he began to kill the thousand tentacles.<br/><br/>As long as the thousand tentacles were completely destroyed, it would be a done deal to destroy all the powerhouses in the evil sequence camp.<br/><br/>The Phantom of thousand tentacles appeared in front of Wang Xian.<br/><br/>The current thousand tentacles had been completely destroyed by Wang Xian. Therefore, the powerhouses in his body had died.<br/><br/>Without the support of these powerhouses in the Heaven’s origin, his strength was only at the stage where he had just stepped into the chaos realm.<br/><br/>Faced with Wang Xian’s curse, he could not withstand it at all.<br/><br/>Unless he immediately appeared in front of the Lord of Calamity and the others to ask the Lord of Calamity and the others to help block it!<br/><br/>However, it was obvious that it would be extremely troublesome if he wanted to arrive in an instant.<br/><br/>However, even if he arrived in an instant, Wang Xian still had the confidence to kill him once again!<br/><br/>“Oh no, this dragon king is cursing thousand tentacles to kill him. He is cursing him to not die!”<br/><br/>When the Lord of Calamity saw the shadow in front of Wang Xian, his expression changed drastically. He immediately roared!<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom<br/><br/>They flew over directly. They wanted to use their physical bodies to stop Wang Xian in a killing manner.<br/><br/>Buzz! Buzz! Buzz! Buzz<br/><br/>Buzz! Buzz! Buzz<br/><br/>However, Wang Xian only took a glance at them. His body flickered and he easily dodged their attacks.<br/><br/>Even if it was a large-scale attack, Wang Xian could easily dodge it.<br/><br/>Without the restriction of space, it was impossible for the Lord of Calamity and the rest to touch Wang Xian!<br/><br/>“Not good. That Dragon King is cursing me to death. I Can’t Dodge it now!”<br/><br/>At the same time, he was in the universe controlled by thousand tentacles.<br/><br/>This universe was not far from the evil sequence universe. Furthermore, there was a teleportation array.<br/><br/>After he was resurrected, his realm did not decrease because of the large amount of resources and treasures.<br/><br/>The only thing was that without the support of the Heaven’s origin powerhouses, his combat strength had decreased a lot.<br/><br/>When he received the message from the Lord of disaster, axe sword demon, and was about to rush over, he was suddenly horrified.<br/><br/>The Dragon King was cursing him to death.<br/><br/>He could not avoid this curse.<br/><br/>He could only hold on for about ten minutes.<br/><br/>However, it was impossible for him to reach the side of the Lord of disaster, Sword Demon Axe, in about ten minutes.<br/><br/>The fastest way was to use the treasure, which would take a few hours.<br/><br/>“No, unless the Lord of disaster can stop the Dragon King’s curse, otherwise, I’m doomed. I have to do my best to resist the curse in order to hold on for more than ten minutes.”<br/><br/>“If I don’t use all my strength to stop it, I’ll lose my life completely in less than a minute!”<br/><br/>He hurriedly called for help from the Lord of disaster and the others, asking them to stop the Dragon King’s Curse!<br/><br/>However, what he didn’t know was that when the Lord of disaster and the others received his message, their faces were filled with helplessness.<br/><br/>They were already trying to stop it.<br/><br/>But they couldn’t stop it at all. The other party’s speed was too terrifying.<br/><br/>If he wanted to fight or escape, it was all up to him!<br/><br/>They also understood that the Dragon King wanted to cripple thousand tentacles first before dealing with them!<br/><br/>“Senior Lord of Disaster, can you continue to use that secret technique of yours? We have to get thousand tentacles to rush over!”<br/><br/>Sword Demon Axe couldn’t help but ask the Lord of disaster.<br/><br/>“No!”<br/><br/>The Lord of disaster shook his head with a gloomy expression and looked at him. “Do you have any methods or trump cards? Quickly use them!”<br/><br/>Sword Demon Axe’s face was filled with despair. He did not have any methods either.<br/><br/>This Dragon King was too terrifying.<br/><br/>He was too powerful.<br/><br/>They had already used all their trump cards and trump cards, but they still could not do anything to him.<br/><br/>“Kill this guy first, kill him, and we can still contend with the Dragon King!”<br/><br/>When the old man with the bamboo hat saw the current situation, his expression changed drastically, and he immediately transmitted his voice to the Lord of disaster and the others.<br/><br/>The Dragon King and the others couldn’t catch up, but they could catch up with this chaos-level powerhouse from the Dragon Palace.<br/><br/>With their life force and strength, they could easily kill him!<br/><br/>When the Lord of Calamity and the rest heard that, they immediately changed their target and charged towards the Divine Roc of the Nine Heavens.<br/><br/>Wang Xian swept his gaze over. With a thought, he approached the Divine Roc of the Nine Heavens and enveloped it with his time domain.<br/><br/>Under the time domain, the speed of the Divine Roc of the nine heavens could be increased by a hundred times.<br/><br/>Under the speed of a hundred times, the Lord of Calamity and the rest couldn’t even touch the feathers of the Divine Roc of the Nine Heavens!<br/><br/>Buzz Buzz<br/><br/>The Divine Roc of the Nine Heavens appeared in front of Wang Xian in a flash!<br/><br/>“What? How is this possible? Why is his speed so fast all of a sudden?”<br/><br/>When the elder wearing the bamboo hat saw that the Divine Roc of the Nine Heavens had disappeared all of a sudden, his speed increased tremendously. His face was filled with shock and disbelief as he roared.<br/><br/>“It’s because of the Dragon King. It’s definitely the Dragon King’s method!”<br/><br/>When the Lord of Calamity and the others saw this, their hearts sank again.<br/><br/>They didn’t believe it and continued to attack the Divine Roc of the Nine Heavens.<br/><br/>When Wang Xian saw them approaching, he immediately dodged while the Divine Roc of the nine heavens followed by his side.<br/><br/>The Lord of Calamity and the others couldn’t catch up at all!<br/><br/>“It’s over!”<br/><br/>Upon seeing this scene, the Lord of Calamity and the others were in complete despair.<br/><br/>They knew that with their strength, they couldn’t kill the Dragon King at all.<br/><br/>They were not a match for the Dragon King at all.<br/><br/>If they continued to waste time, they might even be destroyed!<br/><br/>“What should we do?”<br/><br/>Axe sword demon was floating in the air. He had just broken through and he felt like crying. He was a little lost.<br/><br/>What else could they do now?<br/><br/>“Run, we are not a match for the Dragon King at all. Once thousand tentacles is killed by him, it will be our turn next. Even if our vitality is terrifyingly strong, we are still not a match for him!”<br/><br/>The Lord of Disaster said helplessly!\t\t\t\t\t\t</div>", "images": {}, "success": true}