{"id": 1559, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15170255.html", "title": "Chapter 4562 - Chapter 4562: 4,561", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4562 - Chapter 4562: 4,561</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4562: 4,561<br/><br/>“How… how strong is this Dragon King?”<br/><br/>“A force that is as strong as our Behemoth Alliance was destroyed by the Dragon King alone. How is this possible?”<br/><br/>“The Federation won’t lie to us about this. We only need to investigate.”<br/><br/>“The resources of the Dragon Palace are too terrifying. It’s so terrifying that I can’t even imagine it.”<br/><br/>“If that Dragon King is really that terrifying, we’ll have to take more treasures.”<br/><br/>The experts of the Federal Alliance entered the guest house on the tenth day.<br/><br/>The experts of the Giant Beast Alliance also entered. They were all whispering and discussing in shock.<br/><br/>They thought that their guess of the Dragon King’s strength was already very high.<br/><br/>But unexpectedly, that Dragon King was even more terrifying than they had imagined.<br/><br/>It was even more shocking!<br/><br/>In the next few days, the powerful disciples of the Behemoth Alliance received more information about the Dragon King of the Dragon Palace.<br/><br/>In these few days, all the members of the Justice Alliance and the Dragon Palace Alliance had arrived.<br/><br/>The Behemoth Alliance had also thoroughly confirmed from them the strength of a faction called the evil sequence faction, and all the information about it being destroyed.<br/><br/>Immediately, the four chaos-level existences of the Behemoth Alliance decided that they would prepare precious gifts for the Dragon King’s birthday banquet.<br/><br/>Half a year passed quickly.<br/><br/>Basically, all the members of the Justice Alliance, the Ten-day Federation Alliance, the Behemoth Alliance, and the Dragon Palace Alliance had arrived.<br/><br/>In addition, there were more than 10,000 heaven origin destiny realm powerhouses who ruled over tier 8 and above.<br/><br/>“The celebration party is about to begin. I didn’t expect that not only the powerhouses of the Justice Alliance would come, but also the two major forces from far away.”<br/><br/>“Who would have thought that the Dragon King could grow to this stage? He must have been the leader of a clan that had just risen!”<br/><br/>“Fortunately, our Angel clan and the Dragon King have reconciled. Otherwise, our Angel clan wouldn’t exist in the nine-origin Universe!”<br/><br/>“There are more than 2,000 heaven origin creation realm powerhouses here. More than 2,000 of them come from thousands of universes. It’s shocking!”<br/><br/>The banquet was about to begin. The disciples of the top races of the nine-origin universe sat below the members of the Dragon Palace.<br/><br/>They glanced at the powerhouses around them.<br/><br/>The nearly 2,000 heaven origin creation realm powerhouses were all gathered here, which made them feel a little dazed.<br/><br/>Apart from the Dragon King, who else could have done this?<br/><br/>Especially the Angel Emperor of the Angel race. Looking at the situation in front of him, he still felt a lingering fear when he thought of his own race and the Dragon Palace charging out.<br/><br/>Fortunately, their grudge had been resolved!<br/><br/>“Hehe, with the Dragon King in our nine-origin universe, it will be of great benefit to us!”<br/><br/>The Elven empress said with a smile.<br/><br/>Because the elven race had helped the Dragon Palace in the past, now that the Dragon Palace had risen, the elven race had benefited the most.<br/><br/>This also gave the elven race two heavenly Yuan creation-level powerhouses.<br/><br/>In the surrounding area, the disciples of the four forces were dumbfounded and looked at the powerhouses around them in shock.<br/><br/>This time, the Dragon Palace Banquet had broadened their horizons.<br/><br/>“The Dragon King has arrived!”<br/><br/>At this moment, Prime Minister Gui’s voice sounded throughout the banquet venue.<br/><br/>In front of them, all the experts and disciples of the Dragon Palace immediately stood up.<br/><br/>At the same time, all the experts and disciples around them immediately stood up and looked in the direction of the main hall of the Dragon Palace.<br/><br/>Speaking of which, be it the Justice Alliance or the Ten Days Federation’s Giant Beast Alliance, they had not seen the Dragon King since they arrived at the Dragon Palace.<br/><br/>Even if it was a chaos-level powerhouse.<br/><br/>However, the group of chaos-level existences did not feel any dissatisfaction in their hearts.<br/><br/>The Dragon King was not on the same level as them.<br/><br/>At the main hall of the Dragon Palace, Wang Xian led a group of Dragon Queens and led a group of little fellows to the front.<br/><br/>“Greetings, Dragon King, Greetings, Dragon Queen!”<br/><br/>“Greetings, Dragon King, Greetings, Dragon Queen!”<br/><br/>At this moment, regardless of whether it was existences at the ruler realm or those at the chaos realm, all of them bowed and shouted loudly!<br/><br/>“Thank you all for coming all the way here to attend my child’s celebration banquet. Hehe, please take a seat!”<br/><br/>Wang Xian swept his gaze across and a smile appeared on his face. He waved his hand!<br/><br/>“Congratulations, Dragon King, for getting the little prince and Princess. Thank you, Dragon King, for getting rid of the evil sequence faction and getting rid of the hidden dangers of our Justice Alliance. On behalf of all the strong disciples of the Justice Alliance, I wish to congratulate the little prince and princess on her healthy and Happy Growth!”<br/><br/>The leader of the Justice Alliance took a step forward and congratulated with a Smile!<br/><br/>Following that, another chaos-level powerhouse of the Justice Alliance gestured for them to take out a large amount of treasures and resources.<br/><br/>“Dragon King, these are some gifts for the little princes and princesses of the Dragon Palace.”<br/><br/>He opened his mouth and said.<br/><br/>“Hehe, you little guys, thank you, uncles!”<br/><br/>Wang Xian smiled and patted the little guys beside him!<br/><br/>“Thank you, uncles!”<br/><br/>The little guys sized up their surroundings with their big eyes and thanked them sweetly.<br/><br/>“Alliance leader, you have a son. As members of the Dragon Palace Alliance, we have prepared some small gifts for the little princes and princesses.”<br/><br/>The powerhouses of the Dragon Palace Alliance also came out to present their gifts.<br/><br/>Following that, the ten-day Federation Alliance and the Behemoth Alliance also sent their gifts one by one.<br/><br/>Wang Xian thanked them one by one.<br/><br/>“Thank you all again for coming today. We are all powerhouses from the nearby universe. From now on, peace is the most important thing for everyone. There is no need to create unnecessary killing and torture. Everyone can explore the unknown chaos and the other universes in the other regions.”<br/><br/>Wang Xian looked at them and said faintly.<br/><br/>His words basically confirmed the rules of this area of chaos.<br/><br/>“Hehe, I won’t say anything else. Today is the celebration of my children. Everyone, eat and drink well. After the meal, in order to thank everyone for coming, I will carry out the preaching.”<br/><br/>“After the preaching, there will be a disciple competition. My Dragon Palace has prepared some gifts.”<br/><br/>As Wang Xian spoke, he nodded at Prime Minister Gui.<br/><br/>“Let’s begin the Feast!”<br/><br/>Prime Minister Gui shouted softly at the back. Soon after, Dragon Ladies from the Dragon Palace came up with exquisite food.<br/><br/>Each of the food contained an extremely majestic energy!<br/><br/>“Delicacies made from the flesh and blood of a great dao-level chaos behemoth? This? ?”<br/><br/>In the front, the chaos-level powerhouses from the major factions quickly sensed the preciousness of the food.<br/><br/>This was food made by a Great Dao Level Primal Chaos Beast.<br/><br/>The plates of delicacies were so numerous that it was definitely not a Great Dao Level Primal Chaos Beast.<br/><br/>There were at least five of them.<br/><br/>That was because the plates that flew out had to satisfy nearly ten million living beings.<br/><br/>This time, although there were only over twenty thousand disciples from the other forces, there were nearly ten million disciples from the Dragon Palace and other peak races in the nine-origin universe.<br/><br/>All of them had delicacies made from the flesh and blood of Chaos Behemoths at the Great Dao Level?\t\t\t\t\t\t</div>", "images": {}, "success": true}