{"id": 1558, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15170254.html", "title": "Chapter 4561 - Chapter 4561: In The Middle Of The 4560-Day Celebration", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4561 - Chapter 4561: In The Middle Of The 4560-Day Celebration</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4561: In the middle of the 4560-day celebration<br/><br/>“This…”. “This is a heavenly yuan destiny-level building. There are more than ten extremely huge buildings. How is this possible?”? “How can there be so many heavenly yuan destiny-level treasures in the world?”? “And on each of them, there is a divine dragon that suddenly appeared. This…”? ? ? ?”<br/><br/>“My God, is this where the Dragon King’s forces are sitting? There are treasures everywhere around here, but they are all treasures. The dozen or so buildings give me a powerful pressure.”<br/><br/>“They’re too powerful, so powerful that it’s unbelievable. There are simply too many treasures here in the Dragon Palace. We can even see a lot of heavenly yuan creation-level divine trees and grass. This…”<br/><br/>“The energy around here is many times more powerful than our strongest grotto-heaven blessed land. Hiss!”<br/><br/>“It’s unbelievable that a faction can have so many treasures and supreme treasures!”<br/><br/>The Ten Days Alliance and the Giant Beast Alliance looked at the Dragon Palace in shock.<br/><br/>Every blade of grass, tree, and flower in the Dragon Palace contained powerful energy.<br/><br/>There was no divine grass or divine tree that was lower than the ruler realm.<br/><br/>Most importantly, these divine grass and flowers were like decorations in the Dragon Palace. They could be seen everywhere.<br/><br/>There were all kinds of mountains and rivers that contained enormous energy.<br/><br/>There were clouds in the sky that were formed from divine energy.<br/><br/>There were treasures everywhere.<br/><br/>Even the Heavenly Yuan creation realm experts were shocked when they saw them.<br/><br/>They felt it was unbelievable.<br/><br/>As for the disciples who hadn’t even reached the Heavenly Yuan creation realm, there was no need to mention them.<br/><br/>“Everyone, this way please!”<br/><br/>The Nine Heavens Divine Roc smiled faintly and brought them to a banquet building in the Dragon Palace.<br/><br/>“Welcome to the Dragon Palace. I’m Prime Minister Gui of the Dragon Palace. There’s still half a year before the celebration of our crown prince and Princess. You can walk around the Dragon Palace now.”<br/><br/>“In the vicinity of the Dragon Palace and in the nine-origin universe, you need to abide by the rules of our side. We will have members to act as guides for you and congratulate you on having a good time.”<br/><br/>Prime Minister Gui came up to them and said with a smile on his face.<br/><br/>“It’s okay. It’s our first time here in the Dragon Palace. We are deeply shocked!”<br/><br/>Wu Tongming’s elder answered with a smile.<br/><br/>“We should be the ones who feel that you are here. In order to celebrate the birth of the Crown Prince and Princess, the Dragon Palace will hold a competition and sparring. All guests below the level of Heavenly Yuan creation can participate.”<br/><br/>“First place, our Dragon Palace will take out a heavenly yuan creation treasure that corresponds to its attributes as a reward. Disciples who are interested can participate, Hehe.”<br/><br/>Prime Minister Gui smiled faintly and led them to the guest residence.<br/><br/>When the strong disciples of the two forces heard this, they were slightly shocked.<br/><br/>This? ?<br/><br/>Just a competition between disciples below the level of Heavenly Yuan creation, and first place was able to obtain a Heavenly Yuan creation treasure?<br/><br/>This was something that they didn’t dare to imagine.<br/><br/>A treasure of this level could be used as a wager?<br/><br/>“Third brother, don’t run. Return the item to me. Quickly return it to me, or I’ll let Big Brother Beat You Up!”<br/><br/>“If you don’t return it, then don’t return it. Slightly, slightly, three, three, let’s run!”<br/><br/>At this moment, an extremely young voice came from the side.<br/><br/>A little girl was chasing after the little boy.<br/><br/>The two children looked very small, with childlike innocence on their faces.<br/><br/>A little boy who was riding on a creature with wings was running in front.<br/><br/>A little girl who was also riding on this creature was chasing after him angrily.<br/><br/>“San San, put my third brother down. I want to beat him up. Third brother, I want to fight with you.”<br/><br/>The little girl shouted angrily.<br/><br/>“Crown prince, the seventh princess has spoken. I Won’t participate. Hehe!”<br/><br/>The space beast beneath the Little Boy said with a smile.<br/><br/>“HMPH, you want to beat me up? Catch up with Me First!”<br/><br/>The Little Boy got down from the Space Beast and flew forward in a wisp of smoke.<br/><br/>“If you don’t give me my things, I’ll beat you until you cry. HMPH!”<br/><br/>The little girl hummed as she flew down from the space beast and chased after the little boy.<br/><br/>Although they were very young, they seemed to have the intelligence of children.<br/><br/>However, they were not weak.<br/><br/>“Hehe, 77,33, go and look after the crown prince and the princesses. Don’t let them get hurt.”<br/><br/>Prime Minister Gui, who was in front of the guest house, heard the voice and paid attention to it. He said to 77,33 and the two space beasts of the empty cicada clan.<br/><br/>“Yes, Prime Minister Gui. We’ll keep an eye on them. They’ll be fine!”<br/><br/>The two space beasts nodded and disappeared.<br/><br/>“This… Prime Minister Gui, are those two the children of the Dragon King?”<br/><br/>A chaos-level powerhouse of the Giant Beast Alliance couldn’t help but ask.<br/><br/>“Yes, the crown princes and Princesses of our Dragon Palace and the thirteen crown princes and princesses of our Dragon Palace. The little ones are six months old.”<br/><br/>Prime Minister Gui nodded with a hint of affection.<br/><br/>“Prime Minister Gui, those two called 77 and 33 are masters of the Great Dao, right? Why do they give me the feeling that they are like primal chaos behemoths?”<br/><br/>A primal chaos-level existence from the Behemoth Alliance couldn’t help but ask with a hint of doubt on his face.<br/><br/>Their Behemoth Alliance had the ability to control primal chaos behemoths.<br/><br/>They could sense that the auras of seven, seven, and three were slightly different.<br/><br/>“We are the Behemoth Beasts of chaos. The Dragon King helped us to gain sentience. A few great dao-level experts of our race are fortunate enough to be able to grow together with the crown prince and Princess.”<br/><br/>The leader of the empty cicada tribe said from the side!<br/><br/>“Gain sentience? This?”<br/><br/>The words of the leader of the empty cicada clan shocked the four primal chaos level beings and the other experts of the Behemoth Alliance.<br/><br/>Activate Spiritual Intelligence?<br/><br/>They knew the primal chaos behemoth very well, and this was the first time they had heard that it could activate spiritual intelligence.<br/><br/>Besides, the Dragon King of the Dragon Palace had thirteen children.<br/><br/>Each child was accompanied by a primal chaos behemoth of the Great Dao level as they grew up and protected them?<br/><br/>Didn’t that mean that the thirteen experts of the Great Dao level were just the personal bodyguards of the Dragon Prince’s children?<br/><br/>This? ?<br/><br/>They found it somewhat unbelievable.<br/><br/>Prime Minister GUI smiled and said, “Everyone, you can rest here for the next few days. If you have any questions, you can ask the civil officials of the Dragon Palace who are carrying the turtle shell just like me.”<br/><br/>Prime Minister Gui said a few words and left without accompanying them for long.<br/><br/>Prime Minister Gui’s main task now was to teach the crown prince and the princess.<br/><br/>Teach them how to behave, how to do things, and how to learn!<br/><br/>“Is this the Dragon Palace?”<br/><br/>The experts of the Behemoth Alliance were in a trance. The four chaos-level existences were also amazed.<br/><br/>“Hehe, there’s something we haven’t told you. Not long ago, the Dragon King single-handedly destroyed a force that was as powerful as your Behemoth Alliance<br/><br/>“According to that kid from my family, four primal chaos existences and more than 400 heaven origin destinies were completely annihilated!”<br/><br/>Wu Tongming’s ancestor from the ten-day federation said with a smile when he saw their shocked expressions!\t\t\t\t\t\t</div>", "images": {}, "success": true}