{"id": 1554, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15161891.html", "title": "Chapter 4557 - Chapter 4557: 4,556 Heaven-Connecting Techniques", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4557 - Chapter 4557: 4,556 Heaven-Connecting Techniques</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4557: 4,556 heaven-connecting techniques<br/><br/>“Ladies!”<br/><br/>Wang Xian came before the group of girls and shouted with a smile on his face.<br/><br/>Although Wang Xian had been cultivating and improving his strength during this period of time, he would create clones to accompany the group of girls.<br/><br/>With his current strength, there was no difference between clones and his own body.<br/><br/>He could even create thousands of clones, each of which was his real body.<br/><br/>“HMPH!”<br/><br/>When Guan Shuqing and the rest of the girls heard Wang Xian’s frivolous words, they snorted and rolled their eyes at him before walking towards him!<br/><br/>“How long until our children are born? As their father, we have to prepare a gift for them!”<br/><br/>Wang Xian said to them with a smile on his face.<br/><br/>“About 108 more years. Little Xian, are you happy that you are going to be a father in more than 100 years?”<br/><br/>Lan Qingyue asked him with a smile on her face.<br/><br/>“Of course I’m happy. By the way, now that I’ve settled down, I’ll accompany all of you every day and raise a child in the future. Hehe!”<br/><br/>Wang Xian said with a smile!<br/><br/>The group of girls had wanted to have a child for a long time. However, the Dragon Palace had always been in an unstable state.<br/><br/>Wang Xian did not wish for his child to experience too many tribulations as soon as he was born.<br/><br/>Hence, he did not want the child.<br/><br/>Now, he was invincible and was about to have a child.<br/><br/>He wanted to bring some fresh blood to the Dragon Palace.<br/><br/>Besides, although the Dragon Palace would have to cultivate in the future, it was time for the members of the Dragon Palace to give birth to the next generation.<br/><br/>The number of people in the Dragon Palace was still too small.<br/><br/>There were only about eight million people.<br/><br/>For a force that controlled hundreds of universes, the number of people was pitifully small.<br/><br/>“Hehe, alright. Come, let us tell you about the plan for the children!”<br/><br/>The group of girls pulled him along and discussed the situation of the children with him!<br/><br/>Wang Xian listened to them one by one and agreed.<br/><br/>Anyway, the group of girls had already made arrangements for the children.<br/><br/>Of course, they would not make arrangements for their lives. However, they still had to be taught and educated well when they were children.<br/><br/>“Dragon King, the little princesses and princes are about to be born. This is a joyous occasion for our dragon palace. I think we should celebrate with them and invite some members of the Dragon Palace Alliance and the Justice Alliance!”<br/><br/>After accompanying the group of girls for a few days, Wang Xian returned to the Dragon King Palace. Prime Minister Gui immediately walked over and said with a smile on his face!<br/><br/>“Yes, that’s fine. Let’s celebrate properly. You can make the arrangements!”<br/><br/>Wang Xian nodded his head.<br/><br/>It had been a long time since the dragon palace held such a celebratory banquet. This time around, the birth of his child required some preparation!<br/><br/>It was just an ordinary celebration!<br/><br/>“It’s the Dragon King. Leave it to me!”<br/><br/>Prime Minister Gui nodded his head.<br/><br/>When Wang Xian saw Prime Minister Gui leaving, his face revealed a contemplative look.<br/><br/>Speaking of which, he had to prepare some gifts for his sons and daughters!<br/><br/>“There are already enough treasures and resources in the Dragon Palace. There is no lack of anything. Furthermore, the little ones are born with the strength of a ruler. What gifts should I prepare?”<br/><br/>Wang Xian thought for a while and had some thoughts.<br/><br/>His figure disappeared instantly.<br/><br/>When he reappeared, he was already below the land of origin.<br/><br/>Below the land of origin was the place where the giant beasts of Chaos lived.<br/><br/>There were quite a number of giant beasts of chaos here, and there were four of them at the level of chaos.<br/><br/>The gift that Wang Xian prepared for his child was a pet.<br/><br/>Of course, calling it a pet was only in his opinion.<br/><br/>His eyes sparkled, and his body began to teleport.<br/><br/>After more than ten minutes, Wang Xian arrived in front of a cave.<br/><br/>This was the location of a species of chaos behemoths.<br/><br/>Wang Xian had experienced this species of chaos behemoths once.<br/><br/>At that time, even with his chaos-level strength, he was forced to flee.<br/><br/>Even the mutated space power of an lie was disturbed.<br/><br/>This species.<br/><br/>An existence at the chaos-level.<br/><br/>Seven great dao-level existences.<br/><br/>And sixteen control level existences.<br/><br/>There were also 55 beginner level existences.<br/><br/>This was an exceptionally powerful race.<br/><br/>The last time, when Wang Xian arrived in front of a Great Dao Level Primal Chaos Giant Beast, he was alerted by it.<br/><br/>Its powerful spatial power was indeed terrifying.<br/><br/>However, this time, when Wang Xian appeared in front of them, he was not detected.<br/><br/>A group of chaos behemoths was resting here.<br/><br/>This was a beautiful space behemoth with cicada wings. Their bodies weren’t very big.<br/><br/>Their appearances were also rather beautiful.<br/><br/>Their bodies were emitting a thick spatial energy.<br/><br/>Buzz<br/><br/>Wang Xian’s body trembled slightly, startling the group of Chaos Behemoths.<br/><br/>Boom<br/><br/>An extremely vast spatial energy gushed out from the bodies of the chaos behemoths.<br/><br/>However, before they could retaliate, their bodies froze and did not move.<br/><br/>With Wang Xian’s strength, this extremely terrifying race of chaos behemoths could not move at all.<br/><br/>Their eyes were filled with horror.<br/><br/>“The chaos behemoths are a special product of the chaos. Their strength is extremely terrifying, but they do not have intelligence. This is the rule of the chaos.”<br/><br/>“This also causes them to be difficult to subdue. Take the Giant Beast Alliance for example. They are just a way of controlling them, not taming them.”<br/><br/>“I can’t tame them myself unless I give them intelligence!”<br/><br/>Wang Xian thought to himself.<br/><br/>It was not that easy to gain intelligence. This was equivalent to changing the rules of a living being.<br/><br/>It was a considerable expenditure.<br/><br/>Buzz<br/><br/>Wang Xian moved his body. With a wave of his arm, waves of chaotic energy transformed into a special soul and entered the minds of all the gigantic beasts of this gigantic beast race!<br/><br/>At the same time, some information about the chaos of the universe entered their minds<br/><br/>“Today, I will activate your spiritual intelligence. All of you will follow me.”<br/><br/>At the same time, Wang Xian’s voice entered their ears.<br/><br/>The eyes of the primal chaos behemoths that were filled with fear revealed a look of shock.<br/><br/>This was especially so for the strongest primal Chaos Behemoth.<br/><br/>It was the strongest and the fastest to receive information and convert it!<br/><br/>“Thank you, sir, for activating your spiritual wisdom for us. In the future, our empty cicada tribe will serve you, sir.”<br/><br/>This primal chaos level existence transmitted his voice with exceptional respect.<br/><br/>Even if his spiritual wisdom was not activated, he knew that the Wang Xian in front of him was an extremely terrifying existence that could easily crush him to death.<br/><br/>Now that he had helped him to activate his spiritual wisdom, he was filled with gratitude.<br/><br/>After all, after activating his spiritual wisdom, in his opinion, his previous life was completely muddle-headed.<br/><br/>“There’s no need to be so humble. In the chaos, you are also an almost invincible powerhouse. Join Our Dragon Palace in the future.”<br/><br/>Wang Xian instructed lightly.<br/><br/>His gaze swept across the Seven Great Dao level members of the empty cicada clan. He sighed a little less.<br/><br/>He had more than seven children. He also had to look for a few small and good-looking great dao level Space Beasts.\t\t\t\t\t\t</div>", "images": {}, "success": true}