{"id": 1553, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15141259.html", "title": "Chapter 4556 - Chapter 4556: 4555 To 30 Primal Chaos Level Warriors, Dragon Sons And Dragon Daughters!", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4556 - Chapter 4556: 4555 To 30 Primal Chaos Level Warriors, Dragon Sons And Dragon Daughters!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4556: 4555 to 30 Primal Chaos Level Warriors, Dragon Sons and Dragon Daughters!<br/><br/>The experts of the Justice Alliance brought a lot of treasures and resources.<br/><br/>There was even a Heavenly Yuan Destiny Treasure!<br/><br/>The amount of other resources was also priceless, comparable to all the resources in a universe.<br/><br/>These resources were a huge amount of resources for the Justice Alliance.<br/><br/>However, they still took them out when they faced the Dragon King.<br/><br/>It was more of a tribute than a gift.<br/><br/>It was a gesture of goodwill. They hoped that the Dragon King would not target the Justice Alliance.<br/><br/>After all, with the strength that the Dragon King had displayed, it would not be a big problem to destroy the Justice Alliance!<br/><br/>Wang Xian was not someone who would kill.<br/><br/>He would not attack unless he was attacked. The Justice Alliance did not have any grudges with the Dragon Palace, and Wang Xian would not kill them either!<br/><br/>The experts from the Justice Alliance stayed in the Dragon Palace for a period of time before leaving.<br/><br/>Wang Xian checked all the resources.<br/><br/>He began to continue to absorb and upgrade.<br/><br/>Although he was invincible now,.<br/><br/>There were too many resources at the moment, so many that the disciples of the Dragon Palace could not exhaust them all.<br/><br/>Naturally, he had to upgrade again.<br/><br/>Better safe than sorry.<br/><br/>The chaos was vast and endless. No one had explored the entire chaos, and no one could be sure if there was anything above the chaos.<br/><br/>Therefore, Wang Xian had to improve his strength to be truly invincible first.<br/><br/>Wang Xian continued to improve.<br/><br/>Prime Minister Gui and the rest were dealing with the matters of the Dragon Palace.<br/><br/>They were dealing with the matters of the evil sequence faction universe.<br/><br/>After their decision, they decided to create a race in that universe.<br/><br/>They would create a peak race and build a divine dragon totem there.<br/><br/>They would create something in the form of Wang Xian.<br/><br/>It could be said that with the passage of time, the newly born races and creatures there would use Wang Xian as their creator.<br/><br/>Apart from that, it took the Dragon Palace alliance a million years to build a black hole teleportation formation from the Dragon Palace and the land of origin to the evil sequence camp.<br/><br/>A total of fifteen black hole teleportation arrays were built, covering the entire evil sequence faction universe.<br/><br/>There were many powerful paradises in the evil sequence faction universe.<br/><br/>These paradises were sacred places for cultivation.<br/><br/>These places naturally had to be used.<br/><br/>After the black hole teleportation array was built, the disciples of the Dragon Palace also began to cultivate.<br/><br/>This time, the Dragon Palace obtained more than 1,000 spots as a heavenly yuan creation realm expert. This allowed some disciples who could break through to become Heavenly Yuan creation realm experts with ease.<br/><br/>In addition, they obtained more than 20 Heavenly Yuan creation realm treasures from the evil array formation during this battle.<br/><br/>These treasures were all given to the experts of the Dragon Palace.<br/><br/>This also increased the strength of the Dragon Palace by quite a bit.<br/><br/>After the Great War ended, the Dragon Palace entered the stage of settling down.<br/><br/>50 million years passed very quickly.<br/><br/>In the Dragon King’s Palace, Wang Xian opened his eyes with a smile after absorbing a batch of resources.<br/><br/>He stood up slowly. An extremely terrifying energy was emitted from his body.<br/><br/>The surrounding void started to collapse and disappear. However, it started to reorganize under the terrifying energy.<br/><br/>With a single move, it was as though he could destroy an entire universe.<br/><br/>With a thought, Wang Xian seemed to have 30 terrifying balls in his body.<br/><br/>Each ball was comparable to the combat strength of a primal chaos level.<br/><br/>When the 30 balls were interwoven together, they could erupt with unparalleled energy.<br/><br/>As for how terrifying it was, Wang Xian did not know.<br/><br/>After absorbing a portion of the resources, Wang Xian’s current strength was comparable to 30 chaos levels!<br/><br/>“It’s almost done. There’s no need to improve it for now. Although, there are still many more resources in the Dragon Palace!”<br/><br/>He mumbled.<br/><br/>He had only absorbed one-third of the resources he had obtained from the evil sequence camp this time.<br/><br/>There were still two-thirds of the resources left.<br/><br/>However, there was no need for him to continue absorbing them now.<br/><br/>He was already very, very strong now.<br/><br/>The powerhouses and disciples of the Dragon Palace still needed resources.<br/><br/>After all, now that he had over a thousand slots for the Heaven’s origin creation level powerhouses, the Dragon Palace still had to nurture over a Thousand Heaven’s origin creation level existences.<br/><br/>“How strong Am I Now?”<br/><br/>Wang Xian calculated in his heart, but he couldn’t measure it.<br/><br/>He didn’t know how strong he was when he really erupted.<br/><br/>However, what he could be sure of was that it was too easy for him to destroy a universe.<br/><br/>It didn’t even take an hour to fly from one side of a universe to the other side.<br/><br/>If he were to use the time domain, that was even more so.<br/><br/>Furthermore, the increase in his strength gave him a feeling of transcendence.<br/><br/>He converted it into his divination ability and was able to divine everything.<br/><br/>He was able to divine everything in the world.<br/><br/>In front of any powerhouse, there were no secrets to speak of.<br/><br/>This included the chaos-level existences in the Justice Union universe.<br/><br/>He was unable to divine how many chaos behemoths there were in the land of origin. There were four chaos-level behemoths that were comparable to the chaos-level.<br/><br/>Of course, although he was unable to divine the size of the entire mystery of the chaos, this was already very terrifying!<br/><br/>Other than the power of divination, he could see through all kinds of powers.<br/><br/>With just a thought, Wang Xian could instantly kill the leader of the Justice Alliance and another chaos-level powerhouse.<br/><br/>This was his strength.<br/><br/>“My child is about to be born. I have to go and take a look!”<br/><br/>There was another important thing for Wang Xian to stop absorbing resources this time.<br/><br/>That was that Guan Shuqing and the other girls were about to give birth to their dragon sons and daughters!<br/><br/>This was Wang Xian’s child.<br/><br/>His own flesh and blood.<br/><br/>He was also the princess and Prince of the Dragon Palace, the dragon son and daughter!<br/><br/>Wang Xian moved and arrived at the place where the girls were staying.<br/><br/>In the extremely beautiful garden.<br/><br/>The entire garden was planted with eight divine trees and herbs of the heaven origin creation level.<br/><br/>There were all kinds of beautiful and alluring flowers everywhere.<br/><br/>Each and every one of them was blooming with brilliance.<br/><br/>Guan Shuqing, Lan Qingyue, Sun Lingxiu, Tang Yinxuan, Fan Qinglan, Ah Jiaya… A group of girls were inside.<br/><br/>Their bellies bulged slightly, and their faces were filled with maternal radiance.<br/><br/>They were all talking and watering the flowers.<br/><br/>“In a few more years, a group of little guys will be born. Tell me, how do we rank them? Should we separate the time and let them be born? At least let them have the difference between an older brother, a younger sister, a younger brother, and a younger sister!”<br/><br/>“Yes, this is a must. I think we can divide them according to our age. Hehe, whoever is older, who is the husband, and who is the father will be the boss!”<br/><br/>“Ah, I’m the oldest. However, I want a girl. Isn’t it better to let a boy be the boss?”<br/><br/>“Who is different?”<br/><br/>When Wang Xian arrived, voices were heard.<br/><br/>When he heard them, he revealed a blissful smile on his face.<br/><br/>A group of girls had followed him all the way here. The journey was fraught with danger and they had a good relationship with each other.\t\t\t\t\t\t</div>", "images": {}, "success": true}