{"id": 1556, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15170252.html", "title": "Chapter 4559 - Chapter 4559: 4558. Thirteen Dragon Sons And Daughters", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4559 - Chapter 4559: 4558. Thirteen Dragon Sons And Daughters</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4559: 4558. Thirteen Dragon Sons and daughters<br/><br/>“The Dragon King is the leader of a force, an existence above the chaos, and has obtained the extremely powerful Divine Roc of the Nine Heavens. The better the relationship between the ten-day federation and him, the greater our crisis will be.”<br/><br/>“This time, we will prepare a gift to see if we can befriend the Dragon King. The relationship between the ten-day federation and the Dragon King is only tens of millions of years old.”<br/><br/>“Well, let’s go and have a look. After all, this is an existence above chaos, above chaos. Such a realm is unheard of.”<br/><br/>“Since we are going there, let’s go there openly. Send someone to tell the ten-day federation that we are going to celebrate the Dragon King. The ten-day federation won’t be able to stop us from celebrating the Dragon King’s wedding.”<br/><br/>“Sure!”<br/><br/>In the Behemoth Union, the four chaos-level existences of the Behemoth Union gathered together to discuss this matter.<br/><br/>In fact, with such a huge force like theirs, there was no need to curry favor with others without an invitation.<br/><br/>But there was nothing they could do.<br/><br/>On that day, they witnessed how terrifying the Dragon King was.<br/><br/>He had completely exterminated a chaos-level existence.<br/><br/>The strength he displayed made the four of them tremble with fear.<br/><br/>If he was persuaded by the ten-day federation to fight against their Behemoth Alliance…<br/><br/>It would be a disaster for their Behemoth Alliance.<br/><br/>Therefore, they were prepared to head for the Dragon King’s joyous event.<br/><br/>Time passed year by year.<br/><br/>The entire dragon palace was extremely joyous as they prepared for the birth of the dragon princes and princesses.<br/><br/>The powerful disciples of the entire nine-origin universe also knew that the Dragon King had a child, and they also celebrated.<br/><br/>All the peak races were preparing for the Dragon Palace’s upcoming celebration.<br/><br/>Now, the status of the Dragon Palace, the Dragon King’s strength, and all the powerful disciples of the nine-origin universe were very clear.<br/><br/>He single-handedly destroyed the evil sequence camp.<br/><br/>He established the extremely powerful Dragon Palace Alliance.<br/><br/>He was an invincible existence that even the Justice Alliance came to express their goodwill.<br/><br/>The strong disciples of the nine-origin universe all knew that the Dragon King was an invincible existence in a very wide area nearby.<br/><br/>A truly invincible existence.<br/><br/>The entire nine-origin universe also benefited greatly because of the Dragon King.<br/><br/>They had also benefited greatly from the expedition to the evil sequence camp.<br/><br/>After all, they were a family. Their gains were much more than those of the other members of the Dragon Palace Alliance.<br/><br/>Just a small amount of resources from the Dragon Palace was enough for the other peak races in the nine-origin universe to use for countless years.<br/><br/>“HMM?”<br/><br/>Wang Xian accompanied a group of girls in the Dragon Palace.<br/><br/>On this day, he saw the message sent by Wu Tongming. He raised his eyebrows slightly.<br/><br/>Wu Tongming informed him that the Federation Alliance wanted to come and celebrate for him on the 10th day.<br/><br/>They would send a group of strong disciples over.<br/><br/>In addition, the Behemoth Alliance received the news and was prepared to come as well.<br/><br/>Wang Xian did not reject and agreed.<br/><br/>The livelier the joyous occasion, the better!<br/><br/>“There are still more than 30 years before the child is born.”<br/><br/>After Wang Xian replied to the message, a smile appeared on his face.<br/><br/>Wang Xian and the rest would only hold a celebratory feast one year after the child was born.<br/><br/>Just like the rule on Earth, the child would be born in 100 days after the joyous occasion.<br/><br/>This time, Wang Xian had set the date to be one year after the birth of his child.<br/><br/>After all, in the chaos of the universe, one year was very short.<br/><br/>“The dragon queens are about to give birth!”<br/><br/>“Hehe, the little princesses and princes in our Dragon Palace are about to be born.”<br/><br/>“With the Dragon King around, Our Dragon Palace will get better and better in the future. However, it can already be said to be very good now!”<br/><br/>“The Dragon King has given the order. In the next period of time, let the men and women of our Dragon Palace fall in love more and give birth to more new members of the Dragon Palace!”<br/><br/>“Well, there are more women and men in the Dragon Palace. Most of them are men. Prime Minister Gui also said that he would hold a blind date. hehehe!”<br/><br/>One evening thirty years later, all the Heavenly Yuan creation realm experts of the Dragon Palace gathered in front of the Dragon Queen’s Chamber!<br/><br/>Now, there were two hundred heavenly Yuan creation realm experts in the Dragon Palace!<br/><br/>In the enormous little blue house.<br/><br/>Their strength had recovered to the level of two divine Rocs of the nine heavens!<br/><br/>They were from the Giant Beast Race of chaos, the empty cicada race!<br/><br/>Along with Wang Xian, Ao Qitian, Ao Yao, Ao Jian, Mou Zesen, and the other leaders who had fought together with Wang Xian to this day!<br/><br/>There were also Wu Tongming, bei Shuang, and Xiao Ran, who had already transformed into the fire god Dragon.<br/><br/>Godson Tian Chi.<br/><br/>They were waiting quietly outside.<br/><br/>At this moment, Wang Xian was also waiting for the birth of his child inside.<br/><br/>The group of girls had already reached the Heaven’s origin realm.<br/><br/>With their powerful strength, it was naturally easier to give birth to a child.<br/><br/>It wouldn’t pose much of a threat to them.<br/><br/>In addition, for the past tens of millions of years, the best resources in the Dragon Palace were concentrated on them in order to give birth to a child.<br/><br/>Wang Xian had also expended a lot of chaotic energy to improve the children’s comprehension ability and innate ability.<br/><br/>Furthermore, he had created a unique treasure of the Heaven’s origin.<br/><br/>A unique treasure of the Heaven’s origin!<br/><br/>“Ahhhh!”<br/><br/>Not long after, the cries of the children could be heard.<br/><br/>Wang Xian looked ahead with a smile on his face.<br/><br/>Thirteen children were held in the arms of a group of girls and were crying.<br/><br/>Every one of them was enveloped by a powerful energy.<br/><br/>They were born with the strength of a ruler.<br/><br/>In fact, with Wang Xian’s current strength, he could do it even if he wanted his children to be born with the strength of the Heaven’s origin blessed realm.<br/><br/>However, he didn’t do it.<br/><br/>A child still had to have a complete childhood.<br/><br/>He had to go through the same hardships as other cultivators. It was a process that all cultivators in the universe had to go through.<br/><br/>“Haha, a bunch of little guys are finally born!”<br/><br/>Wang Xian walked over happily and said with a loud laugh.<br/><br/>“Hehe, Xiao Xian, we have our own children now!”<br/><br/>The group of girls were also looking at their children with a face full of happiness.<br/><br/>Wang Xian walked over and sized up his children one by one.<br/><br/>“MMM, they are all following me. They are beautiful and cute!”<br/><br/>Wang Xian said happily.<br/><br/>“Indeed, they are all too cute. As their father, you should give them a good name.”<br/><br/>“Also, we have already discussed it. Moreover, those who were born earlier are all older brothers while the girls are all younger sisters. This is the eldest brother.”<br/><br/>The group of girls said to him.<br/><br/>“I know, of course I know. Leave the matter of the name to me.”<br/><br/>Wang Xian replied with a smile.<br/><br/>“Congratulations to Dragon King and Dragon Queen for marrying the Crown Prince and Princess!”<br/><br/>“Congratulations to master and mistress for marrying the crown prince and Princess!”<br/><br/>“Congratulations to foster father and foster mother for marrying the crown prince and Princess!”<br/><br/>At this moment, the group of powerhouses from the Dragon Palace outside heard the cries of the child. All of them congratulated him respectfully outside!<br/><br/>“Hehe, you can all leave now. We will celebrate after the little ones open their bodies.”<br/><br/>Wang Xian smiled when he heard the voices of his disciples and adopted sons.\t\t\t\t\t\t</div>", "images": {}, "success": true}