{"id": 1552, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15141258.html", "title": "Chapter 4555 - Chapter 4555: 4554 Harvest", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4555 - Chapter 4555: 4554 Harvest</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4555: 4554 harvest<br/><br/>The evil sequence faction had three to four hundred universes, which was a long-term resource.<br/><br/>A universe, even if it was destroyed, would give birth to new life, new resources, and new treasures over a long period of time.<br/><br/>It would even give birth to a heavenly yuan destiny supreme treasure.<br/><br/>Therefore, the evil sequence faction’s universe was a long-term resource for the Dragon Palace.<br/><br/>As for the next management issue, whether to create creatures and races in these universes would require careful planning.<br/><br/>Wang Xian was not going to participate in this matter. He was going to hand it over to Prime Minister Gui and the rest.<br/><br/>He was going to hand it over to the members of the Dragon Palace Alliance.<br/><br/>This time, the members of the Dragon Palace Alliance were also going to pay a price for eating the soup.<br/><br/>“Dragon King, I have already collected all the resources this time. In addition, all the resources have not been officially allocated. Everything is awaiting your decision, Dragon King!”<br/><br/>Prime Minister Gui continued!<br/><br/>All the resources, corpses, and experts of the Dragon Palace Alliance were stored in the storage space.<br/><br/>They were all handed over to Prime Minister Gui.<br/><br/>They would be distributed in the end.<br/><br/>No experts dared to have any opinions. After all, they had seen the strength of the Dragon Palace Dragon King.<br/><br/>It was no exaggeration to say that the Dragon Palace could destroy all their experts and all the universes.<br/><br/>The members of the Dragon Palace Alliance did not dare to have any other thoughts.<br/><br/>They just needed to focus on the Dragon King as their king!<br/><br/>With the protection of the Dragon King, they would not have to worry about the safety of their own universe in the future. was that not good?<br/><br/>“HMM, bring the resources over. I will distribute some of them.”<br/><br/>Wang Xian nodded his head.<br/><br/>Distributing the resources was very simple. Wang Xian promised to give them one-tenth of the resources.<br/><br/>Divination would be done using divination power. It would be enough to divide the resources into ten portions.<br/><br/>Wang Xian quickly divided the resources. Then, he would distribute the resources according to the strength of each member!<br/><br/>Every member of the Dragon Palace would be able to obtain a considerable amount of resources.<br/><br/>These resources were something that they did not dare to imagine in the past.<br/><br/>Other than these resources, there were also some powerful paradises and blessed lands in the universe of the evil sequence faction.<br/><br/>These treasured lands could also be distributed to the members of the Dragon Palace Alliance.<br/><br/>They could send their disciples over to cultivate and improve in such treasured lands.<br/><br/>“Thank you, Dragon King!”<br/><br/>After Wang Xian was done distributing them, the group of powerhouses from the Dragon Palace Alliance expressed their gratitude.<br/><br/>“It’s alright. This is what you deserve. The next priority is to build a black hole teleportation formation and establish a passageway between the entire evil sequence alignment camp and our Dragon Palace Alliance as soon as possible.”<br/><br/>“Also, Prime Minister Gui, you can discuss the situation of the universe here. You can decide whether you want to create a race or something else. Develop these universes well.”<br/><br/>Wang Xian instructed them in the end.<br/><br/>With Wang Xian’s current strength, he had no interest in managing these things anymore. All he had to do was to leave everything to them.<br/><br/>After Wang Xian gave his instructions, he returned to the Dragon Palace.<br/><br/>After checking the resources that he had obtained this time, a smile appeared on his face.<br/><br/>These resources were too huge.<br/><br/>Other than the countless corpses, there were countless divine herbs and divine trees.<br/><br/>Wang Xian planted some divine herbs and divine trees around the Dragon Palace and continued to expand the medicinal garden of the Dragon Palace.<br/><br/>The energy contained in the surroundings of the entire dragon palace was much more powerful than the most top-notch grotto-heaven blessed land.<br/><br/>Even the energy density of the special places in the chaos couldn’t compare to that of the Dragon Palace.<br/><br/>After all, there were many valuable resources buried in the underground of the Dragon Palace.<br/><br/>There were countless kinds of powerful godly tree godly grass in the Dragon Palace.<br/><br/>There were more than twenty godly tree godly grass that could rival a heavenly yuan creation realm expert.<br/><br/>The entire Dragon Palace was a sacred place for all the experts.<br/><br/>It was the same even for powerhouses of the Heaven’s origin realm.<br/><br/>“Dragon King, the Chief of the Justice Alliance is here to visit.”<br/><br/>Not long after Wang Xian returned to the Dragon Palace, a minister of the Dragon Palace came to report.<br/><br/>“Oh?”<br/><br/>Wang Xian raised his eyebrows. “Let them in!”<br/><br/>At the same time, the chief of the Justice Alliance and another chaos-level existence of the Justice Alliance, who was located in front of the Dragon Palace, brought over a dozen great dao-level powerhouses of the Justice Alliance.<br/><br/>At this moment, the Alliance leader of the Justice Alliance and the old man beside him stood in front. They sensed the buildings of the Dragon Palace and looked at each other.<br/><br/>They saw shock and fear in each other’s eyes.<br/><br/>As chaos-level powerhouses, they could naturally sense the front of the Dragon Palace Alliance at a glance.<br/><br/>Not to mention the divine herbs and trees, the resources that shocked them.<br/><br/>The buildings of the Dragon Palace were the ones that shocked them.<br/><br/>All of them were heavenly yuan destiny-level treasures.<br/><br/>All of them!<br/><br/>“How… How is this possible? How can there be so many heavenly yuan destiny-level treasures? And there’s even a divine dragon totem on them?”<br/><br/>The leader of the Justice Alliance was shocked.<br/><br/>“Is this how the Dragon King single-handedly destroyed all the powerhouses of the evil sequence faction?”<br/><br/>The chaos-level existences nearby were also shocked.<br/><br/>“Everyone, please come in!”<br/><br/>At this moment, a dragon palace minister with a turtle shell on his back said to them.<br/><br/>“Thank you!”<br/><br/>Although the figure with the turtle shell on his back was only at the peak of the ruler realm, the Alliance Master of the Justice Alliance and the others didn’t dare to be arrogant.<br/><br/>They cupped their hands and followed behind him as they walked inside.<br/><br/>They had no choice. With the prestige of the Dragon King, his strength was too terrifying.<br/><br/>Even if the other party was just a nobody from the Dragon Palace, they didn’t dare to offend him.<br/><br/>In the Dragon King’s Hall, Wang Xian smiled when he saw the experts from the Justice Union coming over.<br/><br/>When the chief of the Justice Union and the rest came in, their gazes landed on Wang Xian.<br/><br/>However, the chief of the Justice Union and the rest didn’t sense Wang Xian’s strength.<br/><br/>Wang Xian sat on top of it and did not feel any energy fluctuations.<br/><br/>Other than the aura of transcendence on his body, he could not sense anything else.<br/><br/>“Is this above Chaos?”<br/><br/>The experts of the Justice Alliance thought to themselves.<br/><br/>“I am the Alliance leader of the Justice Alliance. Greetings, Dragon King!”<br/><br/>“Greetings, Dragon King!”<br/><br/>The Alliance leader of the Justice Alliance lowered his stance and walked to the front. He bowed his head and cupped his hands in greeting.<br/><br/>The rest of the experts immediately followed suit!<br/><br/>“Everyone from the Justice Alliance, you don’t have to be so polite!”<br/><br/>Wang Xian smiled and said to them.<br/><br/>“I don’t dare, I don’t dare. We heard that you have destroyed the evil sequence faction that committed many evil deeds. Our Justice Alliance has suffered greatly over the years. We are here to thank you, Dragon King!”<br/><br/>“Our Justice Alliance has brought some gifts to express our gratitude. We also have to pay our respects to you, Dragon King, who has reached the level above chaos.”<br/><br/>The leader of the Justice Alliance continued.<br/><br/>They placed themselves above their subordinates and spoke very respectfully.<br/><br/>The leader of the Justice Alliance and all the experts of the Justice Alliance also understood that it would be very easy for the current Dragon King to destroy their Justice Alliance.<br/><br/>The Dragon King was an invincible existence in this region.<br/><br/>The king of this region, even if they were not in the same alliance.<br/><br/>But they have to admit it!\t\t\t\t\t\t</div>", "images": {}, "success": true}