{"id": 1551, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15096727.html", "title": "Chapter 4554 - Chapter 4554: 4553 Harvest", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4554 - Chapter 4554: 4553 Harvest</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4554: 4553 harvest<br/><br/>”? ? ? ? What the F * ck? ? ? The Dragon Palace Alliance destroyed the evil sequence faction? Is this for real? This is unbelievable!”<br/><br/>“Even our Justice Alliance leader has confirmed it. How can it be fake? Many lords have gone to the evil sequence faction’s universe to take a look. Now, the Dragon Palace Alliance is rapidly occupying one universe after another!”<br/><br/>“How can the Dragon Palace Alliance destroy the evil sequence faction? The evil sequence faction’s strength is much stronger than ours. Do you have any brothers who know the truth? How can the Dragon Palace Alliance be so fierce?”<br/><br/>“Isn’t there only one Dragon King in the Dragon Palace Alliance? How can they destroy the evil sequence faction? I remember that the Dragon King came to our Justice Alliance back then!”<br/><br/>“According to the latest news, according to our patriarch, the Dragon King’s current strength is unfathomable. Most of the Heaven’s origin creation realm powerhouses in the evil sequence faction were killed by the Dragon King. The Dragon King’s strength has reached an invincible level. Our Alliance Master and the others are prepared to bring a lot of resources to visit the Dragon King!”<br/><br/>“How is this possible? How could the Dragon King alone destroy the Heaven’s origin creation realm powerhouses in the evil sequence faction? This is nonsense, isn’t it? It’s impossible!”<br/><br/>The news of the destruction of the evil sequence faction by the Dragon Palace caused a huge sensation in the Justice Alliance.<br/><br/>Countless disciples were in a daze, unable to believe it.<br/><br/>They kept discussing in their communicators.<br/><br/>Only the Justice Alliance powerhouses who knew the truth took a deep breath, filled with shock.<br/><br/>The Dragon King single-handedly wiped out all the powerhouses from the evil sequence faction?<br/><br/>They were a little unsure, but they were certain that the Dragon King had once defeated four chaos-level existences from the evil sequence faction in the nine-origin universe.<br/><br/>The Dragon Palace seemed to have another chaos-level existence.<br/><br/>However, no matter what, the death of all the heaven-origin creation-level powerhouses in the evil sequence faction, the Dragon Palace Alliance, and the other heaven-origin creation-level powerhouses did not intervene. Only the Dragon King intervened.<br/><br/>This made them fearful.<br/><br/>They knew very well how powerful the evil sequence faction was!<br/><br/>In the past few million years, the black hole teleportation array in the land of origin of the Justice Alliance and the Dragon Palace alliance had been completely built.<br/><br/>This made many powerhouses of the Justice Alliance head over.<br/><br/>However, after they arrived, there were no powerhouses in the land of origin.<br/><br/>This caused many curious champions of the Justice Alliance to head to the evil sequence faction, wanting to learn more about the truth.<br/><br/>Time passed by slowly.<br/><br/>He had completely absorbed all the resources he had obtained from the Mechanical Ascension Universe.<br/><br/>This allowed him to increase his combat power by two chaos levels.<br/><br/>The current him was comparable to seven chaos-level existences.<br/><br/>Of course, his true combat strength was even more terrifying.<br/><br/>If he had the current strength back then, it would be much easier to destroy the evil sequence faction.<br/><br/>The Dragon Palace Alliance would still need at least five million years to conquer the universe of the evil sequence faction.<br/><br/>Wang Xian did not check and continued to increase his strength.<br/><br/>He still had about a thousand corpses of heaven origin creator powerhouses in his hands. From beginner level to chaos level.<br/><br/>The reason why there were so many of them was because after a great dao level powerhouse was killed.<br/><br/>After he was resurrected, his body was usually at the Great Dao level.<br/><br/>After being killed a few more times, he could still maintain his strength at the heaven origin creation level.<br/><br/>This was equivalent to a powerhouse being able to contribute a few corpses to Wang Xian.<br/><br/>These corpses were sufficient for Wang Xian to obtain a terrifying increase in his strength.<br/><br/>Apart from these corpses, there were also the treasures and resources stored by these experts. They were also extremely terrifying!<br/><br/>It could be said that these experts had taken up a quarter of the resources in the entire evil sequence camp universe.<br/><br/>As for the remaining three-quarters, there were still many paradises and blessed lands that were difficult to place on one’s person.<br/><br/>“Dragon King, we have already taken over all the universes in the evil sequence camp!”<br/><br/>“An lie has set up devil spirit altars in the important grotto-heaven, blessed land, and precious land. We have brought back all the gains!”<br/><br/>“We are preparing to build some black hole teleportation formations here. When the time comes, we will be able to get the other disciples to come here quickly!”<br/><br/>Five million years passed in the process of Wang Xian’s ascension.<br/><br/>On this day, Prime Minister Gui sent him a message.<br/><br/>Wang Xian opened his eyes and looked at the message. A smile appeared on his face!<br/><br/>He looked at the resources in front of him.<br/><br/>In five million years, he had increased his strength by another four chaos levels. Now, it was equivalent to eleven chaos levels.<br/><br/>The resources that he had consumed were only one-fourth. If he absorbed all these resources, he would be able to increase his combat strength by twelve chaos levels.<br/><br/>Furthermore, these resources were only a small portion of the entire evil sequence faction.<br/><br/>“If I absorbed most of these resources, I would be invincible!”<br/><br/>A smile appeared on Wang Xian’s face.<br/><br/>His body moved and in the next moment, a black hole appeared in front of him.<br/><br/>He entered the black hole directly.<br/><br/>On the other side of the black hole was Prime Minister Gui.<br/><br/>Apart from Prime Minister Gui, there were also over a hundred heaven origin creator powerhouses from the Dragon Palace and the members of the Dragon Palace Alliance.<br/><br/>At this moment, they were in the center of the evil sequence alignment camp, in the evil sequence universe.<br/><br/>The sudden arrival of Wang Xian stunned Prime Minister Gui for a moment. He immediately bowed.<br/><br/>“Greetings, Dragon King!”<br/><br/>Prime Minister Gui shouted!<br/><br/>“Greetings, Dragon King!”<br/><br/>All the members of the Dragon Palace Alliance in the surrounding area focused their eyes. Their faces were filled with respect as they bowed loudly.<br/><br/>All of them bowed with exceptional respect!<br/><br/>This time, they were filled with deep respect for the Dragon King from the bottom of their hearts.<br/><br/>Under the circumstance that they did not make a move, the powerhouses of the Dragon Palace did not make a move either.<br/><br/>Just the Dragon King alone had destroyed all the powerhouses from the evil sequence faction.<br/><br/>What kind of great power was this?<br/><br/>This made them feel a little dazed and incredulous.<br/><br/>Just how far had their Dragon King reached?<br/><br/>“Hehe, Get Up!”<br/><br/>Wang Xian waved his hand.<br/><br/>The increase in his strength once again allowed him to pursue with the Netherworld Dragon. In an instant, he crossed countless miles and arrived in front of Prime Minister Gui!<br/><br/>“Dragon King, we are almost done with the universe of the evil sequence faction. Of course, if we want to completely control this place and occupy this paradise, we need to build a black hole teleportation array!”<br/><br/>“In addition, Dragon King, we need you to decide whether or not we need to create humans here!”<br/><br/>Prime Minister Gui continued!<br/><br/>“HMM, let’s set up the black hole teleportation formation first and connect this place to our Dragon Palace Alliance.”<br/><br/>Wang Xian nodded. “Then, let’s discuss how to develop this place.”\t\t\t\t\t\t</div>", "images": {}, "success": true}