{"id": 1550, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15096726.html", "title": "Chapter 4553 - Chapter 4553: 4552 Reaped The Rewards", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4553 - Chapter 4553: 4552 Reaped The Rewards</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4553: 4552 reaped the rewards<br/><br/>“The evil sequence faction is about to be completely destroyed!”<br/><br/>“Hiss, this Dragon King’s strength, this… this is simply too terrifying. The entire evil sequence faction, four chaos-level existences were actually destroyed by this Dragon King. How did he do it?”<br/><br/>“It’s too terrifying. However, the destruction of the evil sequence faction is a great thing for our Justice Alliance.”<br/><br/>“It seems that we have to be even more friendly with that Dragon King. In fact…”<br/><br/>In a corner of the domain of the evil sequence faction, the leader of the Justice Alliance and the others were looking at the information one by one, their faces filled with shock.<br/><br/>They could even destroy four chaos-level existences.<br/><br/>If the Dragon Palace Dragon King were to deal with them, the Justice Alliance’s outcome would be even worse than the evil sequence faction.<br/><br/>Although they were now cooperating with the Dragon Palace Alliance.<br/><br/>But this cooperation was only a small one.<br/><br/>In the past, the son of the leader of the Justice Alliance had a conflict with the Dragon King of the Dragon Palace.<br/><br/>Although this misunderstanding had been resolved.<br/><br/>But they couldn’t guarantee that the Dragon King wouldn’t attack the Justice Alliance.<br/><br/>After all, this was related to a huge amount of resources.<br/><br/>With the strength of the Dragon King of the Dragon Palace, wouldn’t it be easy for them to destroy the Justice League?<br/><br/>They had already decided that they must build a good relationship with the Dragon Palace and that Dragon King.<br/><br/>The two of them looked at each other and decided to prepare some gifts and resources to congratulate the Dragon Palace League for destroying the evil sequence alignment camp.<br/><br/>Wang Xian did not know about the leader of the Justice League and the others.<br/><br/>At this moment, Wang Xian moved and arrived beside the evil sequence universe.<br/><br/>He had laid down quite a number of devil spirit altars here so that he could arrive in an instant.<br/><br/>“It’s time to reap the rewards.”<br/><br/>Wang Xian had a smile on his face as he quickly flew into the evil sequence universe.<br/><br/>In this universe, there were the corpses of the Lord of calamity.<br/><br/>Wang Xian’s curse killed the Lord of Calamity and the others immediately after they were resurrected.<br/><br/>Their corpses naturally remained where they were.<br/><br/>Wang Xian could not let these go.<br/><br/>Especially the corpses of the four chaos-level powerhouses.<br/><br/>Every single one of them was an extremely terrifying resource to the Dragon Palace and to him.<br/><br/>It could greatly increase his strength.<br/><br/>When he arrived at the lair of the evil sequence universe lord of disaster, Wang Xian collected all of his corpses and left behind a demonic altar. He did not stay here for long.<br/><br/>There were still treasures here, but there were more important treasures waiting for him.<br/><br/>To avoid any accidents, he first collected the corpses of thousand tentacles, the old man with the bamboo hat, and the axe sword demon.<br/><br/>Furthermore, his curses were not completely over yet. He was hurrying on his way, curses, and collecting the corpse resources at the same time. To Wang Xian, this was simply a treasure-hunting trip!<br/><br/>As for all the powerhouses from the evil sequence camp, after the thread of life was severed and the four chaos-level powerhouses were killed.<br/><br/>They were in complete despair.<br/><br/>One by one, they fled into the distance in an extremely terrifying frenzy.<br/><br/>They fled into the chaos.<br/><br/>They wanted to escape from the Dragon King’s pursuit and escape from the Dragon King’s curses.<br/><br/>However, it was all in vain.<br/><br/>A few hundred years later, all the powerhouses in the Heaven’s origin realm were in despair!<br/><br/>They had all been killed by the curse several times and their realms had already fallen.<br/><br/>In fact, there were no powerhouses in the Heaven’s origin realm in the entire evil sequence camp.<br/><br/>However, Wang Xian had reaped a lot in the past few hundred years.<br/><br/>He kept these corpses and instantly took all the treasures and resources in their lair.<br/><br/>But, you know, trying to put all their bodies away.<br/><br/>It will take Wang Xian tens of thousands of years.<br/><br/>The field of the evil sequence camp is vast.<br/><br/>It’s a lot bigger than the Justice League.<br/><br/>They occupy hundreds of universes.<br/><br/>It’s a scary amount of resources.<br/><br/>Just like the Master of disaster, he alone controls dozens of universes.<br/><br/>In addition to these resources, Next, the Dragon Palace will also receive thousands of Heaven’s destiny breakthrough quota.<br/><br/>The competition for the evil sequence alignment camp was extremely intense!<br/><br/>They would occupy all the powerhouses, restrict their disciples, and prohibit them from breaking through to the Heaven’s fate realm.<br/><br/>They were afraid that they would threaten their position.<br/><br/>Therefore, there were hundreds of the evil sequence alignment camp in the universe, but there were only three to four hundred heaven’s fate realm powerhouses.<br/><br/>When Wang Xian was harvesting the heaven’s fate realm powerhouses from the evil sequence alignment camp.<br/><br/>The Dragon Palace Alliance had just launched their twentieth universe attack against the evil sequence alignment universe.<br/><br/>This was under the situation where the powerhouses from the Dragon Palace Alliance were attacking separately.<br/><br/>It couldn’t be helped. A universe was indeed too big.<br/><br/>It would take a long time to collect the resources of a universe.<br/><br/>At this rate, it would take tens of millions of years to take over the entire evil sequence alignment and hundreds of universes.<br/><br/>However, the Dragon Palace Alliance was not in a hurry.<br/><br/>Now, the members of the Dragon Palace Alliance were extremely excited as they looted the treasures. All of them were in high spirits and were abnormally excited.<br/><br/>This was equivalent to treasure hunting!<br/><br/>Wang Xian split five clones to speed up the harvesting process.<br/><br/>Time was also passing by quickly.<br/><br/>A million years later, he collected the corpses of all the heaven origin creation stage powerhouses in the evil sequence faction and took all their treasures.<br/><br/>Wang Xian returned to the Dragon Palace immediately.<br/><br/>As for the matter regarding the evil sequence faction, he would leave it to Prime Minister Gui and the rest.<br/><br/>Although the remaining resources were still extremely huge, to Wang Xian, all the important resources were already in his hands.<br/><br/>The harvest this time around shocked even him.<br/><br/>He didn’t dare to imagine it.<br/><br/>After all, it was the collection of three to four hundred powerhouses and all their treasures.<br/><br/>“I haven’t completely digested the resources I obtained from the Mechanical Ascension Universe. Now, I have obtained so many resources. If I absorb all of them, how far will I go?”<br/><br/>Wang Xian mumbled as his eyes sparkled.<br/><br/>If I absorb all of them, wouldn’t I be able to rival twenty to thirty existences of the primal chaos level?<br/><br/>When the time comes, would he be able to kill a powerhouse of the chaos level in an instant?<br/><br/>Even if four to five powerhouses of the chaos level were to join forces, he would be able to kill them in an instant!<br/><br/>That would mean that he was truly invincible!<br/><br/>It was no longer possible to differentiate them based on their levels!<br/><br/>“Hehe, let’s continue to absorb the remaining resources from the Mechanical Ascension Universe first. After the Dragon Palace Alliance has taken care of the matter regarding the evil sequence camp.”<br/><br/>Wang Xian thought to himself. Then, he waited in the Dragon Palace.<br/><br/>When the universes of the evil sequence camp were taken over one by one, the news of the evil sequence camp being completely destroyed by the Dragon Palace Alliance a few million years later had also spread to the Justice Alliance!<br/><br/>When all the strong disciples of the Justice Alliance received this news, they were all dumbfounded and filled with shock!\t\t\t\t\t\t</div>", "images": {}, "success": true}