{"id": 1557, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15170253.html", "title": "Chapter 4560 - Chapter 4560: At The 4559 World Celebration", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4560 - Chapter 4560: At The 4559 World Celebration</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4560: At the 4559 World Celebration<br/><br/>The birth of the dragon princesses made the entire dragon palace a joyous occasion.<br/><br/>Thirteen little guys were just born and could barely walk.<br/><br/>Although they possessed powerful energy, they could not control it yet.<br/><br/>However, the group of little guys were not ordinary creatures after all. In less than two days, they would call their parents, parents, and queen.<br/><br/>Wang Xian and the rest deliberately suppressed the growth of the little ones.<br/><br/>Otherwise, they might become big and young within a few years.<br/><br/>After all, their starting point was too high.<br/><br/>“Come, come. Daddy will give you some little friends. Each of you can choose one. In the future, all of you will grow up together.”<br/><br/>On the fifth day, Wang Xian brought along seven Great Dao level existences from the void Cicada Chaos Behemoth tribe.<br/><br/>The other five great dao-level chaotic behemoths had already formed a contract with their children.<br/><br/>These great dao-level chaotic behemoths had already gained sentience.<br/><br/>They were also gifts that Wang Xian had prepared for his children. They were also pets that accompanied them.<br/><br/>Of course, these pets were all great dao-level existences.<br/><br/>After gaining sentience, they would bear the responsibility of protecting their children.<br/><br/>It was enough for them to protect their children on the level of the Great Dao.<br/><br/>After all, in the Dragon Palace, other than him, there were only the Nine Heavens Divine Roc and the leader of the empty cicada clan!<br/><br/>“Thank you, daddy!”<br/><br/>The little ones picked their companions happily.<br/><br/>The thirteen experts on the level of the Great Dao were also very excited and expectant.<br/><br/>After all, they could be said to be the companion beasts of the Dragon King’s sons and daughters.<br/><br/>The Dragon King was an invincible existence.<br/><br/>However, he could easily kill an existence at the chaos level.<br/><br/>In the future, the strength of these dragon princesses at the Great Dao level might just be the beginning.<br/><br/>They might not even be able to reach the chaos level.<br/><br/>Most importantly, they could follow the dragon princesses and enjoy good food and drinks. No one would dare to provoke them!<br/><br/>“Hehe!”<br/><br/>Wang Xian looked at them and smiled.<br/><br/>Time passed day by day again.<br/><br/>Wang Xian, Guan Shuqing, and the rest accompanied the little ones every day.<br/><br/>They taught them.<br/><br/>As time approached, the strong disciples of the Justice Alliance and the Dragon Palace Alliance began to rush towards the nine-origin universe.<br/><br/>At the same time, at the ten-day federation, at the Giant Beast Alliance.<br/><br/>The powerful disciples were also rushing towards the nine-origin universe.<br/><br/>However, if they wanted to get there, they needed to pass through the black hole teleportation array and reach the location below the land of origin.<br/><br/>“Hehe, everyone from the ten-day Federation Alliance, let’s Go together to celebrate the Dragon King.”<br/><br/>“We are in the same area. There is no need for us to continue fighting in the future. Peace is the most important thing. Let’s develop the chaos that is even further away!”<br/><br/>In a void space, the Beast Alliance and the Disciples of the 10 Suns Federation met.<br/><br/>This time, the Beast Alliance sent four primal chaos level experts along with the rest of the disciples.<br/><br/>There were thousands of disciples.<br/><br/>The weakest was at least a universe overlord level 8!<br/><br/>The four primal chaos level experts of the Beast Alliance smiled and said to the two primal chaos level experts of the 10 suns federation.<br/><br/>“Okay!”<br/><br/>The ten-day federation powerhouse nodded lightly.<br/><br/>They were no match for the Behemoth Alliance.<br/><br/>Although they had tied up the Dragon King now, the relationship between the Dragon King and them was, after all, only a master-disciple relationship with Wu Tongming.<br/><br/>They couldn’t just ask Wu Tongming to find his master whenever there was a problem?<br/><br/>Now that the Behemoth Alliance was willing to reconcile and live in peace, they wouldn’t refuse.<br/><br/>Furthermore, this wasn’t the first time they were discussing such a matter!<br/><br/>“Hehe, many thanks to everyone from the Ten Days Alliance for letting bygones be bygones.”<br/><br/>The experts from the Beast Alliance also lowered their attitude and said with a smile.<br/><br/>“The grudges of the universe, sooner or later, will either be resolved, or we’ll die. Now that we can reconcile, it’s a good thing for us!”<br/><br/>Wu Tongming’s ancestor said with a smile.<br/><br/>The other party gave them a way out, and they also wanted this way out!<br/><br/>“Haha, you’re right. Next, we’ll focus on digging further into the chaos.”<br/><br/>The four leaders of the Behemoth Alliance said with a Smile!<br/><br/>Under the conversation of the experts of the two alliances, they quickly arrived in front of the black hole.<br/><br/>“Let’s go in. My master sent someone to pick us up from the other side of the black hole.”<br/><br/>Wu Tongming looked at the black hole and said with a smile!<br/><br/>The experts of the two forces immediately entered the black hole.<br/><br/>Buzz! Buzz<br/><br/>Because the other side of the black hole was under the land of origin.<br/><br/>The dragon palace hadn’t completely cleaned up the area under the land of origin.<br/><br/>There were also a few primal chaos level beasts and a large number of heaven origin creation level existences here.<br/><br/>Therefore, Wang Xian sent the Nine Heavens Divine Roc and the leader of the empty cicada tribe to welcome them.<br/><br/>“Everyone, this is a rather dangerous place. There are a few primal chaos level beasts here. Therefore, the Dragon King has sent us here. Follow us!”<br/><br/>The Nine Heavens Divine Roc looked at them and said indifferently.<br/><br/>“Oh? Senior Nine Heavens Divine Roc’s strength has recovered quite a bit!”<br/><br/>Whether it was Wu Tongming’s ancestor or the experts of the Primal Chaos Giant Beast Alliance, they felt the pressure coming from the Nine Heavens Divine Roc. Their hearts trembled as they said.<br/><br/>They knew that the Nine Heavens Divine Roc in front of them was once a peak primal chaos existence.<br/><br/>At his peak, it was no problem for him to fight against three primal chaos existences.<br/><br/>Now, he had obviously recovered a lot!<br/><br/>“Hehe, not worth mentioning!”<br/><br/>The Nine Heavens Divine Roc smiled faintly.<br/><br/>“Don’t resist, let’s Go!”<br/><br/>The leader of the empty cicada clan looked at them, flapping his wings slightly as he said.<br/><br/>“Alright!”<br/><br/>All the expert disciples of the Ten Days Federation and the Giant Beast Alliance immediately replied.<br/><br/>They could also sense that this existence that contained powerful space power was also a primal chaos level existence.<br/><br/>They were not surprised that the Dragon King had two such terrifying existences.<br/><br/>The leader of the empty cicada clan led them quickly to the top of the land of origin.<br/><br/>Then, they were teleported to the nine-origin universe through the black hole teleportation array above!<br/><br/>In a square in front of the 9-origin universe Dragon Palace, there was a black hole.<br/><br/>In the black hole, the Great Beings of the 10-day federation and the Giant Beast Alliance appeared.<br/><br/>The moment they appeared, they immediately felt an incomparable energy filling their surroundings.<br/><br/>This majestic energy was stronger than any treasure land or holy land they had ever been to.<br/><br/>They were surrounded by all kinds of divine mountains and rivers, and all kinds of precious divine herbs and trees were like weeds in the grassland.<br/><br/>There were more than ten buildings in front of them, and each of them was exuding charm.<br/><br/>The aura of a heavenly fate supreme treasure could be seen at a glance.<br/><br/>All the disciples of the ten-day federation and the Giant Beast Alliance who were here for the first time were stunned.<br/><br/>Even the six chaos-level experts were the same!\t\t\t\t\t\t</div>", "images": {}, "success": true}