{"id": 1563, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15174038.html", "title": "Chapter 4566 - Chapter 4566: 4565 In The Center Of Chaos", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4566 - Chapter 4566: 4565 In The Center Of Chaos</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4566: 4565 in the center of Chaos<br/><br/>Time passed by slowly. Hundreds of millions of years passed by quickly.<br/><br/>After 100 million years, the bunch of little guys had grown up.<br/><br/>All of them were young and young.<br/><br/>During these 100 million years, the major powers in the surrounding areas of the nine-origin universe were calm and peaceful.<br/><br/>Even during the calamity, everything was still peaceful.<br/><br/>Because of Wang Xian’s words, the conflict here had completely disappeared.<br/><br/>Even the ten-day federation and the Behemoth Alliance, which were once sworn enemies, had started to communicate with each other.<br/><br/>They began to put aside their past grudges and explore the unknown chaotic universe together.<br/><br/>No one knew how big the chaos was. Even if Wang Xian could match up to 40 chaos-level combat strength, he could still obtain any information with his divination ability.<br/><br/>In the span of 100 million years, the number of the strong disciples of the Dragon Palace had increased by more than 300.<br/><br/>The Dragon Palace still had more than 700 spots for the strong disciples of the Heaven’s origin.<br/><br/>This allowed the strength of the Dragon Palace to increase at a terrifying speed.<br/><br/>The universe of the evil sequence faction had already been managed by the Dragon Palace.<br/><br/>The Dragon Palace didn’t lack resources, and they didn’t lack grotto-heavens and blessed lands for cultivation.<br/><br/>In addition, with Wang Xian preaching from time to time for a few years, the breakthrough of the disciples of the Dragon Palace was extremely fast.<br/><br/>In another 100 to 200 million years, the number of powerhouses in the Heaven’s origin realm in the Dragon Palace would probably reach more than 1000.<br/><br/>This was an extremely terrifying number.<br/><br/>One had to know that in a universe, the number of powerhouses in the Heaven’s origin realm could reach 10. This was already considered a relatively powerful existence.<br/><br/>What was the concept of more than a thousand?<br/><br/>It was a hundred times the number.<br/><br/>However, Wang Xian no longer cared much about these people.<br/><br/>Everything in the Dragon Palace was left to Prime Minister Gui and the rest to handle.<br/><br/>Prime Minister Gui had followed him all the way here. He was dedicated to the Dragon Palace and was impartial. He was also respected by all the powerful disciples in the Dragon Palace.<br/><br/>Wang Xian could rest assured that he would be in charge of the entire Dragon Palace.<br/><br/>Wang Xian would only make a decision when it came to important decisions.<br/><br/>He spent the rest of his time playing with his wife and children.<br/><br/>“Dragon King, I have explored a new realm.”<br/><br/>On this day, the Divine Roc of the Nine Heavens rushed over. He bowed to Wang Xian and reported a piece of news.<br/><br/>The Divine Roc of the Nine Heavens had already recovered to the peak of the primal chaos.<br/><br/>However, the obsession in his heart was still to break through to above the primal chaos.<br/><br/>Wang Xian now understood that it was no longer enough to rely on his own efforts to break through to the realm above chaos.<br/><br/>Instead, he needed a strong opportunity.<br/><br/>An ultimate treasure like the chaos gem.<br/><br/>In addition, there had to be a way to absorb this ultimate treasure.<br/><br/>In Wang Xian’s opinion, the probability of this was too low.<br/><br/>It was possible that a thousand experts at the peak of Chaos would obtain an ultimate treasure that could allow them to break through. However, during the process of absorbing the ultimate treasure, it was possible that 999 of them would die in the future.<br/><br/>Thinking back to the time when Wang Xian absorbed the ball of chaos, it caused the entire tree of chaos to wither.<br/><br/>How much energy did the tree of chaos contain?<br/><br/>It was no lower than that of the experts at the chaos realm.<br/><br/>Other than the endless energy, there was also the reason why he possessed all sorts of attributes.<br/><br/>If the Divine Roc of the Nine Heavens wanted to break through, he first had to find the treasure.<br/><br/>Wang Xian also ordered him to look for it. In addition, he would also get the experts of the Dragon Palace to pay attention to it.<br/><br/>The Divine Roc of the Nine Heavens had lived in the chaos for too long. He had been to many places.<br/><br/>This time, he flew for tens of millions of years and found a new territory.<br/><br/>The so-called new territory was a place with a large number of universes.<br/><br/>“Oh? Is there a lot of universes there?”<br/><br/>Wang Xian raised his eyebrows and asked curiously.<br/><br/>The members of the Dragon Palace Alliance and the powerhouses of the Justice Alliance were also looking for a new territory and treasures.<br/><br/>However, they had been searching for 50 million years and still couldn’t find anything.<br/><br/>“There are quite a number of them. That area is also unusually prosperous. There are many powerhouses and it is considered peaceful. Also, that area seems to be connected to another prosperous area.”<br/><br/>The Divine Roc of the Nine Heavens said.<br/><br/>“Is that so?”<br/><br/>Wang Xian nodded and looked at him. “If we were to create a black hole teleportation formation, how long would it take to reach that area?”<br/><br/>“At least 30 black hole teleportation formations would be needed. That place is very far away.”<br/><br/>30 black hole teleportation formations were already able to teleport to a very, very far place.<br/><br/>From the Dragon Palace Alliance to the Justice Alliance, they only needed two black hole teleportation formations.<br/><br/>“There are too many. The resources required are also not small. Let’s get an lie to build some demon spirit altars first.”<br/><br/>Wang Xian said.<br/><br/>“Alright, Dragon King. I will return to that area and see if I can find any special chaos treasures.”<br/><br/>The Divine Roc of the nine heavens nodded and left.<br/><br/>“Father, come out and play. We have found another fun place.”<br/><br/>At this moment, a 1.7 m girl with an innocent smile flew over. She held Wang Xian’s hand and said happily.<br/><br/>“You’re already so old. You only know how to play.”<br/><br/>Wang Xian stroked the head of the girl with a smile on his face.<br/><br/>He followed the girl and entered a teleportation cave.<br/><br/>Guan Shuqing and the rest, as well as a group of children, were playing in front.<br/><br/>“Girl, you go play first.”<br/><br/>Wang Xian stroked his daughter’s head lovingly. With a thought, he called the group of girls over.<br/><br/>“Xiao Xian, what’s the matter?”<br/><br/>The group of girls flew over and asked with a smile.<br/><br/>Now that they were mothers, their faces carried the radiance of motherhood. They looked more mature and charming than before.<br/><br/>“It’s not a big deal to let them play all day long. It’s time for the children to temper themselves. They will never grow up by our side.”<br/><br/>Wang Xian spoke.<br/><br/>“Yes, indeed. We have suppressed their cultivation level for a long time. They will grow up forever without experiencing any hardships. Xiao Xian, do you have any ideas?”<br/><br/>Guan Shuqing and the rest, who had been raising their children for 100 million years, knew that it was time to let the children go out to temper themselves.<br/><br/>They had discussed this matter with each other a long time ago.<br/><br/>Currently, the 13 children were still at the peak of the Dominator realm.<br/><br/>Firstly, they did not put in much effort in their cultivation. In their opinion, it was useless to be strong or weak.<br/><br/>This was because they had an invincible father. Regardless of whether they were at the Great Dao level or even the chaos level, they had to address them respectfully as the princess and crown prince.<br/><br/>Therefore, they were more playful and did not cultivate much.<br/><br/>Secondly, Wang Xian and the rest did not force them to break through.<br/><br/>What was the use of breaking through if their temperament wasn’t good?<br/><br/>Although Wang Xian and the rest could protect them for a lifetime, they still had to grow up.<br/><br/>They had to shoulder the responsibility independently.<br/><br/>Wang Xian and the rest had already given them a wonderful childhood.<br/><br/>They had to face their own choices for the rest of their lives.<br/><br/>“The nine heavens found an area which is more prosperous. There are many universes and many powerhouses. Throw them there to train for a few hundred million years.”<br/><br/>Wang Xian said to Guan Shuqing and the rest.<br/><br/>It was time to let these little guys out.<br/><br/>Putting aside the path he had taken in the past, at least he knew when he encountered difficulties and solved them independently.<br/><br/>Only then could he become a true powerhouse.\t\t\t\t\t\t</div>", "images": {}, "success": true}