{"id": 1569, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15187108.html", "title": "Chapter 4572 - Chapter 4572: 4571 Chaos Supreme Treasure! Down", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4572 - Chapter 4572: 4571 Chaos Supreme Treasure! Down</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4572: 4571 Chaos Supreme Treasure! down<br/><br/>The energy contained in this wind bead was extremely huge.<br/><br/>If Wang Xian absorbed it, he would be able to increase his realm by at least five levels of chaos.<br/><br/>This was an extremely terrifying amount of resources.<br/><br/>However, Wang Xian was not prepared to absorb it. Such a treasure that could only be encountered by chance but not sought after was something that could only be found in one region. It was better to keep it.<br/><br/>In the future, if an expert from the Dragon Palace reached this stage, or if one of the thirteen little ones reached this stage ahead of time and gave him the treasure, he would be able to break through to the realm above chaos.<br/><br/>“This kind of treasure should be called the most precious treasure of Chaos.”<br/><br/>Wang Xian mumbled to himself. A smile appeared on his face as he put it away.<br/><br/>Following that, he looked at the dozen wind elemental gods around him.<br/><br/>After absorbing these elemental gods, Wang Xian would be able to increase his cultivation level by three to four levels.<br/><br/>With a thought, he sat cross-legged in the middle. He waved his hand and grabbed an elemental god to start absorbing.<br/><br/>Buzz Buzz Buzz<br/><br/>Buzz Buzz Buzz<br/><br/>Waves of energy entered Wang Xian’s body and rapidly converted into his own energy.<br/><br/>Time passed quickly.<br/><br/>Tens of millions of years passed in a blink of an eye.<br/><br/>During these tens of millions of years, Wang Xian had been absorbing the energy in this place.<br/><br/>However, compared to the powerhouses in this lawless universe, they did not dare to step into the lawless land after that day.<br/><br/>Back then, that one move had instantly killed more than a hundred of them, the invincible powerhouse had left them feeling extremely shocked.<br/><br/>They were extremely terrified!<br/><br/>Wang Xian’s training this time was very smooth. After tens of millions of years, he had easily absorbed all the elemental gods.<br/><br/>His strength had improved quite a lot again.<br/><br/>Standing up straight, Wang Xian scanned his surroundings.<br/><br/>The energy in the entire special area had decreased by a lot.<br/><br/>However, due to the uniqueness of this place, a second wind bead might be born with time and time.<br/><br/>However, this might take up to ten billion or even a hundred billion years.<br/><br/>Wang Xian flew out of the lawless land. A few months later, he came to the center of the Lawless universe and found the chaos-level powerhouse of Patriarch Five Yang.<br/><br/>Wang Xian did not kill him and did not communicate with him.<br/><br/>In fact, Patriarch Five Yang did not even sense Wang Xian’s arrival and was directly transferred by Wang Xian to retrieve the memories in his mind.<br/><br/>Wang Xian wanted to obtain information about the surrounding areas from Patriarch Five Yang.<br/><br/>However, he had really obtained information about another area from Patriarch Five Yang.<br/><br/>After reading this information, he raised his eyebrows.<br/><br/>“Bang!”<br/><br/>Because he had obtained patriarch five Yang’s memories, he knew that this fellow was not a good person. After casually crushing his body, Wang Xian left once again.<br/><br/>At this point, the poor patriarch five Yang didn’t even know how he died and was resurrected again.<br/><br/>After being resurrected, Patriarch Five Yang trembled and decided to stay in seclusion until the end of the calamity.<br/><br/>“According to the memories of Patriarch Five Yang, there is an area further away where he would need about 50 million years to fly by himself. There are many universes and powerful forces there.”<br/><br/>“Furthermore, the strength of that area is much stronger than the lawless universe.”<br/><br/>Based on his memories, Wang Xian moved and immediately flew in that direction.<br/><br/>Patriarch Five Yang needed to fly for 50 million years. An ordinary heaven origin creator would need to fly for 500 to 600 million years.<br/><br/>With Wang Xian’s speed, he would only need a few hundred thousand years to reach the place.<br/><br/>This was already very fast for the huge chaos!<br/><br/>A few hundred thousand years passed in a blink of an eye in the chaos.<br/><br/>On the way, Wang Xian also encountered some treasures. However, these treasures were all at the level of the Ordinary Heaven’s origin creation.<br/><br/>The current him was not very interested in them.<br/><br/>When Wang Xian arrived at another region, he looked at the universe in front of him and immediately flew over.<br/><br/>Sensing the existence of a heaven’s origin creator, Wang Xian did the same. He flew over directly to check his memories and information.<br/><br/>When Wang Xian arrived at the special domain of this chaotic region based on the memories of this powerhouse.<br/><br/>He realized that the chaos supreme treasure in this special domain no longer existed!<br/><br/>“Based on the situation in this special domain, the Chaos Supreme Treasure should be born. Has It been taken away by other powerhouses?”<br/><br/>Wang Xian looked at this special region.<br/><br/>Using his divination ability, he deduced that there was a 100% chance that the Chaos Supreme Treasure had been born here.<br/><br/>But now, it seemed that it had been taken away by powerhouses.<br/><br/>He moved and flew towards the location of the strongest faction in this region.<br/><br/>In this region, the strongest faction was called the netherworld.<br/><br/>This faction could be said to be an overlord-level existence.<br/><br/>In the entire faction, there were four chaos-level powerhouses.<br/><br/>With the strength of their faction, they indeed had the strength to take away the Chaos Treasure Here!<br/><br/>“There are two chaos-level existences in the front.”<br/><br/>Wang Xian sensed it and flew towards their location.<br/><br/>In front of a long river, two chaos-level powerhouses were fishing leisurely.<br/><br/>There were dozens of disciples and grand-level powerhouses’disciples around them!<br/><br/>“Everyone, sorry to disturb you!”<br/><br/>Wang Xian arrived and appeared in front of them silently as he said faintly.<br/><br/>The pupils of the two elders who were fishing contracted slightly as they looked at Wang Xian.<br/><br/>The surrounding powerhouses’disciples also focused their eyes and looked up.<br/><br/>“My friend, May I know what business you have?”<br/><br/>A primal chaos expert stood up, cupped his hands and asked.<br/><br/>The mysterious man in front of them was able to silently arrive at a hundred meters away from them, causing them to feel shocked.<br/><br/>This kind of strength far surpassed them.<br/><br/>“You came from afar to look for some primal chaos supreme treasures. I See That Your Primal Chaos Supreme Treasures have already been obtained by someone. I wonder who obtained them?”<br/><br/>“According to my divination, this chaos treasure is not with you.”<br/><br/>Wang Xian looked at them and said calmly!<br/><br/>“Chaos Treasure?”<br/><br/>The eyes of the two chaos-level powerhouses focused. When they heard Wang Xian’s words, the fear on their faces deepened.<br/><br/>“It is the core treasure in this special area of yours.”<br/><br/>Wang Xian explained to them!<br/><br/>“The treasure there?”<br/><br/>An elder at the primal chaos level mumbled, then, he said with a more respectful tone, “Senior, the treasures in our special region have indeed been obtained by other experts. They are experts from other regions. They are very strong and have existences that we can not defend against.”<br/><br/>“They took away the treasures in our special region. There is nothing we can do.”<br/><br/>“Oh?”Upon hearing their words, Wang Xian raised his eyebrows slightly. “Do you guys know where they came from?”<br/><br/>“In the far north of us, there is a very bright place. There are many existences on the level of chaos there. It is rumored that there are existences above the level of chaos.”<br/><br/>The elder on the level of chaos replied!\t\t\t\t\t\t</div>", "images": {}, "success": true}