{"id": 1560, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15171970.html", "title": "Chapter 4563 - Chapter 4563: At The 4562 Golden Age Banquet", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4563 - Chapter 4563: At The 4562 Golden Age Banquet</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4563: At the 4562 Golden Age banquet<br/><br/>“Made from the flesh of a Great Dao level Chaos Behemoth?”? Hiss? “This?”? “This…”the chaos behemoths did not come back to life. When they died, they were truly dead. Their flesh and blood were the origin of their flesh and blood. Even a bite of their flesh and blood was a rare treasure for a ruler-level expert. Who would have thought that we would be lucky enough to have a bite of the flesh of a great dao level space behemoth today!”<br/><br/>“Hiss, my God, aren’t the arms of the Dragon Palace too terrifying? How could they casually take out such a priceless treasure and treat it as a banquet? And they even took out the flesh and blood of at least five Great Dao level chaos behemoths at once?”<br/><br/>“What kind of concept is that? Great Dao level chaos behemoths are basically at the top of the pyramid. Even our chaos-level lords would find it very difficult to hunt them down.”<br/><br/>“Yes, it’s very difficult for us chaos-level masters to hunt chaos behemoths at this level. If we go to the origin universe of the Chaos Behemoths’lair and kill too many chaos behemoths, we will attract a large number of chaos behemoths to besiege us. Even chaos-level masters won’t be able to withstand it.”<br/><br/>“Is this the work of the Dragon King of the Dragon Palace? Everyone gets a big piece of delicious food. Oh My God, we have made a fortune this time!”<br/><br/>The experts of the Justice Alliance, the Ten Days Federation, the Behemoth Alliance, and the Dragon Palace Alliance were all stunned when they saw the delicious food.<br/><br/>For them, it was not just food, but a huge opportunity.<br/><br/>It was the same for some experts who had just entered the Heavenly Yuan blessed realm!<br/><br/>“Disciples of the Dragon Palace Alliance, to congratulate the Dragon King on his birth of a dragon child, I will perform a dance with a breeze.”<br/><br/>At this moment, a group of disciples in the ruler realm stepped onto the stage to add some luster to the banquet.<br/><br/>Some beautiful female disciples danced.<br/><br/>The special dance was indeed pleasing to the eye.<br/><br/>Many universes had their own styles, and some special styles were very attractive.<br/><br/>“Good!”<br/><br/>The group of powerful disciples enjoyed the dance while eating the extremely precious delicacies.<br/><br/>After the dance, some members of the dragon palace clapped and cheered.<br/><br/>The strong disciples from other forces gradually let go of their restraints and clapped and cheered.<br/><br/>The atmosphere became more and more lively.<br/><br/>“It’s very nice to watch. There’s a reward.”<br/><br/>Guan Shuqing and the other girls were very happy at this moment.<br/><br/>Looking at the girls who had finished dancing, a smile appeared on their faces.<br/><br/>They waved their arms and precious treasures flew toward them.<br/><br/>These treasures were helpful for breaking through the Heavenly Yuan realm.<br/><br/>These treasures were undoubtedly rare treasures for the masters of the weak universes.<br/><br/>“Thank you, Empress Long!”<br/><br/>The girls thanked her happily.<br/><br/>The resources of the Dragon Palace were extremely huge at the moment.<br/><br/>Furthermore, the gifts given by the four forces during the banquet held by the Dragon Palace were also worth a lot.<br/><br/>Putting everything else aside, the value of the items given by the Justice Alliance, the 10-DAY Federation Alliance, and the Behemoth Alliance were equivalent to four to five ultimate treasures of the Heaven’s origin.<br/><br/>Now that the Dragon King’s strength was so terrifying, they also wanted to please the Dragon King and the Dragon Palace.<br/><br/>Naturally, they were willing to spend a lot of money.<br/><br/>Furthermore, the reason why Wang Xian held the celebration banquet for his child this time was not to receive gifts.<br/><br/>Although these gifts were precious, he did not care.<br/><br/>Therefore, he would reward these gifts with something of similar value.<br/><br/>He would reward them to the strong disciples of various forces.<br/><br/>“The Dragon King and the Dragon Queen have gotten their Dragon Sons and daughters. Today, I will perform a song for them, Xiangyang Chaosheng!”<br/><br/>The first program had just ended.<br/><br/>A female powerhouse at the Heavenly Yuan creation realm of the Dragon Palace Alliance was able to receive a huge reward when she saw dozens of female disciples performing.<br/><br/>She was also excited. She didn’t care whether she was a heavenly yuan creation realm powerhouse or not, so she went up to the stage and said.<br/><br/>“Haha, good. Mrs. Zhuge of the Heavenly Sound Universe is performing music. We Are Lucky Today!”<br/><br/>The members of the Dragon Palace Alliance who knew this expert were stunned for a moment and then said with a smile.<br/><br/>“A performance by a Heavenly Yuan Creator?”<br/><br/>“Oh my God, this is a heavenly yuan creator.”<br/><br/>“It’s already lucky to see a group of beautiful women who are at the peak of the ninth rank ruler realm dancing just now. I didn’t expect that even a lord at the Heavenly Yuan creator realm would perform here.”<br/><br/>All the disciples who were below the Heaven’s origin level were shocked.<br/><br/>What the F * ck, a performance by a Master of the Heaven’s origin level.<br/><br/>What right did they have to watch it?<br/><br/>“Alright!”<br/><br/>Wang Xian looked at this master and nodded with a smile.<br/><br/>The master called Zhuge bowed to Wang Xian. With a move, he turned into seven figures.<br/><br/>Each figure was holding a musical instrument.<br/><br/>Guqin, guzheng, Xiao, guitar, and so on.<br/><br/>Seven figures and seven musical instruments.<br/><br/>Following that, Yue’er’s music sounded and streams of water flowed in the sky.<br/><br/>The water flowed in the surroundings and drizzled in the sky.<br/><br/>This was not an ordinary rain but a spiritual rain.<br/><br/>Streams of water flowed to the thirteen little fellows and slowly entered their bodies.<br/><br/>The powerful energy washed their minds.<br/><br/>The thirteen little guys who had not seen much of the world also had their eyes lit up when they heard Yue’er’s music.<br/><br/>“It’s so good, it’s so good!”<br/><br/>“Yes, yes, don’t Talk!”<br/><br/>“Wow, I want to learn music too!”<br/><br/>The little guys listened and watched curiously.<br/><br/>“All the disciples listen and absorb with their hearts. This music can wash their minds and has great benefits for the ruler realm!”<br/><br/>“The drizzle in the sky is a pure energy illusion. This madam Zhuge is also using all her energy.”<br/><br/>“This madam Zhuge is cultivating in the aspect of melody. This kind of melody is indeed pleasant and can affect the soul. Let alone the disciples, we won’t be able to see this kind of performance.”<br/><br/>Some of the heaven origin creation realm powerhouses exhorted the disciples and also whispered a few words and listened quietly.<br/><br/>Those who had reached the Heaven’s origin realm were considered top-notch powerhouses in any universe.<br/><br/>How could such a powerhouse perform in public?<br/><br/>This was completely impossible.<br/><br/>They would only appear in the banquet hall held by the Dragon King of the Dragon Palace.<br/><br/>“Clap Clap Clap!”<br/><br/>“Clap Clap Clap!”<br/><br/>After a few minutes, the music ended. Wang Xian took the lead and clapped!<br/><br/>“It’s Nice!”<br/><br/>“It’s indeed awesome. I’m really Lucky Today!”<br/><br/>“Mrs. Zhuge’s music is definitely the best among the many in our universe!”<br/><br/>The group of powerhouses from the Heaven’s origin realm also praised her.<br/><br/>“It’s indeed nice. Thank you for your performance, Mrs. Zhuge. I wonder if Mrs. Zhuge has the time to be our children’s music teacher and teach them music.”<br/><br/>Guan Shuqing and the other girls also liked this kind of music very much. Seeing that the little guys also liked it very much and wanted to learn, they said directly.<br/><br/>When Mrs. Zhuge heard what Guan Shuqing and the others said, she was instantly stunned.\t\t\t\t\t\t</div>", "images": {}, "success": true}