{"id": 1567, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15184989.html", "title": "Chapter 4570 - Chapter 4570: 4569 Was Invincible", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4570 - Chapter 4570: 4569 Was Invincible</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4570: 4569 was invincible<br/><br/>Your so-called lawless universe made me very unhappy!<br/><br/>These words resounded throughout the entire space.<br/><br/>In his hand was the corpse of the lawless universe’s five Yang ancestor.<br/><br/>In the surroundings, be it the powerhouses of the lawless universe or the powerhouses of other universes, they all felt a chill in their hearts.<br/><br/>A primal chaos level powerhouse was instantly killed?<br/><br/>This was a primal chaos level existence!<br/><br/>Especially the other primal chaos level existence from the lawless universe. His pupils constricted slightly and his face was filled with shock and disbelief.<br/><br/>His strength was about the same as five Yang ancestor’s.<br/><br/>The two of them were also the strongest experts in this region.<br/><br/>They caused a small lawless universe to become the overlord of this region.<br/><br/>However, he was killed instantly by a strange man who had suddenly appeared.<br/><br/>What kind of existence was capable of killing a chaos-level powerhouse like them in an instant!<br/><br/>“My friend, we are lawless universe and have no intention of making an enemy out of you.”<br/><br/>Another chaos-level existence from lawless universe looked at Wang Xian with fear and said!<br/><br/>“Hehe, you guys were very arrogant just now.”<br/><br/>Wang Xian glanced at him coldly and continued indifferently, “Those who are not from the lawless universe, leave.”<br/><br/>“Hiss… this…”<br/><br/>“What kind of existence is this lord? Where did he come from? His strength is so terrifying.”<br/><br/>“Those who are not from the lawless universe leave. Let’s leave, immediately!”<br/><br/>“What’s the meaning of this? Could it be that he wants to deal with the entire Lawless universe alone? How is this possible?”<br/><br/>“Even the primal chaos level five Suns ancestor was killed by him in an instant. Could it be that there are existences above the universe in this Primal Chaos?”<br/><br/>“That expert from the lawless universe called the Phoenix has a grudge against this mysterious expert. Now that the Lawless Universe has angered this expert, let’s Retreat!”<br/><br/>When the group of powerhouses who were fighting against the lawless universe saw this situation and saw this sudden change, their faces were filled with shock.<br/><br/>They hurriedly flew to the side and looked at Wang Xian’s figure in shock!<br/><br/>Compared to them, all the powerhouses from the lawless universe looked extremely embarrassed.<br/><br/>What did they mean?<br/><br/>One person wanted to deal with their entire lawless universe?<br/><br/>Even if he killed their five Yang Patriarch in an instant, even if this mysterious expert might be an existence above the chaos realm.<br/><br/>But their lawless universe had more than a hundred existences at the heavenly yuan manifestation realm.<br/><br/>There were also six experts at the Great Dao realm!<br/><br/>Was he going to deal with all of them?<br/><br/>“Friend, although your strength is far stronger than ours, you can’t just casually insult us, right? If we join hands, even if you are an existence above the chaos realm, we are not afraid at all!”<br/><br/>“This matter is our fault. That Phoenix, if you want to kill him, then kill him. We Can’t control the universe, so just ignore him.”<br/><br/>Another existence at the chaos level in the universe said!<br/><br/>At the same time, he took out an array-like object and placed it in front of him.<br/><br/>The array glowed and slowly, patriarch five Yang’s figure appeared once again.<br/><br/>He was resurrected!<br/><br/>Patriarch of five Yang was already dead and had just been resurrected. After receiving the information from this side, he decided to rush over.<br/><br/>He decided to take a good look at this existence who could kill him in an instant.<br/><br/>However, this time, he was much more vigilant and stood together with another existence at the chaos level.<br/><br/>“If you want to interfere, then interfere. If you don’t want to interfere, then don’t interfere. Is this something that you can decide? Each of you will be killed once as a punishment!”<br/><br/>Wang Xian looked at them coldly. It just so happened that the Dragon Palace lacked resources at the moment. He would kill them once to fill up the resource warehouse of the Dragon Palace.<br/><br/>Most importantly, this group of people had protected the emperor of Phoenix just now.<br/><br/>The grudge between the Emperor of Phoenix and the Dragon Palace, as well as the grudge between the Divine Dragon lineage, was as deep as the ocean!<br/><br/>As soon as Wang Xian finished his sentence, he raised his hand and waved it gently.<br/><br/>The Shadow of a divine dragon flew out from his palm and gradually solidified, turning into an extremely terrifying divine dragon.<br/><br/>The Divine Dragon carried an unparalleled power and directly attacked the more than 100 heaven origin creation stage powerhouses in the Lawless universe.<br/><br/>Two primal chaos level existences and a group of powerhouses, this power was extremely powerful.<br/><br/>However, the divine dragon was even more powerful and terrifying!<br/><br/>When all the experts in the lawless universe saw that Wang Xian actually dared to attack them, their expressions turned ugly. At the same time, they were also extremely furious!<br/><br/>“Do you really think that the Lawless universe is afraid of You?”<br/><br/>Patriarch of five Yang’s face was filled with anger. He stared at Wang Xian with killing intent. “Kill! All the experts, join hands and kill him for me. So what if he is above the primal chaos?”<br/><br/>He roared crazily and was the first to unleash the most terrifying attack!<br/><br/>“Kill!”<br/><br/>“Kill him!”<br/><br/>“One person actually dares to attack so many of us powerhouses. Does he really think that we are easy to bully?”<br/><br/>“That’s right. Even if he is above chaos, we are not afraid at all. Kill him!”<br/><br/>The group of powerhouses from the Lawless universe began to attack with furious expressions.<br/><br/>All the surrounding powerhouses’disciples were dumbfounded.<br/><br/>This…<br/><br/>They were fighting. There was actually an expert who dared to challenge the entire lawless universe?<br/><br/>This? ?<br/><br/>This made them feel dazed!<br/><br/>“Kill him!”<br/><br/>In the distance, a group of disciples from the Lawless universe saw this scene and also roared with anger.<br/><br/>However, in the next moment, a terrifying scene appeared once again.<br/><br/>That extremely terrifying divine dragon flew towards all the experts from the lawless universe.<br/><br/>His body expanded at a terrifying speed.<br/><br/>It was so big that it could cover an entire space.<br/><br/>The divine dragon circled around the 100 plus heavenly yuan creation powerhouses of the Lawless universe!<br/><br/>“Attack!”<br/><br/>All the powerhouses of the lawless universe felt this terrifying aura and their expressions changed drastically.<br/><br/>Streams of energy bombarded the divine dragon’s body.<br/><br/>However, when these energies landed on the Divine Dragon’s body, they did not destroy it.<br/><br/>It only left some marks on it!<br/><br/>In the next moment, the Dragon God had already surrounded them. Its huge head spat out a beam of chaotic energy.<br/><br/>The chaotic energy covered all the experts in the universe.<br/><br/>“Defend!”<br/><br/>Patriarch Five Yang and the other chaos-level existence’s eyes were about to crack.<br/><br/>The full-force attack of more than a hundred of them landed on this terrifying divine dragon, but it didn’t break it?<br/><br/>Only a tiny trace was left behind?<br/><br/>This caused them to feel aghast as they roared in extreme fear.<br/><br/>“Boom! Boom! Boom!”<br/><br/>The expressions of more than a hundred experts changed drastically as they released their strongest defenses.<br/><br/>However, the power of primal chaos covered them and quickly broke their defenses.<br/><br/>Under the Dragon God’s attack, their defenses were as fragile as glass.<br/><br/>“How is this possible! ?”<br/><br/>“No, no, no, this is impossible. How can there be such a terrifying existence in the chaos! ?”<br/><br/>Patriarch Five Yang and the experts from the Lawless universe roared in disbelief.<br/><br/>They couldn’t believe it. They couldn’t believe it.<br/><br/>They were terrified!\t\t\t\t\t\t</div>", "images": {}, "success": true}