{"id": 1565, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15176355.html", "title": "Chapter 4568 - Chapter 4568: 4567 Met The Emperor Of The Phoenix By Chance", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4568 - Chapter 4568: 4567 Met The Emperor Of The Phoenix By Chance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4568: 4567 met the emperor of the Phoenix by chance<br/><br/>Wang Xian looked at the universe in front of him. His body moved and he flew over quickly.<br/><br/>When he entered this universe, he immediately sensed something.<br/><br/>In the entire universe, there were five powerhouses at the Heaven’s origin manifestation level.<br/><br/>“I’ll go and investigate directly.”<br/><br/>Wang Xian sensed the location of the five powerhouses at the Heaven’s origin manifestation level and flew towards the strongest powerhouse at the Heaven’s origin manifestation level.<br/><br/>In this universe, the strongest heaven origin creation stage powerhouses were merely existences at the control level.<br/><br/>In an instant, Wang Xian appeared in front of a cave dwelling on a towering mountain peak.<br/><br/>The word ‘Tai Wei’was written on the cave dwelling. Although the characters in each universe were different, as long as one’s mind could sense it, one would be able to sense its meaning.<br/><br/>Buzz<br/><br/>In the next moment, an old man appeared directly in front of Wang Xian.<br/><br/>“Eh?”<br/><br/>The old man who was cultivating suddenly saw himself appearing beside a young man out of nowhere. His pupils constricted and a look of astonishment appeared on his face.<br/><br/>“A guest from afar. Sorry to disturb you. Don’t be afraid!”<br/><br/>Wang Xian looked at him and said faintly.<br/><br/>“This… senior, what can I do for You?”<br/><br/>The old man’s forehead was filled with cold sweat. He was an existence at the control level.<br/><br/>However, he was unknowingly teleported over from the cave abode. He did not even have the time to react. He knew that this young man in front of him was not someone he could provoke.<br/><br/>It was as easy as flipping his hand to kill him.<br/><br/>At the very least, he was an existence at the Great Dao level.<br/><br/>“I would like to ask how many universes are there in your area, if there are any powerful factions, and if there are any special places in the chaos.”<br/><br/>Wang Xian looked at him and asked.<br/><br/>“Senior, I’m not too sure about the universes on our side. There are about 200 to 300 universes. In addition, we have a relatively powerful force called the lawless universe.”<br/><br/>“The Lawless universe has conquered many other universes. A few aeons ago, it was a giant existence.”<br/><br/>“Now that the new aeons have arrived, many universes have formed an alliance to resist the invasion of the lawless universe. Currently, the two sides have yet to erupt into a war.”<br/><br/>“In our region, there is a very special territory called the lawless land. This is because the lawless universe was the first to discover this place. Furthermore, the lawless universe obtained some opportunities from it and became the current overlord.”<br/><br/>The old man reported hurriedly.<br/><br/>Wang Xian nodded slightly. “Is there any existence at the level of chaos in this lawless universe? Also, is there anything special in the lawless land? Have All the treasures and resources in it been obtained by the Lawless Universe?”<br/><br/>“Senior, there is one existence at the level of chaos in the lawless universe. As for whether there is any more, it is not something that I can know. The treasures in the lawless land have not been completely obtained by them.”<br/><br/>“Right now, a portion of the lawless land is occupied by the lawless universe. The Alliance of the other universes has made the Lawless universe wary and want to disintegrate them. Right now, the lawless universe is preparing to hold a banquet and invite all the powerful beings of the universe. They want to disintegrate the alliance between them, and the benefits may be exploring the lawless land.”<br/><br/>The old man continued to speak.<br/><br/>“Where is the lawless land? Is there a teleportation formation?”<br/><br/>Wang Xian was not interested in the dispute between the powerhouses in this chaotic region. He asked the old man.<br/><br/>“Senior, there is no teleportation formation. The lawless land is in that direction.”<br/><br/>The old man shook his head and pointed in a direction.<br/><br/>Wang Xian moved and disappeared.<br/><br/>The old man looked over and realized that he could no longer sense Wang Xian’s existence. He heaved a sigh of relief.<br/><br/>“What terrifying strength. He’s so silent. Is He a primal chaos level existence?”<br/><br/>“I don’t know where he came from. He seems to be very unfamiliar with our area.”<br/><br/>The old man mumbled.<br/><br/>Wang Xian flew towards the place the old man pointed out. Halfway through, he used his divination ability to perform a simple divination and obtained a vague location.<br/><br/>However, this was enough.<br/><br/>After flying for about a year, Wang Xian saw many universes in his surroundings.<br/><br/>He did not enter the universe.<br/><br/>Although these universes had treasures, the treasures that were born in the universe were no longer of interest to him.<br/><br/>The strongest treasure that could be born in a universe was the ultimate treasure of the Heaven’s origin!<br/><br/>Wang Xian was no longer interested in treasures of this level.<br/><br/>It was useless.<br/><br/>As he looked ahead, Wang Xian’s eyes sparkled.<br/><br/>This was a very special area with strong gales whistling.<br/><br/>There were endless storms inside. There were terrifying wind blades, wind blades, wind needles, and so on.<br/><br/>Other than that, there were also some wind attribute elemental gods.<br/><br/>The entire space was extremely huge and terrifying. Even if it was the outermost area, one would need to have the strength of an eighth or ninth level master to enter.<br/><br/>Further in, one might even need the strength of the Heaven’s origin blessed realm.<br/><br/>As for the interior, it could threaten existences at the chaos level.<br/><br/>Back then, in the chaos region of the Justice Alliance, when Wang Xian obtained the chaos sphere, only powerhouses at the peak of the chaos level could enter that place.<br/><br/>He could vaguely sense that this place also required existences at such a level to enter the core.<br/><br/>Wang Xian moved his body and approached quickly.<br/><br/>Boom! Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>When he got closer, he saw that there were quite a number of powerhouses fighting in front of him.<br/><br/>He swept his gaze over and revealed an astonished expression.<br/><br/>Two existences at the primal chaos realm were leading more than 100 heaven origin creation stage powerhouses. They were currently surrounding and killing more than 70 heaven origin creation stage powerhouses.<br/><br/>There were more than 30 powerhouses in the Heaven’s origin realm. There were 10 of them in the Great Dao realm. They were barely able to fend off some of them.<br/><br/>In the distance, there were more than 100,000 disciples of the powerhouses watching the battle.<br/><br/>Wang Xian looked around to see if there were any powerhouses with special attributes and special abilities.<br/><br/>Although he possessed the power of chaos at the moment, which could be converted into many attributes, he did not know how to convert some of the mysterious attributes.<br/><br/>If he could convert some of the special attributes, it would also improve his combat ability.<br/><br/>He swept his gaze around and did not see anyone with special abilities.<br/><br/>“HMM?”<br/><br/>However, all of a sudden, Wang Xian saw an acquaintance.<br/><br/>Yes, an acquaintance.<br/><br/>The Emperor of the Phoenix.<br/><br/>At that time, the Dragon Palace destroyed the Phoenix clan and the Emperor of the Phoenix escaped.<br/><br/>Later on, he colluded with the experts of the Void Universe and invaded the nine-origin universe. He was killed by Wang Xian again.<br/><br/>However, he never died.<br/><br/>Later on, after Wang Xian obtained the divination ability, he did a divination as well. However, he did not manage to do so.<br/><br/>After that, Wang Xian did not take the emperor of the Phoenix to heart.<br/><br/>His strength was so great that he completely ignored this ant.<br/><br/>However, he did not expect that the emperor of the Phoenix would actually come here.<br/><br/>“How interesting. It must have taken him at least hundreds of millions of years to fly here!”<br/><br/>Wang Xian mumbled.\t\t\t\t\t\t</div>", "images": {}, "success": true}