{"id": 1568, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15187103.html", "title": "Chapter 4571 - Chapter 4571: 4570 Chaos Supreme Treasure! Go", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4571 - Chapter 4571: 4570 Chaos Supreme Treasure! Go</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4571: 4570 Chaos Supreme Treasure! Go<br/><br/>“Boom! Boom! Boom!”<br/><br/>The Dragon God’s terrifying breath covered the more than 100 heaven origin creation realm experts in the lawless universe.<br/><br/>Faced with this terrifying attack, their defenses were useless.<br/><br/>This caused all the experts to be shocked.<br/><br/>They were all terrified!<br/><br/>When Patriarch Five Yang and another chaos-level existence saw this scene, their expressions changed drastically.<br/><br/>They never thought that there was such a terrifying existence in this primal chaos.<br/><br/>There was such an invincible existence.<br/><br/>The two didn’t hesitate at all. They took out their powerful supreme treasures and prepared to escape.<br/><br/>But in the next moment, they discovered that their supreme treasures had lost their effectiveness.<br/><br/>It was as if there was a vast energy that prevented them from using their supreme treasures to escape.<br/><br/>This made their expressions change drastically as they looked at the terrifying divine dragon that surrounded them.<br/><br/>No, what was terrifying was not the divine dragon, but the mysterious figure that stood in front of them and looked at them calmly.<br/><br/>At this moment, that figure was supreme in their minds.<br/><br/>“We can’t escape, not even if we use our true treasures to escape!”<br/><br/>“It’s over!”<br/><br/>All the powerhouses were in despair.<br/><br/>However, they didn’t suffer too much pain.<br/><br/>The chaotic energy swept past and killed them instantly.<br/><br/>Faced with Wang Xian’s current strength, these 100 plus heaven origin creation stage powerhouses didn’t have the strength to resist.<br/><br/>In fact, Wang Xian hadn’t even unleashed his full strength at this moment.<br/><br/>With one move, he killed over 100 heaven origin creation stage powerhouses instantly.<br/><br/>He had engulfed two primal chaos level existences.<br/><br/>At this moment, all the surrounding powerhouses’disciples were looking at everything in astonishment.<br/><br/>They even rubbed their eyes in disbelief.<br/><br/>They felt that the scene in front of them was an illusion.<br/><br/>Even the group of disciples who could not control the universe in the distance were screaming crazily that everything in front of them was an illusion and not real.<br/><br/>The Emperor of Phoenix, who was standing not far away from Wang Xian, witnessed everything. His body trembled violently and his face was extremely pale.<br/><br/>He stared at Wang Xian in a daze.<br/><br/>He had lost his soul.<br/><br/>“Emperor of Phoenix, I want to kill you. No one can stop me. Don’t worry, I will kill you completely. You will never be resurrected again!”<br/><br/>Wang Xian stared at the emperor of resurrection. With a move of his palm, a virtual image appeared in front of him.<br/><br/>He clenched his fist tightly and the Emperor of Phoenix in front of him died immediately.<br/><br/>Following that, he waved his arm and the Phantom of the Emperor of Phoenix appeared continuously and was destroyed continuously.<br/><br/>Following that, even if he had countless resurrection treasures, he could not escape the ending of death.<br/><br/>Buzz<br/><br/>Buzz<br/><br/>He looked into the distance and waved his arm. The disciples from the Lawless universe in the distance were instantly killed and their corpses were collected.<br/><br/>Wang Xian only killed them once and did not completely exterminate them.<br/><br/>After killing the disciples from the Lawless universe, his body moved and he flew straight into the depths of the lawless universe.<br/><br/>It was as if he had done something insignificant just now.<br/><br/>When Wang Xian left this place completely, the 70 to 80 strong cultivators from the Heaven’s origin realm around him finally reacted.<br/><br/>They looked at each other, their eyes filled with shock.<br/><br/>“There’s actually such a terrifying existence in the chaos?”<br/><br/>“He’s simply too strong? What realm is he at exactly? Above the chaos? It’s impossible for him to be so strong above the chaos. I’m afraid he’s even stronger than the Chaos!”<br/><br/>“Oh my god, there are more than 100 heaven origin creation realm powerhouses. All of them were killed in one move. Among them, there are two existences at the Chaos Realm!”<br/><br/>Seventy to eighty experts discussed in disbelief.<br/><br/>Even they felt that the scene just now was an illusion.<br/><br/>However, they knew that it wasn’t.<br/><br/>The disciples of the experts from the Lawless universe were the best proof.<br/><br/>“Luckily, we didn’t offend this Lord.”<br/><br/>A Great Dao realm expert said.<br/><br/>The other experts nodded. The figure just now had already entered their minds.<br/><br/>They didn’t know his name, but they knew that this master was invincible!<br/><br/>…<br/><br/>Wang Xian entered the lawless land and didn’t care about the shock and disbelief of the other experts.<br/><br/>He didn’t care about how much of a commotion his actions would cause in this area.<br/><br/>At this moment, he had already entered the interior of the lawless land.<br/><br/>“The location I’m at now is the center of the lawless land. At this location, the two existences of the primal chaos level in the lawless universe can barely get close to it. However, this isn’t the core. There are obviously more terrifying and more powerful energy fluctuations at the core.”<br/><br/>Wang Xian stood there, his eyes flickering slightly.<br/><br/>He did not find any treasures in the inner and outer areas of the lawless land.<br/><br/>Obviously, the treasures here had already been taken by the powerhouses in the lawless universe.<br/><br/>However, this place was a powerful cultivation treasure ground for the wind-type powerhouses.<br/><br/>Moreover, due to the uniqueness of this area, treasures would be born here from time to time.<br/><br/>The deeper one went, the more treasures would be born.<br/><br/>Wang Xian moved his body and went deeper into the region.<br/><br/>That was the core location.<br/><br/>Wang Xian scanned his surroundings and saw more than a dozen elemental gods.<br/><br/>These elemental gods were of the wind attribute.<br/><br/>Each of these elemental gods exuded an aura that was not weaker than the Great Dao.<br/><br/>The ten elemental gods intertwined together and formed an extremely terrifying domain.<br/><br/>Inside, he could even sense the existence of three heavenly fate treasures.<br/><br/>The place where the ten elemental gods intersected was not the core of this place.<br/><br/>Wang Xian flew straight in and easily passed through the ten elemental gods. He looked at the core.<br/><br/>There, there was a special wind elemental bead.<br/><br/>The bead was emitting a luster. The luster covered an area of only a few hundred kilometers.<br/><br/>However, Wang Xian could feel that the destructive power contained in this luster was extremely terrifying.<br/><br/>Wang Xian flew over and came to the interior of this special wind bead.<br/><br/>Sensing the powerful destructive power around this wind bead, he raised his eyebrows slightly.<br/><br/>Unless a peak chaos expert brought along an ordinary chaos-level expert, it would be very difficult.<br/><br/>If a peak chaos-level expert stepped in, he probably wouldn’t be able to get the wind bead.<br/><br/>As his gaze landed on the wind bead, Wang Xian’s eyes sparkled.<br/><br/>His body moved and came in front of the wind bead. He reached out and held it in his hand, and it lit up.<br/><br/>“The energy contained in it is very strong. It is purely wind elemental energy, but it is very difficult to absorb. If it is absorbed by a powerhouse at the peak of Chaos, one out of ten people with wind elemental energy might be able to succeed!”<br/><br/>Wang Xian calculated in his heart and deduced.<br/><br/>Very soon, he came to a conclusion. This wind bead was an existence that could allow a powerhouse at the peak of Chaos to step into the realm above chaos.<br/><br/>In other words, this was a treasure that could allow one to break through to the supreme realm.<br/><br/>“Is there such a treasure in every chaotic region and every special region?”<br/><br/>Wang Xian guessed in his heart!\t\t\t\t\t\t</div>", "images": {}, "success": true}