{"id": 1562, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15174037.html", "title": "Chapter 4565 - Chapter 4565: 4564 Combat Strength Of 40 Chaos Levels!", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4565 - Chapter 4565: 4564 Combat Strength Of 40 Chaos Levels!</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4565: 4564 combat strength of 40 chaos levels!<br/><br/>The change of the world, the change of the living beings.<br/><br/>Wang Xian’s preaching began.<br/><br/>Below, all the strong disciples from the four major forces looked on with shock on their faces.<br/><br/>They watched the beginning of chaos, the evolution of the universe, and the birth of the Holy Spirit.<br/><br/>They watched the birth of all living things, the rise of the mountains and seas, and the great changes of the world.<br/><br/>The current Wang Xian had already walked into an unknown realm. He could evolve everything below the chaos level, including the chaos level.<br/><br/>The accumulation of energy and the breakthrough of shackles.<br/><br/>However, all of these were extremely mysterious. He needed to observe and comprehend them himself.<br/><br/>When Wang Xian had evolved for two hundred years, there were disciples in the ruler realm who started to break through.<br/><br/>Large-scale breakthroughs.<br/><br/>There were disciples from the Dragon Palace and disciples from other peak races in the nine-origin universe.<br/><br/>This batch of disciples in the ruler realm whose strength had decreased started to have energy fluctuations in their bodies. They started to break through the shackles one by one.<br/><br/>The number of breakthroughs reached one-third of the shock level.<br/><br/>The group of Heavenly Yuan creation realm experts sensed it and their faces were filled with shock.<br/><br/>By the 300th year, a large number of disciples who were at the peak of the level 8 realm of the universe ruler realm started to break through.<br/><br/>Especially the disciples who were already at the peak of the level 8 realm of the universe ruler realm. One of them must have broken through.<br/><br/>After 400 years of preaching, more than 300 peak level ruler realm disciples had broken through. As long as they had a spot in the universe, they could break through to the Heavenly Yuan destiny realm at any time.<br/><br/>After 500 years, the ruler realm disciples didn’t understand. However, they knew that this was a great opportunity for them. It was the path of Heavenly Yuan destiny.<br/><br/>Even if they didn’t understand, they wanted to remember it in their hearts.<br/><br/>Five hundred years later, some heavenly yuan creation realm experts gradually came to a realization. Energy began to boil in their bodies as they saw the path ahead and the path to breakthrough.<br/><br/>Even experts at the Great Dao realm were greatly moved.<br/><br/>In fact, at the final moment, the Justice Alliance’s Primal Chaos Realm Existences, the two primal chaos realm existences from the ten-day federation and the four Primal Chaos Realm existences from the Behemoth Alliance were all excitedly listening and watching.<br/><br/>Their faces were filled with excitement and excitement.<br/><br/>They could see the road ahead.<br/><br/>However, it was a pity that the evolution was too fast. In just a few hundred years, the evolution was not completely completed.<br/><br/>“A thousand years have passed. The preaching is over.”<br/><br/>“You can communicate here or leave. The Dragon Palace’s celebration is also over.”<br/><br/>A thousand years had passed and Wang Xian had finished his preaching. Seeing that all the strong disciples were still immersed in the preaching, he spoke indifferently.<br/><br/>Then, he left immediately!<br/><br/>“Thank You, Your Majesty Dragon King, for imparting the Dharma.”<br/><br/>The group of strong disciples regained their senses slightly and congratulated him hurriedly.<br/><br/>After all the strong disciples thanked him, they sat there motionlessly when they saw Wang Xian leave.<br/><br/>They were still immersed in their thoughts and memories. None of the strong ones left.<br/><br/>Although the disciples in the ruler realm had regained their senses, how could they leave if the masters in the Heaven’s origin manifestation level had not left?<br/><br/>Some of the powerhouses had an epiphany and wanted to cultivate.<br/><br/>However, they soon discovered a problem. The energy around them was very thin.<br/><br/>The Dragon Palace had cut off the energy on their side.<br/><br/>They were preparing to send off their guests.<br/><br/>Of course, if they did not cut off their energy, the energy around them would be completely absorbed even if the Dragon Palace had accumulated a lot of energy.<br/><br/>The divine herbs and trees around them were about to wither.<br/><br/>“I’ve heard that the Dragon King has really benefited a lot from his teachings. Although the road ahead is blurry, it’s much better than before.”<br/><br/>“There’s too much time. If His Majesty the Dragon King… I can’t imagine how Far His Majesty the Dragon King has reached.”<br/><br/>“According to His Majesty the Dragon King’s last evolution, it’s no longer possible to break through the chaos. It seems that he needs the help of an incredibly powerful treasure?”<br/><br/>“We’ve really benefited a lot from coming here today. It’s a great fortune for us that the Dragon King can teach us everything. We’ll definitely do our best if the Dragon Palace has any instructions in the future!”<br/><br/>The primal chaos experts spoke with shock, enlightenment, and gratitude.<br/><br/>After listening to the Dragon King’s preaching, they realized that the current Dragon King was unfathomable.<br/><br/>He could easily kill primal chaos experts like them.<br/><br/>This made the primal chaos experts extremely grateful.<br/><br/>“Fellow Daoists, why don’t we go outside and have a dao discussion and share our insights?”<br/><br/>The Alliance Master of the Justice Alliance hesitated for a moment, then said to the other chaos-level experts.<br/><br/>“Hehe, good. The Dragon King has ordered us to stop fighting. Then let’s cultivate together and explore the distant chaotic universe.”<br/><br/>The Alliance Master of the Behemoth Alliance nodded.<br/><br/>“My Lords, let’s go to the base of the Dragon Palace Alliance, the land of origin.”<br/><br/>The three prophets of the Dragon Palace Alliance looked at each other and said to them.<br/><br/>“Okay!”<br/><br/>The experts nodded and immediately went to the land of origin to discuss Dao.<br/><br/>The experts of the Dragon Palace also followed.<br/><br/>After all, it was very beneficial for them to discuss dao with the experts.<br/><br/>Although they had the Dragon King, who could preach dao to them at any time.<br/><br/>Time passed by slowly.<br/><br/>The group of powerhouses discussed their Dao in the land of origin for tens of millions of years before leaving.<br/><br/>After 50 million years, the powerhouses from the Behemoth Alliance, Justice Alliance, Ten Days Federation, and the Dragon Palace Alliance began to set up black hole teleportation formations wantonly.<br/><br/>Including the distance between the two sides.<br/><br/>At the same time, the four major alliances began to explore the more distant chaotic space and search for more universes.<br/><br/>During this period of time, Wang Xian had nothing to do but to absorb resources and accompany the children.<br/><br/>The little ones also grew up one by one. After 50 million years, their strength had reached the peak of the universe’s ruler.<br/><br/>Speaking of which, with Wang Xian’s current strength and with the resources of the Dragon Palace, this speed was considered very slow.<br/><br/>This was because they were more playful.<br/><br/>In addition, it was also because they learned more things.<br/><br/>Not only did they need to cultivate, but they also needed to learn all kinds of zither, chess, calligraphy, and painting.<br/><br/>In addition, Wang Xian, Guan Shuqing, and the rest didn’t care about the cultivation level of the little ones.<br/><br/>They wanted to give them a happy and complete childhood.<br/><br/>They basically didn’t care about cultivation.<br/><br/>More than 50 million years might just be the stage of youth for the children of Heaven’s origin.<br/><br/>During this period, Guan Shuqing and the rest brought the little ones to explore the origin universe.<br/><br/>They began to travel to other universes.<br/><br/>As the saying went, it was better to travel thousands of miles than to read thousands of books.<br/><br/>During this period, Wang Xian absorbed some resources and dealt with the giant beasts of chaos in the land of origin.<br/><br/>After all, it was an extremely huge land of resources.<br/><br/>His strength was comparable to 40 experts of the level of chaos.<br/><br/>As for how strong his actual combat strength was, Wang Xian didn’t know.\t\t\t\t\t\t</div>", "images": {}, "success": true}