{"id": 1566, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15184988.html", "title": "Chapter 4569 - Chapter 4569: What Was Invincibility When 4568 Made A Move?", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4569 - Chapter 4569: What Was Invincibility When 4568 Made A Move?</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4569: What was invincibility when 4568 made a move?<br/><br/>One’s life was filled with joy when one met an enemy in another country.<br/><br/>Wang Xian wanted to completely destroy the emperor of Phoenix.<br/><br/>The Emperor of Phoenix had a lot of responsibility for the destruction of the divine dragon lineage in the past.<br/><br/>Treachery.<br/><br/>The reason why so many disciples of the saint lineage were killed in the past was also because they colluded with the Void Universe.<br/><br/>Therefore, Wang Xian would not let the Emperor of Phoenix off when he encountered him now.<br/><br/>This was good. He would completely destroy him this time!<br/><br/>“Emperor of Phoenix, I didn’t expect you to hide in this area. Hehe, let’s see where you can run to this time.”<br/><br/>Wang Xian moved and instantly arrived at the position in front of him.<br/><br/>In front of him was a battlefield. There were more than 100 heaven origin creation stage powerhouses surrounding and attacking 70 to 80 heaven origin creation stage powerhouses.<br/><br/>The Emperor of Phoenix was among them. He was working together with others to deal with a powerhouse.<br/><br/>However, he could not tell which side the emperor of Phoenix belonged to.<br/><br/>However, Wang Xian did not care either!<br/><br/>“Huh?”<br/><br/>“What?”<br/><br/>The Emperor of Phoenix who was in the middle of the battle was slightly stunned when he heard Wang Xian’s voice. His face was filled with astonishment.<br/><br/>He looked at Wang Xian. When he saw Wang Xian’s familiar face, his pupils constricted slightly!<br/><br/>“It’s you, Dragon King of the Dragon Palace!”<br/><br/>The Emperor of the Phoenix revealed an extremely furious and hateful expression.<br/><br/>It was the Dragon King. It was him.<br/><br/>If it wasn’t for him, he wouldn’t have come to this distant region like a stray dog.<br/><br/>However, he had now joined a powerful force in this region.<br/><br/>It could be considered as an opportunity.<br/><br/>Moreover, when he was heading to this region, he had also encountered an opportunity that belonged to him. Now, his strength had reached the level of control.<br/><br/>However, he also knew that the Dragon King’s strength was at the Great Dao level.<br/><br/>The Emperor of Phoenix had left the nine-origin universe earlier. Therefore, he did not know how strong Wang Xian was.<br/><br/>“Hehe, that’s right. It’s me. What a coincidence. I’m going to take your dog life today!”<br/><br/>Wang Xian smiled faintly and said!<br/><br/>“Phoenix, what’s going on? Who Is He?”<br/><br/>The Heaven’s origin creator who was attacking a control-level powerhouse with him saw the Emperor of Phoenix staring at Wang Xian coldly. He frowned slightly and asked.<br/><br/>“I’m an enemy, a blood feud!”<br/><br/>Phoenix stared at Wang Xian and replied with a ferocious expression!<br/><br/>“Enemy? get him out of here immediately and don’t disturb us.”<br/><br/>That powerhouse glanced at Wang Xian nonchalantly and shouted coldly!<br/><br/>“Hehe.”<br/><br/>Wang Xian smiled nonchalantly and flew directly towards the position of the Emperor of Phoenix.<br/><br/>“TSK TSK TSK, I’ve already said that if any powerhouse dares to interfere in this matter today, he would be going against our lawless universe. I will destroy his universe.”<br/><br/>“I don’t care what grudges you have with Phoenix. Get lost immediately!”<br/><br/>At this moment, an old man who was emitting a terrifying aura noticed the commotion and spoke coldly!<br/><br/>He was an existence at the level of chaos. At this moment, he was attacking 70 to 80 powerhouses at the Heaven’s origin creation level. It felt like a cat playing with a mouse.<br/><br/>He didn’t put the other party in his eyes at all.<br/><br/>Wang Xian’s appearance was also under the coverage of his divine sense.<br/><br/>Phoenix was his subordinate. Since he was strong enough to protect his subordinate, he naturally had to protect his subordinate.<br/><br/>“Patriarch Five Yang, please kill him. He destroyed my clansmen and killed me again and again. Patriarch Five Yang, please help your disciple kill him. In the future, I, Phoenix, will definitely serve the lawless universe.”<br/><br/>The Emperor of Phoenix looked at Patriarch Five Yang and said loudly!<br/><br/>His eyes were full of hope.<br/><br/>“Hahaha, good. Phoenix, you are a member of my lawless universe. I will avenge you.”<br/><br/>Patriarch Five Yang laughed and then glanced at the great beings in front of him. “Among you, if you join my lawless universe, I will also protect you. Otherwise, you will only die!”<br/><br/>Patriarch Five Yang’s body was emitting a dense murderous aura.<br/><br/>He wanted to use the matter of the Phoenix Emperor to strike a blow at the group of universe Great Beings who were rebelling against their lawless universe.<br/><br/>“Old Thing, don’t even think about it. Even if we die, we will not surrender. Your Lawless universe is despicable and shameless. You have killed countless living beings and don’t even treat ordinary living beings as human beings. We will never submit to your lawless universe.”<br/><br/>“Even if we die, we will make you pay a terrible price for not being able to be the universe!”<br/><br/>An expert at the level of the Great Dao roared with a cold face!<br/><br/>“If you are unwilling to submit, then die!”<br/><br/>Patriarch Five Yang roared with a face full of killing intent!<br/><br/>Wang Xian swept his gaze across them and raised his eyebrows slightly.<br/><br/>He continued to fly straight towards the Emperor of Phoenix!<br/><br/>“Patriarch Five Yang, save me. He is an expert of the Great Dao.”<br/><br/>When the Emperor of Phoenix saw Wang Xian flying towards him rapidly, he shouted in horror again!<br/><br/>“Die!”<br/><br/>Patriarch Five Yang looked at Wang Xian and a terrifying storm erupted in his eyes.<br/><br/>The storm of wind blades attacked Wang Xian directly.<br/><br/>“You don’t know whether you are dead or alive.”<br/><br/>Wang Xian took a glance at Patriarch Five Yang and waved his arm gently!<br/><br/>Buzz<br/><br/>The next second, Patriarch Five Yang’s body appeared in front of Wang Xian. His palm grabbed patriarch five Yang’s neck!<br/><br/>The storm of wind blades that he released vanished instantly!<br/><br/>Everything was like a dream.<br/><br/>All the experts didn’t manage to react in time.<br/><br/>Even Patriarch Five Yang himself didn’t manage to react in time.<br/><br/>However, very soon, patriarch five Yang widened his eyes and stared at Wang Xian in disbelief.<br/><br/>“No, no, this is impossible!”<br/><br/>Patriarch of five Yang roared crazily. He wanted to burst out all his energy.<br/><br/>He wanted to resist.<br/><br/>However, he realized that all the energy in his body seemed to be confined.<br/><br/>He couldn’t mobilize it at all!<br/><br/>This made him fearful. His body started to tremble violently.<br/><br/>How was this possible?<br/><br/>He was an existence at the chaos level. However, he was an invincible existence in this region.<br/><br/>Now, he was actually grabbed by the throat by an unknown expert. He didn’t even have the chance to resist?<br/><br/>“A puny expert at the level of chaos dares to make a move against me?”<br/><br/>Wang Xian’s face was filled with mockery and disdain.<br/><br/>“Bang!”<br/><br/>The next moment, he clenched his arm and crushed the body of Patriarch Five Yang.<br/><br/>Patriarch Five Yang died instantly!<br/><br/>He was stunned!<br/><br/>The Emperor of Phoenix was completely stupefied. He even felt a little crazy.<br/><br/>He wasn’t the only one. All the experts who were still fighting stopped.<br/><br/>They all looked over, their eyes full of disbelief.<br/><br/>They were full of disbelief.<br/><br/>What did they see?<br/><br/>A chaos-level existence was instantly killed?<br/><br/>How was this possible?<br/><br/>“No, no, no, how is this possible? This is impossible, impossible. Dragon King of the Dragon Palace, how can you be so strong? This is impossible!”<br/><br/>The emperor of the Phoenix felt that he had gone crazy. He roared crazily and his eyes were about to explode!<br/><br/>“No one can stop me from killing you.”<br/><br/>Wang Xian looked at him indifferently and swept his gaze across the surroundings. “Also, your so-called lawless universe makes me very unhappy!”\t\t\t\t\t\t</div>", "images": {}, "success": true}