{"id": 1564, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15176354.html", "title": "Chapter 4567 - Chapter 4567: 4566 Was Exploring The Chaos", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4567 - Chapter 4567: 4566 Was Exploring The Chaos</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4567: 4566 was exploring the chaos<br/><br/>“It’s time for you kids to venture out on your own.”<br/><br/>“There’s another chaos region ahead. It’s more prosperous here as well. You guys should train here.”<br/><br/>“I will seal your department’s memories. You know the existence of your mother and I, but you don’t know our strength or where we came from. All you know is that your parents are ordinary cultivators.”<br/><br/>Amidst the chaos, Wang Xian was floating in the air with his thirteen children, Guan Shuqing, and the other girls.<br/><br/>His gaze swept across the more than ten dazzling universes in front of him. He smiled and said to his children.<br/><br/>A bunch of naughty children. He had stayed with them for 100 million years. Now that he saw them going out to train, he didn’t feel too sad.<br/><br/>The main reason was that when he wanted to see them, he could go over and take a look.<br/><br/>“Don’t worry, Mom and Dad. We will definitely make a name for ourselves. The next time we see us, we have already stepped into the Heavenly Yuan blessed realm. We are already very strong and independent!”<br/><br/>The eldest brother’s gaze was resolute as he spoke with a face full of confidence!<br/><br/>“Living outside, the hearts of people are sinister. You must be vigilant, understand?”<br/><br/>Guan Shuqing and the other girls said with concern.<br/><br/>“Understood, Mom. Don’t worry. We are going to start our magnificent life, as powerful as our Father!”<br/><br/>“Don’t worry, mother. We will grow up and work hard. The next time you see us, you will be shocked. Hehe.”<br/><br/>“Hahaha, we have grown up. We can not stay under the protection of our parents forever. It’s time for us to try.”<br/><br/>The thirteen children were also filled with interest.<br/><br/>All of them were filled with fighting spirit.<br/><br/>If they were to compete with each other, they would definitely be doing better than the rest of them.<br/><br/>When Wang Xian saw this scene, a smile appeared on his face. At the same time, he also shook his head.<br/><br/>The thirteen little ones had never suffered any losses, nor had they suffered any hardships.<br/><br/>In their territory, all the strong disciples were respectful to them and spoke well of them.<br/><br/>Although there were teachers who taught them that the strong preyed on the weak and that people were vicious, they had seen some cruel things during their travels.<br/><br/>However, they had never experienced it firsthand. They had just arrived in an unfamiliar world. Some people probably would not spoil them.<br/><br/>Of course, Wang Xian also believed that they could survive and overcome them one by one.<br/><br/>After all, during these 100 million years, Wang Xian and the rest had found many teachers for them. Apart from teaching them all kinds of knowledge, they also taught them how to behave and how to solve problems.<br/><br/>The 13 children were very smart.<br/><br/>The most important thing was that they could be resurrected after death. There was a prohibition in their bodies and they would not be insulted.<br/><br/>“Alright, Alright, go.”<br/><br/>Wang Xian and the rest were also a little gratified. With a move of his palm, he opened up the 13 black holes and gestured to them one by one.<br/><br/>“Father, mother, Farewell!”<br/><br/>The little ones eagerly entered the black holes one by one.<br/><br/>“These children thought that they were going on a vacation. Little did they know that in a world where the strong preyed on the weak, they would encounter great danger.”<br/><br/>Guan Shuqing and the rest stood beside Wang Xian. Looking at the thirteen children who had disappeared, they said softly, “Now that these little ones have left, we can have some peace.”<br/><br/>“Xiao Xian, come and divine the future situation of the children.”<br/><br/>Guan Shuqing, Lan Qingyue, and the rest didn’t seem to be worried. However, they still looked at Wang Xian and asked him to do the divination.<br/><br/>“Is this alright? Don’t look at them anymore. You might feel sorry for them. Let them do it on their own. Don’t worry. At most, they will encounter some difficulties. They might even be killed once or twice. However, they won’t be in too much danger.”<br/><br/>Wang Xian looked at them and said speechlessly.<br/><br/>All the children had a protective mechanism. Not to mention the 13 Great Dao level pets in their bodies, they would also have a protective mechanism if they were humiliated physically.<br/><br/>This protective mechanism could allow them to escape in an instant.<br/><br/>Even powerhouses at the chaos level could not stop them.<br/><br/>However, their companion pets wouldn’t make a move unless it was under special circumstances.<br/><br/>“Then, then give the girls a divination. They have been deceived. It’s fine if they suffer a little. We can’t let them suffer too much.”<br/><br/>The group of girls hesitated for a moment before saying.<br/><br/>“Alright, Alright!”<br/><br/>Wang Xian nodded his head and gave the group of girls a divination.<br/><br/>With Wang Xian’s current strength, it was easy for him to divine the future.<br/><br/>He could clearly divine the future of his children for the next hundred million years.<br/><br/>It was fine for the group of Little Boys, but the group of little girls shouldn’t be deceived.<br/><br/>Wang Xian immediately performed divination and quickly received some information. The group of girls looked at him with anger, anger, and a smile.<br/><br/>Then, they started to discuss and prepared to interfere with the future of the few little girls.<br/><br/>After all, some of the girls had been deceived in the divination.<br/><br/>Wang Xian smiled. Naturally, he had to interfere. In the future, he would just kill the guy who deceived the girls.<br/><br/>Changing the future. This was Wang Xian’s current terrifying strength.<br/><br/>“Let’s go, Let’s Go!”<br/><br/>Wang Xian waved his arm and left with Guan Shuqing and the rest.<br/><br/>Wang Xian returned to the Dragon Palace with nothing to do.<br/><br/>Now that he was cultivating on his own, the speed of his improvement was extremely slow, unless he absorbed a huge amount of resources and treasures.<br/><br/>However, at the moment, he had almost absorbed all the resources in the chaos near the nine-origin universe.<br/><br/>Even the gigantic beasts of chaos at the bottom of the land of origin had been dealt with.<br/><br/>Even the gigantic beasts of chaos at Wu Tongming’s ten days federation had been dealt with by him.<br/><br/>It was comparable to 40 realms of chaos. One could imagine how much resources Wang Xian had absorbed.<br/><br/>Since he had nothing to do, he accompanied a few disciples and played leisurely for 10 days. Then, he lectured the strong disciples of the Dragon Palace for another 100,000 years.<br/><br/>After that, Wang Xian was bored and prepared to explore other places of chaos.<br/><br/>There were six directions in the chaotic space. Currently, the Dragon Palace Alliance and the Justice Alliance were exploring the east.<br/><br/>The direction where the thirteen little fellows were located belonged to the west.<br/><br/>Wang Xian was exploring directly upwards!<br/><br/>He wanted to explore this boundless chaotic space and see if he could find the existence above the chaotic space.<br/><br/>Wang Xian’s current speed was very fast. With just a thought, he could travel from one side of the nine-origin universe to the other.<br/><br/>When he flew, he couldn’t even see the shadows of existences at the level of the chaotic space.<br/><br/>Wang Xian flew north for a few decades and encountered an unknown universe of the Justice Alliance of the Dragon Palace Alliance.<br/><br/>“Usually, there would be some universes nearby where there are universes.”<br/><br/>According to Wang Xian’s understanding, once there was a universe here, there was a high probability that there would be many universes nearby.<br/><br/>Moreover, there was a high probability that there would be some special treasure lands around.<br/><br/>For example, the land of origin of the Dragon Palace Alliance.<br/><br/>The chaotic area of the Justice Alliance.<br/><br/>These treasure lands were a huge amount of resources for Wang Xian. They could increase his strength!\t\t\t\t\t\t</div>", "images": {}, "success": true}