{"id": 1561, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15171971.html", "title": "Chapter 4564 - Chapter 4564: At The Banquet Of The 4563 Golden Age", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4564 - Chapter 4564: At The Banquet Of The 4563 Golden Age</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4564: At the banquet of the 4563 golden age<br/><br/>“Yes, yes, of course!”<br/><br/>Upon hearing Guan Shuqing and the others’words, Lady Zhuge’s face immediately revealed an extremely excited expression.<br/><br/>She did not expect that she would have such a good fortune.<br/><br/>To be a teacher for the Dragon King’s dragon children?<br/><br/>This was a complete leap to the heavens!<br/><br/>All the powerful disciples knew that the thirteen dragon children were the Dragon King’s Dragon Queen’s closest relatives and the Dragon Palace’s treasures.<br/><br/>They were the children that the Dragon King and the others had just wanted.<br/><br/>Even when they had just come out, the Dragon King had given each of the thirteen children a companion pet, an existence at the level of the Great Dao.<br/><br/>In the future, when he became the teacher of the Dragon Sons and daughters, no one would dare to provoke him.<br/><br/>Even the other experts at the level of the Great Dao of the universe had to be polite to him.<br/><br/>Moreover, if he became the teacher of the Dragon Sons and daughters, would he not receive any benefits?<br/><br/>I’m afraid the tangible and intangible benefits are beyond his imagination.<br/><br/>“Wow, it’s such a leap to be a teacher for the dragon children, Mrs. Zhuge.”<br/><br/>“Yes, if nothing else, there will be no shortage of powerful cultivation resources in the future.”<br/><br/>“The most important thing is the backing of the Dragon Palace. This is simply too enviable. The future Dragon Sons and daughters will be the successors of the Dragon Palace. They will have high positions and power. It will be easy for them to cultivate to the level of the Great Dao. It is unimaginable to become their teacher.”<br/><br/>In the surrounding area, all the powerhouses immediately revealed envious expressions.<br/><br/>This was a great fortune.<br/><br/>Some of the powerhouses who had acting skills were tempted. Very soon, another powerhouse from the Heaven’s origin realm went on stage to perform.<br/><br/>As for embarrassing himself? Lowering his status?<br/><br/>If he could catch the Dragon King’s eye, what would that be?<br/><br/>The second powerhouse from the Heaven’s origin realm went on stage to perform a Great Dao chess game. The Heaven and earth evolved.<br/><br/>Even though he wasn’t able to become the teacher of the dragon son and dragon daughter.<br/><br/>However, Wang Xian rewarded him with a treasure that matched his level of Tianyuan creation.<br/><br/>This treasure could allow him to increase his combat strength when he had just entered the Tianyuan creation level.<br/><br/>This disappointed the Tianyuan creator but at the same time, he was also a little excited.<br/><br/>What the heck? He could obtain such a treasure just by performing hard. It was a huge profit!<br/><br/>Following that, one by one, the powerhouses of the Heaven’s origin realm rushed onto the stage to perform.<br/><br/>The atmosphere also became very lively.<br/><br/>“Hahaha, Old Man Hua, no, no, let me do it!”<br/><br/>“Sigh, since your talent is not good enough, don’t go up and play awkward. Come Down, Haha!”<br/><br/>“Yes, yes, if you want to receive the Dragon King’s reward, you have to at least put on a good show. Don’t be thick-skinned.”<br/><br/>More and more powerhouses of the Heaven’s origin realm went up. Those who couldn’t put on a good show were directly ridiculed by the powerhouses below.<br/><br/>This made the powerhouse smile awkwardly and immediately left the stage.<br/><br/>Wang Xian, Guan Shuqing, and the rest of the group, as well as the little ones, looked on with smiles on their faces.<br/><br/>All those who performed well were rewarded with a weapon that was comparable to a powerhouse who had just entered the Heaven’s origin realm.<br/><br/>“Haha, Thank You All for performing on the stage. It’s very interesting. Next, we’ll give all the disciples who have arrived a stage and an opportunity. All the disciples can go on stage.”<br/><br/>“Let’s Spar and compete. The person who wins first place this time will receive a heavenly yuan creator’s treasure. The other nine will receive a treasure that is comparable to a beginner-level heavenly yuan creator’s treasure. The next ten will be rewarded with an elemental god fragment of the corresponding attribute.”<br/><br/>“My Dragon Palace’s disciples will also participate, but they will not participate in the reward!”<br/><br/>After the group of Heaven Origin Creation Realm powerhouses finished their performance, Wang Xian continued with a smile!<br/><br/>“Kid, go on stage. Get the first place and get the Heaven Origin Creation Treasure!”<br/><br/>“Disciple, go on. Today, we will make our divine elephant universe famous. hahaha!”<br/><br/>“Brother Qing, you are the top heaven’s favorite of this generation of our Justice Alliance. I believe that you will definitely be able to compete for the first place!”<br/><br/>When Wang Xian had just announced the results, the group of Heaven’s origin creation stage powerhouses became excited as well.<br/><br/>As for the core disciples who had rushed over as well as the disciples who were at the peak of the ruler realm, they were so excited that they were trembling.<br/><br/>They were competing with the heaven’s favorites from hundreds of other universes.<br/><br/>If they were able to obtain the first place, it could be said to be world-shaking.<br/><br/>In addition, there was also the extremely powerful treasure prepared by the Dragon King.<br/><br/>The first Tianyuan destiny-level supreme treasure.<br/><br/>Among the twenty Tianyuan destiny-level powerhouses, at most one of them had such a supreme treasure.<br/><br/>Even if they could not get the first place, as long as they could get into the top ten, the reward would make the Tianyuan destiny-level powerhouses envious.<br/><br/>One by one, the disciples at the peak of the ruler realm stepped onto the arena excitedly.<br/><br/>Then, the competition lasted for two years.<br/><br/>The prodigies of the various universes competed for glory.<br/><br/>All sorts of divine arts, mantras, constitutions, bloodlines, mutated attributes, and so on illuminated the sky.<br/><br/>This was a wonderful performance for the heaven origin creation realm experts.<br/><br/>Within two years, the first place was contested.<br/><br/>The first place was obtained by a disciple of the Behemoth Alliance. He was not a member of the Behemoth Universe.<br/><br/>Instead, he was a disciple of a universe under the Behemoth Alliance.<br/><br/>By cultivating the light attribute, he possessed a kind of mutated power of light. His attacks were extremely strange and powerful.<br/><br/>“Mutated power of light. Not bad. It’s very strong and not too old. You can look forward to the future. This light attribute Ultimate Treasure of Heaven’s origin creation will be injected into your body. Try to break through to the Heaven’s origin creation realm as soon as possible and create your own legend.”<br/><br/>Wang Xian waved his arm and injected a heaven’s origin creation treasure into the body of that disciple. He said with a smile.<br/><br/>“I, Guang Minghao, Thank You Dragon King for the treasure. Thank you, Dragon King!”<br/><br/>That disciple immediately knelt there. His face was filled with excitement and excitement as he kowtowed.<br/><br/>Wang Xian waved his hand. The rest of the disciples who were ranked in the top 20 received their rewards.<br/><br/>“In the remaining 1,000 years, I will carry out the preaching of the Dao. I will perform the changes of the world and the changes of the living beings, leading straight to the peak of chaos. You will comprehend as much as you can!”<br/><br/>After the group of disciples left, Wang Xian swept his gaze across all the strong disciples and said.<br/><br/>This was one of the greatest benefits he gave to all the strong disciples.<br/><br/>Preaching of the Dao.<br/><br/>The current Wang Xian could create living beings of the chaos level.<br/><br/>His preaching was suitable for all living beings. The breakthrough of shackles and the transformation of higher realms.<br/><br/>It was of great use to the Alliance leader of the Justice Alliance and a few experts of the primal chaos level.<br/><br/>To them, this was more precious than obtaining the ultimate treasure of the Heaven’s origin creation.<br/><br/>To those disciples, this could be said to be a change in fate.<br/><br/>As for whether they could seize it or not, it was up to them!<br/><br/>As soon as Wang Xian finished his sentence.<br/><br/>All the strong disciples around him immediately stood up. Their faces were filled with excitement.<br/><br/>“We will listen to your teachings!”<br/><br/>The six experts at the primal chaos level took the lead and replied respectfully.<br/><br/>“We will listen to your teachings!”<br/><br/>All the strong disciples also bowed respectfully.<br/><br/>Their faces were filled with anticipation.<br/><br/>The existence of chaos to preach to them, this kind of opportunity, only one!\t\t\t\t\t\t</div>", "images": {}, "success": true}