{"id": 1576, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15199059.html", "title": "Chapter 4579 - Chapter 4579: 4578 Alone Intimidated A Resplendent Alliance", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4579 - Chapter 4579: 4578 Alone Intimidated A Resplendent Alliance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4579: 4578 alone intimidated a resplendent alliance<br/><br/>“Hiss, how is this possible? Our Alliance leader was actually suppressed. This… how is this possible?”<br/><br/>“The other party was able to suppress our alliance leader with just a few moves. Could it be that this person is even more powerful than the Calamity Lord?”<br/><br/>“Not good, our alliance leader isn’t his match. Attack!”<br/><br/>In the Universal Holy Land, all the powerful disciples saw this scene and their pupils contracted slightly. Their faces were filled with shock.<br/><br/>Their leader of the Apocalypse was no match for the other party.<br/><br/>Furthermore, the other party’s terrifying hand had directly trapped their leader.<br/><br/>The expressions of the twenty primal chaos level experts changed drastically.<br/><br/>One of the primal chaos level experts let out a low roar. His body emitted a terrifying aura as he flew upwards.<br/><br/>In the surroundings, a group of heaven origin creator-level powerhouses also flew upwards. Each and every one of their auras locked onto Wang Xian.<br/><br/>When more than ten thousand heaven origin creator-level powerhouses moved together, this terrifying aura caused even the entire chaos to change color.<br/><br/>More than ten thousand heaven origin creator-level powerhouses. The Aura that they gathered together, what kind of concept was this?<br/><br/>Wang Xian’s current realm was comparable to forty-three chaos-level existences.<br/><br/>And a powerhouse of the primal chaos realm was comparable to 27 existences who had just entered the Heaven’s origin creation realm.<br/><br/>43 existences of the primal chaos realm were only comparable to more than 1,000 of the weakest powerhouses of the Heaven’s origin creation realm.<br/><br/>These over 10,000 powerhouses of the Universal Alliance’s Heaven’s origin creation realm were many of the primal chaos realm, the Great Dao realm, and the control realm.<br/><br/>This might even moved Wang Xian.<br/><br/>However, when Wang Xian saw all the heaven origin creation stage powerhouses in the Universal Alliance flying over, he let out a cold smile.<br/><br/>“Why? Do you want to gang up on Me?”<br/><br/>Wang Xian looked at them with a look of disdain.<br/><br/>If the other party really dared to gang up on him, it would be easy for him to leave.<br/><br/>In that case, he could totally destroy the Universal Alliance one by one. He did not have the confidence to destroy the entire universal alliance, but he had the confidence to destroy the entire Universal Alliance.<br/><br/>This would cause the universe alliance to pay an extremely tragic price.<br/><br/>“I will give you ten seconds. Get down here immediately. Otherwise, you are going to start a war with me.”<br/><br/>Wang Xian coldly swept his gaze across the tens of thousands of heaven origin creation stage powerhouses. He wasn’t afraid at all.<br/><br/>“How arrogant. You Dare to be so arrogant in front of the tens of thousands of heaven origin creation stage powerhouses of the Universe Alliance? Do you really think we are afraid of You?”<br/><br/>A chaos-level powerhouse was filled with anger when he heard Wang Xian’s words.<br/><br/>“Hehe, you guys can try.”<br/><br/>Wang Xian stared at them with a look of disdain. So what if there were 10,000 heaven origin creation stage powerhouses.<br/><br/>So what if there was an extremely dazzling universal alliance?<br/><br/>In his opinion, the strength of the Universal Alliance leader was only so-so. He could even completely destroy it.<br/><br/>“Stand down, stand down immediately.”<br/><br/>The Universe Alliance leader was being suppressed at this moment. He hurriedly shouted at his subordinates.<br/><br/>At this moment, he was completely suppressed by this terrifying palm.<br/><br/>His strongest technique did not have the slightest effect on this mysterious expert.<br/><br/>On the contrary, the other party easily suppressed him.<br/><br/>Moreover, the other party was actually able to control the power of the entire chaos.<br/><br/>This caused him to feel shocked and despair.<br/><br/>He and this mysterious expert in front of him were completely not on the same level.<br/><br/>The Gap was too big!<br/><br/>He knew very well that it was too difficult to kill such an expert.<br/><br/>Even if their universal alliance had many experts, it was still very difficult to keep him.<br/><br/>Once he completely became their enemy, he could completely destroy them one by one.<br/><br/>One by one.<br/><br/>If that really happened, they wouldn’t be able to stop it at all.<br/><br/>Even if they had tens of thousands of great beings working together, the other side wouldn’t dare to go against them, but what about their universes?<br/><br/>The Universe alliance had more than 2,000 universes, and each of them was so far away from each other.<br/><br/>The other side couldn’t do anything to them, but to destroy their universes, they couldn’t do anything at all.<br/><br/>“It’s the Alliance leader.”The expressions of the experts changed when they heard the Alliance leader’s words. They immediately retreated.<br/><br/>“HMPH!”<br/><br/>Wang Xian snorted softly. His gaze landed on the Alliance leader of the Universal Alliance. “I have a few questions to ask you next.”<br/><br/>“I’ve lost. Please ask, Senior.”<br/><br/>The Alliance leader of the Universal Alliance took a deep breath and said.<br/><br/>Seeing that he was still sensible, Wang Xian immediately withdrew the chaos hand. He was not afraid that the other party would run away, nor was he afraid that the other party would go back on his words.<br/><br/>If the other party really dared to play tricks, Wang Xian might as well make the entire universe alliance disappear completely.<br/><br/>“What abilities do you have after you break through by absorbing the Wind-type Chaos Supreme Treasure?”<br/><br/>Wang Xian stared at him and asked.<br/><br/>“Senior.”<br/><br/>Faced with Wang Xian’s question, the Universal Alliance leader cupped his hands and said, “After I absorbed the Chaos Supreme Treasure and broke through to the Master of the cardinal tribulations, my control over the wind-type has reached an unbelievable level. I can refine and absorb all the wind-type treasures and turn them into my own power.”<br/><br/>“What else?”Wang Xian continued to ask.<br/><br/>“HMM? What else is there? I feel that as long as I absorb enough wind-type energy, my strength can continue to increase indefinitely.”<br/><br/>The Universal Alliance leader continued to answer.<br/><br/>“Can I absorb wind elemental energy directly in the chaos and increase my strength directly?”<br/><br/>Wang Xian’s eyes flickered as he continued to ask.<br/><br/>“This is also possible. However, I have to separate the wind elemental energy from the chaos. This is more troublesome. It’s better for me to absorb and increase my strength directly in the universe. In addition, I can look for the wind elemental god to refine and increase my strength.”<br/><br/>The Universe Alliance leader answered honestly.<br/><br/>He did not dare to lie to Wang Xian.<br/><br/>“Is there nothing else? For example, creating a wind attribute treasure directly? Creating a heaven origin creation treasure?”<br/><br/>Wang Xian narrowed his eyes slightly.<br/><br/>“Creation? Senior, with my strength, I can create a treasure that is comparable to an ordinary heaven origin creation realm treasure. As for creating a heaven origin creation treasure, that is impossible. Perhaps if I were given a billion years, I would be able to create one.”<br/><br/>The Universe Alliance leader shook his head immediately. Then, he recalled that Wang Xian was able to control the entire power of the chaos, he looked at Wang Xian in surprise. “Senior, you can create a heaven’s origin creation supreme treasure? You can directly absorb all the power in the Chaos?”<br/><br/>Wang Xian pondered and did not answer him.<br/><br/>He did some divination and calculations. He knew that the Universe Alliance leader was not lying.<br/><br/>He had only brought the wind attribute to the calamity realm. To create a treasure, he needed not only a single attribute, but other attributes as well.<br/><br/>It should be no problem for the Universal Alliance to create a wind attribute elf. However, in order for it to gain intelligence, he might need to borrow other items.<br/><br/>After understanding the situation, Wang Xian had a rough understanding of the situation.<br/><br/>If the Alliance leader of the Universal Alliance wanted to achieve his level, he would have to be able to fuse the other nine attributes. However, he would have to obtain the Chaos Supreme Treasure with the other nine attributes and improve himself.<br/><br/>The difficulty was almost zero.\t\t\t\t\t\t</div>", "images": {}, "success": true}