{"id": 1570, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15189429.html", "title": "Chapter 4573 - Chapter 4573: On The Resplendent 4572 Region", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4573 - Chapter 4573: On The Resplendent 4572 Region</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4573: On the resplendent 4572 region<br/><br/>“Above Chaos?”<br/><br/>When Wang Xian heard their words, his eyes lit up.<br/><br/>This was the first time he heard that there was an existence above chaos.<br/><br/>Of course, he didn’t count himself.<br/><br/>Back then, he heard from the Divine Roc of the nine heavens that he had wandered around for countless of years, yet he still couldn’t find an existence above chaos. He also couldn’t find a way to evolve.<br/><br/>“Could it be that this fellow, the Divine Roc of the Nine Heavens, has existed for a very long time? His nirvana this time around has lasted for a very, very long time.”<br/><br/>“Perhaps this fellow did not communicate with other experts. After all, the Divine Roc of the Nine Heavens is a giant beast of chaos. It is normal for it to not communicate with experts from other universes. Therefore, it does not know about the information about the Supreme Treasure of chaos and the existence above chaos.”<br/><br/>Wang Xian thought to himself.<br/><br/>“Do you know the specific location and direction of that area?”<br/><br/>Wang Xian looked at them and asked.<br/><br/>“Senior, we only know a little about the specific location. We haven’t been there before. The location is in that direction.”<br/><br/>An elder at the level of chaos pointed in a direction and said!<br/><br/>“Okay!”<br/><br/>Wang Xian nodded his head and waved his hand. A surge of energy instantly entered the body of the elder at the chaos level. “Let me retrieve the memories in your mind. Don’t worry, I won’t hurt you.”<br/><br/>As he spoke, the information regarding that mysterious and powerful bright land gushed into Wang Xian’s mind.<br/><br/>However, at this moment, the elder at the chaos level was dumbfounded by all the strong disciples around him.<br/><br/>Their expressions became a little aghast!<br/><br/>Buzz<br/><br/>However, after Wang Xian transferred the memories, he did not bother with them anymore. With a move of his body, he disappeared instantly.<br/><br/>He had some understanding of that bright land.<br/><br/>“This… this… he can directly transfer the memories in my mind. This is not something that the primal chaos realm can do. He is definitely an existence above the primal chaos realm. Hiss!”<br/><br/>When Wang Xian left, the elder at the realm of chaos roared in disbelief.<br/><br/>“It is rumored that there are existences above the realm of chaos in that region. However, this is just a legend. I didn’t expect that there would be experts above the realm of chaos appearing before us today. In this realm of chaos, how many existences above the realm of chaos are there?”<br/><br/>“We think that we are invincible. From the looks of it, we are still a little weak.”<br/><br/>Another chaos-level powerhouse had a bitter expression on his face.<br/><br/>A terrifying existence that could access their memories was definitely not a chaos-level powerhouse.<br/><br/>After Wang Xian obtained the information regarding the resplendent land, he immediately rushed over.<br/><br/>He was filled with curiosity regarding the existence of other existences above the chaos.<br/><br/>He was curious. How strong was this level of powerhouse?<br/><br/>How much of a difference was there between him and himself?<br/><br/>Or rather, who was stronger, him or himself?<br/><br/>Of course, Wang Xian still believed that he should be stronger.<br/><br/>According to the old man’s memory, that region was indeed very far away.<br/><br/>If an expert at the primal chaos level were to fly, it would probably take close to a billion years.<br/><br/>An ordinary heavenly yuan creator would probably need tens of billions of years or even more to reach there.<br/><br/>A journey of tens of billions of years was a long process for a heavenly yuan creator.<br/><br/>In fact, there wouldn’t be a heavenly yuan creator who could fly so far.<br/><br/>That was because all resurrection treasures had a distance limit.<br/><br/>When he flew too far, he would lose contact with the Resurrection Treasure. Therefore, once he died, he would truly die.<br/><br/>A heaven origin creator wouldn’t recklessly travel in the chaos.<br/><br/>Wang Xian didn’t mind. He really didn’t believe that there would be a powerhouse who could threaten him.<br/><br/>In addition, he had the ability to predict danger in advance.<br/><br/>A chaos-level powerhouse would need close to a billion years to reach a place. Wang Xian only needed a few million years to use his time domain.<br/><br/>His speed was something that a chaos-level powerhouse could not fathom.<br/><br/>Time passed quickly. Wang Xian flew for more than a million years and passed by a new region Midway.<br/><br/>There were more than a thousand universes in this region, but they did not form a powerful force.<br/><br/>There was also a special region here. However, the most valuable chaos treasure in this region had also been taken away by someone.<br/><br/>According to Wang Xian’s guess, it should have been done by the powerhouses in that resplendent region.<br/><br/>“There should be existences above chaos in that resplendent region.”<br/><br/>After obtaining so many resources, it was quite possible for an expert to break through to the level above chaos.<br/><br/>In addition, there must be quite a number of experts at the primal chaos realm in that bright area.<br/><br/>That was because they had obtained too many treasures.<br/><br/>According to Wang Xian’s speculation, the forces in that area had obtained five to six times more resources and treasures than the Dragon Palace.<br/><br/>This was at least a must.<br/><br/>That was because the most powerful treasure in every area was the Supreme Treasure of the primal Chaos Realm.<br/><br/>Around the Chaos Supreme Treasure, there would be a large amount of other treasures and resources.<br/><br/>“I’m really looking forward to this resplendent region. I hope there will be experts who can fight with me.”<br/><br/>Wang Xian mumbled as a look of anticipation appeared on his face.<br/><br/>Now that he was invincible, it was lonely to be invincible.<br/><br/>Now, he wanted to meet an existence who was evenly matched and fight with him.<br/><br/>He continued to fly forward from this region. Three million years passed once again.<br/><br/>Wang Xian finally arrived at the dazzling place that the chaos-level powerhouse mentioned.<br/><br/>“HMM?”<br/><br/>After he passed through dozens of universes in this region, he looked at the chaotic void in front of him with an astonished expression.<br/><br/>In the region in front of him, there were spaceships that were emitting a powerful aura flying in the chaos.<br/><br/>The spaceships were extremely huge and were emitting a powerful aura.<br/><br/>Furthermore, there was an unknown number of spaceships. There were a total of two of them.<br/><br/>Wang Xian sensed with his mind that there were more than 10,000 strong disciples on the spaceships. Among them, the weaker ones were only at the first level of the ruler realm.<br/><br/>“As expected of a dazzling place. Although I can’t see the whole picture, I can see a few of them just by looking at the spaceships that are flying in the chaos.”<br/><br/>Wang Xian mumbled.<br/><br/>During this calamity, even in the current nine-origin universe, all the powers were dominated by the Dragon Palace.<br/><br/>However, there was no such scene where a weak disciple dared to fly in the chaos.<br/><br/>The region that he had encountered before did not have such a situation.<br/><br/>This was because, after all, it was the period of the calamity. Entering the chaos was fraught with danger.<br/><br/>Now, there was actually a spaceship traversing through the chaos.<br/><br/>“It seems that this region has been unified. Moreover, it is an exceptionally powerful organization.”<br/><br/>Wang Xian mumbled. He concealed his body and entered the spaceship in an instant.<br/><br/>In the two spaceships, the strongest one was an expert at the control level.<br/><br/>Wang Xian arrived in front of him silently. He immediately unleashed his soul capturing power.<br/><br/>Waves of information were transmitted into his mind.<br/><br/>When he received this information, his eyes flickered slightly and revealed a hint of surprise.\t\t\t\t\t\t</div>", "images": {}, "success": true}