{"id": 1575, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15193570.html", "title": "Chapter 4578 - Chapter 4578: 4,577 Hands Pressed Down", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4578 - Chapter 4578: 4,577 Hands Pressed Down</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4578: 4,577 hands pressed down<br/><br/>“Our leader’s power feels like it can destroy an entire universe. It’s too terrifying.”<br/><br/>“That person who’s on the same level as our leader is definitely not a match for our leader.”<br/><br/>“Of course. Our leader has lived for countless years and has been invincible in several regions. We’ve never met anyone who can fight against him.”<br/><br/>In the Universal Holy Land, a group of strong disciples looked at the gigantic alliance leader who was standing in the sky. Their faces were filled with reverence.<br/><br/>They were discussing among themselves. They had absolute faith in their alliance leader’s strength.<br/><br/>Their alliance leader was an invincible existence. He was the strongest existence.<br/><br/>“Today, I will defeat you to test my Invincible Dao.”<br/><br/>The leader of the Universal Alliance stared at Wang Xian. His eyes were filled with fighting spirit and excitement.<br/><br/>As he spoke, he extended his finger and pointed at Wang Xian.<br/><br/>This finger seemed to pierce through the void space directly.<br/><br/>It seemed to pierce through everything and arrived in front of Wang Xian directly.<br/><br/>“Your strength is not bad, but you are still a little too weak.”<br/><br/>Wang Xian looked at the attack of the leader of the Universal Alliance. With a calm expression, he waved his arm.<br/><br/>Bang<br/><br/>Crack! Crack! Crack<br/><br/>The gigantic finger began to crumble and dissipate at a terrifying speed.<br/><br/>In the sky, the huge universal alliance leader’s expression changed when he saw that his attack was instantly defeated.<br/><br/>“Bring out all your strength and all your trump cards. Don’t disappoint me.”<br/><br/>Wang Xian moved and arrived in the chaotic void in front of the Universal Alliance leader. He stared at him calmly.<br/><br/>“Good, good, good. As expected of an existence on the same level as me. As expected of an existence on the same level as me.”<br/><br/>The Universal Alliance leader stopped looking down on Wang Xian. The hurricane around him spun at a terrifying speed.<br/><br/>He extended an arm and the arm detached from his body.<br/><br/>The entire arm was covered in various types of armor and special skin.<br/><br/>The armor was exuding an extremely terrifying might. On the skin, there were various wind attribute giant beasts of chaos roaring and galloping.<br/><br/>The leader of the Universal Alliance had used his own powerful means.<br/><br/>That armor was a weapon that he had nurtured using the ultimate treasure of Tianyuan as the material.<br/><br/>The skin was created by him after hunting a large number of giant beasts of chaos. A large number of souls of giant beasts of chaos were condensed in it.<br/><br/>The terrifying arm flew towards Wang Xian. This strike was enough to pierce through an entire universe.<br/><br/>It was enough to dim the starlight and create a river of stars in the midst of the primordial chaos.<br/><br/>Wang Xian’s eyes sparkled as he looked at this strike.<br/><br/>He stretched out his hand and a dragon claw phantom grabbed towards this arm.<br/><br/>“Roar Roar Roar Roar!”<br/><br/>On the Dragon Claw, there was a divine dragon phantom roaring. The chaotic Dragon Claw absorbed the surrounding power of primordial chaos.<br/><br/>In a breath, a terrifying crack appeared in the surrounding chaotic energy.<br/><br/>The Dragon Claw directly collided with the arm.<br/><br/>However, in the next moment, the chaotic energy on the dragon claw spread toward the arm.<br/><br/>As if it was corroding, it was slowly controlled.<br/><br/>The energy on the arm armor resisted, but it was still dimming.<br/><br/>The Roaring Soul of the Chaos Behemoth quickly fell silent.<br/><br/>Wang Xian looked at this scene and revealed a smile. He waved his arm and the arm of the Universal Alliance leader came in front of him. It shrunk and turned into the purest energy.<br/><br/>“Is this all?”<br/><br/>Wang Xian looked at the Universal Alliance leader in front of him and asked faintly.<br/><br/>“You…”<br/><br/>The Universal Alliance leader’s expression changed drastically. He stared at Wang Xian with a fearful expression.<br/><br/>He had already unleashed most of his strength, yet he was easily neutralized by the other party.<br/><br/>Even his arm was taken away by the other party.<br/><br/>This caused his expression to turn ugly and his heart to feel extremely heavy.<br/><br/>“Hiss… What is going on? In just two moves, our alliance leader’s arm was taken away by that mysterious expert.”<br/><br/>“Oh no, that mysterious expert is not simple. How is this possible? There is actually such a terrifying existence in the chaos?”<br/><br/>“Is this a battle between Great Beings of Calamity Master? It is simply too terrifying. Even if we are primal chaos level existences, once we get close, we will be easily crushed and killed!”<br/><br/>Within the Sacred Land of the Universe Alliance, countless Great Beings’disciples watched this battle in shock.<br/><br/>This was a great battle between Great Beings of Calamity Master.<br/><br/>Especially when they saw that their alliance master was actually at a disadvantage, all of them felt their hearts palpitate!<br/><br/>“Wind demon disintegrated, universe of wind.”<br/><br/>The Universal Alliance leader’s face was filled with a solemn expression as he roared.<br/><br/>In the next instant, their bodies began to disintegrate. Every part of their bodies was emitting a terrifying energy of wind.<br/><br/>The disintegrated bodies flew directly towards Wang Xian’s surroundings.<br/><br/>Each of their limbs was emitting an extremely terrifying energy of wind attribute, causing a terrifying storm to surround Wang Xian.<br/><br/>Wind Blades, wind blades, wind beasts, and all sorts of wind attribute objects were formed.<br/><br/>In the middle of the limbs of the Universal Alliance’s leader, it was as if a wind attribute universe was being born.<br/><br/>The entire universe was the Universal Alliance’s leader. He was the ruler of this universe.<br/><br/>In this universe, he could wear down and destroy everything.<br/><br/>Wang Xian’s gaze swept across his surroundings. The surrounding space had undergone a terrifying transformation.<br/><br/>It was as if he had arrived in an unfamiliar universe.<br/><br/>At the next moment, as if the power came from the entire universe, endless wind blades and wind blades attacked him.<br/><br/>Countless wind attribute behemoths let out savage roars and attacked him.<br/><br/>Endless attacks and endless threats.<br/><br/>“Interesting.”<br/><br/>Wang Xian looked at this special space and universe, his eyes flashing.<br/><br/>His body shook, and a wave of chaotic energy broke through the universe of wind. The surrounding chaotic energy began to compress towards the entire universe.<br/><br/>He transformed into the universe, while Wang Xian transformed into chaos.<br/><br/>Chaos engulfed the universe.<br/><br/>Crack Crack Crack<br/><br/>The entire universe began to be compressed rapidly, and the entire universe began to shrink.<br/><br/>The limbs of the Universal Alliance leader, who was floating around, were suppressed by the chaotic energy.<br/><br/>At this moment, a look of shock and horror appeared on his face. He stared at Wang Xian who was in the middle and roared in disbelief, “How is this possible? How is this possible? How can you mobilize the power of Chaos?”<br/><br/>“Your strength is not bad, but to me, you are still too weak.”<br/><br/>At the next moment, Wang Xian flew out from his universe of wind.<br/><br/>He waved his arm, and the surrounding chaotic energy condensed into an extremely huge palm.<br/><br/>This palm seemed to be bigger than the universe. The palm pressed towards the universe of wind, and the entire universe of wind was in his hand.<br/><br/>The Hand of chaos exerted force, and the universe of wind became smaller and smaller.<br/><br/>“This is impossible. We are both masters of the tribulations, so why is the gap between us so huge? Why are you able to control the power of Chaos?”<br/><br/>The Universe Alliance leader roared in disbelief.<br/><br/>He did not have the slightest ability to resist the terrifying power of chaos.\t\t\t\t\t\t</div>", "images": {}, "success": true}