{"id": 1572, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15191826.html", "title": "Chapter 4575 - Chapter 4575: 4574 Special Techniques", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4575 - Chapter 4575: 4574 Special Techniques</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4575: 4574 special techniques<br/><br/>The foundation of the Universal Alliance was really deep.<br/><br/>Wang Xian looked at the extremely powerful Holy Land of chaos and his eyes were filled with amazement.<br/><br/>He continued to go deeper. He could see the strong disciples in spaceships or flying on treasures.<br/><br/>Each and every strong person was exuding different energies and powers.<br/><br/>Some of them had sword Qi that shot up into the sky.<br/><br/>Some of them had flames that burned the sky.<br/><br/>All kinds of cultivation methods had become a system.<br/><br/>Wang Xian entered and scanned his surroundings. Although there weren’t many heaven origin powerhouses, he could sense them with his powerful divine sense. He could detect the existence of hundreds of heaven origin powerhouses.<br/><br/>“Impressive, truly impressive.”<br/><br/>Wang Xian sighed in his heart. He moved his body and locked onto a great dao level powerhouse.<br/><br/>He arrived in front of him silently and used his soul-absorbing power to check his memories.<br/><br/>Waves of information entered Wang Xian’s mind.<br/><br/>A Great Dao level powerhouse was considered a top existence in the Universal Alliance.<br/><br/>He understood most of the secrets of the Universal Alliance.<br/><br/>Wang Xian obtained new information from this expert’s memories.<br/><br/>Since the establishment of the Universal Alliance, it had already gone through six aeons.<br/><br/>The foundation of the two aeons allowed them to possess a terrifying force.<br/><br/>In addition, within the Universal Alliance, they called their leader, who was above the realm of chaos, the aeons.<br/><br/>They addressed their leader respectfully as the leader of the cataclysm.<br/><br/>It meant an expert who could exist eternally even if there was no cataclysm.<br/><br/>“Leader of the Cataclysm, this title is also acceptable.”<br/><br/>Wang Xian smiled. The only pity was that this expert at the Great Dao level didn’t know the actual strength of their leader, the leader of the cataclysm.<br/><br/>He only knew that the leader of the Cataclysm was an invincible existence.<br/><br/>Wang Xian stood in the void and sensed with his mind. He didn’t sense the existence of the Lord of calamity.<br/><br/>“He’s not here. According to the past situation, the Lord of calamity will come during the universal immortal gathering.”<br/><br/>Wang Xian mumbled and prepared to wait for some time.<br/><br/>He could directly threaten the lord of calamity to appear.<br/><br/>However, Wang Xian gave it some thought and gave up.<br/><br/>The Universal Alliance was too powerful.<br/><br/>There were more than 10,000 powerhouses at the Heaven’s fate level and 20 existences at the chaos level.<br/><br/>In addition to the Lord of calamity and the territory that belonged to them.<br/><br/>All the powerhouses and all their resources combined, Wang Xian was no match for them.<br/><br/>At present, Wang Xian’s realm was comparable to 43 existences of the chaotic realm.<br/><br/>Even if he was stronger in actual combat, it would still be very troublesome to face the combined forces of a huge force.<br/><br/>Most importantly, Wang Xian did not know the strength of the Lord of calamity.<br/><br/>What if the Lord of calamity was not weaker than him?<br/><br/>After all, Wang Xian was not very clear about the realm above the chaotic realm.<br/><br/>He didn’t know if everyone was like him. If they broke through to the realm above chaos, they would be able to improve without limits.<br/><br/>They would be able to absorb treasures without limits.<br/><br/>If the Lord of Calamity was the same, then the other party’s strength wouldn’t be simple.<br/><br/>“According to my divination, after fusing with the supreme treasure of chaos and breaking through, they would be able to absorb treasures of the same attribute to improve themselves. It’s impossible for them to absorb the power of chaos directly.”<br/><br/>“However, all of this is just my own divination. I still need to verify it.”<br/><br/>This master of the Apocalypse was the person Wang Xian verified.<br/><br/>His gaze swept across the surroundings. In this chaotic Holy Land of the universe, there were more than ten million strong disciples.<br/><br/>In addition, from time to time, there would be all kinds of huge spaceships rushing over.<br/><br/>“There are more than two thousand universes nearby. If each universe has a spaceship that is comparable to the strength of a heaven origin creator, it would be truly spectacular and terrifying.”<br/><br/>Wang Xian thought to himself. His gaze landed on a restaurant that was filled with a modern style, and he flew over immediately.<br/><br/>He wanted to taste the delicacies of this world.<br/><br/>Wang Xian entered the restaurant. More than half of the customers in the restaurant were already seated.<br/><br/>A portion of the strong disciples were talking about the upcoming universal celestial gathering. They were talking about which universe, who was who, and how powerful they were.<br/><br/>They were talking about a certain genius, how many universes he had conquered, and what kind of cultivation techniques he had learned.<br/><br/>Wang Xian listened with great interest!<br/><br/>This was the true brilliance, the true glory. It was not something that the nine-origin universe could compare to.<br/><br/>The geniuses from the other universes were fighting each other.<br/><br/>All Kinds of divine arts and divine arts were shining brightly.<br/><br/>The delicacies here were also unique and had the characteristics of this world.<br/><br/>Wang Xian tasted the food and nodded his head slightly. It was pretty good to be able to come across such a bright area after traveling through the various universes and the chaotic world.<br/><br/>For the next period of time, Wang Xian went to various restaurants to taste the delicacies every day. He went to some arenas to watch some of the strong disciples sparring.<br/><br/>It also benefited him greatly.<br/><br/>He learned about a kind of strange energy, the use of water and space attributes.<br/><br/>In the Universal Alliance, there was a race in the universe that was born with the power of water and space.<br/><br/>They could leave a puddle of water in a place, and within a certain range, they could instantly return to the puddle of water.<br/><br/>They could leave their own water in a lake or river, and they could also instantly return to this place.<br/><br/>This was somewhat similar to a special space teleportation, similar to the demon spirit altar.<br/><br/>However, it was much more convenient than the demonic spirit altar.<br/><br/>The demonic spirit altar required him to set up an altar himself.<br/><br/>This kind of special water stain was sufficient.<br/><br/>Moreover, if he were to wrap the water flow around an area, he could appear anywhere.<br/><br/>It was faster and more terrifying than teleportation.<br/><br/>Wang Xian analyzed this ability and integrated it into his other attributes. He even integrated it into the chaos.<br/><br/>This ability caused his combat strength to skyrocket instantly.<br/><br/>What kind of concept was this? In other words, with his power of chaos, he could transform any attribute.<br/><br/>In the future, he could make this area his domain in any region.<br/><br/>He was omnipresent in this domain.<br/><br/>When coupled with the time domain, Wang Xian felt that this move was a little too abnormal and invincible.<br/><br/>It was almost impossible to restrain.<br/><br/>That was because, as long as you used any attribute, I could transform it.<br/><br/>“Not bad, not bad.”<br/><br/>Wang Xian nodded his head slightly. “This trip was not in vain. It can increase my combat strength by a lot.”<br/><br/>Apart from this powerful ability, Wang Xian also learned about some new technological powers.<br/><br/>The Universal Alliance’s technological powers were very powerful.<br/><br/>It far surpassed the mechanical ascension to the universe back then.<br/><br/>The technological attack methods and investigative capabilities of their organization had inspired Wang Xian greatly.<br/><br/>With a deeper understanding, he could use the power of chaos to condense a robot. This robot possessed formidable strength.<br/><br/>Wang Xian could even condense a robot with the power of chaos.\t\t\t\t\t\t</div>", "images": {}, "success": true}