{"id": 1574, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15193569.html", "title": "Chapter 4577 - Chapter 4577: Under The 4576 Cardinal Tribulations Master", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4577 - Chapter 4577: Under The 4576 Cardinal Tribulations Master</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4577: Under the 4576 cardinal tribulations master<br/><br/>“I want to compete with this cardinal tribulations master.”<br/><br/>Wang Xian looked at the cardinal tribulations master in front of him. He was still prepared to spar with him.<br/><br/>Although he couldn’t obtain it, his strength was much stronger than this cardinal tribulations master.<br/><br/>However, he wasn’t sure how much stronger he was.<br/><br/>There was another point. Wang Xian wanted to understand how strong he was now.<br/><br/>He wanted to get the chaos treasures that were taken away by the Universal Alliance.<br/><br/>These chaos treasures were extremely rare. There was only one of them in the entire universe. Therefore, he had to get it.<br/><br/>There were two ways to get it. One was to snatch it directly.<br/><br/>The other way was to use his powerful strength to pressure them and make them hand it over.<br/><br/>The Universal Alliance was a relatively fair area. The experts here did not kill the innocent. They were not unforgivable people. Therefore, Wang Xian was not prepared to use his powerful strength and forceful methods to clash with them.<br/><br/>Wang Xian sat there quietly and watched the continuation of this grand gathering.<br/><br/>In front of him, the Lord of calamity was also watching indifferently with a satisfied expression on his face.<br/><br/>Following the end of the duel between the disciples, what followed was the activity and sparring between the powerhouses of the Heaven’s origin realm.<br/><br/>Between powerhouses below the level of the Great Dao, there would be a competition.<br/><br/>This battle would be much more intense and exciting.<br/><br/>However, within the spatial formation, the battle would not affect too many areas.<br/><br/>Wang Xian was also watching quietly and enjoying it.<br/><br/>Time passed. After 10,000 years, the battle between the powerhouses in the Heaven’s origin realm had ended.<br/><br/>Following that, there were some exchange sessions.<br/><br/>“Everyone.”<br/><br/>At this moment, the leader of the Universal Alliance, who had been watching the entire banquet, suddenly spoke.<br/><br/>“Please speak, Alliance leader.”<br/><br/>When all the strong disciples heard the leader of the Universal Alliance’s words, they immediately stood up and said respectfully.<br/><br/>“Right now, the Universal Alliance has already reached an extremely bright stage. There is no longer any good development in our region. Next, we will prepare to open up other regions.”<br/><br/>“The chaos is huge, and there are many regions like ours. However, there are not many who are as strong and brilliant as us. Right now, the quota for the Universal Alliance in the Heavenly Yuan blessed realm has almost all been used up.”<br/><br/>“If our alliance wants to continue to grow, we have to head to other regions to look for a slot for a breakthrough. We will open up a path to the next region and the next universe.”<br/><br/>The Lord of calamity swept his gaze across all the experts and spoke faintly.<br/><br/>“Yes, Lord Alliance leader.”<br/><br/>“We will follow your orders.”<br/><br/>All the expert disciples immediately replied respectfully.<br/><br/>Wang Xian was mixed in with the group of disciples. When he heard the words of the Lord of calamity, his eyes flickered slightly.<br/><br/>They were preparing to go to other regions. Going to war would definitely be the start of the war.<br/><br/>The Universal Alliance had already reached its peak of brilliance and glory. Their quota of Heavenly Yuan destiny realm powerhouses had already been used up.<br/><br/>If they wanted to improve further, they had to expand. They had to conquer other universes and other regions.<br/><br/>This was an inevitable development.<br/><br/>“The Universal Alliance is really dazzling. Today, the Dragon King of Japan is here to experience the strength of the Lord of Calamity.”<br/><br/>At this moment, Wang Xian also started to move.<br/><br/>Now, he had understood everything that he needed to understand. Next, it was time to get down to business.<br/><br/>His voice spread throughout the entire region and reached the ears of all the strong disciples.<br/><br/>His figure stood directly in the air. He looked at the Lord of calamity from afar with a smile on his face.<br/><br/>“HMM?”<br/><br/>Wang Xian’s sudden words stunned all the strong disciples of the Universal Alliance.<br/><br/>Following that, they looked at Wang Xian’s figure in astonishment.<br/><br/>“Who are you? How dare you to make a ruckus in front of our alliance leader?”<br/><br/>A chaos-level powerhouse stared at Wang Xian coldly.<br/><br/>Wang Xian’s gaze swept across the chaos-level powerhouse.<br/><br/>Thud<br/><br/>The next moment, the Universal Alliance’s elder knelt on the ground with a horrified look on his face. His body was completely out of control.<br/><br/>“Hiss, this? ?”<br/><br/>“Third Elder!”<br/><br/>In the surroundings, the other chaos-level powerhouses as well as the heaven origin powerhouses looked at the third elder in disbelief.<br/><br/>“An expert at the Calamity Lord Level.”<br/><br/>The third elder who was kneeling on the ground, unable to control himself, had cold sweat on his forehead.<br/><br/>His eyes were filled with fear.<br/><br/>The other party looked over, and he actually kneeled down uncontrollably.<br/><br/>This made him feel extremely terrifying, extremely terrifying.<br/><br/>This was definitely an existence at the calamity lord level.<br/><br/>“HM? An existence at the same level? No Wonder I didn’t find you. Hahaha, good, good!”<br/><br/>The Universe Alliance leader was also slightly stunned, and then he laughed out loud, his eyes were filled with excitement and fervor. “Good, good. I’ve traveled through several regions and traveled for billions of years, but I haven’t met an existence of the same realm. Today, I actually met one.”<br/><br/>“Hahaha, I’ve long wanted to understand just how strong I am. You’ve come at the right time. You can let me know just how strong I am!”<br/><br/>“Hahaha, being invincible is lonely. I can finally have an opponent today. Today, I will crush you and trample you under my feet to test my Invincible Dao.”<br/><br/>The leader of the Universal Alliance was very excited. He was filled with a strong fighting spirit.<br/><br/>He stared at Wang Xian. His eyes were filled with passion.<br/><br/>He had been invincible for too long.<br/><br/>He yearned for an opponent too much.<br/><br/>In addition, he was also very confident in his own strength. He was an invincible existence.<br/><br/>“Hehe.”<br/><br/>Wang Xian looked at the excited Universal Alliance leader and revealed a faint smile. “I also want to know how strong I am now.”<br/><br/>“Then let’s have a battle!”<br/><br/>The Universal Alliance leader moved his body and flew directly into the sky, far away from the Universal Holy Land.<br/><br/>Standing in the chaos, his body began to expand crazily. It was as if his entire body was filled with the entire starry sky domain.<br/><br/>His endless body caused all the powerful disciples of the Universal Alliance to be filled with shock.<br/><br/>Their leader’s body was too big, too big.<br/><br/>The planet in front of him couldn’t even compare to his pupils.<br/><br/>Around him, terrifying wind attribute energy condensed into substance and flowed around his body.<br/><br/>A terrifying aura swept across everything.<br/><br/>Fortunately, the Universal Alliance leader was relatively far away from the Universal Holy Land. Otherwise, just this terrifying aura alone could cause the holy land to collapse.<br/><br/>“Not bad!”<br/><br/>Wang Xian looked at the Universal Alliance leader who had unleashed his full strength. A satisfied expression appeared on his face.<br/><br/>His figure moved and instantly appeared in front of the Universal Alliance leader. He sized him up from head to toe.<br/><br/>Although he was still a little weak, he was still barely passable.<br/><br/>“Hiss, my God, is this the true strength of our alliance leader? How terrifying, why does it feel like he can destroy everything?”<br/><br/>“Too strong, simply too strong. That figure that suddenly appeared, is he on the same level as our alliance leader?”\t\t\t\t\t\t</div>", "images": {}, "success": true}