{"id": 1571, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15189430.html", "title": "Chapter 4574 - Chapter 4574: Under The 4573 Dazzling Area", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4574 - Chapter 4574: Under The 4573 Dazzling Area</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4574: Under the 4573 dazzling area<br/><br/>This dazzling area was indeed extremely dazzling.<br/><br/>According to Wang Xian’s memory from this control level powerhouse, there were a total of 2,300 universes in this dazzling area.<br/><br/>There were two special areas in this area.<br/><br/>The entire area was controlled by a force called the Universal Alliance.<br/><br/>This control level expert was also a member of the Universal Alliance.<br/><br/>The Universal Alliance was the only king in the resplendent region. Over 2,300 universes were all its members.<br/><br/>There were over 10,000 heaven origin creation level experts.<br/><br/>This was an extremely terrifying number.<br/><br/>Another important point was that there were a total of 20 members in the Universal Alliance Elder Group.<br/><br/>And within this elder group, all of them were primal chaos level existences.<br/><br/>The twenty members of the Elder Group were all primal chaos level existences. Then, it was easy to imagine what level of existence the Universal Alliance’s leader was.<br/><br/>Above Primal Chaos.<br/><br/>Yes, this was the most powerful existence in the resplendent region.<br/><br/>He was also known as the publicly acknowledged King.<br/><br/>In the entire Universal Alliance, he was the only existence above primal chaos.<br/><br/>He had fused with a powerful true treasure of heaven and earth, and his power was unfathomable. He was an invincible existence in this region and even in distant regions.<br/><br/>The Universe Alliance leader had swept through several regions.<br/><br/>There was no existence in several regions that could be compared to him.<br/><br/>And the Universe Alliance had obtained powerful treasures in several regions.<br/><br/>This great being was a control level existence, and he knew many secrets.<br/><br/>For example, a few hundred million years ago, there was an elder of the Universal Alliance who wanted to break through above the primal chaos realm. Unfortunately, when he was fusing with the primal chaos true treasure, he couldn’t withstand the energy of the true treasure and died completely.<br/><br/>It was extremely difficult to become an existence above the primal chaos realm.<br/><br/>After succeeding, he could break through.<br/><br/>Once he failed, he would die completely and disappear in the universe.<br/><br/>Because this bright region was unified, there was no war in this region.<br/><br/>All the disputes were settled in the arena.<br/><br/>On the surface, no killing was allowed.<br/><br/>Furthermore, between these 2,300 plus universes, there was a super teleportation formation.<br/><br/>This also allowed the disciples of this universe to carry out universe teleportation.<br/><br/>Especially during this calamity.<br/><br/>The brilliance of the strong also resulted in the brilliance of the disciples.<br/><br/>The number of disciples and the level of elites in the entire region were also terrifyingly strong.<br/><br/>“This is really impressive. If it weren’t for the chaos, where the distance between one region and another is too far, I’m afraid with the Universal Alliance’s strength, they would be able to carry out a cross-region invasion.”<br/><br/>Wang Xian mumbled.<br/><br/>In addition, the Universal Alliance had indeed launched an invasion once.<br/><br/>They invaded the nearest region, but their invasion was very instantaneous.<br/><br/>As the Universal Alliance was too powerful, the other party surrendered.<br/><br/>“This universal alliance is the strongest strength I have ever seen. Even the Dragon Palace Alliance, Justice Alliance, the Ten Days Federation, and the Behemoth Alliance aren’t their match.”<br/><br/>Wang Xian mumbled.<br/><br/>Of course, he had to throw Wang Xian out.<br/><br/>At present, it was hard to calculate Wang Xian’s actual combat strength.<br/><br/>In addition, he learned from the memories of this powerhouse that the destination of this spaceship was the Universal Alliance’s base.<br/><br/>The Universal Alliance’s base was located in a special place.<br/><br/>The current special base had been completely modified.<br/><br/>The Universal Alliance had opened up a Holy Land in the chaos with the strength of many experts.<br/><br/>This holy land, even if it wasn’t during the calamity, ordinary disciples wouldn’t be attacked by the power of chaos.<br/><br/>And they went to the Universal Alliance’s base to participate in the Universal Alliance’s once-in-a-calamity Grand Meeting.<br/><br/>The grand meeting was called the Universal Immortal God banquet.<br/><br/>All universes of the Universal Alliance would participate in this banquet.<br/><br/>At that time, all heavenly yuan destiny realm experts and all elite core disciples would participate.<br/><br/>The banquet was mainly to exchange and share all sorts of treasures and delicacies.<br/><br/>Among them, the competition was the most important one.<br/><br/>At that time, there would even be a competition between control-level experts.<br/><br/>It could be said to be the most important grand gathering in the entire Universal Alliance.<br/><br/>It was also the most dazzling event.<br/><br/>At that time, the alliance master and elders of the Universal Alliance would be there.<br/><br/>Even if it wasn’t the real person, the avatar would still come to participate.<br/><br/>“It seems like I’m quite lucky to have encountered such a grand event. That’s good too. This way, I can better understand the universal alliance. When the time comes, I’ll have a spar with the Alliance Master of the Universal Alliance.”<br/><br/>Wang Xian thought to himself.<br/><br/>He wanted to see how strong the existence above chaos was.<br/><br/>In addition, Wang Xian wanted to take the supreme treasure of the chaos level from them.<br/><br/>Wang Xian needed treasures of this level. He needed to prepare for the Dragon Palace and his children.<br/><br/>With this thought in mind, Wang Xian flew toward the Universal Alliance base quickly according to the memories of this powerhouse.<br/><br/>His speed was not something that this spaceship could compare to.<br/><br/>After flying for a few decades, Wang Xian arrived in front of the Universal Alliance.<br/><br/>He looked ahead. Even though he had obtained some information from the memory of that expert, he was still shocked when he saw it with his own eyes.<br/><br/>In a chaotic space ahead, there were two gigantic trees of chaos standing tall.<br/><br/>The extremely huge chaos tree opened up a space filled with energy.<br/><br/>Apart from the two chaos trees, there was also a special sea of stars.<br/><br/>This Sea of Stars was also a special thing in the chaos.<br/><br/>In the Sea of stars, there were many elemental gods that were emitting light. These elemental gods were sealed by energy and could not cause harm to other creatures.<br/><br/>Similarly, there was an extremely powerful array formation that stood between heaven and earth.<br/><br/>The array formation used more than ten elemental gods of the Great Dao level as energy to support the vast space.<br/><br/>Inside, there was a huge spaceship.<br/><br/>It was a space battleship that was the size of dozens of planets.<br/><br/>There were also various godly mountains and rivers.<br/><br/>These were obviously created by the supreme beings with great power.<br/><br/>“Although I can create a space in the chaos, it will consume a lot of energy. It will take a lot of time just to find the Elemental God and the tree of Chaos.”<br/><br/>Wang Xian looked ahead and mumbled.<br/><br/>However, if he was bored in the future, he could create such a holy land in the chaos.<br/><br/>Wang Xian moved his body and continued to fly in.<br/><br/>As he got closer, a powerful energy was transmitted over. The density of this energy was comparable to that of the top grotto-heaven blessed land in the nine-origin universe.<br/><br/>“The density of the energy in the core of this holy land should be even higher than that of the Dragon Palace.”<br/><br/>Wang Xian guessed that the Universal Alliance’s foundation was too deep.<br/><br/>He could feel the powerful defensive power contained in this holy land.<br/><br/>When these defensive powers were activated, the existence of the realm of chaos could be killed.<br/><br/>There was no escape.\t\t\t\t\t\t</div>", "images": {}, "success": true}