{"id": 1579, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15199066.html", "title": "Chapter 4582 - Chapter 4582: 4581 Breakthrough Of The Divine Roc Of The Nine Heavens", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4582 - Chapter 4582: 4581 Breakthrough Of The Divine Roc Of The Nine Heavens</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4582: 4581 breakthrough of the Divine Roc of the Nine Heavens<br/><br/>The Universal Alliance surrendered.<br/><br/>After witnessing Wang Xian’s invincible strength, the Universal Alliance no longer had any intention to resist.<br/><br/>They handed over all the Chaos Supreme Treasures.<br/><br/>There were more chaos supreme treasures than Wang Xian had expected. There were a total of six of them.<br/><br/>Six Chaos Supreme Treasures. These were all the gains of the Universal Alliance over the years.<br/><br/>They didn’t dare to hand over all of them. They were afraid that Wang Xian would find out and implicate the entire Universal Alliance.<br/><br/>In the battle just now, the leader of the Universal Alliance died and 20 elders were killed.<br/><br/>The death this time was very tragic for the Universal Alliance.<br/><br/>A large number of treasures and resources were obtained by the Dragon King.<br/><br/>“Gold, wood, water, fire, Earth, Thunder.”<br/><br/>Wang Xian looked at the six chaos Supreme Treasures and smiled.<br/><br/>Each chaos supreme treasure contained extremely powerful energy.<br/><br/>Even if these chaos supreme treasures were not absorbed, just by placing them in one place, the energy they emitted and absorbed would form an existence that was not weaker than the Universal Alliance’s Holy Land.<br/><br/>If the six of them were placed together, they would form a holy land with abundant energy.<br/><br/>If one cultivated in this holy land, even the strong ones in the Heaven’s origin realm would gain huge benefits.<br/><br/>Those who had just entered the Heaven’s origin realm would be able to achieve a breakthrough in an extremely short period of time.<br/><br/>“If I devour these chaos treasures, I will be able to increase my strength by at least 20 to 30 chaos levels.”<br/><br/>He mumbled to himself. However, Wang Xian did not plan to absorb these chaos treasures.<br/><br/>Instead, he left them with the Dragon Palace. If there were chaos-level existences in the future, he could use them to make a breakthrough.<br/><br/>In addition, he had obtained a fire-type chaos supreme treasure. The Divine Roc of the Nine Heavens could attempt to make a breakthrough.<br/><br/>If the Divine Roc of the Nine Heavens could make a breakthrough, the Dragon Palace would have an additional existence at the level of the Lord of calamity.<br/><br/>Of course, there was not much difference to the current Dragon Palace.<br/><br/>With Wang Xian’s strength, he could handle everything.<br/><br/>“Very good!”<br/><br/>Wang Xian looked at the six chaos supreme treasures in front of him. With a wave of his arm, he kept them.<br/><br/>His gaze swept across the alliance leader and the rest of the Universal Alliance. The corner of his lips curled up slightly. With a move, he disappeared.<br/><br/>His divination ability had confirmed that there were no chaos supreme treasures in this area.<br/><br/>Wang Xian did not plan to stay here any longer.<br/><br/>He was going back.<br/><br/>He had been out for more than ten million years.<br/><br/>His gains were also huge.<br/><br/>He needed to go back and raise his strength. Then, he would make the Divine Roc of the Nine Heavens Devour the fire attribute chaos supreme treasure to see if he could complete his breakthrough.<br/><br/>“Phew, he’s finally gone!”<br/><br/>When the experts from the Universal Alliance saw Wang Xian leaving, they heaved a sigh of relief.<br/><br/>“Alliance leader, what realm is this mysterious expert at? How could he be so powerful?”<br/><br/>An elder asked with lingering fear.<br/><br/>He was able to kill all of them in an instant. His strength was too terrifying.<br/><br/>“I don’t know. He might be one realm higher than me, or he might be several realms higher than me.”<br/><br/>The Alliance leader of the Universal Alliance shook his head with a dazed look on his face.<br/><br/>“This… are there other realms above the calamity?”<br/><br/>The Elders of the primal chaos realm were shocked, their faces filled with disbelief.<br/><br/>“He can control the power of primal chaos, he can control all the power. The gap between us is too big. The other party’s strength is too invincible.”<br/><br/>The Universe Alliance leader muttered.<br/><br/>Controlling the power of primal chaos, he only controlled the wind attribute.<br/><br/>He had no idea if there were other paths behind the Lord of calamity.<br/><br/>“I really didn’t expect there to be such a terrifying existence in the chaos. Sigh.”<br/><br/>The Elders of the Universal Alliance were a little dispirited.<br/><br/>They thought that the Lord of Calamity was an invincible realm and an invincible existence.<br/><br/>However, they didn’t expect that an even more terrifying powerhouse would come today and be able to kill all of them in an instant.<br/><br/>What kind of existence was this.<br/><br/>Wang Xian did not pay attention to the Universal Alliance leader’s shock. At this moment, he was rushing towards the nine-origin universe.<br/><br/>The distance he flew this time was already very far away.<br/><br/>The harvest was also very huge.<br/><br/>A few million years later, Wang Xian returned to the nine-origin universe and returned to the Dragon Palace. After sending a message to the Divine Roc of the Nine Heavens, he began his closed-door cultivation.<br/><br/>He had to start absorbing the resources in his hands. The most important thing was to increase his own strength.<br/><br/>After absorbing all the resources, he spent 100,000 years in the time domain.<br/><br/>He smiled as he felt the energy in his body.<br/><br/>The current him was comparable to 66 existences of the primal chaos level.<br/><br/>Of course, it was still difficult to calculate his actual combat strength.<br/><br/>For example, when he was with the Universal Alliance, the Alliance leader and 20 elders of the Universal Alliance were comparable to more than 30 existences of the primal chaos level.<br/><br/>However, he was still easily massacred by Wang Xian.<br/><br/>Therefore, it was difficult to calculate his true strength.<br/><br/>However, the improvement this time around was extremely huge for Wang Xian.<br/><br/>The most intuitive performance was his speed.<br/><br/>Now, with a thought, he could fly from one side of the universe to the other.<br/><br/>He could even see through the entire nine-origin universe with his mind.<br/><br/>“Greetings, Dragon King!”<br/><br/>When Wang Xian had just arrived at the Dragon King’s Hall, the voice of the Divine Roc of the Nine Heavens was heard.<br/><br/>At this moment, the Divine Roc of the Nine Heavens was looking at him with excitement and anticipation.<br/><br/>Ever since he received the message from the Dragon King a hundred thousand years ago, he had rushed to the Dragon Palace in excitement.<br/><br/>He had broken through.<br/><br/>An existence above the realm of chaos.<br/><br/>He had been chasing after it for far too long.<br/><br/>Even in his dreams, he wanted to break through.<br/><br/>Now, the Dragon King actually told him that there was a way to break through.<br/><br/>How could he not be excited.<br/><br/>“Hehe, nine heavens, do you know that every large region has a special domain? In this domain, there will be a chaos supreme treasure. This chaos supreme treasure is the key to breaking through to the realm above chaos.”<br/><br/>Wang Xian looked at the Nine Heavens Divine Roc and asked with a smile.<br/><br/>“HMM?”<br/><br/>The Nine Heavens Divine Roc was slightly taken aback, he then shook his head and said, “Dragon King, I don’t know about this subordinate. I know about the special domain. However, with my strength, I can’t enter the core of the special domain. Most importantly, I haven’t encountered any special domains with fire attributes.”<br/><br/>“Your Majesty, could it be that the key to breaking through lies within this special domain?”<br/><br/>Wang Xian nodded. “Yes, it lies in this special region. Every region has a treasure that can allow one to achieve a breakthrough. In this region, only one existence above chaos can be born. Coincidentally, this time, I have obtained a fire attribute chaos treasure. You can absorb it and achieve a breakthrough.”<br/><br/>“However, it is extremely difficult to achieve a breakthrough above chaos. It can be said that there is only a slim chance of survival. Once you die, you will be completely annihilated. You will not be able to revive. You have to think carefully.”<br/><br/>Wang Xian reminded him. He had never seen a powerhouse breaking through before, so he could not be sure of the situation.<br/><br/>However, he had to remind the Divine Roc of the Nine Heavens.<br/><br/>He might die.<br/><br/>“Dragon King, no matter how big the risk is, I will not give up. It is enough to learn the Dao in the morning and die in the evening.”\t\t\t\t\t\t</div>", "images": {}, "success": true}