{"id": 1578, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15199063.html", "title": "Chapter 4581 - Chapter 4581: 4580 People Alone Suppressed The Universe Alliance", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4581 - Chapter 4581: 4580 People Alone Suppressed The Universe Alliance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4581: 4580 people alone suppressed the Universe Alliance<br/><br/>When 20 heaven origin creation realm experts joined hands to form a calamity lord.<br/><br/>They released an attack at the same time. This attack was extremely terrifying.<br/><br/>It was extremely shocking.<br/><br/>Their attack covered the entire chaotic space without any blind spots.<br/><br/>Below, the entire Universe Alliance Sacred Land released a powerful luster under this energy fluctuation and automatically activated its defense.<br/><br/>All the powerful disciples of the Universal Alliance couldn’t even sense what was happening in the sky anymore.<br/><br/>They couldn’t see anything.<br/><br/>They could only feel the boundless energy.<br/><br/>“If this attack landed on our side, I’m afraid we would be vaporized instantly.”<br/><br/>“I really don’t believe that there’s an existence in the primal chaos that can resist the alliance master and elders joining hands.”<br/><br/>“I don’t believe it either. In front of this energy, we are too insignificant. We feel like ants.”<br/><br/>All the strong disciples of the Universal Alliance watched all of this in astonishment.<br/><br/>At this moment, Wang Xian had already made his move.<br/><br/>Out of the 20 powerhouses in the Heaven’s origin realm, those who were in the Heaven’s origin realm were not the weakest ones.<br/><br/>The strongest one could match up to more than two of them.<br/><br/>However, when Wang Xian used his time domain, he felt that everything around him had changed.<br/><br/>With his current strength and the speed of time that was a hundred times faster, everything outside was very slow in his eyes.<br/><br/>Even the attacks of the Universal Alliance leader and the rest were extremely slow.<br/><br/>In the outside world, the Universal Alliance leader and the rest released terrifying attacks that covered him.<br/><br/>However, from Wang Xian’s point of view, this attack would take a long time to reach him.<br/><br/>He had a lot of time to dodge and Dodge easily.<br/><br/>Buzz<br/><br/>However, Wang Xian did not Dodge. His dragon eyes were sparkling as he sensed the power of this energy.<br/><br/>“It can’t threaten me.”<br/><br/>Wang Xian looked at their attacks and mumbled.<br/><br/>Even if they were attacking him with all their might, he could still easily withstand their attacks with his defense.<br/><br/>“That’s Easy!”<br/><br/>In the next moment, Wang Xian’s figure disappeared instantly!<br/><br/>“Huh?”<br/><br/>In front of him, the leader of the Universal Alliance was staring at Wang Xian.<br/><br/>When he saw Wang Xian disappear, his pupils constricted slightly. He had a bad feeling.<br/><br/>“Is that all?”<br/><br/>At the next moment, a voice entered his mind. The leader of the Universal Alliance’s heart tightened and a look of horror appeared on his face.<br/><br/>Following that, he felt his neck being grabbed.<br/><br/>An extremely terrifying force restrained his body, making him unable to move.<br/><br/>The leader of the Universal Alliance’s body trembled violently. His face was filled with fear.<br/><br/>How was this possible?<br/><br/>How was this possible? !<br/><br/>Behind him, the 20 elders of the Universal Alliance were horrified when they saw Wang Xian suddenly grabbing their leader’s neck.<br/><br/>Crack! Crack<br/><br/>Buzz<br/><br/>A surge of energy surged into the body of the leader of the Universal Alliance. The power of chaos was rapidly depleting his life force.<br/><br/>In less than a second, the leader of the Universal Alliance lost his life force.<br/><br/>He was dead.<br/><br/>“It’s your turn!”<br/><br/>Wang Xian casually killed the Universe Alliance’s leader. He looked at the 20 elders and revealed a faint smile.<br/><br/>“No, no, no, how is this possible!”<br/><br/>“Hiss!”<br/><br/>The 20 elders were completely terrified at this moment. They would never have thought that such a terrifying existence existed in this world.<br/><br/>He killed the leader of calamity in an instant.<br/><br/>Furthermore, it was under the condition that they were working together with the leader.<br/><br/>They were very clear about the strength of the leader.<br/><br/>Even if the 20 elders were to work together, they wouldn’t be able to kill the leader of calamity.<br/><br/>With the speed of their leader, he could escape easily.<br/><br/>But now, their leader was killed in an instant.<br/><br/>What level of strength was this?<br/><br/>Could it be that there was a higher realm above the leader of calamity?<br/><br/>Before they could think further, Wang Xian had already charged forward.<br/><br/>The difference in speed made it impossible for them to retaliate in time.<br/><br/>They had treasures on them that could automatically defend themselves. However, in Wang Xian’s opinion, their defense was too weak.<br/><br/>“PFFT! PFFT! PFFT!”<br/><br/>Wang Xian’s figure flashed past. The bodies of the elders were separated from their heads.<br/><br/>The terrifying power of chaos was eroding their vitality.<br/><br/>Instant Kill. It was another very fast instant kill.<br/><br/>There was no way to resist it.<br/><br/>At the moment when the Lord of calamity and the twenty elders were killed, some energy in the surroundings began to dissipate slowly.<br/><br/>The situation in this space was revealed.<br/><br/>Twenty-one corpses were lying there quietly.<br/><br/>The treasures on their bodies were still emitting radiance.<br/><br/>But they were already dead!<br/><br/>A terrifying scene was displayed in the eyes of all the powerful disciples of the Universal Alliance.<br/><br/>They were all stunned when they saw this scene.<br/><br/>It was too fast.<br/><br/>It was too fast.<br/><br/>They thought that there would be a world-shaking final battle. They thought that there would be a terrifying war.<br/><br/>But it ended too quickly.<br/><br/>It was so fast that they didn’t dare to accept it.<br/><br/>At the same time, they didn’t dare to believe this result.<br/><br/>The familiar corpse lay in the chaos, and their elder’s body was separated.<br/><br/>This scene was too terrifying.<br/><br/>The tens of thousands of heaven origin creation realm experts felt a chill in their hearts.<br/><br/>They were filled with fear as they looked at the figure in the sky.<br/><br/>“How can there be such a terrifying existence in the chaos? In just a few seconds, he killed our alliance master, Elder, and all of them. Doesn’t that mean that he alone can suppress the entire Universe Alliance?”<br/><br/>An expert at the Great Dao level muttered in disbelief.<br/><br/>“Buzz Buzz!”<br/><br/>At this moment, light flickered in the Sacred Land of the Universe Alliance.<br/><br/>The Alliance leader of the Universe Alliance slowly appeared.<br/><br/>After being resurrected, he rushed over immediately.<br/><br/>Looking at his corpse and the corpses of the twenty elders in the sky, he took a deep breath.<br/><br/>“Senior… are you invincible in this world?”<br/><br/>He couldn’t help but ask.<br/><br/>The strength displayed by this mysterious powerhouse in front of them made them feel despair.<br/><br/>After the opponent unleashed his true strength, he could actually kill him in an instant.<br/><br/>This was an instant kill.<br/><br/>“I don’t know.”<br/><br/>Wang Xian responded indifferently. With a wave of his arm, he kept all the corpses in front of him.<br/><br/>These corpses could increase his combat strength by at least ten chaos levels.<br/><br/>In addition, there were a large number of heavenly and earthly treasures on these corpses.<br/><br/>There were more than 40 heaven origin destiny level treasures alone.<br/><br/>These 40 plus heaven origin destiny level treasures could also increase his combat strength by more than ten chaos levels.<br/><br/>The harvest was huge!<br/><br/>Buzz! Buzz! Buzz<br/><br/>At this moment, the elders who had been resurrected rushed over.<br/><br/>They were silent and filled with despair.<br/><br/>This person was undefeatable.<br/><br/>The moment they became enemies, the entire universe alliance would cease to exist.<br/><br/>“Senior, we are willing to hand over all the primal chaos true treasures.”<br/><br/>The Universe Alliance leader lowered his head and said respectfully.<br/><br/>With the other party’s strength, it was already merciful of him not to directly snatch them.\t\t\t\t\t\t</div>", "images": {}, "success": true}