{"id": 1577, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15199060.html", "title": "Chapter 4580 - Chapter 4580: 4579 Alone Suppressed The Universal Alliance", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4580 - Chapter 4580: 4579 Alone Suppressed The Universal Alliance</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4580: 4579 alone suppressed the Universal Alliance<br/><br/>After gaining some understanding of the realm of the Lord of calamity, Wang Xian understood.<br/><br/>At this realm, he was still considered a unique existence.<br/><br/>In addition, this Universal Alliance leader in front of him had a huge gap in strength compared to him.<br/><br/>He didn’t even use his time domain and could easily crush him.<br/><br/>If he used his time domain, the ten Universal Alliance leaders would not be his match.<br/><br/>It would not be a big problem for Wang Xian to kill the Universal Alliance leader and the other 20 primal chaos level existences.<br/><br/>Of course, he would not be able to fight against over 10,000 heaven origin creation level powerhouses alone.<br/><br/>As he thought, he looked at the Universal Alliance leader and said directly, “Hand over the primal chaos supreme treasure that you obtained from the other regions.”<br/><br/>“HMM?”<br/><br/>When the Universal Alliance leader heard Wang Xian’s words, his expression changed slightly. His expression didn’t look too good.<br/><br/>Chaos Supreme Treasure was a treasure of this level. It wasn’t something that a heaven’s origin creator could compare to.<br/><br/>He also knew that a region could only give birth to one chaos supreme treasure. It was extremely precious.<br/><br/>This was the key to opening the calamity realm. This was the most precious treasure in the chaos.<br/><br/>Even if it couldn’t be absorbed, just the energy emitted by this primal chaos true treasure could form an extremely vast cultivation land.<br/><br/>This cultivation land far surpassed any other blessed land.<br/><br/>The Universe Alliance now had a total of five primal chaos true treasures.<br/><br/>Once, there was a universe alliance Grand Elder who reached the pinnacle of Primal Chaos Realm. He wanted to use the primal chaos true treasure to break through, but he failed and died.<br/><br/>Now, five primal chaos true treasures were still in his universe.<br/><br/>His universe was also a Holy Land of countless great beings.<br/><br/>If one cultivated there, even heavenly origin creation great beings could quickly improve.<br/><br/>Now, the other party actually wanted him to take out a primal chaos true treasure. His face was full of hesitation.<br/><br/>“Senior, we obtained this primal chaos true treasure. It’s unreasonable for you to ask us to hand it over!”<br/><br/>The Universal Alliance leader said with an embarrassed expression.<br/><br/>“Hehe.”<br/><br/>Wang Xian chuckled. “You guys also plundered it from other regions. Why would it be unreasonable for me to ask you to hand it over? The strong are the king.”<br/><br/>“Alliance leader, we can’t hand over the Chaos Supreme Treasure.”<br/><br/>Wang Xian’s words caused the expressions of the 20 chaos-level elders to change drastically. They quickly spoke up.<br/><br/>The Chaos Supreme Treasure was the only key for them to break through to the Master of calamity.<br/><br/>Although the process of breaking through was extremely difficult and there was a high probability of death, it was still their only hope.<br/><br/>Once the chaos supreme treasure was handed over, it meant that they had no hope of breaking through to the Master of calamity.<br/><br/>How could they agree to it.<br/><br/>“It doesn’t matter. If you guys don’t agree, we can start a war. Killing you guys is easy. This way, we can obtain more resources.”<br/><br/>Wang Xian smiled faintly and said nonchalantly.<br/><br/>Their chaos supreme treasure was snatched from other regions because they were strong.<br/><br/>Now that Wang Xian was strong, he could naturally snatch it from them.<br/><br/>There was no right or wrong. This was the law of the chaos. The strong were King.<br/><br/>“Do you really think that we don’t dare to start a war? There are more than 10,000 heaven origin creation stage powerhouses in our universe. Why should we be afraid of him alone?”<br/><br/>“That’s right. If we join hands, we can even suppress the existence of the Lord of Calamity.”<br/><br/>“Alliance leader, Our Universal Alliance is not afraid of any powerhouse.”<br/><br/>Below them, the powerhouses of the Heaven’s origin manifestation were speaking furiously.<br/><br/>How Brilliant was the Universal Alliance?<br/><br/>How powerful was it?<br/><br/>Now, someone actually came directly to them and wanted to take away their chaos supreme treasure.<br/><br/>This was simply an insult to them.<br/><br/>“Senior, our Universal Alliance is not a weakling. We are not to be controlled by others. If you want to take away the Chaos Supreme Treasure, you need to show sufficient strength. Otherwise, we are unwilling to accept it.”<br/><br/>The Universal Alliance leader waved his hand and said to Wang Xian.<br/><br/>He did not dare to offend Wang Xian rashly, but he was also unwilling to hand over the chaos treasure directly.<br/><br/>“Oh? Show great strength? Hehe.”<br/><br/>Wang Xian looked at him, raised his eyebrows slightly, and said with a smile.<br/><br/>“Yes, as long as you can defeat me and defeat twenty elders of our Universal Alliance, we will be able to hand over the Chaos Treasure.”<br/><br/>The Universal Alliance leader said solemnly.<br/><br/>Boom! Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>As soon as he finished speaking, the 20 primal chaos level existences flew directly behind the Universal Alliance leader.<br/><br/>They stared coldly at Wang Xian.<br/><br/>“That’s right. If you want us to hand over the Chaos Supreme Treasure, you have to defeat US first. Otherwise, don’t even think about it!”<br/><br/>An elder at the primal chaos level said with a sinister expression.<br/><br/>“Hehe, Alright, Alright. Not bad. However, since I have made my move, all of you will have to die. That’s good too. Your corpses are also a huge amount of resources.”<br/><br/>Wang Xian smiled as he spoke. He did not put them in his eyes at all.<br/><br/>“Arrogant!”<br/><br/>The group of top-notch experts from the Universal Alliance were enraged. An extremely terrifying aura erupted from their bodies.<br/><br/>The Universal Alliance leader’s gaze also focused, and voice transmissions were transmitted into the minds of the 20 subordinates.<br/><br/>They carried out a joint formation, advancing and retreating in unison.<br/><br/>The 20 primal chaos existences, even if the Universal Alliance leader fought against them, he would still be suppressed if he did not flee.<br/><br/>He did not believe that this mysterious expert in front of him would be their combined opponent!<br/><br/>“Come on, let’s see if the Universal Alliance has the ability to fight against the entire alliance alone.”<br/><br/>The Universal Alliance leader stared at Wang Xian coldly.<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>Following that, an extremely powerful aura erupted from his body once again.<br/><br/>Around him, 20 powerhouses at the primal chaos level also unleashed their full strength.<br/><br/>At this moment, they didn’t hold back at all.<br/><br/>Endless Energy filled the entire primal chaos space.<br/><br/>Below, within the Universal Alliance Sacred Land, all the experts and disciples felt a sense of oppression.<br/><br/>They raised their heads with great difficulty and looked at the battle above.<br/><br/>“Our Alliance Master and elders will definitely be able to suppress this arrogant fellow.”<br/><br/>“This is inevitable. Our Universal Alliance is invincible.”<br/><br/>“No one dares to threaten our universal alliance, and no one can go against us.”<br/><br/>The group of powerful disciples of the Universal Alliance firmly believed that they were the strongest existences.<br/><br/>They cheered for the Alliance leader and elders.<br/><br/>Wang Xian looked at the twenty-one top-notch existences of the Universal Alliance and smiled. “Today, I will show you the gap between you and this Dragon King!”<br/><br/>Buzz<br/><br/>The next moment, Wang Xian activated his time domain and moved.<br/><br/>“Attack!”<br/><br/>The leader of the Universal Alliance roared furiously.\t\t\t\t\t\t</div>", "images": {}, "success": true}