{"id": 1573, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15191827.html", "title": "Chapter 4576 - Chapter 4576: The 4575 Cardinal Tribulations Lord", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4576 - Chapter 4576: The 4575 Cardinal Tribulations Lord</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4576: The 4575 Cardinal Tribulations Lord<br/><br/>Wang Xian had stayed in the Universal Alliance’s sacred land for over ten million years.<br/><br/>During these ten million years, he had witnessed the glory of the Universal Alliance’s sacred land.<br/><br/>He had witnessed their strength.<br/><br/>During these ten million years, more and more powerful disciples had gathered at the sacred land.<br/><br/>The Universal Immortal meeting was a grand event that happened once every thirty billion years. Almost all the powerful disciples from over two thousand universes had come.<br/><br/>Now, it was getting closer and closer to this grand gathering.<br/><br/>During these few days, Wang Xian had already sensed more than a dozen existences at the primal chaos level.<br/><br/>This was something unimaginable in other places.<br/><br/>“There are about two years left before the Universal Alliance’s celestial gathering begins.”<br/><br/>Wang Xian strolled leisurely in the Universal Alliance’s Holy Land.<br/><br/>This holy land was very big. As more and more universe’s strong disciples came, it became more and more lively.<br/><br/>Many universe masters’disciples set up stalls here, selling all kinds of strange treasures and items.<br/><br/>There were also all kinds of strange things and powerful treasures.<br/><br/>These things didn’t exist in the nine-origin universe.<br/><br/>Wang Xian saw some useful things and saw some good ones. He bought all of them and gave them to the girls.<br/><br/>Here, he really encountered many valuable treasures.<br/><br/>For example, treasures for the breakthrough of a heaven origin creator.<br/><br/>Treasures for the breakthrough of a master at the peak of the Dominator realm.<br/><br/>There were even treasures that could allow a master at the peak of the Dominator realm to achieve a 100% breakthrough as long as there was a spot available.<br/><br/>Such treasures were also extremely rare in the Holy Land of the Universal Alliance.<br/><br/>Although Wang Xian did not buy them, he had already analyzed the interior and could easily create them.<br/><br/>“Dong Dong Dong!”<br/><br/>“Dong Dong Dong!”<br/><br/>Along with the sound of the dusk drums, it spread throughout the entire holy land and sounded the beginning of the Universal Alliance’s Celestial Gathering.<br/><br/>“Let’s go, let’s go. This year’s Universal Alliance’s celestial gathering is about to begin. I’ve been looking forward to it for a long time.”<br/><br/>“All the disciples, follow me. When you arrive at the venue, perform well. This time, the alliance leader and elders of our Universal Alliance are all here. If all of you can get the attention of the elders, you will soar to the Skies!”<br/><br/>“Every time there is an assembly of Immortals and deities of the Universal Alliance, there will be a lucky genius who will be valued by the elders. From then on, he will ascend to the peak.”<br/><br/>“This time, all the disciples will have a chance to strike at the chaos. If they can make a sound in the chaos, they will receive an astonishing amount of resources.”<br/><br/>Wang Xian flew into the assembly of Immortals and deities of the Universal Alliance. At the surrounding seats, all the strong disciples were discussing.<br/><br/>Wang Xian listened quietly.<br/><br/>This celestial gathering was a huge opportunity for ordinary disciples. Those with outstanding talent could soar to the sky with a single leap.<br/><br/>They could obtain the recognition of chaos-level existences as well as great dao-level powerhouses.<br/><br/>Of course, it was too difficult to be outstanding from the Heaven’s favorites of more than 2,000 universes.<br/><br/>Those who could be ranked here would definitely be able to break through to the Tianyuan Destiny Realm.<br/><br/>Of course, since there were so many Tianyuan blessed realm powerhouses in the Universal Alliance now, there were not many spots that could make them break through.<br/><br/>Very soon, Wang Xian followed the strong disciples of the public to the venue of the Universal Immortal Celestial Gathering.<br/><br/>His gaze swept across the scene. There were eight to nine thousand Tianyuan blessed realm powerhouses in front of him. Each and every one of them was exuding an astonishing aura.<br/><br/>They sat there and chatted with each other with a smile.<br/><br/>Behind them were disciples whose strength was not even in the Heaven’s origin Kismet Realm. They also had seats, but their seats were slightly inferior to those of the strong practitioners of the Heaven’s origin Kismet Realm.<br/><br/>Wang Xian found a random seat and sat down. His gaze swept across the surroundings.<br/><br/>He had yet to sense the existence of the Lord of the Cosmic Calamity.<br/><br/>The Lord of the cosmic calamity had yet to arrive.<br/><br/>Wang Xian was not in a hurry to search for him. He waited quietly.<br/><br/>He wanted to see the uniqueness of this celestial gathering.<br/><br/>In the future, when the Dragon Palace became stronger and the strong disciples of the evil sequence camp were born in the universe, they could hold such a banquet with many universes.<br/><br/>Boom! Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>Not long after, a terrifying aura descended from the sky.<br/><br/>Twenty figures appeared, and behind each figure was an auspicious cloud and a noble aura.<br/><br/>Each of them exuded an aura that was as powerful as hell.<br/><br/>Twenty Primal Chaos level existences arrived. There were men and women, humans, and creatures from other races. Without exception, each of them was abnormally powerful.<br/><br/>The strongest one was equivalent to two beings of the primal chaos level and two beings of the control level.<br/><br/>Wang Xian watched quietly. To his surprise, the Master of the calamity still did not arrive.<br/><br/>An elder of the primal chaos level said a few words. Following that, the celestial gathering of the universe began.<br/><br/>The celestial gathering of the universe began with the competition among the disciples.<br/><br/>They rang the bell of the primal chaos and performed powerful spells.<br/><br/>At the end, the disciples from more than 2,000 universes began to compete in the arena.<br/><br/>“Compared to the banquet at the Dragon Palace, the quality of the disciples is much higher and their abilities are much stronger. The top-notch disciples at the peak of the Dominator realm here are able to display all kinds of abilities and treasures. They are comparable to the weakest powerhouses who have just entered the Heavenly Yuan blessed realm.”<br/><br/>Wang Xian commented indifferently.<br/><br/>Around them, the group of disciples in the Heavenly Yuan blessed realm cheered for their supporters.<br/><br/>The group of Heavenly Yuan blessed realm powerhouses were also watching with great interest.<br/><br/>“Oh? They are here!”<br/><br/>When the group of disciples were competing and the top three were decided.<br/><br/>At the highest seat in front, a middle-aged figure slowly appeared on the empty holy seat.<br/><br/>His appearance made a bunch of chaos-level powerhouses bow respectfully to him.<br/><br/>The rest of the heaven-origin destiny-level powerhouses wanted to bow, but they were stopped by his arm.<br/><br/>He signaled for the banquet to continue.<br/><br/>All the powerhouses’disciples looked at the imposing figure with admiration and respect.<br/><br/>This was the strongest powerhouse of their Universal Alliance.<br/><br/>It was also because of the existence of the Alliance Master that their Universal Alliance was so glorious.<br/><br/>Wang Xian looked at the Lord of calamity and sipped on his tea. His eyes sparkled.<br/><br/>In front of him, the divination power was circulating, divining the strength of this lord of calamity.<br/><br/>Very soon, a piece of information appeared in his mind.<br/><br/>“Being able to divine means that his strength is inferior to mine. According to the divination information, the lord of Calamity’s strength at this realm can kill six to seven existences at the chaos level.”<br/><br/>“There is another point. It is impossible for powerhouses of the chaos level to surround and kill the Lord of calamity. This is because the lord of calamity can escape at will. In other words, more than ten or twenty powerhouses of the chaos level can’t kill a single lord of Calamity.”<br/><br/>“The Lord of Calamity can assassinate them bit by bit.”<br/><br/>Wang Xian judged the lord of Calamity’s strength.<br/><br/>Overall, there wasn’t much of a problem.<br/><br/>There was another thing that he wasn’t sure about. The Lord of calamity with wind attribute could absorb wind attribute treasures and resources without any prior knowledge, and whether he could create wind attribute treasures.\t\t\t\t\t\t</div>", "images": {}, "success": true}