{"id": 1582, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15210994.html", "title": "Chapter 4585 - Chapter 4585: 4584, The Battle Between The Two Regions", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4585 - Chapter 4585: 4584, The Battle Between The Two Regions</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4585: 4584, the battle between the two regions<br/><br/>“Xiao Xian!”<br/><br/>When Guan Shuqing and the rest of the girls saw Wang Xian, their eyes lit up. They replied with a smile, “Xiao Xian, at the moment, the girls and boys are still alright. Most of them have already joined one faction after another.”<br/><br/>“Among them, the boss has already broken through to the heaven origin blessed realm. The rest of the little guys are about to make a name for themselves.”<br/><br/>“Among them, fourth brother was taken in as a disciple by an expert at the Great Dao level…”<br/><br/>A few girls spoke to Wang Xian one by one.<br/><br/>The strength of the group of girls had already reached the control level. They were not considered strong, but they were not weak either. However, with the chaos level experts of the Kong Chan clan guarding them by their side, they would not be in any danger.<br/><br/>In addition, they all had the life-saving and offensive spells that Wang Xian had given them.<br/><br/>Once these spells were activated, the chaos level experts would definitely die.<br/><br/>Wang Xian listened to their words and nodded slightly.<br/><br/>“Oh right, according to our investigation, the eight barren region is going to attack the torrent region.”<br/><br/>Guan Shuqing and the rest suddenly spoke up.<br/><br/>“Are we going to attack? Looks like the war in this region is about to begin.”<br/><br/>Wang Xian raised his eyebrows and said with a smile, “That’s good too. Once the war begins, we will be able to train the young lads and girls better.”<br/><br/>“According to your divination, this war will be exceptionally fierce. By then, the young lads will suffer a lot of blows.”<br/><br/>The group of girls frowned slightly.<br/><br/>More than ten million years ago, Wang Xian had divined that a huge battle would break out in this region.<br/><br/>And this huge battle came from the eight-sided region that was connected to the torrent region.<br/><br/>The eight-sided region belonged to the intruders, and they were stronger. In this huge battle, the torrent region would be at a disadvantage and would be extremely tragic.<br/><br/>Countless strong disciples would bleed and even the universe would be massacred.<br/><br/>Initially, the group of girls wanted Wang Xian to take care of this matter.<br/><br/>However, Wang Xian thought about it and rejected them.<br/><br/>It was very cruel in the chaos. In the vast and boundless chaos, there were universes being destroyed.<br/><br/>This was the development of the chaos, and this was a calamity.<br/><br/>Even though Wang Xian was invincible now, he could not interfere in many matters.<br/><br/>Regarding the calamity of the torrent universe, he was not prepared to interfere.<br/><br/>In this way, in this calamity, he could train the little guys better.<br/><br/>“It’s good to be cruel. Only in the midst of cruelty can one grow better.”<br/><br/>Wang Xian said, “Only after experiencing great battles and setbacks can one live a better life and become stronger.”<br/><br/>The group of girls nodded. Although they knew that with Wang Xian’s strength, even if the little guys did nothing, they would be safe and sound forever.<br/><br/>However, this was considered doting.<br/><br/>They had no dreams and no fighting spirit. This was no different from a good-for-nothing.<br/><br/>They had to grow up and have a new life of their own.<br/><br/>They couldn’t rely on their father for everything.<br/><br/>“Let’s just watch. This war will last for hundreds of millions of years.”<br/><br/>Wang Xian said with a twinkle in his eyes.<br/><br/>A war that lasted for hundreds of millions of years would allow all the strong disciples in the torrent region to grow rapidly.<br/><br/>Of course, there were also many strong disciples who died quickly!<br/><br/>Wang Xian and the rest were prepared to watch everything from the perspective of a bystander.<br/><br/>Sitting on the river viewing tower and looking at the scenery outside was also pretty good.<br/><br/>Time passed by. In less than 10,000 years, the eight regions officially began to invade the torrent region and the war began to erupt.<br/><br/>The Great War had just begun, and it was abnormally fierce.<br/><br/>A group of heaven origin creation realm experts from the eight regions led their disciples and began to invade the various universes in the torrent region.<br/><br/>They began to slaughter and enslave.<br/><br/>After a short period of shock, the torrent region also reacted.<br/><br/>However, only one faction in the torrent region was attacked, and the other two factions didn’t participate.<br/><br/>However, tens of millions of years later, that faction called the torrent channel occupied all the universes. After a group of experts escaped with their elite disciples, the eight directions region continued to invade other factions.<br/><br/>This also made the other two factions in the torrent region know that the eight directions region wanted to destroy their torrent region.<br/><br/>In shock and anger, the other two factions joined forces. They wanted to invite the experts who escaped to join forces.<br/><br/>However, they were rejected by Hong Qu.<br/><br/>This was because Hong Qu had already been defeated and all the universes had been occupied.<br/><br/>Under such circumstances, how could they agree to join forces?<br/><br/>Furthermore, when Hong Qu had been invaded, they had asked for help from the other two forces, but they had been rejected.<br/><br/>Who were they fighting for now?<br/><br/>The other two forces were called Shang Jiu and the divine gate. Helpless, Shang Jiu joined forces with the Divine Gate to fight against the powerful disciples from the eight regions.<br/><br/>However, the torrent region was weaker than the eight directions region to begin with. Without the involvement of the torrent forces, upper nine and the God’s gate were forced to retreat.<br/><br/>In the end, the two forces, upper nine and the God’s Gate, had no choice but to hand over dozens of universes to the torrent region, asking them to act together.<br/><br/>To fight against the enemies of the eight directions region together.<br/><br/>The torrent region joined in and agreed to join forces. The war continued to erupt.<br/><br/>“If the torrent region had been united from the start, it wouldn’t have reached this stage. Now, half of the universe in the torrent region is occupied by the eight directions region.”<br/><br/>On the river viewing tower, Wang Xian was sitting in a room with a group of girls. They were chatting.<br/><br/>“There was a dispute between the upper nine of the torrent channel and the three forces of the gate of God in the past. However, their mistake was that they should have been united when the enemy invaded.”<br/><br/>“Old Five, little nine, and thirteen belong to Hong Qu, right? Now that old five has broken through to the Heavenly Yuan blessed realm, little nine and thirteen are about to do the same.”<br/><br/>“In the beginning of the battle, Little Nine and thirteen died in battle once. If not, they should have broken through as well.”<br/><br/>“Boss’s strength increased the fastest. Now that the war has broken out, the boss in the divine gate has been heavily nurtured. With Boss’s talent, he has already reached the control level.”<br/><br/>“The control level can not change the outcome of a war. Speaking of which, the second and third brothers have met.”<br/><br/>The few of them were talking about the thirteen children.<br/><br/>The memories of the thirteen children were blocked by Wang Xian in the Dragon Palace. They did not know each other.<br/><br/>Now that the war had broken out, there were some who had fought once and some who had already broken through to the Heaven’s origin blessed realm.<br/><br/>However, even if they had died once, they still shone brightly in this great war and displayed their powerful talents.<br/><br/>As the children of Wang Xian, their talents far surpassed any genius or spoiled child.<br/><br/>In fact, their talents couldn’t even be compared to those experts at the chaos level.<br/><br/>Therefore, they would gradually show their talents tomorrow.<br/><br/>However, due to their weak strength, they couldn’t change the fact that they had occupied this battle.<br/><br/>The flood area is still weak.\t\t\t\t\t\t</div>", "images": {}, "success": true}