{"id": 1584, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15212170.html", "title": "Chapter 4587 - Chapter 4587: 4,586 Children’S Relatives And Friends", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4587 - Chapter 4587: 4,586 Children’S Relatives And Friends</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4587: 4,586 children’s relatives and friends<br/><br/>Now that more than 200 million years had passed, the war in the torrent region had also lasted for more than 200 million years.<br/><br/>During these 200 million years, the relationship between the three forces in the torrent region could be said to be unprecedentedly united.<br/><br/>Ten years later, there would be a heaven origin creation realm expert holding a wedding in the torrent region. Not only would there be a couple, there would also be several other couples holding a wedding together.<br/><br/>Moreover, these couples who were getting married were from different forces.<br/><br/>This behavior was also deliberately done by the three major forces. The three major forces formed an alliance through marriage and became the strongest allies to deal with the upcoming war.<br/><br/>“Where are the relatives of the little ones who ‘died in battle’?”<br/><br/>Wang Xian asked the Divine Roc of the Nine Heavens.<br/><br/>“Dragon King, they are all in the river viewing pagoda.”<br/><br/>The Divine Roc of the nine heavens replied, “There are a total of ten relatives of the crown princess who died in battle. Among them, the fourth Princess’master, the second Prince’s uncle-master, and a senior brother of the upper nine forces where the seventh princess was from, etc. . All of them self-destructed their bodies and souls and died together with their enemies. Especially the fourth princess’master, he sacrificed his life in order to save the fourth princess.”<br/><br/>Wang Xian nodded his head slightly. In a battle of this level, there was a possibility of a powerhouse of the Heaven’s origin creation dying in battle.<br/><br/>This was especially so when a powerhouse of the Heaven’s origin creation sacrificed everything to self-destruct. The power of their self-destruct was extremely terrifying.<br/><br/>It was extremely terrifying.<br/><br/>There were also some forbidden moves that required one to sacrifice everything to engage in battle.<br/><br/>This kind of special self-destruction, powerful forbidden move, after being released, would completely vanish into thin air after death.<br/><br/>Even if one had a resurrection treasure, they wouldn’t be able to revive.<br/><br/>Generally speaking, Heavenly Yuan creation realm experts wouldn’t use forbidden moves, and they wouldn’t carry out suicidal attacks.<br/><br/>However, when a great battle started, there would always be some bloody-minded experts who fought recklessly for their homes, even sacrificing their own lives.<br/><br/>Among the friends, teachers, and elders that the group of Little Fellows had just met, there were ten people.<br/><br/>“Call them over. Let’s get to know each other.”<br/><br/>The group of girls said to the Nine Heavens Divine Roc.<br/><br/>“It’s the Dragon Queen!”The Nine Heavens Divine Roc nodded. With a thought, ten figures quickly appeared in the room.<br/><br/>“Sir.”<br/><br/>When the ten people saw the Nine Heavens Divine Roc, they immediately bowed respectfully.<br/><br/>At that time, they were determined to die. After using the forbidden move, they thought that they would die. In the end, they did not expect that a trace of light of life was actually saved by an unknown expert.<br/><br/>This was the most terrifying expert they had ever seen, the most powerful existence.<br/><br/>They all knew that once they used the forbidden move, even the primal chaos experts in their flood region would not be able to save them.<br/><br/>But they survived and were quickly restored to their strength by this mysterious expert.<br/><br/>This made them feel somewhat incredulous.<br/><br/>After all, there was an existence at the Great Dao realm among them.<br/><br/>“The ones in front of you are the Dragon King and the Dragon Queens. The Dragon King and the Dragon Queen want to meet you.”<br/><br/>The Nine Heavens Divine Roc spoke to them.<br/><br/>At this moment, the ten people finally noticed the dozen figures in front of them.<br/><br/>The mysterious powerhouse who had saved them was standing at the back.<br/><br/>Wasn’t this… ?<br/><br/>A trace of shock flashed through the eyes of the ten people as they looked at the dozen or so people in awe.<br/><br/>“Greetings, Dragon King and the Dragon Queen!”<br/><br/>They hurriedly bowed and greeted.<br/><br/>“You’re welcome. We’re all family. Have a seat.”The Dragon Queens looked at them with a smile and stretched out their hands.<br/><br/>The ten of them had great perseverance and were the kind of people who were willing to sacrifice their lives for their relatives and friends.<br/><br/>At the same time, they were also the relatives and friends that the Dragon Princess had made in the torrent area.<br/><br/>Among them were the masters that the Dragon Princess had come here to worship.<br/><br/>For example, the Master of the fourth princess, the woman.<br/><br/>“Huh?”The ten of them were slightly surprised when they heard Guan Shuqing and the others. A Family?<br/><br/>To be able to order a terrifying powerhouse, who exactly was the Dragon King and Dragon Queen?<br/><br/>They were certain that the other party was not a powerhouse from the torrent region.<br/><br/>There were no such powerful existences in the torrent region.<br/><br/>“Lord Dragon King, Lord Dragon Queen, May I know who you are?”<br/><br/>Among the ten of them, the only powerhouse at the level of Great Dao could not help but ask.<br/><br/>“You are an elder of Lan Jiang, right? Xiao Jiang is our boss.”<br/><br/>Wang Xian said with a smile on his face. With a wave of his arm, the shadows of his children appeared in front of him.<br/><br/>“More than 200 million years ago, we left 13 Little Fellows in your torrent region to train. In the blink of an eye, more than 200 million years have passed.”<br/><br/>Wang Xian looked at him. “It is also a blessing that they are able to get to know people like you.”<br/><br/>“These… these thirteen figures, aren’t they the heaven’s favorites that rose to prominence in our torrent region in the past 200 million years?”An old man looked at the thirteen young men and women. His eyes were wide open and filled with shock.<br/><br/>“You are yinyin’s parents?”The fourth Princess’master looked at them in disbelief. He shook his head and said, “That’s impossible. We have investigated yinyin’s background.”<br/><br/>Wang Xian looked at the woman and smiled faintly.<br/><br/>When the woman saw his smile, she opened her mouth as well. She understood something.<br/><br/>With the mysteriousness and strength of this group of people, their investigations might be fake.<br/><br/>“Dragon King and Dragon Queen, you are so strong. Can you help us in the torrent area? Can you expel the eight regions?”An expert asked.<br/><br/>“Let’s do it in ten years. We will have an understanding in ten years.”<br/><br/>Wang Xian looked at him and said, “I will let you guys go back in ten years.”<br/><br/>“Thank you, sir.”The expert thanked him with excitement.<br/><br/>The war that lasted for more than 200 million years was a very, very long time for them.<br/><br/>“You guys don’t have to be restrained. Eat some delicious food and relax after that. Just take a look around.”<br/><br/>Wang Xian waved his arm and exquisite food appeared in front of them.<br/><br/>The food contained extremely powerful energy. This was the meat of a chaos-level giant beast.<br/><br/>“Thank you, Dragon King. Can We ask why you brought yinyin and the rest here to train?”The woman asked curiously.<br/><br/>“It’s because they grew up too smoothly in our area. A strong person has to go through all kinds of life and tribulations. Therefore, we blocked part of their memories and threw them here.”<br/><br/>Wang Xian replied, “The bunch of little guys have brought you trouble.”<br/><br/>“How can you say that it’s trouble? Yinyin’s talent is unparalleled. Even our great ancestor from the torrent channel said that given time, she could break through to the chaos realm. This is the first time I’ve heard our great ancestor being so certain about something.”<br/><br/>The woman recalled the great ancestor’s evaluation of yinyin and sighed.<br/><br/>It was extremely difficult to break through to the primal chaos realm, but their patriarch was so certain. Back then, it shocked all the experts of the Hongqu.<br/><br/>“Our Divine Gate’s divine king also said that Xiaojiang could break through to the primal chaos realm and his strength would surpass him. Xiaojiang’s talent is too monstrous. It turns out that they are too powerful and terrifying.”<br/><br/>The Great Dao expert also looked at Wang Xian and sighed in his heart.<br/><br/>He was sure that the Dragon King in front of him was stronger than Hun Dun. No, he was sure that the subordinate of the Dragon King, the Divine Roc of the Nine Heavens, was stronger than Hun Dun.<br/><br/>It was simply unheard of.\t\t\t\t\t\t</div>", "images": {}, "success": true}