{"id": 1588, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15220219.html", "title": "Chapter 4591 - Chapter 4591: 4,590 Hands Destroyed An Area", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4591 - Chapter 4591: 4,590 Hands Destroyed An Area</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4591: 4,590 hands destroyed an area<br/><br/>A black hole appeared in front of the river of chaos, appearing above the wedding stage.<br/><br/>This black hole expanded at a terrifying speed, as if it was connected to the distant primal chaos void.<br/><br/>In this primal chaos void, more than 1,000 powerhouses from the eight directions could be clearly seen.<br/><br/>However, at this moment, an incomparably huge dragon claw appeared within the Black Hole. The Dragon Claw emitted an aura that could destroy the heavens and earth.<br/><br/>It contained an incomparable might.<br/><br/>At the same time, a law of time circulated on it.<br/><br/>The Dragon Claw that blotted out the sky grabbed towards the more than 1,000 heaven origin creation realm powerhouses in the eight directions.<br/><br/>This sudden scene and shocking scene stunned all the disciples in the torrent region.<br/><br/>Especially when they saw the faces of the powerhouses in the black hole.<br/><br/>The disciples of the Great Beings from the torrent region were very clear about the great beings from the eight directions universe.<br/><br/>They looked at the familiar figures and enemies with shock and anger on their faces.<br/><br/>“Those are the great beings from the eight directions universe. In the center is the Supreme Master of the eight directions universe, the eight directions master. He was the one who gave the order for this war, but he never made a move!”<br/><br/>“The five figures next to the Master of the eight regions are primal chaos existences. I’ve seen them, I’ve seen them!”<br/><br/>“There are more than 1,200 heaven origin creation realm great beings. Many familiar figures are great beings from the eight regions. It’s them, it’s them. Their auras, I’ll never forget them!”<br/><br/>“This… where are the great beings from the eight regions now? What is Wang Lanjiang’s father trying to do with the black hole? And that huge hand that blots out the sky, could it be?”<br/><br/>At this moment, all the experts and disciples from the torrent region stared with their mouths Agape.<br/><br/>Some control-level and even great dao-level experts couldn’t help but exclaim in shock.<br/><br/>They would never forget this group of powerful enemies from the eight regions.<br/><br/>There was a deep hatred between them!<br/><br/>At the same time, not far from the river of Primal Chaos, in the primal chaos void.<br/><br/>More than a thousand experts from the eight regions quickly flew over here.<br/><br/>Today was the day of great joy for the torrent region, and also the day of their final attack.<br/><br/>All the experts from the torrent region were captured.<br/><br/>They concealed their bodies and flew in the primal chaos void.<br/><br/>With the existence of the Masters of the eight regions, their concealment would definitely not be discovered.<br/><br/>However, all of a sudden, an incomparably huge black hole appeared in front of them.<br/><br/>Seeing this black hole, all the experts in the eight directions were slightly stunned.<br/><br/>Even the eight directions masters looked at the black hole that had suddenly appeared with a stunned expression.<br/><br/>However, before they could even think, they saw a special claw heading towards them.<br/><br/>“What’s the situation?”<br/><br/>“Damn it, is someone attacking us? Is it an ambush from the torrent region?”<br/><br/>“Courting death, you really don’t know what’s good for you. You actually dare to attack us.”<br/><br/>The experts from the eight regions were extremely shocked and furious. The Aura on their bodies was no longer concealed. The soaring aura charged towards the primal chaos space.<br/><br/>The eight regions master stared at the huge Dragon Claw coming from the Black Hole. His face slowly revealed an incomparably grave expression.<br/><br/>“Humph, is this the great formation set up by the torrent region? Today, I’ll let you see my power. Humph, Break!”<br/><br/>However, eight directions master snorted coldly, and with a wave of his arm, an axe appeared in his hand.<br/><br/>The heavenly creation true treasure axe was exuding a terrifying power, and with the support of the power of chaos from eight directions master, it directly clawed at the Dragon Claw that blotted out the sky and covered the Sun.<br/><br/>The huge axe contained the power of endless laws of nature, and the power of thunder was as if it could split the sky and split the earth!<br/><br/>However, in the next second, the huge dragon claw suddenly became much faster.<br/><br/>Time seemed to have stopped when it reached their side.<br/><br/>Soon, the Dragon Claw instantly covered the sky above them.<br/><br/>The power of thunder from the huge axe landed on the chaotic Dragon Claw, and it seemed to be directly absorbed.<br/><br/>The Dragon Claw came to the sky above them, as if it was floating in the sky above them.<br/><br/>“How is this possible? I have already broken through to above the primal chaos realm, how can I not even break through a single claw?”<br/><br/>The eight directions master saw that his attack was actually blocked, and his eyes widened, filled with shock and disbelief.<br/><br/>Not long ago, he had just broken through to above the primal chaos realm, and this was an unknown realm.<br/><br/>This was a realm that the eight regions had never heard of before.<br/><br/>Similarly, this realm was an unimaginable realm for the flood region.<br/><br/>And he had reached it. He felt that it would be easy for him to kill a primal chaos existence.<br/><br/>But now, a black hole had suddenly appeared, and a huge hand that blotted out the sun easily blocked his attack.<br/><br/>It even carried an incomparably vast and mighty power that covered them.<br/><br/>What kind of power was this?<br/><br/>Under this power, even he himself was trembling.<br/><br/>Some felt that he was small.<br/><br/>What kind of attack was this?<br/><br/>What realm was it released by?<br/><br/>He didn’t know.<br/><br/>He also didn’t dare to imagine. He felt that all of this was an illusion.<br/><br/>“Oh no, lord of the eight directions, what is this thing?”<br/><br/>“Oh my God!”<br/><br/>“Is this some kind of rule in the chaos? Is it a strange movement of the Chaos?”<br/><br/>At this moment, the other 1,000 plus heaven origin creation realm experts in the eight directions were also stunned.<br/><br/>They didn’t attack when the lord of the eight directions attacked. They wanted to see their great lord of the eight directions easily break the claw that attacked them.<br/><br/>However, the scene in front of them was hard for them to accept.<br/><br/>They could not believe that this was an attack that other experts could release!<br/><br/>The dragon claws that blotted out the sky gradually enveloped them.<br/><br/>They regained their senses and wanted to resist.<br/><br/>However, the chaotic dragon claws were like a prison of laws that covered them completely.<br/><br/>They felt that the world was covered in gray, as if they had returned to the chaos that did not exist before the calamity.<br/><br/>At that time, there was no energy in the primal chaos, so they could not absorb the energy from the outside world.<br/><br/>“Hiss, Hiss Hiss Hiss!”<br/><br/>“This… this…”<br/><br/>In front of the river of primal chaos, all the powerful disciples in the flood region looked at this scene in the black hole with disbelief and disbelief.<br/><br/>In the black hole, they could hear the voices of all the powerful experts in the eight regions.<br/><br/>They heard the words of the eight directions master.<br/><br/>He said that he had broken through to above the chaos realm.<br/><br/>Above the chaos realm, how powerful was this realm.<br/><br/>However, it was an existence at this realm, along with more than a thousand heaven origin creation realm experts in the eight directions, that was enveloped by a large hand.<br/><br/>The person who waved the large hand was the figure who stood on the stage, a light-hearted figure.<br/><br/>Is Wang Lanjiang Wang yinyin they all father.<br/><br/>A mysterious existence, an indescribable existence!\t\t\t\t\t\t</div>", "images": {}, "success": true}