{"id": 1589, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15220220.html", "title": "Chapter 4592 - Chapter 4592: Invincible 1,4591", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4592 - Chapter 4592: Invincible 1,4591</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4592: Invincible 1,4591<br/><br/>In the chaotic void, there was an extremely terrifying dragon claw. It covered more than 1,000 heaven’s origin powerhouses.<br/><br/>Faced with this terrifying Dragon Claw, they did not have the ability to resist.<br/><br/>They did not have the ability to resist at all.<br/><br/>Even the leader of the eight directions, who had just broken through, could not resist it.<br/><br/>This move of Wang Xian could be said to be his full strength.<br/><br/>The powerful power of time, including all of his strength.<br/><br/>That was how he was able to achieve this step.<br/><br/>However, this step was terrifying, terrifying!<br/><br/>It was equivalent to suppressing an entire region with one hand!<br/><br/>“We are trapped!”<br/><br/>“Master of the eight directions, what should we do? What should we do?”<br/><br/>“I don’t know either. This huge hand is too terrifying. Even the surrounding chaotic space has been sealed. Even powerful treasures and escape treasures have lost their effectiveness!”<br/><br/>“What exactly have we encountered? This is definitely not an attack that can be released by living beings. Absolutely Not!”<br/><br/>The extremely terrifying dragon claws completely enveloped all the great beings in the eight regions.<br/><br/>They could not break free at all.<br/><br/>They wanted to escape, but there was no way they could escape.<br/><br/>It was as if the area covered by the Dragon Claws was the entire world.<br/><br/>In this place, all laws and everything had disappeared.<br/><br/>Following that, they felt a terrifying power of chaos surging into their bodies.<br/><br/>“Not good!”<br/><br/>“It’s over. I feel like I’m being corroded by Chaos. The energy in my body is rapidly decreasing!”<br/><br/>“I can’t resist it. I can’t resist it at all!”<br/><br/>At this moment, they could feel their bodies being corroded. They could feel their strength rapidly decreasing.<br/><br/>At this moment, they were extremely terrified.<br/><br/>Although each of them could be resurrected.<br/><br/>However, the despair that made them suffocate, the despair that they hadn’t even met their opponent, made their bodies tremble.<br/><br/>Each of them had their strength suppressed by more than 90% .<br/><br/>Soon after, they felt that terrifying hand begin to move them.<br/><br/>This caused the hearts of all the experts in the eight regions to sink.<br/><br/>In front of the river of chaos, in front of the wedding stage, all the experts and disciples in the torrent region were completely stunned.<br/><br/>A black hole was opened with a single hand.<br/><br/>A single hand covered the entire eight regions and grabbed more than a thousand Tianyuan Wheel of fortune experts.<br/><br/>This was the area of the eight directions.<br/><br/>It was a powerful force that invaded them.<br/><br/>It was a powerful force that caused their flood region to defend for more than 200 million years, yet they were forced to retreat.<br/><br/>But now, Wang Lanjiang, Wang yinyin, and the others, this mysterious father, with just one hand, had captured all the experts in the area of the eight directions.<br/><br/>The other party didn’t even have the power to defend!<br/><br/>What kind of power was this.<br/><br/>What kind of invincibility was this!<br/><br/>How could there be such a powerful existence in the universe?<br/><br/>Wang Lanjiang and the others were also dumbstruck as they watched this scene.<br/><br/>They knew that their father was very powerful. In their region, he was an invincible existence.<br/><br/>All the experts in the universe had to curry favor and submit.<br/><br/>But they didn’t expect that their father was actually so powerful, so terrifying.<br/><br/>A terrifying hand came out of the black hole and grabbed all the strong practitioners in the eight-sided area.<br/><br/>The hand began to shrink as if it was in control of another universe!<br/><br/>“Eight-sided area, from today onwards, get out of the torrent area immediately. You are not allowed to invade the torrent area. Anyone who disobeys will be annihilated!”<br/><br/>Wang Xian grabbed all the strong practitioners in the eight-sided area. Through the gray hand, all the strong practitioners in the eight-sided area could see the outside clearly.<br/><br/>All of them stared blankly at the mysterious powerhouse who held them in his hand. They looked at the disciples of the powerhouses in the surrounding torrent region.<br/><br/>They were in a Daze!<br/><br/>They couldn’t believe it.<br/><br/>Until now, they still couldn’t believe that they were captured by a powerhouse.<br/><br/>They had a total of more than a thousand powerhouses in the Heaven’s origin realm.<br/><br/>However, they were captured by a large hand from the distant chaotic space.<br/><br/>What realm was this.<br/><br/>This was especially so for the leader of the eight directions. He had just broken through and was above the chaos realm.<br/><br/>He thought he was invincible!<br/><br/>He thought he was the supreme existence.<br/><br/>In the end, he was like an ant that could be crushed to death by that mysterious powerhouse?<br/><br/>This made him somewhat unable to believe it!<br/><br/>Wang Xian looked at his children with a smile. His gaze landed on Wang Lanjiang. “This is considered a wedding gift for you, Boss. In the future, the torrent region will not be invaded by the eight directions region.”<br/><br/>As he spoke, he clenched his terrifying dragon claws slightly.<br/><br/>Buzz! Buzz! Buzz<br/><br/>An extremely dull energy surged out from the huge hand. All the experts in the eight regions were dead.<br/><br/>They didn’t even manage to utter a single word.<br/><br/>“Father, you… you are actually so powerful?”Wang Lanjiang looked at him with a face full of shock. “This is the first time I’ve seen you fight.”<br/><br/>Wang Xian smiled. “Your strength has improved quite well. What other gifts do you want? You can tell me.”<br/><br/>“Father, I don’t want anything either.”Wang Lanjiang shook his head. After regaining his memory, he knew that he didn’t lack anything and didn’t need anything.<br/><br/>“HMM, alright then. Let’s continue with the wedding. Don’t miss this auspicious day.”<br/><br/>Wang Xian smiled and said to them.<br/><br/>“Yes, Father!”<br/><br/>Wang Lanjiang nodded happily.<br/><br/>The rest of the children were also very happy.<br/><br/>“Let’s continue with the wedding. Sirs, please take a seat over here!”<br/><br/>The three chaos-level powerhouses from the torrent region spoke with their eyes wide open. Their faces were filled with respect.<br/><br/>The scene just now had given them too much of a shock!<br/><br/>Destroying all the experts from the entire region with a single hand.<br/><br/>The other party wanted to destroy their torrent region, so it was naturally easy for them.<br/><br/>However, at this moment, the three primal chaos realm existences were extremely excited and excited.<br/><br/>This lord’s children, Wang Lanjiang and the others had trained in their torrent region for over 200 million years.<br/><br/>They had formed a deep friendship with their torrent region.<br/><br/>In the future, wouldn’t their torrent region have an invincible backer?<br/><br/>Especially the primal chaos realm experts of upper nine, their faces were filled with excitement.<br/><br/>Gongsun Ying ‘er was his descendant, and now that she had become this lord’s daughter-in-law, who would dare to provoke them in the future?<br/><br/>In the future, their upper nine would be passed down forever!<br/><br/>The three great experts of the torrent region were very happy, and the other experts were even more excited.<br/><br/>Not to mention the disciples.<br/><br/>The wedding continued.<br/><br/>At this moment, everyone’s faces revealed even more excitement and happiness.<br/><br/>This was especially so when they received news from some of the powerful disciples at the front lines not long after.<br/><br/>They received news that all the powerful disciples in the eight regions had begun to retreat.<br/><br/>The universe they occupied had also been abandoned.\t\t\t\t\t\t</div>", "images": {}, "success": true}