{"id": 1587, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15215383.html", "title": "Chapter 4590 - Chapter 4590: Gift 4589", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4590 - Chapter 4590: Gift 4589</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4590: Gift 4589<br/><br/>“All of you have done well!”<br/><br/>Wang Xian looked at his thirteen children and praised them with a smile on his face.<br/><br/>“As long as you are satisfied, father.”<br/><br/>The children also smiled.<br/><br/>“Father, we have experienced a lot in the past 200 million years. We have lost some and gained a lot.”<br/><br/>Wang yinyin walked to Wang Xian and pulled his arm. “We are no longer children.”<br/><br/>“Yes, you are no longer children!”<br/><br/>Wang Xian nodded with a smile. “However, how can father and your mother make you lose too much?”<br/><br/>As he spoke, ten figures flew over from the back.<br/><br/>“Yiner!”<br/><br/>One of the women looked at Wang yinyin and asked with a smile.<br/><br/>“Master!”<br/><br/>Wang Yinyin’s face instantly revealed a pleasantly surprised expression. “Master, I’m… I’m glad that you’re okay!”<br/><br/>“Martial uncle!”<br/><br/>“Senior Feng!”<br/><br/>Wang Lanjiang and the others saw a few familiar figures and revealed excited expressions. They immediately went up to them.<br/><br/>“Haha, we didn’t die. We didn’t die. It was your father who sent people to save us and saved our lives.”<br/><br/>Wang Yinyin’s master and the others said with smiles on their faces.<br/><br/>“This? Senior Feng and the others didn’t die. I remember that senior Feng used a forbidden move and self-detonated all his energy to perish together with the enemy.”<br/><br/>“Hiss, our martial uncle didn’t die. He’s still alive. This… how did Wang Lanjiang’s father do it?”<br/><br/>“Oh my God, senior Feng and the others didn’t die. That’s Great!”<br/><br/>Below, when everyone saw the ten figures, their faces were filled with shock.<br/><br/>During the 200 million years of war between the torrent region and the eight regions, their torrent region had produced many heroes.<br/><br/>These heroes didn’t hesitate to use forbidden techniques to perish together with their opponents, in order to save their own disciples and clansmen.<br/><br/>These people were worshipped as heroes and were worshipped in the heroic soul palace.<br/><br/>But now, these ten people were still alive.<br/><br/>Below the stage, the three chaos-level experts from the torrent region were filled with surprise and curiosity.<br/><br/>They exchanged glances and walked up the stage.<br/><br/>“I never expected that all of you are the parents of the thirteen elites from our torrent region. This is truly unexpected. May I know where all of you come from?”<br/><br/>The strongest person from the gate of God, The Godly King, opened his mouth and asked with a twinkle in his eyes.<br/><br/>“I’m from a region not far away. Sorry to bother you.”<br/><br/>Wang Xian looked at the three of them and said with a smile.<br/><br/>“It’s really hard to imagine how you managed to raise such outstanding children.”<br/><br/>The strongest person from the torrent region also said with a slight sigh.<br/><br/>They were all very polite. This group of people in front of them was too mysterious. They could not tell their strength.<br/><br/>However, to be able to nurture 13 heaven’s favored sons that shocked the world, they felt that they were at least at the chaos level.<br/><br/>Furthermore, it was possible that they had reached an extremely deep level in the chaos level.<br/><br/>“Thank you!”<br/><br/>Wang Xian smiled faintly. He looked at Wang Lanjiang and said with a smile, “Aren’t you going to introduce your wife to us, our future daughter-in-law?”<br/><br/>“Father.”<br/><br/>Wang Lanjiang’s face turned red. He immediately held Gongsun Ying Er’s hand and said, “This is the girl I met here. Her name is Gongsun Ying Er. We used to cultivate together and fight together.”<br/><br/>Gongsun Ying Er looked at Wang Xian and the rest, feeling a little restrained. She called out in a low voice, “Uncle and aunt.”<br/><br/>“Hehe, you’ll have to change your name in a while,”the strongest person in Hong Qu said with a smile.<br/><br/>“That’s right.”<br/><br/>Wang Xian and the rest looked at their future daughter-in-law and nodded with a smile. They had investigated Gongsun Ying ‘er and understood her well.<br/><br/>They were also very satisfied with her.<br/><br/>“Today is your wedding day. As parents, we have to give you some gifts. Child, tell us what gifts you want.”<br/><br/>Wang Xian and the rest looked at Gongsun Ying ‘er and asked with a smile.<br/><br/>“Um… father… father, mother, I don’t need any gifts. It’s fine as long as you can appear.”Gongsun Ying Er was a little shy and restrained as she said intermittently.<br/><br/>“It’s fine. Don’t be nervous. We can satisfy whatever you want.”<br/><br/>Lan Qingyue said to her with a smile.<br/><br/>“Mother, there’s really no need.”Gongsun Ying Er shook her head.<br/><br/>“Mother, father, why don’t I wait for Ying ‘er to speak?”<br/><br/>Wang Lanjiang said from the side.<br/><br/>“Hehe, sure!”Lan qingyue nodded with a smile.<br/><br/>“Father, mother, Ying ‘ER’s greatest wish is to one day be able to expel the eight regions from the torrent zone. Father, mother, our training has ended. What do you think?”<br/><br/>Wang Lanjiang said with a smile.<br/><br/>“Yes, father, mother. The people from the eight directions region are too despicable. You have to help us teach them a lesson,”a few girls who surrounded Wang Xian said coquettishly.<br/><br/>“Alright, Alright. You have been training for more than 200 million years. Everyone has a wish, Alright?”<br/><br/>Wang Xian looked at them dotingly and touched the heads of the girls.<br/><br/>“Hehe, father is the best.”The girls nodded happily.<br/><br/>“Then, after Big Brother’s big wedding, I’ll have to trouble father to make a move.”The boys also said with smiles on their faces.<br/><br/>They had been in the torrent region for more than 200 million years. They already had feelings for this place.<br/><br/>Naturally, they hoped that they could expel the entire region.<br/><br/>“This…”<br/><br/>At the side, all the strong disciples in the torrent region heard their family’s conversation. Their faces were filled with shock and joy.<br/><br/>All the strong disciples knew that the existence that could nurture Wang Lanjiang and his group of Heaven’s favored sons was definitely not simple.<br/><br/>Moreover, their parents were able to cross regions and place Wang Lanjiang and his group in their torrent area to train, so they were definitely top-notch experts.<br/><br/>They were definitely not weaker than the three lords in their torrent area, and were even much stronger than the three lords!<br/><br/>Now that Wang Lanjiang’s father was willing to take action to expel the eight directions region, excitement and excitement could be seen on their faces!<br/><br/>“There’s no need to end it. I’ll give all of you a gift for your wedding this time, Boss.”<br/><br/>Wang Xian smiled, he raised his head and looked at the sky on the right. “The strength of the eight directions region is not bad. One of them obtained an opportunity and broke through to above the chaos realm not long ago. They are even prepared to wipe all of you out on the day of your wedding, Xiao Jiang.”<br/><br/>He looked at the sky to his right as he spoke. He extended his arm and a terrifying black hole appeared in the void in front of him.<br/><br/>In the black hole, more than 1,000 heaven origin creation realm powerhouses appeared.<br/><br/>All of them had excited expressions on their faces as they flew over.<br/><br/>“What?”<br/><br/>Wang Xian’s words, the sudden appearance of the black hole and the more than 1,000 heaven origin creation realm powerhouses in the eight regions of the black hole caused all the strong disciples in the torrent region to be slightly shocked. They looked over with shocked expressions.<br/><br/>“Kill them today and expel them from the torrent area as your wedding gift, Boss.”<br/><br/>Wang Xian said calmly. He extended his hand. In the next second, a scene that shocked and horrified everyone appeared!\t\t\t\t\t\t</div>", "images": {}, "success": true}