{"id": 1583, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15210995.html", "title": "Chapter 4586 - Chapter 4586: 4585, Their Respective Lives", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4586 - Chapter 4586: 4585, Their Respective Lives</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4586: 4585, their respective lives<br/><br/>As time passed, Wang Xian and the group of girls strolled around the area of the torrent every day. From time to time, they would look at the children from afar. They were rather carefree.<br/><br/>However, compared to them, the lives of the thirteen little fellows were not as easy.<br/><br/>During the war, the thirteen little fellows who belonged to the torrent area were either cultivating or fighting every day.<br/><br/>As the war broke out, they had to follow the experts to launch sneak attacks and counter-attacks to alleviate the crisis in their torrent zone.<br/><br/>However, as time passed, the torrent zone became more and more suppressed. More and more universes were occupied.<br/><br/>The war was extremely intense.<br/><br/>“Eh? Boss got to know a girl who has just broken through to the Heaven’s origin manifestation stage. The girl is not bad.”<br/><br/>On this day, Wang Xian and the rest received a piece of news. A smile appeared on their faces.<br/><br/>“They formed a deep friendship during the war. It’s normal for them to have feelings for each other now. The girl is not bad as well. They can be considered to have a true friendship in times of adversity.”<br/><br/>Wang Xian revealed a smile when he received the news.<br/><br/>According to his divination, the two boys in his family would find a girlfriend in the next few hundred million years.<br/><br/>“Oh, isn’t it a little bad for us to keep an eye on a bunch of little guys in the Dark?”<br/><br/>The group of girls looked at Wang Xian with a smile.<br/><br/>“Indeed, it’s a little bad. Haha.”<br/><br/>Wang Xian smiled. “We’ve seen enough. Let’s go back first. We’ll come back when the war in the torrent zone is almost over.”<br/><br/>“Yeah, that’s fine too. We’ve visited every corner of the torrent zone in the past tens of millions of years.”<br/><br/>The group of girls nodded their heads. Then, they returned to the Dragon Palace.<br/><br/>Wang Xian did not go out to wander anymore. With his current strength, it would be easy for him to go to all the major regions and universes in the future.<br/><br/>Even if the calamity ended, he could easily enter a universe with the characteristics of the power of chaos in his body.<br/><br/>In addition, even if this universe rejected Wang Xian and attacked him, with his strength, he could flatten an entire universe.<br/><br/>After returning to the Dragon Palace, Wang Xian used this time to teach Guan Shuqing and the other girls to cultivate and the disciples of the Dragon Palace to cultivate.<br/><br/>Putting everything else aside, the strength of the girls was only at the control level. It was a little too weak.<br/><br/>With sufficient resources and treasures, the strength of the girls increased rapidly.<br/><br/>Most importantly, in Wang Xian’s time domain, 10 million years was equivalent to one billion years.<br/><br/>Time passed once again and 200 million years passed very quickly.<br/><br/>Boom! Boom! Boom<br/><br/>Boom! Boom! Boom<br/><br/>In the Dragon King Hall, Guan Shuqing and the rest who were in the time domain were emitting a powerful aura.<br/><br/>After 200 million years and 10 billion years in the time domain, the strength of the girls had finally reached the chaos level.<br/><br/>Speaking of which, other than Lan Qingyue, the rest of the girls were much weaker in terms of talent.<br/><br/>Using 20 billion years to upgrade from the control level to the chaos level was something unimaginable to the other experts.<br/><br/>However, with the help of Wang Xian, the speed was not very fast.<br/><br/>“Alright, stop cultivating. Something big is about to happen.”<br/><br/>Wang Xian looked at the group of girls and said with a smile.<br/><br/>“Huh? What Big Thing?”The group of girls were slightly stunned and looked at him in surprise.<br/><br/>“It’s about boss. Boss is getting married. As parents, we can’t have this wedding.”<br/><br/>Wang Xian said to them with a smile.<br/><br/>“What? Boss is getting married?”<br/><br/>The group of girls were slightly shocked. Following that, a nostalgic look appeared on their faces. “Xiao Xian, the children have been training for more than 200 million years. It’s time for them to come back.”<br/><br/>“Yeah, it’s about time. They have been training for more than 200 million years. They have already experienced what they should have experienced.”<br/><br/>Wang Xian nodded his head. With a wave of his arm, a black hole appeared in front of them.<br/><br/>He gestured to the group of girls and entered the black hole.<br/><br/>Soon, they arrived in front of the river of chaos in the torrent region.<br/><br/>“Speaking of which, how far has the war between the torrent region and the eight regions progressed since we didn’t pay attention to the matters here for 200 million years?”<br/><br/>Guan Shuqing and the rest looked at the surroundings of the torrent region and asked curiously.<br/><br/>“The torrent region has been defeated continuously for more than 200 million years. Now, all the forces have been gathered at the river of chaos. The entire torrent region has suffered heavy casualties.”<br/><br/>Wang Xian spoke.<br/><br/>“AH? How are the little ones doing now?”<br/><br/>“Not only do we have to pay attention to the little ones themselves, we also have to take care of their friends. I don’t want the little ones to blame us for not saving their friends in the dark after we get to know each other.”<br/><br/>The few girls were slightly shocked and asked.<br/><br/>“It’s alright. I have Jiu Tian keeping an eye on them. The battle is very intense. There are indeed powerhouses in the Heaven’s origin manifestation who have died completely in the torrent region. There are also some friends of the little ones who have died completely. However, before they died, they were all taken away by Jiu Tian.”<br/><br/>Wang Xian replied. Naturally, he had already taken care of these matters.<br/><br/>The main purpose of letting his children train was to let them grow up.<br/><br/>It was inevitable that there would be life-and-death separation during the process of growth.<br/><br/>It was enough to let them experience it. Of course, it was not enough to let their friends really die.<br/><br/>Before they died, Jiu Tian had already preserved a trace of their lives.<br/><br/>“That’s good. Speaking of which, will boss’s wedding be held here? Isn’t it at home?”<br/><br/>Guan Shuqing and the rest asked.<br/><br/>“Oh, it’s here now. At most, we can go back to the Dragon Palace and hold another one.”<br/><br/>Wang Xian smiled nonchalantly and brought them to the river viewing tower.<br/><br/>The river viewing tower was a pleasure zone where people could stay and play. Wang Xian and the rest had rented a room here for a long time.<br/><br/>Jiu Tian was also here at the moment.<br/><br/>“Jiu Tian.”<br/><br/>When Wang Xian arrived, he called Jiu Tian over with a thought.<br/><br/>“Dragon King!”<br/><br/>“Dragon Queen!”<br/><br/>The next second, Jiu Tian arrived and greeted him respectfully.<br/><br/>“How is it?”A group of girls asked him immediately.<br/><br/>“Rest assured, Dragon Queen. Although the crown prince and the princesses have gone through a lot of hardships, they are still relatively stable. Ten years later, the crown prince will be married to a girl from the Hong Canal faction.”<br/><br/>“Now, the first crown prince is a core member of the Divine Gate while that girl is the descendant of the strongest person in the Hong Canal faction. When they get married, there will be some form of union. Of course, the first crown prince and that girl are truly in love.”<br/><br/>Jiu Tian replied, he continued, “The tenth crown prince has also found a girl that he likes. The relationship between the two of them is also very good. Now that the tenth crown prince is in the upper nine regions, he is also highly regarded by the upper nine powerhouses. It can be said that the thirteen crown princes have a high status in the Hong Canal region and are considered as core figures.”<br/><br/>Wang Xian and the rest nodded. With the talents of these little guys, more than 200 million years was enough for them to shine. All of their abilities had reached the level of control.\t\t\t\t\t\t</div>", "images": {}, "success": true}