{"id": 1580, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15207581.html", "title": "Chapter 4583 - Chapter 4583: 4582. The Breakthrough Of The Divine Roc Of The Nine Heavens", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4583 - Chapter 4583: 4582. The Breakthrough Of The Divine Roc Of The Nine Heavens</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4583: 4582. The breakthrough of the Divine Roc of the Nine Heavens<br/><br/>It had been a long time since the Divine Roc of the Nine Heavens wanted to make a breakthrough.<br/><br/>Now that there was finally a chance to make a breakthrough, he naturally wouldn’t give it up.<br/><br/>“Are You Ready Now? If so, let’s start the breakthrough as soon as possible.”<br/><br/>Wang Xian looked at him and asked.<br/><br/>“Your Majesty Dragon King, I’m already prepared.”<br/><br/>The Divine Roc of the Nine Heavens replied respectfully.<br/><br/>“Alright!”<br/><br/>Wang Xian nodded and revealed a smile. “Let’s go to the chaos to break through.”<br/><br/>As he spoke, he waved his arm and brought the Divine Roc of the Nine Heavens to a place of chaos.<br/><br/>This place was sparsely populated and was a good place to break through.<br/><br/>Wang Xian did not know the exact situation of breaking through the chaos. Therefore, it was a better choice to do so in a place with no one around.<br/><br/>Wang Xian moved his palm and the fire attribute Chaos Treasure appeared in front of him.<br/><br/>“This is the key to breaking through to above Chaos?”<br/><br/>The Divine Roc of the Nine Heavens looked at the chaos supreme. His face was filled with excitement and excitement.<br/><br/>“Yes, devour it and completely refine it. Only then will there be a chance to break through to above chaos. During this process, it will be exceptionally dangerous. If you are not careful, you will be devoured by the Chaos Supreme Treasure.”<br/><br/>“And once the Chaos Supreme Treasure is devoured, you will be completely destroyed.”<br/><br/>Wang Xian reminded him.<br/><br/>The Divine Roc of the nine heavens nodded his head heavily. There was a solemn expression on his face.<br/><br/>“Dragon King, I will start now.”<br/><br/>He looked at Wang Xian who was at the side and said decisively.<br/><br/>“Sure!”<br/><br/>Wang Xian nodded his head. “I will protect you from the side.”<br/><br/>“Thank You, Your Majesty. If I can make a breakthrough, I will definitely devote my life to you, Dragon King, and the Dragon Palace.”<br/><br/>The Divine Roc of the Nine Heavens said with gratitude.<br/><br/>Wang Xian smiled and signaled him to start the breakthrough.<br/><br/>“CHIRP CHIRP CHIRP!”<br/><br/>“CHIRP CHIRP CHIRP CHIRP!”<br/><br/>The Divine Roc of the Nine Heavens Chirped and stared at the Chaos Supreme Treasure in front of him with a burning gaze.<br/><br/>He flapped his wings slowly. The huge wings surrounded the chaos supreme treasure and began to refine and absorb it.<br/><br/>Buzz<br/><br/>However, not long after the Divine Roc of the Nine Heavens refined it, the chaos supreme treasure suddenly entered his body.<br/><br/>Chirp! Chirp<br/><br/>The Divine Roc of the Nine Heavens cried out and terrifying flames erupted from its body.<br/><br/>Some of these flames belonged to itself and some belonged to the Chaos Supreme Treasure.<br/><br/>The two types of flames did not fuse together. Instead, they began to devour each other.<br/><br/>“It’s starting.”<br/><br/>Wang Xian looked at this scene and muttered.<br/><br/>The breakthrough began.<br/><br/>If the Nine Heavens Divine Roc could devour the Chaos Supreme Treasure, it would achieve a breakthrough.<br/><br/>If the Chaos Supreme Treasure devoured the Nine Heavens Divine Roc, the Nine Heavens Divine Roc would die completely.<br/><br/>The confrontation between the two began.<br/><br/>Wang Xian stood together and watched quietly.<br/><br/>In the beginning, the Nine Heavens Divine Roc was in an advantageous position. It kept suppressing the energy that was devouring the Chaos Supreme Treasure.<br/><br/>However, it was not that easy to completely devour the primal Chaos Supreme Treasure.<br/><br/>This would take a very long time.<br/><br/>In the blink of an eye, tens of thousands of years had passed. Wang Xian looked ahead and frowned slightly.<br/><br/>The speed of the Divine Roc of the Nine Heavens Devouring was a little slow.<br/><br/>He was a little tired.<br/><br/>The Primal Chaos Supreme Treasure was resisting little by little. This caused the speed of the Divine Roc of the Nine Heavens Devouring to become slower and slower.<br/><br/>It was even less than one-tenth of the initial speed.<br/><br/>As time continued to pass, Wang Xian realized that the Divine Roc of the Nine Heavens was a little weak and was being suppressed.<br/><br/>Instead, the Supreme Treasure of Chaos began to absorb the Divine Roc of the Nine Heavens.<br/><br/>Wang Xian looked at this scene and frowned slightly. “This won’t do. If this continues, I will fail.”<br/><br/>His gaze flickered slightly. After hesitating for a moment, he waved his arm.<br/><br/>Buzz<br/><br/>An extremely majestic fire attribute energy entered the body of the Divine Roc of the Nine Heavens to help him resist the breakthrough of the Chaos Supreme Treasure.<br/><br/>However, something unexpected happened. Part of the majestic fire attribute energy that he released entered the body of the Divine Roc of the Nine Heavens while another part entered the body of the Chaos Supreme Treasure, it was perfectly absorbed by the Primal Chaos Supreme Treasure.<br/><br/>“This is?”<br/><br/>Wang Xian raised his eyebrows. “Currently, the primal Chaos Supreme Treasure has completely merged with the Nine Heavens Godly Peng. However, at the moment, the Nine Heavens Godly Peng does not have control over the primal Chaos Supreme Treasure. Instead, it is suppressed by the primal Chaos Supreme Treasure. In other words, the Nine Heavens Godly Peng will eventually be devoured and assimilated by the primal Chaos Supreme Treasure.”<br/><br/>This also meant that the absorption and refinement of the primal chaos supreme treasure could not be helped by external forces.<br/><br/>Other experts would not be able to help.<br/><br/>This was because when the refinement and devouring began, the Chaos Supreme Treasure would merge with it.<br/><br/>External forces would not only help the refiner, but also the Chaos Supreme Treasure.<br/><br/>“This breakthrough is really difficult. If this goes on, the Nine Heavens Divine Roc will completely perish.”<br/><br/>Wang Xian mumbled.<br/><br/>At the same time, the Nine Heavens Divine Roc also realized this, there was a hint of anger and unwillingness on his face. “Dragon King, i… I’m afraid I can’t refine this chaos supreme treasure. Now that I’ve fused with the Chaos Supreme Treasure, I’ll be completely devoured by him sooner or later.”<br/><br/>“A breakthrough above the chaos realm is a narrow escape.”<br/><br/>Wang Xian sighed slightly, but he shook his head. “Generally speaking, even existences above the chaos realm can’t help in any way. However, I Can!”<br/><br/>As he said that, a wave of chaotic energy surged toward the Chaos Supreme Treasure and the Nine Heavens Divine Roc.<br/><br/>Wang Xian suppressed their powers to an extremely weak state.<br/><br/>In fact, he could only sense their powers as rulers from the outside world.<br/><br/>“I have suppressed you and the Chaos Supreme Treasure to the ruler realm and sealed most of your powers. You suppress and absorb it while I release the energy of the chaos supreme treasure bit by bit.”<br/><br/>Wang Xian said to the Nine Heavens Divine Roc.<br/><br/>Regarding the breakthrough of the Nine Heavens Divine Roc, he couldn’t force it to devour the Chaos Supreme Treasure.<br/><br/>However, he could seal most of the powers of the Nine Heavens Divine Roc and the Chaos Supreme Treasure, leaving only a small portion of their powers.<br/><br/>For example, both parties only had the power of the ruler realm. Under such circumstances, the Intelligent Nine Heavens Divine Roc could use his experience to devour this portion of the power of the Chaos Supreme Treasure.<br/><br/>As long as the fire attribute power controlled by the Nine Heavens Divine Roc could suppress the chaos supreme treasure, it meant that it could successfully devour it.<br/><br/>This method was impossible in the eyes of other experts, even the Alliance Master of the Universal Alliance.<br/><br/>However, it wasn’t a big problem for Wang Xian.<br/><br/>“Thank you, Dragon King! Thank you, Your Majesty!”<br/><br/>The Divine Roc of the Nine Heavens thanked him immediately.<br/><br/>He knew that with his own strength, he would not be able to break through. In the end, the only thing that would welcome him would be death.<br/><br/>Wang Xian’s action was equivalent to saving his life.<br/><br/>Furthermore, he could help him to break through. How could he not be grateful.<br/><br/>This also made the Divine Roc of the nine heavens even more respectful towards the unfathomable Wang Xian.<br/><br/>“Absorb it as soon as possible. Break through as soon as possible.”<br/><br/>Wang Xian said faintly without much fluctuation in his mind.<br/><br/>Time passed once again. Since he needed to devour it bit by bit, it took a very long time for him to make a breakthrough.<br/><br/>Under the condition of having a time domain, a million years later. The Divine Rocs of the Nine Heavens finally completed their final transformation.\t\t\t\t\t\t</div>", "images": {}, "success": true}