{"id": 1585, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15212176.html", "title": "Chapter 4588 - Chapter 4588: 4587 Recognized Each Other", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4588 - Chapter 4588: 4587 Recognized Each Other</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4588: 4587 recognized each other<br/><br/>Time was fleeting to Wang Xian and the rest.<br/><br/>This day was the only good thing that had happened in the last few hundred million years to the torrent region.<br/><br/>It was the day of the wedding between Wang Lanjiang of the Divine Gate and Gongsun Ying ‘er of the upper nine.<br/><br/>Wang Lanjiang of the divine gate was the most dazzling hero during the war.<br/><br/>He rose in these 200 million years and used a short 200 million years to break through from the peak of the ruler realm to the current control level.<br/><br/>Furthermore, it was not an ordinary control level.<br/><br/>It was comparable to two control level powerhouses. In addition, he had a heavenly Yuan Destiny Supreme Treasure. In other words, Wang Lan Jiang could match the weakest Great Dao level powerhouse.<br/><br/>Of course, this was only comparable.<br/><br/>Great dao-level experts usually had powerful treasures and weapons.<br/><br/>However, according to the Divine Gate’s Divine King, Wang Lanjiang only had 300 million years of life.<br/><br/>In other words, he had achieved his current achievements in 300 million years.<br/><br/>This was extremely terrifying and terrifying.<br/><br/>It made everyone feel incredulous.<br/><br/>In 300 million years, to be able to break through to the heavenly fate realm was already an extremely heaven-defying talent.<br/><br/>However, Wang Lan Jiang had already reached the level of two control levels.<br/><br/>Extremely terrifying!<br/><br/>Similarly, although Upper Nine’s Gongsun Ying Er didn’t have Wang Lan Jiang’s heaven-defying strength, as the granddaughter of a primal chaos level expert, she had used 300 million years to break through to the heavenly fate realm, she was also a genius that shocked many universes.<br/><br/>Unfortunately, she was only slightly dimmer in front of the dazzling Wang Lanjiang.<br/><br/>In addition, in these 200 million years, the three major factions had given birth to too many heaven’s favorites.<br/><br/>Wang Lanjiang, Wang Guanzhou from the gods, Wang Yin ‘er from the torrent, Wang Jiu ‘er, Wang…<br/><br/>And so on.<br/><br/>These heaven’s favorites had risen up powerfully in these 200 million years, each and every one of them was stunning.<br/><br/>What shocked everyone the most was that these 13 heaven-defying prodigies all had the surname Wang.<br/><br/>Furthermore, all of them were over 300 million years old.<br/><br/>At that time, this matter had also shocked the flood channel Divine Gate and the upper nine primal chaos realm experts.<br/><br/>For this, they had investigated the 13 heaven-defying prodigies’teachings and traced them back to when they were born. They were 100% certain that there was nothing strange about it.<br/><br/>This also caused the upper echelons of the three major forces to say that the powerful rise of the thirteen heaven-defying prodigies with the surname Wang meant that the torrent area would become a king in the future.<br/><br/>They would lead the torrent area and walk the path of the king.<br/><br/>Even though the torrent area was currently suppressed by the eight regions, they still firmly believed that it wouldn’t be long before these thirteen stunning prodigies would lead them to expel the experts from the eight regions.<br/><br/>They could even counterattack.<br/><br/>“Today, apart from the wedding of Lord Wang Lan Jiang and Lord Gongsun Ying ‘er, there are six other lords holding a grand wedding together. This also represents the further alliance of the three great forces of the Torrent Region!”<br/><br/>“Today’s grand wedding is also the attitude of the three great forces. It tells our disciples that in the future, the three great forces will be indistinguishable from each other.”<br/><br/>“I heard that Wang Lanjiang, Wang Yin ‘er, Wang Jiu’er, Wang Yueqing, and the other elites have a very good relationship. This wedding will also be held as the best man and Maid of Honor!”<br/><br/>“That’s right. This time, almost all the experts from our torrent region have arrived. The godly monarch, Patriarch Hongqu, and patriarch nine fingers will also be present. They will also be present to witness it together.”<br/><br/>“This can be considered the only joyous occasion in our torrent region in the past 200 million years. Heh Heh, I believe that in the future, our torrent region will be able to defeat the eight regions and expel them from our region.”<br/><br/>Today, the front of the river of chaos was abnormally lively.<br/><br/>At that moment, in front of the river observation tower, the experts from the three major factions had received a portion of the river of Chaos Water. They had paved an abnormally beautiful field in the sky.<br/><br/>The experts of the three major forces and tens of millions of disciples of the ruler realm had all arrived.<br/><br/>The disciples were discussing excitedly.<br/><br/>Today was a joyous occasion in their flood region.<br/><br/>All the experts and disciples were filled with smiles.<br/><br/>This also alleviated the depressing atmosphere of the war.<br/><br/>“Little Xian, today is very lively and festive. The decorations in front are also very good.”<br/><br/>In the river viewing tower, Guan Shuqing and the rest of the girls looked at everything in front of them. They were affected by the festive atmosphere and smiled.<br/><br/>“Yes, the kids are doing well. As parents, we are also very pleased.”<br/><br/>Wang Xian looked at everything with a smile on his face. His children had grown up and he was about to have a family.<br/><br/>“Lan Jiang’s bride is also not bad. She’s quite a nice person. She’s going to be a mother-in-law soon. I’m really not used to it,”Lan Qingyue said with a smile.<br/><br/>“Hehe.”<br/><br/>Wang Xian smiled. “Lan Jiang and Gongsun Ying ‘er have experienced hundreds of wars of all sizes. They have formed a deep friendship. It can be considered a true friendship in times of adversity.”<br/><br/>“That’s right. However, it has been so long. After unlocking the memories of the children, how will they react?”The group of girls said.<br/><br/>Wang Xian shook his head.<br/><br/>Although he could divine what would happen in the future, there was no need for that.<br/><br/>If everything was divined, it would be meaningless.<br/><br/>However, there were some things that he had divined.<br/><br/>For example, the war between the torrent region and the eight regions was coming to an end today.<br/><br/>Of course, there were two outcomes for this ending.<br/><br/>If Wang Xian didn’t make a move, there would be one outcome. If he made a move, there would be another outcome.<br/><br/>“Be careful. When do we make our appearance?”<br/><br/>The group of girls couldn’t help but ask Wang Xian when they saw that the wedding was about to begin.<br/><br/>“Let’s make our appearance when we pay our respects to the heavens and earth and our parents,”said Wang Xian.<br/><br/>It was time to end the training of the little guys.<br/><br/>Two hundred million years was enough.<br/><br/>The group of girls nodded and looked outside.<br/><br/>Less than an hour had passed since the wedding started.<br/><br/>…<br/><br/>However, at this moment, in a starry sky in the region of the torrent.<br/><br/>More than a thousand heaven origin creation realm experts concealed their auras and quickly flew towards the river of chaos.<br/><br/>The leader was a young-looking expert. Although his face was young, he had lived for a very, very long time!<br/><br/>He was the strongest expert in the eight regions, the leader of the eight regions.<br/><br/>The eight regions had already been unified by a force.<br/><br/>The name of the force was also known as the eight regions.<br/><br/>The meaning was to traverse the eight directions of the chaos.<br/><br/>The eyes of the leader of the eight regions were filled with excitement and blazing killing intent.<br/><br/>The experts behind him were also filled with excitement.<br/><br/>Not long ago, their eight directions master had finally stepped into another realm.<br/><br/>An unprecedented realm.<br/><br/>And the moment their eight directions master broke through, they knew that the war with the torrent region was about to end.<br/><br/>The torrent region was about to become their domain.<br/><br/>Moreover, the torrent region was only the beginning!<br/><br/>It was the beginning of their invincible path!\t\t\t\t\t\t</div>", "images": {}, "success": true}