{"id": 1599, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15236592.html", "title": "Chapter 4602 - Chapter 4602: In The Final Chapter", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4602 - Chapter 4602: In The Final Chapter</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4602: In the Final Chapter<br/><br/>Every region had its own unique characteristics.<br/><br/>The Chaotic River in the Torrent Region.<br/><br/>Fa Wu Mountain in Fa Wu District.<br/><br/>The shocking white clouds in the Ancient Cloud Region.<br/><br/>In the following period of time, Wang Xian began his journey to the Chaotic World.<br/><br/>He stepped into a new field.<br/><br/>They passed through new areas.<br/><br/>At the same time, he had also obtained some Chaos cardinal treasures in some areas.<br/><br/>They saw some invincible experts in various regions.<br/><br/>These experts were all existences similar to the masters of calamities.<br/><br/>These Calamity Masters were also exploring the surrounding area.<br/><br/>The difference was that they needed to spend billions of years to find a region.<br/><br/>When Wang Xian encountered these Calamity Masters, he only observed the experts who were not bad from afar.<br/><br/>However, if the other party was a Master of Calamity who was extremely vicious and treated living beings like ants, killing them at will and cultivating evil techniques, Wang Xian would have killed him directly.<br/><br/>Yes, he would directly kill the other party.<br/><br/>“Cough, cough, cough. I didn’t provoke you. Why do you want to kill me? What realm are you at? Are there any other realms above the Master of Calamity?”<br/><br/>The High Devil Region was located in an extremely luxurious hall in the center of the universe.<br/><br/>A middle-aged man sat on the throne in the hall. His chest had been pierced by a spear. His face was filled with disbelief as he stared at the figure in front of him with a crazy expression and roared in despair.<br/><br/>“Yes, you didn’t provoke me. I just don’t like you.”<br/><br/>Wang Xian was standing in front of the luxurious palace. He looked at the middle-aged man indifferently and said,” You have slaughtered hundreds of living beings in the universe and absorbed all the dark attribute cultivators. You used their flesh and blood to increase your strength. Because you are a strong person, you can kill them. Now, I am stronger than you. Naturally, I can kill you.”<br/><br/>“Hahaha, this is the reason you want to kill me. I’m just killing a bunch of ants.”<br/><br/>The middle-aged man seemed to have gone crazy as he roared with an unwilling expression.<br/><br/>“In my eyes, you are just an ant.”<br/><br/>Wang Xian stared at him and said calmly.<br/><br/>“Ant? In your eyes, am I just an ant?”<br/><br/>The middle-aged man’s body trembled violently.<br/><br/>He was an invincible existence in the Upper Devil Region. His cultivation was extraordinary. He even went to other regions to hunt countless experts.<br/><br/>He had also encountered other existences of the same level, but those experts were not his match either.<br/><br/>Although he could not kill the other party, he could still make the other party flee.<br/><br/>He was such an existence, but in the end, he was easily crushed by a nameless, mysterious expert.<br/><br/>His expression was a little dazed.<br/><br/>He was an invincible existence.<br/><br/>He was an invincible existence that countless gods and devils believed in.<br/><br/>In the eyes of that mysterious young man, he was just an ant?<br/><br/>His breathing was a little hurried.<br/><br/>“Before you kill me, can you tell me what realm you are at?”<br/><br/>The middle-aged man asked with a trembling body.<br/><br/>” I don’t know. Maybe he’s invincible!”<br/><br/>Wang Xian shook his head. He had no idea what his current realm was.<br/><br/>Why don’t you call yourself invincible?<br/><br/>In addition, he wanted to see if there was anyone who could compete with him in this chaotic world.<br/><br/>However, he had already passed through seven or eight regions and still did not encounter a single one.<br/><br/>“Alright, you should die.”<br/><br/>Wang Xian waved his arm and a surge of Chaotic Force immediately enveloped the middle-aged man.<br/><br/>The destructive power immediately made him lose all his vitality.<br/><br/>“Hu hu hu!”<br/><br/>At the same time, in another universe in the High Devil Region, the figure of a middle-aged man climbed out of a Deity’s Lake.<br/><br/>He panted heavily, his expression constantly changing.<br/><br/>“Invincible? Invincible?” He muttered, his face filled with unwillingness.<br/><br/>But he couldn’t think of a way to take revenge.<br/><br/>The other party’s strength was too terrifying.<br/><br/>Facing that mysterious expert, he did not have the slightest ability to resist.<br/><br/>The other party had killed him as if he had crushed an ant.<br/><br/>It was effortless.<br/><br/>The middle-aged man was in despair, and his expression became even more ferocious and crazy.<br/><br/>He wanted revenge. Even if he was no match for that mysterious expert, did he not have any family? Did he not have his own universe?<br/><br/>“Buzz!”<br/><br/>” I can feel your disrespect towards me. When I say I’ll kill you, I mean completely kill you!”<br/><br/>At this moment, a familiar voice suddenly sounded in his ears. The middle-aged man’s eyes widened in disbelief.<br/><br/>“No!”<br/><br/>” No, no, no! Don’t kill me! I’m willing to be your slave! Your slave!” he roared.<br/><br/>“Buzz!”<br/><br/>However, the only response he got was death.<br/><br/>Wang Xian didn’t need slaves. With his current strength, he didn’t need any subordinates.<br/><br/>After killing the Calamity Master in the Upper Devil Region, Wang Xian absorbed it.<br/><br/>At the same time, many of the Calamity Master’s subordinates in the High Devil Region were killed by Wang Xian one by one. They were refined and absorbed.<br/><br/>Wang Xian could freely take all the resources in the entire Upper Devil Region.<br/><br/>However, he only took away the corpses and resources of these experts. He did not waste time collecting the resources that were useless to the Heaven Origin Fate Realm experts.<br/><br/>“Let’s go to the next area.”<br/><br/>After staying in this area for tens of thousands of years, Wang Xian’s strength had improved tremendously once again.<br/><br/>This wasn’t the first Calamity Master he had killed, but the third!<br/><br/>Every time he killed a Calamity Master, Wang Xian’s strength would increase tremendously.<br/><br/>His figure moved and left.<br/><br/>They headed to the next unknown region.<br/><br/>What Wang Xian didn’t know was that tens of thousands of years after he left, disciples of experts from the Upper Devil Region came to the old nest of their ruler. When they sensed that their ruler had been killed, they burst into tears.<br/><br/>Then, all the universes in the High Devil Region were in an uproar.<br/><br/>Five faceless statues were erected in various universes for all living beings to worship and worship.<br/><br/>They were grateful to the nameless powerhouse who had saved them.<br/><br/>He continued to fly and roam the primordial chaos.<br/><br/>When Wang Xian passed through the two areas, he discovered another area that was unusually bright.<br/><br/>“Eh? This place is even more resplendent and powerful than the Universe Alliance.”<br/><br/>Wang Xian was surprised when he arrived at a new area.<br/><br/>He had passed through more than a dozen regions. Including the regions he had encountered before, there were more than twenty regions.<br/><br/>However, this was the first time he had encountered three Calamity Masters in one area.<br/><br/>Moreover, this region was even more resplendent and powerful than the Universe Alliance he had encountered back then.<br/><br/>This place could no longer be called a region, but the fusion of two regions.<br/><br/>There were more than 3,000 universes in the two regions.<br/><br/>There were tens of thousands of Heavenly Yuan Creation Realm experts.<br/><br/>“Impressive. The primordial chaos is so vast, and there are so many experts. There are also quite a few resplendent regions!”<br/><br/>Wang Xian sighed.\t\t\t\t\t\t</div>", "images": {}, "success": true}