{"id": 1591, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15222928.html", "title": "Chapter 4594 - Chapter 4594: 4593 Invincibility 3", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4594 - Chapter 4594: 4593 Invincibility 3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4594: 4593 invincibility 3<br/><br/>Time passed slowly. Wang Xian was in the nine-origin universe undergoing a transformation.<br/><br/>With the influence of the five Chaos Supreme Treasures, the entire universe underwent a terrifying transformation.<br/><br/>The Chaos Supreme Treasures formed a supreme paradise. The density of various attributes had reached an unbelievable level.<br/><br/>This transformation could not be completed in a short period of time. It would take at least tens of millions of years, or even hundreds of millions of years.<br/><br/>After all, the chaos supreme treasure was needed to first affect a domain.<br/><br/>While Wang Xian was transforming the nine-origin universe, the powerhouses from the Dragon Palace and the righteous universe were also exploring further away.<br/><br/>At present, there were basically no treasures in this area of the nine-origin universe.<br/><br/>Be it the land of origin or other places, they had been explored by countless powerhouses.<br/><br/>Therefore, they needed to explore further.<br/><br/>In fact, a few hundred million years ago, a group of powerhouses had already begun to explore.<br/><br/>Wang Xian did not have the desire to explore other regions for the time being. He stayed in the nine-origin universe every day.<br/><br/>Ten million years passed very quickly.<br/><br/>The nine-origin universe had undergone great changes. Five regions were emitting extremely powerful energy.<br/><br/>Meanwhile, the experts of the Dragon Palace had also explored a new domain.<br/><br/>“Dragon King, according to the disciples of the Dragon Palace, one can go directly to another prosperous area from a black hole in the land of origin. We don’t know how strong that area is or if there are any chaos supreme treasures.”<br/><br/>Prime Minister GUI reported to Wang Xian.<br/><br/>“Alright, let them explore first.”<br/><br/>Wang Xian nodded his head. He wasn’t very interested in this new domain for the time being.<br/><br/>There were countless black holes at the land of origin. These black holes led to an unknown region.<br/><br/>In the past, the experts at the land of origin didn’t dare to enter the black holes rashly.<br/><br/>This was because they were afraid that the other part of the black hole would be as powerful as the previous land of origin.<br/><br/>If they were too far away after entering, they would die there completely.<br/><br/>After all, if they were too far away, even resurrection treasures would be useless.<br/><br/>However, a group of powerhouses from the Dragon Palace had left their blood essence in the Dragon Palace. With Wang Xian’s means, he could resurrect them.<br/><br/>Therefore, they could try to enter the black hole.<br/><br/>After hundreds of millions of years, they found a region on the other side of a black hole.<br/><br/>As for the strength of that area, they still needed to explore it.<br/><br/>However, not long after Prime Minister Gui told Wang Xian about this news, Prime Minister Gui rushed over again.<br/><br/>“Dragon King, according to the investigation of the powerhouses of the Dragon Palace, that area is very strong. There are three to four thousand powerhouses in the Heavenly Yuan realm. Among them, there are existences above chaos. The Supreme Chaos Treasure there has also been refined.”<br/><br/>Prime Minister GUI reported, “This region is an extremely aggressive region. They have destroyed another region around them. Now, they are also searching for other regions.”<br/><br/>“Oh?”<br/><br/>Wang Xian nodded. As they explored deeper, there were more and more powerhouses above chaos. “Does this mean that there is at least one chaos supreme treasure in that region?”<br/><br/>Of course, based on the time spent exploring, it was actually very little.<br/><br/>After all, they had explored for hundreds of millions of years before they could find an area. Only then could they encounter one in this area.<br/><br/>It was true. The realm of the Lord of calamity should be the highest realm!<br/><br/>“Yes, Dragon King. They invaded and occupied another area. The Chaos Supreme Treasure in the other area was also obtained by them,”Prime Minister Gui said.<br/><br/>“Do you know what attribute it is?”Wang Xian asked.<br/><br/>“According to the information sent by the disciples of the Dragon Palace, it should be light attribute.”<br/><br/>Prime Minister Gui said.<br/><br/>Wang Xian nodded. Light attribute. Currently, he did not have any chaos supreme treasure with light attribute.<br/><br/>He decided to find a time to get his hands on this chaos supreme treasure with light attribute.<br/><br/>However, before Wang Xian was ready to go over, a piece of news that shocked Wang Xian came from Prime Minister Gui thousands of years later.<br/><br/>“Dragon King, two million years ago, the powerhouses of our Dragon Palace were discovered by the powerhouses in that area and were attacked by them. Not long ago, we discovered an unfamiliar powerhouse in the Heaven’s origin realm in the land of origin.”<br/><br/>“This powerhouse is the powerhouse in that area. They seem to be investigating the situation in our area.”<br/><br/>Prime Minister Gui came forward to report.<br/><br/>“Oh? What a surprise. Send the news to the disciples of the Justice Alliance and the Dragon Palace Alliance. Tell them that the strongest powerhouse in our region has a combat strength equivalent to three primal chaos levels.”<br/><br/>Wang Xian squinted his eyes slightly and instructed.<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui replied immediately.<br/><br/>With his status in the nine-origin universe and Wang Xian’s status, all the experts would definitely obey him with just a word.<br/><br/>Generally speaking, unless the experts from the Dragon Palace Alliance and the Justice Alliance personally mentioned that there was an existence above chaos in their region, the experts from other regions would not be able to find out anything.<br/><br/>“That region won’t invade us, right?”<br/><br/>Prime Minister Gui left, mumbling with a smile on his face.<br/><br/>It would be interesting if they came to invade them.<br/><br/>After Prime Minister Gui spread the news, the experts of the Justice Alliance and the Dragon Palace Alliance immediately complied.<br/><br/>Moreover, Prime Minister Gui sent the empty cicada clan to monitor the black hole in the land of origin that could lead to that area.<br/><br/>As time passed, more and more great beings from that area came through the black hole.<br/><br/>In addition, to prevent them from falling, they had built a powerful base under the land of origin.<br/><br/>This base was personally built by the strongest great being in that area, Calamity Master, and it was used to store a group of Great Beings’resurrection true treasures.<br/><br/>If an accident really happened, they could be resurrected immediately, and after they were resurrected, they could immediately return to their area.<br/><br/>The many experts in the area called the witchcraft region had spent hundreds of thousands of years in the land of origin.<br/><br/>Finally, on this day, over 3,000 Heavenly Yuan creator realm experts from the witchcraft region arrived.<br/><br/>They flew out from the land of origin and looked at the void in front of them.<br/><br/>“Hahaha, I didn’t expect that a weak region would be able to explore our area.”<br/><br/>“This area is not bad. A black hole can be teleported here directly. In the future, it will become a stronghold of our witchcraft universe, allowing us to explore other areas better.”<br/><br/>“According to our investigation, there are less than a Thousand Heaven’s origin creation realm experts in this area. There are even fewer chaos-level existences. If we occupy this area, we will be able to obtain a lot of resources and treasures. The heavens are really helping us in the witchcraft universe. If we occupy this area, we will be even stronger.”<br/><br/>At this moment, the eyes of the three thousand heaven origin creation realm experts in the witchcraft region were filled with excitement and fervor.<br/><br/>Once they occupied an area, they would be able to obtain many universes. These universes would become their territory.\t\t\t\t\t\t</div>", "images": {}, "success": true}