{"id": 1596, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15235013.html", "title": "Chapter 4599 - Chapter 4599: Invincible 8", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4599 - Chapter 4599: Invincible 8</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4599: Invincible 8<br/><br/>“Weng weng weng!”<br/><br/>“Weng weng weng!”<br/><br/>Next to a black hole below the Origin Source Grounds, inside an incomparably huge building that emitted endless might.<br/><br/>One by one, the experts in the Witch Region were revived from the resurrection treasures.<br/><br/>After they were resurrected, they still had shocked expressions on their faces.<br/><br/>It was also filled with fear!<br/><br/>“Where’s the Ancestor of Witchcraft? Lord Ancestor of Witchcraft, what should we do now?”<br/><br/>“What kind of existence is the other party? That person was able to easily slaughter all of us. What kind of expert is he?”<br/><br/>” The enemy has been fighting us for more than 3,000 years. This isn’t a war at all. They’re using us as whetstones. They’re using us to train. They don’t even put us in their eyes!”<br/><br/>” Run, run! We have to run! Otherwise, we’re finished! We’re completely finished!”<br/><br/>The experts in the Witchcraft Region were panicking.<br/><br/>When they arrived at the main hall of the building, more than 3,000 Sky Origin Creation Realm experts looked terrified.<br/><br/>The expert who attacked them just now was too terrifying.<br/><br/>They could not resist at all.<br/><br/>Escaping was the most important thing now.<br/><br/>“All experts, follow me. Break through this strange gray space and directly enter the black hole to escape!”<br/><br/>At this moment, the figure of the Ancestor of Witchcraft and Demons also appeared. He shouted with a trace of anxiety on his face.<br/><br/>When the three thousand Sky Origin Fate Realm experts heard this, they immediately followed without hesitation. They even abandoned the buildings that they had painstakingly built and flew out.<br/><br/>“Can you escape?”<br/><br/>However, just as they rushed out of the temple, a figure appeared outside and stared at them indifferently.<br/><br/>” You…” When the Ancestor of Witchcraft and Demons saw this figure, his body could not help but tremble. His eyes were bloodshot.” Sir, are you really going to kill us all?” If you spare our lives, we will definitely compensate you!”<br/><br/>He gave in. Most of the experts only brought one resurrection treasure.<br/><br/>If they were killed again, they would probably really die here.<br/><br/>Even the Witch Ancestor himself would die here.<br/><br/>The longer one lived, the more one did not want to die!<br/><br/>“In the primal chaos, the strong prey on the weak. If you occupy our territory, will you let us go? It won’t happen!”<br/><br/>Wang Xian looked at them coldly.<br/><br/>According to his divination and simulation, if the other party captured this area, their area would be extremely tragic.<br/><br/>The experts were hunted down, and many living beings were slaughtered.<br/><br/>There were many experts who used blood to increase their strength in the Witch Region.<br/><br/>For example, the Ancestor of Witchcraft and Demons in front of him devoured creatures of the same attribute to increase his strength.<br/><br/>Moreover, at least one-third of the experts in the Witch Region cultivated in this way.<br/><br/>To living beings, they were no different from the most terrifying demons.<br/><br/>It was basically the same as the Evil Sequence faction back then!<br/><br/>“Sir, don’t kill us. We are willing to serve you as king and become your subjects. We know that you will let us go. In the future, we will provide you with a large amount of treasures and resources every tribulation. Please don’t kill us!”<br/><br/>A Primal Chaos expert also begged for mercy with a terrified expression!<br/><br/>No matter what, he had to survive for now. Only by surviving was the most important thing.<br/><br/>” If I kill you, I’ll get even more resources and treasures!”<br/><br/>Wang Xian revealed a cold smile. He did not want to get entangled with them anymore. He moved and attacked the Ancestor of Witchcraft and Demons immediately!<br/><br/>” Damn it! He wants to kill us! Fight back! Fight back! Use all our strength! Even if we die, we won’t let him off!”<br/><br/>The Ancestor of Witchcraft and Demons sensed that Wang Xian was coming for him. He roared with a crazed expression.<br/><br/>They had cultivated for countless years, and they had the courage to fight. Now that they could not escape, they would fight to the death!<br/><br/>The energy in the body of the Ancestor of Witchcraft and Demons began to become chaotic, and the might on his body continued to rise. At the same time, his flesh and blood were rapidly melting.<br/><br/>He wore a hat on his head, and inside the hat was a space. There were countless living beings inside this space.<br/><br/>In an instant, all these living beings were sacrificed by him.<br/><br/>A vast amount of energy erupted from his body. This energy was chaotic, violent, and disorderly.<br/><br/>When Wang Xian saw this scene, he frowned slightly.<br/><br/>The Witch Ancestor had used forbidden power and wanted to perish together with him.<br/><br/>However, it was still a little weak!<br/><br/>“You deserve to die!”<br/><br/>Wang Xian instantly appeared in front of the Ancestor of Witchcraft and Demons. With the huge difference in strength and his Time Domain, he was a hundred times faster.<br/><br/>Before the energy in the body of the Ancestor of Witchcraft and Demons reached its peak, Wang Xian had already channeled the Chaotic Force into his body.<br/><br/>His dragon claw landed on the body of the Ancestor of Witchcraft and Demons, crushing all the energy in his body.<br/><br/>The extremely violent energy began to dissipate and calm down!<br/><br/>Under the gray Primal Chaos Power, the Ancestor of Witchcraft and Demons turned into a ball of black energy that was extremely deep.<br/><br/>Wang Xian waved his arm and kept the black energy ball.<br/><br/>He had a feeling that the Witch Ancestor had not been completely destroyed.<br/><br/>The reason why he dared to use a forbidden technique and self-destruct all his energy was because he had a powerful supreme treasure that could revive him.<br/><br/>Even if it was very far away, it could still be revived!<br/><br/>” The Ancestor of Witchcraft was killed in an instant!”<br/><br/>” Run! We’re no match for him! Run! Run!”<br/><br/>“Run!”<br/><br/>When the remaining 3,000 experts in the Witch Region saw their Ancestor of Witchcraft being killed again, they completely collapsed.<br/><br/>They all fled in all directions.<br/><br/>Now, they had lost their fighting spirit and only wanted to escape.<br/><br/>Wang Xian swept his gaze across them with a hint of mockery in his eyes as he moved.<br/><br/>His speed was too fast.<br/><br/>If these 3,000 experts could fight and defend together, Wang Xian might need some time.<br/><br/>However, fleeing in different directions would only hasten their deaths.<br/><br/>In less than a few seconds, the 3,000-odd Heavenly Origin Fate Realm experts who had fled turned into corpses that floated in front of Wang Xian.<br/><br/>These corpses were all huge treasures and resources.<br/><br/>“Dragon King!”<br/><br/>“Father!”<br/><br/>At this time, the experts of Dragon Palace also rushed over. Seeing that the battle had ended, their faces were full of respect.<br/><br/>” Let’s go to the Witch Region and take a look. Prime Minister Turtle, prepare yourself. The Witch Region will belong to the Dragon Palace in the future. We need to plan the development of this region.”<br/><br/>Wang Xian instructed them with a smile.<br/><br/>This was the first area occupied by Dragon Palace.<br/><br/>Wang Xian wasn’t very interested in plundering. However, since there was an area that was invading them, he naturally wouldn’t show any mercy and would subdue it.<br/><br/>In the future, the Dragon Palace would have plenty of opportunities to break through to the Sky Origin Fate Realm, as well as resources!\t\t\t\t\t\t</div>", "images": {}, "success": true}