{"id": 1597, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15235014.html", "title": "Chapter 4600 - Chapter 4600: Invincible 9", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4600 - Chapter 4600: Invincible 9</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4600: Invincible 9<br/><br/>“It’s the Dragon King!”<br/><br/>When the powerhouses of the Dragon Palace heard Wang Xian’s words, their faces were filled with excitement.<br/><br/>Taking down a region was a huge improvement for Dragon Palace!<br/><br/>A region could be as small as a few hundred universes, and as large as a thousand universes.<br/><br/>Not to mention the huge resources in these universes, the number of Sky Origin Creation Realm experts in these universes was very important to Dragon Palace!<br/><br/>“Buzz!”<br/><br/>Wang Xian moved and entered the black hole.<br/><br/>The other experts of Dragon Palace followed closely behind.<br/><br/>The target was the Witch Region.<br/><br/>Ninety-five percent of the experts in the Witchcraft and Fiend Region had been completely wiped out by Wang Xian.<br/><br/>However, this time, the Witch Region did not send all the experts to fight.<br/><br/>There were also more than 200 Heaven’s Origin Creation Realm experts guarding various important places in the Witch Region.<br/><br/>Apart from that, Wang Xian could sense that among the 3,000-odd Heavenly Origin Fate Realm experts, there were more than a dozen of them who were not completely dead except for the Ancestor of Witchcraft and Demons.<br/><br/>These experts had a special resurrection method.<br/><br/>However, even if they were resurrected, their strength had already decreased greatly.<br/><br/>“Weng weng weng!”<br/><br/>When the experts of the Dragon Palace went to the Witch and Demon Area through the black hole.<br/><br/>The gray domain around this area instantly disappeared.<br/><br/>The entire chaotic space returned to its original state.<br/><br/>” The gray energy has disappeared. Has the battle ended?”<br/><br/>“There are no more fluctuations. The battle should have ended. What’s the situation now? Did Dragon King and the others win?”<br/><br/>When the gray energy disappeared, the masters of the Justice Alliance and the Dragon Palace Alliance were still waiting outside.<br/><br/>They had been waiting for thousands of years.<br/><br/>For thousands of years, not a single expert had left.<br/><br/>This was because the situation within the gray energy was related to the fate of their region.<br/><br/>All the experts were filled with doubt.<br/><br/>Now that the gray energy had ended, all the experts were slightly shocked.<br/><br/>” I can’t sense the presence of any experts in this space. Let’s go inside and take a look!”<br/><br/>The leader of the Justice Alliance sensed everything in front of him. He frowned slightly and hesitated for a moment before speaking.<br/><br/>Then, the group of experts immediately flew forward.<br/><br/>The buildings in the Witchcraft District were still standing there.<br/><br/>It was still emitting a terrifying power.<br/><br/>The leader of the Justice Alliance and the others sensed the threat of death from this building.<br/><br/>Yes, this building brought them the threat of death.<br/><br/>It was an existence that could suppress Chaos.<br/><br/>“This… The Dragon King and the others are not here, and all the experts in the Witch Demon Area are not here either. What’s going on?”<br/><br/>An expert looked around and could not help but ask.<br/><br/>The leader of the Alliance of Justice and Order was shocked. He sensed the smell of blood around him and sensed that some powerful beings had fallen. He looked at the few Prophets who were divining the universe.<br/><br/>The three Seers who were divining the universe immediately joined forces and performed a divination.<br/><br/>Soon, their faces were filled with shock.<br/><br/>” There are too many experts involved. Our divination is not accurate, but we can confirm that more than 3,000 Sky Origin Fate Realm experts in the Witch Region have fallen!”<br/><br/>” We didn’t manage to divine the Dragon King’s situation. The Dragon King is very powerful, so we can’t divine him. Even the other experts of the Dragon Palace couldn’t divine him because of the Dragon King’s influence. But we can be sure that the Dragon King is safe and sound now!”<br/><br/>The three Prophet who was divining the universe said in shock.<br/><br/>The Dragon King was fine, but more than 3,000 Heaven’s Origin Fate Realm experts in the Witch and Demon Region had been killed. The result was obvious!<br/><br/>“The Dragon King and the others should have gone to the Witch and Demon Area.”<br/><br/>The leader of the Justice Alliance’s eyes flickered as he looked at the location of a black hole. Do you want to go over and take a look?”<br/><br/>“How powerful is the Dragon King now? How strong is Dragon Palace? They can destroy such a powerful area!”<br/><br/>” It’s too scary. If the Dragon King has the ambition to fight for hegemony, all of our universes will belong to the Dragon Palace!”<br/><br/>“Let’s go and see if we can help.”<br/><br/>The experts were shocked. They were glad that Dragon Palace didn’t occupy their universe.<br/><br/>They didn’t completely submit!<br/><br/>“Let’s go!” The leader of the Justice Alliance nodded and led the experts into the Witch Region!<br/><br/>….<br/><br/>On the other side of the black hole, Wang Xian had led the experts of the Dragon Palace to the Witch Region.<br/><br/>” Go to the center of the Witch Region and completely destroy the Witch Ancestor!”<br/><br/>Wang Xian looked around. This was a desolate chaotic space and there was nothing around.<br/><br/>He stretched out his palm and tore a crack in the chaos.<br/><br/>On the other side of the crack was a bright space.<br/><br/>It was a place in the universe.<br/><br/>It was the universe born by the Witch Ancestor and also his lair.<br/><br/>At this moment, the Ancestor of Witchcraft and Demons had just broken out of a special egg.<br/><br/>This fall was a huge loss for him.<br/><br/>His strength, which was originally above Chaos, was now only comparable to an existence at the level of two Chaos.<br/><br/>Fortunately, his realm and strength could still be slowly recovered.<br/><br/>“I can’t stay here any longer. I have to escape. I have to escape. That terrifying existence will definitely come and occupy the Witch Demon Region!”<br/><br/>The Ancestor of Witchcraft and Demons, who had completely stabilized his body and recovered his mind, said with an extremely ugly expression.<br/><br/>After witnessing that terrifying existence, he no longer had the heart to resist.<br/><br/>He even felt that he was not safe here and had to escape as soon as possible.<br/><br/>Run as far away as possible!<br/><br/>However, at this moment, he saw a black hole suddenly appear in front of the hall.<br/><br/>The black hole slowly grew bigger, and a familiar figure walked out.<br/><br/>When the Ancestor of Witchcraft and Demons saw this scene, his eyes were dull and his face revealed a look of despair.<br/><br/>“No!”<br/><br/>He roared crazily, his face full of pain and despair.<br/><br/>“Buzz!”<br/><br/>Wang Xian didn’t say much to him. With a wave of his arm, a surge of Chaotic Force enveloped him.<br/><br/>At the same time, the Soul-Absorbing Power read the memories of the Ancestor of Witchcraft.<br/><br/>Soon, information appeared in his mind.<br/><br/>Wang Xian moved his palm and completely killed the Ancestor of Witchcraft and Demons.<br/><br/>Killing an existence above Chaos was as easy as killing a chicken or a dog.<br/><br/>” I’ll send the information about the Witchcraft Region into your minds. Accept the universe of the Witchcraft Region. I’ll go and destroy the other Heaven’s Origin Creation Realm experts here.”<br/><br/>Wang Xian instructed Prime Minister Turtle and the rest behind him. With a flash, he disappeared!<br/><br/>He wanted to start hunting down the Sky Origin Creation Realm experts in the Witch Demon Region.<br/><br/>This was very simple for him.<br/><br/>“Move out!”<br/><br/>When the experts of the Dragon Palace received Wang Xian’s message, their eyes lit up and they immediately took action.\t\t\t\t\t\t</div>", "images": {}, "success": true}