{"id": 1594, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15232931.html", "title": "Chapter 4597 - Chapter 4597: 4,596 Invincible 6", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4597 - Chapter 4597: 4,596 Invincible 6</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4597: 4,596 invincible 6<br/><br/>“Boom, Boom, Boom!”<br/><br/>A terrifying battle erupted beneath the land of origin.<br/><br/>Countless explosions sounded out.<br/><br/>A clash between Masters of Calamity and Primal Chaos.<br/><br/>The attacks of over 6,000 heaven origin creation realm experts were destructive.<br/><br/>The entire land of origin was affected by the terrifying energy.<br/><br/>“Boom! Boom! Boom!”<br/><br/>“Boom! Boom! Boom!”<br/><br/>In the sky, the ancestor of sorcerer demon and the energy bombardier of the Nine Heavens Divine Roc.<br/><br/>There was an endless darkness and a crimson flame.<br/><br/>“Kill! Everyone, Kill! This fellow has just broken through to the realm above primal chaos not too long ago. I can kill him.”<br/><br/>After a few clashes, the ancestor of sorcerer demon immediately sensed the strength of the Nine Heavens Divine Roc.<br/><br/>At the realm above Primal Chaos, once one broke through, one’s power could rapidly increase.<br/><br/>Because at this realm, one could freely absorb a type of energy in the universe.<br/><br/>Moreover, this absorption, in his view, had no end.<br/><br/>The longer one accumulated, the greater the increase in power.<br/><br/>In a short exchange with the Nine Heavens Divine Roc, ancestor sorcerer demon could confirm that it had just broken through.<br/><br/>With such strength, he had 80% confidence in defeating it. In fact, if he did not escape, he had the confidence to kill it.<br/><br/>“Good, good, good. Kill, fight with them. As long as our ancestor of witchcraft can win, we can destroy this group of people!”<br/><br/>“Kill, Kill, Kill!”<br/><br/>The experts roared with excitement.<br/><br/>“The Divine Roc of the Nine Heavens is indeed no match for the ancestor of witchcraft. However, it shouldn’t be a problem for it to hold on for a few hundred years.”<br/><br/>Wang Xian looked at everything in front of him and muttered.<br/><br/>The strength of the Divine Roc of the Nine Heavens was indeed far from his.<br/><br/>After all, he had just made a breakthrough.<br/><br/>However, Wang Xian wasn’t worried at all. He watched quietly and used his divination ability to predict the outcome of the battles from time to time.<br/><br/>The purpose of this battle was to train the strong disciples of the Dragon Palace. Wang Xian also hoped that they could fight for more time.<br/><br/>Time passed quickly during the battle.<br/><br/>It was usually difficult to determine the victor of a battle of the same level.<br/><br/>At this level, it would take at least 10,000 years if they were to fight to the death.<br/><br/>Even longer.<br/><br/>A few years passed quickly. At the same time, the experts of the Alliance of Justice and the Dragon Palace rushed over from below the land of origin.<br/><br/>“What… What is this? are the experts of the Dragon Palace fighting against each other? is the entire space covered by the Gray Energy?”<br/><br/>“Hiss. Although the front is covered by the gray energy, I can still sense the terrifying fluctuations inside. I feel that as long as I enter, I might be killed instantly!”<br/><br/>“A great battle has broken out. The experts of the Dragon Palace are fighting with the experts of the witchcraft region. This terrifying gray space domain should have been set up by the Dragon King. Is it used to train the experts of the Dragon Palace?”<br/><br/>“It’s really hard to imagine that the Dragon King would use a powerful area like the witchcraft region to train the experts of the Dragon Palace. How… how powerful is the Dragon King Now?”<br/><br/>The experts of the Justice Alliance and the Dragon Palace Alliance stared at the front in shock and discussed in disbelief.<br/><br/>Although they couldn’t see the specific situation inside, the terrifying aura coming from inside was enough to make the chief of the Justice Alliance and the others feel terrified.<br/><br/>The chaotic energy inside would probably be destroyed if they entered.<br/><br/>Time passed quickly again.<br/><br/>A hundred years had passed. During these hundred years, all the experts of the Dragon Palace were fighting and fighting against their opponents.<br/><br/>Each and every one of them had a huge improvement in their battle experience.<br/><br/>“Dragon King, I am completely no match for this ancestor of witchcraft and devil. He broke through much earlier than me. His accumulation is much deeper than mine.”<br/><br/>More than a hundred years later, the Divine Roc of the Nine Heavens transmitted his voice to Wang Xian.<br/><br/>He had been suppressed during the hundred years of battle.<br/><br/>It was extremely difficult to resist.<br/><br/>If this continued, he wouldn’t be able to hold on any longer.<br/><br/>“Let me help you. You have to hold on for a little longer.”<br/><br/>Wang Xian looked at him and said faintly. At the same time, a surge of energy entered the body of the Divine Roc of the nine heavens, amplifying the fire attribute energy in his body.<br/><br/>Boom! Boom! Boom<br/><br/>In an instant, the body of the Divine Roc of the nine heavens erupted with even more terrifying flames.<br/><br/>“HMPH, are you going to use a powerful move? How dare a guy who has just broken through to ambush us?”<br/><br/>The ancestor of the witchcraft demon stared at the Divine Roc of the Nine Heavens with a face full of killing intent. He did not have any doubts about the explosive power of the Divine Roc of the Nine Heavens.<br/><br/>He also had a way to temporarily unleash a stronger combat strength.<br/><br/>The battle continued.<br/><br/>Two hundred years, three hundred years, five hundred years…<br/><br/>As time passed, some of the experts in the witchcraft region were injured, and some of the experts in the Dragon Palace began to get injured.<br/><br/>However, because the thirteen dragon children had been training in the torrent region and because they had always been in the zone of war, their combat experience was very rich. Each of them suppressed their opponents and stained their bodies with blood.<br/><br/>“Damn it, how can this guy’s explosive power last for so long?”<br/><br/>At this moment, the witchcraft ancestor stared at the Nine Heavens Divine Roc in front of him, and his expression became a little ugly.<br/><br/>Although he was still not his opponent, it was already very difficult for him to completely destroy it.<br/><br/>If he wanted to determine the victor, this time would probably be extended to tens of thousands of years, or even more.<br/><br/>“The strength of our two regions are about the same. I feel that there’s no need to continue fighting. Continuing to fight won’t benefit either of us at all. How about we just give up?”<br/><br/>The witchcraft ancestor punched out a terrifying dark region as he spoke to the Nine Heavens Divine Roc.<br/><br/>He wanted to end this war.<br/><br/>The strength of this region far exceeded their scouting and imagination. With the other party’s strength, it was already impossible for them to occupy it.<br/><br/>Since it was impossible, there was no need for them to fight.<br/><br/>The gains outweighed the losses.<br/><br/>“What a great opportunity to train us, how can we give it up?”<br/><br/>The Nine Heavens Divine Roc sneered and coldly locked onto the witchcraft ancestor.<br/><br/>“Do you really think you are my opponent? Your strength is weaker than mine. If you really anger me, you will have to pay the price.”<br/><br/>The ancestor of the witchcraft demon’s face darkened as he shouted coldly.<br/><br/>“Kill!”<br/><br/>The Divine Roc of the Nine Heavens ignored him and continued to attack.<br/><br/>“Good, good, good!”The ancestor of the witchcraft demon was also emitting a cold killing intent. “Since you are courting death, I will fulfill your wish.”<br/><br/>The dark energy in his body began to erupt.<br/><br/>An even more powerful energy surged in.<br/><br/>However, at the back, Wang Xian watched this fellow erupt. With a wave of his arm, another wave of energy entered the body of the Divine Roc of the Nine Heavens.<br/><br/>This allowed the disciples of the Dragon Palace to train for a few hundred years. They would need at least three to four thousand years of training.<br/><br/>Boom! Boom<br/><br/>The energy on the Divine Roc of the Nine Heavens grew stronger as it charged forward once again.\t\t\t\t\t\t</div>", "images": {}, "success": true}