{"id": 1590, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15222927.html", "title": "Chapter 4593 - Chapter 4593: 4592 Invincible 2", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4593 - Chapter 4593: 4592 Invincible 2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4593: 4592 invincible 2<br/><br/>“All the strong disciples of the eight directions region have retreated from the various universes of our torrent region. This is great, this is simply great!”<br/><br/>“Hahaha, our peaceful days have arrived.”<br/><br/>“With Lord Wang Lan Jiang and his parents around, how could the eight directions region still dare to stay in our torrent region? The scene just now was simply too shocking. My God, to suppress more than a thousand heaven origin creation realm experts in the entire eight directions region by himself, just what kind of realm is this expert at to be able to do this?”<br/><br/>“I don’t know. The eight directions master’s strength has already broken through to above the chaos realm, but it was this kind of existence that was suppressed by that mysterious Lord with a single hand.”<br/><br/>“Too terrifying, too powerful. Such powerful strength, he’s completely an invincible existence. That mysterious lord could easily destroy our entire torrent region by himself.”<br/><br/>The wedding ended very quickly. However, the celebrations in the torrent region were still going on.<br/><br/>Countless powerful disciples were discussing excitedly.<br/><br/>Everything that had happened today had given them too much shock.<br/><br/>No one had expected that there wouldn’t be such a powerful existence in this boundless chaos.<br/><br/>“Father, mother, let me introduce you. This is Qing ‘er, my girlfriend.”<br/><br/>Backstage at the wedding, a family was sitting together. Old Ten Wang Tianya was smiling as he pulled a girl and introduced her to Wang Xian and the rest.<br/><br/>The girl stood at the side nervously and greeted them with a smile, “Hello, uncles and Aunties.”<br/><br/>“Good, good.”<br/><br/>Wang Xian and the rest nodded with a satisfied smile. “It’s our first time meeting and we don’t have any good gifts. Let me give you two pieces of jewelry.”<br/><br/>The two treasures of the Heaven’s origin landed in front of the girl, causing her to thank her in a flustered manner.<br/><br/>“Hehe, I didn’t expect you to find a girlfriend in the past 200 million years. I really didn’t expect that.”<br/><br/>Wang family’s little seven looked at her younger brother and teased him.<br/><br/>“Sister Seven, you are only a few minutes older than me. Big Brother was born a few minutes earlier than me. Now that you are married, is it abnormal for me to find a girlfriend? Unlike You, who is so violent and no one wants her!”<br/><br/>Wang Tianya looked at him and curled his lips as he said.<br/><br/>“You are looking for a beating. Your strength is not as good as mine now. Just you wait, HMPH!”<br/><br/>Xiao Qi flashed her fist with a warning look on her face.<br/><br/>Wang Tianya’s face darkened when he saw her expression.<br/><br/>Wang Xian, Guan Shuqing, and the rest watched this scene with smiles on their faces.<br/><br/>After the children’s memories were restored, they still had deep feelings for each other.<br/><br/>Among the girls, Xiao Qi was more mischievous. She would beat up her brother and beat up her younger brother.<br/><br/>When she was young, there were not many who could defeat her.<br/><br/>She was still more lively now.<br/><br/>“Father, are we going back to the nine-origin universe later?”<br/><br/>After the group of little ones argued for a while, Wang Lanjiang asked.<br/><br/>“When we go back, we can bring your friends here. In the future, we can open the teleportation formation from the nine-origin universe to the torrent area. It will be much more convenient for us to travel back and forth.”<br/><br/>Wang Xian said to them.<br/><br/>“En, en, that’s good. Speaking of which, after living in the torrent area for more than 200 million years, we have already developed a sense of familiarity. Moreover, we have yet to visit many places in the torrent area.”<br/><br/>The group of little fellows nodded and said.<br/><br/>After the family finished their meal and stayed in the river of chaos for a few months, Wang Xian brought them back to the Dragon Palace.<br/><br/>In the Dragon Palace, Prime Minister Gui and the rest were informed in advance of the arrival of the little ones. They were all waiting in the Dragon King’s Hall.<br/><br/>“Uncle Prime Minister Gui, Uncle Ao Jian, Uncle Qitian…”<br/><br/>When the little ones saw the leaders of the Prime Minister Gui, Ao Qitian, who had watched them grow up, they walked over with smiles on their faces and gave them a hug.<br/><br/>“Haha, the Little Fellows from the past have grown up. They are all adults now. I heard that the crown prince is already married.”<br/><br/>Prime Minister Gui and the others also spoke with smiles on their faces.<br/><br/>“Uncles, let me introduce you to them.”<br/><br/>Wang Lanjiang smiled and pulled Gongsun Ying ‘er to introduce them one by one.<br/><br/>Wang Xian stood at the side and watched. He also felt very warm.<br/><br/>Unknowingly, his own children had grown up.<br/><br/>The group of strong disciples from the Dragon Palace celebrated the return of the crown princes and princesses for a few days.<br/><br/>Wang Lanjiang and the rest brought their friends in the torrent region and strolled around the nine-origin universe.<br/><br/>Wang Xian had nothing to do as he absorbed the energy and resources that he had obtained this time.<br/><br/>The corpses of more than a thousand heaven origin creator-level powerhouses in the eight directions region were already a huge amount of treasures and resources in their storage space.<br/><br/>Especially, there was a corpse of a cardinal tribulations master among them.<br/><br/>It had been a million years in the outside world and a hundred million years in the time domain. Wang Xian had absorbed all these corpses and his strength had improved tremendously once again.<br/><br/>It had reached the level of 85 existences of the primal chaos level.<br/><br/>Wang Xian felt that he could destroy the entire universe with a wave of his hand.<br/><br/>Yes, destroying a universe was so powerful and terrifying.<br/><br/>After a million years, the black hole teleportation formation between the nine-origin universe and the torrent region was completed. They could travel to and from the two regions very quickly.<br/><br/>Speaking of which, the nine-origin universe was not as prosperous as the torrent region.<br/><br/>That was because the torrent region could be said to have been unified.<br/><br/>The region where Wang Xian and the rest were located also had the Alliance of Justice.<br/><br/>He was prepared to reorganize and build a prosperous central region.<br/><br/>In the future, even after the cataclysm ended, countless strong disciples could go to the prosperous central region to cultivate.<br/><br/>Wang Xian had a few pieces of primal chaos supreme treasures in his hands. This primal chaos supreme treasure could affect a domain and turn this domain into a blessed land.<br/><br/>Furthermore, a blessed land of this level was extremely powerful.<br/><br/>It was not something that the blessed lands in the universe could compare to.<br/><br/>“I might as well change it to the nine-origin universe and turn the entire nine-origin universe into an extremely powerful blessed land. I can let the powerhouses from other universes come and form the center of this region.”<br/><br/>Wang Xian made a decision in his heart. However, he did not act immediately. Instead, he called the powerhouses from the other peak races in the Heaven’s origin realm over and made some plans.<br/><br/>The powerhouses of the other peak races in the nine-origin universe in the Heaven’s origin realm naturally did not have any objections. Everything was based on the Dragon Palace.<br/><br/>After all, they were able to achieve what they had now because of the Dragon Palace.<br/><br/>For them, the Dragon King turning the nine-origin universe into a powerful Holy Land was also a good fortune and opportunity.<br/><br/>“Let’s begin the transformation then.”<br/><br/>Wang Xian, who was bored out of his mind and could no longer meet his enemies, began to transform the nine-origin universe.<br/><br/>He originally had six chaos supreme treasures in his hands — metal, wood, water, fire, earth, and thunder. After the Nine Heavens Divine Roc absorbed one, there were still five left.<br/><br/>Five of them were placed in the five regions of the nine-origin universe, gradually forming five unusually powerful and terrifying holy lands.\t\t\t\t\t\t</div>", "images": {}, "success": true}