{"id": 1598, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15236589.html", "title": "Chapter 4601 - Chapter 4601: Final Chapter (1)", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4601 - Chapter 4601: Final Chapter (1)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4601: Final Chapter (1)<br/><br/>Time flew by.<br/><br/>The hundreds of Heavenly Fate Realm experts who were guarding the Witchcraft Region were easily killed by Wang Xian.<br/><br/>In the following period of time, Wang Xian used his divination technique to locate the lair of all the Heavenly Origin Creation powerhouses in the Witch Region.<br/><br/>They found the place where they stored their treasures.<br/><br/>How many resources did an entire region have?<br/><br/>Even Wang Xian could not imagine the amount of resources.<br/><br/>The treasures collected by more than 3,000 Heaven’s Origin Stage powerhouses, including all kinds of powerful divine trees and divine herbs.<br/><br/>The treasures collected by the Ancestor of Witchcraft, the treasures in the Ancestor of Witchcraft’s lair.<br/><br/>These resources were too huge.<br/><br/>There were more than 400 of them. One could imagine how terrifying the resources were.<br/><br/>Wang Xian could absorb all these resources.<br/><br/>Wang Xian spent tens of thousands of years to travel all the universes in the Witch Region and collect all the important treasures.<br/><br/>Meanwhile, the Dragon Palace in the Witch and Demon Region was also slowly receiving them.<br/><br/>This speed of reception would require at least hundreds of millions of years.<br/><br/>In fact, to completely master it was not something that could be done in hundreds of millions of years.<br/><br/>It would take at least a billion years.<br/><br/>After all, this was thousands of universes.<br/><br/>And among these thousands of universes, there were also 6,000 to 7,000 more spots for the Heaven Origin Fate Realm.<br/><br/>At least for billions of years, Dragon Palace would not lack the opportunity to enter the Heaven Origin Fate Realm.<br/><br/>50,000 years later, Wang Xian returned to the Dragon Palace with a large amount of resources.<br/><br/>He planned to turn the entire 9-Origin Cosmos into a sacred land, a powerful region.<br/><br/>Now that he had the resources in the Witch Region, it was even easier.<br/><br/>For example, the extremely powerful grotto-heavens in the Fiend Region.<br/><br/>Wang Xian transferred everything he could use over.<br/><br/>He wasn’t in a hurry to forge a 9-Essences Universe Immortal King. Instead, he wanted to continue improving his strength.<br/><br/>The increase in strength was endless. The stronger he was, the more convenient it would be for him to build a Holy Land.<br/><br/>Wang Xian left 1,000 of the corpses of the 3,000-odd Heavenly Origin Fate Realm experts for the experts of the Dragon Palace.<br/><br/>It was equivalent to one for each person to cultivate and absorb.<br/><br/>Wang Xian used the rest to improve his strength.<br/><br/>Just the improvement of these corpses was very terrifying.<br/><br/>In addition, there were more than 400 Heavenly Origin Creation Supreme Treasures.<br/><br/>Wang Xian’s strength was rising at a terrifying speed.<br/><br/>Time was also disappearing.<br/><br/>100 million years later, except for the divine trees, herbs, and resources that were useful to the Dragon Palace, all the other resources were absorbed by him.<br/><br/>At the same time, his strength had also reached an immeasurable level.<br/><br/>In the past, he could still calculate that his strength was comparable to more than 80 Chaos existences.<br/><br/>However, as he continued to absorb and improve, Wang Xian had no idea how strong he had become.<br/><br/>All he knew was that with a single thought, he could travel from the 9-Essences Cosmos to the Justice Alliance’s Justice Universe.<br/><br/>This speed was immeasurable.<br/><br/>With a single thought, he could cover several universes. All the living beings in the entire universe were under his control.<br/><br/>A single thought could destroy an entire universe.<br/><br/>Wang Xian felt an invincible force.<br/><br/>Moreover, as his strength continued to increase, he discovered that the speed at which he absorbed the Chaotic Force in the Chaos had also reached an unimaginable level.<br/><br/>With just a thought, the amount of Primal Chaos energy he absorbed was comparable to that of a Sky Origin Creation Realm expert.<br/><br/>In just a few days, he could perfectly convert this Chaotic Force into his own power.<br/><br/>Increase his strength.<br/><br/>“The current me should be considered truly invincible, right?”<br/><br/>Wang Xian came to a space in the Chaos and sensed his strength.<br/><br/>He even had a feeling that he could create a universe.<br/><br/>Of course, creating a universe required some Chaotic Energy. However, with the energy in Wang Xian’s body, creating a universe was a piece of cake.<br/><br/>After all, he had obtained too many resources in the Witch Region and absorbed too many resources.<br/><br/>“Let’s try divination. Can you divine how big the chaos is, how many regions there are in the chaos, and where the nearby regions are?”<br/><br/>Wang Xian thought to himself as he tried to use the power of divination.<br/><br/>Soon, a vague message appeared in his mind.<br/><br/>“Eh? It can vaguely divine some information and can divine the nearest ten regions.”<br/><br/>Soon, Wang Xian muttered.<br/><br/>The more powerful the divination target was, the more difficult it would be.<br/><br/>For example, the Three Great Prophets who divined the universe could not divine anything from Wang Xian.<br/><br/>In fact, if he forcefully divined, he would suffer a backlash from the energy.<br/><br/>Wang Xian didn’t get any information from divining the entire Chaos. However, he managed to divine the nearest ten regions.<br/><br/>” Try divining the Chaos cardinal treasure!”<br/><br/>Wang Xian’s eyes sparkled. Currently, the Dragon Palace still had five Supreme Treasures of Chaos. They were Metal, Wood, Water, Earth, and Thunder.<br/><br/>He wanted to see if he could gather all nine attributes and place them in the 9-Essences Cosmos to create nine enormous holy lands.<br/><br/>Or perhaps, he could make it circle the 9-Essences Cosmos.<br/><br/>The divination results soon came back. Six of the ten nearby regions had Chaos cardinal treasures.<br/><br/>” The Torrent Zone is one of the zones. The Chaos cardinal treasures do exist there. There are no Chaos cardinal treasures in the eight zones. The Chaos cardinal treasures in the eight zones have been absorbed and refined.”<br/><br/>Wang Xian mumbled. A region without any Supreme Treasures of Chaos meant that there was a high possibility of a Calamity Master being born there.<br/><br/>Of course, it was also possible that the Chaos cardinal treasure had been taken away by experts from further regions.<br/><br/>“Let’s go around the surrounding area.”<br/><br/>Wang Xian thought to himself. With a flash, he arrived at the Witchcraft Region and checked out the current situation.<br/><br/>After hundreds of millions of years of taking over the Witch Region, it could only be said that he had rough control over it.<br/><br/>Every universe still had a huge amount of resources.<br/><br/>These resources were of great use to Heaven Essence Fate Realm experts.<br/><br/>As for the disciples of Dragon Palace, it was needless to say.<br/><br/>After that, more than eight million disciples of Dragon Palace, who had so many resources in the universe, improved even faster.<br/><br/>Guan Shuqing and the rest were playing with the thirteen children in the various universes of the Witch Region.<br/><br/>Many universes had their own characteristics, which were very attractive to them.<br/><br/>Wang Xian went over to greet them. After accompanying them for a while, he flew towards the surrounding areas.<br/><br/>In the past, it would have taken him tens of thousands of years to fly from the 9-Essences Cosmos to the Torrent Region.<br/><br/>But now, a few hundred years was enough for him to go from one region to another.<br/><br/>A few hundred years was considered a very short period of time for powerhouses like them.\t\t\t\t\t\t</div>", "images": {}, "success": true}