{"id": 1592, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15225636.html", "title": "Chapter 4595 - Chapter 4595: 4594 Invincible 4", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4595 - Chapter 4595: 4594 Invincible 4</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4595: 4594 invincible 4<br/><br/>“Dragon King, according to the information from the empty cicada clan, more than 3,000 Heaven’s origin creation realm powerhouses have gathered below the land of origin. They are ready to invade our area.”<br/><br/>“Dragon King, the Justice Alliance has also received information. Now, the leader of the Justice Alliance has sent a message. Should we fight them? We can’t let them enter our area.”<br/><br/>“The powerhouses of the Dragon Palace Alliance have also returned. All of them have gathered at the alliance base above the land of origin.”<br/><br/>When the powerhouses of the witchcraft region arrived, Prime Minister Gui and the rest immediately received the news.<br/><br/>After all, they knew that the witchcraft region intended to attack their territory millions of years in advance.<br/><br/>In addition, the land of origin was their territory. It was their territory.<br/><br/>Although the witchcraft region was strong, the strength of the Dragon Palace Alliance and the Justice Alliance wasn’t weak even if Wang Xian didn’t make a move.<br/><br/>After all, the Dragon Palace still had the Divine Roc of the Nine Heavens.<br/><br/>“There’s no need for the other powerhouses from the Justice Alliance and the Dragon Palace Alliance to make a move. The powerhouses from the Dragon Palace can just go over.”<br/><br/>Wang Xian received the information from Prime Minister Gui and said with a smile, “It’s a good opportunity for the disciples of the Dragon Palace to practice their skills.”<br/><br/>“It’s the Dragon King!”<br/><br/>Prime Minister Gui and the rest replied immediately.<br/><br/>“Call all the little guys over,”Wang Xian added.<br/><br/>“Yes!”Prime Minister Gui nodded.<br/><br/>“It’s just right. Let’s use the experts from the witchcraft region to practice.”<br/><br/>Wang Xian mumbled. Currently, the number of disciples in the Heavenly Yuan blessed realm in the Dragon Palace had reached 900.<br/><br/>The current Dragon Palace had too many resources. Naturally, it would be easy for them to break through.<br/><br/>100 Primal Chaos Metallic lifeforms had all reached the Heavenly Yuan blessed realm.<br/><br/>However, other than Guan Shuqing, Lan Qingyue, and the others, the leader of the empty cicada clan, Mo Sha was the only one who had reached the primal chaos realm.<br/><br/>This was not a small number. Especially after Lan Qingyue broke through, little blue, little white, and the little house quickly received feedback and broke through to the primal chaos realm. There were 18 primal chaos experts in the Dragon Palace.<br/><br/>This time, there were only thirteen primal chaos experts that had invaded their witchcraft region.<br/><br/>“Father, what did you call us here for?”<br/><br/>Not long after, the thirteen dragon children rushed over and asked with smiles.<br/><br/>After over 200 million years of training, they had started to relax after returning to the Dragon Palace.<br/><br/>They brought their friends from the torrent region to explore the various universes, have fun, and be at ease.<br/><br/>After receiving the message, they rushed over immediately. At the same time, some of their friends also followed them.<br/><br/>“There’s a chance to train. I’ll bring you there,”Wang Xian said to them.<br/><br/>“Ah, father, it can’t be. We’ve just trained for more than 200 million years. Do We still need to train?”<br/><br/>Xiao Qi’s face instantly fell as she said with an aggrieved expression.<br/><br/>“Hehe, don’t worry. I’m not throwing you to another region.”<br/><br/>Wang Xian smiled and shook his head.<br/><br/>“Greetings, Dragon King!”<br/><br/>“Dragon King, I heard that there is an area that has invaded our region? hahaha!”<br/><br/>“That witchcraft region has really come. Keke Keke, this is interesting.”<br/><br/>At this moment, Mosha ao Qitian and the rest of the Heavenly Yuan creation realm experts from the Dragon Palace arrived and said with smiles on their faces.<br/><br/>“Oh? Someone wants to invade our region?”<br/><br/>The thirteen Dragon Sons and daughters were also slightly stunned and revealed stunned expressions.<br/><br/>Their father’s strength had already been witnessed.<br/><br/>He had killed more than a thousand heavenly yuan creation realm experts with a single hand, and there was even an existence above chaos.<br/><br/>Now, there was actually a region that was trying to invade them?<br/><br/>“Father, are the forces that invaded our region strong?”<br/><br/>Wang Lanjiang could not help but ask.<br/><br/>“It’s not bad. There are more than 3,000 powerhouses of the Heaven’s origin realm, one lord of calamity, and 13 people of the chaos realm. Coincidentally, the disciples of the Dragon Palace have not fought for a long time. Therefore, I asked you to come and train them.”<br/><br/>Wang Xian replied with a smile.<br/><br/>“Dragon King, can I make a move? I haven’t fought against anyone of the same level since I broke through.”<br/><br/>The Divine Roc of the Nine Heavens requested.<br/><br/>“Yes, but you haven’t broken through for long. There’s a high probability that you won’t be a match for the other party. However, it’s good to temper yourself.”<br/><br/>Wang Xian nodded his head. “When it’s time for each of you to pick an opponent and engage in a life-and-death battle, I won’t interfere with you. If you die, revive and reflect on your cultivation.”<br/><br/>“It’s the Dragon King!”<br/><br/>The powerhouses from the Dragon Palace replied immediately.<br/><br/>In fact, the powerhouses from the Dragon Palace also understood that it was very difficult to be killed in a fight between people of the same level unless they were told to fight to the death instead of running away.<br/><br/>They also understood what the Dragon King meant. He wanted them to have a life-and-death duel.<br/><br/>Only in such a big battle would they be able to transform faster.<br/><br/>“Everyone is here. Let’s set off,”Wang Xian said as he looked at Guan Shuqing and the rest who had arrived!<br/><br/>“It’s the Dragon King!”<br/><br/>The group of experts from the Dragon Palace replied immediately.<br/><br/>Gongsun Ying ‘er and the rest of the more than 30 experts who came to the torrent region were in a daze when they saw this scene and heard the Dragon King’s words.<br/><br/>In a region, there were more than 3,000 heaven origin creation realm experts, a Calamity Lord, and 13 Primal Chaos Realm existences. This terrifying force had accidentally invaded their region.<br/><br/>In the end, the Dragon King brought them there to temper the powerhouses of the Dragon Palace?<br/><br/>Was it just a tempering?<br/><br/>Using more than 3,000 Heavenly Yuan creation realm powerhouses to temper them?<br/><br/>Even though they had witnessed the Dragon King’s power, they were still in a daze at this moment.<br/><br/>A wave of energy enveloped them, followed by their dazed expressions.<br/><br/>In the next moment, they had arrived at the base of the Dragon Palace Alliance.<br/><br/>At this moment, a large number of experts had gathered here in the Dragon Palace Alliance.<br/><br/>Even the Alliance Master of the Justice Alliance and the others had arrived.<br/><br/>The Alliance Master of the Justice Alliance and the others knew that the Dragon King was very powerful and was an existence above chaos.<br/><br/>However, they also knew that the invasion of their witchcraft region was similarly terrifyingly powerful.<br/><br/>There were over 3,000 Heavenly Yuan creation realm experts, and there were even existences on the same level as the Dragon King.<br/><br/>Therefore, they were a little nervous at this moment.<br/><br/>When they saw the Dragon King and the powerhouses of the Dragon Palace, they immediately went up to greet him.<br/><br/>“Sir Dragon King, the powerhouses from the witchcraft region have arrived. They are very strong. How should we deal with them?”<br/><br/>The Chief of the Justice Alliance asked.<br/><br/>“Leave it to the Dragon Palace. You Don’t have to worry.”<br/><br/>Wang Xian looked at them and said faintly.<br/><br/>“This…”<br/><br/>The Chief of the Justice Alliance was stunned. “Sir Dragon King, the other party’s strength is very terrifying.”<br/><br/>“Hehe, everyone. This time, our Dragon King is prepared to use them to temper the disciples of our Dragon Palace. You Don’t have to worry. We will destroy the invading enemies.”<br/><br/>Prime Minister Gui, who was at the side, also said with a smile.<br/><br/>“Let’s go.”<br/><br/>Wang Xian looked at the group of disciples. He waved his arm again and their figures disappeared.<br/><br/>In the front, the members of the Justice Alliance and the Dragon Palace Alliance looked at each other in dismay.\t\t\t\t\t\t</div>", "images": {}, "success": true}