{"id": 1595, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15232933.html", "title": "Chapter 4598 - Chapter 4598: 4,597 Invincible 7", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4598 - Chapter 4598: 4,597 Invincible 7</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4598: 4,597 invincible 7<br/><br/>The battle continued!<br/><br/>Time flew by!<br/><br/>In the blink of an eye, more than a thousand years had passed since the battle between the experts of the Dragon Palace and the witchcraft region.<br/><br/>It was rare to see a battle that lasted for more than a thousand years.<br/><br/>This was because battles at the same level would usually disperse after no victor was determined.<br/><br/>In a battle of a thousand years, if one side was at a disadvantage, the disadvantaged side would escape.<br/><br/>It was still very easy to escape.<br/><br/>But now, the battle between the two sides was still at a white-hot stage, and they were continuously fighting.<br/><br/>“This bunch of Damnable Fellows.”<br/><br/>At this moment, all the experts of the witchcraft region were somewhat anxious.<br/><br/>Although they weren’t at a disadvantage, this meaningless battle made them extremely frustrated.<br/><br/>They were extremely angry.<br/><br/>At the same time, they also had a bad premonition.<br/><br/>Why did the other party want to keep fighting with them?<br/><br/>What did the other party want to do?<br/><br/>“If we continue fighting like this, there won’t be a result. Why do we have to fight like this? Our witchcraft region is willing to retreat. From now on, we won’t interfere with each other.”<br/><br/>The witchcraft ancestor stared at the Nine Heavens Divine Roc and roared loudly.<br/><br/>However, the Nine Heavens Divine Roc didn’t reply and continued to attack.<br/><br/>The experts of the Dragon Palace did the same.<br/><br/>“Break through the defense of this space.”<br/><br/>The ancestor of witchcraft’s expression was gloomy. He didn’t want to continue fighting and ordered all the experts.<br/><br/>“Yes!”<br/><br/>“Yes!”<br/><br/>The experts of the witchcraft region also wanted to quickly resolve the current situation and replied loudly.<br/><br/>They moved, wanting to get rid of the opponent in front of them and leave this place.<br/><br/>Some great beings even tried to take out their true treasures to escape.<br/><br/>“True treasures are useless in this space. They can’t be used. This array is very strange!”<br/><br/>“Damn it. My full-strength attack landed on the gray protective shield around me, but there was no fluctuation at all. The level of this array is terrifyingly high!”<br/><br/>The experts of the witchcraft demon area wanted to escape the attack of the experts of the Dragon Palace and leave.<br/><br/>However, they soon roared with ugly expressions.<br/><br/>“Keep fighting. Don’t even think about running away until a winner is decided.”<br/><br/>“Hehehe, didn’t you want to invade our area? Why do you still want to run away now? Can you escape?”<br/><br/>The experts of the Dragon Palace roared with battle intent.<br/><br/>“Damn it, fight them!”<br/><br/>“Kill, Kill, Kill!”<br/><br/>Seeing that they couldn’t escape, the experts of the Witch Demon area also roared with killing intent.<br/><br/>The battle continued.<br/><br/>More than two thousand years passed quickly. Some experts started to get injured, and those who had the advantage had already killed their opponents.<br/><br/>However, many of the experts could be resurrected instantly, which meant that only a dozen of them had been killed in this battle.<br/><br/>Eight of the experts from the Dragon Palace had been killed.<br/><br/>In comparison, the experts from the Dragon Palace were still lacking.<br/><br/>They hadn’t broken through for long, so they were still lacking in battle experience.<br/><br/>However, after experiencing this battle, their battle experience was rapidly increasing.<br/><br/>There were also heaven origin manifestation powerhouses that were killed in the witchcraft region. After they were killed, they were quickly resurrected from that building.<br/><br/>However, after being resurrected, they did not dare to continue killing their way over.<br/><br/>This was because if they died again, they would probably die here.<br/><br/>They wanted to escape, but they could not break through the strange space covered by the gray energy. It was as if they were in a separate world.<br/><br/>“What exactly do you want to do? What benefits will it bring you if you continue fighting like this?”<br/><br/>As time passed, the witchcraft ancestor’s expression became more and more unsightly.<br/><br/>He could not understand why the other party was fighting like this.<br/><br/>This didn’t benefit them at all.<br/><br/>On the contrary, because of their deaths, there would definitely be a lot of losses.<br/><br/>A Heaven origin creation great being dying once was still very injured.<br/><br/>A true treasure that could revive was very precious.<br/><br/>“Anyone who dares to invade our region must die!”<br/><br/>Nine Heavens Divine Roc said with a cold expression.<br/><br/>“Lunatics, you bunch of lunatics want to kill us. If you’re all dead, we won’t be exterminated.”<br/><br/>The ancestor of witchcraft and demon roared with anger and killing intent.<br/><br/>As time passed, more and more experts died.<br/><br/>From the initial dozen or so, there were already more than a hundred experts.<br/><br/>Some of them were experts from the dragon palace while some were experts from the witchcraft and demon region.<br/><br/>“It’s been more than three thousand years. It’s about time.”<br/><br/>Wang Xian looked at the battlefield in front of him and muttered.<br/><br/>After more than 3,000 years of continuous life-and-death battles, the experience and combat strength of the disciples of the Dragon Palace had obviously improved by several levels.<br/><br/>“It’s time to end this!”<br/><br/>He opened his mouth and spoke to the disciples of the Dragon Palace.<br/><br/>At the next moment, Wang Xian’s body trembled as he activated his time domain.<br/><br/>All of his clones around him disappeared.<br/><br/>At the same time, Wang Xian himself started to move.<br/><br/>With his current strength and the enhancement of his time domain, how terrifying was his speed?<br/><br/>Even experts at the chaos level couldn’t see his shadow.<br/><br/>In just a blink of an eye, more than 2,000 heaven origin blessed realm experts were instantly killed by him.<br/><br/>The sudden change in the situation caused more than 2,000 heaven origin blessed realm experts to be instantly killed. The surrounding experts from the witchcraft region who were fighting against the Dragon Palace’s experts were all stunned!<br/><br/>The ancestor of witchcraft had a drastic change in expression. He looked at Wang Xian’s figure in astonishment.<br/><br/>“Your strength is not bad. It’s a pity that you are still too weak.”<br/><br/>Wang Xian looked at the ancestor of witchcraft and commented indifferently.<br/><br/>In the next instant, Wang Xian arrived in front of the ancestor of witchcraft. He grabbed his neck with one hand and said, “If you want to invade our region, only you members can do so. Die!”<br/><br/>He spoke calmly as he held the ancestor of the witchcraft demons with his palm. His face was filled with shock.<br/><br/>Energy surged and the ancestor of the witchcraft demons was instantly killed by him.<br/><br/>“Let’s end this. These three thousand years of training are considered pretty good.”<br/><br/>Wang Xian looked at the surrounding disciples of the Dragon Palace and said.<br/><br/>“It’s the Dragon King!”<br/><br/>The group of experts from the Dragon Palace replied immediately.<br/><br/>At this moment, the experts from the witchcraft region opposite them were all stunned.<br/><br/>What did they see?<br/><br/>More than 2,000 comrades in the Heaven’s origin realm were instantly killed!<br/><br/>Their witchcraft ancestor was easily killed.<br/><br/>This? How was this possible!<br/><br/>How could there be such a powerful and terrifying existence in the chaos?<br/><br/>Their faces were filled with panic and despair.<br/><br/>Wang Xian moved his body and charged towards the remaining 800 plus heaven origin creation realm powerhouses.<br/><br/>It was still very easy. The other party did not have the ability to resist at all.<br/><br/>Under their shocked gazes, each and every one of them was killed quickly. In the special building that belonged to them, they were resurrected one by one.<br/><br/>“Father’s strength is really invincible.”<br/><br/>Wang Lanjiang and the other thirteen dragon children were also deeply shocked when they saw their father instantly kill over three thousand Heavenly Yuan realm powerhouses.<br/><br/>They didn’t know just how strong their father was.<br/><br/>But from the looks of it, he was invincible!\t\t\t\t\t\t</div>", "images": {}, "success": true}