{"id": 1606, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15244082.html", "title": "Chapter 4609 - Chapter 4609: Master Of Chaos 3", "volume": 17, "volume_title": "Volume 17", "body": "<h1>Chapter 4609 - Chapter 4609: Master Of Chaos 3</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4609: Master of Chaos 3<br/><br/>” The development of a civilization is actually so cruel.”<br/><br/>Wang Xian looked at the numerous battleships, spaceships, and weapons in the Science and Technology Divine Territory and sighed in his heart.<br/><br/>A region had reached such a powerful level through such a method.<br/><br/>Wang Xian didn’t know how to evaluate it.<br/><br/>” This is the naked law of darkness in the Chaos. The strong kill the weak and enslave them.”<br/><br/>Wang Xian mumbled as he followed the spaceship from the Technology Divine Territory and flew in a certain direction.<br/><br/>After traveling through the wormhole, the massive warship arrived at a new area.<br/><br/>” It seems like they’re going to invade this new area. The wormholes have already been set up. They’re going all out.”<br/><br/>Wang Xian’s eyes sparkled when he saw the fleet arriving at a new area. All kinds of battleships and spaceships had been deployed and were ready for battle.<br/><br/>After all kinds of huge warships and weapons were prepared, they entered the area ahead.<br/><br/>After flying for another few decades, they were attacked and ambushed.<br/><br/>” Hahaha, a bunch of ants still dare to resist. We have already scanned the entire area. Next, become our slaves and become the driving force of our machines!”<br/><br/>In the center, a huge spherical warship was spinning.<br/><br/>In the center of this battleship that was hundreds of times larger than a planet, a dozen burly middle-aged elders were sitting inside. They laughed disdainfully when they saw the Sky Origin Creation Realm experts attacking them.<br/><br/>One of the old men pointed at a ball, and a huge cannon barrel appeared in front of it.<br/><br/>“Boom!”<br/><br/>In the next moment, a terrifying bolt of lightning shot out. Just as it was about to reach the expert, it instantly transformed into a huge lightning net.<br/><br/>The lightning net covered it, and then a lightning beam connected to the huge lightning net.<br/><br/>The lightning net was strengthened and covered the Sky Origin Creation Realm expert.<br/><br/>The expert’s expression changed drastically. Without any hesitation, he took out his escape treasure and wanted to escape.<br/><br/>“Buzz!”<br/><br/>However, the entire lightning net suddenly shook violently. Cracks appeared in the space around him.<br/><br/>Escape failed.<br/><br/>He was covered by a terrifying net, and a chip emitting the power of lightning flew towards his mind.<br/><br/>“No!”<br/><br/>The Sky Origin Manifestation expert roared in despair.<br/><br/>Once this special chip entered his mind, he would be controlled and everything about him would be known by the other party.<br/><br/>He would be reduced to a puppet, a slave who only knew how to obey orders!<br/><br/>Around him, some of his companions shouted at him with anger and fear.<br/><br/>They attacked the huge battleships.<br/><br/>However, it was useless.<br/><br/>” Hahaha. It’s impossible to escape from the attack of the star-hunting warship. Even a hundred experts in the Fate Realm of the Heaven’s Origin Stage are nothing in front of the star-hunting warship.<br/><br/>Inside the spherical battleship, a dozen controllers laughed as they watched the scene in front of them.<br/><br/>” He’s really powerful. That trapped expert is an existence at the level of the Great Dao, yet he was suppressed in one strike.”<br/><br/>Wang Xian had been watching from the side. He could not help but exclaim at the technological power of the Technology God Territory.<br/><br/>When all the power was developed to the extreme, it was extremely terrifying.<br/><br/>The difference was that the development of technological power made it even more powerful because of the uniqueness of technology.<br/><br/>“Unfortunately, I saw it.”<br/><br/>After witnessing how powerful these battleships were, Wang Xian decided not to follow them.<br/><br/>He moved and arrived in front of the strongest spherical warship in the center, the star-hunting warship.<br/><br/>In front of the gigantic battleship, Wang Xian was extremely tiny.<br/><br/>Wang Xian waved his arm and a palm-sized space sphere floated towards the star-hunting warship.<br/><br/>“Beep beep beep!”<br/><br/>“Beep beep beep!”<br/><br/>” Warning! Warning! A terrifying spatial energy fluctuation has been detected!”<br/><br/>” Warning, warning. Space energy fluctuations are attacking the star-hunting warship. According to calculations, it is unavoidable.”<br/><br/>” According to the calculation of the star-hunting warship, the star-hunting warship will be contained and suppressed. It will not be able to escape. It will not be able to escape!<br/><br/>” Detected a creature ahead that contains immeasurable energy. Undefeatable, undefeatable!”<br/><br/>” Warning, warning, remind all controllers to transfer their consciousness away immediately. The enemy is undefeatable.”<br/><br/>Just as all the battleships were sweeping across the area to suppress the ambushers.<br/><br/>All the battleships sounded a warning.<br/><br/>It spread throughout the minds of everyone in the Technology God Territory.<br/><br/>This stunned all the experts in the entire Technology God Territory.<br/><br/>“How is this possible? Is there something wrong with the star-hunting warship? How can there be an enemy that we can’t defeat?”<br/><br/>“Hiss, this…This was impossible. How could that human-like creature in front of him be so powerful? Our entire fleet has received the highest level of warning. How is this possible?”<br/><br/>While all the powerhouses in the Technology Divine Realm were in shock, the smiling spatial ball arrived in front of the warships.<br/><br/>A strange and terrifying scene happened. The battleships seemed to be attracted by a terrifying force and directly entered the palm-sized space ball without any resistance.<br/><br/>This made all the powerhouses in the Technology God Territory look incredulous.<br/><br/>Hundreds of enormous battleships were sucked into the space sphere one by one.<br/><br/>All the powerful disciples of the technological divine territory inside died quickly.<br/><br/>In less than a few minutes, the space ball returned to Wang Xian.<br/><br/>Wang Xian grabbed it in his hand and said calmly,” The strong prey on the weak in the Chaos. You have enslaved other living beings and slaughtered countless living beings. One day, you will be slaughtered too!”<br/><br/>He put away the spatial ball and prepared to slowly refine it.<br/><br/>In the next moment, he disappeared with Mu Mu once again and arrived at the center of the Science and Technology Divine Realm.<br/><br/>The living beings in the technological divine territory could instantly transfer their consciousness to other mechanical bodies after their bodies died. This was the key to their eternal life.<br/><br/>Naturally, they did not die just now and were immediately reborn.<br/><br/>After being reborn, they immediately sensed that their entire army had been wiped out!<br/><br/>This caused all the experts and disciples in the Technology Divine Realm to be filled with panic.<br/><br/>What kind of enemy did we encounter?<br/><br/>“Today, with my strength and my name, I will judge your Science and Technology Divine Realm and grant you destruction!”<br/><br/>At this moment, a voice sounded in the minds of all the powerful beings in the Technology Divine Realm.<br/><br/>Their eyes widened in disbelief.<br/><br/>“Judge us?”<br/><br/>“Who are you? Why are you judging us? Why do you want to destroy us?”<br/><br/>“No, no, no!”<br/><br/>In the Science and Technology Divine City at the center of the Science and Technology Divine Realm, countless powerful disciples rushed into the sky, shouting and questioning with fear on their faces.\t\t\t\t\t\t</div>", "images": {}, "success": true}