{"id": 1605, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15244081.html", "title": "Chapter 4608 - Chapter 4608: Master Of Chaos 2", "volume": 17, "volume_title": "Volume 17", "body": "<h1>Chapter 4608 - Chapter 4608: Master Of Chaos 2</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4608: Master of Chaos 2<br/><br/>Wang Xian brought Mu Mu along and continued shuttling through the chaos.<br/><br/>A Universe Devourer had indeed surprised Wang Xian.<br/><br/>Its strength could indeed sweep through one region after another. If it was allowed to devour endlessly, its strength would reach an extremely terrifying level.<br/><br/>While Wang Xian was refining and absorbing it, he was enjoying the scenery in the Chaos.<br/><br/>In the Chaos, there were not only Chaos Behemoths but also some other special creatures.<br/><br/>Especially when Wang Xian saw a race of Chaos. They were moths. When the tribulation began, the Chaos was filled with all kinds of energy.<br/><br/>They wandered in the chaos and ate.<br/><br/>When the tribulation ended and everything in the Chaos was filled with gray Chaos energy, they would turn into cocoons and sleep. When there was energy in the Chaos again, they would appear again.<br/><br/>These creatures only had the strength of those who had just entered the Heavenly Yuan Creation Realm, but there were quite a lot of them, tens of thousands of them.<br/><br/>It was a huge group of Chaos creatures.<br/><br/>Wang Xian continued to wander in the Chaos. After absorbing the Universe Devourer, his strength had increased tremendously.<br/><br/>This allowed his speed to reach a terrifying and unbelievable level.<br/><br/>He only needed a few hundred years to travel from one region to another.<br/><br/>This was something inconceivable to any expert.<br/><br/>It would only take a few hundred years for the divination power to divine an area and rush over.<br/><br/>Wherever he went, there would be traces of him. In the future, he could instantly come to this area.<br/><br/>After arriving at the various regions, Wang Xian obtained the Supreme Treasures of Chaos.<br/><br/>Chaos cardinal treasures of various attributes had been gathered.<br/><br/>“Weng weng weng!”<br/><br/>When Wang Xian arrived at another area, the scene in front of him shocked him again.<br/><br/>This area was unusually special.<br/><br/>Not only the cultivation method in this area, but even the energy in this area made him extremely shocked.<br/><br/>The entire area was dominated by one type of energy, and that was lightning.<br/><br/>Lightning attribute.<br/><br/>The energy of the other attributes was a hundred times less than the lightning attribute.<br/><br/>The powerful power of lightning made this area special and powerful.<br/><br/>This was a region that Wang Xian had seen that was even stronger than the Holy Region.<br/><br/>The people in this area called this place the Science God’s Domain.<br/><br/>That’s right, the Science God Territory. The entire area was focused on developing science and technology, and there were all kinds of powerful spaceship weapons.<br/><br/>He shuttled through the chaos and jumped through wormholes.<br/><br/>Even without wormholes, the spaceships they created could directly perform special spatial jumps.<br/><br/>This was like a spatial teleportation array. Under normal circumstances, the spatial teleportation array had to be established first. After it was established, the two points were fixed.<br/><br/>From one place to another.<br/><br/>It was fixed.<br/><br/>However, the technology here had already developed to the point where the spaceship itself could be used as an anchor point to transmit information to any area around it.<br/><br/>Moreover, the distance of the teleportation was very wide!<br/><br/>The living beings here, even ordinary weak humans, had already achieved eternal life.<br/><br/>Mechanical immortality!<br/><br/>It could also be called technological immortality.<br/><br/>This was because they had already developed a carrier that was exactly the same as a human body. It could not be called a machine.<br/><br/>Every living being had an endless lifespan, which made this area powerful to a terrifying extent.<br/><br/>This caused the technology in this area to reach an unimaginable level.<br/><br/>Wang Xian brought Mu Mu and flew towards the center of the Technology God Territory. They looked around curiously.<br/><br/>When they arrived at the center, they found that many enormous warships were flying in the same direction.<br/><br/>One of the battleships was emitting terrifying energy.<br/><br/>Wang Xian looked over and was surprised.<br/><br/>The most powerful battleship could kill ordinary Calamity Masters.<br/><br/>This battleship could also destroy an existence like Mu Mu.<br/><br/>The reason why this battleship was so powerful was not because of the Chaos cardinal treasure, but because of the alliance.<br/><br/>The countless components stacked together could condense all kinds of energy. Under such circumstances, it was like a master of the tribulation facing dozens of Chaos existences that could perfectly fuse together.<br/><br/>In this way, the Master of Calamity might not be a match for a perfectly fused Chaotic expert.<br/><br/>This was the case for this battleship.<br/><br/>There were hundreds of powerful battleships around him. Some of them were comparable to the Nine-Heavens Divine Roc who had just broken through.<br/><br/>As for the other hundred warships, none of them were weaker than Primal Chaos.<br/><br/>This was an extremely terrifying power!<br/><br/>If the Universe Devourer came to this area, it would probably be bombarded as well.<br/><br/>Most importantly, these battleships were not the only force in this area.<br/><br/>“Truly powerful and dazzling!”<br/><br/>Wang Xian sighed as he looked at the battleships that were performing space jumps at high speed.<br/><br/>He could see that there were countless warriors in these battleships. Each of them had all kinds of powerful weapons in their bodies.<br/><br/>In battle, he was comparable to a Ruler Realm disciple.<br/><br/>At the same time, Wang Xian discovered something special. Some battleships had a large number of living beings at the core of the engine.<br/><br/>These creatures were obviously not from the Technology God Realm. They were all very powerful.<br/><br/>There were hundreds of Heavenly Yuan Creation Realm experts.<br/><br/>However, at this moment, these Sky Origin Fate Realm and Ruler Realm experts had strange expressions. Tubes were inserted into their bodies as energy engines.<br/><br/>These disciples were captured by them and modified to become the power of the battleship!<br/><br/>Wang Xian did a divination and realized that they were going to invade another area.<br/><br/>” This region is so powerful. Clearly, it has been invaded and plundered many times.”<br/><br/>Wang Xian thought to himself.<br/><br/>The resources of a region could not give birth to such a powerful race.<br/><br/>In fact, Wang Xian had divined that they had already destroyed three regions.<br/><br/>All the living beings in these three regions were destroyed by them.<br/><br/>All the resources were plundered.<br/><br/>As for the disciples of the experts, they were treated as human power.<br/><br/>The power of lightning in their own region was enormous. They were not used to going to another region. They studied other regions and the experts and living beings in other regions.<br/><br/>In the end, they would be turned into living engines.<br/><br/>A special chip was used to control their minds, allowing them to absorb the energy of the world and then supply it to their weapons and warships.<br/><br/>This kind of behavior was very cruel. In fact, in order to maintain an endless supply of power, they would raise some universes in captivity, allowing the living beings inside to rapidly improve in a bloody way.<br/><br/>After upgrading it, he could control it and turn it into a biological machine that only knew how to listen to orders, providing power for the warship’s weapons.\t\t\t\t\t\t</div>", "images": {}, "success": true}