{"id": 1600, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15239312.html", "title": "Chapter 4603 - Chapter 4603: Final Chapter (2)", "volume": 16, "volume_title": "Volume 16", "body": "<h1>Chapter 4603 - Chapter 4603: Final Chapter (2)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4603: Final Chapter (2)<br/><br/>“The wiser the experts in a region are, the stronger the region they can govern.”<br/><br/>Wang Xian came to this dazzling area and looked at the brilliance and prosperity of this area. He was amazed.<br/><br/>He came to the center of this batch of areas.<br/><br/>This was the central area of the three universes. It was abnormally resplendent and prosperous.<br/><br/>There were countless flying ships flying through the primordial chaos.<br/><br/>There were also countless flying treasures flying through the primordial chaos.<br/><br/>The entire chaotic space had undergone a special transformation. Even after the tribulation ended, ordinary disciples could still fly here.<br/><br/>There were buildings, floating islands, huge castles, and endless mountains.<br/><br/>On these buildings, there were experts ‘disciples living and moving around.<br/><br/>The entire area was undoubtedly a paradise.<br/><br/>Wang Xian was also sizing up the area with curiosity and admiration.<br/><br/>According to his understanding, this was a federal system.<br/><br/>All living beings were ordinary citizens and had the right to cultivate. There were universities everywhere for these living beings to learn and cultivate.<br/><br/>As long as one had talent and strength, they would not be buried.<br/><br/>Sooner or later, he would rise up.<br/><br/>This pattern also caused the number of experts in this area to be abnormally high.<br/><br/>There were tens of thousands of people in the Heavenly Essence Creation Realm.<br/><br/>“Eh?”<br/><br/>However, Wang Xian soon discovered another problem.<br/><br/>There was another area adjacent to this area. This area was called the Abyss.<br/><br/>There was a powerful and terrifying creature in the abyss, as well as many Chaos beasts.<br/><br/>In the abyss, all kinds of terrifying existences had always wanted to invade this dazzling region.<br/><br/>The two sides had been in a great battle.<br/><br/>Because of the external threats, this area was becoming more and more resplendent and powerful.<br/><br/>This area was called the Holy Area.<br/><br/>The Holy confronted the Abyss!<br/><br/>Currently, the sacred territory guarded the border of their territory and had been able to resist the invasion of the Abyss.<br/><br/>However, because the energy in the abyss was extremely violent, the sacred region had never counterattacked.<br/><br/>Perhaps the reason was that the Abyss was very strong. They were not strong enough to counterattack and completely destroy the Abyss.<br/><br/>Wang Xian was very interested in this area.<br/><br/>He moved his palm and divined with the power of divination. Soon, he divined the location of a Calamity Master.<br/><br/>Wang Xian moved his body and arrived beside the Master of Calamity.<br/><br/>The powerful concealment power seemed to have placed Wang Xian in another space.<br/><br/>Wang Xian was less than 100 meters away from the Master of Calamity, but the Master of Calamity still did not notice him.<br/><br/>” His strength is not bad, but he is not the strongest person in the Holy Region.”<br/><br/>Wang Xian looked at the middle-aged woman in front of him. This was the first female Calamity Master he had met.<br/><br/>He was sitting cross-legged and cultivating.<br/><br/>Wang Xian didn’t alert her. With his current strength, he could easily kill her.<br/><br/>However, Wang Xian wasn’t someone who would kill the innocent. He wouldn’t kill other experts recklessly for resources.<br/><br/>Wang Xian moved and left. After staying in the Holy Territory for hundreds of years, he headed to the border between the Holy Territory and the Abyss.<br/><br/>At the edge of the two regions, there was a huge castle.<br/><br/>This castle was called Demon Suppression Castle.<br/><br/>The entire castle was incomparably huge. Although it was called a castle, it was actually the size of tens of thousands of planets.<br/><br/>The entire castle was emitting extremely terrifying energy.<br/><br/>Wang Xian swept his gaze across the castle and could sense that there were more than 8,000 Heavenly Origin Fate Realm experts.<br/><br/>In fact, there were even two Cataclysm Masters guarding the castle.<br/><br/>This castle was called the Demon Suppression Castle. It was a line of defense between the Holy Area and the Abyss Area.<br/><br/>Countless experts from the Holy Region came here to fight and suppress the demons in the Abyss Region.<br/><br/>Just to protect their home.<br/><br/>Wang Xian strolled around the castle and sensed the strength of the two Calamity Masters. They were much stronger than the ones he had met before. However, compared to him, they were worlds apart.<br/><br/>At the very least, Wang Xian could still kill them easily.<br/><br/>He did not stay there for long and continued to fly in the direction of the abyss.<br/><br/>Along the way, he saw the powerhouses of the sacred region fighting the monsters of the abyss region.<br/><br/>The creatures of the Abyss were a kind of monster that looked extremely cruel and ferocious.<br/><br/>They were bloodthirsty, the strong preyed on the weak, and followed the naked laws of darkness.<br/><br/>The intelligence of these creatures was not inferior to humans, but the nature of their bodies was to kill.<br/><br/>” This is the first time I’ve encountered a creature with such intelligence but such brutality.”<br/><br/>Wang Xian’s eyes sparkled as he looked at these creatures.<br/><br/>He did not make a move because the weak abyssal creatures nearby were not worth his time.<br/><br/>He kept flying toward the depths of the abyss, divining while sensing.<br/><br/>Soon, he entered the depths of the abyss and sensed a huge abyss nest.<br/><br/>This was an extremely huge abyssal lair. Countless abyssal monsters were born here, killing and evolving.<br/><br/>These abyssal monsters began to devour the corpses of their own kind from the moment they were born. The stronger they were, the stronger they were, and the weaker they were turned into food.<br/><br/>At the center of the nest, there was a monster that emitted an extremely terrifying aura.<br/><br/>This monster was the Master of Calamity.<br/><br/>At the same time, he was also the leader of many Abyssal Demons. He could control his subordinates.<br/><br/>“This abyssal monster didn’t break through the Chaos cardinal treasure. It’s similar to the power of faith.”<br/><br/>Wang Xian muttered as he checked the monster’s condition.<br/><br/>The Abyssal Demons gave birth to countless monsters. These monsters would sacrifice their faith and their souls.<br/><br/>The more and stronger his subordinates were, the stronger it would be.<br/><br/>He even had the strength of a Tribulation Master.<br/><br/>Furthermore, according to Wang Xian’s senses, this monster was not much weaker than the three Calamity Masters in the Sacred Region.<br/><br/>” There’s dark energy, faith energy, and lightning energy in his body. It should be enough to kill this monster.”<br/><br/>Wang Xian thought to himself as he extended his palm.<br/><br/>An extremely terrifying dragon claw instantly arrived in front of the Abyssal Demon, and a chaotic power enveloped its body.<br/><br/>The extremely terrifying energy instantly caused it to tremble. Countless blood-red pupils were filled with disbelief and fear.<br/><br/>“Buzz!”<br/><br/>After the dragon claw covered the area, Wang Xian killed the Cataclysm Master.<br/><br/>Waves of energy entered Wang Xian’s body and increased his strength.<br/><br/>“Chirp, chirp, chirp!”<br/><br/>When this Abyssal Demon died, all the Abyssal Monsters born from it died in an instant.<br/><br/>Wang Xian surveyed the Abyssal Demon’s lair and collected all the resources and treasures before flying deeper into the abyss.<br/><br/>With Wang Xian’s current capabilities, everything he had was akin to a vacation.<br/><br/>At the same time, he could also increase his strength and obtain resources.<br/><br/>…..<br/><br/>He had originally thought that these two chapters would end, but as he wrote, there would be more and more chapters. It would end very quickly!\t\t\t\t\t\t</div>", "images": {}, "success": true}