{"id": 1609, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15244085.html", "title": "Chapter 4612_End - Chapter 4612: Finale", "volume": 17, "volume_title": "Volume 17", "body": "<h1>Chapter 4612_End - Chapter 4612: Finale</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4612: Finale<br/><br/>Wang Xian had spent thousands of years on the transformation of the 9-Origin Universe. It could be said that he had strived to make every part of the universe perfect!<br/><br/>Several thousand years later, the entire 9-Essences Cosmos was filled with boundless energy.<br/><br/>The ten Chaos cardinal treasures emitted a gentle light that illuminated the entire universe.<br/><br/>Ten magnificent pillars of light connected from the edge of the universe to the center of the universe.<br/><br/>It was a blue planet that was connected by ten Chaos cardinal treasures and emitted dense vitality.<br/><br/>“Is this the planet where father was born? I really didn’t expect that father would actually reach his current achievements in such a short period of time from such a small earth.”<br/><br/>The group of dragon children and dragon ladies looked at this planet that they thought was small and said in slight shock.<br/><br/>Wang Xian smiled and didn’t say anything. Some of the past events on Earth flooded into his mind.<br/><br/>He was once a weak youth, but he had already grown to his current level.<br/><br/>“If there’s nothing else in the future, I’ll live on this earth and occasionally bring you guys on a trip. We’ll go shopping in the various regions of the universe.”<br/><br/>Wang Xian said to them with a smile.<br/><br/>The current Wang Xian had achieved true invincibility in the Chaos.<br/><br/>No one was his match.<br/><br/>Through the power of divination, he could confirm that there was no existence in the entire Chaos that could compare to it.<br/><br/>In fact, let alone being comparable, there were no experts who could withstand a single move from him.<br/><br/>Invincibility was lonely, but it was also very relaxing. There was no pressure!<br/><br/>It was time to live a life of retirement.<br/><br/>“It’s time to rest.”<br/><br/>The girls also smiled.<br/><br/>In the following period of time, experts from the various pinnacle races of the 9-Origin Cosmos came to pay a visit.<br/><br/>Wang Xian sat with her, chatting and drinking. It was quite relaxing.<br/><br/>The powerful disciples of the Justice Alliance and the Dragon Palace Alliance sensed the changes in the 9-Origin Universe.<br/><br/>That was because the ten Chaos cardinal treasures floating around the universe were too shocking.<br/><br/>They came to pay their respects.<br/><br/>As time passed, more and more experts gathered in Dragon Palace.<br/><br/>The number of Sky Origin Fate Realm experts in Dragon Palace gradually reached five to six thousand.<br/><br/>Moreover, it was increasing at a terrifying speed.<br/><br/>Wang Xian didn’t care much about the strength of the disciples of the Dragon Palace!<br/><br/>However, as Dragon Palace’s strength increased, the disciples of Dragon Palace found more areas around them.<br/><br/>Moreover, they connected the surrounding areas through the teleportation array.<br/><br/>There were also experts from other regions who had unintentionally come to the 9-Essences Cosmos.<br/><br/>When they saw how terrifying the 9-Essences Cosmos was, they were shocked beyond words, and they felt as if they were insignificant.<br/><br/>Those who were blind and did not follow the rules would naturally die permanently here.<br/><br/>Most of them had carefully inquired and learned that there was an invincible existence here.<br/><br/>Time passed very quickly. One billion years, two billion years…<br/><br/>Time passed quickly, and more and more experts in the 9-Origin Cosmos learned about it.<br/><br/>This place was connected to more and more regions.<br/><br/>There were ten Chaos cardinal treasures around the 9-Essences Universe, and they were extremely gentle. This was why the area around the 9-Essences Universe also contained endless energy.<br/><br/>This attracted countless experts to build their own mansions here after obtaining the approval of the Dragon Palace.<br/><br/>As more and more of them appeared, the 9-Essences Cosmos became more and more lively.<br/><br/>After six billion years, the tribulation completely ended.<br/><br/>Chaos returned to chaos.<br/><br/>There was dead energy everywhere. Those who were not in the Heavenly Origin Stage could not survive in the Chaos for long.<br/><br/>However, in the vast space surrounding the 9-Origin Universe, the energy of the Chaos cardinal treasure had propped up a powerful region.<br/><br/>Cultivating in this region was much better than cultivating in any treasure land in the universe.<br/><br/>As time passed, more and more experts found out about this place, and more and more living beings from different regions rushed over.<br/><br/>This also caused the entire area to become more and more lively.<br/><br/>The life force became denser and denser.<br/><br/>” Is this the center of Chaos, the universe born by Dragon King, the master of Chaos?”<br/><br/>” Ten supreme treasures of Chaos are floating around. The enormous formation is connected to the Chaos. Even the energy in the Chaos can be converted into various attributes. The energy here is endless. It’s unbelievable!”<br/><br/>” The Master of Chaos is an invincible and immeasurable existence. It’s so lively here. You know, this isn’t the Cultivation Tribulation. At a glance, there are at least tens of thousands of Heaven’s Fate Realm experts, right?”<br/><br/>After more than 20 billion years, a Tribulation Master brought a region of experts here.<br/><br/>They looked at the holy land in front of them, which was known as the center of chaos, and their hearts were filled with shock.<br/><br/>They finally understood why the Dragon King was called the Master of Chaos!<br/><br/>He finally understood why this place was called the center of chaos.<br/><br/>Because even though they had reached the realm of the Master of Calamity, they still felt insignificant.<br/><br/>And this place was built by the Dragon King. One could imagine what kind of existence the Dragon King was.<br/><br/>Around the 9-Essences Universe, in front of the ten Chaos cardinal treasures, stood ten enormous divine dragon statues.<br/><br/>This was a statue created by the experts of other regions.<br/><br/>The statue of the Dragon King.<br/><br/>All the experts who came here had to bow to the statue to show their respect.<br/><br/>This was the unspoken rule, and no expert had any objections.<br/><br/>That Dragon King was worthy of their worship!<br/><br/>It was clearly recorded that a region was attacked by a terrifying Chaos beast. The entire region was no match for the Chaos beast, and countless creatures were devoured by the Chaos beast.<br/><br/>The experts there came to beg the Master of Primal Chaos to help.<br/><br/>As for the Master of Chaos, he simply waved his arm and grabbed the ferocious Chaos Behemoth from countless distances.<br/><br/>“Xiao Xian, the 9-Essences Cosmos is getting more and more lively.”<br/><br/>In the 9-Source Universe, on the beach on Earth, a group of girls and Wang Xian were lying on chairs leisurely. They were all smiling as they spoke.<br/><br/>Wang Xian smiled.” That’s right. It’s getting more and more lively. A new Cultivation Tribulation is coming.”<br/><br/>” Hehe, the tribulation is coming. Xiao Xian, take us to other areas to have fun!”<br/><br/>The girls said expectantly.<br/><br/>“No problem!”<br/><br/>Wang Xian revealed a smile as he lifted his head and looked up at the starry sky.<br/><br/>His story was over!<br/><br/>……<br/><br/>It’s over. I have mixed feelings. Thank you to all my friends along the way. Thank you for your support. Without you, this book wouldn’t have reached this stage. The ending was still considered perfect. The story that belonged to Wang Xian had come to an end.<br/><br/>Here, I wish all my readers peace and happiness, and I wish them all the best. Thank you for your company!\t\t\t\t\t\t</div>", "images": {}, "success": true}