{"id": 1604, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15244080.html", "title": "Chapter 4607 - Chapter 4607: Master Of Chaos 1", "volume": 17, "volume_title": "Volume 17", "body": "<h1>Chapter 4607 - Chapter 4607: Master Of Chaos 1</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4607: Master of Chaos 1<br/><br/>It swallowed more than 2,000 Sky Origin Creation Realm experts.<br/><br/>One of them was a Calamity Master.<br/><br/>The strength of the Universe Devourer had exceeded the expectations of the great beings in this area.<br/><br/>Their expressions were extremely ugly as they hurriedly activated the huge array diagram.<br/><br/>One had to know that this array diagram was a powerful treasure that their Master of Calamity had found in the chaos.<br/><br/>It could gather all of their strength together, allowing their attacks and defenses to be condensed together.<br/><br/>However, even so, they were suddenly swallowed into their stomachs.<br/><br/>This caused them to be incomparably shocked.<br/><br/>Boom! Boom!<br/><br/>They activated the array diagram, and a terrifying energy attacked upwards.<br/><br/>The endless energy beam tried to break the body of the Universe Devourer.<br/><br/>“Roar!”<br/><br/>However, an incomparably deep voice entered their minds, causing their expressions to change drastically.<br/><br/>They saw that the terrifying energy beam actually dissipated bit by bit.<br/><br/>It was as if it had been swallowed by a strange force.<br/><br/>“How is this possible?”<br/><br/>“Oh no, how can this Universe Devourer be so powerful? How can it be so terrifying?”<br/><br/>Over 2,000 Heaven’s Origin Stage powerhouses looked at this scene in disbelief.<br/><br/>It was too powerful!<br/><br/>The strength of this Universe Devourer was so strong that it made them feel despair.<br/><br/>It could actually devour them in an instant.<br/><br/>An attack that could be directly dissolved by it. How could he resist such a terrifying existence?<br/><br/>They were in despair.<br/><br/>“Should we escape immediately?”<br/><br/>A Primal Chaos existence couldn’t help but ask.<br/><br/>“Once we escape, all of our universes will be devoured.”<br/><br/>“What if we don’t escape? We don’t even have the strength of a Universe Devourer!”<br/><br/>Some experts were unwilling. Their faces were filled with shock and anger, but they were even more powerless.<br/><br/>….<br/><br/>“Eh? Universe Devourer? This title is very vivid. The strength of this giant beast is really powerful!”<br/><br/>From afar, Wang Xian was shocked when he saw this scene.<br/><br/>This Universe Devourer’s power was truly terrifying.<br/><br/>He was even stronger than when he was in the Torrent Region.<br/><br/>At that time, he could kill more than 1,000 Sky Origin Creation Realm experts.<br/><br/>However, after such a long period of improvement, Wang Xian’s strength had already reached an unfathomable level.<br/><br/>” Ah, Dragon King, those creatures have been devoured by this giant beast. This giant beast is so powerful that even I am no match for it. It’s so terrifying.”<br/><br/>Mu Mu stared at the Universe Devourer in front of him and said in surprise.<br/><br/>“It is very strong!”<br/><br/>Wang Xian nodded. He looked at the gigantic Universe Devourer and raised his arm.<br/><br/>A similarly immeasurable palm instantly appeared in front of the Universe Devourer.<br/><br/>The huge claws grabbed its body.<br/><br/>“Roar!”<br/><br/>The Universe Devourer sensed the huge palm in the sky, and it let out a panicked roar.<br/><br/>The gigantic head was aimed at Wang Xian.<br/><br/>At the same time, its body shook, and more than 2,000 Sky Origin Fate Realm experts in its body were spat out.<br/><br/>Sensing the danger, it did not have the time to deal with the 2,000 Sky Origin Fate Realm experts.<br/><br/>“Boom!”<br/><br/>When the 2,000 Sky Origin Stage powerhouses were spat out, the endless palm had already restrained the body of the Universe Devourer.<br/><br/>“Roar!”<br/><br/>“Roar!”<br/><br/>The Universe Devourer kept roaring, and the terrifying energy on its body attacked the huge palm, wanting to fight for it.<br/><br/>A violent physical and spatial energy tore at the giant palm.<br/><br/>“Although you’re the strongest existence I’ve encountered in the primordial chaos, you’re still a little weak!”<br/><br/>Wang Xian said calmly. His five fingers formed a claw and streams of Chaotic Force entered the Universe Devourer’s body and began to absorb its energy.<br/><br/>“This… What’s going on? We’re out again?”<br/><br/>At the same time, the Heaven’s Origin Creation Realm experts who were still inside the Universe Devourer’s body suddenly appeared outside. They were all shocked.<br/><br/>“Look over there. Hiss, how is this possible? What is this?”<br/><br/>“What is this? What palm was this? Was it the Master of Chaos? Is there a Master of Chaos in our Chaos? Is he cleaning up and destroying this Universe Devourer?”<br/><br/>” A single palm actually imprisoned that invincible Universe Devourer. This is simply impossible!”<br/><br/>“Look over there, there are two figures.”<br/><br/>Over 2,000 Sky Origin Creation Stage powerhouses noticed the endless palms above the Universe Devourer.<br/><br/>When they noticed Wang Xian and the rest, their faces were filled with shock and disbelief.<br/><br/>The Universe Devourer had already made them feel invincible.<br/><br/>Now, a palm had appeared and was suppressing the Universe Devourer.<br/><br/>This?<br/><br/>There was a Master of Chaos in the Chaos?<br/><br/>The master of Chaos?<br/><br/>They looked at the two figures in the distance and saw one of them stretch out his hand. Clearly, this was the mighty existence who had attacked.<br/><br/>Sensing the invincible might, their breathing stopped.<br/><br/>“Thank you, great Master of Chaos!”<br/><br/>The Calamity Master’s expression changed. He felt that the lord who had attacked him wanted to kill him as easily as crushing an ant.<br/><br/>However, this great existence was currently destroying the Universe Devourer.<br/><br/>He hurriedly knelt in the air and thanked him.<br/><br/>“Thank you, great Master of Chaos!”<br/><br/>The rest of the experts also hurriedly knelt in the void.<br/><br/>He bowed respectfully.<br/><br/>Wang Xian glanced at them and didn’t pay them any attention. In front of him, the huge Universe Devourer was completely restrained by him.<br/><br/>With a thought, a tiny bubble flew out of his body.<br/><br/>The small bubble contained terrifying spatial power. There was another space inside, as if it could contain a universe.<br/><br/>The bubble flew toward the Universe Devourer, and an unbelievable scene appeared.<br/><br/>The bubble was smaller than a palm, and it slowly sucked the Universe Devourer into it.<br/><br/>“Roar!”<br/><br/>The Universe Devourer was unable to resist at all. It roared in terror, its body trembling.<br/><br/>Following that, the bubble containing the Devourer of the Universe arrived in Wang Xian’s palm.<br/><br/>“Slowly refine it.”<br/><br/>Wang Xian looked at the bubble and smiled.<br/><br/>Through his divination, he found out that this Universe Devourer had devoured everything in thousands of universes.<br/><br/>It possessed terrifying spatial power and powerful physical strength.<br/><br/>After devouring at least two regions, its strength could reach such a terrifying level.<br/><br/>If Wang Xian killed and refined it, he could save countless lives.<br/><br/>“Let’s go. We’ll continue to stroll around other places.”<br/><br/>Wang Xian turned around and left with Mu Mu.<br/><br/>Only more than 2,000 Sky Origin Fate Realm experts were left behind, their faces filled with shock and gratitude.<br/><br/>From then on, the legend of the Master of Chaos circulated in this area!\t\t\t\t\t\t</div>", "images": {}, "success": true}