{"id": 1608, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15244084.html", "title": "Chapter 4611 - Chapter 4611: 4610 Chaos Center, Earth Reappears", "volume": 17, "volume_title": "Volume 17", "body": "<h1>Chapter 4611 - Chapter 4611: 4610 Chaos Center, Earth Reappears</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4611: 4610 Chaos Center, Earth Reappears<br/><br/>” They did bring some interesting things. There are technological items, special treasures, and some beautiful Chaos Star Stones.”<br/><br/>Wang Xian looked at his children, Guan Shuqing, and the other girls. He handed them some toys that he had obtained in the Chaos.<br/><br/>This time, he visited dozens of regions and came to the end of the chaos. He stayed behind when he encountered some interesting things.<br/><br/>This was especially true for some Chaos Star Stones. They were extremely beautiful Star Stones that emitted the light of a dream. They could increase one’s aura and also had the ability to protect.<br/><br/>“Wow, so beautiful!”<br/><br/>“Father, what is this? A mecha? He’s so handsome!”<br/><br/>“This stone looks good. I want to forge it into a necklace!”<br/><br/>The girls were all filled with excitement, and the boys ‘eyes were shining.<br/><br/>Although they were over 200 million years old, they were still like children to Wang Xian and the rest.<br/><br/>“Haha!”<br/><br/>Wang Xian smiled.” I’m going to modify the 9-Origin Universe. You can find a place in the 9-Origin Universe and make it your home. Tell me what kind of home you want.”<br/><br/>“Hmm? Father, you want to transform the 9-Essences Cosmos? We don’t need a separate home, we just want to live together with father and mother.”<br/><br/>The seventh girl immediately said with a smile.<br/><br/>“That won’t do. You’re already so old. Don’t disturb my life with your mother!”<br/><br/>Wang Xian chuckled.<br/><br/>“Humph!” The girls snorted and looked unhappy.” You don’t want us to disturb you. We have to disturb you every day. Mother loves us.”<br/><br/>“Hehe, yes, yes!”<br/><br/>Guan Shuqing and the rest of the girls said with a smile!<br/><br/>Wang Xian also smiled.” I’ll build a nest for each of you. When you rest, go back to your own nest. You’re all grown up now. You’re going to split up. Isn’t it good to give you some privacy?” However, they all have teleportation arrays that can instantly come over.”<br/><br/>“Then I want a fan’s nest.”<br/><br/>” I want the kind that is dreamy. The surrounding space is flowing with starlight…”<br/><br/>The girls immediately became interested and made requests one by one.<br/><br/>Wang Xian chatted with them and recorded them down one by one.<br/><br/>Now, he had more than a dozen Chaos cardinal treasures of various attributes.<br/><br/>All the resources had been absorbed by him. However, Wang Xian could create them directly.<br/><br/>With his Chaotic Force, he could create anything he saw.<br/><br/>In fact, as long as he could imagine it, he could create it.<br/><br/>After accompanying Guan Shuqing and the children for some time, Wang Xian began his transformation.<br/><br/>When the ten Chaos cardinal treasures floated around the 9-Essences Universe, the entire 9-Essences Universe was instantly filled with unparalleled energy.<br/><br/>The majestic degree of this energy had reached a point where it could harm people.<br/><br/>Boundless energy instantly affected the entire 9-Essences Cosmos.<br/><br/>The ordinary plants and vegetation began to rapidly evolve towards the divine tree and divine grass.<br/><br/>Ordinary living beings, even if they did not cultivate, could reach the strength of a Venerable just by breathing in this endless energy.<br/><br/>The ten Chaos cardinal treasures were located in the 9-Essences Cosmos. All living beings in the 9-Essences Cosmos could reach the Ruler realm with a little bit of cultivation.<br/><br/>It would be very easy for him to break through to the Heavenly Yuan Fate Realm, but he still needed a quota to do so!<br/><br/>The sudden change in the 9-Essences Cosmos attracted the attention of all the living beings in the 9-Essences Cosmos. They looked around in disbelief.<br/><br/>The experts of the peak races were the Empress of the Elf Race, the Twelve Ancestors of Sorcery of the Sorcerer Race, the Divine Tiger Race, the Black Tortoise Race, the Saint Race, and so on.<br/><br/>The Heavenly Fate Realm experts of the 9-Origin Cosmos were also shocked.<br/><br/>” From today onwards, I will use the supreme treasures of the universe and the supreme treasures of chaos to transform the 9-Essences Universe. There’s no need to panic.”<br/><br/>At that moment, a voice rang out in the ears of every living being in the 9-Essences Cosmos.<br/><br/>“Dragon King? The invincible Dragon King is the one who is transforming our 9-Essences Cosmos? Oh my god, this spiritual energy is too terrifying and unbelievable. In just a breath, I feel like I’m about to break through!”<br/><br/>“Hiss, just how strong is our Dragon King now? Many lords say that our Dragon King is already invincible. What does invincibility mean?”<br/><br/>” It’s too vast and too powerful. It can transform our entire universe with a wave of its hand.”<br/><br/>“Thank you, Dragon King!”<br/><br/>All living beings were shaken, and all intelligent beings in the 9-Essences Cosmos fell to their knees and bowed.<br/><br/>Some of the living beings who had gained a trace of intelligence under the impact of the spiritual energy also knelt in one direction according to the vague guidance.<br/><br/>The Elven Empress and the rest flew towards Wang Xian.<br/><br/>Following that, they witnessed a scene that they found unbelievable.<br/><br/>The Chaos cardinal treasure hovering around the 9-Essences Cosmos was suffocating.<br/><br/>They felt that as long as they entered the center, they would immediately die from the impact of the energy.<br/><br/>Then, they saw the Dragon King using an indescribable method to transform the entire 9-Essences Cosmos.<br/><br/>A powerful array formation connected the energy of the ten Chaos cardinal treasures, allowing them to enter the 9-Essences Cosmos in a balanced manner!<br/><br/>It filled every corner of the 9-Essences Cosmos.<br/><br/>Soon, many powerful treasures and sacred grounds were born in the 9-Essences Cosmos.<br/><br/>That powerful sacred land was much, much stronger than the strongest treasured lands of the various peak races.<br/><br/>With a wave of the Dragon King’s hand, ninety-nine sacred lands were born in the 9-Origin Universe.<br/><br/>Even without a seat, the area was huge, enough for hundreds of millions of living beings to cultivate.<br/><br/>Because of the ten Chaos cardinal treasures, the energy of these holy lands would never run out!<br/><br/>Ninety-nine sacred lands were scattered throughout the 9-Essences Cosmos.<br/><br/>These holy lands were for all living beings with potential to use.<br/><br/>After creating these sacred grounds, Wang Xian created beautiful sceneries that he had seen in other regions in the desolate void of the 9-Origins Universe.<br/><br/>Strange scenery!<br/><br/>He copied them one by one.<br/><br/>The entire 9-Essences Cosmos was filled with life and was extremely beautiful!<br/><br/>In the end, Wang Xian rebuilt the Dragon Palace and built a new residence for the disciples of the Dragon Palace.<br/><br/>Firstly, he had transferred the former Earth to this place.<br/><br/>Looking at the familiar and slightly changed blue planet, his face revealed a sense of familiarity that he had not felt for a long time.<br/><br/>Earth, the planet he was born on, was also the planet where he rose to prominence.<br/><br/>From a remote place in the universe, he rose from Earth and reached his current level.<br/><br/>This was his home planet.<br/><br/>Wang Xian moved Earth to the center of the 9-Origin Universe. With the Mother Planet as the center, he built buildings around it.<br/><br/>There was a void land, a void ocean, and a unique underwater dragon palace.<br/><br/>“I was born on Earth, and I rose to prominence on Earth. Today, Earth will become the center of the 9-Essences Cosmos, and even…The center of the universe!”<br/><br/>Wang Xian mumbled with a smile.\t\t\t\t\t\t</div>", "images": {}, "success": true}