{"id": 1602, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15244078.html", "title": "Chapter 4605 - Chapter 4605: He, In The Myth Of Chaos", "volume": 17, "volume_title": "Volume 17", "body": "<h1>Chapter 4605 - Chapter 4605: He, In The Myth Of Chaos</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4605: He, in the myth of chaos<br/><br/>“This… What kind of existence is this?”<br/><br/>” A single person and a single hand suppressed an Abyssal Queen Mother. How could a human be capable of such a feat?”<br/><br/>“Hiss, so strong, so strong. What kind of existence is this great expert? Where did it come from? Is he here to save us? Are you here to help us suppress the Abyss?”<br/><br/>All the disciples were stunned!<br/><br/>In the Tianqing region, the disciples who were prepared to die in battle looked at this scene in disbelief.<br/><br/>They thought that a disaster was coming, that a great war was about to break out.<br/><br/>However, he did not expect that a figure would suddenly appear and suppress the entire abyssal Queen Mother army single-handedly.<br/><br/>This scene shocked everyone.<br/><br/>” Thank you, great being, for helping us resolve the disaster in our Tianqing region. Thank you, sir!”<br/><br/>At this moment, even the only Calamity Master in the Tian Qing region was shocked when he saw this scene.<br/><br/>They were also shocked, afraid, and filled with endless reverence.<br/><br/>He directly knelt in the void and bowed to that mighty figure.<br/><br/>” Thank you, great being, for helping us resolve the disaster in our Tianqing region. Thank you, sir!”<br/><br/>” Thank you, great being, for helping us resolve the disaster in our Tianqing region. Thank you, sir!”<br/><br/>In the next moment, all the experts in the Tianqing region knelt in the void and shouted.<br/><br/>Their faces were filled with excitement.<br/><br/>They were filled with gratitude and trembling!<br/><br/>With the abyssal Queen Mother army suppressed, the calamity in the Tian Qing region would be completely resolved.<br/><br/>They could finally breathe a sigh of relief.<br/><br/>“It’s just a casual gesture. There’s no need to thank me!”<br/><br/>Wang Xian said calmly when he heard the earth-shaking kowtowing voices behind him.<br/><br/>He moved his body and led the suppressed abyssal Queen Mother army toward the depths of the abyss.<br/><br/>“Thank you for your help, sir. Our Tianqing region will erect a statue of you for all the disciples to worship as a sign of our gratitude!”<br/><br/>Calamity Master continued to kneel and said loudly.<br/><br/>Even though Wang Xian’s figure had disappeared, they still knelt there for a long time.<br/><br/>Ten minutes later, all the experts slowly stood up, their faces filled with excitement.<br/><br/>“Hahaha, that mysterious lord has eliminated the Abyssal Queen Mother and the group of abyssal monsters. We finally don’t have to worry and be afraid all day!”<br/><br/>“Yes, yes, we can finally be free. Thank you, great being.”<br/><br/>“Where did that lord come from? How powerful is he? He suppressed the entire abyssal legion with one palm. My god, this is unbelievable!”<br/><br/>All the experts and disciples in the Tianqing area roared excitedly, shocked, cheered, and roared…<br/><br/>Not long after, a statue of Wang Xian was established in various regions of the Tian Qing Region and stood at the center of the various Great Cosmoses.<br/><br/>Although the Tianqing Region didn’t know where this great existence came from or what his name was, they only knew that he was their benefactor. That was enough.<br/><br/>He allowed countless creatures in the Tianqing region to exist and continue to survive!<br/><br/>It was a supreme existence!<br/><br/>Wang Xian didn’t know that the Tian Qing Region had erected statues for him in all the universes.<br/><br/>However, even if he knew, he did not care much.<br/><br/>He shuttled back and forth in the abyss and killed a large number of abyssal Queen Mothers and the abyssal legion.<br/><br/>After refining it, his strength became more and more terrifying, unpredictable, and unimaginable.<br/><br/>After dealing with a large number of Abyssal Queen Mothers and the army, Wang Xian crossed the abyss and continued to fly towards the area ahead.<br/><br/>Tens of thousands of years after Wang Xian left the Abyss, some areas that were threatened by the Abyss suddenly realized that the entire Abyss had calmed down.<br/><br/>Some experts entered the abyss and found that the demons in the abyss were almost invisible.<br/><br/>Only a few Abyssal Demons were active inside!<br/><br/>Wang Xian crossed the abyss and stepped into a new area.<br/><br/>In this area, he found a Chaos cardinal treasure.<br/><br/>“Eh?”<br/><br/>As he continued to fly forward, he divined another special area.<br/><br/>” A special area where Chaos Behemoths live. An Elemental God with the existence of a Calamity Master!”<br/><br/>Wang Xian’s eyes flickered as he checked the information he obtained from the divination.<br/><br/>He moved and immediately flew toward that area.<br/><br/>A few hundred years later, Wang Xian arrived at this special area. His eyes sparkled as he looked at the area.<br/><br/>Here, Chaos Behemoths ran amok. There was no universe.<br/><br/>There were many Elemental Gods, and all kinds of Elemental Gods emitted powerful auras.<br/><br/>There was even an Elemental God at the center that was comparable to the Master of Calamity.<br/><br/>This Elemental God, who was comparable to the Master of Calamity, had already given birth to a trace of intelligence. However, because there were no other creatures around to talk to, her intelligence was very low.<br/><br/>Moreover, because of the characteristics of the Elemental God, she was full of destructive power.<br/><br/>Within a radius of countless kilometers, even the powerful Chaos Behemoths did not dare to approach.<br/><br/>” This Elemental God is quite mystical. It actually has intelligence and can be brought to the 9-Origin Cosmos.”<br/><br/>Wang Xian muttered. The Elemental God contained endless energy.<br/><br/>For example, the area around this wood-type Elemental God was a holy land for cultivating wood-type creatures.<br/><br/>Of course, he had to be able to withstand the wood attribute energy that erupted from it.<br/><br/>The cultivation holy land formed by the Elemental Gods was even more powerful than that formed by the Chaos cardinal treasures.<br/><br/>“Buzz!”<br/><br/>Wang Xian came to the front of the Elemental God. With a wave of his arm, he sent some information about the Chaotic Universe into her mind.<br/><br/>This caused the Elemental God’s energy to fluctuate, and endless wood-type energy surged.<br/><br/>Wang Xian placed it inside and blocked it easily.<br/><br/>” Hello, Dragon King. Are those Chaos, universes, and living beings real?”<br/><br/>Very soon, a spiritual fluctuation was transmitted into Wang Xian’s mind.<br/><br/>” That’s right. You’re an anomaly among the Elemental Gods. You’ve gained intelligence, and you’re considered very powerful. You can try to restrain the energy that you’ve spread out and try to transform. Are you interested in following me?”<br/><br/>Wang Xian smiled and said.<br/><br/>” Alright, Dragon King. You’ve increased my intelligence and made me understand more things. I’m willing to follow you and see the endless chaos and universe.”<br/><br/>the Elemental God replied.<br/><br/>“Hehe, alright, I’ll call you Mu Mu from now on. You should learn to control your own strength first.”<br/><br/>Wang Xian smiled as he tried to meddle with the method of controlling one’s strength.<br/><br/>Very soon, Mu Mu, who looked like a little girl, appeared beside Wang Xian and sized him up curiously.<br/><br/>“Let’s go. I’ll bring you to learn more about living beings, regions, and knowledge.”\t\t\t\t\t\t</div>", "images": {}, "success": true}