{"id": 1607, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15244083.html", "title": "Chapter 4610 - Chapter 4610: Master Of Chaos 4", "volume": 17, "volume_title": "Volume 17", "body": "<h1>Chapter 4610 - Chapter 4610: Master Of Chaos 4</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4610: Master of Chaos 4<br/><br/>All the experts and living beings in the entire Technology Divine Realm knew what had happened at the star-hunting warship.<br/><br/>All the living beings in the technological divine territory were filled with horror.<br/><br/>Now, when they heard this voice that was filled with endless majesty, their expressions became stunned. They were furious, terrified, and unwilling.<br/><br/>The battleships and armies that the Technology Divine Realm had sent out this time were three-quarters of their strength.<br/><br/>However, such a powerful force was actually wiped out by a creature that suddenly appeared.<br/><br/>How could this not make the living beings of the Science and Technology Divine Realm feel horrified!<br/><br/>Now, they were about to face judgment and destruction.<br/><br/>They did not want to die!<br/><br/>Wang Xian ignored them. He stood at the center of the Technology Divine Territory and swept across everything in his surroundings with his giant hand.<br/><br/>All the living beings, all the battleships, all the technology, they were all collected by him.<br/><br/>A region that had existed for dozens of eons, a region that was almost invincible, and a technological civilization that was almost invincible. Wang Xian had no way of resisting!<br/><br/>Although the strong preyed on the weak in the Chaos, Wang Xian was not used to the development of this civilization.<br/><br/>Therefore, if he was strong, he would destroy the Science and Technology Divine Realm, judge it, and destroy it.<br/><br/>In the next tens of thousands of years, Wang Xian traveled across the entire civilization and destroyed the technological power of the Technology Divine Realm.<br/><br/>Tens of thousands of years after he left the Technology Divine Territory, the regional powerhouse who had been invaded by the Technology Divine Territory came here.<br/><br/>When they saw all the living beings in the entire Technology God Realm disappear, they were filled with shock.<br/><br/>This made them think of the invincible figure who had suddenly appeared in front of the Science and Technology God Realm Army.<br/><br/>The experts in this region called him the Master of Chaos.<br/><br/>That was because that person was an invincible existence. He was an existence that could destroy the Science and Technology Divine Realm with a wave of his hand.<br/><br/>Other than the Master of Chaos, who else could do it?<br/><br/>Of course, all of this was for the future. Wang Xian brought Mu Mu along and continued on their journey.<br/><br/>While absorbing the resources of the Technology God Territory, he wandered around.<br/><br/>His strength was getting stronger and stronger, becoming more and more unfathomable.<br/><br/>He also had more than a dozen Chaos cardinal treasures.<br/><br/>In the end, when Wang Xian encountered a Supreme Treasure of Chaos, he didn’t collect it anymore.<br/><br/>There was no need to collect too many Chaos cardinal treasures.<br/><br/>“Is there an end to the primordial chaos?”<br/><br/>After Wang Xian absorbed all the resources in the Technology Divine Realm, his speed and strength had reached an even more terrifying level.<br/><br/>He only needed a few decades to travel from one region to another.<br/><br/>His speed had already reached an immeasurable level.<br/><br/>On this day, he suddenly muttered.<br/><br/>Was there an end to the primordial chaos?<br/><br/>He used the power of divination to divine, but he did not get any results. Then, he began to fly in a direction.<br/><br/>Time passed by slowly. As Wang Xian flew, he passed by various regions and encountered various special civilizations.<br/><br/>A special universe.<br/><br/>Wang Xian would always take action and kill the cruel rulers of the universe.<br/><br/>This also caused the name of an invincible and mysterious expert to resound throughout the various regions.<br/><br/>When the experts of these regions met and learned about the information of the other region, they all called the mysterious expert the Master of Chaos.<br/><br/>One legend after another was passed down from one region to another.<br/><br/>Tens of thousands of years passed by quickly. Wang Xian kept flying in one direction.<br/><br/>On this day, he suddenly felt something. He looked at the chaos in front of him and raised his eyebrows slightly.<br/><br/>” I came to the end of the Chaos. No, it’s not the end of the Chaos.”<br/><br/>Wang Xian felt as though he had discovered a new world. He had already traveled through tens of thousands of regions and had finally reached the end of the Chaos.<br/><br/>Of course, this end was a little special.<br/><br/>Other primal chaos regions would have universes, but this region didn’t have any.<br/><br/>The Chaotic Force here was extremely chaotic. There were special spaces that were nurtured in this chaos.<br/><br/>These spaces contained all kinds of energy.<br/><br/>Wang Xian entered this special area and continued to fly deeper. After flying for hundreds of years, he was finally certain.<br/><br/>This was the end of chaos.<br/><br/>The places he had passed through before were the universe, the embryonic form of the universe.<br/><br/>As time passed, new universes would be formed in those spaces.<br/><br/>“So this is the formation of a universe!”<br/><br/>Wang Xian came to the front of a space and observed it continuously. He had a feeling.<br/><br/>He felt that he could also create a universe.<br/><br/>It could even create an even more powerful universe.<br/><br/>” Chaos is not endless. Of course, this is only for oneself. For other experts, Chaos is endless. Even if they exhaust their endless lives, it will probably be very difficult to reach the end, let alone for the Heaven Essence Fate Realm experts.”<br/><br/>Wang Xian muttered to himself. He felt that it was time for him to return.<br/><br/>This time, he had been out for more than a million years and had visited countless areas.<br/><br/>His strength had increased tremendously, and he had gained a lot.<br/><br/>After that, he could go back and build the 9-Essences Cosmos before spending time with Guan Shuqing and the other girls.<br/><br/>In the endless time that followed, he could also bring them to visit various regions.<br/><br/>He didn’t need to pass through quickly like this time.<br/><br/>“Go back!”<br/><br/>A smile appeared on his face, and his body moved, disappearing in an instant.<br/><br/>In the next second, he appeared in the 9-Essences Cosmos, returning from the edge of the cosmos.<br/><br/>This was his ability, because the 9-Essences Cosmos contained his remnant energy.<br/><br/>Right now, Wang Xian felt that he was already immortal. Even without the Ultimate Resurrection Treasure, he would not die.<br/><br/>It was a strange feeling. It was as if the chaos was still there. Even if his body was destroyed, the remaining energy in various places could revive him!<br/><br/>“I’m back!”<br/><br/>Upon returning to the Dragon Palace, Wang Xian teleported over and greeted them with a smile after sensing the location of Guan Shuqing and the rest.<br/><br/>“Ah, Xiao Xian, you’re back. We just happened to get some delicacies from other places. Come and eat with us.”<br/><br/>For experts of their level, the time Wang Xian had gone out this time was not long.<br/><br/>Even for them, a closed-door cultivation would take millions of years.<br/><br/>Therefore, the girls were not too surprised.<br/><br/>“Alright!”<br/><br/>Wang Xian nodded his head and smiled as he looked at the food they were making.<br/><br/>“Father is back!”<br/><br/>“Father, did you bring us any gifts?”<br/><br/>Not long after, a group of little fellows rushed over and shouted excitedly.<br/><br/>Wang Xian smiled.<br/><br/>Wandering in the primal chaos, although he had invincible strength.<br/><br/>They could easily destroy an area or a civilization, but they still felt more comfortable at home.\t\t\t\t\t\t</div>", "images": {}, "success": true}