{"id": 1601, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15239313.html", "title": "Chapter 4604 - Chapter 4604: He, The Myth Of Chaos", "volume": 17, "volume_title": "Volume 17", "body": "<h1>Chapter 4604 - Chapter 4604: He, The Myth Of Chaos</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4604: He, the Myth of Chaos<br/><br/>“This abyss region is completely pitch-black. Even the universes are pitch-black. It’s occupied by all kinds of abyssal monsters. This region is really terrifying.”<br/><br/>Wang Xian was flying in the abyss and kept flying deeper. He was extremely surprised.<br/><br/>A huge area was occupied by these abyssal monsters.<br/><br/>He did not know if these abyssal monsters were born in this universe or if this universe was occupied by these abyssal monsters.<br/><br/>In the Chaos, Wang Xian would occasionally encounter some powerful abyssal monsters.<br/><br/>He would directly attack these abyssal monsters, kill them, and absorb and refine them.<br/><br/>After flying for hundreds of years, he still hadn’t passed through this huge area.<br/><br/>Wang Xian used the power of divination to divine the situation in this area.<br/><br/>“Weng weng weng!”<br/><br/>Information appeared in his mind one after another, causing him to reveal an extremely shocked expression.<br/><br/>According to his divination, the entire abyss region was incomparably huge, like an endless abyss.<br/><br/>The Abyssal Demons occupied this area.<br/><br/>There were twelve Queen Mother Abyssal Demons in the entire region.<br/><br/>As for the Abyssal Demons at the level of the Queen Mother, they were existences at the level of the Master of Calamity.<br/><br/>This abyss region was not only a threat to the sacred region.<br/><br/>There were three other areas that were threatened by the Abyssal Demons.<br/><br/>They desperately resisted these demons.<br/><br/>The strength of these three regions was not as strong as the sacred region. Compared to the sacred region, they were much more miserable.<br/><br/>Countless experts had fallen in order to fight against the Abyssal Demons.<br/><br/>However, they had no choice but to send more experts to the battlefield to resist these Abyssal Demons!<br/><br/>“Let’s exterminate these Abyssal Demons.”<br/><br/>Wang Xian made a divination and decided to eliminate this group of demons.<br/><br/>Although the existence of this group of demons could make some regions stronger and stronger, it also caused more regions to become more and more tragic. Countless heroes and experts died to protect their homes.<br/><br/>Wang Xian moved and divined the location of the Abyssal Demons.<br/><br/>A few hundred years later, Wang Xian arrived at the lair of the second Abyssal Demon Queen Mother.<br/><br/>In the Abyssal Demon Queen Mother’s lair, there were not only the Queen Mother but also thousands of Heavenly Fate Abyssal Monsters.<br/><br/>However, Wang Xian could easily kill them.<br/><br/>With a wave of his arm, a gigantic dragon claw covered the entire nest of the Demon Queen Mother.<br/><br/>The power of Chaos covered all the Abyssal Demons.<br/><br/>“Who is it?”<br/><br/>“No, no, no!”<br/><br/>“What kind of power is this?”<br/><br/>Countless abyssal monsters roared and wailed, but it was useless.<br/><br/>The abyssal Queen Mother unleashed all her power, but it was useless.<br/><br/>After tens of thousands of years, Wang Xian had refined and absorbed all the Abyssal Queen Mothers and monsters here. He then proceeded to the next place.<br/><br/>In the following tens of thousands of years, Wang Xian refined and absorbed the Abyssal Queen Mothers one after another. His strength continued to rise, and his supernatural powers became more terrifying and invincible.<br/><br/>I, the abyssal queen, am comparable to the strength of a region that isn’t weak.<br/><br/>The twelve abyssal queens represented twelve powerful factions and resources.<br/><br/>Wang Xian continued to absorb, improve and kill.<br/><br/>Eighty thousand years had passed unknowingly.<br/><br/>Wang Xian arrived at the lair of the Abyssal Demon Queen Mother.<br/><br/>This abyssal queen was leading her people to fight against a region.<br/><br/>In front of them were countless mechas, battleships, battle islands, and war planets.<br/><br/>There were also countless powerhouses who stared at the abyssal queen mother with blood-red eyes.<br/><br/>Their faces were filled with tragic expressions.<br/><br/>Fortunately, there were also Calamity Masters in this area.<br/><br/>He stared at the abyssal queen from afar.<br/><br/>The war between the two sides did not break out, and the Queen Mother did not launch an attack.<br/><br/>They did not dare to attack and could only wait quietly. The atmosphere was extremely oppressive.<br/><br/>Almost all the experts in this area had gathered here.<br/><br/>They knew that they could not retreat. Behind them was our universe.<br/><br/>Once they were occupied by the Abyssal Queen Mothers, they would become stray dogs without a home or a universe.<br/><br/>Once they lost the universe and their home, it would be terrifying after the tribulation ended.<br/><br/>After the tribulation ended, there was no longer any other elemental energy in the chaos.<br/><br/>Even a Primordial Heaven Creation Realm expert could not continue to cultivate and improve.<br/><br/>As for those below the Heavenly Yuan Creation Realm, they would all die.<br/><br/>This meant that their race was heading towards extinction.<br/><br/>Therefore, they could not retreat, even if they died in battle.<br/><br/>The atmosphere was solemn and stirring. No one knew why the war had erupted!<br/><br/>“Wuwuwu!”<br/><br/>At this moment, the Abyssal Queen Mother suddenly let out a roar. The energy on the bodies of the countless Abyssal Demons and monsters around it began to boil.<br/><br/>“Wuwuwu!”<br/><br/>“Roar!”<br/><br/>“Chirp, chirp, chirp!”<br/><br/>Countless abyssal monsters began to respond. They seemed to have woken up and were ready to hunt and fight.<br/><br/>“Prepare for battle!”<br/><br/>” Fight to the death, for our homeland, for our loved ones, for our universe!”<br/><br/>” Kill! Even if I die today, I won’t take a step back!”<br/><br/>” Kill, kill, kill! Let’s fight to the death with these monsters!”<br/><br/>When all the living beings in the area heard the horn, their hearts tightened, and their eyes turned red as they roared with death in their eyes.<br/><br/>Fight, fight to the death!<br/><br/>Everyone was prepared to sacrifice themselves!<br/><br/>“Buzz!”<br/><br/>At this moment, they suddenly saw an extremely terrifying giant hand covering the abyssal Queen Mother.<br/><br/>It covered all the subordinates of the Abyssal Mother Empress and countless abyssal monsters.<br/><br/>What kind of hand was this?<br/><br/>Boundless and endless.<br/><br/>The gray hand slowly covered the abyssal Mother Empress and the others.<br/><br/>“Wuwuwu!”<br/><br/>In the next moment, they saw the Abyssal Queen Mother bellowing in horror and sending out messages in horror.<br/><br/>They saw countless abyssal monsters trembling and lying in the chaos in despair.<br/><br/>At this moment, they saw a figure appear in their line of sight.<br/><br/>He stood proudly in front of the abyssal Queen Mother army and casually extended his palm.<br/><br/>He suppressed the entire abyssal Queen Mother army with one hand.<br/><br/>That figure turned around and glanced at them indifferently.<br/><br/>This made all the disciples of the experts in the entire region feel as if their souls were being sucked in.<br/><br/>What kind of gaze was that? What pupils?<br/><br/>It was as if he could see through everything in the chaos of the universe.<br/><br/>It was as if he could see through all their secrets.<br/><br/>One glance for a trillion years, one glance for a lifetime!<br/><br/>Under the incredulous gazes of all the powerhouses, the entire abyssal Queen Mother army was held in the hand that reached through the sky. It was slowly shrinking.<br/><br/>Finally, it landed in front of the divine, great, and unbelievable figure.<br/><br/>He suppressed the abyss with one hand!\t\t\t\t\t\t</div>", "images": {}, "success": true}