{"id": 1603, "url": "https://www.novelhall.com/invincible-divine-dragons-cultivation-system-34303/15244079.html", "title": "Chapter 4606 - Chapter 4606: He, The Myth Of Chaos (2)", "volume": 17, "volume_title": "Volume 17", "body": "<h1>Chapter 4606 - Chapter 4606: He, The Myth Of Chaos (2)</h1><div class=\"entry-content\" id=\"htmlContent\">\n\t\t\t\t\t\t\tChapter 4606: He, the Myth of Chaos (2)<br/><br/>Chaos was extremely magical. The Elemental God absorbed the Elemental Gods of the same kind and reached the level of the Master of Calamity.<br/><br/>It could affect an area of space, and the area it affected was comparable to half the universe. It was extremely terrifying.<br/><br/>It gave birth to wisdom.<br/><br/>After Wang Xian helped her increase her intelligence, he also gave her the method to control her strength.<br/><br/>This caused Mumu to be completely born, turning into the appearance of a little girl.<br/><br/>No one would have thought that this was a terrifying Elemental God.<br/><br/>Wang Xian brought her along and continued flying towards the chaos ahead.<br/><br/>Gradually, Mu Mu’s control over her own energy became more and more proficient. She was no different from an ordinary expert.<br/><br/>As an Elemental God, he could also absorb energy of the same attribute and advance.<br/><br/>It could even easily devour other wood-type Elemental Gods.<br/><br/>Wang Xian brought her through the chaos. Not long after, they encountered a Chaos Beast.<br/><br/>An extremely powerful Chaos beast.<br/><br/>The entire Chaos Behemoth emitted the power of a Calamity Master, like a giant whale in the ocean.<br/><br/>This was the strongest existence Wang Xian had ever seen in the Chaos.<br/><br/>He was even stronger than all the previous Calamity Masters he had seen!<br/><br/>When Wang Xian and the rest saw the Chaos Behemoth, it was in a universe.<br/><br/>Its size was comparable to tens of thousands of planets. It was the largest creature Wang Xian had ever seen.<br/><br/>It was extremely terrifying. It shuttled through the universe and had an immeasurable mouth.<br/><br/>Everything in front of it was being devoured.<br/><br/>Yes, it devoured everything, be it living beings, the universe, or even death.<br/><br/>Everything it saw was devoured by it.<br/><br/>Behind it was a place for excrement. This place would expel everything that it could not digest.<br/><br/>A life planet was extremely small in front of it.<br/><br/>In fact, hundreds or thousands of planets would be devoured in the blink of an eye.<br/><br/>Its speed was extremely fast. With a sway, it could fly very far.<br/><br/>Wherever it passed, all living beings died!<br/><br/>Wang Xian arrived with Mu Mu. When he saw the terrifying Chaos Behemoth, his face was filled with shock.<br/><br/>“Why does it devour everything? Devouring all living beings?”<br/><br/>Mu Mu stood beside Wang Xian and could not help but ask.<br/><br/>” Because of its instinct, because it wants to become stronger. This Chaos Behemoth has also gained intelligence, and its intelligence is very high. However, in its eyes, everything in the world is just food.”<br/><br/>Wang Xian’s eyes sparkled as he looked at the terrifying beast ahead.<br/><br/>This Chaos Behemoth was indeed extremely terrifying to a universe and a region!<br/><br/>He looked ahead. There were more than 2,000 experts in the distance.<br/><br/>More than 2,000 Sky Origin Creation Realm experts.<br/><br/>The leader was an existence at the level of a Calamity Master.<br/><br/>They had set up an inescapable net in front of them, waiting for the Chaos Behemoth to step into it!<br/><br/>” All great beings, get ready. The Universe Devourer is coming. He’s about to arrive. We have to destroy him. Otherwise, our region will be finished. We’ll be devoured by him!”<br/><br/>Among the 2,000 experts, the leader, Calamity Master, gritted his teeth and stared ahead.<br/><br/>Universe Devourer. This was the name given to the Chaos Behemoth in their region.<br/><br/>It could devour the universe and everything in the universe!<br/><br/>They did not know where this giant beast came from.<br/><br/>The giant beast had appeared in their region more than 10 million years ago. In a short period of more than 10 million years, it had devoured more than 80 universes here.<br/><br/>All the living beings in every universe were devoured. Wherever the giant beast passed, everything became ruins.<br/><br/>There was no sign of life.<br/><br/>This caused the experts in the entire area to be terrified.<br/><br/>In the beginning, there were Sky Origin Fate Realm experts who joined forces, but they were easily devoured and killed.<br/><br/>Even if hundreds of Sky Origin Fate Realm experts joined forces, they would not be able to do anything.<br/><br/>In fact, it could not even break through its defense.<br/><br/>Later, the invincible experts of this area personally attacked, but they still could not do anything to this Chaos Behemoth.<br/><br/>This caused all the universe great beings in the entire region to be shocked and seethe.<br/><br/>One had to know that the Master of Calamity was an invincible existence in their eyes!<br/><br/>As the giant beast ran amok, all the experts in the entire region decided to join forces and set up an ambush here.<br/><br/>“Here it comes, attack!”<br/><br/>The Chaos Behemoth moved very fast. More than 2,000 Heaven Origin Creation Realm experts and one Calamity Realm expert roared when they saw the Chaos Behemoth.<br/><br/>Boom! Boom!<br/><br/>Boom! Boom!<br/><br/>In an instant, a huge formation flew out, and Sky Origin Creation Realm experts stood on one side of the formation.<br/><br/>Boundless energy surged into the array!<br/><br/>The figure of the Master of Calamity stood in the center of the array. Endless energy gathered and terrifying arrows condensed, attacking the Chaos Behemoth in front of him.<br/><br/>Endless arrows and energy pierced through space.<br/><br/>The Chaos Behemoth had no pupils, but it could instantly sense the terrifying attack!<br/><br/>It had fused with the attacks of more than 2,000 Sky Origin Creation Realm experts.<br/><br/>His entire body shook slightly, and a phantom flew out from his body. It opened its abyss-like mouth and swallowed the attack in front of it.<br/><br/>Boom! Boom!<br/><br/>Violent collisions sounded out as countless arrows landed on the huge phantom, slowly destroying it.<br/><br/>“Roar!”<br/><br/>However, it only defeated the phantom. The terrifying Chaos Beast seemed to have been angered and attacked directly ahead.<br/><br/>“Continue attacking!”<br/><br/>When the leading Tribulation Master saw this scene, his eyes were about to pop out as he roared!<br/><br/>More than 2,000 Heaven Origin Creation Realm experts stood on the formation map. A huge spear condensed. The spear seemed to be able to penetrate the entire universe and pierce towards the Chaos Beast.<br/><br/>“Buzz, buzz, buzz!”<br/><br/>However, the next moment, the surrounding space began to collapse, and everything around them began to turn black.<br/><br/>The Chaos Behemoth’s extremely huge body suddenly disappeared!<br/><br/>” Not good! This Chaos Behemoth has a terrifying innate skill!”<br/><br/>A bad premonition enveloped the hearts of all the experts. The expression of the leading Calamity Master changed drastically as he roared!<br/><br/>“Hiss, look around, we…We’ve already entered the body of the Universe Devourer. Oh no!”<br/><br/>At this moment, a Primal Chaos existence discovered in horror that they had been devoured.<br/><br/>It had already entered the Chaos Behemoth’s body!<br/><br/>They felt a destructive energy attacking them.<br/><br/>“Not good, charge out and break its body.”<br/><br/>Calamity Master, who was in the center of the array, roared with a trace of fear!\t\t\t\t\t\t</div>", "images": {}, "success": true}